{"authors": ["Seth Ackerman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis", "Mímir Kristjánsson"], "date_download": "2020-05-04 19:52:44", "date_modify": "2020-05-04 19:52:44", "date_publish": "2011-12-09 00:00:00", "description": null, "filename": "2011_12__1588621964.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2011/12/09180016/workers_strike.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2011_12__1588621964.html", "title": "The Strike and Its Enemies", "title_page": "The Strike and Its Enemies", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn a noted 2008 essay, Mark Fisher reflected on the pervasive sense of capitalism’s permanence, a feeling he termed “capitalist realism.” But despite its gloomy tone, the piece ended on a note of hope: The very oppressive pervasiveness of capitalist realism means that even glimmers of alternative political and economic possibilities can have a disproportionately great effect. The tiniest event can tear a hole in the grey curtain of reaction which has marked the horizons of possibility under capitalist realism. From a situation in which nothing can happen, suddenly anything is possible again. For Occupy Wall Street, the hole in the curtain was definitively torn open on October 14. In the dead of night, when word went out that Michael Bloomberg was sending the police to Zuccotti Park to force an end to the month-long occupation, an emergency call for help went out from OWS. In response, New York City’s Central Labor Council urged its 1.3 million members to rush to the square to protect the encampment from the cops, and by early morning roughly a thousand people, including hundreds of trade unionists from the Communications Workers, SEIU, and the Teamsters, had gathered and linked arms in defense. On nearby Liberty Street, a cop was overheard asking a colleague: “How are they going to arrest all these people?” The same question was dawning on City Hall. As the crowds gathered, according to the New York Times ’ reconstruction of what followed, the Bloomberg machine was besieged by “an intensifying sense of alarm.” “This is not going in a good direction,” a state senator warned the mayor’s aides over the phone. Calls poured in through the night from officials who feared “that sending scores of police officers into the park would set off an ugly, public showdown that might damage the reputation of the city as well as its mayor.” In the end, of course, Bloomberg blinked and that morning’s raid was called off — giving the occupiers and their defenders not only a crucial month-long reprieve, but the unfamiliar and exhilarating feeling that they could defeat New York City’s massed forces of guns and money. What happened that morning was important: the occupiers had defied the laws of private property — and through the power of numbers and solidarity they had gotten away with it. A lot of the younger contingent in Occupy Wall Street had never had many dealings with the unions that had rendered this act of solidarity. And despite the promising, if halting, attempts at cooperation, many of them — especially those who consider themselves to be on the movement’s radical edge — are openly dismissive of unions. And why shouldn’t they be? Not only has the organized section of the working class shrunk relentlessly to just 12 percent, but by all appearances its organizations long ago turned into the kind of hopelessly desiccated simulacra of resistance that young radicals and proto-radicals avoid like the plague. In the public mind, union “activism” in recent years has been associated with images of defeat: hundreds of identically t-shirted workers bused in to forlorn protests on the National Mall; stultifying rallies featuring scripted speeches delivered in front of slogan-printed backdrops; and the occasional kabuki “strike” that seems more like a sullen and oddly masochistic PR stunt than an instance of direct action. But while it is easy to see the external qualities that make the labor movement appear to be just another feature in the landscape of capitalist realism in the eyes of the young advocates of militant direct action, few really understand how this situation came about. How did a movement, a practice, that once could inspire radicals with street battles and occupations, bravura feats of solidarity and heroism — that once tore holes in the curtain of capitalist hegemony almost as a matter of course — morph into the slick and routine management of decline personified by Andy Stern? There are shelves of books on labor history that recount important aspects of this story, from state repression to working-class racism to party politics. But Reviving the Strike: How Working People Can Regain Power and Transform America, published in 2011 by Joe Burns, a union negotiator in Minneapolis, demystifies what is probably the most tangible element in modern labor’s aura of lifelessness: the virtual disappearance of the strike. And in telling the story of the strike’s disappearance, Burns inadvertently reveals that young radicals who scorn unions and the aging bureaucrats who run them have more in common than one might think.\nAn Absolute Interference At the center of Burns’s story is what he calls “the traditional strike,” which was the heart of trade union activity from the beginnings of labor history until its virtual disappearance after the 1970s. The crucial characteristic of the traditional strike — its sole reason for being — is that it forces capital to stop production. Although this fact may seem slightly obvious, its significance for both workers and radicals has been largely forgotten. In the earliest days, when the labor movement was dominated by skilled craft workers who could not be easily replaced, a strike could simply consist of workers putting down their tools until their employers had met their demands. But with the advent of mass production, the majority of workers were now unskilled or semi-skilled and simply walking out on their jobs would only get them fired and replaced with scabs. Therefore, the strike became a military confrontation in which workers had to physically prevent the restarting of production using scab labor. Hence the images of confrontation that run through American labor history: the Homestead strike, where thousands of workers lined the riverbeds to defend the town against invading Pinkertons. The urban streetcar strikes of the early twentieth century, featuring “a new form of guerrilla warfare, with hand-to-hand combat, night raids, cavalry charges, fighting from rooftops and behind barricades, and retreats in which the wounded were evacuated under heavy cover.” Or the 1934 Toledo Auto-Light strike, where picketers “broke into the plant and battled hand-to-hand to force the company, which had hired 1500 scabs, to stop production.” The traditional strike was an open and unabashed physical attack on the private property rights of the capitalist, and this fact was never denied by the mainstream leaders of the trade union movement. Perhaps the most convincing feature of Burns’s account is that despite the author’s personal identification with the radical strand of the union tradition, he goes out of his way to draw on examples from the most conservative figures in labor history: the Samuel Gompers, the Dave Becks, the George Meanys. These leaders not only accepted but took for granted that the labor movement must use or credibly threaten to use force to shut down capitalist production and that without this tool, nothing could be achieved by the trade union movement. “A strike can only be effective if and when it brings about a cessation of production. It is an absolute interference on the part of workers with the right of employers to make profit.” So said Homer Martin, the conservative former Baptist minister handpicked by the Gompersite AFL leadership to serve briefly as the first United Auto Workers (UAW) president (before being overthrown by a more militant faction). Radical tactics could only exist with a radical theory to support them. The act of blockading a private building in defiance of the police, the resort to forceful measures against scabs, are acts so deeply at odds with the law-abiding instincts of most people — working class, middle class, or otherwise — that they will not do them without a clear account in their own minds of why such behavior is justified. That is why in the era of the traditional strike the labor movement was obliged to hold and propagate a counter-capitalist ideology based around the simple slogan that “labor is not a commodity” — the notion that it is illegitimate to treat human labor as something to be bought and sold for a market-clearing price, and that striking workers are therefore justified in using all necessary means to disrupt its sale. From the nineteenth century until well into the 1950s, this rallying cry was so ubiquitous in the world of mainstream, non-socialist unions as to be a platitude. A simple Google Books search shows the phrase littering the pages of union journals from the Gilded Age onward. Walter Reuther was hardly a fiery radical, but when confronted with proto-neoliberal arguments about the sanctity of the free labor market, as he was on one occasion in 1953 while testifying before Congress, his ready-made reply was crisp: “Labor is not a commodity which you go and shop for in the free market place.” Unions not only believed stopping production was their sole effective means of striking; they considered it to be, ultimately, their only source of power. Again, this notion was a truism, enshrined in college labor textbooks. A 1956 industrial relations text baldly stated of “the strike, the boycott, and the picket line” that “there can be no collective bargaining, if, from the union’s standpoint it cannot utilize these means.” As late as 1980, a labor economics text explained simply: “The union’s ability to strike, and thus halt the employer’s production, is essential to the collective bargaining process. . . . [I]t is the potential of a disruption in production that induces employers to strive to effectuate agreement with the union.” All this should give some sense of why the near disappearance of the production-halting strike since the 1980s is a phenomenon of such far-reaching importance.\nCriminalizing the Strike A large section of Burns’s book is devoted to meticulously tracing the path that led to today’s situation. Companies entered the post-WWII period sufficiently scarred by the militancy of the 1930s and sufficiently cowed by popular acceptance of working-class direct action that an “unspoken norm” developed, according to which management responded to any breakdown in collective bargaining by shutting down production on its own. This prevented the outbreaks of violence and embitterment associated with strikes and provided a calm atmosphere in which negotiations could take place. But meanwhile, during this period of relative harmony, the judicial and political systems were quietly and insidiously entrapping the unions in a little-understood web of repressive measures that collectively make up what Burns calls “the system of labor control.” The system, which developed gradually from the late 1930s through the 1960s, functions as an organic whole. No one piece destroyed the strike on its own; rather, each element carefully reinforces all the others. One of the system’s remarkable aspects is how juridically unorthodox it often is: as law scholars regularly point out, many court decisions clearly contradict the stated text of the National Labor Relations Act. Meanwhile, labor legislation often resorts to startlingly coercive state intervention to achieve its capitalist ends. The system is too elaborate to explain here in full, but a few details will give a flavor of how it operates. The most familiar element, the 1947 Taft-Hartley Act, explicitly made solidarity a crime by outlawing the secondary strike — the crucial technique of striking or picketing in support of workers at another firm. In one blow, the production-halting potential of strikes was drastically curtailed. Tellingly, under current law, peacefully standing outside a toy store handing out fliers urging a boycott is considered protected speech if done by a college anti-sweatshop activist; but it is an illegal act subject to fines and arrest if done by a union worker employed in a striking shop. The traditional capitalist insistence on freedom of contract was swept aside in the 1959 Landrum-Griffin Act, which declared null and void voluntary agreements between an employer and a union exempting the workers from handling “hot cargo” — that is, products made in struck shops. Over the years, a series of court decisions have ruled on the “intermittent strike.” This is a particularly effective technique in which workers strike for only an hour or two without physically leaving their jobs, making orderly management practically impossible while leaving workers largely invulnerable to replacement by scab labor. The intermittent strike has been ruled to be an unprotected strike act and therefore punishable by firing. But the finding so clearly runs counter to the literal text of the National Labor Relations Act that judges have been all but forced to admit that their real objection to the technique is its effectiveness. As one federal appeals court wrote, an intermittent strike “unreasonably interfere[s] with the employer without placing any commensurate economic burden on the employees.” These measures placed serious obstacles in the way of successful strikes. But the real ticking time bomb of labor law was the Supreme Court’s 1938 decision in NLRB v. Mackay Radio giving employers the right to permanently replace striking workers. One of the most criticized decisions in legal history, the “Mackay doctrine” discovered a previously unknown distinction between “discharging” striking workers — which the court acknowledged was not permitted by the NLRA — and merely “replacing” them permanently with scabs. As a result of this decision, the United States remains one of the few democratic countries in the world where strikers can be permanently replaced. Once capitalists regained the initiative in the 1970s and 1980s, permanent replacement was the critical weapon that allowed them to go on the offensive. The postwar gentleman’s agreement that companies would shut down their own production rather than risk a confrontational strike came to an abrupt end. Now management actively sought to provoke strikes, with the intention of keeping production running and permanently replacing the workers, thereby getting rid of a union once and for all. Almost overnight, striking became a suicide mission for workers. The strike rate collapsed. There are still strikes, of course, now and then. But they tend to be strikes of a new kind. Recent years have witnessed the growth of the “one-day strike,” for example, in which the union announces that it will strike for a day and then come back to work. The aim of the one-day strike is simply to generate publicity; it has no real value in stopping production. It would no doubt mystify Samuel Gompers if he were here to see it, to say nothing of Bill Haywood.", "url": "https://www.jacobinmag.com/2011/12/strike-occupy-verizon-joe-burns-labor-unions/"}