{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:21:36", "date_modify": "2020-05-04 16:21:36", "date_publish": "2012-12-27 23:45:18", "description": "View CNN's Fast Facts on Jack Welch and learn more about the life of the former CEO of General Electric.", "filename": "2012_12_27_us_jack-welch---fast-facts_index_1588609296.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/141017005312-jack-welch-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2012_12_27_us_jack-welch---fast-facts_index_1588609296.html", "title": "Jack Welch Fast Facts", "title_page": "Jack Welch Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here is a look at the life of Jack Welch, former CEO of General Electric.\nPersonal\nBirth date: November 19, 1935\nDeath date: March 1, 2020\nBirth place: Peabody, Massachusetts\nBirth name: John Francis Welch Jr.\nFather: John Francis Welch Sr., a train conductor\nMother: Grace (Andrews) Welch\nMarriages: Suzy Wetlaufer, journalist (April 24, 2004-March 1, 2020, his death); Jane Beasley, corporate lawyer (1989-2002, divorced); Carolyn Osburn (1959-1987, divorced)\nChildren: with Carolyn Osburn: Katherine, John, Anne and Mark\nEducation: University of Massachusetts, 1957, B.S. Chemical Engineering; University of Illinois, 1960, M.S., Ph.D. Chemical Engineering\nOther Facts\nHe was the head of Jack Welch, LLC, established in 2007.\nMedia had given him the nickname \"Neutron Jack\" for his no-nonsense approach to business.\nWrote a weekly column in Business Week with his wife Suzy called \"The Welch Way.\"\nTimeline\n1960 - Begins career at GE in the Chemical Development Organization as a chemical engineer.\n1972 - He is appointed general manager of the worldwide plastics division and becomes a vice president.\n1979 - Vice chairman and executive officer.\n1981 - He is appointed chairman and CEO, the youngest CEO that General Electric Corporation (GE) has ever had.\n1999 - Fortune magazine names Welch \"Manager of the Century.\"\nSeptember 2001 - Steps down as GE chairman and CEO and is replaced by Jeffrey Immelt.\nJuly 3, 2003 - Announcement is made that his ex-wife Jane Beasley Welch will receive an undisclosed lump sum divorce settlement.\nApril 13, 2007 - Makes a failed attempt, with other investors, to buy the Boston Globe from New York Times Co.\nJune 21, 2009 - Pays more than $2 million for 12% stake in Chancellor University System LLC which delivers online education. The MBA program will become the Jack Welch Management Institute.\nJuly 5, 2009 - Is hospitalized and later released after suffering a bacterial infection.\nNovember 2011 - Sells the Sells the Jack Welch Management Institute to Strayer University for $7 million. The sale is a 70-30 split with Chancellor University; Welch gets the 70%.\nOctober 9, 2012 - Welch and wife Suzy Welch and wife Suzy resign as Fortune magazine and Reuters contributors after his controversial tweet regarding the Obama administration and September unemployment data was criticized by Fortune.\nApril 4, 2015 - Harper Collins publishes \"The Real-Life MBA,\" the new book written by Welch and his wife Suzy.\nMarch 1, 2020 - Passes away at the age of 84.", "url": "https://www.cnn.com/2012/12/27/us/jack-welch---fast-facts/index.html"}