{"authors": ["Matt Karp", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:47", "date_modify": "2020-05-04 19:52:47", "date_publish": "2012-10-16 00:00:00", "description": null, "filename": "2013_04__1588621967.html", "image_url": "https://images.jacobinmag.com/2012/10/16232858/8044067049_0565a56869-2.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_04__1588621967.html", "title": "Dead White Reds", "title_page": "Dead White Reds", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The central experience of the twenty-first century, of course, cannot yet be reckoned. But whatever it is, we can be grateful that all our dreams and arguments about a just, egalitarian future will not be defined — or distracted, or divided, or destroyed — by the fate of a particular Russian dictatorship.\nThese memoirs remain valuable today — both as vivid portraits of a previous century’s problems, and as bracing reminders to the contemporary left that those problems are not our own. “The central experience of the twentieth century,” as Howe once quoted Theodore Draper, “was communism,” and this was as true for the left-wingers who resisted it as it was for those who succumbed to its chilly embrace.\nA longer glance back into the past should cure us of this sentimentalism. The British historian Eric Hobsbawm and the American critic Irving Howe, both eminent socialist members of Ralph Miliband’s dead generation, can help. Hobsbawm, born in the red year of 1917, remained a defiant communist all his life. Howe, arriving three years later, devoted his own career to defending the socialist idea against Stalin’s Soviet Union. But taken together, their memoirs — Howe’s A Margin of Hope , published in 1982, and Hobsbawm’s Interesting Times , in 2002 — form as poignant a record as exists of the courageous hopes and constant sorrows of the twentieth century Anglo-American left.\nAt least the dead generations took Marx seriously. At least they had a powerful labor movement and center-left parties that believed in the welfare state. And at least Ralph Miliband, the dead leftist whose son is the living leader of Britain’s Labour Party, would never have answered a question about capitalism with a grudging obeisance to the creative power of BlackBerry .\nThe tradition of all the dead generations,” Marx wrote 150 years ago, “weighs like a nightmare on the brain of the living.” Today, with our politics trapped in capitalism’s endless fugue state, the nightmare that troubled Marx may seem to contemporary left-wingers like a pleasant dream of days gone by.\nThe purest pleasure of autobiography lies in anecdote, and both Hobsbawm and Howe deliver this with ease: their joint encounters with celebrities, left-wing and otherwise, could fill a respectable gossip anthology. Many of these slip past, almost unremarked, as tantalizing scraps of the absurd tapestry of twentieth century intellectual life — Hobsbawm taking E. M. Forster to a Lenny Bruce show, or racing after Louis Althusser on a shopping spree in London, where the author of Pour Marx ordered a grand piano and passionately insisted on visiting a Rolls-Royce dealer in Mayfair; Howe sharing a chuckle at Richard Hofstadter’s clowning antics during a game of ping-pong, or recalling when the high-modernist art critic Harold Rosenberg invented Smokey the Bear for the Advertising Council.\nThese are not, of course, the fables of heroism and despair that dot the pages of activist memoir. Hobsbawm and Howe were contemplative academics, no more inclined to pay homage to Catalonia with Orwell than follow Dave Dellinger From Yale to Jail . Hobsbawm actually did cross into the Spanish frontier in 1936, where he encountered republican army trucks in a town square: “Whenever someone felt like going to war, he went to the trucks, and whenever one filled up with enough volunteers, I was told, it went off to the front.” (“C’est magnifique, mais ce n’est pas la guerre,” he notes — and he was no guerrilla either, quickly huffing it back to France after a gunpoint encounter with an anarchist border guard.) Howe, meanwhile, managed to spend a good chunk of World War II at a remote barracks in Alaska, doing his part in the war against fascism by completing Army health services paperwork and reading deep into Gibbon and Matthew Arnold.\nIn a century of sharp turns, both Hobsbawm and Howe remained steady men of the Left throughout their lives. They evolved, of course, but yielded to none of the frantic reversals or bizarre reincarnations so common amid the American twentieth century. Neither felt much kinship with the Vietnam War-era New Left.\nHowe largely shared the younger generation’s critique of US foreign policy, but detested its embrace of the Vietcong, and clashed with its theatrical style of protest, what he saw as a shallow “radicalism of gesture.” By 1969, in response to the taunts of one student protestor at Stanford, Howe found himself crying out, “You know what you’re going to end up as? . . . You’re going to end up as a dentist!” On the other side of the ideological curtain, Hobsbawm happily joined the protestors chanting “Ho-Ho-Ho-Chi Minh,” but was no less dumbfounded by sex, drugs, and the Rolling Stones, and confesses an even more elemental chasm separating him from the younger radicals: “What I have written about the 1960s is what an autobiographer can write who never wore jeans.”\nWhat united the political lives of both men, above all, was the dominating presence of the Soviet Union. As a Berlin teenager in 1932–33, Hobsbawm forged his emotional allegiance to the Russian revolution in the last, desperate hours of communist resistance to Hitler’s Germany. He brought it with him to his student years at Maynard Keynes’s Cambridge, Popular Front activism in pre-war Paris, and postwar academic life in London, where that radical energy melted into the weekly routines of the Communist Party of Great Britain (“Stalinism, that dismal orthodoxy of the once rebellious,” quipped Howe).\nVisiting the USSR with a group of state-approved British historians in 1955, Hobsbawm conceded that his chief impressions — grim-faced widows still clearing war debris from the street; a confused and sweaty ballerina, produced by Soviet officials only moments after her performance to impress the foreign dignitaries; the embalmed corpse of Stalin, who was only 5’3″ — “were not a good advertisement for communism.” But his belief in the necessity of the Soviet Union, the bulwark of revolution and the world’s only counterpoint to capitalist imperialism, was unshaken.\nThe shaking came in the very next year, when Khrushchev’s revelations about Stalin’s crimes threw the western communist world into a crisis. Nearly fifty years later, the trauma of this disillusionment is still fresh: “my throat contracts,” Hobsbawm writes, as he recalls the “intolerable tensions” that racked British communists in 1956. Yet in the end he stayed with the Party, and the Party stayed with him, all the way until its demise in 1991.\nWhy didn’t he quit? Hobsbawm runs through some possible explanations: his old Berliner distrust of bourgeois democracy; his disdain for anti-communism; and his personal pride in rising to the top of British academia — all the while bearing the mark of anti-establishment discontent, now made glorious by communism’s public disgrace. (“I said to myself, fuck them. If I left the Communist Party, it would be good for my career. Fuck them.”)\nThe last of these explanations rings truest, since it is clear from that after 1956 Hobsbawm largely abandoned political life. For this, we should probably be thankful, as it allowed him to produce a half-century’s worth of brilliant scholarship. Still, a soft but deep current of sadness — ideological, world-historical sadness — runs through Hobsbawm’s memoir. The Soviet Union, after all, converted thousands of passionate socialists into morose quietists over the course of the twentieth century, and not many of them could claim the consolation of writing The Age of Extremes . The transformation of Hobsbawm’s revolutionary vision of the future into a symbolic badge that inhibited rather than enhanced actual political struggle — this, too, must be counted among the casualties of the Soviet tragedy.\nHowe, meanwhile, never felt any sympathy toward the “really existing” Soviet regime, and yet his own long political career bore all the melancholy marks of a socialist life equally circumscribed by communism. A youthful Trotskyist orator at City College — Daniel Bell remembers him adopting the Bolshevik moniker “Hugh Ivan” — Howe spent most of the pre-war years waging a fruitless cafeteria campaign against the much larger Stalinist student cadre. In the Fifties, as the founder and editor of Dissent , Howe resisted the great migration of old leftists to newly secure and remunerative positions on the right and center, but nevertheless found his own radical energies increasingly redirected into what he later called “the dry gratifications of anti-communism.”\nBy the Sixties, whatever remained of Howe’s dehydrated idealism left him unable to communicate with a rising generation of radicals. The story of his clash with the future dentist of Palo Alto contains, at least, an ironic grandeur; but there is nothing remotely grand about the famous failed meeting between Dissent ’s editors and the SDS leadership, which Howe admits he purposefully broke up with a windy harangue about the sins of communism.\nIn truth Howe never quite transcended the Cold War paradigm that made any argument about socialism, effectively, an argument about the Soviet Union. “A whole generation,” he later wrote, “was haunted and destroyed by the terrifying rise of Stalinism,” and he, no less than Hobsbawm, suffered from its ravages. The sorrowful spirit of A Margin of Hope is even more tangible than the intermittent melancholia of Interesting Times. The slow desiccation of Howe’s radical idealism — death by a thousand doubts — is another testament to the painful toll that the Soviet experience extracted from the once-optimistic vanguard of the western left.\nThirty years after Howe’s autobiography, and ten years after Hobsbawm’s, the prospects for a revival of that optimism may seem dim enough. For all their decades of woe, neither of these socialist seers really imagined the startling rise or durability of neoliberalism. (It’s telling that Perry Anderson, with characteristically magnificent gloom, faults Hobsbawm’s twentieth century history for being insufficiently defeatist.) And yet a return to these memoirs offers a healthy antidote against the natural instinct of a beleaguered left to look back in time with rueful nostalgia, to an era when some form of socialism, at least, seemed to be on the global agenda.\nThings weren’t better then — they were only bloodier and more confused. We are by now familiar with the manifold crimes committed under the name of socialism; but as these books make clear, the disaster of authoritarian communism cannot be reckoned in statistics alone.\nThe cancers of faction, the agonies of disillusionment, the paralysis of doubt, and, worst yet, a large measure of responsibility for our current reactionary age: all these must be laid at the door of the “really existing”socialist regimes of the twentieth century. There may be no sound intellectual reason, as Hobsbawm justly insists, to damn in a single breath all the diverse offspring of Marxism — from the kibbutzim to Kim Il Sung — any more than there is reason to dismiss at once all Christianity, from the Quakers to the Russian Orthodoxy. But as he well knows, History seldom operates according to sound intellectual reason. One reason Late Capitalism keeps on getting later, without getting much less capitalistic, is that the alternatives have been so viciously besmirched.\nThe weight of the dead generations, draped with iron and congealed in cold war, grew heavier than ever in the second half of the twentieth century. But is it trivial to add that the twentieth century is now over? In A Margin of Hope , Howe briefly indulges a half-ironic longing for the generation of leftists before his own time: “A great bedevilment of our age has been that we can no longer suppose there is but one enemy of progress. I can hardly be the only person who has felt a wry nostalgia . . . for those good old days when socialists and liberals directed their fire solely upon capitalism, Big Business, the trusts, and so forth. Everything must have seemed so nicely simple, unshaded by ambiguity . . .”\nHis irony still stings; but now, at least, we are no longer bedeviled by multiple enemies of progress. Neoliberalism, in the very totality of its triumph, has cleared the ideological battlefield: all that is left to fire upon is capitalism.\nToo many of today’s liberals, sadly, substitute technocratic pellets for moral artillery; they prefer partisan snark and isolated outrage to class struggle or economic justice. Worst of all, reading Slate instead of Blake, they forget that what is now proved was once only imagined, and they give up on imagination entirely. (Even Lionel Trilling would be disheartened by their puniness.) Part of this failure reflects the last lingering shadows of the communist nightmare — the way the ugly ruin of the USSR and its satellites loomed over not only the socialist present, but even the idea of a socialist future. Those shadows are beginning to retreat.\nThe youthful leaders of the newest left are the first generation to grow up in a world unshaded by the Soviet experience, and perhaps just as important, unshaded by furious argument about the Soviet experience. In this vital respect, at least, the era they and we inherit resembles Howe’s good old days before 1917 far more than any period since. The hard work of imagining a post-Soviet socialist future has already begun; we have reason to hope that the harder work of proving it awaits us.", "url": "https://www.jacobinmag.com/2013/04/dead-white-reds/"}