{"authors": ["Mike Beggs", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:16", "date_modify": "2020-05-04 19:57:16", "date_publish": "2012-10-16 00:00:00", "description": null, "filename": "2012_10_eric-hobsbawm-and-the-next-left_1588622236.html", "image_url": "https://images.jacobinmag.com/2012/10/16232910/4917450173_bde0954327_z-2.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2012_10_eric-hobsbawm-and-the-next-left_1588622236.html", "title": "Eric Hobsbawm and the Next Left", "title_page": "Eric Hobsbawm and the Next Left", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Does Marxism have a political future? Hobsbawm is clearly not optimistic. But at the same time, he gives the impression that hard as it may be to imagine the transcendence of capitalism in the short term, it is difficult for him to conceive that socialism is not on the cards in the long run. He still thinks Marx was basically right about the logic of capitalism — to ever greater centralization, or socialization even, of the organization of production, combined with episodic breakdowns. He now thinks Marx was wrong to see the proletariat as the gravedigger, leaving that position vacant.\nThose of us who have come so very late to the party, so to speak, inevitably have a different perspective. We discovered Marx long after the flaws of Marxism and “really-existing socialism” had become obvious, in a period of protracted recession in the labor movement. And yet, we still found something of value. Many, probably most, of us learned much of our Marx at university, deeply impressed by that intellectual flowering of the 1970s which Hobsbawm sees as the high-water mark. The course of his life has followed an epic rise and fall which naturally shapes his conclusions. For us, there is a lot more future to come. Hobsbawm is right that Marxism is academic without a labor movement whose margins can be haunted. But it is hard to believe that the labor movement is dead, even in the rich countries of the West. Surprisingly, “working class” is nearly always prefaced with “industrial” in this book, and it is indeed unlikely that the labor movements of the future will be dominated by manufacturing workers. But in the broad sense, in Marx’s sense, the proletariat includes anyone who has to work for a living. They are still around, and more than a few of them even go to university.\nReform will need to revive before there are many people to talk to about revolution. But the point that Hobsbawm sees as the core of a Marxian approach to politics will be as relevant as ever: that political strategy takes place within a framework of social forces that voluntaristic moral force cannot overcome. This is a point that can be read in different ways, and in the past Hobsbawm has read it the wrong way, as one of the right-wing communists of the 1980s who tried to save UK Labour from the unelectable Tony Benn — as if Labour needed Marxists to look after its electoral interests.\nBut it can also be read the right way. The unrealistic utopians of our day are busy developing non-partisan position papers proposing rational reforms of financial regulation and making reasonable cases for a reduction in inequality, because it is harmful to the social fabric and to health and safety. But there is no genuine way forward that does not polarize class interests and galvanize a movement, and if there is a lesson to be taken from the politics of the last few decades it is that there will be no sustainable gains that do not fundamentally undermine wealth and its power.", "url": "https://www.jacobinmag.com/2012/10/eric-hobsbawm-and-the-next-left"}