{"authors": ["Freddie Deboer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:55:14", "date_modify": "2020-05-04 19:55:14", "date_publish": "2012-11-16 00:00:00", "description": null, "filename": "2013_09_good-wars-real-or-imagined_1588622114.html", "image_url": "https://images.jacobinmag.com/2012/11/16233006/APTOPIX-Mideast-Syria_Horo-635x357-2.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_09_good-wars-real-or-imagined_1588622114.html", "title": "Good Wars, Real or Imagined", "title_page": "Good Wars, Real or Imagined", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The Syrian question has come to an important stage, the reemergence of the liberal hawks. We’ve reached the point in the cycle of American military adventurism — a rhythm as predictable and unchanging as the progression of the seasons — where some progressives and liberals dip their toes into support for the latest war. I don’t mean to overgeneralize; almost every prominent military conflict at least provokes inter-liberal debate, and some of the most effective critiques of bombing Syria have come from liberals. (Scott Lemieux of Lawyers Guns and Money, for example, or Amy Davidson at The New Yorker, or Juan Cole of the University of Michigan.) What’s inevitable, however, is a very public debate among prominent liberals on the question of the next righteous conflict in the American adventure. These debates have the character of ritual; they appear, often, as arguments that exists not to be settled but to be seen.\nFor those who are dedicated to the appearance of “seriousness” in the way typically meant in our national newsmedia, the goal frequently seems not to be reaching a correct or moral position but to be seen agonizing in reaching any position at all. This is the fetish for being perceived as reasonable taken to its logical ends, in the shadow of war.\nThere are consequences. Conservatism is intellectually and socially dominated by militarism. The Republican party is owned, in a quite literal sense, by the defense industry and national security state. The occasional “paleocon” aside, any hope for an American antiwar constituency must come from the Left. The combination of a right wing that is committed to self-destructive military projection and a center-left that is committed to not being committed to anything in particular has unhappy consequences for our foreign policy. While there are very prominent and well-compensated pundits who will support any American military action whatsoever, there are no comparable people who are opposed to American military action as a matter of principle. Indeed: it’s hard to imagine a single stance that is more likely to disqualify one from professional success in political commentary than being consistently antiwar.\nCredit where due: liberal support for intervention in Syria has been nowhere near as common or as angry as that for war on Iraq. I would characterize the median liberal as deeply skeptical towards the Obama administration’s stance on Syria. Even media liberals, who are predisposed for professional and social reasons towards supporting war and towards support of Democrats, are not united in the push towards war. The most strident liberal hawks are the ones that are to be expected — the indefatigable warmongers at the New Republic, say, or MSNBC, now essentially indistinguishable from a media appendage of the Obama administration. Many have refused to settle on an opinion on “the Syria question.” (That question being, more or less, “Should the United States kill people in Syria?”) These has been, instead, wrestling with the question, a state in which prominent politicos are very publicly seen to be having an internal debate. While they debate, professional militarists like William Kristol and Nicholas Kristof are throwing their backs behind war, but conscience can’t be rushed.\nNot that I question their sincerity. Indeed, among liberals calling for the endless projection of American military power, there is almost limitless sincerity. Liberal hawks are bathed in sincerity; it seeps from their pores. That their sincere beliefs converge so perfectly with their professional self-interest is neither coincidence nor conspiracy; such are the consequences of a commitment to Doing Good. The conflicted, for their part, are not dishonest in announcing their interior anguish. What should disturb anyone is what, exactly, is at play in the conflict: knowledge of the reality of warmaking and imperial privilege played against the desperate progressive desire to find a good war, to support a good war.\nThis conflicted attitude towards liberal interventionism is epitomized by recent reversals on the Libyan civil war, where NATO picked a winner and the media, dutifully, has declared victory. Retroactive support for an American war is almost too perfect an example of this kind of thinking — settling on a side only after the issue has been decided, mistaking the power of hindsight for the possibility of wisdom. But Libya is a good example of the power of positive thinking and, more, the dominant influence of the conventional wisdom on media progressives. There is a Libyan reality, but there is also the conventional wisdom that plays on TV, and the conventional wisdom decided awhile ago that Libya was a success.\nUnfortunately for liberal supporters of humanitarianism via explosion, Libya is not nearly as compelling a data point as they seem to believe. Since Qaddafi was killed by the surgical precision of a knife in his rectum and a bullet in his head (sans trial, naturally), Libya has not been the kind of place the militarists who celebrate it would want to hang out. Libya has been hit with waves of political assassination; its new government has failed to secure basic infrastructural and administrative needs, and rushed to engage in hideously homophobic rhetoric; and minority populations like sub-Saharan Africans and Christians have been targeted for violence and oppression. This is all simply to say that civil wars tend to result in chaos and atrocity regardless of who won, and that great powers merely choose winners, and that the short-term requirements of politics have nothing whatsoever to do with the long-term good of actual people.\nIn any event, imperial privilege makes every country a canvas, and those who call for war will paint Libya as they may. Our political class has forgotten the violent reprisals against the ethnic groups unfortunate enough to be on the wrong side of the Kosovo conflict. The crimes against the losers in Libya will be similarly discarded; such memories are inconvenient.\nBetter even than a real conflict, though, is a hypothetical conflict. Why bother with the effort of forgetting, when you can merely invent? Those are the very best wars, the ones that are dreamt of in the American imagination. No conflict has ever been as noble, no war as good, as our hypothetical war for Rwanda.\nThe Rwandan genocide of 1994 stands as one of the most brutal and cruel periods in the history of a brutal and cruel species. The genocide was part of a long conflict between central African tribal groups. The history that preceded the genocide is long and complex. For now, it is enough to say that the conflict between Tutsis and Hutus is centuries old, and that the prelude to the Hutus carrying out genocide against the Tutsis included civil war, the long and continued meddling of Western imperial powers, and the assassination of a Hutu prime minister. The situation, in other words, was typical of real-world civic strife in its extraordinary complication, though the horrific and unforgivable nature of the crimes is as simple as such a thing can be.\nTo understand the yen for intervention in Rwanda — and the failure to intervene is cited constantly, it is the cudgel with which those who really care self-flagellate — you must understand that “Rwanda” is not Rwanda. Rwanda is a country, and a people, and a series of terrible crimes. “Rwanda” is an abstraction. “Rwanda,” as a concept, is a profoundly useful rhetorical object for those arguing for killing as a means of humanitarianism. Over time, the particulars of the conflict have been sanded away in the public imagination, to the point where we can take references to Rwanda to mean neither a country, nor its people, nor the conflict that eviscerated both. When it is invoked as an object lesson, Rwanda, instead, means liberal guilt. It means a stain on the conscience of anguished white people. It is the preeminent example of flesh and blood reduced to metaphor, genocide rendered into the useless psychodrama of an imperial people.\nOur political debates engender a habit of mistaking the simple moral impermissibility of great crimes for simplicity in the events that lead to them. This is always and only a mistake. The Rwandan conflict was at heart a tribal conflict, and there were Hutus and there were Tutsis, and the former were the people who we would have been killing, and they constituted a large majority of Rwanda’s people. The Tutsis, we can assume, would have behaved like essentially every other winning party in every other civil conflict of the past century, and would almost certainly have engaged in a campaign of violent reprisals against the defeated Hutus. The restoration by force of Tutsis to power would have been yet another in a long history of Western imperial powers installing a minority people into government to dominate the majority. Then there’s the uncomfortable reality that the proximate causes of the conflict, civil war and assassination, are not the stuff of long-term stability.\nMore than anything, there is the lesson that Americans across parties simply refuse to learn, the lesson of our own fallibility. “Should” still implies “can,” and we have every reason to doubt “can.” The last decade of history should have taught us no lesson more forcefully or completely than that good will is no guarantee of good deeds, that war is unpredictable and intervention fickle, that overwhelming military superiority is essentially worthless when it comes to securing peace. Every conversation I have ever had about a hypothetical humanitarian intervention has assumed that it would have been successful in keeping Hutus from slaughtering Tutsis. I simply cannot understand this kind of confidence. We had over a hundred thousand troops in Iraq, the “legitimacy” of Congressional approval, an investment of hundreds of billions of dollars, and the willingness to sacrifice thousands of American lives. Yet the warring factions of Iraq killed each other in the hundreds of thousands, ethnically cleansed the country, destroyed its infrastructure, sent refugees out in vast waves, and generally caused the nation to descend into a lawless hell. Today, ten years after the invasion, Iraq suffers from a corrupt and unaccountable government and daily spasms of terrible violence, so common that they barely make the newspapers here. And yet we are always to believe that American good will and military power would have ensured the prevention of atrocity in Rwanda. As always, the burden of proof rests on those who are skeptical of military power, no matter how much history we have on our side.\nThis is the problem with a real Rwandan conflict. It would not be the perfect war it is made out to be when it is used as a argumentative bludgeon. Indeed: for those currently advocating for the (surgical, precise, smart) application of American ordnance, nonexistence is the single most useful aspect of the Rwanda intervention.\nThere is no American adventure in Rwanda to remember, or to assess. I cannot argue against a counterfactual. Even to question the hypothetical war we did not fight is, of course, to invite charges of indifference or even tacit support for genocide. Just like resistance to war in Iraq was represented as support for Saddam, or skepticism towards the bombing campaign in Libya as love for Qaddafi, or opposition to McCarthyism, a vote for Joe Stalin. Perhaps the people who make such allegations might consider the evidence that Hutus and Tutsis would have found a way to slaughter one another regardless of our intervention, just as warring sects are surely settling scores today in Iraq, and in Libya, and would in Syria, in defiance of Western control. Or perhaps they might consider that some of us refuse to divide the world between goodies and baddies, because there are no blameless parties in any wars, and that we instead choose to judge acts, to condemn the act of genocide and not to cast our lot in with warring sides in civil conflicts. Maybe they could merely respect our exhaustion, horror, and revulsion in the face of America’s seemingly limitless appetite for war.\nHow many times must we witness the collapse of good intentions into horror and failure before we no longer allow people to wear those good intentions like a mark of courage?\nI have to confess, and in confessing demonstrate my profound lack of moral seriousness: I cannot understand the mentality that searches for good wars. A good war, to me, is like a good famine or a good plague; I don’t go hunting for unicorns. But even if such a thing is real, history suggests that it is as rare as snow in the Sahara. Still, the liberal hawks will be surprised when they don’t find one in Syria. The benefit of being a hawk, after all, is that your beliefs remain reality-resistant. You can fail again and again and again, and your opposition can be proven right again and again and again, and you will suffer no professional or social consequences. For the unprincipled opportunists who choke our media, this represents no problem. For the true believers, those righteous moral hawks, I see pain ahead. They will once again be surprised to find that they live in a world that is indifferent to their bountiful caring, a broken world, a cruel world, one beyond saving through passion.", "url": "https://www.jacobinmag.com/2013/09/good-wars-real-or-imagined"}