{"authors": ["Will Johnson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:04", "date_modify": "2020-05-04 19:59:04", "date_publish": "2012-09-16 00:00:00", "description": null, "filename": "2012_09__1588622344.html", "image_url": "https://images.jacobinmag.com/2012/09/16232826/leanclass-2.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2012_09__1588622344.html", "title": "Lean Production", "title_page": "Lean Production", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOn September 10, nearly 30,000 Chicago teachers went on strike for the first time in 25 years. This was no mere breakdown in negotiations over wages or healthcare contributions. At issue, as many have noted, was the fundamental direction of public education. The Chicago teachers asserted themselves as the first institutional force to combat what’s often called the “business model” of education reform. Meanwhile, in Detroit, students and teachers returned to dramatically altered schools. Over the summer, Roy Roberts, the schools’ “emergency financial manager,” had unilaterally imposed a contract on the city’s teacher union allowing elementary school class sizes to jump from 25 to 40 students and high school classes to 61 students. These class size reforms were coupled with a 10 percent pay cut for Detroit teachers. While Detroit’s example is extreme, increased workloads for decreased pay are what teachers around the country — including in Chicago — are experiencing to varying degrees as the business model of education reform gains traction with policy-makers. But stretching workers past their breaking point and increasing hours while gutting compensation is nothing new. The business model of education reform is an extension of a process called lean production that transformed the US private sector in the 1980s and ’90s. In education, just as in heavy manufacturing, the greatest damage done by lean production is not done at the bargaining table, but in the destruction of teachers’ working (and students’ learning) conditions.\nThe Team Concept My first two years teaching in New York City, I worked at an exemplary “lean” high school. This school twice received “A” ratings on its progress reports from the Department of Education, and it was rated “well developed” (the highest possible rating) in a 2011 quality review. Curiously, my former school’s stellar ratings were awarded despite its poor academic record, itself a matter of public record (see below). When the Department of Education wrote its “quality review” of my former school, the first set of commendations focused on the administration’s use of teams. “The principal,” the report reads, “promotes organizational decisions . . . through a distributive team leadership model that consistently improve instruction and student outcomes.” Basically, my principal was being lauded for putting teachers on lots of different teams and giving those teams lots of responsibilities. At first, being on teams sounds like fun. Teachers at my old school worked on grade teams, department teams, inquiry teams, “case-conferencing teacher teams” and “‘Teachers as Critical Friends’ groups.” All teachers attended three staff meetings per week, often breaking into small teams — per the administration’s instructions. But based on this school’s academic failures, these teams clearly weren’t leading to “improved student outcomes.” So why was the Department of Education so happy about them? The team concept is a critical component of lean production. In lean workplaces, labor journalist Jane Slaughter writes, worker teams are designed to enlist workers “in speeding up their own jobs . . . It is no longer enough for workers to come to work and do their jobs; they need to become ‘partners in production.’ ” School managers promote teams as empowering for teachers; according to management, they give teachers a say in how their schools are run. In reality, these meetings highlight how little control teachers have over their time and workload at lean schools. Morning meetings can be particularly miserable, as teachers desperate for preparation time are forced to sit through an agenda focused on management concerns. In fact, the apparent purpose of teacher teams is to shift administrative workload onto teachers. At my former school, for example, faculty teams were tasked with designing the rubric our principal would use to evaluate our teaching; case-conferencing teams were tasked with establishing flexible disciplinary systems so that our administration would not have to discipline difficult students; and grade teams were tasked with organizing school events, like field trips and parties. These tasks were piled on top of teaching workloads that were constantly increasing due to growing class sizes and cuts to support staff. Teachers at lean schools are stretched to their limits. This is not an accident. The team concept both increases stress on the workforce and creates the illusion that workers themselves are responsible for this stress. After all, the teacher teams assign themselves the work. Of course, in a lean school, teachers are never given the option to reject the team model, which generates the work; they have to choose between being a “team player” and volunteering for new tasks and responsibilities or letting down their co-workers. The cumulative result is, predictably, frustration and exhaustion: frustration because teachers constantly find themselves having to shortchange their pedagogical responsibilities (planning lessons, developing curricula) and focus on team (administrative) responsibilities; and exhaustion because teacher workloads were barely manageable before this additional work was assigned.\nManagement by Stress The name “lean production” suggests that the practice emphasizes ruthless efficiency and eliminating waste. True, but those tactics have been around since the Industrial Revolution. What makes lean production unique from other forms of capitalist production is its “Management by Stress” approach: to achieve maximum efficiency, management deliberately stresses workplace systems to the point of breakdown. In Choosing Sides: Unions and the Team Concept, Jane Slaughter and Mike Parker note that production in US factories was traditionally supposed to keep moving 24/7. Breakdowns were considered crises. In a lean factory, however, supervisors speed up the production process until a worker drops a widget, loses a finger, or has a nervous breakdown. Such breakdowns are viewed as a positive because they allow management to identify weak links in the chain of production. As Slaughter and Parker write, “If the system is stressed . . . the weakest points become evident . . . Once the problems have been corrected, the system can then be further stressed (perhaps by reducing the number of workers) and then rebalanced.” The line can then be sped up again until the next breakdown occurs. Occupational stress and its attendant physical and mental breakdowns have always been risks for teachers, but in lean schools, such breakdowns are a management goal. The consequences for teachers and students are catastrophic. Not surprisingly, teacher turnover rates have increased dramatically as schools have gotten leaner and leaner. USA Today recently reported that “in the 1987–88 school year . . . the biggest group of teachers had 15 years of experience. By the 2007–8 school year . . . the biggest group of teachers had one year experience.” Research indicates that turnover is 50 percent higher in high-poverty schools — which happen to be the laboratories for lean production in education — than affluent ones. Day to day, high turnover hurts staff cohesion and the shared sense of community in schools. A recent study conducted by researchers from the University of Michigan, Stanford, and the University of Virginia found that teacher turnover even takes an academic toll on students. The researchers found that an increase in teacher turnover “by 1 standard deviation corresponded with a decrease in math achievement of 2 percent of a standard deviation.” The predictable increase in teacher turnover reflects another hallmark of lean production: replacing skilled workers with an unskilled, contingent workforce. Despite a wealth of research showing that students fare better with experienced teachers, advocates of lean education from New York City Mayor Mike Bloomberg to Teach for America CEO Wendy Kopp advocate programs (like TFA) that place inexperienced, poorly trained teachers in classrooms for 1–3 years, burn them out, and replace them with a new batch. In lean education, teaching becomes a low-skilled, temporary job, regardless of how turnover affects students and schools.\nValue Added Assessment Another hallmark of lean production that’s made its way into public schools is value added assessment. The concept emerged from the lean technique of value mapping, wherein managers track the flow of value through each stage of the production process. In a lean workplace, the ideal is an unobstructed flow of value from raw material to finished product. Before tracking the flow of value, however, managers must, as lean production experts James Womack and Daniel Jones write, “specify value.” In lean schools, value is “specified” as test scores. In a lean school, teachers are managers who supervise the flow of value through their students, whose job is to produce test scores as efficiently as possible. Unless they contribute to the production or flow of value, abstract values like emotional and social development, safety, comfort, and joy are all considered waste. Value added assessments are then used to impose rankings upon teachers. Rankings are another key element of the lean production philosophy. As lean management guru Bob Emiliani puts it, “The final element of . . . evolving human resource practice was… an annual forced ranking of all associates.” Forced rankings will certainly sound familiar to anyone who’s been following the recent attacks on teachers from New York to California, where politicians and media outlets used test-based teacher rankings to publicly humiliate teachers — even when those rankings are statistically meaningless. Public humiliation is certainly useful for lean managers who seek to place constant pressure on their employees so that, as Womack and Jones write, they can “do more and more with less and less.” The primary goal of forced rankings is, however, to shrink the workforce and see how far remaining workers can be stretched before they crack. Emiliani advises managers to “develop an action plan” for the “bottom 10 percent” of workers, and if there’s no measurable improvement in performance, “the associate would be subject to involuntary separation.” For the best of the workers — more work! As Bill Gates proposed last year in the Washington Post, policymakers should “get more students in front of top teachers by identifying the top 25 percent of teachers and asking them to take on four or five more students.”", "url": "https://www.jacobinmag.com/2012/09/lean-production-whats-really-hurting-public-education/"}