{"authors": ["Chris Hayes", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:46", "date_modify": "2020-05-04 19:54:46", "date_publish": "2012-06-16 00:00:00", "description": null, "filename": "2012_06_meritocracy-chris-hayes_1588622086.html", "image_url": "https://images.jacobinmag.com/2012/06/16232353/Twilight_2-2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2012_06_meritocracy-chris-hayes_1588622086.html", "title": "The Age of Illusion", "title_page": "The Age of Illusion", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "CH\nI think people are resistant to the idea, because the meritocracy is our social ideal, particularly among good liberals. Equality of opportunity, but not of outcome. Not evaluating people by their [outside] features, but by their innate talent and drive. And I do not say this mockingly. It’s an incredibly appealing vision. But meritocracy contains the seeds of its own destruction. It concedes inequality. As an ethos it doesn’t trouble itself with what the results are going to be. One of the key arguments of the book is that those results have real effects. And they then queer the system to produce more inequality and restrict equality of opportunity.\nMeritocracy leading to oligarchy, my high school is a concrete parable for that. Here’s a place, the Hunter College High School [a prestigious public high school in Manhattan], an amazing place that in some ways sticks to a beautifully austere vision of meritocracy. They have this single test and it literally doesn’t matter if you are Mayor Bloomberg’s daughter, if you don’t take and pass it you are not getting in. I’ve talked to the President of Hunter and she told me “You would not believe the phone calls I get, and who I get them from — ‘is there some way to make an arrangement…’” And there’s something incredible about that, particularly in an era in which there are very few institutions that can confidently say Mayor Bloomberg’s daughter wouldn’t [necessarily] get in.\nBut what’s happened to this, at some level brutally equal, system? That equality is embedded in a social system full of massive inequality, and the latter leaks into the former and colonizes it. We’ve had…the growth of this tremendous testing and test prep industry in New York, along with the massive rise in inequality and it has produced a system in which the school is now admitting only three, four, five black and Latino students. The students they are admitting are almost entirely white, affluent kids with tutors or second generation, first generation immigrants from Queens and other places where the parents pay for test prep. You end up with a system where who you are really letting in are the kids with access to test prep, the kids with access to resources. Hunter can be an amazing engine of mobility, but over time it can’t help but break down if it isn’t embedded in a society that has egalitarian commitment. That’s the theoretical soul of the book.\nMeritocracy has amazing things about it and terrible things about it. Part of the purpose of the long section on Major League Baseball is to show that one of the outgrowths of a system of incredibly intense emphasis on performance, with finely granulated judgments of who’s better than whom, is that you produce real intense incentives for fraud, for cheating. And that’s not to say its impossible, but in the same way that everyone recognizes that a bureaucracy or a system driven by seniority, that there side effects to that, you need to keep people motivated and you have to make sure you don’t end up with blockages and obstacles to getting things done. If we are going to keep embarking on this meritocratic project, we should be clear eyed about what the negative effects are.", "url": "https://jacobinmag.com/2012/06/meritocracy-chris-hayes"}