{"authors": ["Henry Farrell", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:52", "date_modify": "2020-05-04 19:57:52", "date_publish": "2013-07-16 00:00:00", "description": null, "filename": "2013_07__1588622272.html", "image_url": "https://images.jacobinmag.com/2013/07/16233706/farrell-2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_07__1588622272.html", "title": "Half Poulantzas, Half Kindleberger", "title_page": "Half Poulantzas, Half Kindleberger", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Once upon a time, international political economy (as it is studied by American international relations professors) and international political economy (as it is studied by Marxists and marxisants) knew each other well. The realist Robert Gilpin, whose book on international political economy is still assigned in PhD seminars, disagreed with Marxism, but took it for granted that it was one of the major approaches in the field. Admittedly, studying the international economy through the lens of politics, as both Marxist and non-Marxist international political economists wanted to do, was seen by some as faintly subversive. Peter Gourevitch’s famous (among international relations scholars) article on how international forces shaped domestic economies was not notably ideological, but was nonetheless rejected as “Marxist claptrap” by one of the leading journals in the field.\nNow, the American school of international political economy is highly respectable, and (not coincidentally) dull and middle-aged. No-one in their right mind would accuse the modal article in International Organization (the leading journal in the field of international political economy today) of being dangerously radical. Then again, no-one who was not already a specialist academic would be likely to pick it up in the first place. The mainstream of American international political economy has cast off both its more radical connections and its ambitions to speak to larger debates. Marxists and radicals continue to work on international political economy, but they are largely ignored by the dominant figures in the field.\nThis is a pity — as Panitch and Gindin’s book shows, there’s a lot that they could learn. And if most standard issue international political economy scholars don’t know much about Marxists, the opposite is not necessarily true. Panitch and Gindin not only know the debates among radicals, but have read very widely across the field of IPE, engaging with (and often usefully repurposing) the ideas and empirical material that they find useful.\nI learned a lot from their book, and will be assigning it to my students. Still, I think there’s room for useful argument. To be clear, Panitch and Gindin are clearly far better read in the debates that I follow than I am in the debates that they follow. This means that some (and perhaps most) of the disagreement below is of the “why didn’t you write the book that I would have written if I were you” variety, so discount it as you think appropriate. I’m almost certainly not the audience they imagined that they were writing the book for. Yet their account of the entanglement between American imperium and neo-liberalism conceals as well as reveals. There are some causal relations — arguably quite important ones — that are invisible to it.\nMaybe the best place to start is to look at the resonances between The Making of Global Capitalism and a book which has interesting similarities (they don’t cite it, perhaps because it is only indirectly about political economy) — Kal Raustiala’s Does The Constitution Follow the Flag? The political valences of the two books are quite different. I suspect that Raustiala is a liberal with the usual liberal attachment to free markets. Panitch and Gindin — not so much, obviously. However, the stories that they tell have striking similarities. Both are arguments about the construction of American empire. Both emphasize the crucial role of the US regulatory state in building up this empire. Raustiala is writing to chastise globalization boosters who don’t pay sufficient attention to regulatory power. Panitch and Gindin, I imagine, have at least half an eye towards correcting crude accounts which emphasize the power of international corporations and capital, and nothing but. Yet their correctives point in roughly similar directions\nWhere they diverge is in their account of more recent history. Raustiala’s story is one of how American rule is qualified, although not entirely supplanted over time. As the European Union and its member states develop their own regulatory apparatus, they began to challenge the US. It isn’t as easy for the US to bully through as it used to be — European regulators, who often take their lead from European capitalists, have their own interests. He suggests that this makes a world in which there are at least two important regulatory powers, not one. Raustiala doesn’t explore the implications at any enormous length. However, Dan Drezner, in a recent book, argues that this means that when the EU and US agree on regulation, they are able to dominate everyone else, and that where they do not agree, the likely result is rival standards and uncertainty.\nPanitch and Gindin’s account instead emphasizes how continued American imperium and domination and global capitalism continue to reinforce each other, melding Nicos Poulantzas and Charles Kindleberger to each other. From Poulantzas (and Engels, and others in the Marxist tradition), they take a conception of the state as a crucial organizing element which carries out the kinds of domestic coordination that capitalists themselves find difficult or impossible. From Kindleberger, they take an emphasis on the need for one state to act as hegemon in order to sustain a given international economic order (Kindleberger, of course saw this in more benign terms than do Panitch and Gindin). This leads them to focus not on tensions between states as a source of change. Instead, the motor of change is the gradual accumulation of contradictions in a particular economic model, and the efforts of actors (most particularly the US state) to resolve those contradictions in ways salutary for the continued health of capitalism and capitalists.\nSometimes, this results in terrific insights. Panitch and Gindin’s account of the role of the US state in the UK’s decision to apply for IMF funds is excellent, enlightening, and largely new to me (perhaps it shouldn’t be — I’m not a real specialist in this area). They have smoking gun evidence that goes a long way to elucidate the relationship between the US state, the US’s perception of business interests, and the UK state’s responsiveness. Much of the time, it plays the same useful organizing role that any big theory of politics or economics plays — it provides an account of change that is helpful in transforming complexity into order, but that is contestable. Here, I (as a non-Marxist, but someone who gets value from Marxist work), see it as roughly comparable to non-Marxist accounts (say, the aforementioned Gourevitch, or Ronald Rogowski’s work), where one does not have to completely agree with the analysis to find it extremely helpful. Sometimes however, it seems to me to unduly discount things that are important, but that don’t fit easily with the broader theory. This isn’t a major disqualification — any ambitious and genuinely interesting theory of the world has to do this kind of shoehorning. Still, it does provide a starting point for critique, useful discussion, and, perhaps, further elaboration.\nFrom my perspective, Panitch and Gindin’s account could most usefully be criticized for its relative lack of attention to conflicts between different states (and the economic and other interests that they represent). The relationships that they describe are overwhelmingly one way. The US, acting on behalf of an internationalized capital class, promotes neoliberalism. Other states gradually come to acquiesce.\nObviously, there’s a lot to this story. But there is also a lot that it doesn’t explain. Take, for example, monetary relations between the US and Europe. Panitch and Gindin downplay both John Connally’s famous dictum to the Europeans that the dollar was “our currency, but your problem,” and the US’s notorious penchant of offloading its adjustment problem onto unhappy allies. They go on to write about how Europe’s Economic and Monetary Union (which is now wreaking havoc) was benignly encouraged by the US, implying that it is another, reasonably straightforward product of US hegemony. Yet this only tells a small part of the story. As Harold James’ recent book (rooted in a detailed examination of the archives) argues, the EU’s economic and monetary union was a product less of encouragement by the US hegemon than of European fears of what that hegemony implied for them. European central bankers and politicians worried — with cause — that the US would continue to offload its economic problems onto them, and that they would have no good way to respond, unless they came together to create a counter-balancing force.\nOne could tell similar stories in other sectors of the economy. Panitch and Gindin are obviously no fans of academic social democrats who see in Europe a kinder and gentler form of capitalism that might plausibly be sustained. This is fair enough on the macro level — European social democracy is taking a beating. Yet some of the differences between European and US models of capitalism are being sustained, and perhaps even strengthened as, for example, German banks retreat from their forays into US munis. And it’s here that their account is the weakest. It provides a fine and valuable account of the roughly similar changes across advanced industrialized states which sum up to neo-liberalism. But it doesn’t do nearly as well at explaining the variation — which practices survive and which do not; which countries succumb and which remain different. Telling that story would require different theories than the ones that Panitch and Gindin provide us with.\nI have a personal interest in one aspect of this variation — how cross national coalitions can reshape domestic political institutions. As Panitch notes in an interview with , his and Gindin’s account acknowledges these kinds of relationships as more conventional accounts do not.\nThe interpenetration of capital across the Atlantic is a big element in the story. The varieties of capitalism school totally miss this, by the way. They treat each country as a watertight compartment, except for noting that everyone has to be competitive.\nThis is exactly right. However, their account of these coalitions has its own limits. They look at interpenetration in order to explain how neo-liberalism isn’t simply imposed on countries from without — it often is driven too (or perhaps instead) by a clamor from inside, as domestic capitalists become increasingly internationalist, in response both to interpenetration and assiduous encouragement from the US. Doubtless, this explains a lot of the changes we see today. However, again, it doesn’t explain variation particularly well. Capitalists have created cross-national alliances on some issues. On others, they have continued to fight against each other.\nIt seems to me hard to explain this unevenness from within Panitch and Gindin’s own theory. But here, they and other Marxists might look to the work of non-Marxist scholars like Helen Callaghan. Callaghan finds that European businesses have been very happy to cooperate across borders in order to fight against rules mandating increased worker participation in the firm. This benefits both the businesses in the countries where there is no worker participation (they continue to be less constrained) and businesses in the countries where participation is already legally required (they may find it easier to roll back their domestic rules in the future, and can threaten to relocate their business elsewhere in Europe if their workers start acting up). In contrast, businesses in different countries will have diverging interests over rolling back protections against takeovers.\nA shared interest in preserving the right to manage fails to ensure intra-class cohesion because one manager’s freedom to fend off unsolicited bids directly conflicts with another manager’s freedom to make hostile acquisitions. Under conditions of a non-level playing field, those already subject to domestic constraints on their freedom to defend themselves stand to gain from an EU-wide spread of their constraints because it increases their ability to make hostile acquisitions abroad. Those not subject to domestic constraints stand to lose the freedom to fend off unsolicited bids.\nOr, put differently, increasing interpenetration does not necessarily result in increasing cross-national solidarity among capitalists. Investigating the circumstances under which capitalists join arm-in-arm across borders, and those under which they will continue to fight each other requires a different kind of analysis of interpenetration than the one Gindin and Panitch provide us with. Differences of interest across states and across economic interests within those states remain important, and sometimes become even more pronounced as a result of increased interpenetration.\nAgain, this isn’t to downplay Panitch and Gindin’s very substantial contribution to our understanding of how the international economy works today. I hope they take it as the compliment that I intend when I say that their book deserves an audience among non-Marxists as well as Marxists. Nor is it to deny Panitch and Gindin’s impressive command of a wide and varied literature. It is to say that there are important aspects of neoliberalism that their theory doesn’t capture very well, including some quite important variation in the take-up of different aspects of neoliberalism across different states. Better dialogue between Marxist and conventional IR approaches could have great benefit for the latter (especially if it pushes standard international political economy accounts to really pay attention to power relations). But it might have some benefit for the former too.", "url": "https://jacobinmag.com/2013/07/half-poulantzas-half-kindleberger/"}