{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:27:15", "date_modify": "2020-05-04 16:27:15", "date_publish": "2013-08-23 18:46:54", "description": "Read CNN's Fast Facts about Easter and Holy Week.", "filename": "2013_08_23_world_easter--holy-week-fast-facts_index_1588609635.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150330151550-03-holy-week-0330-super-169.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_08_23_world_easter--holy-week-fast-facts_index_1588609635.html", "title": "Easter & Holy Week Fast Facts", "title_page": "Easter & Holy Week Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at Easter and Holy Week.\nOn Easter Sunday, Christians celebrate the resurrection of Jesus Christ on the third day after his crucifixion. It also marks the end of the 40-day period of penance called Lent. Easter is considered to be the most important season of the Christian year.\nEaster\nApril 12, 2020 - Easter Sunday.\nIt is celebrated on the first Sunday after the first full moon following the first day of spring.\nIn some countries, Easter is called \"Pascha,\" which comes from the Hebrew word for Passover.\nThe Jewish holiday of Passover took place just before Christ's crucifixion and resurrection.\nThe Eastern Orthodox Church uses other factors to determine the date and will celebrate on April 28, 2019.\nChristianity is one of the world's largest religions, with approximately two billion followers around the world.\nHoly Week\nPalm Sunday\nApril 5, 2020 - For Christians, Palm Sunday commemorates Jesus' arrival in Jerusalem prior to his crucifixion, where palm leaves and clothing were laid in his path.\nPalm Sunday is often celebrated with a procession and distribution of palm leaves.\nIn some churches, the palms are saved and burnt into ashes to be used on Ash Wednesday of the next year.\nPalm Sunday is also called Passion Sunday.\nIt is the last Sunday of Lent and first day of Holy Week.\nMaundy Thursday\nApril 9, 2020 - also called Holy Thursday.\nThe observance commemorates the Last Supper, before Jesus' crucifixion.\nSome churches hold a special communion service.\nGood Friday\nApril 10, 2020 - For Christians, it is a day of mourning and penance. Good Friday marks the day Jesus died on the cross.\nGood Friday is celebrated the Friday before Easter Sunday.\nMany observe the day by fasting and attending church services.\nCelebrated since 100 AD as a day of fasting, Good Friday acquired significance as a Christian holy day in the late fourth century.\nSymbols & Customs\nEggs have long been a symbol of life and rebirth.\nPainting and dying eggs pre-dates Christianity.\nPolish folklore has the Virgin Mary offering eggs to the soldiers guarding Christ on the cross, as she begged them to be merciful, her tears left stains on the eggs.\n1885 - The Czar of Russia commissions the jeweler Faberge to design an enameled egg each Easter.\nThe first Faberge egg contained a diamond miniature of the crown and a tiny ruby egg.\nOf the 50 Imperial Easter Eggs made, most are now in museums.\nOrigins of the Easter Bunny are unclear, but he appears in early German writings.\nThe first edible Easter bunnies appeared in Germany in the 1800s and were made from sugar and pastry.\nJelly beans first became part of Easter celebrations in the 1930s.\nCommercialization of Easter\nAccording to the National Retail Federation (as of March 2019, no 2020 report published):\nThose who celebrate will spend an average of $151 per person for clothing, candy, decorations and more. And almost half of those not celebrating will still spend an average of $19 for Easter-related sales.\nPlanned activities include: visiting family and friends (57%), cooking a holiday meal (54%), going to church (49%), and Easter egg hunts (32%).\nAccording to the National Confectioners Association, two-thirds of American parents will create an Easter basket for their children, and 90% of Americans will share chocolate and other candy.", "url": "https://www.cnn.com/2013/08/23/world/easter--holy-week-fast-facts/index.html"}