{"authors": ["Mike Beggs", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:17", "date_modify": "2020-05-04 19:57:17", "date_publish": "2013-07-16 00:00:00", "description": null, "filename": "2013_07_jacobin-book-club-the-making-of-global-capitalism_1588622237.html", "image_url": "https://images.jacobinmag.com/2013/07/16233703/intro-2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_07_jacobin-book-club-the-making-of-global-capitalism_1588622237.html", "title": "Jacobin Book Club: The Making of Global Capitalism", "title_page": "Jacobin Book Club: The Making of Global Capitalism", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Hardt and Negri’s Empire . Meiksins Wood’s Empire of Capital . Harvey’s New Imperialism . Already this young century has seen a number of Marxist luminaries reinvent the concept of imperialism to understand the last few decades, in which capitalism has entrenched itself truly as a world system, and in which the American state has set itself so far above any rival. Once imperialism meant national capitalisms clashing through the military power of their national states; now we have a system of national states, under the clear leadership of the United States, superintending and troubleshooting an international economy.\nInto this field comes Leo Panitch and Sam Gindin’s magnum opus, The Making of Global Capitalism: The Political Economy of American Empire . It is at once recognizable as part of this new breed of thinking on empire, and a book that brings it to new levels of detail and depth. It is a history rather than a work of abstract theory, but readers familiar with the debates of recent years will spot a tightly argued position, elaborating work developed in the Socialist Register ‘s last decade.\nOver the next couple of weeks we will run the inaugural Jacobin Book Club seminar on this book, which deserves to be widely read on the Left. Every couple of days we will post a contribution on an aspect of the work. Then Panitch and Gindin themselves will respond.", "url": "https://www.jacobinmag.com/2013/07/jacobin-book-club-the-making-of-global-capitalism"}