{"authors": ["Richard Seymour", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:59", "date_modify": "2020-05-04 19:52:59", "date_publish": "2013-04-16 00:00:00", "description": null, "filename": "2013_04__1588621979.html", "image_url": "https://images.jacobinmag.com/2013/04/16233430/166069024_10-2.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_04__1588621979.html", "title": "An Obituary from Below", "title_page": "An Obituary from Below", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Obituaries are typically concerned with the accomplishments and worthwhile qualities of the deceased. Thatcher’s achievements are undeniable. She was a “Modern Prince” of the Right, intervening at a moment of crisis and great danger for the Conservative Party, taking control of the elements in flux and recomposing them. She utterly transformed the state, party politics, and the economy, institutionalizing a form of neoliberal statecraft that is almost unassailable from within. To describe Thatcher’s accomplishments in this way, though, is already to hint at the problem with the obituary format. Thatcher’s most important achievements were also what made her so vile, and reprehensible. Her energy, her ruthlessness, and her political guile were harnessed to such bigoted, class-supremacist ends, that it is hard to admire them. Reviewing the wreckage of those years, it is difficult not to be transfixed by horror. There is also the danger, in focusing on Thatcher’s qualities and successes, of overstating the role of an individual leader. Thatcher’s efforts depended not just on a wide coalition of popular and business interests, with the petty bourgeoisie and “new middle class” as its lynchpin, but on a series of institutional powers — from the popular press to the International Monetary Fund. Her strengths, as often as not, derived from her opponents’ weaknesses, divisions or downright cravenness. Yet, there is no denying Thatcher’s leadership qualities. And this obituary will pay close attention to the factors that made Thatcher the most successful politician in the post-war period — in the spirit of learning from the enemy, the better to defeat them in future.\nThatcher identified with the rich, fought for their interests, and went to her grave as a fully ratified member of the ruling class — with the dough and aristocratic title to back it up. Yet there is some truth to her representation as a petty bourgeois antagonist. Her father, a Liberal politician who lost out to Labour’s postwar surge, ran two grocery shops. She lived in the flat above one of them. Margaret Roberts, as she was then, was a “striver,” in the language of the present Tory leadership, stacking her résumé with extracurricular activities from a young age. She sought a scholarship to study at Oxford, which she won only narrowly when another student fell through. She gained a second-class science degree and worked as a research chemist before meeting millionaire anti-socialist businessman Denis Thatcher at a business function. He married her in 1951, and supported her political and career ambitions from there on. After she became an MP, he funded her studies to become a barrister specializing in tax law, which enabled her later to join the Tory front bench as a Treasury spokesperson. And it was with the support of her husband and wider sections of the business community that she took the Conservative leadership after the nadir of the Heath years, and became the most successful Prime Minister in the post-war era. Her whole life was characterized by upward class-mobility, fuelled by her aggression and competitive zeal. This experience provided the raw material for her formation as a pioneer of the “meritocracy,” and she would habitually refer back to elements of it. Asked about her support for grammar schools, for instance, she would say that her own ascent was made possible by an education system that recognized and rewarded talent. It is easy to say, perhaps, that she owed everything to the lavish wealth she married into. But this is simply to say that no one’s success is “self-made,” that all achievements are ultimately based on cooperative labor, and that an individual’s talents are nothing without structures enabling their development. It is to say, in other words, that meritocracy is bullshit; but we already knew that. We would be both churlish and underestimating the deceased to deny the role that her ability and energy played. One of Thatcher’s major strengths was ideological clarity. This should not be construed as overall coherence. The rich, complex ideological articulations that came to be known as “Thatcherism” do not stand out for their consistency. Nonetheless, there was a fairly straightforward “free market” philosophy at the base of her thinking, imbibed from Burke and Hayek. In particular, she had read and been enthralled by Hayek’s The Road to Serfdom , while at Oxford. This, along with lesser anti-socialist tracts such as Colm Brogan’s Our New Masters , formed the basis of her intellectual formation. Amid profound historic defeats for the free-market right, these ideas gave confidence and a sense of historic purpose to its defenders. They asserted that the new “socialist” regime was necessarily irrational. Only markets could efficiently aggregate the fragments of knowledge distributed among millions of people, and communicate them as price signals. The only way for the government to take over the role of markets would be for it to try to concentrate all knowledge and executive decision-making in a centralized authority. This was both futile and authoritarian. It was, in fact, the beginning of tyranny, the original source of the “creeping socialism” that the Thatcherites waged war against. There is a great deal to be gained from taking Thatcherite ideology seriously, even though her rhetoric is easy to lampoon. Lauded as a champion of liberty by President Obama, Thatcher rarely met a dictator she didn’t instantly like and wish to aid in some way: Pinochet, Suharto, even Pol Pot when the Khmer Rouge was waging a struggle to regain control of Cambodia. She denied that the African National Congress could ever govern South Africa, as it was a “terrorist” organization, and insisted to the end that Pinochet had delivered democracy to Chile. Yet, in the terms of her ideology, all of this was perfectly consistent. Freedom was, above all, the freedom of markets and citizens from too much state intrusion in their ability to spend money; democracy was to be found in the abundant choice available in the market. Encroachments on either, even if carried out in the name of an elected government, were the beginning of tyranny. The logic of this, as Hayek himself had spelled out increasingly in his written work, was that democracy was only a provisional good, a good insofar as it would educate citizens to accept free markets and “the rule of law”. Hayek himself, like Thatcher, would prove to be fond of Pinochet, preferring a “liberal dictator” to a democracy lacking all liberalism. Such, at any rate, was the credendum that Thatcher brought to local Conservative meetings, where she impressed people enough that she was repeatedly chosen as a parliamentary candidate before being parachuted into the safe seat of Finchley in 1958. As an MP, she was generally to the right of the parliamentary Conservative Party. She was traditionally authoritarian in some respects, voting to support restoring “the birch” in schools, and opposed the abolition of the death penalty, which even her husband thought was “barbaric.” In others, she was socially liberal, voting to decriminalize homosexuality and legalize abortion. Consistently, she was an advocate of tax-cutting and free markets, and in the Hayekian mode denounced high taxes as a step “not only towards socialism, but towards communism.” Yet simply having this intellectual foundation, this ability, and this drive, was insufficient. Thatcher needed a means to popularize this ideology and a unique moment of opportunity. It was the crisis of the post-war system, and the shambolic weakness of her opponents, that made her.\nThe pathfinder for the New Right that Thatcher was to commandeer was Enoch Powell. A right-wing intellectual and Tory MP from the Black Country, he had begun in the mid-1960s to try out a new political persona as a sort of racist Cassandra — with some success. Warning that British culture was being diluted by Commonwealth migration, he insisted that his augury had not to do with biological race but with the tensions arising between incompatible cultures. His experimentation with new forms of right-wing populism, fusing a defensive white nationalism with free-market ideology, had demonstrated that it was possible for Conservatives to obtain a popular base without the inconvenience of defending the welfare state. His themes would later be her themes. For example, Thatcher’s infamous remark citing popular fear of being “swamped” by immigrants, was widely reviled for its naked appeal to bigotry. Just as significant was her appeal to culture as the major frontline of antagonism. It was “the British character,” which had “done so much for democracy, for law, and done so much throughout the world,” and which was threatened by “people with a different culture.” This was a classically Powellite thematic, and she was later to say that he had made a valid argument if sometimes in regrettable terms. Likewise, the way in which she linked “Britishness” to the market, law and order, low inflation, a “strong pound,” and so on, showed that she had learned a lot from him. But Powell was a passing figure; he was soon marginalized, while his political language was taken on, suitably domesticated, by a significant New Right in the Conservative Party. The opportunity for this New Right took the form of a serious crisis, not just of British capitalism, but of the Conservatives as its dominant party. From the late 1960s, the long-term dysfunctions of the British economy were escalated to the level of acute crisis, as profit rates fell and industries looked to the government to try and suppress wage rises. The development of a rank-and-file movement of shop stewards, union members who had no formal bureaucratic position but who could lead workers out on strike at short notice, signified a growing crisis of labor management too. The right of investors to invest, and managers to manage, was under assault. The Wilson government that was re-elected in 1966 had attempted to solve the problem with legislation seriously restricting the right to strike while preserving the corporatist model in which union leaders would play a role in collective bargaining and economic policy. But it failed. The Heath administration that was elected in 1970 attempted the same remedy with the Industrial Relations Bill, only to find that it aroused a level of industrial action not seen since 1926. Its policy was broken, and all the government’s piecemeal attempts to move in the direction of a more liberal economic policy were abandoned — the administration was forced to increase spending, nationalize Rolls Royce, and assume sweeping powers over industry. One of the few cutbacks the government managed was to take away free milk for schoolchildren — something that Thatcher, as education secretary, took responsibility for even though it seems she did not support the policy. Meanwhile, the oil shock of 1973 and the global economic crisis of 1974 accelerated the government’s degeneration. The unions were winning, popular campaigns were gaining momentum, the Labour opposition was moving to the Left, and the Prime Minister may as well have quacked and limped off stage. Another big miners’ strike beginning in 1974 finished the government off. Heath called a snap election, asking the electorate — who runs this country, us or the miners? Voters responded — not you. This was the “crisis of authority” presciently diagnosed by Stuart Hall. In Gramsci’s terms, a “crisis of authority” is the inability of the ruling class to operationalize public consent for its goals. It is a crisis of hegemony, radiating through every dominant institution, through every aspect of productive and ideological relations, and notably through the parliamentary political field itself. The Conservatives were at an historic nadir, with Ted Heath gaining the party just 35 percent of the vote. Businesses increasingly looked to Labour to deliver, through its relationship with the unions, what the Tories could not: higher unemployment and lower wages. This created opportunities for a right-wing opposition. Not only that, but it galvanized the emerging New Right, the spectacle of defeat fueling them with the rage and loathing that would see them through the coming years. Initially, the leadership of the New Right fell on the shoulders of another right-wing intellectual, Keith Joseph. But Joseph’s ambitions were finished after a speech he made, warning that the stock of human population was threatened by high births among the lower classes, was publicized to disastrous effect. Thatcher decided someone else representing “our view” had to stand, and it might as well be her.\nAlthough not exactly charismatic — with her exaggerated accent, her slow, ponderous vowels, and a zombie stare which she occasionally softened with a grimace — Thatcher was seen to be intelligent and passionate. As she took the Conservative leadership, Denis Healey dubbed her “La Pasionaria of Privilege” — a reference to the Spanish communist who incited resistance during the Spanish Civil War, which is as much a compliment as it is an insult. More than this, she had the ability — which Keith Joseph did not — to convert the abstract and slightly ludicrous market doctrines of Friedrich Hayek and Milton Friedman into the language of a political common sense. Even with her fake Belgravia accent, she had a “common touch.” Explaining the need for cutbacks, for instance, she insisted that the state, far from being an especially complex thing, was just like a household or a corner shop — you can’t spend more than you take in, and when things are hard you just have to tighten your belt. Her promise of hard times before the good old days returned resonated with some of the most traditionalist elements of popular culture. She associated herself very ably with notions of British “guts,” symbolically recouping some of the lost glory of empire through her Falklands adventure. Her political performance too was astute. By casting herself as the caring but tough-minded matron of the nation, she spoke to a masochistic layer in English middle class culture — she said, in effect, the crisis has come because we have been too indulgent, too lenient with ourselves. Sackcloth and ashes: we must expiate our sins before the good old days return. This message was spelled out clearly both before and after the 1979 election. Regardless of how terribly the British economy did, regardless of the social chaos unleashed and the soaring rate of unemployment, she insistently stuck with her mantra. Britain will not recover, she said, until its industries are competitive, until strikes end, and until workers stop pricing themselves out of jobs. She offered the example of the car industry — demand for the vehicles was not falling, but increasingly the demand was for imports rather than British-made products. It had failed because decades of corporatism had failed. The state’s insistence on picking winners had produced a series of lame duck projects. The unions had failed the workers, by encouraging them to strike, raising the price of their labor power, and by enforcing over-manning, making production inefficient and costly. Here, there was a solution: let the discipline of the market do its work; let bad companies fail, and good companies thrive; let the industrious and innovative prosper. Soon growth would be restored, as would employment, and living standards would rise. In this way, Thatcher offered a diagnosis that was clearly and intuitively linked to a set of “common sense” solutions, and a set of resonant values, and which also played on certain divisions and weaknesses in the enemy. She knew that trade union leaders were not ready for outright war, and knew also that most strikes were conducted on a narrow, “economic-corporatist” basis. She was aware that solidarity actions were declining, and the support for the Left in the trade unions was dropping. It was in this context that she could say that strikers were harming their fellow workers more than they were helping them. In this connection, Thatcher’s language on public spending and welfare was perhaps more nuanced than people will recall. She certainly believed that the state should be much smaller than it was, relative to the size of the economy. Early on, she abandoned price and incomes controls, broke with corporatism and slashed income and corporate taxes. She also thought the state should be made more like the market where possible, and drafted businessmen to re-organize public services — for example by introducing internal markets into the National Health Service. But in her public arguments, she declared the NHS to be safe in her hands, often accepting the need for decent welfare provision. For example, she maintained that she would very much like to raise Britain’s pensions to a level more approaching European counterparts. But for that, the government must take money from “the working population,” who were often disinclined to spend too much on income taxes. The only way to support an expanded welfare state was to expand the productive base of the economy, which implicitly required a significant drop in the standard of living for the short-term and — in the Marxist terminology she despised — a dramatic increase in the rate of exploitation. It is easy to demand more money, she explained, but that money had to come from other workers. Thatcher was very adept, therefore, at operating on the divisions among workers, extolling the “productive’ majority — from skilled workers to CEOs — against the unproductive state and its clients. The atmosphere of crisis also afforded the government a long leash. A radical right sympathetic to Thatcher had colonized the popular press. The headlines and pundits had successfully worked on the real experiences of privation, violence and social breakdown under Labour’s crumbling social contract to generate an imagined experience of “union bullies” taking over, and “creeping socialism” leading to mass unemployment. The economic crisis, too, was not an incoming Tory government’s fault so much as the permanent rationale for its decisions. “There’s been a world recession,” Thatcher could say blithely, “not our fault . . . but if we hadn’t gone for the policies we have gone for, which are efficiency, increasing productivity, and ending the over-manning of industry, then we would be in no position to compete” when world trade started to expand again. The result was that once world trade did resume, with mild signs of recovery and an inflationary budget, the tremendous damage the government had wrought, the junked industries, the riots, the mass unemployment, was quickly forgiven by the wavering sections of her popular base. The Tories won the 1983 election with just over 42 percent of the vote, only slightly below their share in 1979.\nVictory in the 1983 election, with Labour receiving a catastrophically poor vote share of less than 28 percent, gave the Thatcher government the opportunity to embark on the next phase of its agenda: privatization of state-owned companies, the decisive defeat of the trade unions, and the unleashing of the financial “big bang” by deregulating the City of London. The pivot of Thatcher’s class strategy was a phased confrontation with the trade union movement, outlined in its essential elements in the “Ridley Plan” drawn up before the 1979 election. Only by defeating the unions could they enforce a near permanent acceptance of mass unemployment, and keep wages low. This would also undercut the social basis for Labour’s left-wing, and help destroy socialism in Britain. They sensed opportunity as well: the union leadership had responded to Thatcher’s re-election by embracing a “new realism,” according to which it was no longer possible to fight the government of the day — one simply had to bargain with them for the best one could get. The Tory leadership, now thoroughly dominated by Thatcher and her clique of reactionary bruisers and “self-made” men, prepared for war on the quiet. Despite the general furor about union bosses “running the country,” and the right-wing panic-mongering about the “winter of discontent,” the official rhetoric of the Tories was careful to avoid alerting the enemy as to the stakes in the coming battles. It was clear that they had a beef with the unions, but they foregrounded the liberating effects for ordinary union members of abandoning the “social contract” through which the government held down incomes. Unions would be allowed to bargain as they saw fit, they stressed. In general, their official language gave no signal that they planned to break the union movement, particularly its most militant wing, in a sequence of maneuvers characterized by what has sometimes been called “salami-slicing.” Even when Thatcher did attack strikes, she took pains to point out that it was unions in the public sector — which then included dockers and miners, as well as NHS workers and teachers – who were causing the most trouble. She insisted that the problem was not unions per se, but that state monopolies gave the workers in them a degree of monopoly power which they could activate at a moment’s notice. The “salami-slicing” strategy entailed isolating and picking a fight with one group of workers while others were incentivized to stay out of it. Behind the scenes, as it were, the state was re-tooled for the fight. Anti-union laws were passed, and police numbers were increased. The repression helped weaken an already subsiding tradition of solidarity. Meanwhile generous pay settlements in (temporarily) unaffected sectors gave union leaders a good reason to mind their own business. The government thus began by attacking smaller unions, notching up some significant victories, before moving onto the big battalions. The miners were the biggest, most dangerous one as far as the Tories were concerned. They quietly built up coal stocks, recruited non-union drivers for haulage companies, and built up mobile police squads to attack picketers. They passed laws requiring that benefits be cut off to the spouses of striking workers, thus forcing the union to support whole families. Once the fight was on, however, the Tories’ rhetoric had to escalate if their supporters were to be prepared for a prolonged struggle. As ever, the terrifically malleable thematics of “Britishness” came to Thatcher’s aid during that fight, as she mobilized her supporters in the Conservative Party, the state apparatus, the small business community, and the most right-wing workers. She drew on the language of British pluck that she had deployed in the Malvinas conflict, and which she had unloaded against the Irish republican movement, with the Sun and Mail as her mouthpiece. “We had to fight the enemy without in the Falklands,” she argued. “We always have to be aware of the enemy within, which is much more difficult to fight and more dangerous to liberty.” This points to one of the central ambiguities in Thatcherite ideology. The neoliberal modernizing element was individualistic, and libertarian. The traditionalist element was authoritarian and nationalistic. It was the latter layer of Thatcherism, which evinced a conception of social solidarity based on hierarchy and obedience, which came to the fore during the suppression of the strike. Thus, while the Left reviled scabs, the Right could deride traitors. Thatcher won. It was a near thing at several moments. There was a flourishing of grassroots, left-wing action to sustain the strikers, a broad political mobilization of sections of the working class in its self-defence, despite the union bureaucracy’s reticence. Solidarity action at certain key junctures might have been enough to force the government into a humiliating retreat on a terrain which it had selected. But after a year of struggle, much of it violent and bitter, and growing poverty for many workers, the NUM’s resistance collapsed. With no deal, they abandoned the strike, and the government began to dismantle the mining industry. Nor did Thatcher forget the debt she owed to Rupert Murdoch. Her government, and the police, colluded with the tabloid owner while he sought to shift the production of his newspapers to Wapping, and break the print unions. 54 weeks of strike action by the print workers was policed by cops armed with rubber bullets, enforcing Thatcher’s repressive anti-union laws. So, the government’s victory over the miners in 1985 was closely followed in 1986-7 by Murdoch’s victory over the print workers — with a dramatic increase in his profitability and his ideological power as he assembled more media control, following from it.\nThe wheels of the Thatcher government began to fall off around 1988. They were defeated by a popular NHS workers’ strike, and increasingly divided over the question of Europe. Thatcher had always thought that being pegged to European currency would lead to unnecessarily deflationary policies, and stifle British growth. Her pro-European allies thought it would be a stabilizing factor given the messy dynamism of the City and the UK’s growing dependency on US-led stock-market bubbles. The final miscalculation was the introduction of the Poll Tax. It was not just that mass demonstrations followed, culminating in riots where the police were actually outflanked and defeated. The government could handle mass unrest as long as it retained its popular base. It was that the turbulence was spreading to parts of the Tory base, and the government was losing by-elections in what had been heartlands, with sweeping shifts to Labour. In the polls, Labour even crept above 50 percent. The polarizing effect of such measures was to drive many voters who had opted to support the Liberals back to Labour in a serious way. And under the surface of popular Thatcherism, there was a growing disquiet even in parts her base. The Poll Tax seemed to accentuate everything that people didn’t like about the Tories — the underspending on the public sector, the welfare cuts, the attacks on the poor while the interests of the rich were always looked after. If the Tories didn’t swing back to a pragmatic, centrist position shortly, they would lose enough of their popular base to put in question their ability to ever win another election. Thatcher, whose strident determination was increasingly a liability, was eventually deposed in favor of John Major, a bland centrist from Brixton. Her moment had passed. In a particular conjuncture, a moment of crisis, she had come forward for her class. She had taken control of a precarious situation, and decisively shaped it in the interests of the ruling class. But once the crisis was effectively over, with capitalist growth and political control restored, the militant unions and left-wing councils broken, and the Labour Party swinging firmly to the Right, her methods were no longer useful. What had been her virtues —ideological clarity, political guts, strategic inflexibility — appeared to degenerate into dogma and tactical stupidity. In sections of the popular press, she appeared increasingly as a megalomaniac. In reality, I think the change was as much in her circumstances as in Thatcher herself. She retired from frontline politics, accepted the title of Baroness, and started making increasingly erratic speeches. Her stern, matronly features withered. In a sign of how times had changed, after Labour’s election in 1997 she appeared at Downing Street, gazing through narrow, cynical slits for press photographs alongside Blair. Yet apart from her symbolic role as the guarantor of the “safety” of a centre-left government, the surety that it had accepted the changes of the 1980s, she looked more embarrassing than lethal. In the early New Labour years, when British Airways dropped the Union Jack flag in favor of a cosmopolitan logo, Thatcher made a spectacle of herself by defiantly covering the new logo with a hankie. Yet, she hadn’t changed; it was just that her old imperial nationalism was increasingly redundant. Likewise, when General Pinochet was up for extradition over his crimes against humanity, she insisted on embracing him, defending his record, and crediting him with having brought democracy to Chile. Again, she merely looked vile. She had always supported right-wing dictatorships. But Pinochet, who had been her ally over the Falklands, was by then a hunted criminal. Even the US government had formally apologized for its role in supporting that regime. The moment of emergency, which had made Thatcher, had passed. As an effective politician, so had she.", "url": "https://www.jacobinmag.com/2013/04/margaret-thatcher-an-obituary-from-below/"}