{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:52:27", "date_modify": "2020-05-04 16:52:27", "date_publish": "2013-11-07 19:44:18", "description": "Read Fast Facts from CNN about the Vatican's timetable and process for choosing a new pope.", "filename": "2013_11_07_world_papal-timeline-fast-facts_index_1588611147.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/160327114816-pope-easter-sunday-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_11_07_world_papal-timeline-fast-facts_index_1588611147.html", "title": "Papal Timeline Fast Facts", "title_page": "Papal Timeline Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's some background information about the Vatican's timetable and process for choosing a new pope.\nApproximate Timetable\n(This timeline is based on 1996 Pope John Paul II 's constitution on the conclave, \"Universi Dominici Gregis,\" and on what by has happened in previous conclaves.)\nBurial & Mourning upon Death of a Pope\nCardinals decide, after the death of the pope, when funerals and conclave begin.\nUniversi Dominici Gregis (hereafter referred to as Law) dictates that:\n- There must be nine days of mourning.\n- The conclave cannot begin earlier than 15 days and no later than 20 days after the pope's death.\n- The pope has to be buried between the fourth and sixth day after death.\n- The embalmed body of the pope has to be on display at St. Peter's Basilica for mourning.\nChoosing a New Pope\nBased on the above and what traditionally happens after the pope dies, we can assume the following time table:\nDAY ONE\nBy tradition and law, Vatican Radio announces the pope's death: Sedes vacantes.\n( Sedes Vacantes : The seat of the Holy See is empty and it is referred to the death of the pope.)\nThe Interregnum begins. Cardinals start gathering in Rome.\n(Interregnum: The period between the death of pope and the election of a new pope.)\nDAY TWO\nBy tradition, the body of the pope is dressed in papal vestments and will be put on display at St. Peter's Basilica. Pilgrims will flock St. Peter's.\nMourning begins and by law must continue for 9 days (Novemdiales), ending on the 10th day after death. There will be a Mass on each day. (Novendiales: nine days of mourning.)\nDAY FOUR, FIVE or SIX\nBy law, a burial takes place. Tradition calls for popes to be buried in St. Peter's Basilica.\nDAY TEN\nBy tradition, big funeral Mass takes place at St. Peter's.\nDAY FIFTEEN (earliest possible date)\nBy law, conclave begins in the Sistine Chapel. On that morning, the cardinals will concelebrate the Votive Mass \"Pro Eligendo Papa.\"\nThe cardinals will determine where to hold the Mass; most likely it will be in St. Peter's Basilica.\nIn the afternoon they will start the conclave. In theory they can vote that afternoon.\nThe Voting\nThe cardinals will vote twice in the morning and twice in the afternoon.\nAt the end of each voting session, they will burn the ballots and send a signal to the world by the color of the smoke: BLACK FOR NO POPE AND WHITE FOR POPE. For the first time, pealing bells from St. Peter's will accompany the white smoke, so that there is no confusion. Voting can go on for days.\nAfter the New Pope Is Elected\nHe will come out St. Peter's Basilica main balcony.\nA cardinal will say the words \"Habemus Papa\" and will announce the new pope's name.\nBy tradition, anywhere between 30 minutes to one hour can pass between the white smoke and the appearance on the balcony. It is only when the cardinal announces the name that we'll know who he is.\nInauguration of the new pope will likely take place days after his election. He decides where and when to hold the Mass, although it probably will be at St. Peter's.", "url": "https://www.cnn.com/2013/11/07/world/papal-timeline-fast-facts/index.html"}