{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:21:18", "date_modify": "2020-05-04 16:21:18", "date_publish": "2013-04-29 18:18:50", "description": "Take a look at CNN's Fast Facts on Kobe Bryant to learn about the life of the former Los Angeles Laker, who played 20 seasons in the NBA.", "filename": "2013_04_29_us_kobe-bryant-fast-facts_index_1588609278.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/131206172206-unguarded-kobe-bryant-returns-00003502-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_04_29_us_kobe-bryant-fast-facts_index_1588609278.html", "title": "Kobe Bryant Fast Facts", "title_page": "Kobe Bryant Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the life of former NBA player Kobe Bryant, who played 20 seasons with the Los Angeles Lakers.\nPersonal\nBirth date: August 23, 1978\nDeath date: January 26, 2020\nBirth place: Philadelphia, Pennsylvania\nBirth name: Kobe Bean Bryant\nFather: Joe Bryant, a professional basketball player\nMother: Pam Bryant\nMarriage: Vanessa (Laine) Bryant (April 18, 2001-January 26, 2020, his death)\nChildren: Capri, June 2019; Bianka, December 2016; Gianna, May 2006-January 26, 2020; Natalia, January 2003\nOther Facts\nBryant was 6 feet, 6 inches tall.\nHis parents named him after a type of steak. The beef is from a species of cattle, Wagyu, raised in the Kobe region of Japan\nBryant lived in Italy for eight years while his father played in the Italian Professional Basketball League. Bryant spoke Italian fluently.\nNominated for one Academy Award and won.\nHe entered the NBA straight out of high school.\nIn 1996, Bryant was the youngest player in NBA history at that time, at 18 years, 2 months and 11 days.\nHe played his entire professional career for the Los Angeles Lakers.\nBryant won two Olympic gold medals for men's basketball.\nBryant is fourth on the NBA all-time scoring list.\nHe won five NBA championships.\nHe was posthumously elected into the Naismith Memorial Basketball Hall of Fame.\nTimeline\n1996 - Finishes his high school career as the all-time leading scorer in the history of southeastern Pennsylvania basketball. He leads the Lower Merion Aces to a season record of 31-3 and the Class-AAAA state championship.\n1996 - USA Today names Bryant the National High School Player of the Year and he wins the Naismith Player of the Year.\nJune 26, 1996 - Bryant is selected by the Charlotte Hornets as the 13th pick in the first round of the NBA draft.\nJuly 11, 1996 - Is traded by Charlotte to the Los Angeles Lakers for Vlade Divac.\n1996-2016 - Guard for the Los Angeles Lakers.\n1996-1997 - Is named to the NBA All-Rookie Second Team.\nFebruary 1997 - Wins the All-Star Weekend slam dunk competition, but does not play in the Wins the All-Star Weekend slam dunk competition, but does not play in the All-Star game.\n1998 - Bryant is the youngest starter, at 19, in his first All-Star game.\n2000-2002 - The LA Lakers win the NBA Championship three years in a row.\n2002 - First of four times being named All-Star MVP. He's also named in 2007, 2009 and 2011.\nJuly 18, 2003 - Bryant is charged with one count of sexual assault in a case involving a 19-year-old hotel worker. The charge accuses Bryant of \"sexual penetration or intrusion and (that) he caused submission of the victim through actual physical force,\" according to District Attorney Mark Hurlbert.\nJanuary 19, 2004 - McDonald's announces that it will not renew Bryant's endorsement contract, which expired in December 2003.\nAugust 10, 2004 - The same woman from the criminal case files a civil lawsuit in federal court in Denver. The woman, under the name of \"Jane Doe,\" claims Bryant raped her in his hotel room in a Vail-area resort in 2003 -- the same incident alleged in the criminal charge against him. The suit is for an unspecified amount of damages.\nSeptember 1, 2004 - The criminal sexual assault charge is dropped.\nJanuary 22, 2006 - Bryant scores 81 points in the Lakers' 122-104 win over Toronto. Only Wilt Chamberlain's 100-point game in 1962 tops this performance.\nMarch 2, 2005 - The accuser agrees to settle her civil lawsuit. The terms of the settlement have not been disclosed.\nMay 2008 - Wins the NBA regular season MVP award.\nAugust 24, 2008 - Bryant wins a gold medal at the Beijing Bryant wins a gold medal at the Beijing Olympics as a member of the US men's basketball team.\n2009-2010 - The Lakers win back-to-back NBA championships.\nJune 14, 2009 - Is named the Is named the NBA Finals MVP.\nFebruary 1, 2010 - Surpasses Jerry West's career record of 25,192 as the Los Angeles Lakers' all-time leading scorer, with 25,208 points.\nJune 17, 2010 - For the second year in a row is named the NBA Finals MVP.\nApril 13, 2011 - Bryant is fined $100,000 by the NBA for making an anti-gay slur at a referee during a game on April 12.\nDecember 16, 2011 - Vanessa Bryant files for divorce.\nAugust 12, 2012 - Is a member of gold medal-winning US men's basketball team at the 2012 London Olympics.\nJanuary 11, 2013 - Announces on Announces on Facebook he and Vanessa have reconciled.\nApril 12, 2013 - Tears his left Achilles tendon in game against Golden State Warriors. Successful surgery to repair the injury will leave him unable to play for six to nine months.\nMay 8, 2013 - Files a lawsuit to stop his mother, Pamela Bryant, from auctioning off memorabilia from the beginning of his basketball career. Bryant claims he did not give his mother permission to sell the items. A settlement is reached in June.\nDecember 8, 2013 - Bryant returns from his Achilles injury.\nDecember 17, 2013 - Breaks a bone in his left knee in a game against the Memphis Grizzlies and will be out for six weeks.\nMarch 12, 2014 - The Lakers announce that Bryant will not play the rest of the season, after team doctors determine the fractured lateral tibial plateau of his left knee has not healed.\nMarch 23, 2014 - Bryant launches Kobe Inc. He also announces the company's first investment is a 10% stake in the sports drink BodyArmor.\nOctober 28, 2014 - Bryant plays for the first time since December 2013, in the regular season opener.\nDecember 14, 2014 - Surpasses Surpasses Michael Jordan to become third on the NBA's all-time scoring list, with 32,310 career points.\nJanuary 28, 2015 - Undergoes surgery to repair his torn right rotator cuff and is expected to be out nine months.\nJuly 28, 2015 - Lakers Coach Byron Scott announces that Bryant may play a power forward position instead of his usual guard position, when he returns in October. Kobe has played the guard position since he was drafted by the Charlotte Hornets in 1996.\nOctober 4, 2015 - Makes his return in a preseason game against the Utah Jazz after undergoing season-ending surgery in January.\nNovember 29, 2015 - In a post on In a post on The Players' Tribune , announces he intends to retire at the end of the NBA season.\nFebruary 2016 - Bryant announces the launch of Granity Studios (formerly known as Kobe Studios), a multimedia original content company.\nApril 13, 2016 - , helping the Lakers defeat the Utah Jazz 101-96. Scores 60 points in his final game , helping the Lakers defeat the Utah Jazz 101-96.\nDecember 18, 2017 - , No. 8 and No. 24, during a ceremony at halftime. The Lakers retire Bryant's jersey numbers , No. 8 and No. 24, during a ceremony at halftime.\nApril 4, 2020 - Bryant is posthumously elected into the Naismith Memorial Basketball Hall of Fame.", "url": "https://www.cnn.com/2013/04/29/us/kobe-bryant-fast-facts/index.html"}