{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:15:44", "date_modify": "2020-05-04 16:15:44", "date_publish": "2013-07-30 21:51:02", "description": "View CNN's Fast Facts to learn about the Arab League, an organization of 22 Middle Eastern and African countries and the Palestine Liberation Organization (PLO).", "filename": "2013_07_30_world_meast_arab-league-fast-facts_index_1588608944.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/171119162223-arab-league-headquarters-1119-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_07_30_world_meast_arab-league-fast-facts_index_1588608944.html", "title": "Arab League Fast Facts", "title_page": "Arab League Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the Arab League , an organization of 22 Middle Eastern and African countries and the Palestine Liberation Organization (PLO).\nFacts\nAhmed Aboul Gheit of Egypt is the current secretary-general of the Arab League.\nThere are also four observer states: Eritrea, India, Brazil and Venezuela.\nThe Arab League's purpose, from the Pact of the League of Arab States, is to promote closer political, economic, cultural and social relations among the members.\nA council composed of representatives from the member states works together to settle disputes peacefully. The league has five major committees: political, economic, social and cultural, legal and Palestinian affairs.\nEach member has one vote on the council. Decisions are only binding to the states that have voted for them.\nTimeline\nSince 1945, 16 other members have joined - Libya (1953), Sudan (1956), Morocco (1958), Tunisia (1958), Kuwait (1961), Algeria (1962), Yemen (Aden, 1968), Bahrain (1971), Oman (1971), Qatar (1971), United Arab Emirates (1971), Mauritania (1973), Somalia (1974), the PLO (1976), Djibouti (1977) and Comoros (1993).\nApril 13, 1950 - League members sign an agreement on joint defense and economic cooperation.\n1959 - The league holds the first Arab petroleum congress.\n1964 - The league organizes the Arab League Education, Cultural and Scientific Organization (ALECSO).\n1976 - ARABSAT, an Arab communications satellite system, is formed.\nMarch 26, 1979 - Egypt signs a peace treaty with Israel. The league suspends Egypt's membership and transfers its headquarters from Cairo to Tunis, Tunisia.\n1989 - Egypt is re-admitted to the league; later the headquarters is moved back to Cairo.\n1990 - Yemen (Aden) and Yemen (Sanaa) unite as Yemen.\nAugust 1990 - The league is divided over the The league is divided over the invasion of Kuwait by Iraq. Members are split on a vote for a proposal to send Arab troops to join the troops defending Saudi Arabia from possible attack. Saudi Arabia, Egypt, Syria, Morocco, Qatar, Bahrain, Kuwait, the United Arab Emirates, Lebanon, Djibouti and Somalia endorse the presence of foreign troops in Saudi Arabia.\n2003 - All league members except Kuwait officially oppose a All league members except Kuwait officially oppose a US-led war against Iraq. However, some members in addition to Kuwait, including Bahrain and Qatar, allow their territory to be used.\nApril 23, 2006 - Arab League Spokesman Hisham Yusif announces that the organization has promised to transfer $50 million to the Hamas-governed Palestinian Authority. This is in reaction the United States and Arab League Spokesman Hisham Yusif announces that the organization has promised to transfer $50 million to the Hamas-governed Palestinian Authority. This is in reaction the United States and European Union cutting off direct funding to the Hamas-led government that assumed power March 30.\nFebruary 22, 2011 - The Arab League releases a statement saying it is suspending Libya's participation in Arab League meetings and all of the group's agencies. The statement also condemns what it calls crimes against protesters and peaceful strikers in Libya.\nMarch 3, 2011 - A summit scheduled for March 29 in Baghdad, Iraq, is postponed due to unrest in several Arab League countries.\nMarch 12, 2011 - The Arab League asks the The Arab League asks the UN Security Council to impose a no-fly zone over Libya.\nJuly 13, 2011 - Al-Araby visits Syria and meets with Al-Araby visits Syria and meets with President Bashar al-Assad\nNovember 12, 2011 - The Arab League suspends Syria's membership, effective November 16, 2011, in response to The Arab League suspends Syria's membership, effective November 16, 2011, in response to Syria's continued violence against its own citizens . 18 members vote in favor of the suspension, while Lebanon and Yemen vote no. Iraq abstains from voting.\nDecember 19, 2011 - Syria signs an Arab League proposal aimed at ending violence between government forces and protesters.\nDecember 26, 2011 - Members of an Arab League delegation arrive in Syria to monitor events on the ground.\nJanuary 28, 2012 - The Arab League suspends its mission in Syria as violence in the country continues.\nNovember 12, 2012 - State media reports that the Arab League has approved the resolution to recognize the new National Coalition Forces of the Syrian Revolution, which unites Syrian opposition factions.\nMarch 28-29, 2015 - The 26th Arab League Summit takes place in Sharm el-Sheikh, Egypt. All of the leaders agree to create a multi-national military force in order to combat threats to the Middle East.\nJuly 25, 2016 - The Arab League Summit is held in Nouakchott, Mauritania, but only seven leaders of the 22 member countries attend. The meetings focus on fighting terrorism and how to deal with other conflicts in the region.\nFebruary 24-25, 2019 - The first ever EU-Arab League summit is held in Sharm el-Sheikh, Egypt.", "url": "https://www.cnn.com/2013/07/30/world/meast/arab-league-fast-facts/index.html"}