{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:15:14", "date_modify": "2020-05-04 16:15:14", "date_publish": "2013-09-20 16:52:15", "description": "See CNN's Fast Facts for a look at the civil war that took place in Libya in 2011.", "filename": "2013_09_20_world_libya-civil-war-fast-facts_index_1588608914.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/111020122456-gaddafi-profile-picture-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_09_20_world_libya-civil-war-fast-facts_index_1588608914.html", "title": "Libya Civil War Fast Facts", "title_page": "Libya Civil War Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's some background information about the civil war that took place in Libya in 2011.\nTimeline\nPolice crack down on protesters as anti-government demonstrations take place in Benghazi. Within days, the protests spread to Tripoli and more than 200 people are killed amid the upheaval.\nGadhafi makes a defiant speech, vowing to die a martyr rather than step down.\n- The opposition movement announces that it has picked former Justice Minister Mustafa Abdul Jalil to lead The opposition movement announces that it has picked former Justice Minister Mustafa Abdul Jalil to lead a caretaker administration.\nMarch 5, 2011 - announces that it is studying a request to appoint Ali Abdussalam Treki as the nation's ambassador. The UN announces that it is studying a request to appoint Ali Abdussalam Treki as the nation's ambassador.\nMarch 13, 2011 - Secretary of State Hillary Clinton meets in Paris with Mahmoud Jibril, the leader of the opposition group, Transitional National Council.\nMarch 17, 2011 - The UN Security Council votes The UN Security Council votes to impose a no-fly zone over Libya and take \"all necessary measures\" to protect civilians.\nMarch 19, 2011 - aimed at enforcing the no-fly zone. More than 110 Tomahawk missiles fired from American and British ships and submarines hit about 20 Libyan air and missile defense targets. French, British and American military forces begin the first phase of Operation Odyssey Dawn, aimed at enforcing the no-fly zone. More than 110 Tomahawk missiles fired from American and British ships and submarines hit about 20 Libyan air and missile defense targets.\nMarch 20, 2011 - Gadhafi, speaking on Libyan state TV, says the UN charter provides for Libya's right to defend itself in a \"war zone.\" Weapons depots will be opened he says.\nMarch 24, 2011 - NATO agrees to take command of the mission, NATO agrees to take command of the mission, enforcing a no-fly zone over Libya.\nMarch 28, 2011 - President Obama addresses the President Obama addresses the American public on the situation in Libya. \"Tonight, I can report that we have stopped Gadhafi's deadly advance,\" Obama says. He declares that the United States will \"support the aspirations of the Libyan people\" as the \"military effort ratchets down.\"\nMarch 30, 2011 - Libyan Foreign Minister Moussa Koussa arrives in Great Britain and Libyan Foreign Minister Moussa Koussa arrives in Great Britain and announces that he has resigned his post.\nApril 4, 2011 - Foreign Minister Franco Frattini announces that Italy will become the third country, after France and Qatar, to recognize the rebel Libyan National Transitional Council as the legitimate international representative of Libya.\nApril 6, 2011 - A senior Obama administration officials announces that Gadhafi has sent the president a letter urging him to end the NATO bombing campaign.\nApril 30, 2011 - Gadhafi speaks on state TV and says he is ready to negotiate a ceasefire but that he will not step down.\nMay 18, 2011 - Four journalists are released by the Libyan military after spending several weeks in custody.\n- NATO extends its mission in Libya for another 90 days.\nJune 8-15, 2011 - Several countries, including the United States, Spain, Germany and Canada, recognize the opposition-led National Transitional Council as Libya's legitimate representative.\nAugust 11, 2011 - The Libyan Embassy in Washington reopens under the control of the National Transitional Council.\nAugust 21, 2011 - . A government spokesman says some 1,300 people have been killed and about 5,000 have been wounded in 12 hours of fighting. Rebels advance on Tripoli and capture two of Gadhafi's sons . A government spokesman says some 1,300 people have been killed and about 5,000 have been wounded in 12 hours of fighting.\nSeptember 1, 2011 - Britain and France begin releasing funds to the National Transitional Council that were frozen at the beginning of the crisis.\n- Russia recognizes the National Transitional Council as Libya's official government.\n- 60 countries meet in Paris to discuss Libya's transition from Gadhafi's rule to democracy.\nSeptember 24, 2011 - Jibril addresses the UN General Assembly.\nOctober 20, 2011 - Gadhafi is killed after being captured by rebel forces.", "url": "https://www.cnn.com/2013/09/20/world/libya-civil-war-fast-facts/index.html"}