{"authors": ["Elizabeth Humphrys", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:45", "date_modify": "2020-05-04 19:57:45", "date_publish": "2013-07-16 00:00:00", "description": null, "filename": "2013_07__1588622265.html", "image_url": "https://images.jacobinmag.com/2013/07/16233708/humphrys-2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_07__1588622265.html", "title": "Within or Against the State?", "title_page": "Within or Against the State?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Leo Panitch and Sam Gindin are, thankfully, far from followers of fashion. In a period when academics and public intellectuals extolled globalization as connoting the death of the nation state, they ensured a critical eye was trained, rather, on the neoliberal reorganization of the state. They acknowledge that although the nation state has been transformed since the end of the long boom, the idea that it has been usurped is wrong. Such positions, they contend, are based on the “mistaken notion that, in going global, capitalist markets were escaping, by-passing or diminishing the state.” While others envisioned multinationals as operating “free” of the impositions of state, Panitch and Gindin noted that capital “depend[s] on many states” in “maintaining property rights, overseeing contracts, stabilizing currencies, reproducing class relations and containing crisis.”\nThe Making of Global Capitalism begins with Panitch and Gindin outlining their conceptualization of the nature of the state. My contribution to this series is chiefly in response to this section and on how the authors conceive of the state in relation to class struggle. In referencing Marx’s only sketchy outlines of a theory of the state, they ground their analysis in the innovations of Nicos Poulantzas and Ralph Miliband. They argue that states, classes and markets have been mutually constituted by capitalism, but reject what they see as a tendency to analyze the state as derivative of abstract economic laws. Marx’s “conceptual categories,” they argue, were “developed to define the structural relationships and economic dynamics distinctive to capitalism” but can only be of significant value if they “guide an understanding of the choices made, and the specific institutions created, by specific historical actors.” “What states do in practice,” therefore, “and how well they do them, is the outcome of complex relations between societal and state actors, the balance of class forces, and, not least, the range and character of each state’s capacities.” States consequently develop distinct institutions and capabilities to facilitate successful accumulation, and to deal with actual and likely interruptions.\nIt is within this framework that they describe “the ‘relative autonomy’ of capitalist states: not as being unconnected to the capitalist classes, but rather as having autonomous capacities to act on behalf of the system as a whole.” They argue the state is a both a capitalist state (serving the interests of the ruling class) at the same time as functioning with relative autonomy from the immediate social relations of accumulation (meaning it is not the mechanical expression of patterns of accumulation). That is, what “states can autonomously do, or do in response to societal pressures, is ultimately limited by their dependence on the success of capital accumulation. It is above all in this sense that their autonomy is only relative.” Such an approach has been a long-term theme in Panitch’s work, and elsewhere he cites Poulantzas’ well-known formulation that the capitalist state, in the long run, can only correspond to the interests of the dominant class or classes.\nHow then do we explain the interdependence and relative autonomy of the state and production? For Panitch and Gindin the implication is that the state and accumulation are two different logics tied up with each other; that they are separate but interacting sets of social relations. Yet the nature of that correlation is left unclarified. While they note that the state’s function is to guarantee control to the ruling class in general, this does not tell us why this is the case specifically. The implication of this is important, as the question is central in developing strategies seeking to transform social relations.\nIn moving towards a better understanding of the capitalist state it is better, I would argue, to see the state and capitalist production as differentiated moments of the same set of social relations. In this it is useful to follow authors such as Simon Clarke and Colin Barker who argue we must start from what the mode of production is, and what are the ensemble of social relations that constitute it. In his critique of Poulantzas, but equally applicable to Panitch and Gindin’s thesis, Barker puts it this way: In doing their job, workers not only make things but surplus value, reproducing the relationships of control and exploitation. “The whole social order — relationships of family, state, science, education, etc. — should be understood as perpetually produced and reproduced elements made by real active individuals in their social interconnections.” Therefore in capitalist society, like other class societies, the struggle between classes is fundamental to comprehending how society is maintained and what the conditions are for its overthrow.\nFor Panitch and Gindin, as for Poulantzas and Miliband, the nature of the state is not derived from these fundamental social activities. The forms of activity of the exploited classes are not present as a central element of their theory of the state, and there is therefore a measurable distance between their analyses and that of Marx. For Marx, the state is not simply an expression of the will or interests of the ruling class (be that of a fraction or of capital in general) but an integral part of capitalist social relations understood in their entirety.\nMarx himself attended to this connection (between the immediate conditions of production in any given society and the nature of the entire set of social relations that arise from them) in a passage in the third volume of Capital : “The specific economic form, in which unpaid surplus-labor is pumped out of direct producers, determines the relationship of rulers and ruled, as it grows directly out of production itself and, in turn, reacts upon it as a determining element.” The basic form of the state, as well as that of other social institutions, rests on these fundamental relationships, even if the unique features of any given society mean that there are “infinite variations and gradations in appearance, which can be ascertained only by analysis of the empirically given circumstances.” Put another way, in the Grundrisse , Marx writes of “the concentration of the whole in the state.”\nIn separating state analysis from the commodity form and the capital relation, Panitch and Gindin are unable to explain why the state takes the form it does in contemporary capitalism. The focus on how the state apparatus authors change obscures rather than clarifies, as it does not tell us how and through what processes such changes come about. Such an approach argues that actions of the state are both relatively autonomous from accumulation and the result of bourgeois political dominance over it — in effect an amalgam of aspects of Poulantzas and Miliband.\nPanitch and Gindin’s conclusion is that the state needs to be transformed politically if it is to function to reflect a different balance of class forces (or to act for different class interests). This leads them to paint class struggle outside the state as economistic, and to treat political and economic power as separate. They have a tendency to read the balance of class forces in the post-WWII era off the composition of state policies, rather than through the balance of forces outside the state. Hence the long boom decades are portrayed as a time of working class strength because Keynesian policy was in operation. Yet a closer examination reveals that in many countries sectional working class strength during significant parts of this period was weak and key sectors of the working class were on the back foot (for example in US, France and Australia from soon after the end of the war until the late 1960s). On the other hand, the neoliberal period is seen as one of stability of capitalist class power because states have been able to implement anti-working class policies and to globalize markets. Domestic and international tensions in the neoliberal project are downplayed because the policies of neoliberal globalization, along with their associated state bureaucrats, are dominant. For example, the US debt ceiling debate is dismissed as an irrational political game rather than as a reflection (albeit in a distorted way) of real tensions between individual capitalist interests and state attempts to stabilize US capitalism — let alone its international relations.\nThis leaves Panitch and Gindin’s account of what constitutes the political — which is their central concern — relatively insulated from the pressure of the balance of class forces outside the state. This becomes especially clear in the conclusion to the book where they argue that “today’s revived demands for social justice and genuine democracy [can] only be realized through . . . a fundamental shift of political power, entailing fundamental changes in state as well as class structures. This would need to begin with turning the financial institutions that are the life-blood of global capitalism into public utilities that would facilitate, within each state, the democratization of the decisions that govern investment and employment.” Such a perspective — of a series of dramatic transitions in the existing policies, functions and responsibilities of states needing to occur prior to genuine democratization being possible — seems to bear little connection to the wider structures of social class forces where capital remains dominant over labor. Consequently, the ability of collective agency to transform societies from below seems to rest on somehow converting states that remain impervious to democratic transformation. It is not clear how Panitch and Gindin intend to resolve this paradox.\nBy instead seeing states as a concentrated subset of capitalist social relations, a quite different perspective emerges. The more likely path to social transformation would be a heightening of class struggle against the operations of states, institutions less and less able to effectively manage that resistance. This does not rule out transient attempts to accommodate some hostile class demands within state policies. However, to imagine that prior to any break with capitalism there will necessarily be transitional progressive regimes of governance — reflecting shifting political balances of class forces — is misplaced. Panitch and Gindin are correct to locate the focus of political class struggle as the capitalist state, but they are mistaken in presuming that the resolution of that class struggle will occur within that state. That is, they see the state as the most important field within which the class struggle is waged, rather than starting from an acknowledgement that the capitalist state, the most concentrated form of social relations of capitalist domination, cannot be transformed to deliver the very different world we all agree is urgently required.", "url": "https://jacobinmag.com/2013/07/within-or-against-the-state/"}