{"authors": ["Dick Bryan", "Mike Rafferty", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic"], "date_download": "2020-05-04 19:57:50", "date_modify": "2020-05-04 19:57:50", "date_publish": "2013-07-16 00:00:00", "description": null, "filename": "2013_07__1588622270.html", "image_url": "https://images.jacobinmag.com/2013/07/16233715/bryan_rafferty-2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_07__1588622270.html", "title": "An Empire of Our Lives", "title_page": "An Empire of Our Lives", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "We have here a commanding study of over 150 years of the evolution of global capitalism, increasingly under the auspices of the US state. This is an encyclopedic work, and for those who lack background, all the significant turns are addressed and pieced together, in an integrated and readable way. For those more familiar with various debates about global capitalism, Panitch and Gindin can be seen to be presenting a path through the debates. Their work is “light touch” on theory, and so wins its audience by writing a compelling history, without claims to (or for or against) theoretical orthodoxy.\nThis is, we believe, a refreshing way of writing, for we observe on the Left too many interpretations of recent history that are driven by defending orthodoxies (be they Keynesian, or generally social democratic, or Marxist, or of particular Marxisms). One of the challenges of the recent financial crisis, and indeed the financial transformations of which it was an expression, is to ask whether our conventional ways of framing industrial capitalism still hold. Can we usefully think of the global financial crisis through the theory of the tendency for the rate of profit to fall? Are more state expenditure and/or more state “regulation” a way to reflate capital accumulation? We would like to think that the answer to these sorts of questions is not pre-determined, for in the challenges to conventional understandings new interpretations generate new angles of political engagement.\nSo because economic formalism is absent from this book, the issue of which orthodoxies are to be defended and which transformed or ditched does not directly arise. In many ways, and pleasingly so, this means that it can be read as a statement to be evaluated “on its merits.” But, at the risk of drawing Panitch and Gindin back to conventional debates that they have avoided, there are two big questions that we want to pose which do take, or are in danger of taking, their analysis back into those conventional debates, although we hope not to engage it dogmatically.\nFirst is the concept of American empire, and how useful an organizing category it is. The second relates to the politics that opens up from their analysis.\nThe first is not intended as a broadside, but actually a concession. Our initial view (Dick’s especially) was that the fixation with American empire was just a problem of Canadians living too close to the border (and recognizable to a couple of Australians who lived in the culture of a British colony). We have been persuaded by the broad argument that the Panitch-and-Gindin framing of the US empire, as a hegemonic nation state securing and serving global agendas, is indeed an effective heuristic device for understanding some key historical and economic turns. It provides a coherent and powerful analysis, which draws us through the nineteenth and twentieth centuries. But this leads to two questions: what are its limits, and does it still work?\nThose questions could no doubt have been asked in the 1970s, with the combination of the (so-called) “deindustrialization” of the US and the devaluation of the US dollar that collapsed the Bretton Woods Agreement. Panitch and Gindin were saying it wasn’t the end, but a globalization of the US state, and their call was a good one, as the 1980s and 1990s showed. But in the world of global finance and a financial crisis, we again need to ask the question, and to get the framing of the question right.\nThe question is not “have we seen the end of US empire?” for in their terms clearly not — whether it is measured by volumes and values of financial transactions, or the role of the dollar, or the amount of bailout money the US state has put on the table. It is a more subtly turned question. With the rise of globally-integrated and liquid financial markets, in which the US state remains a predominant player, how do we cast the changing foundations of empire, and what is the changing basis on which US empire is being reproduced?\nWe aren’t sure Panitch and Gindin are quite clear here. On the one hand, there is the depiction of a global state project, which has long been their argument. Yet the analysis in The Making of Global Capitalism does seem surprisingly nation-centered. It is important to the authors that the crisis started in the US and was a product of US market and regulatory processes, and that the regulatory debates are US-centered. Of itself, this focus is not unreasonable — it is “true” — but it does then pose the question of how we interpret it as an expression of already-globalized US capitalism. If it has already globalized, why does it re-appear as national-centered in the context of crisis explanations?\nThe question is, of course, not innocent. We would contend that what is somewhat missing in the analysis of the last 30 years is in the realm of finance. The book is indeed comprehensive in its engagement with the growth of financial aggregates, and with international capital flows, etc. But finance appears as something that gets bigger (sort of in the way that secondary industry gets smaller). But as well as getting bigger, how does it change the momentums of accumulation; how does it load different pressures on the US state globally, and, in the context of crisis, how does it create new challenges for the US state to reconcile domestic with global agendas? In short, how is US hegemony changed, even as it is played out via finance, and what new tensions/contradictions for US hegemony (and for capital) does this open up?\nThe second question of a politics follows somewhat from these issues above. Referring back to the distancing of Panitch and Gindin from the orthodox debates, we similarly observe that theirs is not a story of the crushing of a working class, and its need to rise in resistance. Indeed, class is largely absent as an organizing category. We are not critical or this, for in many ways a critical issue on the table is how we re-think class in the era of finance, and the answer is unlikely to simply confirm the analytical or political standing of an “industrial working class,” or even perhaps a working class “in production.” Indeed, as Panitch and Gindin note, labor’s resistance has refused to be neatly contained, and the rise of labor’s role in capitalism as more than simply an input into production predates the moving assembly line associated with Henry Ford’s Michigan car factory in the early 1900s.\nPerhaps then, thinking about the recent role of labor in risk transfer and of finance in providing products to facilitate that transfer, an alternative is to write in terms of a world of “ordinary people” who are also now getting screwed by malevolent bankers and gutless bureaucrats. But Panitch and Gindin explicitly resist this framing, for there are structural, or at least systemic drivers that need attention – beyond class as production relation alone, to subjectivities across the circuit of capital. So how do we think in aggregate about these people whose lives are being re-structured and re-arranged by the transformations of financialization and American empire? What, in short, would Panitch and Gindin nominate as the new conception of a “working class,” and how is its depiction seen to be framed by the transformations set out in this book?\nIf we turn for instance to Sam Gindin’s analysis, documented in many forms and forums, about the decomposition of organized labor, it would be interesting to learn how both financialization and empire have contributed to that process, and therefore what space is constituted by those processes to force open a different political agenda for labor? And for Leo Panitch, who has written and spoken widely on the need to challenge finance by turning banks (back) into utilities, is this informed by a politics to “de-commodify” working class consumption or exposure to finance, or is it to challenge the elitism and undemocratic constitution of finance? In other words, if utility banking is constituted as a transitional demand, how does it challenge the risk shifting to labor that seeks to capitalize literally on more and more aspects of working class life, from education and health care, to retirement and utility bills? How would utility banking get labor out of a further deepening of the integration of the US (and indeed global) working class into capital? More ambitiously, how would utility banking constitute the beginnings of a challenge to capital as a system that exerts an empire over our lives?\nWe would like to hear Panitch and Gindin talk about how their analysis impacts on their political vision — both within the scope of the book, and personally. These are two people who have made incredibly important interventions into Marxist scholarship and also extraordinary and profound commitments to the cause of social change “on the ground.” It would be fascinating to hear from them collectively, and perhaps individually, how they approach their politics differently as a result of the things they have clarified to themselves, as well as to the rest of us, in this outstanding book.", "url": "https://jacobinmag.com/2013/07/an-empire-of-our-lives/"}