{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:57:32", "date_modify": "2020-05-04 16:57:32", "date_publish": "2013-02-22 19:14:21", "description": "Read CNN's Fast Facts about John Paul Stevens, and learn more about the late Supreme Court justice.", "filename": "2013_02_22_us_john-paul-stevens-fast-facts_index_1588611452.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/111002074552-justice-john-stevens-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_02_22_us_john-paul-stevens-fast-facts_index_1588611452.html", "title": "John Paul Stevens Fast Facts", "title_page": "John Paul Stevens Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Here's a look at the life of the late US Supreme Court Justice John Paul Stevens.\nPersonal\nBirth date: April 20, 1920\nDeath date: July 16, 2019\nBirth place: Chicago, Illinois\nBirth name: John Paul Stevens\nFather: Ernest James Stevens, hotelier\nMother: Elizabeth (Street) Stevens\nMarriages: Maryan (Mulholland) Stevens (December 1979-August 7, 2015, her death); Elizabeth Jane (Sheeren) Stevens (June 7, 1942-1979, divorced)\nChildren: with Elizabeth Jane (Sheeren) Stevens: John Joseph (died in 1996), Kathryn, Elizabeth, Susan\nEducation: University of Chicago, A.B., 1941; Northwestern University School of Law, J.D., 1947\nMilitary Service: US Navy, 1942-1945, awarded the Bronze Star\nOther Facts\nStated he regretted one vote, his 1976 opinion to uphold the death penalty in Gregg v. Georgia.\nWas partial to bow ties and enjoyed flying, competitive bridge and tennis.\nLongtime Chicago Cubs fan.\nWas the last Supreme Court nominee to be confirmed without televised hearings.\nA lifelong Republican, but was considered liberal in his judicial rulings.\nTimeline\n1947-1948 - Law clerk to US Supreme Court Justice Wiley Rutledge.\n1949 - Admitted to the Illinois Bar.\n1949-1952 - Associate at Poppenhusen, Johnston, Thompson and Raymond.\n1951 - Associate counsel for the Subcommittee on the Study of Monopoly Power of the Judiciary Committee of the US House of Representatives.\n1952-1970 - Partner at Rothschild, Stevens, Barry and Myers.\n1953-1955 - Member of the National Committee to Study Antitrust Laws.\n1969 - Appointed chief counsel to the special commission to investigate the integrity of the judgment of People v. Isaacs, Illinois Supreme Court.\n1970-1975 - Judge of the US Court of Appeals for the Seventh Circuit.\nDecember 19, 1975 - Is sworn in to the Supreme Court, appointed by Is sworn in to the Supreme Court, appointed by President Gerald Ford.\nDecember 12, 2000 - Writes the dissenting opinion in Writes the dissenting opinion in Bush v. Gore.\nApril 9, 2010 - Stevens' retirement is announced and becomes effective June 29, 2010.\nMay 29, 2012 - Receives the Presidential Medal of Freedom from Receives the Presidential Medal of Freedom from President Barack Obama\n2014 - His book, \"Six Amendments: How and Why We Should Change the Constitution,\" is published. The book addresses the anti-commandeering rule, political gerrymandering, campaign finance, sovereign immunity, the death penalty and the second amendment.\nMay 4, 2015 - Speaking before a meeting of the group Lawyers for Civil Justice in Washington, Stevens says that some Guantánamo Bay detainees should be given reparations because Speaking before a meeting of the group Lawyers for Civil Justice in Washington, Stevens says that some Guantánamo Bay detainees should be given reparations because \"detainees who have been deemed not a security threat to the United States and have thereafter remained in custody for years are differently situated.\"\nMarch 27, 2018 - published in Writes in an op-ed published in The New York Times that students and others demonstrating for gun control should seek a repeal of the Second Amendment. This \"would do more to weaken the NRA's ability to stymie legislative debate and block constructive gun control legislation than any other available option,\" he writes.", "url": "https://www.cnn.com/2013/02/22/us/john-paul-stevens-fast-facts/index.html"}