{"authors": ["Martijn Konings", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:42", "date_modify": "2020-05-04 19:57:42", "date_publish": "2013-07-16 00:00:00", "description": null, "filename": "2013_07__1588622262.html", "image_url": "https://images.jacobinmag.com/2013/07/16233734/konings-2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_07__1588622262.html", "title": "Democratic Empire", "title_page": "Democratic Empire", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The start of the current wave of left-wing theorizing about imperialism was marked by the turn-of-the-century publication of Michael Hardt and Antonio Negri’s Empire , which re-described the dynamics of what had until then mostly been known as “globalization” in terms of the imperial logic of network power. In their review of that work, Leo Panitch and Sam Gindin expressed a mixture of admiration and frustration: while fully acknowledging Hardt and Negri’s essential insights into the imperial nature of global capitalism and the central role of American institutions in fostering that process, they also voiced considerable doubt about the specifics of the interpretation — above all the paradoxical statements about the role of labor in shaping and resisting imperialism and the lack of attention to the ongoing role of the American state in managing the empire it has spawned.\nThey traced these problems to a somewhat indulgent reliance on autonomist theory and the absence of a rigorous political economy framework. What remained to be done, they argued, was to analyze “the actual extent to which the American state has transformed itself so as to be able to act as the global state that global capitalism needs to keep order, to manage crises, and to close contradictions among the world nation-states and the diverse social forces that compose them.”\nPanitch and Gindin have now produced that analysis themselves. For the purposes of this discussion, the argument of The Making of Global Capitalism can be telegraphed as follows. Contrary to common wisdom, globalization did not begin in the 1970s as international markets undermined a system of state-centered order. Instead, global capitalism was made, over the course of the twentieth century, through the penetration of distinctly American institutions and practices into the social, political and economic fabric of other nations. And this imperial system continues to be overseen by a configuration of states that pivots on the role of the US state, which acts to manage the contradictions and tensions that attend the dynamism of ongoing economic expansion.\nThis interpretive template is extremely productive as a way of reading history, and many historical facts that do not fit with conventional approaches find a coherent place in their monumental narrative. In this way, they offer a fundamental challenge to mainstream political economy scholarship and the progressive-liberal perspectives and affinities that dominate the field. Key among the objects of their criticism is the pervasive conviction that during the past four decades we have been living in an age of American decline. One of the most innovative and important conceptual instruments that Panitch and Gindin employ in countering the thesis of decline is the distinction between “failure containment” and “failure prevention,” which is explicated only on a few occasions but plays a role throughout the book. Mainstream scholarship sees the occurrence of crises as indicating fissures in the construct of American power, and announcing the final blow to American power has accordingly become a favorite pastime for progressive scholars (with no amount of accumulated embarrassment ever sufficing to motivate a redirection of scholarly energies). The Making of Global Capitalism argues that the American state has long come to accept that periodic crises will continue to accompany economic dynamism, and that it has increasingly reconceived its task in terms of the containment and distribution of the effects of crises.\nSimilar themes have been deployed by other authors in order to account for the resiliency that American and global capitalism have displayed in the face of the tremendous volatility of the past decades. The significance of neoliberalism lies not in the retreat of state power, but, as Melinda Cooper has argued, in the growing ability of institutions to recognize that capitalism’s systemic dynamics are governed by a paradoxical logic, characterized by sources of order that remain invisible from a perspective that understands it as a linear and predictable process. For mainstream scholars of economic globalization, such arguments amount to little more than metaphysical speculation. But, ironically, this is no longer the case for many policymakers, as insights regarding complexity and system topology are nowadays part of the policy repertoire of key American state institutions such as the Federal Reserve. The exposition in The Making of Global Capitalism offers the most penetrating and historically concrete analysis of this shift in governance that we will have for some time to come. It traces the emergence of a containment regime in historical terms, never assuming implausible degrees of foresight but nonetheless taking seriously the ability of policymaking institutions to pragmatically learn through their interaction with the system they regulate and to deploy sources of order that may not be apparent to a positivist mindset.\nIn that sense, The Making of Global Capitalism can be read as manifesting a particular way of articulating theory and history. Panitch and Gindin came of intellectual age during a time when theoretical debates about the nature of the capitalist state were prominent. The question at the heart of these debates was how to understand the state’s relative autonomy, that is, how to conceive of the state’s institutional separation from the economy as an internal differentiation within capitalist society. Approaches that have continued to grapple with this problem at a purely theoretical level have become increasingly arid and scholastic. But intractable as the problem was on a formal conceptual level, its practical relevance only increased with the turn to neoliberalism — which is, after all, an intensely paradoxical political enterprise that effects transformations at the heart of economic life by projecting the image of a rigorous separation between state and economy. Leaving behind the formalism of state theory, The Making of Global Capitalism thinks relative autonomy in historical terms, demonstrating how the capacity for political agency emerges from within, and remains throughout tethered to, the capitalist organization of social life.\nIn this way, the book dispels the myth that contemporary neoliberalism somehow represents a weakening of governance and statehood. Of course, the myth of decline will endure even after its demolition by this book. While The Making of Global Capitalism will no doubt become a classic among critical scholars, in more mainstream circles it may well meet with the kind of polite acknowledgement meant to cover up non-engagement. In an important sense, the book can be seen to be both too theoretical and too historical to be palatable to mainstream social science. In mainstream scholarship, the malaise of progressive thought is apparent in its relentless commitment to “mid-range theory,” code for an aversion to both theorizing and historicizing. Theoretical writing is dumbed down to undemanding analytics and eclectic classification, and historical writing reduced to case studies that serve as a “testing ground” for contrived analytical puzzles. The conceptualization of history is geared not to critically clarifying the practical but often unseen investments that regulate our present and shape our future, but precisely to the production of stylized periodizations and characterizations that serve to legitimate existing political imaginaries, steeped in a nostalgic longing for the civilized capitalism of the post-New Deal and Bretton Woods era.\nI am highlighting the tenacity of the myth of decline to suggest a particular perspective on the practical discursive role of this theme that is perhaps not given sufficient play in the book. The image of decline, after all, is at the heart of the American republican tradition, which is always appalled by the social and political institutions it encounters but forever sees this as the corruption of an authentic republic. The notion of decline, in other words, has historically been a key discursive and emotional style of the American political character. Over the past decades, the legacy of the republican jeremiad has been most effectively appropriated by neoliberal and neoconservative discourses, which have been highly successful in depicting the New Deal institutions as sources of corruption. And seen from this angle, the embrace of decline theory by progressives is deeply ironic: it appears as an unconsidered defensive move, an unexamined turn to a familiar political style that fails to discern the valences that this trope has accrued or to grasp the current pragmatics of its political use. And this is of course hardly an academic observation: it is what accounts for the overwhelming moralism of contemporary progressivism, always lamenting developments that it is unable to relate to in critically productive ways.\nIf we situate progressive talk of decline in this way, it appears not just as a problematic theory but as a key ingredient of the nostalgic style of the American polity, a particularly unreflexive manifestation of the sentimentality of American democratic culture. Of course, one of the central points of The Making of Global Capitalism is that progressive discourses, far from offering a counterweight to the more overtly imperial designs of neoconservatives, play a central role in the production and management of empire. American imperialism is made as much through the more or less levelheaded stewardship of Democratic administrations as through the military adventures of Rumsfeldian hawks. Panitch and Gindin offer a particularly penetrating reading of progressivism’s historical role in their analysis of how it promoted the integration of the American population into the American financial system, and how this development subsequently became an important driver of imperial expansion. The dynamic at work here was fostered and governed as much by Clinton and Obama as by Reagan and Bush.\nBut we may still ask if this fully captures the interplay of democracy and capitalism or the alliance of republicanism and empire. Whereas the early part of the book identifies the alliance with republican self-governance as central to the making of American empire, towards the end the image is more that of an American state learning to govern a system of extraordinary complexity without needing to spend too many of its resources securing domestic consent or acquiescence. Perhaps one way of phrasing this is that Panitch and Gindin see the paradoxical complexity of network power fully at work in the relation between state and economy, but put some brackets around this when it comes to the dynamics of state and democratic legitimation. When they describe the turn to monetarism or the current rise of austerity politics, they put considerable emphasis on the ability of political and financial elites to sideline or bypass democratic processes.\nThis does not do sufficient justice to the fact that, as some important recent historical studies have shown, the neoconservative backlash against the New Deal enjoyed considerable democratic support and grassroots credentials. And these populist impulses have been on full display with the rise of the austerity movement in the aftermath of the financial crisis. Taken by themselves, these points might just be taken to mean that the problem of legitimation is a less rather than more pressing problem for the American state. But here we should remind ourselves that no group or organization has come closer to shutting down global capital markets than the Tea Party movement (when, at the end of 2011, it forced its political representatives to resist a political deal to raise the debt ceiling of the American government). The point, then, is that there are no sure-fire ways of governing the republican imaginary and the popular sentiment it provokes.\nThis is where we might see some continued relevance for those aspects of Hardt and Negri’s take on empire that Panitch and Gindin are most critical of. If there is something frustratingly ambiguous about their claim that the laboring multitude is the immanent cause of both imperial order and its disruption, perhaps this reflects above all the fact that the practical sources of imperial order are highly paradoxical — not easy to grasp in functional terms but to do with contemporary capitalism’s communicative and affective properties and the curious ways in which they often appear to incorporate even the most serious challenges and dysfunctionalities into its orbit.\nIf the present-day American political debate is hard to watch without being impressed by its sheer banality, we should still be able to account for the fact that the “attention economy” it stages and the energies this generates are extraordinarily effective as a means of political and cultural integration. Here progressive discourses play an absolutely central role. After all, in the contemporary republican imaginary it is the progressive-liberal character — whether in the guise of lazy dependency or patrician condescension — that figures as the embodiment of moral corruption, all that stands between the degenerate present and a redemptive republicanism. Responding to each political setback with ill-directed moralistic judgment (in the style of “What’s the matter with Kansas?”), progressivism performs a part in a play that is authored and shaped by forces that it cannot productively relate to and on which its narratives provide little grip. In this way, it unwittingly participates in an attention economy that transforms multitudinous energies into the distinctive sentimentality of an imperial democracy.\nOne of the main political implications of Panitch and Gindin’s analysis is that any viable project of anti-imperial resistance will require the transformation of states and above all the American state. This should probably begin with an acute awareness that the politics of social democracy no longer have anything to offer and that progressive liberalism has become one of the most serious obstacles to meaningful resistance. If this merely rehearses one of their own arguments, it is meant to emphasize that an explicit reconsideration of the paradoxical intersection of empire and democracy in the contemporary era is a precondition to developing our practical capacities for attenuating the suction power of institutional politics.\nThe disconcerting recent turn by left-wing intellectuals to a new Leninist vanguardism (with Slavoj Zizek urging the left to show the same disdain for democratic procedures as Margaret Thatcher did during her reign) underlines the difficulty of imagining viable ways out of the antinomies of present-day democratic culture. It would certainly be unreasonable to suggest that Panitch and Gindin should have resolved this problematic in what is already a tremendously expansive book, and as such these reflections are intended not as a criticism of what they have written but as a request for more.", "url": "https://jacobinmag.com/2013/07/democratic-empire/"}