{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:52:42", "date_modify": "2020-05-04 16:52:42", "date_publish": "2013-07-26 22:59:43", "description": "Read CNN's Fast Facts on the Kyoto Protocol, an agreement reached in Japan in 1997, mandating that industrialized nations cut their greenhouse gas emissions.", "filename": "2013_07_26_world_kyoto-protocol-fast-facts_index_1588611162.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/151119141537-climate-change-tease-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_07_26_world_kyoto-protocol-fast-facts_index_1588611162.html", "title": "Kyoto Protocol Fast Facts", "title_page": "Kyoto Protocol Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the Kyoto Protocol, an agreement reached in Kyoto, Japan , in 1997, mandating that industrialized nations cut their greenhouse gas emissions.\nFacts\n192 parties have ratified the protocol ( 191 states and one regional economic integration organization ). The United States has not; it dropped out in 2001.\nThe protocol mandated that 37 industrialized nations plus the European Community cut their greenhouse gas emissions. Developing nations were asked to voluntarily comply.\nMore than 100 developing countries, including China and India, were exempted from the treaty.\nThe treaty could not go into effect until at least 55 countries, accounting for 55% of the world's emissions in 1990, ratified it.\nThe signatories agreed to cut their country's emissions to 5% below 1990 levels between 2008 and 2012.\nThe treaty also established an international trading system, which allows countries to earn credits toward their emission target by investing in emission cleanups outside their own country.\nAccording to the Global Carbon Atlas, the largest contributors of greenhouse gases in 2018 were China and the United States.\nTimeline\nDecember 1-11, 1997 - The Conference of the Parties to the United Nations Framework Convention on Climate Change (UNFCCC) is held in Kyoto, Japan. More than 150 nations attend and adopt the first international treaty on controlling and reducing greenhouse gases.\nNovember 2, 1998 - In Buenos Aires 160 nations meet to work out details of the protocol and create the \"Buenos Aires Action Plan.\"\nJuly 23, 2001 - Negotiators from 178 countries meet in Bonn, Germany, and agree to adopt the protocol. The United States doesn't participate.\nNovember 10, 2001 - Representatives from 160 countries meet in Marrakech, Morocco, to further work out details of the protocol.\nNovember 18, 2004 - ratifies the protocol, giving new hope that it can be implemented, even without the United States. The Russian Federation ratifies the protocol, giving new hope that it can be implemented, even without the United States.\nFebruary 16, 2005 - The Kyoto Protocol takes effect.\nDecember 12, 2011 - Canada officially renounces the Kyoto Protocol. Environment Minister Peter Kent says Kyoto's goals are unworkable because the United States and China never agreed to Kyoto, and that a new pact is needed to address emissions.\nJune 23, 2013 - Afghanistan adopts the Kyoto Protocol, becoming the 192nd participant.", "url": "https://www.cnn.com/2013/07/26/world/kyoto-protocol-fast-facts/index.html"}