{"authors": ["Göran Therborn", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:44", "date_modify": "2020-05-04 19:57:44", "date_publish": "2013-07-16 00:00:00", "description": null, "filename": "2013_07__1588622264.html", "image_url": "https://images.jacobinmag.com/2013/07/16233711/therborn-2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_07__1588622264.html", "title": "Global Capitalism in One Country?", "title_page": "Global Capitalism in One Country?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Leo Panitch and Sam Gindin’s The Making of Global Capitalism is a landmark study of the construction and the evolution of the American capitalist empire. To my knowledge, it is the best in existence, wide-ranging in time as well as in space, perceptive, deeply informed, and sophisticatedly nuanced in its analyses.\nIts analytical focus is “globalization and the state,” and its main general theoretical argument is that “states need to be placed at the center of the search for an explanation of the making of global capitalism.” This is, of course, a deliberately provocative statement, thrown into the face of the mainstream globalization discourse of the past quarter of a century, on the left as well as on the right. It is a very welcome re-focusing of our lenses, which I basically sympathize with. Apart from trying to convey to my Cambridge students the still crucial importance of nation-states in current world society, I have found reason to take issue with the “global cities” conception of a few cities “commanding” the world economy, increasingly detached from their state hinterlands.\nHowever, there are some basic problems hidden in the Panitch-Gindin formulation. The first one is the meaning of “global capitalism,” i.e., the explanandum. It is nowhere defined and dated in the book, which makes any explanation of it rather foggy. The authors imply its emergence in the nineteenth century, as its first great crisis is located in the 1870s. But just two lines before that, on the same page (331), we are told that it took American capitalism and the American state “to make global capitalism a reality,” which points to some later date. And another few lines upwards on the same page, we are referred to the Communist Manifesto but then informed that it was only by the beginning of the twenty-first century that capitalist social relations had spread “over the entire surface of the globe.”\nI think their central conceptual fuzziness reveals that the authors have not really thought through what kind of book they wanted to write. There is also a strange lacuna in this amply footnoted work. There is no mention at all of world system analysis, and of its pioneering author, Immanuel Wallerstein. The systemic analyses of Wallerstein and his followers may be criticized, may even be held surpassed, but they cannot seriously be ignored. After the Marxist classics of the three quarters of a century up to World War I, Wallerstein’s work was the beacon of critical studies of global capitalism.\nThe formulation of placing “states . . . at the center of the search for an explanation of the making of global capitalism” (emphasis added) is unfortunately elliptic in another way. Although the authors obviously do not mean it, their formulation as such leaves out the dynamics of capital and its interaction with states. On the other hand, whereas the general theoretical statement refers to “states” in plural, the book is actually almost exclusively about one state, the USA.\nPanitch and Gindin have written a magnificent book about the American empire, interweaving analyses of US capitalism, of US state capacity development, US domestic politics, and US economic diplomacy, and highlighting the successful exports of American corporate institutions and American business law. They also make a convincing argument against the theorists of American economic decline. American corporations have a global dominance in the new “ ‘commanding heights’ of global capital accumulation,” from the high-tech of aerospace, computers, and healthcare equipment, to the management of consumption and debt, to retailing, finance, and business services.\nThe contribution of their book is stated in its subtitle, “the Political Economy of American Empire.” Because of the centrality of the USA, it is at the same time a major contribution to our understanding of contemporary global capitalism. But it is not a full-scale study of the “Making of Global Capitalism,” and from the uncertain theoretical formulations by two such experienced and theoretically well-formed authors, it may be suspected that the authors had not really intended to explain the making of global capitalism.\nOnce upon a time, there was a debate about whether socialism could be built in one country. It was concluded by force rather than by any Habermasian communicative action, but a good historian’s verdict might be that something important was indeed built — to be erased later — though something not identical to the Marxian notion of socialism. Now, Panitch and Gindin are arguing that global capitalism was built in and from one country. Again, we have in front of us an important historical construction which does not quite measure up to its own ideals.\nThe methodological point is that you cannot adequately understand and explain a totality, or a globality, from one of its parts, even if that part is the domineering one. To explain “how global capitalism came about” is a formidable task, and if Panitch and Gindin had embarked on it seriously they would not have been able to provide us now with their timely book on the American empire.\nSuch a task would have to start by engaging with the works of Fernand Braudel and Immanuel Wallerstein, and with the debate about the divergence of Asia and Europe — with K. N. Chaudhuri, Prasannan Patthasarathi, Kenneth Pomeranz and others. In recent times, it would have to come to grips with the ultimate failures of the Communist revolutions and with the limitations of the North Atlantic working-class movement, which did “march forward” for about a century. Making states central to explaining global capitalism must involve analyzing what happened in and to the state of the Soviet Union and of China. And all over the world, global capitalism is varying with state and societal forms, from the organized, strongly unionized Scandinavian welfare states to the free-wheeling chaos of Nigeria, or from the socially cohesive national development states of Japan and South Korea, to the social abyss separating the stunted lives of the poor in India from capitalist privilege.\nWith their US-state-centered focus Panitch and Gindin devote rather little space and effort to class conflict, although they certainly do not ignore it. And they may be somewhat too pessimistic, particularly in a global perspective, in their conclusion that “individualized consumerism” “became the main legacy of working-class struggles in the twentieth century.” They are likely to be right in assuming that the coming anti-capitalist struggles will require “very different movements and parties” from the socialist ones of the previous century. But I don’t think it should be excluded that new generations will find inspiration in the hopes, the aspirations, and the efforts of a more positively perceived socialist legacy, as well as valuable experiences to learn from.", "url": "https://jacobinmag.com/2013/07/global-capitalism-in-one-country/"}