{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:08:33", "date_modify": "2020-05-04 16:08:33", "date_publish": "2013-05-13 18:47:14", "description": "Read CNN's Fast Facts about the life of singer and actress Barbra Streisand.", "filename": "2013_05_13_us_barbra-streisand-fast-facts_index_1588608513.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/130224235050-oscar-photos-barbra-streisand-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_05_13_us_barbra-streisand-fast-facts_index_1588608513.html", "title": "Barbra Streisand Fast Facts", "title_page": "Barbra Streisand Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here is a look at the life of singer and actress Barbra Streisand .\nPersonal\nBirth date: April 24, 1942\nBirth place: Brooklyn, New York\nBirth name: Barbara Joan Streisand\nFather: Emanuel Streisand, a teacher\nMother: Diana (Rosen) Streisand Kind\nMarriages: James Brolin (July 1, 1998-present); Elliott Gould (March 21, 1963-1971, divorced)\nChildren: with Elliott Gould: Jason Emanuel Gould\nOther Facts\nChanged her name from Barbara to Barbra.\nHer father died when she was 15 months old.\nHas suffered from severe stage fright.\nNominated for 45 Grammy Awards and has won eight.\nNominated for nine Primetime Emmy Awards and has won four.\nNominated for five Academy Awards and has won two.\nNominated for two Tony Awards , and has received a special Tony Award.\nTimeline\n1962 - Makes her Broadway debut in \"I Can Get It For You Wholesale.\"\n1962 - Signs a contract with Columbia Records.\n1963 - Her debut album, \"The Barbra Streisand Album,\" is released and wins her two Grammy Awards.\n1964 - The Broadway musical \"Funny Girl,\" in which Streisand plays Fanny Brice, debuts.\n1965 - Her television special, \"My Name Is Barbra,\" airs. It earns Streisand an Her television special, \"My Name Is Barbra,\" airs. It earns Streisand an Emmy Award and a Grammy Award for the accompanying album.\nApril 14, 1969 - Wins the Academy Award for Best Actress for her role in the film \"Funny Girl.\"\n1970 - Receives a special Tony Award.\n1973 - The film \"The Way We Were\" opens.\nMarch 28, 1977 - Receives the Academy Award for Best Original Song, for the song \"Evergreen (Love Theme From A Star Is Born)\" from the movie \"A Star Is Born.\"\n1983 - Streisand's directorial debut, \"Yentl,\" opens.\n1991 - \"The Prince of Tides\" opens, a film in which Streisand produces, directs and acts.\n1995 - Receives a Grammy Lifetime Achievement Award.\n2008 - Receives the Kennedy Center Honors.\nSeptember 2014 - Streisand's new album, \"Partners,\" is released and goes to the top of the Billboard 200 album chart. This makes her the first artist to have a No. 1 album in each of the past six decades.\nFebruary 2018 - releases an interview in which Streisand reveals that two of her dogs are Variety magazine releases an interview in which Streisand reveals that two of her dogs are clones of her deceased dog Samantha, who passed away in 2017.", "url": "https://www.cnn.com/2013/05/13/us/barbra-streisand-fast-facts/index.html"}