{"authors": ["Shawn Gude", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:52", "date_modify": "2020-05-04 19:50:52", "date_publish": "2013-04-16 00:00:00", "description": null, "filename": "2013_04_the-industrial-classroom_1588621852.html", "image_url": "https://images.jacobinmag.com/2013/04/16233455/gude-2.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_04_the-industrial-classroom_1588621852.html", "title": "The Industrial Classroom", "title_page": "The Industrial Classroom", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nMichelle Gunderson hates standardized tests. The Chicago elementary school teacher thinks they steal “precious instructional time” and drive a wedge between her and her students. When Gunderson is forced to administer one of the exams herself, “it is so different from my day-to-day interactions with children that I prepare them for it. I tell them that I have to speak the exact words in the book, and that it won’t sound like me. So in a sense, I hate that this test comes between me and the relationships I have with my students.” Educators in Seattle have voiced similar objections. In January, teachers at Garfield High School announced they would no longer proctor the MAP test, a standardized exam they regard as flawed and detrimental to student learning, and whose implementation was marred by conflict-of-interest concerns. Jesse Hagopian, a Garfield High history teacher, told me that some anti-MAP teachers have a beef only with this particular test; a better one would mollify their misgivings. A large contingent, however, takes issue with standardized tests themselves. “Many others see the problem as more inherent to norm-referenced tests,” says Hagopian, referring to exams that place students in “percentiles” and rank them in relation to previous test-takers. “This is a struggle about the MAP test,” he says, “but I think the reason why there’s been so much support from around the country is it’s in the context of a country that’s gone test-crazy.” This stance places Hagopian, Gunderson, and other dissident teachers at the center of an upsurge seeking to combat the corporate school-reform movement. They are the counterweights to the well-funded reformers, who push high-stakes testing, competition, and merit pay. They are the bulwarks — the most militant instance being last fall’s Chicago Teachers Union strike — against the top-down imposition of policies that drain the profession and the classroom of their humanity. And in this struggle, the teachers can claim historical antecedents. A few of their working-class forebears: the Florida educators who launched the first statewide teachers’ strike in 1968, seeking increased education funding and signaling an emerging militancy; the pioneering Chicago educators who, tired of crowded classrooms and crappy pay, formed the country’s first union composed entirely of teachers; the many workers who, in the early twentieth century, resisted the implementation of so-called “scientific management” in their shops and factories. In each instance, workers fought dehumanization, indignity, and domination. They embodied the labor movement’s great promise, that workers acting in concert can control the terms, conditions, and material benefits of their labor. There’s a special resemblance between the struggles against scientific management, or Taylorism, and today’s teacher resistance to corporate reform schemes. Just as factory workers fought top-down dictates, deskilling, and the installation of anemic work processes, so too are teachers trying to prevent the undemocratic implementation of high-stakes testing and merit pay, assaults on professionalism, and the dumbing down and narrowing of curricula. There are more obvious parallels: Proponents of scientific management counted some prominent progressives in their ranks, just like the contemporary left-neoliberals hawking education reform. The nostrums of both Taylorism and the education accountability movement paper over foundational conflicts and root causes. Many of those who espouse education reform cast their solutions as unimpeachably “scientific” and “data-driven,” yet as with scientific management partisans, the empirical grounding of their prescriptions is highly dubious. And proponents of scientific management and corporate school reform share an antipathy toward unions, often casting them as self-interested inhibitors of progress. The unions-as-impediment framing is correct in one respect, and here the case of Taylorism is instructive: only organized workers can thwart agents of dehumanization.\nBorn to a wealthy family in 1856, Frederick Taylor was the eponymous champion of the scientific management movement. Less a visionary innovator than a skilled synthesizer, Taylor combined largely preexisting management tools and techniques to develop a coherent system that ratcheted up the amount of control bosses had over workers and the labor process. The stopwatch was his favored metric, the time study his guide. Taylor’s objective was to “rationalize” the production process, to expunge it of perceived inefficiencies and increase output. All the waste — gratuitous motions, worker “soldiering,” idiosyncratic production methods — had to go. Non-labor superfluity was included in this, but Taylorism’s impact on workers, especially skilled workers, aroused the most opposition. As labor historian David Montgomery details in Workers’ Control in America , Taylor was confronting craftsmen who had a high degree of autonomy and control over their work. In the late 1800s, skilled workers — even in non-union shops — commonly set an output quota, or “stint,” to ensure they’d receive decent pay and regular employment. If managers tried to goad workers into abandoning the collectively set rules, they’d often just walk off the job. They held such power because they alone possessed the “secrets of the craft” — only they knew how to make, mold, and maneuver. The stint particularly irked Taylor. Deriding this collective custom as “soldiering,” Taylor wanted to determine exactly how, and how fast, tasks were completed. No deviation was allowed. He’d find each trade’s “one best way,” thereby deskilling the skilled and making the worker easily replaceable. Workers, unsurprisingly, didn’t take too kindly to being reduced to another “input” in the production process, to being treated as automatons rather than sentient human beings. They were generally contemptuous of Taylorism because, at root, it sought to wrest control from workers themselves and transfer power over the production process to management. (Managers often took issue with Taylor’s prescriptions as well. They resisted outsiders telling them their operation was shoddily run.) Molders and workers in the International Association of Machinists were among the most stridently opposed to scientific management. They viewed with contempt the deskilling of workers, the stripping of worker control, the cold inhumanity of the stopwatch. They were convinced that those who couldn’t meet the feverish pace thus established would be cast aside, disposable and unemployable. And, of course, they were correct. After studying the Bethlehem Steel pig iron workers, Taylor claimed the men should be lugging nearly four times as much pig iron as they had been — a feat, he conceded, that “only about one man in eight” was physically capable of. For the roughly 400 percent increase in output, the company would grant the workers a pay increase of about 60 percent. Fair’s fair, right? Scientific management’s proponents also consciously strove to individualize and atomize workers and break the bonds of solidarity. Increasing and individualizing worker pay served two purposes: inducing otherwise obdurate workers to go along with management’s demands, and holding individual workers accountable for their output. In Taylor’s eyes, solidarity and collective bargaining were impediments to a genuinely scientific production process. They prevented workers from pursuing their rational self-interest, which, conveniently enough, meant accepting a workplace structured and run according to scientific management’s tenets. Early in his career, as he tried vainly to get individual workers to churn out more than their peers, Taylor conceded that their umbrage was justified. He would act the same way if he were operating the lathe machine. But later, he tended to ascribe a kind of false consciousness to recalcitrant workers. His method was scientific, objective, infallible. What was there to quibble with? Why hadn’t the appeal of collective bargaining and unions collapsed under the sheer weight of Taylorism’s analytical rigor? Why didn’t workers perceive their self-interest? Louis Brandeis, active in the Progressive Movement and dubbed the “people’s lawyer,” wondered the same thing. Credulous but avowedly pro-union, he was among the well-intentioned center-left figures who sung the praises of scientific management. Brandeis saw endemic inefficiency in the monopolistic railroads, and, in the widely covered “Eastern Rate Case,” introduced an expert who claimed the railroads could save up to $1 million a day. With more money to go around, class antagonism could be ameliorated, if not eradicated. Efficiency would rid the nation of bitter class wars. Around the same time, scientific management was seeping into the education world. Popular publications like Ladies’ Home Journal and Sat­urday Evening Post , caught up in the “efficiency craze” and convinced of scientific management’s universal applicability, zeroed in on the public education system and shook their heads at the waste and lack of accountability they saw. Unlike scientific management’s adherents in private industry, however, they didn’t face organized worker opposition. The few existing teachers’ unions were young and not major actors. The National Education Association was more a professional organization for administrators than a bona fide union. Rank-and-file teachers had little role in shaping education policy. Superintendents, as Raymond Callahan chronicles in Education and the Cult of Efficiency , were the ones who bore the brunt of the efficiency backlash. And they tended to bend to the critics’ wishes. Businesses required a trained workforce, so an “efficient” education system to them meant an increasingly vocationalized one.\nThe present-day school-reform movement doesn’t exactly have grassroots origins. Its genesis is typically dated to 1983’s landmark Nation at Risk report, the product of a presidential commission on the state of public education. The panel saw abject failure, a system in decline, and a country imperiled by its educational shortcomings. Barely twenty years later, over the cries of conservative localists, as well as teachers’ unions and their liberal allies — and, it should go without saying, leftists — Congress passed the No Child Left Behind Act. The Act revolutionized national education policy and signaled corporate reformers’ purchase on both major political parties. Accountability was the watchword, stepped-up standardized testing the preferred method of quantification. In the NCLB world, high-poverty “Title I” schools were penalized if their students didn’t exhibit, in the technical argot, “adequate yearly progress” — that is, if their test scores didn’t improve quickly enough. While some of NCLB’s most punitive measures never came to pass, hard-charging, zealous school-reformers at the local and state levels pushed on. Michelle Rhee was among the worst. Rhee, former chancellor of the DC Public Schools and avatar of the reform movement, instituted a draconian high-stakes testing regime, and seemed to take a perverse glee in firing teachers and bashing unions. (A USA Today investigation revealed widespread cheating under Rhee’s tenure, effectively negating the testing gains about which she boasted so much.) President Obama has renounced the ill-conceived NCLB law, but the substantive emphasis on standardized testing hasn’t waned under his administration. Obama’s signature education program, Race to the Top, is reminiscent of NCLB, rewarding states that increase the role of standardized testing in public education. As a rule, the past few decades have been marked by a pronounced uptick in standardized testing and regimentation. Xian Barrett, who teaches law and Chicago history to high school juniors and seniors, told me that the prioritization of test prep is crowding out more engaging school activities like trips to DC to meet elected officials. The testing obsession, Barrett said, has also increased the stress level in an already high-stress occupation. “The proliferation of high-stakes testing has . . . created unnecessary pressure and urgency where those qualities already existed. It has essentially placed a higher burden on those with the toughest jobs — not just the teachers, but other educators and students as well.” Long-time educators like Gunderson, a twenty-six-year veteran, have seen teachers’ control over curriculum threatened and eroded. They’ve seen the status of their profession diminished. In Chicago specifically, they’ve seen the predominance of mayoral control — the school board is appointed, not democratically elected — and private largesse in molding public policy. They’ve watched testing be used to “sort, punish, and privatize,” in Gunderson’s words. It’s put educators on the defensive. “It’s not enough to want child-centered learning. You have to be willing to defend it at every turn,” the fourth-grade teacher says. “This seems like a silly waste of time and is very different from when I started teaching. I was left alone to make my own sound judgments and was trusted.” The common retort from neoliberal reformers is that teachers must be subject to accountability, and that the most objective way to measure teacher performance is student test scores. Many also favor releasing those figures to the public (so parents can determine the effectiveness of their child’s present or future teacher) and linking pay to exam results. But test scores are a notoriously poor way to gauge teacher quality. Student backgrounds, while certainly not determinative, can still impact educational achievement as much as classroom teaching. Equating good teaching with good test scores reduces a complex, human process, and the teacher-student relationship, to a cold data point, bereft of nuance. Under neoliberal reform, rote learning and “teaching to the test” replace critical thinking and problem solving. Taylor’s “one best way” is reborn as the “one best answer.” Teachers who balk at high-stakes testing do so because of their love of the profession and support for a lively curriculum, not to inhibit student achievement (or, as Taylor might have framed it, restrict production). Teachers don’t “sabotage” their pupils as a defiant worker might a product on an assembly line — the “products” teachers are assembling and molding are living, breathing human beings. Teachers are, however, fighting incursions on labor autonomy and self-direction that are very reminiscent of Taylorism. As Harry Braverman argues in Labor and Monopoly Capital , Taylorism was a program of dehumanization. Properly conceived, human labor is purposeful, deliberately designed, and consciously carried out. The work environment that Taylorists favored — regimented, dictated, with conception divorced from practice — was organized according to the needs of management rather than labor. Workers’ wellbeing was an afterthought, entering into the equation only if its consideration could be shown to boost production or prevent labor strife. This amounted to what Braverman calls “the degradation of work,” a trend that continued apace through the twentieth century and, to this day, hasn’t abated. The same can be said about the corporate school-reform agenda: it results in the “degradation of education.” When education is reduced to test prep, rich curricula and the craft of teaching are imperiled. The vapid classroom of neoliberal school reform mirrors the vapid workplace of Taylorism. Teach for America, which implicitly advances the idea that the sparsely trained can out-teach veteran educators, engenders deskilling and deprofessionalization. Non-practitioners dictating to practitioners how they should do their work mirrors management’s disciplining of workers; both militate against work as a creative activity. The appropriation of business language — the head of the Chicago Public Schools is the “CEO” — reinforces the idea that schools should be run like corporations. Merit pay individualizes and severs educators’ ties to one another, forcing them to compete instead of cooperate. So too with the anti-union animus that neoliberal reformers and scientific management proponents display. The goal in each is case to attenuate the collective power of workers to resist management’s edicts. The Taylorists’ futile efforts to transcend or eradicate class conflict is analogous to corporate school-reformers’ sidestepping of child poverty. And prominent Democrats like Barack Obama and his education secretary, Arne Duncan, are school reform’s useful idiots, just as prominent Progressive and Taylorist Louis Brandeis was in his day. This is a simulacrum of schooling. It’s education drained of its humanity. One could easily read the foregoing, nod in agreement, then reasonably object that the analogy between Taylorism and school reform is off in one crucial respect: motivation. Taylor, the skeptic might say, was acting in the service of capital, disciplining labor to increase output. School-reformers, however wrongheaded, are legitimately trying to boost student achievement. This argument contains a kernel of truth, and indeed, the private and public spheres are governed by disparate laws and logics. As much as reformers are given to business-speak, public schools still aren’t driven entirely by the imperatives of profit, as in the private sector. For his part, Hagopian sees corporate reform as a deliberate attempt to weaken teachers’ unions, one of the few remaining bastions of American labor. “One of the ways to undermine those unions,” Hagopian says, “is to make teachers’ jobs more tenuous, make people fear for their jobs, and get around union protections by pretending to demand teacher quality and instead implementing these value-added junk-science measures that are not designed to improve student learning.” But one doesn’t even have to buy Hagopian’s reform-as-subterfuge argument to object to the reform agenda. The motivations of corporate school-reformers are almost immaterial. It’s evident that the consequences of the policies they push are injurious to unions. The same can be said about a panoply of reform prescriptions: we needn’t speculate about nefarious intent when we know that high-stakes testing narrows curricula and drains the teaching profession of its humanity. We needn’t impute bad faith to Wendy Kopp, the founder of Teach for America, when we know her in-and-out-in-two-years model vitiates teaching as a profession. We needn’t think that Bill Gates, who single-handedly shapes public education policy, is motivated by malice; simple disgust at its diminution of democracy is enough.", "url": "https://www.jacobinmag.com/2013/04/the-industrial-classroom"}