{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 15:57:30", "date_modify": "2020-05-04 15:57:30", "date_publish": "2013-09-28 17:26:35", "description": "Read CNN's Fast Facts about horse racing's Triple Crown. The three races included are the Kentucky Derby, the Preakness Stakes and the Belmont Stakes.", "filename": "2013_09_28_us_triple-crown-fast-facts_index_1588607850.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150611180506-08-week-in-photos-0612-tease-super-169.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_09_28_us_triple-crown-fast-facts_index_1588607850.html", "title": "Triple Crown Fast Facts", "title_page": "Triple Crown Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at horse racing's Triple Crown. The three races in the Triple Crown are the Kentucky Derby , the Preakness Stakes and the Belmont Stakes .\nFacts\nA horse must win all three races to achieve the Triple Crown.\nThere have been 13 Triple Crown winners:\n- 1919 Sir Barton\n- 1930 Gallant Fox\n- 1935 Omaha\n- 1937 War Admiral\n- 1941 Whirlaway\n- 1943 Count Fleet\n- 1946 Assault\n- 1948 Citation\n- 1973 Secretariat\n- 1977 Seattle Slew\n- 1978 Affirmed\n- 2015 American Pharoah\n- 2018 Justify\nSince 1990, there have been nine instances where horses have won the first two of the three legs of the Triple Crown: Silver Charm in 1997, Real Quiet in 1998, Charismatic in 1999, War Emblem in 2002, Funny Cide in 2003, Smarty Jones in 2004, Big Brown in 2008, I'll Have Another in 2012 and California Chrome in 2014.\nRosie Napravnik, in 2013, became the first female jockey to ride in all three Triple Crown races.\nJune 6, 2015 - , and the first since 1978. Victor Espinoza is the oldest, and first Latino jockey, to win the most prestigious accomplishment in horse racing. American Pharoah wins the 147th Belmont Stakes and becomes one of only 12 horses to achieve the Triple Crown , and the first since 1978. Victor Espinoza is the oldest, and first Latino jockey, to win the most prestigious accomplishment in horse racing.\nJune 9, 2018 - . Justify becomes the 13th horse to achieve the Triple Crown. Justify is the first undefeated horse to complete the Triple Crown since 1977. Justify, ridden by Mike Smith, wins the 150th Belmont Stakes . Justify becomes the 13th horse to achieve the Triple Crown. Justify is the first undefeated horse to complete the Triple Crown since 1977.\nKentucky Derby:\nThe Kentucky Derby is traditionally run the first Saturday in May at Churchill Downs in Louisville, Kentucky.\nThe Derby is 1.25 miles in length.\nThe age limit for horses in the Derby is 3 years.\nThe winner is given a blanket of roses, so the race is also known as the \"run for the roses.\"\n1875 - The Kentucky Derby is established.\nMay 4, 2019 - The 145th Kentucky Derby takes place. The 145th Kentucky Derby takes place. Country House, with jockey Flavien Prat, crosses the finish line second but is declared the winner after Maximum Security is disqualified for interference. It is the first time a Derby winner has been disqualified because of a foul on the track.\nPreakness Stakes:\nThe Preakness is traditionally run the third Saturday in May at Pimlico in Baltimore.\nThe Preakness is 1 and 3/16 miles in length.\nThe winner is covered by a blanket of black-eyed Susans.\nMay 27, 1873 - The first Preakness Stakes is run.\n1890-1909 - The Preakness is run at Gravesend Track in Brooklyn, New York.\nBelmont Stakes:\nThe Belmont Stakes is generally run on the first or second Saturday in June at Belmont Park in Elmont, New York.\nThe longest of the three triple crown races at 1.5 miles; often referred to as the \"Test of the Champion.\"\nSecretariat set a world record at the race that still stands for the mile and a half distance on a dirt track at 2:24.\nThe winner of the race is given a blanket made of between 300-400 white carnations, the traditional flower of the Belmont Stakes.\nThe Belmont Stakes is the oldest of the Triple Crown events.\nJune 19, 1867 - The first Belmont Stakes takes place at Jerome Park in the Bronx, New York.", "url": "https://www.cnn.com/2013/09/28/us/triple-crown-fast-facts/index.html"}