{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:23:25", "date_modify": "2020-05-04 16:23:25", "date_publish": "2013-04-08 21:54:41", "description": "Read CNN's Fast Facts about the life of Steve Ballmer, former CEO of Microsoft.", "filename": "2013_04_08_us_steve-ballmer-fast-facts_index_1588609405.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/141108051517-unguarded-steve-ballmer-00001229-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_04_08_us_steve-ballmer-fast-facts_index_1588609405.html", "title": "Steve Ballmer Fast Facts", "title_page": "Steve Ballmer Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Photos: The many faces of Steve Ballmer The many faces of Steve Ballmer – Steve Ballmer, the former CEO of Microsoft, appears set to buy the L.A. Clippers. Ballmer, seen here at a NBA playoff game on April 29, is not one to hide his emotions. Rather, he is known for his exuberant persona at tech events. Here's a look at some of his many mugs: Hide Caption 1 of 10\nPhotos: The many faces of Steve Ballmer The many faces of Steve Ballmer – Here Ballmer responds during an interview at a 2000 tech conference in Florida. If only we knew what the question was. Hide Caption 2 of 10\nPhotos: The many faces of Steve Ballmer The many faces of Steve Ballmer – \"Don't ask me again about Windows Vista.\" Hide Caption 3 of 10\nPhotos: The many faces of Steve Ballmer The many faces of Steve Ballmer – Oh, this is a caption contest waiting to happen. Here Ballmer speaks at the Web. 2.0 Summit in 2011 in San Francisco. Hide Caption 4 of 10\nPhotos: The many faces of Steve Ballmer The many faces of Steve Ballmer – Here Ballmer (pick one: 1. grimaces 2. grins 3. remembers he left the stove on) while talking about Windows 7 during a 2009 appearance in Munich, Germany. Hide Caption 5 of 10\nPhotos: The many faces of Steve Ballmer The many faces of Steve Ballmer – \"I'll shout louder so you guys in the back can hear me.\" Hide Caption 6 of 10\nPhotos: The many faces of Steve Ballmer The many faces of Steve Ballmer – If this Microsoft thing hadn't worked out, Ballmer might have made a fearsome football coach. Hide Caption 7 of 10\nPhotos: The many faces of Steve Ballmer The many faces of Steve Ballmer – \"Well, Apple has had some success, sure. And Facebook is big. Don't get me started on Google. ... What was the question again?\" Hide Caption 8 of 10\nPhotos: The many faces of Steve Ballmer The many faces of Steve Ballmer – Please don't make Steve Ballmer angry. Just don't. Hide Caption 9 of 10", "url": "https://www.cnn.com/2013/04/08/us/steve-ballmer-fast-facts/index.html"}