{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:24:23", "date_modify": "2020-05-04 16:24:23", "date_publish": "2013-08-16 16:11:08", "description": "Read CNN's Fast Facts about April Fool's Day, also known as All Fools' Day, celebrated on April 1st every year.", "filename": "2013_08_16_world_april-fools-day-fast-facts_index_1588609463.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150401115528-microsoft-office-cats-april-fools-super-169.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_08_16_world_april-fools-day-fast-facts_index_1588609463.html", "title": "April Fools' Day Fast Facts", "title_page": "April Fools' Day Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "History\nSome historians believe the April Fools' customs began in France, although no one knows for sure.\nIt may stem from a calendar change in 16th century France -- the moving of New Year's Day from April 1 to January 1 when the Gregorian calendar was adopted.\nPeople who continued to celebrate New Year's Day on April 1st rather than the new date of January 1st were referred to as \"April fools\" and others played tricks on them.\nAround the World\nIn France, April 1st is called \"Poisson d'Avril.\"\nFrench children fool their friends by taping a paper fish to their friends' backs.\nWhen the \"young fool\" discovers this trick, the prankster yells \"Poisson d'Avril!\"\nIn Scotland, April Fools' lasts two days. Victims of pranks are called gowks (cuckoo birds). The second day is known as Taily Day, and pranks involving the backside are played. Supposedly, it is the origin of \"kick me\" signs.\nIn England and Canada, pranks are only played in the morning of April 1st.\nMemorable Pranks\nEarly 1950s - The BBC runs a \"news\" item about the spaghetti harvest in Switzerland.\n1985 - Sports Illustrated runs a 14-page story by George Plimpton about a Mets pitching phenom named Sidd Finch. The reclusive, skinny Finch has a 168-mph fastball (which he credits to meditations in Sports Illustrated runs a 14-page story by George Plimpton about a Mets pitching phenom named Sidd Finch. The reclusive, skinny Finch has a 168-mph fastball (which he credits to meditations in Tibet ) and a host of quirks including carrying a French horn at all times and wearing only one hiking boot while pitching.\n1986-present - Press releases for the [non-existent] New York City Press releases for the [non-existent] New York City April Fools' Day Parade have been issued every year since 1986.\n1996 - Taco Bell Corp. runs a full-page ad in several major newspapers claiming it has purchased the Liberty Bell and is renaming it the \"Taco Liberty Bell.\"\n2004 - The National Public Radio show \"All Things Considered\" runs a story about the post offices' new \"portable zip codes\" program. Based on people being able to keep their phone number even if they moved, the program was designed to represent \"a citizen's place in the demographic, rather than geographic, landscape.\"\n2008 - The BBC runs a video clip of flying penguins as part of a story for its series \"Miracles of Evolution.\" The presenter explains that the penguins escaped the cold, harsh Antarctic weather by flying to the tropical rainforests of South America.\nApril 1, 2010 - The National Republican Senatorial Committee releases a parody web video celebrating The National Republican Senatorial Committee releases a parody web video celebrating President Barack Obama as \"truly the greatest president ever\" and that he has \"kept all his promises.\"\nApril 1, 2013 - The Guardian announces the launch of its own augmented reality device, The Guardian announces the launch of its own augmented reality device, Guardian Goggles, which will \"beam its journalism directly into the wearer's visual field, enabling users to see the world through the Guardian's eyes at all times.\"", "url": "https://www.cnn.com/2013/08/16/world/april-fools-day-fast-facts/index.html"}