{"authors": ["Lois Weiner", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:11", "date_modify": "2020-05-04 19:50:11", "date_publish": "2013-04-16 00:00:00", "description": null, "filename": "2014_07_building-not-rebuilding-public-education_1588621811.html", "image_url": "https://images.jacobinmag.com/2013/04/16233452/erickson-2.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_07_building-not-rebuilding-public-education_1588621811.html", "title": "Building, Not Rebuilding, Public Education", "title_page": "Building, Not Rebuilding, Public Education", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Social movements effectively challenged the inequality of outcomes in education, but in the end were unable to sufficiently disrupt social processes in schools. In good part this occurred because schooling was made to carry a weight that it cannot by itself bear and because education is enmeshed in social, political, and economic conditions that support or undercut what can be accomplished in classrooms.\nSchools in the United States have been affected by inequality outside their walls, while also functioning in ways that both challenge and reproduce it. We have a remarkable body of high-quality empirical scholarship describing “schools as places where social reproduction occurs but also where human agency matters and makes a difference in students’ lives.”\nUnions did not create residential and school segregation, but accepting it was an unarticulated assumption in its post–World War II pact with capital. Those practices and assumptions must no longer be accepted by parents, teachers, and our unions.\nThe fight against corporate education reform must be less about restoring a system to its former glory than building a just one for the first time.\nAcross the United States, there is a great struggle over the nation’s education system. But many working class parents of color see the current battle differently than do those from the white middle class. To be credible to the poor and working-class parents and community members who should be natural allies, labor must acknowledge its complicity in allowing the gross inequality in American education to persist.\nWhen decrying today’s corporate reform, too many gloss over the second experience and universalize my own, appealing to a past that was always deeply unequal.\nYet schools on Wilmington’s east side got the leftover musical instruments and much less money for books, supplies, and maintaining school facilities like the playground. Harlan was all white, intentionally segregated. Real estate developers and brokers in its attendance zone had homeowners sign racial covenants that prohibited the sale of homes to blacks.\nIn 1954, I was in the first grade at David W. Harlan Elementary School in Wilmington, Delaware. I could buy a hot lunch prepared by cafeteria workers who were employed by the Wilmington Public Schools. I took music lessons for free, using a violin the city schools lent me. We had a school library, chorus, and band. We had art classes three times a week.\nProbably the most important liberal defender of public education today is Diane Ravitch. In battling her former co-thinkers with the personal resources and connections she acquired in supporting neoconservative policies, Ravitch has contributed mightily to public awareness of the threat to democracy and to children in the current drive to create a privatized school system funded by public money but without collective, public oversight.\nReign of Error: The Hoax of the Privatization Movement and the Danger to America’s Public Schools , her newest book, is an authoritative compendium of why these reforms are so dangerous. Ravitch has almost singlehandedly developed and publicized a liberal rebuttal to corporate reforms.\nStill, while she has repudiated the policies she helped craft and promote under the George H. W. Bush administration, she has not yet distanced herself from assumptions that led to her support for the initial iteration of the current reforms. The central political flaw in her analysis is seen when she argues about education’s purposes, past and present. Public education was established in the nineteenth century, she explains:\n. . . to educate future citizens and to sustain our democracy. The essential purpose of the public schools, the reason they receive public funding, is to teach young people the rights and responsibilities of citizens . . . A secondary purpose was to strengthen our economy and our culture by raising the intelligence of our people and preparing them to lead independent lives as managers, workers, producers, consumers, and creators of ideas, products, and services.\nA third purpose, she writes, was “to endow every individual with the intellectual and ethical power to pursue his or her own interests and to develop the judgment and character to survive life’s vicissitudes.”\nRavitch explains that education’s purpose was — and is — to strengthen the economy and prepare people for work. Yet the book does not acknowledge that schools have educated most working-class students for working-class jobs, and most children of professionals for similar careers and social status of their parents. She challenges the claim that education is the “one true path” out of poverty by making poverty exclusively to blame for inequality in education.\nPreviously Ravitch contended that her own education was ideal, and it is to her credit that in Reign of Error she steps back from that assertion and argues that residential and school segregation do harm. Her shift in thinking shows a new willingness to address racial segregation, an unpopular but necessary step in equalizing school outcomes. However, the overarching argument that U.S. public education was doing as well as could be expected given the effects of poverty is a serious flaw in her analysis and opens up her — and the movement — to the charge that we want to defend an unequal status quo.\nRavitch does not address the contradiction between schooling’s non-economic purposes — its role in educating the next generation of citizens and nurturing each individual’s potential — and its use as a sorting mechanism to allocate a diminishing number of well-paying jobs. Unfortunately, neoliberal reforms resonate with many poor, minority parents precisely because they want the same opportunity for their children to compete for good jobs as middle-class children have.\nCalls for schools that make children happy and develop creativity will not assuage parents’ fears that their children will not be strong competitors in an increasingly punishing labor market. Arne Duncan’s contemptuous dismissal of opponents of high-stakes testing and the new Common Core standards as “suburban moms” who can’t face their children’s limitations demonstrates that our opponents will fully exploit the utterly hypocritical and inaccurate claim that they protect poor, minority children against white liberals who want to maintain the status quo, to advantage their own children.\nRavitch marshals evidence that bipartisan reforms aim to destroy the template for mass public education in the United States that was created in the nineteenth century. Unfortunately the artificial national border she draws in telling the story of US education reform obscures the global dimension of the project and the relationship of the changes being made to American schools to demands of capitalism globally and its transformation of schooling throughout the world.\nIn effect, she proposes a return to the post–World War II social democratic compact, inflected by a commitment to the Civil Rights Movement’s campaign for school integration. One insurmountable problem with this strategy is that capitalism rejects the compact. But even if we could win back the compact, it was a Faustian deal. Teachers unions, like the rest of labor, were bureaucratized and greatly weakened by the quid pro quo that gave them collective bargaining but took away the capacity to intervene directly on issues that go to the heart of teachers’ work, especially school organization and curriculum. This is not a past to which we should want to return.\nRavitch’s electoral strategy also reflects a desire to return to the (idealized) past. She recognizes that big money and corporations control the Democratic Party, and her solution is to push Democrats to be the defenders of public education she says they once were. She therefore encourages opponents of corporate school reform to embrace Democrats willing to criticize (however vaguely) privatization, testing, and charter schools and defend (however meekly) teachers unions.\nHowever, she — and those who agree with this political strategy — do not explain how we will hold candidates responsible to the activists who have worked on their behalf and avoid betrayals. Yet this issue is more pressing with each election cycle and each desertion of Democrats whom progressives have supported.\nAl Franken, liberal sweetheart, has endorsed Teach for America and charter schools, as has Howard Dean. Ras Baraka, campaigning for mayor of Newark, easily won the support of activists, including Ravitch, based on his harsh criticisms of Newark’s school closings and proliferating charter schools. Yet Baraka has allied himself with the mayor of Jersey City, who was elected on a program to bring to the Jersey City schools precisely the reforms that Baraka criticizes in Newark — reforms that Democrats for Education Reform and New Jersey’s newest Democratic senator and Newark’s former mayor, Cory Booker, embrace wholeheartedly.\nPressed by activists to criticize teacher union leaders, in particular her longtime friend, American Federation of Teachers President Randi Weingarten, for endorsing the Common Core and commending legislation that links teacher evaluation to students’ standardized test scores, Ravitch has declined, arguing this creates divisions.\nBut the divisions already exist because union reformers are challenging the local and national leadership in both of the national teachers unions. The question is whether we will encourage activists to democratize their unions, to make them social movements, or whether we think the model of “service” or “business unionism” should remain the norm. The Chicago Teachers Union is just one part of a growing movement for a better education system. But much hinges on other radical activists in the United States understanding that we cannot repeat the mistakes teachers unions made during their birth in the 1960s.", "url": "https://jacobinmag.com/2014/07/building-not-rebuilding-public-education"}