{"authors": ["Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis", "Mímir Kristjánsson"], "date_download": "2020-05-04 19:50:14", "date_modify": "2020-05-04 19:50:14", "date_publish": "2013-04-16 00:00:00", "description": null, "filename": "2013_09_class-action-presented-by-the-chicago-teacher-unions-core-caucus-and-jacobin_1588621814.html", "image_url": "https://images.jacobinmag.com/2013/04/16233452/erickson-2.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_09_class-action-presented-by-the-chicago-teacher-unions-core-caucus-and-jacobin_1588621814.html", "title": "Class Action: Presented by the Chicago Teacher Union’s CORE Caucus and Jacobin", "title_page": "Class Action: Presented by the Chicago Teacher Union’s CORE Caucus and Jacobin", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Since the beginning, Jacobin has paid special attention to the struggle of public workers against austerity. Our critiques of neoliberal education reform have been especially well-received — with reprints penetrating even into mainstream venues like the Washington Post and Salon. Megan Erickson, Lois Weiner, Micah Uetricht, Liza Featherstone, Will Johnson, Shawn Gude, and other Jacobin -affiliated writers have dedicated themselves to the issue.\nIt was the right decision. With so much of the education reform movement’s impetus coming from liberals, communities resisting the push have been left with few allies. As a publication that has a young core audience, we thought it important to make clear that K–12 education issues are salient to everyone, not just teachers, students, and parents. That meant connecting the education “reform” project specifically to the larger trend towards market solutions as an orienting vision not just for the public schools but for society as a whole.\nAmerican public schools are increasingly seen by politicians, business people, and philanthropists as a sorting facility where children either seize opportunity or surrender it. Education “reformers” like Michelle Rhee and Joel Klein rhetorically connect standards and accountability to egalitarianism, using liberal language to advocate for a radically conservative reform agenda which consists of union breaking, “merit” pay, and sometimes budget cuts for schools.\nWith the inspiring 2012 Chicago Teachers Union strike, we saw signs of what can happen when teachers and their allies unite to resist this agenda and present visions of an alternative. In turn, Jacobin articles like “Lean Production” received a wide-audience among teachers in Chicago and beyond. Our partnership with the CTU’s Caucus of Rank and File Educators comes from this exchange.\n“Class Action” aims to be useful to those engaged in struggle. It will be tabled with as a fundraising tool by teacher organizations, passed around freely at community events and protests, and used as an educational tool at faculty reading groups. We’re printing 4,000 copies, with distribution in Chicago, New York, Newark, Washington DC, Seattle, New Haven, New Orleans, and elsewhere. The content will be mostly original, a majority of which will be written by current or former educators.\nThe booklet will be produced in a 7.5 by 10″ full-color format by Jacobin creative director Remeike Forbes. Original art will be commissioned from a host of talented designers and illustrators. Additionally, we’re giving a fellowship to photographer Katrina Ohstrom to fly to Chicago and spend a week documenting school closures. Her original work will appear in the supplemental and limited-edition prints are available for project supporters. Ohstrom has been covering closed and closing schools in Philadelphia for several years.\nThe supplement will be approximately 40 pages. Including Ohstrom’s fellowship, we project the actual costs of the project to run to around $7,500, so donations above the target amount would be warmly appreciated. The more money we raise, the more booklets we can produce.\nYou can fund our project on Kickstarter for the next thirty days.", "url": "https://jacobinmag.com/2013/09/class-action-presented-by-the-chicago-teacher-unions-core-caucus-and-jacobin"}