{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:15:02", "date_modify": "2020-05-04 16:15:02", "date_publish": "2013-09-02 15:45:16", "description": "Read CNN's Fast Facts to learn more about how the Mexican government has been fighting against drug traffickers since December 2006.", "filename": "2013_09_02_world_americas_mexico-drug-war-fast-facts_index_1588608902.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150713224748-drug-cartels-explainer-el-chapo-sinaloa-los-zetas-juarez-nueva-generacion-orig-00002603-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_09_02_world_americas_mexico-drug-war-fast-facts_index_1588608902.html", "title": "Mexico Drug War Fast Facts", "title_page": "Mexico Drug War Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the Mexican Drug War. The Mexican government has been fighting a war with drug traffickers since December 2006. At the same time, drug cartels have fought each other for control of territory.\nFacts\nAccording to a 2018 Congressional Research Service report , \"many sources indicate\" that about 150,000 intentional homicides since 2006 were organized crime-related.\nMexican drug cartels take in between $19 billion and $29 billion annually from drug sales in the US.\nMajor Cartels\nBeltran Leyva - Founded by the four Beltran Leyva brothers, Arturo, Carlos, Alfredo and Hector. Formerly aligned with the Sinaloa cartel. All of the brothers have been killed or arrested, but \"remnants\" of the group continues to operate in parts of Mexico, according to the US Drug Enforcement Agency's Founded by the four Beltran Leyva brothers, Arturo, Carlos, Alfredo and Hector. Formerly aligned with the Sinaloa cartel. All of the brothers have been killed or arrested, but \"remnants\" of the group continues to operate in parts of Mexico, according to the US Drug Enforcement Agency's 2018 National Drug Threat Assessment. The subgroups rely on alliances with the Jalisco New Generation Cartel, the Juarez Cartel and Los Zetas.\nGulf Cartel - Based in Matamoros, Tamaulipas, it started in 1920. It split with its enforcers, Los Zetas, by 2010, and the fallout between the two groups has been called the \"most violent in the history of organized crime in Mexico,\" according to a 2018 Congressional Research Service report. The cartel is now splintered into small, competing gangs.\nJalisco New Generation - Split from the Sinaloa Cartel in 2010, it is \"one of the most powerful and fastest growing in Mexico and the United States,\" according to the DEA assessment. The Mexican government has warned it's one of the most dangerous cartels in the country, especially after it shot down a military helicopter in May 2015. Rubén Oseguera Cervantes, known as \"El Mencho,\" is believed to be the group's leader.\nJuarez Cartel - Formerly aligned with the Sinaloa Cartel, then began fighting it for control of Ciudad Juarez and the state of Chihuahua.\nLa Familia Michoacana - Based in the Michoacan state. Possibly defunct as of 2011. It announced it would disband in 2010, but some cells are still active in Guerrero and Mexico states, according to the Congressional Research Service report.\nLos Zetas Cartel - Comprised of former elite members of the Mexican military. Initially they worked as hit men for the Gulf Cartel, before becoming independent. The group has a reputation for being particularly savage and is known for massacres, killing civilians, leaving body parts in public places and posting killings on the internet. The group's main asset is not drugs, but organized violence, including theft, extortion, human smuggling and kidnapping, according to the Congressional Research Report.\nSinaloa Cartel - Considered to be the dominant drug trafficking organization in Mexico. It was founded and led by Considered to be the dominant drug trafficking organization in Mexico. It was founded andled by Joaquin \"El Chapo\" Guzman , who was arrested in 2014, escaped in July 2015, and rearrested in January 2016. He was convicted in a US federal court in February 2019 . The cartel may now be operating \"with a more horizontal leadership structure than previously thought,\" according the US DEA report.\nTijuana/Arellano Felix Cartel - Based in Tijuana. Most of the Arellano Felix brothers have been apprehended or killed.\nTimeline\nDecember 11, 2006 - Newly elected Mexican President Felipe Calderon deploys more than 6,500 Mexican soldiers to the state of Michoacán to battle drug traffickers.\n2006 - In the first few weeks of the government crackdown on drug trafficking, 62 people are killed. (Mexican government, April 2010)\nJanuary 2007 - Captured drug lord Osiel Cardena Guillen, alleged former head of the Gulf cartel, is extradited to the United States.\nFebruary 2007 - More than 20,000 Mexican soldiers and federal police are spread out across Mexico as part of President Calderon's drug war.\nJune 25, 2007 - President Calderon fires 284 federal police commanders to weed out corruption.\n2007 - In the first full year of the drug war, 2,837 people are killed. (Mexican government, April 2010)\nJanuary 2008 - Alfredo Beltran Leyva, of the Beltran Leyva Cartel, is arrested by Mexican police in Culiacan, Sinaloa, Mexico.\nMay 1, 2008 - Roberto Velasco Bravo, Mexico's director of investigation for organized crime, is killed in Mexico City.\nMay 8, 2008 - Edgar Eusebio Millan Gomez, Mexico's federal police chief, and two bodyguards are killed in Mexico City.\nMay 9, 2008 - The commander of Mexico City's investigative police force, Esteban Roble Espinosa, is killed outside his home.\nSeptember 15, 2008 - During an independence day celebration in Morelia's town square, grenades are thrown into the crowd, killing eight people. The incident has been described as the first terrorist-style attack on innocent bystanders in Mexico's drug war.\nNovember 1, 2008 - The acting head of Mexico's Federal Police, Victor Gerardo Garay, resigns under suspicion of corruption.\n2008 - In 2008, 6,844 people are killed in Mexico's drug war. (Mexican government, April 2010)\nNovember 3, 2009 - The reported head of the Los Zetas drug cartel, Braulio Arellano Dominguez, is killed in a gun battle with Mexican forces in Soledad de Doblado.\nDecember 16, 2009 - Arturo Beltran Leyva, head of the Beltran Leyva cartel, is killed in a shootout with Mexican forces in Cuernavaca.\n2009 - The Mexican government reports 9,635 deaths in 2009 in the drug war. (Mexican government, April 2010)\nJanuary 2010 - Carlos Beltran Leyva is arrested by Mexican authorities in Sinaloa. He is the third Beltran Leyva cartel brother to be captured or killed in two years.\nFebruary 25, 2010 - Osiel Cardenas Guillen, head of the Gulf Cartel until his capture in 2003, is sentenced to 25 years in prison in Texas. He is also forced to turn over $50 million to the United States.\nMay 26, 2010 - Pedro Roberto Velazquez Amador, allegedly the leader of the Beltran Leyva cartel in San Pedro, is killed in a shootout with federal forces in northern Mexico.\nJune 11, 2010 - Edgar Valdez Villarreal, \"La Barbie,\" an American citizen, is charged with trafficking thousands of kilograms of cocaine into the United States between 2004 and 2006. He remains a fugitive with a $2 million reward for information leading to his capture.\nJune 25, 2010 - A leader in the Sinaloa cartel, Manuel Garibay Espinoza, is arrested in Mexicali.\nJuly 29, 2010 - Ignacio \"Nacho\" Coronel Villarreal, one of the leaders of the Sinaloa drug cartel, is killed in a military raid in Guadalajara's suburbs.\nAugust 25, 2010 - The bodies of 72 migrants from South and Central America are discovered on a ranch in Tamaulipas state. It is believed the 58 men and 14 women were kidnapped by the Los Zetas cartel and killed for refusing to traffic drugs.\nAugust 30, 2010 - Mexican authorities announce that they have captured \"La Barbie.\"\nSeptember 10, 2010 - President Calderon tells CNN en Español, \"We live next to the world's largest drug consumer, and all the world wants to sell them drugs through our door and our window. And we live next to the world's largest arms seller, which is supplying the criminals.\"\nSeptember 12, 2010 - A top leader in the Beltran Leyva cartel, Sergio Villarreal, is arrested in the city of Puebla.\nNovember 5, 2010 - Antonio Ezequiel Cardenas Guillen, aka Tony Tormenta, allegedly the head of the Gulf cartel, is killed in a shootout with Mexican forces in Matamoros.\nJanuary 2011 - The Mexican government says that 34,612 citizens have been killed during the four-year drug war.\nJanuary 17, 2011 - Flavio Mendez Santiago, one of the original founders of Los Zetas, is captured near Oaxaca.\nFebruary 15, 2011 - US Immigration and Customs Enforcement Agents Jaime Zapata and Victor Avila Jr. are run off the road in Mexico and attacked by a group of armed men who open fire. Zapata dies and Avila survives a gunshot wound to his leg. The Los Zetas drug cartel is suspected.\nFebruary 23, 2011 - Mexican soldiers arrest six members of the Los Zetas drug cartel, including Julian Zapata Espinoza, who is allegedly responsible for the death of US ICE Agent Zapata.\nMarch 5, 2011 - Alleged Los Zetas drug cartel member Mario Jimenez Perez is arrested in connection with Zapata's murder.\nMarch 7, 2011 - Alleged Los Zetas drug cartel leader, Marcos Carmona Hernandez, is arrested.\nApril 2011 - Several mass graves holding 177 bodies are discovered in Tamaulipas, the same area where the bodies of 72 migrants were discovered in 2010.\nApril 16, 2011 - Mexican authorities announce the arrest of Martin Omar Estrada Luna -- nicknamed \"El Kilo,\" a presumed leader of the Los Zetas drug cartel. Estrada Luna has been identified by authorities as one of three prime suspects behind the mass graves discovered earlier in April.\nApril 29, 2011 - Former drug cartel leader Benjamin Arellano Felix is extradited to the United States.\nMay 8, 2011 - Twelve suspected members of the Los Zetas drug cartel and a member of Mexico's navy are killed in a shootout on a Falcon Lake island. Authorities say the suspected drug traffickers were storing marijuana on the island.\nMay 29, 2011 - Ten police officers, including a police chief, are arrested on charges of protecting the Los Zetas drug cartel.\nJune 2011 - A congressional report shows that about 70% of firearms seized in Mexico and submitted to the ATF for tracing came from the United States. The report covers 29,284 firearms submitted in 2009 and 2010.\nJune 21, 2011 - Mexican federal police capture Jose de Jesus Mendez Vargas, also known as \"The Monkey,\" the alleged head of La Familia Michoacana cartel in Augascalientes.\nJuly 3, 2011 - Mexican authorities arrest Jesus Enrique Rejon Aguilar, known as \"El Mamito,\" a reported founding member of the Los Zetas Cartel and allegedly connected to ICE Agent Jaime Zapata's death.\nJuly 11, 2011 - The US government announces a plan to require gun dealers in California, Arizona, New Mexico and Texas to report the sales of semiautomatic rifles under certain conditions in an effort to stem the flow of guns to Mexican drug cartels.\nJuly 27, 2011 - Edgar Jimenez Lugo, known as \"El Ponchis\" or \"The Cloak,\" a 14-year-old American citizen with suspected drug cartel ties, is found guilty of beheading at least four people. He is sentenced to three years, the maximum for a juvenile, in a Mexican correctional facility.\nJuly 30, 2011 - Mexican authorities announce they have Jose Antonio Acosta Hernandez, or \"El Diego,\" in custody. He is the purported leader of La Linea, the suspected armed branch of the Juarez drug cartel, and considered responsible for the death of US Consulate employee Lesley Enriquez and her husband Arthur Redelfs.\nAugust 1, 2011 - Mexican federal police arrest Moises Montero Alvarez, known as \"The Korean,\" a suspected leader of the Independent Cartel of Acapulco (CIDA) and allegedly connected with the murders of 20 Mexican tourists in 2010.\nAugust 25, 2011 - At least 52 people are killed in an attack on the Casino Royale in Monterrey, Mexico. Witnesses say up to six people entered the Casino Royale and demanded money from the manager. When the manager refused to pay, the building was set on fire.\nAugust 30, 2011 - Mexican officials allege that five suspects arrested in connection with the Mexico casino fire are members of the Los Zetas drug cartel. The suspects are identified as Luis Carlos Carrazco Espinosa; Javier Alonso Martinez Morales, alias \"el Javo;\" Jonathan Jahir Reyna Gutierrez; Juan Angel Leal Flores; and Julio Tadeo Berrones, alias \"El Julio Rayas.\"\nSeptember 1, 2011 - A Nuevo Leon state police officer, Miguel Angel Barraza Escamilla, is arrested in connection with the casino fire in Monterrey.\nSeptember 13, 2011 - A murdered man and woman are found hanging from a bridge in Nuevo Laredo. Near their mutilated bodies is a sign saying they were killed for denouncing drug cartel activities on a social media site. The sign also threatens to kill others who post \"funny things on the internet.\"\nOctober 12, 2011 - A suspected top Los Zetas drug cartel leader, Carlos Oliva Castillo, alias \"La Rana,\" or \"The Frog,\" is arrested for allegedly ordering the attack on the Monterrey casino.\nJanuary 4, 2012 - Benjamin Arellano Felix, a former leader of Mexico's Tijuana drug cartel, pleads guilty to charges of racketeering and conspiracy to launder money. The plea deal calls for the forfeiture of $100 million to the United States and a maximum of 25 years in prison.\nJanuary 11, 2012 - The office of Mexico's Attorney General releases a statement saying that nearly 13,000 people were killed in drug violence between January and September 2011.\nAugust 31, 2012 - Eduardo Arellano Felix, an alleged senior member of a Tijuana-based drug cartel, is extradited from Mexico to the United States. Arellano Felix was arrested on October 25, 2008, after a gun battle with Mexican forces. He is later sentenced to 15 years in US prison.\nSeptember 3, 2012 - In his final state of the nation address, President Calderon defends his government's approach to combating crime and drugs and criticizes the United States for providing criminals with almost \"unlimited access\" to weapons.\nSeptember 4, 2012 - Mexican authorities announce the capture of Mario Cardenas Guillen, also known as \"M1\" and \"The Fat One,\" a suspected leader of the Gulf cartel.\nSeptember 27, 2012 - Mexican marines capture and arrest a man claiming to be Ivan Velazquez Caballero, alias \"El Taliban.\" Velazquez Caballero is one of the top leaders of Los Zetas.\nOctober 9, 2012 - Mexican authorities confirm that Mexican marines killed Heriberto Lazcano Lazcano, leader of the Zetas cartel, in a shootout on October 7. Lazcano's body was stolen from a funeral home on October 8, but authorities had already taken fingerprints and photographs to confirm his identity.\nJuly 15, 2013 - Los Zetas cartel leader Miguel Angel Trevino Morales, known as Z-40, is detained by Mexican authorities in an operation in the Mexican border state of Tamaulipas, state media reports.\nAugust 20, 2013 - Mario Ramirez-Trevino, ranking member of the Gulf cartel and also known as \"X-20,\" is captured in Reynosa, a city in Tamaulipas state.\nFebruary 22, 2014 - A US official tells CNN that Joaquin \"El Chapo\" Guzman, the boss of one of Mexico's most powerful drug trafficking operations, has been arrested in Mexico.\nMarch 9, 2014 - during an arrest attempt, according to Mexican authorities. He was one of the leaders and main founders of La Familia Michoacana cartel. This is the second time Mexican officials have claimed Moreno is dead. They also announced his death in 2010. Cartel leader Nazario Moreno Gonzalez, also known as \"El Chayo,\" \"El Doctor\" and \"El Mas Loco,\" The Craziest One,\" is fatally shot during an arrest attempt, according to Mexican authorities. He was one of the leaders and main founders of La Familia Michoacana cartel. This is the second time Mexican officials have claimed Moreno is dead. They also announced his death in 2010.\nOctober 1, 2014 - head of the Beltran Leyva drug cartel, in San Miguel de Allende, Mexico. Mexican police capture Hector Beltran Leyva, head of the Beltran Leyva drug cartel, in San Miguel de Allende, Mexico.\nOctober 9, 2014 - Authorities announce that Mexican federal police have captured alleged Juarez Cartel boss Vicente Carrillo Fuentes.\nJuly 11, 2015 - Guzman previously escaped from prison in 2001 in a laundry cart and eluded authorities for more than a dozen years until his capture in 2014. \"El Chapo\" escapes through a hole in his cell block that led to a tunnel nearly a mile long. Guzman previously escaped from prison in 2001 in a laundry cart and eluded authorities for more than a dozen years until his capture in 2014.\nJanuary 29, 2016 - A cross-border raid by US and Mexican law enforcement officials results in the arrest of 24 Sinaloa cartel members. The sting also netted weapons and hundreds of pounds of narcotics.\nMarch 14, 2017 - Veracruz State Attorney General Jorge Winckler confirms that a Veracruz State Attorney General Jorge Winckler confirms that a mass grave containing more than 250 human skulls has been uncovered . The remains appear to be victims of organized crime violence killed in recent years.\nMay 2, 2017 - , a high-ranking leader of Mexico's Sinaloa drug cartel, is arrested in Mexico City. Dámaso López Nuñez , a high-ranking leader of Mexico's Sinaloa drug cartel, is arrested in Mexico City.\nDecember 19, 2017 - The US Department of Justice announces the extradition from Mexico to the US of two alleged former Mexican drug cartel leaders -- Mario Ramirez-Trevino, alleged former leader of the Mexican Gulf Cartel, and an associate of Guzman, Victor Manuel Felix-Felix, alleged leader of a Mexican money laundering and cocaine trafficking organization. Ramirez-Trevino was charged and arrested in 2013 and has been in Mexican custody since. Felix-Felix was indicted in March 2011.\nFebruary 9, 2018 - Mexican authorities capture the alleged head of the Zetas drug cartel, Jose Maria Guizar Valencia.\nJune 11, 2018 - \"La Barbie\" is sentenced to 49 years and one month in prison and fined $192,000, the US Justice Department says.\nFebruary 12, 2019 - Guzmán is convicted of 10 counts in a New York federal court. He faces a mandatory life sentence without the possibility of parole for leading a continuing criminal enterprise, and a sentence of up to life imprisonment on drug counts. His attorneys say they plan to file an appeal on a number of issues.\nAugust 8, 2019 - Mexican police find 19 bodies in Mexico City. Nine of the bodies are found hanging from an overpass alongside a drug cartel banner threatening rival cartels.\nFebruary 11, 2020 - Quintero Arellanes is charged with participating in an international drug conspiracy during his time as part of the Rafael Caro Quintero organization.", "url": "https://www.cnn.com/2013/09/02/world/americas/mexico-drug-war-fast-facts/index.html"}