{"authors": ["Shawn Gude", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:54", "date_modify": "2020-05-04 19:50:54", "date_publish": "2013-08-16 00:00:00", "description": null, "filename": "2013_08_capitalism-vs-democracy_1588621854.html", "image_url": "https://images.jacobinmag.com/2013/08/16233806/capitalism_1435629c-2.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_08_capitalism-vs-democracy_1588621854.html", "title": "Capitalism vs. Democracy", "title_page": "Capitalism vs. Democracy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "If Washington, DC Mayor Vincent Gray signs a bill mandating big retailers pay a living wage, he’ll do more than raise workers’ remuneration.\nHe’ll establish a potent precedent for powerful corporate actors like Walmart. Threaten to shelve construction plans, as the retail giant has warned it will do if the legislation is approved, and democratic governments will remain undeterred. He’ll demonstrate that elected officials, instead of being cowed by businesses that blackmail, can bring them to heel. He’ll prove that policies which corporations bitterly oppose, which negatively affect their best efforts at unbridled accumulation, don’t have to be deep-sixed.\nAt issue, in other words, is the relationship between democracy and capitalism. Can the prerogative of capital be curtailed, or must self-governing communities accept the terms that corporations dictate?\nGray, who expended a great deal of energy trying to lure Walmart to the nation’s capitol, is expected to veto the living wage legislation; it’s set to hit his desk today. The Large Retailer Accountability Act is narrowly drawn, applying only to stores which exceed 75,000 feet and whose parent companies pull in more than $1 billion in gross annual revenue. The businesses who meet those criteria — the most prominent of which is Walmart — would be required to pay workers at least $12.50. In July, less than than 24 hours before the DC Council was set to vote on the proposal, Walmart said they’d forgo construction of at least three stores if the city imposed the wage floor. But the Council stood fast. They approved the legislation by a vote of 8-5, one shy of a veto-proof majority. Since then, Target, Home Depot, and other retailers — unaffected, as of yet, but still vexed — have registered their own disapproval.\nIn defense of the living wage bill, pro-labor liberals have rightly argued that Walmart, an immensely profitable company, can easily afford to pay its employees a relatively paltry $12.50. They’ve also pointed to the stimulative effect of boosting low-wage workers’ pay. What’s been missing, however, is a forceful defense of public power to rectify injustice in the market, of the right of citizens and their representatives to constrain capitalism’s cruelty. Government action shouldn’t supplant collective, extra-legislative worker action. But when corporations unceasingly quash organizing attempts, it’s salutary for the state to step in.\nNot to say it’s easy. The vituperation with which Walmart has attacked the living wage bill is perhaps most striking because capital’s threats, typically tacit, have actually been openly made. The Council dared question the untrammeled control of capital, and now they’re seeing the result of such temerity. Even marginally shifting the locus of power from capital to labor — even if it’s done by a state that usually does the bidding of business — is enough to occasion outcry from the business community. DC’s deputy mayor, for instance, has said,“People have no idea how damaging this is,” and argued that even a veto wouldn’t be enough to restore business confidence.\nThe controversy throws into sharp relief one of our era’s great unspoken truths: Capitalist democracy, if not an oxymoron, is less a placid pairing than an acrimonious amalgamation. The marriage that Francis Fukuyama famously pronounced eternal is in fact a union of opposites. Inherent to capitalism is inequality, fundamental to democracy is equality. Class stratification, the lifeblood of capitalism, leaves democracy comatose. The economic “base,” to put it in classical Marxian terms, actively undermines the purported values of the political superstructure.\nCapitalist democracy is a domesticated democracy. Even before it makes its existence visible in the political arena — via campaign donations and high-powered lobbyists — capital markedly narrows the range of policies available to citizens and their elected officials. Policies which impinge upon that most sacrosanct of things, private property, or severely hinder the profitability of firms aren’t formally rejected. They don’t have to be. The mobility of capital ensures that corporations can play governments off of each other, forcing them to compete to be the most “business friendly.” Capital strikes are the other nuclear option.\nBut it never really comes to that. The implicit threat of adverse actions is enough. Consequently, absent sustained pressure from below, the array of policy options available to a nominally democratic polity is extremely limited. The citizen, guaranteed legal equality and self-determination, is reduced to a supplicant.\nCapitalist enthusiasts no doubt welcome this check on popular power, viewing the market and private businesses as countervailing forces that constrain an otherwise overweening state. Liberal democracy, to them, means markets are opened and private property is inviolable. But it’s at least important to recognize the capital-as-counterbalance justification for what it is: A profoundly anti-democratic position, a severe restriction on popular sovereignty.\nThis isn’t to say that the DC Council is democracy embodied, or even that the LRAA’s passage would be a substantial blow to corporate power. The living wage campaign is ultimately a fight for a more humane capitalism. A genuinely democratic society requires we go beyond that. But Gray does have an important decision to make, in the here and now: Capitulate to capital, or demonstrate the justness of a properly wielded democratic state. Whatever he elects to do, this much is clear: the contradictions between democracy and capitalism have been on full display, as they so rarely are.", "url": "https://www.jacobinmag.com/2013/08/capitalism-vs-democracy"}