{"authors": ["Shawn Gude", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:57", "date_modify": "2020-05-04 19:50:57", "date_publish": "2013-12-16 00:00:00", "description": null, "filename": "2013_12_in-defense-of-entitlements_1588621857.html", "image_url": "https://images.jacobinmag.com/2013/12/16234251/hammock-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_12_in-defense-of-entitlements_1588621857.html", "title": "In Defense of “Entitlements”", "title_page": "In Defense of “Entitlements”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The word “entitlement” is widely held in disrepute. It conjures up images of a petulant child, wailing for candy in the grocery store aisle, or a slovenly freeloader demanding something for nothing.\nRonald Reagan, political acumen never in doubt, was the first major politician to cast the popular programs as “entitlements,” in an effort to malign them. (The term’s first appearance, according to conservative scholars Norman Ornstein and John Makin, was in the legalese of the 1974 Congressional Budget and Impoundment Control Act.) Today’s conservatives are convinced the salient schism in American society is between “makers” and “takers.” Mitt Romney, in the candid moment that torpedoed his campaign, excoriated the 47 percent of Americans who pay no federal income tax, yet “believe the government has a responsibility to care for them.” Paul Ryan, among others, frets that citizens are becoming coddled; that the social safety net has turned into a “hammock.”\nIn response, liberal defenders of the welfare state prefer to call food stamps and the like “social insurance.“ Democrats, the party most responsible for Medicare, Medicaid, and Social Security but aware of the word’s negative associations, usually balk at its use as a descriptor. They endorse social safety nets, not senses of entitlement.\nThe trepidation is misplaced. Whatever its connotations and origins, “entitlements“ has become a staple in the political lexicon. The word isn’t vanishing, even if liberals vow it will never pass their lips. So the choice is really one of concession or appropriation, whether to cede rhetorical ground or turn its widespread use to the welfare state’s advantage. And whether liberals decide to claim it for their own, radicals and leftists should.\nThe rush to erase the term ignores its potency. The discourse of entitlement is a discourse of rights, of human agents claiming what’s theirs instead of asking permission from the powerful. It’s a tradition that regards paternalism and noblesse oblige as pejoratives. Dignity, not charity, is the animating principle. People earn access to the rudiments of life (food, healthcare, shelter) by virtue of their humanity. Rights language invites the beggar to rise from his knees and, without equivocation or supplication, demand his humanity be recognized. Workers are entitled to a living wage. Children are entitled to grow up free from poverty. Homeless people are entitled to a home.\nIn an era of Gilded Age-level inequality and austerity, “entitlements” and “rights” should become watchwords, used to push back against government retrenchment and economic exploitation and deprivation. It could even provide the rhetorical basis for an expanded welfare state based on solidarity and universal delivery.\nThe high-water mark of rights language, at least in recent memory, was the black freedom movement. In the late 1960s and early 1970s, after decades of struggle, legal rights had mostly been secured. Social and economic rights were next. Martin Luther King’s attention turned to the Poor People’s Campaign, welfare recipients mounted sit-ins at government agencies, and even Richard Nixon backed a guaranteed minimum income. The “equality of outcome” Democrats that the present-day GOP habitually castigate weren’t conjured out of thin air — actual leaders of the party like George McGovern, the Democrats’ 1972 presidential nominee, were arguing for these policies.\nThe National Welfare Rights Organization was the most prominent, most militant group of the period to couch its grievances in the locution of rights. Welfare recipients (overwhelmingly mothers) living in the wealthiest, most powerful nation in the world knew they had neither wealth nor power. They demanded their time spent raising their children be recognized as work, and that they be treated as full citizens entitled to share in the postwar economic boom. A 1971 statement by one of the group’s leaders articulated what came to be the central demand of the organization: “We are about a ‘Guaranteed Adequate Income’ for all Americans; and that means a true redistribution of this country’s resources in such a way as to guarantee the right to a decent life to all Americans, be they man [or] woman; black, white, or red; working or non-working.”\nLess visible but arguably more effective were the loosely organized throngs who, claiming their right to an adequate existence, expanded the welfare rolls before the NWRO had even gotten off the ground by storming welfare offices and demanding all the benefits to which they were legally entitled. It was this discontented mass, Frances Fox Piven and Richard Cloward argue in their classic book Poor People’s Movements , that constituted the core of the welfare rights movement. If they weren’t speaking the language of rights, they were putting it into practice. The present-day progeny of the NWRO include groups like Baltimore’s United Workers, who organize to secure the “rights to housing, health care, social security, welfare, work with dignity, living wages and labor organizing.”\nMany scholars have observed the difficulty of building a strong welfare state in a heterogeneous society. Racial and ethnic and religious cleavages — all tend to make people less trusting and more acrimonious. Policy-wise, the only way around this is constructing a welfare state that delivers universal benefits rather than means-tested benefits. Social Security and Medicare are the best examples of the universal approach, which give programs a solidaristic, cross-class foundation. It makes them more difficult to cut. Few Social Security recipients feel they’re living “on the dole,” but they do feel entitled to their monthly government check.\nIn the long term, the only solution to class division is the eradication of class. But entitlement language seems to offer one way, rhetorically, to shrink the chasms in American society. If universally deployed, the discourse of entitlement could help undergird a robust welfare state.\nCurrently, a chastened and inept Democratic Party can’t even effectively defend its biggest achievements. Having bought into the need for budget cuts, perpetually trumpeting their fealty to “fiscal responsibility,” Democrats have positioned themselves in a confounding, contradictory balancing act: They’re ostensibly seeking to safeguard the victories of the New Deal and Great Society, even as they’ve long cast off — if not repudiated — the kind of liberalism that defined those epochs. Liberals have fled from the social democratic precepts of FDR’s Four Freedoms, and McGovern is just a bogeyman used to discipline candidates who stray too far from the political center.\nOnce capable of invoking social rights, many in the party are now willing to entertain the idea of means testing. To his credit, President Obama said in a recent speech, “when previous generations declared that every citizen of this country deserved a basic measure of security — a floor through which they could not fall — we helped millions of Americans live in dignity, and gave millions more the confidence to aspire to something better, by taking a risk on a great idea.” But it appears he’ll fete his forebears while unraveling their gains, allured by the idea of the Grand Bargain. Senate Democrats and House Republicans are at an impasse over how much to slash food stamps.\nBut unmet needs debase people. Satisfying necessities is a precondition for self-determination and self-governance; for moving us beyond our most primordial needs. In injecting insecurity, anxiety, and circumspection into our lives, economic dependency saps us of our ability to lead dignified, autonomous existences. People are forced to grovel to get by, to accept whatever job they can find or stay in abusive relationships to stay afloat financially.\nFar from inducing dependency, the welfare state brings substance to the purely formal rights of the law. It makes life a little less cruel, a little less insecure. And reducing that cruelty is, without question, our entitlement.", "url": "https://www.jacobinmag.com/2013/12/in-defense-of-entitlements"}