{"authors": ["Connor Kilpatrick", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 20:00:19", "date_modify": "2020-05-04 20:00:19", "date_publish": "2013-09-16 00:00:00", "description": null, "filename": "2013_09_alexander-cockburn-the-last-polemicist_1588622419.html", "image_url": "https://images.jacobinmag.com/2013/09/16233905/large-2.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_09_alexander-cockburn-the-last-polemicist_1588622419.html", "title": "Alexander Cockburn: The Last Polemicist", "title_page": "Alexander Cockburn: The Last Polemicist", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Transcript of remarks delivered at a celebration of Alexander Cockburn in Brooklyn earlier this month.\nI’m honored to have been invited to speak here. But seeing as how everyone else is either a relative of Alexander’s or a personal friend, I’d like to talk about what his writing meant to someone who never met or corresponded with the man as well as someone who, as a dreaded Millennial, arrived on the socialist left during the Bush-Obama years thanks in large part to the brilliant polemics of Alexander Cockburn.\nEveryone knows Alex’s great bit about his hate being pure. If you don’t know the story, it’s a tradition that Alex inherited from his editor Jim Goode who’d test Alexander’s morale and commitment to the good fight by asking him if his “hate” for the powerful was truly pure. Alex would then put the same question to his interns at the Nation . One such intern, a young Ed Miliband, soon to be the next Prime Minister of the United Kingdom, replied with shock that he did not, in fact, hate anyone. As Alex put it: “It’s all you need to know.”\nSo yes, Alex’s hatred was most certainly pure. But somehow, for me, that doesn’t really get at what made his writing so wonderful. Because it was a joyful hate that Alex nurtured. An inspiring hate.\nFor all the talk of his sharp tongue and even sharper pen, we are, after all, talking about a man who once confessed to weeping on an airplane as he watched 1993’s Homeward Bound: The Incredible Journey , a film about two talking dogs and a sassy cat trying to make their way back home.\nOnce I came across a video of a mid-1980s C-SPAN appearance of Alex’s. The callers that day were hostile, accusing him of being a foreign communist of sorts. Alex kept up his spirit, smiling all the way through. One particularly angry man called in and shouted “don’t smile at me.” Alex replied that he could smile all he wanted to. And then he let him have it: a tight grin, those marvelous Cockburn-family cheekbones, aimed right at the camera.\nAs great as Alex’s prose is, the man could just as easily deliver a fiery sermon, truly a lost art on the Left. Not only the dozens of appearances over the years on C-SPAN shows but more obscure bits like a grainy video of Alex speaking at an anti-war rally in rainy Eureka, CA just outside the Humboldt County Courthouse. In this one, Alex is standing next to an actual guillotine just to his right. He starts off with: “A few facts about the guillotine: it was invented by a liberal!”\nHe then goes on to deliver a passionate defense of both the French Revolution, popular sovereignty and the guillotine itself. “If every corporate chieftain in the United States, as he told his employees to break the law, as he asked his lawyers to get him off the hook, as he cheated people with his products, if he knew that there was one possibility that the blade would go up and the blade would come down, we’d have a better society.”\nI remember one of my favorite Cockburn spiels was from Tao Ruspoli’s documentary Behind the Wheel . In the first clip, right at the peak of the Bush administration’s power, Alex says sure, everything’s gone to hell. And of course there’s no hope. But, Alex said: Bread and coffee. Bread and coffee today in the United States is infinitely better than what it was when he first came here. “The staples of life,” he says. He wasn’t joking around. He was serious. This was the kind of thing no one cares about. But he was right. There was change we could believe in. One third of “Peace, Land, Bread” and that’s nothing to scoff at.\nAnd then he went on:\nYou do what you can. You have to take the long view sometimes. Supposing we’re in the Roman empire in 300 AD . . . We’ve seen there’s a future for secular leftism in the Roman empire . . . Actually if you took the longview people would say “these people were completely insane in the third century.” Cause there’s centuries of not exactly radical advance ahead of them. But were they wrong to say I think we can nationalize land, release all the slaves build a communal society in northern Tuscany?\nI always thought of this as the Cockburn version of Kafka’s famous dictum: “there is hope but not for us.” Which strikes me as wonderfully optimistic.\nSo Alex’s hate, ever pure, is just the twin of — and sorry to sound like a total hippy here — his love. His love of America’s lost interior. His love of freaks and weirdos, the dispossessed, the losers and the forgotten.\nWhat’s remarkable about all of this is that Alexander stayed a radical for his entire life even as the last several decades were spent watching the liberal-left transform into something beyond tepidity. I don’t know how he did it. I certainly couldn’t have managed. I’d have been running for either an MBA program or an Oregon commune. As I was telling some friends of mine at Jacobin , I cannot imagine what it must feel like to come to the United States as a committed radical in the early 1970s, the son of Claud Cockburn, and have to watch the whole sorry affair of Carter, Clinton, and Obama play out for decades.\nBut thank God he was here. Because, in the words of Cormac McCarthy, he carried the fire. And when he passed it off, I honestly couldn’t care less if he’d taken a few detours from the correct and proper socialist path. Because that was half the joy of reading his work.\nAs a socialist of my generation, I’m sure you can guess where I differed with Alex. But the thing was: I stopped caring whenever I disagreed or thought he was cozying up to the wrong crowd. Or when I thought he was training his fire on the wrong segments of the Left. Not only because we needed to hear a lot of it, but because it was always tempered with that optimism, that joy of his.\nI spent the first twenty-five years of my life feeling trapped in Texas. I was born to conservative parents and raised in petty-bourgeois sunbelt suburbs. I grew up around lots of fundamentalists, lots of Republicans, lots of football, lots of churches, plenty of guns, and of course lots of deer and dove hunting expeditions with my father’s drunken cajun buddies. At the age of 11, in a defiantly colorful Keith Haring printed shirt, I accepted a certificate from the Texas Big Game Awards for a 12-pt buck I’d shot.\nI hated it all. Like most left-thinking kids growing up in such places, I got the hell out of there as fast as I could.\nAnd the truth was that despite my supposed socialism, it made me a snob. Alex however, despite a healthy love for folks like Marx, Engels and even the dreaded Lenin, never became a snob. He never turned his nose up like I did at the Red States. Whenever I’d read him talking about his encounters bumping along the ex-Confederate hinterland, I’d find myself saying “goddamnit it, Alex. Don’t you get it? These people are racist, theocratic, quasi-fascist bastards. If you weren’t from Ireland, you’d totally get this.”\nWhen liberals and lefties dismissed the Tea Party, calling it an inauthentic “astro-turf” operation, Alex was quick to call them on their smugness: “You think the socialist left across America can boast of 647 groups, or of any single group consisting of more than a handful of people?”\nAlex was right to relentlessly pound Clinton liberalism and to show no mercy to its defenders. He was right to rebuke them for embracing what he called “fake politics.” And he was right to call out the Left for having fled the battle altogether and surrendered so much energy, passion and enthusiasm to the right-wing.\nAnd when a new radical Left finally did begin to slowly emerge, he was also on the mark. Particularly with Occupy Wall Street, which he approached with just the right balance of enthusiasm and criticism. While other lefties his age were sounding the trumpets for the return of a big bold movement of Reds, Alex was far more cautious.\nIt must be the dratted Leninist in me, even after years of therapy. Surfeited with somewhat turgid paeans to the democratic gentility of the OWSers, I clamber up to the dusty top shelf, furtively haul down Vladimir Ilich’s April Theses of 1917 and dip in: end the war, confiscate the big estates, immediately merge all the banks into one general national bank… The blood flows back into my cheeks, my eyes sparkle.\nAlex knew that a smart, organized and politically-minded Left doesn’t just spring out of decades of de-politicization. He knew that pats on the back wouldn’t do them any good. He decried the collapse of a Marxian left which, in his words, “used to provide a training ground for young people who could learn the rudiments of political economy and organizational discipline, find suitable mates and play their role in reproducing the left, red diaper upon red diaper, tomorrow’s radicals, nourished on the Marxist classics . . . An adolescent soul not inoculated by sectarian debate, not enriched by the and study groups of Capital , is open to any infection.”\nAnd it’s in this sense that Alex played what I think was his most valuable role for the left, though as a staunch anti-militarist, he’d probably hate the metaphor: he was like our drill sergeant. He hurled abuse at us — but beautifully stated and almost alway hilarious abuse — from every possible direction. “Oh, maybe if Hillary — SLAP!” “Oh, maybe if I buy organi — SLAP!” “Oh, if only the Democrats — SLAP!” “The Kennedys were the last true — SLAP!” But why was he doing it? Because he was mean? No. Because he wanted us to survive. He wanted us to win.\nAnd honestly, we needed it.", "url": "https://www.jacobinmag.com/2013/09/alexander-cockburn-the-last-polemicist"}