{"authors": ["Mike Beggs", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:49", "date_modify": "2020-05-04 19:57:49", "date_publish": "2013-07-16 00:00:00", "description": null, "filename": "2013_07__1588622269.html", "image_url": "https://images.jacobinmag.com/2013/07/16233659/beggs-2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_07__1588622269.html", "title": "Dollar Diplomacy", "title_page": "Dollar Diplomacy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "See the rest of our symposium on The Making of Global Capitalism .\nThe cover of The Making of Global Capitalism is framed by the border of the US dollar bill. Nothing symbolizes better what the book is about — the interface between state and economy, and in particular between the American government and the economic system of the whole world. “One of capitalism’s defining characteristics, compared with pre-capitalist societies, is the legal and organizational differentiation between state and economy.”\nNothing says commerce like money. But cash is stamped with the signs of sovereignty and references to public institutions and laws: a portrait of a national hero, emblems of Treasury and the Federal Reserve, signatures of particular policymakers, a legal declaration (“This note is legal tender for all debts, public and private”), and the marks of the bureaucratic organization of its production — serial numbers and anti-counterfeit devices.\nAnd then it has a number representing its value. Here it reaches beyond the state to refer to the role it plays in the economic system. The meaning of the number is not set by being printed on the bill. It is determined by the setting of prices and other rates of exchange that refer to the units on the bill; largely private decisions, validated by other largely private decisions to make payments at those prices. Policymakers are far from indifferent about the value of currency that emerges from the economic network, but this cannot be decided by fiat — unless the state itself were responsible for price-setting, in which case we would no longer talking about capitalist society. Policymakers can influence the value of money only through strategic engagement in the economic sphere to influence the conditions in which the strategic pricing decisions are made. This is a social system that transcends the state — while remaining dependent upon its agencies and legal infrastructures — and which has a very different organizational logic.\nThis strategic situation facing policymakers in their attempts to influence the value of their state’s currency is, I think, a productive entry point to wider questions about the relationship between capitalist states and capitalist economy, and also about the relationships between different states. It has certainly been of enormous importance to the co-evolution of states and economy over the whole period covered by this book. It is a thread that is almost everywhere in the complex weave of The Making of Global Capitalism . Once I decided to make it the focus of my reading, hardly three or four pages went by without an underlined passage, and some chapters are so full of my dog-ears that it looks like termites have attacked a corner of my copy. But it is not a theme that the authors explicitly draw out, so it seems worth exploring here. I will focus specifically on Bretton Woods and the postwar period and two or three chapters of the book — though I could have picked just about any section.\nIt would be wrong to start from the functionalist position that capitalism as such depends upon some particular level of stability in the measure of value, which has thus always been the responsibility of capitalist states. Measures of value have been anchored in a variety of ways over capitalism’s history, and those anchors have involved a diversity of state agencies and practices in a range of different social contexts. We can analyze them only as historical conjunctures. We can examine the interplay of strategies they emerged from and how they restructured the economic and political fields, how they functioned and why they ultimately broke down.\nThe plan Keynes took to Bretton Woods stipulated that “there should be the least possible interference with internal national policies”. It is actually very difficult to define what “interference with internal national policies” specifically means. National economic policy is not made in an existential vacuum of total freedom, but within political and economic contexts that always rule out many courses of action and make some paths strategically easier than others. Policy instruments involve actions in the economic system whose effects depend on and are limited by the logic of that system and the strategic reactions of other agents within it. Particular policy ends and means will also be influenced and limited by the political power, expectations and aspirations of classes and other groups, as channeled (or blocked) by the political system.\nIn both economic and political spheres, it can be difficult to make a firm distinction between constraints that come from inside and outside the nation. For conservatives of the interwar period, the advantage of resuming the gold standard was precisely that it did constrain policy. The international monetary regime was a tool for strengthening capitalist power domestically against the labor movement. As Keynes’s friend Bob Brand wrote to Keynes after the latter’s Tract on Monetary Reform, “Almost thou persuadest me. . . . But I don’t know what things will look like after a year or two of Ramsay MacDonald and Sidney Webb.”\nThis is a point that resonates throughout The Making of Global Capitalism . As the authors put it towards the end, “the conflicts that have emerged today in the wake of the greatest capitalist crisis since the 1930s are taking shape . . . less as conflicts between capitalist states and their ruling classes than as conflicts within capitalist states.” (p. 330) The “American empire” of their vision is not so much an imperialism of state against state, but a program in which the American state provided leadership and external political pressure that was welcomed by agents and owners of capital around the world as it reinforced them in their own political conflicts.\nThe evolution of standards of value is one field on which this has played out, because the history of monetary systems is a history of class struggle. Fluctuations in the internal value of a currency — i.e. in terms of a price index — are closely connected to wage-setting, and so to institutions that determine the bargaining power of labor and to the macroeconomic conditions in which bargaining takes place. Anything that concerns one concerns the others. This is why price level problems always involve so much more than the inconveniences, relative price distortions and redistributions of inflation itself.\nThe extent to which an international monetary regime seems constraining depends on what policymakers are expected to do. The classical 19th century gold standard was not a pre-capitalist survival, an atavistic fetish ready to dissolve upon exposure to rational judgment. As Samuel Knafo has argued, it was itself a highly modern and rational project which enhanced the power of central banks within the financial system in order to stabilize emergent systems of private bank credit-money. It seemed a “barbarous relic” only once it began to chafe against the rising economic power and political expectations of an ascendant labor movement, as it became more difficult to put the burden of periodic disinflationary adjustment onto wages.\nKeynes’s macroeconomic vision raised expectations about what it was possible for policy action to do, but it made calls on instruments that could be pulled in another direction by gold standard commitments. When Keynes called for a system that would minimize restraint on national governments, he was not really talking about negative freedom from external sanction — in fact in some ways his plan increased official sanctions on member governments — he blamed gold-hoarding in the US and elsewhere for some of the interwar troubles and wanted to discipline countries that ran chronic balance-of-payments surpluses. He meant positive freedom: an increased capacity for governments to pursue high employment.\nMichal Kalecki’s well-known paper, “Political Aspects of Full Employment” argued that capitalism would not be able to sustain full employment, for political rather than economic reasons: big business and rentiers would not abide it because it challenged their social dominance, and “they would probably find more than one economist to declare that the situation was manifestly unsound.” This is often seen as prescient, predicting the rise of Friedmanism a quarter-century before the fact. But such economists were already much in evidence in 1943, when Kalecki was writing. From the very end of the war, full employment had its naysayers, and they were by no means marginal characters. As Panitch and Gindin rightly stress, the tension between full employment and price stability was “the central contradiction of the postwar era” — not a problem that emerged only at the end of the 1960s.\nTo make too firm a distinction between “political” and “economic” aspects of the opposition to full employment is a mistake. In a democratic capitalist society, economic dysfunctions appear as political issues. They are open to different framings, but the systematic nature of the economic structure favors some over others. At least since the Keynesian revolution, which raised expectations on this front, capitalist governments have been judged on the extent to which they can stabilize the system. As Bob Jessop has written, the state is “just one institutional ensemble among others within a state formation” but one which “is peculiarly charged with overall responsibility for maintaining the cohesion of the social formation of which it is a part.” Political programs that could be plausibly linked to broader economic stability could thrive; those connected to dysfunctions had a strong current against them. Of course, what counted as “dysfunction” was open to negotiation: in postwar Australia, 3 percent unemployment was an outrage; now 5 percent is considered very respectable. But expectations themselves have been managed by the extent to which they seem achievable.\nAt the end of the war popular expectations for “full employment” were already being seriously moderated by the political culture and system of the United States. It never achieved the kind of political consensus it had in the UK or Australia: symptomatically, the Full Employment Bill of 1945 was watered down into the Employment Act of 1946, with economists like Henry Simons warning Congress that a full employment target could mean unacceptable inflation. In the 1940s and 1950s macroeconomic policy often aimed at restraint rather than stimulus, with the 1951 Accord between Treasury and the Federal Reserve — establishing market determination of the price of Treasury securities — “designed to ensure that ‘forces more radical’ within any administration would not be able to implement inflationary monetary policies.” Panitch and Gindin write:\nThe roots of “monetarism” — understood not in the sense of policy determined by arcane measures of money supply, but in the sense of giving macroeconomic priority to ‘manipulating short-term interest rates to control aggregate demand and inflation’ — thus really need to be located not in the 1970s but in the 1950s, during the supposed heyday of the Keynesian era.\nThe weight of the US economy in world markets, and the role of the dollar (and dollar-denominated Treasury securities) as international standard and store of value, meant that macropolicy there had repercussions everywhere. Domestic American politics also had a serious impact on how the Bretton Woods system managed the relationship between the international economy and the policy instruments of other states.\nMaintaining a fixed exchange rate to gold or to another currency required that a country’s central bank stand ready to buy and sell foreign currency at the going rate, so it was limited by its reserves of gold and foreign exchange. Bretton Woods would not remove this limit, which survived from the gold standard. Keynes’s proposals for the new regime aimed to loosen the constraints in several ways. Member governments would have access to a reserve pool of a new international currency, significantly larger and more flexible than existing reserves. This would extend the time over which countries could sustain a payments deficit without running out of reserves. Capital controls would prevent rapid speculative outflows from draining reserves. Penalties for surplus nations would redress to some extent the deflationary asymmetry of the gold standard — that countries had to worry about running out of reserves but could accumulate any amount. Finally, exchange rate adjustments would be allowed to deal with persistent imbalances.\nAs Panitch and Gindin detail, American negotiators went to Bretton Woods with quite different priorities. The US Treasury recognized the need for more wiggle room in adjustment, but not nearly to the extent Keynes’s British plan envisioned, and wanted much tighter conditions on access to the International Monetary Fund. (To give a sense of the quantities: Keynes’s Clearing Union proposal would have left the Australian government, for example, with three times the effective reserves it ended up with under the actual Bretton Woods system.) The US agreed to allow other countries to maintain capital controls, but (thanks to pressure from Wall Street) not to help in their policing, and “absent the crucial cooperation of the American state, they could not really be effective in the long run.” The final text of the Articles of Agreement stated that governments could adjust their exchange rate in conditions of “fundamental disequilibrium”, but this would be subject to IMF approval, and turned out to be very rare in practice after 1949.\nThough Bretton Woods was less flexible than Keynes had wanted, it was more flexible than what Wall Street wanted — a tougher set of IMF rules and free capital mobility. “If there was ever a case where the advantages of relative autonomy were manifest, allowing a capitalist state to act on behalf of capital but not at its behest, it was in the extensive public campaign to get the Bretton Woods agreement endorsed by Congress over the bankers’ opposition.”\nThe end result was nevertheless an international monetary system in which most national governments faced a particular kind of balance-of-payments constraint. Maintaining a fixed exchange rate still required that their central banks not run out of foreign exchange and gold reserves — with the balance shifting further towards the latter, and the US dollar displacing sterling. This meant balance-of-payments deficits could not be sustained indefinitely, though countries with surpluses could sterilize them and pile up reserves. The situation was different from that of the gold standard because of the obstacles to capital mobility, at least until later in the 1960s: speculative capital was less of a threat where credibility was lost, but also less supportive of a credible peg. So payments crises were slower moving, and focused policy attention mainly on trade and the current account.\nSo “external balance” joined full employment and price stability as the key macro-policy aims of the postwar period. The three were closely bound up with one another, as modeled in a growing 1950s macroeconomic literature on the interdependence of policy problems. Given the level of aggregate demand elsewhere and international price levels (which domestic policymakers could not hope to control), the trade balance would depend on domestic demand and the domestic price level. Home income mattered because, other things being equal, higher income meant more imports. Domestic prices and wage costs — relative to those abroad — mattered because they affected the competitiveness of export and import-competing industries. The domestic wage/price level could be “too high” in the sense that the current account would balance only at a lower level of output than that associated with full employment — and policymakers faced a dilemma.\nThe technocratic message of academic economics was that the state would need to gain more control over the wage, and so prevent the domestic cost structure from getting out of line with that abroad while maintaining full employment. Dutch economist Jan Tinbergen, whose work launched the modern neoclassical-Keynesian paradigm of economic policy analysis, argued that “wage rates have to be a deliberate instrument of economic policy if employment targets and monetary equilibrium are to be pursued at the same time.” James Meade, who set the standard postwar analysis of international macroeconomics with his 1951 Balance of Payments , argued that avoiding the “most bitter dilemma” of a trade-off between full employment and price stability would require one of four strategies with respect to the labor movement: “Stagnation, Starvation, Slavery or Seduction”. Meade himself favored Seduction.\nUnlike fiscal or monetary policy, which involved the strategic redirection and coordination of tools the state already possessed — government budgets and central banks — most states did not have very fine control over what happened in their labor markets: the money-wage was not at all an instrument in the sense that the base interest rate was an instrument. Even in a country like Australia with a centralized wage bargaining system, turning it to macroeconomic ends was very difficult. Seduction worked to some extent, with unions encouraged or forced to justify claims according to macroeconomic logic. But macroeconomic functionality always competed with other logics — not least, market logic, as when the pressure of demand for labor undermined nationally-negotiated wage restraint with overtime and other above-minimum payments. If money-wage growth could not be contained by some kind of corporatist arrangement, the discipline of unemployment loomed as regrettable back-up plan.\nThe international reserve role of the US dollar exempted it from the balance-of-payments constraint. Harry Dexter White, the chief US Treasury official at Bretton Woods, remarked that a dollar flow abroad resulting from full employment in America would be welcomed by a dollar-hungry world. (p. 75) So the demands of “external balance” did not directly pressure US policymakers into prioritizing price stability. Indeed, US payments deficits were functional for the system as a whole, as dollar reserves could only be accumulated elsewhere if the US was exporting dollars. The early postwar years, before the large US deficit began to accumulate, were felt as an acute “dollar shortage” in Europe and elsewhere — which gave the American state considerable leverage in negotiating the Marshall Plan. The strings attached to those Marshall Plan dollars limited the scope for policy freedom that they might otherwise have bought: recipient governments had to agree “to balance government budgets . . . restore internal financial stability . . . and stabilize exchange rates at realistic levels.”\nThis was not simply an imperial imposition, a subjection of states that would otherwise have been free to manage their economies as they saw fit. Neither was the economic pressure on policymakers facing international payments deficits. Both shifted the balance of power within domestic political struggles, and were welcomed by those forces that wanted to discipline wages and the power of the labor movement anyway. In West Germany, US tutelage strengthened but did not create the intensely Germanic tradition of ordoliberalism, committed to price stability, balanced budgets, and free markets. West German governments never needed to be disciplined by their balance of payments, maintained a persistent international surplus, and in 1961 even revalued the Deutschmark against the dollar.\nOther countries found labor costs rising faster than those of their trading partners and had to cope with chronic balance-of-payments problems. Most notably, France and the UK were forced into disinflationary stabilizations in the late 1950s and early 1960s respectively. Japan’s rapid growth repeatedly ran up against the balance-of-payments barrier. Why were exchange rates not allowed to adjust more often, to take the burden of adjustment off domestic demand and money-wages? Partly, because this would not necessarily relieve domestic policy at all: the higher international costs would feed back into wage-price spirals and mount pressure for further devaluation. And under Bretton Woods rules, devaluations had to be negotiated with the IMF, and would be made conditional on domestic stabilization. (The franc was in fact devalued twice in the late 1950s amidst a tight stabilization program.) But also, the exchange rate peg was domestically useful for political forces that could use the external constraint as a bulwark against the aspirations of labor.\nAll of this was in some ways just a prelude to the 1970s, when the relationship between inflation, unemployment and exchange rates moved to the very center of the political field around the world. But it is a great strength of The Making of Global Capitalism that it shows that these issues did not come out of nowhere. Inflation was already an obsession of governments in the postwar period, and not something that was introduced with Reagan and Thatcher, though they rode it to power. The imperative for states to manage the internal and external value of their national currencies would continue to affect the balance of class forces in many countries, because it is so closely tied to wage-setting, labor market institutions and unemployment. It continues to manifest today, channeled by various arrangements — floating currencies, pegs, independent central banks, supranational currencies — into different policy problematics, but all sharing a family resemblance.\nIn this post I have riffed off only a part of just one strand of Panitch and Gindin’s fantastic book. I have tried to connect their narrative about Bretton Woods to the macroeconomic policy theory of the time. It seems to me that this is a useful way forward for Marxian state theory — to critically analyze how contemporary economic theory has framed the situations facing the state. This is historical and non-deterministic, because it does not read state institutional forms or actions off the preconceived needs of the economic system. But it still recognizes how economic dysfunctions and needs shape the capitalist state, as they are interpreted through the fallible, contestable models of applied economics. It integrates questions of class, because class conflict appears all over the place in these models, once you start looking for it. It is there in the strategic context within which policymakers operate. This approach seems to fit the vision opened up by The Making of Global Capitalism, a rich and detailed story of the strategic formation of the modern US state and the world that evolved around it.", "url": "https://jacobinmag.com/2013/07/dollar-diplomacy/"}