{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:07:34", "date_modify": "2020-05-04 16:07:34", "date_publish": "2013-07-10 20:53:30", "description": "Read CNN's Fast Facts about South Sudan. In 2011, South Sudan gained independence from Sudan.", "filename": "2013_07_10_world_africa_south-sudan-fast-facts_index_1588608454.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/151104063735-south-sudan-map-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_07_10_world_africa_south-sudan-fast-facts_index_1588608454.html", "title": "South Sudan Fast Facts", "title_page": "South Sudan Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at South Sudan, a landlocked country in east-central Africa. In 2011, South Sudan gained its independence from Sudan .\nAbout South Sudan\n(from the CIA World Factbook 644,329 sq km, slightly smaller than Texas\nPopulation: 10,561,244 (July 2020 est.)\nMedian age: 18.6 years\nCapital: Juba\nEthnic Groups: Dinka (Jieng) 35.8%, Nuer (Naath) 15.6%, Shilluk (Chollo), Azande, Bari, Kakwa, Kuku, Murle, Mandari, Didinga, Ndogo, Bviri, Lndi, Anuak, Bongo, Lango, Dungotona, Acholi, Baka, Fertit (2011 est.)\nReligion: Animist, Christian, Muslim\nGDP (purchasing power parity): $20.01 billion (2017 est.)\nGDP per capita: $1,600 (2017 est.)\nOther Facts\nThe country is poverty-stricken despite containing vast oil reserves.\nA demilitarized, jointly monitored Common Border Zone was established between Sudan and South Sudan to ease tensions in the oil-rich Abyei region.\nTimeline\nJanuary 1, 1956 - Sudan gains its independence after an agreement between the United Kingdom and Sudan gains its independence after an agreement between the United Kingdom and Egypt.\nMarch 27, 1972 - The signing of the Addis Ababa Agreement ends 17 years of civil war between the northern Khartoum forces and southern Anya-Nya rebels. Part of the agreement includes the creation of the autonomous region of South Sudan, with Juba as its capital.\n1977 - Oil discovered in southwestern Sudan. Civil war during the 1980s and 1990s prevents exploration or development of the oil deposits.\n1980s - Prolonged droughts put pressure on water and farming resources.\nMay 1983 - John Garang forms the Sudan People's Liberation Army (SPLA). Garang helps organize a rebellion against the government's proposal to re-divide the region and impose Islamic law.\n1989 - The The United Nations airlifts famine relief to both sides during a civil war.\nMarch 27, 1995 - Sudan's government calls for a two-month ceasefire at the behest of former Sudan's government calls for a two-month ceasefire at the behest of former US President Jimmy Carter\nJuly 15, 1998-May 1999 - The SPLA calls a ceasefire due to regional famine, allowing UN supplies to reach famine victims.\nJanuary 9, 2005 - is signed by representatives from the north and the south. The agreement includes independence for southern Sudan within six years. Islamic law will not apply in South Sudan, according to the agreement. The Comprehensive Peace Agreement is signed by representatives from the north and the south. The agreement includes independence for southern Sudan within six years. Islamic law will not apply in South Sudan, according to the agreement.\nApril 11-15, 2010 - Sudan holds multiparty elections for the first time in 24 years. Kiir is elected president of South Sudan with 93% of the vote.\nJanuary 9-15, 2011 - Voters participate in a referendum, casting ballots that will determine whether South Sudan secedes or remains part of a unified Sudan.\nFebruary 7, 2011 - The Southern Sudan Referendum Commission announces that 98.83% have voted for separation. The Southern Sudan Referendum Commission announces that 98.83% have voted for separation. US President Barack Obama declares Washington's intention to recognize South Sudan as an independent state in July, when the Comprehensive Peace Agreement is scheduled to end.\nMarch 2011 - Violence breaks out between soldiers and rebel groups.\nApril 27, 2011 - During a speech on state television, During a speech on state television, Sudanese President Omar al-Bashir claims the disputed oil-rich region of Abyei is part of the north.\nMay 31, 2011 - The African Union announces that Sudan and South Sudan have reached an agreement on Abyei, in which a demilitarized, jointly monitored Common Border Zone is established.\nJune 5, 2011 - Fighting breaks out along the border.\nJune 20, 2011 - Representatives from Sudan and South Sudan sign an agreement calling for the withdrawal of Sudan Armed Forces (SAF) from Abyei and for joint supervision of the disputed region.\nJuly 9, 2011 - South Sudan becomes an independent nation.\nJuly 14, 2011 - Becomes the 193rd member nation of the UN.\nJuly 29, 2011 - South Sudan is admitted to the African Union.\nOctober 9, 2011 - Kiir meets with Bashir to \"reach final solutions\" to address continuing differences between their countries. In his first visit to Khartoum since South Sudan's independence, Kiir meets with Bashir to \"reach final solutions\" to address continuing differences between their countries.\nJanuary 23, 2012 - South Sudan shuts down oil production after accusing Sudan of stealing $815 million of its oil. Sudan claims it confiscated the crude to make up for unpaid fees to use the pipeline and processing facilities in its territory.\nSeptember 27, 2012 - to resume oil exports and establish a demilitarized zone. The presidents do not reach an agreement on the status of Abyei. Bashir and Kiir sign a deal to resume oil exports and establish a demilitarized zone. The presidents do not reach an agreement on the status of Abyei.\nJanuary 6, 2013 - Bashir and Kiir agree to temporary arrangements for the Abyei region.\nMarch 8, 2013 - Defense ministers from Sudan and South Sudan Defense ministers from Sudan and South Sudan sign an agreement to withdraw their respective military forces from the 14-mile-wide demilitarized zone between the countries.\nJuly 23, 2013 - Kiir dismisses his entire Cabinet, including Vice President Riek Machar.\nJanuary 6, 2014 - Kiir and Bashir hold talks in Juba.\nAugust 26, 2015 - Under threat of UN sanctions, Kiir signs a peace deal with Machar.\nOctober 27, 2015 - indicating militants have committed such atrocities as forced cannibalism and gang rape. The African Union releases a report indicating militants have committed such atrocities as forced cannibalism and gang rape.\nJanuary 28, 2016 - for the first time since the South seceded five years ago, the Sudan News Agency reports. Bashir orders the opening of the border with South Sudan for the first time since the South seceded five years ago, the Sudan News Agency reports.\nFebruary 11, 2016 - as vice president, part of a peace deal to end the two-year civil war, according to a presidential decree read on state television. Machar is sworn in on April 26, 2016. Kiir reinstates Machar as vice president, part of a peace deal to end the two-year civil war, according to a presidential decree read on state television. Machar is sworn in on April 26, 2016.\nJuly 25, 2016 - Kiir removes Machar as vice president for the second time and replaces him with Kiir removes Machar as vice president for the second time and replaces him with Taban Deng Gai, who had previously served as Machar's chief negotiator, as well as mining minister.\nNovember 1, 2016 - , shortly after the release of a report on deadly violence in July and the actions of the UN mission in the country. The UN announces the dismissal of the commander of the peacekeeping force in South Sudan , shortly after the release of a report on deadly violence in July and the actions of the UN mission in the country.\nFebruary 20, 2017 - An estimated 4.9 million people - more than 40% of South Sudan's population - are in urgent need of food, agricultural and nutrition assistance. The UN announces famine has been declared in parts of South Sudan. An estimated 4.9 million people - more than 40% of South Sudan's population - are in urgent need of food, agricultural and nutrition assistance.\nMay 9, 2017 - Militants attack Gai's convoy, shooting and injuring three of his bodyguards.\nSeptember 12, 2018 - Kiir signs a peace agreement with Machar in an effort to end the civil war.\nFebruary 20, 2020 - Kiir and Machar announce they have agreed to form a unity government. Machar is sworn in as vice president two days later.", "url": "https://www.cnn.com/2013/07/10/world/africa/south-sudan-fast-facts/index.html"}