{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:08:01", "date_modify": "2020-05-04 16:08:01", "date_publish": "2013-04-08 17:32:53", "description": "View the David Letterman Fast Facts on CNN and read more about The Late Show and Letterman's career.", "filename": "2013_04_08_us_david-letterman-fast-facts_index_1588608481.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/170522150346-david-letterman-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_04_08_us_david-letterman-fast-facts_index_1588608481.html", "title": "David Letterman Fast Facts", "title_page": "David Letterman Fast Facts  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here is a look at the life of former late-night talk show host David Letterman.\nPersonal\nBirth date: April 12, 1947\nBirth place: Indianapolis, Indiana\nBirth name: David Michael Letterman\nFather: Harry Letterman, a florist\nMother: Dorothy (Hofert) Letterman Mengering\nMarriages: Regina Lasko (March 19, 2009-present); Michelle Cook (divorced)\nChildren: with Regina Lasko: Harry Joseph, 2003\nEducation: Ball State University, B.A., 1969\nJUST WATCHED David Letterman: I'm retiring in 2015 Replay More Videos ... MUST WATCH David Letterman: I'm retiring in 2015 02:33\nOther Facts\nLetterman is the founder of the production company Worldwide Pants, which produced \"Late Show with David Letterman.\"\n\"Late Night with David Letterman\" was nominated for 35 Emmy Awards and won five.\n\"Late Show with David Letterman\" was nominated for 72 Emmy Awards and won nine.\n\"My Next Guest Needs No Introduction with David Letterman\" has been nominated for two Emmy Awards.\nTimeline\n1969 - Begins working as an announcer and weekend weatherman at WLWI (now WTHR), an ABC affiliate in Indianapolis, Indiana.\n1975 - Moves to Los Angeles and begins performing stand-up at the Comedy Store. Later he is hired by Jimmie Walker, star of the CBS sitcom \"Good Times,\" as a writer.\n1978 - Appears on Appears on Mary Tyler Moore 's variety show, \"Mary.\"\nNovember 1978 - Makes the first of 22 appearances on \"The Tonight Show\" hosted by Johnny Carson. Letterman also serves as a guest host on \"The Tonight Show\" several times.\nJune 23, 1980-October 24, 1980 - Hosts \"The David Letterman Show,\" a daytime talk show on NBC.\nFebruary 1, 1982-June 25, 1993 - Hosts \"Late Night with David Letterman\" on NBC.\nSeptember 18, 1985 - Premiere of the \"Top Ten\" list.\nMay 1992 - Carson announces his retirement and speculation begins that Letterman will replace him.\nJanuary 1993 - After it is announced that Jay Leno will take Carson's place, Letterman announces he will be leaving NBC for CBS, and expresses anger over what he regards as NBC's poor treatment of him.\nAugust 30, 1993-May 20, 2015 - Host of \"Late Show with David Letterman.\"\nMarch 27, 1995 - Hosts the Hosts the Academy Awards.\nJanuary 14, 2000 - Letterman undergoes quintuple bypass surgery.\nSeptember 17, 2001 - Is the first late-night talk show host to return to air after the Is the first late-night talk show host to return to air after the September 11 terrorist attacks . Instead of starting the show with a humorous monologue, Letterman mourns those lost and praises the city's firefighters and police officers. His first guest, CBS anchor Dan Rather , breaks down in tears during the broadcast.\nMarch 31, 2003 - Letterman returns to his show after being out for nearly a month due to shingles.\nMarch 17, 2005 - Kelly Frank, a house painter who worked on Letterman's Montana ranch, is charged with plotting to kidnap Letterman's son for ransom.\nSeptember 12, 2005 - Frank pleads guilty to a lesser charge and is sentenced to 10 years in prison. In 2007, he escapes, but is later recaptured.h\nOctober 1, 2009 - Letterman admits on air that he has had sexual relationships with female staff members and that someone has been attempting to blackmail him over the affairs.\nOctober 5, 2009 - Letterman apologizes to his wife, Regina Lasko, and female staffers in front of a live studio audience.\nSeptember 2, 2010 - Halderman is released after serving four months of his six-month prison sentence.\nApril 2012 - Extends his contract with CBS through 2014.\nDecember 2, 2012 - Is honored at the Kennedy Center Honors gala along with Buddy Guy, Dustin Hoffman, Natalia Makarova and the musical group Led Zeppelin.\nOctober 4, 2013 - Extends his contract with CBS through 2015.\nApril 3, 2014 - During an afternoon taping of \"The Late Show,\" Letterman announces that he will be retiring in 2015.\nMay 20, 2015 - Counting his work on both NBC and CBS, this is show #6,028 for Letterman. Tapes his final show. Counting his work on both NBC and CBS, this is show #6,028 for Letterman.\nOctober 30, 2016 - Letterman's segment on climate change for the \"Years of Living Dangerously\" series airs on the National Geographic Channel. The episode follows Letterman as he travels around India discussing India's zealous renewable energy plan.\nOctober 22, 2017 - Is awarded the Is awarded the Mark Twain Prize for American Humor\nJanuary 12, 2018 - In the debut of his new Netflix series \"My Next Guest Needs No Introduction,\" Letterman interviews former In the debut of his new Netflix series \"My Next Guest Needs No Introduction,\" Letterman interviews former US President Barack Obama. Guests scheduled for the rest of Letterman's shows include George Clooney, Malala Yousafzai , Jay-Z, Tina Fey and Howard Stern.\nMay 31, 2019 - \"My Next Guest Needs No Introduction\" returns for a second season on Netflix.", "url": "https://www.cnn.com/2013/04/08/us/david-letterman-fast-facts/index.html"}