{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:57:02", "date_modify": "2020-05-04 16:57:02", "date_publish": "2013-10-31 19:06:09", "description": "Read Fast Facts from CNN about the shootings at Virginia Tech in April 2007, the third deadliest mass shooting in US history.", "filename": "2013_10_31_us_virginia-tech-shootings-fast-facts_index_1588611422.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/111209095610-virginia-tech-shooting-scene-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_10_31_us_virginia-tech-shootings-fast-facts_index_1588611422.html", "title": "Virginia Tech Shootings Fast Facts", "title_page": "Virginia Tech Shootings Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Twenty-three-year-old Seung-Hui Cho killed 32 people on the Virginia Polytechnic Institute and State University campus in Blacksburg, Virginia, before taking his own life.\nFacts\nTimeline\nDecember 13, 2005 - Cho is ordered by a judge to seek outpatient care after making suicidal remarks to his roommates. He is evaluated at Carilion-St. Alban's mental health facility.\nFebruary 9, 2007 - Cho picks up a Walther P-22 pistol he purchased online on February 2 from an out-of-state dealer at JND Pawn shop in Blacksburg, across the street from Virginia Tech.\nMarch 2007 - Cho purchases a 9mm Glock pistol and 50 rounds of ammunition from Roanoke Firearms for $571.\nApril 16, 2007 - (Events are listed in local ET)\n7:15 a.m. - Police are notified in a 911 call that there are (Events are listed in local ET)7:15 a.m. - Police are notified in a 911 call that there are at least two shooting victims at West Ambler Johnston Hall, a four-story coed dormitory on campus that houses approximately 895 students.\n9:01 a.m. - Cho mails a package containing video, photographs and writings to NBC News in New York. NBC doesn't receive it until two days later due to an incorrect address on the package.\n9:26 a.m. - The school sends out an email statement that a shooting took place at West Ambler Johnston Hall earlier that morning.\n9:45 a.m. - 911 calls report a second round of shootings in classrooms at Norris Hall, the engineering science and mechanics building. At least 32 students and faculty are killed.\n9:50 a.m. - \"Please stay put.\" A second email notifies students that a gunman is loose on campus.\n9:55 a.m. - University officials send a third message about the second shooting via email and text messages to students.\n10:16 a.m. - Classes are canceled.\n10:53 a.m. - Students receive an email about Norris Hall shooting, with the subject line, \"Second shooting reported: police have one gunman in custody.\"\n12:42 p.m. - VT President Charles Steger issues a statement that people are being released from campus buildings and that counseling centers are being set up. He announces that classes are canceled again for the next day.\nApril 17, 2007 - Virginia Tech Police announce that they \"have been able to confirm the identity of the gunman at Norris Hall. That person is Seung-Hui Cho. He was a 23-year-old South Korean here in the US as a resident alien.\"\nApril 18, 2007 - NBC News announces that they have received a package containing pictures and written material which they believe to be from Cho, sent between the two shootings.\nAugust 15, 2007 - It is announced that the Hokie Spirit Memorial Fund, funded by private donations, will donate $180,000 to the families of each of the 32 victims. Those injured will receive $40,000 to $90,000, depending on the severity of the injuries, and a waiver of tuition and fees if applicable.\nMarch 24, 2008 - The state proposes a settlement to the families related to the shooting. In it, $100,000 is offered to representatives of each of the 32 people killed and another $800,000 is reserved to those injured, with a $100,000 maximum. Expenses not covered by insurance such as medical, psychological, and psychiatric care for surviving victims and all immediate families are also covered.\nApril 10, 2008 - announces that a \"substantial majority\" of the families related to the shootings have agreed to the $11 million settlement offered by the state. It isn't clear how many families have not accepted the deal. The settlement will pay survivors' medical costs for life and compensate families who lost loved ones. By accepting the settlement, the families give up their right to sue the university, state, and local government in the future. Neither the attorneys representing the families nor the governor would discuss the exact terms until final papers are drawn. Governor Tim Kaine announces that a \"substantial majority\" of the families related to the shootings have agreed to the $11 million settlement offered by the state. It isn't clear how many families have not accepted the deal. The settlement will pay survivors' medical costs for life and compensate families who lost loved ones. By accepting the settlement, the families give up their right to sue the university, state, and local government in the future. Neither the attorneys representing the families nor the governor would discuss the exact terms until final papers are drawn.\nJune 17, 2008 - A judge approves the $11 million settlement offered by the state to some of the victims and families of those killed in the shooting rampage. Families of 24 of the 32 killed, as well as 18 who were injured are included in the settlement.\nApril 10, 2009 - Norris Hall reopens. The 4,300-square-foot area will house the Center for Peace Studies and Violence Prevention, which relocated to the building.\nDecember 9, 2010 - The US Department of Education releases a report charging that Virginia Tech failed to notify students in a \"timely manner,\" as prescribed by the Clery Act.\nMarch 14, 2012 - A jury awards $4 million each to two victims' families who sued the state for wrongful death. The jury finds Virginia Tech failed to notify students early enough following the discovery of two shooting victims at West Ambler Johnston dormitory. The families of Erin Peterson and Julia Pryde argued that had officials notified students and staff earlier of the shooting, lives might have been spared. The Peterson and Pryde families did not accept a portion of an $11 million settlement between the state and the families of victims, opting instead to sue for wrongful death. The amount is later reduced to $100,000 per family.\nOctober 31, 2013 - The Supreme Court of Virginia overturns the jury verdict in a wrongful death suit filed against the state by the families of two of the victims, that \"there was no duty of the Commonwealth to warn students about the potential for criminal acts\" by Seung-Hui Cho.\nApril 2014 - Virginia Tech pays fines totaling $32,500 to the Dept. of Education for violation of the Clery Act, a law requiring colleges and universities to provide timely notification of campus safety information.\nThe Victims\nWest Ambler Johnston Hall (dorm)\nRyan Clark, 22, Martinez, Georgia\n- Senior, English, Biology and Psychology\n- Resident Assistant on campus, also in the Marching Virginians college band\n- Known as \"the Stack\" to friends - Senior, English, Biology and Psychology- Resident Assistant on campus, also in the Marching Virginians college band- Known as \"the Stack\" to friends\nEmily Jane Hilscher, 19, Woodville, Virginia\n- Freshman, Animal and Poultry Sciences\nNorris Hall (dept. bldg/classrooms)\nRoss Alameddine, 20, Saugus, Massachusetts\n- Sophomore, English\n- Died in a French class - Freshman, Animal and Poultry Sciences- Sophomore, English- Died in a French class\nDr. Christopher \"Jamie\" Bishop, 35, Pine Mountain, Georgia\n- Instructor, Foreign Languages and Literatures (German) - Instructor, Foreign Languages and Literatures (German)\nBrian Bluhm, 25, Cedar Rapids, Iowa\n- Graduate Student, Civil Engineering Graduate Student, Civil Engineering\nAustin Cloyd, 18, Blacksburg, Virginia\n- Sophomore, International Studies and French - Sophomore, International Studies and French\nJocelyn Couture-Nowak, 49, born in Montreal, Canada\n- Instructor, French - Instructor, French\nDaniel Alejandro Perez Cueva, 21, Woodbridge, Virginia, originally from Peru\n- Junior, International Studies\n- Died in French class - Junior, International Studies- Died in French class\nDr. Kevin Granata, 46, Toledo, Ohio\n- Professor, Engineering Science and Mechanics - Professor, Engineering Science and Mechanics\nMatt Gwaltney, 24, Chesterfield, Virginia\n- Graduate Student, Civil and Environmental Engineering Graduate Student, Civil and Environmental Engineering\nCaitlin Hammaren, 19, Westtown, New York\n- Sophomore, International Studies and French Sophomore, International Studies and French\nJeremy Herbstritt, 27, Bellefonte, Pennsylvania\n- Graduate student, Civil Engineering - Graduate student, Civil Engineering\nRachael Hill, 18, Richmond, Virginia\n- Freshman, Biology Freshman, Biology\nJarrett Lane, 22, Narrows, Virginia\n- Senior, Civil Engineering - Senior, Civil Engineering\nMatt La Porte, 20, Dumont, New Jersey\n- Sophomore, Political Science - Sophomore, Political Science\nHenry Lee, 20, Roanoke, Virginia\n- Sophomore, Computer Engineering - Sophomore, Computer Engineering\nDr. Liviu Librescu, 75, from Romania\n- Professor, Engineering Science and Mechanics\n- A Romanian Holocaust survivor Professor, Engineering Science and Mechanics- A Romanian Holocaust survivor\nDr. G V Loganathan, 51, born in Chennai, India\n- Professor, Civil and Environmental Engineering\n- Had been at VA Tech since 1981 - Professor, Civil and Environmental Engineering- Had been at VA Tech since 1981\nPartahi Mamora Halomoan Lumbantoruan, 34, Indonesia\n- Doctoral student, Civil Engineering - Doctoral student, Civil Engineering\nLauren McCain, 20, Hampton, Virginia\n- Freshman, International Studies - Freshman, International Studies\nDaniel O'Neil, 22, Lafayette, Rhode Island\n- Graduate student, Environmental Engineering - Graduate student, Environmental Engineering\nJuan Ramon Ortiz-Ortiz, 26, San Juan, Puerto Rico\n- Graduate student, Civil Engineering - Graduate student, Civil Engineering\nMinal Panchal, 26, Mumbai, India\n- Graduate student, Architecture - Graduate student, Architecture\nErin Peterson, 18, Centreville, Virginia\n- Freshman, International Studies\n- Died in a French class - Freshman, International StudiesDied in a French class\nMichael Pohle, 23, Flemington, New Jersey\n- Senior, Biological Sciences - Senior, Biological Sciences\nJulia Pryde, 23, Middletown, New Jersey\n- Graduate Student, Biological Systems Engineering - Graduate Student, Biological Systems Engineering\nMary Karen Read, 19, Annandale, Virginia\n- Freshman, Interdisciplinary Studies - Freshman, Interdisciplinary Studies\nReema Joseph Samaha, 18, Centreville, Virginia\n- Freshman, University Studies\n- Went to the same high school as Cho - Freshman, University Studies- Went to the same high school as Cho\nWaleed Mohammed Shaalan, 32, Zagazig, Egypt\n- Doctoral student, Civil Engineering - Doctoral student, Civil Engineering\nLeslie G. Sherman, 20, Springfield, Virginia\n- Junior, History and International Relations - Junior, History and International Relations\nMaxine Turner, 22, Vienna, Virginia\n- Senior, Chemical Engineering - Senior, Chemical Engineering", "url": "https://www.cnn.com/2013/10/31/us/virginia-tech-shootings-fast-facts/index.html"}