{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:54", "date_modify": "2020-05-04 19:57:54", "date_publish": "2013-07-16 00:00:00", "description": null, "filename": "2013_07__1588622274.html", "image_url": "https://images.jacobinmag.com/2013/07/16233701/aschoff-2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_07__1588622274.html", "title": "The Luchadores of Global Political Economy", "title_page": "The Luchadores of Global Political Economy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In the world of lucha libre a class war rages. Técnicos battle rudos, head-butting and scissor-kicking for the common man against capital and the state. In the battles of global political economy Leo Panitch and Sam Gindin are master técnicos. Their new book, The Making of Global Capitalism: the Political Economy of American Empire , examines how “the American state developed the interest and capacity to superintend the making of global capitalism.” Global Capitalism is burly and, like the great El Santo, difficult to pin down, so in what follows I will focus on only one aspect of the book: Panitch and Gindin’s analysis of financialization.\nWhat is financialization? Scholars broadly agree that financialization is the increasing dominance of financial actors, institutions, markets, and motives in the economy. By this definition, Wall Street’s tidy 2008 bailout, American CEOs’ curious habit of dumping money into share buybacks rather than job-creating investment, Treasury’s delight in running roughshod over Congress, and the growing dependence of working people on the stock market and credit are all examples of financialization. But from here it gets a bit dodgy. People don’t agree about what caused the rise of finance, or how financialization has shaped the economy over the past three decades, or what the continuing dominance of finance means for the future of capitalism. Gindin and Panitch have answers to these questions.\nTo make things interesting, I’ll toss Panitch and Gindin’s theory of financialization into the ring with Giovanni Arrighi’s theory of financialization. Arrighi, a master técnico in his own right, spent his life thinking about capital and why it does the things it does. He was particularly interested in Marx’s general formula of capital and how its logical derivations could help us understand the development of global capitalism and the (dis)empowerment of nations vis-à-vis other nations. A lucha between Gindin/Panitch and Arrighi is a bit risky — it might just leave us sweaty and tired. But with luck it could also provide some insight into the moment in which we live, and how we can beat the rudos.\nPanitch and Gindin’s story of the rise of finance is straightforward and compelling. The US was a financial and manufacturing powerhouse by the end of WWI but lacked the vision and institutional capacity to play a leading role in the global economy. Through the New Deal, World War II, and the formation of Bretton Woods, the US developed this capacity and emerged, at war’s end, a superpower ready to relaunch global capitalism. Coming out of World War II, “The explicit long-term goal of the American state was to create the material and legal conditions for the free movement of capital throughout the world.” Panitch and Gindin argue that a key element of this project for an American empire was the regulation and expansion of US finance. By the 1950s US finance was growing in step with (and often ahead of) US manufacturing, “deepen[ing] markets at home, expand[ing] abroad, and lay[ing] the basis for the explosion of global finance that occurred in the last decades of the twentieth century.”\nBut as finance got stronger, the cradle of Bretton Woods turned into a cage. The regulatory framework of the New Deal became a barrier finance sought to overcome. US banks followed US companies overseas, setting up shop outside the US to avoid restrictions. At the same time the contradictions of Keynesianism (strong capital plus strong labor) intensified. Profits for US corporations declined amidst new competition from Europe and Japan, and US workers grew unruly, demanding (and getting) increased wages and benefits. By the late 1960s the Bretton Woods system of fixed exchange rates and capital controls was strained to the breaking-point.\nAs the crisis of stagflation and dollar devaluation increased during the 1970s the US state fumbled around for a solution. To overcome what Panitch and Gindin call a “crisis of business confidence” the US needed to show that it could resolve the contradictions of Keynesianism at home and Third World nationalism abroad. Ultimately it did, through Volcker’s “shock and austerity” campaign.\nThe imposition of class discipline to break the great inflation and the wage militancy of US labor strongly confirmed the American state’s commitment to property, the value of the dollar, and the inviolability of its debt. The way in which this was achieved — high interest rates, a deep recession, and the liberalization of markets — also laid the basis, not only for the new age of finance, but also for the restructuring of US industry.\nIn addition to the Volcker shock, Congress phased out “Regulation Q” ceilings beginning in 1980, continuing an ongoing policy of deregulation to keep pace with developments in the private financial sector. Cutting the New Deal apron strings enabled finance to develop its global capacity further, while Volcker’s monetary shock swiftly redirected capital flows toward the US, reestablishing Wall Street as the center of the global financial world.\nBut Gindin and Panitch don’t define the eighties and nineties by the rise of finance as many scholars do. Instead, they see the rise of finance as one of a number of transformations occurring at the time, along with the “restructuring of manufacturing, the explosion of high-tech, the ubiquity of business services, and the profound weakening of working-class organization and labor identity.” Collectively, these transformations “re-constituted the material base of American empire,” enabling a deep restructuring of the US economy to restore competitiveness and profitability. In the process a truly global capitalism was made.\nThe machinations of the US state revived corporate profitability with a vengeance. But, it also created a volatile global economy dominated by the whims of finance. There were seventy-two financial crises in the 1990s alone. To keep the whole thing going the US state had to increase its capacity for regulation and rescue. The US Treasury’s ability to “control contagion and orchestrate supplemental interventions,” along with the Fed’s function as “lender of last resort,” were increasingly called upon as global financial crises (Mexico, East Asia, Argentina) got bigger and bigger.\nThe 2007 US financial crisis was the mother of them all, and pushed the US state’s role as container of crises further: it became “market maker of last resort.” Yet, the crisis wasn’t a sign of systemic breakdown. Instead, Panitch and Gindin argue that the crisis actually strengthened the US empire, that the ability of the US to rein in the crisis demonstrated its centrality to the functioning of global capitalism. Muted criticism of quantitative easing, and the continued Treasury bond feeding frenzy, showed that the US was the only game in town. The power of finance was also bolstered by the crisis: “[I]n spite of the widespread anger at the role of Wall Street in causing the crisis, US finance emerged not only more concentrated, but also still encompassing the general interest of capital amid a broad neoliberal consolidation of class power.”\nSo if we sum up the properties of global capitalism according to Panitch and Gindin, the system is locally volatile but globally stable. Why? The global ruling classes (North and South) benefit from and support the system, and the global working class is in a state of near total defeat, eliminating the greatest potential source of change. Until the working classes rebel and put new political systems in place the US Empire isn’t going anywhere. And as for finance:\nEqually illusory is the belief that there is a way back to a supposed postwar “real economy” from the finance-led capitalism which greased the wheels of globalization. Capitalist finance is in truth no less real than capitalist production — and not just because of the way it affects the rest of the economy during both boom and bust, but because it is integral to capitalist production and accumulation as well as to the extension and deepening of global capitalism.\nArrighi’s story of the rise of finance in The Long Twentieth CenturyAdam Smith in Beijing is both similar and different to Panitch and Gindin’s. The familiar signposts are there: New Deal, Bretton Woods, Eurodollar market, Volcker shock. But in Arrighi’s story financialization means something different. This is partly a result of his historical framework. For Arrighi the development of global capitalism is a five-century-long process of expansion and intensification of the world-economy through a succession of “regimes of accumulation.” The US regime’s supersession of the British regime is part of “a series of connected stages of capitalist development on a world scale.” Looking back through history Arrighi argues that regimes of accumulation, while initially successful in expanding profitability and growth, eventually give rise to intensified competition, followed by a period of crisis, and ultimately, a breakdown. As competition and uncertainty increase, capitalists (who are able) look for other, safer ways to make a profit, and divert more and more of their capital into financial channels. And those who can’t or won’t put all their money in finance (perhaps because they are wedded to fixed investments like auto plants) start relying more heavily on finance to buttress their profits. Arrighi calls this tendency financialization. The leading capitalists from the dominant regime benefit most from the rise of finance, and by extension the dominant power enjoys a period of renewed profitability and vigor.\nArrighi argues that although each historical cycle (and each turn to finance) is different, we can see key similarities between the rise of finance in the 1970s and past financial expansions. After World War II the US launched itself as a “welfare-warfare” state, promising social and economic development to the Global South and a willingness to use its burgeoning military strength to keep the world open for business. To make this happen the US not only rebuilt Europe (in its own image), but also constructed a worldwide network of military bases, and funneled capital to Third World countries through military Keynesianism, food aid, and multilateral development loans.\nFor a decade or two after World War II the US welfare-warfare model was a success. Europe and Japan were rebuilt, the Third World industrialized, and the US was able to keep the lid on communism through victory (of a sort) in Korea and elsewhere. But these successes weren’t lasting. Revived capitalism soon brought real competitors for US multinationals, and workers in the Global North demanded their piece of the pie. However, these problems were part of a much bigger problem. The Third World was getting restless after decolonization and industrialization failed to narrow the gap between rich and poor countries. Nationalist and communist movements began picking up steam. At the same time, America’s job as self-appointed global policeman became increasingly difficult as Vietnam descended into bloody quagmire.\nThe problem was twofold: cost and credibility. Unlike the British, who literally forced their subjects to pay for their own subjugation, the Americans had to foot the bill for their “informal” empire. And this got increasingly more expensive as Vietnam and Great Society costs mounted. The failure in Vietnam was a serious blow to the credibility of the US: “The decline of US power and prestige reached its nadir in the late 1970s with the Iranian Revolution, a new hike in oil prices, the Soviet invasion of Afghanistan, and another serious crisis of confidence in the US dollar . . .” Arrighi agrees with Panitch and Gindin (contra Brenner) that labor-capital conflict in the North was a key element in the 1970s crisis, but for him “the strongest stimulus for the change came from the unresolved crisis of US hegemony in the Third World.”\nLikewise, the significance of the Volcker shock was not so much about labor-capital relations in the North, but about North-South relations globally. The monetary revolution was so successful because “it enabled the United States to achieve through financial means what it could not achieve by force of arms — to defeat the USSR in the Cold War, tame the rebellious South, and reorient the US economy to take full advantage of financialization, both at home and in the world at large.” Indeed, it was so successful that by the 1990s the Southern revolt was a distant memory.\nBut Arrighi argues that despite the significant differences between the US regime of accumulation and past cycles (lack of inter-state conflict, power of trans-national corporations) the turn to finance in the 1970s maintains important similarities, and thus doesn’t represent a permanent solution to the crisis of US hegemony. He gives three main reasons: Economically, the dominance of finance leads to hoarding and speculation and channels purchasing power away from “demand-creating investment.” Politically, the turbulence of financial expansions leads to new configurations of power that undermine the existing order. Socially, financialization is accompanied by polarization and social dislocation that in turn “provoke movements of resistance and rebellion among subordinate groups and strata.”\nSo what can we spectators take away from this lucha? Both perspectives provide deep insight into financialization and help us penetrate the fog of the present moment. If we combine their perspectives for a trios tag-team we can identify a broadly overlapping vision. Both Arrighi and Panitch/Gindin emphasize the fusion of state and capital in the making of global capitalism. In doing so they show how globalization is a “project” as much as it is a process, and how neoliberalism is a state-led counterrevolution against workers and the Global South. Panitch/Gindin and Arrighi also adopt Marx’s theory of crisis as turning point and situate the rise of finance within the crisis of the 1970s. In doing so, they provide a foundation for understanding and tracking otherwise puzzling developments such as the housing bubble and the epidemic of “shareholder value” ideology.\nHowever, Gindin/Panitch and Arrighi diverge significantly in their take on financialization. Panitch and Gindin don’t see financialization as a phase of capitalism, or something that creates distinctive tendencies within capitalism. For them the past three decades have been about restructuring, with financialization as just one part of this restructuring. Increased volatility in the global economy is not a result of the rise of finance per se — it’s a result of the US empire spreading unfettered capitalist social relations to every corner of the world. Thinking about US empire and finance, we can ask: How long can the US play world central bank while it pursues austerity at home? Will the global economy remain dependent on the US domestic economy? If so, how will long-term austerity in the US impact the new global pattern of capital flows whereby the Global South funds the Global North?\nArrighi also thinks financialization is intrinsic to capitalism, but (following Braudel) sees it as a temporally limited phase of capitalism, a “sign of autumn” of a particular regime of accumulation. Why? Because financialization is a response to crisis that, in turn, generates new sources of turbulence that (at least historically) have proven unsustainable. Arrighi acknowledges that the US regime of accumulation is more comprehensive and far-reaching than any preceding it, and that the tremendous power of trans-national corporations may prove to be a wild-card, undermining the inter-state system as we know it. But at the same time, he sees the US state’s open-ended, global War on Terror as a clear indication that the political and social ramifications of the current phase of financialization are dire, and that the US has not resolved its crisis of hegemony.\nArrighi’s emphasis on the turbulence associated with financialization opens the door for a few more questions about the present moment: Panitch and Gindin have addressed the coercive aspects of US empire in the past, but where does the “War on Terror” sit in their story today? Are today’s dirty wars simply part of controlling “the spirits [US empire] called up from the deep,” or do they signal a deeper crisis — that the US is trying to use its military colossus to achieve ends otherwise unattainable? And, how is the expansion of the US state’s “coercive apparatus” connected to the expansion of its ability to superintend the global economy?", "url": "https://jacobinmag.com/2013/07/the-luchadores-of-global-political-economy/"}