{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:27:05", "date_modify": "2020-05-04 16:27:05", "date_publish": "2013-10-31 01:28:47", "description": "View CNN's Fast Facts about the Vatican, also known as the Holy See.", "filename": "2013_10_30_world_vatican-fast-facts_index_1588609625.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/160323102217-pope-francis-speaks-march-2016-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_10_30_world_vatican-fast-facts_index_1588609625.html", "title": "Vatican Fast Facts", "title_page": "Vatican Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's what you need to know about the Vatican, also known as the Holy See.\nFacts\nThe full name of the country is the State of Vatican City, and it is the spiritual and governing center of the Roman Catholic Church.\nIt stands on Vatican Hill in northwestern Rome, Italy west of the Tiber River. It is comprised of roughly 100 acres.\nTall stone walls surround most of Vatican City.\nHistorical documentation reveals that St. Peter was crucified at or near the Neronian Gardens on Vatican hill and buried at the foot of the hill directly under where the main altar of St. Peter's Basilica now stands. Excavations at the basilica between 1940 and 1957 located the tomb believed to be St. Peter's.\nVatican City has its own pharmacy, post office, telephone system and media outlets. The population is 1,000 (2019 est.)\nSt. Peter's Basilica\nIt is the world's second-largest Christian church after the Yamoussoukro Basilica in Cote d'Ivoire. St. Peter's is not a cathedral, which is a bishop's principal church. The pope is the bishop of Rome, and his cathedral church is in Rome.\nBuilt on the foundation of the first St. Peter's, the new basilica took 120 years to complete. Masonry, sculpture, painting and mosaic work continued for nearly another 200 years.\nThe dome of the basilica was designed by Michelangelo, and is 400 feet tall and 138 feet in diameter.\nThe church is shaped like a cross and is almost 700 feet long, 450 feet wide at its widest point, and stands on more than 18,000 square yards.\nIn the grottoes or necropolis, beneath the basilica, is a papal burial chamber. The tombs of many popes, including St. Peter (the first pope), are located here.\nVatican Palaces\nThe Vatican Palaces consist of several connected buildings with over 1,000 rooms. Within the palaces there are apartments, chapels, museums, meeting rooms and government offices.\nThe Palace of Sixtus V is the pope's residence.\nThe Vatican museums, archive, library, gardens and other offices make up the remainder of the palaces.\nThe Sistine Chapel\nA separate structure from the basilica, designed to be the pope's chapel, was commissioned by Pope Sixtus IV della Rovere.\nThe Sistine Chapel was designed by architect Giovanni dei Dolci. The decorations by Pier Matteo d'Amelia, Michelangelo, Raphael and others continued for 60 years after construction was completed.\nIt is the site of the papal conclave and where elections for the new pope are held.\nIt is one of the world's most famous galleries of biblical art with the ceiling by Michelangelo, tapestries by Raphael and Rosselli's Last Supper.\nTimeline\n320s - Construction begins on the first St. Peter's, by order of Constantine the Great.\n1473-1481 - The Sistine Chapel is constructed.\nApril 18, 1506 - Pope Nicholas V begins rebuilding and expanding St. Peter's Basilica.\n1508-1512 - Michelangelo paints the ceiling of the Sistine Chapel.\nFebruary 11, 1929 - The signing of the Lateran Pacts between the Holy See and Italy establishes the Vatican City State, the smallest independent nation in the world, covering only 109 acres.\nJune 7, 1929 - The Treaty of the Lateran is ratified. Pope Pius XI gives up all claims to the Papal States, and Italy agrees to the establishment of the independent State of Vatican City.\n1950 - Declared a Holy Year by Pope Pius XII, is also the year an excavation for a subway in Rome leads to an archaeological find that extended to the floor beneath St. Peter's Basilica.\nOctober 11, 1962-November 21, 1964 - The 21st Ecumenical Council of the Roman Catholic Church, known as Vatican II, is held under orders of Pope John XXIII. The council included 2,700 clergymen from all walks of Christiandom looking to improve relations with the Catholic Church. By the end of the council there is a new pope, Paul VI, a new The 21st Ecumenical Council of the Roman Catholic Church, known as Vatican II, is held under orders of Pope John XXIII. The council included 2,700 clergymen from all walks of Christiandom looking to improve relations with the Catholic Church. By the end of the council there is a new pope, Paul VI, a new constitution for the Church and new reforms.\nJune 2011 - sends the first Vatican tweet announcing the opening of the news portal, \"Dear Friends, I just launched News.va Praised be our Lord Jesus Christ! With my prayers and blessings, Benedictus XVI.\" Pope Benedict XVI sends the first Vatican tweet announcing the opening of the news portal, \"Dear Friends, I just launched News.va Praised be our Lord Jesus Christ! With my prayers and blessings, Benedictus XVI.\"\nMay 23, 2012-October 6, 2012 - Paolo Gabriele, butler to Pope Benedict XVI, is arrested for illegal possession of confidential documents. The documents are the hundreds of personal letters and confidential documents that have been released to Italian journalist and author, Gianluigi Nuzzi. Gabriele is tried, convicted and sentenced to 18 months in prison by a Vatican court.\nNovember 10, 2012 - Claudio Sciarpelletti, a computer technician, receives a two-month suspended sentence for Claudio Sciarpelletti, a computer technician, receives a two-month suspended sentence for leaking Vatican secrets to the media.\nDecember 22, 2012 - Gabriele is pardoned by the pope and immediately released to his family.\nMay 2013 - a smartphone app, is launched by Missio, a smartphone app, is launched by Pope Francis . The app provides Catholic news from the Vatican and around the world.\nNovember 24, 2013 - The Vatican exhibits the bones of a man long believed to be St. Peter, one of the founding fathers of the Christian church, for the first time.\n2014 - The Pontifical Council for Social Communications launches The Pope App, to follow papal events and Servizio Internet Vaticano - Direzione TLC launches The Pontifical Council for Social Communications launches The Pope App, to follow papal events and Servizio Internet Vaticano - Direzione TLC launches Vatican.va , the official app of the Holy See.\nJanuary 10, 2019 - after receiving the blessing of the Italian Olympic Committee (CONI). Among the first members of the Vatican Athletics track team are nuns, priests, Swiss Guards, museum workers, carpenters and maintenance workers. The Holy See launches its official athletics team after receiving the blessing of the Italian Olympic Committee (CONI). Among the first members of the Vatican Athletics track team are nuns, priests, Swiss Guards, museum workers, carpenters and maintenance workers.\nMarch 4, 2019 - Pope Francis announces that the Vatican archives on wartime Pope Pius XII will be opened to researchers on March 2, 2020.\nMarch 22, 2019 - American: The Jesuit Review publishes an excerpt from a book by its Vatican correspondent, \"The Election of Pope Francis: An Inside Account of the Conclave That Changed History.\" The book reveals how many votes were cast and who received them during the 2013 election of Pope Francis.", "url": "https://www.cnn.com/2013/10/30/world/vatican-fast-facts/index.html"}