{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:57:23", "date_modify": "2020-05-04 16:57:23", "date_publish": "2013-09-18 20:43:12", "description": "Read Fast Facts from CNN about the bombing of the Alfred P. Murrah Federal Building in Oklahoma City, Oklahoma on April 19, 1995.", "filename": "2013_09_18_us_oklahoma-city-bombing-fast-facts_index_1588611443.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/160318000101-merrick-garlands-work-oklahoma-city-bombing-dnt-sanchez-ac-00005024-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_09_18_us_oklahoma-city-bombing-fast-facts_index_1588611443.html", "title": "Oklahoma City Bombing Fast Facts", "title_page": "Oklahoma City Bombing Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Photos: The Oklahoma City bombing Oklahoma City firefighter Chris Fields holds a baby who was inside the Alfred P. Murrah Federal Building when it was hit by a truck bomb on April 19, 1995. The 1-year-old, Angel Baylee Almon, later died in the hospital. She was one of the 168 people killed in the terrorist attack. More than 500 people were injured. Hide Caption 1 of 13\nPhotos: The Oklahoma City bombing A man's face is covered with blood in the aftermath of the deadly bombing. Hide Caption 2 of 13\nPhotos: The Oklahoma City bombing The Federal Building following the blast. Hide Caption 3 of 13\nPhotos: The Oklahoma City bombing The building wreckage on April 21, two days after the bombing. Hide Caption 4 of 13\nPhotos: The Oklahoma City bombing Rescue workers dig through the rubble as they look for survivors on April 29, 10 days after the bombing. Work was halted because of falling debris that was a danger to the rescuers. Hide Caption 5 of 13\nPhotos: The Oklahoma City bombing Timothy McVeigh is led from a courthouse in Perry, Oklahoma, after being charged in connection with the bombing. Two years later, he was convicted on 11 counts of murder, conspiracy and using a weapon of mass destruction. He was executed by lethal injection in 2001. His co-conspirator, Terry Nichols, was sentenced to life in prison. Both McVeigh and Nichols were former U.S. Army soldiers associated with the extreme right-wing Patriot Movement. The Patriot Movement rejects the legitimacy of the federal government and law enforcement. Hide Caption 6 of 13\nPhotos: The Oklahoma City bombing Mary Ligons visits her daughter, 15-year-old Brandy, at an Oklahoma City hospital two days after the bombing. Brandy was the last survivor pulled from the destroyed building. Hide Caption 7 of 13\nPhotos: The Oklahoma City bombing President Bill Clinton, seen in the front row with the first lady, attends a memorial service in Oklahoma City on April 23. \"We pledge to do all we can to help you heal the injured, to rebuild this city, and to bring to justice those who did this evil,\" he said. Hide Caption 8 of 13\nPhotos: The Oklahoma City bombing A prayer service is held in Oklahoma City in April 1995. Hide Caption 9 of 13\nPhotos: The Oklahoma City bombing Rescue workers use a saw to cut through debris as the hunt for survivors continues 10 days after the blast. Hide Caption 10 of 13\nPhotos: The Oklahoma City bombing A boy visits the fence that surrounds the remains of the Federal Building in May 1997. It was later razed, and a park and memorial was built on the site. Hide Caption 11 of 13\nPhotos: The Oklahoma City bombing Nichols is escorted out a courthouse in McAlester, Oklahoma, in 2004. He was sentenced to 161 consecutive life terms without the possibility of parole. Hide Caption 12 of 13", "url": "https://www.cnn.com/2013/09/18/us/oklahoma-city-bombing-fast-facts/index.html"}