{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:57:24", "date_modify": "2020-05-04 16:57:24", "date_publish": "2013-09-03 16:25:05", "description": "Read CNN's Fast Facts about the United Nations Security Council and learn more about the 15-member body within the UN.", "filename": "2013_09_03_world_united-nations-security-council-fast-facts_index_1588611444.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/130307164531-un-security-council-north-korea-sanctions-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2013_09_03_world_united-nations-security-council-fast-facts_index_1588611444.html", "title": "United Nations Security Council Fast Facts", "title_page": "United Nations Security Council Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the United Nations Security Council, a 15-member body within the United Nations.\nOverview\nThe Security Council has 15 members.\nThere are five permanent members: the United States, the Russian Federation, France, China and the United Kingdom.\nTen temporary members are elected by the General Assembly for two-year terms.\nUN Security Council Voting\nTo be approved, a Council resolution must have nine \"YES\" votes out of 15 and no \"NO\" votes from any of the five permanent members.\nEach Council member has one vote.\nA \"NO\" vote from one of the five permanent members kills the resolution.\nThere is no such thing as a \"VETO\" vote in formal UN rules, though a \"NO\" vote from a permanent member has the effect of vetoing a resolution.\nIf a member \"ABSTAINS\" from voting, it does not count as either a \"YES\" or \"NO\" vote.\nMembers raise their hands to vote, and sit at a horseshoe-shaped table.\nEach of the five Permanent Members has gone to war or invaded a country without Security Council approval.\nSecurity Council Vetoes\nA list of resolutions presented to the Security Council, along with the permanent member negative votes, can be found here\nUN Security Council Presidency\nThe presidency of the Council rotates monthly, going alphabetically among member states.\n2020 Schedule of Presidency\nJanuary: Vietnam\nFebruary: Belgium\nMarch: China\nApril: Dominican Republic\nMay: Estonia\nJune: France\nJuly: Germany\nAugust: Indonesia\nSeptember: Niger\nOctober: Russian Federation\nNovember: Saint Vincent and the Grenadines\nDecember: South Africa\nUNSC Functions & Power\nAll Members of the United Nations agree to accept and execute the decisions of the Security Council:\n\"to maintain international peace and security in accordance with the principles and purposes of the United Nations;\"\n\"to investigate any dispute or situation which might lead to international friction;\"\n\"to recommend methods of adjusting such disputes or the terms of settlement;\"\n\"to formulate plans for the establishment of a system to regulate armaments;\"\n\"to determine the existence of a threat to the peace or act of aggression and to recommend what action should be taken;\"\n\"to call on Members to apply economic sanctions and other measures not involving the use of force to prevent or stop aggression;\"\n\"to take military action against an aggressor;\"\n\"to recommend the admission of new Members;\"\n\"to exercise the trusteeship functions of the United Nations in 'strategic areas';\"\n\"to recommend to the General Assembly the appointment of the Secretary-General and, together with the Assembly, to elect the Judges of the International Court of Justice.\"", "url": "https://www.cnn.com/2013/09/03/world/united-nations-security-council-fast-facts/index.html"}