{"authors": ["Dean Baker", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:08", "date_modify": "2020-05-04 19:50:08", "date_publish": "2014-04-16 00:00:00", "description": null, "filename": "2014_04_unremedial-education_1588621808.html", "image_url": "https://images.jacobinmag.com/2014/04/16234842/8651119768_3fe5e8822c_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_04_unremedial-education_1588621808.html", "title": "Education Is Not the Answer", "title_page": "Education Is Not the Answer", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "This article is from Class Action: An Activist Teacher’s Handbook , a joint project of Jacobin and the Chicago Teachers Union’s CORE. The booklet can be downloaded for free and print copies are still available.\nIt’s common in policy circles to claim that improving the quality of education in inner cities and impoverished rural areas is the answer to halting the growing gap between rich and poor. This view reflects not only illusions about the potential for substantially improving education for children from low- and moderate-income families without deeper economic and political shifts, but also a serious misunderstanding about the growth of inequality over the last three decades.\nThere should be no surprise, then, that the education reform movement has failed in its effort to boost educational outcomes for children from disadvantaged backgrounds.\nAt this point, education “reform” is hardly new; it is the establishment consensus, having led the national agenda on education for the last quarter century. The extent to which it has produced gains can be debated, but it has, without a doubt, not turned around struggling schools. The children in these schools still perform consistently worse on standardized tests and have much poorer career prospects than children attending wealthy suburban public schools or private ones.\nBut even if reform had improved education, it is unlikely to have done much about inequality. People with more education have, on average, done better than those with less education, but the growth in inequality over the last three decades has not been mainly a story of the more educated pulling away from the less educated. Rather, it has been a story in which a relatively small group of people (roughly the top one percent) have been able to garner the bulk of economic gains for reasons that have little direct connection to education.\nThe classic story of the education and inequality story is usually captured by the college/non-college premium: the ratio of the pay of those with college degrees to those without college degrees. This premium showed a substantial rise in the 1980s for both men and women. According to data from the Economic Policy Institute, the college premium for men rose from 20.2% at the 1979 business cycle peak to 34% at the business cycle peak in 1989. For women, the premium rose from 25% in 1979 to 40% in 1989.\nInterestingly, the sharpest rise, especially for men, was during the high unemployment years at the start of the decade. The rise in the college/non-college pay gap is often attributed to technology and the growing use of computers in the workplace, in particular. But the largest rise in the college premium occurred at a point in time when computers were just being introduced to the workplace.\nIf the timing of the rise in the pay gap in the 1980s doesn’t fit the technology story very well, the wage trend in the last two decades is even harder to square with this picture. There was a much smaller increase in the college premium in the 1990s than in the 1980s — even though this was the period of the tech boom, when information technology led to a marked acceleration in the rate of productivity growth. After having risen by almost fourteen percent in the 1980s business cycle, the college premium for men rose by just 8% from 1989 to the business cycle peak in 2000. For women, the premium increased by 7.9% points in the 1990s cycle after increasing 15% in the 1980s.\nThe 2000s don’t fit any better with the technology and inequality story, as even college grads could no longer count on sharing in the gains from growth. For men, the premium rose by 2.8% between 2000 and 2011. This corresponded to a 2.4% gain in wages for male college grads between 2000 and 2012. The college premium for women increased by just 0.8% points over this period, with the wages of female college grads rising by 0.7% between 2000 and 2012. This situation holds true even if we look at just the segments of the labor market where we might expect especially strong demand. The average hourly wage for college graduates working in computer and mathematical occupations increased by just 5.3% from 2000 to 2011 — less than one-third of the rate of productivity growth over this period.\nThe patterns in the data show that inequality is not a question of the more-educated gaining at the expense of the less-educated due to inevitable technological trends. Rather, it has been a story in which a small group of especially well-situated workers — for example, those in finance, doctors, and top-level corporate executives — have been able to gain at the expense of almost everyone else. This pattern of inequality will be little affected by improving the educational outcomes for the bottom quarter or even bottom half of income distribution.\nOf course, this does not argue against efforts to improve education. It is almost always the case that workers with more education do better than workers with less education, both in terms of hourly wages and employment outcomes. Unemployment and non-employment rates are considerably higher for those with less education.\nEducation does provide a clear avenue for mobility. Certainly it is a positive development if children from low-income families have the opportunity to move into the middle class, even if this might imply that someone from a middle-class background will move in the opposite direction.\nAnd education is tremendously valuable for reasons unrelated to work and income. Literacy, basic numeracy skills, and critical thinking are an essential part of a fulfilling life. Insofar as we have children going through school without developing these skills, it is an enormous failing of society. Any just society would place a top priority on ensuring that all children learn such basic skills before leaving school.\nHowever, it clearly is not the case that plausible increases in education quality and attainment will have a substantial impact on inequality. This will require much deeper structural changes in the economy. As a practical matter, given the dismal track record of the education reformers, substantial improvement in outcomes for children from low- and moderate-income families is likely to require deep structural change in society as well.", "url": "https://www.jacobinmag.com/2014/04/unremedial-education"}