{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:08:35", "date_modify": "2020-05-04 16:08:35", "date_publish": "2014-01-31 14:30:35", "description": "View Jack Nicholson's Fast Facts at CNN and learn more about the Academy Award winning actor.", "filename": "2014_01_31_us_jack-nicholson-fast-facts_index_1588608515.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/140228110041-jack-nicholson-56-millones-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2014_01_31_us_jack-nicholson-fast-facts_index_1588608515.html", "title": "Jack Nicholson Fast Facts", "title_page": "Jack Nicholson Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the life of actor Jack Nicholson, who has won three Academy Awards and been nominated for 12, the most of any male performer.\nPersonal\nBirth date: April 22, 1937\nBirth place: Neptune, New Jersey\nBirth name: John Joseph Nicholson\nFather: Identity not confirmed.\nMother: June Nicholson\nMarriage: Sandra Knight (1961-1966, divorced)\nChildren: with Rebecca Broussard: Lorraine and Raymond; with Winnie Hollman: Honey; with Susan Anspach: Caleb; with Sandra Knight: Jennifer\nOther Facts\nRaised by Ethel May Nicholson. It wasn't until Nicholson was an adult that he learned that Ethel May was his grandmother and not his mother. His birth mother was June Nicholson, who he grew up believing was his sister.\nWorked in film for 10 years before his breakthrough role in \"Easy Rider.\"\nWrote, produced and starred in the 1966 western \"Ride in the Whirlwind.\"\nArdent Los Angeles Lakers fan.\nTimeline\n1954 - Moves to Los Angeles.\n1958 - Makes his film debut in \"The Cry Baby Killer.\"\n1969 - The film \"Easy Rider\" is released and earns him an Academy Award nomination for Best Supporting Actor.\n1974 - The film \"Chinatown\" is released.\n1976 - Wins the Best Actor Wins the Best Actor Academy Award for his performance in \"One Flew over the Cuckoo's Nest.\"\n1980 - The film \"The Shining\" is released.\n1984 - Wins the Academy Award for Best Supporting Actor for his performance in \"Terms of Endearment.\"\n1989 - The film \"Batman\" is released. Nicholson plays the Joker.\n1998 - Wins the Academy Award for Best Actor for his performance in \"As Good as It Gets.\"\n1994 - Smashes another man's car windshield with a golf club during a traffic dispute. Later, charges are dropped and Nicholson reaches an undisclosed settlement with the car's owner.\nDecember 2001 - Kennedy Center honoree.\n2006 - Co-stars in the Martin Scorsese film \"The Departed.\"", "url": "https://www.cnn.com/2014/01/31/us/jack-nicholson-fast-facts/index.html"}