{"authors": ["Ellen Meiksins Wood", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:49", "date_modify": "2020-05-04 19:52:49", "date_publish": "2014-12-17 00:00:00", "description": null, "filename": "2014_12__1588621969.html", "image_url": "https://images.jacobinmag.com/2014/12/17001759/PSM_V62_D073_Steam_shovel-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_12__1588621969.html", "title": "Capitalism’s Gravediggers", "title_page": "Capitalism’s Gravediggers", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nCapitalism was for a while a forbidden word, at least in mainstream politics and media, which treated it as a left-wing pejorative. What we got instead were “private enterprise,” the “free market,” and so on. The word is now back in more common usage, but its meaning tends to be a bit vague. Pressed for a definition of capitalism, most people would make some reference to markets, trade, and commerce. Any society with well-developed commercial activity, particularly (but not only?) where trade and industry are privately owned, would count. Some people insist on defining the term more precisely. I’m one of them — and we’ve been criticized for offering too precise a definition (more on that later). But it seems to me there are advantages to being clear about what truly distinguishes the capitalist system from any other social form — at least if we want to understand why it operates the way it does, whether in (relatively) good times or in bad.\nDefining Capitalism So, what do I mean by capitalism? Capitalism is a system in which all major economic actors are dependent on the market for their basic requirements of life. Other societies have had markets, often on a large scale; but only in capitalism is market dependence the fundamental condition of life for everyone. And that is equally true of capitalists and workers. The relation between capital and labor is itself mediated by the market. Wage laborers have to sell their labor power to a capitalist simply in order to gain access to the means of their own life and even the means of their own labor; and the capitalist depends on the market for access to labor and to realize the profits the workers produce. Of course there’s a huge imbalance of class power between capital and labor, but capitalists are no less dependent on the market to maintain themselves and their capital. In non-capitalist societies, direct producers such as peasants typically possessed their means of subsistence and production (land, tools, etc.), so they were not dependent upon the market. The dominant class had therefore to be able to deploy superior power in order to appropriate the surplus labor of others by what Marx called “extra-economic” means — that is, coercive force of one kind or another: juridical, political, or military — as, for instance, when a feudal lord extracted labor services or rent from peasants. Capitalist profits, by contrast, are not extracted directly from workers. Capitalists pay workers in advance and must realize their gains by selling what workers produce. Profit depends on the difference between what the capitalist pays workers and what s/he derives from the sale of the products and services supplied by the workers. The fact that capitalists can make a profit only if they succeed in selling their goods and services on the market, and selling them for more than the costs of producing them, means that their making a profit is uncertain. Capitalists must also compete successfully with other capitalists in the same market in order to secure a profit. Competition is, in fact, the driving force of capitalism — even if capitalists often do their best to avoid it, by means, for example, of monopolies. But the social average of productivity that, in any given market, determines success in price competition is beyond the control of individual capitalists. They can’t command the prices at which their products will successfully sell and don’t even know in advance what conditions are necessary to guarantee a sale at all, let alone a profitable one. The one thing capitalists can control to a significant extent is their costs. So, since their profits depend on a favorable price/cost ratio, they will do everything possible to cut their costs to ensure profit. This means, above all, cutting the costs of labor; and this requires constant improvements in labor productivity, to find the organizational and technical means of extracting as much surplus as possible from workers within a fixed period of time, at the lowest possible cost. To keep this process going requires regular investment, the reinvestment of surpluses, and constant capital accumulation. This requirement is imposed on capitalists regardless of their own personal needs and wants, whether they are altruistic or greedy. Even the most modest and socially responsible capitalist is subject to these pressures and is compelled to accumulate by maximizing profit, just to stay in business. The need of capitalists to adopt “maximizing” strategies is a basic feature of the system. So the whole capitalist system is operated by market imperatives, the compulsions of competition, profit-maximization, capital accumulation, and a relentless imperative to improve the productivity of labor so as to reduce costs in order to reduce prices.\nWhat Capitalism Isn’t Which brings us to what capitalism isn’t. I keep talking about capitalist market imperatives, and what I’m suggesting is that there’s an essential difference between imperatives and opportunities. Highly developed commercial networks have emerged throughout human history, on various continents; and, just to mention some major European cases, there have been societies, such as the Florentine or Dutch republics, in which commercial interests have been dominant, politically and economically. France too had an advanced and far-reaching commercial network. But even such highly developed commercial societies were not subject to the specifically capitalist principles of constantly accumulating to meet constant competition — the unrelenting pressure to increase labor productivity to reduce costs. Elites in such societies typically still relied for their wealth on “extra-economic” power, on legal, political, or military superiority and coercion. Public office, for instance, was a major source of income. Even commercial success depended largely on superiority in negotiating separate markets (as distinct from competitiveness in an integrated market) — by means, for example, of dominance in shipping and command of trade routes, as well as monopolies and trading privileges granted by governments, to say nothing of direct military force often deployed by private companies. These commercial societies might engage in substantial production and might even achieve significant technical innovations, but these had less to do with improving competitiveness than with increasing output to take advantage of a growing market. Declining market opportunities were likely to be met by the withdrawal of investment from production — in contrast to capitalism, where declining market opportunities can actually intensify rather than weaken the need to respond to market imperatives. So when western European economies descended into crisis after 1660, wealthy elites in the Dutch Republic disinvested from land and eventually from industrial production. By the mid-eighteenth century non-productive rentiers would account for by far the greatest wealth. This was in sharp contrast to what was happening in England at the same time. In earlier years, England had in some respects lagged behind its European neighbors in commercial development. But the English economy — especially the agricultural sector —was the first in history in which production was directly driven by the imperatives of competition, profit-maximization, and capital accumulation. A substantial class of English agricultural producers, mainly tenant farmers, had emerged on the ruins of the peasantry, which had seen its land expropriated. Separated from their means of subsistence, these agrarian capitalists were dependent on the market, and whatever their own consumption needs, were therefore required to meet those imperatives. They may not have been compelled to attain an average rate of profit in the manner of a modern capitalist, but production for profit beyond their own subsistence needs was the condition of their continued access to the land and a presupposition of production for their own subsistence. These producers were thus subject to price/cost pressures in a wholly new way, with the consequence that when the trans-European crisis and declining agricultural prices brought about the intensification of competition, it spurred in England, in contrast with the Netherlands and the rest of Europe, an increase in productive investment in new technologies to enhance labor productivity and cost-effectiveness. The outcome often described as an agrarian revolution in eighteenth century England was an ongoing reduction in costs leading to rising real wages, the growth of the domestic market, the transcendence of Malthusian populations ceilings — the first breakthrough to “self-sustaining growth.” This historic contrast highlights the essential difference between non-capitalist commercial societies and an economy driven by the market imperative to enhance competitiveness by increasing labor productivity. To put it another way — in contemporary economic jargon — one might say that in these non-capitalist commercial societies, finance, along with commerce and rent-taking, was the “real economy,” in contrast to capitalist societies in which the financial sector is commonly distinguished from, and subordinate to, the “real” production of goods and services. Merchants and traders typically depended on buying cheap in one market and selling dear in another, or on arbitrage and negotiating separate markets. If they withdrew investment from production, commercial activity could still carry on in its own traditional way. At the same time, producers such as peasants, who possessed the means of subsistence and were therefore largely shielded from competitive constraints, never depended fundamentally on satisfying market imperatives and could still produce to meet their own subsistence needs. This contrasts sharply with developed capitalist societies, in which, for capital and labor alike, both continued production and their very survival depend on obeying the market imperatives at the foundation of the social order. Financial interests can certainly detach themselves from production or the “real economy”; but then it needs to be explained how and why, in a capitalist system, financial speculation could and would uproot itself from the real economy in ways that can only end badly (as it has done in the current crisis) — an explanation that requires a specific conception of what capitalism is (and isn’t).\nThe Emptiness of Bourgeois Revolution Vague conceptions of capitalism can’t explain what’s specific about the capitalist system as distinct from any other social form, and that’s in part because they dodge another question: where it came from in the first place. If capitalism has always existed — sort of — or if there’s no identifiable process of historical change from non-capitalist societies to capitalism, there’s nothing much to say about its specificity. From the eighteenth century on, standard explanations of the origin of capitalism have taken it as given that capitalism has existed in embryonic form since time immemorial, for as long as there have been markets and trade. With enough commerce and opportunities to make money, sellers would sooner or later begin acting more or less like capitalists: specializing, accumulating, and innovating. If anything required explanation, in this view, it was the failure to remove the obstacles — the political or cultural impediments — which had for so long prevented commercial activity from reaching critical mass and spontaneously generating capitalism proper. We can call this the “commercialization model” of capitalist history, and it goes back at least to Adam Smith himself in The Wealth of Nations. So this version of capitalist history is an old story. But the vague conception of capitalism that lies at its heart has become particularly essential most recently to a school of Marxist thought which has accused people like me (whom they like to call “Political Marxists”) of an “eccentrically narrow conception of capitalism.” (Alex Callinicos and Camilla Royle, “Pick of the Quarter,” International Socialism 142, April 2, 2014). Their own conception is for the most part consistent with the commercialization model, with particular emphasis on technological advance as an essential driving force. But at the very heart of their idea is the concept of “bourgeois revolution.” In fact, the main point of their vagueness about the definition and history of capitalism is to rescue the concept of bourgeois revolution. (See in particular Neil Davidson, How Revolutionary Were the Bourgeois Revolutions? Haymarket, 2012; “Is There Anything to Defend in Political Marxism?” International Socialist Review 91, August 14, 2014.) Like the commercialization model itself, the bourgeois revolution is an old story, not invented by Marxists. But the standard historical narrative about capitalism took a significant turn when it came to be associated with the idea that “bourgeois revolution” had been decisive in removing obstacles to the advancement of commercial society. It was French historians, notably Francois Guizot, who began to think of modern Western — or, indeed, global — history as the forward march of the bourgeoisie in class conflict with more backward forces and to interpret historical events (whether social uprisings, civil wars, or even the process of industrialization) through the imagery of revolution derived from their nation’s own recent revolutionary experience. Historians such as Guizot conferred on the English Civil War its status as a bourgeois revolution (and later British industrialization as an industrial revolution). The effect of melding French and English history was to conflate the rise of capitalism with the progress of the bourgeoisie. It is difficult to overstate the confusions engendered by this historical conflation, which is largely responsible for the identification of “bourgeois” with “capitalist.” In its original French meaning, the “bourgeoisie” referred to towndwellers and, at some point, came to designate the more prosperous elements of the Third Estate. But capitalism in any precise sense had little to do with it. It might be reasonable to describe the French Revolution as bourgeois — that is, as a conflict between bourgeoisie and aristocracy —so long as bourgeois is not taken to mean capitalist and it is understood that it was not about capitalism. The typical revolutionary bourgeois was not a capitalist or even a precapitalist merchant but an officeholder or professional. The bourgeoisie’s opposition to the aristocracy was not about promoting capitalism but above all about challenging aristocratic privilege and privileged access to state office. The English Revolution, on the other hand, could reasonably be described as capitalist, because it was rooted in capitalist property, and it was even led by a class that was essentially capitalist. But it was not particularly bourgeois. Not only was there no class struggle between bourgeoisie and aristocracy, but the dominant capitalist class was actually the landed aristocracy. The conflation of these historical cases made “bourgeois revolution” a central theme in the capitalist story. Once that happened it began to play a critical role in the question-begging explanation, or, more precisely, non-explanation, of capitalism’s origins. Once it was taken as given that the bourgeoisie was inherently and by definition capitalist, capitalism could be assumed to already exist; and all that required explanation was not the origin of capitalism but the triumph of the bourgeoisie and thereby the removal of obstacles to the victory of capitalism in conflicts with more backward forces. This tendency would be particularly visible in various Marxist traditions. It is true that Marx himself was influenced by Guizot and the narrative of bourgeois progress; but in his mature analyses of capitalism he would move far beyond the ideas of historical development and class struggle inspired by Guizot. (Even in his early work, notably the Communist Manifesto , there were already significant departures from the French thinker’s influence.) Nevertheless, the idea of bourgeois revolution, as a necessary stage in history achieved by class struggle between the bourgeoisie and backward landed classes, would harden into simplistic orthodoxy when it was mobilized to support the Stalinist doctrine of “socialism in one country” against Trotsky’s “permanent revolution.” Yet the notion of the bourgeois revolution as a historical event driven by a class conflict between, on the one hand, a rising capitalist class of merchants and industrialists and, on the other, a backward feudal aristocracy, became difficult to sustain against the overwhelming historical evidence that no straightforward class struggle between landed aristocracy and capitalist classes occurred anywhere, not even in France. So the bourgeois revolution in its crudest variety was largely abandoned some time ago.\nThe “Political Marxists” Nevertheless, the crude idea was kept alive, in a negative form, by critics of Marxism. It served as a major target for various “revisionist” historians seeking to challenge “social interpretations” of the French and English revolutions by demonstrating that in neither case was there anything like a revolutionary class struggle between a rising capitalist bourgeoisie and a declining feudal aristocracy. But while the “revisionists” were still aiming their fire at a type of social interpretation that scarcely any serious historian was advocating, Marxists were moving on. Some who had concluded that the concept of bourgeois revolution obscured more than it revealed — notably those labelled “Political Marxists” — began offering new social interpretations of both the French and English revolutions (see, in particular, George Comninel, Rethinking the French Revolution , Verso, 1987; and, on the English, Robert Brenner, postscript to Merchants and Revolution , Verso 2003). They still emphasized social property relations and class, outlining the specific constraints and requirements imposed by specific social property relations with their own distinctive “rules for reproduction.” But these new social interpretations no longer depended on old accounts of class struggles between aspiring capitalists and backward landed classes. Others have still been reluctant to abandon the idea of bourgeois revolution. But in order to sustain it, they have effectively abandoned the traditional idea of a rising bourgeois capitalist class against a backward feudal class and replaced it with a much vaguer notion. Proceeding from the conventional identification of bourgeois with capitalist (always problematic), a group of Marxist historians, led especially by Neil Davidson, have thus put forward the idea that what makes a revolution bourgeois, whatever its causes and agencies, is that it has the effect of contributing to the advancement of capitalism. In other words, it is outcomes or consequences, not particular class agents, that identify revolutions as bourgeois. This “consequentialist” version of bourgeois revolution applies the concept to any kind of transformation that somehow can be said to promote the development of capitalism or sweep away obstacles to its advance, whatever the class composition or intentions of revolutionary agents. Indeed, agency may even disappear in accounting for the capitalist advances of bourgeois revolution, replaced instead by some transhistorical mechanism of “bourgeois” progress, such as the inevitable advancement of technological forces. These Marxist consequentialists may try to take into account, up to a point, historical evidence that challenges old orthodoxies; and it would be perfectly reasonable if all they were saying is that capitalism first emerged not as a deliberate class project but as an unintended consequence (as, by the way, Political Marxism actually argues). It might even be — just about — understandable if they simply accepted the (problematic) identification of “bourgeois” with capitalist and redefined the “bourgeois revolution” as any revolutionary process which, irrespective of agencies or intentions, advanced the development of capitalism. But as it is, their argument runs into insurmountable obstacles. This is because they feel compelled, for largely ideological reasons, to give the concept of bourgeois revolution an unsustainable universality, which in the end deprives it of all meaning. Bourgeois revolution has to subsume not only revolutionary upheavals but also very long, gradual historical processes. It is also obliged, quite explicitly, to cover a curiously broad and diverse historical spectrum. The bourgeois revolution becomes ever more improbably bendable when forced to cover a wide range of historical patterns on various continents. But what really produces an insoluble contradiction in the consequentialists’ concept of bourgeois revolution is that it includes not only cases in which capitalism actually was advanced — for instance, by the triumph of a capitalist landed aristocracy in England — but also cases where capitalist development was actually impeded by the revolution. This is most striking in what the consequentialist analysts view as the classic case of the bourgeois revolution, i.e. the French Revolution — which had the effect of fettering capitalist development by entrenching peasant property and opening the way to freer access to state careers for bourgeois officeholders. A conception of bourgeois revolution that can include both cases in which capitalism is advanced and those in which it is obstructed would seem fairly meaningless. But even if we set aside the fact that the consequentialist concept of bourgeois revolution has no obvious connection to the advancement of capitalism, however defined, it simply does not and cannot explain the origin of capitalist property relations, even if the alleged revolution is said to take place before, and as a condition for, the maturation of capitalism. This is because, by the consequentialists’ own definition, all that the bourgeois revolution is explaining is the the removal of obstacles to the development of a capitalism that already exists, a capitalism whose prior existence is assumed. The fundamental question of how it came into existence simply cannot be posed. In its most recent development, the consequentialist argument emphasizes the importance of revolutions from above, or transformations in the state, which then seeks to promote the maximization of capitalist profit. These state transformations may vary greatly in their nature, timing and causalities; and bourgeois revolutions may produce a wide variety of state forms, from France or England to Japan. Yet whatever the nature and timing of the relevant state transformations, consequentialism can’t explain the origin of precisely those capitalist property relations that state transformations are supposed to advance. The explanatory value of the concept of “bourgeois revolution” is further compromised if we acknowledge that all cases of capitalist development, apart from the first one, presupposed imperatives, commercial and military, generated by an already existing capitalism elsewhere. The main example here is the advantages in trade and war enjoyed by a capitalist Britain, which affected the development of other European powers and imperialist expansion, especially by encouraging state policies designed to rival the British — not least in France. So this consequentialism is ambiguous about both causes and consequences. At this point, the concept of bourgeois revolution hardly refers to anything specific at all. The idea of bourgeois revolution has been defined out of existence. It applies to everything, which means it explains nothing.", "url": "https://www.jacobinmag.com/2014/12/capitalisms-gravediggers/"}