{"authors": [], "date_download": "2020-05-04 20:20:12", "date_modify": "2020-05-04 20:20:12", "date_publish": "2014-07-31 19:10:41", "description": "NEW YORK (AP) — Coca-Cola is reversing course after fans of Vitaminwater complained about the drink's new sweetener. The Atlanta-based company promised Thursday the drink would go back to...", "filename": "_ff8233d79ba34c37ba73453d33062ea6_1588623612.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ff8233d79ba34c37ba73453d33062ea6_1588623612.html", "title": "Vitaminwater cries uncle, switches back formula", "title_page": "Vitaminwater cries uncle, switches back formula", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEW YORK (AP) — Coca-Cola is reversing course after fans of Vitaminwater complained about the drink’s new sweetener.\nThe Atlanta-based company promised Thursday the drink would go back to its previous taste after fans flooded Vitaminwater’s Facebook page with negative comments. The reversal comes just a few months after Coca-Cola had changed the sweetener in the drink to a mix of sugar and stevia, a low-calorie sweetener known for its metallic aftertaste.\n“Our fans haven’t had the greatest things to say about it,” said a statement posted on Vitaminwater’s website.\nThe statement said the Vitaminwater that people “loved” would start appearing on shelves this fall and be available nationwide by winter. Previously, Coca-Cola sweetened Vitaminwater with a mix of sugar and crystalline fructose. The change didn’t alter the calorie count, which remained at 120 calories per bottle.\nIn explaining the change without providing specific details, Coca-Cola had previously said it was “always innovating and evolving” its products. The move came after sales volume for Vitaminwater declined 18 percent in 2013, according to Beverage Digest, an industry tracker.\nDespite its lack of popularity in some circles, Coca-Cola Co. still sees potential for stevia. The company has introduced a reduced-calorie version of its namesake cola using the sweetener in Argentina and plans to eventually roll out a version in the U.S.\nAnd Coca-Cola still uses stevia in Vitaminwater Zero, a version for the drink that has no calories.", "url": "https://apnews.com/ff8233d79ba34c37ba73453d33062ea6"}