{"authors": ["Robin Marie Averbeck", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:22", "date_modify": "2020-05-04 19:53:22", "date_publish": "2014-07-16 00:00:00", "description": null, "filename": "2014_07_why-im-not-a-liberal_1588622002.html", "image_url": "https://images.jacobinmag.com/2014/07/16235558/Hubert_Humphrey_and_Lyndon_Johnson-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_07_why-im-not-a-liberal_1588622002.html", "title": "Why I’m Not a Liberal", "title_page": "Why I’m Not a Liberal", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "I was standing in the National Mall, surrounded by nearly a quarter million people, when I realized I wasn’t a liberal.\nI had come to Washington, along with 215,000 others, to participate in Jon Stewart’s “Rally to Restore Sanity,” an event inspired by Glenn Beck’s “Rally to Restore Honor.” The festival reached its height as the spectators were treated to a video montage of fire-breathing pundits from all the major news networks denouncing their political opponents.\nThe message was clear: Those who tell you there are fundamental differences between Americans that are worth getting emphatically angry about are lying to you.\nThis divided America — an America that contains people with radically different values and radically different ideas of what a just, moral society looks like — does not exist. If it seems otherwise, it is simply because, as one sign at the rally put it, we fail to use our “inside voices.”\nStanding in the crowd, I felt my eyebrows furrow. True, the antics of cable news conflict do nothing to contribute to the national discourse. True, most American citizens are more complex than the buffoons we rightly dismiss as “pundits.” Yet for all their shameless spectacle-making, the talking heads of the national news media do get one thing right: There are substantial, and fundamental, oppositions between Americans.\nYet if mainstream liberal outlets are your major news sources, you would never know it. Stewart himself drove this point home with his final speech, an earnest paean to looking past our differences, built on the assumption that ultimately we all share the same goals, hopes, and dreams.\nThis conceit — that the fundamental divides creating discord in America are easily corrected by a cool head and an open mind — is perhaps the most central ideological tenet of contemporary liberalism. It’s also a major obstacle to a more egalitarian society.\nOf course, the primary target of liberals’ ire is the Tea Party echo chamber of conservative commentary. As Stewart put it, “We have a special place in our hearts for Fox.” Yet ironically, the Right’s willingness to recognize conflict occasionally results in more clarity from them than from liberals.\nTake the battle of obituaries that commenced between liberals and the Left after the death of Nelson Mandela. Liberals mostly wrote what they would be expected to write: appreciations of Mandela as a model of non-violent resistance while ignoring the radical dimensions of his political project. The Left responded with the type of corrective history that has become commonplace every year Martin Luther King Day rolls around.\nUsually neglected in such commentaries, however, was an acknowledgment that other voices in the political conversation also recognize the radical legacy of figures like Mandela and King — conservatives. Such conservatives did appear, but they were treated by liberals as self-evident examples of the Right’s intellectual bankruptcy, paraded out as more proof of how hysterical their movement has become.\nYet lost in all of these festive roastings of the Tea Party was the fact that the right-wing “crazies” were closer to the truth than the liberals. After all, as many a leftist columnist pointed out and celebrated, Mandela did at one point advocate the use of violence as a means to liberation, did participate in communist politics, and was, at least earlier in his career, a radical.\nBut in liberal discourse, the erroneousness of the Right is assumed, and the moral of the story again becomes one of the dangers of polarization and ideology. In liberals’ view there is no conflict, so recognizing and naming your enemy is necessarily an act of distortion.\nMoreover, by encouraging us to be anxious about open conflict, liberalism actually masks how today’s political debate obscures as much as highlights our differences.\nRecoiling from the screaming and name-calling, liberals point to conflict-oriented infotainment as toxic to the public discourse. Yet because they are so distracted by the surface noise, they miss the undisturbed bedrock of consensus positions.\nIn debates about poverty policy, for example, liberals often do push back against the nearly sociopathic desire of conservatives to destroy the welfare state. If you really want to fight poverty, they insist, you need to help folks get back on the job, not leave them at the mercy of circumstance.\nRemaining undisturbed, however, is the assumption that the solution to poverty is to push as many poor people as possible into the job market — to “fix” poor folks rather than restructure the economic institutions that place them in such a quagmire. The fact that this charade of a debate often involves yelling creates the illusion that a fundamental difference is being discussed — but it’s merely the means that are being disputed.\nAt the same time, identifying fundamental disagreements that do exist becomes extremely difficult when one cannot even name what is being struggled over — power. For at the root of the liberal denial of conflict is the liberal denial of power. And on this falsehood, all attempts to honestly confront conflict run afoul.\nTo say that liberals struggle with the concept of power is so familiar that it seems like a truism at this point. Indeed, even liberals themselves — on their leftmost flank, at least — often engage in this critique. Yet as G. E. Lessing once wrote, even those who mock their chains are not always free, and even self-conscious liberals still continually ignore or downplay power.\nLiberals in academia, for example, frequently find ways to avoid questions of power. Consider the last twenty years of scholarship on conservatism. While much of this work confronts power directly, the field itself implicitly rests on two questions: What in the world is conservatism about and how did it become so successful after World War II?\nIndeed, some scholars are so discombobulated by these problems that when one provides what seem like obvious answers — racism, sexism, and a lopsided class struggle — they respond with disbelief that anyone could offer so reductive an assessment.\nYet the importance of such scholarship is more than just academic. For when no one is understood as protecting a position of power, strategies designed to confront that power directly are deemed illegitimate.\nDirect action is characterized as undemocratic, opposition to hate speech is described as hate speech, and boycotts attempting to put pressure on Israel are attacked as dogmatic at best and antisemitic at worst.\nAnd unsurprisingly, much shortsighted hand-wringing ensues. Such strategies are intended to call the bluff that there are no sides by explicitly, and emphatically, taking a side. Those who prefer the illusion of principled neutrality sense an implied criticism of their conduct in such a move, and respond with even more furious declarations of the infinite complexity of the question and the simplicity of those taking a stand. Defining legitimate modes of opposition, then, is not only an intellectual tendency, but also a reflexive act of self-defense.\nThus by policing the acceptable boundaries of conflict, liberals end up denying the existence of conflict altogether. Injustice, in the liberal narrative, is a product of misunderstanding, an offspring of faceless processes that no one really benefits from and only the ignorant line up in defense of.\nSo blind is the liberal gaze to questions of power that even something as clearly based in domination as the Jim Crow regime is recast, as in the arguments of Gunnar Myrdal, as merely an awkward and irrational contradiction in Americans’ hearts, easily corrected if exposed as incompatible with the supposedly egalitarian ethic of the “American Creed.”\nIn the liberal imagination, education and accommodation are self-evident solutions, since the problem can neither be understood as a matter of brute power struggles nor as a product of structural inequality fundamental to the functioning of entire institutions.\nThe hundreds of murals that decorate the walls of cultural centers and student resource buildings across the country attest to this narrative of victims without victimizers. We see images of people holding flags and coming together. But who they are organizing against is rarely depicted. Where are the riot cops, the angry business owners, the hedge fund managers, the anti-choice and anti-gay protesters, the Young Americans for Freedom in these montages?\nIn this picture book version of social justice struggle, no one ever opposes freedom’s forward march. All the oppressed need to do is rise up and assert themselves; the world they are fighting for is realized simply by the act of self-declaration.\nThis blind spot is strictly enforced. Activists who try to put the oppressors back in the picture are either dismissed as illegitimate, and if they still refuse to go away, are dealt with by the police and by the courts.\nIt makes it exceedingly difficult to hold anyone responsible for their actions. The representatives of the liberal order can always cry good intentions and open dialogue, denying that, through their behavior and affiliations, they have already taken a side that is in opposition to the interests of those who protest them.", "url": "https://www.jacobinmag.com/2014/07/why-im-not-a-liberal"}