{"authors": ["Enrique Diaz-Alvarez", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:49:48", "date_modify": "2020-05-04 19:49:48", "date_publish": "2014-02-16 00:00:00", "description": null, "filename": "2014_02__1588621788.html", "image_url": "https://images.jacobinmag.com/2014/02/16234519/wall-street-bull-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_02__1588621788.html", "title": "The Rent Is Too Damn High", "title_page": "The Rent Is Too Damn High", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "After the unfortunate events of 2008–9, Goldman Sachs decided to spend a little PR money.\nTheir aim was to remind the unwashed masses that what their company does has a point beyond just making the partners rich. The result was the “Progress Is Everyone’s Business” ad campaign featuring short films about Goldman financing medical imaging companies and renovating the Brooklyn Navy Yard.\nThe message was clear: we’re not just blood-sucking vampire squids, we promise!\nGoldman is a notoriously unapologetic and publicity-shy institution. That it would feel compelled to issue such sentimental self-justifications is remarkable. As it turns out, Lady Goldman doth protest too much. Matt Taibbi’s ”vampire squid” comparison stuck because it’s largely true.\nBut even today, financial behemoths like Goldman have plenty of well-credentialed apologists. Over the weekend, Greg Mankiw — former head of the Council of Economic Advisors under President George W. Bush — gallantly rose to the defense of the ultra-wealthy, particularly high-end financiers, who make up a large and growing share of this bunch.\nAs Mankiw puts it,\nThose who work in banking, venture capital, and other financial firms are in charge of allocating the economy’s investment resources. They decide, in a decentralized and competitive way, which companies and industries will shrink and which will grow. It makes sense that a nation would allocate many of its most talented and thus highly compensated individuals to the task.\nMankiw is right that these individuals hold enormous power over our economic destiny. But there can be no doubt that their compensation is, at best, incomprehensible — at worst, a crime of unfathomable social magnitude. This shouldn’t be surprising, given that at the high end of the financial sector, the vampire squids more or less set each other’s pay.\nAs for this alleged “talent,” it’s increasingly hard to see it when one looks out at the US’s crumbling infrastructure, low levels of investment, extreme corporate short-termism, and the recurrence of bubbles, unsustainable booms and spectacular crashes that characterize recent financial history.\nUnless, of course, Mr Mankiw was referring to a very specific kind of “talent”: rent-extraction. And as we’ll see, when it comes to this particular talent, our financial elite has few parallels in economic history.\nExplaining the large gap between the cost of things and their value has been one of the classical questions in economics. Sometimes, the traditional answer provided by orthodox economics is simple and reasonable. Take the question of scarcity, for instance: Why are diamonds more expensive than water, when the latter is far more useful? Because there’s a lot of water in the world but very few diamonds.\nUnfortunately, scarcity only goes so far in explaining the cost-to-usefulness gap. Why does an artificial hip implant cost as much as a house in the US? It is not clear that the hips themselves or the surgeons who put them into place are any scarcer than good timber or architects. There is also the pesky fact that you can get one in Belgium for the price of renovating your kitchen.\nRent-extraction or rent-seeking is one of the concepts developed by orthodox economics to attempt to explain these massive, obvious gaps between income and social value. Unlike many economic concepts, this one is quite useful and worth exploring in depth — particularly since these gaps are becoming the defining characteristic of post-industrial capitalism in the so-called advanced countries.\nIn the US, rent-extraction appears to be heavily skewed by economic sector. The health care sector is perhaps the most prominent, both because of the large number of customers and dollars involved as well as the blatant visibility of the looting — and, of course, the increasingly miserable consequences. Of similar size, but perhaps more subtle in its operations, is the finance and insurance sectors together with their lesser cousin, real estate (FIRE for short).\nAs in health care, the social cost (which, lest we forget, is always income to someone else) of the FIRE sector as a percentage of GDP is at an all-time high. In both cases, massive expenditure in technology has failed to provide any visible social efficiency.\nIn a healthy, functional capitalist economy, FIRE’s fundamental role is to match the surplus funds of savers with the funding needs of investors, and to select among the latter the most profitable ones, which are presumably the most socially beneficial.\nIn an otherwise excellent paper, Thomas Philippon lists some possible sources of additional social value from FIRE. Some are dubious (liquidity services, total instrument issuance), others implied in the definition above (provision of incentives and information).\nThis definition covers only the size of the job to be done by FIRE, and tells us little about the quality of its work. That is good enough for our purposes, but, to repeat, it is hard to look at the last couple of decades of financial market volatility, collapsing private research and development spending, and rotting infrastructure and argue that the job is being done well.\nBut even then, what does FIRE charge society in return for these services?\nDoug Henwood, in his astonishingly valuable Wall Street, gives the best answer: the salaries paid to FIRE employees plus the profits of FIRE companies. In other words, the total rent collected by the sector. Orthodox economics also refers to this as the “value add” of the sector, as always making the assumption that rent extracted equals value delivered. So how efficient is the FIRE sector?\nAs it turns out, not at all — and it’s getting worse. Henwood gives us the historical evolution of FIRE rent relative to the private investment they’ve been tasked with directing.\nThe numbers are shocking:\nNowadays, for every dollar of investment it directs, the financial sector presents society with a bill of forty-five cents! During the postwar Golden Age, when the US financial sector was hardly a paragon of efficiency, it kept its take to twenty-five cents on the dollar.\nAnother way to look at this is to consider net rather than gross investment. Most gross investment goes towards maintenance or replacement of the existing capital stock as it becomes worn out in the production process or obsolete. Net investment subtracts this from the total, and thus measures the increase in productive capital — capital accumulation, in other words. Measured against net, rather than gross investment, FIRE’s take becomes nearly incomprehensible.\nFor every dollar that our capital stock increases, FIRE collects somewhere between two and four dollars! Old Soviet bureaucrats with their chauffeured Ladas and modest three-bedroom apartments never dreamed of achieving this level of parasitism.\nForcing FIRE back to the moderate inefficiency of the 1960s and 1970s — a time when bankers’ and brokers’ compensation was still very far from starvation levels — would free up roughly $500 billion a year in un-extracted rents.\nBy comparison, making higher education free for all who now attend would cost about $150 billion a year. Tripling the budget for NASA, the National Institutes of Health, and the food stamps program would run us about $240 billion. Even after all of that put together, we’d still have plenty of money to set up training programs for all the newly unemployed yacht builders and butlers. It’s not socialism, but compared to today’s status quo, it looks like utopia.\nBut what about the “working men and women” in the FIRE sector, the mid-level employees? Not everyone there is a “master of the universe,” right?\nKeep in mind that FIRE sector rents accrue mostly to a workforce of highly paid employees. Even median pay in the financial sector is about 50 percent higher than in the rest of the economy. Perhaps more significantly, financiers are greatly overrepresented among the oligarchy. Financial professions accounted for just over 4 percent of all employment, but a high (and growing) 14 percent of the top 1 percent of income-earners as of 2005. Data is scarce, but there is little doubt that their share grows as one moves higher up the ladder. According to the Economist , the top twenty-five hedge fund managers (financial rent extractors par excellence) make more money than all the CEOs of the S&P 500 combined.\nSince the 2008 collapse, efforts at reining in the financial system do not seem to have achieved much beyond hurting bankers’ feelings. The Dodd-Frank Act is far from meaningless and it certainly increased compliance costs dramatically across the industry — though it is not clear what good this does, beyond creating paper-pushing jobs and protecting well-heeled incumbents who can afford hordes of lawyers from competition by potential new entrants.\nDodd-Frank has also forced some significant operational reshuffling in the way investment banks conduct trading, forcing many opaque instruments into more transparent trading venues and driving banks more or less out of proprietary trading entirely.\nHowever, the social costs of finance have, if anything, gone up.\nIt appears that Dodd-Frank has failed to restrain financial rent extraction. Instead, we have a mere institutional shift in the rent extraction nodes — from investment banks to hedge funds, asset managers and private equity. Increasingly, the impeccably credentialed, and questionably skilled children of the elite are heading over to hedge funds in Greenwich, Conn., rather than Goldman Sachs. Other than that, nothing much has changed.\nThe numbers paint a pretty awful picture. Bloated and inefficient, the financial sector is focused on hooking up bankers with large bonuses rather than matching savings with investment. Not only is it possible for us do much better, but in fact the US has done much better, for a long time, in the period between World War II and the FIRE explosion that began in the early eighties.\nThis could be easily achieved in three ways.\nOne, a strong regulatory push towards financial product simplification and fee reduction. As a start, legislation capping the fees public pension funds are allowed to pay out to third parties would have a significant psychological and (given their size) quantitative impact on the industry.\nTwo, a move towards low-cost utility banking via “public options.” A recent example was the de facto nationalization of the mortgage market after the 2008 crash, which brought about the stabilization of the housing market and simplified, low-margin products. Another excellent idea is Elizabeth Warren’s push for a Postal Bank that would take advantage of the Post Office’s extensive branch network and implicit government guarantee to offer low-cost retail banking services.\nLast, a large increase in public infrastructure investment. Not only is it desperately needed in a country whose physical plant has been left to rot for thirty years, but it would also largely cut FIRE out of the loop, at least at the Federal level. It has been the federal government’s privilege for many decades to issue the world’s preeminent riskless asset, the Treasury bond. No great salesmanship is required to find buyers for it. In fact, a few hundredths of a percentage point at auction time are considered ample reward by Wall Street banks (so-called “primary dealers”) for the slight trouble of placing them among holders of surplus funds. This imperial efficiency means that merely restoring 1960s levels of federal infrastructure spending would suffice to at least break the ugly trends visible in the figure above.\nBut it’s hard to be optimistic about any of this happening. The massive socioeconomic gap between regulators and the nominally regulated means that the former worry mostly about getting future gigs with the latter. Obama is no friend of public options of any kind, and has in fact announced plans to reprivatize the mortgage market at the earliest opportunity. Warren’s Postal Banking proposal has been received as little more than a Senatorial eccentricity. When it comes to infrastructure, the political choice appears to be between cutting and cutting more. Polls do tell us that all of these measures would be enormously popular, but that is an increasingly irrelevant detail when it comes to US policy.\nMankiw’s bucolic view of our financial elite as misunderstood, hard working and talented supermen collecting their justly enormous rewards is completely wrongheaded. Closer to the mark is the image of a gang of grasping toll collectors collecting more and more for doing less and less for the rest of society — and doing it badly.", "url": "https://www.jacobinmag.com/2014/02/the-rent-is-too-damn-high-2/"}