{"authors": ["Adam Gaffney", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:48", "date_modify": "2020-05-04 19:52:48", "date_publish": "2014-04-16 00:00:00", "description": null, "filename": "2014_04__1588621968.html", "image_url": "https://images.jacobinmag.com/2014/04/16234844/5278448067_f76b92377c_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_04__1588621968.html", "title": "The Neoliberal Turn in American Health Care", "title_page": "The Neoliberal Turn in American Health Care", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Last year’s three-ring Congressional shutdown circus — for many little more than a desperate rearguard action by an isolated right-wing fringe to undo the fait accompli of Barack Obama’s health care reform — reinforced with each passing day the gaudy dysfunction of the American political system. But we miss something crucial if we construe the perseverance of Barack Obama’s 2010 Affordable Care Act (ACA) as nothing more than the overdue victory of commonsense health care reform over an irrelevant and intransigent right, or, even more, as the glorious culmination of a progressive dream for American universal health care long deferred. For many commentators, though, this is precisely what the ACA represents. With the law’s passage in March 2010 and its survival in the face of a constitutional review by the Supreme Court, they have concluded that the battle “over universal health coverage,” as one writer for the Washington Post put it, “is basically over.” Unfortunately, the evidence does not permit such a sanguine conclusion. Most plainly, when we consider the provisions and limitations of the law, it becomes clear that though it may help many, the ACA fails fundamentally to create what so many had hoped for: a system of universal health care. Leaving millions still uninsured and many more “underinsured” — a well-described and researched phenomenon in which the possession of health insurance still leaves individuals and families with dangerous financial liability when illness strikes — the ACA falls well short of the standard of universal health care as it is understood elsewhere in the social democratic world. But more broadly, when we consider the ACA through the lens of political economy, an even more concerning narrative emerges, one that says even less about the triumph of social democracy and more about the sharp shift of the political center and the disintegration of the New Deal left. For the law fundamentally leaves intact a system of health care predicated, as we shall see, on key neoliberal health care beliefs, for instance the “moral hazard” of free care, the primacy of health consumerism, and the essentiality of the private health insurance industry. This is not, however, an acute development: indeed, as we survey the last half-century, a long, slow, yet unambiguous neoliberal turn in the political economy of American health care becomes evident, during which the window for true universal health care — wide open as recently as the 1970s — has been slowly closed simultaneous to a historic rise in inequality and an unprecedented expansion of corporate power. These developments are, of course, manifestations of a single transformation. Yet the neoliberal revolution of the political economy of American health care remains inadequately contextualized, requiring much deeper analysis and demystification — particularly in light of parallel changes unfolding in other nations throughout the world — if it is to be understood.\nThe Postwar Health Care Agenda: Social Democracy Almost Triumphant In 1942, the civil servant William Beveridge — erstwhile social worker, pundit, and social insurance researcher — was famously assigned with the seemingly mundane war-time task of surveying Britain’s social insurance schemes, to bring some order to its fragmented, disorganized, and overall insufficient welfare system. Exceeding his mandate, as Nicholas Timmins explains in The Five Giants , Beveridge instead made history by proposing a comprehensive system of social insurance, given “as of right,” and inclusive of national health care provided “without a charge on treatment at any point.” This was, incidentally, precisely what the war-weary nation wanted to hear: the public response was jubilant, the “Beveridge Report” rapidly became a bestseller, and — following Labor’s landslide victory in 1945 — Parliament passed legislation creating the National Health Service (NHS). On the other side of the Atlantic, things seemed to be heading — to some extent — in a similar direction. Though Franklin Delano Roosevelt had cautiously chosen to leave a universal health care plan out of his Social Security Act of 1935 (which established pensions for the elderly), towards the end of his presidency Roosevelt returned to the idea, calling for the “right to adequate medical care and the opportunity to achieve and enjoy good health” in his 1944 State of the Union Address. After his re-election that year, he began to prepare for another effort at a national health program — aborted, as Monte M. Poen explains in Harry S. Truman Versus the Medical Lobby , only by his death in April 1945. His successor Harry S. Truman re-initiated the campaign for a national health insurance program, and had he been successful, the United States would have acquired a unified national program around the same time that much of Europe did. Truman had strong support from organized labor, but encountered trenchant resistance from organized medicine in the form of the American Medical Association (AMA). The AMA and other interests (including the relatively young pharmaceutical industry) poured millions of dollars into a red-baiting public relations campaign that all but accused the Truman administration of communist sympathies; the plan, unsurprisingly, soon went down in the flames of Cold War politics. With no universal system enacted, the United States instead experienced a rapid expansion of employer-provided private health insurance, a move that had begun during the war, when federal authorities excluded health insurance benefits from wage controls (thereby giving companies a way to legally attract scarce workers). This dynamic was crucially bolstered in the postwar period, when employer-provided private health insurance was exempted from taxation: more and more workers were able to win increasingly comprehensive coverage — frequently through collective bargaining — over subsequent decades. Yet however many that were insured in this manner, the association of employment and health care excluded many others, particularly those who were less likely to be a unionized worker: casual workers, blacks, women, the elderly, and so forth. And furthermore, even the insured remained vulnerable to both economic and medical misfortune: illness would cost workers their jobs, while the loss of their job would then perversely cost them their health care. Yet while labor was in a position of strength, these deficiencies were to some extent ameliorated. Elsewhere in the industrialized world, however, the direction was clearly towards a diversity of universal models, generally either in the form of national health services or national health insurance (or some mixture of the two), thereby establishing — at least to some extent — a “right to health care” in these nations. The relative resilience of these systems speaks to their broad public support, even in the face of the neoliberal assault that would come in later decades.\nHayek on Health Care: The Postwar Neoliberal Reaction Universal health care — and social democracy more generally — of course had its detractors, though these parties needed some time to marshal the ideas and resources necessary for an effective counterattack. Neoliberalism, though with origins in the interwar period, only began to coalesce as an influential, dynamic, and — perhaps most significantly — well-funded movement in the postwar period. Its primary thinkers founded key organizations (e.g., the Mont Pelerin Society in 1947) and published foundational works (e.g. Friedrich Hayek’s Road to Serfdom in 1944) during these years, and the new political identity and ideology that was forged should not be underestimated. “. . .[S]uch a self-confident and expansive free market program as did emerge later. . .”, Daniel Stedman Jones recently put it in Masters of the Universe : Hayek, Friedman, and the Birth of Neoliberal Politics, “would not have succeeded without the robust philosophical ballast . . . provided by Hayek’s, Popper’s, and Mises’ analyses of the West’s predicament,” within which it is “possible to see the beginnings of a recognizably neoliberal worldview.” Perhaps more important than such “philosophical ballast,” however, was the extent to which the “neoliberal worldview” was buttressed and nurtured by American capital. As Kim Phillips-Fein demonstrates in her important book Invisible Hands , American businessmen saw their very existence threatened by New Deal liberalism and the historic labor mobilization that accompanied (and enabled) it, and did not wait long to begin to push back. Neoliberalism, in this line of thinking, was less a school of economic and political thought, and was more the predictable counterattack of an embattled business class — under very real threat from an ascendant center-left coalition — which slowly but surely embarked on a campaign — first intellectual, then political — to recover its lost preeminence. Not surprisingly, the response of neoliberals to universal health care, and to new systems of social welfare more generally, was frequently one of revulsion. What “was formerly a charity on which the poor had no claim,” shuddered Ludwig Von Mises, “is now a duty of the community . . . Maintenance is a claim which the person entitled to it can enforce at law.” Although many libertarian health care proposals of neoliberals like Milton Friedman — who proposed ending the licensing of physicians and the regulation of drugs — made little headway, neoliberal notions about the fundamental undesirability of universal health care succeeded in becoming part of the mainstream health care discourse. In his 1960 The Constitution of Liberty , Hayek presented what is essentially the philosophical essence of health care neoliberalism, an ideology that would later be complemented by developments in the arena of health economics and health policy. Hayek argued that the case for “a free health service” rested on a fundamental philosophical error, namely on the idea that people’s medical needs could have “an objectively ascertainable character.” Now at first glance, this seems rather reasonable, insofar as people have different preferences for health care in different scenarios and times in life, e.g. one of us might pursue more aggressive treatments at an older age which others might eschew, and so forth. But this wasn’t Hayek’s point. Rather, he was arguing that we all have different preferences for how much health care we want in proportion to the other “material advantages” in life. In other words, crudely speaking, one person might prefer paying rent to having a mammogram, while another might take a needed heart surgery over a week on vacation. “Though we all dislike the fact that we have to balance immaterial values like health and life against material advantages,” Hayek put it, “and wish that the choice were unnecessary, we all do have to make the choice because of facts we cannot alter.” As a result, the idea that there is an “objectively determinable standard of medical services which can and ought to be provided for all, a conception which underlies the Beveridge scheme and the whole British National Health Service, has no relation to reality. This is the crux of the neoliberal ideology on health care. Hayek doesn’t merely dispute the basis of the NHS or other universal systems on grounds of efficiency, organization, cost, or output; rather, he disputes the very notion that there could exist anything like a universal desire — much less a “right” — to any social good, including health care. Why should we have universal health care, in other words, if our desires for health care are not universal? Health care should therefore be distributed like other commodities: according to the tastes of the individual consumer, each of whom acts as a rational actor in electing to purchase the quantity and quality of health care goods that he or she desires. Any attempt to dictate such consumption would be tantamount to an infringement on one’s economic freedom, or so the argument goes. Such ideas became increasingly prominent in later years, and indeed came to form the basic health care philosophy of the right in both the United States and Great Britain, endlessly regurgitated and repackaged by neoliberal think tanks. In the United States, however, such thinking was — and is — also an accurate description of the status quo: families and individuals must frequently make painful choices between health care and other “material advantages.”\n1960s–70s: Veering towards a Social Democratic Health Plan Still, such philosophizing did little to diminish the popularity of universal systems. The NHS, for instance, remained popular and largely impervious to frontal attack for decades. Similarly, in the United States — though Truman’s plan for a national health insurance program was successfully defeated by the acidic Cold War politics of the late 1940s, and though the conservative presidency of Dwight D. Eisenhower was able to forestall reform throughout the 1950s — it wasn’t long before a coalition of labor, progressive, and senior citizen groups pushed the government to return to the issue of health care reform. The 1964 elections gave Lyndon B. Johnson the presidency and the Democrats control of the Congress, and the following year Johnson signed into law Medicare (a federally-organized health insurance program for the elderly) and Medicaid (a health insurance program, administered by the states, for the poor). For the left and for the more progressive wing of the Democratic Party, such historic gains were nonetheless perceived as stepping-stones to a fully universal and comprehensive system. And there can be little doubt that there was a growing popular mandate for action along these lines. “Subtly but unmistakably,” read a front-page story in the New York Times in August 1971 quoted by Beatrix Rebecca Hoffman in Health Care for Some , “Americans from all strata of society and all economic classes are swinging over to the idea that good health care, like a good education, ought to be a fundamental right of citizenship.” Democratic Senator Edward Kennedy therefore had broad-based support behind him when, in 1969, he proposed a system of universal health care for the country. Nixon countered with a reform plan of his own, which would have retained a system of private insurance while significantly reducing the ranks of the uninsured. It seemed to almost everyone that success was near, with even Nixon at one point even admitting that national insurance “was an idea whose time has come in America.” Progressives, indeed, were hesitant to compromise much, feeling that outright victory was right around the corner.\nThe Cost Control Crucible of the Late 1970s Such optimism, however, was not to survive the decade. The country was “saved” from universal health care — which had seemed like a near inevitably — by two crucial and interconnected developments of the 1970s: an ascendant atmosphere of economic crisis, and the historic unleashing of corporate money and power in Washington. Regarding the first phenomenon, though it has been argued that the severity of the economic crisis of 1970s was much exaggerated, there was indeed a palpable change in the economic scene during these years that was crucial to the defeat of universal health care and other progressive reform plans. For some three decades following World War II, as Dean Baker explains in The End of Loser Liberalism , strong economic growth in the United States had been accompanied by a growth of income at all levels on the economic ladder. This relatively egalitarian period of capitalist expansion was in part the result of a relatively strong labor movement: as Baker puts it, “workers spent most of their income . . . demand kept pace with productivity,” and productivity gains were equitably distributed. However, the economic shocks of the 1970s — in particular, oil shocks early in the decade and then again following the Iranian revolution — accompanied a decline in productivity that together gave rise to the decade’s infamous “stagflation.” Suddenly, the affordability of everything was called into question — including universal health care. At the same time, however, it is difficult to guess what would have been the effect of these economic disruptions alone, given the historically variable relationship of economic crisis and social policy. It was, for instance, in the setting of an almost complete breakdown of the capitalist order that Franklin Roosevelt was able to push through the most expansive social democratic welfare legislation in American history, and it was likewise during a time of economic austerity that Britain created the NHS. In more recent times, conversely, economic crises have served as the crucial hinge for major neoliberal transformations, most notably in the United States in the late 1970s, and more recently with the case of much of Europe during the Great Recession of 2008. Crucial to the neoliberal transformation of the late 1970s, therefore, was the sudden plunge of corporate power — organizationally and intellectually poised for such an aggressive reentry for years — back into the political arena. These years saw an explosion in the number of corporate political action committees (PACs), in the number of corporations with public affairs offices in Washington, and in the quantity of corporate political donations. “On every dimension of corporate political activity,” as political scientists Jacob S. Hacker and Paul Pierson conclude in Winner-Take-All Politics , “the numbers reveal a dramatic, rapid mobilization of business resources in the mid-1970s.” The atmosphere of economic crisis (again, even if exaggerated) was the milieu in which these business interests were given a historic opportunity to reassert power in Washington. In addition to these political and macroeconomic trends, however, the 1970s also saw the beginning of a persistent, marked upswing in national health care expenditures, which in turn gave birth to the health care “cost crisis” which is with us still. Between these three developments — declining productivity, a bold reassertion of corporate power, and health care inflation — a new dogma emerged: universal health care was simply unaffordable, as Hoffman explains in Health Care for Some , and and until costs were controlled, little reform could or should be pursued. The primacy of cost-control, crucially, was agreed upon by both major parties: indeed, it was Democratic President Jimmy Carter who abandoned any real effort towards a national health insurance system. Carter’s own proposal for health care reform, as Colin Gordon explains in Dead on Arrival : The Politics of Health Care in Twentieth-Century America, was in fact significantly less expansive and comprehensive than Nixon’s plan from that very same decade. The only reform attempt of the Carter administration, ultimately, was a hospital cost-containment measure. Comprehensive health care reform thereby remained a dead letter until the 1990s. Still, for those who hoped to bury universal health care for good in the United States, “cost” was never going to be a sufficient argument, given one slightly uncomfortable fact: national health care programs can be (and in fact, almost always are) substantially more cost effective than fragmented private systems, with the US system costing about double as most European systems. Therefore, an economic argument was going to be needed to counter the continued push for a universal system, and maybe even one day to further expand the reach of the market into health care.\nEnter “Moral Hazard”: “Overinsurance” as Original Sin Yet one intractable problem for policy experts who preferred a medical marketplace — where private “care producers” could engage in unrestricted commerce with comparison-shopping “patient-consumers” — over government-organized universal health care was that the reigning paradigm of health care economics suggested that markets and medicine didn’t mix particularly well. This idea dated at least back to 1963, when the economist Kenneth J. Arrow published his famous paper “Uncertainty and the Welfare Economics of Medical Care” in the American Economic Review. Arrow, who would later win the Nobel Prize, had been commissioned by the Ford Foundation to bring theoretical economics to the field of health care, as Timothy S. Jost describes in Health Care at Risk: A Critique of the Consumer-Driven Movement ; he then proceeded to demolish many ideas about the applicability of market economics to medical care. Arrow’s arguments centered on the notion that such distortions as risk, inadequate information, uncertainty, and ethical considerations are fundamental to health care, and that as a result, health care “departs considerably from the usual marketability assumptions about commodities.” He argued that longstanding provisions for charitable care, for instance, exist because of “this tradition about human rights to adequate medical care.” Given the breakdown of market assumptions with health care, he asserted that “a pure cash nexus would be inadequate,” admitting that “when the market fails to achieve an optimal state, society will, to some extent at least, recognize the gap, and nonmarket social institutions will arise attempting to bridge it.” Putting aside the specific policy recommendations that might come from such theory — for instance, that “government should undertake insurance where the market, for whatever reason, has failed to emerge” — what is notable is that Arrow’s paper specifically repudiated the centrality of market mechanisms to health care. Such thinking — though it came from an establishment neo-classical economist — was (and indeed, remains) pure heresy from a neoliberal perspective. It had to be answered, and it was some five years later, with the publication of Mark Pauly’s 1968 “The Economics of Moral Hazard,” generally considered one of the most influential health economics papers of all time. Pauly — who corresponded with Hayek and who would later become a scholar at the neoliberal think tank the American Enterprise Institute (AEI) — took on Arrow’s central argument through an exploration of the idea of “moral hazard,” and in doing constructed an instrumental case against the very foundations of universal health care, separate from any argument about its cost or efficiency. What Pauly expressed in the language of microeconomics was exactly what Hayek had already expressed in the language of political philosophy earlier that same decade. The notion of “moral hazard” — basically the idea that patients would use health care unnecessarily just because their insurance made it free — had longstanding roots. The insurance industry had always opposed “first dollar” coverage, which they thought promoted what Hoffman calls nuisance “sniffle claims.” Various devices of “cost-sharing” (i.e. deductibles, copayments and co-insurance) were developed to deal with this allegedly costly phenomenon. But Pauly’s contribution took the notion of moral hazard a step farther: he argued that “moral hazard” resulted not from some intrinsic moral weakness of a sniffling humanity, but instead from rational economic decision-making — but that it made society poorer none the less. “The effect of an insurance which indemnifies against all medical care expenses,” Pauly argued, “is to reduce the price charged to the individual at the point of service from the market price to zero.” Because of this lowering of the apparent price of health care, there would be a net society-wide “welfare loss” as people used care that they didn’t actually value at its true production cost. Roughly speaking, he was arguing that I might use health care that cost $1,000 to produce but that I only really “valued” at say $500 — simply because I paid $0 for it. As a result, a “welfare loss” from this “excess use” was imposed on society. He admitted that there was also “utility gain” from having insurance, insofar as being insured against uncertainty had some intrinsic value itself, for which it was worth paying. But then comes the crux of the argument: because “individual demands for medical care” might differ, it was possible that the balance between the loss due to “excess use” and the utility gain of being “insured against uncertainty” might differ from individual to individual. If persons differ in their preferences for risk aversion, then the optimal state would be one in which “various types of policies are purchased by various groups of people” (emphasis mine). Conversely, it would clearly not be “optimal policy to provide compulsory insurance against particular events for all individuals.” Pauly was not merely arguing in favor of some degree of cost sharing to prevent people from going to the doctor for the sniffles — he was arguing that a state of universal health insurance would be fundamentally suboptimal, constituting a net loss for the entire society. His analysis was followed by important papers from other economists that attempted to calculate what this loss would actually be. The economist Martin S. Feldstein, later chief economist of the Reagan administration, corporate board member, economic advisor to George W. Bush, and currently a professor at Harvard, argued in an important paper in the Journal of Political Economy in 1973 that “American families are in general overinsured against health expenses,” and that the estimated gain from reducing insurance by one third would be in the billions annually. Both universal health care and comprehensive employer-based private health insurance — which had been tax subsidized since World War II — were not the solution, they were in fact the problem. Universal health care should therefore be off the table entirely, while removing (or at least limiting) the tax deduction that subsidized comprehensive employer plans would help begin the rollback of “overinsurance.” As the health economist John Nyman (who later helped thrash much of the economic thinking behind these models) would later explain in an article titled “”American Health Policy: Cracks in the Foundation,” these views quickly became the dominant paradigm in American health economics, reinforced in health economics textbooks from the 1970s onward: If health insurance is problematic and may even make consumers and society worse off, then there is also little reason to implement a national health insurance program. As a result, few American health economists during this period called for the creation of a national health insurance program. And significantly, these views became subsumed into more mainstream thinking about what was possible and desirable for health care reform. The important thing was to impose sizable out-of-pocket expenses for the sick (in Britain, rightly referred to as a “sickness tax”) and to grant individuals the power to select the insurance care plan that fit their particular “tastes.” And as it turned out — as is the case with the ACA — such “innovations” could indeed be possible under a system of supposedly “universal” health care.\n“Moral Hazard” Confirmed: The RAND Health Experiment Pauly’s thinking, however, still remained in the theoretical realm, based on economic modeling and not necessarily applicable to the behavior of living, breathing patients. In part to address such concerns, in the 1970s the federal government helped fund the Rand health insurance experiment (HIE), to this day one of the largest — and most influential — social experiments carried out in history. Anything like it is unlikely to be repeated, and its findings have served to further the neoliberal health care agenda in crucial — if unforeseen — ways. The study recruited some 2,750 families (consisting of 7,700 individuals) that were randomly assigned to one of five different health insurance plans — one “free plan,” and four others with varying levels of “cost sharing” (i.e. money paid out of pocket for health care). These families were followed, and their health care use and expenditures, visits to the doctor and hospital, and health (vision, blood pressure, and so forth) were tracked over the years. The impact of the experiment is difficult to overstate: the results of the HIE are quoted in essentially every paper on cost sharing, and they have continued to inform health policy decision-making to the present day. The one sentence summary that one sometimes encounters is that people in the higher cost-sharing plans go to the doctor less and are hospitalized less, but nonetheless have overall the same health. In other words, skimpy insurance was a win-win scenario, with less money spent but health care preserved. Assuming this was all there was to it, these results would seem to suggest that universal “free health care” plans — like Britain’s NHS or the plan Ted Kennedy had proposed in 1969 — were basically a waste of good money. This is precisely how the study sometimes gets used to the present day. The truth about the HIE is rather more complicated — and concerning. First, as the investigators reported, some people were in fact adversely affected by the cost sharing plans. Those without free care (particularly the poor and sick) had worse blood pressure, for instance, which resulted in an increased calculated risk of death. Second, though cost sharing seemed to reduce the use of health care, it reduced both “appropriate” and “inappropriate” care, meaning that patients avoided both important and unimportant health care interventions. They weren’t simply avoiding the doctor when they had the sniffles — they were avoiding needed health care, as well. While this difference may not have translated into different health outcomes at the time when the experiment was performed, with the advent of new and more effective medical therapies, it seems likely that it eventually would. Other concerns have been raised about the study’s basic conclusion that the cost sharing plans saved money, as well. But these and other caveats are frequently neglected by the proponents of neoliberal health care. Between the results of the HIE in the medical literature and the elaboration of moral hazard theory in the economic literature, the case against universal health care had now earned a prominent academic underpinning. Translating such thinking into policy, however, required its endless reiteration and recycling by think tanks, accompanied by a corresponding rise in the ideology of the health care “consumer” — and in the corporatization of American health care more generally.\nFrom Reagan to Clinton: Corporate Managed Care Ascendant The crucible of the 1970s saw the demise in the United States of what seemed to be nearly successful schemes for universal health care, followed by the rise to power of a potent conservative government. Health care was not immune from the rapidly ascendant ideology of the market. “Powerful economic forces are reshaping the US health care system,” according to J. Goldsmith, an enthusiastic supporter writing in a premier US health policy journal Health Affairs in 1984. “As market forces emerge as a powerful feature of the US health care system, the real task of the policymaker is not to supplant, but to leverage those marketplace forces.” From the Reagan to the Clinton administrations, several developments along these lines occurred in parallel, with the challenge of “moral hazard” being met in two main ways. First was a rise in cost sharing in many health insurance plans in the early 1980s, a movement supposedly supported by the lessons of the HIE. Second was the emergence — and transformation — of corporatized “managed care.” Ironically, “health maintenance organizations” (HMOs) had originally been conceived as progressive health centers financed on a capitated basis wherein multi-physician groups would care for all the health care needs of a population of patients (an arrangement traditionally deemed socialistic by the AMA). By the 1970s, however, many begin to think of “managed care” in a different way: through coordination of care, through the elimination of the perverse incentives of “fee for service,” and through a variety of top-down controls on the utilization of care, HMOs could serve as the linchpin in a campaign for cost control. Nixon was persuaded that this was the optimal approach, and signed the 1973 HMO Act, which provided federal money for grants and loans to qualified HMOs. Yet there was little growth of these plans on the market for years to come, perhaps because for-profit HMOs were largely excluded under the act. Things changed radically with the onset of the “Reagan Revolution.” In 1981, Reagan signed legislation that actually ended federal grant support for HMOs, replacing it with a system to promote HMOs as investment opportunities. This was followed by a rush of corporate investment into HMOs: according to Bradford H. Gray in History and Health Policy in the United States, whereas before 1982 less than twenty percent of HMOs were for-profit, by 1986 a majority were. The plans were consolidated, increasingly sold on the national level by large corporations. By limiting care on the supply or “provider” side — through a variety of restrictions on health care utilization — “moral hazard” could (again, in theory) be controlled. Perhaps most importantly, though, this was another opportunity to release the power of the market. The idea behind “managed competition” — the centerpiece of Bill Clinton’s 1993 health care plan — was that insurance plans would directly compete with one another, ostensibly lowering health care costs and improving quality as companies fought for the attention of discerning consumers. Though Clinton’s plan went down in ignominious defeat, the fundamental idea that comparison-shopping by employers or individuals for health care plans could save American health care persevered. Inconveniently, however, the public quickly came to detest HMOs, with their limited networks of physicians, their various restrictions, and the general perception that care was being unfairly rationed. By the late 1990s, some of the big insurers like Aetna that had enthusiastically embraced the HMO model were facing financial crisis of their own, and began responding with new insurance products. The demise of the HMO by the early 2000s coincided with a rise in “demand-side” moral hazard management — i.e. more “cost sharing” with patients at the time of illness — and with a movement that soon became known as “consumer-driven” health care, an idea with deep roots in the neoliberal revolution.\n“Spending Their Own Money”: The Rise of Consumer-Driven Health Care The “consumer-driven health care” movement emerged directly from the “moral hazard” idea that people had to play with their own money when it came to health care.As told by Jost in Health Care at Risk, Its proponents have won several policy achievements in recent decades, some of which were actually first championed by neoliberal think tanks. The National Center for Policy Analysis (NCPA) and its promotion of the “health savings account” (HSA) is a case in point. As Jost notes, the NCPA had been founded in 1983 by John Goodman (still its current CEO and President) with assistance from Anthony Fisher, the disciple of Hayek who had founded the key British neoliberal think tank the Institute of Economic Affairs (IEA), and who had played a crucial role in the establishment of various conservative think tanks on both sides of the Atlantic (including the Manhattan Institute, the Fisher Institute, the Cato Institute, and the Fraser Institute). In a 1984 article in the Wall Street Journal , Goodman and Richard Rahm (then chief economist at the US Chamber of Commerce) proposed the elimination of Medicare (the government program of insurance for the elderly) through privatization, and its replacement with personal tax-deductible health savings accounts, through which the elderly could buy their own health care. “When elderly individuals purchase health care with their [own] … funds,” they argued in classic moral hazard style, “they are spending their own money, rather than the ‘government’s money’ . . . Thus the elderly will have an incentive to spend their health-care dollars wisely.” The notion of privatizing Medicare would later get some traction, as would these newly conceived “health savings accounts.” In 1990 the NCPA assembled some 40 organizations (including other free market groups like the AEI and the Hoover Institution, as Jost describes) to develop a health reform proposal, and ultimately recommended that these savings accounts — coupled with high-deductible insurance to cover medical catastrophes once the accounts were depleted — be at the center of the health care system. In 1994, Goodman joined with the Cato Institute to publish Patient Power: The Free Enterprise Alternative to Clinton’s Health Plan , again in which high-deductible health care plans — where patients spent their “own money” — unleash the power of the free market and thereby save American health care. The health economist Mark Pauly (at this point affiliated with the AEI) — who, as we earlier saw, first famously theorized the “moral hazard” health care argument — joined with Goodman in a 1995 paper where they championed the idea that people “buy insurance that covers only large medical expenses and permits them to pay out of pocket for smaller ones.” By 1996, Milton Friedman was joining this chorus: people could “purchase an insurance policy with a very high deductible, i.e., a policy for medical catastrophes, which would be decidedly cheaper than the low-deductible policy their employer had been providing to them, and deposit all or part of the difference in a special ‘medical savings account.’” This activism won its first legislative success in 1996, with the creation of a new category of tax-deductible accounts dubbed “medical savings accounts” (MSAs) as part of a larger health care law dealing with the privacy of health care records and other unrelated issues. These new accounts — which allowed individuals and their employers to deposit funds into tax-free accounts designated for health care expenses — were exciting to neoliberals for two reasons. First, they represented a potentially lucrative source of revenue for the finance industry. Jost notes one source who estimated that up to $300 billion a year might eventually be held in a later iteration of these accounts, representing a potential windfall in banks fees and “asset capture.” More importantly, however, by requiring these accounts to be attached to high-deductible health insurance plans, the “consumerization” of health care would be greatly advanced: patients would now be spending their “own” money whenever they needed health care, forcing them to act more like consumers, and (in theory) thereby holding down costs. In a 2001 opinion piece in the Public Interest , Milton Friedman looked back pessimistically on the previous ten years of developments in health care policy, and was excited by only a single development, admittedly “minor in current scope” but “pregnant of possibilities”: the MSA. The 1996 law, however, was little more than a demonstration project, and such accounts only began to take off after 2003, the year when George W. Bush’s Medicare Modernization Act (MMA) enshrined a new version of the accounts — now dubbed the “Health Savings Account” (HSA) — into law. These tax-deductible HSAs had to be coupled with catastrophic “high-deductible” health insurance plan, and this pairing is now referred to in the industry as “consumer-directed health insurance plans” (CDHPs). From 2003 to the most recent survey of employer-sponsored health insurance, CDHPs quickly came to constitute 20 percent of all employer-based plans. They seem set to gain more market share in coming years: by passing more of the costs of illness onto employees, they allow employers to control premiums and therefore their own health care expenditures. But even more important than this specific development, all plans — even those not officially classified as CDHPs — have been heading in the same direction over the past ten years, with more cost-sharing and less comprehensive benefits year after year. “Consumer-driven” health care, both official and unofficial, was increasingly becoming the lived reality.\nOverinsurance, or Underinsurance? But could health care reform be forever deferred? As long as the ranks of the uninsured continued to grow, the presence of market failure was impossible to deny, and the door would be left open to calls for universal health care. Furthermore, health care expenditures actually continued to accelerate during the 2000s, further weakening the defense of the status quo. As soon became clear, the sort of health care system that neoliberals wanted — a “consumer-driven” system with an abundance of private insurance plans with high out-of-pocket expenses — wasn’t necessarily mutually exclusive with a system of almost-universal health care. In the early 1990s, for instance, Mark Pauly and others proposed a health care plan for presidential candidate George HW Bush that coupled high-deductible health care with an “individual mandate,” or a legal requirement that the uninsured buy private health insurance. As he and his colleagues described it in a 1991 paper, the proposal would have emphasized “the responsibility of all Americans to obtain insurance,” of “non-poor citizens to pay for medical care services to the extent of their ability to do so,” and — most crucially — the “responsibility consumers have to choose whether they want to buy more comprehensive medical care and medical insurance or whether they want to save more to spend on other goods.” This last point is yet another restatement of Hayek’s idea in The Constitution of Liberty — that there could be no “objectively ascertainable” standard of health care. But their underlying motivation was clear enough, and that was to counter the proponents of universal health care. “We did it because we were concerned about the specter of single payer insurance [i.e. universal government-provided national health insurance], which isn’t market-oriented,” Pauly frankly admitted in an interview with Ezra Klein at the Washington Post in 2011. The purpose of the “individual mandate,” furthermore, “was to round up the stragglers who wouldn’t be brought in by subsidies.” The “individual mandate,” though now a central part of the ACA, has impeccable conservative credentials: first proposed by the conservative think tank the Heritage Foundation in 1989, it made an appearance in a health bill floated by Republicans in the early 1990s, and was ultimately implemented in 2006 in Massachusetts by none other than Republican and future presidential candidate Mitt Romney. The irony here, of course, is that the mandate has become for today’s Republicans one of the most hated portions of Obama’s ACA. Remarkably, despite not achieving much in the way of legislative victories following the 2003 law that had created HSAs, the general direction over the last decade has been towards the sort of “consumer-driven” health care plans favored by Pauly and Goodman. The numbers of the uninsured continued to rise, but so too did “underinsurance” — having insurance, but of such poor quality that it didn’t pay for the actual cost of sickness. In one study, for instance, 42 percent of the entire non-elderly adult US population was determined to be either underinsured or uninsured. Another study in the New England Journal of Medicine found that almost a quarter of children with insurance were nonetheless underinsured: such children were more likely to have poor health or to have special health care needs. And as out-of-pocket expenses rose, so too did “medical bankruptcies” — financial catastrophes resulting from an inability to afford medical bills. One study found that in 2007, perhaps 62 percent of all bankruptcies filed in the United States had a medical cause; notably, three-quarters of those individuals actually had health insurance at the time of the illness that caused their bankruptcy. The ground was therefore fertile for major reform when Obama and the Democrats swept into power in 2008. Yet despite the clear mandate for reform and their control of both houses of Congress, what the Democrats (just barely) accomplished was modest when compared with the proposals of earlier decades. Indeed, the 2010 law actually included many key aspects of the neoliberal health care platform, which had clearly moved towards the political center over the previous three decades.\nUniversal Health Care Not Triumphant To be fair, the fact that the ACA falls well short of a system of universal health care says little about Obama, and much more about the political context in which he was operating. Obama, after all, had in previous years voiced support for a single-payer system. During the 2009 health care reform campaign, he also supported a “public option,” a government insurance plan that would compete against private plans. But whatever his personal proclivities on the matter might have been, he was operating in a political landscape much different than that of Ted Kennedy and Richard Nixon in the early 1970s — one dominated like never before by powerful corporate “stakeholders” whose ability to shape the political debate had undergone a massive transformation in the intervening decades. The fingerprints of the health care industry on the ACA — in particular the lobbying groups of the insurance industry and the pharmaceutical industry (American’s Health Insurance Plans [AHIP] and PhRMA, respectively) — are clear. As the sociologist Paul Starr demonstrates in his history of American heath care Remedy and Reaction, AHIP gave its support to universal coverage (meaning it wouldn’t exclude based on pre-existing conditions) only if it were coupled with an individual mandate. PHrMA, on the other hand, was willing to support Obama’s legislation if it prevented Medicare from directly negotiating over drug prices, a reform that could have saved the government hundreds of billions of dollars a year. To appreciate the magnitude of the neoliberal turn in the political economy of American health care over the period covered in this paper, consider the following. Ted Kennedy’s 1969 “Health Security” plan would have established a single-payer, government-run, national health insurance system which would have covered health care free at point of service. Republican President Richard Nixon’s plan two years later, Paul Starr explains in Remedy and Reaction: The Peculiar American Struggle over Health Care Reform, would have kept in place a system of private health insurance, but would have established a mandate for employers to buy health insurance for their workers as well as a new health insurance system for the poor (for families up to 121 percent of the poverty level). Some forty years later, the ACA is passed: it keeps in place a system of private insurance (albeit with many new regulations and subsidies), establishes an “employer mandate” (like the Nixon plan), adds a requirement (to some degree at the behest of the insurance lobby) that all uninsured individuals purchase private insurance (the “individual mandate,” as first proposed by the Heritage Foundation), and expands Medicaid to cover all of those up to 138 percent of the poverty level. While the ACA will undoubtedly help many, there can be no mistaking the close resemblance of Obama’s plan to Nixon’s, and of its marked divergence from the universalism of Kennedy’s. The health care political center, in other words, has moved to the right very sharply indeed. Perhaps the greatest testament to this is the fact that the ACA, despite its roots in the proposals of moderate conservatives of previous eras, is now deemed rank socialism by today’s conservatives. The health insurance plans offered on the new state level exchanges, furthermore, are to some degree an embodiment of Pauly’s (or Hayek’s) idea that people should be free to choose whether to “buy more comprehensive medical care and medical insurance,” or, in his words, “to save more to spend on other goods.” The plans are divided into metallic “tiers” — Bronze, Silver, Gold, and Platinum — that have actuarial values (meaning the percent of average annual health care costs that the insurance will cover) of 60, 70, 80, and 90 percent, respectively. They will feature copays, deductibles, and co-insurance, with out-of-pocket expenses rising to as much as $12,700 a year (depending on income) for a family (after the premium is paid). Again, the notable comparison is Ted Kennedy’s early plan, which would have made health care free at the point of service. The point is not so much that the ACA creates new levels of cost sharing; rather, the ACA simply permits the progression of an already established “consumer-driven” trend, wherein insured individuals and families pay more and more out of pocket each year whenever they become ill. One element of the law that is a particularly clear manifestation of the neoliberal turn is the tax on so-called “Cadillac” health care plans. As we have explored, comprehensive “overinsurance” resulting from overly generous tax-subsidized employer-based health insurance had been deemed a significant part of the problem of the American health care system ever since Pauly’s 1968 paper; there have been calls for the end of (or at least a limit on) the tax-deduction ever since, which would remove the incentive towards comprehensive plans. The “Cadillac” tax functions more or less as such a limitation. It imposes a 40 percent excise tax on the issuers of expensive health care plans, and while it will initially affect few plans, over the years, an increasing proportion of plans will be affected — perhaps as many as 75 percent of plans after a decade in effect. Despite the “Cadillac” moniker, however, these plans cover little in the way of unnecessary or extravagant medical services, and instead simply have low cost sharing and broad networks of providers. To avoid paying the tax, insurers and employers will have to prevent premiums from rising; the main way for them to accomplish that will be with progressively restricted coverage and higher cost sharing. Indeed, to avoid hitting the premium threshold at which the tax goes into effect, employers have already started trimming benefits, a move that has strongly been resisted by municipal unions, which over the years have bargained hard for comprehensive health benefits.", "url": "https://www.jacobinmag.com/2014/04/the-neoliberal-turn-in-american-health-care/"}