{"authors": ["Douglas Williams", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:41", "date_modify": "2020-05-04 19:50:41", "date_publish": "2014-08-17 00:00:00", "description": null, "filename": "2014_08__1588621841.html", "image_url": "https://images.jacobinmag.com/2014/08/17000105/9.69.1223-011-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_08__1588621841.html", "title": "Love Me, Ferguson, I’m a Liberal", "title_page": "Love Me, Ferguson, I’m a Liberal", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "“Outside agitator.”\nThese words were spoken by Mississippi Governor Ross Barnett when asked about the Freedom Summer voting registration drive in 1964. They were also uttered by Alabama Governor George Wallace when he was asked about the protests in his state’s largest city, ignobly labeled “Bombingham.”\nBull Connor referred to Martin Luther King Jr as one, even though his church was in the state capital, Montgomery. These two words were also uttered by Thomas Jackson, the police chief in Ferguson, as he tried to describe why his mostly-white police force could not stop the protests occurring in the nearly 70 percent black city he was charged with patrolling.\nAll of these men were segregationists, anticommunists, and purveyors of state-sanctioned violence against African Americans. But now you can also find some prominent liberals using the term, ostensibly in relation to the activities of small pockets of anarchists and the Revolutionary Communist Party in the city.\nBoth the Daily Beast and Gawker have run pieces on the RCP in the same spirit, Gawker even going as far as to call them “despicable” for “trying to drum up even more tension.” Justin Glawe writes in the Daily Beast that:\nAnd while police have rightfully been criticized for their heavy-handed approach to the protests that have gone on since Brown’s death, the intelligence they’ve gathered regarding some of the more riotous protesters has been correct. Those who wish to do physical harm to law enforcement are small in number, and subversive in tactics.\nApparently, the RCP’s new slogan is, “Turning liberals into defenders of the police state, one protest at a time.”\nYesterday, Richard Seymour asked what it means that these liberals, “unthinkingly regurgitate the stuff about ‘outside agitators’ in Missouri.” I think I can answer that.\nIt is not the RCP that these liberals are scared of. Only a fool would believe that eight to ten sectarians from Hyde Park have the power to tank a demonstration as large as the ones occurring in Ferguson. But these empty protestations from liberals do have a very clear purpose: separating people of color from a spirit of revolutionary community-building and anticapitalist politics.\nTo be clear, I’m no fan of the RCP — less of an old-school communist party and more of a personality cult centered around Bob Avakian, a one-time Free Speech Movement activist who now lives in “exile” in France:\nOne important aspect of boldly spreading revolution and communism everywhere is the work of building what we have characterized as a culture of appreciation, promotion, and popularization around the leadership, the body of work and the method and approach of Bob Avakian.\nIf that’s not weird enough for you, then try this blog post about the RCP’s Burning Man dedication to Avakian. Most socialists and communists do but one thing to the RCP in general: ignore them.\nBut then there’s the case of Carl Dix, a member of the RCP who was arrested in Ferguson on Tuesday. Dix is from an older generation of black activists, one who’s chosen to fight for communities of color through sectarian anticapitalist organizations. As many radicals know, it is a tradition common in older cities like New York, Philadelphia, Baltimore, and Chicago with both large black populations and strong socialist and communist histories. But not surprisingly, it is a history completely alien to many mainstream liberals today.\nAnd while we might wonder what it is about the RCP specifically that Dix finds worthy of his time, no one can deny his dedication to the kinds of working class issues that disproportionately affect blacks — issues that liberals and the Democratic Party either avoid or exacerbate — whether it’s helping to lead the fight against stop-and-frisk in New York or his work in New Orleans trying to save public housing from demolition.\nIt says something, though, that the idea of “communists” advocating “revolution” while taking part in a protest in a predominantly black community elicits such disgust and bewilderment from even sympathetic observers. They feel so comfortable erasing black socialists and communists from the history of freedom movements in America that one could be forgiven for thinking that they do not know they even existed — staunch anticapitalists like Bayard Rustin (March on Washington planner), Harry Haywood (a member of both the US and USSR Communist Parties who worked on the Scottsboro Boys case), and, of course, Dr Martin Luther King Jr, a socialist.\nMichelle Dean at Gawker :\nAccording to a website called the Missouri Torch, the man French is referring to is one Greg “Joey” Johnson, of Chicago. They have a variety of other images and videos of Johnson and assorted ‘commie’ — their word — friends being shown around Ferguson. It’s pretty plain they’ve identified him correctly.\nThe Missouri Torch, approvingly cited by Dean, is a site that has referred to Michael Brown as a “thug” and sought to justify his murder by Ferguson Police. The RCP has, apparently, also turned liberals into defenders of white supremacy.\nAt the very least, these liberals are no different from the white moderate described by King in his “Letter From a Birmingham Jail.” They prefer a false peace to a just peace; they prefer orderly hand-holding and singing from communities that have been brutalized beyond belief; they prefer a quiet list of demands read out at a press conference, as if that has not already been tried before to little effect; they prefer to focus on the empty (or absent) proclamations of their favorite celebrity punching bags rather than focusing on the lives and humanity of real people who are fighting white supremacy and repression on the ground right now.\nAs seen in the responses to Ferguson, many liberals today excel at aping leftist aesthetics in order to earn trust into a community while simultaneously resurrecting anti-leftist slurs like “outside agitator.” They pulverize words like “intersectionality” into a meaningless oblivion, and turn them into signals that, yes, they have also taken a Sociology 201 class. They “get it.”\nBut in reality, these liberals are the enemies of the sort of radical change that these terms of inclusiveness are meant to signify. The language is turned into tools to silence and freeze people out of meaningful discussions about coalition-building and community change and, ultimately, reinforce capitalism’s status quo.\nThe ease with which certain liberal bloggers at venues like the Daily Beast and Gawker use the terminology of racists, bigots, and violent segregationists should give everyone pause, and it should tell leftists that we have a long way to go towards building a truly progressive media.\nPhil Ochs wrote “Love Me, I’m A Liberal” as a response to empty, part-time social justice advocates:\nIn every American community there are varying shades of political opinion. One of the shadiest of these is the liberals. An outspoken group on many subjects, ten degrees to the left of center in good times, ten degrees to the right of center if it affects them personally. Here, then, is a lesson in safe logic.\nFerguson has been a lesson in “safe logic.” But what will we learn?", "url": "https://www.jacobinmag.com/2014/08/love-me-ferguson-im-a-liberal/"}