{"authors": ["Sam Gindin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:11", "date_modify": "2020-05-04 19:52:11", "date_publish": "2014-06-16 00:00:00", "description": null, "filename": "2014_06_paying-dues_1588621931.html", "image_url": "https://images.jacobinmag.com/2014/06/16235440/Screen-Shot-2014-06-27-at-11.47.57-AM-e1403887884541-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_06_paying-dues_1588621931.html", "title": "Paying Dues", "title_page": "Paying Dues", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe spread of the notoriously misnamed “right-to-work” legislation in the US — most notably in Michigan, the home of the iconic sit-down strikes and effective birth of modern American-Canadian trade unionism — has given confidence to union-bashers in Canada to follow suit. “Right-to-work” has, of course, nothing to do with guaranteeing anyone a job and everything to do with trying to undermine unions. Its essence is that even if the majority of workers overcome management opposition and establish a union, and even if all workers benefit from what the union negotiates and the union is (as is the case in the US) compelled by law to represent all workers, workers can — unlike taxes — choose to be free riders and not pay dues. On the other hand, significant sections of the Left have long argued that legislative protections were a double-edged sword, contributing to the institutionalization, bureaucratization, and downfall of the labor movement. If unions were forced to constantly meet their members face-to-face and had to convince each individual to pay dues — as opposed to employers collecting the dues via their payroll systems and sending them on to the union — might it, the argument goes, act as an inadvertent blessing? Might it ultimately renew the labor movement?\nTactics and Principle The Right’s attack on the dues check-off, as expressed within the Canadian federal government and the Ontario Conservatives, has been rooted in two strategic goals: the expectation that unions will be weakened if they lose their financial security and that individual collection will make it harder to address issues outside the workplace, from putting extra resources into organizing low-paid workers to international solidarity and — especially important to anti-union elites — electoral activity. If politics depends on individual contributions and individuals can’t effectively pool their resources, then the rich have an inherent advantage. For unions, the issue is not one of principle but of tactics. The relevant principle is that unions must communicate with and be responsible to members. But though union democracy looks great compared to corporate decision-making — where there is no need to even pretend to have any responsibility to workers or the community — it is nevertheless often very thin. Decisions are commonly made by a narrow band of leaders and then routinely ratified. Though formally elected, union elections for top offices are rarely seriously contested and membership participation in union life is at best sporadic. However, ending the dues check-off does not necessarily resolve this limited democracy. In some ways it might even aggravate its flaws. There is no disagreement that having to collect dues directly from the members would put the union in constant contact with the members and it would give individual workers greater control over what happens with their dues. But greater contact does not necessarily mean better contact. It is not obvious that having to regularly collect dues is the best way, or even an especially good way, to communicate with members and increase leadership accountability. If shop stewards are primarily acting as a collection agency, they may end up harassing workers rather than involving them. And it will often be much more productive to focus on issues without the collection of dues getting in the way. Moreover, if workers can individually withhold their dues, this may only open the door to greater fragmentation. Rather than taking an issue to a membership meeting where a binding collective decision is made, some workers might just refuse to pay because they are peeved that their personal priority was not a collective priority. As a tactical question, the relevance of how dues are collected is a matter of context, of place and historical moment. In India, the dynamic new labor central, the NTUI (New Trade Union Initiative), has from the beginning collected dues one member at a time and this seems to work well; the union is actively opposed to moving to the check off system. Yet if Canadian and American unions lost their check off, the decline of trade unionism would only be amplified. Given the current weakness of unions as a social force, the aggressiveness of business and state attacks on unions, alongside the problematic commitment of the members to an institution they are not sure can deliver, the capacity of unions to adjust to the loss of automatic dues would at best be questionable.\nLooking Back In the 1930s, there was no dues check off. As labor historian Nelson Lichtenstein points out, although American workers had poured into the CIO industrial unions during the sit down strike wave of 1937, many dropped out when the recession of the late thirties made it difficult for unions to make gains against the employers. (He cites as one example the fact that over 8,000 workers had joined the UAW local at the Fisher Body plant in Lansing by late 1937, but a year later only a little over 1,000 were still paying UAW dues). This did force the union to find more creative ways to gain members — the GM Oshawa local, not confident in its ability to take on GM, attracted workers through bowling leagues and hunting clubs — but when the opportunity to have a steady income came, workers and their unions generally opted to lock that in through dues checkoff. The postwar struggle for unionization in Canada led at Ford to a dramatic shutdown in 1945 and an arbitrated ruling (the “Rand Formula”) that offered unions the dues check-off (“union security” as it was referred to). This was quite generally hailed as a victory by unionists, soon became a pattern in major industries, and was subsequently enshrined in law. But in exchange, workers were to give up the right to strike during the life of the agreement and the union was to take responsibility for policing that ban. Gaining the dues check-off was controversial, but only because of that trade-off. In itself, there was very little debate about the company collecting dues for the union. As for maintaining strong links with the members, this had been addressed at Ford in the early days of the union through a formal and informal shop steward system that matched the foreman-worker ratio — about one steward for every ten or eleven workers. It was the decline of this system, not the dues check-off, which eventually undermined worker-union links. (Today, a full-time steward in an auto assembly plant represents some 200 workers.) Ending the dues check off would hardly change the current distance between full-time stewards and the rank-and-file. There are certainly impressive examples in Canada and the US where workers, blocked from winning a dues check-off by companies and laws in right-to-work states, have proved they can build strong organizations without depending on automatic dues. But here too, what is telling is that even after that experience, workers have generally moved on to call for a dues check-off. That reflects, it seems, more than a tendency to bureaucratization; it suggests that worker activists see the dues check-off as providing the secure financial resources that allows them to focus on other things.", "url": "https://www.jacobinmag.com/2014/06/paying-dues"}