{"authors": ["Shawn Gude", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:55:25", "date_modify": "2020-05-04 19:55:25", "date_publish": "2014-06-16 00:00:00", "description": null, "filename": "2014_06_educating-for-the-status-quo-common-core_1588622125.html", "image_url": "https://images.jacobinmag.com/2014/06/16235423/9677769476_c29b9d0380_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_06_educating-for-the-status-quo-common-core_1588622125.html", "title": "Educating for the Status Quo", "title_page": "Educating for the Status Quo", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The Common Core, the education establishment’s cherished set of national educational standards, is under attack.\nGlenn Beck and Karen Lewis, state’s rights proponents and Gates critics, anti-standardized testing skeptics right and left — all are lining up to pillory a policy that counts Randi Weingarten, Jeb Bush, and the National Parent Teacher Association among its supporters. Opponents, if one can draw parallels between the grievances of prudish conservatives, militant unionists, and Louis C. K., fret that the Common Core circumscribes creativity and regiments schooling. Conservative detractors are skittish about government indoctrination, lefties about corporate domination.\nSo severe is the scorn that even the Gates Foundation, a financial backer of the standards, is backpedaling; last week, it said schools should hold off on using test scores to evaluate teachers and promote students until the two-year initial implementation process is complete.\nThe Common Core debate is important not simply because of the standards’ immediate effects on pupils, but because it offers us an opportunity to ask the biggest questions about our education system: What should be the guiding ethos of public education in a democratic society? What are we preparing students for, other than participation in economic life? And how should schooling be structured to reflect democratic values?\nThe short answers: Incredulity, not docility, is the trait to inculcate, along with a citizenry disposed to questioning received wisdom and orthodoxy and a less hierarchical teacher-student relationship. In each instance, the Common Core is an impediment.\nThe avowed purpose of the Common Core is to “ensure that all students graduate from high school with the skills and knowledge necessary to succeed in college, career, and life, regardless of where they live.” The benchmarks for math and English are intended to achieve a uniformity currently missing in the patchwork of state standards. Fourth graders in Iowa, advocates say, should be able to complete the same complex math problems as fourth graders in Mississippi.\nThe Common Core doesn’t directly set curricula. Keeping with the American tradition of local control in education, that’s left to states and school districts. (Critics argue that fidelity to the standards ends up shaping curricula anyway.) After their development in 2009 by the National Governors Association Center for Best Practices and the Council of Chief State School Officers, forty-five states quickly adopted the standards — voluntarily, but with money dangled from the Obama administration through its Race to the Top initiative. That number is now dropping, with three states having recently backed out and several others threatening to follow suit.\nIf the substance matters, so does the process. Particularly important is the role of the Gates Foundation — absolutely critical, as the Washington Post ’s Lyndsey Layton has extensively documented. In 2008, national standards had numerous supporters but little chance of widespread passage. Then Bill Gates got involved, and everything changed.\nThe billionaire showered money on the Chamber of Commerce, the nation’s two major teachers’ unions, and state and local players. He bankrolled research and advocacy alike. In just two years, after $200 million in Gates money had been dispensed, all but five states had lent the standards their imprimatur. Most states adopted the standards via unelected state officials, without public input.\nFrom a democracy standpoint, there’s much to question here. First, the virtual omission of civic education, an area already treated as an afterthought in many public schools. The civic education we do have tends to be sanitized, fact-heavy regurgitation that casts democratic participation more as a duty than as a vehicle for emancipation.\nThe Common Core, through its aligned standardized tests, pushes non-tested subjects like civics to the periphery. It looks at a public education system saturated with standardization — witness the increase in boycotts and opt-outs — and prescribes more testing. In their resolution opposing the standards, the Chicago Teachers Union rightly objected to this: “Common Core assessments disrupt student learning, consuming tremendous amounts of time and resources for test preparation and administration.”\nFinally, the Common Core seeks to foster competition among students and countries. Beat the Chinese, it subtly implores. There’s no place for collaboration under global capitalism. In short, the Common Core omits and constricts: It shunts to the side vitally important areas of inquiry in favor of more high-stakes testing.\nThe adoption process was also anathema to democratic values. Gates was instrumental, probably decisive, in reshaping the content of education in nearly every state. He used his financial power to, in Layton’s words, “overcome the politics that had thwarted every previous attempt to institute national standards.” It’s unproductive to impugn the billionaire’s motives. The extraordinary arrogation of decision-making power to one man simply because he excelled at computer programming — this is what’s unseemly.\nThe support of national teachers unions and civil rights groups for the Common Core gives some leftists pause, and their goal of equity across state borders is indeed desirable. Some of the principles of the controversial standards are unobjectionable, even progressive. There’s a conscious effort, for instance, to dispense with rote learning. But any policy approach that doesn’t significantly ratchet down standardized testing militates against educational justice.\nPartisans of the Common Core like to crow that the standards will prepare students to “compete and lead in the global economy.” An emancipatory, democratic education, in contrast, pushes students to examine those very relations of work. It prioritizes the interrogation of received knowledge rather than simple acquisition. Capitalism, the structure which most shapes our existence, comes out into the open as a subject worthy of critical study. The mantra for this form of education could be cribbed from the old man himself: “a ruthless criticism of all that exists.”\nCurricula changes would be welcome. No more whitewashed MLK, labor history elevated to the prominent position it deserves, civic education that borrows more from Ella Baker than Character Counts. Above all, democratic education enshrines self-governance as schooling’s guiding ethos. Uncritical acceptance would dissipate as students assessed whether the common sense of the day actually made sense.\nStudents can only develop into self-determining citizens — active agents, authors of history — if they can assess the merits of the present system of social, political, and economic relations. Is it just? Whose interests are served and who suffers? Are its institutions and mores in line with their values? Is tinkering or broad-based change necessary? This would be the new civic education, in which the order of presidential succession would take a backseat to discussions about the morality of capitalism.\nSome students would come away as staunch proponents of existing social arrangements, convinced that there’s nothing abhorrent about a profit-driven society based on wage labor. They’d be wrong, in my view. But such a decision would be the consequence of active inquiry and intentional reflection. This is what separates democratic education from mere indoctrination. Knowledge transferral and easy assimilation would give way to searching examination.\nFor leftist critics of the Common Core, it’s important not to appeal to some idealized past in which public education was supposedly inoculated against business influence. The democratic promise of public schools has never been a reality. If privatization and standardization have quickened, it’s less a wholesale departure from the past than a purer form of corporatization.\nK-12 public education, as Samuel Bowles and Herbert Gintis argued decades ago, has long functioned to socialize students into the capitalist economy. Most provocatively, Bowles and Gintis showed, “the contribution of schooling to cognitive development plays little part in explaining why those with more schooling have higher earnings.” Students learn, both through instruction and the top-down structure of schooling, that getting ahead means acceding to authority.\nThis pattern of relations mirrors the boss-worker relationship in the corporate workplace (the “correspondence principle,” as the two called it). The “people production process” taking place in the nation’s schools is thus governed “by the imperatives of profit and domination rather than by human need.”\nThis isn’t to say that our public schools are a site of wholesale indoctrination — they still impart valuable skills and, in working class communities especially, serve as a vital community space — or that privatization is the answer. No, the proper response is a deepening of democracy in the classroom. Following Paulo Freire, the “banking” concept of education — educators as depositors of knowledge, students as passive recipients — should be supplanted by an active, less hierarchical learning process.\nEducation is never neutral. For radicals and progressives, the metric should be whether schooling actively sustains or unsettles the status quo. Unreflectively ingested information is noxious for future citizens of the body politic. This is what the Common Core encourages. As one might expect from a policy endorsed by the Chamber of Commerce, the Business Roundtable, and Bill Gates, it shores up the status quo.\nAnd it leaves intact the longstanding ethos of American public education: what’s good for capital is good for the student.\nIt’s an ethos that doesn’t suit a society that calls itself democratic.", "url": "https://jacobinmag.com/2014/06/educating-for-the-status-quo-common-core"}