{"authors": ["Richard Seymour", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:55", "date_modify": "2020-05-04 19:50:55", "date_publish": "2014-08-17 00:00:00", "description": null, "filename": "2014_08__1588621855.html", "image_url": "https://images.jacobinmag.com/2014/08/17000029/1326718146315-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_08__1588621855.html", "title": "Who is an “Outside Agitator”?", "title_page": "Who is an “Outside Agitator”?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In Ferguson, Missouri, there are “outside agitators.” On this, the reactionaries and liberals agree.\nOf course, there are all sorts of racialized rumors flying around in the guise of reporting about what is taking place in Ferguson. We are well used to this — we remember Hurricane Katrina. There will be time to properly sift through and catalog all that. For now, I simply want to ask a quick question: what is an “outside agitator”?\nThe metaphor of exteriority, of being outside, has two important connotations. First, one is transgressing the spatial ordering of the state. States constitute social spaces like districts, wards, and counties — a process that is historically far from racially innocent in the US.\nSecond, is that one’s political being is “outside,” and thus traitorous and disloyal. It is not just that one traveled from one city to another — that’s fine, provided the political agenda one brings is benign for the system — but that one brought ideas that are not only not native to the destination, but actually foreign to the nation, the free world, civilization itself.\nUnderstandably, then, this language is common in situations of high racial tension. The “outside agitator” line reeks of good old boy vigilantism, the commingling of race-baiting and red-baiting that was typical of Southern counterrevolution in the dying days of Jim Crow. Because racial situations unfold in heavily structured political spaces in which the definitions and boundaries of the “local” serve existing forms of dominance. And racial situations are defined within the “common sense” of white supremacy — which, if it is to be seriously challenged, must be challenged from a point of view somewhere far outside that “common sense,” a point of view strongly at odds with the dominant ideology’s ideas of the moral and intellectual foundations of civilization.\nOf course, this implies that “locals” are themselves otherwise not susceptible to radical disturbance. Indeed, the considered point of view of segregationists during the civil rights era was that “their” African Americans were either content or too dumb to rebel by themselves; therefore, if there was unrest, it was the fault of the Jewish outsiders and their “freedom rides” and connections to the global Communist conspiracy.\nThe obvious liberal response to this sort of line was that injustice anywhere was a problem everywhere, that all citizens had moral agency and a stake in freedom, that there is nothing sacrosanct about “the local” (and appeals to it are usually reactionary), and that red-baiting had proved itself to be an attack on all democratic forces. At least since the massive resistance to the Civil Rights Movement, that was the obvious liberal response. And it took no time at all to think it up, everyone already knew the line.\nSo what does it say that a great many of today’s liberals unthinkingly regurgitate the stuff about “outside agitators” in Missouri?", "url": "https://www.jacobinmag.com/2014/08/who-is-an-outside-agitator/"}