{"authors": ["Allie Gross", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:55:35", "date_modify": "2020-05-04 19:55:35", "date_publish": "2014-07-16 00:00:00", "description": null, "filename": "2014_07__1588622135.html", "image_url": "https://images.jacobinmag.com/2014/07/16235711/UFT-charter-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_07__1588622135.html", "title": "The Charter School Profiteers", "title_page": "The Charter School Profiteers", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThis is the second installment in our two-part series looking at charter schools in New Orleans and Detroit. The juxtaposition is no accident — these two cities have the highest percentage of charters in the country. In New Orleans, charters have almost entirely replaced traditional public schools; in Detroit, about half the schools are charters. Both cases show the perils of privatization and the way in which elites manipulate crises to transform social goods. Similar themes are explored in Class Action: An Activist Teacher’s Handbook , a joint project of Jacobin and the Chicago Teachers Union’s CORE. The booklet can be downloaded for free, and print copies are still available. Jenay* crouches on the carpet, her spine curved into a lowercase “c” as she concentrates on the flimsy picture book in her lap. Every few minutes her fingers slide off the page, tapping the floor until she locates a bottle of purple soda. She never breaks eye contact with the book. It’s 4 PM on a Monday in Detroit, and the fifth grader is staying after school to work on her reading. Jenay is reading at a second-grade level. She has been placed in summer school each June since the third grade, and every September she is promoted to the next grade. It is the unspoken truth all students know: Getting held back is an idle threat. It could lead to families switching schools and the loss of thousands in per-pupil funding — mutually assured destruction for the school and the student. Stumbling from word to word, Jenay carefully mouths each letter before whispering what she hears in her head. It is 5:30 when she finishes the twelve pages. Exhaling, she closes the book. A smile spreads across her purple-stained lips, but her eyes evince something else: frustration.\nIn 2009, Detroit Public Schools (DPS) made national headlines. According to the National Assessment of Educational Progress, the majority of DPS fourth- and eighth-graders scored “below basic” on the national exam. Detroit kids had the lowest scores in the assessment’s history. Exacerbating the negative results was video testimony of the district’s failure. The same year, journalist Dan Rather went “inside” DPS. His two-hour documentary, A National Disgrace , highlighted wasted instructional time, a dysfunctional school board, and, due to financial disarray, the appointment of a district emergency manager by the state governor. The system was fraught with corruption, leaving some of the most vulnerable and marginalized in society — black youth like Jenay — far behind. Jenay, however, is not a product of DPS. Since third grade she has attended a charter school in Detroit’s Midtown area — the charter school I taught at from 2010–3. I moved to Detroit as a Teach for America corps member and, like many of the organization’s recruits, I was idealistic about what I could offer students. But beyond just experience, I lacked a contextual understanding of the system I pledged to fix. The DPS brouhaha was the extent of my crash course in the city’s education landscape; it was my perception that charter schools were not just an alternative but the better alternative. What made charter schools so different from traditional public schools was unclear, but the consensus seemed to be that charter schools were somehow immune to the failings of conventional districts. When I was hired by Plymouth Educational Center (PEC), I was charmed by the school’s curbside appeal and enjoyed believing that I was working at one of the “good” choices — a solution. There was a manicured front lawn, freshly painted hallways, and a brand new million-dollar football complex — Kilgore Field, named after the school’s superintendent, Jessie E. Kilgore. PEC appeared to be an educational wellspring in the desert of Detroit’s failing schools. But like all mirages, reality catches up. As I’d eventually discover, mismanagement and opportunistic “education entrepreneurs,” more than pedagogical excellence, defined the charter school system that was supposed to be serving students like Jenay.\nI talked about Jenay incessantly with my colleagues. While I felt comfortable teaching upper-elementary cornerstones like metacognition and critical thinking, I felt under-qualified to teach Jenay the basics. Sitting on the carpet after school I’d tell myself that just being there was helping, but deep down I knew she needed more support. Speaking with administrators was a dead end. They defensively justified her being in the fifth grade — something about passing an end-of-summer-school exam. While some might argue Jenay’s case was a unique situation, the reality is she wasn’t alone. Many of the students were behind, and failure to provide proper interventions was endemic. In my third year at PEC, about 14 percent of the fifth graders scored “proficient” on the state’s October math exam. My homeroom was particularly lagging, so the principal decided that twice a week my students would skip Specials — a rotation of arts and athletic classes — and instead use the period for math remediation. On paper the idea sounded great; in reality it was ill-conceived. Every Tuesday and Thursday morning students would spend an hour filling in math worksheets — also known as dittos — under the watchful eyes of everyone from the gym coach to the Taiwanese exchange teachers who taught Mandarin. Charters schools like PEC were supposed to “save” students who had been failed by neighborhood public schools. But the school’s inability to provide proper, useful interventions highlighted deficiencies in both leadership and structure. Looking back, there were red flags. Our principal, a former colleague of Kilgore’s, had been the director of technology on and off for seven years before being promoted to the head of the school. We had a chief academic officer on staff, but there was no school-wide curriculum, save for the hodgepodge of textbooks teachers found in their classrooms. While the rhetoric around student achievement indicated high expectations, the school’s actions told a different story. Almost every month, during the school day, the student council hosted a dance to raise funds. The fact that these monthly events were interrupting learning time, or that students who couldn’t afford to go were forced to sit idle in the classroom, seemed secondary to the cash they could rake in. Then there were the misguided academic choices. In my second year at PEC, Spanish classes were replaced with a Mandarin program through Michigan State University. With basic literacy in the school well below the national average, children were suddenly expected to master the characters and tones of a new language, all in the name of one day competing in the global marketplace. In reality the course — which cost the school $180,000 a year — quickly devolved into chopstick obstacle races and anime YouTube video sessions. While the school had many excellent, hardworking teachers, it lacked purposeful systems and governance. New products and programs were constantly pushed into classroom with very little follow up or follow through. Despite the promise of being observed by an administrator once a week, my classroom was only visited twice during that first year. During my second year, the haphazard manner in which the school was run was magnified when Kilgore announced he would be leaving PEC for an unspecified period of time to serve as the executive director of the Michigan State University-Good Schools Resource Center, an institute funded by the Skillman Foundation. This move raised questions. I wondered about the extent of PEC’s masked dysfunction. How could someone running a school that lacked intervention systems provide multiple city schools with support resources? More broadly, I questioned the implications for the rest of the city’s education reform efforts.\nThrough the heft of its donations and the power it wields, the Skillman Foundation has been able to shape education policy in Detroit for years. In 2006, the group committed to giving six neighborhood and the schools therein $100 million over ten years, and ensuring a full $600 million would eventually reach them. In addition to giving, the foundation has led various reform efforts. In 2010, it helped bring Teach for America back to Detroit (TFA had a short stint in 2002 but left because of a lack of placement opportunities) and played a significant role in the creation of Excellent Schools Detroit, a clearinghouse for information used by school shoppers. A CEE Trust report from 2010 describes the philanthropy’s role in the city thusly: “Detroit lacks a single political or central governance system spearheading a citywide reform agenda. Skillman views its role as filling this void, stabilizing and coordinating the reform infrastructure from outside typical district and city leadership and authority structures.” At the time, I viewed Skillman as it intended to be seen: a beacon of light in this educational Dark Age. So its choice to hire Kilgore felt surprisingly misguided, especially for an organization with so much at stake in the city’s reform agenda. The very things the Good Schools Resource Center was meant to encourage — structured resources and high student achievement — PEC lacked. Skillman didn’t see it that way. In its 2011 annual report “Tenacious for the D: Ordinary Heroes Do Extraordinary Things for Detroit Kids,” Kilgore is featured as one of the city’s ten “ordinary heroes.” “When Jessie E. Kilgore Jr. talks about Detroit youth, he locks your eyes and flashes an electric smile,” the hagiographic profile begins.\nMy interactions with this “ordinary hero” were limited. The most memorable instance occurred during a school staff meeting last May. Kilgore had been gone from the school for a year and a half, but his influence was still pronounced. When he left, the board never appointed a new superintendent, instead promoting the chief academic officer to interim superintendent. This move left the school’s leadership in limbo and meant many on staff continued to view Kilgore as an authority. Nobody batted an eyelash when he occasionally called staff meetings, like this one in May. Adding to the confusion of Kilgore’s consistent behind-the-scene machinations were rumors that he was still being paid by the school. And so at the meeting, feeling frustrated by all I was witnessing, I decided to ask. We locked eyes, more or less, and without a moment’s pause Kilgore flatly denied being on payroll during his leave of absence. “No, I’m not,” he said matter-of-factly before flashing the room his electric smile. He continued with the next line on the agenda. Needing to return to my classroom for a meeting with a parent, I got up a few minutes later. As I made my way towards the back of the gym, Kilgore stopped me. “Lady in red!” he called out. I had been on staff for three years, and he did not know my name. “For transparency,” he began, stressing the second word. “I just want to say I am not on payroll, but my consulting company is.” The words “consulting company” hung in the air, but no further explanation was given. What the company did, or even what it was called, remained a mystery. That August I sent in a Freedom of Information Act to the school’s board and lawyer. What I learned was that in April 2012, three months after announcing his departure from PEC, Kilgore signed a nine-month contract for $70,000 to consult with the school board as EdConsult LLC — a company he registered four days before signing the contract. The following school year, when Kilgore still hadn’t returned and the former chief academic officer assumed his role as interim superintendent, the EdConsult contract was re-negotiated and signed for a second time. Assigning vague but far-reaching responsibilities, the contracts asked Kilgore to participate in board meetings, train the interim superintendent, and manage the since-halted construction of a new high school. As a former teacher whose classroom lacked a pencil sharpener and lined paper, I was bemused as to how so much responsibility and money would be invested in such amorphous tasks. I began to wonder: Is this happening at other schools as well?\nThe answer, it turns out, was yes. Earlier this month, the Detroit Free Press released a stunning, yearlong investigation on charter schools in the state. In short, the paper found that while Michigan has spent roughly $1 billion on charter schools, public accountability has plummeted, and schools have floundered. In charter-heavy Detroit, permissive regulations have created an environment ripe for mismanagement. According to the National Alliance for Public Charter Schools, Detroit ranks number two nationally for charter enrollment. The city is right behind New Orleans, with over half of its school-aged students attending a charter school in the 2012–3 school year. That number will no doubt rise now that Michigan has lifted its cap on charter schools. Even more pernicious, the majority of them are run by for-profit education management organizations (EMOs). According to a report by the National Education Policy Center, Michigan has the highest proportion of for-profit EMOS running their charter schools — 79 percent of the total. Privatization and limited oversight have conspired to produce a new figure: the education entrepreneur. In the chaos of the Detroit school system, education entrepreneurs see an opportunity for experimentation, innovation, and venture capital. And the decentralized nature of charter schools works to their advantage. With little coherence across schools, the issue of serial education entrepreneurs emerges. Those with limited track records of success are able to wedge their ways into school after school, with nobody checking up on past performance. Kilgore is a paradigmatic example. In 2007, while he was running PEC, Kilgore founded Transitions Consultants, LLC (and its counterpart, Transitions Employment Services, LLC) with fraternity brother Idowu Jegede and businessman Kareim Cade. At the time Kilgore was PEC’s superintendent, Jegede was PEC’s chief financial officer, and Cade worked for Colonial Life, a supplemental insurance provider used by PEC. With the founding of Transitions, Kilgore extended and broadened his entrepreneurial reach in the booming charter sector. From school leader to consultant, Kilgore positioned himself as the head of a for-profit EMO providing services to competing schools. Peddling a five-phase plan that decreased in price as schools transitioned to self-management, Transitions landed contracts for the 2008–9 school year with George Washington Carver Academy (GWCA) and its neighborhood competitor, Northpointe Academy. Both schools had track records of low academic performance, and GWCA had recently been dropped by its authorizer, Central Michigan University. When Transitions came along, both schools were chartered by the bankrupt and swamped Highland Park School District — which was most likely attracted to the 3 percent per-pupil fee it was entitled to as authorizer. Desperate for transformation, GWCA was drawn to Transitions’ seemingly attractive business model and ostensibly successful founders. It seemed too good to be true. And it was. By the end of year one, the academy was still in terrible academic shape. As the management company prepared for its second year with the school, rumors circulated about financial challenges and an inability to pay teachers in a timely fashion. After a disappointing meeting in August 2009 where Kilgore announced pay would be late by two weeks, the frustrated teachers attempted to form a union. Threatened or simply unwilling to countenance opposition, Transitions Consultants, LLC gave their sixty-day notice of contract termination that September. In board meeting minutes from that month they cite “teacher tension” as one of the reasons. The school year had just begun. What should have been a clean break was anything but. In November, Transitions sued GWCA for over $230,000 in unpaid invoices. The for-profit EMO felt entitled to the monies not because of a contractual obligation, but because the school had not objected to the invoices in a reasonable amount of time. Reviewing board meeting minutes from that time period, questions about unnecessary, exorbitant, and disorganized billing arise time and again. For example, in August, a Transitions employee, Carlos Johnson, (who has also been contracted by PEC over the years) ran a marketing campaign for the school by handing out postcards and t-shirts at a booth in downtown Detroit. Transitions invoiced GWCA $30,000 for the weekend marketing stint. When asked about remaining funds at an October 12 board meeting, Johnson said he would get back to the school. There is no documentation of him following up. At a budget meeting on October 20, it is revealed that GPS Educational Services (a company Transitions contracted for special education services that has also been contracted by PEC) invoiced the school for $200,000, even though the school budget allocated only $111,000 for their services. At the same meeting, Carmella Hardin, an independent accountant who GWCA hired after Transitions gave notice, recommends the discontinuation of the electronic signature feature because while reviewing the books she noticed, “Checks were being cut without approval and duplicate invoices were being entered and paid.” With GWCA and Transitions battling over money, the school’s day-to-day responsibilities of educating kids took a backseat. Board meeting minutes from the time period show a slew of angry parents, guardians, and educators vocalizing concern. One parent complained that her fifth-grade son was given an eighth-grade math book. A mother was saddened to hear that the school couldn’t afford paper or make copies because Transitions had allegedly stopped paying the monthly Xerox bill. Another mother was furious when she discovered the IEP (Individualized Education Plan) her daughter received from GPS Educational Services was allegedly the same one from the year before. By the winter, the teacher’s health insurance had stopped being paid — money, however, was still being taken out of their checks. While Transitions claimed they paid the bill every month, board meeting minutes from January 11 tell a different story. According to the management company that replaced Transitions, Blue Cross Blue Shield was contacted and insisted the opposite — Transitions, they said, had stopped paying. Wising up, GWCA ended up countersuing Transitions. The two eventually settled for an undisclosed sum, and by 2010, Transitions was no more. Despite all of this, Kilgore was still the superintendent at my school, PEC. Jegede continued as PEC’s chief financial officer for a time, but lost his job in January 2010 amid financial instability (board meeting minutes indicate that in February 2010 PEC had only $16,000 in their bank account). Cade started an insurance company, Great Lakes Benefits, which has since been contracted by PEC to provide supplemental insurance for the teachers and staff. Like Silicon Valley entrepreneurs who test out an idea, fail, and move on to new projects, the founders expunged Transitions from their “education portfolios” as they moved to their next ventures. Despite robust Internet presences, LinkedIn accounts, and online CVs, Transitions is rarely, if ever, mentioned.\n“I have a saying,” Kilgore says in a video accompanying Skillman’s 2011 annual report. “I say if it’s good for kids, then it’s good. Right. If it’s not good for adults, oh well! If it’s not good for the status quo, oh well! But if it’s good for kids, then in my book it’s something good, and that’s something we should move forward with.” Kilgore sits in front of various computers and tablets, leads a Good Schools Resource Center mini-meeting, taps on a BlackBerry, and generally looks busy. What is never explained in the video or article is what Kilgore and the Good Schools Resource Center actually do. After some difficulty getting in contact with Kilgore, a staffer from the Skillman Foundation agreed to help me interview the elusive executive director. In the ensuing phone conversation, Kilgore rattled off various programs and vendors with which he recommended the schools contract. His descriptions were long-winded but basic, lacking any more depth than an explanation on a website. When he revealed his aspiration to one day be a college president, I realized I needed to get a better handle on the success of this seemingly invincible education entrepreneur. “In your opinion, what past accomplishments qualify you to run the Good Schools Resource Center?” I asked. “I’ve been a teacher, an athletic director, a support services director, a principal, a superintendent – I’ve had four Sylvan Learning Center franchises that I operated for a number of years. Two in Detroit, one in Southfield, and one in Auburn Hills,” he told me. After cutting him off to ask about the Sylvan Learning Centers, I let him continue. “Educational background, of course with a master’s and PhD in Education [from Walden University Online]. And [I’m] pretty connected in the city, [I’ve] been around here my entire life.” Despite my prodding, Kilgore never offered Transitions or EdConsult — two massive education-related endeavors he initiated — until I brought them up. “Oh yeah, yeah, yeah. I forgot about that. So Transitions,” he chuckled when I finally mentioned the elephant in the room.\nThis hesitation to disclose past ventures is part of a disconcerting trend that treats education endeavors like tech start-ups. You haven’t heard of Odeo, the failed podcast company the Twitter founders initially worked on? Probably not a big deal. You haven’t heard about the failed education ventures of the person now running your district? Probably a bigger deal. When we welcome schools that lack democratic accountability (charter school boards are appointed, not elected), when we allow public dollars to be used by those with a bottom line (such as the for-profit management companies that proliferate in Michigan), we open doors for opportunism and corruption. Even worse, it’s all justified under a banner of concern for poor public school students’ well-being. While these issues of corruption and mismanagement existed before, we should be wary of any education reformer who claims that creating an education marketplace is the key to fixing the ills of DPS or any large city’s struggling schools. Letting parents pick from a variety of schools does not weed out corruption. And the lax laws and lack of accountability can actually exacerbate the socioeconomic ills we’re trying to root out. As seen at PEC and GWCA, decentralized charter districts can make mismanagement easier to disguise and replicate. As the number of unregulated charter schools increases in the city, the number of education entrepreneurs with their hands in the pot will also inexorably rise. A further flaw with the marketplace solution is the premium it places on the superficial. Last summer DPS contracted public relations firm Skidmore Studios to revamp their image. Faced with parents opting out of the district, DPS believed public perception was the problem to be solved. In response, Skidmore helped the district create a “Customer Service Initiative.” When all options are focusing on the status quo — sparkling customer service to woo children through the door — what happens once students are actually through the door and enrolled?", "url": "https://www.jacobinmag.com/2014/07/the-charter-school-profiteers/"}