{"authors": ["Mark Bergfeld", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:16", "date_modify": "2020-05-04 19:58:16", "date_publish": "2014-05-16 00:00:00", "description": null, "filename": "2014_05_the-next-portuguese-revolution_1588622296.html", "image_url": "https://images.jacobinmag.com/2014/05/16235125/carnation-revolution-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_05_the-next-portuguese-revolution_1588622296.html", "title": "The Next Portuguese Revolution", "title_page": "The Next Portuguese Revolution", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe poster for this year’s official celebrations of the Portuguese Revolution features a large question mark against a red background. It’s a fitting symbol for an event open to many interpretations. Does Portugal again stand at a crossroads? Or has the revolutionary legacy been co-opted once and for all? Does the poster highlight the revolution’s unfinished business, or put into question the wider gains it made? The Portuguese Revolution of 1974–5, also known as the Carnation Revolution, was the hottest topic of the post-1968 left. At the time, thousands of international revolutionaries travelled to Portugal to get a glimpse of what popular power and real democracy could look like. In their eyes, the revolutionary process in Portugal posed an alternative to both Western capitalism and the Soviet model. Like much of the Left associated with 1968 and after, the memory of these tumultuous years has largely faded into oblivion abroad. Yet in Portugal, the revolution remains a reference point by actors on both sides of the battle over austerity. While former Maoist student leader and current President of the European Commission Manuel Barrosso is a prominent supporter of the “refoundation of the Portuguese state,” which seeks to tear up the last vestiges of the revolution, a new generation of activists associated with groups such as Que Se Lixe a Troika (Screw the Troika), or, a precarious workers’ organization, continue to sing Zeca Afonso’s song Grandola Vila Morena on picket lines and at rallies. The song signaled the beginning of the coup d’état led by leftist military officers of the Movimento das Forças Armadas (MFA) who initially seized the public radio station on 25 April 1974, was sung unison at this year’s official celebrations. Beneath the cloak of unity, bitter wars have been raging over the nature of 1974–5, the government’s eager submission to the Troika’s austerity agenda, and whether the new Portuguese left is up for the task of providing a people ravaged by capitalism with a viable alternative to it.\nMaybe news from May 1968 — a general strike in France, the Vietcong offensive, the uprisings in the US ghettoes — reached the fringes of the Iberian Peninsula with a bit of delay. At the time, Portugal was the poorest country in Western Europe. Its economy depended heavily on raw materials imports from its African colonies. It manufactured these at home in order to export. Low levels of consumption and economic devastation created a powder-keg in a country that was ruled by a fascist regime, a remnant of Europe’s past. The military had been fighting a thirteen-year-long colonial war in Mozambique which had both exhausted the conscript soldiers and stalled economic growth at home. By 1973, when the world was still on fire, socialist and communist agitation was widespread in the military ranks. For the Communist Party (PCP), which had operated in clandestine conditions since the end of World War II, circumstances suddenly changed when domestic class struggle began to catch up to their agitation. More than 100,000 workdays were lost to industrial action between October 1973 and April 1974 alone. When the military signaled the overthrow of the fascist Salazar regime by playing Afonso Zeca’s song, people’s fears instilled by decades of dictatorship were vanquished. To the MFA’s own surprise, the popular classes disobeyed their orders to stay at home. Armed with red carnations, the people of Lisbon unleashed a wave of popular support for the soldiers who stuck them down the barrels of their guns, turning the flower into the symbol of a popular revolution. Today, right-wing revisionists argue that the regime was opening itself up to the idea of democracy and European integration in any case, and that the revolution simply prolonged the process. The insurrectionary actions against the much-hated regime tell another story. On the first day, the people occupied the general headquarters of Salazar’s secret police, the PIDE. Once known as one of the world’s most effective secret services, the PIDE was so despised that workers and rank-and-file soldiers of the MFA chased undercover agents into neighboring Spain or underground during the course of the revolution. In a process that came to be known as saneamento, bosses, factory owners, middle management, and school principals who had collaborated with the Salazar regime were forced out of their positions by popular mandate. Over the course of the next nineteen months, Portugal was to become a laboratory of popular democracy and self-management. People occupied empty buildings and turned them into homes. They created workers’ councils, cooperatives, and free clinics. Newspapers and radio stations came under direct democratic control. In the countryside, workers helped peasants to plough the land. Children taught adults to read. The Portuguese people did not wait for the provisional government to ratify the freedom of assembly in parliament, but established it through their daily demonstrations. Political demands spilled over into economic ones. People won the right to organize in trade unions, the minimum wage, holiday and sick pay. Over one and a half years, the insurgents could push back two coup attempts and dethrone six provisional governments. It seemed like nothing could stop the revolutionary tide. Yet the newly-found Socialist Party — set up among others by the German Social Democratic Party — and high-ranking military officers were keen to return to business as usual. They wanted to see Portugal integrated into Europe, while the Communist Party adhered to a “stagist theory” which would have catastrophic political consequences. In this view, Portugal would first have to undergo a democratic revolution before meeting the conditions necessary for the overthrow of capitalism and the establishment of socialism. Thus, when moderate and right-wing sections of the armed forces finally regained control on 25 November 1975, the Communist Party (PCP) — by far the largest organization in the country — failed to support a group of rebelling soldiers that continued to occupy a barracks on the outskirts of Lisbon. This would mark the preliminary end of the revolutionary mobilizations, and the chance for a revolutionary alternative to emerge in the country. The CIA-backed coup against Salvador Allende and the Popular Unity government in Chile, the historical compromise of the Italian Communist Party (PCI), the establishment of liberal democracy in Greece post-junta, and the ensuing peaceful transition after Franco in Spain contributed to the feeling that revolutions were deemed to fail. But the revolutionary turmoil in Portugal would shape the country for years to come.\nThe Carnation Revolution helped establish the Portuguese welfare state as part of the post-revolutionary settlement. Women had the right to choose and could divorce their husbands. Free healthcare, public education and other services became the common sense among all political parties. While other European countries received their first taste of neoliberalism in the late 1970s and early 1980s, Portugal was moving into the opposite direction. For a time, the country remained instable with frequently changing governments. In this period, Portugal’s process of Europeanization and integration into the EEC/EU also hailed a new set of policies associated with the Washington Consensus. The fractures at the top of society had displaced mass mobilizations until militant student demonstrations in 1992 played a tremendous role in bringing down the Cavaco government, the first government with an absolute majority since the fall of the dictatorship. With Portuguese state debt amounting to €209 billion, or the equivalent to 126.3% of the Gross Domestic Product, the €78 billion heavy bailout package in 2011 would put Portugal at the mercy of bondholders and financial sharks. Economist and leading member of the Left Bloc Francisco Louca told me in an interview, “An economy with a deficit of three percent cannot pay an interest rate of four percent. If debt creates debt, cancellation is the only possible solution.” Yet, debt cancellation was not on the agenda. Instead, the ruling coalition — made up of the Social Democrats (PSD, a right-wing party despite its name,) and the Conservatives (CDS) — cut civil servants’ salaries by over €1,500, or 10%; those earning over €1,000 had their holiday pay scrapped and more than 600,000 public sector jobs — around four out every five public sector workers in the entire country — came under severe scrutiny. According to Eurostat figures, 24% of the Portuguese population now live below the poverty line. In the budget for 2013, the ruling coalition demanded €3.5 billion worth of further cuts to health care, social security, and education. Not only would this plunge Portugal deeper into crisis, but it would also destroy the last gains of the revolution. The process of Europeanization in Portugal that began with the revolution has taken a perverse twist in more recent years. As the government committed itself to selling off €5 million worth of state assets, German and French companies made sure to snap up shares of profitable state-owned companies at a fraction of their original value. In December 2012, the government sold its shares of the profitable airport provider ANA to the French company VINCI for a bargain price. More recently, the French call centre giant Teleperformance won the government bid recently for Saude 24 (Health 24), a telemedicine service. The new owners of “Saúde 24” immediately embarked on restructuring the vital service. Yet more than 400 workers across two call centers took unofficial strike action over the lack of proper working contracts (“falsos recibos verdes”). When I spoke to Tiago, a nurse with nine years of work experience in emergency rooms, he told me “the rope is around our necks, but we remain firm.” It is this feeling of necessity and hopelessness in the face of the Troika which has broken the silence in Portugal once again. In late 2012 and early 2013, Portugal witnessed the largest mobilizations since the fall of the Salazar dictatorship. On 15 September 2012, the Que Se Lixe A Troika (Screw the Troika) coalition mobilized more than one million people into the streets. This demonstration was followed by a general strike called by the main Communist-dominated trade union confederation, the CGTP, on 14 November 2012. At the main demonstration in Lisbon, dock workers engaged in clashes with police in front of the parliament building. On 2 March 2013, the Screw the Troika Coalition once again called for democratic assemblies to censure the government. In a country of ten million inhabitants, it is estimated that more than 1.5 million people participated in the protests across eighty towns and cities. In 2013, the teachers went on strike during examination period. The strike lasted for more than three weeks and aimed to stop the latest austerity package that would impose drastic cuts to public education, increase their working hours, and lift the pension age. Catarina Principe, an activist with the Bloco de Esquerda now living in Germany, wrote at the time: “During this strike, teachers all over the country built networks of solidarity to support them. The national unions, of course, mobilized a big infrastructure to keep the strike going, but . . . many of these solidarity actions were proposed and put into practice by rank-and-file teachers in their schools.” On all these demonstrations, it has been particularly the younger people who chant Zeca Afonso’s “Grandola Vila Morena.” Zeca’s revolutionary song acts as the link between disparate struggles against austerity, extending the collective memory of the revolution to a new generation of activists who don’t have the same political structures, parties, and institutions of workers’ power as during the height of the revolution. Students at the ISCTE University in Lisbon, for example, hit the headlines when they sang the revolutionary anthem at Deputy Prime Minister Miguel Relvas in front of rolling television cameras and forced Relvas to flee the building. It appears that the new movement aims to get down to the old unfinished business of sanamento. The military has also raised its head again. On 6 November 2012, more than 5,000 local police officers marched against the government’s plans to stop early retirement and to end free public transport and healthcare for police officers. Only a few days later on November 10, 10,000 active and retired members of the military in civilian dress marched against austerity through Lisbon. There have been a number of demonstrations since. Some officers complained that their salaries have been cut by as much as 25%. One banner read: “The military is unhappy, the people are unhappy,” Reminding many of the role that radical officers played in the 1974–5 Revolution, one member of the military went on to say, “We will do everything so that the indignation of the people will not be suppressed.” During the November 2012 general strike, I spoke to sanitation workers, metro drivers, teachers, postal employees — all of whom compared the situation to the revolutionary years. Paolo, a postal worker, said, “I haven’t seen anything like this since the revolution back when I was three years old. This is a struggle of workers against the capitalists. We need the same to happen here as in Greece and Spain.” Francisco Louca, who was an activist during the revolution and had been arrested for a protest against the colonial war in December 1972, was more skeptical: “Young people today chant Grandola, Vila Morena, the wonderful and meaningful song used as the radio signal for the military operation in April 1974. One generation later people have re-appropriated the symbols of the revolution. But new modes of politics require different visual representations.” This poses a unique problem to a movement in its infancy. At a time when the possibility of revolution has been largely written out of history, the memory of past revolutions can reduce itself to mere nostalgia. But a new generation of activists appears to be using it to root their organizations in a lineage of resistance in Portugal. Whether they are successful depends on whether they are able to move beyond the mere choreography of protests and root their organizations in the popular neighborhoods of Bela Vista and Sétubal, where more than fifty percent of the population live below the poverty line.", "url": "https://jacobinmag.com/2014/05/the-next-portuguese-revolution"}