{"authors": ["Owen Davis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:55:12", "date_modify": "2020-05-04 19:55:12", "date_publish": "2014-10-17 00:00:00", "description": null, "filename": "2014_10__1588622112.html", "image_url": "https://images.jacobinmag.com/2014/10/17001018/28432v1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_10__1588622112.html", "title": "Punitive Schooling", "title_page": "Punitive Schooling", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nWhen police grappled Eric Garner into a chokehold and left him to die in the street on July 17, it wasn’t just one Staten Island cop that incited protest. The entire “broken windows” system of policing was again thrown into question — particularly because its architect, Police Commissioner Bill Bratton, had been reappointed to a second term just seven months earlier by Mayor Bill de Blasio. Perhaps less known is the fact that the “broken windows” theory has crept into classrooms in New York City and across the nation. As the policing theory goes, minor instances of supposed disorder — spraying graffiti, panhandling, selling single cigarettes — creates an environment of lawlessness, leading to acts of theft and murder. Busting jaywalkers and homeless people for misdemeanors, it follows, will decrease the homicide rate. Some of the fastest-growing charter school networks explicitly draw on Bratton’s law enforcement methods to run their schools, which typically enroll mostly black and brown students. As practiced in schools, the theory becomes “no excuses” discipline, in which teachers rigorously enforce an intricate set of behavioral expectations on students. Minor infractions — a hand improperly raised, a shirt untucked, eyes averted — invite escalating punitive measures: demerits, lost privileges, detention, suspension. The policing theory that gave us stop-and-frisk now underpins the disciplinary system of the education reform movement. “We adhere to a ‘broken windows’ approach to school discipline,” reads the charter application for New York City’s Democracy Prep Public Schools, a New York charter network whose graduation ceremonies last year were graced by United Nations Secretary-General Ban Ki-moon. School staff “focus relentlessly on appropriate consequences for small issues in order to ensure that more significant negative behaviors are unlikely to occur.” The Achievement First network has also “adopted sociologist James Q. Wilson’s ‘broken windows’ theory.” Uncommon Schools, with forty locations in five cities across the United States, likewise advertises that it subscribes to the “broken windows” theory of school discipline. These schools aren’t atypical. They’re at the vanguard of a reform movement predicated on the promise of privately managed and largely union-free schools — charters — which are exempt from public schools’ district discipline regulations. Though these schools do create remarkably ordered environments, the drawbacks of “broken windows” policing provide a useful analog for scrutinizing “no excuses” charters. Millions of demonstrably racist stop-and-frisks, for example, have given “broken windows” a dubious reputation. That a model of schooling proliferating across the country rests on that same theory warrants circumspection. For while many “broken windows” schools post impressive test scores, they’re marked by alarming patterns of suspension and attrition. “The research is very clear that ‘no excuses’ discipline policies tend to lead to many more suspensions, which have negative outcomes for students,” says Paulina Davis, staff attorney at Advocates for Children, an organization offering free legal and advocacy services to New York City families. “These are the kinds of things that can disproportionately impact students with disabilities and students experiencing poverty.” At Chicago’s Noble Schools (where students who step out of line have to shell out cash for fines), the suspension rate is two and a half times that of the district. “You hear the phrase ‘sweat the small stuff’ or ‘the broken window theory,’” Noble’s superintendent told the Chicago Tribune . “We absolutely live by that.”\nThe Rise of “Broken Windows” Schooling Broken windows” policing first captured the public imagination with a 1982 Atlantic essay by sociologists James Q. Wilson and George L. Kelling. A decade later, promising to take a whack at crime, Mayor Rudolph Giuliani swelled the police force from 28,000 to 40,000, appointed commissioner Bratton, and instituted a “broken windows” policy. Police were soon arresting people en masse for depredations on the order of jumping turnstiles and squeegeeing cars. When crime fell (as it did nationally, even internationally), the media credited “broken windows.” Some of the first modern charter networks, which were cropping up at the time, seized on the theory. To close achievement gaps between poor children and affluent, disorder would not be tolerated. The 2003 book No Excuses: Closing the Racial Gap in Learning popularized these schools’ methods. Authors Abigail and Stephan Thernstrom found that charters had “adopted James Q. Wilson’s ‘broken windows’ theory and applied it to schools.” Before long these schools had landed on a folksy euphemism for their discipline: “sweat the small stuff” (best expressed in journalist David Whitman’s “broken windows”-referencing Sweating the Small Stuff: Inner-City Schools and the New Paternalism ). Uncommon Schools founder Doug Lemov popularized the phrase in his collection of teaching techniques, now a bestseller and enterprise unto itself. Technique number forty exhorted teachers to “sweat the details.” It was, writes Lemov, “the idea behind the broken windows theory of policing.” Today, “no excuses” schools are ubiquitous. For an indication, see the Center for Transformative Teacher Training, a clearinghouse for “no excuses” methods. Its clients include most of the top-flight charter chains, as well as Teach for America (TFA), which annually inculcates “broken windows” discipline in thousands of novice educators. As Joan Goodman, education psychologist and director of the TFA program at the University of Pennsylvania explains, TFA teachers “have the same philosophies, read the same texts, have the same rules about behavior” as “no excuses” charters (a fact consistent with my experience in TFA). Not only does “broken windows” discipline permeate the charter movement, it’s standard operating procedure in the country’s largest teacher pipeline.\n“Making Sure the Child Stays in the Goddamn Building” Nowhere has “broken windows” discipline taken hold so completely as in New Orleans. Karran Harper Royal knows the problem well. When her first son, who was diagnosed with ADHD, had trouble fitting into public schools, Royal became a full-time special education advocate. The role has taken her through two decades of reform in the Big Easy. In the years before Katrina, Royal helped families mainly with academic issues. Those days are over. “Post-Katrina, more of my time is spent just making sure the child stays in the goddamn building,” Royal says. In the wake of Katrina, free-market school reform interests swept through New Orleans. Dozens of schools were closed as charter operators streamed in. Today, every school in the Recovery School District is now a privately managed charter (though four non-charter schools persist under the old Orleans Parish School Board). US Secretary of Education Arne Duncan, for his part, called Katrina “the best thing that ever happened to the education system in New Orleans.” With the influx of charters came “no excuses” discipline. Rebecca Radding, who taught kindergarten at a New Orleans KIPP charter from 2010 to 2013, recalls her administrators’ fixation on discipline. “They used the metaphor of the broken window,” she says. “If you say something, you better make sure that every kid does it — or the windows will break and you’ll lose control.” KIPP’s professional development, says Radding, “was devoted entirely to classroom management strategies: the practice of giving directions and mandating that 100 percent of the students follow the directions.” And, of course, maintaining silence. Not only, says Radding, were kindergarteners required to spend most of the day with legs crossed and hands in their laps. “They had to inflate their mouths to look like a bubble so they wouldn’t make any sounds.” Royal recalls visiting such schools with her younger son who, like his brother, had special learning needs. At one school, amid lines of students silently marching through hallways, the principal related sending a student home for wearing the wrong belt. “I wouldn’t put my dog in that school,” Royal says. “That kind of school would destroy my children’s spirit.” Ambitious behavioral expectations, though a draw for many parents, seemed entirely inappropriate given her children’s needs. That disconnect has created a crisis for kids with disabilities. About a third of New Orleans’ students with special needs are suspended annually. Suspension rates of around 60 percent at three prominent high schools have sparked student demonstrations. In 2010, a group of families filed a lawsuit alleging civil-rights violations, a case that has since careened toward class-action status. “Let’s say you’re a child with a learning disability,” Royal explains. “Because you don’t know what the heck is going on, you constantly make trouble. You’re sent to the time out room. Your parent is constantly called and told to come pick you up.” The situation quickly becomes untenable. “Kids are literally pushed to the side,” Royal says, “because the schools don’t know how to deal with them.”\nTotalizing Environments To be fair, American discipline in the age of incarceration has been generally appalling. The last law enforcement theory schools adopted en masse was zero tolerance, which gave us an explosion in racially disparate expulsion rates and absurdities like kids getting suspended for brandishing squirt guns. Some aspects of “no excuses,” meanwhile, draw from the legacy of African-American teaching. As journalist Dana Goldstein discusses in The Teacher Wars, a tradition extending back to the notion of the “Talented Tenth” that stressed high behavioral expectations for African-American boys and girls. In this context, is “broken windows” discipline really novel? After all, what’s new about being a hard-ass? A lot, as it turns out. As University of Pennsylvania’s Goodman argues in a 2013 paper, this type of discipline goes beyond the Dickensian martinet or the militarized urban school, representing “a rather new model on the educational horizon.” “A conspicuous feature of the regulated environment,” Goodman writes, “is an insistence on continuous compliance to pervasive rules that shadow children throughout the day.” These schools create “totalizing environments” through “systematic behavioral engineering” — drills, chants, and near-constant behavioral reinforcement. It’s not about the individual teachers. In fact, many charter-school teachers have healthy doubts about “no excuses” discipline. But individuals alone don’t make these schools tick. Like “broken windows” policing, it’s the system.\n“Somebody Here Does Not Belong” With “broken windows” theory enjoying a renaissance inside and outside of our schools, longstanding criticisms have resurfaced. For one, no empirical evidence ever causally linked the approach with drops in crime, a point underscored in its most trenchant critique, Bernard Harcourt’s Illusion of Order: The False Promise of Broken Windows Policing . “Broken windows,” argues Harcourt, created the category of the disorderly. By “turning the individual into someone who needs to be policed and surveyed,” he writes, the theory “facilitates a policy of surveillance, control, and exclusion of the disorderly.” The policy also objectifies people and behaviors. As journalist Raven Rakia noted in the wake of Eric Garner’s killing, “broken windows” proponents “apply this theory about damaged property to living and breathing human beings.” Having been implemented in a society built on structural racism, the policy has become another iteration of criminalizing and controlling black bodies. Similarly, theorists of “broken windows” schooling often equate orderly student behavior with order in inanimate objects. “To ignore one piece of trash,” the Thernstroms write in No Excuses , “one shirt improperly tucked in, one fight between kids, one bit of foul language, would send a disastrous no-one-cares message.” Litter and language, conflicts and comportment occupy a single category: the disorderly. When society enforces bounds of the orderly, it ensures the de facto exclusion of those who deviate. The Thernstroms favorably relate how the founder of Newark’s North Star charter network chanced upon an obscenity on the wall and called an emergency school meeting. “Somebody here does not belong with the rest of us,” he bellowed. “Somebody here wants to live amidst trash.” Patterns of targeted exclusion plague the charter-school sector, whose enrollment trends have long suggested many vulnerable kids leave, or are removed from, the student body before graduation. Nationally, district schools enroll about half the proportion of kids with special needs as charters. Bizarrely, charter high schools regularly trumpet 100 percent college-going rates with graduating classes that are a fraction of their freshman size. The combined 2013 graduating class in three Boston charter high schools, as education blogger EduShyster found, had only sixteen boys, compared with thirty-nine four years prior — a rate over fifteen points lower than the city’s overall graduation rate for boys.", "url": "https://www.jacobinmag.com/2014/10/punitive-schooling/"}