{"authors": ["Jannon Stein", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:49:56", "date_modify": "2020-05-04 19:49:56", "date_publish": "2014-10-17 00:00:00", "description": null, "filename": "2014_10_the-propaganda-of-construction_1588621796.html", "image_url": "https://images.jacobinmag.com/2014/10/17000714/j_stein-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_10_the-propaganda-of-construction_1588621796.html", "title": "The Propaganda of Construction", "title_page": "The Propaganda of Construction", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Can we address what Engels called “the housing question?” The architect Patrik Schumacher says no. During a keynote panel at a 2013 conference, he claimed that “reality is no longer posing that question.” Schumacher was rejecting the idea that public housing has contemporary relevance, arguing that it is naïve and “regressive” to return to this “bureaucratic” framework.\nIt was a stunning moment. Five years after a housing market collapse initiated a global financial crisis, a leading practical theorist of architecture was declaring “that question” off topic and outmoded. One hardly needs to recite the statistics of foreclosures, evictions, or market rents in major cities to understand that housing remains a problem for huge numbers of people.\nBut from Schumacher’s perspective, the matter of how people organize where to live cannot be framed as an active problem in search of new approaches from professional architects.\nSchumacher did have a salient point that day. He stressed that architecture adapts itself to “socioeconomic and political realities” — design styles do not solve political problems. If we want to transform how we use common space, we should engage in the politics necessary to make such projects more than aesthetic speculations.\nNonetheless, some aspects of how buildings are arranged seem to enable or prevent certain modes of life. Some street grids allow for semi-open, park-like spaces — plazas and courtyards — while others present narrow meandering paths through crowded shops and apartments. Some boulevards can be easily filled with tanks, some squares with millions of people.\nThere’s a difference between a suburban cul-de-sac of single-family homes and a large complex of interconnected buildings with hundreds of apartments sharing common facilities like a swimming pool and a gym. The style of a building reveals nothing about how much the inhabitants pay in rent, taxes, or mortgage fees. It is mum about whether they had a say in the building codes or neighborhood zoning. It provides no knowledge of the workplace safety or level of compensation for the people who built it.\nBut sometimes the politics of a situation can yield new styles, new forms, new shapes for what we choose to build in the places in which we end up living. Perhaps in order to think through the complexity of the housing question, it’s worth taking a look at one time and place in which its politics took center stage.\nOn the walls of certain buildings in the city of Vienna, there are large letters, usually red, arranged in short, simple sentences. The wording varies a little.\nOne common formulation could be translated into English as:\nBUILT BY THE\nCOMMUNITY OF VIENNA\nIN THE YEARS OF 1923–1934\nBY MEANS OF THE HOUSING-BUILDING TAX\nVersions of this text are affixed to the oldest of the Gemeindebauten — the public housing buildings that still provide homes for a little less than a third of the city’s population. Currently, around 500,000 people live in the various apartment buildings owned and administered by the city. The 220,000 units within these buildings make up about 24 percent of all of the available housing in Vienna.\nContained within that total are approximately 65,000 apartments built by the Sozialdemokratische Arbeiterpartei (SDAP), mostly between 1923 and 1934. These socialists, also known as the Austromarxists, came to power in Vienna in 1919 through revolution and the first free and universal elections in Austria. They held a solid ruling majority on the city council until defeat at the hands of the fascists in 1934.\nDuring the fifteen years of “Red Vienna” — and ever since — the apartment buildings built by the SDAP were and have been a synecdoche for the entire project of Austromarxist municipal socialism. In the theory of Austromarxism, strategic interventions, even outside periods of full-scale revolution, could go beyond mere reformism and positively restructure social dynamics.\nJohan F. Hartle, whose work focuses on the problematic visibility of the proletariat — an absent people, a people to come — in Red Vienna, has referred to the SDAP’s method as a “propaganda of construction,” in which newly erected buildings not only advertised and demonstrated an ideological program, but also addressed social needs and were intended to shift conditions on the ground in preparation for future socialist development. The inscriptions vividly capture this attempt to turn Vienna from a collapsed imperial capital into a socialist city.\nThe texts are fairly simple; their claims are compact. In many ways, they are a stripped-down version of a keystone inscription. Responsible parties are named, a span of years is indicated, financial benefactors are acknowledged.\nYet these texts are brief polemics as well. In letters that can be seen all the way down the block, they proclaim the work of community. Some even highlight the financial structure of a new housing system formed in opposition to the practices of private landlords. They declare a city built by its own people with their own means for their own ends, with greater transparency as to how the built forms of a common life are constructed politically and economically.\nAs historians have pointed out, housing policy was not initially the SDAP’s preferred field. The SDAP felt that changes in housing would not alter fundamental labor relations. Yet they were drawn in by a combination of opportunity and extreme need.\nIn the years leading up to World War I, Vienna experienced a significant housing shortage, with many residents living in poor conditions as subtenants or “bed-renters” — up to half of the members of most workers’ families did not have a bed to themselves, while roughly a quarter of the Viennese population was known to be relying on a homeless shelter system in 1912.\nThe Christian Social government under the notoriously anti-Semitic mayor Karl Lueger did pursue some populist infrastructure policy: Lueger was successful at breaking up utility monopolies and bringing essential services under municipal control.\nBut his reliance on a petty-bourgeois base of support meant that his administration upheld the interests of small landlords who relied on rent from tenants and subtenants to supplement income from small businesses and craft professions. The last days of the Habsburgs were characterized by growing demand for reform with little in the offing, aside from small interventions by larger employers, charities, and some mutually organized building societies.\nThe war further inhibited private building. The situation became so dire that Emperor Karl I intervened, declaring a system of rent control in 1917. It was still in place after the war, as refugees from the edges of the empire arrived in search of a new start and new homes. The SDAP defended it as they took over the machinery of the city. Meanwhile, due to postwar economics, land prices in Vienna were quite cheap, but new housing construction was uninteresting to investors.\nEmerging radical competition spurred the Austromarxists along. Wilde Siedler — wild settlers — were occupying vacant land and buildings while also organizing more staid associations to build and administer new housing. Within this context, the SDAP leadership soon saw their work on the Gemeindebauten as crucial — and it became their signature achievement.\nThe decision to pursue an aggressive social housing policy came quickly in 1919, but the agenda stalled until reforms made Vienna its own federal state within Austria, allowing it to pursue an independent taxation policy. Under the city’s financial minister, Hugo Breitner, the SDAP seized on this as a powerful tool of policy and propaganda. Breitner shifted the overall tax burden towards a highly progressive regime and initiated luxury taxes aimed at the easily mocked excesses of bourgeois life, such as horse racing, gourmet pastry shops, and the employment of household servants.\nThe Wohnbausteuer or housing-building tax was placed on all rental properties, but structured so that top-tier properties funded the vast majority of proceeds — all dedicated to the construction of new communal housing. In 1925, the tax yielded 22.6 million schillings; in 1927, roughly 65 million. By the end of 1926, the city had already constructed 25,000 units of new housing.\nThe building program was a massive effort, involving around four hundred different architectural offices. The early buildings in particular show a wide variety of styles, although most are fairly modest. They tend to stay in keeping with existing building patterns, street profiles, and decorative flourishes. There were mandates to ensure that each unit would be well lit, have its own bathroom, water, gas, and electricity, and have easy access to the street or to a courtyard.\nBut nothing like a uniform style was mandated. While patterns did emerge, the Gemeindebauten of Red Vienna demonstrate a great diversity of multi-unit housing forms: row houses, multi-story buildings enclosing courtyards with large archways resembling medieval city gates, semi-connected suburban villas, and many ordinary infill apartment buildings. A core group of buildings were designed by students of Otto Wagner and show his influence.\nLater, more modernist forms appeared — blocks placed around open park-like courtyards and superblocks like the famous Karl-Marx-Hof. During the early period, a handful of larger projects were given particular attention and featured innovations that go beyond the mere provision of higher-quality apartments.\nOne of the first Gemeindebauten opened to new tenants was the Fuchsenfeld-Hof. Designed in 1922 by Heinrich Schmid and Hermann Aichinger, who together took the single largest share of all of the architectural commissions, it had 481 units and a communal laundry, swimming pool, playrooms for small children, and workshops. By 1925, it was the core of a larger group of eight interconnected superblocks, with nearly 1,100 apartments.\nThe Reumann-Hof, designed by Hubert Gessner starting in 1924, had 478 units around a huge courtyard with a memorial to Jakob Reumann, the first SDAP mayor of Red Vienna, who died in 1925. It was described disparagingly as a Volkswohnungspalast — a palace for the people’s apartments.\nOf similar scale and ambition was the Matteotti-Hof, also designed by Schmid and Aichinger. Begun in 1926, it was named after the Italian socialist Giacomo Matteotti, who had been murdered two years prior by Mussolini’s Fascists. It arranged 452 units around multiple courtyards with a monumental entrance gate and two fountains. Most of the early buildings, however, were simpler — the point was to build a lot of decent apartments quickly. Events at the end of the 1920s helped accelerate and shift the building program.\nAt the dedication of the Karl-Marx-Hof, the mayor of Vienna, Karl Seitz, framed the effort through a lens of prospective nostalgia: “Once we are no longer, these stones will speak for us.” By that point in 1930, coming defeat could be seen on the horizon — indeed, it had already begun with the tragic and embarrassing outcome of the July Revolt of 1927. The police had killed eighty-four protesters after a crowd burned the Palace of Justice in response to the acquittal of right-wing paramilitaries who had shot up an SDAP rally in the small alpine town of Schattendorf earlier in the year, killing a man and a child.\nDespite the SDAP’s continued strong showing at the polls and solid membership numbers through the early 1930s, this debacle revealed just how weak the party’s position truly was. As Anson Rabinbach and Helmut Gruber have pointed out, after 1927, the leaders of SDAP put greater weight on their cultural programs as they became increasingly isolated internationally, and their ability and willingness to directly maneuver against reorganized opponents collapsed.\nRed Vienna threw its still significant weight into completing larger housing projects and erecting new buildings it hoped would shelter a new way of life.\nIn addition to the Karl-Marx-Hof, which stretches over a kilometer in length, the period after 1927 saw the completion of several other sizable complexes, including the largest, Sandleitenhof, in 1928. It housed 5,000 people at its peak and was described as a city within a city, because in addition to apartment buildings with community spaces, it had plazas, dozens of stores and workshops, and even its own cinema.\nThe same year, Schmid and Aichinger completed the Rabenhof: 1,109 apartments, along with a laundry, kindergarten, children’s dental clinic, health-insurance office, library, and other facilities. Other larger Gemeindebauten finished during this period included the complex at Friedrich-Engels-Platz (1,467 units), the Goethehof (727 units), and two in the Floridsdorf area that were later named for SDAP leaders, the Paul-Speiser-Hof (765 units, renamed in 1948) and the Karl-Seitz-Hof (1,173 units, renamed in 1951).\nDespite these heroic efforts, housing needs remained substantial and worsened as the Depression set in. During this later period, an estimated 77,000 people in Vienna relied on homeless shelters every month. The bullet holes that remained in the façade of the Widholz-Hof from 1934 to 1948 were evidence that these palaces of the people could also be stormed.\nThe later renaming of these buildings to honor the leaders of the 1920s suggests how they continued to speak throughout the years. After 1934, and even more after 1938, many of the original inscriptions were removed from building walls. Several buildings were renamed, Jewish tenants were evicted, and “politically unreliable” city employees who worked for the housing department — ranging from municipal architects to swimming-pool attendants — were fired. Yet most of the buildings survived the war.\nAfter the war, the successors to the SDAP, the SPÖ (Sozialdemokratische Partei Österreichs, known as the Sozialistische Partei Österreichs from 1945 to 1991) were elected into the mayor’s office and city council again and again. They have never lost the municipal majority, but they have certainly become less radical and less ambitious over the years.\nNew community housing was built well into the 1990s, and since that time, residential criteria have opened up to include citizens from across the EU as well as some non-EU citizens. But the last new building was completed over a decade ago. In 2004, Vienna decided that it was no longer in the business of reimagining and building new visions of socially owned housing.\nVienna’s Gemeindebauten are lasting monuments to past efforts, but also places where real people live. They remain sites of contest: politicians campaign on the question of who has a right to a communal apartment. While these buildings still stand, while they are still maintained, those large red letters will still call out a message: this community built these places — this is when, this is how. The people of Red Vienna tried to address the housing question as best they could.\nWhat would it mean politically to do the same today? To ask ourselves how to build places to live, places to learn, places to rest, places to enjoy, places to work together that let us feel more free and equal? What would urban housing look like if we could build cities where buildings with hundreds of units wouldn’t simply be machines for generating private rent?\nWhat might a new suburbia look like if it wasn’t a way to tie people into the mortgage debts of a two-income, overworked, overstressed nuclear family? What would it mean to learn from Vienna — not just this or that technique for laying out apartments and houses, but methods for demonstrating the antagonisms at work in our cities and our plans for a better life?\nWhat if we could learn to be polemical, provocative, and even transformative in our work while also striving to act with transparency — about who we claim to be, about what we are building, about our means? To take on the question of the shape of our cities and to be able to lay out a record of work — a propaganda that speaks to victories won today, while paving the way for more ambitious changes in the future.\nBut perhaps that goes a bit beyond the “housing question.”", "url": "https://jacobinmag.com/2014/10/the-propaganda-of-construction"}