{"authors": ["Richard Seymour", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:00", "date_modify": "2020-05-04 19:57:00", "date_publish": "2014-08-16 00:00:00", "description": null, "filename": "2014_08_the-anti-zionism-of-fools_1588622220.html", "image_url": "https://images.jacobinmag.com/2014/08/16235833/140752087264602-1.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_08_the-anti-zionism-of-fools_1588622220.html", "title": "The Anti-Zionism of Fools", "title_page": "The Anti-Zionism of Fools", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nA new holocaust. Kristallnacht. That, they say, is what the large mobilizations against Israeli actions in the Gaza Strip betoken. With the best will in the world, when Israel’s mandarins and apologists invoke the Holocaust’s legacy in this way, it is difficult not to respond with a world-weary sigh. Who dares to bomb a packed refugee center, incinerating, shredding, and crushing the humanity crammed within, and then betray the Holocaust’s memory for cheap propaganda? Who else but Israeli politicians, for that matter, would actually threaten genocide on another people, and then say that it is their critics who are bristling with genocidal intent? This time, however, they think they have a stronger case. They refer, it seems, to recent protests where, particularly in France, it is reported that pro-Palestine marches have degenerated into antisemitic slogans and violence. As such, just as IDF troops murder West Bank protesters, now Israel demands “strict regulations” on the format and content of future demonstrations in Europe. In France, a number of protests over Gaza have already been banned, on the pretext of containing the antisemitism allegedly on display at previous demonstrations. The French chief of police banned protests on July 19 and 26, citing a threat to public order. A number of participants have been arrested, and a leading member of the Nouveau parti anticapitaliste (NPA), Alain Pojolat, has been charged with organizing a protest in defiance of the ban. This is exceptionally rare in France. Generally speaking, one does not need a permit to demonstrate. One “declares” a demonstration, and it is then tacitly permitted. In the past, only a few far-right protests have been banned; this is the first occasion on which the tactic has been extended to pro-Palestine marches. Nor can such bans be treated as isolated instances. Much of the mobilization around Gaza is driven by the political anger of France’s Arab and Muslim population, specifically the poor and oppressed of the banlieues. The French state has a long history of violence and repression against this group, in recent years articulated with an increasingly shrill Islamophobia. In context, canceling the democratic rights of pro-Palestine protesters looks like, among other things, a further attempt to curtail the political agency of an oppressed group. Not only that, but if advocacy for the Palestinian cause is so inextricably bound up with antisemitism — and violent, eliminationist antisemitism at that — that protests in Europe have to be controlled, what can antiwar demonstrators in Israel expect? To be deemed self-haters, traitors. To be beaten up, and told “Go to Gaza.” This, then, is a matter of some consequence. It is vital that the truth about the demonstrations be told, and that the real extent, influence and nature of antisemitism in the pro-Palestine movement be confronted head on.\nThe Misinformation What happened at the rue de la Roquette? What happened in Sarcelles? The Anglophone media is, with some important exceptions, unequivocal: a rabid outburst of antisemitism. Synagogues and Jewish businesses attacked. The air filled with Jew-hating slogans, including a particularly noxious call to “gas the Jews.” Roger Cukierman, president of the Conseil Représentatif des Institutions juives de France (Representative Council of Jewish Institutions of France, CRIF), compared the events to Kristallnacht. It is not only Israel apologists who are worried about these events. Palestinian activists are appalled by the reports. Is this the pro-Palestine movement in France today? Let us start with the rue de la Roquette. On July 13, a surprisingly large and lively demonstration took place, which arrived peaceably at the Place de la Bastille. En route, it passed by the synagogue at the corner of the rue de la Roquette in the east of the city, near the Place de la Bastille. Media reports claimed that as the procession neared the synagogue, there was suddenly an attempt to attack it and worshippers within. A fairly typical report in Britain’s Independent stated: “Worshippers barricaded themselves inside the Synagogue de la Roquette as demonstrators tried to storm the building with bats and chairs. Police and security volunteers blocked their way and tear gas was launched to disperse the crowds.” Did the reported events happen? The president of the synagogue, Serge Benhaïm, is emphatic on this point. “Not one projectile was launched towards the synagogue,” he stated. “At no time were we put in danger.” What did happen, as can be seen from the footage, was a stand-off between sections of the protest and another group, little heard of in the press accounts. That group, wielding chairs and clubs, is the far right Jewish Defense League (LDJ). Banned in several other countries and classified a “terrorist group” by the FBI, the LDJ operates legally in France. More than that, there is evidence suggesting that the French state has been in striking complicity with the LDJ. It has a close relationship to the fascist Front national, attacks Jewish dissenters, and engages in a range of vigilante actions, in which it threatens to send the “Muslim pro-terrorism vandals” “to the hospital.” Their presence here, and their charging at the protest, was intended to incite a street fight. It has also been alleged that the slogan “death to the Jews” was heard at the protest. Roger Cukiermann asserted as much on national television, and it was subsequently reiterated to condemn the protesters. This has never been verified. A comprehensive account by the investigative news site MediaPart (translated here) suggests that no evidence of this can be found in any of the video clips of the protest. It points out that Cukiermann initially claimed that the phrase was shouted through a microphone, though this was later retracted. And it notes that the LDJ activists can be seen in footage calling the protesters “Dirty Arabs” and “niggers.” There is also the role of the CRS (the French national police force) at this protest. If they were not tear gassing the pro-Palestine protesters in order to protect the synagogue from an attack, why were they using such weapons? They were, in fact, protecting the LDJ. Officers were heard warning the LDJ that “if you go on charging, we won’t be able to help you anymore”. The events, then, were not as reported. Nonetheless, even here, the fact that antisemitism was the subject of a gross distortion and slander does not mean we can write it off as a potential problem. The synagogue was not attacked, but there had been a “Molotov cocktail” attack on a nearby synagogue in recent days, though by whom it is not clear. Likewise, even as the LDJ announced that they would gather at the synagogue, the idea of attacking the place of worship during the protest had been circulated on social media. What of Sarcelles? Here is a typical report from the Huffington Post: On Sunday, locals reported [chants] of “Gas the Jews” and “Kill the Jews,” as rioters attacked businesses in the Sarcelles district, known as “little Jerusalem.” Manuel Valls, France’s prime minister said: “What happened in Sarcelles is intolerable. An attack on a synagogue and on a kosher shop is simply anti-Semitism. Nothing in France can justify this violence.” As the journalist Dominique Vidal blogged at Le Monde Diplomatique , the events in Sarcelles appear, even in the opaque light of news reports, to be of a different type than those in the rue de la Roquette. This is unquestionable. However, once again, the media reports omitted a great deal of detail. This includes, of course, the mass presence of the tooled-up LDJ and other local Jewish youths, who had gathered at a synagogue on the Val D’Oise supposedly to “help” police protect the site, but plainly seeking a confrontation after days of baiting between Arabs and Jews on social media. It also includes the role of the CRS. The demonstration at Sarcelle was banned, and while riot police could not prevent it from taking place, they were there to control it and in practice once more ended up protecting the LDJ. What then took place as a result of the confrontation with both LDJ and cops was evidently not a coordinated action, but a spontaneous riot. The demonstration-cum-riot is not reducible to the actions of a fringe. However, some of the actions on the riot were, unquestionably, explicitly antisemitic. Jewish-owned businesses were singled out for attack, and a Molotov cocktail was flung at the synagogue where LDJ were gathered. The reports of antisemitic slogans, circulated in mainstream news reports as fact, cannot be verified. The claims were nebulously sourced to “locals” in the original reporting by the Agence France-Presse wire service. Eyewitness reports are notoriously unreliable, and no corroborating evidence is available. This is not to say that the chants did not happen. And if people really did shout “gas the Jews,” it would shed a particular light on the political dangers involved. Even moderately savvy Nazis would resile from such a slogan these days, if only because they prefer Holocaust denial to outright Holocaust affirmation. However, given the imputation of such slogans to other pro-Palestinian demonstrations without evidence, there are grounds to be cautious about such claims. However distorted and exaggerated, antisemitism is a real current in France, and even in the far margins of the pro-Palestine movement more generally. In the French movement, there is a fringe which finds expression in such outfits as the Gaza Firm, which is unquestionably antisemitic. And even where antisemitism does not have this level of support, one need only look at the small reservoirs of support for kooks such as Gilad Atzmon and Israel Shamir — both of whom, it should be noted have been openly repudiated by key Palestinian activists — to see it at work. Organizing a political response to real manifestations of antisemitism is, however, made far more difficult by stigma and repression in the service of Israel-apology.\nAntisemitism as Canard How did the reports omit so much, and how were definite conclusions so rapidly formed? First, it is important to establish some of the political and ideological conditions in today’s France. Aside from Germany, France is the European state in which it is most difficult to criticize Israel explicitly. It is the country in which it is possible to be prosecuted for articulating a pro-Palestine position — even a relatively moderate, two-state position. The prosecutions of the journalist Daniel Mermet, the philosopher Edgar Morin, the political scientist Samir Naïr, the novelist Danièle Sallenave, to cite a few instances, make this clear. More generally, the political culture is one in which practically any kind of critical politics can be stigmatized, usually by former leftist intellectuals, as antisemitic. For example, the philosopher Alain Badiou has repeatedly been been accused of providing the philosophical basis of a “new antisemitism” in France, on the basis of a book published in 2005 on the “Uses of the Word ‘Jew.’” The book, grossly travestied by its opponents, is a philosophical argument about Jewish identity, and includes an argument for breaking with Israel’s “excessive identitarian claim to be a Jewish state.” That the invigilators of political discourse are often former Maoists of the Gauche Prolétarienne is no accident. Many of these, disappointed by the failure of the revolutionary upsurge of May 1968, became the most zealous counter-radicals by the late seventies. The “New Philosophers,” as they were called, enacted a pale recapitulation of 1950s McCarthyism, sending up shrill alarms about “totalitarianism” everywhere, particularly on the Left. They offered this assurance: we have seen the radical left from the inside, we understand the totalitarian impulse very keenly, and we can assure you that the open, market society that you almost have is the best you can aspire toward. Everything else is tyranny. The stigma of antisemitism is at the heart of such “antitotalitarian” practice. It works through a chain of equivalents linking, a la Bernard-Henri Lévy, anti-capitalism, anti-imperialism, anti-Americanism, anti-democracy, and antisemitism. To be in any way anti-capitalist, for instance, is to be impugned for entertaining the bogey of the “Jewish financier.” In such a culture, anyone articulating a critique of Israel, let alone a thoroughgoing rejection of Zionism as such, merely inculpates themselves. It is not just that there has been a rightward turn of formerly left intellectuals. The CRIF, which claims to represent all Jews in France and plays a significant ideological role in France on the subject of Israel, has come a long way from its origins as a body representing Jewish resistance to Vichy. Its turning point in this regard was in 1967, when, as with Euro-American states in general, alignment with Israel suddenly became far more strategically important. It tended, initially, to align with the Socialist Party, owing to the “Arab Policy” of the Right and the latter’s lack of concern about antisemitism. The struggle against the Front national in the 1990s led it to seek a more bipartisan stance. But by the 2000s, in the context of the Second Intifada and rising support for the Palestinians, it was strongly aligned with the right government of Nicolas Sarkozy. That is the context in which Roger Cukierman wrote after the 2002 presidential elections, in which the fascist Jean-Marie Le Pen came second, that Le Pen’s success “will serve to reduce Islamic anti-Semitism and anti-Israeli behavior, as his vote sends a message to Muslims to behave peacefully.” Nor is this a peculiarly French phenomenon. For years, the concept of “the new antisemitism” has been deployed by a raft of commentators (to name a few, Phyllis Chesler, Bernard Lewis, David Mamet, Gabriel Schoenfeld, Walter Lacqueur, Daniel Pipes, Abraham Foxman, Melanie Phillips) to characterize post-Second Intifada anti-Zionism as a form of Jew-hatred. Even the Holocaust references are not new. The French philosopher Alain Finkielkraut dubbed 2002 a “Kristallyear.” In 2003, hearing of a poll in which 60% of Europeans considered Israel a threat to world peace, Natan Sharansky averred that the EU was “brainwashing” people against Israel, and in the process preparing to sink back into “dark sections of its past.” Bernard Lewis asserted in 2006 that the supposedly reigning atmosphere of hostility to Israeli was like 1938 all over again. The basic drift of the “new antisemitism” thesis is that Israel is the “Jew among nations,” the guarantee of Jewish security in a world of nation-states, and that the attempt to undermine this state is an attempt to deprive the Jewish people of the normal and secure status conferred by nationhood. Italians have a state, Iranians have a state, even the Palestinians want a state now, so why not Jews? Notably, however, this critique precisely embraces the conflation of Jews with Israel that in other contexts we are rightly told is antisemitic. Indeed, the fact that that Israel’s apologists regularly reinforce this false logic is particularly important to understanding the French situation. Cukiermann and the CRIF warn of “Kristallnacht” in one breath, advising sternly against the conflation of Jews with Israel, and claim to represent all French Jews and tell us that “the Jews” support Israel, in the next.\nThe Anti-Zionism of Fools This bad faith and self-contradiction is actually intrinsic to pro-Israel discourse, in part because the Zionist movement internalized the precepts of antisemitism at a very early stage. However, the fact that this is so cannot be allowed to obscure the real dynamics of antisemitism, nor the fact that there is some novelty in its articulations. Certainly, whatever the recent myths, synagogues have been firebombed, and antisemitic incidents have reportedly increased — not only in France, but in the UK as well. In Germany, a synagogue was petrol bombed, supposedly “in solidarity with the Palestinian cause.” The antifascist journalist Rene Monzat, reporting on the banned protest at Barbès on July 19, noted that while he did not hear antisemitic slogans, “I’m convinced that, in the present circumstances, the confusion of Israelis/Jews/Zionists is exceedingly dangerous and that it often happens.” Likewise, Julien Salingue, a Palestine scholar and NPA member, argues that in France today there is “a combination of ‘classic’ antisemitism (right-wing, white and Catholic)” with “a ‘perverted anti-Zionism.’” Part of what is happening is the conflation of the Israeli state with Israeli Jews who support Zionism and those who do not, Jewish supporters of Israel, Jewish opponents of Israel, and Jews who are indifferent to Israel. This, logically, can only be a racializing gesture. It ignores the fact that Israel has far more solid allies on the Christian far right than it does among Jewish New Yorkers, some of whom were arrested in civil disobedience against the war on the Gaza Strip last week. It is the latter form of antisemitism that is the most troubling challenge for pro-Palestine activists. We can hardly be surprised that the subject of Israel attracts a degree of antisemitism. It advertises itself as “the Jewish state,” the privileges of which any Jewish person has access to by birth. As Sigal Samuel wrote in the Jewish Daily Forward : Is it really so hard to understand why — after Jews have spent decades telling every Jewish child that they are owed a free trip to Israel, citizenship in Israel, life and land in Israel purely by virtue of being Jewish — the world is slow to distinguish between Jews and Israel? Nevertheless, no one is forced to make this conflation, and the overwhelming majority of pro-Palestine activists refuse it and indeed actively combat it. Why does it gain currency among some? Salingue points out that the major political manifestation of this type of French antisemitism is “the Dieudonné-Soral axis.” What is this axis? And why does it have political support? To answer this question is to say something about the failures of the French Left in regard to the country’s Arab and Muslim working class. The majority of the French Left, beholden to a republican ideology that stresses an exclusionary form of secularism, abandoned any attempt to organize in the banlieues where French Arabs live, long ago, after the indigenous-led March for Equality and Against Racism in 1983. At best, they tailed the empty moralistic anti-racism of the dominant Socialist Party and its allied organization SOS Racisme. At worst, they colluded with Islamophobia. In some senses this was continuous with a failure to reckon with the legacy of colonialism — especially in the case of the French Communist Party (PCF), which had always (from the Popular Front period onwards) been soft on colonialism in practice, particularly in Algeria. Whatever the reason, the French Left was largely unable to productively address the problems of oppression that this group faced. This was particularly evident during the “foulard” controversy, in which the French state restricted the rights of Muslim women to wear a religious headscarf, and much of the Left essentially seconded the government’s line. Even to admit the problem of Islamophobia has taken a huge effort on the part of the Left. This is one of the reason why it was so significant when, in 2012, Jean Luc Mélenchon — the traditionally “republican” leader of the Front de gauche — acknowledged and spoke out against Islamophobia. Into the void left by this dereliction stepped the comedian and actor Dieudonné M’bala M’bala of French and Cameroonian background, and the “national-socialist” polemicist and dandy Alain Soral. Dieudonné was initially known and widely loved as an anti-racist comedian, who performed in a double act with a Jewish comedian, Élie Semoun. He campaigned against Le Pen’s Front national in 1997 and 2001. And he became increasingly interested in the issues of the slave trade and reparations. In the face of the Left’s indifference to these issues, he slipped into increasingly delirious anti-Semitic positions (citing, for example, the supposedly preponderant role of Jews in the slave trade). But it was a television skit in which he characterized an Israeli settler as a Nazi that inaugurated his turn to the far right. The sketch lambasted the “Americano-Zionist axis” and saw Dieudonné, in character, perform a Nazi salute and cry “Isra-heil.” Several organizations tried unsuccessfully to sue him for incitement to racial hatred, at around the same time that numerous others were being prosecuted for criticizing Israel. In response to this, he began to denounce the “organized Jewish community,” and began to seek an alliance with Jean-Marie Le Pen, later to become a godfather to one of his children. It was, however, Alain Soral, a former member of the PCF who had lurched to the far right and become a speech-writer for Le Pen, that became closest to Dieudonné. Together they formed a toxic complex, in which Dieudonné’s undoubted charisma and popularity helped bring antisemitic conspiracy theories from the far right into the most oppressed communities in France. The statistics for the Liste Anti-Sioniste (Anti-Zionist List) for which Dieudonnéran in 2009 show that it was most popular in the most deprived, economically dilapidated areas. The ideological content of their antisemitism had a strong populist element. Alain Badiou thus gets at a part of the truth when he adverts to the class dimension of racism, arguing that while much traditional antisemitism had an anti-popular animus identical in structure to the hatred incited against “gypsies” and immigrants, the antisemitism of many banlieue youths was directed exclusively against a group perceived as being powerful. To “prove” the reach of “the organized Jewish community,” he could cite the censoriousness over Palestine. He would also invoke laws against hate speech and Holocaust denial to show the power of “the Jewish lobby.” It wasn’t that Dieudonné outright denied that Jews had been victims of oppression, although he appeared on television with Holocaust-denier Robert Faurisson, but rather he claimed that the cultural recognition of the Nazi holocaust and the realities of antisemitism had been allowed to crowd out the field of victimhood, such that the injustices of the slave trade, colonialism, and anti-immigrant racism were ignored in the media and school curriculums. There is a strange irony in all this. Dieudonné’s antisemitism ultimately invokes the French model of secular assimilation against Jews, who, in a loaded language, he accuses of behaving in a “tribal” way. Given that much of his audience reviles assimilationist discourse, this is a strange point on which to pin one’s antisemitic case. There may, however, be an underlying logic. In Houria Bouteldja’s decolonial analysis of the Dieudonnéphenomenon, it is suggested that in a way what many of his supporters wanted from France was to be recognized as legitimate, as equals, as French citizens. The competition with Jews for recognized victimhood can thus be interpreted in part as a struggle for legitimacy from white society. Soral is canny enough to offer this — recognition as French citizens in an alliance with the far right, which nonetheless respects the specificity of indigenous cultures. Thus, pro-Palestine politics and “anti-imperialism” are linked in a particular way, through antisemitism, to the material and symbolic interests of individual communities. This is the terrain on which those who genuinely want to combat this sort of antisemitism are intervening.", "url": "https://www.jacobinmag.com/2014/08/the-anti-zionism-of-fools"}