{"authors": ["Rob Hunter", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:20", "date_modify": "2020-05-04 19:54:20", "date_publish": "2014-05-16 00:00:00", "description": null, "filename": "2014_06_waiting-for-scotus_1588622060.html", "image_url": "https://images.jacobinmag.com/2014/05/16235235/hunter-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_06_waiting-for-scotus_1588622060.html", "title": "Waiting for SCOTUS", "title_page": "Waiting for SCOTUS", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Sitting justices of the Supreme Court do not relinquish life tenure lightly. Ruth Bader Ginsburg provoked a squall of protest from liberal commentators recently when she dismissed suggestions that she retire before the end of President Obama’s second term. In 1972, William Douglas scrapped his retirement plans when Richard Nixon’s reelection conjured the specter of a hostile replacement. But perhaps no justice was ever more determined to stay put than William Howard Taft. In 1929, two weeks after Black Tuesday, the former president turned Chief Justice declared, “I must stay on the court in order to prevent the Bolsheviki from getting control.” Douglas and Taft were both aware of the political consequences of leaving the Court. Contemporary justices are less willing to acknowledge the partisan dimensions of their office. Despite describing the current Court as “activist,” Ginsburg seems to be untroubled by the prospect of a conservative replacement. This is in keeping with the prevailing mythology about the Supreme Court. As Ginsburg’s colleague John Roberts put it during his 2005 confirmation hearings, justices with the power of judicial review — the power, in effect, to change the law by reviewing the constitutionality of legislation — should strive to be impartial “umpires.” Liberals lambasted Roberts for arguing in bad faith, but in reality they share his vision. In the liberal political imagination, the Supreme Court is an institution that must vindicate principles rather than practice politics. As the philosopher Richard Rorty once acknowledged, liberals “turn to the judiciary as the only political institution for which we can still feel something like awe. This awe … is respect for the ability of decent men and women to sit down around tables, argue things out, and arrive at a reasonable consensus.” Disdaining political conflict, liberals would rather seek consensus through conversation. And they would prefer that such conversations take place only among a narrow stratum of elites and power brokers. The only “reasonable consensus” that the Supreme Court can produce is inherently anti-democratic. Liberal enthusiasm for pursuing policy change through the Court rather than through confrontation and struggle illustrates the degree to which progressive politics has become emptied of content and purpose.\nIn 1789 — the same year that French revolutionaries were storming the Bastille — the wealthy and landed elites of the newly formed United States were consolidating their power. The French Revolution sought to abolish the aristocracy. In the United States, however, a new aristocracy of landowners, merchants, and slavers — the framers of the Constitution, which went into effect that March — sought to prevent anything like the French Revolution from taking place on American soil. They were aghast at popular uprisings, demands for mass debt forgiveness, and state governments that appeared dangerously willing to consider subordinating the interests of creditors and mercantile elites to those of farmers and workers. Through the Constitution, the framers were determined to put in place a system of institutions that would resist democratic pressures and mute expressions of popular sovereignty. Although the framers frequently invoked the idea of popular sovereignty, they did so not in order to constitute a collective subject, but to prevent one from emerging. The Constitutional Convention of 1787 could hardly be classed as a constituent assembly of the kind found in France. It was convened in a state of exception rather than one of revolutionary ferment. Its delegates busied themselves not with giving institutional expression to popular sovereignty, but with creating a national government whose responsiveness to democratic politics was limited. To those who carried the day at the Convention, popular sovereignty consisted of little more than presenting the Constitution to state governments for ratification — a deeply participatory and popular form of democracy was hardly what they had in mind. The Constitution claims popular sovereignty as its authorization, but establishes a distinctly undemocratic system of institutions. Unlike the political institutions of republican France, the institutions established by the Constitution are elite-dominated, decentralized, and marked by few opportunities for direct participation by the people. These are the institutions defended by the Supreme Court when it reviews the constitutionality of legislation. In this way, the Court participates in American politics mainly by attempting to frustrate the exercise of democratic power. Before the Civil War, the Court largely refrained from invalidating congressional legislation on constitutional grounds. The only important such episode was Chief Justice Roger Taney’s decision in Dred Scott v. Sandford . Taney wrote that Congress could not forbid the extension of slavery into the territories, and added infamously that constitutional protections applied only to whites. Dred Scott foreshadowed the most obvious and frequent future use of judicial review: protecting constitutional boundaries against the incursions of democratic politics. Dred Scott was not undone through another decision, but through victory over the seceding states. America’s bourgeois revolution — the mob­ilization and death of hundreds of thousands of soldiers, along with the emergence of a federal government with truly national prerogatives and powers — was what ended slavery, rather than the deliberations of nine old men in robes. The federal government’s victory in the Civil War was memorialized by the Thirteenth, Fourteenth, and Fifteenth Amendments, which established the primacy of a national conception of citizenship over the semi-feudal patchwork of citizenship rights of the antebellum republic. But the ink had barely dried on the Fourteenth before the Supreme Court busied itself with effacing its Privileges or Immunities Clause, which empowered the federal government to protect individual citizens from abuses by state governments. (Contemporary examples of such abuses include welfare “reform,” union-busting, and all-out assaults on public education.) In the Slaughterhouse Cases , five justices narrowly construed the Privileges or Immunities Clause to prevent its extension into state politics — a warning that the federal judiciary could serve as a redoubt for conservative resistance to the project of building a national, centralized, and egalitarian state. In the ensuing decades, the Court deepened its role as a conservative bulwark against attempts to expand the reach and authority of public institutions. Many chroniclers of the Court point to Lochner v. New York as the landmark case in an era of judicial reaction. However, the decision — in which the Court struck down a maximum-hour law — was not regarded as an important one by contemporaries. It was rarely cited in subsequent cases, and ultimately set aside without acknowledgement or fanfare. More important than the holding in Lochner were the ideological assumptions animating the decision: a genuine fear of democratic institutions peering inside the hidden abode of production, and a conviction that public policy must not be allowed to recognize class conflict. Writing for the Court, Justice Rufus Wheeler Peckham fretted that sustaining maximum-hour legislation would open a Pandora’s box of insidious state intervention in the economy. Such concerns informed much of the justices’ decision-making during this period. No single decision served as the cornerstone of the barrier the Court was erecting against progressive policy, and thus no single reversal would undo it. The Court carried this ideological freighting into the 1920s and 1930s, when the justices were led by conservatives like Taft and emboldened by a raft of reforms of the federal judiciary, which gave the Court greater discretion over its docket and greater supervisory powers over lower courts. The Court became an important conservative veto point during the showdowns between labor and capital prior to the New Deal. In cases like Adkins v. Children’s Hospital (striking down a federal minimum wage law), the power of judicial review to obstruct the creation of coherent, nationwide social policy was vividly demonstrated. The conservative justices were well aware of increasingly volatile relationships between labor and management, as well as spiraling economic inequality. They were determined to obstruct democratic efforts that aimed to tame the pathologies of capitalism. But even precedents like Adkins were eventually overturned or abandoned. In the 1930s, the conservatives on the Court gave way to political pressure from the New Deal coalition — such as when Franklin Roosevelt threatened to pack the Court to overwhelm the intransigent conservative justices — and stopped resisting the expansion of federal powers to intervene in the economy. The experience of the 1930s should have taught liberals two lessons: First, the Court’s ability to shape national policy comes mainly in the form of overturning popular legislation. Second, an obstructionist Court — like an obstructionist conservative opposition — can be overpowered through well-organized and concerted action by coalitions of political leaders, union and party organizations, and rank-and-file activists. The Court is capable of playing a constructive role in politics by providing jurisprudential support to specific projects. That such support is usually lent to conservative projects is no accident. The Constitution describes a decentralized polity, fragmented by federalism and obdurate in the face of popular pressure. It is therefore an ideal rhetorical launchpad for conservative efforts to roll back the redistributive state. And the Court is an ideal vehicle for such efforts. As the legal scholar Larry Kramer has argued, antipathy for democracy among conservatives as well as liberals in the second half of the twentieth century has promoted the notion of “judicial supremacy,” under which the Court is naturally seen as the final, authoritative interpreter of the Constitution. The net result is twofold: the Court is now almost always able to make its constructions of constitutional meaning stick, and many participants in politics (particularly liberals) can only conceive of making foundational decisions about the American political order in judicial terms. With the assistance of friendly Republican administrations, the recent Rehnquist and Roberts Courts have done much to chip away at the juridical foundations of the piecemeal welfare state that was erected in the twentieth century. The Court’s conservatives began to reject the capacious understanding — arrived at during the New Deal — of Congress’ ability to regulate economic activity at the state level, striking down the Gun-Free School Zones Act and part of the Violence Against Women Act. (Exceptions were made for Congress’ ability to pursue conservative policy objectives, such as using federal law to undo state-level efforts to liberalize drug laws.) Under Rehnquist, the Court frequently intervened in the policy process, declaring severe limits on public power and disputing the government’s competence to manage the economy. Under Roberts, the justices continue the Rehnquist Court’s work, by pursuing the dismemberment of national capacities to monitor and intervene in the market, along with the quasi-feudal fragmentation of political power at the state level. But it is important to note that the Roberts Court is only an auxiliary of neoliberal governance. Its decisions should be seen as ratifications of accomplished political facts, rather than independent moves. Simply replacing the conservative justices with liberals would amount to little in practical terms. Nevertheless, conservative judicial ratification helped to build the legal foundations of a less inclusive polity, and to preclude legalistic countermoves — the only moves liberals are still willing to consider making.\nSo why does the Supreme Court have so many liberal defenders? The answers may be found in the decades of depoliticization in the second half of the twentieth century. Never fond of agitation, organizing, and confrontation (unlike conservatives, who are well-versed in such tactics), liberals began to imagine — as many still do — that the vagaries of political antagonism could be transcended through the majesty of constitutional law. They became infatuated with an image of the Court’s role as a defender of individual rights and liberties. The main historical touchstone for this view is a collection of decisions handed down by the Supreme Court under Chief Justice Earl Warren. But the experience of the Warren Court was anomalous and will not be repeated — not until there is a profound shift in American politics. It was only in the greater political environment of centrist liberal hegemony during the middle of the twentieth century — materially underwritten by the postwar boom years and the balance, not yet wholly upset, between organized labor, capital, and the expanding national state — that liberal justices would find themselves in the right place, and with sufficient power, to temporarily achieve modestly progressive gains. The judicial accomplishments that were only possible under the postwar compact defined liberals’ expectations for what the Supreme Court is capable of, even though that compact has all but disappeared today. Despite their accomplishments, the liberals on the Warren Court were unable to lay the legal groundwork for a constitutional realignment, because truly progressive outcomes could only be achieved by razing the conservative foundations of constitutional law. The decisions of Warren and his allies disrupted legal continuity — the feudal heirloom most cherished by conservative jurists. The result in Brown v. Board was arrived at not through orthodox doctrinal reasoning, but through the justices’ awareness of the moral necessity of school desegregation (a policy that was not fully implemented and remains a distant ideal today). The majority opinion in Griswold v. Connecticut — a cornerstone for modern privacy jurisprudence — rested on textually spurious reasoning. (Finding no explicit right to privacy in the Bill of Rights, Justice Douglas concocted one out of the “penumbras” and “emanations” of individual rights listed in it.) And the Court explicitly created new policies governing interactions between civilians and police in landmark cases such as Mapp v. Ohio and Miranda v. Arizona . Unwilling to wait for legislative moves to reform policing, the Court arrogated the task of policymaking to itself. The gains made by the Warren Court were modest but real. But they could not last — like many other products of the postwar compact — precisely because they were made through elite deliberation rather than mass mobilization. Most landmark cases were only loosely tethered to popular movements. Few of the Warren Court’s decisions could be described as the capstone achievements of long struggles by organized groups. When they were threatened by later conservative Courts, these decisions usually lacked broad constituencies that could be mobilized to defend them. Conservative jurists armed with the politically potent (though philosophically puerile) doctrine of “originalism” feel confident to declare such decisions constitutionally groundless. Originalism — briefly, the doctrine that the views and preferences of long-dead politicians and judges should supersede those of the living — holds considerable sway because of its simplicity and its compatibility with conservatism. Liberals criticize originalism as arbitrary and backward-looking, even as they deploy arbitrary and backward-looking arguments to defend liberal decisions by the Court against what they call “judicial activism” by conservatives. It would be better to call it “juristocracy,” the term used by political scientist Ran Hirschl to describe the use of supreme courts as spoilers in the politics of constitutional democracies. However, the activism of recent conservative Courts is simply the result of sound juristocratic strategy, and of conservative justices making the most of the Court’s institutional role. It is, after all, rather straightforward to use an inherently conservative institution to defend an inherently conservative constitution. Trying to staff that institution with liberals who will attempt to make liberal interpretations of that document stick is rather more difficult. After the heyday of the Warren Court, Repub­lican presidents and their administrations — here Ronald Reagan and his Attorney General Edwin Meese stand out — set out to carefully reshape the federal judiciary as a conservative barricade against further expansions of federal power. Rare missteps aside — as when Robert Bork was not confirmed to the Court, mainly because of a surfeit of candor during Senate confirmation hearings — this strategy succeeded in creating a conservative-dominated Court that would balk at the expansive interpretations of congressional power that judicially ratified New Deal and Great Society institutions. From the liberal perspective, juristocracy is an aberration rather than the norm. In campaign literature, magazine stories, and newspaper editorials, the patchwork progressive state conjured into precarious existence in the last century is often defended in jurisprudential terms. Act now or the Republicans will undo Roe v. Wade! My opponent wants to roll back Brown v. Board! We need to repair the damage done by those conservative activist judges in Citizens United! Republican judges are a menace to our constitutional civil rights! This perspective obscures the importance of concerted, organized political struggle and gives unnecessary focus to legal casuistry. The increasingly traditionalist cast of contemporary liberal Court-talk — concerned as it is with preservation of surviving precedents, and institutional continuity rather than political recreation — illustrates the pitfalls of depoliticization. Judicial liberals have abandoned mass politics only to see the brief hegemony of liberal justices undone by conservative electoral successes and the resulting conservative recomposition of the Court. Their rejection of democracy on the street has left them pining after something that looks like monarchy on the Court. The prizes won through judicial liberalism were never secure and now appear more fragile than ever: paper-thin abortion rights, porous conceptions of privacy, and fragile protections against an increasingly militarized array of security services. Concerted mass efforts — which would have required liberals to overcome their reluctance to find allies on the Left — could have won these prizes, and kept them, by putting pressure on political institutions to enact legislation, revise administrative procedures, or even alter the Constitution. But too many liberals conceive of minorities and marginalized groups not as allies or comrades, but as discrete isolates that only a distant Court can protect. Solidarity is not found in the juridically-inflected liberal grammar of politics. It instead appears as something like a philosophical error: it simply cannot be the case, or so liberals imagine, that minorities can engage productively with majoritarian institutions, that marginalized groups can punch above their weight through organization and coalition-building, or that the intersectionality of oppression under late capitalism can be generative of new understandings of shared risks and common interests.", "url": "https://www.jacobinmag.com/2014/06/waiting-for-scotus"}