{"authors": ["Micah Uetricht", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:19", "date_modify": "2020-05-04 19:50:19", "date_publish": "2014-03-16 00:00:00", "description": null, "filename": "2014_03__1588621819.html", "image_url": "https://images.jacobinmag.com/2014/03/16234608/ctu-rally-photo-1-2_0-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_03__1588621819.html", "title": "Uncommon CORE", "title_page": "Uncommon CORE", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe Chicago Teachers Union has become recognized as vibrant, democratic, and militant in a country where many unions are more likely to be engaged in the organizational equivalent of curling up into the fetal position. Unions have been battered by decades of attacks from big business and both political parties, yet they’ve been largely unwilling to remake themselves into key players in a broader social movement nor to educate and empower their membership. But more attention has been paid to the union’s recent struggles than how the CTU became the kind of union that it is — one that could take on the right flank of the Democratic Party and free market reformers, go on strike when such a tactic was largely seen as alienating and counterproductive, and lead a movement for educational justice alongside parents and community members in a city long known as an incubator for neoliberal education reform. This transformation was accomplished through the rise of a radical rank-and-file caucus — the Caucus of Rank-and-File Educators (CORE).\nUnlike previous CTU leaderships and the current national union leadership, the CTU under CORE adopted an uncompromisingly confrontational stance against free market education reform. They refused to enter into a partnership with neoliberal Democrats like Mayor Emanuel and foundations like the Gates Foundations, which have used seemingly benevolent nonprofit donations to aggressively pursue a free market agenda in public schools. CORE also made good on Lewis’s campaign promise to “change this into a democratic union responsive to its members” — a transformation that lies at the heart of the union’s ability to push for a broad educational justice agenda in Chicago. The union educated and activated its membership, involving them in an internal democratic process to an extent that, for the CTU, was unprecedented. Leadership broadened the rights and responsibilities of members in the governing House of Delegates, and fourteen member-led committees were tasked with central roles in the union’s day-to-day functioning. Contract committees were set up at each school, and each committee member was responsible for communicating with ten other educators face-to-face, including school employees like cafeteria workers who were members of other unions. The creation of an organizing department, which had never before existed in the union, was one of the most crucial changes CORE instituted. The department was tasked with continued organizing alongside community groups and expanding the union’s work with community members. Through it, the CTU transformed itself from a service-model union — where the union’s primary purpose is to provide services for their members like representing them in grievances against school management — to a union where the staff’s principal task is facilitating the development of members so they can be at the helm of the union themselves and advance a broadly progressive agenda, in tandem with organized communities. The difference could be seen in the way union members began interacting with parents. In one school on the Northwest Side, for example, CPS administration attempted to co-locate a charter school in the same building as a middle school. In past years, according to union organizer Matt Luskin, the union would have mounted a legal battle with CPS to halt the co-location and hoped for the best; the fight would have been largely in the union’s hands rather than parents’ and teachers’. But CTU staff “encouraged the teachers themselves to take control of the situation by organizing with parents,” Luskin says. Teachers and parents organized together to reach out to other schools in the neighborhood, meeting with their Local School Councils, democratically elected bodies of parents and community members in every Chicago school. Eventually, they held a protest opposing the charter’s opening that drew several hundred people. “The parents didn’t see themselves as particularly anti-charter school, or even pro-union, on the front end,” Luskin says. But parents realized the charter’s construction would interrupt their children’s education, and, once built, the charter would undercut their neighborhood school. “And then by the end of it, they were very anti-charter and very pro-union.” In another case, three elementary teachers worked closely with parents around increasing special education funding for their children, pointing out potential violations of laws around special ed students. The school’s principal, threatened by such agitation that cast her management in a poor light, gave unsatisfactory ratings to all three teachers — putting their future teaching careers in serious jeopardy. “In the past,” Luskin says, “the union would have said, ‘Well, you can file a grievance’” — leaving the teachers to passively await the outcome while union staff handled the fight. Instead, teachers organized house meetings with parents, who strongly supported the teachers. Soon, the teachers accompanied a group of forty parents to a meeting of the Local School Council to issue an official rebuke of the principal. The teachers’ ratings were eventually restored, and the principal transferred to another school. The union’s organizing department also trained rank-and-file members in organizing tactics and educated them on the city’s major public policy issues. Members of the House of Delegates, the union’s representative body of teachers, received training in “bread-and-butter” issues like enforcing the contract’s provisions, but also subjects beyond the classroom like fighting school closures. The department started a summer internship organizing program where teachers learned about the city’s tax increment financing (TIF) program, a shadowy financing scheme controlled by the mayor that has been used to divert public funds from public institutions like schools and libraries to major corporations in the city. The teachers then knocked on educators’ doors across the city, teaching them about TIFs. Critical to the CTU’s success have been the centrality of rank-and-file members increasingly carrying out the union’s work and their organizing with parents for a mutually beneficial agenda. The former helped lead to 90 percent of all CTU members voting to strike and a city awash in red-shirted CTU educators during the strike; the latter helped lead to overwhelming numbers of public school parents and the Chicago population as a whole siding with the teachers during the strike rather than Mayor Emanuel.\nChicago is the birthplace of American teacher unionism — Local 1 of the American Federation of Teachers — as well as an historic home of rank-and-file teacher activism stretching back to the early twentieth century. The United Progressive Caucus (UPC) was a part of that history, formed as a combination of several racial justice caucuses by rank-and-file educators of color in the early 1970s. The UPC ran the union nearly uninterrupted from 1972 to 2010, leading the union through five strikes over the course of a decade and a half and winning sizable wage and benefit gains for CTU members — even at times when much of labor was losing ground — due to the leadership’s close collaboration with the city’s mayors. The caucus’s leadership eventually drifted towards narrower goals of improving pay and working conditions for teachers (without engaging significantly with parents and community groups) and a top-down style of governance. Taking up an agenda that could be beneficial to students and teachers was nowhere on the table. As with the rest of the American labor movement, the returns on that strategy eventually disappeared. Economic gains eroded as the city dug its heels in at the bargaining table in the 1990s, demanding concessions and changes that would weaken the union, while power (and pay) remained congealed at the union’s top. Similar stories could be found throughout the American labor movement in that era, but the CTU’s history of rank-and-file agitation and relatively open internal structures would lead to a successful challenge from liberal educators. In the 2001 union election, Chicago teachers, fed up with several poor contracts in a row, voted the Proactive Chicago Teachers (PACT) caucus into power, unseating UPC president Tom Reece. Debbie Lynch, an elementary school teacher and longtime UPC critic, ran on a platform of ending corruption within the union, increasing the union’s role in training teachers, and restoring bargaining rights over issues like class sizes that had been lost in the 1990s. PACT’s election brought a shift toward more liberal concerns, but the longtime top-down governing style, with the union’s power seen as coming from its shrewd leaders rather than engaged members, remained unchanged. Support for Lynch quickly waned after she, too, negotiated a concessionary contract: teachers ousted her after only one term, reelecting a UPC slate. As their power and compensation eroded, many Chicago teachers were angry with their union; like any angry electorate, they again tossed the bums out. But like Lynch and Reece, newly elected UPC president Marilyn Stewart also oversaw the negotiation of an unpopular contract in 2007. Membership again rebelled, with some members actually burning copies of the contract outside a press conference after, according to several accounts, Stewart asked for the “yeses” in a contract vote at a House of Delegates meeting, then ran out of the meeting before the “no” vote could be called to declare to reporters that a contract had been settled. Throughout this period, Chicago teachers expressed their anger by replacing and re-replacing union leaders. But none of the various leadership shifts changed the union’s engagement strategy toward members or the broader community. There was no bottom-up approach, centered on the members themselves and allied strongly with a citywide movement for educational justice. During the union’s leadership upheavals, Chicago had become a testing ground for free market education reform. CPS CEO Arne Duncan (now Secretary of Education under President Obama) and Mayor Richard M. Daley introduced Renaissance 2010, a 2004 program to shut down and “turn around” sixty to seventy schools deemed low-performing and under-utilized by firing the entire staff and converting the majority into charter schools. A small group of rank-and-file teachers began organizing against Renaissance 2010. Community groups in neighborhoods of color had been organizing against the closures and turnarounds, but the union would not. The leadership appeared resigned to the implementation of free market education reform, still unwilling to mount a fight but continuing to reap the benefits of elected office. Jackson Potter and Jesse Sharkey, history teachers at South and North Side high schools, respectively, took matters into their own hands, making presentations to teachers and community members about the plan, recruiting teachers to join them, and joining the community-led organizing already underway. They and a growing group of educators attended closure hearings and recruited parents and other teachers for the citywide movement against corporate reform. The teachers were a loose group hoping to push their leadership to take action, but through organizing alongside community groups, momentum began to build for the teachers to form a formal caucus to run in union elections. Community members were the first to encourage teacher activists to seriously consider running for office. The teachers’ deep connections to the organizing initiated by community groups would ultimately legitimize the union in the eyes of community members — they understood the teachers did not simply aim to take power for themselves, but wished to make the union’s agenda mutually beneficial for students and teachers alike. As the organization grew larger, union action against closings remained lackluster. At one point, CTU leadership publicly endorsed a plan designed by Toledo’s teachers union leadership to fire 10 percent of all teachers in the system — confirming to many that working within the existing leadership would get the activist teachers nowhere. Rather than confront free market education reformers, the union’s leadership had adopted much of the reformers’ rhetoric. The teachers pushed forward, now calling themselves the Caucus of Rank-and-File Educators. They held community forums on anti-public education attacks and continued working with community organizations. They held study groups on texts like Naomi Klein’s The Shock Doctrine , which one staffer described as “a light bulb going off” for teachers. At a nominating convention in August 2009, the caucus chose longtime chemistry teacher Karen Lewis as their presidential candidate. Shortly before the election, CORE organized a massive rally in downtown Chicago with thousands of teachers. Union leadership attempted to take credit, but teachers knew who had organized it. In the May 2010 union elections, CORE triumphed. Immediately after the news of the victory, president-elect Karen Lewis outlined her and her caucus’s vision of a unionism that would confront the forces of neoliberal education reform. “Corporate America sees K–12 public education as a $380 billion trust that, up until the last ten or fifteen years, they haven’t had a sizable piece of,” Lewis said. Referencing the CTU’s leaders, she said, “Our union . . . didn’t point out this simple reality: what drives school reform is a singular focus on profit. Not teaching, not learning — profit.” That profit motive would be directly confronted by the union: “This election shows the unity of 30,000 educators standing strong to put business in its place: out of our schools,” Lewis said.", "url": "https://www.jacobinmag.com/2014/03/uncommon-core-chicago-teachers-union/"}