{"authors": ["Johanna Brenner", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:10", "date_modify": "2020-05-04 19:51:10", "date_publish": "2014-09-17 00:00:00", "description": null, "filename": "2014_09__1588621870.html", "image_url": "https://images.jacobinmag.com/2014/09/17000457/Triece-Pic-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_09__1588621870.html", "title": "The Promise of Socialist Feminism", "title_page": "The Promise of Socialist Feminism", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In addition, the political discourses and organizing strategies of twenty-first century socialist feminism are a resource for a struggling left. People have a sense that the old forms of left politics will not do. In this search for alternatives, socialist feminism has much to offer.\nWhile neoliberalism extinguished the radical promise of the second wave, it has also created the material basis for the renewal and spread of socialist feminist movements led by working-class women — whether employed in the formal economy, the informal economy, in the country-side, or doing unwaged labor.\nIn the global north, this new regime was ushered in by employers’ assault on the working class, on the welfare state, and on the historic institutions of working-class defense — unions and social democratic parties. This assault brought about neoliberalism, the political context for the successful backlash against the radical demands of feminists, anti-racist activists, indigenous peoples, and others.\nI want to make a different argument: Liberal feminism’s partial incorporation into the neoliberal economic, political, cultural, and social order is better explained by the emergence of a regime of capital accumulation that has fundamentally restructured economies in both the global north and the global south.\nIt is undoubtedly important to understand how this occurred. But some recent explanations offered by feminist scholars point us in an unfortunate direction. These writers argue that second-wave feminism, with its overemphasis on legal rights and paid work as a route to equality, unwittingly paved the way for neoliberalism. It is comforting to think that radical feminists had this level of control over the outcome of our struggles. For, were it true, we could now correct our mistakes, change our ideas, and regain our revolutionary footing.\nDecades removed from the heady days of feminism’s “ second wave ” in the United States, it is distressing to acknowledge that the movement’s revolutionary moment is a dim memory, while key aspects of liberal feminism have been incorporated into the ruling-class agenda. Liberal feminist ideas have been mobilized to support a range of neoliberal initiatives, including austerity, imperial war, and structural adjustment.\nThe dominant feminist political discourse in the second wave was not classic-liberal feminism — that is, a feminism that wanted to clear away any impediments to women’s exercise of their individual rights — but rather what I would call social-welfare feminism. (Outside the US, where there were actual left parties and where socialist political discourses were more available to feminist activists, this politics could be called social-democratic feminism.)\nSocial-welfare feminists share liberal feminism’s commitment to individual rights and equal opportunity, but go much further. They look to an expansive and activist state to address the problems of working women, to ease the burden of the double day, to improve women’s and especially mothers’ position in the labor market, to provide public services that socialize the labor of care, and to expand social responsibility for care (e.g., through paid parenting leave and stipends for women who care for disabled family members).\nWomen in the affluent end of the professional/managerial class are the social base of classic-liberal feminism. Social welfare feminist politics finds its social base predominantly in the lower reaches of the professional managerial class and especially among women employed in education, social services, and health. Professional/managerial women of color are more likely to be employed in these industries than in the private sector. Female trade-union activists also played a significant part in leading and organizing social-welfare feminism.\nWe can generously characterize as ambivalent the relationships between working-class women/poor women and the middle-class professional women whose jobs it is to uplift and regulate those who come to be defined as problematic — the poor, the unhealthy, the culturally unfit, the sexually deviant, the ill-educated. These class tensions bleed into feminist politics, as middle-class feminist advocates claim to represent working-class women.\nThe way these class tensions get expressed is shaped considerably by other dimensions of class locations, such as race/ethnicity, sexuality, nationality, and ability. Crucially, the politics of middle-class feminists also shift depending on the levels of militancy, self-organization, and political strength of women in the working classes.\nA compelling instance of this dynamic can be seen in the first half of the 1970s. In the political context of the black struggle for economic justice, driven by the black working class and the welfare rights movement — the Civil Rights Movement’s working-class feminist leading edge — social-welfare feminists took up a visionary and broad-based program of expanding state support for caring labor.\nFor example, in 1971, a coalition of feminist and civil rights organizations won legislation that would have established day care as a federally funded developmental service available to every child who needed it. Although feminists undoubtedly saw this act as crucial to mothers’ employment, they did not limit the benefit only to mothers working for pay. The program included provisions for medical, nutritional, and educational services for children from infancy to fourteen years of age. Services were to be on a sliding fee scale. President Nixon vetoed the bill, but organizing around it continued throughout the 1970s.\nThe National Welfare Rights Organization (NWRO) pushed and informed the politics of social-welfare feminism. What is most interesting about the NWRO is its ability to combine claims that philosophers, lawyers, and academics tend to see as competing. In short, they broke down the distinction between “needs talk” and “rights talk.”\nMaternalist political discourses are quintessential examples of “needs talk.” Here, advocates make claims based on children’s needs and mothers’ unique capacity to fulfill those needs. On the other hand, the demand for gender-blind employment practices or equal access to professional schooling is quintessential “rights talk,” insisting on the extension of individual rights to women that are already granted to men.\nThe NWRO argued for a guaranteed, unconditional minimum income for single mothers. Poor women should have choices about how they parented and asserted that they, themselves, were the only appropriate authorities to establish their children’s needs. They should receive economic support and social services whether they were stay-at-home mothers or working parents.\nThe welfare-rights activists also critiqued the war on poverty employment programs for channeling single mothers into training for traditionally female, low-paid, pink-collar jobs. Finally, they linked their demand that motherhood be recognized as valuable work to women’s economic autonomy and their right to self-determination.\nThis “both/and” politics was also reflected in women of color’s challenge to the pro-choice movement. Where the radical and liberal wings of the feminist movement focused on women’s rights to bodily autonomy ― and the right to refuse motherhood ― poor women of color were facing a very different assault: forced sterilization in the public hospitals where they gave birth. Furthermore, the welfare rights movement was organizing poor women, and especially black women, to challenge the denigration of their motherhood and the stigmatization of their sexuality.\nIncorporating the ideas of working-class women of color activists, socialist feminists articulated a politics of reproductive rights that reached beyond the language of choice. Reproductive rights included the right to be mothers and to raise children in dignity and health, in safe neighborhoods, with adequate income and shelter.\nThis panoply of reproductive rights constitutes a program of non-reformist reforms. Some of these demands can be fought for and won under capitalism — for example, the outlawing of racist sterilization or discrimination against lesbian mothers — but wholesale adoption would be incompatible with capitalism. In this respect, the political discourse of reproductive rights links feminism to anti-capitalist politics.\nAt its height, second-wave feminism argued for socializing the labor of care. Shifting care from an individual to a social responsibility required then and requires today a redistribution of wealth from capital to labor.\nSocial responsibility for care depends on the expansion of public goods, which in turn depends on taxing wealth or profits. Compensating workers for time spent in caregiving (e.g., paid parenting leave) expands paid compensation at the expense of profits. In addition, requiring (either by regulation or by contract) that workplaces accommodate and subsidize employees’ caregiving outside of work interferes with employers’ control over the workplace and tends to be resisted in the private sector, where jobs continue to be organized as if workers have very little responsibility for care.\nIn other words, socializing the labor of care required confronting capitalist class power. It was here that twentieth century social-welfare feminism foundered.\nConfronting capitalist class power called for a broad, militant, disruptive social movement ― an anti-capitalist front linking feminism, anti-racism, gay rights, and immigrant rights to trade unions and workers’ struggles. What existed instead were bureaucratic, sclerotic, sectoralist trade unions that had neither the interest in nor capacity for building movements of any kind.\nAt the very moment when social-welfare feminism was at its strongest, in the 1970s, the tsunami of capitalist restructuring arrived, inaugurating a new era of assault on a working class that had little means of defending itself. As people scrambled to survive in this new world order, as collective capacities and solidarities moved out of reach, as competition and insecurity ratcheted up, as individualistic survival projects became the order of the day, the door was opened for neoliberal political ideas to gain hegemony.\nCaught between a demobilized working class and a Democratic party overtaken by neoliberalism, middle-class social welfare feminists began to accommodate to the existing political realities. For example, leaving behind the “both/and” politics of the NWRO, middle-class advocates moved away from the maternalist discourses ― “young children need to be with their mothers” ― that, however problematic, had been part of their defense of income support to single mothers.\nAnd they adopted neoliberal discourses in the face of bipartisan charges that the welfare state encouraged dependency. They embraced the idea of self-sufficiency through paid work, even though it was quite obvious that the low-paid precarious jobs open to so many single mothers would never pay a living wage, that the childcare stipends provided (to the poorest women) were inadequate for quality childcare, and that after-school programs for older children were unaffordable.\nIn other words, second-wave social welfare feminism was not so much co-opted as it was politically marginalized. And in the context of that defeat, not surprisingly, liberal feminist politics not only moved center stage but became incorporated into an increasingly hegemonic neoliberal regime.\nIronically, as middle-class advocates moved rightward, working-class feminists, especially in unions with large or majority women members, were making substantial gains. They increased women’s representation in leadership, pushed their unions to support political mobilizations defending legalized abortion (for instance, the Coalition of Labor Union Women’s “pro-union, pro-choice” campaign), opposed discrimination against LGBT people, and placed demands like comparable worth and paid parental leave on the bargaining agenda. However, these latter gains rang hollow as unions swiftly lost ground, including at the negotiating table.\nThe preceding history is instructive. Feminism and other movements against oppression must be cross-class movements, so they must also pose the question, “who will have hegemony within these movements?” Whose worldviews will determine what the movement demands, how those demands are articulated and justified, and how the movement itself is organized?\nIn the ordinary course of events, the answer to these questions is the middle class. Yet, as in the moment of the second wave’s radicalization, when working-class people walk onto the political stage, the power relations within social movements can shift.", "url": "https://www.jacobinmag.com/2014/09/the-promise-of-socialist-feminism/"}