{"authors": ["Rob Hunter", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:50", "date_modify": "2020-05-04 19:54:50", "date_publish": "2014-08-16 00:00:00", "description": null, "filename": "2014_08_abolish-the-states_1588622090.html", "image_url": "https://images.jacobinmag.com/2014/08/16235914/3b35947r-e1473004150121.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_08_abolish-the-states_1588622090.html", "title": "Abolish the States", "title_page": "Abolish the States", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "It’s easy to mock someone like Draper, but any laughter aimed at Six Californias is ultimately misplaced. In reality, Americans have been living under a variant of Draper plan’s for over two centuries: a federal system that distributes political power between a national government and regional governments claiming the status of “states.”\nSix Californias has steadily attracted media attention that mixes bemusement with amusement . Stephen Colbert, whose celebrity is founded on his liberal fans’ enthusiasm for chortling at conservatism, recently lampooned the proposal before confronting Draper in front of his studio audience.\nSome of the elite are on a quest to create two, three, many Californias. At least that’s at the heart of a proposal sponsored by billionaire venture capitalist Tim Draper to abolish California and replace it with six smaller states . Draper claims this breakup would reduce waste and inefficiency. Barring any procedural or legal challenges that may come its way, the proposal will appear on the ballot in California in 2016.\nThe belief that sovereignty can and should be divided between a national government and regional governments is a mainstay of the American political tradition. As recently as last year, when the Supreme Court eviscerated the federal preclearance requirements in the Voting Rights Act of 1965, Chief Justice John Roberts raised eyebrows by asserting that the federal government and the states enjoy “equal sovereignty.”\nAt first glance, the phrase may seem incompatible with the broad pattern of American political development after the Civil War. In the postbellum period, modern administrative forms took hold, and the idea that public power should be exercised in the pursuit of social goods gained currency; the federal government is usually seen as exercising far more power today than in the past. However, Roberts’s statement exposed a deeper and more persistent pattern, in which federalism continues to fracture popular sovereignty, and thus democratic action itself.\nFederalism multiplies the loci of power that must be captured by popular movements seeking to transform the capitalist state, or even just win some advances within it. It obscures and diminishes the responsibility and accountability of public officials for crafting and enforcing policy. It provides local elites powerful means for dominating minorities, for crushing labor organization, and for restricting mass access to public institutions and social goods.\nRoberts was not wrong to suggest that state governments retain considerable power at the expense of national political institutions. He was participating in American federalism’s long tradition of strangling popular sovereignty and democratic equality in the knots of competing and multiple state jurisdictions.\nAbraham Lincoln bore witness to this tradition when he observed that, under the federal system set out in the Constitution, a slave was not only held in bondage by physical fetters, but was also a prisoner in the institutional dungeons constructed by the framers. In the wake of Dred Scott v. Sandford , Lincoln asked Americans to consider the fate of a slave in the custody of federalist jailers:\nThey have him in his prison house; they have searched his person, and left no prying instrument with him. One after another they have closed the heavy iron doors upon him, and now they have him, as it were, bolted in with a lock of a hundred keys, which can never be unlocked without the concurrence of every key; the keys in the hands of a hundred different men, and they scattered to a hundred different and distant places; and they stand musing as to what invention, in all the dominions of mind and matter, can be produced to make the impossibility of his escape more complete than it is.\nThe division of political power into a multiplicity of states is not simply an ignoble legacy from the early history of the republic, when the framers of the Constitution successfully advanced the idea that sectional solidarity among ruling classes should trump any notions of equality among democratic citizens. The inter-elite compromises which elevated the individual colonies to something resembling the status of sovereign states, and which hobbled early attempts to build a central government, remain consequential for American politics today. Federalism frequently thwarts forms of political participation and action that might challenge the nation’s configuration of power.\nAnd yet, conservatives and liberals alike are often quick to praise the system as a freedom-enhancing feature of the American constitutional order. For many conservatives, it promotes “subsidiarity” — the doctrine that political power should be localized and geographically dispersed, the better to protect the liberty of individuals (particularly owners of businesses and heads of families).\nFor many liberals, dividing the country makes states into “laboratories of democracy,” and fosters a scattering of political boltholes in which their desired political goods — such as higher minimum wages and heightened restrictions on gun ownership — may be enjoyed in tranquility. But subsidiarity is merely a fancy word for dragging political questions out of the public sphere and into the domain of private power; and history has shown how those little “laboratories of democracy” are just as likely to be run by mad scientists as they are by benevolent researchers.\nThe autonomy of the states does not secure freedom or equality. It is true that residents of Washington State enjoy relatively high minimum wages and gay couples in Maryland enjoy the freedom to marry. However, these are poor substitutes for the nationwide policies and protections that could have been obtained by democratic coalitions that, in the absence of federalism, would have been free to confront a single set of national institutions and demand comprehensive political change.\nInstead, progressive social movements are frequently distracted and bogged down by a morass of different political and institutional contexts across the fifty states. The cession of “numerous and indefinite” powers to the states has not aided democratic movements but hindered them.\nThe federal form of the American polity has consistently worked to the advantage of capital, local elites, and members of privileged groups. It was the basis for the invocation of “states’ rights” as a pseudo-democratic defense of chattel slavery. It was an ideological touchstone for reactionary resistance to Radical Reconstruction. The attempt by Radical Republicans to impose central authority on the South, in the name of emancipation and equal citizenship, could have served as the foundation for a later turn toward social democracy in the United States.\nInstead, as Richard Bensel points out, many segments of Northern capital depended on Southern cotton production, which was threatened by Radical Reconstruction; and the less progressive segments of the Republican Party eventually found it preferable to retreat from the imposition of strong central power on the South in favor of a laissez-faire approach that returned substantial autonomy to the region.\nThe bulk of the Northern political elite, including many Republicans, ultimately balked at what Reconstruction in the South presaged for the rest of the country: not simply increased regulation but a state apparatus empowered to enforce it, along with the unacceptable limits to capital accumulation that that portended. Radical Reconstruction — the institutionalization of the Civil War’s revolutionary changes in the areas of regulation, welfare provision, and the development of public power — foundered on the shoals of federalism when capital found it preferable to allow the South to, in many ways, return its pre-war status quo.\nThroughout the country, “competitive federalism,” as the political scientist David Brian Robertson has labeled it, compelled state governments to outdo one another in resisting labor agitation for improved working conditions and reduced hours, out of the fear of capital flight and underinvestment. Federalism also obstructed the advance of civil rights for decades. Recalcitrant Southern states were able to check the expansion of national power — which alone could adequately enforce meaningful racial equality — through procedural chicanery in the Senate and state-level legislation and rulemaking.\nToday, federalism continues to frustrate the elaboration of policies promoting sexual and gender equality. Through the device of geographic — rather than population-based — representation in the Senate, it substantially dilutes the voice and voting power of the majority of Americans who live in urban and metropolitan areas in favor of those living in rural areas. And through Article V of the Constitution, it empowers a small minority of the national population to halt attempts to make meaningful structural changes via constitutional amendment.\nFederalism is also one of the culprits in a recurring whodunit in comparative politics: why did the United States — unlike so many European countries — never have a powerful and independent movement on behalf of social democracy, let alone socialism?\nAlthough the United States certainly had its share of labor agitators and organizers during the nineteenth century, they were unable to win the same tangible benefits — in the form of substantial labor protections and institutionalized welfare states — that European labor and socialist parties managed to achieve. The comparatively centralized decision-making apparatus of many European states made the task of demanding, drafting, and enforcing labor-friendly policy far easier than it was in the United States.\nA fondness for federalism is not a reactionary tic. It is fully consistent with those conceptions of liberalism — retailed by libertarians and left-neoliberals in particular — that prize the “Eden of the innate rights of man — the realm of Freedom, Equality, Property, and Bentham.” Too frequently we see that such an Eden is an otherworldly paradise of formalities, lacking genuine political commitments and the will to maintain them. The Left, by contrast, cherishes the substantive freedoms that enable individuals to pursue their chosen life projects, and to participate in their own communities and traditions, without having to worry about expending their minds and bodies for the sake of others’ accumulation of capital.\nBut such freedoms are far removed from the formal (and insubstantial) freedoms more commonly on offer today: the nihilistic freedom of participation in markets that are themselves free from regulations or limitations; the enforced freedom to sell one’s labor in order to survive in a fully commodified social environment; the lonely freedom from any bonds of solidarity and fellow-feeling that might generate social consciousness, political activity, or hope.\nThese latter conceptions of freedom dwell comfortably in what Corey Robin calls the American tradition of “democratic feudalism,” a decidedly inegalitarian vision of the social order in which only a substantial minority of the population is free — free, that is, from any censure or restraint by an active state that is popularly authorized to enforce social equality.\nFederalism is the institutional foundation of democratic feudalism. By impeding the development of strong central public institutions, it has made possible patterns of social domination in which bosses controlled workers, husbands controlled wives, and whites controlled nonwhites. The federal system is designed to place political power within closer reach of local elites and power brokers. In doing so it buttresses hierarchical and uneven power relations, and it hinders the articulation and execution of democratic political projects.\nThe persistence of American federalism does not spell doom for the Left, but it does necessitate a certain approach to crafting political strategy. Seizing sovereignty will never again be so easy as confining a lone monarch in the Tuileries.\nAmerican federalism is a hydra. No individual can subdue it; certainly no PAC or Netroots organization can wring all of its necks. Decentralized sovereignty can evade and elude popular pressure and demands far more easily than an absolute monarch ever could. Horizontal models of organization, visions of politics that privilege spontaneous and unfocused participation, direct action untethered to concrete goals — none of these can extract concessions from federalized power.\nNor will a single-minded focus on electoral politics pay off. One of the signal contradictions of American federalism is that the only office with something resembling a national constituency is the presidency. Like other national institutions, it is usually hostile to radical social projects. What’s more, thanks to our convoluted and — not coincidentally — federalized electoral system, it is utterly beyond the reach of even the most anodyne progressive candidate.\nCongressional offices are equally beyond the Left’s reach at the moment, and even encouraging local victories — such as the election of Kshama Sawant to Seattle City Council — are insufficient. The tasks of building a “radical civil society” and of increasing the capacity of social movements to bring pressure on existing institutions acquire even more urgency in the shadow of federalism.\nCentralized state power generates its own contradictions, of course, and many of them are dangerous. Post-Thermidor, Paris became an imperial metropole, hardly distinguishable from Versailles in its extractive appetites. Nor were the enlightened despots of eighteenth- and nineteenth-century Europe paragons of radical democracy simply because they sought to rationalize and centralize the states they ruled.\nBut too many on the Left draw from such episodes the unwarranted conclusion that public power can never be responsibly or justifiably exercised. A refusal to contemplate possessing and wielding institutional authority only enhances federalism’s ability to frustrate socially emancipatory projects. Embracing a critique of federalism does not entail the blanket endorsement of coercive state power.\nAs for Tim Draper’s Six Californias? By all means, let’s get rid of the state of California. But let’s also get rid of Vermont and Virginia. Let’s discard the arbitrary distinctions that disenfranchise D.C. residents, Puerto Ricans, and the residents of overseas territories. We could also do without the geographical disparities in funding and resource allocation that attend the federalization of the country, and the segmentation of the United States into richer and poorer regions.\nThere can be no economic justice in this country when high minimum wages and less restrictive regimes of social provision are luxuries enjoyed only by the residents of states like Oregon and Vermont, and not by workers in Tennessee and South Carolina. And few measures would do more to diminish waste than the elimination of fifty unnecessary provincial governments.\nWe should efface the internal barriers and boundaries comprising federalism, not in order to form “a more perfect union,” but in order to build the institutions and practices that will secure real freedom. We need a unitary and uniformly administered state, with a universal franchise, direct citizen access to national institutions unmediated by regional or local interference, and strictly equitable patterns of democratic representation based solely on population.\nIt’s time to truly unite the states, by smashing them first.", "url": "https://www.jacobinmag.com/2014/08/abolish-the-states"}