{"authors": ["Keeanga-Yamahtta Taylor", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:36", "date_modify": "2020-05-04 19:50:36", "date_publish": "2014-11-17 00:00:00", "description": null, "filename": "2014_11__1588621836.html", "image_url": "https://images.jacobinmag.com/2014/11/17001706/14978144321_c9222e44db_k-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_11__1588621836.html", "title": "Organizing Fergusons", "title_page": "Organizing Fergusons", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Ferguson Police officer Darren Wilson spent more than one hundred days in hiding while a grand jury decided whether or not to indict him on any charge related to the killing of black teenager Mike Brown. After a long and blustering speech in defense of the indefensible, Prosecuting Attorney Robert McCulloch announced Monday there would be no indictment.\nThe decision not to indict wasn’t surprising, but its predictability did very little to disperse the anger and frustration that has become part of the ritual of grieving the loss of another young African American at the hands of American law enforcement. There can be no question that black life is both cheap and expendable in the eyes of law enforcement and the criminal justice system of which it is a part.\nAnd yet there is a stubborn refusal to have this conversation as the starting point for any meaningful change in the practice of law enforcement in this country. Instead, the mainstream media and even the president remain almost singularly focused on the potential of violence among anti-police brutality activists, particularly in Ferguson, Missouri.\nOver the last several weeks, law enforcement and the media worked in tandem to whip up hysteria about violent demonstrations in the aftermath of the predictable decision not to indict.\nFor months, one thousand officers around St. Louis were preparing for these demonstrations. The FBI released a memo to local law enforcement agencies warning of “outside agitators” and violent Ferguson solidarity protests. The Boston Public Schools even did robocalls calling for “peaceful” demonstrations in the aftermath of a grand jury decision. In the media coverage of the reaction to the decision, reporters donned gas masks, trained their cameras on burning objects, and integrated themselves and their personal safety into the evening’s news.\nBut in all of the hysterical reporting about violent demonstrations, there was almost no discussion about what would prompt such an angry reaction to a grand jury decision. There was no discussion about the police violence, harassment, and yes, terrorism that pervades black and brown communities in every city and state in this country.\nInstead, President Barack Obama offered the hollow observation, “We have made enormous progress in race relations over the course of the past several decades.” That progress is decidedly difficult to measure given the persistence of police murders of African Americans.\nJust in the days prior to the grand jury decision, police in Cleveland killed an unarmed African-American woman, Tanisha Anderson, by smashing her head into the concrete. Then, 12-year-old Tamir Rice, also of Cleveland, was shot in the stomach twice by white cops and killed. He was holding an air pellet gun on a playground. African-American Akai Gurley was murdered by New York City cops when he entered the stairwell of a public housing complex.\nThese cases only scratch the surface of the scope of racist policing in the US, but it is the subject of almost no discussion outside of radical circles.\nWhite cops are twenty-one times more likely to shoot a black man than a white man. And more African-American police will not help. Black cops are involved in only 10 percent of police shootings, but 78 percent of the victims they shoot are African American.\nThe FBI calculated that from 2007 to 2012, white police killed at least two black men each week — roughly five hundred deaths in all. To put this in perspective, consider that in the five years prior to the introduction of federal anti-lynching legislation in 1922, there were 284 lynchings of African Americans. The epidemic of racism is raging through every institution connected to the American criminal justice system.\nPolice violence is only one aspect of a generally racist criminal justice system that feeds off the bodies of black people. Enormous numbers of African Americans have been victimized by the “war on drugs” that has resulted in the literal criminalization of African American communities. To take only one statistic illustrating the disparities, African Americans are 13 percent of drug users — roughly the same as their proportion in the population as a whole — but are 46 percent of those convicted for drug offenses.\nThe foot soldiers in the war on drugs are the cops on the beat, who target black communities to make the easy arrests increasingly demanded by municipal officials, who crave them as proof that they are fighting crime. And there is the other motive — in Ferguson, municipal court fines, mainly from vehicle violations, are the second largest source of income for the city.\nReading Darren Wilson’s testimony describing Mike Brown in the released grand jury transcripts, one can glean how entrenched police racism is.\nIt is, in fact, the racist dehumanization of Brown that holds Wilson’s story together. The only way to believe Darren Wilson is to suspend belief in Brown’s humanity, his literal humanness. In Wilson’s testimony, Brown becomes a wild animal — or a “demon,” as the officer refers to Brown — who tossed Wilson around like a rag doll, “grunted aggressively,” was impervious to gunshot wounds, and only stopped when he was shot in the head.\nThe universality of police racism has prompted thousands of people across the country to organize and attend rallies in solidarity with Mike Brown, his family, and Ferguson. There is a recognition that we owe a tremendous debt to the people of Ferguson, who have refused to stop organizing and kept the campaign against this injustice alive. In doing so, they have given new life to a growing movement against racist policing and the criminal injustice system.\nThe movement in Ferguson has built on a movement that has roots in the organizing to stop the execution of black death row prisoner Troy Davis in Georgia in the fall of 2011. It certainly grows out of the activism that helped get George Zimmerman arrested for the murder of Trayvon Martin, and that re-emerged after Zimmerman was acquitted.\nThe movement is represented by a core of young organizers from a variety of groups, including Hands Up United, Organization for Black Struggle, We Charge Genocide, Black Lives Matter, Don’t Shoot Coalition, Millennial Activists United, Black Youth Project, and beyond.\nThrough activism, this layer of developing leaders has helped to clarify that the much-discussed “divide” in black America is about politics much more than simply generation.\nIt will be lost on few people that the same mainstream black leaders, who earlier in November were lecturing African Americans about turning out to vote for Democratic candidates who have had precious little to say about the issues impacting black communities, now have little to say themselves about how to respond to Ferguson.\nNot only did no prominent black elected official come out against the mobilization of the National Guard and obvious attempts to intimidate protestors in Ferguson, but very few called for concrete policies aimed at reigning in racist policing in black communities.\nOf course, to do so would call into question many other practices in black communities right now. Racist policing isn’t happening in a vacuum — it has to be seen, at least in part, as the flip side of the economic gutting of those communities.\nThe local, state, and federal governments have slowly eroded black neighborhoods by shuttering public schools and public housing, closing public clinics and hospitals, and slashing funding for social programs. They have stood by while the foreclosure crisis gave way to an eviction crisis.\nThey advocated the destruction of public-sector jobs that have been a source of middle-level incomes for African Americans, and instead championed low-wage underemployment. Plus, the mass incarceration of hundreds of thousands of black men and women has left them unable to participate in the job market — or if so, only at its margins.\nAll told, these factors combine to make black communities vulnerable to policing that has already criminalized and impoverished African Americans. These policing practices have, in effect, become a form of public policy, which complicates what politicians suggest as remedies. In fact, they have very few remedies to offer beyond studies, investigations, and vague calls for justice.\nBut there are very clear demands our movement can put on the table to increase the pressure on equivocating political leaders who support law enforcement and subscribe to the idea that the problem is a “few bad apples,” rather than policing being systemically racist.\nWe should demand civilian review boards that reflect the composition of the communities where police are accused of wrongdoing. We can demand a federal law against racial profiling. We can demand that police accused of abuse and murder actually be arrested and put through a legal process, as any other person would be subjected to. Finally — and this is by no means an exhaustive list — we should demand that police forces across the country be disarmed.\nThere is an epidemic of police shooting unarmed African Americans, and it is intensifying. In Utah, police are responsible for a shocking 15 percent of all homicides in the state. The Ferguson grand jury decision to not indict Darren Wilson will give cover to police across the country to continue killing unarmed African Americans — unless we take the guns out of their hands.\nThe murder of Mike Brown has created a new urgency to build this movement. It’s clear that nothing other than a mass movement can stop the senseless murder of young African Americans at the hands of American police.", "url": "https://www.jacobinmag.com/2014/11/organizing-fergusons/"}