{"authors": ["Avi Asher-Schapiro", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Florian Wilde"], "date_download": "2020-05-04 19:54:30", "date_modify": "2020-05-04 19:54:30", "date_publish": "2014-09-17 00:00:00", "description": null, "filename": "2014_09__1588622070.html", "image_url": "https://images.jacobinmag.com/2014/09/17000500/4508568871_2ebb29be97_o-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_09__1588622070.html", "title": "Against Sharing", "title_page": "Against Sharing", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Kazi drives a Toyota Prius for Uber in Los Angeles. He hates it. He barely makes minimum wage, and his back hurts after long shifts. But every time a passenger asks what it’s like working for Uber, he lies: “It’s like owning my own business; I love it.”\nKazi lies because his job depends on it. After passengers finish a ride, Uber asks them to rate their driver on a scale from one to five stars. Drivers with an average below 4.7 can be deactivated — tech-speak for fired.\nGabriele Lopez, an LA Uber driver, also lies. “We just sit there and smile, and tell everyone that the job’s awesome, because that’s what they want to hear,” said Lopez, who’s been driving for UberX, the company’s low-end car service, since it launched last summer.\nIn fact, if you ask Uber drivers off the clock what they think of the company, it often gets ugly fast. “Uber’s like an exploiting pimp,” said Arman, an Uber driver in LA who asked me to withhold his last name out of fear of retribution. “Uber takes 20 percent of my earnings, and they treat me like shit — they cut prices whenever they want. They can deactivate me whenever they feel like it, and if I complain, they tell me to fuck off.”\nIn LA, San Francisco, Seattle, and New York, tension between drivers and management has bubbled over in recent months. And even though Uber’s business model discourages collective action (each worker is technically in competition with each other), some drivers are banding together.\nUber drivers in LA, the largest ride-sharing market in the country, held dozens of protests over the summer to oppose rate cuts. Late last month, drivers working with Teamsters Local 986 launched the California App-based Drivers Association (CADA), a sort of Uber drivers union. Uber workers in Seattle have staged their own protests and have formed the Seattle Ride-Share Drivers Association. Just last week in New York City, drivers for the luxury UberBlack service threatened to strike and successfully reversed a company decision that would have forced them to pick up cheaper and less lucrative UberX rides. On Monday, drivers protested again.\n“We want the company to understand that we are not just ants,” Joseph DeWolf, a member of CADA’s leadership council, told me at the Teamsters Union hall in El Monte, California. “What we want is a living wage, an open channel of communication with the company, and basic respect.” DeWolf said CADA is signing up members, collecting dues, and plans to strike in LA if Uber refuses to come to the negotiating table.\nIt won’t be easy. Drivers are going up against a burgeoning goliath valued at around $18 billion. The company just hired David Plouffe, who managed Barack Obama’s presidential campaigns; it’s active in 130 cities; and if company executives are to be believed, it doubles its revenue every six months.\nUber makes that money by relying on a network of thousands of drivers who are not technically employees of the company, but rather independent contractors — the company calls them “driver-partners” — who receive a percentage of its fares.\nFrom the very beginning, Uber attracted drivers with a bait-and-switch. Take the company’s launch in LA: In May 2013, Uber charged customers a fare of $2.75 per mile (with an additional 60¢ per minute under eleven mph). Drivers got to keep 80 percent of the fare. Working full time, drivers could make a living wage: between $15 and $20 an hour.\nDrivers rushed to sign up, and thousands leased and bought cars just to work for Uber — especially immigrants and low-income people desperate for a well-paying job in a terrible economy. But over the last year, the company has faced stiff competition from its arch-rival, Lyft. To raise demand and push Lyft out of the LA market, Uber has cut UberX fares nearly in half: to $1.10 per mile, plus 21¢ a minute.\nUber drivers have no say in the pricing, yet they must carry their own insurance and foot the bill for gas and repairs — a cost of 56¢ per mile, according to IRS estimates. With Uber’s new pricing model, drivers are forced to work under razor-thin margins. Arman, for instance, made about $20 an hour just a year ago. And now? Some days he doesn’t even break minimum wage.\nHis experience is quite common among LA Uber drivers I spoke to. For many, driving for Uber has become a nightmare. Arman often works up to seventeen hours a day to bring home what he used to make in an eight-hour shift. When he emailed Uber to complain about his plummeting pay, he said the company blew him off. Uber’s attitude is that drivers are free to stop working if they are dissatisfied, but for drivers like Arman who’ve invested serious money in their cars, quitting isn’t an option.\n“These drivers are very vulnerable if they do not band together.” Dan McKibbin, the Teamsters’ West Coast organizer, told me. “Right now they have no one to protect them.”\nThe company wouldn’t speak to me about CADA, the Teamsters, or how it deals with driver grievances. But it seems to brush off everyone else too. Earlier this summer, when CADA leader DeWolf met with William Barnes, Uber’s LA director, Barnes allegedly laughed in his face.\nAs DeWolf recounted, when he told Barnes that drivers planned to organize with the Teamsters, Barnes responded, “Uber would never negotiate with any group that claims to represent drivers.”\nUber repeatedly ignored my request for comment on this exchange. Instead, the company issued a statement accusing the Teamsters of trying to “line their coffers” with new Uber-driving members.\nUber claims there’s no need for a union; it instead asks drivers to trust that the company acts in their best interest. Uber refused to show me complete data detailing average hourly compensation for drivers. It does claim, however, that UberX drivers are making more money now than before this summer’s price cuts.\n“The average fares per hour for a Los Angeles UberX driver-partner in the last four weeks were 21.4% higher than the December 2013 weekly average,” Uber spokesperson Eva Behrend told me. “And drivers on average have seen fares per hour increase 28% from where they were in May of this year.”\nI couldn’t find a single driver who is making more money with the lower rates.\nWhat’s clear is that for Uber drivers to get by, they’re going to have to take on more rides per shift. Uber implicitly concedes as much: “With price cuts, trips per hour for partner-drivers have increased with higher demand,” Behrend said.\nSo while drivers make less per fare, Uber suggests they recoup losses by just driving more miles. That may make sense for an Uber analyst crunching the numbers in Silicon Valley, but for drivers, more miles means hustling to cram as many runs into a shift as possible to make the small margins worthwhile.\n“These days, I won’t even stop to take a shit, I just drive — sometimes for up to fifteen hours a day,” a driver named Dan told me after pulling an all-nighter bringing drunk people home from bars. “It’s humiliating.”\nLower rates also means they pay more out of their own pockets for gas, and their cars depreciate in value faster because they’re driving extra miles.\nMeanwhile, Uber acts as if it’s doing drivers a favor by offering them work in the first place. Uber CEO Travis Kalanick, who loves giving inspirational talks about innovation, often claims that Uber helps people “become small business owners.” But working long shifts and forking over 20 percent of fares to a group of Silicon Valley app-engineers doesn’t really count as owning a small business.\n“They think we are a bunch of losers who can’t find better jobs,” DeWolf said. “That’s why they treat us like robots — like we are replaceable.”\nUber, of course, disputes this characterization. “Uber succeeds when our partner-drivers succeed,” Behrend said.\nBut that is just empty spin: drivers aren’t partners — they are laborers exploited by their company. They have no say in business decisions and can be fired at any time. Instead of paying its employees a wage, Uber just pockets a portion of their earnings. Drivers take all the risks and front all the costs — the car, the gas, the insurance — yet it is executives and investors who get rich.\nUber is part of a new wave of corporations that make up what’s called the “sharing economy.” The premise is seductive in its simplicity: people have skills, and customers want services. Silicon Valley plays matchmaker, churning out apps that pair workers with work. Now, anyone can rent out an apartment with AirBnB, become a cabbie through Uber, or clean houses using Homejoy.\nBut under the guise of innovation and progress, companies are stripping away worker protections, pushing down wages, and flouting government regulations. At its core, the sharing economy is a scheme to shift risk from companies to workers, discourage labor organizing, and ensure that capitalists can reap huge profits with low fixed costs.\nThere’s nothing innovative or new about this business model. Uber is just capitalism, in its most naked form.", "url": "https://www.jacobinmag.com/2014/09/against-sharing/"}