{"authors": ["Chris Maisano", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:31", "date_modify": "2020-05-04 19:54:31", "date_publish": "2014-07-16 00:00:00", "description": null, "filename": "2013_08__1588622071.html", "image_url": "https://images.jacobinmag.com/2014/07/16235524/image-19500-panoV9free-cahp-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_08__1588622071.html", "title": "Social Democracy for Our Time", "title_page": "Social Democracy for Our Time", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "To those liberals still hoping for a left turn in economic policy during Obama’s second term (bless their souls), reading last weekend’s New York Times interview with the President must have seemed like a vindication of the faith. Just name-dropping “Bob” Putnam’s Bowling Alone , that urtext of Clintonian Third Way liberalism, probably would have been enough to send the hearts of highly educated liberals aflutter. But there was more. Obama gestured toward the findings of a major recent study documenting the decline of social mobility in the United States. He looked back nostalgically to the postwar Golden Age, that sacred time when even the lowliest working stiff had a fair shake at achieving the American Dream. And he invoked the memory of the March on Washington for Jobs and Freedom by talking up his framed original copy of the day’s program. By harkening back to an era when Rustin and Reuther, King and Keyserling, Harrington and Humphrey could still march arm-in-arm toward an American version of social democracy, Obama sought to spark hopes that such a dream (or some rough facsimile of it) remains within reach in our own time. Most people on the Left today are apt to dismiss social democracy as the fading echo of a bygone age, a brief and exceptional period in the history of global capitalism that is never to return. Lane Kenworthy, a sociologist and political scientist at the University of Arizona, is not one of them. In recent months Kenworthy has lectured on, blogged about, and even written a book dedicated to the proposition that the establishment of social democracy in twenty-first century America is not just possible, but imminent. Kenworthy argues that there is a progressive logic embedded in the current trajectory of US social policy that will hasten the coming of American social democracy. Of course, the pressures generated by demographic changes — particularly the aging and retirement of the Baby Boomers — will force the government to increase expenditures on federal programs like Medicare and Social Security. But more importantly, a growing awareness of the manifest inadequacy of the American welfare state in dealing with a broad range of socioeconomic problems will push the nation’s leaders to take remedial action. As Kenworthy puts it: Policy makers, drawing on reason and evidence and perhaps with a push from organized interest groups or the populace, will recognize the benefits of a larger government role in pursuing economic security, opportunity, and rising living standards and will attempt to move the country in that direction. Often they will fail. But sometimes they’ll succeed. Progress will be incremental, coming in fits and starts. But it will have staying power. New programs and expansions of existing ones will tend to persist, because programs that work well become popular and because our policy making process makes it difficult for opponents of social programs to remove them. Small steps and the occasional big leap, coupled with limited backsliding, will have the cumulative effect of significantly increasing the breadth and generosity of government social programs. At the end of that protracted and discontinuous process (one that Kenworthy projects will take roughly fifty years), capitalism in the United States will come to resemble the “cuddly” variety practiced in the Nordic countries rather than the “cutthroat” version that prevails here today.\nPoints of Agreement Before moving on to the critique, it’s worth recognizing what Kenworthy gets right. First is his argument that progressive social policies should be delivered by government instead of institutions in the private sector or in civil society. Routing benefits through government (particularly the federal government) would be more universal and yield more powerful social outcomes than channeling benefits through families, trade unions and collective bargaining, and community-based organizations. As Kenworthy notes, all of these institutions are in decline and are too narrowly focused to serve the needs and interests of the broad masses of working and poor people. Second, he reminds us that as a strictly technical matter it would be quite easy for government to raise the roughly 10 percent of GDP it would require to dramatically expand the US welfare state. Perhaps controversially, he relies on the imposition of a national consumption tax to do much of the heavy lifting in this regard. Most on the Left have tended to oppose a national consumption tax as a regressive tax whose impact falls disproportionately on workers. No doubt, it is regressive — but I don’t think it’s possible to fund a robust welfare state without it. As Kenworthy notes, the biggest problem with the American tax system is not its lack of progressiveness (it’s actually quite progressive relative to many other wealthy nations) but its lack of revenue-raising power. A VAT-like tax would generate vast amounts of revenue and make possible even more extensive and powerful forms of income redistribution. Finally, his specific policy demands amount to a program that radicals and left-liberals have long called for: universal health care, one-year paid parental leave, government as employer of last resort, ending the drug war, increasing paid holidays and vacation time, and so on. These are reforms that would not just increase people’s living standards in the short term, but provide some degree of freedom from the disciplinary pressures of the marketplace.\nEvidence vs. Ideology Kenworthy is at pains to demonstrate how reasonable his social democratic scenario is. The welfare state will expand, he argues, because political actors (defined primarily as “policy makers,” not citizens and social movements) will respond to perceived needs on the basis of reason and evidence. You might call this the “Danes do it better” argument. Life is just so much less difficult for the vast majority of people in the Nordic countries, and Americans will eventually come to the realization that things can be better here too and act accordingly. Like a good empirical social scientist, Kenworthy assumes that politics is fundamentally a rational, evidence-based pursuit and that good policy will eventually win out over bad politics. But his appeal to reason and evidence is almost touching considering how patently deranged US political culture can be, particularly when it comes to questions of welfare and social spending. The rhetoric of reaction that Kenworthy dismisses as a gradually weakening obstacle to reform will not be defeated by the force of evidence-based, reasoned argumentation alone. The “common sense” of neoliberal ideology will have to be challenged and displaced if social policy advances are to be truly effective. Social democratic wonks will be too preoccupied with making Excel spreadsheets to do so — that task will fall to the radicals.\nThe Political Content of Social Policy Government spending on social programs may well increase in the coming decades, but the sheer volume of spending tells you little about the political content of social policy. Does policy reinforce or undermine the logic of capital accumulation? Does it redouble our subordination to market discipline or offer us a greater degree of freedom from its demands? In Kenworthy’s scenario major social reforms will happen almost willy-nilly, with a passive populace coming to support successful programs only after they’ve been adopted. Historical institutionalists in political science and political sociology have long argued that policies create constituencies, contributing to their “stickiness” over the long term. They’re not wrong. But in the absence of popular organization and pressure outside the formal political system, the programs that are adopted will do little to shift the balance of class power away from capital and toward labor, and to reverse commodification instead of deepening it. As Kenworthy argues, there have been a number of large-scale policy initiatives since the 1980s, even during periods when the Republicans won national elections and dominated the three branches of government. But many of programs that he points to fall precisely into this trap. The Earned Income Tax Credit (EITC) has brought much-needed relief to the working poor, but it also serves as an indirect subsidy for low-wage employers. Medicare Part D offers some subsidies to low-income seniors, but it’s widely recognized as a costly giveaway to the prescription drug industry. Obamacare will expand health insurance coverage, partially through the (contested) expansion of Medicaid. But the individual mandate only serves to deepen the marketization of health coverage, adding tens of millions of Americans to the private, for-profit insurance system. The 2009 stimulus plan likely saved the country from Great Depression 2.0, but it was inadequate to the scale of the crisis and weighted in favor of tax cuts for businesses who simply pocketed the cash instead of hiring new workers. At the state level, we recently witnessed the passage of the “Pay It Forward” funding plan for public colleges and universities in Oregon. Aside from the fact that legislation may not be workable and does nothing to increase affordability, its political logic only serves to reinforce the dominance of neoliberal ideology. As one of its liberal supporters freely admitted, “When we talked to legislators, conservatives said it appealed to them because it’s a contract between the student and the state, so they see it as a transaction, not as a grant.” Here we see public education reduced to a form of “human capital” rather than a social good, an investment security for one’s personal economic portfolio rather than the foundation of democratic citizenship. Nevertheless, the bill received immediate and effusive praise from liberals in the Nation , the American Prospect , and the New York Times .", "url": "https://www.jacobinmag.com/2013/08/social-democracy-for-our-time/"}