{"authors": ["Bécquer Seguín", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:06", "date_modify": "2020-05-04 19:53:06", "date_publish": "2014-07-16 00:00:00", "description": null, "filename": "2014_07__1588621986.html", "image_url": "https://images.jacobinmag.com/2014/07/16235656/12610645955_27e7613747_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_07__1588621986.html", "title": "The Syriza of Spain", "title_page": "The Syriza of Spain", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nPodemos (“We can,” in Spanish) is the name of Spain’s newest political party — resembling the slogan of Barack Obama’s 2008 campaign. But not much else links Obama and Pablo Iglesias, the thirty-something public face of the party. After all, Podemos has put forth a radical program based on class politics. Their proposals include citizen audits of public and private debt, shortening the workweek to thirty-five hours, reducing the retirement age to sixty, illegalizing for-profit layoffs, a universal basic income, parliamentary control over the European Central Bank, and abolishing private credit rating agencies. But most importantly, Podemos uses a decision-making model strikingly different from the two mainstream parties. They call it the “constituent process.” A number of local “circles” peppered across Spain shape the overall party structure. Made up of anyone who wants to participate, these circles introduce and debate proposals for the party to take up. Each circle has an organizational leadership that works by compulsory rotation. And each avoids a subordinate relationship to the circles in Madrid, where the party was founded and where Iglesias and other key organizers participate. Voting and circulating proposals online makes this kind of politics possible. Everyone’s on equal footing, and everyone has a chance to lead the party. Podemos took many by surprise this past May when nearly 1.25 million Spaniards voted for them in the European Parliament elections. This nearly 8 percent vote share earned Podemos five seats, which, in addition to Iglesias, are occupied by green activist Teresa Rodríguez, unemployed server Lola Sánchez, physical chemist Pablo Echenique, and teacher Tania González. While heavy on academics, the candidates on the Podemos ticket represented more of a cross-section of the Spanish citizenry than any other party in the country. Their ages ranged from eighteen to seventy-eight, and their vocations from firefighter to librarian, but most importantly they included unemployed workers of all shades. Spain’s mainstream media didn’t expect anything from any of the minority parties, let alone one that had been founded only months before the election. The success of Podemos has forced many from the center-left Partido Socialista Obrero Español (Spanish Socialist Worker’s Party) and the right-wing Partido Popular (Popular Party) to attempt to explain away the phenomenon. Pedro Arriola, an influential sociologist and principal advisor to President Mariano Rajoy, lamented soon after the elections that: “All the freaks in the world ended up conspiring in Madrid.”\nIberian Austerity But the truth isn’t in the demographics, it’s in the economics. As Guillem Murcia explains at Socialist Worker , Spain’s response to the 2008 economic crisis has left the working class largely out of work. The PSOE, in power from 2004–11, first attempted a Keynesian response to stimulate demand. But around late 2010, the party made a dramatic reversal. It acceded to the austerity measures being pushed by the Troika (IMF, European Commission, and European Central Bank), and by the time President José Luis Rodríguez Zapatero left power in 2011, they had frozen pensions, raised the retirement age from sixty-five to sixty-seven, cut public employee salaries, slashed the budget of Spain’s national health service, and eliminated social services for children and the elderly. Then Mariano Rajoy’s conservative PP took over, further entrenching the cuts to Spain’s welfare system. Over the past two years, wages have declined 10 percent as a result. No other country in the European Union — save Greece — has seen a reduction anywhere near that mark. In addition, Spain’s unemployment level today is at nearly 26 percent, and nearly half of these roughly 5.5 million (registered) people do not receive any unemployment insurance. Even those who are employed aren’t much better off, increasingly falling into the category of temporary work. Of all new contracts in May, for example, 92 percent were for temporary work, a trend that has undermined the government’s claim that the country has climbed out of its most recent two-year recession. The Rajoy government also passed far-reaching anti-protest laws this past December. The government decided to punish protesters with a fine of roughly $820,000 for demonstrating near the parliament and nearly $41,000 for “insulting” a police officer or the state during a protest. Labor unions, too, have seen their right to strike undermined by these laws. Many on the Left strongly criticized Rajoy’s unilateral directive to take such decisions away from the courts. But their pressure hasn’t yielded political results, and the consequences of these anti-democratic measures are taking their toll. More than 250 workers across Spain are now facing a collective sentence of over 120 years in prison for organizing strikes and protesting austerity measures. Three union leaders are being sentenced to a total of thirteen years in jail for having organized two major strikes. The UGT (General Union of Workers), one of Spain’s major labor unions, is trying to fight these punitive actions, but the state hasn’t shown any signs of dropping the charges. Without the slightest hint of irony, Rajoy responded to critics of the anti-protest laws by saying, “one of the obligations of the government is to guarantee the liberty and security of all its citizens.” Especially, it seems, the job security of its political elites.\nA Leftist Resurgence Like any good leftist party, Podemos emerged from a movement and a manifesto. The movement was Spain’s indignados movement. The indignados — or the 15-M, as it’s called in Spain — surged in the spring of 2011, occupying Madrid’s Plaza del Sol and many other public spaces across the country. In addition to austerity, the indignados protested the governing parties’ inability to curb astronomical levels of youth unemployment (then, hovering around 45 percent; now, 57.7 percent) and to forge a participatory democracy. Thanks to the governing parties, politics in Spain today looks 140 years old. After the fall of the First Republic in 1874, the Bourbon Restoration returned the Spanish government to the clutches of the monarchy. Keen to solidify their power and not open up another opportunity for a republic, the monarchy decided to hedge their bets with democracy and keep the entirety of the bourgeoisie happy: it instituted a policy of turnismo in which the liberal and conservative factions would literally take turns ruling the country. Elections would be fixed, everyone would have a chance to be “in power,” and the monarchy would go about its business running the country. Replace “monarchy” with “economic elites,” and politics today looks much the same. Since Spain’s transition to democracy following the death of Franco nearly four decades ago, the PP and PSOE have alternated as governing parties. There’s certainly a wide gap between their rule and Franco’s. They modernized the country, they established the welfare state, they legalized abortion and gay marriage, and so on. But by and large, they’ve followed the same conservative economic trajectory sketched during the second half of the Franco dictatorship. Each government has built upon the privatization schemes of their predecessor, eroding what was left of the welfare state. If there’s any story to be written about Spain’s transition to democracy, it is a story about how workers have held politicians’ feet to the fire. The relentless pressure Spaniards put on their government in the form of strikes, protests, and elections is responsible for much of Spain’s welfare system. On December 14, 1988, 90 percent of the active labor force went on strike in response to proposed labor market reforms that would have made it easier to fire workers and introduce temporary contracts for young workers. After paralyzing the country for twenty-four hours, Felipe González, the country’s PSOE president, sat down with the union organizers and ultimately decided to increase public spending instead of going through with the proposed reforms. (A similar story would happen with the general strikes in 1994 and 2002, though with less material gains for workers.) The indignados movement then irrupted in 2011. Neither a pale version of the Arab Spring nor a mere precursor to Occupy, the indignados have morphed into what the PP and PSOE most feared: a broad-based opposition to their cooperative rule. Once focused more pointedly on policies to aid the youth, the indignados have shifted their demographic focus to a broader swath of the labor force. In 2012, they lent their support to two major labor strikes. If the indignados were the movement, Mover ficha: convertir la indignación en cambio político (Making a Move: Turning Indignation into Political Change) was the manifesto. The document aimed to channel a growing popular movement into electoral gains. Some twenty-eight activists, ranging from university professors to union organizers, signed on. Mover ficha immediately resonated with the Spanish people. And the reasons are clear. “The solution can only come from the citizenry,” the manifesto reads, “just like worker’s protections, the defense of families against evictions, or the guarantee of public services — small but significant victories.” The manifesto explicitly challenged the two-party control of government. It laid out a political platform to “recover popular sovereignty,” “defend decent working conditions,” and “reject all privatization of public services and common goods.” Policy directives included repealing article 135 of the Spanish constitution (a constitutional reform to cap budget future deficits pushed through without a popular referendum), applying article 128 of the constitution (which reads, “The entire wealth of the country in its different forms, irrespective of ownership, shall be subordinated to the general interest”), removing Spain from NATO, retroactively applying nonrecourse debt, maintaining public education and health, and opposing restrictive reforms to abortion law. Once Podemos officially registered as a party in March, it expanded on these and other policies in a collectively drafted thirty-six page document.", "url": "https://www.jacobinmag.com/2014/07/the-syriza-of-spain/"}