{"authors": ["Beth Sondel", "Joseph L. Boselovic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "R. H. Lossin"], "date_download": "2020-05-04 19:56:01", "date_modify": "2020-05-04 19:56:01", "date_publish": "2014-07-16 00:00:00", "description": null, "filename": "2014_07_no-excuses-in-new-orleans_1588622161.html", "image_url": "https://images.jacobinmag.com/2014/07/16235649/NOLA_charter_083110-thumb-640xauto-818-1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_07_no-excuses-in-new-orleans_1588622161.html", "title": "“No Excuses” in New Orleans", "title_page": "“No Excuses” in New Orleans", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThis is the first installment in our two-part series looking at charter schools in New Orleans and Detroit. The juxtaposition is no accident — these two cities have the highest percentage of charters in the country. In New Orleans, charters have almost entirely replaced traditional public schools; in Detroit, about half the schools are charters. Both cases show the perils of privatization and the way in which elites manipulate crises to transform social goods. Similar themes are explored in Class Action: An Activist Teacher’s Handbook , a joint project of Jacobin and the Chicago Teachers Union’s CORE. The booklet can be downloaded for free and print copies are still available. This fall, less than a decade after its post-Katrina, “grand experiment in urban education” began, New Orleans will become the first city in the country with an all-charter school district. The traditional school district has been effectively supplanted by the state-level Recovery School District, originally presented as a temporary solution to resuscitate lagging public schools before returning them to local control. The state of education in New Orleans is often presented as a sort of grand bargain: on the one hand, the neoliberal transformation has been undemocratic and has marginalized community members, parents, and educational professionals; on the other hand, advocates of reform are quick to cite higher test and state school performance scores as evidence that the reforms have been successful. While the former is true, the claim that there has been substantial improvement in the educational experiences of young people is unfounded. In such a market-based system, students’ assessment data are used to compare charter providers, recruit families, maintain charter contracts, and reward teachers. The willingness of reform advocates to hold up test scores as the key indicator of success places enormous pressure on schools and teachers to produce quantifiable results. When the focus is on increasing assessment data, what happens to the democratic purposes of schooling? If we are willing to accept that the purpose of schooling goes beyond raising test scores, and is in fact tied to preparing citizens to engage in and deepen our democracy, then we need to look more closely at how power has been distributed in school governance across New Orleans and the ways in which this distribution shapes the experiences of students. We must ask if we are raising test scores at the expense of raising citizens.\nIn 2010, Secretary of Education Arne Duncan spoke for many school reformers when he said, “The best thing that happened to the education system in New Orleans was Hurricane Katrina.” And indeed, nowhere has the growing charter movement been more successful in replacing traditional public schools than in the Big Easy. With many citizens still displaced, the Louisiana State Legislature made a series of rapid-fire decisions that lifted the state cap on the number of charters in the state, altered criteria to qualify a school for state takeover, and changed the chartering process to limit school and community-based participation. As a result, more than 7,000 predominantly African-American school personnel were unlawfully laid off, and most schools were taken away from local, democratic control. In subsequent recovery efforts, there was little to no space for community input as the federal government and venture philanthropists provided money for the development of charter schools with no comparable sum offered to rebuild traditional public schools. Now, instead of a single school district overseen at the city level, New Orleans has a system of individual charter schools and charter management organizations (CMOs). By the upcoming school year, all but a handful of the city’s schools will be charters, either run independently or by one of about seven major CMOs that operate multiple schools. (The only remaining traditional public schools are overseen by the Orleans Parish School Board.) With limited public oversight and transparency, these CMOs and independent charter schools also have stronger control over personnel — teachers unions are virtually non-existent post-Katrina — which diminishes the ability of professional educators to shape the daily experiences of students and staff and heightens labor exploitation. Teachers often work over seventy hours a week, getting to school before seven in the morning and working through the day, sometimes without bathroom breaks, until they return home to grade papers and answer student phone calls until nine in the evening. Some community members were originally optimistic about the possibilities promised by reform advocates, believing that they would improve the system by developing new schools based on educational innovation and neighborhood input. In reality, however, while some schools were successful in fighting to re-open following Katrina and a few neighborhood and community-based groups have been granted charters, these have been the exceptions. Even proponents of the post-Katrina reforms admit that the current system is segregated and not serving students equitably.Whereas the black middle class comprised the majority of teachers and staff prior to Katrina, the schools of the moment are overwhelmingly operated and staffed by younger, non-local, white teachers with limited training and even less experience. This is because the reforms have been and continue to be made possible by a network of corporate-sponsored non-profits, incubators, and start-ups. Central to this constellation is Teach For America (TFA) — the controversial organization that recruits college graduates, the vast majority of whom have not studied education, to train for five weeks and then teach for two years in low-income schools. In the months after Katrina, TFA tripled in size in the region and has continued to grow in each subsequent year. While TFA has announced plans to scale back in the upcoming school year, according to their records, there are 400 TFA corps members and 830 alumni in the area. Many TFA alumni hold powerful leadership positions, including State Superintendent John White, members of local school boards, and over thirty principals. TFA corps members work primarily in “No Excuses” charter schools, premised on the assertion that poverty must not be used as an excuse for low performance. Instead, “No Excuses” advocates argue that high-poverty schools can be high-achieving when school leaders are given autonomy from the bureaucratic constraints of districts and commit to, among other things, an extended day, data-driven instruction, and strictly enforced behavioral expectations. KIPP, the flagship “No Excuses” school, and many others, were founded by, heavily staffed by, and are formally affiliated with, TFA.\nExtensive observational research one of us conducted (Sondel) in two of these “No Excuses” schools (an elementary KIPP school and a locally based middle school modeled after KIPP) provides evidence that assessment data is no longer the proxy for educational quality but has in fact become the purpose of schooling itself. At both schools, as is the case in many “No Excuses” charters in New Orleans, the principals were white males, under the age of thirty, and TFA alumni. TFA corps members and alumni also constituted five of the six collective administrators and over 60 percent of the instructional staff. With few exceptions, the curriculum was characterized by a narrow interpretation of state standards at the expense of all other material. Students rarely learned local history or current events. Instead, science and social studies were relegated to ancillary classes in the elementary school and reduced to the accumulation of vocabulary and lists of facts at the middle school. Teachers stopped introducing new material a month prior to state assessments in order to begin review. This curriculum was delivered almost exclusively through direct instruction — what TFA corps members refer to as the “five step lesson plan,” and educator and philosopher Paulo Freire calls “banking education,” wherein students are treated as passive and empty receptacles into which information can be deposited. In nearly every lesson Sondel observed, teachers stood in front of students to introduce new content or an isolated skill, after which students were asked to parrot, practice, and then perform their newly acquired knowledge on worksheets and multiple-choice assessments. There were no student debates, projects, or science experiments. In a literacy lesson, for example, a teacher started by reviewing the definitions of figurative language. The teacher then projected on the Smartboard sentence after sentence, poem after poem, and, finally, a short story while students raised their hands and waited to be called on to identify idioms, similes, and personification. After this series of questions and answers, the students sat silently at their desks, read four short passages, and identified figurative language on multiple-choice questions. The students were not asked to read the poem, analyze the story, or discuss the purpose of metaphors. After the lesson, upon being asked if students practice this skill in their independent reading or writing activities, the teacher responded, “You know the problem with that is then they have a difficult time identifying metaphors on the test.” Perhaps because there was little inherently interesting or relevant to students about the curriculum or the classroom activities, teachers often attempted to control rather than engage students in lessons. There were, for example, specific expectations about where students should put their hands, which direction they should turn their heads, how they should stand, and how they should sit — practices referred to at one school as SLANT (Sit up, Listen, Ask and Answer Questions, Nod, and Track the Speaker) and at the other as SPARK (Sit up straight, Pay attention, Ask and answer questions, React to show I’m following along, Keep tracking the speaker). Students were kept silent, or what teachers called “level zero,” through most of the day. Silence seemed to be especially important in the hallways. At the sound of each bell at the middle school, students were expected to line up at “level zero” with their faces forward and hands behind their backs and, when given permission, step into the hallway and onto strips of black duct tape. There they waited for the command of an administrator: “Duke, you can move to your next class! Tulane, you can walk when you show me that you are ready!” Students then marched until they reached the STOP sign on the floor, where their teacher checked them for hallway position before giving them permission to continue around the corner. Throughout this process, students moved counter-clockwise around the perimeter of the hallway (even if they were going to a classroom one door to the left). This system of control was administered through intricate systems of reward and punishment. Elementary students received and lost stars for each “behavioral infraction.” In one classroom, a teacher circulated the room with a timer in her hand while students read silently. Every three minutes, after the buzzer, she put a single goldfish on the desk of each student who had remained silent. In another classroom, a teacher silently glared at a student and then typed into his iPhone, which was connected through Class Dojo — an online behavior management system — to his Smartboard. Numbers would increase and decrease on little avatars representing each student. At the middle school, stars matured into fake money that students could use to buy access to brass band and spoken word performances. When they were not compliant, or did not have enough money to attend the weekly celebration, they were sent to the “behavior intervention room,” where they were expected to copy a piece of text word for word on lined paper. One particular afternoon, the text in question was Martin Luther King Jr’s “I Have a Dream” speech. Despite the reputation that people join TFA to pad their resumes, many get involved in an attempt to contribute to society. Some are even convinced they are a part of the Civil Rights Movement of their generation. Implementing the “No Excuses” approach is equated with social justice, under the assumption that it is the most effective way to improve students’ test scores — which will get them into college and out of poverty. One teacher explains: “Because these days with the economy the way it is, you need a college degree. So this is a movement of social justice and giving everyone that wants an opportunity access to education.” Teachers unconvinced by this ideology tend to acquiesce to the “No Excuses” approach for fear of losing their jobs or negatively influencing their students’ futures. One social studies teacher who wishes he could develop his students into historically curious, community-oriented citizens told Sondel why he focuses on teaching standards and test prep instead of current events: “I would be afraid of seeing a whole lot of sixth graders end up back in sixth grade and I would, frankly, be equally afraid that I wouldn’t be the one teaching them next year.” Yet this pedagogy is far from justice-based or reflective of the radical ambitions of the Civil Rights Movement. Instead, this type of schooling extinguishes young people’s passion for learning and potentially pushes out those who fail to or are unwilling to comply. At best, the “No Excuses” approach attempts to develop within students the compliant dispositions necessary to accept and work within the status quo.", "url": "https://www.jacobinmag.com/2014/07/no-excuses-in-new-orleans"}