{"authors": ["Daniel Lazare", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:48", "date_modify": "2020-05-04 19:51:48", "date_publish": "2014-12-17 00:00:00", "description": null, "filename": "2014_12__1588621908.html", "image_url": "https://images.jacobinmag.com/2014/12/17001742/senate-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_12__1588621908.html", "title": "Abolish the Senate", "title_page": "Abolish the Senate", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "With Republican Senate victories in Montana, South Dakota, Iowa, Arkansas, Colorado, North Carolina, and West Virginia, Democrats are reeling from their worst political drubbing in decades. Things, the pundit class proclaims, will never be the same.\nThe GOP’s 2014 Senate sweep is indeed big news, which is why it’s generated such massive headlines. But an even bigger story concerns the nature of the chamber the Republicans have just captured.\nThe US Senate is by now the most unrepresentative major legislature in the “democratic world.” Thanks to the principle of equal state representation, which grants each state two senators regardless of population, the great majority of people end up grossly marginalized by the body. It’s a problem that has only gotten worse over time.\nAlthough California has the same number of votes as Wyoming, its population, currently at 38.3 million, is now some sixty-five times larger. One Californian thus has 1.5 percent of the voting clout in Senate elections as someone living just a few hundred miles to the east.\nSince a majority of Americans now live in just nine states, they wind up with just eighteen votes while the minority holds eighty-two, a ratio of better than four to one.\nThanks to the Senate’s bizarre filibuster rules, forty-one senators representing less than 11 percent of the population can prevent any bill from even coming to a vote.\nThanks to the requirement that proposed constitutional amendments be approved by at least two-thirds of each house, thirty-four senators from states representing just 5 percent of the population can veto any constitutional change, no matter how minor.\nThe same goes for treaties, which also require two-thirds approval.\nThe Senate “hold” system is even more unjust since it allows a single senator representing as little as one citizen in a thousand to stall a bill or executive appointment almost indefinitely.\nThe upshot is one of the most cockeyed systems of minority rule in history, one that allows tiny coteries to hold the entire country ransom until their demands are met. Congress is hardly the only bicameral legislature on earth. But while the British House of Lords, the Dutch Senate, and the German Bundesrat are often less than fully representative, their actual power ranges from minimal to non-existent, which helps soften the blow.\nYet thanks to Article I, which gives the Senate veto power over treaties and executive appointments, America’s upper chamber is actually more powerful than the lower and at the same time vastly more unequal.\nIt’s a double blow to democracy that feeds into American capitalism’s worst oligarchic tendencies. And yet the problem is almost completely invisible. Where one would expect millions of people in the streets protesting against US government’s resistance to one-person-one vote, the crowds are nowhere to be seen.\nNot unexpectedly, equal state representation also turns out to be racially unrepresentative. While Hispanics and racial minorities make up 44 percent of the population in the ten largest states, all of which are heavily urbanized, they account for just 18 percent of the ten smallest states (in which individual voting power happens to be some eighteen times greater). Non-whites wind up hugely short-changed as a consequence. Yet while minority leaders have plenty to say about individual senators, they seem to have nothing to say about the institutionalized racism of the Senate as a whole.\nOther groups are also penalized. Although women are not affected in the same way since their population is evenly distributed, issues like abortion and equal pay are hardly well served by an arrangement that multiplies the power of rural conservatives. But the LGBT community, whose most vocal activist base is typically in urban areas, does suffer from the Senate’s reign. Yet if the Lambda Legal Defense Fund or other gay advocacy groups have anything to say about equal state representation running contrary to their members’ interests, it has been so muted that no one has noticed.\nThe same goes for socialists, labor unions, health-care activists, conservationists, and others. All suffer under an exclusionary system that deprives progressive city dwellers of their rightful representation. Yet all are strangely acquiescent.\nIf Republicans proposed stripping workers of 80 percent of their voting rights, the uproar would be overwhelming. But since it is all the result of forces that the nation’s founders set in motion more than two centuries ago, there is only silence.\nWhat can be the reason for such passivity? Any attempt at an answer requires a journey into the depths of American constitutionalism. As every political science student knows, Roger Sherman, a lawyer, shopkeeper, and surveyor turned politician, put forward his famous Connecticut Compromise midway through the 1787 Constitutional Convention in an effort to assuage fears that small states were about to be swamped by giants like Virginia and New York.\nInstead of a unicameral system, Sherman’s modest proposal was to divide legislative responsibility between a lower house that would look after popular interests and an upper house that would attend to those of the states. American bicameralism, a variation on the British Parliament’s division between commons and lords, was born.\nBut that was not all the compromise entailed. It also required that the upper house be at least as powerful as the lower to ensure that state interests would be adequately protected, as well as modifications to the amending clause to see to it that the arrangement would be effectively immune to popular pressure. The upshot was the Senate’s enhanced power over treaties and appointments set forth in Article I, plus a clause in Article V stipulating “that no state, without its consent, shall be deprived of its equal suffrage in the Senate.”\nWhere other parts of the Constitution can be changed with the approval of two-thirds of each house and three-fourths of the states, any deviation from the principle of equal state representation in the Senate is forbidden without the states’ unanimous consent.\nThis was enough to render the Senate all but untouchable back in 1790 when Delaware was less than a twelfth the size of Virginia. But as the number of states has grown and population disparities have widened, the guarantees have only grown more ironclad. Today, a demographic microstate like Wyoming derives so much benefit from the system that the chances of it ever saying yes to reform approach zero. The very idea is unspeakable.\nGiven such obstacles, Americans have made the pragmatic decision to concentrate on what they can change and ignore what they can’t. But the problem involves not only specific legal impediments, but the very nature of the Constitution and its place in larger society.\nAmericans think of their Constitution as a document towering over society, hardly surprising since it preceded the nation and essentially gave rise to it, a process that continued through the Civil War and even after.\nThe Declaration of Independence said nothing about a nation-state, referring instead only to “the good people of these colonies,” which “of right ought to be free and independent states.” The Articles of Confederation, adopted in 1781, were equally chary, specifying that “each state retains its sovereignty, freedom, and independence” and characterizing the new union as no more than “a firm league of friendship.”\n“We the people,” the 1787 Constitution’s famous opening phrase, was the first official reference to Americans as anything approaching a single entity.\nAmericans view this as perfectly natural. After all, the Constitution created the federal government, which then laid the basis for the first stirrings of a unified society. But elsewhere the process was different. Beginning in the spring of 1789, the French convened the first national assembly, issued the Declaration of the Rights of Man, and stormed the Bastille, all without drafting a constitution until more than two years later.\nThe Constitution gave rise to the nation in America, the nation gave rise to the constitution in France.\nAs a result, the American nation was above the Constitution in one instance and below it in another. The preamble seemingly establishes “we the people” as the highest authority in the land since it describes them as ordaining one plan of government and, in the process, implicitly tossing out another, the ill-fated Articles of Confederation.\nBut the Constitution then goes on to subordinate the people by severely limiting their ability to change a document made in their name and in at least one instance, that of equal state representation, eliminating it altogether. The Constitution established the people as sovereign and non-sovereign in virtually the same breath.\nIt is tempting to dismiss the results as little more than a muddle. If a camel is a horse designed by a committee, then the Constitution, the product of four months of labor by fifty-five merchants, planters, and lawyers, is a multi-humped dromedary straight out of Dr Seuss.\nBut one could also describe it in more modern terms as a kind of early computer program, one that switches on a processor, powers it up, and then orders it to perform certain specific tasks. The Constitution invests the people with just enough power to carry out the functions that it dictates.\nIf so, this explains a good deal about the American political system — its low ideological level, its narrowness of debate, its all-around thoughtlessness. Instead of freely thinking through the problems before them, Americans are required — programmed, actually — to think only in ways dictated by the founders.\nThey are creatures of a pre-ordained democracy that limits their role to filling in certain blanks. They will argue endlessly about the “necessary and proper” clause in Article I or the meaning of the Second Amendment, but never about why, after more than two centuries, they should remain bound by such precepts in the first place. They debate what the Constitution allows them to debate and disregard the rest.\nHence the silence over the undemocratic nature of the Senate. Since equal state representation is the single most immovable part of the political structure, it is the feature most resistant to popular pressure and therefore the one most off-limits to debate.\nAmericans campaign for and against various Senate candidates, they spend millions on political ads, and they beat their breasts when the wrong side wins. But they never pause to ask themselves why they play the game at all or what purpose it is serving in a democratic society.\nSince they’re not programmed to think about such issues, they’re no more inclined to do so than a laptop is inclined to think about the merits of Microsoft Word.\nThis is the equivalent of what the Scottish New Left political theorist Tom Nairn once described as “royal socialism,” the notion that Labor MPs can nationalize industry, expand the welfare state, and promote equality all while kneeling before the queen and praying for a peerage. It assumes that progress can continue indefinitely within certain fixed parameters, whether those of an unwritten constitution in the United Kingdom or a 227-year-old written document in the United States that is all but unamendable.\nBut it can’t. Rather than a workers’ state, royal socialism in Britain led to the grotesque hypocrisy of the Tony Blair years and the growing financial dictatorship of the City of London. The American version has resulted in even worse, the eclipse of organized labor and a dramatic surge in income polarization, not to mention economic crisis, unemployment, and war in the Middle East.\nConstitutional strictures thus have a way of turning on their supporters and biting them in the derriere when they least expect it. What seems generous and accommodating in one era becomes suffocating and restrictive in another. In the United States, an entire generation came of age thinking of the Supreme Court as the key to social progress. The deep freeze might continue on Capitol Hill while Ike continued to putter around the golf course, but “the Supremes” would return the Bill of Rights to all its glory.\nBut that was so last century. With the court restored to its normal historical conservatism and the executive branch likely to lurch to the right in 2016 as well, the strategy is by now exhausted. In Congress, the trench warfare meanwhile grows more and more dangerous.\nNation columnist Alexander Cockburn labored to put a positive spin on gridlock. “We like it,” he wrote in 2000, because it prevents conservatives from ramming through such initiatives as Social Security privatization and school vouchers. But that was wrong then and even more wrong now.\nIn the long run, it is plain that gridlock plays into the hands of the know-nothing right who want Americans to believe that democracy equals mob rule and that government is a dead end. The more democracy is made to tie itself in knots, the more frustrated working people grow and the more corporate interests have the field to themselves.\nThe Senate is now the center of the conspiracy. Republicans are rejoicing over what is likely to be a fifty-four to forty-six majority. But since their forces are concentrated in less populous states in the West and South, they actually represent fewer Americans than most people realize — just 46 percent.\nIn democratic terms — the only terms, of course, that count — they are still the minority party. But that will not stop them from making the utmost of their constitutional prerogatives.\nNext year’s GOP freshmen include such troglodytes as software executive Steve Daines of Montana, who maintains that solar cycles cause global warming; millionaire “turnaround specialist” David Perdue of Georgia, who told a campaign rally, “I believe in the good Lord, I believe in the Bible, and I believe in our Constitution”; and IBM executive Thom Tillis of North Carolina, who is anti-abortion, anti-birth control, and a global warming skeptic to boot.\nAn increasingly undemocratic structure fuels a growing anti-democratic assault. Yet the problem can only grow worse. Over the next decade or so, the white portion of the ten largest states is projected to continue ticking downward, while the opposite will occur in the ten smallest.\nBy 2030, the population ratio between the largest and smallest state is estimated to increase from sixty-five to one to nearly eighty-nine to one. The Senate will be more racist as a consequence, more unrepresentative, and more of a plaything in the hands of the militant right.\nIf you want to know what the future looks like, to paraphrase Orwell, imagine the old pre-reform Mississippi state legislature stamping on democracy — forever. Reformers will face an uphill fight even in defending existing gains. Yet there will not be a thing that liberals will be able to do about it without going contrary to rules that they previously extolled. Their options will be either to stand by and watch as democracy rapidly unravels or somehow strike off into a radical new direction.\nWith growing income polarization and an increasingly rigid Constitution, the US political structure is more brittle than most people realize. Americans have not had a chance to vote on the Constitution as a whole since the ratification battles of 1787–8. And since only white male property owners were allowed to vote — with only a quarter actually choosing to do so — those contests hardly qualify as a democratic.\n“We the people” have therefore never been consulted at all. They have merely acquiesced. But the big question is: for how long?", "url": "https://www.jacobinmag.com/2014/12/abolish-the-senate/"}