{"authors": ["Micah Uetricht", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:45", "date_modify": "2020-05-04 19:50:45", "date_publish": "2014-07-16 00:00:00", "description": null, "filename": "2014_07_run-karen-run_1588621845.html", "image_url": "https://images.jacobinmag.com/2014/07/16235629/Karen-Lewis-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_07_run-karen-run_1588621845.html", "title": "Run, Karen, Run", "title_page": "Run, Karen, Run", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "It feels odd saying “Karen Lewis for mayor of Chicago!” with a sense of complete seriousness.\nIt’s a phrase some Chicagoans have uttered many times since the 2012 Chicago Teachers Union strike. But it used to come out after a few beers among activists and fellow travelers, always accompanied by a smirk revealing the statement as a half-joke — fervently desired, but an impossible wish.\nThat smirk is still there, but now it’s more a look of disbelief that the hope might actually come true. A promising recent poll and a potential mayoral challenger’s dropout now have Lewis and much of the city thinking that she could actually beat Mayor Rahm Emanuel. “Mayor 1%,” long thought impervious to a challenge from anyone, could suffer a second major defeat by Lewis and the CTU during his time as mayor — not in a labor fight, but in his reelection bid.\nI’m getting a bit ahead of myself here on multiple counts — for one thing, Lewis hasn’t even decided if she’s running yet. But it’s hard not to get worked up when pondering the possibility of dethroning one of the most viciously anti-worker, pro-privatization, finance-friendly mayors of any major city in the country.\nLewis hasn’t announced yet, but after a Chicago Sun-Times poll found her beating Mayor Rahm Emanuel 45%–36% (with 18% undecided) if the election was today, it’s looking increasingly likely. Cook County Board President Toni Preckwinkle, long the hope of the Chicago Teachers Union (including Lewis) and most of Chicago desperate for anyone who could beat the mayor, finally gave an official announcement that she would not run — leaving Emanuel, whose approval rating is abysmal after he has closed fifty schools, shut down mental health clinics, and overseen the general increase in immiseration of the majority of Chicagoans since his election in 2011, without a clear opponent in 2015.\nBefore the poll results and Preckwinkle’s decision, public discussion about a Lewis run was scattered but unserious. But after the news of both broke Monday, Lewis and the CTU moved quickly to form an exploratory committee that will soon make a decision about the run. Some politicos and union leaders quickly pledged their support.\nFor over a year, many held out hope that Preckwinkle would challenge Emanuel in February. She was seen as the only viable contender to the mayor and has a record of progressivism and independence from the mayor that is not entirely undeserved.\nBut the fuel for a Preckwinkle run would have been more “Anybody but Rahm” sentiment than real enthusiasm for a candidate. Preckwinkle is fairly progressive, but she is a cautious career politician, not the product of a grassroots movement.\nKaren Lewis, on the other hand, stands at the head of a union that led the most inspiring strike in the US in at least fifteen years and has become the center of a citywide movement for educational and economic justice. And she has emerged as the principal voice opposing the brutal austerity measures, vicious racism, and rapidly expanding inequality that so many in the city are feeling.\nAt 61, she clearly held no longstanding ambitions for higher office — she spent twenty-two years as a rank-and-file teacher and came close to retiring shortly before running for union president. The only reason she is even considering running is because of the momentum of the movement that she, the CTU, and community groups and unions have created.\nMuch of the city and national press has covered the CTU’s battles over the last four years as a clash of big personalities; the extent to which the teachers union has been able to defeat Rahm (or at least hold the line against him), according to the dominant narrative, is largely due to Lewis’s brash and uncompromising style — qualities required to stand up to a mayor famous for a foul mouth, mailing people dead fish, and all-around Frank Underwood-esque ruthlessness.\nBut as I recount in Strike for America , the CTU won the 2012 strike not because of the piercing strength of the barbs Lewis dishes out in public (satisfying though they are), but because she and the Caucus of Rank-and-File Educators (CORE) that took over the union in 2010 were guided by a vision of a bottom-up, democratic unionism led by the 26,000 members of the CTU rather than the union’s bureaucracy. The strike would not have been possible without the mass political education and activist training that the union engaged in since CORE took office.\nIndeed, if journalists listened carefully to what Karen Lewis actually says, they would realize that she constantly insists that decisions about the union’s actions are not hers to make, but the rank and file’s. A Lewis election raises all kinds of possibilities about new forms of grassroots, democratic governance in a city that has only known “machine” governance of one form or another.\nThe question of whether Lewis would run as a Democrat or as an independent looms large. Lewis has spoken openly and repeatedly about the betrayals of the Democratic Party, even saying publicly that a third party is needed.\nThe CTU is moving towards the creation of an “independent political organization” along with the progressive SEIU local Health Care Illinois Indiana and several community organizations which, according to union staffers, would be open to supporting independent political challenges outside of the Democratic Party (several of which are already underway in Chicago), but will spend more of its resources on progressive Democrats (as it did earlier this year). A Lewis mayoral campaign could be an opportunity to create and build momentum around a third party — a route that would introduce a host of thorny issues into a campaign that is already a bit of a longshot.\nWhether running as a Democrat or an independent, such a campaign will not be easy. Emanuel is already sitting on more than $8 million in campaign cash; he will essentially have access to unlimited funds from his wealthy allies. That money can only get the mayor so far with voters who have felt the impact of his neoliberal agenda personally, but it will fund an incredible amount of attack ads and dirty tricks long associated with Chicago politics — virulent racism and sexism, redbaiting, and other reactionary tactics will likely reach new depths.\nEmanuel is incredibly unpopular in the city right now, but he is also a major Democratic power player nationally; a tough reelection fight would probably see major figures in the party like Presidents Bill Clinton and Barack Obama shilling for Emanuel, as they have in the past.\nAnd Lewis will not have the rest of the Chicago labor movement to count on. Since last June, Emanuel has received over $800,000 in donations from local unions.\nThis might be expected from conservative building trades unions, who have given the lion’s share, but that money has also come from the labor movement’s “progressive” wing — most notably SEIU Local 73 and UNITE HERE Local 1, both of whom also represent Chicago Public Schools employees and were bargaining alongside the CTU in 2012. After making the donation, the latter publicized a summit with the mayor and its members and has lined up behind an awful deal to use public money to open two luxury hotels and new basketball arena for DePaul University.\nAt the exact moment when a citywide movement has begun to coalesce against Emanuel and his agenda, generally in the form of the citywide education justice movement and concretely in the form of the independent political organization the CTU and others are forming, these unions have opted instead to curry the mayor’s favor to pursue their own narrow self-interests.\nBut no matter. A Karen Lewis mayoral campaign will put the question of “Which side are you on?” in stark relief for the city’s unions, public officials, and residents — not simply on Lewis’s side or Emanuel’s, but on the side of a city for the people or for capital.\nChicagoans need a mayoral campaign that isn’t just evil versus lesser evil. We need a Karen Lewis run.", "url": "https://www.jacobinmag.com/2014/07/run-karen-run"}