{"authors": ["Rory Fanning", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 20:00:01", "date_modify": "2020-05-04 20:00:01", "date_publish": "2014-12-17 00:00:00", "description": null, "filename": "2014_12_the-christmas-truce_1588622401.html", "image_url": "https://images.jacobinmag.com/2014/12/17002156/truce-football-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_12_the-christmas-truce_1588622401.html", "title": "The Christmas Truce", "title_page": "The Christmas Truce", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn the fresh light of dawn one hundred years ago today, German and Allied soldiers were dug into their opposing trenches on the Western Front in Belgium and France when they defied their superiors to declare a truce. In dropping their weapons, they frightened the world’s war makers, providing a glimpse of the power that people without rank and privilege have to determine their own destinies. It was only the fifth month of what was then known simply as the Great War. Both sides longed for home. The men felt death looming in the trenches where they watched their friends die. The soldiers wielded monstrous weapons: flamethrowers, chlorine and mustard gas, machine guns that could shoot 500 rounds a minute. More than one million lay dead already. But on Christmas Eve in 1914, an incredible scene began to unfold. The faint sounds of carols drifted from the muddy, half frozen and blood-splattered trenches British and German soldiers had been occupying that night. “All is calm, all is bright,” was sung in both English and German. The soldiers hugged the chopped-off tops of pine trees, which were ornamented with candles and paper lanterns. Paper lights festooned heavy artillery, ammo boxes, crates of food rations, and the wooden beams that kept the trench walls in place. “Merry Christmas” was yelled out in a German accent. “Frohe Weihnachten” followed in a Scottish accent. The opposing trenches were so close that the words could be heard easily. Lighted trees began to rise over the lip of the German furrows. British soldiers watched through their periscopes. Rumors of a Christmas truce had been circulating for weeks. Was this it? Or was it a trap? The soldiers squinted through their military hardware and pondered their next move. An equal mix of joy and suspicion filled the bunkers. These men were fighting in a war that served none of them. It was an imperialist war, a war among the world’s most powerful nations to re-divide the world, a war to ensure the collection of bank debt. They knew it was only a matter of time before they, too, would meet the same fate as the so many others who had already lost their lives. What was it all for? So the rich could stay rich? In their mind’s eye, the soldiers could see their significant others, their parents, their children, their brothers and sisters, tucked away in warm homes, next to their own Christmas trees. The enlisted ranks couldn’t fight in these conditions. So they didn’t.\nThe sun rose and one German soldier pulled himself from his death-soaked trench. British snipers peered through their sites. He wasn’t carrying a weapon. Then another German soldier emerged, and another. They, too, were weaponless. Trigger-ready soldiers, hardened by months of fighting, felt a wave of excitement rush through them as they lowered their rifles. The British soldiers left their trench next. Both sides stepped over the bodies of fallen comrades, which were stiff in the cold mud and covered with a dusting of morning frost. The soldiers met in the middle of the battlefield — no man’s land — still a bit anxious, but smiling. Eye to eye, they shook hands and shared pictures of their loved ones at home. They exchanged small presents: cigarettes, military-issued desserts, coat buttons. They recognized and celebrated their similar interests. The soldiers from both sides had parents who were factory workers, domestic laborers and all manner of ordinary, everyday people. They bonded over this. The soldiers were soon snapped back to the horrors of the previous months. The bodies of their fallen comrades, littering no man’s land, couldn’t be ignored any longer. Teams, intermixed from both sides, carried blue and torn bodies to their graves in relative silence. Someone then suggested soccer, but there were no balls. A tin can was tossed out into the cleared-out space as a sorry substitute, but the soldiers made the most of it. They traded the grim duties of war for sport. The soldiers played like their lives depended on the game. They savored each clunky kick, pass and goal, needing the fun to last forever. Respect and sportsmanship flowed between the teams. In those moments, the men were no longer enemies. Time was slower during moments of calm. Both sides felt it. It was a calm they were surprised by, a calm they didn’t know existed before the war. Every glance, laugh and touch was vivid and important. It felt like the best narcotic.\nOfficers all the way of up to the rank of colonel participated in the truce. However, the fun was short-lived for the higher ranks. Allied officers couldn’t ignore the words sent out only a few weeks prior from General Sir Horace Smith-Dorrien, who issued an instruction to the brass of all divisions: It is during [the holidays] that the greatest danger to the morale of troops exists. Experience of this and of every other war proves undoubtedly that troops in trenches in close proximity to the enemy slide very easily, if permitted to do so, into a ‘live and let live’ theory of life . . . The Corps Commander therefore directs divisional commanders to impress on subordinate commanders the absolute necessity of encouraging offensive spirit . . . Friendly intercourse with the enemy, unofficial armistices, however tempting and amusing they may be, are absolutely prohibited. The sun set and the officers, with Gen. Smith-Dorrien’s words echoing in their minds, gave the order to return to the trenches. They couldn’t let the men gain the confidence to openly question the chain of command. The brass couldn’t let the lower ranks see that they were stronger than the higher ranks — the minority. The next day was Boxing Day. The calm lingered, but more than 100 soldiers were dead by end of the day. The officer-directed fighting commenced. Troops from both sides were ordered to fire on the people they played soccer with, exchanged presents with, showed photos to, only hours before. These soldiers killed people with whom they had far more in common than those who were ordering them to fight. They were mostly poor and working class. The generals in the rear had titles like “sir” and “lord.” They owned large estates. They were collaborators with robber barons, kings, and other heads of state. They lived in worlds the fighting men only read about. Sixteen million people died in the First World War in total. Soldiers that questioned the sanity of war and their own personal interest in fighting it, wondered: What if we had refused to get back in our trenches? Would word have spread? What could have happened next?", "url": "https://www.jacobinmag.com/2014/12/the-christmas-truce"}