{"authors": ["Daniel Zamora", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:56", "date_modify": "2020-05-04 19:53:56", "date_publish": "2014-12-17 00:00:00", "description": null, "filename": "2014_12__1588622036.html", "image_url": "https://images.jacobinmag.com/2014/12/17001850/07_revolte-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_12__1588622036.html", "title": "Can We Criticize Foucault?", "title_page": "Can We Criticize Foucault?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "DZ\nIt’s practically an unexplored issue within the immense corpus of the “Foucauldians.” To tell the truth, I didn’t think I’d be working on this when I was thinking up the plan of the book. My interest in social security wasn’t originally connected to Foucault directly, but my research on this issue led me to think about how over the past forty years we’ve gone from a politics aimed at combatting inequality, grounded in social security, to a politics aiming to combat poverty, increasingly organized around specific budget allocations and targeted populations.\nBut going from one objective to the other completely transforms the conception of social justice. Combatting inequalities (and seeking to reduce absolute disparities) is very different from combating poverty (and seeking to offer a minimum to the most disadvantaged). Carrying out this little revolution required years of work delegitimizing social security and the institutions of the working class.\nIt was while reading closely through the texts of the “late” Foucault (from the late seventies and early eighties) that it became clear to me that he himself fully took part in this operation. So, he not only challenged social security, he was also seduced by the alternative of the negative income tax proposed by Milton Friedman in that period. To his mind, the mechanisms of social assistance and social insurance, which he put on the same plane as the prison, the barracks, or the school, were indispensable institutions “for the exercise of power in modern societies.”\nIt’s also interesting to note that in François Ewald’s central work, he doesn’t hesitate to write that “the welfare state fulfills the dream of ‘biopower.’” No less! [Ewald was Foucault’s disciple and assistant, now a leading intellectual aligned with France’s insurance industry and the Medef, the main French business federation.]\nGiven the many defects of the classical social security system, Foucault was interested in replacing it with a negative income tax. The idea is relatively simple: the state pays a benefit to anyone who finds themselves below a certain level of income. The goal is to arrange things so that without needing much administration, no one will find themselves below the minimum level.\nIn France this debate begins to appear in 1974, through Lionel Stoléru’s book Vaincre la pauvreté dans les pays riches ( Conquering Poverty In the Rich Countries ). It’s also interesting to note that Foucault himself met with Stoléru several times when Stoléru was a technical advisor on the staff of [right-wing French president] Valéry Giscard D’Estaing. An important argument runs through his work and directly attracted Foucault’s attention: in the spirit of Friedman, it draws a distinction between a policy that seeks equality (socialism) and a policy that simply aims to eliminate poverty without challenging disparities (liberalism).\nFor Stoléru, I’m quoting, “doctrines. . . can lead us either to a policy aiming to eliminate poverty, or to a policy seeking to limit the gap between rich and poor.” That’s what he calls “the frontier between absolute poverty and relative poverty.” The first refers simply to an arbitrarily determined level (which the negative income tax addresses) and the other to overall disparities between individuals (which social security and the welfare state address).\nIn Stoléru’s eyes, “the market economy is capable of assimilating actions to combat absolute poverty” but “it is incapable of digesting overly strong remedies against relative poverty.” That’s why, he argues, “I believe the distinction between absolute poverty and relative poverty is in fact the distinction between capitalism and socialism.” So, what’s at stake in moving from one to the other is a political issue: acceptance of capitalism as the dominant economic form, or not.\nFrom that point of view, Foucault’s barely masked enthusiasm for Stoléru’s proposal was part of a larger movement that went along with the decline of the egalitarian philosophy of social security in favor of a very free-market-oriented fight against “poverty.” In other words, and as surprising as it may seem, the fight against poverty, far from limiting the effects of neoliberal policies, has in reality militated for its political hegemony.\nSo it’s not surprising to see the world’s largest fortunes, like those of Bill Gates or George Soros, engaging in this fight against poverty even while supporting, without any apparent contradiction, the liberalization of public services, the destruction of all these mechanisms of wealth redistribution, and the “virtues” of neoliberalism.\nCombatting poverty thus permits the inclusion of social questions on the political agenda without having to fight against inequality and the structural mechanisms that produce it. So this evolution has been part and parcel of neoliberalism, and the objective of my text is to show that Foucault had his share of responsibility in this development.", "url": "https://www.jacobinmag.com/2014/12/foucault-interview/"}