{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:57:19", "date_modify": "2020-05-04 16:57:19", "date_publish": "2014-08-18 17:46:47", "description": "Check out CNN's Fast Facts for information about the Kurdish people.", "filename": "2014_08_18_world_kurdish-people-fast-facts_index_1588611439.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150225161553-ctw-kurds-in-iraq-00003308-super-169.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2014_08_18_world_kurdish-people-fast-facts_index_1588611439.html", "title": "Kurdish People Fast Facts", "title_page": "Kurdish People Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's some background information about the Kurdish people. Kurds do not have an official homeland or country. Most reside within countries in the Middle East including northern Iraq , eastern Turkey, western Iran and small portions of northern Syria and Armenia.\nAbout the Kurdistan region\nArea: Roughly 74,000 sq mi\nPopulation: approximately 25-30 million (some Kurds reside outside of Kurdistan)\nReligion: Most are Sunni Muslims ; some practice Sufism, a type of mystic Islam\nOther Facts\nKurds have never achieved nation-state status, making Kurdistan a non-governmental region and one of the largest stateless nations in the world.\nPortions of the region are recognized by two countries: Iran, where the province of Kordestan lies; and northern Iraq, site of the autonomous region known as Kurdistan Regional Government (KRG) or Iraqi Kurdistan.\nKurds were mostly nomadic until the end of World War I and the breakup of the Ottoman Empire.\nTimeline\nOctober 30, 1918 - (TURKEY) - The Armistice of Mudros marks the defeat of the Ottoman Empire in World War I.\nNovember 3, 1918 - (IRAQ) - With the discovery of oil in the Kurdish province of Mosul, British forces occupy the region.\nAugust 10, 1920 - (TURKEY) - The Treaty of Sèvres outlines the dissolution of the Ottoman Empire, with Turkey renouncing rights over certain areas in Asia and North Africa. It calls for the recognition of new independent states, including an autonomous Kurdistan. It is never ratified.\nJuly 24, 1923 - (TURKEY) - The Allies and the former Ottoman Empire sign and ratify the Treaty of Lausanne, which recognizes Turkey as an independent nation. In the final treaty marking the conclusion of World War I, the Allies drop demands for an autonomous Turkish Kurdistan. The Kurdish region is eventually divided among several countries.\n1923 - (IRAQ) - Former Kurdish Governor Sheikh Mahmud Barzinji stages an uprising against British rule, declaring a Kurdish kingdom in Sulaimaniya in northern Iraq.\n1924 - (IRAQ) - British Forces retake Sulaimaniya.\n1943-1945 - (IRAQ/IRAN) - Mustafa Barzani leads an uprising, gaining control of areas of Erbil and Badinan. When the uprising is defeated, Barzani and his forces retreat to Kurdish areas in Iran and align with nationalist fighters under the leadership of Qazi Muhammad.\nJanuary 1946 - (IRAN) - The Kurdish Republic of Mahābād is established as a Kurdish state, with backing from the Soviet Union. The short-lived country encompasses the city of Mahābād in Iran, which is largely Kurdish and near the Iraq border. However, Soviets withdraw the same year and the Republic of Mahābād collapses.\nAugust 16, 1946 - (IRAQ) - The Kurdish Democratic Party of Iraq (KDP) is established.\n(IRAN) - The same day, (IRAQ) - The Kurdish Democratic Party of Iraq (KDP) is established.(IRAN) - The same day, Massoud Barzani is born in Kurdish Republic of Mahābād\n1957 - (SYRIA) - 250 Kurdish children die in an arson attack on a cinema. It is blamed on Arab nationalists.\n1958 - (SYRIA) - The government formally bans all Kurdish-language publications.\n1958 - (IRAQ) - After Iraq's 1958 revolution, a new constitution is established, which declares Arabs and Kurds as \"partners in this homeland.\"\n1961 - (IRAQ) - KDP begins a rebellion in northern Iraq. Within two weeks, the Iraqi government dissolves the Kurdish Democratic Party.\nMarch 1970 - (IRAQ) - A peace agreement between Iraqi government and Kurds grants the Kurds autonomy. Kurdish is recognized as an official language, and an amendment to the constitution states: \"the Iraqi people is made up of two nationalities: the Arab nationality and the Kurdish nationality.\"\nMarch 6, 1975 - (ALGERIA) - (ALGERIA) - Iraqi President Saddam Hussein and Shah Mohammed Reza Pahlavi of Iran sign a treaty. Iraq gives up claims to the Shatt-al-Arab waterway, while Iran agrees to end its support of the independence seeking Kurds.\nJune 1975 - (IRAQ) - Former (IRAQ) - Former KDP Leader Jalal Talabani , establishes the Patriotic Union of Kurdistan (PUK). The following year, PUK takes up an armed campaign against the Iraqi government.\n1978 - (IRAQ) - KDP and PUK forces clash, leaving many dead.\nLate 1970s - (IRAQ) - The Baath Party, under Hussein's leadership, uproots Kurds from areas with Kurdish majorities, and settles southern-Iraqi Arabs into those regions. Into the 1980s, Kurds are forcibly removed from the Iranian border as Kurds are suspected of aiding Iranian forces during the Iran-Iraq War.\n1979 - (IRAQ) Mustafa Barzani dies in Washington. His son, (IRAQ) Mustafa Barzani dies in Washington. His son, Massoud Barzani, is elected president of KDP following his death.\n1980 - (IRAQ) - The Iran-Iraq War begins. Although the KDP forces work closely with Iran, the PUK does not.\n1983 - (IRAQ) - PUK agrees to a cease-fire with Iraq and begins negotiations on Kurdish autonomy.\nAugust 1984 - (TURKEY) - PKK launches violent separatist campaign in Turkey, starting with killing two soldiers. The conflict eventually (TURKEY) - PKK launches violent separatist campaign in Turkey, starting with killing two soldiers. The conflict eventually spreads to Iran, Iraq and Syria\n1985 - (IRAQ) -The cease-fire between Iraq and PUK breaks down.\n1986 - (IRAQ) - After an Iranian-sponsored reconciliation, both KDP and PUK receive support from Tehran.\n1987 - (TURKEY) - Turkey imposes state of emergency in the southeastern region of the country in response to PKK attacks.\nFebruary-August 1988 - (IRAQ) - During It is believed that (IRAQ) - During Operation Anfal (\"spoils\" in Arabic), created to quell Kurdish resistance, the Iraqi military uses large quantities of chemical weapons on Kurdish civilians. Iraqi forces destroy more than 4,000 villages in Kurdistan.It is believed that some 100,000 Kurds were killed.\n1990-1991 - (IRAQ) - The (IRAQ) - The Gulf War begins when Hussein invades Kuwait seeking its oil reserves. There is a mass exodus of Kurds out of Iraq as more than a million flee into Turkey and Iran.\nFebruary 28, 1991 - (IRAQ) - Hussein agrees to a cease-fire, ending the Gulf War.\nMarch 1991 - (IRAQ) - Kurdish uprising begins, and in two weeks, the Kurdish militia gains control of Iraqi Kurdistan, including the oil-rich town of Kirkuk. After allied support to the Kurds is denied, Iraq crushes the uprising. Two million Kurds flee, but are forced to hide out in the mountains as Turkey closes its border.\nApril 1991 - (IRAQ) - A safe haven is established in Iraqi Kurdistan by the United States, the United Kingdom and France. Iraqi forces are barred from operating within the region, and Kurds begin autonomous rule, with KDP leading the north and PUK leading the south.\n1992 - (IRAQ) - In an anti-PKK operation, 20,000 Turkish troops enter Kurdish safe havens in Iraq.\n1994-1998 - (IRAQ) - PUK and KDP members engage in armed conflict, known as the Fratricide War, in Iraqi Kurdistan.\n1998 - (IRAQ) - The conflict between KDP and PUK ends, and a peace agreement is reached. This is brokered by the United States, and the accord is signed in Washington.\n2002 - (TURKEY) - Under pressure from the (TURKEY) -Under pressure from the European Union , Turkey legalizes broadcasts and education in the Kurdish language. Turkish forces still combat PKK, including military incursions into northern Iraq.\nMay 2002 - (TURKEY) - The European Union designates the PKK as a terrorist organization.\nFebruary 1, 2004 - (IRAQ) - (IRAQ) - Two suicide bombs kill more than 50 people in Erbil . The targets are the headquarters of KDP and PUK, and several top Kurdish officials from both parties are killed.\nMarch 2004 - (SYRIA) - Nine people are killed at a football (soccer) arena in Qamishli after clashes with riot police. Kurds demonstrate throughout the city, and unrest spreads to nearby towns in the following days, after security forces open fire at the funerals.\nJune 2004 - (TURKEY) - State TV broadcasts Kurdish-language programs for the first time.\nApril 6-7, 2005 - (IRAQ) - Kurdish leader Talabani is selected the country's president by the transitional national assembly, and is sworn in the next day.\nJuly 2005 - (TURKEY) - Six people die from a bomb planted on a train by a Kurdish guerrilla. Turkish officials blame the PKK.\n2005 - (IRAQ) - The 2005 Iraqi constitution upholds Kurdish autonomy, and designates Kurdistan as an autonomous federal region.\nAugust-September 2006 - (TURKEY) - A wave of bomb attacks target a resort area in Turkey, as well as Istanbul. Separatist group (TURKEY) - A wave of bomb attacks target a resort area in Turkey, as well as Istanbul. Separatist group Kurdistan Freedom Falcons (TAC) claims responsibility for most of the attacks and threatens it will turn Turkey into \"hell.\"\n2009 - (TURKEY) - A policy called the Kurdish Initiative increases Kurdish language rights and reduces military presence in the mostly Kurdish southeast.\nSeptember 2010 - (IRAN) - A bomb detonates during a parade in Mahābād, leaving 12 dead and dozens injured. No group claims responsibility for the attack, but authorities blame Kurdish separatists. In 2014, authorities arrest members of Koumaleh, a Kurdish armed group, for the attack.\nApril 2011 - (SYRIA) - (SYRIA) - Syria grants citizenship to thousands in the Kurdish region. According to Human Rights Watch, an exceptional census stripped 20% of Kurdish Syrians of their citizenship in 1962.\nOctober 2011 - (SYRIA) - Meshaal Tammo, a Syrian Kurdish activist, is assassinated. Many Kurds blame (SYRIA) -Meshaal Tammo, a Syrian Kurdish activist, is assassinated. Many Kurds blame Syrian President Bashar al-Assad 's regime for the assassination.\nOctober 19, 2011 - (TURKEY) - (TURKEY) - Kurdish militants kill 24 Turkish troops near the Iraqi border, a PKK base area.\nJune 2012 - (TURKEY) - Turkish forces strike PKK rebel bases in Iraq after a PKK attack in southern Turkey kills eight Turkish soldiers.\nJuly 2012 - (SYRIA) - Amid (SYRIA) - Amid the country's civil war , Syrian security forces retreat from several Kurdish towns in the northeastern part of the country.\nAugust 2012 - (TURKEY) - (TURKEY) - Turkish Prime Minister Recep Tayyip Erdogan warns that any attempts by the PKK to launch cross-border attacks from Syria would be met by force ; the Turkish Army then performs a large exercise less than a mile from border villages now controlled by the Syrian Kurdish group Democratic Union Party (PYD).\nDecember 2012 - (TURKEY) - (TURKEY) - Erdogan announces the government has begun peace talks with the PKK.\nJanuary 10, 2013 - (FRANCE) - (FRANCE) - Three Kurdish women are found shot dead in Paris , one of whom was a founding member of the PKK.\nMarch 21, 2013 - (TURKEY) - Imprisoned (TURKEY) - Imprisoned PKK founder Abdullah Ocalan calls for dialogue : a letter from him is read in the Turkish Parliament, \"We for tens of years gave up our lives for this struggle, we paid a price. We have come to a point at which the guns must be silent and ideas must talk.\"\nMarch 25, 2013 - (TURKEY) - Turkish Prime Minister Erdogan and Iraqi Kurdistan Prime Minister Nechirvan Barzani negotiate a (TURKEY) - Turkish Prime Minister Erdogan and Iraqi Kurdistan Prime Minister Nechirvan Barzani negotiate a framework deal that includes an outline for a direct pipeline export of oil and gas. The pipeline would have the Kurdish crude oil transported from the Kurdish Regional Government directly into Turkey, allowing the KRG to be a competitive supplier of oil to Turkey.\nDecember 2, 2014 - (IRAQ) The government of Iraq and the government of Iraqi Kurdistan sign an agreement to share oil revenues and military resources. Iraq will now pay the salaries of Peshmerga fighters battling ISIS and act as an intermediary to deliver US weapons to Kurdish forces. The Kurdistan government will deliver more than half a million barrels of oil daily to the Iraqi government. Profits from the sale of the oil will be split between the two governments.\nMarch 21, 2015 - (TURKEY) In a letter read to thousands during a celebration in the city of Diyarbakir, (TURKEY) In a letter read to thousands during a celebration in the city of Diyarbakir, imprisoned PKK leader Abdullah Ocalan urges fighters under his command to lay down their arms , stop waging war against the Turkish state and join a \"congress.\"\nMay 18, 2015 - (TURKEY) In the run-up to parliamentary elections on June 7, an (TURKEY) In the run-up to parliamentary elections on June 7, an explosion rocks the office of the Kurdish People's Democratic Party (HDP) in Adana , in southeastern Turkey. Six people are injured.\nJune 16, 2015 - (SYRIA) Kurdish forces in the Syrian town, Tal Abyad say they have defeated ISIS fighters and (SYRIA) Kurdish forces in the Syrian town, Tal Abyad say they have defeated ISIS fighters and taken back the town on the Turkish border.\nJune 23, 2015 - (SYRIA) Kurdish fighters announce that they have taken back the town of Ain Issa, located 30 miles north of the ISIS stronghold, Raqqa, a city proclaimed to be the capital of the caliphate. A military base near Ain Issa, which had been occupied by ISIS since last August, is abandoned by the terrorist group the night before the Kurdish forces seize the town.\nMarch 13, 2016 - (TURKEY) A (TURKEY) A car bomb attack kills at least 37 people in Ankara . The Kurdistan Freedom Falcons, or TAK -- an offshoot of the Kurdish separatist group PKK -- takes responsibility for the attack.\nMarch 17, 2016 - (SYRIA) Kurds declare that a swath of northeastern Syria is now a separate autonomous region under Kurdish control. The claim stirs up controversy, as Syrian and Turkish officials say it goes against the goal of creating a unified country after years of civil war.\nJuly 20, 2016 - (TURKEY) Following a failed coup attempt, President Erdogan declares a state of emergency. In the first three months, pro-Kurdish media outlets are shut down, and tens of thousands of civil servants with alleged PKK connections are dismissed or suspended. The purge includes ministers of parliament, military leaders, police, teachers, and mayors, including in the Kurdish-majority city of Diyarbakir.\nSeptember 25, 2017 - (IRAQ) Iraqi Kurds vote in favor of declaring independence from Iraq. (IRAQ) Iraqi Kurds vote in favor of declaring independence from Iraq. More than 92% of the roughly 3 million people vote \"yes\" to independence.", "url": "https://www.cnn.com/2014/08/18/world/kurdish-people-fast-facts/index.html"}