{"authors": ["Keeanga-Yamahtta Taylor", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:17", "date_modify": "2020-05-04 19:50:17", "date_publish": "2014-12-17 00:00:00", "description": null, "filename": "2014_12_no-more-eric-garners_1588621817.html", "image_url": "https://images.jacobinmag.com/2014/12/17001919/3c36896v1-e1467942714615-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_12_no-more-eric-garners_1588621817.html", "title": "No More Eric Garners", "title_page": "No More Eric Garners", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Coming within days of each other, the grand jury decisions not to indict the police officers responsible for the deaths of Michael Brown and Eric Garner have produced a genuine crisis in American policing. Its defenders are scrambling to hold onto whatever fraying threads of legitimacy remain.\nLast week, in response to the wave of protests in Ferguson following the grand jury announcement, an unprecedented meeting brought grassroots anti-police-brutality activists into the same room with President Barack Obama, Vice President Joe Biden, and Attorney General Eric Holder. Out of this and other discussions, Obama emerged with a set of proposals he hopes will restore confidence in law enforcement, including a pilot program for fifty thousand police to wear body cameras, a review of how local police departments utilize military equipment, and a new commission to study policing and community relations.\nThe announcement from the White House barely had time to make a ripple before the non-indictment of Garner’s killer reduced the plan to a pile of junk. In one stroke, the idea that body cameras would make a decisive difference in whether a police officer would be held responsible for the death of an innocent and unarmed person collapsed — and with it, the centerpiece of Obama’s reforms.\nThe focus on body cameras assumes that the reason violent and brutal police aren’t punished is because of the absence of visual evidence or proof. But this has nothing to do with it, as the Garner case makes clear. Instead, violence in American policing goes unpunished because the criminalization of black people has legitimized brutality, humiliation, incarceration, and even murder as reasonable practices.\nThat Obama and Holder have launched initiatives to address policing in black communities, and yet phrases like “racial inequality,” “mass incarceration,” and “racial profiling” are never invoked, raises questions as to whether this is a serious inquiry or a stalling mechanism designed to give the impression that action is being taken while they buy time in the hopes that black Americans will cool off.\nIn fact, it is impossible to imagine any serious response to police brutality in black communities not involving undoing the “war on drugs” and all of the resulting effects of mass incarceration.\nThe cumulative impact of these policies has cemented the public perception that all working-class African-American men and women are suspicious and worthy of close scrutiny and surveillance. Police transform these perceptions into policy, as black communities are targeted and suffer overwhelmingly disproportionate rates of “stops and frisks,” frivolous arrests, and other engagement that can only be described as harassment.\nThis is the essence of the “broken windows” theory of policing — first pioneered in New York City during the first reign of current police chief William Bratton, but now practiced across the country. The theory is that if low-level offenses are aggressively policed, more serious offenses will be deterred. In reality, this approach to policing has criminalized entire communities, leading to thousands of frivolous arrests that ruin people’s lives.\nMoreover, policing in the neoliberal era relies on all sorts of statistics that document the rise and fall of crime and incentivize the manipulation of numbers to shape the perception of crime-fighting in a given locality. Politicians regularly invoke arrest numbers, crime rates (when they’re going down), and other supposed markers of crime-fighting as evidence of their competence — big city police chiefs parlay these statistics into pay raises and political capital. They are all getting fat off the destruction of the lives of the young black men and women, who are the overwhelming victims of American policing and unjust practices in the wider judicial system.\nNone of the reforms that Obama and Holder or New York City Mayor Bill de Blasio are suggesting will do anything to address these systemic issues. Instead, Obama’s commission on policing in the twenty-first century is likely to produce many of the same “reforms” that created the problems in the first place.\nThe commission is to be led by former Assistant Attorney General Laurie Robinson and Philadelphia Police Commissioner Charles Ramsey. Placing these two people at the helm of a commission aimed at curbing errant police conduct in black communities is akin to putting the fox in charge of investigating a rash of attacks on chickens. It’s literally absurd.\nAll one needs to know about Robinson is that she worked in the Department of Justice for seven years during the Clinton administration, when the US became known as the “incarceration nation.” Under Clinton, the federal and state prison populations rose faster than under any other administration in American history, and the black incarceration rate tripled.\nAs an assistant attorney general, Robinson had her fingerprints all over Clinton’s signature crime legislation, which included the immoral and racist expansion of the death penalty, as well as the adoption of the “three strikes and you’re out” sentencing rule that helped explode the prison population across the nation.\nAs for Ramsey, the idea that any law enforcement official from Philadelphia could have any meaningful contribution to the national discussion on curbing police brutality and racism in black communities is an affront to common sense.\nPhiladelphia is, of course, home to a police union that remains committed to using its resources to keep black political prisoner Mumia Abu-Jamal behind bars. It is also where the police participated in the 1985 bombing of activists from MOVE, a black counterculture organization.\nAside from these spectacular examples of police misconduct and racism, there is the daily targeting of black communities, which has, to take just one example, led to disproportionate rates of arrest and imprisonment for nonviolent drug offenses. Despite the fact that blacks and whites use marijuana at about the same rate, blacks are four times more likely to be arrested and charged with possession. According to one study, of those arrested in Philadelphia in 2012 for marijuana possession, 3,052 were black, compared to 629 whites.\nWhat is Ramsey’s role in this? Even though the Philadelphia City Council voted to ease laws criminalizing pot possession, Ramsey spent last summer insisting that his police department would continue to arrest people for possession. His public statement: “I am not in favor at all of any form of [marijuana] legalization . . . We still have to treat [marijuana possession] as a misdemeanor until we are told otherwise by state law . . . State law trumps city ordinances.”\nFinally, since Ramsey became chief of police in 2008, the city of Philadelphia has paid out $40 million to settle lawsuits involving wrongful shooting deaths, illegal searches, or excessive force complaints.\nJust last May, Philadelphia was forced to pay $14 million to settle a civil rights lawsuit against police that involved 128 plaintiffs. In 2012, the city negotiated deals on several different cases of police misconduct, at a cost of $8 million. As one lawyer who successfully sued the city explained about Philly police, “The rank and file have no expectation that their behavior is ever going to be subject to any real, meaningful review . . . That becomes admissible evidence that shows the city is not properly supervising and disciplining officers.”\nWhat on earth does the Philadelphia Police Department have to teach the nation about ending racism and brutality in American policing?\nThis is a crisis that won’t go away. As the US continues to assert its authority internationally, the ugly fact of white police officers murdering and abusing black men and women looms over American actions abroad. It renders hollow the kind of rhetoric that Barack Obama employed when he framed the new US war on ISIS back in September, saying:\n[O]ur endless blessings bestow an enduring burden. But as Americans, we welcome our responsibility to lead. From Europe to Asia, from the far reaches of Africa to wartorn capitals of the Middle East, we stand for freedom, for justice, for dignity. These are values that have guided our nation since its founding.\nThese comments didn’t fit reality then, but today, they are completely absurd. The US has not an ounce of credibility when it comes to any discussion about freedom, justice, and dignity.\nAt home, Obama has directly inserted himself into this crisis, and in doing so, he is raising the expectations of African Americans that he will finally use his office to do something other than chastise black people. Talking about the Garner case, Obama said, “We are going to take specific steps to improve the training and the work with state and local government when it comes to policing in communities of color. . . We are going to be scrupulous in investigating cases where we are concerned about the partiality and accountability that’s taking place.”\nBut the question remains how, when all the parties involved refuse to address the systemic issues involving criminalization, racial profiling, and mass incarceration. How many more commissions and investigations are needed to come to the obvious conclusion that the police operate above the law, and that legal institutions generally view black people, especially black men, as expendable?\nWhen the police and other state-sanctioned vigilantes are killing African Americans at a rate of one every twenty-eight hours, people won’t accept toothless reforms meant to quell anger while doing absolutely nothing to punish, imprison, and disarm the real menace — the agents of the state who terrorize African-American communities with impunity.", "url": "https://jacobinmag.com/2014/12/no-more-eric-garners"}