{"authors": ["Loren Balhorn", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:46", "date_modify": "2020-05-04 19:58:46", "date_publish": "2014-12-17 00:00:00", "description": null, "filename": "2016_12_reformation-christianity-communism-2_1588622326.html", "image_url": "https://images.jacobinmag.com/2014/12/17002159/Cranach-prague-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_12_reformation-christianity-communism-2_1588622326.html", "title": "A Very Kautsky Christmas", "title_page": "A Very Kautsky Christmas", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nReading Karl Kautsky today is a peculiar undertaking. For starters, there is the burning question of “who actually reads Kautsky?” Vilified by the Bolsheviks and their descendants for, in their eyes, betraying the Marxist principles his writings had done so much to popularize, yet still too Marxist for comfort in the rightward-moving Social Democratic Party of Weimar Germany, the “Pope of Marxism” has largely been consigned (along with Georgi Plekhanov, Bruno Bauer, and others) to the pile of seemingly-important authors one should at least have read about, but is not obligated to actually read. Once we move beyond this first peculiarity, we are confronted with the second: namely, that a lot of what Kautsky writes is quite good. Sure, his work is riddled with over-simplifications and teleological projections that hold little water a century after the fact. But to reduce his Marxism to these shortcomings alone is to ignore one of the most important socialists of the twentieth century. Kautsky’s most significant contribution — namely, systematizing classical Marxist theory into a series of easily understandable, digestible works fit for mass consumption — brought socialist theory and politics into the hearts and minds of millions of European workers at the turn of the last century. Kautsky was considered a “Pope” not due to unassailable ecclesiastic authority or backroom intrigues within the upper ranks of the SPD, but rather because he represented one of the main authorities on Marxist theory in an age where the spirit of revolution was sweeping up the German working classes like never before (and never since). He sat at the pinnacle of an expanding workers’ movement, whose promises of inevitable socialist transformation seemed plausible and within reach. He wrote for an audience of millions of eager, attentive militants, and no doubt felt a sense of responsibility to use his authority to imbue the spirit of class consciousness in his readers. This spirit runs through Communism in Central Europe at the Time of the Reformation , in which Kautsky traces the revolutionary egalitarian impulses of subaltern Protestant currents in the Middle Ages, identifying both an “egalitarian communism” of the poor and downtrodden masses, as well as an intellectualized “Utopian communism” of the educated upper classes. Communism in Central Europe was originally part of a much larger, untranslated work titled Die Vorläufer des neuen Sozialismus (“The Forebearers of Modern Socialism”) before being published in English as a stand-alone text. The book is Kautsky’s attempt to reconstruct human history as a history of class struggles, in order to imbue his readers with a sense of historical tradition, revolutionary continuity, and moral obligation to the socialist future. Kautsky sees communism historically as developing in two spheres: communism as the intellectual, ideological task of imagining a society free of poverty and exploitation; and communism as the real, living struggle of the oppressed and exploited for a better existence. Though it is only under conditions of developed capitalism that a unity of these spheres is possible — realized, for Kautsky, in the form of the industrial proletariat endowed with Social Democratic leadership — that does not mean that people throughout history have not already been fighting for a better world. In the book’s introduction, Kautsky urges his readers to familiarize themselves with the history of communism in order to more fully appreciate the meaning and historical necessity of the struggle and to become better socialists because of it. “The Influence of Christian Tradition” describes how the world of ideas propelled communist discourses forward, even under precarious and backwards material conditions. Kautsky shows how the oppressed of the Middle Ages drew on Christian teachings, specifically the Gospels, to develop a moral critique of the inequality and unfairness they experienced in life. He depicts a world dominated by the Church and drenched in Catholic dogma, but one in which the very individuals responsible for propagating this dogma (the Church and the ruling classes) had long ceased to believe in it themselves. Religious doctrine was drilled into the masses in order to prevent other, potentially dangerous ideas from filling that space. Christianity served as an ideological fog to mystify the workings of feudal expropriation, but was not a material force as such. Protestantism turned Catholic dogma on its head (or perhaps on its feet?), ushering in a relative democratization of Biblical interpretation and theological discussion. This democratization at first allowed for the building of broad alliances against Papal authority, uniting elements of the bourgeoisie with the disenfranchised peasant masses. According to Kautsky, however, these interpretations were also open to much more radical conclusions — the prospect of “democratic communism” — which made them dangerous not only to the Church but also to the ruling class as a whole, and in turn encouraged the bourgeois leadership of the Reformation to bring things back under control as soon as possible. “The Influence of Christian Tradition” demonstrates that wherever and whenever people are oppressed, they will invariably find a language to articulate their feelings of oppression. These languages are often wanting and mediated by the historical circumstances in which they arise, but they always serve this purpose. Throughout history, oppression and exploitation have never gone unopposed, nor do they today. The task, then as now, is to take up the already-existing languages and practices of the exploited and illuminate them with the prospect of a democratic communism for the twenty-first century. Kautsky may not have much to tell us about what that goal means today, but his exhaustive survey of how previous generations of “political and rebellious” communists sought a better world in their time can serve as inspiration for the next generation. Below is an excerpt from Communism in Central Europe .\nThe transmission by tradition of ideas originating in earlier conditions of society has an important influence on the march of events. It often retards the progress of new social tendencies, by increasing the difficulty of arriving at an apprehension of their true nature and requirements. At the close of the Middle Ages, on the contrary, it favored their development. After the violent disturbances which took place during the general migrations of nations and the barbarism that followed it, and from the time of the Crusades, the peoples of occidental Christendom began to rise to a scale of civilization which, in spite of its peculiar characteristics, accorded in many respects with the highest point attained by Attic and Roman society just before the decline. Literature, that treasury of thought bequeathed by this society to succeeding generations, harmonized fully with the needs of the newly rising classes at the close of the Middle Ages. The revival of ancient literature and learning fostered to an extraordinary degree the self-consciousness and self-knowledge of these classes, and in consequence became a powerful motive force in social progress. Under such circumstances tradition, usually conservative in its influence, became a revolutionary factor. It was natural that each class should appropriate to itself from the treasury of tradition whatever best accorded with its condition. Burgesses and princes appealed to the Roman law, because it appeared to them well adapted to the needs of simple production, trade, and the despotic power of the State. They rejoiced in pagan literature – a literature of the pleasures of life and even of wantonness. Neither the Roman law nor classic literature could please the proletariat and its sympathisers; they found what they were seeking in another product of Roman society – the Gospels . The traditional communism of primitive Christianity was well-suited to their own necessities. As the foundations of a higher order of communistic production were not yet laid, theirs could only be an equalizing communism; which meant the division and distribution of the rich man’s superfluity among the poor who were destitute of the necessaries of life. The communistic doctrines of the Gospels and Acts of the Apostles did not create the analogous tendencies of the Middle Ages, but they favoured the growth and dissemination of the latter quite as much as the Roman law aided the development of absolutism and the bourgeoisie. Hence the Christian and religious basis of the communistic tendencies. Conflicts were inevitable with the Church, the richest among the rich, which had indeed for a long time denounced the demands of the prevailing communism as a devilish heresy, and had sought by all kinds of sophistries to distort and obscure the communistic purport of primitive Christian writings. If, however, the effort to establish a communistic order of society necessarily conduced to heresy, so, on the other hand, the struggle with the Church favoured the growth of communistic ideas. The time had not yet come when men could harbor the thought of dispensing with the Church. It is true that during the declining period of the Middle Ages there existed in the towns a culture far above that represented by the hierarchy. The newly rising classes – the princes with their courtiers, the merchants, the Roman jurists – were at that time far from being Christian-minded, and were, indeed, still less so the nearer to Rome they resided. The metropolis of Christendom was itself the headquarters of unbelief. Any new form of government or secular bureaucracy which could step into the place of the spiritual organization had scarcely begun to be fashioned, and the Church as a supreme governing power remained indispensable for the ruling, i.e., for the unbelieving classes. The task of the revolutionary portions of society was not to destroy the Church, but to conquer it, and, by its means, to govern the community and advance their own interests, just as, in the present day, it is the work of the proletarians to conquer the state and make it subservient to their own ends. The increase of unbelief among the upper classes led them to concern themselves more than hitherto about the orthodoxy of the lower orders, and to use every means in their power to withhold from the latter every form of culture which could raise their views above the horizon of the Christian doctrines; no very difficult task certainly, for the social condition of the peasants, handicraftsmen, and proletarians was such that it was impossible for them to attain to a higher culture. Nevertheless, the Papal Church gained very little by this circumstance; for it did not prevent the development of great popular movements against the money-making hierarchy. Its only effect was to enable the participants in these movements to appeal with greater weight to religious arguments in confirmation of the reasonableness of their efforts. The literary productions of primitive Christianity offered an arsenal full of weapons to all those who, on any grounds whatsoever, might wish to confiscate the wealth of the Church; for it was fairly evident from these writings that Jesus and his disciples were poor, and that they required voluntary poverty in their followers; but the wealth of the Church belonged not to the priesthood, but to the community. The return to primitive Christianity, the restoration of “the pure Word of God” which the Papal Church had falsified and interpreted in a sense opposed to the true one – these were the objects striven for by all parties and classes who were enemies to the papacy. It must be confessed that each of these parties construed the “pure Word of God” differently and in a manner consonant with its own interests. Only on one point were they unanimous – the despoliation of the Church. It is true that the various Protestant parties diverged from each other widely with regard to the question whether that “pure Word” demanded the reorganisation of the Church government or the introduction of the community of goods. As, however, according to the evidence of tradition, democratic organisation and community of goods had existed in primitive Christianity, any one who reverenced that form of Christianity must have had very large interests in the opposite state of things to enable him to find anything in the “pure Word of God” upholding different views. Hence every candid member of the propertied classes who took part in a heretical movement, and was in a position to raise himself mentally above the interests and prejudices of his particular faction, could with comparative ease be won over to democratic communism. This was especially the case so long as the Papal government was regarded by the wealthy classes opposing it as an over-powerful enemy, while at the same time communism seemed to be the harmless toy of eccentric idealists. Their partisanship of the communistic doctrine would, however, cease when they were confronted with the necessity of uniting all antagonistic elements in one phalanx. At first, heretical communism showed itself to be dangerous only to the accumulation of wealth by the papacy, and hence easily acquired the tolerance of the upper classes, where these were heretically minded. Taking all these circumstances into consideration, it is comprehensible that, at the period when heretical movements had as their object the overthrow of the Papal power, communistic tendencies were able to acquire a force and vogue out of all proportion to the strength, extent, and self-consciousness of the proletariat. But directly they made any attempt to assail the whole existing order of society, instead of uniting their efforts with those of the wealthy classes against the papacy only, the collapse of heretical communistic movements was, as a rule, sudden and inevitable, apparently leaving no trace behind it. The class-character of these movements from the twelfth and thirteenth centuries to the era of the Reformation was much more effectually concealed by the veil of religion, under whose guise they first made their appearance, than was the case with the other popular agitations of that period. This resulted from the circumstances already enumerated, viz., the lack of class-feeling among the poor, a proportionately greater interest in communistic strivings among the wealthy (merchants, nobles, and particularly the ecclesiastics), and the powerful literary influence of the communistic records of primitive Christianity. Nevertheless, the spirit of the proletariat had already impressed itself upon communistic movements. The proletariat of the Middle Ages differed from the proletariat of Rome in the days of her degeneration, and also from that of modern times. Moreover, the communism which it upheld differed from that of primitive Christianity and from that of the nineteenth century. It constituted a transitional stage between the two.", "url": "https://jacobinmag.com/2016/12/reformation-christianity-communism-2"}