{"authors": ["Kim Moody", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:49", "date_modify": "2020-05-04 19:58:49", "date_publish": "2014-04-16 00:00:00", "description": null, "filename": "2014_04__1588622329.html", "image_url": "https://images.jacobinmag.com/2014/04/16234833/Screen-Shot-2014-04-10-at-12.03.54-PM-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_04__1588622329.html", "title": "Reviving Labor From Below", "title_page": "Reviving Labor From Below", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "KM\nThe thing about American business union leaders is that they’re not all stupid. They figured out way back when that they were in trouble, and something needed to change. You may remember or have read about John Sweeney taking over the AFL-CIO on this program of reorganization and new strategies and tactics in the mid-1990s.\nSome of those reforms were good (although all of the reform seemed to be located in Washington, DC, rather than everywhere). There was a new attitude that was supposed to be more militant. And yet somehow, labor-management cooperation kept being part of this. Quite obviously, the Sweeney-era reforms didn’t work. Membership kept dropping, contracts got worse, wage increases and benefits were being taken away. So that failed.\nWe had a second try at this with Richard Trumka — a much more militant guy, no doubt about it. And yet, still, reform hasn’t happened.\nBut these union leaders did come up with some ideas. One of them was, okay, we’re having problems organizing because the whole National Labor Relations Act and National Labor Relations Board system is bankrupt. It has been turned on its head and is now a barrier to unionization.\nSo what do you do about this? Well, in the old days, you’d have strikes. But that wasn’t so easy anymore. So they came up with the idea of the neutrality agreement. We can’t go through the NLRB anymore, so the thinking goes, because it doesn’t work very often (although many unions still do it). So we’re going to go to the employer and ask them to sign an agreement that they will remain neutral if there is an organizing drive. Accompanying that is often the idea of card check: instead of agreeing to an election, the employer agrees to let us, the union, simply sign up a majority of people on union cards.\nSo all this sounds pretty good. And in fact, it did work in a number of situations, and using neutrality and card check was very popular for a while — many unions still use them. But the Great Recession seemed to kill them. When these agreements worked, it was often when the union already had a bargaining relationship with the company, and they were going after a subsidiary or something.\nBut the vast majority of American employers are not interested in neutrality. Of course, if you’re asking the employer to be neutral in an agreement, they’re going to ask something from you. So the company agrees not to badmouth the union, but they also demand that the union not badmouth the company. This is part of the reason why the UAW failed to organize Volkswagen in Chattanooga.\nSo the neutrality agreement has been, at best, extremely limited, and at worst a failure as an overall strategy, because capital in America is not about to be “neutral” about anything.\nSeparately, there are the alternative forms of worker organization, particularly workers centers. I think these are good things — don’t get me wrong. They have an important function to play: they bring people into unions, but they also have an independent function, particularly in immigrant communities, of waging fights where it’s not yet possible or it’s too difficult for the workers to organize a union.\nBut one has to look at the reality of power relationships in society. And the reality is that these organizations do not have much social power. They’re also often funded by foundations, which is a tricky business — I’m not saying that they shouldn’t take that money, but it can be a bit of a problem.\nSo they’re a good development, but they’re not going to solve the problem of the working class and of the labor movement.\nNow, the latest thing in top-down reform at the last AFL-CIO convention is to embrace the idea of these alt-labor organizations. In one sense, that’s a very good thing. But in another sense, it’s like the top leadership of the labor movement saying, “The way we’re going to solve our problem is to bring in somebody else,” when the fundamental problem of the weakness of American unions is not being addressed.\nThe good thing about some of the organizations that have come along is that they raise ideas that labor needs to pay attention to — not just the leadership, but the members, too. They emphasize that direct action has to be part of the package. If you don’t disrupt, if you don’t bring things to a halt, if you don’t stop business as usual, you’re not going to be able to successfully fight back. All of that is essential. But labor-community coalitions are not going to be a panacea.", "url": "https://www.jacobinmag.com/2014/04/reviving-labor-from-below/"}