{"authors": ["Lois Weiner", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:55:33", "date_modify": "2020-05-04 19:55:33", "date_publish": "2014-05-16 00:00:00", "description": null, "filename": "2014_05_how-to-thank-a-new-york-city-teacher_1588622133.html", "image_url": "https://images.jacobinmag.com/2014/05/16235010/3346044174_4f1a6a3945_o-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_05_how-to-thank-a-new-york-city-teacher_1588622133.html", "title": "How to Thank a Teacher", "title_page": "How to Thank a Teacher", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "This week is “Teacher Appreciation Week.” Should we mark the occasion? How? Why?\nTeaching is still “women’s work” — 85 percent of K–12 teachers are female. Teaching is taxing work that requires skill and knowledge, the ability to think quickly on one’s feet and be caring. Managing learning for a room of thirty (or more) people is the preeminent form of multi-tasking.\nYet teaching’s difficulty and value are inadequately recognized by our society (as is parenting). Few schools give teachers the resources and support they need to do their jobs well, one of which is the opportunity to work with colleagues, students and parents as partners, learning from and with them. And because of the linkage between standardized testing and teachers’ evaluations, teachers’ professional judgment has been circumscribed, teaching’s nurturing functions undercut; frightened themselves, local school officials increasingly demand subservience from teachers. A climate of fear exists in many schools.\nIt is teachers unions’ task to educate parents and citizens about the supports needed for high-quality teaching and learning to occur, and to fight for conditions that allow teachers to do their jobs well. Because union contracts narrow the scope of bargaining, the union has to push self-consciously against those restraints.\nPart of this struggle is insisting on a salary that is commensurate with the skill, knowledge, and difficulty of the work — a professional wage. Teachers cannot do their best when they don’t earn enough to support themselves and their families. They also cannot serve kids well when they are fearful of poor evaluations and losing their jobs if they speak honestly about what is happening in their schools and classrooms.\nWe face an enormous challenge. The superbly orchestrated propaganda campaign against teachers and teachers unions, in support of a privatized school system run by moguls and billionaires through the politicians they have persuaded or bought, has configured teachers and teachers unions as blocking improvements in education for kids who most need high-quality schools and teachers. And the reforms being pushed by both parties use the rhetoric of putting “students first” to destroy public ownership of schools and limit opportunity.\nHow should we deal with the daunting task of changing the public perception of teachers and our work? We see how to do it with the success of the Chicago Teachers Union, about which much has been written. In contrast, we see how not to do it with the proposed United Federation of Teachers contract in New York City, which continues the failed policies of “business unionism.” A bureaucratic process of developing contract proposals has been accompanied by little or no member involvement in pushing for real improvement in working conditions. This has, unsurprisingly, yielded a poor contract.\nThe UFT’s leadership clique publicized the proposed contract as a victory — before members were given the contract language. All union members had was a description of “contract highlights,” released to the press as well. The ensuing publicity, endorsements by national media and a prominent liberal friend of the AFT leadership, was intended to make teachers feel that rejecting this contract is a futile gesture.\nThat is, the media, politicians, and UFT officers have worked to minimize space for union members to decide for themselves whether the contract makes their work better and improves schools.\nThe question New York City teachers should ask themselves in deciding how to vote on this contract proposal is, “Will this contract improve education for NYC kids?” The answer, for me, is a decisive “no.”\nThe contract contains a few elements that are especially pernicious:\nA career ladder — “merit pay” without the label. If it weren’t designed to serve as “merit pay,” we would allow teachers to do these jobs at their same pay. The new positions being created will likely help teachers to help kids, so we should demand that more of these positions be created — at the same pay. The career ladder will pit teachers against one another for the pay increase, reinforce the erroneous idea that we can improve teaching by rewarding the “well-deserving” individuals, and weaken solidarity in the school. The changes in the “redesigned” school day don’t touch the kind of transformation of working conditions teachers and students desperately need. Those have to be made by empowered school leadership teams — about which this contract is silent. As schools are closed and replaced by charters, more and more teachers will be put into the pool of displaced teachers. Teachers’ lack of protections in this process weakens the union and increases teachers’ fears. Every teacher is in danger of being placed in this pool, but the displacements affect older teachers and teachers of color disproportionately. This new contract weakens the position of displaced teachers — and in doing so harms the union and kids. Pay: The press hammers on this issue because they know that half of New Yorkers live at or below the poverty level. The union’s focus on pay reinforces the public perception that the union and teachers are totally self-interested. Yes, teachers deserve a professional wage and the union must fight for that. But that demand must be embedded in a vision for a very different kind of schooling that can win parents and community to our side.\nAre New York teachers ready to hear this message? Teachers’ work now consists of more than what we do in our classrooms. Our job is to speak truth about what New York kids need and deserve — and demand that our unions organize us with our allies to win those conditions.\nThe NEA is publicizing National Teachers Week by having supporters use social media to #thankateacher; the AFT and the AFL-CIO have joined this campaign. On the other hand, President Obama has marked the occasion by proclaiming this “National Charter Schools Week.”\nWe’re not going to defeat the policies Obama is pushing with the kind of contract the UFT has negotiated. I suggest we #thankateacher by urging New York teachers to reject the proposed contract they’ve been told to ratify.", "url": "https://www.jacobinmag.com/2014/05/how-to-thank-a-new-york-city-teacher"}