{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:15", "date_modify": "2020-05-04 19:57:15", "date_publish": "2014-01-16 00:00:00", "description": null, "filename": "2014_01_the-schizophrenic-state_1588622235.html", "image_url": "https://images.jacobinmag.com/2014/01/16234315/issue13_aschoff-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_01_the-schizophrenic-state_1588622235.html", "title": "The Schizophrenic State", "title_page": "The Schizophrenic State", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The real Eliot Ness wasn’t nearly as cool as De Palma made him out to be in The Untouchables . But no matter, Neil Barofsky was still pretty chuffed when Treasury officials likened him to the Prohibition agent. Barofsky felt like Ness during his twenty-seven months in the DC swamp, where “bullshit, ego, politics, turf, and credit” ruled the day, and only he and his SIGTARP (Special Inspector General of the Troubled Asset Relief Program) team stood between Wall Street bankers and hundreds of billions of bailout dollars. Last year Barofsky published Bailout: How Washington Abandoned Main Street While Rescuing Wall Street . The book is a memoir of sorts that aims to call attention to the “hijacking of both the bailouts and the government itself by a handful of Wall Street financial institutions and their executives.” Barofsky hopes that the American people will be as pissed off as he was when, as director of SIGTARP, he found out that Washington had been “captured by the banks.” He wants us to wake up and do something to “break our system free from the corrupting grasp of the megabanks.” A noble objective, to be sure. The Office of the SIGTARP is a special agency established by Congress in 2008. SIGTARP’s website posts quarterly reports, offers a hotline to report TARP abuse, boasts about sending bankers to jail, and warns Americans about mortgage-modification scams. SIGTARP was the result of a compromise between the Executive and Congress over the implementation of TARP, a hotly contested piece of legislation originally designed to provide Treasury with a pool of money to buy up toxic assets, alleviate the mortgage crisis, and restart credit flows. Congress didn’t want to write a blank check to the Executive, but got queasy at the prospect of a financial meltdown. SIGTARP is designed to act as a watchdog for American taxpayers, using its law-enforcement capacity to prevent fraud, waste, and abuse linked to the $700 billion bailout program. In Bailout , Barofsky recounts his bafflement at being nominated for the directorship. Surely the fact that he was “a nobody” with an “aversion to bullshit and hypocrisy that occasionally led to an Asperger’s-like bluntness” would make him unsuitable for the adventure. No, no, Barofsky was perfect for the job. His background as a prosecutor for the Southern District of New York, combined with his experience busting mortgage fraud and his stint investigating the Revolutionary Armed Forces of Colombia prepared him to fight the Treasury. Just in case, he brought his lucky dead-FARC-soldier bayonet — a memento from the “esteemed” Colombian National Police — to Washington with him. TARP had already doled out hundreds of billions of dollars to the banks by the time Barofsky and his right-hand man, Kevin Puvalowski, got keys to their office — conveniently located next the Treasury cafeteria and atop a broken sewage pipe. The space, a harbinger of things to come, screamed, “Welcome to Washington, asshole. Fuck you. Really, I mean it. Fuck. You.” Barofsky had to quickly learn the ropes, face a Congressional hearing, find people willing to work for SIGTARP, get garbage cans for the office, and convince Treasury to start enacting fraud regulations before the next bailout installment to the banks went out. Hank Paulson (Secretary of the Treasury under Bush) had just pulled a major bait-and-switch, using the latitude given to Treasury by the TARP bill to create the Capital Purchase Program (CPP) — a straight-up bailout of the banks — instead of using TARP funds to buy up toxic assets, as originally intended. Through the CPP program, Treasury funneled money directly to big banks like Morgan Stanley and Goldman Sachs by buying up preferred shares of stock. According to Paulson, avoiding the looming problem of bad assets and underwater mortgages was justified because the CPP program would stimulate lending and “get credit flowing.” Looking over the program his first few days in office, Barofsky realized that there was no protection against banks “cooking their books” to make themselves look healthy enough to qualify for TARP funding, and no language forcing banks to actually use the money to get credit flowing again. When Barofsky tried to convince Treasury to introduce oversight mechanisms into the CPP contracts, Treasury was adamantly opposed, arguing that SIGTARP oversight would frighten banks away from participating. The Bush-Obama changeup brought preparation for a new bailout program called TALF (Term Asset-Backed Securities Loan Facility). The program was designed to resuscitate the securitization market by lending $200 billion from the New York Federal Reserve to hedge funds, financial institutions, and other big investors to buy new TALF bonds — bonds formed by lumping together student loans, car loans, credit-card debt, and small-business loans. Investors could borrow 95 percent of the money they needed to buy the bonds from the Fed, and if the bonds turned out to be worthless, no problem. The loans were “non-recourse loans,” so the borrower could simply give the bonds back and be off the hook for the money. Aside from providing a taxpayer-funded floor on losses, TALF was ripe for fraud, particularly collusion between bond buyers and sellers. When Barofsky confronted Treasury about the program’s problems, they gave him the brush-off — said he didn’t understand “that the biggest players in these programs — the big banks and investment firms — would never risk their reputations by trying to rip off the government. The reputational damage they’d suffer would be far greater than any potential profit.” Besides, the bonds would be AAA-rated by the credit-rating agencies, so the taxpayer could rest assured that the “loans backing the bonds were properly underwritten.” These, of course, are the same rating agencies that wildly overrated the asset-backed securities that caused the crisis in the first place, but William Dudley (acting President of the New York Fed) was hopeful, saying: “. . . we’re confident [the ratings agencies] won’t risk being embarrassed again.” Ever the wordsmith, Barofsky later told Puva-lowski: “These guys haven’t just drank the Wall Street Kool-Aid, they ripped open the packets, added the water, stirred it up, and are now serving it to us on a $700 billion taxpayer-funded service platter.” Amid all this, Treasury still hadn’t done squat about TARP’s mandate to stem foreclosures. Following Tim Geithner’s confirmation and months of criticism from members of Congress, it issued a vague pronouncement about a $50 billion housing program. When Barofsky asked the department for details about the plan, he got the usual run-around, with officials saying no details had been finalized. Yet a week later, President Obama unveiled the Home Affordable Mortgage Program (HAMP) at a speech in Arizona. HAMP was designed to modify mortgages for millions of homeowners whose mortgages were underwater. Treasury would contract out the job to mortgage-service providers who would be paid for every mortgage they modified. Unbeknownst to SIGTARP, Treasury had been quietly working on the program for months with BlackRock and the Trust Company of the West Group — two giant investment houses that stood to profit from the program. The program was a disaster. HAMP didn’t provide homeowners with a way to reduce their principal and offered no relief for people who’d lost their jobs. Barofsky begged Treasury to at least make a public-service announcement warning homeowners against mortgage fraudsters pretending to be part of HAMP, but Treasury refused. The program was so disorganized that Treasury changed the mortgage-modification rules nine times in the first year, and the average homeowner applicant had to submit paperwork to their mortgage servicer six times. The program was also rampant with abuse. Many homeowners were told by their mortgage servicer to stop making payments on their mortgages so they could qualify for HAMP and participate in the trial-mortgage modification program. The mortgage servicer would then collect late fees while the owner waited months and months for the trial modification to be finalized. Many homeowners were rejected after months of waiting and slapped with a “deficiency” bill, charging them for the difference between their trial mortgage monthly payments and their original monthly payments, along with a mountain of late fees. Barofsky and Puvalowski were baffled. Why would the Treasury launch such a shoddy, ill-designed, underfunded program? Calls to SIGTARP’s helpline were nonstop, but it seemed like Treasury really didn’t care at all about the suffering of so many borrowers. Instead, the program appeared to be just more gravy for the banks. Barofsky later discovered in a meeting with Geithner that this was precisely the purpose of HAMP. It was designed to “foam the runway,” giving banks relief from the surge of foreclosures by stretching them out over a longer period of time, thus allowing the banks to absorb the losses more slowly while they pulled in bailout money through the other TARP programs. “HAMP was not separate from the bank bailouts; it was an essential part of them.” HAMP and TALF were just two examples of the 24/7 TARP clusterfuck. The SIGTARP team was flummoxed by the behavior of the Treasury in its response to the crisis. Why had it shown such callous disregard for the American taxpayer while pushing truckloads of free money onto the banks with no strings attached? For Barofsky, the answer is simple: “the entire crisis was unleashed by the greed of a small handful of executives who exploited a financial system that guaranteed that no matter what risks they took . . . the US taxpayer would cover their losses. . . . The US government had been captured by the banks.”\nMark Blyth agrees that the bailout was executed poorly. He even questions whether the banks should have been bailed out at all. But he doesn’t buy the bad apples theory. In his recent book, Austerity: The History of a Dangerous Idea , Blyth argues that “the moral failings of individuals are irrelevant for understanding both why the financial crisis in the United States happened and why austerity is now perceived as the only possible response, especially in Europe.” Instead, the crisis happened because capital and the US state have been following a faulty “instruction sheet” for the past thirty-five years. The central thrust of Austerity fits with Blyth’s broader theory of institutional change that emphasizes the power of ideas to shape societies and, in particular, institutions like the state. Blyth argues that a new set of ideas emerged during the crisis of Keynesianism. These ideas ultimately delegitimized the Keynesian instruction sheet and replaced it with a new one emphasizing neoclassical principles like inflation control and monetary stability. Blyth argues that the inability of Keynesian ideas to effectively address the economic and political crisis of the 1970s created a moment in which the embedded liberal order became vulnerable to attack from business groups and their political allies who opposed the Keynesian principles of a strong state and redistributive growth. Amid the crisis, these groups were able to develop a new instruction sheet that displaced old ways of thinking about political economy, and they forged a new consensus that ultimately coalesced into a new neoliberal institutional order. In contrast to Barofsky’s account, in which the state was hijacked by a few greedy Wall Street bankers, Blyth emphasizes how powerful ideas wrote the state into irrelevance and created a climate in which the financial sector could do no wrong. In the process, the role of the state was reduced to nothing more than a provider of “courts, weights, measures, and defense goods” because the instruction sheet demanded that the state “stay as far away from the market process as possible.” Blyth’s book has two main interconnected goals. The first is to argue that “this crisis is first and foremost a private-sector crisis” and was definitely not caused by state profligacy. Instead, “seemingly unconnected and opaque parts of the global system of finance came together to produce a crisis that none of those parts could have produced on its own.” The toxic cocktail combined three parts financial shenanigans — collateral deals in the US repo markets, mortgage-backed derivatives and repo transactions, and correlation and tail risk — with one part climate of bad ideas resulting from hegemonic neoclassical economic theories. If the state played any role in causing the crisis, it was “cause only by omission” because “states chose not to regulate derivative markets.” Included in the neoliberal instruction sheet is a centuries-old prescription for dealing with financial crisis that we thought had gone the way of “old-time religion”: austerity. Thus, the second emphasis of the book is on how a private-sector banking crisis was transformed into a sovereign debt crisis in which the rest of us are forced to pick up the tab. In a political-economic turn that would have Polanyi rolling over in his grave, austerity is once again being heralded as the only possible solution in Europe, with devastating consequences. In the early days of the financial meltdown, when US bankers and government officials were running around like chickens with their heads cut off, it looked like Europe might get through the financial crisis relatively unscathed. But European leaders were quickly disabused of this notion when it became clear that European banks had been engaging in their own shady practices. Blyth synthesizes the problem nicely: European banks had been gorging on sovereign bonds from the PIIGS (Portugal, Italy, Ireland, Greece, Spain), which had a slightly higher yield than Northern European bonds, and had become so hyper-leveraged (40 to 1 in some cases) that they were literally too big to bail, let alone fail. The problem, of course, is that European countries, thanks to that “doomsday machine called the euro,” can’t enact their own stimulus programs like the US is doing. Only the European Central Bank can print money, and it’s founded on a set of “ordoliberal” monetary principles that say “if states have broken the rules the only possible policy is a diet of strict austerity to bring them back into conformity with the rules.” The problem with this strategy, Blyth convincingly argues, is that it won’t work because austerity doesn’t work. It’s also “unfair” and leads to dangerous social outcomes. After all, as Blyth reminds us, the Nazis rode to power on a wave of public fury caused by disastrous austerity policies during the Weimar Republic. If austerity is so dangerous and ineffective, why are the European states willing to swallow the austerity cure again? Blyth gives three reasons. First, “in a democracy you can hardly come clean about what you’re doing and expect to survive.” If European leaders admit that they’re really just bailing out the banks, they’ll be out of a job. Second — and this is related to the first reason — the “epistemic hubris” behind the European monetary project has created an institutional framework that is simply “incapable of resolving the crisis it faces,” resulting in permanent austerity. And finally, the most important reason: “What we learned in the 1930s has been forgotten.” We all forgot that austerity doesn’t work. Blyth argues that the whole ugly decade of the 1930s taught society (economists included) that austerity doesn’t work, but in the time since then “broad ideological and institutional shifts” have “bit by bit brought austerity back to the status of common sense.” This last explanation beggars belief. Anyone watching Latin America in the 1980s and 1990s, Africa for the last three decades or more, Russia after the collapse of the Soviet Union, and on and on, is certainly aware that austerity doesn’t work. That it wreaks havoc on the societies in which it is enacted. That it destroys ways of life and quite literally kills people. We know these things. Blyth acknowledges that austerity was tried “with limited success in the Global South,” but apparently only the good folks over at the World Bank were paying attention. European policy makers haven’t had time to pick up a copy of Stiglitz’s Globalization and its Discontents . This blind spot in Blyth’s analysis betrays more than Eurocentrism. It is part of a blinkered view of the global economy that is most apparent in his perspective on why the US, which supposedly follows a much stricter neoliberal instruction sheet than Europe, is not following an austerity program. According to Blyth: “when the crisis hit, the United States may have been on the right ideologically, but it was very much on the left in terms of economic policy.” But “if austerity becomes the policy mantra of the United States anytime soon . . . we can expect it to be equally destructive there, too.” Currently, the US is dumping truckloads of money into the financial sector every second of every day. The Federal Reserve buys $85 billion worth of low-interest-rate Treasury bonds and mortgage-backed securities every month. This is certainly not to say that the austerity hawks hold no sway in the US. They do. This year’s budget sequestration — a result of the 2011 Budget Control Act — will cut $85 billion from the budget in the 2013 fiscal year, and there’s a good chance the Fed will drift in a hawkish direction despite the recent nomination of “dovish” Janet Yellen. But in the broader scheme, the US state is not following austerity principles. Instead, it is following a twisted neoliberal form of Keynesianism in which the US state dumps money indiscriminately into the financial markets hoping that they will correct themselves, or reboot themselves, or whatever markets “naturally” do, while screwing over the working class. But according to the neoliberal instruction sheet, this shouldn’t be happening. This type of stimulus is precisely the kind of thing Milton Friedman railed against, so why is it happening at a time when neoliberalism seems stronger than ever? Blyth gives a simple explanation: Americans love us some guns — we have seventy million handguns alone. But most of us don’t have a lot of money. When Lehman collapsed, and the possibility of empty ATMs loomed, the US government was terrified that we would take our guns and go all Death Wish on each other. This fear, combined with the potential collapse of the US banks’ collective asset footprint, sent “US policy makers running to the tool shed for a solution.” The solution: TARP.", "url": "https://jacobinmag.com/2014/01/the-schizophrenic-state"}