{"authors": ["Susanne Soederberg", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:49:47", "date_modify": "2020-05-04 19:49:47", "date_publish": "2014-10-17 00:00:00", "description": null, "filename": "2014_10__1588621787.html", "image_url": "https://images.jacobinmag.com/2014/10/17001114/166785777_5844bcd874_b-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_10__1588621787.html", "title": "The New Loan Sharks", "title_page": "The New Loan Sharks", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Before World War I, American wage earners who couldn’t make ends meet before their next paycheck relied on an insidious form of loan sharks known as salary lenders. These predators lent money at an illegal rate of interest and without collateral. They often charged annual interest rates in excess of 1,000 percent. State sanctions against salary lenders were not rigorously imposed, and the industry thrived not through the threat of physical violence, but the illusion of a legal obligation.\nFast-forward one hundred years, and salary lending has expanded, but under a different name: payday lending, a wildly lucrative industry that occupies more storefronts than McDonald’s and Starbucks combined. These new loan sharks operate under the same logic as salary lenders, but specifically target more vulnerable populations like welfare recipients, and are armed with new techniques to squeeze as much surplus as possible from debtors.\nPayday loans are small, short-term, unsecured cash advances that are due on the borrower’s next payday (usually two weeks) or government benefit (e.g. social security or welfare check). The average profile of a payday borrower is a single mother with young children earning approximately $40,000 who lives an economically precarious life in which an additional expense — such as an illness, divorce, or seasonal financial pressures (think back-to-school supplies or Christmas expenses) — is too much. For those struggling to get by, the industry is ready to lend, at a cost.\nThe dependence of the poor on this privately created money (aka “credit”) is neither natural nor inevitable. It is a social reality manufactured by neoliberal policies. In particular, payday lending has been facilitated by an important yet largely neglected component of neoliberal governance: the debtfare state.\nAlongside other components of neoliberalism such as workfarism (replacing welfare provisioning with work) and prisonfare (criminalizing poverty), debtfarism aims to regulate social insecurity by expanding the credit system: payday loans, student loans, credit card debt.\nSimultaneously, the same forces promoting debtfarism advance social and economic policies that serve to reproduce this very precariousness. Such policies include draconian bankruptcy laws (such as George W. Bush’s Bankruptcy Prevention Abuse and Consumer Protection Act of 2005), lax usury laws, and watered-down consumer-protection laws.\nThe rhetorical and regulative interventions of debtfarism facilitate both the widespread reliance of the poor on privately created money as well as the extraction of interest and fee-based revenue through the poverty industry, with payday lenders as its avatar.\nThe payday loan industry is dominated by a few players, including Advance America (recently purchased by Mexican billionaire Ricardo Salinas Pliego). Far from existing on the margins of the financial system, many of these large payday lenders are plugged directly into Wall Street, with banks such as Wells Fargo, J. P. Morgan Chase, and Bank of America supplying the direct credit lines that finance this poverty industry.\nWhen regulations and interest-rate caps have cropped up at the state level, national banks have frequently protected payday lenders — for a price — under “rent-a-bank” partnerships. Since national banks are not subject to the same usury laws set by states, payday lenders have been able to circumvent regulatory limits.\nEager to profit from the poverty industry, national banks such as US Bancorp and Wells Fargo created their own payday loan products (called “direct deposit advances” or “checking account advances”) with triple-digit interest rates to serve their checking account customers. (They got rid of their payday loans earlier this year under threat of federal regulation.)\nNeoliberal policies have created a ludicrous situation in which payday loans appear to be a rational option for debt-strapped individuals, despite the exorbitant rates of interest they’re forced to pay. The average payday loan carries triple interest rates, with averages ranging from 364 to 550 APR.\nAnd the industry makes even more off “rollover loans.” Nearly 90 percent of its revenues are based on fees stripped from borrowers who have renewed their loans and are caught in a cycle of debt. A typical borrower has an outstanding payment for thirty weeks and ultimately pays $800 for a $300 loan.\nPayday lenders base their business strategy on the assumption that customers will be more likely to take out payday loans if a store is close to their workplace. Some observers have even suggested that the only factors payday borrowers take into account are convenience of location, ease of process, and speed of approvals, thereby reinforcing the representation of the poor as ignorant, indolent, and irrational.\nYet debtfarism has facilitated the construction of this convenience in at least two ways. First, in a world of deregulated interest rates, national banks are permitted to charge over 4,000 percent (median) interest rates on overdraft checks — twenty times greater than payday loans. This has created an outrageous environment in which payday loans have become a cost-effective alternative for cash-strapped workers.\nSecond, the payday industry actively targets particular populations, including African-American and Latino neighborhoods, and urban areas with higher concentrations of people on public assistance, people in the military, or immigrants.\nIn specific cases, this targeting has prompted strong political responses. When the Pentagon raised concerns about the high numbers of military personnel linked to payday loans and how this dampened troop morale, interest rates for the military were suddenly capped at 36 APR through the Military Lending Act of 2006.\nEfforts at the state level to instate tougher restrictions have been less successful. Whenever voters have pressed for interest rates caps or outright bans, legislatures have provided enough slack to allow payday lenders to keep thriving.\nConsider, for example, the Short-Term Loan Act, which the Ohio state legislature passed in 2008 to curb predatory payday lending. This ostensibly progressive legislation capped the maximum loan amount at $500, set a maximum APR of twenty-eight, made the maturity date a minimum of thirty days, and banned lenders from issuing more than four loans per year to the same borrower. This appeared to throw considerable sand in the industry’s rollover mechanism.\nBut the payday lending industry found an out. They identified two major loopholes in two other pieces of state legislation. Exploiting these legal gaps, lenders charged even higher APR than previously allowed. A year later, payday lenders in Ohio were levying triple-digit interest rates, issuing loans in amounts exceeding $500, and requiring that loans be repaid within two weeks or less if borrowers wanted to avoid penalties.\nIn the aftermath of the 2008 subprime crisis, and in the renewed spirit of debtfarism in reforming predatory practices through lightweight consumer-protection laws, two federal bills were introduced in 2009 to restructure the payday lending industry: the Payday Loan Reform Act and the Protecting Consumers from Unreasonable Credit Rates Act. Unsurprisingly, neither passed. Moreover, each bill has a built-in ambiguity that allows the payday lending industry to engage in business-as-usual behavior.\nIn fact, the annual earnings of the payday lending industry have never been higher, revealing how financial crises can strengthen neoliberal capitalism. The lack of regulatory rigor promoted by debtfarism has also facilitated the rapid growth of the poverty industry’s NextGen: online payday lenders such as BillFloat, Zest, Think Finance, Kabbage, and On Deck. These virtual actors will prove more difficult to regulate than their brick-and-mortar brethren.\nStronger regulation of payday lenders is an important short-term goal. But simply pushing consumer-protection legislation confines us within the limits of debtfarism and its attempts to regulate and normalize a world in which workers are compelled to turn to marketized safety nets in the absence of a living wage.\nWe should reject a reality in which (temporary) relief from the structural violence of capitalism is available only as a point of sale at a payday lending store. Public forms of social protection should be available to all citizens, not just corporations and the wealthy in the form of tax breaks and bailouts.\nWe therefore need to collectively attack the roots of the poverty industry, demanding nothing less than the establishment of living wages and the eventual decommodification of labor; the rejection of workfarism in favor of inclusive and non-punitive social programs; and robustly funded public education, healthcare, and housing.\nThere is an alternative, and we shouldn’t allow the poverty industry’s distorted reality to convince us otherwise.", "url": "https://www.jacobinmag.com/2014/10/the-new-loan-sharks/"}