{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:21:29", "date_modify": "2020-05-04 16:21:29", "date_publish": "2014-12-04 19:20:59", "description": "Read Fast Facts from CNN about Rand Paul and learn more about the US senator from Kentucky.", "filename": "2014_12_04_us_rand-paul-fast-facts_index_1588609289.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150721061741-rand-paul-june-9-2015-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2014_12_04_us_rand-paul-fast-facts_index_1588609289.html", "title": "Rand Paul Fast Facts", "title_page": "Rand Paul Fast Facts - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the life of Rand Paul, US senator from Kentucky.\nPersonal\nBirth date: January 7, 1963\nBirth place: Pittsburgh, Pennsylvania\nBirth name: Randal Howard Paul\nFather: Ron Paul , former presidential candidate and retired US representative from Texas\nMother: Carol (Wells) Paul\nMarriage: Kelley (Ashby) Paul\nChildren: Robert; Duncan; William\nEducation: Attended Baylor University, 1981-1984; Duke University School of Medicine, M.D., 1988\nReligion: Christian\nOther Facts\nHe is not named after author Ayn Rand; his nickname was shortened from \"Randy.\"\nFormer president and longtime member of the Lions Club International.\nWas active in the congressional and presidential campaigns of his father, Ron Paul.\nTimeline\n1993 - Completes his ophthalmology residency at Duke University Medical Center.\n1994 - Founds grassroots organization Kentucky Taxpayers United, which monitors state taxation and spending. It is legally dissolved in 2000.\n1995 - Founds the Southern Kentucky Lions Eye Clinic, a non-profit providing eye exams and surgeries to those in need.\nAugust 5, 2009 - Announces on Fox News that he is running as a Republican for the US Senate to represent Kentucky.\nMay 18, 2010 - Defeats Secretary of State Trey Grayson in the Kentucky GOP Senate primary.\nNovember 2, 2010 - Paul is elected to the Senate, defeating Jack Conway.\nJanuary 5, 2011 - Sworn in for the 112th Congress. It is the first time a son joins the Senate while his father concurrently serves in the House. Ron Paul retires from the House in 2013.\nJanuary 27, 2011 - Participates in the inaugural meeting of the Senate Tea Party Caucus with Senators Mike Lee and Jim DeMint.\nFebruary 22, 2011 - Paul's book \"The Tea Party Goes to Washington\" is published.\nFebruary 12, 2014 - Paul and the conservative group FreedomWorks file a class-action lawsuit against Paul and the conservative group FreedomWorks file a class-action lawsuit against Obama and top national security officials over the government's electronic surveillance program made public by intelligence leaker Edward Snowden. The lawsuit is later dismissed.\nDecember 2, 2014 - Paul announces his bid for a second term in the Senate.\nMay 20, 2015 - After 10 hours and 30 minutes, After 10 hours and 30 minutes, Paul ends his \"filibuster\" over National Security Agency surveillance programs authorized under the Patriot Act. Paul's speech wasn't technically a filibuster because of intricate Senate rules, but his office insists it was a filibuster.\nAugust 5, 2015 - The Justice Department The Justice Department indicts two officials from a Rand Paul Super PAC for conspiracy and falsifying campaign records. During the 2012 presidential primary season, Jesse Benton and John Tate allegedly bribed an Iowa state senator to get him to endorse Ron Paul. Benton and Tate go on to help run one of the Super PACs supporting Rand Paul, America's Liberty PAC. Both men are later convicted.\nFebruary 3, 2016 - Announces that he is Announces that he is suspending his campaign for the presidency.\nNovember 8, 2016 - Wins a second term in the Senate, defeating Democrat Jim Gray.\nJanuary 29, 2019 - A jury awards him more than $580,000 in his lawsuit against the neighbor who attacked him in 2017. The amount includes punitive damages and payment for pain and suffering as well as medical damages.\nAugust 5, 2019 - Paul says part of his lung had to be Paul says part of his lung had to be removed by surgery following the 2017 attack by Boucher.", "url": "https://www.cnn.com/2014/12/04/us/rand-paul-fast-facts/index.html"}