{"authors": ["Russell Saltamontes", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:11", "date_modify": "2020-05-04 19:59:11", "date_publish": "2014-10-17 00:00:00", "description": null, "filename": "2014_10__1588622351.html", "image_url": "https://images.jacobinmag.com/2014/10/17000737/Chrysler-strikers-warn-away-scabs-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_10__1588622351.html", "title": "A Union County", "title_page": "A Union County", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "On Labor Day weekend, with thousands spread out across the lawn that fronts the Black River in downtown Lorain, Ohio, the president of the county AFL-CIO, Harry Williamson, glowingly introduced Tim Carrion, a leader in the city’s large Latino community. Carrion then took the stage and announced he was running for mayor in the 2015 election to bring “new leadership, new ideas, and a vision of solidarity.”\nAfter his remarks, as a raffle drawing for big-screen televisions closed out the day’s festivities and the sun set behind Lorain’s abandoned Ford plant, people discussed the dramatic effect Carrion’s run would have on local politics. They were right, and maybe not just about Lorain.\nSo what’s going on in northern Ohio? Most leftists outside of the state first heard of Lorain after last year’s municipal elections, when, on the heels of the victories of Kshama Sawant in Seattle and Bill de Blasio in New York City, Labor Notes published a story about Lorain’s independent labor slate.\nAlthough the article erroneously reported that twenty-two independent labor city councilors were elected in Lorain (in fact, twenty-two out of twenty-four labor-endorsed candidates won in the state of Ohio, thirteen of which were in Lorain County, three of whom ran as independents), what’s happening in Lorain does deserve attention. The county’s labor movement represents an important model for trade unionists looking to build political power and successfully challenge neoliberalism at the municipal level.\nLorain is a diverse county of 300,000 people, just west of Cleveland and located on the banks of Lake Erie. It includes the poor, heavily black and Latino industrial cities of Lorain and Elyria, affluent Cleveland suburbs like Amherst, the progressive college town of Oberlin, and a swath of small farming communities.\nLike much of the Rust Belt, Lorain’s economy has changed dramatically in the past twenty years. Describing the economy when he was growing up, Carrion says, “If you lost your job today, you could be working at another factory tomorrow.” The late 1990s and early 2000s saw the closure of what had once been Ford’s largest auto factory and the dramatic contraction of steel production, with Lorain’s biggest steel mill cutting employment from over 15,000 to less than 4,000.\nNevertheless, Lorain County still has thousands of auto and steelworkers, most of whom are union members, and the other big employers in the county — hospitals and healthcare companies, the public sector, and Oberlin College — are also heavily unionized. Nearly everyone has a family member in a union, or knows someone personally who is in a union.\nStill, none of the local unions are big enough to mount independent political action alone. What distinguishes Lorain, and what has made the kind of political program labor has undertaken there possible, is an unalloyed commitment to that most traditional of union values: solidarity.\nThree events last year triggered labor’s decision to challenge Democratic candidates: the local Democratic Party’s decision in January to appoint County Chamber of Commerce President Frank DeTillio to a city council seat instead of union teacher Josh Thornsberry; Democratic Mayor Chase Rittenauer and his city council allies’ repeal in March of a Project Labor Agreement (PLA) that had taken three years to negotiate and pass under the previous mayor; and Rittenauer’s breaking of a strike by unionized sanitation workers in April, when the mayor himself scabbed and drove a garbage truck.\nIn many places, these would have been seen as separate issues requiring separate responses: a problem for the teachers union, a problem for the Building Trades, a problem for the Teamsters (who represent sanitation workers). But in Lorain, they were treated as three attacks on organized labor in four months that demanded a unified response.\nLorain’s labor leaders were used to working closely together. For twenty years, they had been jointly planning and executing Ohio’s largest Labor Day Festival. Union members had walked one another’s picket lines and helped with one another’s organizing drives. In 2005, organized labor fought the construction of a Walmart, eventually using a referendum to block a plan in which a local official would have made hundreds of thousands of dollars selling the proposed site for the store. In 2011, Lorain’s labor movement led the successful fight to defeat Ohio’s draconian anti-union law, Senate Bill 5.\nThey had also been centrally involved (as unions almost always are) in the Democratic Party’s local campaigns, providing money, volunteers, and votes to elect progressive, pro-labor Democrats like Representative Marcy Kaptur, Senator Sherrod Brown, and the steelworker mayor who preceded Rittenauer, Tony Krasienko.\nIn a sense, then, running candidates for local office was nothing new. Still, directly confronting the Democratic Party, who have long controlled politics and policy, was without precedent.\nIn Lorain, the local elite is comprised of wealthy attorneys, affluent property owners, and the scions of political dynasties. Running independent candidates in last year’s election was a direct challenge to this circle of elites, and they took it as such. Two labor leaders were officially reprimanded and then banned from attending party meetings.\nYet despite the strenuous efforts of local Democrats, labor’s candidates won. In Josh Thornsberry’s ward, his union-backed campaign succeeded by getting Republicans and independents (a third of his ward’s voters, by Thornsberry’s estimation) to vote against the Democratic machine, and union households (estimated to be half the Democrats, or another third of the total) to vote for labor. Thornsberry personally knocked on every door in his ward — twice. Besides that, there were plenty of union members, from all different unions and trades, knocking with him. The other independent candidate for council in Lorain, Greg Argenti, won in a similar way.\nNow in office, the labor-endorsed elected officials work together, but haven’t crafted a unifying legislative agenda. They focus mostly on constituent services and neighborhood issues, like controlling seasonal flooding or planning new housing developments.\nLocal labor leaders told me this was what they had expected: not that labor-backed officeholders would push “labor’s interest” in any kind of obvious or immediate way, but that they would endeavor to be excellent city councilors. Labor’s real goal, they say, is to be part of a powerful coalition that works for a more democratic, well-functioning city, because that will mean more jobs and a better living environment for workers.\nDoing that requires running more candidates for more offices in the 2015 elections and forging a majority coalition of anti-establishment officials in city government, backed up by a diverse base of support.\nIn the 2013 elections, communities of color did not form an important part of labor’s coalition, in large part because their independent candidates, Greg Argenti and Josh Thornsberry, were running in wards that were whiter and more affluent than the city as a whole. This time around, that has to change.\nLorain’s large Latino population dates back to the early twentieth century, when US Steel and Republic Steel ruled the city and brought in migrant workers from Puerto Rico. The booming steel mills also attracted African-American and Mexican workers. Nowadays, Lorain’s well-established black, Puerto Rican, and Mexican communities comprise about a third of the city’s population, and have managed to elect some of their own to public office.\nThe broadening of the anti-establishment coalition began in earnest this year with the first meeting of what has come to be called the “VALU’s Council,” a roundtable of veteran, black, Latino, and unions leaders.\nThey came out of the meeting with a realization that they had already had much in common. For one thing, they were often quite literally the same people: many working-class people of color were active in their unions. Even non-union leaders of color and white labor leaders knew each other from years of organizing and struggle in a small city, and found they shared frustration with the way local government failed to address the challenges their constituencies faced. The cohesion among disparate unions that labor leaders had been building since the 1990s was now being extended to non-labor groups.\nThis isn’t to say the bridge-building process has been easy. Carrion, the mayoral candidate, doesn’t come from the world of organized labor. Although he was a member of the Teamsters for a couple of years, he’s spent most of his adult life as an insurance agent and community activist.\nBefore the VALUs Council, he was skeptical of the benefits of PLAs. These agreements generally didn’t help workers of color get jobs even when they had minority-hiring guidelines, because “good-faith effort” clauses allowed contractors to circumvent the guidelines with ease. However, as he worked more with labor leaders and learned how comprehensive the agreements could be, he changed his mind. “When the city is going to spend money on a project, it is important to hire local, union, and diverse workers to be effective and keep that money in the community,” he says.\nAfter the candidates that they helped elect came to office, labor leaders played a key role in negotiating a replacement for the repealed PLA; the resulting deal included minority-hiring targets that weren’t merely higher than the original, but unprecedented for the state.\nThe new agreement shows how, fundamentally, the electoral fight has impelled labor to come together with its natural allies in order to force some concessions from local elites. Labor shifted their demands to reflect their new alliance with communities of color, and got some of what they were unable to win before the election. Meanwhile, leaders outside of organized labor are realizing that many of their interests are tied up with those of labor.\nIndependent political action is an extension and expansion of workplace struggles. Even as Carrion is planning his mayoral campaign, 500 workers at Camaco, a factory in Lorain that makes seats for cars, are fighting publicly for union recognition. Organizing is happening at small construction companies. And SEIU-represented Head Start teachers are fighting for a new contract and resisting layoffs, with Building Trades and UAW workers joining them on the picket line.\nIt’s this kind of solidarity and organizing, rather than any unifying programmatic vision, that has made independent political action possible and could help labor’s coalition win control of city government next year.\nLeftists and trade unionists should look to the energy and strategic intelligence of the Lorain labor movement, which has stayed strong despite substantial changes in the community and economy because of its commitment to struggling for strong contracts, organizing new shops, and building solidarity across industry, union, race, and gender.\nIt’s important, of course, not to overstate the nature or degree of change in Lorain. Local factors like high union density make Lorain a somewhat exceptional case in a country that’s hemorrhaging union members. In addition, organized labor in Lorain is fighting for a county where politicians and bosses think twice before they cross unions. Their agenda should not be misconstrued as being any more or less radical than that. Whatever the benefits of having politicians tied to an organized, progressive working-class base, independent labor political action is not radical political action.\nStill, the accretion of political power strengthens workers’ ability to fight collectively for themselves and their communities. Victories often embolden workers, and the combination of state and workplace power, while partial and especially restricted in the municipal context, could spur organized labor to make more radical demands.\nMunicipal elections hold special promise for leftists because they are typically either nonpartisan or dominated by a single party, and relatively small amounts of money — combined with armies of committed volunteers and superior organizing — can beat much better-funded candidates.\nAt the city and county level, it often makes sense to launch electoral efforts against the local Democratic Party leadership when there is an organized political base to do so. We can see this in Sawant’s campaign in Seattle; Chokwe Lumumba’s campaign in Jackson, Miss.; and union-backed campaigns in New Haven, Conn. In addition, many of the neoliberal state’s worst abuses are felt in municipalities, whether through school closures in Chicago or police brutality in Ferguson.\nIn Lorain, decades of workplace and community organizing to improve the standard of living for working-class people finally reached a point of direct confrontation with local elites. Unions and their allies are taking this confrontation on directly, by taking solidarity seriously. For a mainstream labor movement that often seems to have forgotten that cardinal virtue, Lorain is indeed a welcome departure.", "url": "https://www.jacobinmag.com/2014/10/a-union-county/"}