{"authors": ["Shaun Ossei-Owusu", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:35", "date_modify": "2020-05-04 19:50:35", "date_publish": "2014-12-17 00:00:00", "description": null, "filename": "2014_12__1588621835.html", "image_url": "https://images.jacobinmag.com/2014/12/17001826/la-na-nn-ny-police-cameras-20141203-001-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_12__1588621835.html", "title": "The Problem with Body Cameras", "title_page": "The Problem with Body Cameras", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nAmid nationwide protests against a cascade of police violence, President Obama has offered a response to police critics and a black community that feels he has been stoically indifferent to black death: police body cameras. He’s not alone. The Congressional Black Caucus, the Lawyers’ Committee for Civil Rights Under Law, the American Civil Liberties Union and even George Zimmerman’s attorney, Mark O’Mara, support the proposal. But with the non-indictment this past week of Daniel Pantaleo, the officer who choked Eric Garner to death on camera this summer, many are skeptical of Obama’s proposal. I am too. The Garner case and the torrent of recorded black killings demonstrate the folly of thinking that body cameras are the magic potion to a four-century problem of state-sanctioned violence against racial minorities. I’m not completely opposed to body cameras, which are already in place in some cities. Anything that’s going to protect people from being brutalized and killed by police has my support. Body cameras can help resolve the conflicting accounts that often bedevil claims of police violence. Authority figures to which most defer, the accuracy of police are often assumed to be correct, especially if the other person is not alive. More clarity would be a boon. In addition, digital footage would reveal to the world, like Darren Wilson’s non-indictment, that racism in America isn’t close to being dead. It might also demonstrate to the international community how state and federal officials sometimes refuse to use the law to protect black people — a pattern that is eerily similar to early twentieth century government inaction in regards to lynching. Indeed, when North Korea is giving the United States government the Nelson Muntz “ha ha,” you know there is a problem. During the Civil Rights Movement, photography didn’t just highlight the depravity of American racism for domestic audiences, but for those around the world. The images of four innocent black girls dying at the hand of church bombers, dogs attacking people, and murdered protestors were plastered on the covers of foreign newspapers, which provoked scrutiny of the United States’ role as global policeman and displays of solidarity. Cameras could bring about similar pressure. Still, there are several reasons to be skeptical of the body camera remedy.\n1 Police Officer Discretion Questions about the specifics abound: who will have access to the recordings? How will tampering concerns be assuaged? Will cops have discretion concerning when the cameras must be taping? If so, they could simply turn the cameras off and whatever occurs would be up for dispute and subject to the same deference to police accounts that exists today. It’s likely that police will be able to darken the cameras. A recent Department of Justice-funded report states that police should have “a certain amount of discretion concerning when to turn their cameras on or off.” That is cause for concern. Consider the story of Angela Garbarino, a Louisiana woman who was arrested after a drunk driving charge in 2008. After getting into an argument with officer Wylie Willis in a booking room, Willis cut the power on the camera. When it came back on she was on the floor in a pool of blood. Garbarino ended up with two black eyes, a broken nose, and a grisly countenance. Willis claimed these injuries occurred because Garbarino fell. If this can happen to a white woman, Lord knows what will happen to a person of color if the cameras are turned off. To be sure, there are good reasons to not always have body cameras rolling — chief among them, privacy concerns. These devices could simply turn cops into walking recorders, a disconcerting possibility especially when one considers the overpolicing of minority neighborhoods. When coupled with police hostility to being filmed by pedestrians, this measure could help police neutralize one of the few accountability mechanisms that citizens possess: their ability to record instances of brutality on their phones. It could thus further shift power in favor of police. Law enforcement already has guns, the power of the state, and the presumption of truth behind them. Body cameras could provide cops with another powerful weapon: the ability to favorably frame instances of brutality.\n2 There’s Money to be Made Sometimes video footage is released because of the public’s right to know and/or to incite the rightful rage and anger that accompanies such killings. But I’m not convinced that is what is motivating these displays. Sociologist David Garland has noted how professional photographers set up shop at the scene of lynchings and “did a brisk business selling photo-souvenirs of the event. Images of mutilated black bodies, some of them horribly burned and disfigured, were purchased as picture postcards, and passed between friends and families like holiday mementoes, dutifully delivered by the US mail.” So while galvanizing can play a role in the circulation of these videos, so can profit. Who has a pecuniary interest in the proliferation of body cameras? Certainly investors and camera manufacturers. European scholar Ben Hayes puts it best in his discussion on the links between government, state agencies, and corporations, or what he calls the “surveillance industry complex.” For Hayes, “this is an undesirable relationship within which political decisions are shaped not just by democratic concern for the ‘public good’ but by profitable courses of action for private entities.” The popularity of reality television and the twenty-five-year longevity of Cops suggest that the entertainment industry might get a cut too.\n3 Technology Doesn’t Reduce Racism Body cameras are no guaranteed deterrent, and technological advances do not deal a deathblow to racism. Since the early twentieth century, white bigots publicly lynched blacks and subsequently posed for the camera in front of dead bodies. Few perpetrators were prosecuted. Technology and tangible evidence did not save these victims. More recently, video footage didn’t save Eric Garner, John Crawford, or Marlene Pinnock. We’ll see what happens with 12-year-old Tamir Rice, who police shot after receiving a call that he was brandishing a gun that was “probably fake.” Evidence, like beauty, is in the eye of the beholder. Sometimes people believe what they want to believe and see what they want to see. Public opinion data continuously indicates that many whites do not fully recognize racial inequality and the criminal justice system’s discriminatory treatment of blacks. While video might modify these obstinate views, it is hard to believe that its payoff will correspond with the hype. Additionally, will cameras matter when smear campaigns typically follow police violence? The media, the police, and their supporters often wield the alleged or actual deviant behavior of the victim to demonstrate fault and imply that he or she was deserving of violence. When a person is killed by law enforcement, it’s easy for folks to pull a page out of Rudy Giuliani’s playbook and claim that the victim was “no altar boy.” One only has to look to Brown (references to his criminal record) or Rice (invocations of his father’s domestic violence) to get a sense of this maneuver. When such “evidence” is commonly deployed to justify police slayings, it’s hard to believe that cameras will change much.", "url": "https://www.jacobinmag.com/2014/12/the-problem-with-body-cameras/"}