{"authors": ["David Espo"], "date_download": "2020-05-04 20:24:23", "date_modify": "2020-05-04 20:24:23", "date_publish": "2014-06-23 20:29:54", "description": "WASHINGTON (AP) — The White House and an influential pair of business organizations both called for renewal of the Export-Import Bank on Monday, one day after newly elected Republican House...", "filename": "_04828519076c48cc8d05e4858462428d_1588623863.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_04828519076c48cc8d05e4858462428d_1588623863.html", "title": "White House, business back Export-Import Bank", "title_page": "White House, business back Export-Import Bank", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WASHINGTON (AP) — The White House and an influential pair of business organizations both called for renewal of the Export-Import Bank on Monday, one day after newly elected Republican House Majority Leader Kevin McCarthy said the agency should be phased out.\nThe bank’s existence is fast emerging as a flashpoint in the internal Republican struggle between the business-backed establishment and conservative tea party groups.\nAsked about McCarthy’s comments, White House spokesman Josh Earnest said the bank “helps American companies create and support jobs here at home at no cost to taxpayers” and traditionally has enjoyed bipartisan support as a result.\nThe bank also returned $1 billion to the Treasury in the last budget year.\nThe government agency provides direct loans, loan guarantees and credit insurance to help foreign buyers purchase American-made products. In its 2013 annual report, it said it had approved an all-time high of 3,842 authorizations for the 12-month period, with an estimated export value of $37.4 billion. “This support is estimated to have sustained an estimated 205,000 export-related U.S. jobs,” it said.\nIts charter expires in September, and without legislation, it would no longer be able to back new loans.\nThe U.S. Chamber of Commerce and National Association of Manufacturers sent an appeal to lawmakers calling for the bank’s renewal, signed by 865 organizations from around the country.\nTom Donohue, who heads the Chamber, said nearly half of the Republicans currently in the House voted to reauthorize the back two years ago, 122 out of 233. He and Jay Timmons, the top official at the NAM, both expressed confidence their side could prevail in a vote.\nMcCarthy’s comments on Sunday marked a turnabout for him and the first indication of a change in direction of the House majority since the rank-and-file reshuffled its leadership last week.\nAsked if he would allow the bank’s charter to expire, he said, “Yes, because it’s something that the private sector can be able to do.”\nMcCarthy voted to reauthorize the bank’s charter in 2012, when Majority Leader Eric Cantor helped maneuver legislation through the House.\nCantor is stepping down on July 31, following a primary defeat at home in Virginia earlier this month, and McCarthy’s shift in position came in his first interview following his election as new majority leader.\nSeveral tea party and other conservative groups oppose programs like those run by the Export-Import Bank as “crony capitalism” in which the government uses taxpayer money to select economic winners and losers, rather than allowing market forces to play that role.\nSupporters of the bank say it helps crate fair competition in an era when dozens of foreign countries subsidize their own exports.\nWhile Donohue and Timmons refrained from criticizing McCarthy directly, the White House spokesman quoted remarks by President Ronald Reagan when he signed Export-Import Bank legislation in 1986.\n“I can imagine that the incoming majority leader might discount a little bit what I have to say, but I’d be surprised if he discounted President Reagan’s view on this,” Earnest said, referring to a conservative Republican chief executive.\nLarge corporations like Boeing benefit from the bank’s support of exports, and the agency recently announced a $15 million loan guarantee to support the overseas sale of power generating equipment by Caterpillar.\nThe agency says much of its backing is for sales by small companies, and its Web Site includes a map detailing activity in each state and congressional district from 2007 to the present.", "url": "https://apnews.com/04828519076c48cc8d05e4858462428d"}