{"authors": ["Sam Gindin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:24", "date_modify": "2020-05-04 19:52:24", "date_publish": "2014-04-16 00:00:00", "description": null, "filename": "2014_04__1588621944.html", "image_url": "https://images.jacobinmag.com/2014/04/16234849/3029135825_290515b86e_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_04__1588621944.html", "title": "Raising Our Expectations", "title_page": "Raising Our Expectations", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Looking back to the defeat of the labor movement since the early 1980s, three lessons seem especially important. First, any gains made under capitalism are temporary; they can be reversed. Second, the kind of unionism we developed in that earlier period of gains was inherently limited; it left us in a poor position to respond to the subsequent attacks. Third, absent new forms of working class organization and practices, fatalism takes over and worker expectations fall.\nRaising Expectations (And Raising Hell), newly out in paperback from Verso, is part memoir, part organizing manual, and part rejoinder to that fatalism. Jane McAlevey is a long-time organizer in the student, environmental and, over the past two decades, labor movements. She is currently a PhD candidate at City University of New York Graduate Center, which she has integrated into her continuing life as a labor organizer. Her message, based on her experiences and achievements, is that as much as capitalism has diminished workers and undermined their confidence in affecting their lives, workers can overcome — but only if they themselves become organizers inside both the workplace and community.\nWhile any such organizing begins with workers’ needs, it is workers’ expectations of their own ability to intervene — and of the support from their unions in doing so — that must especially be raised. McAlevey refuses to romanticize workers or glorify spontaneity. But she deeply respects working people and genuinely appreciates their creative potential, a respect reflected in her refusal to be shy about challenging workers to reach their potential.\nOrganizing strategy is McAlevey’s forqte, and two examples highlight her approach. In 1998, following the moment in the mid-nineties when the AFL-CIO had become desperate enough to allow some real experimentation to take place, McAlevey was sent to Stamford, Conn., to direct an organizing drive, the Stamford Organizing Project. Stamford had one of the lowest union densities in all of New England.\nA number of aspects of that drive stand out. First, as obvious as it might seem to cooperate across unions, it is in fact extremely rare to see unions getting together to “pool resources, share lists, and adhere to collectively made decisions.” To the credit of the four locals involved (most of whose leadership came from an oppositional and left tradition), they saw beyond a parochial concern to gain new dues-paying members and grasped the need to build the class across sectors and across racial and gendered divisions.\nSecond, when a main concern of the workers turned out to revolve around access to housing, McAlevey shifted the unionization drive to make housing a primary focus — class was not just a workplace relationship. The confidence, skills, and alliances developed in that campaign, and the corresponding credibility gained for the labor movement, were key to organizing unions and winning strong contracts.\nBreaking down the distinction between the workplace and the community and putting an emphasis on community allies is itself not unusual in such struggles; what was distinct was that rather than seeing the community as an “other,” McAlevey emphasized the extent to which workers were themselves part of the community; success depended on workers becoming the key organizers in bringing the community around. “When union staff try to do it in place of workers,” McAlevey writes, “they blow it.”\nSome six years later, just before the split in the AFL-CIO in 2005, McAlevey was sent by SEIU to organize public and private hospitals in Nevada. Because Nevada became a right-to-work state, with workers having the right to opt out of paying dues, the thin organizing that unions commonly practice couldn’t work. McAlevey’s team identified and supported organic worker-leaders. The intensive, face-face organizing that followed, with increasingly confident workers now “in constant conversation with one another about everything going on” raised the share of dues-paying union members from 25 percent to 80 and higher — enough of a difference to distinguish between collective begging and collective bargaining.\nThis was accomplished by honing a rigorous system of mapping the workplace thoroughly and continuously, and then building and deliberately testing the workers’ capacities throughout the campaign. Alongside this, McAlevey insisted that to build the kind of power necessary to win in the particularly hostile context of Nevada demanded an inclusive bargaining unit — one that brought nurses and lab technicians together with janitors, laundry workers, and food preparation staff.\nTo a degree virtually unheard of in labor negotiations, McAlevey pressed to open up the bargaining sessions to the members. The bargaining team included “one worker to the team for every twenty-five workers in the larger units and for every fifteen workers in the smaller units,” and this was done “by unit and shift so that we had every kind of worker input.” All members were welcome and “encouraged to attend negotiations, whether for a day, an hour, or a coffee break.”\nThis had, as McAlevey acknowledges, its risks and demanded a great deal of preparation and internal discipline if it wasn’t to become a free for all. But in the end, such “big bargaining” greatly contributed to winning over members disillusioned about the union and their role within it.\nIn both examples, and central to all of McAlevey’s organizing, is the priority given to carrying out the most in-depth power analysis of what workers are up against and where they can exercise leverage in their struggle. This involves mapping and charting the power not only of the companies being unionized or bargained with, but in the communities in which the struggle is taking place.\nAnd it includes both the conventional metrics of identifying power brokers, community leaders, state-corporate links, and others, and qualitative assessments by the workers themselves of both the power arrayed against them and the power they can bring to bear. The information gathered and the process of gathering it then become integral to developing workers’ strategic understandings and capacities.\nSome critics of the book have accused McAlevey of self-promotion for the book’s emphasis on her own role in these events. This seems rather churlish. Both the device of making her points through a memoir based on her personal experience and the informal style were clearly intended to make it more accessible to lay readers and rank-and-file unionists. (The publishers apparently asked for the personalized subtitle of “My Decade Fighting for the Labor Movement.”) Moreover, McAlevey is very generous in pointing to her mentors and giving them and earlier organizers credit for the model she applies.\nJudgments of McAlevey’s personality are beside the point. The real question is whether she has written a book that contributes to addressing labor’s current impasse. And on this score, it is difficult to imagine even such critics denying that she has something important to say.\nMcAlevey has also been attacked — most notably by respected labor journalist Steve Early — for her criticism of Sal Rosselli, the SEIU leader of a key local in California who broke away, after the SEIU’s imposition of a trusteeship, to form the National Union of Healthcare Workers.\nEarly’s attack is doubly unfortunate. First, McAlevey’s book only mentions Rosselli in passing. Challenging her brief comments is one thing; focusing on those few passages to essentially dismiss the book is another. Second, whatever disagreements there may be between Early and McAlevey on this specific issue, they are on the same side in their antipathy to the role of the SEIU leadership. As McAlevey says in her new afterward, “While the Birthers and Tea Party were effectively mobilizing town halls all across the nation to destroy health care–reforms, SEIU’s health-care organizers were busy blowing up one of their best local unions.”\nMost important, however, in terms of discussions of organizing models, have been suggestions that as a staff representative herself, McAlevey presents a model that is staff-driven. We should, of course, be wary of organizing models that substitute staff for the participation of workers. But the very point of McAlevey’s work is to combat that kind of relationship between staff and rank-and-file and replace it with an orientation to remaking the working class into a social force with the capacity to make its own decisions.\nAs she said of the Stamford process, “I was proposing that the bulk of this work not be done directly by union organizers but by the workers themselves.” It was, in fact, McAlevey’s refusal to toe SEIU’s deal-making model, which she has referred to elsewhere as “organizing the company,” and to repeatedly insist on organizing the workers, that got her in trouble with the SEIU top leadership.\nYet the issue here isn’t just to reject the role of staff. In the building of militant, democratic, community-centered unions, full-time staff have an essential role to play as catalysts and support systems for bringing in and bringing out the best in the members. To ignore this is to obscure all the difficult but necessary issues of how to establish the proper context for staffers to play this kind of role.\nThe larger issue here revolves around the nature of organizing. An essentialist view of workers as being inherently militant, solidaristic and strategy-wise doesn’t grasp the actual state of the working class. If workers already had the needed capacities fully formed, they would have organized themselves long ago.\nOrganizing is about moving people from where they currently are to someplace that brings out their potential as social agents. It involves developing the individual and collective capacities — alongside the structures, tactics and strategies — that can match what workers are up against. Most labor leaders today, McAlevey asserts, think that in the “self-centered, plugged-in, globalized country this nation has become,” deep workplace and community organizing is impossible. Her experiences prove otherwise.\nThe organizing model McAlevey proposes, based on her experience and with roots in early CIO practices, demands a heavy commitment of union resources (McAlevey hasn’t shied away from supporting large dues increases) and depends on experienced organizers (who may or may not be staff) playing a catalyst role. The identification of informal leaders is given much greater attention than most unions’ traditional organizing models since the de facto leaders, as McAlevey repeatedly emphasizes, are not generally the formal, elected leaders.\nOrganizing is a continuous process, beginning with power mapping, testing to hone mobilization capacities, then acting. It connects individual and collective action and passes on analytical and strategic skills to workers. It develops workers’ self-confidence through demonstrating that employers and politicians can be taken on and demands won. It is suspicious of the legalisms of grievance handling, instead focusing on workers addressing grievances through direct action. It keeps the union members fully informed, opens the bargaining process to much broader direct participation, doesn’t shy away from strikes, and it looks to the workers themselves to organize their communities.\nAnd yet for all the concrete demonstrations that this model of organizing works, it did not spread across the labor movement. The exciting example in Connecticut of unions cooperating with each other and moving into the community — and subsequently gaining members and first contracts, successfully intervening to save and improve public housing projects and gaining representation in local politics — did not spread. In Nevada, an impressive number of workers overcame the state’s anti-labor legislation and joined the SEIU, and the contracts won were quite remarkable, including the breakthrough in Nevada’s health care sector for fully employer-paid family health care. Yet this too faded, undone by both legitimate disagreements and petty turf wars. What are we to make of this?\nThe dilemma is that this organizing model rests on unions being open to real organizing, committing the resources, standing ready to accept some turmoil within their organizations, and trusting the members rather than looking to broker deals with corporations. But unions that would agree to such a program are distressingly rare. Creating them essentially requires revolutions inside unions — something that is unlikely to happen through any spontaneous dynamic strictly internal to unions.\nWithout the existence of a left committed to class struggle and with its feet inside and outside workplaces, unions that have transformed into the kinds of organizing machines McAlevey helped create will remain the exception. But such a left, with links to workers and a capacity to develop organizers where workers are looking for help and workers that might transform their unions, is itself at an impasse. Much as many of us might think of the Left as the most self-conscious part of the class struggle, their impasse is as difficult to overcome as unions’.\nIn this context, McAlevey’s book is timely and desperately needed because it convincingly demonstrates that the problem is not in the stars, but in ourselves. If we as the Left can get our shit together, it is possible to build groups of workers into a social force in spite of the times.\nWhere unions are ready to try, McAlevey presents a method for how to do this. And where unions are not yet prepared to take this on, it lays out a range of specific demands we should be fighting for within our unions. (The book is full of concrete examples of tools, tactics, and strategies that can win; it is practically begging for a follow-up detailed manual).\nEvery serious labor activist needs to engage this book, drawing out what is useful and experimenting with variations as appropriate. But we also need to go further. Indirectly, McAlevey’s book challenges the Left to stop lamenting its disappointments in the working class and address, with humility, its own failures. The Left must raise its expectations of itself.", "url": "https://www.jacobinmag.com/2014/04/raising-our-expectations/"}