{"authors": ["Neil Davidson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:31", "date_modify": "2020-05-04 19:59:31", "date_publish": "2014-09-17 00:00:00", "description": null, "filename": "2014_09__1588622371.html", "image_url": "https://images.jacobinmag.com/2014/09/17000350/Sweatshirts_yes_campaign.0-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_09__1588622371.html", "title": "Why Scotland Should Vote Yes", "title_page": "Why Scotland Should Vote Yes", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "On the evening of May 16, 1973, around halfway through the Aladdin Sane tour, I watched David Bowie play his second sold-out show at the Aberdeen Music Hall. I could not have imagined that one day I would be listening to him — or, rather, listening to Kate Moss speaking on his behalf — intervene in the debate over a Scottish independence referendum. Mind you, I cannot pretend that the national question was a high priority for my 15-year-old self; nor could I have imagined that there would ever be a Scottish independence referendum. The message that Moss read out for Bowie at the Brit Awards on February 20 this year — “Scotland, stay with us” — nevertheless deserves to be taken more seriously than it has been, and certainly more than the mixture of bluff and bullying that Scots have recently received from George Osborne, Jose Manuel Barroso, and the directors of Standard Life PLC. Bowie is actually a more political artist than is often supposed, but he is in no sense a conventional left-wing one. Yet his intervention was typical of a widely held view on the Left that a “yes” vote for Scottish independence on September 18 would be a disaster for “us” (meaning the English), and perhaps also for the Scots themselves. These views are also widely held in Scotland itself. Before turning to these arguments, it is worth considering one pro-independence position that can only be held in England. Expressed most recently (if eccentrically) by Will Self in the New Statesman, this holds that an independent Scotland would be a social-democratic — perhaps even socialist — inspiration to the English Left, finally galvanizing it into posing a serious challenge to neoliberalism and imperialism. And in some respects, a survey of social legislation in Scotland even under devolution, including that passed by the first two Liberal/Labour coalition governments, tends to support this perspective. Scotland has free care for the elderly, free prescriptions for all, and no student tuition fees (at least for Scottish students). And the bedroom tax, while it is beyond the power of Holyrood to abolish, has effectively been neutralized by the current Scottish National Party (SNP) government’s declaration (in a move supported by Labour) that it would set aside £15 million to meet the additional costs of the 76,000 social housing tenants deemed to have a “spare bedroom.” Furthermore, although there are longstanding private schools in Scotland, education has not been subjected to the disintegrative effect of academies and free schools; water remains in public hands; the extent of privatization of the National Health Service in England has not been replicated north of the border; private finance initiatives and public–private partnerships are no longer in use. And while it would be absurd to pretend that racism is not a problem in Scotland, the public culture in this respect is different from England, not least because the SNP government — to its endless credit — has argued for welcoming migrants rather than attacking them. We should nevertheless be skeptical about claims that, on the basis of these modest but real reforms, independence would automatically lead to the creation of a social democratic, let alone socialist, society. There is nothing intrinsically progressive about Scottish statehood — otherwise it would not be supported by reactionary types like Sir Brian Souter of Stagecoach or Sir George Mathewson (formerly of the Royal Bank of Scotland), both of whom are perfectly aware of their class interests. It is also true that, in economic terms, the SNP is committed to the neoliberal agenda — it is almost entirely in social terms that it has deviated to the left. This means that the SNP is presenting a highly contradictory program: on the one hand it argues for an Irish-style “competitive” tax regime for the corporations, while on the other claiming that it will be able to provide a Scandinavian-style welfare state. Nor is this the only contradiction: the SNP is committed to removing nuclear weapons from the Clyde, but also to remaining within NATO, positions which are likely to conflict with each other, to say the least. These contradictions form the starting point of the Left critique of the independence movement. But even so, a vote for independence in the referendum is not the same as a vote for the SNP. It is conceivable that independence might be won and the SNP could still lose the next Scottish parliamentary election, or vice versa. Support for a national demand such as Scottish independence is quite distinguishable from support for a party that advocates it. Indeed there are good reasons for thinking that the SNP — or at least its leadership — is not as committed to independence as it and almost everybody else finds it convenient to pretend. “Maximum devolution,” or “devo max,” is the constitutional option probably supported by most Scots, although it is not an option on the referendum. This would leave the Scottish Parliament in control of all state functions (including taxation), with the exception of those controlled by the Foreign Office, the Ministry of Defence and the Bank of England, in relation to setting interest rates. The bulk of the SNP leadership recognizes that there is unlikely to be a majority for independence in September. Devo max is therefore what they hope to achieve — and, more importantly, what they think they can achieve — in the short to medium term. Salmond cannot of course openly argue for this without incurring the wrath of the fundamentalist-nationalist wing of his party, for whom anything less than independence is betraying of the blood of Wallace and The Bruce, and so on. Thus the way he has framed the outcome of a “yes” vote is as close to devo max as possible — retention of the monarchy, the pound sterling (under the tutelage of the Treasury and the Bank of England), and membership in the EU — the last two in themselves guaranteeing that the neoliberal ascendancy would continue, regardless of the intentions of the SNP leadership. Ironically, Osborne’s and Barroso’s intransigence may have inadvertently provided Salmond with an escape clause, if he is capable of taking it. The situation is further complicated, however, by the fact that, in certain circumstances, devo max would probably be acceptable to a majority of Tories, if it was politically necessary. Cameron certainly wants to win a vote against independence, but, tactically inept though he is, is also aware that even if this is achieved the demand for further devolution will be unstoppable, and would probably result in pressure for devo max. Cameron effectively conceded this early after the announcement of the referendum, in a February 2012 speech in Edinburgh when he offered further measures of devolution if voters rejected independence. For tactical reasons, Salmond affected to believe this was a ruse to lull the Scots into voting for the status quo, after which the promise would be quietly forgotten. It is usually wise to believe the worst about Tory intentions, but in this case Cameron is probably genuine. If the essential integrity of the British state was maintained at the military-diplomatic level, the latter would be an acceptable outcome, particularly since it would place the responsibility for raising taxation and cutting expenditures on the Scottish government. Indeed, some Tory intellectuals, notably Tim Montgomerie, are already arguing that Cameron should seize the opportunity to reconstruct the British Constitution on a federal basis. This is a position that would bring the Tories into harmony with the Liberal Democrats, for whom this is a policy goal dating back to the days of the original Liberal Party. In other words, given the amount of shadow play involved in the current debates, the Left needs to present arguments for a genuine independence from the British state; but the Scottish Left is split on the question. The Labour Party is officially part of the Better Together campaign (“Project Fear”) along with the Tories and the Liberal Democrats, although an unquantifiable but substantial number of Labour members either want the party to campaign separately from the parties of the ruling Westminster Coalition, or even for it to support independence. The “Yes Scotland” campaign is unsurprisingly dominated by the SNP, with support from the Greens and the remnants of the Scottish Socialist Party (SSP). Aligned to it, but much further to the left, is the Radical Independence Campaign (RIC), which involves the SNP left, the Greens, the SSP, and the rest of the radical and revolutionary left (Solidarity, the Socialist Workers Party, etc.). RIC has held two large conferences in Glasgow and is now conducting voter registration drives in the housing schemes of Central Scotland. (For the purposes of full disclosure, I should point out that I support RIC, although this will soon become obvious.) What are the respective arguments of the two camps?\nNo? Some left arguments for Scotland remaining within the Union deserve to be taken more seriously than others. One which does not deserve to be taken seriously is the claim that the desire for independence is the expression of an atavistic identity politics, a nationalist diversion from class issues that are essentially the same on both sides of the border. I would like to say that the presumption and lack of self-awareness involved in making these claims is extraordinary, but unfortunately it is very ordinary indeed. Supporting Scotland becoming an independent state apparently marks one down as a nationalist, but supporting the British state remaining as currently constituted does not. This is what is usually referred to as a double standard. Left-wing opponents of Scottish independence tend to become incensed when they are themselves accused of nationalism, as though British nationalism was not really a nationalism at all — a venerable conservative position dating at least as far back as Lord Acton’s writings on the subject. Very well, but if they can apparently detach their desire to maintain the British state from British nationalism, why do they assume that supporters of establishing a Scottish state cannot do the same with regards to Scottish nationalism? In fact, there are good socialist (and, indeed, capitalist) reasons for supporting either position that do not depend on possessing any nationalist feelings at all. It is possible to support the continued existence of the United Kingdom without being a British unionist, just as it is possible to support secession from Britain without being a Scottish nationalist. As I will argue below, for socialists, as opposed to British unionists or Scottish nationalists, support or opposition to Scottish independence is essentially a tactical question. A more concrete set of arguments for voting “no” concerns the potential weakening of the British working class. These involve varying degrees of intellectual coherence. One is that the Labour Party will find it more difficult, perhaps even impossible, to form a government without the numeric weight of Scottish votes and MPs: the Scots who vote for independence are condemning their English brothers and sisters to an eternity of Conservative rule. There are a number of responses one could make to this type of political-emotional blackmail, but the most obvious, based on facts available in any reasonably detailed handbook of British electoral statistics, is that it is simply untrue. In general elections since World War II, Labour has only twice — in 1964 and February 1974 — relied on the results in Scotland to form a government, and in both cases these governments were subsequently re-elected — in 1966 and October 1974 respectively — without any such reliance. Labour’s great majorities in 1945 and 1997 would have been reduced without Scotland, but not to the point where their ability to enact legislation would have been threatened. In other words, Scottish independence does not create an impossible logistical obstacle to the formation of a future Labour government. If, subsequent to a Scottish secession, Labour was unable to gain an electoral majority in the Remainder of the United Kingdom (RUK), the responsibility would not lie with the departing Caledonians but with that party’s electoral politics. A second, more serious argument is that the Scottish economy is to a very great extent owned and controlled externally by foreign multinationals or their subsidiaries, while economic policy is determined by financial institutions based in the City of London and the EU bureaucracy based in Brussels. Deprived of the protective power exercised by the British Parliament, an independent Scotland would be at the mercy of these forces. It is true, of course, that an independent Scotland would still be dominated by capital, much of it external in origin; but who, apart from the most hopelessly naive ever imagined otherwise? And even — leaving aside the nationalist implications — the idea that there is something particularly pernicious about “foreign” capital of course depends on how one sees the socialist transformation of society being accomplished. By far the most serious left argument against Scottish independence is that it will undermine the British trade union movement, by preventing cross-border unity. This would indeed be serious if it was an inevitable consequence of secession, but it is not. Workers in Ireland can belong to the same unions as workers in Britain, workers in Canada can belong to the same unions as workers in the USA; there is no reason why workers in Scotland could not belong to the same unions as workers in England and Wales. More importantly, unity is not secured by the constitutional form of the state or by the bureaucratic structures of union organization, but rather by the willingness to show solidarity and take joint collective action, across borders if necessary. Grangemouth is in Scotland, yet the existence of UK-level Unite organization did not prevent the debacle which overwhelmed the workforce last November when the union effectively conceded a pay freeze, attacks on pension levels, and a massive reduction in workplace rights. On the other hand, workers across southern Europe demonstrated the possibility of coordinated action across borders in strikes against austerity on November 14, 2012. Finally, if Scottish independence is so unthreatening to capital, so divisive of the working class, why then are most sections of the British — and, indeed, the European and US — ruling classes so opposed to it? Why is Osborne so implacable about the impossibility of monetary union? Why is Barroso so determined that Scotland would not automatically be entitled to EU membership? The changing positions of The Economist — always the most reliable bellwether of neoliberal ideology — suggest an answer. During the glory days of neoliberal globalization it was forever insouciantly recommending that the Scots be granted independence so that they would be compelled to become more competitive by cutting wages and welfare. Now it runs cover stories bewailing the fate of “Skintland” were its inhabitants to opt for a constitutional option that the magazine had previously regarded as necessary to impose market disciplines. One suspects this change of heart is not prompted by a concern for the Scots, but rather a fear of the consequences for the British state, and consequently for capital invested in Britain, from whatever source. The problems posed by independence are not directly economic, but are related to the capitalist economy through a series of mediations. What are they?", "url": "https://www.jacobinmag.com/2014/09/why-scotland-should-vote-yes/"}