{"authors": ["Alyssa Battistoni", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:45", "date_modify": "2020-05-04 19:51:45", "date_publish": "2014-01-16 00:00:00", "description": null, "filename": "2014_01__1588621905.html", "image_url": "https://images.jacobinmag.com/2014/01/16234320/issue13_battistoni_feature-2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_01__1588621905.html", "title": "Alive in the Sunshine", "title_page": "Alive in the Sunshine", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "For as long as the environment has existed, it’s been in crisis. Nature has always been a focus of human thought and action, of course, but it wasn’t until pesticides and pollution started clouding the horizon that something called “the environment” emerged as a matter of public concern.\nIn 1960s and 1970s America, dystopian images provoked anxiety about the costs of unprecedented prosperity: smog thick enough to hide skylines from view, waste seeping into suburban backyards, rivers so polluted they burst into flames, cars lined up at gas stations amid shortages, chemical weapons that could defoliate entire forests. Economists and ecologists alike forecasted doom, warning that humanity was running up against natural limits to growth, extinction crises, and population explosions.\nBut the apocalypse didn’t happen. The threat that the environment seemingly posed to economic growth and human well-being faded from view; relieved to have vanquished the environmental foe, many rushed to declare themselves its friends instead.\nFour decades later, everyone’s an environmentalist — and yet the environment appears to be in worse shape than ever. The problems of the seventies are back with a vengeance, often transposed into new landscapes, and new ones have joined them. Species we hardly knew existed are dying off en masse; oceans are acidifying in what sounds like the plot of a second-rate horror movie; numerous fisheries have collapsed or are on the brink; freshwater supplies are scarce in regions home to half the world’s population; agricultural land is exhausted of nutrients; forests are being leveled at staggering rates; and, of course, climate change looms over all.\nThese aren’t issues that can be fixed by slapping a filter on a smokestack. They’re certainly not about hugging trees or hating people. To put it bluntly, we’re confronted with the fact that human activity has transformed the entire planet in ways that are now threatening the way we inhabit it — some of us far more than others. And it’s not particularly helpful to talk in generalities: the idea that The Environment is some entity that can be fixed with A Solution is part of the problem.\nThe category “environmental problems” contains multitudes, and their solutions don’t always line up: water shortages in Phoenix are a different matter than air pollution in Los Angeles, disappearing wetlands in Louisiana, or growing accumulations of atmospheric carbon. So instead of laying out some kind of template for a sustainable future, I argue that there’s no way to get there without tackling environmentalism’s old stumbling blocks: consumption and jobs. And the way to do that is through a universal basic income.\nEnvironmentalists have long lectured Americans about overuse of natural resources. By now, the talking points on overconsumption are familiar: 5 percent of the world’s population uses 25 percent of its resources, and emits about the same percentage of its greenhouse gases; if the whole world lived like Americans, we’d need four planets, or maybe five. We eat too much meat, drive too many miles, live in houses that are too big and too far apart, shop too much for stuff we don’t need. When it comes to climate change, it’s even worse than the numbers suggest: Western nations outsource a huge percentage of emissions to the places that increasingly produce our goods.\nSuch international disparities have, of course, long presented a challenge to those concerned with both domestic and global justice: how to acknowledge that America’s poor are wealthier than most of the world without simply concluding that they’re part of the problem? But while discussions of consumption tends to focus on a universal “we,” as epitomized by the famous Pogo Earth Day cartoon — “we have met the enemy, and he is us” — it’s important to look more closely within the rich world rather than simply heaping scorn on national averages.\nDepictions of American consumerism tend to focus on the likes of Walmart and McDonald’s, suggesting that blame lies with the ravenous, grasping masses. Meanwhile it’s trendy for the wealthy to appear virtuous as they drive Priuses, live in homes that tout “green design,” and eat organic kale. But whether you “care about the environment,” believe in climate change, or agonize over your coffee’s origins doesn’t matter as much as your tax bracket and the consumption habits that go with it.\nConsumption doesn’t correspond perfectly to income — in large part because of public programs like SNAP that supplement low-income households — but the two are closely linked. The US Congressional Budget Office estimates that the carbon footprint of the top quintile is over three times that of the bottom. Even in relatively egalitarian Canada, the top income decile has a mobility footprint nine times that of the lowest, a consumer goods footprint four times greater, and an overall ecological footprint two-and-a-half times larger. Air travel is frequently pegged as one of the most rapidly growing sources of carbon emissions, but it’s not simply because budget airlines have “democratized the skies” — rather, flying has truly exploded among the hyper-mobile affluent. Thus in Western Europe, the transportation footprint of the top income earners is 250 percent of that of the poor. And global carbon emissions are particularly uneven: the top five hundred million people by income, comprising about 8 percent of global population, are responsible for 50 percent of all emissions. It’s a truly global elite, with high emitters present in all countries of the world.\nBut that doesn’t mean America is off the hook altogether. The global wealthy may consume far more than the rest, but global consumption can’t be leveled out by bringing everyone up to even Western median levels; consumption in rich nations, even at relatively low levels of income, has to decline if we’re to achieve some measure of global equality.\nFor those in rich countries, this sounds suspiciously close to an argument for austerity: we’ve been profligate, and now the bill is coming due. That may be easily reconciled with more ascetic strains of environmentalism and anti-consumerist left currents. But for those who aren’t bothered by decadent consumption so much as by the fact that so few are able to enjoy it — and who are wary of recalling Soviet bread lines — the prospect of limiting consumption is deeply worrisome.\nIt’s hard to talk about consumption without a whiff of moralizing disapproval, as if there was something inherently wrong with having nice things. So the condemnations of consumer culture that once occupied social critics have largely fallen out of fashion, seen as too Puritan, too patronizing, too snobbish — and maybe even too boring. We get it already.\nBut it’s important to distinguish between different types of consumption. For all the resonances in the rhetoric of anti-consumerist environmentalism and austerity, reducing public consumption would actually be an environmental disaster. Reductions in public goods tend to produce increases in private consumption: people drive cars instead of taking the bus, move to a house with a yard instead of going to the park, buy books and home entertainment systems instead of going to libraries and museums, drink bottled water instead of tap — if they can afford to. Those who can’t just have to go without.\nIt’s hard to think of many things more disingenuous than arguing that addressing environmental issues will impose unacceptable restrictions on the American standard of living while simultaneously promoting austerity measures — yet that attitude is pervasive in mainstream political discourse.\nAnd while having stuff doesn’t make you a miserable soulless materialist, as some of the shriller anti-consumerist rhetoric would suggest, it doesn’t necessarily make you happier, either. Rather, the “status treadmill” frequently does the opposite: fueling anxiety, inadequacy, and debt under the banner of democracy and freedom. Meanwhile, consumer guilt has led to an explosion in “green” products — recycled toilet paper, organic T-shirts, all-natural detergents — but most do little more than greenwash the same old stuff, bestowing a sheen of virtue on their users, suggesting personal choices will save the planet. But the individual agonizing that constitutes consumer politics isn’t going to get around the fact that the global economy depends on more or less indefinitely expanding consumption. In fact, consumption has come full circle and become virtuous: protesting sweatshops and ranting about exploitation is passé; buying gadgets is the new way to lift people out of poverty. And so it’s not just workers who are threatened with jobs blackmail — we’re all threatened with consumption blackmail, wherein consuming less will put millions out of work worldwide and crash the global economy. Even our trash is creating jobs somewhere.\nIndeed, you can’t talk about consumption without talking about production — which brings us to jobs, which environmentalists have long been accused of killing. To be sure, the history of environmentalism is littered with projects aimed at keeping patches of nature free from human impact, often demonizing workers in the process. And industry has long taken advantage of the popular stereotype of job-killing tree-huggers to resist improving safety and pollution standards, threatening that forced installation of sulfur scrubbers or proper ventilation of workspaces will put thousands out of work.\nSuch estimates of job loss tend to be wildly exaggerated scare tactics, while the jobs that dirty industry projects claim to create are usually vastly overhyped. TransCanada, for example, has claimed that building the Keystone XL tar-sands pipeline would create twenty thousand jobs, while the State Department projects something more on the order of five thousand, most of them temporary. But regulations sometimes do kill jobs within industries, even if on balance they often create more — and sometimes they destroy industries altogether. And while nakedly extractive occupations like coal mining and oil drilling are the standard examples of practices that the shining eco-future will render obsolete, a closer look implicates less obvious industries and kinds of work.\nA “green economy” can’t just be one that makes “green” versions of the same stuff, or one that makes solar panels in addition to SUVs. Eco-Keynesianism in the form of public works projects can be temporarily helpful in building light rail systems and efficient infrastructure, weatherizing homes, and restoring ecosystems — and to be sure, there’s a lot of work to be done in those areas. But a spike in green jobs doesn’t tell us much about how to provide for everyone without creating jobs by perpetually expanding production. The problem isn’t that every detail of the green-jobs economy isn’t laid out in full — calls for green jobs are meant to recognize the fraught history of labor-environmentalist relations, and to signify a commitment to ensuring that sustainability doesn’t come at the expense of working communities. The problem is that the vision they call forth isn’t a projection of the future so much as a reflection of the past — most visions of a “new economy” look a whole lot like the same old one. Such visions reveal a hope that climate change will be our generation’s New Deal or World War II, vaulting us out of hard times into a new era of widespread prosperity.\nBut the Keynesianism underpinning that vision was the answer to a problem that was identified as underconsumption rather than overproduction: it was intended to jump-start demand rather than reduce supply. If overconsumption is actually the problem, we can’t fix it by consuming more, however eco-certified the products. Indeed, the very idea that green jobs will drive economic recovery is closely tied to notions of continued American hegemony: green tech is the next big thing, the rhetoric goes, and America needs to get ahead in the global race to innovate. But nearly every country in the world harbors similar hopes. That the wealthiest country in the world is so panicked at the prospect that others might catch up reveals the fallacy of the notion that continued growth will somehow reach an endpoint in which everyone enjoys a decent standard of living.\nContinued growth isn’t the only way to get there. The mythology surrounding the New Deal often obscures the fact that labor’s response to the Depression was not to make more work, but to share existing work more broadly by shifting to a thirty-hour workweek; Keynes himself famously predicted we’d be down to a fifteen-hour workweek by the end of the century. The decision to use fiscal policy to stimulate consumption instead was a way of avoiding deeper structural changes — to grow the pie rather than ask who was eating most of it. Since then, instead of increasing leisure time, productivity gains have largely increased private consumption for an increasingly small number of people. These days, of course, people are having leisure forced on them — it’s employers who are cutting hours and workers who are desperate for more. It’s clear that we can meet needs with vastly less labor than will support a population dependent on stagnating wages. While neoclassical economists pose the consumption-leisure tradeoff as a choice made by individuals, whether or not people work in the first place is clearly determined by decisions made at a society-wide level.\nIt’s beginning to look like we should have taken the other New Deal. We need to explicitly shift toward working less — to reorient the consumption-leisure tradeoff towards the latter on a social level — and share the work that remains more evenly. The sociologist Juliet Schor says we could work four-hour days without any decline in the standard of living; similarly, the New Economics Foundation proposes we could get by on a twenty-one-hour workweek. Meanwhile, David Rosnick and Mark Weisbrot suggest that the US could cut energy consumption by 20 percent by shifting to a schedule more like Western Europe’s, with thirty-five hour workweeks and six weeks of vacation — certainly not a panacea, but hardly impoverishing for a start. In a study of industrialized nations over the past fifty years, Schor, Kyle Knight, and Gene Rosa find that shorter working hours are correlated with smaller ecological footprints.\nWhile making people work shitty jobs to “earn” a living has always been spiteful, it’s now starting to seem suicidal. So perhaps it’s time to reclaim job-killing environmentalism, this time not as a project that demonizes workers, or even work — but rather, as one that rejects work done for its own sake. Instead of stigmatizing, criminalizing, and imprisoning the unemployed and “non-industrious poor,” perhaps we should see them, as David Graeber suggests, as the “pioneers of a new economic order” — one where we all work and consume less, and have more time for other pursuits.\nIn fact, addressing environmental issues suggests the need not only for new kinds of jobs but for new approaches to work altogether. No work or human activity, however removed from “the land,” is without environmental impact — but some work is less material-intensive than others. An ecologically viable future will rely on many kinds of work that are typically undervalued, or not considered work at all — caring for people and ecosystems; building communities; learning and educating. This emphatically doesn’t mean we should all become artisans engaged in small-scale production; to the contrary, there are dangers in romanticizing supposedly “natural” and unalienated forms of labor. Rejecting fast food in favor of gardening and canning, for example, might just reinstitute a toilsome regime for women; acknowledging the problems of certain maximalist projects can’t mean ceding liberatory goals. But done right, a reevaluation of work from an ecological perspective could elevate the unpaid work of making a social, livable world.\nProposals to shorten the workweek are often defended on the basis of giving people more time for what they will — to spend time with friends, family, and loved ones, start a band, write a novel, cook a meal, and so on. But calling those activities “leisure” diminishes their importance in making a life with less stuff a worthwhile and fulfilling one. Likewise, the word “leisure” doesn’t credit the fact that strong communities are as important for surviving natural disasters as strong seawalls. If we’re paying people to build the latter, shouldn’t we also pay them to build the former?\nAs it turns out, some of the most interesting efforts to rethink the relationship between work, production, and nature are thus far taking place in unlikely places: namely, in the payment-for-ecosystem-services (PES) framework that now dominates mainstream environmental economics. The general idea is to identify different ecological processes — pollination, say, or soil fertility — and put a price on them. It sounds like a quintessentially neoliberal strategy — and indeed, that’s often how it’s been deployed. But the ideas originally motivating payment for ecosystem services in many ways recall those of the radical feminist Wages for Housework movement of the 1970s. Wages for Housework pointed out that capitalism depends on the socially reproductive labor of the household, and by calling that work an act of love, makes it free. By demanding recognition of and payment for household labor, the Wages for Housework movement sought to unsettle assumptions about “women’s work,” force recognition of undervalued work, and force a reconsideration of the relationship between reproductive labor and traditional notions of the productive economy. Forced to pay the costs of reproducing life, capitalism would no longer be viable.\nAs with Wages for Housework, in which the concrete demand for payment acted as a provocative starting point, the demand for payment for work done to and by ecosystems was originally meant as an unsettling metaphor: the first step in a broader project of changing the way we think about the relationship between human society and the natural world. Concocted not by political radicals but by largely apolitical ecologists desperate to protect the systems they studied from destruction, payment for ecosystem services began as an attempt to value the work that we call nature and make free: it sought to recognize the ecological functions that are taken for granted, to acknowledge that livelihoods don’t exist separately from environments, and to reject old, often racialized ideas of conservation that emphasize keeping humans out of pristine environments. While it was never anticapitalist in intent, there was always an element of destabilizing absurdity in the prospect of pricing the entire planet.\nIn practice, however, while the ecosystem-services framework has been deeply uneven in its implementation, it has often served to advance privatization and commodification of the services it claims to protect. The monetary value produced by ecosystems is frequently captured and consolidated by powerful local actors, or translated into tradable commodities like credits for carbon markets, which have been wildly volatile and largely failed to achieve goals of either environmental protection or poverty alleviation. PES programs that assign value to ecosystems without attention to equity and ownership often incentivize states or speculators to take over suddenly-profitable natural assets, dispossessing people of access to subsistence holdings and delivering benefits solely to investors. Meanwhile, dividing ecosystems into packages of services to be traded and sold loses sight of the complexity and interdependence of what’s supposedly being preserved. In short, like so many ideas, payment for ecosystem services has largely been captured by neoliberalism.\nBut the underlying principles may still be salvageable — recognizing the use value of ecosystems, that so-called environmental issues can’t be separated from questions of livelihood and broader society, and that the world we live in is constituted by human and “natural” work alike. Those principles gesture toward an economy that recognizes the value of the care given to ecosystems, and the value of the work necessary to sustain life — the work of reproducing the very world in which we live. And they recognize the value of not working, of not producing, as in programs that pay people not to cut down trees — compensating them for income lost in the name of global sustainability.\nWe need to think seriously and expansively about these kinds of work and value — and about the real costs that “sustainability” will impose on individuals and communities. And we need to recognize that this is a truly collective project — that individualized, atomized systems of work and reward are increasingly untenable in the face of the interdependent tangle in which we’re enmeshed.\nHow might we do that? To begin with, by divorcing income from conventional notions of production, and by instituting a social wage in the form of universal basic income. Basic income won’t, in and of itself, solve environmental problems; it won’t replace coal plants with solar panels or ease pressure on depleted aquifers. If instituted as a justification for cuts to other social programs, it would be disastrous both socially and environmentally; robust public services are necessary if we’re to live on less. But it marks a critical starting point in rethinking the relationship between labor, production, and consumption, without which environmental hand-wringing will go nowhere.\nMore pragmatically, in providing an alternative to dependence on destructive industries and removing the threat of job blackmail from communities desperate for livelihoods, it makes change a real option, giving workers and communities more power to demand protections against environmental harms. It can start to reorient social focus away from an eternal game of consumption catch-up toward the good life.\nIt admittedly won’t do much to curb the upper bounds of consumption, at least not right away. But it might point in that direction. Environmentalists like to point to World War II for evidence that people will accept restrictions on consumption for the sake of a shared cause, but the so-called Greatest Generation didn’t exactly accept rations with a patriotic grin. What that experience does demonstrate, however, is that while people don’t like limiting consumption under any circumstances, what they really don’t like is cutting back if everyone else isn’t doing the same. That sentiment is typically mobilized in service of anti-welfare politics: why should I have to work if someone else just gets a check? But during the war, it went the other way: over 60 percent of the population supported capping incomes at $25,000 a year, a relatively paltry $315,000 today.\nOf course, the post-work future has long been over the horizon; to propose it as a solution to such time-sensitive problems may seem wildly, even irresponsibly utopian. The revolution might happen in time to avoid environmental catastrophe, but we probably shouldn’t count on it, though some African climate activists have put basic income grants, financed by wealthy nations’ payment of ecological debt, at the centerpiece of their demands.\nEven the US presents some interesting opportunities. One prominent alternative to a straight carbon tax or cap-and-trade system is a policy known as tax-and-dividend, in which the proceeds from a carbon tax would be distributed unconditionally to all citizens — similar to the oil dividend paid to every Alaskan resident. It’s defended as a compensatory mechanism for the higher energy prices that would result from a carbon tax; in more bluntly political terms, it functions as a bribe to garner support for a tax that would otherwise be unpopular. There are plenty of criticisms to be leveled against the plan as currently designed, particularly if it’s considered a stand-alone climate solution — individual dividends won’t maintain levees, support public transportation systems, or build affordable urban housing. But it’s also a potential wedge into new obligations and relationships: the first suggestion of an unconditional guaranteed income, financed mostly by a tax on the environmentally destructive consumption habits of the wealthy. It’s an assertion of public ownership of the atmosphere, and the staking of a new claim to public resources.\nViewed as a bulwark linking unconditional livelihood provision to environmental sustainability, it could be the beginning of a much larger project of ensuring decent standards of living for all regardless of productive input, while reclaiming environmental commons from the false yet persistent narrative of tragedy.\nThat may seem overly hopeful about dim prospects. To be sure, it must be emphasized that this is meant as a suggestion for a general direction rather than a precise solution. While we can draw ideas from past efforts to cope with environmental problems, there are no real precedents for what we now face. We’re going to have to figure some of this out as we go — which is another argument in basic income’s favor. Addressing environmental problems will entail significant and widespread changes, yet without a commitment to unconditional social provision, talk of resilience, flexibility, and adaptation are all too easily collapsed into justifications of perpetual precarity.\nObserving the protests outside the Copenhagen climate summit in 2009, reflecting on the apparent tension between the recognition of limits cautioned by those claiming “there is no planet B” and the limitlessness implied by chants of “everything for everyone,” Michael Hardt suggested the need to “develop a politics of the common that both recognizes the real limits of the earth and fosters our unlimited creative capacities — building unlimited worlds on our limited earth.” Virginia Woolf might seem an odd place to turn in response, but her essay A Room of One’s Own , while best known as a classic piece of feminist polemic, could serve just as well as a manifesto for such a politics. In it, she reflects on the “instinct for possession, the rage for acquisition” which keeps “the stockbroker and the great barrister going indoors to make money and more money and more money when it is a fact that five hundred pounds a year will keep one alive in the sunshine.” With that five hundred pounds, she wrote, came the freedom to think and write as she pleased. We should add a few more things to the list — universal healthcare, a bus pass — but figuring out what it takes to keep all seven-billion-plus people on the planet alive in the sunshine will be the fundamental task of the twenty-first century.\nThe post-work future is often characterized as a vision of a post-scarcity society. But the dream of freedom from waged labor and self-realization beyond work suddenly looks less like utopia than necessity.\nFinding ways to live luxuriously but also lightly, adequately but not ascetically, won’t always be easy. But perhaps in the post-post-scarcity society, somewhere between fears of generalized scarcity and dreams of generalized decadence, we can have the things we never managed to have in the time of supposed abundance: enough for everyone, and time for what we will.", "url": "https://www.jacobinmag.com/2014/01/alive-in-the-sunshine/"}