{"authors": ["Peter Frase", "Mike Davis", "Liza Featherstone", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis", "Mímir Kristjánsson"], "date_download": "2020-05-04 19:53:52", "date_modify": "2020-05-04 19:53:52", "date_publish": "2014-01-16 00:00:00", "description": null, "filename": "2014_01__1588622032.html", "image_url": "https://images.jacobinmag.com/2014/01/16234358/Screen-Shot-2014-01-21-at-12.15.01-PM-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_01__1588622032.html", "title": "The Left and the State", "title_page": "The Left and the State", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The New Republic has long been notorious for posing as a liberal magazine while publishing articles that serve mostly to undermine liberal and progressive politics.\nThis tendency seemed to abate a bit when Facebook millionaire Chris Hughes took over the magazine from the notorious racist and warmonger Marty Peretz. The latest from Sean Wilentz, however, falls squarely within the old tradition. We are to believe that rather than principled critics of the surveillance state, the likes of Edward Snowden and Glenn Greenwald are motivated by “paranoid libertarianism”; they “despise the modern liberal state, and they want to wound it.”\nHenry Farrell has already done the necessary demolition of this hack work at Crooked Timber , so there’s no need for me to repeat it. And I’d be less concerned if this line of argument were limited to Wilentz, who has an established track record as a truculent apologist for established government elites.\nBut Wilentz’s argument resembles Mark Ames’ ongoing crusade against Greenwald and Snowden, as well as David Golumbia’s criticism here at Jacobin of “cyberlibertarianism.” So I’m interested in what drives this obsession with people like Greenwald and Snowden as vectors for noxious libertarianism rather than people who are doing courageous and useful work even if their politics aren’t socialist.\nI think Henry Farrell is right to see, with Wilentz, an attempt to conflate the ideal of the liberal state with the existing national security state, in an attempt to force defenders of the welfare state to also embrace the authoritarian warfare state. But with the sympathizers to Wilentz’s left, something a bit different is going on.\nI found this post from Will Wilkinson helpful in thinking this through. Wilkinson is libertarian-ish in his beliefs, but I find he can provide a helpful perspective, despite coming from rather different moral and political economic premises. In this case, I think he correctly identifies the trap that some of these left attacks on people like Snowden or Greenwald fall into.\nWilkinson notes that theoretically, libertarianism is “an argument against the possibility of legitimate government.” This makes it clearly incompatible with most socialist or social democratic attempts to democratize the market or expropriate the means of production. Yet nevertheless, “it’s crazily illogical to reason that the actually existing state is justified on liberal terms just because the libertarian critique of the state is false, and a legitimate liberal state is possible.”\nSubstitute “socialist” for “liberal,” and I think the point stands just as well. He further points out that mounting a libertarian defense of our current economic relations depends on a parallel sleight of hand, “confusing our unjustifiably rigged political economy with a very different laissez faire ideal.”\nBut there seems to be an instinct among some on the Left to suppose that defending the possibility of government requires rejecting any alliance with libertarians who might criticize particularly noxious aspects of the existing state. Or, to be a bit more subtle, that any critique that emphasizes government authoritarianism merely distracts us from the critique of private power, in particular the power of the boss.\nI don’t think it’s true that attacks on NSA surveillance somehow make it harder to bring up corporate privacy abuses or the tyranny of capital in the workplace. But more than that, I think that when leftists set themselves up as defenders of government against libertarian hostility to the state, they unwittingly accept the Right’s framing of the debate in a way that’s neither an accurate representation of reality nor a good guide to political action.\nThe Right, in its libertarian formulation, loves to set itself up as the defender of individual liberty against state power. And thus contemporary capitalism — often referred to by that overused buzzword, “neoliberalism” — is often equated in casual left discourse with the withdrawal of the state.\nBut in the works that developed neoliberalism as a category of left political economy, this is not how things are understood at all. Neoliberalism is a state project through and through, and is better understood as a transformation of the state and a shift in its functions, rather than a quantitative reduction in its size. In his Brief History of Neoliberalism , David Harvey underlines the importance of the state in forcibly creating a “good business climate” by breaking down barriers to capital accumulation and repressing dissent. Hence:\nNeoliberalism does not make the state or particular institutions of the state (such as the courts and police functions) irrelevant, as some commentators on both the Right and the Left have argued. There has, however, been a radical reconfiguration of state institutions and practices (particularly with respect to the balance between coercion and consent, between the powers of capital and of popular movements, and between executive and judicial power, on the one hand, and powers of representative democracy on the other).\nThe growth of the surveillance state, in this formulation, clearly makes up a central part of the neoliberal turn, and is not something ancillary to it.\nHowever, the misrecognition of the specifically neoliberal state continues to mislead liberals and leftists, and not only on the topic of the national security state — a state, it should be noted, that is inextricably linked with the nominally private sector, in the form of contractors such as the one that employed Edward Snowden. As the neoliberal state moves in the direction of governing through crime, it becomes increasingly important to dismantle the prison-industrial complex, a joint public-private project of domination, exploitation, and social control.\nAnd yet there is the persistent temptation to invoke the genie of state repression, despite the Left’s documented inability to make it do its bidding. That can take the form of “humanitarian” warmongering or what Elizabeth Bernstein has described as “carceral feminism”: “a vision of social justice as criminal justice” that attempts to deploy the repressive power of the state to protect women who are portrayed as helpless victims.\nOr take a very different issue: the recent chemical spill in West Virginia, which has exposed hundreds of thousands of people to toxic drinking water. The always-acerbic and astute Dean Baker notes the witless habit of referring to this event as “a failure of government regulation” and a consequence of “free-market fundamentalism.”\nThe real issue, he notes, is that the state protects the property rights of the rich while allowing them to profit from befouling our common resources. Baker has, I think, done some of the best popular writing attacking the fiction that the Right is for free markets while the Left is for government regulation. As I’ve noted elsewhere, the contest before us in the immediate future is between different regimes of state-created and -enforced property, not between the state and the market.\nOne should not have any illusions that critics of the national security state all share socialist politics. But we should judge these critics by what they say and do and what their political impact is. An endless inquisition into hidden beliefs and motives, and the attempt to unmask a devious libertarian hidden agenda, makes for a satisfying purity politics for those who want to justify their own inaction. But it does nothing to contest the predatory fusion of state and capital that confronts us today, which must be confronted in the government, the workplace, and many other places besides.", "url": "https://www.jacobinmag.com/2014/01/the-left-and-the-state/"}