{"authors": ["Kevin Prosen", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:48", "date_modify": "2020-05-04 19:53:48", "date_publish": "2014-02-16 00:00:00", "description": null, "filename": "2014_02_grieve-to-win_1588622028.html", "image_url": "https://images.jacobinmag.com/2014/02/16234548/Screen-Shot-2014-02-27-at-12.10.30-PM-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_02_grieve-to-win_1588622028.html", "title": "Grieve to Win", "title_page": "Grieve to Win", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "This article can be found in Class Action: An Activist Teacher’s Handbook , a joint project of Jacobin and the Chicago Teachers Union’s CORE. The booklet can be downloaded for free, and print copies are available for a limited time.\nFiling a grievance is the most rudimentary form of union activity and representation in the workplace.\nA grievance is filed when a union member feels that management or administration has violated one of the principles of their contract. For many workers, it is their first experience in organized workplace confrontation.\nTo the union staffer, the grievance is often the most important way that unions advocate for their members at the level of the “shop floor.” For workers experienced with the process, however, it can feel like a kind of cruel trick; grievances linger sometimes for years without even checking a boss’s behavior. Often no resolution is ever achieved. Despite the shortcomings of the grievance process, it can be a useful tool for educators looking to invigorate their union chapter, when conducted with the kind of solidarity and élan typically lacking from narrow discussions of contract interpretation and arbitration settlements.\nThe grievance system itself emerged as part of the post–World War II system of labor-capital relations that solidified “business unionism” as a bulwark against the pre-war period’s more radical forms of labor struggle. It allows for management to channel workers’ discontent into less threatening channels than the strike waves of the depression and those immediately following World War II. Union staff and bureaucracies ballooned across all industries in order to manage the new apparatus of “shop floor jurisprudence.” Such a system, whatever the surface symmetries between labor and management, inevitably favored employers.\nLabor scholar Kim Moody describes the way bosses exploited this system:\n[M]anagement could remove an issue from the shop floor to a higher level simply by denying any grievance at the first step or two of the procedure. Grievances then piled up at higher stages and were either arbitrated if they were regarded as important by higher levels of the union or bargained away at contract time. As a consequence of the time-delay inherent in the system, management initiatives, even when blatantly in violation of the contract, could not be stopped through the grievance procedure.\nThis will sound familiar to anybody working in a modern teachers union. Such time delays have the effect of dampening organization and action on the “shop floor” and creating immense frustration among the membership, while allowing management prerogatives to continue unabated. The grievance process can also be used by administration as a form of bargaining by force, wherein management can try to press on ambiguous parts of the contract in the hope of obtaining an arbitration decision in their favor.\nIn his 1973 pamphlet “Toward Teacher Power,” Steve Zeluck wrote of this process: “Thus the board may decide to openly violate a clause (especially if it is in the least bit ambiguous). This is done only partly as a ‘testing’ operation. For if the union takes the grievance to arbitration, there is, on the average, at least a 50-50 chance of losing.” Indeed, many grievances stall before arbitration, since the unions are only willing to bring ones they’re certain they’ll win. In opposition to this unsatisfying resolution mechanism, Zeluck proposed alternative courses of direct action on the job site: “group refusal to perform extra-curricular duties, voluntary duties, coaching duties, sick-outs, demonstrations, etc.”\nSuch propositions are music to the ears of many union militants, although they sound like anachronistic advice when many of our coworkers are terrified to put their name on a petition to their principal or grieve even the most flagrant contract violations. Often teachers are more willing to pursue individual solutions; “playing along” and “staying off the radar” replace concerted action and militancy. Zeluck was writing in the early seventies after a period of sustained teacher militancy, including illegal strikes which had given birth to modern teacher unionism in many cities.\nPresent-day teachers have nothing approaching this experiential basis from which to draw courage. Fear, anxiety, and individual solutions have replaced solidarity and concerted action. While exciting new forms of rank-and-file defiance have started to emerge — like the boycott of standardized testing at Garfield High School in Seattle last year — such examples remain exceptions to the general rule.\nHow do we get from here to there? What can teachers do to break down fear and apathy in the workplace and lay a basis for more daring forms of struggle that will be necessary to confront corporate education reform? Since it is “within the system” and not outside it, organizing a grievance campaign in your school can be a useful transitional step toward more confrontational forms of action. Rather than placing faith in the grievance and arbitration system, rank-and-file teachers need to make the grievance machine work for them. We grieve not because we believe in the process, but to prepare the groundwork to transcend it in the future.\nGrievances as a form of workplace action are not without certain distinct advantages. Once freed from the narrow bureaucratic concerns of what is most likely to win at an arbitration table, the grievance becomes a useful way to educate, agitate, and organize, as the old mantra goes. The important thing is to infuse the process with a sense of collective action, that forgotten key to effective unionism. Because it pertains to specific contract articles, the grievance provides an opportunity to train staff to read and interpret the contract, a skill which does not come naturally to anyone and which the unions do not, unfortunately, cultivate among the general membership. Since teachers are often scared of administrative retaliation for sticking their necks out, conducting a grievance collectively can teach a basic lesson about the power of solidarity.\nActivists should identify issues that affect the entire staff or an entire department; there’s safety and strength in numbers. This could be the allocation of per-session jobs, abuse of non-teaching assignments, forced overtime, micromanagement, or any other issue large or small that affects large numbers of people on your staff. If the particular grievance isn’t covered by the contract, file it anyway as a letter of protest or complaint to the principal, rather than as a formal grievance. Once you’ve freed yourself from the concerns of winning at some uncertain future at the arbitration table and committed yourself to asserting strength in the workplace, there’s no need to be bound by what is “contractual.”\nTrain a layer of collaborators on the staff in the specific grounds for the grievance, and how to engage with staff members’ hesitations and doubts. Be sure to talk to every staff member and check them off as they sign. Having more than one person circulating the grievance helps show that it is a collective process, not the work of a rogue crank. When the principal schedules the “Step One” meeting, bring all the signatories into the office together, no matter how many there are. Show that the staff is united.\nSuccessful campaigns like this can alter the school environment, even if they don’t “win” in the narrow terms afforded by the grievance process. For the staff, they can produce a sense of collective strength and solidarity that can break down the isolation of the classroom experience and the divisive pressures at play in the school system. It can also compel administration to be more conflict-avoidant, and seek more collaborative ways to resolve potential problems with the staff rather than against them. This is the most basic and elemental level of workplace power, one that has been conceded long ago in countless schools across the country.\nMost contemporary teachers’ unions lack militancy, membership solidarity, and even a meaningful connection with rank-and-file educators. A thoughtful, well-organized grievance campaign can help build unions at the most important level, in the schools. Such organization is the precondition for turning the tide of education reform. It would be a small step, but one in the right direction.", "url": "https://www.jacobinmag.com/2014/02/grieve-to-win"}