{"authors": ["Peter Frase", "Mike Davis", "Liza Featherstone", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis", "Mímir Kristjánsson"], "date_download": "2020-05-04 19:53:36", "date_modify": "2020-05-04 19:53:36", "date_publish": "2014-12-17 00:00:00", "description": null, "filename": "2014_12__1588622016.html", "image_url": "https://images.jacobinmag.com/2014/12/17001906/food-stamps-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2014_12__1588622016.html", "title": "Beyond the Welfare State", "title_page": "Beyond the Welfare State", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Yesterday, Jacobin published Seth Ackerman’s translation of an interesting interview with French sociologist Daniel Zamora, discussing his recent book about Michel Foucault’s affinities with neoliberalism. Zamora rightly points out that the “image of Foucault as being in total opposition to neoliberalism at the end of his life” is a strained reading of a thinker whose relationship to the crisis of the 1970s welfare state is at the very least more ambiguous than that.\nAt the same time, Zamora’s argument demonstrates the limitations imposed by the displacement of “capitalism” by “neoliberalism” as a central category of left analysis. For his tacit premise seems to be that, if it can be shown that Foucault showed an “indulgence” toward neoliberalism, we must therefore put down his influence as a reactionary one.\nBut what Foucault’s curious intersection with the project of the neoliberal right actually exemplifies, I would argue, is an ambiguity at the heart of the crisis of the 1970s that gave rise to the neoliberal project. That he can be picked up by the Right as easily as the Left says much about the environment that produced him. Meanwhile, Zamora’s own reaction says something important about a distinction within the social democratic left that is worth spending some time on, which I’ll return to below.\nZamora makes much of the neoliberal move away from the attempt to reduce inequality, in the direction of targeted efforts to alleviate poverty and provide a minimum standard of living. (In a juicy bit bound to delight those of us immersed in the wonky details of empirical measures of inequality, he even quotes one of Foucault’s right-wing contemporaries positing that “the distinction between absolute poverty and relative poverty is in fact the distinction between capitalism and socialism.”)\nBut in doing so, he elides the force of the Foucauldian critique of the welfare state. It is true that the move away from universal social provision and toward targeted aid is a hallmark of social policy in the era of welfare state retrenchment. But this is not the main point of Foucault’s argument, even by Zamora’s own telling.\nFoucault, he argues, “was highly attracted to economic liberalism” because “he saw in it the possibility of a form of governmentality that was much less normative and authoritarian than the socialist and communist left.”\nIt is possible to see this as nothing more than either reaction or naïveté, as Zamora seems to when he warns of Foucault’s mistake in putting “the mechanisms of social assistance and social insurance . . . on the same plane as the prison, the barracks, or the school.” But it’s possible to extract a different lesson about the nature of the system that Foucault was analyzing.\nAt the heart of Zamora’s own project, he says, is a disagreement with Geoffroy de Lagasnerie’s argument that Foucault represents “a desire to use neoliberalism to reinvent the left.” Rather, he argues “that he uses it as more than just a tool: he adopts the neoliberal view to critique the Left.”\nHere we have the crux of the problem. For Zamora, the key political opposition is between “neoliberalism” and “the Left.” But neoliberalism is only a historically specific phase of capitalist class strategy, one which itself developed in the context of the particular form of welfare capitalism and class compromise that arose in the mid-twentieth century. So if “the Left” is conceived primarily as a project against neoliberalism, its aims will be limited to the restoration of the pre-neoliberal order, which Zamora defines as “social security and the institutions of the working class.”\nBut the value of Foucault, and others like him, is in highlighting the limits of any such strategy. Postwar welfare capitalism was, to be sure, a substantive achievement of the working class and the socialist movement. And it represented an equilibrium — call it the Fordist compromise — in which workers shared in the benefits of rising productivity.\nBut it was also an inherently contradictory and self-subverting order. This was true both from the perspective of capital and of labor.\nFor the capitalist, long periods of full employment and strong labor movements meant a profit squeeze and escalating political instability as workers lost their fear of unemployment and poverty. The Fordist compromise was no more satisfactory for workers, as the historian Jefferson Cowie documents in his writing on the 1970s. What was called the “blue collar blues” represented the desire of workers for more than just higher paychecks: for more free time, for control over the labor process, for liberation from wage labor.\nThe welfare state institutions that arose in that context were marked by the same contradiction: they were at once sources of security and freedom, and instruments of social control. As Beatriz Preciado says, in a quote Zamora produces as evidence of the bad new libertarian left: “the welfare state is also the psychiatric hospital, the disability office, the prison, the patriarchal-colonial-heteronormative school.”\nOne aspect of the welfare state made it dangerous to the employing class, while another chafed on the employed (and unemployed). Welfare capitalism has always been characterized by this tension between universalistic benefits tied to a universal notion of social citizenship, and carefully targeted systems of qualification and incentive designed to prop up specific social relations, from the workplace to the street to the home. This is a key insight of the school of comparative welfare state study that distinguishes the decommodifying from the stratifying elements of the welfare state.\nOne way to think of this is as the permeation of the contradictions of bourgeois democracy into the economic sphere. Just as capitalist democracies exist in an uneasy tension between the principles of “one person one vote” and “one dollar one vote,” so does the system of economic regulation simultaneously work to support the power of the working class and to control it.\nIn contrast, Zamora seems unwilling to countenance this two-sided quality to class compromises in capitalism. As he puts it, the choice is either “that social security is ultimately nothing more than a tool of social control by big capital” (a view held by unnamed persons on “the radical left”), or that the bourgeoisie “was totally hostile” to institutions that “were invented by the workers’ movement itself.”\nZamora appears to view social insurance as representing the creation of “social rights” that cushion workers from the vagaries of the market, while leaving the basic institutions of private property and wage labor in place. This is a non-Marxist form of social democracy with deep theoretical roots going back to Karl Polanyi and T. H. Marshall, and it was arguably the main way in which the European social democratic parties saw themselves in their heyday.\nThis kind of social democracy is the protagonist in Sheri Berman’s recent book on the history of European social democracy, in which the Polanyian pragmatists are pitted against Marxists who, in her view, ignored the exigencies of social reform altogether in favor of an apocalyptic insistence that the capitalist system would inevitably collapse and usher in revolution. The endpoint of this kind of Polanyian socialism is a welfare state that protects the working class from the workings of an unfettered market.\nThere is, however, another way to think about the welfare state from a Marxist perspective. It is possible to believe that fighting for a robust and universal welfare state is a necessary and desirable project, while at the same time believing that the socialist imagination cannot end there, because the task of humanizing capitalism generates its own contradictions.\nOn this view, the system Foucault analyzed was a system that could not simply continue on in static equilibrium; it had to be either transcended in a socialist direction, or, as happened, dismantled in a project of capitalist retrenchment. From this perspective, the importance of figures like Foucault is not just as misleaders or budding reactionaries, but as indicators of social democracy’s limits, and of the inability of the mainstream left at the time to reckon with the crisis that its own victories had produced.\nBy the same token, neoliberalism can be seen not just as a tool to smash the institutions of the working class, but also as a mystified and dishonest representation of the workers’ own frustrated desires for freedom and autonomy.\nZamora speaks of Foucault imagining “a neoliberalism that wouldn’t project its anthropological models on the individual, that would offer individuals greater autonomy vis-à-vis the state.” Other than the name, this does not sound much at all like the really existing neoliberal turn, which has only reconfigured the densely connected relationship between state and market rather than freeing the latter from the former.\nThis vision of autonomy sounds more like the radical move beyond welfare capitalism, toward Wilde’s vision of socialist individualism. (Provided, that is, that we accord autonomy from bosses equal place with autonomy from the state.) Postmodernism as premature post-capitalism, as Moishe Postone once put it.\nNone of this is to say that the fight for universal social provision is unimportant; nor is it to dispute Zamora’s point that the fight for universal economic rights has tended, in recent times to be eclipsed by “a centering of the victim who is denied justice,” as he quotes Isabelle Garo.\nThe point is only that it is worth thinking about what happens on the other side of such battles. Whether one finds it useful to think along these lines depends, ultimately, on what one sees as the horizon of left politics.\nZamora speaks mournfully of the disappearance of exploitation and wealth inequality as touchstones of argument and organizing, and of the dismantling of systems of social insurance. Yet he himself seems unwilling to go beyond the creation and maintenance of humanized forms of exploitation, a perhaps more egalitarian (but not equal) distribution of wealth. He speaks favorably of Polanyi’s principle of “withdrawing the individual out of the laws of the market and thus reconfiguring relations of power between capital and labor”; meanwhile, André Gorz’s elevation of the “right to be lazy” is dismissed and equated with Thatcherism.\nThis Polanyian social democracy as a harmonious “reconfiguring” of the capital-labor relation is a far cry from the Marxist insistence on abolishing that relation altogether. But its inadequacy as either an inspiring utopia or a sustainable social order is the real lesson of the crisis that gave rise to neoliberalism. And while Foucault may not have come to all the right conclusions about addressing that crisis, he at least asked some of the right questions.", "url": "https://www.jacobinmag.com/2014/12/beyond-the-welfare-state/"}