{"authors": ["Stathis Kouvelakis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:31", "date_modify": "2020-05-04 19:53:31", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08__1588622011.html", "image_url": "https://images.jacobinmag.com/2015/08/17005240/Greece_protest-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08__1588622011.html", "title": "Introducing Popular Unity", "title_page": "Introducing Popular Unity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Early this morning, twenty-five Syriza MPs left the parliamentary group of the party to create a new group under the name of “Popular Unity.” Most of these MPs are affiliated with the Left Platform, but some others also joined like Vangelis Diamantopoulos or Rachel Makri, a close collaborator of Zoe Kostantopoulou.\nThis is a major development in Greek politics but also for the radical left, in Greece and at an international level.\nThree things need to be emphasized.\nThe first is that “Popular Unity” is the name of the new political front, which will regroup thirteen organizations of the radical left — those who signed the text issued on August 13 calling for the constitution of the Front of the No. This front is therefore the first tangible result of a recomposition within the Greek radical left — recomposition that draws the lessons of the last five years and of course of the experience of Syriza in office and of the resulting catastrophe.\nBut the goal of the front is even broader than this. It is to provide an expression to social forces that do not necessarily recognize themselves as part of the Left but want to fight austerity, the memoranda, and the “troika rule reloaded” of the new memorandum.\nThe second is that the goal of the front is to constitute the political expression of the “no” as was expressed both in the January elections and in the referendum of July 5.\nThe main programmatic lines are the rupture with austerity and the memoranda, the rejection of all privatizations, and the nationalization under social control of strategic sectors of the economy (starting with the banking system), the cancellation of the major part of the Greek debt (starting with the immediate interruption of its repayment), and, more broadly, a set of radical measures that will shift the balance of forces in favor of labor and of the popular classes and open up a path for the progressive reconstruction of the country, of its economy, and of its institutions.\nAs the recent disaster had abundantly demonstrated, these goals cannot be realized without exiting the eurozone and breaking with the whole set of policies institutionalized by the European Union. The front will also struggle for a unitary internationalist struggle around common objectives at the European and international level and will support exiting NATO, breaking the existing agreements between Greece and Israel, and radically opposing imperialist wars and interventions. This transitional program is situated in the perspective of a socialism of the twenty-first century.\nThe third is that this new parliamentary group is now the third largest group in the Greek Parliament, ahead of Golden Dawn, the neo-Nazi party. This means that in the next few days its leader, Panagiotis Lafazanis, will get a mandate to constitute a government that will last for three days, as the Greek constitution stipulates.\nAfter the resignation of the Tsipras government, this mandate is now in the hands of the second party in parliament, New Democracy, the main right-wing opposition party. This span of time will be used by Popular Unity to trigger a broad debate and the mobilization of all the social forces who wish to fight austerity and the memoranda, the previous as well as the new one.\nThe program of the party and the full range of its support among leading personalities of the Greek left, which is expected to be quite impressive, will be released at the start of next week.", "url": "https://www.jacobinmag.com/2015/08/popular-unity-syriza-left-platform-lafazanis/"}