{"authors": ["Kevin Ovenden", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:03", "date_modify": "2020-05-04 19:54:03", "date_publish": "2015-01-17 00:00:00", "description": null, "filename": "2015_01_greek-right-golden-dawn-samaras_1588622043.html", "image_url": "https://images.jacobinmag.com/2015/01/17002509/o-GOLDEN-DAWN-facebook-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_01_greek-right-golden-dawn-samaras_1588622043.html", "title": "The Greek Right", "title_page": "The Greek Right", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThere are a lot of significant elections in Europe this year — including Britain’s contest in May. It’s fitting, then, that today’s “Republican march” of national unity in Paris morphed into a display of “European solidarity” — or, spelling it out more accurately, of solidarity between European political leaders facing angry electorates. Where better, then, for conservative Greek Prime Minister Antonis Samaras to roll up as part of his desperate election campaign to stave off victory by Syriza. His presence underlines the political chicanery with which the European elites have responded to the Charlie Hebdo atrocity. The march began to run into the political rapids two days ago when Nicolas Sarkozy and the center-right Union for a Popular Movement (UMP) called on Socialist Party president François Hollande to include Marine Le Pen and her far-right National Front in the parade. “I represent a quarter of the French population,” said Le Pen, “how can there be national unity without me?” The question cuts right through the piles of left-wing verbiage claiming that rallying for the republic is the way to unite France against the Right. Whether by accident or design, Hollande — the most unpopular French president on record — happened on an elegant solution. The march was to be Europeanized, unity of the nation replaced by another group selfie of European Union leaders. Le Pen could be excluded by ensuring the presence of Cameron, Merkel . . . and, at his own insistence, it seems, Samaras. So in order to construct a cordon around Le Pen, Hollande will march with Samaras — whose interventions following the Paris killings have been more extreme than those of the National Front leader — and give him a fillip two weeks before polling day. Syriza and the Left are ahead in the polls. For seventy years anti-Communism — through state policy and force of arms — has kept the Left in Greece in opposition (sometimes in exiled opposition). That it could hold office following the January 25 elections is immense. But we should not lose sight of the Right. New Democracy is only just behind Syriza in the opinion polls. And on the eve of the great display of European hypocrisy in Paris, it’s worth shedding some light on the recesses of the Greek right.\nLineages of the Absolutist Right Across Western Europe, decades of post-war stability allowed for a transformation of politics from the mass, violent clashes of the 1930s into the more pacific confines of parliamentary democracy. Christian Democracy emerged — or, rather, was crafted with great resource and effort — as a broad church for a range of forces which had in the interwar years fought for political power under their own banners: national conservatives, industrialists, religious conservatives, liberals, fascists. In Greece, the process was delayed and took a peculiar course. The Greek Civil War led to three decades of illegality for the Left, which had to operate under front organisations. The Cold War entrenched in power — backed by the US and Britain — a monarchist, authoritarian right for whom political violence was customary. Whether you’ve seen it before or not, this month really would be a good time to put on a DVD of Costa Gavras’s superb film Z . It tells the story of the assassination of left-wing politician (and outstanding athlete) Grigoris Lambrakis in Salonika in 1963. The conspiracy went right to the top of the military-monarchist right. Its techniques prefigured the strategy of tension of the Italian capitalists in the 1970s. The Greek right manufactured a supposedly autonomous protest movement of “indignant” citizens, a “silent majority” of anti-Communist thugs. Two of them bludgeoned Lambrakis to death. But culpability for the murder went further and higher. In counter-revolutionary tactics the late developing Greek state was thoroughly modern and ahead of its time. With the Left beaten out of the political sphere, official opposition was in the hands of liberals and centrists. A military coup in 1967 was a last-ditch effort by the ugly triptych of the oligarchs, the palace, and their allies in the US embassy to hold together the anachronism. Despite great brutality, all it achieved was to dam up for a few more years the generational social changes which were shaking the rest of the world. When the junta fell in 1974, it was as if the Beatles’s Sgt. Pepper, Woodstock, May ’68, the Tet Offensive, and the Italian Hot Autumn all hit Athens in the same month. There could be no return for the Greek capitalist class to monarcho-military methods. Instead, they cohered around the patrician figure of Konstantinos Karamanlis, who had remained outside Greece during the coup years and returned to found the New Democracy party. Italian Christian Democracy had had the luxury of twenty years to meld together competing right-wing forces (bound together by golden threads of corruption, the mafia, and the immense social resources of the Catholic Church). New Democracy had to do it all in the course of the tempestuous mid-1970s. One consequence was that New Democracy was dominated by old style, paternalistic politicians of the Right. The familial and institutional connections with the traditionally anti-democratic establishment remained strong. At the same time, like the rest of the center-right in the 1980s and 1990s it tried to be the party of economic liberalism — in the Thatcher-Reagan model. In popular appeal, however, national conservative themes of patriotism, religious orthodoxy, anti-communism, and outright racism played heavily. Five years ago, for example, New Democracy refused to support in parliament the austerity memorandum which then-prime minister George Papandreou had signed up to with the troika of European and international lenders. It did so for the narrowest of party motives. That prompted ideologically committed neoliberals, led by Dora Bakoyannis, to split, temporarily. Bakoyannis is the standard bearer of the neoliberal, modernizing right — and also scion of New Democracy’s Mitsotakis clan. Today, she is back with New Democracy, but her tendency is not in command of the party. Leadership is in the hands of Samaras. The chasm between the two is more than ideological. Samaras led a national-chauvinist split from New Democracy in the 1990s. He returned just in time to be given the leadership six years ago over the head Bakoyannis and the Mitsotakis clan, who had remained loyal to the party all those years.\nThe Feral Right The reconfiguring of the Right in Greece is, in hothouse microcosm, part of a Europe-wide phenomenon. The singular pole of Christian Democracy is fragmenting, allowing a variety of right-wing forces — from anti-European chauvinist to outright fascist — to reemerge in their own party formations. The National Front in France, dismissed as a short-lived Poujadist protest movement in 1983, is the largest iceberg to calve from the retreating glacier. The most successful ruling-class party in history — the British Tory Party — now faces serious defection to the UK Independence Party. Even Germany, beneficiary of the euro arrangement, has the right-wing populist Alternative for Germany above the 5 percent threshold for election to parliament. The process is further advanced in Greece. The Independent Greeks broke on a nationalist, but anti-memorandum basis. They are struggling to survive. The Popular Orthodox Rally (LAOS) racist-nationalist party was first to take a chunk of New Democracy support. Its collapse led not to the restoration of the Right along quietist parliamentary corridors, but to its two-fold radicalization. First, the open neo-Nazis of Golden Dawn filled the space. Secondly, LAOS defectors to New Democracy were given pride of place, despite their often fascist credentials. There is an affinity between Makis Voridis — former LAOS now New Democracy MP — and Samaras. Voridis was a notorious fascist stormtrooper in his younger days. There’s a famous photograph circulating of him wielding an axe on his way to confront left-wing law students. Samaras may not have personally wielded an axe. But his entire political line over the last five years has been to reach deep into the collective memory of the Right, dredging up every filthy anti-Communist smear and innuendo of the Civil War years. The confection is spiced with the most virulent anti-immigrant, anti-Muslim racism. So a few days ago, Samaras began the election campaign in earnest by visiting the far-flung border between Greece and Turkey marked by the river Evros. It is here that border control has been handed willingly to European corporation Frontex, paid handsomely to keep migrants out. There is, in effect, a premium for every lifeless black or brown person who washes up on the banks of the river. Samaras is making the crudest of anti-immigrant pitches, and we didn’t have to wait to see the consequence. On Friday — almost wholly ignored in the wake of the grim news from Paris — a gunman entered a hostel housing primarily migrant workers in Salonika, brandished a pistol, and threatened to open fire because he “was sick of paying taxes for you people.” A social outcast, perhaps? A thug belonging associated with the fascists of Golden Dawn? No. Stelios Ioannides is a local functionary of Samaras’s New Democracy. The Golden Dawn fascists do have “security battalions.” The police and army do have longstanding and familial links to the anti-democratic right. But you don’t have to look that far into the “deep state” to see the ugly face of right-wing paramilitary violence. It is in the offices of the outgoing governing party.", "url": "https://www.jacobinmag.com/2015/01/greek-right-golden-dawn-samaras"}