{"authors": ["Tad Tietze", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:06", "date_modify": "2020-05-04 19:54:06", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08__1588622046.html", "image_url": "https://images.jacobinmag.com/2015/08/17004931/negotiations-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08__1588622046.html", "title": "The Failed Strategy", "title_page": "The Failed Strategy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe leader of Spain’s Podemos party, Pablo Iglesias, recently explained why he thought the deal Syriza reached with the European institutions was “sadly, the only thing they could have done.” As a small southern European government, Greece didn’t have the political power to go another route. He added that even Podemos would only be able to deliver very limited reforms: We can’t do more than that. We defend the same thing that Christian Democracy did thirty years ago. But in this chess game in which we have got almost nothing, there’s not much more we can do. Spain can do a little more than Greece . . . but the limits are massive. Is politics nice? No, it’s absolutely horrible, abject, the worst thing. [But] what the situation in Europe has shown is that politics depends on the power you’ve got. In a similar vein, Leo Panitch and Sam Gindin have criticized those who would attack Syriza’s leader Alexis Tsipras as not being willing to acknowledge the lack of a social base for a more radical rupture — first from the eurozone, and then “with the European Union as a neoliberal free trade and free capital zone.” Panitch and Gindin come across as more hopeful than Iglesias in that they pose the possibility of Syriza winning its supporters to a prolonged period of social sacrifice as the political capacity is built for such a radical project, although how a government implementing brutal austerity can simultaneously build popular capacity for opposition to austerity remains unclear. Bleaker assessments of the limits of the present European left project would be hard to imagine. For all the ideological passion of the radical left, for all its historical commitment to fundamental social transformation, the current pickings are slim indeed. Apparently now what we have to look forward to from political success is more of the very austerity that we were supposed to overturn. These are a far cry from the mantra of “hope against fear” that reverberated through the international left from the time of Syriza’s sudden breakthrough in the May 2012 general election, and which was stepped up again when the party was able to form a coalition government in late January. Even if the Syriza leadership around Tsipras had moderated its platform, not only was this the first far-left led European government since the end of World War II, but it was also the first serious governmental challenge to the harsh austerity that the eurozone had pushed since the first Greek bailout in 2010. One of the products of the “hope” mantra was a dismissal (and sometimes denunciation) of those who raised the notion that something other than a project like Syriza was needed to reverse the deep social suffering being inflicted on ordinary Greeks. Even many who were critical of the Syriza leadership’s commitment to remaining within the single currency argued that the minority inside the party who called for some kind of Grexit proved that being inside Syriza was the most important political place to be. In that line of thinking, the presence of a platform grouped around a mostly correct program of action within Syriza meant that a Syriza government itself was worth having, because if the pro-euro line failed in practice the minority view would have its time in the sun. That is, “after Tsipras, our turn.” Hopes were raised again as the post-election negotiations with the Eurogroup began. Yanis Varoufakis’s unorthodox negotiating style and public shenanigans seemed to announce a new, more aggressive approach to the troika. It is important to understand what the initial strategy entailed, because it has been obscured by claims that Syriza’s electoral mandate was supposed to shift the troika by moral persuasion. Varoufakis was brought on board because he had long put forward a view that it was in the economic self-interest of the stronger eurozone nations (especially Germany) to use their creditor status to “recycle” the debts of the poorer and more indebted peripheral nations — similar to how the United States related to a decimated Europe after the Second World War. On this view, countries like Germany were undermining the integrity of the euro by pressing for a strict rules-based approach to public finances across the currency zone, since such rules would eventually lead to the default and exit of weaker countries like Greece. These rules precluded the writing off (or “restructuring”) of Greek debt that even the IMF was calling unsustainable. What Tsipras and Varoufakis found in the negotiations was a wall of opposition to their argument, one that seems to have caught them off guard. This was especially because other “periphery” governments (Ireland, Portugal, and Spain) that had suffered most in the crisis were even more vicious in defending the “German” approach than the Northern Europeans. The Syriza negotiators had completely missed how in a situation of massive disparity in public finances across the eurozone, amid deep economic crisis, the stronger nations would only ever move to greater political convergence on terms that protected their own fiscal integrity. They needed to overcome the widely recognized problem that monetary union without fiscal union (that is, a single political decision-making system for public spending) created dangerous centrifugal forces within the eurozone, which had become gravely apparent following the 2008 financial crisis. Tsipras and Varoufakis had simply not understood the importance of the political dimension to the eurozone crisis. This politics was not one based on “neoliberal ideology,” nor the caricatured view of the “ugly German,” but on the logic of keeping the single currency together politically, as well as economically. Additionally, also contrary to Syriza’s expectations, there was no benefit for the political classes of the indebted “periphery” nations in now allowing one of their number to get special treatment after they had inflicted deeply unpopular economic pain on their own electorates by acceding to the existing rules. Such a move would only have fed the popularity of Syriza’s local counterparts, such as Podemos, which had been making electoral gains on the basis of the crisis of the old pro-austerity parties of center left and center right. Popular anti-austerity sentiment made the other periphery governments more — not less — keen for Greece to acquiesce. The first major blow to “hope” was, therefore, the February 20 interim deal in which Syriza basically agreed to a continuation of troika (now renamed “the institutions”) monitoring of the old New Democracy austerity plans. Nevertheless, many saw this as winning “political breathing space” for Syriza to regroup and extract a better deal in the months of negotiations ahead, despite the social suffering it would lead to. Meanwhile, the fiscal rectitude of the other periphery governments was rewarded after the deal with Greece through a major tranche of Eurozone Quantitative Easing (monetary stimulus), one that would be unlikely to reach Greece because of its unique circumstances.\nThe Referendum But worse was to come. As it became obvious the Eurogroup was going to press for continuation and intensification of strict fiscal discipline, with a forced Grexit dangled as punishment, Tsipras was put in an extremely difficult position domestically. On the one hand, while he had been elected to try to end austerity (even if only on a moderate platform), he had also been elected on the basis of staying inside the single currency. Greek opinion polls had consistently shown high levels of support for the latter and the absence of a widely known and credible plan for Grexit meant this was unlikely to change anytime soon. On the other hand, Tsipras faced a party in which skepticism about the euro was much higher. The Left Platform, for instance, had essentially come to the conclusion that Grexit was both necessary and inevitable. If he negotiated a crummy austerity deal, Tsipras faced the possibility of the government collapsing because his own side would vote against him in large numbers. This is certainly how Varoufakis explained Tsipras’s snap decision to call a referendum to the Eurogroup, admitting at the time that they expected the “no” to lose. Whether or not Tsipras expected (and/or wanted) “no” to win, his campaign for “no” was crystal clear about what the referendum was not about: a Grexit. The results of the democratic choice of our people will be respected, whatever their choice may be. But I want to make this clear: Any attempt for this referendum to be converted from a referendum to reject the new Memorandum to a referendum on the country’s currency serves to undermine the democratic process itself, and reveals the hidden and underlying aspirations of the Memorandum supporters. . . . Greece is neither a visitor nor a guest in the European project. We are equals among equals. No one has the right, not even institutionally according to the European Treaties that we all signed, to show us to the door to exit from our common home. We do not intend to concede this right to anyone for any reason whatsoever. On the most charitable assessment, a popular “no” could be seen as giving Tsipras some extra leverage within the Eurogroup. However, given that the January election had failed to do any such thing, a more realistic interpretation must return to Tsipras’s domestic political dilemma. Of course, calling the referendum enraged the negotiating partners and the old, discredited Greek political class, which threw itself into an anemic “yes” campaign — one based on fear of Grexit — and paid the price. It also led to significant economic disruption, with bank closures, ATM withdrawal limits, and capital controls. But rather than helping the pro-EU camp, this state of affairs ended up favoring the government. It was a strange official “no” campaign, however, because no sooner had he called the plebiscite, Tsipras was writing to try to broker a new austerity deal with the Europeans, and Varoufakis even offered to call off the referendum if its terms were accepted. In response to his offer being rejected Tsipras argued for a “no” on the basis of a break with the strategy of the old parties, but within the eurozone. Tsipras tended to not be concrete about what a “no” would mean for people’s social interests. Stathis Kouvelakis of the Left Platform, himself a supporter of a popular Grexit, has told of how when he was campaigning for “no” he found himself embarrassed that he had no answer to questions about what Syriza would do after the “no” won. There was a stark contradiction between the aspirations of the left activists who made up ground troops for the “no” campaign (many of whom were already convinced of the need for some kind of “rupture”) on one side and the intentions of the government and the consciousness of voters on the other. Again at the final massive “no” rally in Athens’s Syntagma Square on July 3, Tsipras made clear: On Sunday, we will all send a message of democracy and dignity to Europe and the world. We will send again a message of hope to the people. Because on Sunday, we are not deciding about staying in Europe. We are deciding about living with dignity in Europe, working and prospering in Europe. For all of us to be equal in Europe. And believe me, no one has the right to threaten us that they will cut Greece off from its natural, geographical home. No one has the right to threaten, to divide Europe. Greece, our country, was, is and will remain the cradle of European civilization . . . It is from this very place that the austerity technocrats want to abduct Europe again. NO. We tell them NO on Sunday. We will not leave Europe in the hands of those who want to abduct it from its democratic tradition. It is this contradiction, the ambiguous and paradoxical nature of the “no” vote, which was missed by most of its radical left supporters. As news of the massive 61 percent support for “no” rolled in, and a wave of euphoria overcame the Left, few were prepared for the political disaster that was about to engulf them.\nWithin the Rules The days after the Greek referendum were littered with commentaries from across the political spectrum that completely misunderstood what had just transpired. Some saw the vote as applying pressure on the Eurogroup to soften its demands. From others there was an expectation that the “no” would result in a rapid transit to a nasty, forced Grexit, because Syriza had so flagrantly tried to put a democratic domestic vote ahead of the rules and processes of the eurozone. Some on the Left who favored a “popular” Grexit saw this as a chance for Tsipras to come to his senses and be forced into a rupture with the logic of austerity. Most agreed with the sentiment that, “In calling the referendum, prime minister Alexis Tsipras unleashed a social outpouring,” and that: In a very short week, there has been a reckoning. Over the coming months we will learn the full measure of Sunday’s victory in the preparedness of workers, students and the unemployed within Greece and across Europe to continue the fight against every manifestation of austerity. Instead what they got was a horrific austerity deal — even more of the Eurogroup’s terms than the one that had just been rejected in the popular vote. There was no Grexit, no move to a “rupture,” and the Greek Parliament voted through the new Memorandum by large majorities. While a section of Syriza’s left refused to vote for the new deal, the Left Platform’s leader Panagiotis Lafazanis did not go any further than that. We support the government, and those of us who said ‘No’ support the efforts leading Greece to exit the crisis with its head held high and [with] social justice . . . We are deputies of this government. We support it wholeheartedly, we are the heart and soul of Syriza, we support the party, we support the party in the government, we support the prime minister — we do not support the Memorandum. In the weeks that have followed, there has been no mass social rebellion against the deal — with protests at best a small fraction of the size of the “no” rallies before the referendum. Indeed Greek opinion polls have shown Syriza maintaining its electoral lead over all the other parties, strong support for Tsipras’s negotiation of the deal despite recognition it was against the spirit of the “no” vote, and at best a minor boost to support for leaving the euro. There has been no surge in support for the parties of the far left outside Syriza. Tsipras summarized how he viewed the mandate he had been given just days later in Parliament, saying “[The Greek people] rejected the ultimatum. They did not grant a mandate for rupture. Their mandate sought to strengthen the negotiating effort for an economically viable agreement.” Few expected the ease with which his interpretation could be carried, at least in the short term. In part they were thrown off by the class distribution of the vote, with working class areas most solidly in the “no” camp and wealthy areas overwhelmingly favoring “yes.” But a class distribution of votes in a referendum is not the same as a positive assertion of social class interests. As a New York Times report after the referendum contended, the real dynamic was that Tsipras “is the last person standing in Greece’s political landscape, without a rival in sight.” Mr. Tsipras, experts say, will be speaking to a population that is deeply fed up with the politics of the last forty years and hopes he offers a change. The two parties that traded power during that time, the center-right New Democracy and the center-left Pasok, are in disarray. Put simply, Syriza was much more the beneficiary of the rapid collapse of the old political order than some kind of expression of social movements against austerity. This was true in the lead-up to the 2012 elections, as I argued at the time, and it must have been even truer after mid-2012 when, as is universally acknowledged, the overall level of social struggle declined considerably compared with the previous period. By missing this fact — and instead being preoccupied with Syriza’s historical origins in postwar communism, its main internal ideological trends, its canny move to relate to 2011’s “movement of the squares,” and the stated commitment of even its more conservative leaders to opposing austerity and carrying through some kind of “radical left” program — many commentators failed to grasp the shallowness of Syriza’s social base, and hence the even more paltry social base of its more radical internal currents. Whereas at its height of power in the 1980s Pasok was able to draw power from and carry a substantial social base to dominate Greek politics, Syriza relies far more on a negative process: the hollowing out and fragmentation of the old parties. The big “no” vote on July 5 therefore represented more a decisive rejection of the old pro-Memorandum political class than any kind of radical class break with the social crisis wrecking Greece. And it meant that while Tsipras could come out as undisputed winner within the airy realm of politics, he would have no more social power behind him to force a substantially different outcome from negotiations. The “no” vote did give Tsipras leverage to get the main opposition parties to formally agree to back him in parliamentary votes over new negotiations and austerity, allowing him to get around his internal dissidents in the immediate term. The effect was to strengthen his position within the political system, and to expose the isolation of those within his ranks who had met to draw up plans for a Grexit. For the Left Platform, Grexit was not a realistic strategy that had any chance of being implemented on the basis of the existing balance of forces. Instead it was a purely intellectual opt-out from the trap they had walked into and had no way out of in the real world. The effective internal opposition to Tsipras has subsequently receded rather than grown precisely because there is no clear social basis for it. To deploy the term used by Pablo Iglesias (and taken from Stalin), there are no military “divisions” that could be deployed to make a radical exit from the euro a viable policy. Thus, the initial majority against a deal among the Syriza Central Committee has fragmented, leaving the Left Platform in a minority and allowing Tsipras to push through an extraordinary party conference with fresh election of delegates — which means the leadership is likely to wield a crushing majority that reflects the current weakness of its opponents. It is almost certain that Tsipras will be able to press home this advantage, bolstered by the Left Platform’s lack of a credible alternative program, to quell internal dissent, hold the government together and avoid having to call early elections. The Left Platform depends more than ever on being inside Syriza (and, now, in government) to exercise any influence and maintain its parliamentary representation. Far from the austerity deal confirming a perspective of “after Tsipras, our turn,” the Left Platform finds itself with nowhere else to go.", "url": "https://www.jacobinmag.com/2015/08/syriza-referendum-podemos-austerity/"}