{"authors": ["Megan Erickson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:16", "date_modify": "2020-05-04 19:50:16", "date_publish": "2015-02-17 00:00:00", "description": null, "filename": "2015_03_education-technology-gates-erickson_1588621816.html", "image_url": "https://images.jacobinmag.com/2015/02/17002958/erickson-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_03_education-technology-gates-erickson_1588621816.html", "title": "Edutopia", "title_page": "Edutopia", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nAt a recent professional development training, I was told to imagine what kind of school I would design if I had five million dollars. I scribbled down a few ideas, shared them with the group, and was then asked to consider how I could implement them now, without the money. The point was this: forget the cash. Forget that American teachers spend an average of $500 a year supplying their classrooms with materials. Anything is possible, if you put your mind to it. Similarly, Design Thinking for Educators, the eighty-one page “design toolkit” made available to teachers as a free download by New York City-based firm IDEO — which has designed cafeterias for the San Francisco Unified School District, turned libraries into “learning labs” for the Gates Foundation, and developed a marketing plan for the for-profit online Capella University — contains no physical tools. Problems ranging from “I just can’t get my students to pay attention” to “Students come to school hungry and can’t focus on work” are defined by the organization as opportunities for design in disguise. Tim Brown, IDEO’s CEO and a regular at Davos and TED talks, has described design thinking as a way to inject “local, collaborative, participatory” planning into the development of products, organizational processes, and now schools. Design Thinking for Educators is full of strikingly drawn graphic organizers and questions like, “How might we create a twenty-first century learning experience at school?” with single paragraph answers. “Responsibility” is used three times in the text, always in reference to teachers’ need to brainstorm fixes for problems together and develop “an evolved perspective.” (The word “funding” is not used at all — nor is the word “demand.”) We’re told faculty at one school embarked on a “design journey” and came to an approach they call “Investigative Learning,” which addresses students “not as receivers of information, but as shapers of knowledge,” without further detail on how exactly this was accomplished. Of course, the idea of engaging students as experienced co-teachers in their own education isn’t novel, nor is it an innovation that sprang forth from a single group of teachers using graphic organizers to brainstorm and chart solutions. Marxist educator Paulo Freire developed his critique of the “banking model” of education — in which students’ minds are regarded as passive receptacles for teachers to toss facts into like coins — while teaching poor Brazilian adults how to read in the 1960s and ’70s. His book Pedagogy of the Oppressed helped reignite the progressive education movement during that era, and his collaborative approach to learning remains influential in American schools of education today. Peter McLaren, who taught elementary and middle school in a public housing complex for five years before becoming a professor of education, has since further developed Freire’s ideas into an extensive body of revolutionary critical pedagogy, which I was assigned in my first class as a master’s student in education. The Radical Math project, launched a decade ago by a Brooklyn high school teacher whose school was located within a thousand feet of a toxic waste facility, draws heavily on Freire’s perspective in its curriculum for integrating social and economic justice into mathematics. Yet, here we are, a “nation at risk,” with lower test scores than our international peers and children still arriving at school every day without breakfast. Like all modern managerial philosophies that stake their name on innovation, “design thinking” has been framed by creative-class acolytes as a new way to solve old, persistent challenges — but its ideas are not actually new. According to Tim Brown, design thinkers start with human need and move on to learning by making, “instead of thinking about what to build, building in order to think.” Their prototypes, he says, “speed up the process of innovation, because it is only when we put our ideas out into the world that we really start to understand their strengths and weakness. And the faster we do that, the faster our ideas evolve.” What design thinking ultimately offers is not evolution, but the look and feel of progress — great graphics, aesthetically interesting configurations of furniture and space — paired with the familiar, gratifying illusion of efficiency. If structural and institutional problems can be solved through nothing more than brainstorming, then it’s possible for macro-level inputs (textbooks, teacher salaries) to remain the same, while outputs (test scores, customer service) improve. From the perspective of capitalism, this is the only alchemy that matters. Design Thinking for Educators urges teachers to be optimistic without saying why, and to simply believe the future will be better. The toolkit instructs teachers to have an “abundance mentality,” as if problem-solving is a habit of mind. “Why not start with ‘What if?’ instead of ‘What’s wrong?’” they ask. There are many reasons to start with “What’s wrong?” That question is, after all, the basis of critical thought. Belief in a better future feels wonderful if you can swing it, but it is passive, irrelevant, and inert without analysis about how to get there. The only people who benefit from the “build now, think later” strategy are those who are empowered by the social relations of the present. The same people benefit when analysis is abandoned in favor of technical solutions — when the long history of education for liberation, from Freire to the SNCC Freedom Schools to Black Panther schools to today’s Radical Math and Algebra projects (none of them perfect, all of them instructive) is ignored. It’s not surprising, then, that when Carlos Rodríguez-Pastor Persivale, the billionaire son of an elite Peruvian banking family, decided to expand his empire of restaurants and movie theaters by buying up a chain of for-profit English-language elementary schools, his first step was to contact IDEO and commission them to design everything: the buildings, the budget, the curriculum, professional development opportunities for teachers. The network is called Innova, and it’s on its way to becoming the largest private school system in Peru. According to “ed tech community” edSurge, Innova is “more than just an example of how first-world ideas about blended learning and design thinking can be adapted in a developing country.” It aims to close the achievement gap, build Peru’s next generation of leaders, “and make a profit while doing so.” Innova students use computer tutoring programs designed by Pearson and Sal Khan, a Gates Foundation protégé. (By now, Khan’s story is canonical among readers of the Harvard Business Review : in 2005, the former hedge-fund analyst created a simple computer program for practicing math problems and some instructional videos to help tutor his cousins remotely. These went viral on YouTube among parents looking for after-school enrichment activities for their children, including Bill Gates.) In a photograph of one location posted to IDEO’s website, students sit in groups of six, each absorbed in his or her laptop. The school’s modular walls collapse to allow classes of thirty to be joined together into one large group of sixty students at various times throughout the day. After a visit, Khan remarked, “I was blown away when I visited Innova. It was beautiful, open, and modern. It was inspiring to see an affordable school deliver an education that would rival schools in the richest countries.” The question is, affordable for whom? Tuition at an Innova school is $130 a month, which is considerably less than the cost of your average American private school, but would require shelling out over a quarter of the monthly income of a family living on Peru’s median household income of $430 a month. Half of the families that attend Innova are led by two parents working professional jobs such as accountants, engineers, or entrepreneurs. For his part, Rodríguez-Pastor has been clear that the schools are targeted specifically at Peru’s emerging middle class, but American education reformers have a different sense of what the schools represent. IDEO puts forth the fact that Innova students perform higher than the national average on math and communication tests as proof that they’ve delivered on their mantra for the project: “affordability, scalability, excellence.” But if test scores are higher than those of public schools, it is not because of the soul-searching of teacher/designers. It’s because tuition is about a quarter of the national median income. After all, a consistent pattern in the educational research of the past half-century is that the socioeconomic status of a child’s parents is one of the strongest predictors of his or her academic success. “Usually in Peru, our schools are like a jail,” says Innova founder Yzusqui Chessman. “But [Innova] schools . . . have big transparency, many colors, and bandwidth throughout.” Transparency and Wi-Fi for the middle class, while everyone else attends jail-like schools? Given the data, perhaps it would be more revolutionary, more innovative — more forward-thinking — if, instead of free idea toolkits, IDEO built a system that ensured that every child, rich and poor, had access to these beautiful new schools. There is one simple, elegant solution: make them free and public, and tax rich business owners like Rodríguez-Pastor to pay for them. On the other hand, American historian of education Larry Cuban has observed that even when innovations are well-funded for mass use in public schools — during the Baby Boom, for instance, over $100 million was invested by the federal government and the Ford Foundation to promote the use of televisions in classrooms to alleviate a teacher shortage — they rarely change the fundamental nature of schooling. When we think about the classrooms of the future, we have to ask what (as Marshall McLuhan has put it) technologies like radio and television can do that the present classroom can’t. That means asking: what’s futuristic about the future? And equally important, whom will it belong to?\nTeaching Machines Technology offers real possibilities for positively changing the way we relate to each other as human beings. For example, adaptive technology for children with special needs gives us the potential to integrate even children with severe disabilities into general-education classrooms. But one laptop per child can’t lift communities out of poverty, because technology is not an alternative to wealth redistribution from the top 1 percent to the bottom 99. There is a disconnect between what we imagine technology and education can do, and what they actually do. Management gurus and their tech-industry followers insist that if we can dream it, we can do it; that instead of “throwing more money at the problem,” we must use our creativity to brainstorm best practices for education and make them scalable. Harvard Business School Professor Clayton Christensen believes that in the future, computer-based instruction will entirely replace the current model, bringing a higher return on investment for the nation’s education system. Today’s corporate education reformers express frustration with the continuity of traditional schooling methods — though most do not recognize the history to which they are intimately tied, since technological innovation is imagined to be as ahistorical as it is apolitical. In a 2013 Google+ hangout, US Secretary of Education Arne Duncan told Sal Khan: We have to continue to accelerate. The fact that we’re still teaching with a nineteenth-century model makes no sense whatsoever, with twenty-five or thirty kids sitting in rows learning the same thing at the same time, same pace. It’s like Neanderthal. It makes no sense. This idea with technology being a great thing to empower moving from seat time to competency — I don’t want to know how long you sat there, I want to know, do you know the materials? Do you know Algebra or Biology or Chemistry or Physics? If you know it, you shouldn’t have to sit there. Edward Thorndike, the behavioral psychologist known for introducing scientific methods into the field of education, shared this frustration when he first theorized the possibility of a teaching machine. Textbooks, he observed in 1912, prod a student towards reasoning, but are unable to manage the process of elucidating just enough to help a student arrive at his or her own conclusions. Described by colleagues as prodigious, efficient, and an extremely rapid reader who liked to read books in one sitting, smoking cigarettes between chapters, Thorndike was preoccupied throughout his career with the quantification of human intelligence — he would go on to create an aptitude test used by the American military during World War I, as well as college entrance exams — but his objection to the use of textbooks in classrooms is an argument against standardization, or at least, against learning at a single standard pace mediated by a teacher. Thorndike envisioned a future in which texts were capable of offering a self-directed learning experience for schoolchildren: if, “by a miracle of mechanical ingenuity,” he wrote, a book could be arranged to hide information and display it step-by-step, so that page two was only accessible upon mastery of page one, “much that now requires personal instruction could be managed by print” — effectively making the teacher-as-guide obsolete. Four decades later, B. F. Skinner, a man who neither believed in free will nor had hope for the world’s salvation, stood in front of a new kind of classroom and announced that the future was here. Skinner had been influenced by the work of Sidney Pressey, a psychologist who, following Thorndike’s research on the retention of information through practice, developed a machine he believed would generate an industrial revolution in education (Pressey himself was deterred by the Great Depression). “I am B. F. Skinner, Professor of Psychology at Harvard University. I should like to discuss some of the reasons why studying with a teaching machine is often dramatically effective,” he announces in a video from 1954. On the screen, we see an enormous group of teenage children sitting elbow-to-elbow at long tables, rapidly and silently inputting answers into a device that looks like a cross between a typewriter and a record player. In the window of each child’s machine is an incomplete sentence or an equation missing a piece. Once the student fills in the blanks, the machine confirms or corrects the answer. Every child works alone. “The machine you have just seen in use . . . is a great improvement over the system in which papers are corrected by a teacher where the student must wait perhaps until another day to learn whether or not what he has written is right. Such immediate knowledge . . . most rapidly [leads to] the formation of correct behavior,” Skinner reflects. Skinner was not only concerned with increasing the efficiency of knowledge absorption for the individual learner, but also for the group. He leaves us with this: “With techniques in which a whole class is forced to move forward together, the bright student wastes time waiting for the others to catch up, and the slow student, who may not be inferior in any other respect, is forced to go too fast. . . . A student who is learning by machine moves at the rate that is most effective for him.” For Skinner, as well as for corporate education reformers, knowledge is static and students are passive recipients; efficient transmission of information is the goal of education. And technology is the means by which we make the transmission process faster, cheaper, smarter. Gifted children are best served by moving individually at their own pace, “slow students” move at theirs, all in isolation. This way of conceptualizing learning corresponds neatly with our present economic system, in which individuals either stand or fall on their merits, but it fails to deal with — in fact it conceals — the contentiousness of reality. Skinner’s new classroom went through many iterations over the decades that followed. A more sophisticated version known as Individually Prescribed Instruction (IPI) was used by students at Pittsburgh’s Oakleaf Elementary in 1965, and described by a contemporary journal of education as “the nation’s first successful operation of individualized instruction on a systematic, step-by-step basis.” His teaching machine, however, was never adopted on a mass scale in American public schools. Part of the resistance to the technology came from educators. Newly professionalized, they were adamantly opposed to having their role transformed into that of a coordinator. Rodney Tillman, Dean of the George Washington University School of Education, wrote in an essay titled simply “Do Schools Need IPI? No!” that the functions of a teacher using the system are limited to “writing prescriptions for courses of study, diagnosing student difficulties, and tutoring. . . . These I cannot accept.” Tillman was not resistant to the use of technology in schools so much as he was hostile to the particular vision of learning implicit in teaching machines, which rewarded rote mastery while evaluating student performance in isolation. The skills required to prepare children for the future were, he argued, not didactic, but interpersonal. And even in neurotic post-Sputnik America, parents tended to share a belief in the broadly humanist model of education. In 1960, the National Education Association (NEA) found it necessary to release a statement reassuring concerned mothers that while mechanical aids were now part of a modern classroom, they would never be the mode of instruction. “NEA Allays Parent Fears on Robot Teacher” was the headline in the Oakland Tribune. Anxiety about technology in classrooms, or about robots raising the children, was crystallized in pop culture. The Jetsons , which premiered in 1962, is the story of a typical nuclear family in the year 2062. George Jetson works a few hours a week at Spacely’s Space Sprockets, Jane Jetson is a homemaker, and young Elroy Jetson’s teacher is a robot named Ms Brainmocker. By 1981, at the end of his life, Skinner recanted his belief that technology could solve the world’s problems, observing bitterly that no one had had the inclination to use the tools he’d created. Skinner was not alone in his desire to radically transform education for a new century, or in his eventual disillusionment with this project. Just a few decades prior to the development of the teaching machine, Thomas Edison had declared that books were obsolete and motion pictures would initiate a revolution of the school system within ten years — a process that is still dramatically incomplete over a hundred years later. The possibilities of education technology remain ambiguous. The tools with which we learn are neither intrinsically empowering, as Skinner assumed and Arne Duncan continues to assume, or inherently threatening. They can be used in ways that are liberating or oppressive. But the popular idea that technological innovation is cruel (Ms Brainmocker) is not irrational. “Innovation” is almost always invoked by elites to ignore class conflict, to the point that some leftists have come to be wrongly but understandably suspicious of modernization altogether. Experts from Edison onward called enthusiastically for the incorporation of film and radio in classrooms without accounting for the fact that, as historian David Tyack points out, there were still tens of thousands of American schools that lacked electricity well into the 1960s. Of course, these schools were not evenly distributed across the country. They were the ones attended by working-class children, particularly in communities of color.\nThe Optimism of Billionaires In 1966, an MIT professor lamented that it had been easier to put a man on the moon than to reform public schools. Today, SpaceX CEO Elon Musk wants to replace the US space shuttle program and blow up education by turning it into a game and adding special effects. “Give kids a chance to fly,” Duncan said to Khan in their Google hangout. “Let them find their passion and they’ll go to the moon with that.” Why are two such disparate concepts as education and space travel so intricately linked in our public discourse? Education and space are both metonyms for the future. When today’s children grow into tomorrow’s adults, holding meetings in holodecks and beaming themselves through the galaxy in maroon turtlenecks, they will have replaced us. When science fiction becomes reality, we will all be dead, unless we figure out a way to bring about the impossible. From the perspective of the tech industry, education and space travel are alike because they are problems in search of rational, personalized, twenty-first century answers, like those arrived at by design thinking. The expectation is that these answers will obliterate material limitations, class struggle — history, past and present. Design thinking, embraced by key figures in business and especially in the tech industry, insists that educators adopt a perpetually optimistic attitude because that is what it takes to believe everything will turn out okay if we just work together to streamline our efforts. That is what it takes to believe that the best idea is the one that survives group discussion and is adopted. The rabid optimism of the techno-utopian vernacular, with its metaphors that no longer register as metaphors, obscures the market imperatives behind the industry’s vision for the future. This is intentional. Conflating the future with unambiguous, universal progress puts us all on equal footing. Participating as a citizen in this framework consists of donating your dollar, tweeting your support, wearing your wristband, vowing not to be complacent. Critiquing the solution only impedes the eventual discovery of the solution. And why make demands for power if you yourself are empowered? Empowerment, as Duncan uses it, is a euphemism. Anger is empowering, frustration is empowering, critique is empowering. Competence is not empowering. The fact is, education is not a design problem with a technical solution. It is nothing like building a spaceship. It is a social and political project that the neoliberal imagination insists on innovating out of existence. The most significant challenges faced today in education are not natural obstacles to be overcome by increasing productivity — they are man-made struggles over how resources are allocated. In a frequently cited policy report on academic performance and spending over the past forty years, Andrew J. Coulson of the Cato Institute concludes that dramatic increases in education funding have not resulted in improvements in student performance. “In virtually every other field,” Coulson notes, “productivity has risen over this period thanks to the adoption of countless technological advances — advances that, in many cases, would seem ideally suited to facilitating learning. And yet, surrounded by this torrent of progress, education has remained anchored to the riverbed, watching the rest of the world push past it.” What Coulson and others who repeat this myth ignore is who specifically is left out of the tech world’s ecstatic march towards progress, and how and why they are left out. The United States is one of few OECD countries where schools that serve affluent families have more resources than schools that serve poor families. A 2010 OECD report noted: In 16 OECD countries, more teachers are allocated to disadvantaged schools to reduce the student-teacher ratio, with the objective of moderating disadvantage (OECD, 2010). This is particularly the case in Belgium, Italy, Ireland, Spain, Estonia, Iceland, Portugal, Japan, the Netherlands and Korea. Only in Turkey, Slovenia, Israel and the United States are disadvantaged schools characterised by a higher student-teacher ratio. In 2013, Andreas Schleicher, who runs the OECD’s international educational assessments, told the New York Times: “The bottom line is that the vast majority of OECD countries either invest equally into every student or disproportionately more into disadvantaged students. The US is one of the few countries doing the opposite.” In a country where the top 20 percent of the population earns eight times as much as the bottom 20 percent, this inevitably leads to two distinct and parallel systems of education, one for the rich and one for the poor. It’s not that “money doesn’t matter” for reforming the education system, or that technology can be a substitute, but that children from working-class and poor families score lower on standardized test scores than their wealthy peers — and America has many more poor families than rich.\nThe Cynicism of Managers Sal Khan’s Khan Academy, funded by generous grants from the Gates Foundation, is the miracle of mechanical ingenuity that Thorndike dreamed of a century ago. When I first logged on to Khan Academy, I was surprised to find that despite all the tech-industry backing, it is not attractive, simple, or intuitive. Users mouse over the Subjects bar and choose Math, Science, Economics and Finance, Arts and Humanities, Computing, Test Prep, or Partner Content. Clicking on a Math “mission” brings you to a page of basic exercises. In instructional videos, Khan is awkward, a one-time mathlete with a slight twang and the affected exuberance of someone who has been teased but ultimately rewarded for being himself. The website is interactive in the most mechanistic sense of the word: it provides individual feedback. After ten correct answers, the user can move on to the next concept. Ten correct answers is applied uniformly throughout the site as a metric, though it’s unclear why success in this metric indicates mastery, just as the 85 percent correct required by the IPI system seemed to be arbitrarily selected in order to enable the teaching machine to function. Badges, which are meant to be incentives, are exactly the kind of thing an “unabashedly geeky” adult would think a kid might find interesting. It is a cloud-based, portable version of Skinner’s teaching machine. Its strength is that it is self-guided: exercises allow repetition and provide students with immediate feedback as they practice. Memory performance improves with practice, and practice leads to automaticity, which frees up working memory and allows us to concentrate on comprehension. That’s why it’s impossible to gain complex insight into the abstract concepts of literature or algebra until we can read words and equations fluently. Passive practice does not actually improve our recall of information, and Thorndike, who saw the mind as a group of habits, was the first to identify the use of feedback as essential to successful learning. But where’s the revolution? Khan is quick to say his videos are not a replacement for teachers, a claim that seems disingenuous given that the mission of his project is to “provide a free world-class education for anyone, anywhere.” Pedagogically, the videos are unambitious. Even with a paper textbook, a student can move at his or her own pace and receive feedback by checking answers at the back of the book. Why should a digitized version create a significantly different outcome? Khan Academy is a fine way to practice math problems or learn a didactic skill. What it is not is innovative in pedagogy or design. As a system of education it is a failure. It degrades both student and teacher by deemphasizing the importance of interpretation and critique in education, just like design thinking does. One example of the importance of this kind of flexible and evolving practice — especially for children from low-income families — comes from Lisa Delpit, educator and author of Other People’s Children . In talks, Delpit uses a situation she witnessed in a preschool in which a teacher handed out a tray of candy and instructed children to each take a piece and pass on the tray. Some of the children took multiple pieces, and there was not enough to go around. A teacher evaluating the children without interpreting the context, like a machine, would conclude that the children did not successfully complete the task and need more practice in sharing. In fact, after asking why the children took extra pieces, the human teacher found that they were simply engaging in a different kind of creative economy, saving up a couple of pieces to take home to siblings later. I suspect the innovation Gates is investing in is not a technological one, but a managerial one. The only truly novel thing Sal Khan has done is produce a cheap and popular way to distribute basic lectures and exercises to a large number of people who like them. It’s possible that what Gates admires most about him is that one man can teach so many different subjects at different levels, from kindergarten math to cell biology to financial markets. At the Aspen Ideas festival, Gates praised Khan for moving “about 160 IQ points from the hedge-fund category to the teaching-many-people-in-a-leveraged-way category.” Look, he seems to be saying, at all the value that can be extracted from one employee! In a November 2012 interview, Gates told Fareed Zakaria, “When you revolutionize education, you’re taking the very mechanism of how people become smarter and do new things and you’re priming the pump for so many incredible things. Over the next decade at all levels in all countries, that’s going to change quite dramatically.” Technology “will take that space at the current investment levels and allow us to do a far better job.” Elsewhere, Gates has called for austerity in public education, repeating the familiar argument that for thirty years we’ve been spending money while performance by American children remains flat. What we need to do, he says, is raise performance without spending more by changing the way money is spent. To that effect, Arne Duncan asked a room full of Silicon Valley entrepreneurs and investors last year, “Can we find ways to scale the amazing teachers we do have?” Systems that “scale” retain quality under an increased workload. Modifying teachers to scale would mean replacing them with robots or computers. Managers are incentivized to outsource redundant jobs and tasks, but in the past thirty years there’s been a special focus on chipping away at the security and esteem of teachers and the American school system. Certainly it’s about money, as it always is, but the financial backing of the Gates Foundation is astronomical enough that the question is less about actual scarcity and more about how the funds will be spent. The firing and disciplining of teachers is also an ideological choice: teachers threaten the ruling class. Though they are atomized as workers into separate classrooms and competing districts, teachers are, as Beverly Silver puts it, strategically located in the social division of labor. If they don’t go to work, no one can — or at least, no one with children to look after. As caretakers, teachers are by definition important and trusted community figures, public care workers who can shut down private production. In the United States, where the vast majority of families continue to rate their own child’s teacher highly, even while believing the political mantra that the nation’s education system is rapidly deteriorating — unique job protections like tenure serve to further strengthen teachers’ capacity to resist neoliberal reforms. In the same vein, schools are public spaces in which children and teenagers can put down their pencils or laptops or iPads and organize against state violence and coercion, as we’ve seen in the aftermath of Michael Brown’s murder. The possibilities for confronting injustice are so powerful that children (especially black and brown children, but increasingly, all American children) are literally policed and considered suspects in their own school buildings. Teachers who encourage resistance are essential sources of support and guidance for kids. People do not learn to think critically and construct meaning in isolation — which is the assumption behind the trend of textbooks that respond individually to each student and allow them to move at their own pace. People argue, discuss, play, experiment, and converse. And, as Delpit writes: Only those who are authentically and critically literate can become the independently thinking citizens required for any society’s evolution. The opportunity to achieve such levels of literacy is even more critical for those whom the larger society stigmatizes. . . . When people of color are taught to accept uncritically texts and histories that reinforce their marginalized position in society, they easily learn never to question their position. Learning as a group is not a painless process. A good teacher knows her students well, respects them and earns their respect in return, and challenges them to aim for the highest reaches of what Vygotsky called “the zone of proximal development” — their potential. As Katherine McKittrick has pointed out in response to the idea of trigger warnings being placed on college syllabi: the classroom isn’t safe. It should not be safe. Teaching, for McKittrick, is a “day-to-day skirmish,” and teachers must work hard to create classroom conversations “that work out how knowledge is linked to an ongoing struggle to end violence,” to engage with the history that students bring with them into the classroom and resist reification of oppressive thinking in practical ways. This winter, during the Hour of Code sponsored by the tech industry and supported by the US Department of Education, Susan DuFresne, a kindergarten teacher and former teacher’s aid with forty years of experience told me, “Children are not standard. They need unstructured play indoors and out to develop skills” like sharing, listening, cooperation, and self-regulation. The Hour of Code is a publicity stunt in which public school children from preschool up are given laptops and taught to code. DuFresne was vocally opposed. Kids “have different learning styles,” she said. “Some learn faster with technology. But now children as early as third grade will be required to type written answers into text boxes, click and drag, and use multiple tech software tools on the Common Core tests.” Still, her resistance had little to do with fear of new tools, and everything to do with the conceptualization of the role of technology in the classroom. Another high school teacher, Brooke Carey, who has been working for over a decade in the New York City school system, agreed that technology is often used in public-school classrooms in “a fairly traditional way,” with iPads serving as a fancier version of pen and paper and Smartboards functioning as computerized chalkboards or dry-erase boards. In American public schools, teaching tools have been digitized and optimized for efficiency, but the content and philosophy remain the same. Even Google engineers know this. An article in the New York Times reported on the popularity of the Waldorf model of education in Silicon Valley as if it were a contradiction: “A Silicon Valley School That Doesn’t Compute.” Waldorf schools incorporate creative and tactile experiences and tools including hammers and nails, knives, knitting needles, and mud — but not computers — into the curriculum. Engagement comes from the connection between children and their teachers, who stress critical thinking and aim to create interesting, inquiry-based lesson plans. According to the Times , employees at Google, Apple, Yahoo, Hewlett-Packard and eBay send their children to the Waldorf School of the Peninsula. “The idea that an app on an iPad can better teach my kids to read or do arithmetic, that’s ridiculous,” Alan Eagle, a Google communications executive who’s written speeches for Eric Schmidt, told the Times . The great irony is that the very Silicon Valley reformers promoting and funding techno-utopian models for American schoolchildren refuse to submit their own children to anything like it, choosing innovative pedagogical models instead of newer touch screens.", "url": "https://jacobinmag.com/2015/03/education-technology-gates-erickson"}