{"authors": ["Francisco Louçã", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:12", "date_modify": "2020-05-04 19:58:12", "date_publish": "2015-12-17 00:00:00", "description": null, "filename": "2015_12_portugal-left-bloc-catarina-martins-francisco-louca_1588622292.html", "image_url": "https://images.jacobinmag.com/2015/12/17010539/lisbon1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_12_portugal-left-bloc-catarina-martins-francisco-louca_1588622292.html", "title": "Bloco’s Anti-Austerity Gamble", "title_page": "Bloco’s Anti-Austerity Gamble", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Interview by Tor Krever\nLast month, Portugal’s minority right-wing government fell, rejected by a coalition of left and center-left parties in parliament.\nIts creation only weeks earlier, following the October 4 elections, had been controversial. Rather than appoint a left government with majority support in parliament, Portugal’s right-wing president had chosen to instead reappoint Pedro Passos Coelho’s minority center-right Social Democratic Party–Popular Party coalition, insisting that the radical left had no place in government.\nHowever, following parliament’s rejection of his continued austerity program on November 10, Passos Coelho resigned. Two weeks later, on November 24, Portugal’s president backed down and appointed Socialist leader António Costa prime minister. Costa’s center-left Socialist Party will govern with the support of a parliamentary majority following agreements with the Portuguese Communist Party (PCP) and the Left Bloc.\nThe Left Bloc swept to prominence with an unprecedented 10.2 percent of the vote in October’s elections. Its emergence as government-maker, following a successful anti-austerity campaign and its backing by a growing popular social movement, is the most important development in recent years for the Portuguese left.\nEarlier this month, before the new government was formed, Tor Krever spoke with Francisco Louçã, the founder and former leader of the Left Bloc, about the party’s history, its electoral success, and its priorities — as well as the risks entailed — in supporting a Socialist Party government.", "url": "https://jacobinmag.com/2015/12/portugal-left-bloc-catarina-martins-francisco-louca"}