{"authors": ["Alexis Tsipras", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:26", "date_modify": "2020-05-04 19:53:26", "date_publish": "2015-01-17 00:00:00", "description": null, "filename": "2015_01__1588622006.html", "image_url": "https://images.jacobinmag.com/2015/01/17002559/8935156736_15cd86bc59_b-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_01__1588622006.html", "title": "A Historic Opportunity", "title_page": "A Historic Opportunity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "AT\nThe effects of the crisis on Greek society have been truly devastating. It comes as no surprise that there have been major changes in the political scene. Syriza has always offered a detailed analysis of the crisis and the underlying causes.\nWhile the mainstream parties led people on — rather brazenly, I might add — we were vehement that austerity would have severe negative consequences and lead to recession; these policies simply weren’t sustainable. We supported grassroots initiatives, including major demonstrations and the social solidarity movement. Lastly, our political emphasis has been on uniting the Left. This was critical — and it really resonated with people.\nThe response from the Greek people was immediate and clear: during the May 2012 elections, Syriza captured 17 percent of the vote, and during the second round of elections the following month, Syriza’s numbers increased to 27 percent — just three percentage points less than the center-right party.\nIt’s important to note that we achieved these numbers despite the mainstream media’s relentless fearmongering. While we did our best to address these scare tactics, we weren’t able to overcome them to the extent needed to be placed first in the elections. We didn’t rest on our laurels after the elections, though. We diligently worked to develop a detailed program outlining how to exit the crisis, including ending austerity and renegotiating the terms of the debt.\nToday, we have a fully comprehensive program to address the debt. Key aspects include renegotiating the terms with our European partners, along with a detailed plan to spur economic growth, address unemployment, strengthen the welfare state, and provide relief to the members of society hit hardest by the crisis. It is imperative that we implement these changes; austerity and budget cuts are not sustainable and only serve to further destroy social cohesion.\nSyriza’s rise is not about a “protest vote” against the mainstream parties responsible for Greece’s demise in the wake of the economic crisis. Syriza is winning over voters because it’s the only party that offers a viable alternative solution.\nIn the recent European elections, we came in first in Greece with a four percentage-point lead; since then, we’ve been polling at even higher numbers, well ahead of the parties in the ruling coalition government. We’ll see a major shift in the political landscape soon, but this isn’t making us complacent. We remain committed to the work ahead, both on the political and social levels.\nWe’re under no illusions about the challenges we’ll be facing when we first come to power — a historical first for us, as well as for postwar Europe. We’re determined to see this through, with the support of the people, building consensus but not shying away from conflicts when they arise. As Franklin D. Roosevelt said, “the only thing we have to fear is . . . fear itself.”\nTo answer the second part of your question, I’d like to point out that while we witnessed a rather dramatic political shift in Greece, similar shifts have also been occurring elsewhere in southern Europe. United Left and Podemos captured 18 percent of the vote in Spain in the European elections, very close to the Socialists and the Popular Party, whose popularity has since plummeted.\nThese numbers represent an increase of two and a half times from the results of the 2011 national elections. We hope that the United Left and Podemos will have even stronger results in the upcoming 2015 elections. Also, Sinn Féin’s success in the European elections was a significant development for Ireland, another country decimated by the Memoranda for bailing out the banks. Italy is showing signs of an uptick for the Left, a trend seen in many European countries, including Slovenia.\nIn the early 1990s, the European social democrats formed an alliance with the Right to promote neoliberalism across Europe — something they are now paying dearly for in the wake of the economic crisis. This is why I believe that the Left is Europe’s only hope for overcoming the crisis. The austerity policies implemented by conservative and social democratic governments have reached their tipping point, as have the fiscal targets assigned by the European Union (EU), which are unachievable for any country.\nThis simply can’t continue. If Europe does not turn towards the Left — embracing growth, decent work and the welfare state — its other choice will be right-wing extremism and Euroscepticism. The setbacks will have terrible consequences.\nThe rapid political changes across Europe spurred by the crisis have aided the Left, creating new opportunities. The social struggle for decent work and dignity is one of the most critical — and one that the left is deeply committed to. A stronger left increases the chances for major changes in Europe, shifting the balance in favor of labour. Syriza aspires to be the catalyst for these changes, creating a “domino effect.”\nIt is important to note that our work doesn’t just end with abolishing austerity. Our mission is not simply to carry out the unfinished work of postwar social democracy, but rather to enable the radical transformation of society across Europe, based on socialism and democracy.\nThis is our goal as we seek to form new social alliances that will unite the working and middle classes, the unemployed, the most disadvantaged members of society, intellectuals, and social movements, around a common struggle: the struggle to liberate society from the effects of cutthroat profiteering, and to foster social justice and democracy, an economy that will focus on people’s needs, and a welfare state that ensures education, health, and dignity for all.\nTo call a halt to the free-market policies responsible for miring Europe in the economic crisis, the European left must have a feasible and realistic political strategy, in addition to a unifying vision — these go together.", "url": "https://www.jacobinmag.com/2015/01/alexis-tsipras-interview-syriza/"}