{"authors": ["Stathis Kouvelakis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:39", "date_modify": "2020-05-04 19:53:39", "date_publish": "2015-02-17 00:00:00", "description": null, "filename": "2015_02__1588622019.html", "image_url": "https://images.jacobinmag.com/2015/02/17002920/16372044648_4c5d2a75e8_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_02__1588622019.html", "title": "Is Syriza Retreating?", "title_page": "Is Syriza Retreating?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "To use a worn-out cliché, “the times are critical.” In fact, they are more than just that: we are at the edge of a crucial temporal sequence. The whole endeavor of a Syriza government will be judged by its reaction to the unprecedented blackmail and ultimatums it is receiving from its tragically misnamed European “partners.”\nAnd the news from the frontline is not pleasant. To be sure, it is very difficult to have a clear view of the current status of the negotiations — “negotiations” being an oxymoron given the sheer asymmetry in the balance of forces, and the fact that one side has a gun (the European Central Bank’s) pointed at its head. What is clear, however, is that the Greek government has backtracked on crucial aspects, especially concerning its commitments towards the people that brought it into office.\nBefore examining the substance of the request for an extension of the “Master Financial Assistance Facility Agreement” submitted on Wednesday by the Greek government to Brussels, let’s have a closer look at the “Moscovici document” leaked by the Greek government during the Eurogroup meeting last Monday, which it has declared itself willing to sign.\nThis document rules out “unilateral action,” sets primary surpluses of an undefined volume as a budgetary target, and recognizes the entirety of the debt. All future adjustments made concerning the restructuring of the debt will have to be in line with the Eurogroup’s decisions in November 2012.\nEssentially, the implementation of the fundamental measures of Syriza’s Thessaloniki election program is made subject to the prior approval of the lenders, effectively amounting to the program’s annulment. Additionally, it recognizes the odious terms of the lending agreements, thereby further weakening the Greek negotiating position on the matter. It is obvious that by accepting such a framework as a supposedly “honorable compromise,” the Syriza government is having its hands tied.\nThe request for an extension of the Master Financial Assistance Facility Agreement includes all of the above-mentioned points and adds to those — for the first time — the recognition of “the supervision under the [European Union] and ECB framework and, in the same spirit, with the International Monetary Fund for the duration of the extended Agreement (point f).” In other words, the troika is back but with a different name. The Greek media has already started talking about “the Institutions.”\nBut even that is not enough for the EU and German Finance Minister Wolfgang Schäuble. Having understood that the Greek side — eager to avoid any rupture and even any unilateral move — is on a constant path of retreat, the “partners” have opted for total surrender as their primary aim.\nBy teaching the Syriza government a lesson, they simultaneously issue a warning to Podemos and any other force in Europe that may attempt to challenge austerity, the memoranda, and debt peonage. The German side has either way rejected the Greek request for the Master Financial Assistance Facility Agreement, apparently aiming for further Greek concessions and the full humiliation of the Greek left-wing government.\nAnd herein, maybe, lies hope. It can’t be ruled out that the escalating demands of the EU and the lenders will be rejected by a government that has undertaken some basic commitments to its people. And, more importantly, that they will be rejected by a people that is believing in hope again and taking to the country’s streets and squares. A retreat should not be treated as unavoidable, and the Greek government deserves support to the extent that it holds firm in the war unleashed against it.\nWhatever the conclusion, one thing is certain. All the reassuring arguments that have circulated in the past few years — about a European “bluff,” about the possibility of overthrowing austerity within the eurozone framework, of separating lending agreements and memoranda, of solutions in the lines of the 1953 London conference on the German debt (that is, of a favorable restructuring for the borrower agreed by the lender) — in other words, the constituent elements of the narrative of the “good euro” — have all collapsed.\nAt some point, we are owed explanations about all this as well.", "url": "https://www.jacobinmag.com/2015/02/greece-syriza-backtrack-europe-negotiations/"}