{"authors": ["Stathis Kouvelakis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:36", "date_modify": "2020-05-04 19:58:36", "date_publish": "2015-01-17 00:00:00", "description": null, "filename": "2015_01__1588622316.html", "image_url": "https://images.jacobinmag.com/2015/01/17002703/bbbb4893-11f0-4da7-84c3-f254364c5b39-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_01__1588622316.html", "title": "After Syriza’s Victory, Confrontation or Capitulation", "title_page": "After Syriza’s Victory, Confrontation or Capitulation", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Syriza’s electoral triumph has brought hope to the European radical left and workers’ movement, offering it an immense opportunity. We can also put that the other way around — for Syriza to fail this test could have incalculable consequences.\nA few quick remarks on the first difficulties and problems we face:\nFirst of all, Syriza came close to winning an overall majority, but ultimately just fell short. Its final score (36.3 percent) was at the lower end of what the exit polls had suggested, while New Democracy’s result was towards the upper end of its exit poll prediction.\nIn this sense there was a tinge of disappointment in the campaign offices and in front of the Propylaea last night. Moreover, having been in central Athens on a number of election nights, I have to say that this time there were fewer people in the streets than after the Pasok victories of the 1980s and 1990s.\nEven if beating New Democracy by 8.5 percent is an important victory, we have to explain why the dynamic behind Syriza was not as great as we had hoped. One striking aspect of the results is that, while nationally Syriza improved on its June 2012 and European elections score by almost 10 percent, it made much less progress in the main urban centers (particularly Athens and Thessaloniki), where it only gained 6 percent.\nSo while in June 2012 its best result was in the very working-class, emblematically “Red” Second Piraeus constituency (if we don’t include Xanthi, where it enjoyed massive support from the Turkish-speaking minority), this time around it did better in seven other areas (including former Pasok bastions like Crete and the northern Peloponnese) than in the Piraeus industrial belt — though here too it went from 37 to 42 percent.\nThus Syriza made advances above all in rural and semi-urban areas and middling provincial towns: in a Greece whose political behavior is more conservative and “legitimist.” Its influence in the country is thus now more homogeneous, as it makes its appearance as a legitimate “party of government”; but it lacked the dynamic to be able to increase its advantage in the major cities and get the extra seats it needed in the mega-constituencies of Athens and Thessaloniki.\nIts electoral profile is now that of a more “cross-class” party, without the “unevenness” of 2012: its support is less distinctly rooted among the wage-earners of the main urban centers, even if its influence among this population is significant and they do make up a major part of its vote.\nThis fact ought to be seen in parallel with the Communist Party making (albeit limited) gains of 1 percent relative to June 2012, as well as Antarsya going from 0.33 to 0.64 percent. Their progress was largely in the main urban centers. So Syriza certainly suffered some small losses “to its left” and above all was unable to mobilize major reserves of abstaining voters (there was a weak turnout nationally, at just 64 percent).\nThe new government (whose composition was unknown at the time of writing) will have to deal with truly staggering obstacles. The coffers are empty, and the state’s revenues are collapsing quicker than expected. It will very soon become apparent that the financing plan set out in the “Thessaloniki program” was based on very over-optimistic estimates (or even simply wrong ones).\nThe goal, here, was to give the impression that the program could be realized half by redirecting the European credits (which are earmarked, some of them already allocated, and whose payment is entirely dependent on European Union agreement) and half through a more effective collection of tax receipts, without tax reform and without a need for increased budget deficits.\nThe government’s strategic orientation toward the EU is also rather unclear. After the win, Syriza leader Alexis Tsipras was keen to reassure the EU and the markets, speaking of a “sincere dialogue” and “mutually advantageous solution.” He didn’t mention the word “debt.”\nYesterday, I was alarmed to hear comrades praising European Central Bank President Mario Draghi, presenting him as some sort of great adversary of German Chancellor Angela Merkel and German Finance Minister Wolfgang Schäuble, and almost as an ally of Syriza. Today, the only European leader whose smiling face adorns the homepage of the party’s official website is that of Martin Schulz, president of the EU parliament and member of the German Social Democrats, who has asked for an immediate meeting with Tsipras.\nIt seems that some circles in the party have gone so far as to convince themselves of the truth of campaign slogans like “Europe’s changing,” in the sense that “the EU is prepared to make an honorable compromise with us.” But the outlook on that front, in the best-case scenario, would be to bypass the troika and “negotiate” (that magic word!) a mildly blunted version of the Memorandums directly with the EU institutions.\nLast but not least, while Panos Kammenos and his sovereignist right-wing Independent Greeks (ANEL) are certainly a lesser evil compared to formations like To Potami (whose stated goal was to force Syriza to stay within the narrow boundaries set by the EU and the Memorandums), they are nonetheless an evil. Their participation in the government, even with just one minister, would symbolize the end of the idea of an “anti-austerity government of the Left.”\nMoreover, this is a party of the Right, one that is particularly concerned to protect the “hard core” of the state apparatus (it will be important to keep a watchful eye over whatever cabinet portfolio it might get). It will be no surprise if its first demands are for the ministry of defense or public order, though it seems that it will not get them.\nSyriza has a very narrow margin of maneuver — but these ambiguities must soon be resolved. Society remains passive for the moment, yet the hopes placed in Syriza are very great and very concrete. Hugely important tasks lie ahead for those forces that are conscious of the coming dangers and determined to defend the key points of the party’s program of breaking with austerity.\nMore than ever we must be clear that there is no middle course between confrontation and capitulation. The moment of truth is at hand.", "url": "https://www.jacobinmag.com/2015/01/syriza-greece-victory-kouvelakis-left/"}