{"authors": ["Brett S. Morris", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:44", "date_modify": "2020-05-04 19:51:44", "date_publish": "2015-04-17 00:00:00", "description": null, "filename": "2015_04_khmer-rouge-cambodian-genocide-united-states_1588621904.html", "image_url": "https://images.jacobinmag.com/2015/04/17003706/06-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_04_khmer-rouge-cambodian-genocide-united-states_1588621904.html", "title": "Nixon and the Cambodian Genocide", "title_page": "Nixon and the Cambodian Genocide", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "But Pol Pot’s rise to power, the Cambodian genocide, and the absence of justice for the KR’s victims are inseparable from broader US intervention policies in Indochina from 1945–1991 — in particular, the US’s vicious bombing campaign waged against Cambodia.\nPol Pot , the leader of the KR from 1963–1997 and prime minister of Democratic Kampuchea, fled to the jungle. He died in 1998 without ever having faced justice. In fact, since the removal of the KR, only three individuals have been convicted for their roles in the genocide (the first conviction was not handed down until 2010; the other two came last year).\nOn April 17, 1975, Khmer Rouge (KR) forces stormed Phnom Penh and reestablished Cambodia as Democratic Kampuchea — a supposedly self-sufficient, entirely agrarian society. Resetting the clock to “Year Zero,” the KR forced urban dwellers to the countryside, and began to “purify” Cambodia through a genocidal purge of intellectuals and minority groups. By the time the slaughter came to an end in 1979 — after Vietnam invaded Cambodia and removed the KR from power — some 1.7 million people (21 percent of the population) were dead.\nBombing and Destabilizing\nThe US began bombing Cambodia in 1965. From that year until 1973, the US Air Force dropped bombs from more than 230,000 sorties on over 113,000 sites. The exact tonnage of bombs dropped is in dispute, but a conservative estimate of 500,000 tons (almost equal to what the United States dropped in the entire Pacific theater of World War II) is unquestionable.\nThe ostensible targets of the bombings were North Vietnamese and National Liberation Front (“Viet Cong”) troops stationed in Cambodia and, later, KR rebels. However, it is indisputable that there was also total disregard for civilian life. In 1970, President Richard Nixon issued orders to National Security Advisor (and later Secretary of State) Henry Kissinger:\nThey have got to go in there and I mean really go in. I don’t want the gunships, I want the helicopter ships. I want everything that can fly to go in there and crack the hell out of them. There is no limitation on mileage and there is no limitation on budget. Is that clear?\nKissinger relayed these orders to his military assistant, Gen. Alexander Haig: “He wants a massive bombing campaign in Cambodia. He doesn’t want to hear anything. It’s an order, it’s to be done. Anything that flies on anything that moves.”\nJust how many people the United States killed and injured will never be known. In his book Ending the Vietnam War , Kissinger himself cites an apparent memo from the Historical Office of the Secretary of Defense stating there were 50,000 Cambodian casualties. The leading Cambodian Genocide scholar, Ben Kiernan, estimates the likely number to be between 50,000 and 150,000.\nOne Cambodian eyewitness to a bombing described the event as follows:\nThree F-111s bombed right center in my village, killing eleven of my family members. My father was wounded but survived. At that time there was not a single soldier in the village, or in the area around the village. 27 other villagers were also killed. They had run into a ditch to hide and then two bombs fell right into it.\nThe US bombing campaign in Cambodia destabilized an already fragile government. When Cambodia won its independence from France in 1953, Prince Norodom Sihanouk became its effective ruler. A neutralist, Sihanouk’s primary objective was to maintain the integrity of Cambodia — a task that proved enormously difficult, as American, Chinese, and Vietnamese interests, as well as various left- and right-wing factions within Cambodia, were all pulling Sihanouk in different directions. Attempting a delicate balancing act, he played groups off one another, working with one group one day and opposing it the next.\nOne group challenging Sihanouk was the Communist Party of Kampuchea, which would become widely known as the Khmer Rouge. The leadership of the party was roughly divided into two factions: one was pro-Vietnamese and advocated cooperation with Sihanouk, the other — led by Pol Pot — was anti-Vietnamese and opposed Sihanouk’s rule. By 1963, Pol Pot’s faction had mostly displaced the other, more experienced faction. The same year, he moved to rural Cambodia to formulate an insurgency campaign.\nFour years later, a peasant uprising known as the Samlaut Rebellion broke out in the countryside over a new policy that forced peasants to sell their rice to the government at below-black-market rates. To ensure compliance, the military was stationed in the local communities to purchase (or simply take) the rice from the farmers.\nWith their livelihoods suffering, peasants launched an uprising, killing two soldiers. As the rebellion quickly spread to other areas of Cambodia, Pol Pot and the KR capitalized on the unrest, gaining peasant support for their fledgling insurgency. By 1968, KR leaders were directing ambushes and attacks on military outposts.\nPol Pot’s insurgency was indigenous, but as Kiernan argues, his “revolution would not have won power without U.S. economic and military destabilization of Cambodia.” Previously apolitical peasants were motivated to join the revolution to avenge the deaths of their family members. As a 1973 Intelligence Information Cable from the CIA’s Directorate of Operations explained:\nKhmer insurgent (KI) [Khmer Rouge] cadre have begun an intensified proselyting campaign among ethnic Cambodian residents . . . in an effort to recruit young men and women for KI military organizations. They are using damage caused by B-52 strikes as the main theme of their propaganda.\nIn 1969, the US air war against Cambodia escalated drastically as part of Nixon’s Vietnamization policy. The goal was to wipe out Vietnamese communist forces located in Cambodia in order to protect the US-backed government of South Vietnam and US forces stationed there. At the beginning of the escalation, KR fighters numbered less than 10,000, but by 1973, the force had grown to over 200,000 troops and militia.\nThe US-backed coup that removed Sihanouk from power in 1970 was another factor that dramatically strengthened the KR insurgency. (Direct US complicity in the coup remains unproven, but as William Blum amply documents in his book Killing Hope , there is enough evidence to warrant the possibility).\nSihanouk’s overthrow and replacement by the right-wing Lon Nol sharpened the contrast between the opposing camps within Cambodia and fully embroiled the country in the Vietnam War.\nUp until this point, there had been limited contact between the communist forces of Vietnam and Cambodia, as the Vietnamese accepted Sihanouk as the rightful government of Cambodia. But after the coup, Sihanouk allied himself with Pol Pot and the KR against those who had overthrown him, and Vietnamese communists offered their full support to the KR in their fight against the US-backed government.\nThe KR were thus legitimated as an anti-imperialist movement.\nAs the aforementioned CIA Intelligence Information Cable notes:\nThe [Khmer Rouge] cadre tell the people the Government of Lon Nol has requested the airstrikes and is responsible for the damage and the “suffering of innocent villagers” in order to keep himself in power. The only way to stop “the massive destruction of the country” is to remove Lon Nol and return Prince Sihanouk to power. The proselyting cadres tell the people that the quickest way to accomplish this is to strengthen KI forces so they will be able to defeat Lon Nol and stop the bombing.\nIn January 1973, the United States, North Vietnam, South Vietnam, and South Vietnamese communist forces signed the Paris Peace Accords. US forces withdrew from Vietnam, and the bombings of Vietnam and Laos were discontinued.\nYet the Nixon administration continued bombing Cambodia in order to defend Lon Nol’s government against KR forces. Facing intense domestic and congressional opposition, Nixon was forced to end the campaign in August 1973 after reaching a deal with Congress.\nFor the next year and a half, civil war continued to rage between the government and the KR. The KR succeeded in capturing numerous provinces and large areas of the countryside, and they finally took control of Phnom Penh in April 1975.", "url": "https://jacobinmag.com/2015/04/khmer-rouge-cambodian-genocide-united-states"}