{"authors": ["Rob Hunter", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:53", "date_modify": "2020-05-04 19:54:53", "date_publish": "2015-03-22 00:00:00", "description": null, "filename": "2015_03_civil-rights-movement-bruce-ackerman_1588622093.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2015/03/22164320/Screen-Shot-2019-08-22-at-4.41.26-PM.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_03_civil-rights-movement-bruce-ackerman_1588622093.html", "title": "The Civil Rights Movement’s Forgotten Radicals", "title_page": "The Civil Rights Movement’s Forgotten Radicals", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nEarly in Seeing Red , a 1983 documentary about the Communist Party USA during the 1930s, ’40s, and ’50s, Sylvia Woods, a retired black autoworker, is asked whether she was worried about becoming a member of an organization that explicitly challenged the country’s ruling institutions. She responds that she joined without fear, “because I was suffering from . . . discrimination — and the humiliation of discrimination.” Like others interviewed in the film, Woods saw the radical left as the only political formation committed both to the full political and economic empowerment of individual Americans, and to challenging the institutions and power structures that disempowered them. Woods’s choice was clear: humiliation under a racist power structure, or dignity within the solidarity of a socialist movement. Organized socialists were among the few political groups, North or South, who opposed segregation and Jim Crow in the decades preceding the Civil Rights Movement. During the Great Depression, American socialists did what few other activists would, undertaking the slow and unglamorous work of organizing thousands of members into a movement capable of threatening racist institutions from below. The prewar alliance of black radicals, labor organizers, and socialist cadres laid the foundations for the mass movements that powered the Civil Rights Movement of the 1950s and ’60s. This radical engine is omitted from conventional portrayals of the Civil Rights Movement. The legislative victories of the Civil Rights Movement weren’t magnanimously handed down from on high. School desegregation, the Civil Rights Act of 1964, the Voting Rights Act of 1965, and Title VIII of the Civil Rights Act of 1968 (the “Fair Housing Act”) emerged from elite-dominated institutions, but they were the results of intense popular pressure. Similarly distorted is recent media coverage of American policing, which typically frames racist cops as atavistic holdovers from a bigoted past. Such stories exhibit the liberal confidence in a perpetually upward trajectory towards racial equality, and their tellers typically discourage any attention to the contradictions between a mythology of placidity and progress and the reality of systemic racism and exploitation. Structural critiques of power are disfavored, and marginal reforms are proffered as the best and only solutions. The police killings of Tony Robinson, Eric Garner, Michael Brown, Tamir Rice, and others are thereby transformed. They are no longer manifestations of a policing system devised to protect capital and complicit in the maintenance of white supremacy; they are simply aberrations — ones that merit explanation, but not explanations that are connected to critiques of larger social structures and power dynamics. Indeed, when police killings are met with anger, demonstrations, and demands for accountability and change — as seen in the burgeoning Black Lives Matter movement — protesters and activists are often lectured for failing to adhere to the supposedly purely nonviolent traditions of the Civil Rights Movement. But of course the movement was not simply built on unwavering fidelity to nonviolence, nor was it sustained solely by the leadership of charismatic personalities. It was built upon radical traditions of organizing and deep foundations of solidarity. Many participants did not shy from confrontation and the risks of direct action. Bruce Ackerman’s latest book, the third volume in his We the People series, also challenges this prevailing narrative. Ackerman, a specialist in constitutional law, has devoted much of his scholarship to rescuing the constitutional foundations of America’s ersatz welfare state from an assault by conservative jurists. The Civil Rights Revolution continues his project of identifying social movements that reshape the fundamental commitments of the American political order. Ackerman insists that popular sovereignty, not legality, furnishes the standard by which we should assess the legitimacy of major transformations of American politics such as Reconstruction, the New Deal, and the civil rights era. Ackerman’s argument is unlike that of most judicial liberals: he explicitly rejects the view that the Supreme Court is the primary motor of progressive political change with respect to race. In this, as in previous volumes, he casts the Court as a site of conservative resistance to the expansion of civil rights. From Dred Scott v. Sandford to the striking down of the Civil Rights Act of 1875 after the dismantlement of Reconstruction to judicial obstinacy in the face of the New Deal, the Supreme Court has been in the vanguard of reaction. If the liberal Warren Court is to be celebrated, Ackerman argues, it is because it deferred to public opinion (as mediated through formal political institutions) and accepted new understandings of the role of public power in combating private discrimination. Ackerman is no leftist. In previous books he has made clear that he values procedural rectitude and prefers moral suasion over the pursuit of political power through confrontation and contestation. But The Civil Rights Revolution is nevertheless a book that should command leftists’ attention. Its analysis of civil rights lawmaking proceeds from an understanding of the grassroots origins of the Civil Rights Movement. Just as importantly, its attentiveness to constitutional law is motivated by the author’s conviction that constituent power is a more potent source of political authority than legal continuity. Ackerman is thus at once an originalist — insofar as he holds that the Court is required to respect constitutional boundaries, rather than creatively reimagining them — as well as a populist, insofar as he holds that constitutional boundaries are set not by the interpretation of texts but by the activity of social movements. Ackerman thus argues for a vision of the political authority of mass publics that transcends the forms of conventional constitutionality. The stakes for Ackerman’s argument are high; the current landscape for civil rights in the United States is bleak. State violence kills a black person once every twenty-eight hours. The criminal justice system — extensively paramilitarized, significantly privatized, and lightly controlled — has replaced state and municipal officialdom as the main form of governmentality that millions of black people encounter on a daily basis. The legislative and judicial underpinnings of antiracist policies are under continued assault by conservative judges and politicians. But The Civil Rights Revolution fails to make a convincing case for Ackerman’s claim that Americans’ fundamental political commitments were substantially altered by the Civil Rights Movement. The failure is instructive: it reveals both the limits of liberal visions of racial justice, and the limits of pursuing radical political change within the institutional boundaries of formal politics.\nIn The Civil Rights Revolution , Ackerman presents major legislative accomplishments, landmark judicial decisions, and subsequent reinterpretations of the role of state power as evidence of successful mobilizations of popular power that saw their demands put into place through government action. The legislative and administrative reforms of the civil rights era comprised a “Second Reconstruction,” accomplished through novel but unmistakable acts of constituent power by an engaged mass public. Ackerman’s present-day bête noire is conservative opposition — grounded in “originalist” interpretations of the Constitution — to the antiracist policies and programs that were adopted in during the fifties and sixties. He calls originalism a “judicial battering ram for obliterating the achievements of the twentieth century” and faults conservatives for failing to recognize the Civil Rights Movement’s successes in dismantling many of the formal underpinnings of racist discrimination in the United States. Liberals have typically responded to the originalist challenge by identifying their preferred landmark cases, and articulating what they feel to be the authoritative interpretations of their doctrinal importance. Ackerman’s preferred term of derision for such casuistry is “formalism,” and it is well chosen. Liberals’ obsession with constructing legally airtight arguments for their preferred policies — rather than seeking to garner mass support for them — is an internally contradictory project. On Ackerman’s account, the landmark legislation and decisions during the Civil Rights Movement were political accomplishments that warrant substantial deference from courts — even though those accomplishments were not inscribed in sacred parchment through the Constitution’s amendment process. As a political precedent, Ackerman points to the New Deal coalition’s preservation of its legislative and administrative accomplishments despite a hostile federal judiciary. The turn (a grossly inadequate and racially imbalanced one) toward a modern American welfare state succeeded not through the passage of constitutional amendments — a virtual impossibility under the terms of Article V of the Constitution — but through the continued mobilization of organized labor, successive landslide electoral victories, and growing elite and popular impatience with the conservative justices (whom Roosevelt was eventually able to replace). Ackerman does not credit the Supreme Court with accomplishing school integration by fiat, nor does he believe that mass media spectacles such as the marches on Selma and Washington were sufficient to win the hearts and minds of a nation. He sees the Civil Rights Movement as following the same pattern as Reconstruction and the New Deal. In his telling, a mass movement placed demands on national institutions; political leaders crafted policy responses; the programs and agencies created by those policies endured in the face of challenges from state politicians, lower courts, and conservative national politicians; and ultimately, a new social contract was adopted, under which all citizens may expect the federal government to protect them from racist humiliation in encounters with police and officials, when looking for jobs or housing, or in school. Opposing humiliation is, for Ackerman, the foundation of antiracism. He weighs the US Constitution against the basic legal texts of other developed democracies and finds it wanting; unlike European constitutional texts, the American one fails to ground the form and aims of government in respect for human dignity. One of the achievements of the “Second Reconstruction” was the extension of New Deal technocracy — “government by numbers,” as Ackerman (approvingly) calls it — beyond labor relations to interpersonal relations in workplaces, schools, and public facilities. For Ackerman, the Civil Rights Movement’s most important contribution to American politics is the way in which it affixed dignity and the fight against humiliation in the constitutional firmament: not by inserting them into the text, but by creating federal programs and agencies that oversaw and monitored the implementation of antiracist policies in areas like public education, housing, and employment law. It’s not obvious that Ackerman’s case succeeds. Even if we grant the validity of his theoretical argument — that mass movements actively engaged with political institutions can change the American polity’s commitments and values in the absence of formal constitutional amendment — his historical premises may not hold up under strict scrutiny. Ackerman asks readers to consider that, in response to the mass pressures of the Civil Rights Movement, the judicial, legislative, and executive branches all considered questions of great constitutional import, and their deliberations produced texts — Court decisions, federal statutes, reams of administrative documentation — that assume a canonical stature the current Court cannot ignore. But the test of canonicity is in the authority a text commands and the deference it receives from an audience. By this measure a great deal of the Civil Rights Movement’s victories did not enter the canon. Political elites were largely successful in resisting the movement’s more radical demands and in subsequently repressing the movement’s more radical sectors. The reforms that did emerge from the mid 1960s were a patchwork of statutes and rulings whose place in the constitutional canon was and remains contested. If conservatives were unconvinced of the constitutional probity of state-driven antiracism then, why should they be persuaded by Ackerman’s arguments for it now, decades into the long retreat of the midcentury welfare state? Ackerman frequently asks his readers to accept several of his propositions without much evidence: that Chief Justice Earl Warren’s idiosyncratic treatment of constitutional doctrine in Brown v. Board was a piece of “commonsense prose [that] helped anchor the next decade’s constitutional debate”; that technocratic “government by numbers” reflected “a determination to get the job done” rather than an abandonment of political initiative and a retreat into bureaucratization; and that a pantheon of leaders such as King, Lyndon Johnson, Hubert Humphrey, and Richard Nixon authentically spoke for the aspirations and goals of “the American people” (apparently a unitary entity, free of inner antagonisms or contradictions). Ackerman, like most liberals, gives short shrift to the economic aspects of the civil rights struggle as well as the radicalization of many formations within the movement. He has nothing to say about the Black Panthers’ exploration of alternative forms of politics, including the provision of shared goods and security in urban centers abandoned by capital and local government; the unique contributions of black theorists to radical thought; or the turn taken by many within the movement, even erstwhile moderates like King, toward union organizing and toward a recognition of the need to attach anti-racist struggles to anti-poverty and anti-imperialist struggles. By bookending the bulk of his historical account with Supreme Court decisions — from the de jure desegregation of public schools in 1954 in Brown to the blessing of de facto segregation in 1974 in Milliken v. Bradley — Ackerman not only directs his spotlight away from the Civil Rights Movement; he fails to pay sufficient regard to the centrality of racial inequality and subordination in every sphere of American life, North and South. Ackerman does not explicitly acknowledge what labor organizers in the 1930s and 1940s recognized: that racism and economic exploitation have always been closely intertwined in the United States. His “Second Reconstruction” consists of a federal government with a modest mandate for combating humiliation within the limited precinct of citizen encounters with officialdom. The myriad instances of humiliation that attend brutal economic inequality, a plutocratic and antidemocratic political system, the dependence of capitalism on past acts of primitive accumulation and present dispossession and marginalization of minority communities — none of these basic questions of political economy receive sustained attention in Ackerman’s book. By ignoring the aspects of systemic inequality that are not easily discussed in terms of “government by numbers,” Ackerman also abets the conservative movement’s success in re-framing the narrative about racism — away from the embeddedness of racism in American institutions and power structures, and toward nostrums about individual morality and responsibility. The scant attention Ackerman pays to the Cold War fails to illuminate the challenge of the resurgent right. An ever-adaptable tool for the maintenance of elite hegemony, hysterical anti-communism provided ideological cover for white racists’ opposition to organized black power. And today, conservatives who profess to be blind to differences in race seek to obscure the ways in which government policy and class power maintain white supremacy, and the contemporary discourse of “diversity” (not justice) reflects the ideological success of decades of conservative opposition to a truly pluralistic and multiracial society. While originalists’ critics rightly accuse them of engaging in “law office history” — the selective reading of the documentary record and statutory language in order to support desired rulings — Ackerman’s reading of the history of American racism is also inadequate. His error is twofold: he misconstrues the partial and incomplete victories of the Civil Rights Movement as vindications of the traditional conception of American popular sovereignty, and he imagines that substantive political change is possible within the formal bounds of the American constitutional system. Ackerman acknowledges that his analysis “fail[s] to integrate the voices of movement activists, local political leaders, and ordinary Americans.” But this failure limits the scope of his historical argument and the usefulness of his theoretical argument for future struggles. Ackerman implicitly endorses a narrative in which landmark statutes such as the Civil Rights Act of 1964 and the Voting Rights Act of 1965 were enacted out of whole cloth, lacking historical antecedents in a past marked by radicalism: labor radicalism in the late nineteenth century, socialist organizing in the early twentieth century, and the critical efforts of slaves and sharecroppers to subvert and destroy white supremacy. Moreover, this narrative presents the marches on Selma and Washington, and the reactions they provoked from state and national institutions, as solutions to a non-problem. It assumes that America only needed a bit of reminding about the principles to which it had always been committed. With the necessary soul-searching, America was able to turn its back on the aberrations of Jim Crow and segregated schooling. Discrimination — and the humiliation that accompanied it — would be swept away in a reaffirmation of founding values: liberty, equality, and dispassionate treatment under fairly written laws. Moral suasion and a reading of history undisciplined by any coherent method will not suffice to protect Ackerman’s ersatz amendments from what he describes as the “judicial hubris” of the current Court.", "url": "https://www.jacobinmag.com/2015/03/civil-rights-movement-bruce-ackerman"}