{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:18", "date_modify": "2020-05-04 19:57:18", "date_publish": "2015-02-17 00:00:00", "description": null, "filename": "2015_03_smartphone-usage-technology-aschoff_1588622238.html", "image_url": "https://images.jacobinmag.com/2015/02/17002956/aschoff-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_03_smartphone-usage-technology-aschoff_1588622238.html", "title": "The Smartphone Society", "title_page": "The Smartphone Society", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe automobile was in many respects the defining commodity of the twentieth century. Its importance didn’t stem from technological virtuosity or the sophistication of the assembly line, but rather from an ability to reflect and shape society. The ways in which we produced, consumed, used, and regulated automobiles were a window into twentieth-century capitalism itself — a glimpse into how the social, political, and economic intersected and collided. Today, in a period characterized by financialization and globalization, where “information” is king, the idea of any commodity defining an era might seem quaint. But commodities are no less important today, and people’s relationships to them remain central to understanding society. If the automobile was fundamental to grasping the last century, the smartphone is the defining commodity of our era. People today spend a lot of time on their phones. They check them constantly throughout the day and keep them close to their bodies. They sleep next to them, bring them to the bathroom, and stare at them while they walk, eat, study, work, wait, and drive. Twenty percent of young adults even admit to checking their phones during sex. What does it mean that people seem to have a phone in their hand or pocket everywhere they go, all day long? To make sense of our purported collective phone addiction, we should follow the advice of Harry Braverman, and examine the “machine on the one side and social relations on the other, and the manner in which these two come together in society.”\nHand Machines Apple insiders refer to FoxConn’s assembly city in Shenzhen as Mordor — J. R. R. Tolkien’s Middle Earth hellhole. As a spate of suicides in 2010 tragically revealed, the moniker is only a slight exaggeration of the factories in which young Chinese workers assemble iPhones. Apple’s supply chain links colonies of software engineers with hundreds of component suppliers in North America, Europe, and East Asia — Gorilla Glass from Kentucky, motion coprocessors from the Netherlands, camera chips from Taiwan, and transmit modules from Costa Rica funnel into dozens of assembly plants in China. Capitalism’s simultaneously creative and de­structive tendencies spur constant changes in global production networks, and within these networks, new configurations of corporate and state power. In the old days, producer-driven supply chains, exemplified by industries like auto and steel, were dominant. People like Lee Iacocca and Boeing legend Bill Allen decided what to make, where to make it, and how much to sell it for. But as the economic and political contradictions of the postwar boom heightened in the 1960s and ’70s, more and more countries in the Global South adopted export-oriented strategies to achieve their development goals. A new type of supply chain emerged (particularly in light industries like apparel, toys, and electronics) in which retailers, rather than manufacturers, held the reins. In these buyer-driven models, companies like Nike, Liz Claiborne, and Walmart design goods, name their price to manufacturers, and often own little more in the way of production than their lucrative brands. Power and governance are located at multiple points in the smartphone chain, and production and design are deeply integrated at the global scale. But the new configurations of power tend to reinforce existing wealth hierarchies: poor and middle-income countries try desperately to move into more lucrative nodes through infrastructure development and trade deals, but upgrading opportunities are few and far between, and the global nature of production makes struggles by workers to improve conditions and wages extremely difficult. Congolese coltan miners are separated from Nokia executives by more than an ocean — they are divided by history and politics, by their country’s relationship to finance, and by decades-old development barriers, many of which are rooted in colonialism. The smartphone value chain is a useful map of global exploitation, trade politics, uneven development, and logistical prowess, but the deeper significance of the device lies elsewhere. To discover the more subtle shifts in accumulation that are illustrated and facilitated by the smartphone, we must turn from the process by which people use machines to create phones to the process by which we use the phone itself as a machine. Considering the phone as a machine is, in some respects, immediately intuitive. Indeed, the Chinese word for mobile phone is shouji, or “hand machine.” People often use their hand machines as they would any other tool, particularly in the workplace. Neoliberal demands for flexible, mobile, networked workers make them essential. Smartphones extend the workplace in space and time. Emails can be answered at breakfast, specs reviewed on the train home, and the next day’s meetings verified before lights out. The Internet becomes the place of work, with the office just a dot on the vast map of possible workspaces. The extension of the working day through smartphones has become so ubiquitous and pernicious that labor groups are fighting back. In France, unions and tech businesses signed an agreement in April 2014 recognizing 250,000 tech workers’ “right to disconnect” after a day’s work, and Germany is currently contemplating legislation that would prohibit after-work emails and phone calls. German Labor Minister Andrea Nahles told a German newspaper that it is “indisputable that there is a connection between permanent availability and psychological diseases.” Smartphones have also facilitated the creation of new types of work and new ways of accessing labor markets. In the “marketplace for odd jobs,” companies like TaskRabbit and Postmates have built their business models by tapping into the “distributed workforce” through smartphones. TaskRabbit connects people who would prefer to avoid the drudgery of doing their own chores with people desperate enough to do piecework odd jobs for pay. Those who want chores done, like the laundry or cleanup after their kid’s birthday party, link up with “taskers” using TaskRabbit’s mobile app. Taskers are expected to continuously monitor their phones for potential jobs (response time determines who gets a job); consumers can order or cancel a tasker on the go; and upon successfully completing the chore, the contractor can be paid directly through the phone. Postmates — the darling of the gig economy — is an up-and-comer in the business world, especially after Spark Capital pumped $16 million into it earlier this year. Postmates tracks its “couriers” in cities like Boston, San Francisco, and New York using a mobile app on their iPhones as they hustle to deliver artisanal tacos and sugar-free vanilla lattes to homes and offices. When a new job comes in, the app routes it to the closest courier, who must respond immediately and complete the task within an hour to get paid. The couriers, who are not recognized employees of Postmates, are less enthusiastic than Spark. They get $3.75 per delivery plus tips, and because they’re classified as independent contractors, are not protected by minimum wage laws. In this way, our hand machines fit seamlessly into the modern world of work. The smartphone facilitates contingent employment models and self-exploitation by linking workers to capitalists without the fixed costs and emotional investment of more traditional employment relations. But smartphones are more than a piece of technology for wage work — they have become a part of our identity. When we use our phones to text friends and lovers, post comments on Facebook, or scroll through our Twitter feeds, we’re not working — we’re relaxing, we’re having fun, we’re creating. Yet, collectively, through these little acts, we end up producing something unique and valuable: our selves.\nSelves for Sale Erving Goffman, an influential American sociologist, was interested in the self and how individuals produce and perform their selves through social interaction. By his own admission, Goffman was a bit Shakespearean — for him “all the world is a stage.” He argued that social interactions can be thought of as performances, and that people’s performances vary depending on their audience. We enact these “front-stage” performances for people — acquaintances, coworkers, judgmental relatives — that we want to impress. Front-stage performances give the appearance that our actions “maintain and embody certain standards.” They convince the audience that we really are who we say we are: a responsible, intelligent, moral human being. But front-stage performances can be shaky and are often undermined by mistakes — people put their foot in their mouth, they misread social cues, they have a piece of spinach lodged in their teeth, or they get caught in a lie. Goffman was fascinated by how hard we work to perfect and maintain our front-stage performances and how often we fail at them. Smartphones are a godsend for the dramaturgical aspects of life. They enable us to manage the impressions we make on others with control-freak precision. Instead of talking to each other, we can send text messages, planning our witticisms and avoidance strategies in advance. We can display our impeccable taste on Pinterest, superior parenting skills on CafeMom, and burgeoning artistic talents on Instagram, all in real time. New York magazine recently ran a piece about the four most desirable people in New York City according to OKCupid. These individuals have crafted such attractive dating profiles that they are pummeled with attention and racy requests — their phones ping continually with messages from potential paramours. Tom, one of the chosen four, regularly tweaks his profile, subbing in new photos, and rewording his self-description. He has even used OKCupid’s MyBestFace profile-optimizing service. Tom says all this effort is necessary in our present “culture of likes.” Tom considers his OKCupid profile to be “an extension of himself”: “I want it to look good and clean so, like, I make it do crunches and shit.” The incredible reach of social media and people’s rapid adoption of it to produce and perform their selves are engendering the emergence of new technologically mediated rituals of interaction. Smartphones are now central to the way we “generate, maintain, repair, and renew as well as . . . contest or resist relationships.” Take texting rituals, which, with all their complex, unwritten rules, now play a commanding role in the relationship dynamics of most young adults. One need not deal in toxic nostalgia to admit that new, technologically mediated rituals are displacing or radically altering older conventions. Digitally maintaining, generating, and contesting relationships through smartphones is somewhat different from using phones to complete tasks associated with wage work. Individuals don’t get paid a wage for their Tinder profile or for uploading photos of their weekend adventures on Snapchat, but the selves and the rituals they produce are certainly for sale. Regardless of intention, when a person uses their smartphone to connect with people and the imagined digital community, the output of their labor of love is increasingly likely to be sold as a commodity. Companies like Facebook are pioneers in the enclosure and sale of digital selves. In 2013, Facebook had 945 million users who accessed the site through their smartphones. It made 89 percent of its revenue that year from advertising, half of which came from mobile advertising. Its entire architecture is designed to guide the mobile production of selves through a platform that makes those selves salable. That’s why it instituted its “real names” policy: “pretending to be anything or anyone isn’t allowed.” Facebook needs users to use legal names so it can easily match corporeal selves with digital selves, because data produced by and connected to an actual human is more profitable. Users of the dating site OKCupid agree to a similar exchange: “data for a date.” Third-party companies sit in the background of the site, scooping up users’ photos, political and religious views, and even the David Foster Wallace novels they profess to love. The data are then sold to advertisers, who create targeted, personalized ads. The pool of people who have access to OKCupid’s data is remarkably large — OkCupid, along with other companies like Match and Tinder, is owned by IAC/InterActiveCorp, the sixth-largest online network in the world. Crafting a self on OKCupid may or may not yield love, but it definitely yields corporate profits. Awareness is spreading that our digital selves are now commodities. New School professor Laurel Ptak recently published a manifesto called “Wages for Facebook” and in March 2014, Paul Budnitz and Todd Berger created Ello, a fleetingly popular Facebook alternative. Ello proclaims: “We believe a social network can be a tool for empowerment. Not a tool to deceive, coerce, and manipulate — but a place to connect, create, and celebrate life. You are not a product.” Ello promises not to sell your data to third-party advertisers, at least for now. It reserves the right to do so in the future. However, discussions of the peddling of digital selves by gray-market data companies and Silicon Valley giants are usually separate from conversations about increasingly exploitative working conditions or the burgeoning market for precarious, degrading work. But these are not separate phenomena — they are intricately linked, all pieces in the puzzle of modern capitalism.", "url": "https://www.jacobinmag.com/2015/03/smartphone-usage-technology-aschoff"}