{"authors": ["Oskar Lafontaine", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:05", "date_modify": "2020-05-04 19:54:05", "date_publish": "2015-03-17 00:00:00", "description": null, "filename": "2015_03__1588622045.html", "image_url": "https://images.jacobinmag.com/2015/03/17003255/3963256731_7692f90efe_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_03__1588622045.html", "title": "A Better Europe is Possible", "title_page": "A Better Europe is Possible", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Interview by Leandros Fischer\nOskar Lafontaine is one of postwar Germany’s most remarkable politicians. Only former social-democratic Chancellor Willy Brandt provoked similarly emotional responses.\nYet ever since moving towards socialism a couple decades ago, Lafontaine has become an even more polarizing and controversial figure than Brandt. The former champion of European Union integration and sympathizer with the “post-material movements” of the 1980s is now one of the most vocal critics of Europe and staunchest defenders of the welfare state.\nIn his long career, Lafontaine served as minister-president of the tiny state of the Saar on the French-German border; mayor of its capital, Saarbrücken; German secretary of finance; chairman of the Social Democratic Party (SDP); and later cochair of the new left-wing party Die Linke (The Left).\nIn the late 1990s, the English tabloid the Sun called him the “most dangerous man in Europe” for advocating the regulation of financial transactions at the European level. Following a well-orchestrated media campaign and losing ground to the neoliberal forces in the German Social Democratic Party (SPD) around chancellor Gerhard Schröder, Lafontaine resigned from all his posts, prompting the German stock markets to rise by five percent.\nIn 2005, Lafontaine left the SPD after four decades and joined the new Die Linke formation. Under his leadership, the party grew electorally. But Lafontaine came under attack again, this time from the government-oriented wing of Die Linke, who saw in Lafontaine a barrier to forming future coalitions with the SPD and the Greens. After battling cancer, Lafontaine resigned from the party’s leadership in 2010, but still leads the organization in Saar.\nFollowing the outbreak of the eurozone crisis, Lafontaine emerged as a critic of the euro, advocating the abolition of the single currency and a return to a system of coordinated exchange rates. A charismatic speaker, Lafontaine quotes a variety of sources in his speeches, from French socialist Jean Jaurés and German revolutionary Karl Liebknecht to Pope Francis.\nHere, in an interview that has been edited for clarity, he speaks to Cologne activist Leandros Fischer about a democratic Europe, how to express solidarity with Syriza, and Die Linke’s position as an “anti-systemic” party.", "url": "https://www.jacobinmag.com/2015/03/oskar-lafontaine-interview-die-linke/"}