{"authors": ["Popular Unity", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:15", "date_modify": "2020-05-04 19:53:15", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_09__1588621995.html", "image_url": "https://images.jacobinmag.com/2015/08/17005338/INO-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_09__1588621995.html", "title": "What Does Popular Unity Stand For?", "title_page": "What Does Popular Unity Stand For?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nReleased on September 2 and translated for the first time below, the manifesto of Popular Unity is signed by the fifteen organizations of the radical left that comprise this political front, which seeks a rupture with austerity and the eurozone. Usually presented as a split from Syriza, Popular Unity actually includes a more variegated blend of forces, from left social democrats and social movement activists to far-left currents. Some of these forces come from Syriza: the two components of the Left Platform (the Left Current, led by Panagiotis Lafazanis, and the Red Network around DEA/Workers Internationalist Left), which constitutes the backbone of the movement. There’s also the Communist Tendency, which is affiliated with the International Marxist Tendency, and the Movement for the Radical Left, a network constituted by activists essentially working in the antiracist, pro-migrant, and LGBT movements previously part of the now-defunct tendency “53+”. Other organizations come from Antarsya (The Left Recomposition/ARAN and the Left Anticapitalist Regroupment, the two historically Althusserian groups of the Greek far left) or from groups that have collaborated with Antarsya (Leftwing Intervention, Communist Renewal, and the Plan B, led by former Syriza president Alekos Alavanos). Still more groups have roots in the KKE tradition (the Communist Group Reconstruction) or from layers of Pasok cadres who left the party either in the 1990s (the DIKKI-Socialist Left, a former component of Syriza) or in the last five years (Young Militant or the Left Socialists, a network of trade-union cadres controlling some important sectors of the labor movement). Some prominent personalities and networks have also joined Popular Unity on a more independent basis, including Zoe Konstantopoulou, the outgoing president of parliament; Nadia Valavan, the former vice-minister of finance; and the network “the OXI lasts a long time,” which groups activists from a left Eurocommunist background around Eleni Portaliou. What unites this diverse assemblage of groups, personalities, and tendencies is a commitment to replacing austerity with a progressive program of far-reaching social reform. “The alternative way forward that we are proposing,” Popular Unity insists, “will deprive Greece only of its chains.”\nThe starting point for the formation of Popular Unity is the Greek people’s resounding “oxi” (“no”) in the July 5 referendum. In the face of the scare tactics of the dominant forces in the European Union (EU) and in Greece, the great majority in society, with dynamic participation from the younger generation, staged an authentic popular revolt. The basis of Popular Unity lies in the resistance of the Greek people, unprecedented in its persistence and numerical strength, particularly in the first two years of imposition of the memoranda. This struggle expressed generalized resistance to the strategic plan for imposing permanent austerity, the stripping of workers of every right, seizure of property, the dissolution of democracy, and the imposition of a regime of limited sovereignty. A mere month after the Greek people’s “oxi” in the referendum, the passage of the third memorandum has brought dramatic changes to the political landscape. The leadership group in the government that emerged from the elections of January 25 violated the very social contract that linked it to the popular majority, sowing disillusion and rekindling fear. It switched sides and is now on the side of the neoliberal forces, bombarding working people and the middle strata with new anti-popular measures. This development enabled the creditors to mount a political coup, violating both the Constitution and popular sovereignty in every sense of the term. The international tutelage becomes ever more stifling, the prime example of humiliation being the creation of the notorious fund for privatizations, which mortgages social wealth for generations to come. The third memorandum is just the beginning. Already on the agenda is the further dismantling of workplace relations, new reductions for pensions that are already degradingly low, a taxation blitz on farm incomes and the small- and medium-social strata, along with a host of other measures that are to be implemented in the coming months. It was precisely this, in conjunction with the attempt to avert the formation of an alternate anti-memorandum political front, that impelled the government to call a snap election. It is an attempt to sequester the popular vote before the electorate can be informed of, and experience fully, the consequences of the third memorandum. An attempt which enjoyed full support from the European overseers — Merkel, Juncker, Moscovici, Dijsselbloem — who two months previously connived to thwart the Greek people’s right to democratic self-assertion in the case of the referendum. No serious person can possibly imagine that these socially catastrophic measures might prove effective even from a narrowly financial viewpoint. Their predestined failure will lead to new packages of anti-popular measures, perpetuating the vicious circle we have seen with previous memorandum governments. Working people, farmers, the young, professionals, and small business people will be ruined simply for the sake of securing the next tranches of the “bailout,” 99 percent of which will go to the creditors or to the bankers. Nothing will be available for the real economy or for the citizens who find themselves on the brink of economic annihilation. It is beyond a joke to imagine that this government, which signed the third memorandum and from that time onwards has been extolled by the representatives of the creditors and local oligarchs, will succeed — somehow, someday — to extricate itself from it. If you take the wrong train, you are never going to reach your destination. A person is not living in the real world if he or she imagines that a government that agreed immediately to take €93 a month away from the poorest of the poor, reducing the minimum pension to the pitiful sum of €393 monthly, would be capable of challenging major vested interests.\nFor a great front of Oxi for as long as it takes For all these reasons it is urgently necessary to form Popular Unity, a social and political front to overturn the memoranda, predatory austerity, the negation of democracy, and the transformation of Greece into a European colony by means of indebtedness. What we need is a great popular patriotic front, characterized by credibility, reliability, and selflessness. A front that will revive the betrayed hopes, overcome the fears, and provide a prospect of victory for the fifth of July’s great popular and youthful current of Oxi. Those who seek to malign this effort in advance, characterizing it as an act of desertion that supposedly brought down the “first left-wing government,” are simply wasting their time. The real deserters from the Left and its programmatic commitments are those who chose to become this country’s third memorandum government. Popular Unity is not an electoral flag of convenience, nor is it willing to become just another addition to the bankrupt political party system. It represents a regroupment of political organizations, movements, and independent citizens that seeks to express, inspire, and strengthen the authentic popular movement through initiatives of self-organization. We want to become the voice of those who at present have no voice, the power of those who lack power. We want to initiate a political and social front that can represent the social alliance of working people, the unemployed, farmers, the self-employed, the urban small and medium business strata, intellectuals, and artists, in a common endeavor to map out a new way forward for Greek society. In this initiative there will be no room for monolithic logics and pretensions to exclusive truth. A variety of social sensitivities, political traditions ,and ideological preferences will have their place. It is a prerequisite for survival of this front that its functioning be democratic, centered on the activists themselves, their demands, and the answers they submit. The forces, the activists, the men and women participating in Popular Unity are linked together by a powerful political consensus in favor of an immediate, vitally necessary alternative solution to the tragedy of the memoranda, a solution that will work to the benefit of the popular classes at the expense of big capital, and will free Greece from the deadly overlordship of the imperialist centers. What unites us is a common quest, via different routes, for a new society, liberated from the bonds of exploitation and every species of oppression, a society of solidarity, justice, and freedom, on the path to socialism of the twenty-first century.\nImmediate measures for an exit from social disaster The basic immediate objective of the new Popular Unity is the creation, by the social movements and mass political action, of the prerequisites for a radical alternative solution to the disaster of the memoranda. The basic features of the alternative route have already been mapped out by numerous leftist groupings, radical movements, and progressive scholars. The alternative solution we embrace seeks to provide answers to all the key problems of the economy, society, the state, and foreign policy. Naturally it is not confined to monetary policy, as is asserted by the swindlers and slanderers who speak of a “drachma lobby.” The problem with this alternative proposal is not its supposedly inadequate “technical” elaboration but its inadequate political preparation: namely, the fact that it has not been discussed as much as it should have been among the people and the social organizations — among those, in other words, who will be called upon to put up a tough struggle against colossal vested interests in order to implement it. We plan to fill this gap immediately, through a great campaign of public dialogue, in opposition to those who are intent on imposing a new “idionymon” (the law banning political dissent from the 1930s), demonizing and even penalizing this “prohibited” discussion. The immediate emergency measures which must be taken to open up the new way forward are: Abolition of the socially and economically ruinous memoranda and the accompanying colonial loan agreements that mortgage our future.\nSuspension of debt repayments — whose non-viability has been recognized, from its own viewpoint, even by the International Monetary Fund — with a view to effecting an overall annulment of the debt, or at least the greater part of it. The suspension of payments will be accompanied by political and legal actions, at the international level, utilizing the relevant findings of the Greek Parliament’s Truth Commission on the Greek Debt.\nIndependently of the action at the international level, but in parallel with it, there will be immediate and insistent demands — political, legal, and movement-based — for payment of German debts, that is to say the Greek loan to Germany at the time of the Occupation, and reparations to the victims and the compensation for the destruction from Nazi atrocities.\nAn immediate end to austerity and implementation of a policy of redistribution of social wealth to the benefit of working people and at the expense of the oligarchs. Particular attention must be paid to the social strata worst hit by the crisis, with income support and a step-by-step increase in the minimum wage and the minimum levels for pensions and unemployment benefits, along with the securing of medical and pharmaceutical cover and basic provisioning (power, water, heating) for all.\nMore generally, support for wages and pensions, and social expenditures for free public education, popular health care, and culture. Gradual wage increases will be encouraged, in step with the rate of growth. Punitive taxation and other memorandum-based measures against farmers and the self-employed will be rescinded. The Uniform Property Tax will be abolished, and a tax system will be introduced affecting only very large-scale fixed property.\nNationalization of the banks and their operation under a regime of social control, with watertight guarantees for the savings of ordinary people. The new nationalized banking system, freed from the patronage of the European Central Bank (ECB), will underwrite the vitally necessary cancellation of debt for households exhausted by the crisis and the equally necessary liquidity for small and medium businesses threatened with closure. To this end, the Agrotiki Trapeza (Bank of Agriculture) and TachydromikoTamieftirio (Post Office Savings Bank) will start operating again, with investigation of the scandals surrounding their sale. Nationalization of the banks will make possible an immediate in-depth inquiry into the dodgy loans dispensed to monopoly groups, not to mention tax evasion though various lists of tax evades such as the “Lagarde-list.”\nEconomic reorganization and cultural rebirth In parallel with these emergency measures, which will provide a first measure of relief to the economy and to ordinary people, radical reforms will be promoted to change the bankrupt developmental model and overturn the balance of social forces to the advantage of the people and to the detriment of the oligarchs of crony capitalism. Radical change in labor legislation, with restoration of collective agreements and free collective bargaining, a clampdown on unfair treatment by employers, stricter limitations on and disincentives for dismissals, activation and strengthening of labor inspectorates. A public, social, and upgraded Manpower Employment Organization, along with abolition of private employees subleasing companies.\nEstablishment of a permanent, socially just, and redistributive taxation system so that the burdens of the crisis can be borne at last not by the customary pack animals but by the possessing classes.\nAn end to predatory privatizations of enterprises, networks, and infrastructures (Public Power Company, natural gas, harbors, airports, real estate in the public sector, etc.). Immediate abolition of the Hellenic Republic Asset Development Fund. Reacquisition, without compensation, except for small shareholders, of the public property that has been sold off to private capital, with cancellation of the illegal and unconstitutional decision for their sale. Nationalization, reorganization, and relaunching under a regime of workers control/social control of all strategic enterprises, networks, and infrastructure, which will be assigned the role of economic powerhouses. The aim will be rapid economic revitalization that will create jobs, strengthening the position of working people and protecting the environment.\nReorganization of the demolished national health system and of public hospitals, with institution of a first-rate, high-quality health system, accessible to all, in urban centers and in the regions.\nA policy for dealing with cultural decline, upholding the public character of cultural institutions and universal popular access to cultural creation. Public support for every creative initiative by the people of culture and the citizens themselves.\nReconstruction of the economy and of production with the emphasis shifting (a) from consumption of imported commodities to production (above all, industrial and agricultural production of high quality goods), and (b) from contraction of labor costs to increased added value. Our aim, in the final analysis, is to effect a transition from development that serves the exploiters of labor and of nature to a development centered on producers of social wealth and supported by their knowledge, experience, ingenuity, and creativity. To this end what will be needed are policies of democratic central and regional planning, with participation and joint decision-making from local communities and a distinct environmental dimension.\nGenerous funding for public, free education and research, which is, apart from anything else, a basic prerequisite for a productive turn towards a new and efficient social model.\nOne essential aspect of economic reconstruction will be a strengthening of the “third” (alongside state-run and private) sector, that of the social economy (cooperatives, self-managing enterprises that have been abandoned by their owners, solidarity networks, etc.). Generous funding by state mechanisms and the public banking system will be indispensable.\nA policy of solidarity and humanism for refugees and economic immigrants. We will actively oppose every form and instance of xenophobic and racist behavior — the most extreme case being that of the fascist Golden Dawn — which tends to convert the social war of capital into an ethnic “civil war” within the ranks of labour. We oppose the imperialist wars that fan the flames of the refugee and migrant problem. We demand from the EU the support due to our country and the other “front line” countries while at the same time insisting on abolition of the Dublin II regulations that transform Greece into a prison for immigrants.\nExit from the monetary prison of the eurozone It is entirely evident to us that cancellation of the memoranda in itself — and even more so the radical structural changes we have described — will face fierce resistance from the dominant forces in the EU. They will immediately try to throttle our effort, using as their basic instrument the cutting off of liquidity to the banks by the ECB. We have already experienced this in the last six months, even with the much more moderate policies of the Syriza-ANEL government. Therefore, the question of an exit from the eurozone and of a break with the neoliberal policies and choices of the EU, which has been following an ever more reactionary and anti-democratic trajectory, will be placed on the agenda not as the product of some ideological obsession but in terms of basic political realism. The bitterly acquired experience of the last months has revealed even to the most skeptical that the dominant forces in the EU are not “allies” and “partners.” They are financial blackmailers and political hit men who do not hesitate to impose on an entire people the most ruthless form of collective punishment when its decisions are not to their liking. The attainment of monetary sovereignty and the establishment, on a new democratic, social, and developmental basis, of a national currency, is not an end in itself. It is one of the necessary instruments for the implementation of the radical changes we have outlined, for which, indeed, the ultimate guarantor will be not the currency but the struggle of the popular classes. Whatever the inevitable difficulties of the first months, nothing justifies the stance of those Cassandras who equate such a move with economic disaster and national ruin. In the course of the twentieth century, sixty-nine monetary unions collapsed on this planet without this signifying the end of the world. The introduction of a national currency as a prerequisite for implementation of a progressive program for reconstruction and a way forward is not only a viable option; it is an option of hope, with the potential to launch the country on a new developmental trajectory. We are not nostalgic for the capitalist Greece of the drachma. We know that the pre-euro situation of our country was anything but a paradise for the exploited classes. But the thirteen years we have been living with the euro have not been in any way better. The first seven were, for certain sections of the population, a protracted credit-based consumer binge, on the accumulated ruins of the country’s productive base. But the following six saw the abrupt end of the binge and the descent into the hell of the memoranda, with no hint of light at the end of the tunnel. It is time to venture an emancipatory exit. Attainment of monetary sovereignty, with de-linkage of the Bank of Greece from the ECB, and its operation with governmental, public, and social accountability and with issuance of a national currency, will provide us with the necessary liquidity in the economy, without the onerous burden of the loan agreements. It will be of great assistance in strengthening exports, limiting and gradually substituting local products for imports, invigorating the country’s productive base and tourist inflow. It will foster job creation through a program of necessary public productive investments, developmental initiatives from the big publicly owned enterprises, support for the social sector of the economy, and restoration of credit for small and medium businesses. Abolition of the unjust taxation and other burdens imposed on lower-income households simply to service the unbearable debt will boost demand and stimulate development. In sum, we are going to present a special plan for Greece and open it for discussion: a plan for implementing a radical, progressive program with a national currency.\nA position of equality for Greece in today’s world Exit from the economic prison of the eurozone does not mean national autarchy and international political isolationism, as our opponents maintain. On the contrary, by embarking on a new course of radical change the Greek people may be offering a beacon of hope for other peoples of Europe and the world, establishing necessary relations, building support, and securing allies. The alternative way forward that we are proposing will deprive Greece only of its chains: the obligations that reduce it to the status of European and Atlanticist real estate. It will, however, liberate Greece’s potential to develop mutually beneficial relations with all countries that respect its sovereignty and its decision to be friendly towards all the world’s peoples, without being in the service of any great power. Our basic orientation is towards a new independent multi-dimensional international relations policy, in the domains of energy, economics, and politics. International relations that will not be imprisoned in the straitjacket of the EU. We aspire to an energy policy of collaboration in the Mediterranean, the Balkans, and the Middle East. A policy that will take advantage of the new opportunities for mutually beneficial collaboration with the emerging economies of the BRICS nations, Latin America, and other regions of the planet. We are against the new “Cold War” and a new division of Europe with the erection of new walls against Russia. We oppose the imperialistic options and the military adventurism of NATO. We are pledged to the exit of Greece from this coalition, a war machine that disintegrates states, tyrannizes peoples, and destabilizes the wider geopolitical arc of our region from eastern Ukraine to the Middle East. We campaign for the removal of the American-NATO bases, for non-participation of Greece in any imperialist organization. To deal with the problems caused in Greek-Turkish relations by the demands of the Turkish governments, we seek to pursue peaceful dialogue, on the basis of faithful implementation of international agreements, international law, and in particular the Law of the Sea. We are totally opposed to any attempt to change borders in our region. We reject all fomenting of nationalistic, chauvinistic tendencies. We campaign for a just and viable solution for Cyprus, on the basis of United Nations resolutions, for an independent Cyprus, without armies of occupation and foreign bases. We consider it necessary that military collaboration with Israel — occupier in our region of foreign territory — be terminated, and the Palestinian state immediately recognized. We are in solidarity with the peoples of the world who struggle for freedom, justice, and self-determination. Exit from the eurozone and implementation of a radical alternative program with the organized people as the key protagonist amounts to a proposal for conflict with the options of the EU and its anti-democratic supranational agencies. As early as the Treaty of Maastricht, the European integration project served the neoliberal agenda, strengthening the imperialist proclivities of the dominant forces and undermining popular sovereignty. In the face of the inevitable attacks from finance capital and its political representatives, the people must be ready for anything. The question of Greece leaving the EU may be placed on the agenda, de facto and at any moment. In this eventuality, we will call upon the people to insist on implementation of the progressive program it has chosen, taking the decision for remaining in the EU, or not, by referendum, in the same manner as other European countries. In any case, exit from the eurozone and a break from the narrow constraints of the EU does not mean isolation of Greece from its European environment. We will address ourselves particularly to other peoples, the social movements, and the progressive forces of the EU member countries with whom we are linked by longstanding economic, political, and cultural ties. We seek to contribute to the establishment of a pan-European movement around the goals that are implicit in the common interests of working people, irrespective of nationality. A landmark in the reactionary transformation of the EU is the Transatlantic Trade and Investment Partnership (TTIP) now being hatched. An agreement that surrenders public goods (water, education, health, etc.) to multinational corporations, opening the doors wide to genetically modified food and at the same time abolishing every trace of workers rights and national sovereignty that might impose any limits on the unaccountability of investors. We will employ all the powers at our disposal, together with the progressive movements of Europe, to prevent ratification of this monstrous agreement.", "url": "https://www.jacobinmag.com/2015/09/tsipras-popular-unity-syriza-eurozone-snap-elections/"}