{"authors": ["Robin Blackburn", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:50", "date_modify": "2020-05-04 19:51:50", "date_publish": "2015-11-17 00:00:00", "description": null, "filename": "2015_11_from-ed-miliband-to-jeremy-corbyn_1588621910.html", "image_url": "https://images.jacobinmag.com/2015/11/17010321/corbyn-campaigning.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_11_from-ed-miliband-to-jeremy-corbyn_1588621910.html", "title": "From Ed Miliband to Jeremy Corbyn", "title_page": "From Ed Miliband to Jeremy Corbyn", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nBritain’s Labour Party has elected as its leader Jeremy Corbyn, a man branded a dangerous socialist and pacifist. The national press warns he is completely unelectable, but is still panicked by the thought of Prime Minister Corbyn. Corbyn is not a demagogue but soft-spoken and studiously polite to opponents. His landslide victory — he won quarter of a million votes out of just over four hundred thousand casted — is a striking repudiation of Tony Blair and his New Labour project, with its foreign wars and neoliberal domestic policies. The sixty-six-year-old Corbyn is faithful to the old-time religion of Labour socialism, a force the party heads thought they had rid themselves of years ago. It was truly impressive to see how the campaign withstood repeated attacks from the “Labour grandees” and the mass media. There were even scurrilous attempts to portray this tireless peace campaigner as a stooge of terrorists. Repeated broadsides from Blair and Lord Mandelson seemed only to convince Corbyn supporters that they were making the right choice. Barring some constitutional crisis, the next election will not be until 2020, so Corbyn has time to refashion his party, challenge austerity, and campaign against British aggression abroad. But his supporters will expect an early start to the campaign, with looming battles over “devolution” within the not-so-United Kingdom, over Britain’s European Union membership, and over local elections in May. Corbyn has momentum in these battles because of a massive influx of new party members and supporters, young and old, who crowded to his rallies and greeted him with the cry “Jez We Can!” But the new leader has to contend with a party machine that is still in place and a distinctly moderate Parliamentary Labour Party (PLP) which is used to wielding power behind the scenes and scarcely disguises its scorn for Corbyn. His alternative is change from the grassroots — something that’s begun to happen but only in fits and starts.\nChallenging New Labour To understand the challenge Corbyn faces, it is helpful to look back at the last five years of Labour leadership. In 2010, after more than a decade in power, Labour suffered crushing defeat. That May, Gordon Brown resigned as UK prime minister, leaving two brothers, David and Edward Miliband, to slug it out for the Labour leadership. David was the chosen candidate of Tony Blair’s wing of New Labour, while Ed, his younger brother, took a critical stance on the government’s participation in the Iraq War and Labour’s role in the financial crisis. However, Ed’s critique was muted — he was himself former adviser and close associate to Gordon Brown, Blair’s partner and successor. Ed Miliband won the 2010 leadership contest by a wafer-thin margin, and only with considerable backing from organized labor. The spectacle of two brothers battling it out for the top job was lent added piquancy by the fact that their father, Ralph Miliband, had been Britain’s leading Marxist political scientist and author of a highly critical study of the Labour Party, entitled Parliamentary Socialism. Edward’s decision to challenge his brother, with the pain that this was bound to entail, could only be justified if some major principle was at stake. The younger Miliband’s claim was that Labour needed to distance itself from New Labour. While he ultimately failed to effect such a shift, his attempts weren’t inconsequential. Corbyn has learned from them. Ed Miliband began the work of furnishing Labour with a different narrative, one that criticized the ravages of capitalism in the contemporary UK. And finally, he introduced a new method of electing the party leader — one which at last empowered each member with an equal vote. These changes went beyond Miliband’s intentions and gave Corbyn and his supporters the opportunity they needed to win the party a few years later.\nMiliband’s Early Coups Corbyn, we should be aware, inherits a difficult role. Most of the time British Oppositions find themselves responding to the government, and to events. But Miliband, in his first two or three years, sometimes managed to set an agenda which his opponents could not ignore. In 2011, he supported a backbench attempt to rein in Rupert Murdoch’s scandal-plagued media empire by reducing and separating its television and press holdings. By supporting this backbench initiative Ed broke with the rotten New Labour tradition of toadying to Murdoch. Cameron was thereby also forced to drop his opposition to the measure or be exposed as a servile Murdoch minion. Miliband had not initiated the campaign but he had backed it at the critical moment. Such defeats for Murdoch are few and far between. Ed scored a different sort of success when he used his leader’s speech at the Labour Party’s 2011 conference to attack the energy companies for exorbitant price rises. They aggravated what he called the “cost of living crisis.” He urged the government to introduce an electricity price freeze. By now many millions were suffering from the government’s austerity program, with average take-home pay lagging behind inflation. Miliband’s “cost of living crisis” established an effective and enduring talking point, reflected in opinion polls by a modest but steady Labour lead. Ed also reached for a broader theme when he drew a sharp contrast between “predatory capitalism” and “productive” capitalism, with hedge funds in the former category, and responsible and regulated suppliers of needed products and services in the later. He called for taxes on the wealthy and the removal of the hedge funds’ exemption from stamp duty. These measures would furnish timely resources for the National Health Service. The Economist later explained that it could not endorse Labour despite its valuable support for European Union membership. The reason? “Labour’s leader wants to remake British capitalism in favor of a fairer society.” Miliband’s ability to shape policy in opposition was showcased on other occasions, as well. By 2013, there was a vociferous transatlantic campaign in favor of Western military intervention in Syria. Miliband was wary of a cause backed by so many of the authors of the Iraq War. Some backbench Conservatives and Liberal Democrats were equally concerned. The Labour leader was prepared to listen to the government’s case but instead eventually urged all his MPs to oppose a motion licensing military action, to the surprise of friend and foe alike. The government motion was defeated, with immediate repercussions in Washington. The White House had been agitating for significant intervention but now changed its tune, and declined to ask Congress for backing for such a move. The vote in the British parliament had helped the doves check the hawks. For a British opposition leader to have such an impact is rare indeed. According to an editorial in the Financial Times, David Cameron regarded this defeat as the worst moment of his premiership. The Labour leader’s string of coups led the Commons Press Lobby to award him the title of Parliamentarian of the Year in 2013. Coalition leaders were sore, but it was fellow Labourites who were most alarmed. Former Labour Cabinet ministers began musing in public that Ed was disloyal to British allies and flirting with populism. We may wonder whether veiled Blairite threats in public were supplemented by more brutal warnings in private.\nMiliband Appeases Miliband wanted to enter the 2015 general election with a united party. He was determined to avoid the public divisions that had done so much damage to Labour in the eighties and the Conservatives in the nineties, and his shadow cabinet was composed almost exclusively of former Blairites or Brownites. His stance on Syria was to prove quite exceptional. He had earlier backed Western airstrikes on Libya and the ouster of Muammar Gaddafi. He also endorsed British engagement in Afghanistan and US and British airstrikes in Iraq during 2014. Miliband’s domestic options were sometimes equally compromising. Scottish Labour, a bastion of machine politics, was allowed a virtually free hand after complaints that it was treated as a branch office. Such a belated move did nothing to ward off the verdict of the Scottish voters. Their bone of contention had to do with the Trident nuclear submarine program. Its proponents wanted to update it to the tune of tens of billions of pounds. The Scottish National Party (SNP) urged the scrapping of the Trident nuclear submarine program, as its termination would have released huge funds to spend elsewhere. But Miliband was adamantly opposed. Labour’s internal policy police were content. Unilateral nuclear disarmament had long been a signature issue for the Labour left. But the leader’s stance against it was virtually uncontested. There were a few courageous mavericks in the PLP, like Jeremy Corbyn, but not a visible and vocal left-wing grassroots movement such as had animated Labour in the days of Nye Bevan, Michael Foot, or Tony Benn. Absent the assertive presence of such a Left, Miliband had little hope of taking on the right-wing majority of the PLP even if he had wished to do so. The party’s policy director, Jon Cruddas, later complained that its policymaking process came to a shuddering halt, two years before the election was to take place. We now know that Labour’s membership was restless and growing, and would very probably have approved a more radical course. But back then, in what I now think of as BCE (Before Corbyn Era), Miliband was still in awe of the New Labour coterie and its threats. The Blairites might have held their fire, but the same was not true of the press which mercilessly seized on any unfortunate photo and minor stumble to ridicule and diminish the Labour leader. The poll lead narrowed a bit but it seemed that, at least in England, everything was still to play for. In Scotland, the prediction that the SNP would sweep the board led Scottish Labour to retreat into its Unionist bunker and to ignore the deep-seated crisis of the UK state. The Labour leadership concentrated its fire on the SNP and let off the Conservatives with warnings that they were alienating Scottish opinion. The Conservatives certainly fear that loss of Scotland would threaten to unravel the UK and diminish its claim to be a great power. But Conservatives, lacking support there for a generation, are not as panicked as Labour by the threat of secession.\nThe Voters’ Complex Verdict On election night it was revealed that a late surge to the Tories had wiped out Labour’s notional lead and given the Conservatives an absolute majority of seats. The Conservatives would be able to form a government by themselves. The Conservatives had attracted 37 percent of the total vote, while Labour had only 30 percent. Labour had lost in forty-eight constituencies it had previously held and retained only one member of parliament (MP) in Scotland. The SNP had won 50 percent of the vote in Scotland, and gained fifty-six out of fifty-nine seats. The Liberal Democrats had been reduced from fifty-seven to just eight seats, with only one in Scotland, and a share of the total vote that fell from 22 percent to 8 percent. Meanwhile 1.1 million Green votes, 4.2 percent of the total, earned them only one seat. An even more grotesquely disproportionate result for the right-wing populist UK Independence Party (UKIP) saw it awarded one seat — though it had received 3.9 million votes. Looked at as a verdict on the Coalition, the results showed a retreat, with Conservative gains being more than offset by larger Liberal Democrat losses. Contrary to the impression given by many commentators, the Conservative share rose by only 0.8 percent of the total vote, from 10.7 million votes in 2010 to 11.3 million in 2015. The Lib Dems had fallen from 6.7 million votes in 2010 to 2.4 million votes in 2015, losing 15.2 percent of the total and with a net loss of forty-nine seats overall. Labour saw its vote rise from 8.7 million votes to 9.3 million. In England alone it attracted a million more votes than in 2010, and saw its share of the total vote rise by 3.6 percent. Labour’s recovery this year from its terrible results in 2010 was too weak, leaving others — especially the SNP and UKIP — to harvest voter disaffection. UKIP received nearly 13 percent of the total vote, boosting its share by 10.7 percent of the total vote compared with 2010. The complexity of this picture has not been sufficiently recognized. This was a terrible result for Labour because of Scotland and because, overall, it attracted two million fewer votes than the Conservatives and suffered a net loss of twenty-six seats. But the Lib Dem loss of more than four million votes and the UKIP gain of more than 3.5 million also weigh heavily in the overall result. In an awesome massacre of votes, millions of Lib Dem, Green, and UKIP supporters laid down their ballots to enable the Conservatives to rule and Labour to survive. It would be wrong, of course, to conclude that over three million voters switched from the Lib Dems to UKIP. The constituency pattern suggests considerable “churn” quite apart from the fact that, over five years, constituencies of those eligible to vote change. Exit polls enable some broad shifts to be plotted, one of them being what seems to be the changing options of former Lib Dem voters. Much of Labour’s increased votes stemmed from this source, but there was also a significant shift to the Conservatives. The Conservative campaign on the ground focused its effort on seizing Liberal Democrat seats with a ruthlessness towards yesterday’s allies. The relative success of this policy became apparent when the Conservatives won 20 percent of those who had voted for the Lib Dems in 2010, compared with 24 percent who opted for Labour and 11 percent who went to the Greens. Overall the Lib Dems lost two-thirds of their former share of the vote. Labour scored well with those aged eighteen to thirty-four, especially young women, winning 43 percent of their votes. Unfortunately less than half of younger voters turned out to cast their ballot. Those over sixty-five, by contrast, attained a 78 percent turnout and only 25 percent voted Labour — no doubt in part due to the party’s scant attention to the growing crisis of elder care. The swelling of the UKIP vote meant that there had been a major contraction of the middle ground in English politics. While Thatcher’s Conservatives never won more than 44 percent of the total vote, the two right-wing parties have now won just under 49 percent of all votes. However, these parties are not a bloc, but rivals and antagonists. They have been at one another’s throats and are not potential coalition partners. The Conservative party is par excellence the party of respectable, English, bourgeois hegemony while UKIP is a populist breakaway, promising rejection of the EU and cuts to welfare. Ralph Miliband argued in Capitalist Democracy in Britain that the first-past-the-post electoral system promotes a concentration of power in the hands of the potentially hegemonic bourgeois fraction. This is well-illustrated by the Conservative victory and the unhappy fate of UKIP, with its solitary MP and 3.9 million votes. The humiliation of Nigel Farage, the UKIP leader who failed for the seventh time to win a Westminster seat, provoked infighting and recriminations that further weakened the party.\nThe Overcrowded Center Labour’s dismal result was the cue for a chorus of senior Labourites to declare that the party had lurched too far to the left and that, as Blair himself put it, British elections are won in the center ground. Though widely echoed, this verdict reflects an ostrich-like inability to see the wider pattern of UK politics which can no longer be read as a two-horse race. Labour suffered historic rejection in Scotland because it had sacrificed the welfare state to the warfare state. In England the anti-centrist UKIP took support from Labour well as the Conservatives, portraying the center parties’ subordination to the EU as the source of all the country’s woes. UKIP’s support comes disproportionately from the swaths of England which have been left behind. UKIP, however, is a party of the radical right, not the center. Generally without the backing of big business — a few anti-EU City financiers aside — the party caters to anti-immigrant feeling, with racial undertones. However, on other issues, it attacks several of the many undemocratic features of the EU and UK in a populist manner. The Liberal Democrats are a genuinely centrist party and they tanked. Their collapse was many voters’ withering response to that party’s coalition with the Tories and backing of austerity. This fatal misstep reversed more than a decade during which the Lib Dems had built support by outflanking Labour on the left, favoring a rise in income taxes, opposing the Iraq war, and urging electoral reform. If Labour had won most of those who deserted the Lib Dems it would have won the election. As it was, Labour only achieved this in London, while elsewhere Lib Dem votes went to the SNP and UKIP, with only a trickle going to Labour. Some even went to the Conservatives on the principle that it’s better to engage the organ grinder than his monkey.\nLabour’s Key Failure Labour in early 2015 was haunted by a past that it refused to confront. The key issue that sank Labour was, once again, its own record in office. While Ed Miliband’s distance from New Labour got him elected leader, it was unpopular with the shadow cabinet. The Brownites — and Gordon Brown himself — were utterly opposed to any serious criticism of the economic stewardship of the Blair/Brown governments, with its notorious claim to be “relaxed” about galloping inequality and its empty brag that it ended the cycle of boom and bust. Since it was difficult to praise the measures that fostered the bubble economy, the result was an awkward silence. Cameron and colleagues swooped on Labour’s embarrassment to allege that the crisis was the result of the government’s profligate public spending. In reality, of course, the mountainous debts which brought on the financial crisis stemmed from the private sector, while the post-crisis spending was essential to prevent an even sharper downturn. Nevertheless Tory spokesmen got away with talking about “Labour’s recession” as if the meltdowns of Wall Street and the City were a mere sideshow compared with the blunders of the British government. Martin Wolf in the Financial Times and Paul Krugman in the New York Times wrote piece after piece arguing that it was the indebtedness and speculations of financial institutions that brought on the crisis and bailout. Wolf and Krugman insisted that austerity was making matters worse and weakening the recovery. Neither Ed Miliband nor Ed Balls, the shadow chancellor, took up the arguments laid out by these leading economists. Balls avoided any criticism whatsoever of the Blair/Brown governments (of which, of course, he had been a prominent member). Labour bore much responsibility because it facilitated the orgy of financialization which did so much damage to the UK and US economies. The notorious Private Finance Initiatives (PFI) concealed some debt off the balance sheets. But this is a different proposition from claiming that state spending caused the crisis. Allowing this big lie to gain widespread credence was a decisive defeat for Labour before the campaign had even begun. For their part the Conservatives had also favored deregulation but, as Ralph had warned, Labour was not well-placed to point this out. A signature stance of New Labour in the approach to the 1997 election had been a promise to adhere to the Conservatives’ spending plans for the next two years. Ed Balls chose to repeat this assurance in 2012-15. Such a self-denying ordinance made nonsense of Labour’s claim to offer voters an urgent alternative. In Ed Miliband’s case the failure to take up the cudgels may have reflected a wish not to lecture the voters and appear academic. Would the general voting public understand a grownup discussion of economics? Would it be suicidal to attempt to explain the Keynesian argument? Miliband and Balls are not the only social democrats to decline the attempt. This was not true, however, of the “Bennite” left of which Corbyn was a part. In the 1980s, they put out an “Alternative Economic Strategy” (AES). Benn described it as a plan built around “saving jobs, a vigorous micro-investment program, import control, control of the banks and insurance companies, control of export, of capital, higher taxation of the rich, and Britain leaving the Common Market.” In 2015, however, the party that actually spoke about the need for a “long term economic plan” that would reflect the interests of “working people” was the Conservative Party. Flouting Labour’s caution, Cameron used factory meetings to inform employees that they deserved higher pay and that this would strengthen the recovery. No one on the Labour side responded to these provocations, beyond a lame claim that Labour had “a better plan.” History had repeated itself. Ralph Miliband had urged the Labour leadership of the mid-1980s that they lacked a connecting vision to bring coherence to the grab bag of promises and improvements which they put forward at election time. Nowadays these are called “retail offers” and they are tested out on focus groups and small-scale polls, with little awareness that context and narrative are essential to coherence and effectiveness. Ralph urged that each measure should be conceived as part of a long-term plan for a different society. To ask for such an approach today may seem like crying for the moon. Yet it was not long ago that an English filmmaker, Danny Boyle, was commissioned to present a historical panorama to be performed on the opening night of the 2012 Olympic games. The resulting panorama of popular struggles for the vote, social justice, universal free health care, access to education, technological progress, and nuclear disarmament won widespread acclaim and showed that it is still possible to imagine the peoples of the British Isles as protagonists of their own fate rather than as consumers of predigested tidbits of political pabulum.\nThe Corbyn Insurgency Ed Miliband failed to drive home this sort of vision. But his real significant achievement is the changes to the rules governing the Labour leadership elections and the opening it presented to Corbyn and the party’s left. The special voting rights given to MPs and the trade unions were abolished in favor of a new system known as One Member One Vote. The party’s supporters were invited to register as such, paying a three-pound fee and receiving the right to vote in the leadership election. Members of affiliated unions had to be in good standing but did not need an extra payment. The party reported that three hundred thousand new members and supporters had signed up by mid-August 2015, bringing the party’s total in all categories to over six hundred thousand. In order to register the supporters needed a credit or debit card, tied to the appropriate address. The opening stages of the Labour leadership contest appeared very narrow with no left-wing contender (candidates needed the support of thirty-five MPs to qualify). Friendly commentators described all the initial contenders as “Blairite.” However, at the last moment, Jeremy Corbyn announced that he had the necessary support to enter the contest. He had received the formal sponsorship of MPs who did not share his politics but believed that it would damage Labour to offer such a narrow choice. The contest was swiftly transformed as Corbyn garnered the most constituency sponsorships (161) and scored well in straw polls of potential voters. Corbyn was Tony Benn’s right-hand man in the 1980s and 1990s and had been chair of the Stop the War Coalition since 2002. Even opponents concede that he is likeable and modest. During his three decades in parliament he has voted against the Labour whips’ instructions five hundred times. At the time of the MPs’ expenses scandal a few years ago, Corbyn’s claims were the lowest of any member. He manages to combine the best of politics and anti-politics. Party members and supporters found Corbyn a breath of fresh air compared with the bland New Labour jargon of the other candidates. At hustings he spoke his mind and urged a rise in higher-rate income taxes, levies on wealth, the end of student tuition fees, nationalization of the railways, and opposition to military intervention in the Middle East. He spoke on these topics without the politician’s usual evasiveness. Commentators explained the surge of support for Corbyn by observing that Labour — almost moribund in 2010 — had been radicalized and rejuvenated during the Miliband years. Ed Miliband would be given some credit for this were it not for frustration at his excessive moderation. On the other hand, Corbyn’s opposition to Trident renewal expresses what Ralph Miliband called “nuclear pacifism.” It frees up large sums for social expenditure and offers a bridge to the Greens, the SNP, and even the Lib Dems. The arrangements for the leadership contest had been approved by all when first introduced, but as the polls began to point to an outright Corbyn win they were blamed for allowing alien “entryists” and political enemies to infiltrate the party and sway the vote. But Corbyn’s lead was so large — many tens of thousands of votes — that it was ridiculous to claim that tiny sectarian groups and hostile pranksters could have contrived it. Likewise the enrollment of new supporters and members was so large — over 250,000 of them — that at one point it overwhelmed the computers, but the insistence that applicants register with a valid bank card, and that voting slips were only sent to validated addresses, made fraudulent registration on any scale very unlikely. The real problem panicking the pundits was that the wrong candidate was winning and that this would destroy the Labour Party. Tony Blair, Alastair Campbell, Peter Mandelson, Polly Toynbee, Phillip Stephens, and David Runciman had their differences but all agreed on one point: that Labour’s most successful recruitment drive in its history was an utter disaster and the lunatics were taking over the asylum. The central doctrine of historic Labour was to vest all authority in the parliamentary party and to have the party’s membership defer to the PLP with its greater wisdom, experience, and proximity to government. The party leadership could always, or nearly always, rely on the trade union “block vote” to come to the leader’s aid whenever the constituencies got out of line. Tom Nairn memorably compared the trade union barons, casting a few million votes each, as similar to the land developers in Gogol’s Dead Souls who purchased the papers of serfs who had died and used these “dead souls” to claim more land prior to registering the serf’s death. Ralph Miliband explained in the opening sentence of Parliamentary Socialism, “Of political parties claiming socialism to be their aim, the Labour Party has always been one of the most dogmatic — not about socialism, but about the parliamentary system.” Britain’s parliamentary system is still embedded in pre-democratic institutions, notably the monarchy, Privy Council, and House of Lords, and undemocratic practices, such as first-past-the-post. Individual MPs swear allegiance to the Queen and not to a party with members who select leaders and policies. That said, the privileges of the PLP were clipped in the 1980s when, under Bennite pressure, an electoral college was set up for leadership elections with separate representation, roughly a third each, for MPs, trade unions, and constituencies. Under Blair the members had even less say, with the party’s conference degenerating into a simple rally. The One Member One Vote principle challenges all that. Corbyn is intent on giving real power to the constituencies and party conference. Whatever their failings, and they were many, the pre-New Labour party conferences still had life and debate. What is now needed is a veritable relaunch of the party, starting with a proper conference. Corbyn seems to realize this. It will, he hopes, help him to bring round recalcitrant MPs and help him to escape the imprisonment in his own shadow cabinet which doomed Miliband. Corbyn will seek to direct MPs’ fire at the Conservative government instead of their new leader. Corbyn has been tolerant at the outset but will need to assert his chosen strategic priorities. The constituency parties have the power to select and deselect candidates. Corbyn should be able to count on growing support in the National Executive of the party, as the new and younger members assert their presence and their desire for a new style of politics. Corbyn exemplified that new style when prior to his first appearance at the prime minister’s question time, he asked voters to send him questions they would like to see the prime minister answer. He then chose six, out of more than forty thousand received, based on their pungency and representative quality. Cameron realized that his usual mocking banter and point-scoring would backfire, and was forced to answer them seriously for once. Corbyn’s surprise victory and the preceding membership surge signals a new Labour left struggling to be born. While not stronger than past Lefts, it faces a disoriented and weakened center and right.\nRelics of Parliamentary Socialism However, the strength of the Right within the PLP has greatly constrained Corbyn, especially in the choice of his Shadow team. By appointing his close associate John McDonnell as shadow chancellor he retains a firm grip on economic policy. McDonnell is a former financial director to the Great London Council. In the press he’s said one of his hobbies is “fermenting the overthrow of capitalism.” However in many other shadow cabinet appointments Corbyn has been obliged to pick prominent supporters of the three candidates he beat, with Andy Burnham, the runner-up, becoming shadow home secretary. The strength of former New Labourites in the PLP and shadow cabinet remains the new leader’s most stubborn problem. Corbyn will be determined not to allow too much sway to these defining relics of “parliamentary socialism.” They have often been well to the right of the membership but the distance is greater than ever today. Many on the right of the PLP have made it clear that they do not accept the new leader and will work to overthrow him. But for the time being, the scale of Corbyn’s victory makes an open challenge unlikely. Indeed Corbyn could have been bolder in his choice of shadow foreign secretary by choosing Diane Abbott — someone much closer to his foreign policy stance — rather than Hillary Benn, the moderate son of Tony. Corbyn has a small but coherent leadership team built around former members of the Campaign group of MPs and former members of the London municipal administration. The Campaign group had only ten members prior to the leadership election, though its numbers seem to be growing. The new leadership and the new membership together could make Labour a hegemonic force in English politics, but only if it recognizes that the political landscape has changed and that the party must adjust to that fact. In different ways the Greens, the SNP, Plaid, and Sinn Fein have carved out their own territory and will not be going away. Ed Miliband failed because he allowed the Blairites to blackmail and threaten him and because he failed to articulate the crisis of the UK state. Corbyn has the chance to do much better. His new shadow chancellor is an ally in this regard. The Greens remain serious rivals but also potential partners. The Greens’ economic program does not use the word “socialist” but has a progressive and transitional character. They also avoid the word “capitalism,” which is a mistake since they thereby fail to identify the systemic forces at work in the economy. Green parties elsewhere in Europe have a very mixed record, with the realos serving as stooges of the extreme center. The English Greens have these discouraging examples to learn from. They also have a good opportunity to join forces with the trade union left, and the new Labour leadership, on Europe and austerity. Under a new leader the Liberal Democrats could also be drawn to support some progressive measures. Corbyn’s campaign set him several key tests. He will have to show that he can rally resistance to cuts to welfare, education, and health. The centrist candidates, under pressure from Corbyn, came up with one or two good ideas which should be considered on their merits. Andy Burnham has proposed that care for the elderly should be reorganized as part of the National Health Service, with everybody contributing and everyone benefitting. Of course ambitious ideas like this would need funding. Here the SNP has made a vital contribution with its proposal to end the Trident nuclear submarine program, potentially releasing £90 billion of future funds. Corbyn will have to take the lead in making the case against Trident. Though supplied by the US, the weapon’s complex equipment is officially and implausibly claimed to be independent. Possession of Trident has not prevented Putin’s encroachments, nor the advance of ISIS. The weapon appeals to the macho instincts of some British politicians and its scrapping is long overdue. But Hilary Benn, the shadow foreign secretary, is a supporter of Trident, as is Tom Watson, the deputy leaders, and a number of the trade unions, who are concerned about job loss (though Corbyn offers public contracts that would ease the problem). But there has not been an English debate on Trident so it will be up to Corbyn to initiate one. John McDonnell has pledged that, as chancellor, he will eliminate the deficit. In doing so he is not giving ground to the government but rather urging that a pro-growth strategy would not need cuts to bring down the deficit. But he is also interested in new taxes. A useful funding source could be Ed Miliband’s pre-election promise to take away the privileged exemption from stamp duty enjoyed by hedge funds and spread-betting outfits. Tory support for this privilege is muted because these unpopular financial lobbies are major donors to the Conservative party. A radicalized Labour opposition should be able to reach out to a broader common front against austerity, against the UK state’s democratic deficit at home, and against military action abroad. One of Corbyn’s central planks was a call for the re-nationalization of the railways, an idea that is endorsed by many commuters because of the relentless price gauging of the franchise operators, coupled with a poor record of investing in infrastructure. Polls show 70 percent back a return to public ownership. In August the BBC aired a television program on the British railways by Ian Hislop, editor of the Private Eye, a satirical journal. Hislop’s account of the malaise of a national institution under commercial ownership dwelt on rail’s importance to sustaining communities and its salience in English literature and history. Corbyn had expressed a readiness to reopen rail lines that have been closed. Corbyn’s Labour should be prepared to seek alliances with the Greens and SNP rather than treat them as rivals or enemies. They should also be prepared for a wider, democratic overhaul of the United Kingdom and support the idea of a Constitutional Convention to address electoral reform, further measures of devolution, and the future shape of the British Isles. This is possible because Jeremy Corbyn has a long history of campaigning for a diversity of progressive causes and is one of the least tribal of Labour politicians. The appearance of a new Labour left should signal an era in which Labour relearns how to fly (though, as noted below, there is reason to fear it is still tethered to parliamentarism). He is learning from one of Ed Miliband’s worst mistakes: ruling out in advance any agreement with the SNP. Corbyn’s support for cancellation of Trident, and his willingness to negotiate with the SNP over further democratization and to resistance to austerity, mean that his election as Labour Leader would represent a radical challenge to the UK state. Blair and Brown understand this but it was already too late when they woke up to the threat. The moderate mass of Labour MPs will complain but, with the new members breathing down their necks, are not yet in the mood to split. The trade unions which help to finance the party and individual MPs will urge loyalty to the new leader. Corbyn felt obliged to fill his shadow cabinet with prominent supporters of those he had just defeated and the consequence was seen in less than a week when Corbyn published an article in the Financial Times in which he backed British membership of the EU. The key sentence read: “Our Shadow Cabinet is clear that the answer to any damaging changes that Mr Cameron brings back from his renegotiation is not to leave the EU but to pledge to reverse the changes with a Labour government elected in 2020.” Even the threat of abstention was forsworn by this formula. Evidently Corbyn and McDonnell felt they had no choice but to tie their own hands without getting anything in return, except for that familiar excuse for a poor deal: party unity. They were surrendering to the last bastion of parliamentary socialism, long ago amended to parliamentary neoliberalism, but they were doing so because on this issue, the PLP, shadow cabinet, and affiliated trade unions all stand together. Whether the new membership knew and approved was hard to say since they were not asked, and Corbyn had not campaigned on EU membership. There was a flimsy escape clause. In the same issue of the FT a news item reported that Corbyn had assured his MPs that he had given no “blank check” to the prime minister, “hinting that he could support a Brexit if the PM watered down EU workers’ rights.” But with the same forces at work at some future turning point, the hinted-at might never come to pass. However if a public campaign against the EU gathers momentum — and some trade unions might back this — then Corbyn and McDonnell could change their stance, whether to an abstention or to a “no” vote. If Cameron overreaches himself or the recovery falters, popular support for British membership in the EU could sag. The Labour Party conference in late September saw Corbyn and McDonnell make strong and well-received appeals to the delegates. But the conference was in many ways a return to the past, with deals made in back rooms, delegates who had been chosen long before the election of the leader, much compositing of motions, and horse-trading in union votes. Corbyn asked for a debate on Trident renewal but the majority voted to postpone the debate and the decision. They had a point in that, outside Scotland, the issue had not been previously aired and few delegates had a mandate on the matter. But, so long as the new leader launches such a debate, the decision can be made next time. Indeed, by then, the party will need a new urgency, and welcoming spirit, if it is to hold the new members. Corbyn’s appeasement of the moderates does not reestablish the status quo ante or signal a return to Ed Miliband’s predicament. It simply shows that changing such a hide-bound hulk cannot happen overnight. The dramatic ascent of Corbyn was the outcome of a sea change of opinion reflecting the great crash, the Iraq deceit and defeat, the MPs’ expenses scandal, the austerity mantra, the marginalization of real politics in a consumerist culture, and much else besides. Corbyn has acted to challenge all that. It will be a long time before this momentous “de-subordination” evaporates. His moderation is not a Tsipras moment because Corbyn is not backing austerity or membership of the eurozone, or acceptance of Trident, nor is he reneging on a promise. But it is a powerful reminder that formal structures matter, that democratization has yet to transform the party, and that Ralph Miliband’s warnings still carry weight. While Corbyn’s critics are fixated on the supposed hostility of middle-class voters to his message we have the evidence of a You-gov poll which found that 62 percent of those who had voted for UKIP in 2015 thought that Corbyn would make the best leader of the Labour Party. The sample was of London voters, 46 percent of whom said they would support Corbyn on the first round, more support than the next two candidates put together. Corbyn’s anger at social injustice is likely to achieve resonance in a society plagued by galloping inequality and stunted by class barriers to personal fulfillment. Another poll reported in the Economist on August 29 found that support for Corbyn, impressive overall, was higher among new members and supporters, and higher among those who had joined in the Miliband years than with longstanding members. Here were signs that Corbyn was widening, not narrowing, Labour’s appeal. When the votes were counted Corbyn won 85 percent of the supporters’ ballots. Repeated standoffs between the new leader and the impatient right stem from the latter’s refusal to accept the result of the leadership election. The Right’s repeated attempts to ambush Corbyn on such issues as EU membership or Trident imply that he should either resign or carry out a reshuffle of the shadow cabinet. The membership would certainly not accept Corbyn going and few have any fondness for the parliamentary champions of moderation. Life for Corbyn will not be easy, but if he comes up with his own initiatives and counts on the goodwill that members feel towards him, his early problems are surmountable.", "url": "https://www.jacobinmag.com/2015/11/from-ed-miliband-to-jeremy-corbyn"}