{"authors": ["Nicole Gohlke", "Janine Wissler", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:53:14", "date_modify": "2020-05-04 19:53:14", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07__1588621994.html", "image_url": "https://images.jacobinmag.com/2015/07/17004801/CJLBbSLWEAEaW9J-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07__1588621994.html", "title": "Escaping the Euro Dream", "title_page": "Escaping the Euro Dream", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe following statement was published last week by Nicole Gohlke and Janine Wissler, two radical MPs in Germany’s Die Linke (The Left Party) associated with one of its far-left currents, Marx21. In it they criticize what they perceive as the party’s failure to entertain political possibilities outside of the eurozone, limiting itself to strategies of creating a “social Europe” within the confines of the European Union (EU). Instead, they argue for a widening of the strategic debate in Die Linke in light of Syriza’s defeat at the hands of the troika. Until now the debate within Die Linke around its stance toward the EU has largely been restricted by the party’s understandable desire to stand with and support the Syriza government, as well as a longstanding belief on large parts of the German left that any opposition to the EU runs the risk of backsliding into nationalist populism and is thus to be avoided. This refusal to entertain visions of a radical social transformation outside the bounds of the EU has necessarily limited Die Linke (and other important parts of the European left) to vague calls for a reformed, mildly social-democratic EU. Syriza’s experience with the troika has begun to prompt a rethinking of this stance. Though Gohlke and Wissler are by no means the only figures in the party calling for such a rethinking, this contribution represents one of the most prominent of the last weeks. The events of the past weeks in Athens and Brussels are prompting sharp strategic debates all across the continent, and Germany is no exception.\nThe Terms of the Debate On July 17 the parliamentary faction of the Left Party rejected the latest austerity program being pushed on Greece, with fifty-three MPs voting against and two abstaining. Die Linke‘s vote demonstrated a clear “oxi” to the blackmailing of the Greek government by Angela Merkel, Wolfgang Schäuble, and Sigmar Gabriel. Although that may seem unsurprising coming from a leftist formation, it represents in all honesty a redefinition of our position, given that in February of this year a large majority of our parliamentary fraction voted “yes” to the bailout extension, while a minority abstained and an even smaller minority voted “no.” Granted, the February vote was a different one, incomparable in terms of the gravity of the decision being put to a vote. The argument in favor of supporting Greece’s newly minted leftist government by giving them time to maneuver had to be taken particularly seriously at the time, despite the fact that the blackmail tactics and neoliberal demands of the European institutions were already plain to see. Unlike in February, Die Linke voted “oxi” this time because the German government had forced the most severe austerity package since 2010 onto the Greek government. Unfortunately, Alexis Tsipras and the majority of Syriza MPs saw no way out of this blackmail, and accepted the austerity package. This defeat represents an occasion to reflect, ask questions, and exercise some self-criticism. The capitulation of the first genuinely leftist government within the European Union since the outbreak of the economic crisis to the German government and the other European governments that follow Germany’s lead is ultimately our own defeat, and a defeat for the entire European left as well. We must take this moment to rethink the central strategic premises that have guided our politics these past months, i.e. our principled “yes” to the EU and our categorical “no” to leaving the eurozone. Doing so means rethinking our political strategy as a left party as a whole. As a party of the European Left, we are obligated to discuss this question with our comrades throughout the continent and in Greece in particular. We cannot abandon them in this difficult situation. It is of little use (and counterproductive) to denounce Syriza as traitors and declare their political demise. That is the job of our political opponents seeking to suffocate the political awakening happening in Greece. Equally as unhelpful, however, are knee-jerk reactions and blind, unquestioning loyalties. We should neither reject nor uncritically support everything the Syriza government has attempted to end the widespread and ongoing impoverishment of the Greek people. The sort of disdainful moralism that says we as Germans and “outsiders” have no right to develop an opinion or a critique of what is happening in Greece will not help us to learn any political lessons from the situation either. We owe both ourselves and our Greek comrades an honest and solidaristic debate about both the strategic successes as well as mistakes of the past months, especially if we wish to continue to fight together against austerity in Europe and prepare ourselves for coming European struggles. Thus it is crucial that we be confident enough to critically reflect on what has happened, to discuss Greece’s exit from the eurozone as a possible alternative, and attempt to understand what the current defeat and the massive “oxi” vote means.\nIn Bad Faith Since being elected, Alexis Tsipras was blackmailed by the rest of the European heads of state, to whom he ultimately capitulated. He admitted as much to the Greek Parliament. His defeat is not a personal failure, nor is it due to some sort of egotistical drive to retain power on his part. Nevertheless, the central premises of the Greek government’s political strategy — the non-negotiability of staying in the eurozone while simultaneously rejecting a politics of austerity — would not (and could not) have had any other result. Ultimately, this strategy gave the Greek government no choice but to submit to the diktat of Merkel and Schaeuble. We supported our Greek comrades in their strategy and had hoped that some sort of middle path could be found, but in retrospect we have to concede that no such middle path existed. Former Finance Minister Yanis Varoufakis recently published a telling account of the Eurogroup negotiations, in which he reveals that the suggestions of the Greek side were never really even taken seriously — doing so, after all, would have entailed a serious discussion about alternatives to austerity and the possibility of concessions from the Eurogroup. This means that, in reality, the closed-door “negotiations” in Brussels were not negotiations at all, but rather a series of meetings in which the Eurogroup repeatedly decided that the compromises Syriza was willing to make were still miles away from what the Eurogroup sought to squeeze out of the country. This dynamic culminated in Varoufakis — Greek minister of finance and official representative of an EU member state — being ejected and excluded from the Eurogroup meeting. His attempt to consult the Eurogroup’s bylaws subsequently revealed that the Eurogroup does not formally exist, and thus does not offer any rights or privileges to individual member states. And thus it was that the supposedly fair European rules of the game were shattered on the rocks of a Europe under German leadership. In light of these facts, we must accept that the Syriza government’s strategy that focused on negotiation and diplomatic dialogue has failed. Not even the charismatic personalities of Tsipras and Varoufakis, nor extensive expertise and deep negotiating tactics, were enough to win real influence or shift the balance of forces within the European institutions even slightly. The pledge to abstain from “unilateral actions” did not gain Syriza any extra time or breathing room. Rather, the negotiations proved that the European institutions are unfavorable and adverse terrain for the Left, and that a strategy of offering concessions to the other side in hopes of salvaging at least a modicum of humane social policies will fail. Merkel, Schäuble, and Gabriel were not interested in Greece alone: Greece was to serve as an example for the rest of Europe. The message that the defeat is intended to send is this: it does not matter how many general strikes are conducted, it does not matter if you elect a new government and the majority of the population votes “oxi” in a popular referendum. These things will not help you and will not change your country’s politics. That is the message that they want to use to demoralize the entire European left and stifle social protest across the continent. This demoralization and disappointment can only be countered if the European left conducts an open and self-critical debate about the lessons to be drawn from the current defeat.\nA Left-Wing Grexit Ultimately, Schäuble (in collusion with Sigmar Gabriel) threatened the Greek side with a forced Grexit from the Right. A Grexit “from the Right” would mean Greece leaving the euro unprepared, with the conditions for switching currencies, stabilizing an exchange rate, and restructuring the debt being negotiated with the EU from a position of profound weakness. Whether Schäuble and the conservative factions of European capital were seriously considering this option, or whether it was simply further political blackmail to force more concessions out of Syriza in light of the party’s lack of a strategic alternative, is difficult to say. Either way, the Left in Europe utterly failed to think through a Plan B in a serious manner. Thus, Greek’s left government was robbed of any possible alternative in its negotiations with the lenders. Not having a Plan B meant Syriza had only one option: remaining in the eurozone at all costs. Thus, the institutions could demand as much from the Greek government as they saw fit, because the only other possibility was the break which was to be avoided no matter what. What, then, could our Plan B look like? This undertaking strikes us a difficult one that poses more questions than it offers answers. Though there are many important contributions on the issue of a Plan B, particularly from the Greek left itself, there has yet to exist a detailed scenario for a left-wing Grexit. The relative attractiveness thereof is owed more than anything to the alternative to it: remaining in the eurozone would mean further austerity and immiseration, the de facto abandonment of democratic and parliamentary competencies, and a historic political test for Syriza as a party. Remaining in the eurozone has forced the Syriza government — at least for now — to switch tracks from being a bitter enemy of austerity to the executive organ of the troika dictatorship in Greece. A self-determined, left-wing Grexit is by no means a simple or an easy solution. The economic consequences thereof in particular remain highly controversial amongst left-wing economists and social scientists. At this point they appear to be more or less unpredictable. In the short term, a Grexit could mean a deepening of social fault lines, economic collapse, and further impoverishment of the Greek people. On the other hand, it could also mean opening up new spaces of political maneuvering and scopes of action: e.g., self-directed lending, national measures against capital flight, and increased taxes on the rich without first having to seek the troika’s approval. These options are at least worth exploring. Such a move would of course mean taking on an almost incalculable political risk for the parties involved. It would entail a leap into the unknown, accompanied by the fear of being held politically responsible for missteps and unexpected consequences that may arise from it. Our Greek comrades have nevertheless already demonstrated their willingness to think boldly and take risks. For example: in the heat of sharpening contradictions immediately before the referendum, Yanis Varoufakis suggested a raft of unilateral counter-measures to the prime minister’s cabinet as a reaction to the European Central Bank’s closing of Greek banks. His suggestions can be read as a first step towards a self-directed exit from the eurozone. He suggested: 1) printing Greek promissory notes or announcing the government’s intention to introduce a separate currency (still tied to the euro), 2) enacting a haircut on Greek bonds held by the ECB since 2012, and 3) taking control of the Greek central bank.\nWhat Do the People Want? In the left debate around the Grexit, there is usually a political argument in addition to the economic: the majority of Greeks want to remain in the eurozone, meaning that the Syriza government could only undertake a left-wing Grexit against the wishes of the majority. But is that really the case, or should we instead understand this moment as one of a contradictory dynamic within a scenario of polarized class conflict? It is undeniably the case that when asked if they would like to remain in the Eurozone — decoupled from the austerity program that remaining in the eurozone entails — a majority of Greeks respond with “yes.” But would the same be true if this question were posed with a clear focus on the link to austerity? The Greek people’s preference for what seems like the easier solution (i.e., remaining in the eurozone while ending austerity) is not necessarily incompatible with a readiness to accept the consequences of a Grexit should it prove necessary — particularly if breaking with austerity while remaining in the eurozone proves to be impossible. This is precisely what the 61 percent of Greeks who voted “oxi” in the referendum on the July 5 expressed. Although Alexis Tsipras sought to emphasize that the referendum was not primarily a vote on the question of Greece’s preferred currency, for most Greeks it was clear that they were making a choice between remaining in the eurozone (and thereby continuing austerity) on the one hand, and a clear rejection of the offer made by the “institutions” (and thus the possibility of a Grexit) on the other. The Greek media sought to project just such a mood and stylize the referendum in this way. Panic and alarm about shuttered banks, images of long lines in front of (nearly) empty ATMs, a collapse of public life — the media established a doomsday scenario as the backdrop to the referendum in Greece, which the Eurogroup in turn used as a threat. The message that emerges from 61 percent of the population voting “oxi” in the referendum is amplified by the very real relation between social position and voting behavior: the financially disadvantaged and socially marginalized voted against the deal in huge majorities. The referendum thus seems to indicate that remaining in the eurozone unconditionally is not necessarily a goal shared by the majority of the population, but is rather a project of the ruling and propertied classes of Greece.\nA Common Defeat The referendum also demonstrated how the brave actions of our comrades and the initiative to launch the referendum could lead to an enormous re-politicization of Greek society and renewal of the social movements. Many felt this possibility when Gregor Gysi and representatives of the Blockupy coalition spoke in front of tens of thousands at the closing rally at Syntagma Square. The mobilization around the referendum and the very overwhelming “oxi” vote indicate that there is most certainly an enormous desire for political alternatives and a Plan B within Greece itself. Our comrades in the government had five months to convince a majority of the population of the utility of a Plan B. We had five months to demonstrate to the Greek people that we were doing everything possible to fulfill our electoral promise of ending austerity while remaining in the euro. But having a Plan B also means establishing red lines that we are unwilling to cross. It also means that — should an end to austerity inside the eurozone have proved impossible — then a real and plausible alternative to capitulation had to exist. At the same time it would have been necessary, perhaps along the lines of Varoufakis’s suggestions, to begin making serious preparations for the worst-case scenario, i.e. preparing to issue promissory notes, to print a new national currency, to nationalize the banks, and to introduce capital controls. Whether or not our comrades in Syriza could have won over a majority of the population to an exit from the eurozone in the case of a final breakdown of negotiations is of course difficult to say. The lack of a strategic alternative to remaining in the eurozone, however, not only weakened our negotiating position, but was also disorienting for people looking to the new government for hope and inspiration both in and outside of Greece. The responsibility for the mistake of not preparing a Plan B and not fighting to win over majorities in favor of such a strategy is not that of Syriza alone — it is the responsibility of the entire European left. We all owe it to ourselves to reflect critically on the fact that we neglected to utilize or even entertain the thought of utilizing our last remaining strategic resource: a break with the institutions and the eurozone, thereby developing the scenario of a left-wing Grexit. Thus we have neither reason nor justification to act as if we had known better than our Greek comrades. No one can claim that we would have performed better or more intelligently than they did. In fact, illusions about the space for maneuver and scope for reform within the EU are probably even more widespread on the German left than they are in Greece. These sorts of illusions were consistently nourished by our own party in the last European elections, while some currents went so far as to claim that principled left-wing criticism of the EU and its institutions was impossible. In light of this mistake, we must engage in thoroughgoing self-reflection and self-criticism. For our common defeat suggests that truly left politics in Europe can from now on only be oriented against the institutions of the EU. It follows that, for a socialist government in the European periphery, left politics may only be possible outside of the straightjacket of the Eurogroup altogether.\nShattering the EU Illusion So what questions have to be reevaluated in the EU debate? In Germany, a major reason why Die Linke often finds it difficult to criticize the EU as an imperialist project is because it is portrayed as a historical lesson learned after the second World War. As the story goes, the once warring great powers of Europe joined together in a new geopolitical alliance which would make future armed conflict on the continent a thing of the past. Philosophers such as Jürgen Habermas take this point of departure to praise the EU as a post-national construct and an alternative to the European nation-state. But even though the EU has greatly transformed the political relations between its constituent member states, economic competition between said states has not been lessened by this transformation whatsoever. Indeed: the negotiations around Greece’s latest bailout extension make them easy for all to see. That the EU introduced a common currency but not a common wage, social, or budgetary policy is not a mistake or an accident, nor is it a temporary condition of an as-yet-unfinished European Union. The construction of the euro and Germany’s aggressive export strategy are harmful to economically weaker countries like Greece, particularly since the various states do not share a common or coordinated economic policy. Instead of constraining the power of the German economy and political establishment, the EU simply provides it with a post-national alibi. It is now clear that from now on “German” is to be spoken in Europe, as Volker Kauder gleefully declared a few months ago. Given this state of affairs, we must determine to what extent an EU-wide “reboot” of the European project constitutes a useful demand for class struggle in Europe. The consequences of EU policies are very different depending on whether we are talking about Germany or Greece, Great Britain or Portugal. A state-driven reconfiguration of European social policy would require a synchronized political shift in nearly all twenty-eight member states. Even then, major corporations and financial markets would still serve as powerful opponents of any possible social reform. We do not believe that concrete solidarity between the peoples of Europe is possible by making positive reference to an EU that is imagined and enacted by national governments as a common currency area and economic zone. The various struggles against austerity and for improved living conditions across Europe (which admittedly are yet to be united in common cause) appear to us as much more promising prospects. Not to be ignored is the concrete struggle against old and new forms of fascism and racism; this means fighting Pegida in Germany, the National Front in France, and Golden Dawn in Greece. It is time to make the policies and politics of the EU the subject of the real social struggles existing in the various member states, rather than continuing to speak of a “social EU” for which we will be unable to build a social movement in the foreseeable future. Our politics must contribute to establishing, expanding and deepening pan-European networks of solidarity between political actors and activists in European, national, regional, and local movements. Following Greece’s subjugation under the diktat of the institutions, it is both unlikely as well as inappropriate to expect that our comrades in the European Left will continue to view the EU or the euro in a positive light, as membership in the eurozone has revealed itself to be an instrument for the implementation and enforcement of austerity policies.", "url": "https://www.jacobinmag.com/2015/07/germany-greece-austerity-grexit/"}