{"authors": ["Eleni Eleftherios", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:12", "date_modify": "2020-05-04 19:53:12", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07__1588621992.html", "image_url": "https://images.jacobinmag.com/2015/07/17004540/greece-beggar-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07__1588621992.html", "title": "Life Under Austerity", "title_page": "Life Under Austerity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "EE\nIn the past few years, Greek people, especially young people, and workers, tried to have a low profile in order to keep their jobs and a salary, even if it’s €500 with no insurance. People need to start to think about their future and their children’s future. To think about reclaiming your rights from your boss. Asserting your rights to your boss is your duty.\nAll of us need to do this if we want our children to have a decent life, not to make €1 an hour, or 100 drachmas an hour, depending on what happens. This is something that has to do with all of us. I’m not talking about political parties, I’m talking about using the strength and the power that workers have to reclaim control over their lives and communities with collective action.\nI am a member of the Union of Waiters and Cooks of Thessaloniki. It’s a union for all workers in food service. Many people ask us, I’m not a waiter, I work with souvlaki, like me. Anyone who works in a place that has to do with food can join. Its a legally registered union, but different from the other bureaucratic unions because we don’t have different political parties active inside the union, and we are not aligned to any political party.\nWe are all workers, we have all the same problems, we have no executives who decide for us, we make all our decisions in our assembly. We have two assemblies per month that all members attend. We have an elected board of five, but we elect people to the board of the union only if someone is being threatened by their boss, because there is a law in Greece that you can’t fire a union officer. Of course, you have power not just because of the law, but because the boss knows that if they mess with you, they will have people outside their shop protesting.\nI told my coworkers after two years that I am a member of this union, and it got back to the boss. They started to be more polite to me, to smile at me more, they don’t even think about trying not to pay us, like bosses do in other shops have done this week, using the referendum as an excuse.\nBefore the crisis, “syndicalism,” “union,” these words terrified people. They thought this means you are just a member of a corrupt political party, that you get paid by the party and do nothing in your job, that you were somehow with the bosses and not with the workers — it’s hard to convince the workers to join an organization like that. But this kind of union I am a member of — a base union — has become more well known in the last few years of the crisis. Workers are building base unions in food service in Athens, Ioannina, and other cities.\nI’ve stopped using the words “labor movement and “working class,” because I don’t want to speak for workers like they are an undifferentiated mass. Every worker is different. But in the last few years in the crisis, you can see that society has become polarized. You see more workers demanding stuff.\nIf a business is not going well, and you have a family to raise, but the boss says they don’t have any money, you have to choose: do you care more about your boss’s business, or your family? It’s an easy decision. You have to feed your family, and that means you have to struggle like we are doing in the Union of Waiters and Cooks.", "url": "https://www.jacobinmag.com/2015/07/tsipras-syriza-referendum-debt-euro/"}