{"authors": ["Trish Kahle", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:34", "date_modify": "2020-05-04 19:52:34", "date_publish": "2015-04-17 00:00:00", "description": null, "filename": "2013_10__1588621954.html", "image_url": "https://images.jacobinmag.com/2015/04/17003530/11241951505_0886cc8420_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_10__1588621954.html", "title": "Betting on Militancy", "title_page": "Betting on Militancy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nStruggling through a frigid March rain earlier this year, rounding up carts in the parking lot of the Chicago Whole Foods where I work, one of my bosses stood at the door. “That weather really sucks,” he said offhandedly. I nodded tersely. “But, hey,” he continued, chuckling. “What are you going to do? Go on strike?” It made sense that he found the idea of us striking absurd — strikes are at an all-time low, nearly nonexistent in shops like mine, and almost none of my coworkers have ever been in a union. But a month later, we did. Ten Whole Foods workers walked off the job to protest a draconian attendance policy and poverty wages, along with two hundred fast food and retail workers across the city and thousands across the country. Low-wage fast food and retail workers took center stage for the American labor movement this summer. The Fight for 15 (FF15) campaign went public last November, then erupted earlier this spring, as workers walked off the job in New York, then Chicago, then St Louis, Milwaukee, Detroit, and Seattle. Seven cities organized a second week of one-day strikes at the end of July. Then, on August 29, sixty-two cities and more than one thousand workers struck around two principal demands: $15 an hour minimum wage and the right to form a union without retaliation. We are part of a new generation of workers rediscovering our strongest weapons: the union and the strike. In the age of austerity, we stood up. And we’ve done so with the backing of a union that many on the Left have (rightly) skewered in the past for its close collaboration with capital. Despite a recent history of eschewing confrontation, the Service Employees International Union (SEIU) has helped kick-start what could be a wave of militancy among twenty-first century low-wage workers — a wave that, should it continue to spread, may go beyond anyone’s expectations.\nMany of us never thought we’d be stuck in low-wage work. Growing up, I was told that if I went to college and got a degree, I’d have a better standard of living than I’d grown up with. I went to college on a scholarship, paying my living expenses by working on farms across Western North Carolina. I graduated as the recession hit, without prospects for a living wage job or industry connections. After scouring the region for work, I landed a job as a veterinary technician. Despite being a so-called “skilled” job, I only received twenty-five hours a week and $8.50 an hour. I was laid off less than six months later. For nearly a year, the only work I could find was as a temp landscaper, working for $10 an hour with no guaranteed hours, no provided safety equipment, and regular wage theft. I applied to every retail and fast food company in the area; to the post office and UPS, where I didn’t even get called back for holiday temp work. I was desperate — and not alone. When Whole Foods opened its new store in Greensboro, it hired for one hundred open positions. More than three thousand people submitted applications — a number the regional management kept bringing up during employee orientation. The clear message: we should consider ourselves lucky to have jobs. The two years after I graduated college were a slap in the face. Increasingly, it became clear I was not going to get a good job. Every hiring director told me I was overqualified because I had a degree or underqualified because I only had one. When I graduated, I had considered becoming a letter carrier. Instead, I went back to school to get a PhD. Academic jobs might be disappearing just like public sector jobs, but at least writing a dissertation would buy me some time. But even after I enrolled in a graduate program at one of the world’s elite research universities, I struggled to get by. Now in my second year, I work at Whole Foods in addition to two research assistantships in my department and pick up shifts as a mover for the social sciences division. No matter how many hours I work, stable employment and livable wages seem to remain out of my grasp. By itself, my situation might be easy to write off — an unlucky anomaly. But my story is common among American youth. Some refer to my generation as “millenials,” but I think the “Left Behind” generation would be more accurate: the best educated generation in global history, a generation saddled with crushing student debt, little to no access to living wage employment, and little prospect of anything better coming along. And, of course, it’s not only childless twenty- and thirty-somethings employed in jobs like mine. Many of my co-workers have children or other dependents they care for. If surviving on low wages is extremely difficult for the childless, it is nearly impossible for my co-workers with children, especially single mothers — many of whom are coping with simultaneous cuts in social programs like food stamps, Medicaid, Social Security, and education. Some of my other union brothers and sisters have worked in fast food and retail as long as I’ve been alive. One McDonald’s employee, a member of the union, has worked for the company for twenty-seven years; after a generation of work, he makes less than $9 an hour. He will never be able to retire. With poverty wages, regular sexual harassment and racism on the job, and no sense of workplace rights or job security, the risks of organizing looked increasingly worth it.\nAtrocious working conditions and bleak prospects for breaking out of the industry help explain why FF15 has grown so quickly, but there’s a crucial third reason: the re-entry of struggle into the popular imagination. December 2010 to November 2011 was filled with flashpoints of resistance for the Left Behind generation: overseas, there were tuition hike student protests in Britain, revolutions in Tunisia and Egypt; at home, the backlash against Gov. Scott Walker in Wisconsin, and Occupy soon after. Thousands of mostly young people were rising up against inequality, and a radicalization among the American population, concentrated in youth, was spreading in fits and starts. But outrage against economic and social inequality had yet to find expression in the workplace. In September 2012, the Chicago Teachers Union gave us a strong example. FF15 workers in Chicago, who seven months later would walk off the job by the hundreds, were watching the teachers. We saw them demand not only fair compensation, but better working conditions. We saw them confront Chicago’s vicious racism, embodied in the city’s apartheid education system. And we saw them do it themselves: organizing their workplaces, democratically debating strike tactics and their contract. We saw the power of solidarity as parents refused to send their children across teachers’ picket lines. As teachers swarmed downtown the first day of the strike, we saw them standing up for all working people. Months later, when the CTU gets mentioned in our organizing meetings, workers break out into applause. After the CTU strike, people were ready to organize. But, especially in the early stages of the campaign, we couldn’t organize alone. For most of us, the concept of taking collective action was terrifying. We didn’t have a long tradition of union militancy in our workplaces or families to draw upon. And of course, there was a very real chance that we would be fired, as are thousands of American workers every year who try to organize unions. Organized labor and its observers knew our industry represented a huge base of potential new membership, but even as union membership has declined in recent decades — now standing at its lowest in a century — existing unions failed to mount organizing drives directed at fast food or retail on a national scale. SEIU led the way. In Chicago, FF15 has been supported by SEIU locals and other community groups committed to worker justice. Rather than focusing on a single store, or a particular chain, the FF15 has taken a more inclusive citywide approach, organizing all fast food and retail workers into a single union. Had the campaign been run shop by shop, it would have been to easy for the bosses to isolate us. Citywide organization has produced tangible results. After striking on April 24, campaign organizers in Chicago asked if any workers wanted to get on a bus and drive five hours to St. Louis or Milwaukee to support workers striking the next week. Hands shot up. A few people lamented that they were scheduled to work that day. In the front of the room, a middle-aged African-American McDonald’s worker stood up. “Let’s go on strike again,” he said. “Then we can all go.” At the next meeting, a woman stood up and told us how her boss had subjected her to anti-immigrant slurs, and was threatening to fire her after she missed work while hospitalized. An organizer asked if anyone was willing to form a walk-back committee to escort her back to work to ensure her boss didn’t fire her. “We only need a couple of people,” he finished. But almost fifteen hands shot up. Everyone wanted to stand with their union sister. In my store, when I faced disciplinary action for violating the attendance policy we had been organizing against, I demanded union representation in my disciplinary meeting and my co-workers prepared to take action if they decided to try and fire me. Management backed off. The disciplinary meeting never even took place. When a Whole Foods worker from another location was suspended after striking (for an incident that had taken place two weeks before the strike without incurring discipline) we began organizing openly to defend her job, and she was reinstated with full back-pay.\nThe small taste of victories won through struggle has transformed how people perceive themselves and their power at work. It’s changed our relationships with co-workers, and solidified our confidence that much more is possible. But some left and union activists have raised concerns about the movement’s potential and the limitations of its strategy — perhaps most notably about SEIU’s history of settling concessionary contracts, cutting deals with employers that short workers, and most recently, in the health care wars in California. Others are concerned the workers aren’t in control. Still others worry FF15 isn’t a real organizing drive, but a PR campaign. SEIU’s commitment and involvement in this campaign have been indispensable in terms of the organizing resources provided, the legal protection and services we otherwise would not have access to, and the direct connection to the broader labor movement and community organizations. For all of SEIU’s past flaws — which are very real and need to be reckoned with — they deserve credit for taking up bold organizing campaigns while too many other unions are on the retreat, or are playing dead while being battered by “right to work” laws and other anti-union campaigns and legislation. SEIU leadership is calling for the continued and escalated use of strikes, occupation, and direct action as means to resolving worker grievances. They are encouraging workers to organize on the shop floor. They are confronting issues of racism and sexual harassment in the workplace. This is an unquestionably good thing, and could help revitalize and transform the labor movement. Certainly, there is a PR aspect of the movement, but to write off the campaign because of this is too cynical. The aggressive media campaign has spread the campaign to places where staff organizers have never set foot, including rural areas and the South. And the media campaign has made our struggle, and the struggles of many workers throughout the country, well-known in the mainstream. The “PR campaign” does not operate alone, but alongside a real project of movement building. Is this a worker-run campaign that workers have conceptualized and carried out entirely by themselves? Not yet. But workers are being transformed into union leaders for the first time by participating in this movement. SEIU has opened up space in the context of five years of economic crisis. That space may have possibilities far beyond what organizers and even workers ourselves have imagined. The campaign cannot necessarily be contained or molded by the union that initiated it. The FF15 is social movement unionism in embryo; it has the potential to clarify the questions about class struggle raised by Occupy. It can help re-link workplace struggles to communities. It can push for increased power for workers on the shop floor, but it can also demand that government institutions institute stronger protections for unions and all workers. Radicals are in a position to shape this movement by rebuilding the tradition of radical unionism. We can, and already have, played important roles in shaping the campaign on the ground — in Chicago, for example, we helped initiate a women’s caucus, and designed and led worker-run trainings on organizing basics and fighting retaliation from bosses. The Left needs to move beyond conceptualizing workers’ institutions like SEIU as monoliths incapable of change. It’s difficult to change them, but not impossible. Anger over the betrayals of business unionism and bureaucracy should not trick us into seeing unions as completely and irreparably divorced from the membership. Rather, it should make all the more clear the need to organize new workers and rebuild unions from the bottom up.", "url": "https://www.jacobinmag.com/2013/10/beyond-fast-food-strikes/"}