{"authors": ["Michael Billeaux", "Eleni Schirmer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic"], "date_download": "2020-05-04 19:56:16", "date_modify": "2020-05-04 19:56:16", "date_publish": "2015-03-17 00:00:00", "description": null, "filename": "2015_03__1588622176.html", "image_url": "https://images.jacobinmag.com/2015/03/17003048/MadisonProtest-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_03__1588622176.html", "title": "What’s Next After “Right to Work”?", "title_page": "What’s Next After “Right to Work”?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In 2011, Wisconsin Gov. Scott Walker introduced the innocuously named “Budget Repair Bill.” The sweeping legislation contained both fiscal measures — reduced support for public education, state Medicaid programs, and regulatory agencies, as well as lower property and capital taxes — and a labor law amendment that all but outlawed collective bargaining for public sector employees and created new barriers to union organizing.\nAfter decades of neoliberal advance and the emergence of the Tea Party, none of this — even in a state with a progressive history — was especially surprising. But this time it sparked dogged resistance: a two-and-a-half-week occupation of the State Capitol, demonstrations topping one hundred thousand people, and “sick out” work stoppages by teachers across the state.\nWhen the capitol was cleared, however, the mobilization that began with the demand to “kill the bill” was funneled into the effort to electorally oust Walker. In the 2012 recall, in a replay of the 2010 gubernatorial election, Milwaukee Mayor Tom Barrett lost to Walker — by an even greater margin than before.\nThe second phase of Walker’s anti-worker campaign began a few weeks ago, nearly four years after the introduction of the “Budget Repair Bill.” In early February, the governor issued a nearly two-thousand-page budget proposal that includes deepened cuts (most notably an unprecedented $300 million reduction in public higher education funding), laxer regulation of private schools and public charters, and lower tax rates for large property owners.\nThen just last week, the legislature fast-tracked “right to work” (RTW) legislation. RTW forbids contracts between unions and employers that require workers to pay “fair share” dues or agency fees for union representation. Such arrangements reduce the free-rider problem because the benefits won by a union are distributed to all employees irrespective — per federal law — of any individual’s decision to join the union.\nAfter RTW is enacted, more workers tend to opt out of paying dues — because, the rationale goes, why pay for something when you can get it for free? — and the union becomes less able to defend and advance workers’ interests. In the long run, this depresses wages, benefits, and working conditions.\nAct 10, Wisconsin’s 2011 measure that curtailed collective-bargaining rights for public sector workers, implemented RTW-style legislation for public employees. Now the state is targeting all workers.\nThe speed of the attack has disoriented many. Whereas a few weeks ago liberals and leftists — and even some portions of the moderate right — were focused on defeating the budget cuts, they have been forced to rapidly respond to RTW. Organizations like the Teaching Assistants’ Association have their attention and energy split.\nThe frenetic timeline, the layered assaults on public institutions, the sneaky legislative procedures, and the utter disregard for public testimony or democratic input trigger flashbacks to 2011.\nIndeed, the unavoidable similarities between 2011 and the present moment have many on the Wisconsin left demoralized. The cumulative failures of the 2011 uprising, the 2012 recall attempts, and the 2014 reelection of Walker weigh heavily, draining energy and strategy for renewed mobilization. If one hundred thousand protesters at the capitol in 2011 only led to an even more emboldened Walker and deeply conservative legislature, what can we do this time around?\nThe past few weeks have seen some mobilization, and the budget hearings over the coming weeks will likely generate more resistance. However, compared to 2011, the activity has been modest, contained, and tinged with despair.\nThe response to the budget cuts has been mostly limited to the University of Wisconsin campuses, and demonstrations opposing RTW have not succeeded in delaying the legislation. Indeed, the bill passed the Wisconsin Senate on February 25, the day after being submitted to committee. With the state assembly starting final debate today, it could become law as early as this week.\nWhereas passage of the 2011 legislature required Democratic votes to achieve quorum, Republican lawmakers ushered the RTW bill through without financial provisions, bypassing quorum and eliminating the possibility of Democratic legislators deploying the stall tactics that garnered them near-celebrity status in 2011.\nBut assuming nothing can be done to respond to Walker’s latest moves is wrongheaded. This position reflects a narrowing of the political imagination common in the neoliberal era. It envisions politics as the realm of officials and electoral campaigns, a stunted conception that results from the near elimination of other effective actions like workplace organizing and strikes.\nThis has produced the first misconception leftists must reject: the popular belief that we find ourselves facing Walker’s second offensive because the 2012 recall efforts failed. Rather, the real moment of defeat came with the decision to redeploy the 2011 movement’s energy into the recall.\nThe recall strategy was a conscious choice by the movement’s leadership rather than a decision straightforwardly determined by conditions on the ground. The official labor leadership and Democratic Party–affiliated organizations largely forced this choice by adopting a “settle-at-any-cost” strategy instead of encouraging the rank-and-file mobilization that had emerged. In addition, this framing generated a flimsy political litmus test (pro-Walker or anti-Walker) that created a low bar for Democratic candidates and limited the amount of serious political content being debated.\nThe goal dropped to removing Walker, rather than stopping or slowing the austerity agenda (or these were treated as synonymous). Indeed, no candidate even verbally committed to returning to the 2010 status quo (hardly a year remembered for its great socialist triumphs), and Barrett himself ran an austerity program in Milwaukee and openly agreed with the fiscal aspects of Walker’s proposal.\nThe second miscalculation that plagues Wisconsin leftists today is an undue shortening of the time horizon, which can give rise to both defeatism — declaring there is nothing to be done — and adventurism — insisting on immediate, high-risk actions. This truncation obscures the long, slow, and crucial work of organizing and movement-building.\nThe prevailing belief posits that the only victories worth mobilizing for are either immediate legislative wins — e.g., the defeat of the proposed budget cuts or RTW bill — or an electoral reconfiguration, such as a midterm or recall election (the first recall petitions circulated within days of the 2011 proposal).\nA sober assessment of the current political landscape suggests both of these are unlikely at best, and probably altogether off the table. RTW will breeze through the Wisconsin Assembly, and the Republican-dominated legislature will likely offer minimal revisions to the proposed budget cuts.\nThere is little energy to sustain either gubernatorial or legislative recalls, especially after the political debates in 2012 fizzled into a distracting sidebar about the legitimacy of the recall procedure itself rather than the political issues at hand. Impatience can also lead to hasty calls for a general strike, without investing the time and work required to build movements strong enough to support one.\nThe final miscalculation reinforces a cognitive map of the social world that parcels the working class into separate categories concerned with separate issues. For example, the protests in 2011 were considered a “union issue” rather than a “student issue” or “black issue,” which rendered these groups and the legislative impacts on them less visible. This invisibility eliminates political agency and forces undue isolation on those most affected.\nRather than seeing ourselves as embedded in a community of shared fate and struggle, we view ourselves as disconnected or at odds with each other. This severely limits our collective capacity to create a new form of politics, primarily because we fail to see each other, much less unite and mobilize for our mutual struggles.\nThough the 2011 Wisconsin Uprising faced immediate setbacks, it did provide an opportunity for activists in often-unconnected movements to learn to stand alongside each other. Likewise, while our immediate prospects may be dim, the way we mobilize now — even if we fail to stop the austerity budget or RTW — can lay the groundwork for future victories.\nIn 2011, connections were formed between rank-and-file union members, racial justice advocates, student organizations, native rights organizations, and environmental groups. The union bureaucracy clearly led the mobilization, with other social justice organizations — especially the racial justice organizations — relegated to the margins.\nThis time around, the character of the mobilization has begun to shift. Having ruled out the possibility of electoral victories or short-term solutions, many on the Left have begun to look more deeply at issues like racial justice and how they relate to the battle against austerity.\nThe Young Gifted and Black Coalition (YGB) — the core of the Black Lives Matter movement in Madison — has become one of the central organizations mobilizing against Walker’s new budget. Making the connection between the black freedom struggle and fiscal policy, the YGB’s primary focus has been opposing the $8 million jail expansion in Madison’s Dane County. These connections are crucial in Wisconsin, where, for instance, expenditures on corrections surpassed those on higher education in 2011, and where racial disparities are some of the worst in the country.\nThere is no denying that workers and students have suffered a series of defeats in the past four years. And there’s no denying that our forces were weakened in 2011, with public sector unions losing some two-thirds of their membership after Act 10 took effect. This will get even worse soon, with Wisconsin likely becoming the twenty-fifth RTW state in the country.\nBut while the Left seems to be failing, our task, in this moment, is to learn to “fail better” and build stronger movements in the future.", "url": "https://www.jacobinmag.com/2015/03/scott-walker-right-to-work/"}