{"authors": ["Adam Gaffney", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:13", "date_modify": "2020-05-04 19:56:13", "date_publish": "2015-06-17 00:00:00", "description": null, "filename": "2015_06__1588622173.html", "image_url": "https://images.jacobinmag.com/2015/06/17004313/ACAsigning-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_06__1588622173.html", "title": "From Exchange to Egalité", "title_page": "From Exchange to Egalité", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Yet such an acknowledgement must not mean turning a blind eye to the deep structural inadequacies of our health care system, which will persevere — whatever the decision of the Supreme Court — until more fundamental change is won.\nWith both Bastille Day and a decision in King v. Burwell — the case now before the Supreme Court that may threaten the viability of the Affordable Care Act (ACA) — soon to be upon us, this episode seems reasonably relevant. The Affordable Care Act isn’t — and is never going to be — adequate for delivering health care justice. At the same time, the sudden withdrawal of private health insurance from millions of Americans would be a human travesty that no sensible left should countenance, much less celebrate.\nAlas, as Rosen and others have noted, they also violently undercut the inadequate but at least functional system of church-based charitable care — before their own sweeping projects ever came close to fruition. Good intentions were insufficient, and it was the poor and ill who suffered the consequences.\nThough admittedly not its most emblematic feature, one rather remarkable aspect of the French Revolution was its ambitious orientation towards the provision of social welfare, including medical care . Following a period of great deprivation , the French revolutionaries “endeavored to set up a national system of social assistance, inclusive of health care,” as the great historian of medicine George Rosen wrote ; they furthermore “called attention to the need for assistance, inclusive of medical care, in neglected areas and for neglected groups in the population.”\nA Vulnerable System\nThere are many roads to what is called, often problematically, “universal health care.” Some nations — for instance, Canada — have systems of national health insurance in which a governmental “payer” insures everyone (though the provision of care may remain predominantly private). Other nations have “national health services” — e.g., Britain — where the provision of care is a direct public service.\nThe health care reforms embodied in the ACA are neither of these: the law instead contains a number of intricate, interlocking provisions designed to lower the number of uninsured while preserving the role of private insurers (and also accommodating, not infrequently, the for-profit provision of care).\nUnderstanding the complicated interdependency of the ACA’s insurance reforms is crucial to appreciating its fundamental vulnerability to legal challenges. This interdependency is frequently conceived as a precarious “three-legged stool”: a well-aimed kick delivered to any single leg, it is argued, would topple the law in its entirety.\nThe first “leg” is the ACA’s provision preventing insurance companies from discriminating against those with “pre-existing” conditions (for instance, through the imposition of punishingly high premiums). This particularly popular provision most easily accords with a sense of common decency.\nThe second leg of the stool is the “individual mandate,” a concept with its genesis, as is frequently noted, in the conservative Heritage Foundation. The mandate requires that the uninsured buy private health insurance or pay a penalty, so as to prevent “free riders” from taking advantage of the protections afforded by the first leg (for example, by postponing the purchase of insurance until one is in the throes of a terrible illness). In 2012, this leg came close to being severed in the Supreme Court case National Federation of Independent Business v. Sebelius, but emerged with its constitutionality intact by a single vote.\nAnd third, given that it would be rather cruel to mandate the purchase of health insurance for people who cannot physically afford it, the law provides income-adjusted subsidies for those who buy plans on the ACA’s “exchanges.” It is this leg that is now under threat in King v. Burwell.\nThe legal basis for the suit revolves around what seems to be sloppy wording in one provision of the law. Sarah Kliff of Vox traces the origins of the case back to a 2010 presentation at a conference hosted by the conservative American Enterprise Institute and “aimed at finding new ways to challenge the healthcare law.”\nThe presentation, Kliff writes, pointed out one eyebrow-raising finding: a single provision of the ACA referred to subsidies being available to those who purchased insurance in exchanges “established by the state.” However, most states — thirty-four at present — have elected not to set up their own exchanges, and to instead rely on the federal government’s exchange (which the law permits).\nIf the Court finds that residents of those thirty-four states are not eligible for federal subsidies, it could deliver a potentially fatal blow to Obamacare: those who purchased plans in these states would quickly lose the subsidies that made buying health insurance affordable.\nHowever, many legal scholars, interpreting the provision more contextually, are highly suspicious of the merits of this case. For instance, though the law professor Timothy Jost, writing in the New England Journal of Medicine , acknowledges that the provision is “awkwardly worded,” he opines that nonetheless:\nThe purpose of the statute is clear, however, and there is no evidence, other than the four words on which these cases turn, that Congress meant to deny millions of Americans health insurance simply because their states elected not to operate exchanges.\nThough that may be true, the health care access of these millions now very much hinges on the Supreme Court’s interpretation of the clause.\nAs things stand, individuals and families earning up to 400% of the federal poverty level are eligible for premium subsidies; in the thirty-four states using the federal exchange, about 6.4 million people (or 87% of those buying insurance on the exchange) would be at risk of losing these subsidies.\nAccording to the Kaiser Family Foundation, the loss of these subsidies would translate into an average premium increase for these individuals and families of 287% (ranging from a 132% increase in Arizona to a whopping 650% increase in Mississippi).\nFurthermore, those who were sick would try harder and sacrifice more to stay in the exchanges than those who were well, which would further destabilize the actuarial basis for the marketplace. According to modeling by the RAND Corporation, this would result in an overall decline in enrollment in the individual market by 9.6 million.\nAnd Congress isn’t likely to deliver to Obama the simple “one sentence” fix needed to resolve this snafu, while a variety of substantial political and legal barriers would preclude or at least hinder an effective, expeditious remedy at the state level.\nThough there may be some debate about the precise effects of uninsurance on mortality, the consequences of such an abrupt change should not be underestimated. Simply put, pulling the rug — or the hospital bed — out from under millions of people cannot be accomplished without substantial bloodshed. By one estimate, some 9,800 “additional deaths” a year may result from such a surge in the ranks of the uninsured.", "url": "https://www.jacobinmag.com/2015/06/aca-obama-universal-healthcare/"}