{"authors": ["Rand Wilson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:54", "date_modify": "2020-05-04 19:58:54", "date_publish": "2015-11-17 00:00:00", "description": null, "filename": "2015_11__1588622334.html", "image_url": "https://images.jacobinmag.com/2015/11/17010345/nnu.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_11__1588622334.html", "title": "Will Labor Back Bernie?", "title_page": "Will Labor Back Bernie?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "RW\nWell, this is hardly new — Labor for Bernie has not invented anything new here. Rather, the opportunity has presented itself because so many members are excited about Sanders at the grassroots level and recognize this moment to break away from corporate-dominated Democrats. What we’ve tried to do is give members the tools and resources to make sure their voices are heard, and to try and amplify those voices so that union leaders hear it.\nFor all the failings and weaknesses of the labor movement, unions are still democratically structured and the member’s voice can have a real impact. We’ve tried to just make sure that members realize that they have a role and a responsibility and a right to speak out and wherever we can, we’ve tried to give the megaphone to the members to do that.\nIn the case of the Machinists and the AFT, when those endorsements were made from the top down there was tremendous outcry from their activist base, from the shop stewards and executive board members who are the foot soldiers of the labor movement.\nIn the case of the National Education Association and AFSCME, the top-down decisions were not made without any local or state dissent. There were executive board members who had the courage and understood that they needed to dissent and they voted “no.” Even though we lost the decision it’s gratifying to see that it wasn’t made without some pushback from state and regional leaders. We’re not taking credit for it, but we are part of the movement that yielded that sentiment within AFSCME and the teachers.\nWithin the IBEW we had an incredible story of a supporter in Indiana. A rank-and-file member, a savvy guy, and he organized hundreds of emails to the president of the union saying “Hold off, give us more time.” That resulted in the IBEW’s president saying, “Fine! I’m not going to make an early endorsement, and this decision will be something that I’m going to wait on to hear from a lot more locals and more members.” So the current within the IBEW is a result of the president saying “Have at it” to the grassroots.\nThat’s the group that’s got the most engagement with Labor for Bernie. It’s not your typical liberal union. But there’s a real grassroots movement in the IBEW that has the encouragement from their president. And that should be applauded.", "url": "https://www.jacobinmag.com/2015/11/postal-workers-endorsement-labor-for-bernie-sanders-clinton-nomination/"}