{"authors": ["Doug Henwood", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:12", "date_modify": "2020-05-04 19:57:12", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07_mason-guardian-capitalism-new-economy-post-work_1588622232.html", "image_url": "https://images.jacobinmag.com/2015/07/17004638/9717154582_0a0ed88b4b_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07_mason-guardian-capitalism-new-economy-post-work_1588622232.html", "title": "Workers Aren’t Disappearing", "title_page": "Workers Aren’t Disappearing", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Paul Mason has a breathless piece in the Guardian making grand New Economy claims that sound like recycled propaganda from the late 1990s — though he gives them a left spin: post-materiality is already liberating us. I wrote a book that was in large part about all that ideological froth, published in 2003, and so far I’ve been struck by the non-revival of that discourse despite a new tech bubble. Uber and Snapchat don’t excite the same utopian passions that the initial massification of the web did.\nI’ll pass on refuting Mason’s article, because I already did that twelve years ago. But I do want to comment on one point that Mason makes — one that’s ubiquitous in a lot of economic commentary today: capitalists don’t need workers anymore. As he puts it:\nPostcapitalism is possible because of three major changes information technology has brought about in the past 25 years. First, it has reduced the need for work, blurred the edges between work and free time and loosened the relationship between work and wages. The coming wave of automation, currently stalled because our social infrastructure cannot bear the consequences, will hugely diminish the amount of work needed — not just to subsist but to provide a decent life for all.\nI can’t make sense of the “currently stalled because our social infrastructure cannot bear the consequences” — has capitalism ever skipped an innovation because of its social consequences? — but there’s no evidence that info tech is “hugely diminish[ing] the amount of work needed.” Sure, wages and benefits stink, but that’s about politics and class power, not because of the latest generation of Intel chips or something fresh out of the latest TechCrunch Disrupt.\nExpressing this argument in some economically quantifiable way probably means something like “the relation between GDP growth and employment growth has broken down.” If that’s what proponents mean — the presentations are usually light on precision — then it’s just not true.\nGraphed below is the yearly growth in employment, and what the growth in employment “should” be based on GDP growth (lagged a quarter). Below it is the difference between the two — a measure of whether actual employment growth is stronger or weaker than the very simple model suggests.\nSeveral things stand out:\nThe relationship between GDP growth and employment growth is very tight.\nIt hasn’t gotten any less tight. Employment losses during the Great Recession were greater than the contraction in GDP says they should have been, but not by much, and the model tracks actual results, both down and up, remarkably well.\nRecent employment growth is stronger than the model suggests it should be. For the first quarter, average US monthly employment gains during the first quarter of 2015 “should” have been 163,000, and not the 253,000 they were.\nPut another way, were IT really making workers less necessary, we should be seeing more productivity growth, and not less. But less is precisely what we’re seeing — as of the first quarter of 2015, trend productivity growth was 0.4%, an all-time low since the series began in 1948, less than a fifth the 1948 — 2007 average of 2.3%. It’s below the levels of the lamented 1970s productivity slowdown.\nThe only time in recent history where IT appears to have led to an acceleration in productivity growth was the late 1990s, which was the result of increased investment in high-tech equipment. I went into writing After the New Economy thinking that the productivity acceleration was a mirage, but it wasn’t. But then it fell apart, because corporations prefer shoveling out cash to their shareholders to investing it.", "url": "https://www.jacobinmag.com/2015/07/mason-guardian-capitalism-new-economy-post-work"}