{"authors": ["Jesse A. Myerson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:30", "date_modify": "2020-05-04 19:54:30", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08__1588622070.html", "image_url": "https://images.jacobinmag.com/2015/08/17004830/basic-income-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08__1588622070.html", "title": "The Right to a Dignified Life", "title_page": "The Right to a Dignified Life", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nProposals for a libertarian-socialist coalition frequently emphasize the trans-ideological support for a universal basic income (UBI), whose proponents half a century ago ranged from Milton Friedman to Martin Luther King, and whose revivalists include not just writers at the Cato Institute but also many in the socialist camp. While leftists share the hope that a broad political constellation can help win a basic income, caution is in order. The desire for such an outcome should not compel us to obscure our aims and risk ending up with a program that reinforces existing class hierarchies. At a time when support for a basic income is garnering increasingly more mainstream consideration, it is essential for the Left to make explicit the anticapitalist rationale for a UBI. Below are five important considerations.\n1. The purpose of a UBI is to free people from the tyranny of the job market. The engine fueling capitalism’s indefinite tendency to expand is mass dependence on the market to secure the means of subsistence. Because the majority of us have to work in order to afford the trappings of dignity, the market is able to impose its imperatives on all of society. Ellen Meiksins Wood articulates these drives clearly: “the compulsions of competition, profit-maximization, capital accumulation, and a relentless imperative to improve the productivity of labor so as to reduce costs in order to reduce prices.” The way to break from this market subjugation is to guarantee material security as a human right, providing everyone with an “exit” from the job market. (Any good libertarian must concede that exit opportunity is a necessary precondition for a market to be “free.”) While rights-based income wouldn’t stop capitalism’s advance, it would take the cinderblock off the gas pedal. It would also provide two critical tools to those trying to hit the brakes: social adjustment to the guaranteed right to a dignified life, and the provision of extra free time and cash to those motivated to defend and expand it. More patriotically, a basic income aimed at divorcing work from pay would provide the conditions for what the Declaration of Independence promises: the freedom to pursue happiness, however elusive.\n2. A UBI should exist as part of a suite of benefit programs. It is common for right-wing UBI advocates to advertise it as a replacement for all other government benefit programs. Simply giving people money and letting them spend it on what they like strikes many libertarians as an enlightened approach to general welfare that decreases the involvement of a coercive state. Enabling independence is of course a worthy goal. But while some programs would be rendered redundant with the enactment of a UBI, gutting the welfare state would undermine personal autonomy. And relatedly, giving everyone an equal basic income isn’t the same as providing everyone an equal opportunity to flourish. As Demos blogger Matt Bruenig points out, not all people need exactly the same amount of money to meet their basic needs: For instance, a disabled person might need more dollars to achieve the capability of being able to move around the world if they require a wheelchair or some other assistance. Giving that person the same number of dollars as someone who does not have such a disability would not actually achieve equal capabilities among the two or the same social floor among the two. Bruenig thus advocates three tiers of basic income: child (the lowest), adult, and elderly (the highest). This approach would replace a number of programs: the child tax credit, Social Security, Social Security Disability Insurance and other disability insurance programs (supplanted by specific “top-ups” for people with disabilities), and the earned income tax credit (replaced by means-tested wage supplements). But that is where the program-trimming ends. Alongside that UBI-based system, there would need to be a host of universal public services, not least national health insurance, child care, and education, including pre-K. This suite of programs, which must be completely insulated from market pressures and treated as guaranteed human rights, must not be sacrificed for a basic income program. Only together could they achieve that vital leftist accomplishment: market independence for our society.\n3. A UBI should be coupled with guaranteed access to public-sector employment. The income support of a UBI could get us closer to full employment by reducing the number of people who need a job for money, but it couldn’t replace employment wholesale — at least not at first. Perhaps the conditions to fulfill the “fully automated luxury communism” aspiration are emerging, but in the meantime there is an enormous amount of work that would greatly improve life in this country, if human beings could be employed by the public sector to do it. If nothing else, deriving income is not the only thing people want out of work: of the 90% of participants who reported satisfaction with Argentina’s public employment Jefes program, “I have an income” was, at 7%, the fifth most listed reason for satisfaction, behind “I can do something” (42%), “I work in a good environment” (26%), “I help the community” (12%), and “I learn” (9%). People want to learn, be contributing members of society, and be part of a community. We should make these desires possible. The libertarian version, a basic income without public employment, runs the risk of establishing an “aristocracy of producers, serving and accredited by a democracy of consumers.” Subsidizing consumption alleviates poverty, but it does not interrupt capitalism’s incessant consolidation of wealth into the hands of the ownership class. By redefining work from a vehicle by which capitalists can accomplish their acquisitive aims to a vehicle by which people perform a public purpose — from taking care of children to producing public artwork to scanning public-domain documents into a massive database on the Internet — a job guarantee can accomplish socially beneficial projects that simply increasing consumers’ purchasing power could not or would not.\n4. It can’t be done by Bitcoin. Tech-libertarian basic income proponents like Swedish entrepreneur Susanne Tarkowski Tempelhof believe that a UBI would be best implemented by a privately commissioned and designed cryptocurrency scheme. Journalist Nathan Schneider describes Tempelhof’s project, dubbed Bitnation, as a “collaborative platform for do-it-yourself governance” where “everything is done through voluntary means, rather than through forcing people through the use of — the threat of — violence.” The idea is for people to voluntarily join a “stateless” economy, whereupon they become entitled to a basic income, paid in a cryptocurrency germane to BitNation. If the idea sounds dubious, that’s because it is. Whatever the merits and drawbacks of BitNation and any of its probable successors, mass allocation processes should be the result of political decisions rather than private projects. Like nuclear reactor safety testing systems, food and drug safety, and research ethics, the successful and predictable allocation of basic income is too important to depend on a voluntary enterprise. The inflationary and deflationary potential of cryptocurrencies operating without a fiduciary duty to their users disqualifies projects like BitNation from serious consideration. Moreover, all the systems that make up the economy — payments, credit, contracts, property — require public law enforcement to work. BitNation may contend that its code can enable contracts made in its currency to enforce themselves, but it strains credulity to suppose that the many accountants, judges, and hours of public testimony necessary to resolve defaults and bankruptcies can be handled automatically by algorithm. Taxation, too, is necessary for the economy to function: by demanding tribute in a currency, a government creates and sustains demand for it. BitCoin acted like a speculative commodity: they were only valuable when people wanted them and thought they would appreciate in value. Once users’ confidence in them was shaken, their value plummeted. Without the governmentally imposed necessity that all users continually accumulate a collection of the currency to relieve a tax burden, the currency is made valuable merely by the trust of its users. And trust is a very fickle resource indeed. Lastly, voluntarism is pro-cyclical. Charity abounds during economic booms, when it is less necessary, and dries up during recessions, when it could do a lot more good. When situations like that hit, therefore, you want your fiscal and monetary system to respond appropriately. During a downturn, the system should grow the supply of currency to fill in the gap in everyone’s voluntary spending, a task a job guarantee or UBI-like helicopter drops can accomplish, and when inflation hits, it should change people’s spending patterns in ways that are contrary to their voluntary impulse. A public monetary system is capable of doing this and responsibly allocating a basic income. On the other hand, writes Schneider, “cryptocurrency schemes run the risk of leaving us with a system in which you’d get your check only if you play by the founders’ rules.”\n5. UBI should not have taxes baked in. Milton Friedman’s basic income proposal, which he called a Negative Income Tax (NIT), was actually two policies: (1) a UBI and (2) high marginal tax rates at the bottom of the income scale. The purpose of the second part was to raise money to fund the first. This approach involves a “break-even” point, above which people are taxed more than the basic income payment they receive, and below which they receive more than they pay, effectively means-testing the benefit. Friedman’s version of the program prescribed a 50% tax rate, so the break-even point would be twice the UBI payment amount. With a hypothetical $10,000 UBI, the threshold would be $20,000, quite low on the income spectrum. A higher income bar would be preferable, but not as preferable as detaching the payment from the tax entirely. The purpose of the tax is simply to manage the potential inflationary effects of the basic income, and as such can come from anywhere — it needn’t be paired with the payment as part of a single program. The Alaska Permanent Fund pays its basic income not out of tax revenue but profits from stocks it invests in — that is, it collectivizes ownership claims on (a tiny sliver of) the means of production. The fund builds its principal by charging royalties for extraction of Alaskan public oil. This can serve as a model for a national (or regional) sovereign wealth fund, which can easily be plied with cash from another favorite trans-ideological reform: land value taxation. The Permanent Fund can serve as a model for a national UBI in still another way: its insulation from right-wing political leadership. One problem with Friedman’s approach is the political vulnerability of a benefit targeted at poor people (by definition the least politically powerful population). The political forces arrayed to protect and defend such a benefit are at a terrible disadvantage, in contrast to a program like Social Security, whose universal benefits and whose reliance on trust funds (however economically needless) make it very difficult for wealthy interests to destroy, try as they might.", "url": "https://www.jacobinmag.com/2015/08/universal-basic-income-socialist-libertarian/"}