{"authors": ["Panagiotis Sotiris", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:38", "date_modify": "2020-05-04 19:58:38", "date_publish": "2015-09-17 00:00:00", "description": null, "filename": "2015_09__1588622318.html", "image_url": "https://images.jacobinmag.com/2015/09/17005643/P10600441-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_09__1588622318.html", "title": "What Popular Unity Can Do", "title_page": "What Popular Unity Can Do", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Greece votes tomorrow, but it seems as if all the major questions facing Greek society are absent from the pre-election debates. Both Syriza and New Democracy compete for the popular vote by avoiding any discussion of the real problem — that is, the very fact that both Syriza and New Democracy, along with other pro-austerity parties, voted for another austerity memorandum.\nIt seems like it is not a political debate but a contest between two parties who share the same political program. In a certain sense, this is real. These loan agreements are not just a set of terms and conditions. They include a mechanism of constant supervision and control of all major economic decisions through processes of constant evaluation.\nThis means that Greece’s creditors can always ask for more austerity cuts, more neoliberal measures, and more “reforms.” The agreements are a regime and a form of governance, based on a condition of limited sovereignty. As a result, any pro-memoranda government will have very limited space to move, and will be forced to implement the measures dictated to it.\nAlexis Tsipras and the leadership of Syriza have fully accepted this condition. The basic political message is that Syriza must be in a position to be the leading force in a pro-memoranda government. Their explicit message is that the party must be strong enough to form a “progressive” government — a government with Pasok and the openly neoliberal River.\nHowever, in reality there is strong pressure by the European Union for a “grand coalition” with New Democracy. This kind of “special purpose” pro-austerity coalition is one of the trademarks of contemporary European post-democracy. In a break with all traditions of the Left, Syriza’s campaign is based not on political proposals but on Tsipras’s suitability to be prime minister once again.\nThis pre-election political landscape, where both Syriza and the other pro-memoranda parties reproduce ad nauseam the message that there is no alternative, is in sharp contrast to the sharp divisions and dynamics inside society. In one of the strongest electoral expressions of class polarization, the massive “no” vote in the July 5 referendum made explicit the political will of the broad popular masses to reject austerity, to demand popular sovereignty, to fight against the embedded neoliberalism of the eurozone.\nThis discrepancy between the political scene and the divisions and dynamics inside society is an expression of the new phase of Greece’s political crisis.\nGreek society is deeply traumatized. The abrupt shift from the determination and collective aspiration of the “no” vote to a painful feeling of defeat and humiliation has left society without a positive point of reference. It is the first election since 2012 where there is no obvious pole of hope. Moreover, for the first time many view the Left as “part of the political game” and part of the problem. This can easily turn hope into despair and desperation.\nIt is here that Popular Unity enters the political debate. It attempts to change its terms, to insist that there is an alternative to the memoranda and that another road is possible. It is trying to transform the dynamic of the “no” vote into a political alternative.\nIt has a radical program whose basic positions include the stoppage of debt payments, exit from the eurozone, the nationalization of banks and strategic enterprises, and the reversal of the neoliberal reforms associated with the memoranda. It is based on the collaboration of the left tendencies of Syriza that exited the party in protest of its pro-austerity mutation and important segments of the anticapitalist left. It has roots in social movements.\nAs should be expected for an electoral coalition that has been active for less than one month, Popular Unity is not yet the kind of united front that is urgently needed. Some of the problematic aspects of Syriza — both in terms of a certain bureaucratic organizational culture and of a reformist conception of the political program — are being reproduced inside Popular Unity. Many people are still critical of the leading figures of Popular Unity because of their participation in the Syriza government.\nAbove all, we are far from presenting a new political synthesis not only between the traditions of Syriza and the anticapitalist left, but also between the necessary political program and the collective experiences of solidarity and self-organization.\nHowever, in a political landscape dominated by pro-memoranda positions, Popular Unity can indeed make a difference, represent the dynamic of the “no” vote, and potentially be the starting point for the radical left front that is urgently needed.\nThe post-election period will be marked by the aggressive implementation of the third memorandum and an avalanche of cuts and neoliberal reforms. There is the possibility of a new wave of struggles and protests, including demonstrations from new forces that were not active in the previous period, such as farmers.\nMoreover, the deterioration of social conditions, because of the new cuts in pensions and social spending, will increase the need for solidarity networks. Popular Unity has the opportunity to prove that it is not only an electoral outlet of protest, but also a leading force in the collective resistance.\nSyriza’s capitulation is not the end of the political crisis in Greece. Greek society remains deeply divided and polarized. The trauma of the defeat is here, but it is possible to transform despair into hope and determination. This is the challenge Popular Unity faces.\nHowever, to meet this challenge Popular Unity must not remain the coalition between the left wing of Syriza and some segments of the anticapitalist left. It must become something radically new and original. It should combine and, at the same time, transcend the experience of both Syriza and Antarsya.\nIt is necessary to elaborate a political program that goes beyond simply calling for an exit from the eurozone and an end to austerity and offers a new vision based on public ownership, democratic planning, and worker self-management.\nIt must insist on an open appeal not only to other forces of the Left such as Antarsya, but also to the militants and activists from the movements and the solidarity networks. It should experiment with new forms of collective social organization, especially given the extremely precarious situation of the workforce of the private sector. It must attempt to be really democratic and make itself into an open political laboratory of radical alternatives.\nAs is the case with most aspects of life, the first steps are the most difficult. Popular Unity still has great potential, provided that we remember that in a new situation we will need not just commitment and energy, but creative new ways of thinking about organizing.", "url": "https://www.jacobinmag.com/2015/09/popular-unity-syriza-lafazanis-tsipras-greece-snap-election/"}