{"authors": ["Mark Bergfeld", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:29", "date_modify": "2020-05-04 19:58:29", "date_publish": "2015-06-17 00:00:00", "description": null, "filename": "2015_06_germany-strikes-railroad-teachers-nurses_1588622309.html", "image_url": "https://images.jacobinmag.com/2015/06/17004239/dt.common.streams.StreamServer-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_06_germany-strikes-railroad-teachers-nurses_1588622309.html", "title": "The Upsurge in Germany", "title_page": "The Upsurge in Germany", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Over the last few weeks, sensational headlines like “Willkommen, Streikrepublik Deutschland” have adorned the websites of German news outlets. The Süddeutsche Zeitung, Germany’s largest daily, featured the country’s spike in union membership on its front page. And the London Guardian thought it important enough to run a piece by the famous German sociologist Wolfgang Streeck titled “The strikes sweeping Germany are here to stay.”\nSo what’s going on in Germany?\nIn short, the largest strike wave in decades: so far this year, more than 350,000 days of work have been lost to strike action. That number was just 156,000 all of last year; in 2010 it was only was 28,000 days.\nAirline pilots, train conductors, postal workers, preschool teachers, and nurses, just to name a few, have all been or are currently on strike. These labor actions pose the largest threat to the German economic model since the protests against the Hartz IV reforms — which liberalized labor markets — more than ten years ago.\nFor generations, German trade unions have not been known for their militancy. In the late 1960s and early 1970s, when the UK, Italy, and France were all sites of fierce industrial conflict, Germany was comparatively quiet. The country’s corporatist, “social partnership” model explicitly bound up workers’ fate with the country’s export economy, the trade unions subordinated their interests to those of the company.\nBy some measures, the model has served Germany well. Its productivity rate is very high, and its export goods remain relatively cheap abroad. Workers are afforded some democratic rights through the policy of co-determination, which allows them to elect representatives to company works councils. And union membership remains much higher than in the United States.\nHowever, the entire model has been predicated on squeezing wages and making work less secure. While many American liberals have trumpeted the German model as an untrammeled success, there is a substantial low-wage sector. Between 1998 and 2008, the number of workers on full-time contracts decreased by 800,000, while the number of workers in precarious employment grew by 2.4 million. By 2012, “atypical” workers made up 21.2% of the German labor force. Today more than 2.6 million people work a second job.\nTrade union membership has stabilized, and the number of workplace representatives continues to decline. Only 58% of the German workforce is covered by a collective-bargaining contract. To make matters worse, parliament just passed a law that aims to curtail the right to organize and strike.\nThis is a direct attack on one of the principal actors involved in the strike wave: the train conductors’ union, whose strike of 34,000 members demonstrated the power of small yet structurally strong groups of workers. Its work stoppages stranded more than six million passengers and brought more than 600,000 tons of raw materials and goods to a standstill on a daily basis. A single strike day cost the railway company around €10 million, while the total damage to the German economy for a one-day strike was roughly €100 million.\nSince the partial privatization of the railway company, train conductors have been paid less than their European counterparts. So even though their demand for a 5% wage increase, reduced working hours, improved work conditions, and the right to represent other rail personnel was absolutely reasonable, it has been met with utter hostility by politicians, the press (with few notable exceptions), and even by some sections of the trade union movement. (The fact that the train conductors’ union is not in the official trade union confederation has made them and their leader, Klaus Weselsky, an easier target.)\nIf the train conductors want a bigger slice of the pie, hospital care workers at Berlin’s Charité want to take over the bakery.\nLast month, the Charité workers led the biggest hospital strike in German history simply by walking out for two days. They were not asking for more money. Their demand was better patient-staff ratios.\nIn addition, the strike departed from past worker actions, which had been led by administrative staff, porters, and other personnel. Hospital workers have born the brunt of the neoliberal restructuring in hospitals, and it is on that basis that they successfully built coalitions with patient groups, medical doctors, students, citizens’ initiatives, and the left-wing party Die Linke.\nPreschool and kindergarten teachers are demanding social recognition for their labor, and a 10 to 15 percent raise. In doing so, they have opened up a public discussion about what early childhood learning should look like, and why pay inequities persist: why is a skilled male worker worth more than a female educator? And if political elites like Chancellor Angela Merkel assert the importance of early childhood education, why are educators appropriately remunerated? These preschool and kindergarten teachers don’t simply play with children, as the dominant image suggests. Their labor is educational.\nThe strike also calls Merkel’s and Finance Minister Wolfgang Schäuble’s Schwarze Null (Black Zero) policy of fiscal austerity into question. The government’s goal of avoiding debt at all costs has been achieved at a huge expense. German cities and municipalities have been bled dry, schools are falling apart, and bridges are near collapse.\nIf workers win, this model could come crashing down. German municipalities would have to start paying workers a decent wage for the services they provide, and workers could in turn push for better, more well-funded services. Entering arbitration — as the preschool teachers did, at the height of their strike — makes this unlikely, however.\nIt is this development that should give us pause about exuberant proclamations of labor unrest in Germany. Too many opportunities have been lost, and there have been too many concessions made in recent years to presume a 180-degree turn. After all, this is a country where a trade union functionary of the IG Metall has been given stewardship of the Volkswagen corporation while shareholders and the family owners squabble over strategy.\nThe move to enter arbitration even as parents and the public were behind them seems to confirm the view that German unions continue to hold to the co-determination model, a model whose promises of social justice have been exposed of late. Today, Germany is one of the most unequal societies in Europe. Economic growth has come at an ever-greater human and environmental cost.\nUp until now, the strikes have been called by well-organized groups of workers with long trade union traditions. The low-wage sector, by contrast, has been essentially untouched by this upsurge. If the work stoppages are to spread, striking workers must wrest gains from capital to show that halting production is effective in the German context — instead of just believing social partnership will deliver.\nThis movement could be the beginning of something real if workers dare to break with the logic that has dominated official union politics in Germany for far too long. After all, there was a time when the labor movement’s lingua franca was German.", "url": "https://jacobinmag.com/2015/06/germany-strikes-railroad-teachers-nurses"}