{"authors": ["Derek Seidman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:43", "date_modify": "2020-05-04 19:52:43", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_09_mcdonalds-seiu-minimum-wage-strike_1588621963.html", "image_url": "https://images.jacobinmag.com/2015/08/17005353/12949v1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_09_mcdonalds-seiu-minimum-wage-strike_1588621963.html", "title": "Dismantling the Low-Wage Economy", "title_page": "Dismantling the Low-Wage Economy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nWhen the Fight for 15 campaign (FF15) began close to three years ago, most people dismissed it as a fantasy. That fast-food workers could win a $15 hourly wage, let alone gain some form of union representation, seemed like a utopian dream. But today, it’s clear that the movement has made major headway and has reshaped the national discussion around low-wage work. In localities across the country, the proposal for a $15 wage is gaining momentum. In some cities, like Seattle, San Francisco, and Los Angeles, it’s already won, and Washington DC will have a popular vote on it in 2016. New York recently became the first state to move towards a state-wide $15 wage for fast-food workers, and SEIU says it will try to replicate this victory elsewhere. Workers beyond fast food, like those in the University of California system, are also benefitting from the $15 wave, and everyone from homecare workers to medical first responders are drawing inspiration from the campaign. And with last week’s landmark National Labor Relations Board decision that corporations can be held liable for labor violations committed by their franchises, the path towards organizing fast-food and other low-wage workers just got easier. FF15 is clearly on a roll, and millions of workers in the US will likely see significant raises as a result. But the impact of the movement is not just monetary. Like great labor campaigns of the past, FF15 is raising new questions about social citizenship and worker rights in America. It’s developing a new layer of leaders and raising expectations among all workers. It’s devising creative strategies to tackle historically difficult terrain for the labor movement, and it’s fostering a political environment that will make all organizing easier. It’s also rejuvenating the labor movement as a social movement. As Fortune magazine put it, “A wage of $15 per hour is now the battle cry for low-wage workers nationwide, and it’s transformed labor organizing from a process often centered on nickel-and-dime negotiations with a single employer into a social justice movement that transcends industry and geographic boundaries.” The appeal of FF15 is rooted in recent transformations, particularly the post-2008, post-Occupy climate. Millions of people are realizing that the new status quo of rising inequality and of being increasingly overworked and underpaid is not going away. Today, 42 percent of American workers make less than $15 an hour. According to the Bureau of Labor Statistics, ten of the twelve occupations that will see the most growth through 2022 pay a median annual wage of less than $33,000 a year, and seven pay less than $25,000 a year. Four of the top five pay less than $22,000 a year. As Nicole Aschoff writes, “A growing number of Americans is realizing that ‘good jobs’ aren’t coming back, and that for things to get better, they’re going to have to fight to turn their McJobs into something better.” But FF15 also has a deeper historical significance. From its origins, the postwar fast-food industry presumed it could pay most of its workers sub-subsistence wages. It searched for workers whom it could offer such middling remuneration, but whose physical survival it could assure by pushing the costs of their reproduction onto others. The movement of this poverty-wage business model from margin to center beginning in the 1970s and 1980s set the stage for the rise of the low-wage working class that is now at the center of FF15. When looked at this way, the campaign represents more than just a call for a higher wage. In pitting fast-food workers against the fast-food industry, and creating a dramatic spectacle around this struggle, it represents a clash of forces that is decades in the making. It is an opening salvo against a defining postwar low-wage business model, based on sub-subsistence wages, that structures the lives of millions of American workers. To understand this, we need to look at the history of the fast-food industry, and its most iconic star: McDonald’s.\nFood Service Meets Taylorism As many have remarked, society spends billions of dollars subsidizing the fast-food industry’s low pay through welfare programs. McDonald’s is the biggest beneficiary, with $1.2 billion in public subsidies in 2012. But the subsidizing of fast-food poverty wages is nothing new. From its origins, McDonald’s was at the vanguard of forging the low-wage, cost-externalizing labor model that would later come to dominate the US labor market. The story begins in 1940s Southern California, where a layer of hamburger shacks oriented towards the new suburban car culture sprung up. They had diverse menus that catered to individual tastes and used labor-intensive “car hops” to deliver food to cars that pulled in. These carhops were usually young women, and the burger shacks mostly attracted young men. In the 1940s, as the number of burger shacks grew, the McDonald brothers wanted to find a way to break the growing stalemate in the competition for customers. One of the brothers had studied Taylorism and was enamored with the assembly line model. When he looked at the McDonald’s operation, he saw inefficiencies, high labor costs, undisciplined workers, high turnover, and a limited consumer base. To break this impasse, the McDonald brothers completely shut down their shop for three months in 1948 to reinvent it along more efficient, routinized lines. They cut the food menu from twenty-five to just nine standard items that could be quickly and uniformly prepared. They sliced their prices in half. They replaced the car hop model that with an in-store, walk-up counter. They fired their female workers, who they felt attracted rowdy young men, and hired an all-male workforce. “Our whole concept was based on speed, lower prices, and volume,” said Richard McDonald. “We were going after big, big volumes by lowering prices and by having the customer serve himself.” Most importantly, the McDonald brothers devised an assembly line of food production for their shop. They broke down the production process into minute, repetitive tasks for individual workers to do. This deskilled the jobs and transferred control and power over to management. Workers became easily replaceable. Little training was needed to carry out the routinized tasks. Fast-food workers became just another input in food service production, and more easily managed — all to increase the pace and volume of production. In making these changes, the McDonald brothers hoped to attract new customers who wanted fast, cheap, predictable food in a setting more welcoming to families. When the store reopened after its hiatus, it was prophecy fulfilled. People flocked to the cheap and tasty food and family-friendly atmosphere. McDonald’s hagiographer John F. Love writes: Within a year of reopening their San Bernardino drive-in, the McDonald brothers’ fascination with speed had converted their hamburger stand into a small assembly plant….The procedures were so detailed and the jobs so specialized that the McDonald’s operation benefited not only from higher production speeds but from the same labor-saving advantages that Henry Ford had discovered when he introduced the modern assembly line techniques to manufacturing. The brothers could now employ untrained cooks at a lower wage and with minimal training, and they could turn out products faster and with better quality control than even the best short-order cooks are capable of. The McDonald brothers called this “Quickie Service.” Today we call it fast food. The model soon spread across the nation. When we go to the drive-thru today, we are participating in the scheme that the brothers developed almost seventy years ago.\nPaying McWages But from the very beginning, each part of the fast-food model rested on a key invariable: very low wages, and more specifically, workers whom it could pay very low wages by pushing the costs of their physical reproduction onto others. In all the celebratory accounts of the plucky entrepreneurial ingenuity of the McDonald’s origins story, this fact is hardly mentioned. In the 1950s, this dependence on low wages meant hiring teenagers. Why them? As Eric Schlosser, author of Fastfood Nation writes, they were “perfect candidates” for fast-food jobs not only because they were less expensive to hire than adults, but also because “their youthful inexperience makes them easier to control.” Importantly, the families of teenagers could cover the costs of housing, food, medical care, and other expenses. “Since most teenagers still lived at home,” notes Schlosser, “they could afford to work for wages too low to support an adult.” With a teenage workforce, McDonald’s could pay sub-subsistence wages and rely on their workers’ families to ensure they still survived. This teen-centered labor model would last for decades, and McDonald’s PR machine would package the company’s low-wage jobs as performing a social good. Here were the first jobs for young Americans, instilling the habits of hard work and punctuality needed to make it in the world. McDonald’s wasn’t exploiting their workers by paying them poorly, but offering them opportunity. The teenage fast-food worker became a postwar American icon — think Fast Times at Ridgemont High. If Taylorizing food service was the first step toward creating the modern fast-food business model, the nationalization of the McDonald brothers’ local innovation through franchising was the second. The key player here was Ray Kroc. In the early 1950s, Kroc was a conservative, middle-aged salesman still looking for his big break. After visiting the San Bernardino McDonald’s and witnessing its cookie-cutter efficiency, he had a vision: this model could be easily exported across the nation. Kroc bought the rights to franchise McDonald’s from the owners, and soon bought the company entirely. He went about pioneering its modern formula. Sometimes called the “three-legged stool,” the corporation, the suppliers, and the franchisees play their respective roles to create profits for each leg. It was a brilliant move by Kroc: the corporation maintained tight, centralized control over a franchise system that delegated risk onto others while pulling in steady profits through ever-greater scales of production, real-estate rentals, and skimming of fixed profit rates from franchisees who had to conform to the corporation’s dictates. And all the while, because of the centrality of the franchise system, McDonald’s could posture as a down-home, nostalgic, small-business enterprise. Virtually all accounts of McDonald’s celebrate this model and point to it as the cause for the company’s astounding success. But they ignore the fourth and most vital leg of the stool: the low-wage workers who make up more than 90 percent of McDonald’s personnel. Everything else in the business model depends on paying these workers sub-subsistence wages and simultaneously pushing the costs of their reproduction onto others. The legitimacy of McDonald’s rests upon not discussing this dirty secret. It’s telling that, in the many hundreds of pages of self-congratulatory company history written by management and outside admirers, there is virtually no mention of the plight of McDonald’s rank-and-file workers, outside of a few stories and formulaic clichés that fit neatly into the company’s careful public image as a wellspring of charity, opportunity, and mobility.\nMcJobs in a Neoliberal Era By the 1970s, just about two decades after the birth of modern fast food, the results of the four-legged stool were astonishing. In 1960 there were 250 McDonald’s restaurants; in 1973, there were 3,000. Other companies adopted the McDonald’s model, and fast-food sales expanded an average of 20 percent annually in the 1970s and 10 percent in the 1980s. Meanwhile, as the company’s market-pull and cultural reach grew, Kroc and company remained at the vanguard of the effort to keep a low-wage fraction of the American working class laboring in the food service sector. For example, in 1972 the fast-food industry, led by Kroc, lobbied Congress to pass what became called the “McDonald’s Bill.” It was a piece of minimum-wage legislation that contained a provision allowing fast-food employers to pay sixteen- and seventeen-year-olds 20 percent below the standard. Kroc’s $250,000 contribution to Nixon’s 1972 campaign paid off when the president supported the bill, even vetoing a minimum-wage hike that didn’t include the subminimum wage provision. The McDonald’s Bill failed, but it was clear that Kroc knew what drove his business: low wages, pliable workers, and throwing the costs of employees’ reproduction onto others. All this held together from the 1950s to the 1970s. The postwar economic boom combined with a strong labor movement to generate decent jobs for many American breadwinners. As the children of the baby boom became teenagers, they found employment in fast food. And while the wages were low, fast-food jobs were marginal to the nation’s core labor market. But things started to change in the 1970s and 1980s. Fast-food and other service and retail sector jobs starting to drift to the center of the US labor market. These industries became new engines of job growth for working-class Americans. The characteristics of fast-food jobs — poverty wages, few benefits, part-time hours, poor safety, a lack of power on the job — became the harbinger of a new normal for workers. And now that it was family breadwinners and not teenagers laboring at these jobs, corporations like McDonald’s had to find new fixes to make society subsidize the workers they depended on but refused to pay a decent wage. Three major developments shaped the contours of fast food’s transition from a marginal to core employer in the US beginning in the late twentieth century. The first was an anti-labor business offensive that began in the 1970s. This attack on workers took a few forms that are relevant to the story. Emboldened by a profit crunch and a conservative political ascendency, employers began to directly attack the working class with a new level of ferocity and sophistication in the 1980s. They busted unions and forced concessions, lowering wages and chipping away at pro-worker regulations and provisions. The result was a huge rise in inequality and a precipitous decline in workers’ share of the social wealth. Real wages dropped, beginning a decades-long stagnation in worker compensation, even as labor productivity increased. But more importantly, the minimum wage fell even further, losing 30 percent of its real value during the 1980s. This was crucial, because job growth was increasingly in sectors where jobs were pegged to the minimum wage, like fast food. Corporations also moved their factories to lower wage regions within, and especially outside of, the US. This was not a new employer tactic, but it intensified in the 1970s and 1980s. Combined with deepening automation, the exodus substantially lowered the percentage of industrial jobs in the US, and left the door open for a boom in low-wage service and retail employment. Between 1989 and 2000, these jobs accounted for 70 percent of all new ones, and they continue to drive employment growth to this day. Along with the anti-labor business offensive, the second major development to the growing centrality of low-wage service and retail labor was the rising entry of women into the workforce as second family breadwinners. The stagnation crisis of the 1970s and the mounting attacks on workers put economic pressure on working-class households. As a result of this pressure, as well as changing sensibilities produced by the feminist movement, more women entered the workforce, intensifying a trend that had been slowly rising since the 1950s. According to the Bureau of Labor Statistics, “Between 1970 and 1980, the labor force participation rates of women in the twenty-five-to-thirty-four and thirty-five-to-forty-four age groups increased by 20.5 percentage points and 14.4 percentage points, respectively. No other labor force group has ever experienced an increase in participation rates of this magnitude in one decade.” And the jobs that were readily available for these workers, due to both supply and sex-typing, were retail and service-sector jobs like those in fast food. This new female workforce was a godsend for fast-food businesses. By the 1970s, the industry was booming and in need of more employees, and second-income women workers could accept sub-subsistence wages since their paycheck was a supplement to their husband’s income. They would also be more willing to work with few benefits and with part-time hours, which left room for unpaid domestic and child-rearing work. Kroc had outlawed the hiring of women because he worried they would distract his male crew and attract rowdy customers. But by the mid-1960s, franchisees needed new workers. One franchisee in Illinois started hiring housewives because, as he put it: “I had been scraping the bottom of the barrel in hiring all males, and I figured that the best female help available would be better that the hiring of the worst male help.” He went on to say that hiring women was a “breakthrough,” and he stood his ground when Kroc tried to make him fire his female workers. Other franchisees soon caught on, and by the 1970s, women workers were filling the jobs at McDonald’s. Kroc didn’t concede, however, without imposing unwritten rules on the new female hires. Along with his commitment to poverty wages, he was also a dedicated sexist: “We figured that the first women we hired should be kind of flat-chested,” he said. “We didn’t want them to be attractive to the boys.” Women with “serious complexion problems” were not allowed to work the drive-in window, and female workers were assigned to lighter tasks because “certain jobs, such as grill, require far more stamina than most women possess.” Despite Kroc’s sexist views, the writing was on the wall. In the late 1960s, virtually no women worked for McDonald’s; today, 65 percent of fast-food workers are women, and many of them are their family’s primary breadwinners. Overall, 56 percent of low-wage workers are women, including 70 percent of food servers and 72 percent of retail cashiers. From 1950 to 2000, female participation in the US civilian labor force grew by almost 50 million, an astounding 257 percent increase. Ironically, the rising entry of women into the workforce as second-household-income earners further intensified the rise of the fast-food industry. With overworked parents increasingly strapped for time, more people turned to cheap and convenient time saving fixes that eased their burden a little bit. Happy Meals and one-stop shopping centers were ideal forms of consumption for the new American working class. A third development that helped forge the modern fast-food working class was the heightened mobilization of racism in the 1980s and 1990s to pass policy reforms that forced adults into the low-wage workforce, subsidized their poverty wages, gained popular consent to pay them so miserably, and disciplined them to accept horrible working conditions as the new norm. This recomposition of the low-wage working-class under neoliberal capitalism cannot be understood apart from the reconstitution of gendered and racial hierarchies during this era. Beginning in the 1980s, conservatives and business activists, as well as some Democrats, began aggressively targeting the social safety net created by the 1930s New Deal and the 1960s Great Society. As part of this, they put welfare programs in their crosshairs — not the existence of welfare in itself, but access to it that wasn’t attached to wage work. They gained support for such attacks by demonizing the poor, especially poor African Americans, and framing poverty as a product of individual and behavioral flaws rather than structural forces. They articulated new or revived old racist tropes: the welfare queen, the black criminal, the deadbeat parent, all of which became staples of 1980s and 1990s political culture and still linger today. African Americans, and particularly black mothers, came to be seen as unworthy of public largesse and emerged as scapegoats through whom, in part, the assault on the welfare state and the expansion of a low-wage fraction of the working class could proceed. The cornerstone of this process became “welfare reform,” which consisted of a range of local and national initiatives in the 1980s and 1990s and culminated in the broader effort’s crown jewel: Bill Clinton’s 1996 Personal Responsibility and Work Opportunity Reconciliation Act. Specifically, welfare reform meant redefining welfare as workfare, a lever to push hundreds of thousands into the low-wage workforce and accept “personal responsibility.” Access to social assistance, particularly for single mothers, would be contingent upon finding and keeping low-wage work. Throughout US history, as sociologists Jane Collins and Victoria Mayer note, welfare policy has been linked to class politics and capitalist prerogatives regarding the labor market. There is a long tradition, going back to at least the 1930s, of sexist and racist social welfare policy aimed at maintaining pliable workforces in specific sectors like agriculture and domestic labor. “But today,” Collins and Mayer write, “the connections between welfare and work may be tighter than ever before.” In the 1980s and 1990s, conservative anti-state ideology combined with the new racial and gendered tropes to create consent for welfare reform that would reinvent welfare as coercion towards low-wage labor. The historical moment in which welfare reform happened is important to the story. It’s not coincidental that there was a push by business lobbies and their political allies for workfare beginning in the late 1980s. As the retail and service sectors kept expanding, there weren’t enough new workers willing to take their poverty-wage jobs. A labor shortage was creating a rising demand for workers, and this was leading to rising wages. William Kolburg of the National Alliance of Business spoke to Corporate America’s alarm when he testified in favor of workfare in the late 1980s. “We have a window of opportunity in the next few years,” Collins and Mayer quote him as saying. “There are two-fifths less young people coming into the labor force over the next ten years…. we have had the smallest growth in the labor force that we have had since the Thirties.” By pushing for workfare as an engine for “job creation,” he argued, “we have a chance to find jobs, entry-level jobs, for people that are trained, willing and able to work.” Pierce Quinlan, a leader of the National Alliance of Business, remarked that “the training of welfare recipients to fill vacancies on the private sector is not only good social policy; it is good economic policy.” The Chamber of Commerce celebrated Clinton’s welfare reform as a “reassertion of America’s work ethic.” It’s no secret why these business groups pushed for welfare reform. As Loïc Wacquant notes, it not only “abolished the right to assistance” and replaced it with “the obligation of unskilled and underpaid wage labor,” but it also disciplined workers to accept the new, post-industrial work regime. To survive, workers needed to obey and internalize the dictates of service and retail labor. Welfare reform was “a training ground for contingency, low wages, the loss of protective rules, and the absence of opportunity.” Workers were thrown into a bewildering mix of draining work, navigation of bureaucracy, instability and insecurity in daily life, and low expectations. It may have been a nightmare for workers, but it was the perfect scenario for employers in the low-wage service and retail sectors. Welfare reform flooded the labor market with new low-wage workers who could be paid less-than-subsistence wages with few prospects for mobility. These workers were disproportionately mothers. For example, in 1992, only 51 percent of never-married mothers with a high school education or less were employed. By 2000 that number had skyrocketed to 76 percent. And we know where these new workers were finding jobs — according to a 2004 Department of Health and Human Services report, their employers were “heavily concentrated in the service sector, are large companies, in urban areas, and offer irregular schedules or alternative arrangements (e.g. on-call, temporary employment and relatively low wages.” There’s disagreement over the extent to which welfare reform, as opposed to new tax credits or a growing economy in the 1990s, drove these shifts. But what’s not debatable is that welfare reform created a new apparatus that went far in disciplining a new labor force to accept the conditions of low-wage work with little hope of escaping from poverty. This new status quo wreaked havoc on the ability of mothers to provide stable care for their children. Forced to take poverty-wage jobs to hold onto social assistance, they now had “both hands tied,” write Collins and Mayer. On the one hand, they had to work miserable jobs at sub-subsistence pay and inconvenient hours. On the other hand, they lacked the economic resources to guarantee decent conditions for their children while they worked bad jobs at erratic shifts — and were then scapegoated for being bad mothers who neglected their children. With work schedules not known more than a few days in advance, and with technology leading to a rise in just-in-time shifts, the instability only intensified. Politicians and low-wage employers cynically used the rhetoric of “opportunity,” “responsibility,” and “family values” as cover to further entrench a modern poverty-wage regime on the backs of these women. And here, we also see a fix that McDonald’s and other low-wage service and retail corporations needed to keep their business model going. Poor Americans had to seek out McJobs, and in turn survive on those McJobs with welfare subsidies. Fast food didn’t need to pay its breadwinning workers a wage they could subsist on; taxpayers would foot the bill. These subsidies continue to come by the billions, with McDonald’s the top beneficiary in fast food. Today, 56 percent of all state and federal public assistance spending, a total of $153 billion a year, goes to working families. Also worth noting is the utter cynicism of those who denounce welfare as well as a $15 dollar hourly wage, since welfare and low wages in the modern era must go together, and were constructed precisely to do so.\nThe McWorking Class Together these developments helped create the fast-food workforce of the twenty-first century that is at the center of FF15. Big changes in political economy, the aggressiveness of employers, new workforce demographics, and reactionary public policy all coalesced to reproduce, on a much greater scale, a broad set of workers that the fast-food industry could exploit while maintaining its historic commitment to finding outside subsidies to pay poverty wages. This story is not unique to fast food; a similar story could be told about Walmart and other companies. But fast-food wages are some of the lowest in the entire job market, and significantly raising them would likely lead to a major restructuring of the wage floor across the entire nation. Opponents of a $15 wage sometimes say that fast-food jobs are “teenage jobs” that are undeserving of such a pay increase. But today, nothing could be further from the truth. After the 2008 financial crisis, the general trends towards worse jobs and lower wages have only intensified. Fast-food jobs are not the jobs of adolescents anymore, but the jobs of breadwinning adults — especially mothers. Since 2009, 58 percent of all new work has been low-wage, and fast food is at the vanguard of this job creation. The author of a recent employment report told the New York Times, “Fast food is driving the bulk of the job growth at the low end — the job gains there are absolutely phenomenal.” Bloomberg Business, drawing on the US Census Bureau’s Current Population Survey, says that sixteen- to nineteen-year olds only made up 17 percent of food preparation and serving workers in 2010, a steep decline from the past. “The sheer number of adults in the industry has just exploded,” says the director of UC Berkeley’s Food Labor Research Center. The reason is that good jobs are on the decline, and as unemployment has risen since 2008, more and more adults have had to find work in food service. Since 2008, higher-wage industries have shed a million jobs overall while lower-wage industries have added 1.8 million jobs. Whereas about 70 percent of fast-food employees were twenty years old or younger in 1994, 70 percent were twenty years old or older by 2012 — and 40 percent were over 25. This means that in a shop of ten workers in the 1980s, seven or eight of them might be teens, but today seven or eight would be in their twenties, thirties, or older, and a substantial chunk of these workers would be parents. The 2008 crisis and its aftermath have deepened the decades-long formation of a disempowered, low-wage working class, growing in non-industrial sectors, that increasingly makes up the mass of American workers. Since the economic crash, the precarious conditions of the fast-food workforce have only intensified. Wages remain dismally low. As of May 2014, the median hourly wage for “Food Preparation and Serving Workers, Including Fast Food,” was $8.85. Wages at McDonald’s are likely even lower than this. (The impossibility of surviving on McWages without subsidies was starkly seen when McDonald’s posted a budgeting tool for its workers on its website, which quickly backfired on the company.) Meanwhile, McDonald’s rhetoric about opportunity and mobility for workers within the company rings hollow. Almost 90 percent of fast-food jobs are frontline occupations; only 2.2 percent are managerial, professional, or technical jobs. The chances of moving up in the company through hard work are very slim. At the same time, between 2010 and 2014, the McDonald’s CEO took home over $39 million in total pay and, after retiring, was given a $3 million consulting gig. Bloomberg Business highlighted the astounding pay disparity in McDonald’s back in 2012 when it noted that one worker it profiled, who made $8.25 an hour, would have to work a million hours, or over a century, to earn the $8.75 million that the company’s CEO took in that year. Scheduling and hours are as much grievances as low wages. Only 28 percent of core frontline fast-food workers regularly get forty or more hours per week, compared to 75 percent of the country’s workforce as a whole. Schedules are often posted just a day or two before the work week begins, creating havoc in workers’ personal lives, especially when it comes to things like child care, attending classes, or needing to find a second or third job. With new software that monitors customer traffic, workers are often sent home early or called in the day-of. But if they don’t show up, they lose favor with management and their hours can be cut. The power that fast-food bosses have over scheduling, and the level of “flexibility” it demands of its workers to maximize profit, severely limits employees’ ability to have a basic level of stability and predictability in their work and personal lives. Wage theft is another travesty in the fast-food industry. Managers are under intense pressure to squeeze workers and cut costs while getting ever more productivity out of them. Almost 90 percent of fast-food workers report wage theft. Sixty percent of fast-food workers report being required to perform tasks before clocking in or after clocking out. Forty-six percent have not been paid for all hours worked or all tasks performed. Wage theft results from of a lack of power and collective organization among workers — employers steal wages when they think employees are powerless to do something about it. In addition to wage theft, worker safety is a big issue in fast-food jobs. Many fast-food workers involved in FF15 talk about the blatant disregard management has for workplace safety. Some have burns and scars from working with the hot machines and ingredients, or bad backs from standing and lifting. Customers consistently harass workers and regularly leave disgusting messes for them to clean up. All this creates a high-stress work environment, and for some of the lowest wages in the nation. Moreover, as mentioned, racial and gendered inequalities underlay modern fast-food labor. The more sensational and overt examples of this make headlines, but the deeper ways in which the industry both exploits and reproduces racialized and gendered class inequalities is less noticed. Few postwar industries have benefitted as much as fast food from the channeling of women and people of color into low-wage, subsidized jobs. And by entrenching and maintaining a deeply gendered and racialized poverty wage regime, fast-food companies have helped to maintain class hierarchies marked by race and sex. Today, as in the past, a disproportionate number of workers in low-wage jobs are women and people of color. In 2014, according to the Bureau of Labor Statistics, 62 percent of “Combined food preparation and serving workers, including fast food” were women, while 20.5 percent were African American and 19 percent were Latino. Meanwhile, like many billionaire corporations, McDonald’s is careful to constantly publicize its commitment to “diversity” and its multicultural bona fidas. Its “Global Diversity Chief Officer” even wrote an entire book on McDonald’s professed commitment to diversity, and over the past few years McDonald’s has begun a full-on offensive to co-opt urban black cultural signifiers to appeal to the very same African-American consumer base that suffers most from its sub-subsistence wages and its obesity- and heart disease-inducing food. The starkest expression of this is its “365black” website, which it calls “the new social space for celebrating African American history and culture 365 days a year.” The website promotes its corporate sponsorship of gospel tours, awards festivals, and “community” projects aimed at “spreading love.” Meanwhile, fast-food wages and working conditions remain a key force in reproducing the conditions that maintain disproportionate poverty levels among the black working poor. To be sure, many of these trends are not unique to fast food. They could easily apply to other sectors, and the downward pressure on workers’ livelihoods operates in virtually all working-class jobs. But fast food has been an industry at the forefront of these trends, and the prominence of FF15 makes it important that we understand this historical context.", "url": "https://www.jacobinmag.com/2015/09/mcdonalds-seiu-minimum-wage-strike"}