{"authors": ["Erik Olin Wright", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:17", "date_modify": "2020-05-04 19:54:17", "date_publish": "2015-12-23 00:00:00", "description": null, "filename": "2015_12_socialism-marxism-democracy-inequality-erik-olin-wright_1588622057.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2015/12/23122715/8540431008_c0d758bb68_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_12_socialism-marxism-democracy-inequality-erik-olin-wright_1588622057.html", "title": "Why Class Matters", "title_page": "Why Class Matters", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "EOW\nHere’s the short punchy version. There are four ways to be anticapitalist: smashing capitalism, taming capitalism, escaping capitalism, or eroding capitalism.\nSmashing capitalism was the vision of nineteenth and twentieth century revolutionary communism. The scenario is familiar to most people: you organize a political movement, a political party being the standard form. In historically contingent circumstances, that political movement is capable of seizing state power. That could be through an electoral process — that’s not inherently ruled out — or through a violent insurrection.\nRegardless of how you seize state power, the first task is to refashion the state itself to make it an appropriate instrument of transformation, and the second task is to smash the centers of power of the existing social structure.\nThat enables you to launch the long process of building the alternative. You can think of the smashing capitalism strategy as “smash first, build second.” That was the revolutionary ideal of the twentieth century.\nI think the evidence from those experiments is pretty strong that capitalism is not the kind of social order — at least in its complex forms — that’s smashable. The last line of the Wobbly anthem, “Solidarity Forever,” is, “We can bring to birth a new world from the ashes of the old.” What the revolutionary movements of the twentieth century showed is that it is possible to build a new world in the ashes of the old — it’s just not the world that anybody wanted.\nThere were achievements of the Russian and Chinese Revolutions, of course, but they did not create a world of democratic egalitarian empowerment of ordinary people capable of fashioning their own destinies. That’s not what came out of those revolutions.\nWhether that is just because of the historically adverse circumstances under which those revolutions took place or because this is an intrinsic consequence of the strategy of smashing, of burning down, of trying to build on the ashes — that’s debateable.\nMy bet is that the chaotic forces that get unleashed in the smashing strategy are so unwieldy and dangerous that they lead to repressive responses to recreate the conditions of social integration. Social order and security is such a pressing need that it creates forms of domination in the new post-revolutionary society that then are extremely hard to dislodge, perhaps impossible.\nWe certainly have no evidence that if you smash the old structure, you can build an emancipatory, egalitarian, democratic participatory environment for human flourishing. I think smashing is off the historical agenda in complex societies.\nA democratic transition, I think, is possible. That’s what I’m going to argue for. The problem is that the ruptural moment will unleash hugely chaotic processes, even under democratic conditions. That’s the Syriza problem. If they abandoned the euro, they would be plunged into an economic chaos. Then the question is, could they, at that point, engage in a rupture with capitalism, under democratic conditions?\nWhat’s going to happen in the next election? Things are going to be miserable. In the next election, some parties say, “Come vote for us, and we’re going to bring Greece back into the euro.” And what’s going to happen? European bankers are going to say, “Yeah, yeah, vote for these guys and we’re going to help you out.” Then they’ll get the subsidies. There is no way that you’re going to be able to survive the number of elections needed under democratic conditions to traverse the transition trough, the decline in standards of living and material conditions of life.\nIn a complex society, where there’s so much interdependency, the amount of suffering that gets unleashed by an effort at rupture makes it unsustainable under democratic conditions. Under non-democratic conditions, the problem is that authoritarian transitions don’t result in democratic and participatory destinations. I am not prepared to formally proclaim an impossibility theorem. That’s too strong. There are too many contingencies, but my intuition is that a system-level ruptural transformation of capitalism is impossible.\nThe other options are taming, escaping, or eroding. Taming is the social-democratic solution. You still capture the state. You get state power in the formal sense. You don’t have societal power because capitalism is still very strong. Capital controls the means of investment.\nYou do have state power in the governmental sense. You have political power. You have enough mobilization behind that political power to negotiate a deal with capital where you create constraints on capital that are beneficial for workers, but there has to be a quid pro quo collaboration by workers in a capitalist development project. It’s a class compromise.\nTaming capitalism is meant to reduce and neutralize the worst harms that are generated by capitalism — risks to the individuals, deficits in public goods, negative externalities. You mitigate these harms, but you leave capitalism intact and just deal with the symptoms. Taming capitalism works pretty well. At least it worked for a while. It’s gotten a little ragged lately.\nNeoliberal ideology says that the social-democratic solutions are permanently off the table. That’s just self-justification of elite privilege. Even in a relatively open, globalized, financialized world, there’s no reason to believe (aside from the political power of the forces of neoliberalism) that taming mechanisms can’t be reestablished. They just haven’t been reestablished yet.\nOne thought is that the global crises of climate change are going to kill off neoliberalism because there’s no way that the market is going to solve the adaptation problem, let alone the mitigation problem. The giant public works needed to deal just with the disruptions of climate change are going to open up another space for a new round of the affirmative state providing public goods and social justice goods through mitigating the adverse effects of global warming.\nIn any case, that’s taming capitalism. It’s certainly ragged today compared to thirty, forty years ago, but still part of the menu of anticapitalism.\nEscaping capitalism is the more individualistic solution. The hippies indulged in it in the 1960s and 1970s. The pioneers in the Western movement in the United States were escaping capitalism. That was their central impulse: to move west, to get out of the clutches of the banks and the landlords. Voluntary simplicity movements or anti-consumerist movements are a kind of escaping capitalism — people wanting to scale back in order to live more balanced lives.\nEscaping capitalism is an interesting form of anticapitalism. It has very little potential on its own to be transformative. It can, in some settings, provide useful experiments, useful models for things that could then be generalized in altered conditions.\nEroding capitalism is the least familiar. That’s more in line, I think, with certain anarchist tendencies. Proudhon can be thought of as an early eroder. His view was, “You create worker cooperatives. They’ll be attractive ways of life. Workers are going to flock to them. Capitalism will collapse because it can’t find anybody to work.”\nIt’s a simple-minded view of how worker cooperatives would survive and compete with capitalists. Marx, in his famous debate with Proudhon, thought this was ridiculous and dismissed it along with utopian socialist projects as just pointless little experiments. Worse than pointless — they were diversionary.\nLater, Marx actually was pretty favorable to worker cooperatives and other forms of cooperatives, and felt that they were palpable demonstrations that workers could actually govern production and that the problem with them as a strategy was that they wouldn’t be tolerated. If they were ever a threat to capital, they’d just be destroyed.\nThere are a lot of examples today of economic iniatives that fall under the eroding capitalism rubric. The Brazilian Landless Workers Movement’s project of land reform, land occupations, other new forms of community and agricultural production, worker cooperatives, and many other forms of cooperatives. Wikipedia destroys the three-hundred-year-old capitalist market in encyclopedias within a decade. It is way more productive than any capitalist model, as is Linux and other open-source software. That’s eroding capitalism.\nNow eroding capitalism, I argue, is extremely appealing and utterly far-fetched as a strategy for transcending capitalism. It’s appealing because even with a really hostile environment, you can do something. And I think activists always are desperate to work out,”What can I do?” My students are constantly asking me, “What can I do? I want to do something constructive.”\nEroding capitalism builds these alternatives, and they all make life better. They are definitely illustrations of better ways of life. They may be effective, but is it likely that the accumulative effect of community gardens, worker coops, Wikipedia, and the like, is to actually undermine the possibility of capitalism and transcend it to an alternative? This seems pretty far-fetched.\nI don’t think it’s plausible that the anarchist strategy of just getting on with the business of building the world you want in the world that exists is likely to succeed in transforming the world as a whole. But I do think if eroding is combined with new ways of thinking about taming capitalism, then it might be possible to create a long-term political strategy which combines the best of the progressive side of social democracy with the most constructive versions of anarchist community activism and bottom-up creativity.\nThis means combining anarchism and social democracy in a couplet where you erode capitalism to make it more tamable, and you tame capitalism to make it more erode-able. You span that political divide, rejecting the vision of smashing capitalism because of its impossibility and escaping capitalism because of its narcissism.\nI think that couplet is not an easy one. It’s not a linear one. It’s not as if once you’ve figured out the formula, you then just let it rip and it’s going to take care of itself. No, it’s going to be filled with contradictions. That’s intrinsic to the process: the way in which you tame capitalism is by making deals with capital. Those deals are inherently unstable. They depend upon the balance of forces.\nBut what’s the alternative? It’s not that I’m making a prediction, “If you do this, we will win.” I’m saying that I don’t see any other strategy that has any plausibility of being able to transcend capitalism.", "url": "https://www.jacobinmag.com/2015/12/socialism-marxism-democracy-inequality-erik-olin-wright"}