{"authors": ["John Milios", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:04", "date_modify": "2020-05-04 19:53:04", "date_publish": "2015-06-17 00:00:00", "description": null, "filename": "2015_06__1588621984.html", "image_url": "https://images.jacobinmag.com/2015/06/17004214/1000-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_06__1588621984.html", "title": "Austerity Isn’t Irrational", "title_page": "Austerity Isn’t Irrational", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nAfter the outbreak of the 2008 global economic crisis, extreme austerity policies prevailed in many parts of the developed capitalist world, especially in the European Union (EU) and the eurozone. Austerity has been criticized as an irrational policy, which further deepens the economic crisis by creating a vicious cycle of falling effective demand, recession, and over-indebtedness. However, these criticisms can hardly explain why this “irrational” or “wrong” policy persists, despite its “failures.” In reality, economic crises express themselves not only in a lack of effective demand, but above all in a reduction of profitability of the capitalist class. Austerity constitutes a strategy for raising capital’s profit rate. Austerity is the cornerstone of neoliberal policies. On the surface, it works as a strategy of reducing entrepreneurial cost. Austerity reduces labor costs of the private sector, increases profit per (labor) unit cost, and thus boosts the profit rate. It is complemented by economizing in the use of “material capital” (alas, another demand curtailing strategy); and also by institutional changes that, on the one hand, enhance capital mobility and competition and, on the other, strengthen the power of managers in the enterprise and shareholders and bondholders in society. As regards fiscal consolidation, austerity gives priority to budget cuts over public revenue, reducing taxes on capital and high incomes, and downsizing the welfare state. However, what is cost for the capitalist class is the living standard of the working majority of society. This applies also to the welfare state, whose services can be perceived as a form of social wage. It is clear, therefore, that austerity is primarily a class policy. It constantly promotes the interests of capital against those of the workers, professionals, pensioners, unemployed, and economically vulnerable groups. In the long run, it aims at creating a model of labor with fewer rights and less social protection, with low and flexible wages, and no substantial bargaining power for wage earners. Austerity does lead, of course, to recession. However, recession puts pressure on every individual entrepreneur, both capitalists or middle bourgeoisie, to reduce all forms of costs, to more intensively follow the path of relative surplus value, i.e. to try to consolidate her profit margins through wage cuts, intensification of the labor process, infringement of labor regulations and workers’ rights, massive redundancies, etc. From the perspective of big capital’s interests, recession thus gives birth to a process of creative destruction. There is a redistribution of income and power to the benefit of capital, and concentration of wealth in fewer hands as small and medium enterprises, especially in retail trade, are being cleared up by big enterprises and shopping malls. This strategy has its own rationality that is not completely obvious at first glance. It perceives the crisis as an opportunity for a historic shift in the correlations of forces to the benefit of the capitalist power, subjecting European societies to the conditions of the unfettered functioning of financial markets, attempting to place all consequences of the systemic capitalist crisis on the shoulders of working people. This is the reason why, in a situation of such an intensification of social antagonisms like today, a government that wants to side with labor and the social majority cannot even imagine succumbing to pressures to continue implementing austerity policies.\nCapital vs. Workers Neoliberalism is a form of capitalist govermentality, i.e. of organizing the power of capital over the working classes and the social majority. It is based on the one hand on austerity, as already argued, and on the other on the crucial regulatory role of the globalized financial markets. The financial sphere is not simply the reign of speculation, is not a casino — it is much more an overseeing mechanism. In his analysis in Volume III of Capital, Marx illustrates that social capital is being occupied by two “subjects”: a “money capitalist: and a “functioning capitalist.” In the course of a lending process, the money capitalist becomes the recipient and proprietor of a security, that is to say a written promise of payment from the functioning capitalist, the manager. In Marx’s own words: “In the production process, the functioning capitalist represents capital against the wage-labourers as the property of others, and the money capitalist participates in the exploitation of labour as represented by the functioning capitalist.” Secondary contradictions between the managers and the big financial investors certainly do exist, but they are minor in comparison to the capital-labor class contradiction. Every enterprise is Janus-faced — comprising, on the one hand, the production apparatus per se and, on the other, its financial existence, its shares and bonds, which are being traded on the global financial markets. The production of surplus value constitutes a battlefield situation where resistance is being encountered, meaning that the final outcome can never be taken for granted. Techniques of risk management, organized within the very mode of functioning of the deregulated money market, are a critical point in the management of resistance from labor, and thus for promoting and stabilizing austerity. Financial markets generate a structure for overseeing the effectiveness of individual capitals, that is to say a type of supervision of capital movement. The demand for high financial value puts pressure on individual capitals (enterprises) for more intensive and more effective exploitation of labor, for greater profitability. This pressure is transmitted through a variety of different channels. To give one example, when a big company is dependent on financial markets for its funding, every suspicion of inadequate valorization increases the cost of funding, reduces the capability that funding will be available and depresses share and bond prices. Confronted with such a climate, the forces of labor within the politicized environment of the enterprise face the dilemma of deciding whether to accept the employers’ unfavorable terms, implying loss of their own bargaining position, or face the possibility of losing their job: accept the “laws of capital” or live with insecurity and unemployment. This pressure affects the whole organization of the production process. It therefore presupposes not only increasing despotism of managers over workers but also flexibility in the labor market and high unemployment. Hence, market discipline must be conceived as synonymous with capital discipline. The theoretical sketching that I tried to present above apprehends the phenomenon of capitalist globalization and financialization as a complex technology of power, the main aspect of which is the organization of capitalist power relations. It is a technology of power formed by different institutions, procedures, analyses and reflections, calculations, tactics, and embedding patterns that allow for the exercise of this specific, albeit very complex, function that organizes the efficiency of capitalist power relations through the workings of financial markets. The working majority in practically every capitalist country will always be opposed to shrinking of wages and precarious employment, degeneration and cutback of public services, raising the cost of education and health care, weakening of democratic institutions, strengthening of repression. They will always conceive the “crisis of labor” (i.e. unemployment, precarious, and underpaid work, etc.) as a social illness that shall be tackled by itself, not as a side effect of the recovery of profits. The continuation of austerity is therefore a matter of the social relation of forces. As Marx commented on the limits of the working-day: The capitalist maintains his rights as a purchaser when he tries to make the working-day as long as possible . . . On the other hand . . . the labourer maintains his right as seller when he wishes to reduce the working-day to one of definite normal duration. There is here therefore an antinomy, of right against right, both equally bearing the seal of the law of exchange. Between equal rights force decides. Beyond certain limits, the subjection of all parts of social life to the unfettered function of markets and the dictate of profitability may function as ‘political risk’ for the neoliberal establishment, since it can easily trigger uncontrolled social outbreaks. It is characteristic that Franklin D. Roosevelt in his speech at Madison Square Garden, New York City on October 31, 1936, presented his New Deal policies as the golden mean between “organized money” and “organized mob.” In the eurozone, political risk is supposedly being minimized through the introduction of an institutional framework in which austerity is the only way to deal with economic and financial instability. In the usual nation-state setting, a single national fiscal authority stands behind a single national central bank. As we know, this is not the case with the eurozone: there is no solid and uniform fiscal authority behind the European Central Bank (ECB). Member states issue debt in a currency which they do not control in terms of central banking (they are not able to “print” euros or any other type of currency, at least not for a considerably long period of time). Member states will not always have the necessary liquidity to pay off bondholders. This will make the downsizing of the welfare state a precondition for financial solvency. The ruling European elites have thus voluntarily subjected themselves to a high degree of sovereign default risk in order to consolidate the neoliberal strategies. In other words, they have jointly decided to exploit the crisis as a means to further neoliberalize state governance. Member states are faced with a dilemma: austerity, cuts, and privatizations or risk default. By and large, these are commensurate choices. Even in the latter scenario, member states would accept a rescue package, the content of which is again austerity-cuts-privatizations. This conservative perspective recognizes as a “moral hazard” any policy that supports the interests of the working class, expands the public space, supports the welfare state, and organizes the reproduction of society beyond and outside the scope of markets. In this framework, the strategic question for EU neoliberalism is to define the level of austerity that targets an optimal balance between political risk and moral hazard. Generally speaking, these two risks, the “moral” and the “political” one, move in opposite directions due to their consequences in the political conjuncture. When moral hazard increases, political risk declines and vice-versa. Therefore, the tension (when they encounter each other) results in an appropriate balance between them. The “independent authorities,” being immunized against any democratic control, especially on issues related to the economy (the main example here is the ECB), create a mechanism for detecting the balance between these two “risks.” Nevertheless, this mechanism will always remain incomplete. Class struggle will always create contingent events.", "url": "https://www.jacobinmag.com/2015/06/syriza-greece-austerity-neoliberalism-tsipras/"}