{"authors": ["Khury Petersen-Smith", "Brian Bean", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:50:33", "date_modify": "2020-05-04 19:50:33", "date_publish": "2015-06-17 00:00:00", "description": null, "filename": "2015_06__1588621833.html", "image_url": "https://images.jacobinmag.com/2015/06/17004104/15844469998_c3979a1237_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_06__1588621833.html", "title": "Nothing Short of Liberation", "title_page": "Nothing Short of Liberation", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn the fall of 2012, the Chicago Teachers Union (CTU) carried out the most important public-sector strike in recent years. While the teachers on strike demanded higher wages and defended their benefits, the heart and soul of the strike was the fight for what the union called, in a special report, “The Schools Chicago Students Deserve.” The CTU rightly identified school closings, tracking students through standardized testing, high class sizes and a host of other grievances in a district whose students are 90 percent people of color for what they are: racist. The report did not mince words. It called the segregation of schools and the deteriorating conditions faced by black students in particular an “apartheid-like system.” The CTU put a special emphasis on defending its black members, who were disproportionately targeted by school closings. In 2011, black teachers in the CTU comprised 28% of educators overall, they accounted for 56.6% of teachers in schools slated for closure, disciplinary “turnaround” and other punitive actions. By highlighting the fact that its members’ fight for “good teaching conditions” was intertwined with the fight against segregated schooling, racist probationary policies, poverty and the criminalization of students, the union showed in practice how the politics of solidarity and the recognition of shared interests can contribute to a powerful struggle. The conventional wisdom was that the adults in Chicago most affected by the strike — those whose children attended Chicago Public Schools — would resent the CTU for taking an action that inevitably disrupted their lives. But after three days of teachers on the picket lines, opinion polls showed that 63 percent of black Chicagoans and 66 percent of Latinos supported the teachers. It is straightforward why two-thirds of black and Latino Chicagoans supported the union: CTU members, whose largest demographic is white, supported them. We hold up this multiracial, working-class resistance as an important, though overlooked, example for an important conversation taking place among those struggling against racism: where white antiracists fit in. At the moment, the dominant notion of white solidarity with people of color is informed by the concept of “ally-ship.” Ally-ship is one aspect of a broader framework for understanding race and fighting racism, but this article aims to assess the politics and practices of ally-ship and to offer a critique. This critique is not unique to us, but has been developing — in, for example, the writings of Andrea Smith, Rev. Osagyefo Sekou, Indigenous Action Media and David Leonard — with both similar and dissimilar themes to the ones we highlight. The fact that many people believe it is possible and necessary for those who are not black to oppose anti-black racism and to stand with people of color against it is important. But we believe the dominant notion of ally-ship has limitations that ultimately disarm the struggle against black oppression. We believe that ally-ship is a step in the right direction — but we need to go well beyond it if our objective is overcoming racism and winning black liberation. Our case is that the politics of solidarity — encapsulated in the old labor movement slogan “An injury to one is an injury to all” and given concrete expression in strikes and struggles like the CTU’s — can take us forward.\nSupport or Solidarity? The term “ally,” as it is used by proponents of social justice, can mean different things to different people. To some, the role of allies is to “shut up and listen” to people of color, as the activist and blogger Mia McKenzie wrote on the Black Girl Dangerous website. In this conception, allies must necessarily defer completely to people of color regarding the nature of racism and strategies for fighting it. The role of white allies is to passively support the activity of black activists. Alternatively, there are those who argue that the role of allies flows from the power that white people (some extend this analysis to people of color who are not black) have as a result of privileges they supposedly enjoy in a system of white supremacy. Here, being an ally involves accessing that privilege to make antiracist decisions from positions of power that benefit people of color. White allies become the agents for dismantling racism, while blacks and other people of color are the passive recipients of their efforts. While these two approaches to ally-ship diverge, they both flow from a relationship in which white allies and people of color are relegated to “supporters” and “supported,” rather than working together to confront racism. The problems with this become apparent in practice. To cite one example, In August of last year, while the people of Ferguson rose up in response to the murder of Mike Brown, an organizing meeting of anti–police brutality activists began with a discussion of what was taking place. As this group of activists shared their reflections, an interesting pattern emerged. Almost all of the people who were white, while only a fraction of the room, spent their time talking about their reaction as a white person, how their white friends and family were responding, and how it was necessary to engage the racists who demonstrated support for Mike Brown’s murderer Darren Wilson and teach them the error of their ways. This was a room filled with well-intentioned and committed activists, but it was notable that as the country was experiencing the most sustained black rebellion in decades and the long-running epidemic of police murder of people of color had finally gained attention — when even the mainstream media were forced to question the level of repression used by the state — the conversation in this room became about the experience of whites. What contributed to a conversation of antiracists being re-centered from black people rising up against violence by the state against bullet, baton, and gas to the individual experience of white people? With so much to reflect upon in this historical moment, the prescription that an analysis of white people’s role in the movement is the paramount task of these activists it shifts the conversation to this. The problem wasn’t with any of the individuals involved, but that the conception of ally-ship as the framework to understand the fight against oppression led white activists to view everything through the lens of their identity, rather than their solidarity with the struggle. This perspective is rooted in an approach to oppression and racism that often limits the struggle to interpersonal interactions, and that downplays the structures of power that produce racism and other oppressions. The ironic and contradictory effect was to focus attention on “white allies,” as opposed to the oppression that people strive to dismantle, and the history and politics of past struggles that must be learned and discussed to guide the fights of today.\nBeyond the Individual People embrace the idea of ally-ship in an effort to build solidarity, and this is a positive thing. And many prescriptions for activists put forward in the name of ally-ship are practices that should be uncontroversial in any movement. Suggestions to listen, to read more and to be mindful of dynamics in organizing spaces are important. No one likes an arrogant person who dominates a meeting and gets in the way of effective organizing. We should also challenge any attempt to push aside a discussion of racism or sexism in the name of “unity.” Real unity requires confronting oppression directly and as a central political priority. We want the voices of women and people of color to be central to our movements, not sidelined. Our problem is with the one-sided focus on interpersonal dynamics that has a distorting effect on our understanding of racism and how to fight it. This makes it appear as though racism originates within white individuals. Without an acknowledgment of the historical and structural mechanisms that produce racism, political action and discussion can be reduced to confessing and talking about oneself. As feminist activist and co-founder of INCITE! Women of Color Against Violence Andrea Smith writes in her essay “The Problem with Privilege“: In my experience working with a multitude of antiracist organizing projects over the years, I frequently found myself participating in various workshops in which participants were asked to reflect on their gender/race/sexuality/class/etc privilege. These workshops had a bit of a self-help orientation to them: “I am so and so, and I have x privilege.” It was never quite clear what the point of these confessions were. It was not as if other participants did not know the confessor in question had her/his proclaimed privilege. It did not appear that these individual confessions actually led to any political projects to dismantle the structures of domination that enabled their privilege. Rather, the confessions became the political project themselves. A description of the role of allies by Keith Edwards in an essay “Aspiring Social Justice Ally Development: a Conceptual Model” highlights the tendency for development to be seen as solely a matter of self-reflection: Rather than being defensive, allies actively seek out critique, not only to be effective allies, but also as a means to realizing their own humanity. Allies are open to feedback not only as a way to helping the other, but also as a means to illuminate their own oppressive socialization and privilege, a necessary part of the ongoing process of liberating members of the privileged group from their own internalized dominant socialization. What is missing from this description of being an ally is activism — activity to challenge racism beyond one’s self. The project of being an ally against oppression becomes primarily a moral one to be a good person. This is a far cry from, for example, the mass social struggles of the 1960s, when, for example, the movement against Jim Crow segregation and myriad other forms of institutionalized racism involved a black-led rebellion against racist laws and institutions. The difference between a collective confrontation with police, courts, laws and social institutions, and a personal effort to rid one’s self of racist ideas, while confroanting others who espouse them, isn’t just a difference of scale. It is a different project.\nA Question of Power When the importance of social change through mass struggle is lost, so is the critique of oppressive institutions. In “Motivating People from Privileged Groups to Support Social Justice,” Diane Goodman writes, “[I]n order to attain educational and social reforms, we need to enlist the support of people from privileged groups, including those who are policymakers, administrators, teachers, parents, community members, and students.” There are a number of problematic assumptions underlying this passage. The first is a profound confusion of who has power. It is simply not true that parents and students, on the one hand, and school district officials or university administrators, on the other, can be lumped into the same social category or even located on the same continuum. Some of these people are in a fundamentally different position of control regarding the shaping of school and university policies. There is another questionable assumption that individuals who part of a social institution like a school must participate in oppression in ways that perpetuates it. Ally-ship therefore involves rejecting or being self-conscious about this participation. But a teacher, no matter how racist or antiracist, is not ultimately responsible for the “school-to-prison pipeline,” for example. That is shaped by mass incarceration and the criminalization of black and brown youth, which is driven in turn by the dominant elite of society. Antiracism in the classroom is crucially important. But we must be clear that the school-to-prison pipeline can only be brought down through a mass confrontation with the existing criminal justice regime. Without this recognition of structural and social sources of oppression, it all comes down to individuals being encouraged to be good allies. Keith Edwards’ widely read article cited above, for example, is meant to guide university administrators in their ally-ship: Student affairs professionals committed to social justice education seek not only to develop their own critical consciousness and change oppressive systems as transformative educators, but also to educate students to engage in societal transformation towards a vision of social justice. Again, to be clear, self-consciously antiracist teaching is important. But Edwards’ article doesn’t advocate practical antiracist measures such as recruitment and acceptance of more students of color, scholarships for students of color, affirmative action and quotas for hiring faculty of color, ethnic studies courses and departments, and so on. Instead, the object of social justice education seems to be the development of empathy for people who face oppression. This may be positive in an interpersonal context, but it is far from sufficient if discriminatory structural practices remain, even while a growing number of students and staff are “aware” of them. Along the same lines, another problematic assumption about ally-ship is the conflation of awareness of racism with social change itself. Racism persists as a central feature of US society, not because the population is made up of bigoted individuals whose attitudes are reflected in social and political institutions, but because racism is an indispensable tool for the ruling class to specially oppress black people and divide the working-class majority. Of course, fighting racism necessarily involves changing racist attitudes, and not simply changing laws or policies. But wholesale changes in racist ideas come about as a product of mass social struggle. Thus, in 1942, 70 percent of white Americans polled thought that black and white children should attend separate schools. By 1982, that number had dropped to 10 percent. The key factor behind that ideological sea change was not millions of one-on-one conversations over a period of forty years, but the impact of the civil rights movement. Or to be more precise: those interpersonal conversations did take place in their millions, but they arose and were shaped by the actions of the civil rights movement. Witnessing people confronting racist police, marching against unjust laws, enrolling in and attending previously segregated schools in defiance of racist mobs, and countless other examples of civil rights and black power struggles had a tangible impact on the consciousness of people who had previously accepted segregation.\nNot Just an Idea For a more contemporary example, consider how the conversation about racism in the US is different today from what existed before the rebellion in Ferguson last summer. That rebellion and the rise of the Black Lives Matter movement has, for millions of people, forced a reckoning with dominant, racist ideas that have gone unchallenged in the criminal justice system and media for so long. It isn’t enough for people to reconsider racist ideas. Unless masses of people are involved in resisting racist institutions, the oppression of black people and other people of color will remain. With the rise of the Black Lives Matter movement, we have new opportunities to involve ourselves in the fight for social change by demanding justice for black victims of the criminal justice system and disrupting business as usual until we get it. Because the contemporary notion of ally-ship was developed in an academic context, in which the critique of the system only goes so far though, it is flawed as a guide to action in struggle. Another illustration of the problems of ally-ship arose during a Black Lives Matter march last winter. When thousands of activists marched onto a highway onramp, riot police formed a line to prevent the protesters from taking the Interstate. A call came from the front of the march for “white allies to the front!” — that is, white protesters should place themselves in front of the cops so they would bear the brunt of repression and arrests since they are less vulnerable than blacks in the criminal justice system. The idea that white activists can and should put their bodies on the line in the fight against racism is welcome — it is far in advance of the idea that the main task of white allies is to confront racist whites in their immediate lives. But even putting aside the fact that there are plenty of white people who are also vulnerable in the criminal justice system — people with criminal records, parents of children, etc — the idea of a solid line of white allies facing down police at a Black Lives Matter action presents several problems. First, it moves black people or other people of color off of the front line of a fight for their own freedom, leaving white activists to face the police on behalf of black ones. Another problem was the belief among some that white activists would be in a better position to negotiate with police by virtue of their whiteness. Not only does this also put white people in the position of speaking for black activists who might prefer to speak for themselves, but it also assumes that ordinary white people can assert some influence over police force that actually does “serve and protect” them.\nForging a United Fight We want to be clear about what we are not saying. First, while we are critical of the concept of ally-ship because of its overemphasis on the interpersonal, we do believe that interpersonal dynamics are important. While racism and other forms of oppression are structural in nature — driven by the dominant institutions of this society — they are experienced in profoundly personal ways by people of color, women, LGBTQ people, indigenous people, migrants and others directly impacted by oppression. We do want to ensure that we develop the structures in our organizing and in political spaces that are conscious of these dynamics. Solidarity should not be confused with the liberal sentiment of “can’t we all just get along,” which glosses over the landscapes of oppression that we inhabit. Second, our critique of ally-ship is not based on the reductionist workerism voiced by some organizations that call themselves socialist–those that insist that organizing against racism “distracts” from working-class issues like wages or the potential for multiracial solidarity. The struggle against racism isn’t something that exists alongside the class struggle — the two are interwoven and inseparable. Class and race in America have a clear and particular connection — those who ignore this fall prey, in effect, to a different sort identity politics that equates “worker” with white workers and that horribly misses the dynamics that shape the US working class and its struggles. We should only have to point out two of these struggles to illustrate the point — today’s Fight for 15 campaign to raise the minimum wage that prominently features low-wage workers of color, and the explosion of marches and job actions by primarily Latino workers in 2006 against legislation targeting undocumented immigrants. For these reasons, we put forward this case about the concept of ally-ship in the belief that the slogan Black Lives Matter and the black-led movement that has arisen against police violence are critical to the future of the class struggle overall. We believe the politics of solidarity offer a different political path, based on a process of building on shared interests among the majority of people in society, which exist because of the multiple ways that capitalism and racism interlock. That solidarity has to be forged — by identifying those shared interests and taking up the difficult, but essential, task of building a united fight. The basis for working-class solidarity with the black struggle for freedom isn’t some abstract socialist theory — it lies in the position that black people occupy in US class society. Because the enslavement of blacks was the foundation of American capitalism, and racism against black people has been central to US society ever since, the oppression of African Americans is central to the oppression of other people, whether they know it or not. Conversely, the struggle for black freedom is a struggle for all oppressed people. We agree with Alicia Garza, the activist and co-creator of the slogan “#BlackLivesMatter”, when she writes: Given the disproportionate impact state violence has on Black lives, we understand that when Black people in this country get free, the benefits will be wide-reaching and transformative for society as a whole. When we are able to end hyper-criminalization and sexualization of Black people and end the poverty, control and surveillance of Black people, every single person in this world has a better shot at getting and staying free. When black people get free, everybody gets free. This is why we call on Black people and our allies to take up the call that Black lives matter. We’re not saying Black lives are more important than other lives, or that other lives are not criminalized and oppressed in various ways. We remain in active solidarity with all oppressed people who are fighting for their liberation, and we know that our destinies are intertwined.", "url": "https://www.jacobinmag.com/2015/06/black-lives-matter-police-brutality-allies/"}