{"authors": ["Peter Rossman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:29", "date_modify": "2020-05-04 19:52:29", "date_publish": "2015-05-17 00:00:00", "description": null, "filename": "2015_05__1588621949.html", "image_url": "https://images.jacobinmag.com/2015/05/17003844/TPP2-e1349980588177-1280x960-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_05__1588621949.html", "title": "Against the Trans-Pacific Partnership", "title_page": "Against the Trans-Pacific Partnership", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Critical public debate on President Obama’s coveted Trans-Pacific Partnership (TPP) had been undergoing an important shift in the buildup to his failure yesterday to secure “fast track” authority. Opponents of the trade deal being secretly negotiated between the United States, Australia, Brunei, Canada, Chile, Japan, Malaysia, Mexico, New Zealand, Peru, Singapore, and Vietnam have moved the discussion beyond its putative impact on jobs and growth and closer to the agreement’s broader ramifications.\nA recent letter to congressional leaders by well-known legal experts and economist Joseph Stiglitz points out that the treaty’s investment enforcement mechanism, investor-to-state dispute settlement (ISDS), has been used “to challenge a broad range of policies aimed at protecting the environment, improving public health and safety, and regulating industry.” Massachusetts Sen. Elizabeth Warren has raised similar concerns, and Paul Krugman has written that the TPP “is not a trade agreement. It’s about intellectual property and dispute settlement.”\nThis widening of the debate has shifted it into areas that reflect at least some of the concerns long voiced by labor, social movement, and environmental activists. However, the TPP is about much more than intellectual property and dispute settlement.\nFocusing exclusively on legal aspects of ISDS obscures the larger corporate project embedded in the TPP and similar treaties deliberately and misleadingly branded as “trade” agreements (like the European Union-US TTIP, which is also now being negotiated in secret). At the heart of the project is a drive to expand the already considerable reach and power of transnational investors by restricting governments’ regulatory power and opening up vast new areas for private investment.\nThe TPP, incorporating and building on the regional and bilateral investment treaties that have been layered onto the World Trade Organization (WTO), challenges, limits, and does away with governments’ regulatory function through a variety of mechanisms, beginning with an expansive definition of investment and so-called investor rights.\nInvestment, we know from the leaked investment chapter published by Wikileaks, is defined as “any asset that is owned or controlled by an investor, directly or indirectly, whose characteristics include a commitment of capital or other resources, expectation of gain or profit, or assumption or risk.”\nThis takes the notion of “investment” far beyond the investment in real assets that has traditionally defined foreign direct investment (FDI). It now covers intellectual property, including trademarks, patents and copyrights, licenses, authorizations, franchises, authorizations, debt instruments, and speculative tools like options, futures, and derivatives. (Negotiators are wrangling over whether to include sovereign debt.)\nMere attempts at an investment would be covered under the scope of the agreement: investing is defined as “concrete action or actions to make an investment, such as channeling resources or capital in order to set up a business, or applying for permits or licenses.”\nThe treaty gives transnational investors “security” and preemptive protection against not only expropriation (a rarity in today’s world, and for which there already exists a considerable body of jurisprudence) but also against “indirect expropriation” — any measure that might arguably reduce the future value of the investment or anticipated profits.\nThe right to “fair and equitable treatment”and a “minimum standard of treatment” provides insurance against new regulatory or even tax measures: the minimum standard which defines investor “expectations” is the degree of regulation established by a previous government. In investment treaty language, this is the “right to a stable investment environment.”\nThe investment provisions would be retroactive. Like similar trade and investment treaties, the TPP’s investment provisions prohibit any restrictions on the repatriation of profits or funds. Governments may not impose capital controls to halt attacks on their currencies, restrict “hot money” flows in a crisis, or impose financial transaction taxes.\nThe TPP (like the TTIP) significantly expands upon investment provisions in the WTO that have already substantially augmented corporate power and reduced public policy space.\nThe WTO rules limit, among other things, governments’ ability to favor or support domestic producers in ways that “discriminate” against foreign investors. Disputes initiated by one country against another are adjudicated by the WTO’s Dispute Resolution Body.\nThe ultimate enforcement penalty is sanctions. Indeed, the mere threat of sanctions is a potent tool for restricting government action and forcing through investor-friendly changes to law and regulations. A successful WTO complaint by Japan last year compelled the Canadian province of Ontario to eliminate a key element of legislation aiding local renewable energy producers. The US is now similarly pressing India through the WTO to drop support for local solar power production.\nThe WTO agreements have been hugely effective at — to name just a few of its accomplishments — restricting access to affordable medicines, strengthening the pharmaceutical giants, promoting corporate agriculture at the expense of national and local food production, stimulating and locking in privatization, and generally reducing the regulatory power of government.\nThe TPP, TTIP, and similar agreements are “WTO-plus” — they go much further in establishing corporate prerogatives at the expense of the public interest.\nCorporate lobbyists failed to push through a comprehensive investment chapter at the WTO. The WTO treaty on Trade Related Investment Measures (TRIMS), which severely restricts the use of local content and other performance requirements, is the residue of the failed attempt to secure comprehensive investment provisions at the WTO.\nSo parallel to the WTO negotiations, transnational capital has pursued an investment agenda within the framework of “trade” negotiations. ISDS allows transnational investors to directly contest government laws and regulations at the national and sub-national level, and to demand financial compensation through closed arbitration panels — which bypass domestic courts, have no established jurisprudence, and exclude appeal.\nThese expanded powers create a parallel, private legal system that confers exclusive privileges on transnational capital. Governments pay the awards and foot the bill for the proceedings, which run into the millions.\nWhile ISDS has been included in investment treaties going back decades, it was sparingly used until the North American Free Trade Agreement (NAFTA) — which went into effect in 1994, one year before the WTO — hitched the procedure to the concept of “indirect expropriation” in its Chapter 11 investment provisions.\nNotorious NAFTA Chapter 11 cases include the 1996 suit by the US Metalclad Corporation against the government of Mexico for closing a waste treatment facility after a geological audit indicated severe threats to the local water supply. The tribunal ruled that the cancellation of a state-level zoning permit constituted regulatory expropriation and ordered the government to pay the company $16.7 million in damages.\nIn 1997 the US Ethyl Corporation sued the Canadian government for a ban imposed on its gasoline additive, MMT, a proven health hazard no longer used in the US and even prohibited in California. Ethyl claimed that the proscription “expropriated” its assets in Canada and that legislative debate itself constituted an expropriation of its assets because public criticism of MMT damaged the company’s reputation. In 1998, the Canadian government withdrew the legislation that banned MMT and paid Ethyl Corp $13 million to settle the case.\nThe Ethyl Corporation MMT case shows how ISDS lawsuits can lead directly to changes in national or sub-national legislation. Tribunals can order “injunctive relief” in addition to compensation.\nIn 2011 the federal government of Canada agreed to a $130 million settlement with AbitibiBowater, a pulp and paper manufacturer based in Canada but registered in Delaware, an onshore tax haven. Three years before, the company had closed its mill in Newfoundland and asserted the right to sell its timber harvesting and water use permits, which were contingent on production.\nUnder Canada’s constitution land and water use rights belong to the provinces, so the provincial government moved to take back the licenses. AbitibiBowater sidestepped the courts, filed a Chapter 11 claim, and won — setting a precedent that effectively privatizes Canada’s public ownership of natural resources by allowing foreign companies to assert ownership claims.\n“By recognizing a proprietary claim to water taking and forest harvesting rights, Canada has gone much further than any international tribunal established under NAFTA rules, or to our knowledge, under the rules of other international investment treaties,” a lawyer for the public interest advocacy group Council of Canada explained to the Canadian Parliament in 2011.\nIn November 2012, demanding $100 million in compensation, the US pharmaceutical company Eli Lilly launched a suit to attack Canadian court decisions that rejected monopoly patent protections for two of its drugs after finding insufficient evidence they could deliver the promised results.\nThat same month, US-based Lone Pine Resources announced its intention to seek $250 million in damages from the government of Quebec in response to its popular moratorium on fracking under the St. Lawrence River. Although the fracking threat to water resources is well documented, Lone Pine contends the moratorium is “arbitrary, capricious and illegal” under Chapter 11.\nInvestment treaties have also recently become a contentious issue in Europe, as a result of the proposed inclusion of ISDS in the TTIP. But the EU and its members have already signed over 1,400 bilateral investment treaties (BITS). Another multilateral treaty, the 1998 Energy Charter Treaty (ECT), signed by 51 member countries and the EU, contains binding ISDS provisions that are increasingly being used.\nThere are now over 3,000 such agreements. Most of the approximately 300 regional and bilateral free-trade agreements (FTAs) are essentially investment treaties. The thousands of BITs deal exclusively with investment issues. Over 90 percent of these treaties include ISDS provisions.\nAs with NAFTA Chapter 11, transnational investors have made increasing use of these treaties to challenge laws and regulations that protect worker and consumer health and safety, the environment, and public health. The mere threat of an expensive lawsuit hangs over virtually all regulatory measures, and can also be used as a bargaining chip.\nThe Australian/Canadian Pacific Rim Mining Company is claiming $300 million in compensation from the government of El Salvador after being denied a permit on environmental grounds. The compensation is for “losses” for investment that never even took place. Pacific Rim, a company with no US operations, set up a company in Nevada in order to use the Central American Free Trade Agreement (CAFTA).\nIn June 2012, the French services provider Veolia — which has been sued by US municipalities for dumping untreated waste water and overcharging residents — used the France-Egypt BIT to sue the Egyptian government for increasing minimum wages. In May 2012, the Swedish energy company Vattenfall launched a claim under the Energy Charter Act against Germany’s phase-out of nuclear energy following the Fukushima nuclear catastrophe, although one of the two plants operated by the company in Germany has in fact been out of operation since 2007 due to numerous incidents.\nThese cases are just a few among a proliferation that has grown since the early NAFTA days, and now average roughly fifty a year. The compensation settlements have also escalated. The initial $1.77 billion award to Occidental Petroleum for Ecuador’s termination of a contract due to extensive pollution has swelled to over USD $3 billion, with the addition of compound interest calculated from the date of the “violation.” A small coterie of investment law firms, which also serve as corporate lobbyists, has surfed the litigation boom and dominates the business.\nBut the inclusion of ISDS in investment treaties is only part of the treaty architecture. The TPP, like similar treaties, includes chapters on intellectual property, “regulatory coherence,” transparency, state-owned enterprises, and public procurement, all of which carve out new, expanded powers for transnational capital.\nThe chapters form an interrelated whole. The TPP chapters on regulatory coherence and transparency, for example, work in tandem to formalize and institutionalize corporate influence over virtually every area of regulation and public policy. The chapters on public procurement and state-owned enterprises further reduce governments’ capacity to use public spending in pursuit of public policy objectives, and the intellectual property provisions intensify corporate control over medicines, digital publishing, copyrights, patents, and biological resources, affecting every aspect of our lives.\nLooming over the TPP and TTIP is the Trade in Services Agreement (TISA) being promoted by a group of countries (including the US, EU, Japan, Canada, Australia, New Zealand, Switzerland, and South Korea) who call themselves “the Really Good Friends of Services.” TISA would circumvent the inconveniences of the WTO’s General Agreement on Trade in Services by opening up virtually all service sectors, public and private, to transnational investors and make it impossible for governments to take them back into public ownership or impose new regulatory requirements.\nTTIP, like the TPP and regional and bilateral agreements, is a package deal: ISDS, toxic as it is, is only part of the package. Other treaty enforcement mechanisms are available. All investment agreements negotiated between states include state-to-state dispute resolution provisions. The history of WTO disputes shows how capital can use these provisions to their advantage. Philip Morris is currently challenging Australia’s Supreme Court–approved law on cigarette packaging at the WTO, as well as through bilateral investment treaties. Investor protection can also be enforced through commercial contracts backed up by the treaties.\nThe Cato Institute, a prominent right-wing think tank, understands this and advocates “purging” the controversial ISDS from TPP and TTIP in order to preserve the treaties’ core deregulatory mission. But treaties like the TPP, even if they are stripped of ISDS, still remain a corporate power grab. The Left must therefore campaign against the treaty project as a whole. Given the sweeping powers the treaties grant transnational capital, they cannot be tweaked. No environmental or labor “safeguards” can contain their toxic impact.\nPublic opposition sank the Multilateral Agreement on Investment (MAI) — the first post-WTO attempt to negotiate a comprehensive investment treaty among members of the OECD, the world’s richest countries — in 1998. In 2004 the anti-NAFTA backlash sank the attempt to expand NAFTA throughout South and Central America and the Caribbean through the proposed Free Trade Area of the Americas. The treaties can be successfully resisted.\nThe TPP will continue to be marketed as a trade agreement, and trade, we are told, is good because it creates jobs and growth. But cross-border exchange in goods plays only a minor role in this and similar treaties, which essentially aim to expand the possibilities for cross-border investment. Investment flows, not tariffs, are the key to understanding how and why jobs are created and destroyed in today’s world in which 80 percent of world trade takes place between and within transnational companies. Corporations, not countries, do the trading.\nTariffs were significantly rolled back under the pre-WTO General Agreement on Tariffs and Trade (GATT) and, with the notable exception of agriculture, are at a historical low as a percentage of the value of world trade. Tariff-only trade models that exclude investment flows have consistently and massively failed to predict the employment impact of trade deals from NAFTA on, and recent studies have confirmed that the effect of WTO-style tariff reductions on economic growth has been minimal.\nThese models do not (and cannot) take into account the impact of environmental degradation, the reduction and elimination of public services, the lack of affordable medicines and health care, or the further deregulation of finance. They are worse than useless as either predictive tools or as a guide to action.\nNAFTA was sold in the US with the promise of 200,000 new jobs. It is now generally conceded to have led to the loss of over 600,000 manufacturing jobs. It also promoted the massive dumping of subsidized corn over the Mexican border, destroying peasant agriculture and driving millions of desperate men and women north in search of work.\nFrom a US perspective, the TPP and other mega-deals will certainly contribute to the continued offshoring of jobs; the employment impact of the agreement on the totality of countries involved in the deal is difficult to predict given the diverse nature of those countries’ economies. What is certain, however, is the negative impact on unquantifiable areas like environmental destruction and the quality of public services.\nThe overriding purpose of the TPP and similar deals is to shrink the power of governments to regulate in the public interest, expand the range and scope of capital accumulation, pillage and patent the commons, and narrow the scope for democratic political action. That is sufficient reason for socialists to oppose them.", "url": "https://www.jacobinmag.com/2015/05/trans-pacific-partnership-obama-fast-track-nafta/"}