{"authors": ["Michal Rozworski", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:57", "date_modify": "2020-05-04 19:58:57", "date_publish": "2015-12-17 00:00:00", "description": null, "filename": "2015_12__1588622337.html", "image_url": "https://images.jacobinmag.com/2015/12/17010729/uber-detroit-launch.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_12__1588622337.html", "title": "Why We Fight Uber", "title_page": "Why We Fight Uber", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The fight against the sharing economy, and Uber in particular, can be disorienting. Opposition is often painted as technophobia. The good guys in this story are Uber and progress; on the other side are opponents afraid of flexibility and smartphones, kicking and screaming against a future already here.\nIn many ways, this is like the fight of the Luddites (machine smashers) two hundred years ago at the dawn of the Industrial Revolution. While the Luddites were fighting the way technology was used to further exploit rather than liberate workers, they were and are misrepresented as simply being afraid of and opposing technology.\nJust as power looms and other machines inaugurated a technological revolution that ultimately produced more work for the many and greater wealth for the few, so too are modern technologies enriching Silicon Valley’s billionaires at the expense of drivers, delivery folk, and all manner of service workers.\nThe sharing economy that consumers experience as a friendly convenience is, for workers, a low-wage, precarious trap. It would sound all too familiar to the skilled cloth-makers who wanted machines to give them more leisure and continued control over their work, but instead found themselves subsidizing the profits of the machine owners in England’s “satanic mills.”\nToday, few technologies have as much potential for easy cooperative management as those of the currently mislabeled sharing economy. These tools are not to blame. In fact, Internet-based technologies are an opportunity for worker management. As Mike Konczal wrote in the Nation a year ago:\nGiven that the workers already own all the capital in the form of their cars, why aren’t they collecting all the profits? Worker cooperatives are difficult to start when there’s massive capital needed up front, or when it’s necessary to coordinate a lot of different types of workers . . . If any set of companies deserves to have its rentiers euthanized, it’s those of the “sharing economy,” in which management relies heavily on the individual ownership of capital, providing only coordination and branding.\nSilicon Valley’s version of sharing means that while we carry the risks of illness, breakdown, and everything else that comes with own our tools — the cars that we drive for Uber or the computers we use for online Taskrabbit chores — they get to say how the gains from our services are distributed.\nThe Luddites surely would be impressed that technology owners can now get rich simply by connecting people with each other. If looms and frames were the symbol for Luddites of their degradation, today’s drivers, couriers, and taskrabbits can only point to ephemeral platforms and apps. While the Luddites attacked their bosses by destroying their looms and faced violent reprisals sanctioned by law, the privately run digital networks of today are virtually impossible to physically disrupt while having the full force of the law behind them.\nInstead of producing greater socialization that spreads wealth and decision-making, the sharing economy funnels money and control toward the top. Yet today’s world still has space for some pretty old-school demands the Luddites would recognize. They wanted to work less and have a say over how they worked (with technology!). We too could be using the fruits of technology to get ever-shorter workweeks, cooperate more, and manage aspects of the economy together.\nFaced with the charge of technophobia, we must remember that the fight against Uber is a fight for a technology that could be used to distribute work more equally and foster genuine cooperation. That fight, I hope, won’t be misremembered in some dystopian twenty-third century capitalism. Though I’m sure the Luddites would have had the same hopes of us.", "url": "https://www.jacobinmag.com/2015/12/uber-sharing-economy-taskrabbit-silicon-valley-technology/"}