{"authors": ["Carmen Boullosa", "Mike Wallace", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic"], "date_download": "2020-05-04 19:59:55", "date_modify": "2020-05-04 19:59:55", "date_publish": "2015-03-17 00:00:00", "description": null, "filename": "2015_03_mexico-drug-cartel-neoliberalism_1588622395.html", "image_url": "https://images.jacobinmag.com/2015/03/17003140/1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_03_mexico-drug-cartel-neoliberalism_1588622395.html", "title": "How the Cartels Were Born", "title_page": "How the Cartels Were Born", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nRonald Reagan cast himself as a law and order man, ready to reverse the drug policies of Jimmy Carter, who indeed had pulled back from Nixonian fanaticism. Once in office, Reagan set up the South Florida Task Force to go nose-to-nose with the cocaine barons, whose airplanes had been dropping drug-bundles at sea, where they were picked up by fast boats and whisked ashore. Headed by Vice President George H. W. Bush, the task force brought in the army and navy, and put Miami vice in its crosshairs. It worked. Surveillance planes and helicopter gunships throttled the hitherto wide-open Colombia-Florida connection. But the Colombians simply abandoned their direct shuttle service and increased the flow through their Mexican pipeline. Soon, however, the Mexicans shifted from being simply a well-paid smuggling service to demanding and getting full partnership status. In short order kingpins Félix Gallardo, Fonseca Carrillo, and Caro Quintero were providing 90 percent of the cocaine pouring into the US market, and raking in an estimated $5 billion a year. In 1984, the DEA began referring to the triumvirate as the Guadalajara Cartel, echoing the by-then common reference to the Medellín and Cali Cartels. In 1986, with the Iran-Contra scandal about to splash into public view and midterm elections approaching, Reagan turned up the volume of his drug war rhetoric. “My generation will remember how Americans swung into action when we were attacked in World War II,” he cried. “Now we’re in another war for our freedom.” He signed a National Security Decision Directive declaring drug trafficking a threat to national security. This permitted the US Department of Defense to get involved in a wide variety of anti-drug activities, especially on the Mexico-USA border. Reagan also won passage of the 1986 Anti-Drug Abuse Act, which required the executive branch to annually certify that any country receiving US assistance was cooperating fully with US anti-narcotics efforts, or taking steps deemed sufficient on its own. (Thus did the US, the world’s largest consumer of illegal drugs, set itself up as judge of other countries’ progress on solving a problem the US could not.) If the country in question failed to measure up — and Mexico was an obvious target — it would be struck off from all foreign aid programs. Worse (particularly for Mexico), the US would oppose any loan requests that country might make to multilateral development banks (like the International Monetary Fund). President de la Madrid (1982–1988) fell in line, declaring drug trafficking a threat to Mexico’s national security, and authorizing an expanded military presence in anti-narcotics efforts. He had little choice. Mexico had tumbled into a full-blown economic crisis. Certification, hence access to credit, had now become essential. In the course of wrestling with it, de la Madrid would begin to engineer a profound transformation in the country’s economy and polity, a transformation that would have major consequences for the organization of the drug business. In the mid 1970s the United States had added to its woes of recession those of inflation, due in considerable measure to OPEC’s success in raising oil prices. To “whip inflation now,” the Federal Reserve Bank helmed by Chairman Paul Volcker began to raise interest rates, eventually driving the prime rate from 12 percent to 21 percent. By 1980 this had precipitated a far deeper downturn, which did lower inflation, but only by driving up unemployment to levels not seen since the Great Depression of the 1930s. The recession Volcker engineered in the US had an even more devastating impact on Mexico, as the interest rate on rolling over its short term loans nearly doubled. By 1982, simply meeting interest payments would have required more than $8 billion per year. Worse, just as expenses soared, oil prices sagged. Mexico made clear it could no longer make its interest payments. US banks were terrified. Thirteen of the biggest stood to collectively lose $60 billion if Mexico went under — 48 percent of their combined capital. And if Mexico fell, most of Latin America would come tumbling down behind it, likely triggering a collapse of the entire international financial system. The United States, accordingly, put together a multi-billion-dollar package of loans and credits, and worked out an unofficial debt moratorium. The World Bank and IMF were wheeled in to provide Mexico with emergency loans with which to resume paying the US banks, rescuing them from their own recklessness. These institutions in turn — following the model first worked out in New York’s fiscal crisis in 1975 — now imposed “structural adjustment” on Mexico. The creditors demanded privatization of public services, cuts in government social programs, a wider opening to foreign investment, and a ruthless concentration on paying back loans and interest. This arm-twisting was given an ideological gloss, reviving hoary shibboleths about the inherent superiority of market over state, repackaged as “neoliberalism.” Executing these demands fell first to President de la Madrid and then to his successor Carlos Salinas de Gortari (1988–1994). Both believed the state apparatus was a burden upon Mexican business that should be thrown off, along with much else in the Partido Revolucionario Institucional (PRI) inherited project and ideology. Structural adjustment prompted privatization, the opening of the country to foreign investment, and the reorientation of the agricultural sector towards exports. The 1980s were known as la Década Perdida, or “lost decade,” wherein 800,000 jobs evaporated and dispossessed farmers streamed into urban centers. Salinas continued the policies, selling off large public enterprises at bargain basement prices. The process created a new class of Mexican tycoons. In 1987 there was one Mexican on the Forbes billionaire list. When Salinas left office in 1994 there were twenty-four. Labor, conversely, was battered. When public enterprises were privatized their collective agreements were scrapped, benefits removed, “flexible” work rules imposed. Salinas also distanced the party from its long-affiliated labor unions, and ordered a series of attacks on more militant entities. At the same time, state subsidies that had kept the price of basic foodstuffs low were suddenly removed. The price of milk, tortillas, petrol, electricity and public transport shot up at the same time wages were being slashed. The provision of basic social services was similarly cut so that fewer people had access to free health care and education. The neoliberal offensive was particularly devastating to farm labor, partly as a consequence of the establishment of the North American Free Trade Agreement (NAFTA) (which Salinas negotiated with George H. W. Bush, and which went into effect under Bill Clinton). A principal US condition for entering the agreement was that Mexico undo the agrarian reforms embedded in Article 27 of the Constitution, a principal legacy of the Revolution. Communal (ejido) land could now be divided and converted into private property. Price regulation of staple crops was scrapped. Tariffs and quotas on agricultural imports were removed. Subsidies that had supported small-scale farmers were deleted. The results of establishing a putatively equal trade between grossly unequal partners was that US agribusiness pushed thousands of Mexican farmers out of their own markets. The price of corn dropped by around 50 percent after the NAFTA agreement, and the number of farmers living in poverty rose by a third. In the six years following the introduction of NAFTA, two million farmers abandoned their land. They flocked from country shacks to the burgeoning barrios of Mexico City; to the spreading slums of Tijuana and Ciudad Juárez to work in maquiladoras (assembly plants just across the border); and to the United States. The crisis transformed the narcotics industry. Indeed it is impossible to understand the tremendous changes in the drug business during the combined sexenios of Salinas and Zedillo (1989–2000) without taking into account the massive political, economic, and ideological transformations wrought during that decade and the previous one by the PRI-governed state. Farmers, unable to sustain themselves due to the removal of subsidies and the arrival of competition from US agri-corporations, found the burgeoning market for marijuana and poppies their only avenue to surviving on the land. The army of the urban unemployed gave the cartels a deep pool from which to recruit foot soldiers, and the miserably paid (and eminently corruptible) police and military provided the muscle with which to protect their interests.\nThe spread of everyday crime — aided by the rapid declension and corruption of local police forces — demoralized civil society, and provided a climate within which grander forms of criminality would flourish. The adoption of free trade, and the deeper integration of the Mexican economy with that of the United States, dramatically increased cross-border traffic, making it far easier to insert narcotics into the stream of northward-bound commodities. Some NAFTA rules were of particular help: because maquiladoras were exempt from tariffs and subject to only minimal inspections, Mexican smugglers began buying up such factories to use as fronts for shipping cocaine. Narcotrafficking had formerly been integrated into the PRI corporatist state, an under-the-table equivalent of labor, peasant, and business organizations. As such it was subject to a certain degree of regulatory control, and to unofficial taxation, in return for the de facto licensing of smuggling (the plaza system). The state’s abandonment of this form of corporatist inclusion contributed to the independent growth and power of organized crime syndicates. The glorification of wealth and entrepreneurialism provided a cultural environment that boosted the social standing of narco businessmen. As in the former Soviet Union and other post-communist regimes, a neoliberal shock treatment simultaneously produced millionaires and gangsters, a twinning that Forbes registered by including them on the same list. The weakening of the state and the glorification of “free enterprise” conferred authority and legitimacy on the private sector in which drug traffickers were now key players. As Peter Watt and Roberto Zepeda have argued, neoliberals prioritized accumulation of profit over social welfare, ruthless competition over cooperation, and the sanctification of private property and wealth over community and civic responsibility. These propositions — the cornerstones and guiding principles of free-market ideology — also formed the dominant ideology of crime syndicates.\nLead or Silver Seven months after taking office in 1989, veteran drug warrior George H.W. Bush declared in his first televised address to the nation that “All of us agree that the gravest domestic threat facing our nation today is drugs.” He proposed spending billions on a militarized response. Salinas signed on. He approved a binational Northern Border Response Force to monitor the border, created the National Institute to Combat Drugs (INCD) modeled on the DEA, and permitted US Airborne Warning and Control System (AWACS) planes to fly over Mexican airspace to track drug-trafficking activity. Bush had a specific request as well: Salinas was to (metaphorically) bring him the head of Miguel Ángel Félix Gallardo, chief of the Guadalajara Cartel. The kingpin was duly reeled in, and Bush certified that Mexico had cooperated fully in drug control efforts, praising in particular the arrest of Félix Gallardo. But the decapitation of the Guadalajara Cartel — a centralized regulatory gangster regime supported by the PRI state — gave the “free market” its head. The consequences for the criminal sector would be even more disastrous than the havoc wrought in the legitimate economy by the larger neoliberal project. At first, the lieutenants of the original cartel attempted to establish some ground rules. Following Félix Gallardo’s arrest in 1989, the sub-capos held a gangster summit in the resort city of Acapulco. The attendees were almost all members of the old Sinaloan narco tribe, long intertwined by ties of marriage, friendship, or business. They proceeded to parcel out production territories and smuggling routes to the US market, awarding themselves the plazas that had once been assigned by the now-defunct DFS. The resulting organizations were called cartels, misleadingly, as they were in fact fragments of an exploded cartel — the byproducts of de-cartelization — and most were manned by descendants or associates of the original Guadalajaran trio. As the 1990s unfolded, all these Mexican traffickers flourished as it proved impossible to resurrect the old relationship between subservient crook and dominant state. With the ascendancy of the cocaine trade, cartel profits had soared into the empyrean, and the amount of money they could now budget for bribery allowed the narcos to make irresistible offers — unrefusable when accompanied by threats of violence, as in the formulation plomo o plata (“lead or silver”): take the money or die. As neoliberal doctrine dictated, state regulation had been thrown off and replaced by a privatized regime, in which public officials were suborned on a piecemeal basis. President Ernesto Zedillo, only too aware of the party’s peril, opted during his term (1994–2000) for some efforts at reform. The military increased its role, a policy strongly promoted by Bill Clinton’s appointed drug czar, Barry McCaffrey, a recently retired four-star general whose previous position had been as head of the United States Southern Command. Given the need to stay in US good graces, Zedillo followed suit. He established a five-year plan (the National Program for the Control of Drugs) that significantly widened the involvement of the (reluctant) armed forces beyond its sporadic participation in eradication programs. Just as the PRI state was opting for militarization, so was the Gulf Cartel, the dominant traffickers in the northeast. In 1998, after a period of intra-cartel battling, one Osiel Cárdenas Guillén had murdered his way to the top. Cárdenas Guillén set out to create a Praetorian Guard. He turned for assistance to Arturo Guzmán Decena, a commander in the army’s elite Grupo Aeromóvil de Fuerzas Especiales (GAFE), Mexico’s equivalent of the Green Berets. GAFE had been given counter-insurgency training, and dispatched by President Salinas to crush the Zapatistas. Guzmán Decena left the barracks altogether, and signed up with Cárdenas Guillén. He brought with him thirty or so GAFE colleagues and an arsenal of the army’s most sophisticated weaponry and surveillance equipment. Soon they had expanded beyond bodyguard duties to become the Gulf Cartel’s mercenary military arm, and dubbed themselves Los Zetas. Meanwhile, in the western and central states, the fragmented organizations that had emerged after the breakup of the Guadalajara Cartel — the Sinaloa, Juárez, and Arellano Félix cartels — had fallen out and launched assaults and counter-assaults against one another. Now the streets ran red, with hundreds killed, tortured, and disappeared. At first Ciudad Juárez and Tijuana were the principal battlegrounds, but then the fighting expanded to adjoining states. At the very same time that a centralized regulatory regime gave way to chaotic competition in the criminal underworld, the centralized one-party regime gave way to a competitive party system in the world of politics. In 2000, Mexican voters were looking for a fresh face, and the National Action Party (PAN) provided one. Vicente Fox was put forward by a right-wing party, but he was not a hardline ideologue or a Catholic militant. Raised on the family ranch, he had earned a BA in business administration, buffed his credentials at Harvard Business School, and worked his way up to the presidency of Coca-Cola for Mexico and Latin America. Fox was forthright and folksy. His personality promised change. On July 2, 2000, he won the presidency with the support of a center-left coalition. President Vicente Fox’s administration began on December 1, 2000. Three weeks later, on December 22, he went to Tijuana and declared war on the Arellano Félix Organization. Fox put the Arellano Félix brothers at the top of his hit list because they were the drug lords “most wanted” by the USA Eight months earlier, the Brothers had captured Pepe Patiño, an anti-drug prosecutor who had been working closely with the DEA and FBI. They tortured him by breaking virtually every bone in his body before slowly finishing him off by crushing his skull in a pneumatic vise. This galvanized US law enforcement. Fox was eager to oblige, especially since his old friend George W. Bush — another cowboy-booted, plainspoken, rich rancher and former governor — had agreed to make the first foreign trip of his presidency (2001–2009) to Mexico. Fox had an agenda stuffed with asks — notably opening up the border, and winning legal status for the 3.5 million undocumented Mexicans working in the States — and he wanted to have his anti-crime credentials in order. But embarassingly, barely a week later and on the eve of Fox’s tête-à-tête with Bush, El Chapo Guzmán of the Sinaloa Cartel escaped from jail. Within a week, Fox went to Culiacán, heart of El Chapo’s Sinaloan domain, and repeated his Tijuana in-your-face challenge, escalating it to countrywide status. Announcing a “Cruzada Nacional contra el Narcotráfico y el Crimen Organizado,” he declared “a war without quarter against the drug traffickers and the pernicious criminal mafias.” The tough talk was enough to meet the immediate need. When Bush arrived in February, he expressed confidence that Fox was committed to fighting traffickers, and even admitted, with an unusual degree of candor, the obvious but uncomfortable fact that Mexicans were selling drugs north of the border because Americans were buying them.\nMexico Seguro and America’s Iron River But when Fox visited the White House in September 2001 — Bush’s first state visit — he was welcomed with open arms but empty hands. The dot com bubble had burst, and the US had sunk into a recession that dragged Mexico’s NAFTA-manacled economy down with it. Then, five days after Fox addressed a joint session of Congress, the Twin Towers came down, and his plea for a more open border became an instant nonstarter. Worse, as Fox loyally pledged support for Bush’s global war on terror, a crackdown ensued on illegal crossings along the 2,000-mile-long frontier. This in turn exacerbated the crisis of the Mexican countryside, making it ever harder to get a cross-border job and send south the remittances that were the life support on which many devastated communities so depended. Cooperation in the war on drugs became ever more central to Mexican-US relations. Fox quickly backed off a pre-election vow to withdraw the military from the drug war in order to avoid deepening the corruption of its general staff, and to comply with Mexico’s constitutional prohibition on using the military for anything but national defense. The US made clear it considered Mexico’s army its most reliable force, despite Fox’s 2001 arrest of generals who had been protecting gangsters. The US backed strategy seemed to produce rapid results. On February 10, 2002, Ramón Arellano Félix was killed, and a month later, Benjamín Arellano Felix was captured. But the Tijuanos’ distress was duly noted by other drug lords, particularly the Sinaloans. In October 2001 they had held a summit meeting in Cuernavaca. Newly restyled The Federation, they debated plans for expansion into the far eastern plaza, centered in Nuevo Laredo (in the state of Tamaulipas), a lucrative and newly vulnerable border crossing, theretofore the exclusive domain of the Gulf Cartel. The daily, NAFTA-supercharged flow of freight cars and cargo trucks provided great cover for funneling narcotics into the US rail network and onto Interstate 35, the highway to San Antonio and points north. The Federation decided to invade. From the first skirmishes in 2003, the firefights on the streets of Nuevo Laredo grew steadily until by 2005 spectacular battles, deploying ever more sophisticated and deadly weaponry, had become commonplace. In July, after the rivals had wheeled out machine guns and rocket-propelled grenade launchers, American officials shut down the US Consulate. The new levels of lethality appalled the Americans, but should not have surprised them as the iron river of armaments had been flowing more briskly, courtesy of the US arms industry and the Republican Party’s powerful right wing. Back during the Clinton Administration, an impediment to the southward flow had been put in place, when in 1994 Congress slapped a ban on the manufacture of semiautomatic assault weapons. Though scheduled to sunset in 2004, two thirds of Americans (among them President Bush) supported extending the ban. Fierce opposition by the National Rifle Association and right-wing Texas Congressman Tom DeLay blocked this renewal. A grateful NRA invited DeLay to keynote its annual meeting in 2005 and, as he took the podium, he choked up slightly as he proclaimed the tribute “the highlight of my career.” Lifting the ban facilitated a growing cascade of powerful weaponry south, just at the time powerful weaponry began showing up in Nuevo Laredo — including such narco favorites as the AK-47 Kalashnikov assault rifle (known affectionately as the cuerno de chivo or “goat horn” rifle), the AR-15 assault rifle (a civilian version of the M16, built by Colt), and the Barrett .50 caliber armor-piercing sniper rifle preferred by all the best professional assassins, along with machine guns, fragmentation grenades, shotguns, cop-killer pistols, and the like. Not only did the ability to shoot a massive number of bullets lead to hundreds of civilian bystander deaths, but the massive buildup of firepower — rivaling that of the Mexican Army — fostered an increasing willingness to tackle state authorities. In 2005, seven police commanders were ambushed and killed, seriatim, in Nuevo Laredo. The position remained vacant until a printing-shop owner accepted the post on the morning of June 8, 2005. Within six hours, Zetas toting AR-15 assault rifles had riddled him with bullets. This latest slaying, coupled with pressure from the US ambassador who was worried about murders and kidnapping of American citizens, spurred countermeasures from the Fox regime. Fox created a combined military and police strike force, the muscle behind a program entitled México Seguro (Safe Mexico). On June 11, 2005, Fox sent 600 members of the Federal Investigations Agency and the Federal Preventive Police, together with members of GAFE (the special forces of the Mexican Army) parading into Nuevo Laredo. They were met with gunfire from local police officers in the pay of the Gulf Cartel. Federal authorities removed almost one-third of municipal police officers for alleged ties to drug traffickers, suspended the rest, and replaced them with federal forces. This was widely perceived as having all but no effect on the ongoing slugfest. More to the point, the big cartels were having a big impact on the federal forces sent against them. Some soldiers were deserting out of fear, others were lured away by better offers. The success of Los Zetas underscored the benefits that awaited those who took their military skills over to the dark side, especially given the notoriously poor salaries, harsh living conditions, and humiliation by officers that were their daily fare in the barracks. Between 2000 and 2006, 123,218 had deserted, two-thirds of the 185,143 Fox had started with, though most were replaced by new recruits. And it was in these dispiriting circumstances that the Fox sexenio sputtered to an end.\nTwo Mexicos Face Off The PAN, much to most people’s surprise, nominated a little known lawyer, Felipe Calderón, who in addition to his Mexican MA in economics had a degree in public administration from Harvard’s Kennedy School of Government (2000. His chief opponent was Andrés Manuel López Obrador. As the PRD candidate, his campaign slogan was “For the Good of Everyone, the Poor First,” referring to his advocacy of increasing taxes on the rich and extending resources to the poor. In the end, two different but overlapping Mexicos faced off, one more socially conservative, the other more socially liberal; one more rooted in the industrial north, the other strongest in the central and southern states where most of the country’s poor lived; one favoring state action, the other preferring to let the market work its magic. All the candidates were remarkably circumspect in their rhetoric, making no mention of particular cartels, lest they call down gangster wrath. Calderón talked vaguely about freeing “cities like Tijuana, Nuevo Laredo or Acapulco from this cancer before it eats away our society,” and advanced a series of specific reforms — changing the judicial system, centralizing the police forces, extraditing captured drug lords to the United States, and imposing life sentences on convicted kidnappers. López Obrador argued that creating jobs and reducing poverty was the only real way to fight crime — “I don’t think you can make much progress with prisons or threats of heavy-handed approaches and tougher laws,” he said, though he also broke with the Left’s anti-military tradition by suggesting a bigger role for the army in fighting the drug trade, given how well-armed were the cartels. On election day, July 2, the contending forces proved to be as sharply divided in votes as they were in views. Calderón received 35.89 percent of the vote. López Obrador got 35.33 percent. Madrazo of the PRI trailed in third place with 22 percent. The López Obrador forces, pointing to a variety of irregularities, claimed that Calderón’s popular vote margin had been obtained by straight-out fraud and that López Obrador was the rightful president. During July and August, López Obrador’s followers blocked major thoroughfares like Avenida Reforma and set up a giant encampment in the Zócalo, Mexico City’s enormous central plaza. But after undertaking a partial recount of the ballots the Federal Electoral Tribunal declared Calderón the winner. The protests continued, and on December 1, when Calderón arrived at the Legislative Palace of San Lázaro to take the oath of office before a joint session of Congress, all was bedlam. The circumstances surrounding Calderón’s inauguration were so chaotic that little attention was paid to a press conference Calderón had just held. In addition to announcing the members of his security cabinet, Calderón tossed a bombshell into the roiling national conversation. He was declaring, he said, a war on drugs, a “battle against drug trafficking and organized crime, which will take time, money, and even lives.”", "url": "https://www.jacobinmag.com/2015/03/mexico-drug-cartel-neoliberalism"}