{"authors": ["Por Beth Harris"], "date_download": "2020-05-04 20:20:43", "date_modify": "2020-05-04 20:20:43", "date_publish": "2015-11-11 16:43:23", "description": "LOS ANGELES (AP) — \"Concussion\" le da un duro golpe a la NFL al lidiar con datos que vinculan los repetidos porrazos que reciben sus jugadores con demencia y una variedad de otros...", "filename": "_31b05d38bd6e4f048ae673223e260ac3_1588623643.html", "image_url": "https://storage.googleapis.com/afs-prod/media/14f9547999c3476c948cd1e5f6f69c5e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_31b05d38bd6e4f048ae673223e260ac3_1588623643.html", "title": "Película \"Concussion\" da un duro golpe a la NFL", "title_page": "Película \"Concussion\" da un duro golpe a la NFL", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOS ANGELES (AP) — “Concussion” le da un duro golpe a la NFL al lidiar con datos que vinculan los repetidos porrazos que reciben sus jugadores con demencia y una variedad de otros problemas.\nLa escabrosa relación de la liga con el doctor Bennet Omalu, quien identificó una enfermedad degenerativa en jugadores de fútbol americano conocida como encefalopatía traumática crónica (ETC), es el foco de la segunda hora de la cinta.\nProtagonizada por Will Smith y Alec Baldwin, “Concussion” tuvo su premiere el martes por la noche en el AFI Fest en Hollywood. Entre el público en el Teatro Chino TCL estaban la esposa de Justin Strzelczyk, el offensive lineman de los Steelers fallecido en un accidente de tránsito, y la esposa e hija del linebacker Junior Seau, miembro del Salón de la Fama, quien se suicidó. Strzelczyk tenía daño cerebral, se conoció más tarde; Seau tenía ETC.\nSmith interpreta a Omalu, un patólogo forense nigeriano en Pittsburgh que no sabe nada de fútbol americano cuando realiza la autopsia del ex centro de los Steelers Mike Webster. Omalu descubre ETC en el cerebro de Webster, lo que lo lleva a exponer la crisis de las contusiones cerebrales.\nOmalu rápidamente se enfrenta con la NFL, que exige que retracte sus hallazgos de ETC y lo acusa de fraude. El doctor es objeto de amenazas telefónicas y su esposa es seguida mientras maneja sola.\nLa película nombra a personas de la vida real y usa imágenes de verdaderos juegos de la NFL que muestran el tipo de golpes en la cabeza que pueden ocasionar lesiones y daños permanentes en los jugadores.\nEl personaje de Smith busca reunirse con el comisionado de la NFL Roger Goodell (interpretado por Luke Wilson), quien llama a una cumbre sobre contusiones a la que Omalu no tiene permitido asistir. En vez, el personaje de Baldwin, el exmédico de los Steelers Julian Bailes, presenta los hallazgos de Omalu.\nBailes le dice a Omalu que la cumbre fue montada para que la NFL pudiera decir que escuchó.\n“La liga ha mantenido a todo el mundo en la oscuridad”, dice Bailes, quien explica que fue elegido para hablar porque era parte de la NFL.\nEn las oficinas de la liga en Nueva York, ejecutivos son informados de artículos de periódico sobre ETC que están en primera página, no relegados a las secciones de deporte o ciencia.\nEl ex safety de la NFL Dave Duerson, que trabajó para la liga, aparece rechazando pedidos desesperados de ayuda de Andre Waters, un aguerrido safety que dijo que su mente no andaba bien. Tanto Duerson como Waters se suicidaron pegándose un disparo. En Duerson se halló evidencia de ETC, mientras que Waters tenía daño cerebral.\nLa película termina con la noticia de la muerte de Seau seguida de estadísticas del daño que el ETC ha ocasionado a jugadores de la NFL y la demanda por contusión cerebral presentada por docenas de jugadores retirados.\nEl director Peter Landesman rechazó nuevamente un reporte reciente del New York Times de que el filme fue alterado para aplacar a la NFL.\n“Casi da risa”, dijo en la alfombra roja. “Cualquiera que ve esta película sabe que es un tiro a la NFL. No porque estemos persiguiendo a la NFL, simplemente porque la verdad es nuestra defensa y es una película poderosa sobre seres humanos”.\nLa cinta no revela nada nuevo sobre las implicaciones a largo plazo de los repetidos golpes a la cabeza. Se enfoca en la lucha de Omalu por decir la verdad y las muertes trágicas de hombres que jugaron el deporte millonario favorito en Estados Unidos.\n“La única crítica que hemos recibido es de personas que no han visto la película”, dijo Landesman durante una sesión de preguntas y respuestas posterior a la función. “Ninguno de nosotros quería que la película fuera polémica o sentenciosa. Todo el mundo tiene un punto de vista. Me encanta el fútbol americano. No estamos señalando con el dedo y diciendo que no lo jueguen”.\n“Concussion” se estrena el 25 de diciembre.\n___\nLa corresponsal de AP Nicole Evatt contribuyó a este despacho.", "url": "https://apnews.com/31b05d38bd6e4f048ae673223e260ac3"}