{"authors": ["Joe Allen", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:57", "date_modify": "2020-05-04 19:59:57", "date_publish": "2015-02-17 00:00:00", "description": null, "filename": "2015_02_logistics-industry-organizing-labor_1588622397.html", "image_url": "https://images.jacobinmag.com/2015/02/17002840/amazon-copy-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_02_logistics-industry-organizing-labor_1588622397.html", "title": "Studying Logistics", "title_page": "Studying Logistics", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\n“Amateurs study strategy, professionals study logistics,” US Army General Omar Bradley famously said. Bradley’s declaration was of course an overstatement, but it was also a necessary correction. Logistics — the mobilization of vast resources and, most importantly, people — was the lifeblood of a winning military strategy. Without full and competent logistical support, any strategy, no matter how brilliant, will fail. It is a point worth remembering when discussing the importance of the logistics industry to the US economy. Most people know the word logistics from UPS’s ubiquitous advertising campaign, “We [Heart] Logistics.” It is sometimes seen as a fancy word for old-fashioned warehousing and distribution, an advertising makeover for the twenty-first century. “For many [others],” Marxist geographer Deborah Cowen writes, “logistics may only register as a word on the side of the trucks that magically bring online orders only hours after purchase or that circulate incessantly to and from big-box stores at local power centers.” On still other occasions, it is more glibly understood as the “supply chain.” The US economy revolves around the sprawling logistics industry, and the potential power of these workers is enormous. Socialists should always seek a political relationship with those sections of the working class that have the potential power to elevate the organization and politics of the entire class. Without a strong left wing based in the most powerful workplaces, both the working-class movement and the socialist left will continue to be of marginal influence. After three decades of gut-wrenching changes to the industrial economy, I believe that socialists can, once again, have an industrial strategy in the United States.\nThe “Old” Supply Chain The production of capital goods (machines and tools for manufacturing) and consumer goods (for personal consumption) has been and will be central to the capitalist system. Every generation or so, however, capital reorganizes its methods of production and circulation (what bourgeois economists call distribution) and in the process remakes the composition of the industrial working class. These changes can be painful and disorienting, and it can take a significant amount of time for socialists and other working-class activists to reorient themselves. This remaking includes modernization of production techniques (the means of production), the organization of production and labor management, the methods of transporting goods to the market, and how goods are actually sold to the consumer. Getting capital and consumer goods to the paying customer or the consumer market has been, at times, surprisingly fraught with difficulties. The reorganization of capital is rarely as smooth or as modernized as thought, and parts of the system can advance quite quickly while others lag behind. The rise of large-scale, modern manufacturing in the late nineteenth and early twentieth centuries was not accompanied by a revolution in retail, although this era saw the invention of the department store. In 1910, for example, inventor and capitalist Thomas Edison complained: Selling and distribution are simply machines for getting products to consumers. And like all machines, they can be improved with great resulting economy. But it is the plain truth that these machines for distribution have made the least progress of all machines. They are the same in many instances that they were forty or fifty years ago. Let’s be clear about Edison’s complaint. He was saying that the retail industry of 1910 was essentially the same as it was in 1870 or 1860: it was still largely the province of local and very small businesses. The rise of the railroads in the nineteenth century was the most visible and revolutionary development for the delivery of capital and consumer goods. Such innovations as the refrigerated boxcar enabled packinghouse giants like Swift, Armour, and Hormel to send meat products across the country. Rail transport, manufacturing, and warehousing became (and still is) concentrated around the greater Chicago area. Railroad workers were the most militant, even insurrectionary, of US workers, clearly demonstrated by the 1877 railroad strikes and the 1894 Pullman strike. Despite the revolution in rail transport, however, the horse and wagon remained primarily responsible for the delivery of goods from the railroads to the consumer market. The development of motorized trucking — exploding in size and scope in the decades following World War I — significantly changed the delivery of capital and consumer goods. Long-haul and local freight drivers picked up from the manufacturers or warehouses — including the waterfront — an increasingly larger share of the market. These groups of workers played key roles in the emergence of the CIO and the Teamsters, affiliated with the AFL, in the 1930s. In the years following World War II, the development of containerization and air cargo literally revolutionized the transport of goods around the world. The container was a transport development of historic importance. Mind-boggling in design, the container led to a massive restructuring of ocean transport, ports around the globe, the trucking industry, and the railroads. This restructuring made transport cheaper and faster, and allowed a sizable chunk of industrial production to be moved to the Far East. The North American continent, especially the US half, became a gigantic “landbridge,” where shippers — avoiding the expensive Panama Canal — dropped their cargo at West Coast ports and had them loaded onto rail cars and transported to ports along the East and Gulf Coasts, and finally loaded back onto ships bound for Europe. This is a quick sketch of the old supply chain and how it began to morph into the beginnings of the supply chain we know today. Where does the development of logistics fit into this, and how has it transformed contemporary industrial production and circulation?\nThe Logistics Revolution The transportation landscape and economic organization of the US on the eve of the post–World War II logistics revolution would be unrecognizable to most of us. There was no federally funded interstate highway system, many of the ports were relics of the nineteenth century, trucking companies were tiny and local, retailers were also small and local, UPS specialized in department store deliveries, there was no FedEx or Walmart, international shipping wasn’t done by containerization, computers were in their experimental infancy, there was no satellite communication, no GPS, no universal bar code, and economic life was highly regulated by the federal government. To name just a few things. For many people, logistics was perceived to be a military art or skill. “For most of its martial history logistics played a subservient role,” according to Cowen, “enabling rather than defining military strategy.” This military art was raised to a much higher level of importance with the introduction of modern industrialized warfare brought about by the First and Second World Wars. Global imperialist wars required a mobilization of industry, resources, and troops on an unprecedented scale. Not only did the successful implementation of a war strategy require a different level of logistical thinking and support, it actually impacted strategic thinking itself. “The logistical complexity of mobilization in this context meant that the success or failure of campaigns came to rely on logistics,” Cowen argues. “Over the course of the twentieth century, a reversal of sorts took place, and logistics began to lead strategy rather then serve it.” The close relationship between industry and the military that created the US war machine also meant that logistics was soon “adopted into the corporate world of management.” Long before the ubiquitous advertising campaigns of UPS and others, a logistical revolution took place in management. Sociologists Edna Bonacich and Khaleelah Hardie argue that logistics has two interrelated meanings. The first is the “nuts-and-bolts distribution function” that we generally associate with the word. But the other refers to “the management of the supply chain, including the relations between retailers, their producers/suppliers, and their carrier/transportation providers.” For our purposes we can define modern logistics in Bonacich and Hardie’s latter meaning of the word, as the management of supply chains. How is that different from older methods of organizing manufacturing, warehousing, and distribution? For the bulk of the previous two centuries, manufacturers dominated the retailers that sold their goods, especially consumer products that expanded massively following World War II. The retail industry was dominated by the seasonal production schedules of the manufacturers. For the most part manufacturers told the retailers what would be sold, and at what prices, while massive warehouses stockpiled huge amounts of goods. This imbalance between manufacturers and retailers continued well into the later part of the twentieth century. Retail was also considered a backwater of American capitalism, despite the emergence of the big downtown department stores in the late nineteenth century, and the creation of popular chains stores that dotted the landscape beginning in the twentieth century, such as Woolworth and Sears. Fifty years after Edison complained of the sad state of American retail, management guru Peter Drucker made a similar observation but with a positive spin. “Distribution,” he wrote, “is one of the most sadly neglected, most promising areas of American business.” The new retail giants filled this “promising area.” Starting in the late 1970s and early 1980s, the relationship between the retailers and manufacturers began to shift. That change has had profound consequences for the organization of capitalist production, and the composition and power of the industrial working class. “The revolution in logistics also marks the rise of corporate retail and logistics giants with aggressive and punitive approaches to labor management,” Cowen writes. “Wal-Mart may be widely known as a mammoth retailer, but in the world of business management it is known as a logistics company.” Wal-Mart, from its world headquarters in Bentonville, Arkansas, “cut out a raft of salesmen, jobbers, and other supply chain middlemen, squeezed the manufacturers by shifting every imaginable cost, risk, and penalty onto their books [and has] taught the entire retail world,” according to historian Nelson Lichtenstein, “how the bar code and date warehouse could finally put real money on the bottom line.” The logistics corporation is not only a new stage in the evolution of the modern corporation but has significant implications for our understanding of the historic distinction between manufacturing, transportation, and retail. Lichtenstein argues, “Their connections with a global manufacturing network were practically incestuous. They might not own the Asian or Central American factories from which they sourced all those big-box consumables but their ‘vendors’ were linked to them by a ‘supply chain’ that evoked the iron shackles subordinating slave to master.” The modern logistics corporation — with significant help from the capitalist states — has massively reorganized the global manufacturing network, the shipping and transportation systems, and the final delivery of goods. This reorganization has changed not just the delivery of the finished products, but the manufacturing of the goods themselves. As Cowen writes, “It is misleading to think about a singular site of production. Commodities today are manufactured across logistics space rather than in a singular place.” If we see transportation as a key element of modern production, then the new distribution centers developed by the logistics giants are also an important historic development. Lichtenstein highlights this point in his book The Retail Revolution : Unlike the great icons of the twentieth-century industrial age . . . They are neither inspiring nor grim, merely a functional set of docks and locks from one place and are destined for sale and consumption somewhere else, hundreds of miles downstream. Yet these Distribution Centers and similar facilities operated by Home Depot, Target, UPS, and Federal Express, stand at the center of the production and consumption network that girdles the planet. “Stand[ing] at the center of the production and consumption network,” these new logistical workers — who are also employed at Amazon’s distribution centers — have the potential power to regain the workplace muscle lost by a generation of industrial workers in this country. These are the “chokepoints” in the modern industrial system that run backward to the manufacturer and forward to the customer. What makes this system even more vulnerable to the potential power of the workers in these new distribution centers is the “just-in-time” or “lean production” methods that have come to dominate the global manufacturing system since the early 1980s. Nearly two decades ago, Kim Moody made this point in his book Workers in a Lean World , though he was primarily focused on developments in the auto industry. Citing MIT’s longstanding International Motor Vehicle Program (IMVP), the program’s researchers feared the lean production system was feared was “fragile.” It had to be a “humane” system or, as Moody saw it, “the fragility of the system becomes a weapon of resistance.” We can now extend Moody’s analysis and the potential for resistance to the entire logistics industry. While there are many distribution centers throughout the US, there are three cities and related industrial complexes that are especially important for socialists to understand. These are Fedex’s “SuperHub” in Memphis; UPS’s “Worldport” in Louisville; and Chicago’s vast assortment of warehousing complexes and rail and trucking links, starting with UPS’s Chicago Area Consolidated Hub (“CACH”) and extending forty miles southwest to the area surrounding the old Joliet Arsenal, a region that is the logistics hub of the US.\n“Cargo Alley” The deregulation of the trucking and airlines industries in the late 1970s and early 1980s had a transformative impact on the logistics industry. Major sections of the freight industry that had been bastions of union power collapsed within a few years, or were reorganized on a non-union basis. The evolution of logistics in the delivery business was intimately tied up with the neoliberal era, and in some ways pioneered distinctive neoliberal economic policies. For example, trucking on the waterfront became the province of “independent contracts,” and UPS pioneered part-time wages and work. The Big Three US-based international delivery companies that emerged out of this transformative era were Fedex, UPS, and DHL. All three corporations operate globally with enormous workforces that rival or exceed the size of some of the world’s largest standing armies. UPS, for example, has a worldwide workforce of 395,000 employees, making it nearly the same size as the 400,000-strong US army. Fedex follows with a worldwide workforce of 300,000 employees, and DHL with 275,000. The combined standing and reserve force of the British army is 80,000. The size of these workforces testifies to the importance of these specific corporations in national and international trade. Deutsche Post owns DHL but it started out as a US corporation, and remains the major competitor to UPS and Fedex on the international level. Its spectacular failure in ground delivery forced it to withdraw from the US ground delivery market in the 2000s. UPS and Fedex air operations based in Memphis and Louisville are the pumping hearts of both companies. Why Memphis and Louisville? Both air hubs are located in a geographic region nicknamed “Cargo Alley.” “If you want a system that connects every point in the US to every other point,” FedEx founder Fred Smith told business writers John Kasarda and Greg Lindsay, “the hub has to sit somewhere in a trapezoid between Memphis in the Southwest, to Champaign, Illinois, in the Northwest, over to Dayton, Ohio, and down to Chattanooga. It has to sit in that footprint.” From Memphis and Louisville, FedEx and UPS cargo planes can reach nearly 80 percent of the continental US in two hours. “Louisville and Memphis both languished until they deliberately embraced the overnight carriers calling each one home,” Kasarda and Lindsay write in their fascinating book Aerotropolis: The Way We’ll Live Next . “Two cities rooted in the steamboat era have been refashioned into the most import hubs of our era.”\nThe FedEx “SuperHub” Frederick W. Smith founded FedEx in 1971. Then known as Federal Express, the company pioneered the overnight delivery business. Smith claimed to have first put forward the idea for such a business while at Yale in 1966. Later, after he was a commissioned as an officer in the US Marine Corps, and served as a forward air controller during the Vietnam War, Smith got an inside look at the US military’s global supply network. He chose Memphis for the location of FedEx’s central air hub because it was on the western fridge of “Cargo Alley.” By the time FedEx set up shop in Memphis, the city was known to most people for killing Martin Luther King and had seen much of its industry move out. In the nineteenth century, Memphis’s economy was infamously based on the selling of slaves and the cotton trade. The Memphis Cotton Exchange was the center of business. In the 1970s, business began moving to East Memphis, “where the airport, highways, and rail yards had given birth to an entire forest of white, multi-story warehouses adorned with the stubs of truck-loading docks.” For Kasarda and Lindsay, Memphis is the “embodiment of an evolution from warehousing to distribution to logistics that took less than twenty years and saw it rise from a necessary evil to the front lines in an eternal war on costs and the competition.” From modest beginnings FedEx has evolved into one of the most important logistics corporations in the world. Its first sort took place on the night of April 17, 1973, when six French-built Falcon jets brought back a total of 185 packages and envelops. “Now three hundred planes nose up to its gates nightly, and 3.3 million packages pass through its labyrinth of belts on any given day. Memphis International has been the busiest cargo airport in the world for eighteen years running — since the rankings began — and 95 percent of its title is due to FedEx,” Kasarda and Lindsay. Memphis International held that title until 2009 when it fell to number two behind Hong Kong International, where it has remained since. FedEx also expanded into other areas of transportation. As Jeffrey F. Rayport explains in the MIT Technology Review: The result is the largest air-cargo company in the world: it employs 290,000 people, maintains a ﬂeet of 75,000 trucks, and owns and operates 684 jets. It has more wide-body jets than any airline, including Boeing 777s that can ﬂy from Shanghai to Memphis nonstop. The SuperHub, the heart of FedEx’s operations, measures four by four miles. Some 30,000 people are needed to run it. The SuperHub is an amazing feat of engineering. “Every weekday night at the SuperHub, FedEx lands, unloads (in just half an hour, even for a super-jumbo 777), reloads, and ﬂies out 150 to 200 jets,” Rayport notes. “Its aircraft take off and land every 90 seconds. This all happens between 11 p.m. and 4 a.m. Central Time. The SuperHub processes between 1.2 million and 1.6 million packages a night.” It is also a virtual company town with “a hospital, a ﬁre station, a meteorology unit, and a private security force; it has branches of U.S. Customs and Homeland Security, plus anti-terror operations no one will talk about. It has 20 electric power generators as backup to keep it running if the power grid goes down.” FedEx’s impact on Memphis has been revolutionary. “Not only is it the largest private employer in a metropolitan area of the region of more than million people,” Kasarda and Lindsay note, “it sits at the center of an ecosystem of warehouses, trucking firms, factories, and office parks.” This “eco-system” includes “more than a hundred foreign companies [that] have set up shop around the hub.” Outside of FedEx’s pilots, who are unionized, the SuperHub is one of the great non-union industrial complexes in the US. It took sixteen years for FedEx to become a $4.6 billion company; last year its revenues were $45 billion. Its wealth has largely been built on the same basis as that of its chief rival UPS, namely part-time wages and work. Here’s how Kevin Coyne described “The Sort” at the SuperHub in his superb 1993 book A Day in the Night of America : The roads leading to the airport filled with the commuting cars and the crosswalks streamed with brigades of workers, almost 4,500 strong, in blue uniforms and steel-toed boots, marching out of the night and into Federal Express complex, through the long, wide, sci-fi- white corridor and toward their stagemarks for the nightly one-act drama called The Sort — three-hours-or-so sprint wherein the delivery cycle reached its busiest peak. More than three-quarters of them college students, the moonlighting, part-time backbone of the sorting process. For a few hours, at an average wage of nine dollars an hours, they would work at a pace few could sustain over a full right-hour shift, human cogs in the din of a vast Letter Sorting Machine. Today far more people work at the SuperHub, and the proportion of college students as short-term workers has drastically declined because the falling wages of American workers have forced many to either seek an additional part-time job or work two (and sometimes three) part-time jobs to make a living. The potential power that these SuperHub workers have is vast and untapped. Unionization would be a huge battle, but winning it would have a transformative impact on the working class as a whole because of the SuperHub workers’ central importance to the US economy.\nUPS’s “Worldport” Worldport, UPS’s Star Trek -sounding mammoth air hub in Louisville, Kentucky, is another engineering marvel. At 5.2 million square feet (or the size of ninety football fields), with 115 miles of conveyor belts capable of sorting 416,000 packages per hour, it is the largest UPS facility in the country. It employs more than 20,000 workers, most of whom are members of Teamsters Local 89. It has seventy aircraft docks and delivers daily to more than 220 countries and territories around the world. UPS’s pilots are members of the Independent Pilots Association. Over the last two decades, the company has spent billions of dollars to turn the Louisville air hub into its showcase facility. While FedEx pioneered the overnight package delivery business, UPS was founded in 1907 as a messenger service. It went through many transformations in the decades before air delivery became so central to its operations. It did some air service in its early decades of business but focused primarily on small package delivery, making it the king of the small parcel industry. UPS planned very methodically before it decided to take on FedEx in the overnight delivery business. “Nine years after the first FedEx sort, UPS landed in the opposite corner of the trapezoid with its own hub at Louisville,” according to Kasarda and Lindsay. “In the intervening years, [the US government] had deregulated American aviation, allowing any airline (passenger and cargo alike) to fly wherever it wanted whenever it wanted, using whatever aircraft it liked.” UPS initiated Next Day Air service in September 1982, seventy-five years after the founding of the company. After initially outsourcing its early air transport operation, UPS went on a spending spree, acquiring several hundred planes, including a dozen of its very own 747s. By the 1990s, UPS put the “International” in Louisville International Airport with its nightly sorties to Europe. Even more than Memphis revolves around FedEx, Louisville and its airport depend on UPS. So does Kentucky — UPS is the state’s largest private employer, with more than twenty thousand workers. UPS owns 237 jet aircraft and charters 388 to deliver packages to 940 US destinations and 1,015 around the globe on a daily basis. It is one of the largest private airlines in the world. The packages are transported in U-Haul-truck-size aluminum containers cut to fit the interior of the airplanes. Nicknamed “cans” they can weigh up to two tons, and they are moved about thanks “to miles of inverted casters and ball bearings studded in the Worldport’s floor and at gates. The cans need only a solid push to glide across them into the hub or onto the caravans of waiting tugs.” Workers unload the cans and sort the individual packages. Only two sets of hands are supposed to touch the packages, while the rest of the time they are transported and guided across the miles of conveyor belts by smart labels that contain zip codes and tracking numbers. UPS has spent hundreds of millions of dollars in advanced computer software to make Worldport work. “The majority of this software resides at Worldport itself,” according to Kasarda and Lindsay, “making twice as many calculations in an hour as the New York Stock Exchange does in a heavy day of trading.” Worldport may be highly automated — and rely on the most advanced computer technology and engineering — but human beings still make it run. Twenty thousand part-time workers (union and non-union) work during the crucial hours of 11 AM to 4 PM. Teamsters Loca 89 in Louisville has more than 16,000 members — the overwhelming number of which are UPS workers — and, because of the continued expansion of Worldport, will likely be North America’s largest Teamsters local in the near future. Like many UPS hubs across the country, Worldport is plagued by a shortage of part-time workers because of its notoriously low wages and miserable work conditions. Attempting to stabilize its workforce at Worldport, UPS leaned on the local and state governments to allow students to take courses at Metropolitan College, a special program created by a joint venture of the University of Louisville and the Jefferson Community and Technical College. Metro College has several locations throughout Louisville including at Worldport. The college was designed “to fit the needs of UPS,” Time reported in 1998. The student-workers “will experience a daily schedule that will essentially reverse their internal clocks. Class schedules, social activities and sleep patterns will revolve around the hours of the night shift at UPS.” UPS has also recruited large groups of refugees to meet its needs. The real power of the Worldport workers and pilots was demonstrated vividly during the 1997 national strike against UPS. Planes didn’t fly, and packages weren’t sorted. The Worldport became a ghost town. Since then the power of these workers has been continually muted or undermined, though there is clearly a growing restlessness among them: last March, Local 89 members rejected the local agreement with UPS with a 90 percent “no” vote.\nChicago: The Great Inland Port Chicago has been at the heart of the US transportation, manufacturing, and warehousing network since the Civil War. The logistics revolution, however, has raised Chicago’s historic place in the US economy to Olympian heights. With the construction over the last twenty-five years of UPS’s gigantic Chicago Area Consolidated Hub (“CACH”) and several “logistics parks” on the grounds of the former Joliet Arsenal, the Chicago-area has been transformed into the world’s third largest container port. Chicago’s geographic location and transportation infrastructure has inherent advantages that can’t be reproduced on the same scale anywhere in the US, or even in the Western hemisphere. The six largest North American railroads meet in Chicago, and over 219 million people are a two-day truck drive from the city. UPS decided to build the CACH in the Chicago area precisely because it is at the nexus of major transportation lines. The CACH is the largest ground package facility in the world, and one of the US economy’s most important distribution centers. During peak season (the two months running up to Christmas), the CACH employs up to 8,000 people, who load and unload trailers, and as many as three million packages are moved through the facility. Unlike the SuperHub or Worldport, the CACH has its feet firmly on the ground. There are two “Feeder Boards” — seniority lists for the drivers of tractor-trailers — that connect the hundreds of Chicago-area and Midwest UPS hubs, and many rail lines around the Chicago and Joliet region. Teamsters Local 705 and Local 710 have about 380 drivers on their respective lists. The BSNF rail yard located adjacent to the CACH is one of the busiest rail yards in North America, “where every 80 seconds a trailer is lifted on or off a flatcar,” and moved to one of CACH’s 170 bays to be unloaded. “In 2005, Willow Springs was BNSF’s second-busiest intermodal yard, performing 770,000 lifts,” according to Trains magazine. During the 1997 strike, the CACH, like Worldport, was completely shut down, and became a magnet for national media. Turnover among the part-time workforce remains high, and the power of these union workers has been dormant since the strike. Looking back two decades now, it seems clear that UPS’s decision to build the CACH in the Chicago suburbs foreshadowed even greater logistics developments. Running southwest from the CACH on I-55 to the former grounds of the US Army’s Joliet Arsenal and beyond to neighboring Elwood are massive intermodal facilities and warehouses that have been operating since 2002. The area has been designated a free trade zone, and the rail lines are owned by the BNSF and Union Pacific railroads. Jacque Engle, a spokeswoman for CenterPoint properties, the logistic management company in Joliet-Elwood, recently told the Chicago Tribune , that CenterPoint has “spent nearly $2 billion, building 12 million square feet of industrial warehouse space and 1,600 acres of other development in Joliet and Elwood. Nine million square feet of warehouse space was built in Elwood alone.” Will County, where Joliet and Elwood are located, is home to more than 300 warehouses. Walmart alone has 3.4 million square feet of warehousing space located there. According to Warehouse Workers for Justice, “there are about 150,000 warehouse workers in the Chicago region.” These groups of warehouse workers, drivers, and crane operators are the single greatest concentration of potentially powerful workers in the United States.", "url": "https://jacobinmag.com/2015/02/logistics-industry-organizing-labor"}