{"authors": ["Tor Krever", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:27", "date_modify": "2020-05-04 19:58:27", "date_publish": "2015-11-17 00:00:00", "description": null, "filename": "2015_11__1588622307.html", "image_url": "https://images.jacobinmag.com/2015/11/17010335/b-esq.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_11__1588622307.html", "title": "The Bloco Tightrope", "title_page": "The Bloco Tightrope", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nMore than a month has passed since Portugal’s national elections, yet the country remains wracked with political uncertainty. In the weeks following the October 4 election, a coalition of the Left and radical left promising to end four years of crippling austerity emerged, securing an absolute majority in parliament. But Aníbal Cavaco Silva, Portugal’s right-wing president, balked. Invoking a higher imperative than democracy — appeasement of foreign financial markets and eurozone investors — Cavaco Silva declared that the radical left had no place in power and swore in a minority right-wing coalition at the beginning of November. Less than two weeks later, the government fell, polarizing the country to an extent not seen in decades. Surging support for the radical left and popular frustration with Portugal’s intransigent conservative establishment have precipitated a political crisis unprecedented in the country’s forty years of democracy. How did we get here and what can we now expect?\nSwings Toward the Left A month ago, few would have predicted the present maelstrom. The Economist was celebrating incumbent Prime Minister Pedro Passos Coelho’s election victory. Although it lost its majority in parliament, the magazine predicted that Passos Coelho’s right-wing coalition Portugal Ahead (PaF) — made up of the center-right Social Democratic Party (PSD) and the right Popular Party — would have no problem governing alongside the center-left Socialist Party (PS). The Economist assured its readers that “deep ideological divisions” on the Left ruled out any alternative coalition, and quoted a political consultant who characterized the Socialists as “a fundamentally moderate and decidedly pro-European party” that would happily toe the line. The election was thus seen as a vindication of the Right’s austerity politics, a line echoed by eurozone leaders such as German Finance Minister Wolfgang Schäuble. Since the 1974 Carnation Revolution — which peacefully overthrew the Estado Novo dictatorship and led to Portugal’s withdrawal from its African colonies and East Timor — Portugal’s politics have been dominated by two centrist political formations, the center-left PS and the center-right PSD. The eurozone crisis shook things up, ending six years of PS government in 2011 and enabling Passos Coelho’s PSD to sweep into power in coalition with the right-wing Popular Party. A €78 billion European Union bailout and troika-mandated austerity followed the PSD’s ascendancy. Public-sector pay and pensions were slashed and public services culled, propelling the country into its worst recession in forty years. Popular immiseration and record 17.7 percent unemployment followed, stoking memories of the dictatorship years. The Portuguese government condescended to public suffering, reminding people that unemployment was an “opportunity to change one’s life” and suggesting emigration as a solution. Over the next four years, some half a million Portuguese took that advice; nearly a quarter of those remaining in the country live below the poverty line. The government’s callous stance fueled public anger, as seen in the enormous anti-austerity rallies — the largest mobilizations since the fall of the dictatorship — and the 2013 general strike. The emergence of new left-leaning political movements generated optimism, and the PS, helmed by former Lisbon mayor António Costa, enjoyed a clear lead in the polls. Yet by September of this year that optimism had waned, and the PaF and PS were neck-and-neck. Discontent with the Right — which pledged more austerity despite an official end to the EU bailout — was still growing, but the PS’s campaign was uninspiring and at times downright incompetent. In the middle of the race, the party’s last prime minister, José Sócrates, was indicted for corruption and thrown in jail. (He is currently awaiting trial.) Costa spoke of “turning the page on austerity,” but offered little in the way of concrete measures to indicate the PS would make a fundamental break with the past four years. Instead, fealty to eurozone budgetary rules and a pervasive rhetoric of fiscal responsibility remained the dominant lodestars of Portugal’s political center. In the October elections, the PaF captured 38.6 percent of the vote — down from over 50 percent in 2011 — compared to PS’s with 32.3 percent. They quickly declared themselves the winner. But if the Socialists proved predictably uninspired, unable to draw disillusioned victims of austerity to their austerity-lite platform, the far left was able to capitalize on their feeble performance. The radical Bloco de Esquerda, or Left Bloc (BE) won support from an unprecedented 10.2 percent of the electorate, representing more than half a million votes, while the Communist Party (PCP) — running in coalition with the Green Ecological Party — won 8.25 percent. With those vote shares, almost 20 percent of the new parliament is anticapitalist and eurosceptic. The PCP’s performance was not surprising. Founded in 1921 as the Portuguese section of the Communist International, it was a leading underground force in the opposition to Salazar’s dictatorship and a vocal supporter, from 1957, of the liberation movements in Angola, Mozambique, and Guinea-Bissau. Since the revolution, the PCP has maintained a strong social base and won consistent parliamentary representation. Today — led by Jerónimo de Sousa, a former ironworks machinist and PCP parliamentarian for much of the post-dictatorship era — the party is the strongest it’s been since 1999. While the PCP enjoys a predictable and stable level of support, the BE is a more recent formation, and its evolution into a major political force is significant for the Portuguese left. Founded in 1999 as an electoral alliance of Trotskyist, Maoist, and dissident PCP political associations, it grew steadily under the leadership of Francisco Louçã, an economist and former head of the Revolutionary Socialist Party, from electoral insignificance to the dramatic capture of 9.81 percent of the vote and sixteen seats in Portugal’s 2009 parliamentary elections. The BE has championed progressive legislative efforts including laws on domestic violence, same-sex marriage, and labor protections. Snap elections in 2011 cost the Bloc half its parliamentary deputies, but it has since rebounded under the new leadership of a six-member commission — fronted by Catarina Martins, a former theater actor and, since 2009, a parliamentary deputy. The Left Bloc campaigned on an anti-austerity platform and vocalized a searing critique of the past four years’ disastrous social policies. As Martins said in her post-election speech, the BE’s priority is what’s truly essential: the social crisis, people’s lives and difficulties, one child out of three living in poverty, one million unemployed, and more than one million pensioners who live on less than ten euros a day to pay the rent, food, and taking care of themselves. These are the problems that concern our country. No less important, though, is the BE’s coherent, principled opposition to Europe’s undemocratic institutions — their clear-sighted recognition of the need to renegotiate the national debt and insistence that social welfare and economic sovereignty, not to mention the population’s dignity, must not be sacrificed at the altar of the euro. Dismissed by the center and right as irresponsible ideologues, the BE has put forward a credible anti-austerity, euro-critical program that has succeeded in attracting a modest but significant part of the traditional center’s discontented social base and opening up space for a radical left politics. Impressive gains, certainly, but insignificant, most commentators assumed, in the immediate post-election juncture. Cavaco Silva urged the PS and Costa to support Passos Coelho in continuing the austerity of the past four years, and the Economist was not alone in predicting a continued, albeit now PS-backed, PaF government. Even left-wing commentators pointed to a PS electoral program fundamentally at odds with the Left Bloc and Communist Party positions, dismissing the possibility of an anti-austerity coalition of the Left. Against these comfortable assumptions, Costa refused to rule out discussions with the Left, setting off alarm bells within the European establishment. “We would be very reluctant to invest in Portuguese debt,” one northern European bank warned, while Angela Merkel left no doubt where Berlin’s preference lay: “we hope Pedro will be successful in forming a government,” she said of the PSD leader. In Portugal, establishment opinion unleashed a red scare, lambasting the PS’s moves as tantamount to a coup, with Costa a “usurper” and the PCP’s influence a threat to democracy. Rhetoric entered the realm of the fantastical when a downturn in Lisbon’s stock exchange, though part of a continent-wide trend, was declared the product of a meeting of the PS and the Left Bloc and concomitant “nervousness” on the part of the markets. The loudest warnings came from within Costa’s own party. Francisco Assis, a European parliamentarian and leading figure of the PS’s right wing, attacked “left-wing fantasies” in the PS and declared that he “absolutely opposed” a left majority government, preferring instead a minority PaF government. The political bankruptcy of social democracy in Portugal, though well advanced, is not yet complete. To Costa’s credit, he did not submit tamely to the Right and instead rallied his party’s left wing in support of cooperation with the radical left; in doing so he broke with a tradition of militant animosity between the PS and PCP. Two and a half weeks after the election, the PS, PCP, and the Left Bloc announced they had agreed on a basis for an alliance and were prepared to form a majority government. The announcement sparked outrage from official opinion, and establishment commentators insisted that a majority left government would lack political legitimacy. Leading the charge, Passos Coelho used the peculiarly Portuguese concern for parties’ individual vote tallies as a basis for insisting that only the PaF — having secured more votes than any other individual party and thus winning the election — could claim a democratic mandate. “It’s time to say loud and clear that the Socialist Party lost the elections,” Coelho said. His ideological ally in Spain — right-wing Prime Minister Mariano Rajoy — backed him, making the bizarre claim that “coalitions of losers want to join forces to do away with moderate majorities in our societies, to attain through deals what they didn’t achieve at the ballot box.” This reasoning resonated with Portugal’s president and late last month, Cavaco Silva declared in a televised address that he had invited Passos Coelho to form a minority government. “In forty years of democracy,” he declared, “no government in Portugal has ever depended on the support of anti-European forces.” Parties critical of European institutions, such as the unworkable fiscal compact, or those advocating an end to the monetary union and withdrawal from NATO, the president explained, had no place in power. What Cavaco Silva conveniently ignored was that the Left Bloc and PCP had, in reaching an understanding with the PS, agreed to put aside many of those “anti-European” demands to focus, with the PS, on “breaking the cycle of impoverishment.” While Portugal’s semi-presidential constitution gives Cavaco Silva the right to appoint a minority PaF government, his cavalier justification for doing so startled even the conservative Telegraph in the UK. Here was a unilateral declaration that acceptance of the institutional and economic status quo — European fiscal rules, the euro, participation in NATO’s military adventurism — was a precondition for participating in government. Declaring that any scenario was preferable to a government including the PCP and the Left Bloc, the president signaled his unwillingness to allow a left majority in parliament to govern — regardless of the implications for Portuguese democracy. That he did so by invoking the appeasement of foreign financial markets and eurozone investors was even more troubling.\nMore Troikista than the Troika It’s no surprise that Cavaco Silva is using his office to continue the Right’s ideological agenda against popular opposition. Although his doctoral dissertation from the University of York expounded a defense of Keynesian economics, by the 1980s he was more in thrall with Thatcher. (Cavaco Silva’s Portugal, Thatcher’s UK, and Reagan’s US were the only three countries to oppose a 1987 United Nations General Assembly resolution declaring solidarity with the anti-apartheid liberation struggle in South Africa and demanding Nelson Mandela’s release.) As prime minister of a PSD government from 1985 to 1995, he presided over tax cuts, labor market liberalization, and economic deregulation, joining Filipe González in Spain as the chief introducers of neoliberal reforms onto the Iberian Peninsula. That Cavaco Silva’s arbiter of legitimacy is the Börse and Bundestag rather than the Portuguese polls is also not surprising. Where once the country’s African colonies offered Portuguese elites pretentions to global significance, sycophancy to North Atlantic power is now the norm. Outspoken in its support for NATO aggression in Kosovo and the US invasion of Iraq — despite popular opposition to the latter — and an eager collaborator in Bush-era renditions, Lisbon has long played the faithful servant to Washington. In the era of the euro, the Portuguese establishment has become flatterer to German economic power as well. As Berlin blackmailed Athens this summer, few were as vocal in demanding acquiescence to troika diktats as Portugal’s government. An increasingly autocratic Europe run from Berlin, Frankfurt, and Brussels holds southern Europe in a steely vice, to be sure. Yet, as much as Cavaco Silva’s rhetoric highlights the compulsion for Portugal to remain quiescent in the face of demands from foreign markets and investors, it’s wrong to externalize responsibility for Portuguese austerity. Portuguese elites have been more than happy to see their own neoliberal vision take shape. Austerity, and the consolidation of neoliberal capitalism, is as much a Portuguese project as an imposition of German chauvinism. The dismantling of the social and economic reforms achieved in the wake of the Carnation Revolution has been a longstanding project of the Portuguese neoliberal right, and the troika’s insistence on slashing public expenditures merely provided them an opportunity to implement their dream policies. Indeed, Passos Coelho’s austerity drive of the past four years has exceeded any external demand. “We are going beyond the troika memorandum,” he said of the country’s 2012 budget, proudly fashioning the Left’s brickbat — “more troikista than the troika” — into a badge of honor. As for the Left, “screw the troika” is a powerful slogan, but the failure to dispute this externalization of responsibility has only bolstered the Right’s insistence that there is no alternative. Whatever his motives, the president’s political machinations in late October provoked immediate outrage from the PS. “It is unacceptable to usurp the exclusive powers of parliament,” Costa said, insisting that “the Socialists will not take lessons from Professor Cavaco Silva on the defense of our democracy.” PCP leader Jerónimo de Sousa was more blunt. The president, he warned, had “overstepped his functions, abused the prerogatives that are constitutionally assigned to him, subverted the foundations of the democratic regime, [and] assumed himself not as President of the Republic but as a representative of the PSD.” October ended, the minority government was sworn in soon thereafter, and Passos Coelho presented to parliament his four-year political program. The left parties immediately vowed to reject the proposal; under Portugal’s constitution, refusal of a government’s program by an absolute majority — 116 deputies — triggers government collapse. Costa too promised his party would vote against the government, again bringing the PS’s internal cleavages into sharp relief as Assis and his supporters once more condemned the PS’s turn to the left. The president insisted that “it is now up to parliament to respect the government’s program.” Implicitly directing his remarks at the right of the PS, he urged deputies to vote in the “higher national interest” and exercise their “personal responsibility” — code for breaking with the party. Yet the president’s comments appear to have had the opposite effect. PS deputies rallied behind their leader and against Cavaco Silva’s attempts to radicalize the political impasse. On November 10, a motion rejecting the government’s program passed with the support of all eighty-six PS deputies. Even the People-Animals-Nature Party — which has just one deputy and few substantive policies — sided with the Left.\nTactical Moves With that, Portugal’s government fell, and Passos Coelho tendered his resignation. But now what? The president is constitutionally prohibited from calling new parliamentary elections in the last six months of his mandate. Cavaco Silva has only two months left, with new presidential elections due in January. Two possibilities remain. Cavaco Silva could cave and ask the PS to form a government with the support of the PCP and the BE. Or, he could ask Passos Coelho to stay on as prime minister and lead an unelected caretaker cabinet. As he has repeatedly made clear, he is loath to do the former, but the latter is looking increasingly unappealing even to a political establishment wary of the PCP and the BE. A crippled caretaker government terrifies the representatives of capital even more than a government of the Left. The European Commission has already warned against such a development, complaining that Portugal has missed its October 15 deadline for presenting a 2016 budget to Brussels. Meanwhile, the country’s mainstream press has started to turn against the president; Público, a major centrist daily, has described his comments — if not yet his actions — as “deeply ideological and at times alarmist.” With the appointment of a left government now appearing the most likely outcome, the PS, BE, and PCP have finalized the details of their “Triple Left” pact. The PCP and BE have agreed to support a PS government, dropping demands for euro exit and debt relief and promising the PS a parliamentary majority, while stopping short of formally joining the new government’s ranks. In return, Costa has agreed to left demands including undoing public-sector wages cuts, unfreezing pensions, ending privatizations, pushing progressive tax reform, and increasing the minimum wage. Meanwhile, the forces of reaction have quickly rebounded, shifting tact to disarm, if not quash, a PS government. The country’s television and newspaper media uniformly warn of the costs of left policies — €450 million for ending wage reductions — while repeating warnings from Dutch and German banks about scaring markets and inviting “rating jitters.” In reality, capital has little to fear from a PS-led government. Costa has gone to great pains to celebrate the ostensible achievements of European fiscal rules, affirming them as sacred and above party politics. “Europe can rest easy,” Costa has assured markets. “The Socialist Party is not Syriza.” The PCP and the Left Bloc, he insists, have dropped their radical demands such as NATO exit, nationalizations, renegotiation of the national debt, and withdrawal from the eurozone. “What I want to transmit, especially to markets, is that Portugal will maintain the stability of its European commitments.” Costa’s colleague, Mário Centeno, a former Bank of Portugal economist and likely finance minister in a PS government, has also stressed that the PS will not be held hostage to the PCP and BE. There is no chance of a Socialist government pursuing debt restructuring — “nobody with any sense thinks of not paying debts they have contracted” — nor of leaving the euro or even challenging the fiscal compact’s suffocating limits. One hopes that the PCP and the Left Bloc are clear-eyed about the tactical compromises they say are necessary for an anti-austerity strategy. Their priority is the removal of a right-wing austerity government from power, so they have agreed — for now — not to raise the inviolability of European fiscal rules and instead seek a compromise between the PS’s commitment to those rules and their own social spending priorities. These types of bargains, however, have a short shelf life. The fiscal compact will soon prove an insurmountable barrier to addressing Portugal’s myriad social challenges. More astute observers have already noted that even the PS’s modest plans for increased spending on education and health will be incompatible with a compact that obliges Portugal to reduce its public debt from 128.9 percent of GDP to 60 percent in the next twenty years. Contra Centeno, the question of debt, too, cannot be ignored indefinitely. While the PCP and the Left Bloc have agreed to leave it off the table for now, even the PS must recognize that Portugal’s debt is unsustainable, and they will be obliged to entertain its renegotiation soon. But after Syriza’s humiliation in Greece, they will be loath to take the lead. Ultimately, then, any tactical gains of de facto participation in government will be limited by the internal character of the “Triple Left” formation. Despite the present anti-PaF solidarity spurred by Cavaco Silva’s intransigence, many in the PS remain more comfortable voting with the Right than with the PCP or BE. The PS is a party well on the road to Pasokification, and many of its senior figures remain committed, if not to Passos Coelho’s grinding austerity, then certainly to a milder program of social spending cuts. The PS’s Centeno has been forthright about this political preference for the status quo: “It’s not the direction [of the last government’s austerity program] we challenge, but the speed of travel.” It is paramount, then, that the radical left’s tactical compromise remains just that: tactical. The Left must retain its convictions and be prepared to walk when the PS becomes — as it inevitably will — an obstacle to meaningful reform. In this light, the radical left’s decision to resist the seduction of power and support the PS only from outside government may appear wise. Yet this position still poses many of the same dangers. Martins has refused to rule out censuring a PS government in the future, but such a move will inevitably be portrayed, not least by the PS, as the BE bringing down a left government and returning the country once more into the hands of the Right. How many concessions will the BE (and PCP) make before it decides too many “red lines” have been crossed?", "url": "https://www.jacobinmag.com/2015/11/bloco-esquerda-portugal-silva-ps-pcp-be-austerity-merkel-troika/"}