{"authors": ["Alex Gourevitch", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:30", "date_modify": "2020-05-04 19:53:30", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07__1588622010.html", "image_url": "https://images.jacobinmag.com/2015/07/17004611/varoufakis_schauble-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07__1588622010.html", "title": "You Can’t Be Pro-Euro and Anti-Austerity", "title_page": "You Can’t Be Pro-Euro and Anti-Austerity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The draft of the agreement between the Greeks and the Eurogroup is out and, as everyone has noticed, it is not just an act of revenge — it is a piece of legislative torture. It contains old demands, like pension reductions and higher taxes to fund primary surpluses, as well as new demands, like a reduction in the power of unions and a massive privatization of state assets using a separate fund controlled by Greece but monitored by the European Union’s institutions.\nIn fact the document asks for a massive legislative program touching on every aspect of Greek economic life — tax policy, product regulation, labor markets, state-owned assets, the financial sector, shipping, budget surpluses, pensions, and so on. This legislation is demanded within the next few weeks. Such a package is the kind of thing one sees during or just after wartime, not as the product of democratically negotiated decisions.\nLet’s remember that the program on which Greek Prime Minister Alexis Tsipras and the Eurogroup agreed is something asked of a country that has already experienced a very severe depression, implemented a number of constraints requested by creditors, and has a 25 percent unemployment rate and a banking crisis. What is the point of torturing a victim whose will is already broken? To destroy all opposition.\nI think this should not be read as a proposal for restoring growth to Greece or even as the reflection of an economic blindness in Europe but as the reflux of the EU political project, of which the euro is the purest expression: the preference for technocratic domination over popular sovereignty. This program describes an architecture of rule, one that expresses utter indifference to the attempt by peoples to manage their affairs democratically, and one that demands enormous reserves of discretionary power for the Eurogroup.\nNote not just the scope of the Eurogroup’s demands but the molecular level of detail with which they lay out demands. For instance, as part of their package of “ambitious product market reforms,” they insist on changes in “Sunday trade, sales periods, pharmacy ownership, milk and bakeries, except over-the-counter pharmaceutical products, which will be implemented in a next step, as well as for the opening of macro-critical closed professions (e.g. ferry transportation).”\nThen there are the new demands, like “rigorous reviews and modernization of collective bargaining [and] industrial action,” which is Eurospeak for rubbing out labor rights. Other demands make it clear that these decisions are not only extensive and fine-grained, but designed as much as possible to remove responsibility and control from the Greek people and their government.\nThe “scaled up privatisation programme” is to “be established in Greece and be managed by the Greek authorities under the supervision of the relevant European Institutions.” And the “quasi-automatic spending cuts in case of deviations from ambitious primary surplus targets” are “subject to prior approval of the [European] Institutions.”\nMost telling of all, “The government needs to consult and agree with the Institutions on all draft legislation in relevant areas with adequate time before submitting it for public consultation or to Parliament.” That is to say, on every above-named area of reform — from tax policy to labor markets — the government must consult first with its European managers.\nThe pièce de résistance, however, is that the Greeks are maximally accountable to the Eurogroup while the Eurogroup is minimally accountable and maximally arbitrary. Having listed its demands, the document then says, “The above-listed commitments are minimum requirements to start the negotiations with the Greek authorities.” Later, the document states that a European Stability Mechanism program is possible “provided that all the necessary conditions contained in this document are fulfilled.”\nThere is no guarantee the money is forthcoming. In other words, the Eurogroup retains maximum discretion to decide that Greece has failed to meet any of the impossible demands made upon it, while the Greeks possess no similar ability to hold the Europeans to account for their failures.\nRecall, for instance, that the agreement requires Greece to run budget surpluses that the Germans and French have never managed to achieve and that the European Central Bank recently refused to extend sufficient emergency financing to the Greek banks, essentially engineering a near bank failure in direct violation of its mandate to provide emergency liquidity to illiquid banks.\nThere are those who think that you can be pro-euro and anti-austerity. As this round of negotiations show, the economics and politics of the euro are not separated like that. The euro is a political project. It is unification without sovereignty. It is the delegation of national sovereignty to groups of finance ministers and supranational bodies whose main task is to suppress the reappearance of the very source of their power.\nThe political institutions and practices that have grown up around the euro and the EU are based on the belief that exercises of sovereignty are dangerous, irresponsible, and unaccountable. Although these institutions are in one sense nothing more than the product of agreements between nations, their raison d’être is to prevent any further, outright expression of that sovereign power. That is why they insist on total subjection to their decisions, and why Greece became about more than Greece.\nThe Greeks dared to assert popular sovereignty at the only level it is currently possible to do so. The bitter irony being that the discretion demanded by these post-sovereign entities is less accountable than when exercised as the outright power of a democratically elected government. And no less vindictive.", "url": "https://www.jacobinmag.com/2015/07/tsipras-eurozone-varoufakis-syriza-debt/"}