{"authors": ["Michal Rozworski", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:37", "date_modify": "2020-05-04 19:56:37", "date_publish": "2015-04-17 00:00:00", "description": null, "filename": "2015_04_canada-austerity-stephen-harper-conservatives_1588622197.html", "image_url": "https://images.jacobinmag.com/2015/04/17003716/canada-budget-1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_04_canada-austerity-stephen-harper-conservatives_1588622197.html", "title": "Canada’s Austerity Consensus", "title_page": "Canada’s Austerity Consensus", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nHow exceptional is Prime Minister Stephen Harper and his crop of Canadian conservatives? For not just large- and small-l liberals, but also some leftists, the last decade has been an aberration — particularly compared to the alleged synthesis between responsible government and economic expansion that occurred during the 1990s. Yet while both public and elite consensus has shifted even further to the right since the ’90s, too often Harper and the current Conservatives are portrayed as an anomaly rather than a continuation. The ultimate irony of the last two decades of austerity may be that Harper’s Conservatives have been able to rest comfortably on their laurels because of previous attacks on working-class power and livelihoods, even temporarily increasing public spending to save a system in crisis. While the 1980s had laid some of the groundwork in Canada, the Right’s counterrevolution was not as successful as it had been under Ronald Reagan in the US or Margaret Thatcher in the UK. It was up to Canada’s Liberal Party, the centrist, “natural governing party,” to cement it. In his 1994 budget speech, Paul Martin — then the finance minister, later the prime minister — encapsulated the Liberal message: It is now time for government to get its fiscal house in order. For years, governments have been promising more than they can deliver, and delivering more than they can afford. That has to end. We are ending it . . . Over the next three years, for every one dollar raised in new revenues we will cut five dollars in government expenditures. The subsequent austerity drive was one of the most severe in the Global North, and remains the foundation for the Right’s strategy of death by a thousand cuts. Taking this longer view of the political economy of Canadian austerity — and the nature of Harper’s conservatism — isn’t just crucial to making sense of the present. It provides more stable ground to fight for a less austere future.\nThe Foundation for Austerity As the 1993 election approached, Canada was just starting to exit its longest recession since the Great Depression, and elites faced the prospect of both populist right-wing upstarts in the West and separatists in Quebec gaining popularity. The mass media stepped in and set a centrist tone, asserting the need for a new “responsible” government. As the Wall Street Journal warned Canada would soon become a “banana republic,” more than a million Canadians watched a panicky episode of the investigative news program “W5” about New Zealand’s debt. With the disintegration of the ruling Progressive Conservatives, the Liberals, led by Jean Chrétien, won a resounding electoral victory. The economic environment the Liberals inherited was a product of the tight monetary policy carried out in the late ’80s. Modeled after Federal Reserve Chairman Paul Volcker’s high-interest approach during the early Reagan years, it was intended not only to dramatically cut inflation, but to restore power to capital. Unemployment jumped from 7 percent to 11 percent. What’s more, the public debt accumulated during the elevated-interest-rate era, as well as during the 1990–92 recession, provided a pretext to reshape Canada’s public sector. On issues of the economy, much in the Liberals’ 1993 campaign platform was developed with the help of private-sector experts. Billionaire Paul Desmarais Sr, on good terms with large segments of the political class, including both Chrétien and former Progressive Conservative Prime Minister Brian Mulroney, was a mentor to Martin and left his imprint on economic policy of the time as well. A consensus developed that economic and employment growth on their own would not be enough to get Canada out of the recession. On the other hand, the Liberal experts were not in favor of the restrictive zero-inflation experiments that briefly held influence in the Conservative Party. Thus, monetary policy could be loosened, but the screws would have to be put to fiscal policy in order to make Canada more “competitive” — in other words, to make labor more pliant. The monetary loosening that followed the early ’90s recession pushed interest rates downward and spurred lagging investment and profits. Low rates also meant the Canadian dollar depreciated against its US counterpart, jumpstarting a lagging export sector. Both profits and investment rose as a percentage of GDP through the late ’90s and 2000s, all the way up to the 2008–9 crisis. Similarly, starting in 1993 and ending only in 2008, Canada consistently exported more than it imported, accumulating a current account surplus, primarily with the US. Canada was thus further integrated into the US-led global surplus recycling mechanism that Greek Finance Minister Yanis Varoufakis has called the “Global Minotaur.” This economic pattern paralleled the integration of Canadian elites with their US counterparts. NAFTA, signed in 1992 by Mulroney and implemented in 1994 under Chrétien, was not a case of the US imposing its will on Canada, but rather of large sections of capitalist elites across the continent securing their common interests over the working class in both countries. Free trade reconfigured coalitions within elites as well as between them and the Canadian state. Of course, some sectors were negatively impacted, but in general the agreement was a win-win for continental capital: rationalized supply chains not only cut costs but put more workers in competition with each other. This was the context in which the Liberals began their cutbacks, initially quick and deep. A greater share of government expenditures redirected towards debt repayment created additional false scarcity of funds for direct spending. Spending on federal government programs and transfers to provinces, cities, and individuals fell by over 5 percent of GDP from 1993 to the turn of the millennium. Spending growth did not just slow: absolute expenditures decreased. Reduced fiscal transfers to provinces put the squeeze on local governments. Since the 1990s, Canada has seen provincial governments — not just governed by Liberals and Conservatives, but also by New Democrats — impose austerity further down the line. Since provinces are responsible for many basics like health, education, and welfare benefits, shrinking transfers have further eroded the working class’s social wage. Privatizations, workfare schemes, tuition increases — all were applied (unevenly) across the country. Overall, the sharp turn to austerity created a more punitive welfare state. While Canada’s economic growth in the mid to late ’90s fed off that in the US, the character of its reforms was also in line with the Clintonite agenda. There was a similar push to create conditions for business expansion even less encumbered by working-class demands. A major strategy was an attack on the social wage.\nDepressed Wages, Housing Boom One major social program that is the responsibility of Canada’s federal government — and provides a good example of the transformations wrought by austerity — is unemployment insurance. The Liberals ate into the real value of benefits and made eligibility requirements more restrictive. While just over 80 percent of Canada’s unemployed received jobless benefits during the early 1990s, this percentage fell to about 45 percent by the early 2000s. Most unemployed workers no longer received any benefits. Alongside curtailed access, the dollar amounts of benefits were frozen, making them more difficult to survive on with each passing year. When workers know they are less likely to get state support, they are also less willing to go out on a limb to demand wage increases, form a union, or otherwise try to better their working conditions. Changes to unemployment insurance were part of a reorientation towards more flexible labor markets and a lower social wage. Business was helped directly too: their unemployment insurance contributions fell by over a third. The OECD’s measure of real unit labor costs grew at an average rate of just 0.5% per year between 1993 and 1999 and 2.1% in the first decade of the 2000s, both down from an average of 6.6% over the previous two decades. Decreased labor costs were reflected in stagnant real wages for most workers throughout the ’90s and 2000s. The depreciating Canadian dollar further cut into wages with higher prices for imported consumption goods. Finally, the social wage provided by public programs and transfers fell under Martin’s austerity budgets. How was austerity mitigated once the ’90s boom ran out of steam? In short, debt and housing wealth. The fall in government borrowing as a result of Liberal deficit-fighting was offset by a rise in household borrowing, reducing the public debt but increasing private debts. (Rolling back the welfare state means more people borrow to stay afloat and spend more on basic services.) As in many parts of the world, including the US and the UK, Canada’s housing sector took off after the 2000 bust. This divided the working class. For those who owned homes, housing became a crutch, a valuable asset to borrow against or downsize, making up for the lower social wage and stagnant incomes left after the ’90s expansion. For those who did not own a home, rising prices and rents became a further source of daily struggle. The federal Liberal governments of the 1990s ended the mission of directly providing public housing, capping funding and offloading responsibilities onto Canada’s provincial governments. The number of new units of social housing built sunk from around twenty thousand in 1993 to under two thousand in 1998. New financial products were the wave of the future to which the Liberals harnessed their housing strategy. This included the commercialization of the Canada Mortgage Housing Corporation, greater access to mortgage finance, and increased competition. All of these moves helped lay the foundation for the coming rise in housing prices and greater working-class stratification. At the same time, those whose private wealth multiplied and ended up on the “winning” side of the housing disparity could be convinced to support austerity policies, even as that same austerity ate away at shared public wealth. Interestingly, while the acceleration in house prices and personal indebtedness was similar in Canada to that in the US and the UK, Canada did not implement the same degree of financial deregulation. Without the economic and political clout of a big financial center like New York City or London, Canadian regulators were able to exercise some control over the financial sector, while still allowing for a stable and very profitable banking oligopoly. House prices, asset values, and debt levels continue to climb in Canada with only a small hiccup during the 2008–9 global crisis. Since 2000, growth in the value of housing assets has consistently outpaced the growth of the economy. But rather than idly speculate how big Canada’s housing bubble is and when it will burst, it’s far more interesting to further explore the role played by housing in sustaining Canadian austerity and to consider its effect on a possible broad-based working class politics.\n“Expansionary Austerity” The 1990s in Canada are often held up as an example of “expansionary austerity” — austerity that is not only accompanied by but causes growth. If this sounds a bit nuts, it is. In fact, even economists from the International Monetary Fund have thoroughly debunked the idea: the growth that occurred during most of bouts of “expansionary austerity,” including Canada during the Liberal-led ’90s, would have happened anyway. Indeed, crediting austerity for sparking Canada’s 1990s growth ignores several factors: first, Canada benefited from strong US expansion, especially given the strength of export growth; greater integration through NAFTA only solidified how closely Canada followed the US boom of the mid- to late ’90s. Second, fiscal austerity was accompanied by an aggressive monetary loosening that resulted in low interest rates and a depreciation of the exchange rate; alongside more flexible labor policies, these improved profits, investment, and growth. Resource booms also played a role in driving wage growth and reducing unemployment in some regions. But hawkers of austerity around the world continue to cite 1990s Canada as model case. Within Canada itself, the ’90s is still mythologized, especially when all the major parties engage in the “fiscal stewardship” game during election campaigns. Around 2000, the Liberals switched their focus to returning the “fruits of austerity” to the public, and the Conservatives continued this practice. While working-class incomes were padded to soften the blow of a falling social wage, the gains went disproportionately to the wealthy: there were tax reductions across the board, including cuts to taxes on corporations, top incomes, and capital gains. Between 1993 and 2011, after-tax incomes for the top quintile grew three times as quickly as they did for the bottom quintile (and nearly twice as quickly as the middle quintiles). At the same time that politicians shifted to cutting taxes, the spending to GDP ratio stabilized: it is comparable today to what it was in 2000. Similarly, per capita federal government transfers to individuals (pensions, unemployment benefits, child benefits) in real terms are today just below the high point that occurred right before the Liberals came to power.\nThe Making of a Consensus The austerity implemented by the Liberals, starting with the 1994 budget, helped shift the political consensus sharply to the right. The Conservatives, riding a wave of public resentment against the Liberals due to corruption scandals, were first elected to a minority government in 2006. After five years of governing with the tacit support of the Liberals, the Conservative Party finally gained a majority in 2011. Austerity under Stephen Harper is less interesting, partly because the task has been easier. The Conservatives have been happy to keep the ship sailing in the same direction. Far more striking is how easily the party was able to implement a short bout of Keynesian countercyclical policy in the immediate aftermath of the 2008–9 crisis. The austerity consensus was strong enough that, given the risks to the incomes and assets of the capitalist class, a spike in public spending (largely on one-off projects) was brought in without significant opposition from elites. In a way, this only shows how neoliberalism has no new ideas for dealing with the crises it creates, resorting to Keynesian remedies that are abandoned once accumulation is reassured. As Canada’s financial sector survived, commodity prices continued to boom, and global contagion was limited by the efforts of central banks, the Conservative expansionary program proved to be extremely short term, largely confined to one budget cycle. Elites gambled that they didn’t have to worry about a temporary increase becoming the seed of something larger, and they were right — the year after the stimulus was passed, the Conservatives were returned with a majority and spending fell back to record lows. Canada’s austerity had shown itself adaptable to circumstances. Since the crisis, the Conservatives have returned to the pattern of slow-motion austerity, most recently paying out dividends to elites via additional tax cuts and regulatory changes that further distribute gains to the top of the income distribution. Political opposition is slowly rebuilding, but the working class remains weak and largely unorganized. There are divisions between public and private sector workers, between those who have gained from housing wealth and those who haven’t, between an older organized base and new generations of low-wage service workers who have never known a higher social wage. Meanwhile, austerity complemented and bolstered profit margins for two decades, punctuated only by the two most recent crises in 2000 and 2008–9. Profit rates recovered quickly from the bottom of the 1990–92 recession, bouncing back to their pre-recession high within a few short years. They haven’t really looked back since, despite the changing fortunes of the US economy and a significant period of Canadian dollar appreciation in the 2000s. One change, however, was that economic growth and attendant profit growth in Canada after 2000 has been driven much more by domestic consumption than by exports. To what extent this may be a source of future weakness remains to be seen. Today, the electoral arena is comprised of parties broadly committed to cutting spending over raising revenues, continued austerity over any significant move to expand the social wage, and capital over workers. The Conservatives have been able to escape strong critique because of the lack of organization in the face of this consensus on austerity. They are once again the favored party of elites, retaking the crown of the largest recipient of political contributions from the Liberals. The Conservatives have also deftly exploited social fault lines. They have stoked fear to chip away at civil liberties, played to their right-wing base by scapegoating migrant workers and attacking environmentalists. It bears repeating that neoliberalism doesn’t just mean that state expenditures are cut — austerity is aimed at specific expenditures and particular groups. Alongside the cuts to the social wage, some state spending has been redirected. The Conservatives have increased spending on the military and the security apparatus. War and terrorism have been used to increase the size of security and surveillance forces and divert attention from domestic political economy when convenient. And public investment is increasingly beholden to private management and capture, in particular through the use of “public-private partnerships.”", "url": "https://www.jacobinmag.com/2015/04/canada-austerity-stephen-harper-conservatives"}