{"authors": ["Vivek Chibber", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:08", "date_modify": "2020-05-04 19:58:08", "date_publish": "2015-09-17 00:00:00", "description": null, "filename": "2013_04__1588622288.html", "image_url": "https://images.jacobinmag.com/2015/09/17005751/Haitian_Revolution-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2013_04__1588622288.html", "title": "How Does the Subaltern Speak?", "title_page": "How Does the Subaltern Speak?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "VC\nWell, we have to distinguish between two forms of Eurocentrism: one is kind of neutral and benign, which says that a theory is Eurocentric insofar as its evidentiary base has come mostly from a study of Europe. In this sense, of course, all the Western theories we know of up to the late nineteenth century overwhelmingly drew their evidence and their data from Europe, because the scholarship and the anthropological and historical literature on the East was so underdeveloped. In this sense, they were Eurocentric.\nI think this kind of Eurocentrism is natural, though it’s going to come with all sorts of problems, but it can’t really be indicted. The most pernicious form of Eurocentrism — the one that postcolonial theorists go after — is where knowledge based on particular facts about the West is projected onto the East and might be misleading. Indeed, postcolonial theorists have indicted Western theorists because they not only illicitly project onto the East concepts and categories that might be inapplicable; they systematically ignore evidence that is available and might generate better theory.\nIf it’s Eurocentrism of the second kind that we’re talking about, then there have been elements in the history of Marxist thought that fall prey to this kind of Eurocentrism. However, if you look at the actual history of the theory’s development, those instances have been pretty rare.\nSince the early twentieth century, I think it’s accurate to say that Marxism is maybe the only theory of historical change coming out of Europe that has systematically grappled with the specificity of the East. One of the most curious facts about subaltern studies and postcolonial theory is that they ignore this. Starting with the Russian Revolution of 1905 and on to the Revolution of 1917, then the Chinese Revolution, then the African decolonization movements, then the guerilla movements in Latin America — all of these social upheavals generated attempts to grapple with the specificity of capitalism in countries outside of Europe.\nYou can rattle off several specific theories that came out of Marxism that not only addressed the specificity of the East, but explicitly denied the teleology and the determinism that subaltern studies says is central to Marxism: Trotsky’s theory of combined and uneven development, Lenin’s theory of imperialism, the articulation of modes of production, etc. Every one of these theories was an acknowledgement that developing societies don’t look like European societies.\nSo if you want to score points, you can bring up instances here and there of some sort of lingering Eurocentrism in Marxism. But if you look at the balance sheet, not only is the overall score pretty positive, but if you compare it to the orientalism that subaltern studies has revived, it seems to me that the more natural framework for understanding the specificity of the East comes out of Marxism and the Enlightenment tradition, not postcolonial theory.\nThe lasting contribution of postcolonial theory — what it will be known for, in my view, if it is remembered fifty years from now — will be its revival of cultural essentialism and its acting as an endorsement of orientalism, rather than being an antidote to it.", "url": "https://www.jacobinmag.com/2013/04/how-does-the-subaltern-speak/"}