{"authors": ["R. H. Lossin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:14", "date_modify": "2020-05-04 19:57:14", "date_publish": "2015-09-17 00:00:00", "description": null, "filename": "2015_10_usps-bronx-privatization-murals-new-deal-art_1588622234.html", "image_url": "https://images.jacobinmag.com/2015/09/17005804/ukiah-post-office-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_10_usps-bronx-privatization-murals-new-deal-art_1588622234.html", "title": "Why the Post Office Matters", "title_page": "Why the Post Office Matters", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn 1938, as part of Franklin Roosevelt’s New Deal, Ben Shahn and Bernarda Bryson began work on thirteen large murals for the lobby of the Bronx General Post Office (GPO). Collectively entitled “Resources of America,” the Shahn-Bryson murals were inspired by the Walt Whitman poem “I Hear America Singing.” A large, central panel depicts two columns of workers, backs turned to us as they read the following Whitman lines on a chalkboard: For we support all,\nAfter the rest is done and gone, we remain,\nThere is no final reliance but upon us,\nDemocracy rests finally upon us, (I, my brethren,\nbegin it,)\nAnd our visions sweep through eternity. The murals embody a spirit of public luxury that couldn’t be more alien to today’s political discourse. From 1933 to 1939, in the face of the Great Depression, federally funded public works projects created jobs, built infrastructure (including 1,100 post offices, the Bronx GPO among them), and produced one of the largest public art collections in the world. In what is nothing less than an enclosure of public property, this luxury is now being handed over to private interests. Last year, the Bronx GPO was sold to the real-estate developer Youngwoo & Associates for $19 million. The sale is but one casualty of an ongoing effort to privatize the United States Postal Service (USPS). The assault on USPS is, in turn, only one example of a larger push toward privatization. But the historical and cultural significance of postal properties makes this a particularly tragic instance of the government’s growing willingness to hand over public property. It is also a singular example of the lengths to which right-wing politicians and their corporate beneficiaries will go in order to justify the transference of public wealth to the private sector. The Bronx GPO was recently approved for development as a retail space — so members of the public will still be able to physically enter the premises. And because the murals were classified as an interior landmark in 2013, they remain the property of the USPS. This means that the artworks, thankfully, are not subject to the whims of market logic. It also means that USPS — not Youngwoo & Associates — is paying for their intensive and expensive restoration. USPS has recently been unloading buildings at an alarming rate. According to Steve Hutkins, a literary scholar and editor of Save the Post Office, since 2010 the Postal Service has sold at least sixty properties and perhaps as many as a hundred. The 2012 USPS annual report stated that after a review of four thousand facilities more than six hundred buildings were “earmarked for disposal.” A significant portion of those sold or listed are historic buildings or are eligible for the National Register. The post office in Venice, CA was sold to a film producer in 2012; Greenwich, CT’s historic post office is slated to become a Restoration Hardware; and Bethesda, MD lost its only building listed in the historic register when its Wisconsin Avenue branch — also a New Deal building with historic murals — was sold for $4 million.\nCooking the Books As the last thirty years of world economic history have shown, deficits are one of the best ways to ideologically justify the private plunder of public coffers. But the post office is not broke. The efforts of David Walker, who served as the country’s comptroller general from 1998–2008 and whose right-wing resume is extensive, were indispensable to the companies trying to profit off the panic. The reports issued by the Government Accountability Office (GAO) during Walker’s tenure repeatedly label the postal service as “high risk” and suggest measures such as downsizing the workforce, selling buildings, and outsourcing or fully privatizing certain aspects of its operations. But in order to do any of these things, the system needed to look like it was actually in trouble. The political manufacturing behind the agency’s current “crisis” is appallingly obvious if a bit convoluted. A 2002 GAO report estimated that the USPS was liable for close to $100 billion in pensions, workers’ compensation, treasury debt, and post-retirement health benefits. On review by the Office of Personnel Management (OPM), however, it was discovered that rather than running a deficit, current USPS payments to the Civil Service Retirement System (CSRS), were set to overfund benefit obligations by $71 billion. In 2003, another GAO report reviewed the figure offered by the OPM and estimated the potential overfunding at $103 billion. The OPM recommended that the postal service reduce its payments, effectively saving $3 billion annually. But even though the post office is mandated to run much like a private business, generating its income from operations rather than tax dollars, the money it pays into the CSRS is figured into the unified federal budget. If the post office were to keep the extra money, the Treasury Department would be out $3 billion dollars annually. In order to keep the $3 billion in payments, the Retiree Health Benefits Fund was created as part of the Postal Accountability and Enhancement Act (PAEA) of 2006. The PAEA also demands that the postal service pre-fund the next fifty to seventy years of retiree health benefits over the course of a decade — a demand that is not made of any other federal agency. A sensible payment schedule would be something along the lines of $1.5 billion annually over forty to fifty years, but the PAEA requires the post office to pay $5.4–$5.8 billion annually over the next ten years — producing the $5.5 billion figure regularly cited by Congress and uncritically repeated by news outlets.\nPublic Versus Private The sense of urgency generated by the postal service’s entirely fake debt is buoyed by the neoliberal myth that for-profit enterprises are masters of efficacy. But historically, the postal service has been effective precisely because it is not organized around a bottom line. As historian Richard John notes, if the USPS had been created by “market incentives [rather] than political fiat,” heavy, and therefore expensive, newspapers would not have reached the hinterlands — cutting off millions from political debate. The postal service continues to incur some losses fulfilling its public mandate through delivery to sparsely populated areas. This democratic logic is nowhere to be found in policymakers’ handling of the post office today. Congress’s choice of real-estate broker for the postal properties is a great example. In 2011, the CB Richard Ellis Group (now CBRE), the world’s largest commercial real-estate services firm, was awarded an exclusive contract to market USPS facilities, earning a commission of 2 to 6 percent on sales. Richard Blum, Sen. Diane Feinstein’s husband, was one of the company’s main stakeholders. Nepotism aside, the company’s handling of these transactions has been problematic at best. CBRE frequently represents both buyer and seller, creating a conflict of interest that is likely to lose the post office millions while making CBRE a pretty penny by doubling its commissions on each sale. CBRE also manages much of the USPS’s leased property (24,000 spaces) and has been accused of illegally high rent increases, as well as collecting commissions for lease renewals (nowhere to be found in the original contract). Earlier this year, the postal service’s Office of Inspector General recommended the termination of CBRE’s contract.\nProfiteering and Pushback Precisely because the postal service is quite profitable, a number of corporations would be happy to take responsibility for certain aspects of its operations. A 2013 report by the National Academy of Public Administration (NAPA), one of many right-wing think tanks with similarly anodyne names, suggested that the operations of the post office be divided into retail, processing, and delivery. According to the scheme laid out in the ostensibly independent report presented to Congress, retail and processing would be taken over by private entities, and delivery, the least profitable of the three operations, would continue to be the responsibility of the state. The report, far from being independent, was funded by Pitney Bowes, Inc, a company that already owns and operates a massive pre-sorting network and makes millions of dollars through contracts with the post office. USPS offers discounted rates for mail that is pre-sorted by zip code. Pitney Bowes contracts with companies that send large amounts of mail and splits the savings with its clients. It has a direct interest in the privatization of mail sorting services. The study also happened to be coauthored by the same David Walker who, as comptroller general, was behind the series of GAO reports designating the postal service as “high risk.” The USPS has apparently realized that the symbolism of these sales is not sitting well with the public. The sale of postal buildings has slowed down significantly. There are currently only thirty-eight buildings listed on the USPS properties for sale website. Community activists along with organizations such as the Advisory Council on Historic Preservation and the National Trust have thrown their weight behind the effort to keep these buildings public, and Congress has taken an interest in slowing the sales. Berkeley’s La Jolla Post Office is a case in point. In 2012, after learning of plans to sell the historically significant property, Brechin gave a talk at the Hillside Club — a community organization devoted to promoting the arts in Berkeley — that led to the Save the Berkeley Post Office movement. City attorney Antonio Rossman filed a lawsuit in federal court to stop the sale, arguing that it violated the National Historic Preservation Act as well as a number of EPA regulations. The San Francisco court ruled in their favor — kind of. The post office sale isn’t off the table, but it is “under advisement” for the next five years. Brechin speculates that USPS backed off because it feared losing, and thus setting a difficult legal precedent for other sales. Delaying sales does not mean that the effort to privatize the postal service has ended or even slowed down. USPS recently contracted with Staples to take over portions of its retail business, shifting its efforts toward the building of alternative and private infrastructure. Blocking these other routes to privatization requires continued public diligence. The National Labor Relations Board has issued a complaint charging that USPS illegally subcontracted this work with the office supply chain store. A favorable decision would return this work to postal employees and safeguard one of the postal services’ revenue streams.", "url": "https://www.jacobinmag.com/2015/10/usps-bronx-privatization-murals-new-deal-art"}