{"authors": ["Stathis Kouvelakis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:29", "date_modify": "2020-05-04 19:53:29", "date_publish": "2015-05-17 00:00:00", "description": null, "filename": "2015_05__1588622009.html", "image_url": "https://images.jacobinmag.com/2015/05/17003939/19ATHENS-master675-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_05__1588622009.html", "title": "The Impossible “Honorable Compromise”", "title_page": "The Impossible “Honorable Compromise”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "References, with positive or negative connotations, to the idea of an “honorable compromise” are very much in vogue in Greece. In the media discourse, and, more worryingly, of the government itself, “reaching an honorable compromise” with the so-called “institutions,” as the troika has been renamed, has become the strategic goal of the period.\nNeedless to say that, on the part of Syriza, this discursive slippage amounts to an abandonment of the objective of the break with the memoranda and the troika rule on the basis of which it won the elections.\nBut what can, in the present context, this all-pervasive reference to something as opaque as an “honorable compromise” mean?\nLet us begin with the second word, the “compromise.” In both Greek and Latin, the term “compromise” has strong connotations of reciprocity. “Symvivasmos” is a conjunction of “syn” (together) and “vaino” (go) similar to “compromissus,” which puts together “com” (together) and “promittere” (promise). “Compromise” means therefore that concessions are made on both sides, perhaps unequally, but at least at a scale that allows comparability. For the trade-off to be meaningful, the moves on either side must be if not exactly balanced, then at least subject to a (common) measure.\nAs a consequence, if one side, obviously the stronger, is not offering the slightest concession, then what is involved cannot be called a compromise. The term becomes just a figleaf to provide cover for the pursuit of total subjection.\nBut there is a further aspect to the formulation: the ethical. The “honorable” in “honorable compromise” refers to a notion of “honor.” To put it differently, a compromise of this kind presupposes a “code of honor” shared by both sides. In that sense any real compromise is “honorable.” Speaking of a “dishonorable compromise” amounts to a contradiction in terms.\nBut here a real ambiguity appears: although it is not at first sight evident, the term contains within itself a normative dimension, which is however, in ordinary discourse, latent. “Compromise” typically implies a “non-ideological” attitude. As a goal, it is allegedly oriented to the demands of a “pragmatic” approach.\n“Ideology,” by contrast, is the attribute of those who reject compromise, who are incorrigibly “maximalist,” dangerous “hardliners,” or just inoffensive “dreamers.” The reference to compromise performs an ethical and political function but one that remains implicit, operating in an undercover way. To that extent, we can talk of compromise as an ideology.\nDoes this mean that the concept of compromise is to be rejected or that compromise in general is impossible? Obviously not. What should then be the criterion to judge its desirability or feasibility? There is only one: politics, the art of intervention in a specific conjuncture.\nHerein lies the real meaning of Lenin’s famous text on compromise, which has unfortunately been misused to all kinds of purposes. Lenin ridicules those who reject compromises as a matter of principle, in the name of some moral purity, to have their hands always clean. But also to be rejected is the notion that compromise, again as a matter of principle, is a goal in and of itself.\nEverything depends on the concrete analysis of the concrete situation. At this precise moment, says Lenin in early September 1917, and only for a very short time (“only a few days or at most a week or two”), compromise is possible and desirable “for the purpose of exhausting even the slightest posssibility of the revolution’s peaceful development.”\nBut very soon after, the conjuncture had changed and talk of ”compromise” is no longer possible, not because such an idea is morally blameworthy but because it is politically unrealistic. The revolution is not able to develop peacefully anymore. The choice then is not between a “compromise” and a “break.”\nThe break is in any case unavoidable. The choice is between a Kornilov type of break and a Lenin type of break, in other words between a counterrevolutionary coup and a radicalization of the revolutionary process. Under these circumstances the search for a compromise would mean political impotence, and impotence in such a polarized situation means annihilation.\nThe ongoing confrontation inside Syriza and Greek society over the capacity for, and feasibility of, compromise (usually without a distinction being drawn between the two) is not a conflict between “realists” who desire it and “hardliners,” “maximalists,” or “ideologues” who reject and it and work for a “break.”\nDiscussing in these terms can only lead to a trap, that of a kind of politics subordinated to abstract moral norms, turning thus to mere moralizing. This conception reproduces the predominant discourse, “naturalizing” politics by assimilating it to the management of an order which by its nature cannot be transcended.\nTo put it somewhat differently: it is precisely because “compromise” under present conditions is in practical terms impossible, that its compulsive evocation obscures the actual issues, depoliticizing and presenting them as a clash of ethical preferences: “realists” vs. “hardliners,” “pragmatists” vs. “utopians,” and so on.\nWhat is actually reflected in the current discursive struggle is that “honorable compromise” is not possible because the prerequisites for it do exist. The stronger party, the European Union, is not interested in compromise but only in administering humiliation, which by definition entails dishonor.\nThe unfeasibility of compromise is of course related to the asymmetry in the balance of forces, which makes compromise in a sense optional and so, from the viewpoint of the stronger party, unnecessary. But it does not boil down only to that.\nDuring the only period in history when capitalism, in the countries of the “world center,” functioned on the basis of a class compromise — such as the decades immediately following the Second World War — an essential role was played by the fact that a sector of the Western bourgeoisie had participated in the antifascist war and had in that context found itself, for a brief but decisive moment, on the same side with the organized forces of the subaltern classes.\nThis minimal, but by no means negligible, common terrain persisted even through the first phases of the Cold War, at least in Europe. Greece underwent an analogous experience during the struggle against the military dictatorship (1967–74), which prepared the ground for the political compromise that followed its fall and put a definitive end to the repressive regime in place since the end of the civil war (1949).\nThe neoliberal counterrevolution which, as aptly emphasized by both Naomi Klein and David Harvey, had its beginnings with Pinochet’s tanks putting an end to the Popular Unity experiment in Chile, scattered all the above to the four winds.\nThe balance of forces that had sustained the postwar class compromise was crushingly overturned to the advantage of capital. The shared references to the values of the antifascist struggle, fundamentally important in the creation and legitimation of the postwar social state, evaporated. They were replaced by reheated Cold War anticommunism, in the guise of “anti-totalitarianism,” mixed with exaltation of the values of the market, of profit, and of “free competition.”\nThe bourgeois world and the established order in Europe is no longer represented by the likes of De Gaulle, Macmillan, or Jean Monnet but by Merkel, Dijsselbloem, and Draghi.\nThe shock therapy applied to Greece over the past five years is nothing more than a radical (by the standards of a Western European country) version of this same neoliberal counterrevolution. Those who embody it, inside and outside the country, are executors of an operation of plundering and naked subjection. They are at once violent and vulgar, the antithesis of the type that would seek compromise. In those conditions only the action of the oppressed can open up a perspective of political, social, and ethical regeneration.\nThis presupposes a decisive reemergence of what Gramsci, quoting the French Marxist Georges Sorel, called the “spirit of cleavage” of the subaltern classes, their ability to break the ideological and ethical hegemony of the dominant groups, to uncover the latent antagonism in social relations and put forward their own world view and their own “ethical reform.”\nOnly the cleavage is, in the here and now, “honorable” — precisely because it is the vehicle for a break that is both the prerequisite for and the harbinger of the radically new, uniting politics and ethics in the struggle for popular emancipation.", "url": "https://www.jacobinmag.com/2015/05/greece-syriza-european-union-austerity-troika/"}