{"authors": ["Stathis Kouvelakis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:17", "date_modify": "2020-05-04 19:53:17", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07__1588621997.html", "image_url": "https://images.jacobinmag.com/2015/07/17004603/Greece_OXI-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07__1588621997.html", "title": "Greece: The Struggle Continues", "title_page": "Greece: The Struggle Continues", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "SK\nI think that the referendum was clearly an attempt to get out of the trap into which the government was falling through the negotiating process.\nIt was quite obvious, actually, that during the downward spiral of concessions the government and Tsipras realized that whatever they proposed was never going to be enough for the troika. By the last week in June, it was clear that the agreement that was more or less taking shape would not pass the internal test within Syriza and would not pass the test of public opinion.\nMessages were sent to the leadership and to Tsipras himself from inside the party, from well beyond the ranks of the Left Platform, that this was not acceptable. In the last days of that week, the change in public opinion was also significant, with people saying that they were just fed up with this process of endless negotiations. It was understood that the troika was just seeking to humiliate the Greek government.\nTsipras, who it has to be said is a kind of a gambler as a politician, thought of the referendum — an idea that was not entirely new and which was floated before by others in the government including Yanis Varoufakis — not as a break with the negotiating process but as a tactical move that could strengthen his negotiating plan.\nI can be certain about this, because I was privy to detailed reports about the crucial cabinet meeting on the evening of June 26, when the referendum was announced.\nTwo things have to be said at this point. The first is that Tsipras and most of the people close to him thought it was going to be a walk in the park. And that was pretty much the case before the closure of the banks. The general sense was that the referendum would be won overwhelmingly, by over 70 percent.\nThis was quite realistic, without the banks closing down the referendum would have been easily won, but the political significance of No would have been changed, because it would have happened without the confrontational and dramatic atmosphere created by the bank closure and the reaction of the Europeans.\nWhat happened in that cabinet meeting was that a certain number of people — the rightist wing of the government, lead by Deputy Prime Minister Giannis Dragasakis — disagreed with the move. Dragasakis is actually the person who has been monitoring the whole negotiation process on the Greek side. Everyone on the negotiating team with the exception of the new finance minister, Euclid Tsakalotos, are his people and he was the most prominent of those in the cabinet who really wanted to get rid of Varoufakis.\nThis wing thought that the referendum was a high-risk proposal, and they understood, in a way that Tsipras did not, that this was going to be a very confrontational move that would trigger a harsh reaction from the European side — and they were proved right.\nThey were also afraid about the dynamic from below that would be released by this initiative. On the other hand, the Left Platform’s leader and minister of energy and productive reconstruction, Panagiotis Lafazanis said that the referendum was the right decision, albeit one that came too late, but he also warned that this amounted to a declaration of war, that the other side would cut off the liquidity and we should expect within days to have the banks closed. Most of those present just laughed at this suggestion.\nI think this lack of awareness of what was going to happen is absolutely key to understanding the whole logic of the way the government has been operating so far. They just couldn’t believe that the Europeans would react the way that they actually reacted. In a way, as I have said, the right wing of Syriza was much more lucid about what they were up against.\nThis explains also what happened during the week of the referendum at that level. Tsipras was put under extreme pressure by Dragasakis and others to withdraw the referendum. He didn’t do that, of course, but he made it clear that his next moves were the ones that the right wing would agree with, and the measure was not a break with the line that had been followed up until that point, but was rather a kind of tactical move from within that framework.", "url": "https://www.jacobinmag.com/2015/07/tsipras-varoufakis-kouvelakis-syriza-euro-debt/"}