{"authors": ["Stathis Kouvelakis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:23", "date_modify": "2020-05-04 19:53:23", "date_publish": "2015-01-17 00:00:00", "description": null, "filename": "2015_01__1588622003.html", "image_url": "https://images.jacobinmag.com/2015/01/17002621/greece-economy-elections-syriza-1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_01__1588622003.html", "title": "Greece: Phase One", "title_page": "Greece: Phase One", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "SK\nFirst of all, I agree — that is definitely the case. At a more personal level, what I can say is that, over these last four years, I have been rereading a lot of what has from the outset been at the basis of my political culture, Gramsci and Poulantzas.\nI read a lot of Gramsci to understand the specificities of the crisis in Greece, and the way the economic crisis developed into a full-scale political or “organic” crisis, to use the Gramscian term, and the role of the properly political level in intervening in what seemed at the outset very open, but also very chaotic. It was also useful to think about differences between the Greek situation and the typical Gramscian “war of positions” type of approach.\nOn the one hand, we see a confirmation of the attitude of Gramscian-Poulantzian option, of seizing power by elections, but combining that with social mobilizations, and breaking with the notion of a dual power as an insurrectionary attack on the state from the outside — the state has to seized from the inside and from the outside, from above and from below.\nBut on the other hand, what is missing from the traditional “war of positions” is that we don’t have strong positions in the Gramscian sense, strong and stabilized organizations of the subaltern classes from which we can fight in situations of protracted confrontation. The trade union movement is currently very weak in Greece and has been disorganized by the crisis; the political parties of the Left themselves, including Syriza, are not comparable to the mass formations of the workers’ movement of the previous century. So we don’t have these strong organized blocs from which you can somehow progress and build counter-hegemony.\nBut the situation is much more mobile on the front of social confrontation. We have had big explosions, verging on insurrectionary-type situations, more particularly between June and October 2011. But those that were hoping for a kind of Greek Tahrir-type situation very quickly realized that things would not happen that way. The political and also the electoral level were still very strategic. And this is of course why Syriza’s anti-austerity government actually seized the mood.\nBut I have also been reading a lot of Poulantzas, and specifically late Poulantzas, not only on the strategic issue of the “democratic road to socialism,” but also in order to understand specifically the risks of Syriza’s evolution as a party form and more particularly the need to avoid the “state-ization” of Syriza. The risk of this type of strategy is that, before reaching power, or immediately after reaching power, you have already been absorbed by the state. And, of course, we know that the state is not neutral, that it reproduces capitalist power relations, and so on.\nSo I have been reading a lot of this to understand strategically the situation. And I have also combined these readings with those of Daniel Bensaïd’s texts about the need to reorient strategic thinking on the Left.\nNow the question you raise is truly relevant, because it really seems the Spanish situation is quite similar to Greece. To quote Bensaïd, the Spaniards realized that the indignados were not a self-sufficient proposal, and it was a “social illusion” to think that you can change the situation only via the indignados movement. On the other hand, Podemos is really sui generis: very self-consciously pursuing a populist approach along Laclauian lines.\nMy perception of this is although the developments of Laclau chronologically come after Poulantzas — they came at a time when the very types of issues raised seemed to have moved away from the question of the transition to socialism and seizure of state power raised by Poulantzas. Substantively, I think that Poulantzas is ahead of Laclau.\nWhat I mean by this, very simply, is that the problems that Podemos will face as a party are only starting now. As an organization, as a type of intervention and strategy, at the political level, at the level of the program, of the party, of the relation to the state, to international realities, everything: they have only just started. So, in a way, the serious stuff — and the annoying stuff — is ahead of them.\nMy perception is that they will need to go beyond Laclau to face these tasks. And, to be a bit less optimistic, if Syriza fails, and turns out not being able to face the pressure, I’m not very optimistic about the chances of something less structured (like Podemos) to resist similar types of pressure.", "url": "https://www.jacobinmag.com/2015/01/phase-one/"}