{"authors": ["Jonah Walters", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:46", "date_modify": "2020-05-04 19:59:46", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08__1588622386.html", "image_url": "https://images.jacobinmag.com/2015/08/17004955/bomb-exploding-nagasaki1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08__1588622386.html", "title": "A Guide to the Hiroshima and Nagasaki Attacks", "title_page": "A Guide to the Hiroshima and Nagasaki Attacks", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nSeventy years ago today, the United States detonated a plutonium implosion-type atomic bomb over the Japanese city of Nagasaki, killing between 40,000 and 80,000 people. It was only the second time an atomic weapon had been used in warfare. The first time had occurred three days before, when the United States dropped a uranium gun-type atomic bomb on Hiroshima. Between 90,000 and 170,000 people died in that attack. It was one of the greatest wartime atrocities ever perpetrated. The United States political and military establishment unleashed all the destructive power of the most potent weapons ever created on two civilian populations of little strategic importance. It was a brutal show of force that announced the arrival of the new American superpower and helped establish the stakes of the Cold War. As a Defense Department official later explained, “the Soviets know that this terrible weapon has been dropped on human beings twice in history and it was an American president who dropped it both times. Therefore, they have to take this into consideration in their calculus.” The nuclear attacks on Hiroshima and Nagasaki remain two of the most shameful moments in US history. Perhaps because of this lingering shame, they are too often left understudied. Often they are dismissed as acts of simple naivety — as if President Truman were unaware of the murderous potential of his Space Age super-weapons — or alternatively as an act of wanton callousness, evacuating these events of their political content. In this short primer, Jacobin briefly describes the attacks, their aftermath, and the continuing relevance of nuclear weapons on the global stage today.\nDid the US have to bomb Hiroshima and Nagasaki to end the war? No. There is no truth to the common argument that the United States military had to use nuclear bombs on Japanese civilians to end World War II. American leaders at the time understood well that they had other options. In fact, Truman mentions this in his memoirs, recalling his worry that, should American atomic tests fail, the Soviet ground invasion of Japan would precipitate the Japanese surrender, thus amplifying Soviet influence in East Asia. The Joint Chiefs of Staff of the US military had begun planning a detailed ground invasion of their own, a strategy deliberately developed to avoid the use of nuclear warfare in the Pacific. But more importantly, Japan was profoundly isolated in the region and in the world following the surrender of Nazi Germany. The Japanese state had already begun to collapse, with military and executive bureaucracies in disarray. The Soviet declaration of war — which occurred on August 8, between the bombing of Hiroshima and the bombing of Nagasaki — so panicked Japanese Prime Minister Kantarō Suzuki that, when he was advised not to plan a military response to the imminent invasion, he reportedly replied, “then the game is up.” Whatever cynical agenda motivated the American leaders’ decision to annihilate hundreds of thousands of Japanese lives with new-fangled apocalypse technology, it wasn’t out of an interest in preventing further suffering. The bombing of Hiroshima and Nagasaki was geopolitical posturing at its most barbaric, a catastrophic display of military capability engineered to send a message to the Soviet Union and other powers unfriendly to global US hegemony. It wasn’t about ending the war. It was about announcing American willingness to use doomsday weapons on civilian populations. In August 1945, President Truman and the American establishment held a gun to the head of the entire world. And that gun remains in place to this day.\nWhat were the effects of the bombings? At about 11:00 on the morning of August 9, Kermit Beahan — an American bombadier who would later describe the attack as “the best way out of a hell of a mess” — found a hole in the clouds above Nagasaki and dropped the atomic bomb. It took about forty-six seconds to fall. When it exploded there was an overwhelming flash of light, followed ten seconds later by a deafening roar. Speaking to the Houston Chronicle years later, Beahan would describe the aftermath of the explosion, saying, “’I saw a mushroom cloud bubbling and flashing orange, red and green. It looked like a picture of hell. The ground itself was covered by a rolling black smoke.” The temperature under the explosion has been estimated to exceed 3,000 degrees centigrade — hot enough to incinerate human bodies. Sharp heat rays carried enormous amounts of radiation, which were imperceptible in the moment but would have devastating health effects. The risk of developing leukemia has been estimated at 46 percent for those exposed to atom bomb radiation. The obscenity of the nuclear attacks is illustrated in vivid detail in the testimony of survivors, known in Japan as hibakusha. Emiko Fukahori was only seven-years-old at the time of the bombing, which occurred as she played in a shady bamboo grove close to Nagasaki: I was totally absorbed in playing when I heard the sound of an airplane (a B-29). I somehow immediately knew it was an enemy aircraft. … When the bomb exploded, the first one into the shelter was Sumi-chan, then me, and then a third child. The last girl was incinerated and died on the spot. When I was going into the shelter, I felt the heat on my back, so I escaped the fate of the third child by just a hair’s breadth. When I left the shelter, the adults had been burnt all over their bodies, and were gasping for breath. The surrounding area had completely changed– all the large moso bamboo trees had been knocked down. A woman covered in blood was calling for help as she came up from below, which frightened me. … Fukahori’s older brother also survived the explosion. But, like many who experienced the bomb’s lethal radiation, his health began to deteriorate soon afterward. He started suffering nosebleeds about a week after the bombing. They called a doctor, and my aunt put a wash basin by his side and stayed up all night taking care of him. But the bleeding from his gums and nose grew worse, and he finally died on the 22nd. Before he breathed his last, he complained that his stomach and legs hurt very much. I was sleeping next to him, and he told me to bring a knife because an atomic bomb was lodged in his stomach. I couldn’t bear to watch him suffer, so I got up to get him a knife, but my uncle scolded me. My brother’s corpse had no blood at all. It was as white as a wax dummy. My mother died in Nagasaki at about the same time, and my sister and younger brother died weeping over her body. I was told they held the funeral for all three on the same day. Horrific symptoms of this kind were widespread. Tatsuichiro Akizuki was a young doctor at a Nagasaki medical center 1.4 kilometers from the explosion’s epicenter. At the time of the explosion he was working at the hospital, and recalls yellow smoke billowing in through the building’s collapsed stories. It didn’t take long for the wounded to begin approaching the hospital. About 10 or 15 minutes later, throngs of wounded people streamed up the hill to the hospital. The people in the nearby fields and streets looked as if they had all been burned white, and they had somehow lost their clothes. They staggered towards us, heads in their hands, calling for help. The people who came later were different. Their faces were blackish and had swollen like pumpkins. You couldn’t tell the men from the women. They all stopped to wash off in the river, started walking again, and then stopped to wash off again. Then they all fell flat on their faces and stopped walking. There were a lot of blackened corpses by the river’s edge. … There were corpses in which the heads had been split open, and intestines were spilling from their abdomens. Most of the others had burns–on their face and back, their legs and calves, or their chest and abdomen. The people who were in the fields and paddies turned around to look behind them when the flash from the bomb came, and they were burned on their face and back at the same time He provided round-the-clock treatment to thousands of bomb victims, encountering symptoms he had never seen before and that he was entirely unprepared to treat. Starting about the third day, patients turned black and had diarrhea. They told me that blood had come from their mouths, which had turned purplish. By the fourth or fifth day, I thought this might have been dysentery or peliosis. But some of those people had not been wounded in the bombing, and I began to get suspicious and had a sense of foreboding. The effects of the bombing lingered long after the morning of the August 9, 1945. Amnesty International estimates that by the end of 1945, 70,000 people had died in Nagasaki as a result of the bombing. In the 40 years that followed, 24,000 more would perish as a result of radiation toxicity and burning. On November 2, Japan signed the instruments of surrender, effectively surrendering control of the Japanese state and economy to the American establishment.\nWhat did the American public think? The unprecedented horror of nuclear warfare — so recklessly unleashed by the American executive without so much as a pale imitation of democratic decision-making or regard for human life — managed to cut through even the patriotic bravado of the World War II homefront. Though conservative elements of the public — and most of the military establishment — welcomed the use of the bombs and praised Truman’s choice to deploy such novel killing instruments, Americans were overwhelmingly disquieted by the attacks. Even Truman felt the need to backpedal a little bit when the extent of the devastation became clear. Instead of the chest-pounding typical of wartime presidents, he offered a lukewarm statement that approaches, but stops short, of an apology — the political equivalent of a grimace and a shrug: I realize the tragic significance of the atomic bomb … It is an awful responsibility which has come to us … We thank God that it has come to us, instead of to our enemies; and we pray that He may guide us to use it in His ways and for His purposes. But even American Christian organizations — hardly known for their willingness to contradict the president or criticize the military — weren’t willing to concede this faux-theological justification for such careless destruction of human life. In 1946, the Federal Council of Churches issued a strongly-worded statement that read: As American Christians, we are deeply penitent for the irresponsible use already made of the atomic bomb. We are agreed that, whatever be one’s judgment of the war in principle, the surprise bombings of Hiroshima and Nagasaki are morally indefensible. Internationally, the response was even graver. Unsurprisingly, the bombings found little support among the millions of people living in Third World nations who now witnessed the scale of US cruelty during wartime, and who imagined their own hamlets, ports, and cities in the place of Hiroshima and Nagasaki. And a war-weary Europe was largely unimpressed with the careless savagery of the American military, having recently seen their own cities demolished by bombs while the United States mainland remained entirely untouched. The human effects of the bombings were so shocking that almost no one could celebrate them uncritically without inviting criticism from the Left, Right, and center. But, true to form, the jingoistic American enchantment with US military capacity proved strong enough to make hometown heroes out of some participants in the nuclear attacks, including the navigator of the Hiroshima bomber Enola Gay, who was uncritically celebrated in his small Pennsylvania town’s local paper as recently as last year.\nWhat effects have the bombings had on global politics? Following the introduction of nuclear weapons to the arsenals of the world’s largest military powers, a strong international movement for nuclear disarmament emerged, lambasting global leaders as careless cynics who had put humanity on the path towards annihilation. With the horror witnessed in Hiroshima and Nagasaki fresh in the minds of many, the movement quickly gained traction and became a real force in international politics, helping to encourage the passage of the Nuclear Non-Proliferation Treaty in 1970 and contributing the commonly-used peace sign to the lexicon of popular political symbols. In 1982, one million people demonstrated in New York City’s Central Park, demanding a bilateral end to nuclear arms testing in an effort to de-escalate the Cold War. It has been celebrated as the largest political demonstration in American history. But despite this pushback, nuclear capability continues to be a potent bargaining chip in diplomatic negotiations. The United States occupies the ironic position of self-appointed moral gatekeeper of nuclear technology worldwide — as if the country’s spectacular demonstration of the bomb’s destructive potential in 1945 granted the US an historical right to determine who gets to have it and who doesn’t. And this has served to obscure the United States’ continued interest in developing increased nuclear capability and repeated flouting of its own treaties limiting nuclear weapons manufacturing. Most recently, the international community has witnessed American saber-rattling in response to Iranian nuclear ambitions, and the specter of nuclear warfare has been used twice to justify US military interventions in Iraq.", "url": "https://www.jacobinmag.com/2015/08/hiroshima-nagasaki-atomic-bomb-guide-unnecessary/"}