{"authors": ["Dan Russell", "Catarina Príncipe", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:53:42", "date_modify": "2020-05-04 19:53:42", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08__1588622022.html", "image_url": "https://images.jacobinmag.com/2015/08/17005323/Pirelli-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08__1588622022.html", "title": "Asking the Right Questions", "title_page": "Asking the Right Questions", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIt would be hard to do a better job defending the political project that was Syriza — against both those who have condemned it from the beginning and those who now defend the leadership’s capitulation — than Stathis Kouvelakis has done over the past few months. Kouvelakis, however, was not only defending Syriza or the “new” European left more broadly, but the very strategy of building mass workers parties — to organize and transform class consciousness through struggle — a strategy that stretches back to the nineteenth century. Kouvelakis’s stance is very different from those like Tad Tietze who dismiss the possibility of a political alternative to austerity and ask us to instead focus on developing extra-parliamentary movements. But a viable left strategy for ending austerity can’t counterpoise the social and political: a political alternative must help create its own social basis. This was precisely the project of Syriza, which the newly formed Popular Unity will carry on now that the Syriza leadership has abandoned its commitment to fighting the memorandum. Despite defeats and detours these projects remain the only viable path toward an eventual rupture with not just austerity but capitalism itself. Those of us who don’t have to confront the question of state power just yet nonetheless must learn the right lessons both from Syriza and the history from which it was born.\nReform and Revolution The first experience of building mass working-class parties came to an end with the outbreak of World War I and the almost-unanimous decision of both the German and French social-democratic parties — the leading lights of the European movement — to betray the cause of socialist internationalism and back their respective governments’ march to war. The task of uniting a minority opposition fell to the Bolsheviks. Their efforts laid the basis for a new international that would briefly cohere in the wake of the Russian Revolution. The space for a Third International and mass revolutionary parties that defined themselves against reformist social democracy appeared because of concrete conditions, particularly the high level of class struggle that the war unleashed. Still, only the German communists — already devastated by the assassination of their greatest leaders and expelled from the social-democratic party — were able to make a sustained challenge for power before the revolutionary wave receded, social democracy found its footing, and Stalinism fatally reshaped the young Communist Parties. Those who attempted to chart an independent revolutionary course were purged and isolated from both the official Communist and social-democratic movements that would dominate the workers movement through the Second World War. A number of changes had to take place before revolutionaries would again have a mass audience: revelations of Stalin’s crimes, the Soviet suppression of the Hungarian and Czech uprisings, and the return of militant class struggles in the 1960s and ’70s. The latter exposed the conservatism of most Western European Communist parties and created space for new formations to their left, such as the British Socialist Workers Party and the French Revolutionary Communist League. But with the onset of the neoliberal offensive in the late 1970s, these parties were weakened. Traditional social-democratic parties were also irrevocably harmed. Social democracy’s reform-minded left wing experienced defeat and retreat, while its right wing happily took up managing neoliberalism. As these former workers parties began implementing austerity, dissident social democrats, communists, and others built new parties that worked with social movements and engaged in debates about the best way to confront neoliberalism. Over the past decade, formations like Bloco de Esquerda, Die Linke, and Syriza have filled the hole left by social democracy. Unfortunately, some revolutionaries have made what from the 1930s to the 1980s was a necessity — building small revolutionary groups because of the difficulty or impossibility of operating independently within mass reformist parties or official Communist ones — into a virtue by misinterpreting the experience of social democracy in general and the Bolsheviks in particular. The Bolsheviks were not attempting to build a special “revolutionary” party but a social-democratic one in the repressive context of Tsarist Russia. It was that context and the split with the Mensheviks — not some theoretical purity — that rendered the reformist tendencies that dominated the German party machinery marginalized in Russia. The most relevant lesson from pre-war social democracy for the class struggle today is that we must first build parties that will become dominant in the workers movement through the fight for reforms. It is only through that collective experience of winning tangible victories and testing the limits of reformism that a majority will be won to revolutionary politics. While it’s true that such formations would recreate many of the same contradictions present in prewar social democracy, this does not necessarily doom them to the same result. And revolutionaries who cede to reformists the task of creating and shaping political formations that can appeal to and engage the working-class majority in political struggle undermine not just those but any “separate” revolutionary projects as well.\nParties of a New Type With the rise of neoliberalism and the attendant shift of traditional social-democratic parties from mass workers parties into parties that administer austerity, the political center of gravity has moved to the Right. This means that the struggles in Europe for a functional welfare state and labor rights have been orphaned for several decades. The rightward drift, coupled with the fall of the Soviet Union and the anti-war and alter-globalization movements, opened a political space that needed to be occupied by a new left. These parties were founded on a rejection of Stalinism and a new idea of how to relate to social movements, with the aim of winning the social base of liberalized social democracy. Doing so meant adopting central programmatic points of traditional social-democratic parties — protecting the welfare state and labor rights — and adding a broader layer of feminist and environmental demands. As politics in Europe and beyond swerved to the right, it was up to radicals to organize around these policies. These parties have gone about constructing mass working-class parties with two things in mind. The first is that the party is an instrument of social intervention — interacting with social movements, the labor movement, and grassroots organizing efforts — that should simultaneously build an autonomous political program and fight for state power. The second is that the New Left’s base of support is both the traditional supporters of mass workers parties and the millions who have become discontented with the political system as a whole. These new currents were established on the understanding that there was no need to counterpoise the effort to win people around to a set of left-reformist demands and the need to develop support for more radical ideas and currents. On the contrary, this kind of broad engagement was the only way to keep the far left relevant to ordinary people. The ideologically diffuse composition of these parties allows for their transformation in progressive directions, as well as offering radicals a wide public platform. What has kept revolutionary ideas alive has been precisely their engagement with left-reformist projects. New Left parties now proliferate, but it is still unclear for many on the European left where we go from here. We offer three strategic ideas to contribute to that debate. Broad left parties didn’t emerge out of thin air, or because of the goodwill of small radical or revolutionary groups: they are the product of shifts born of broader political mobilizations that existing parties were unable to tap into. One of the central objectives of these parties of “a new type” has been to undermine the neoliberalized social-democratic parties by siphoning off their basis of support. This is only possible if there is an autonomous political project that refuses to be a crutch for the traditional social-democratic parties, while at the same time fights for reforms, tries to win social majorities, and disputes state power. Moreover, each important rupture with the center-left parties has happened because a formation was applying pressure from the left — as with Oscar Lafontaine and other left-wing German Social Democratic Party members’ involvement in the founding of the socialist party Die Linke. However, this tactic has been only half successful. The strategy of trying to win over both traditional supporters of social-democratic parties and people who have soured on the political system writ large has proven difficult to carry out: these parties “of a new type” bear too much of a resemblance to others for those disillusioned with the system, and seem too foreign and anti-establishment for those not ready to overhaul the existing political system. It bears repeating that the vulnerability and decline of social-democratic parties has been self-inflicted. Applying and managing austerity rather than expanding social provision, these former workers parties have adopted the same basic policy approach as their conservative counterparts. It is precisely because of this “Pasokification” that we need strong left reformist organizations; only they are capable of winning over and organizing the people who are most likely to depart social-democratic parties. And the presence of revolutionaries inside these organizations is and will be crucial to preventing a rightward drift. Another key point has to do with the relation between social struggle in the streets and the pursuit of political office. We have to understand parties as instruments for social struggle, vehicles that help us coordinate and build relationships between different movements. Maintaining the autonomous character of these movements is not necessarily at odds with building programs and campaigns to achieve state power and implement progressive policies. Though what socialists can accomplish using the capitalist state is limited, it does have relative autonomy from business. The state’s capacity to deliver progressive goals depends on the balance of power between labor and capital. Not recognizing this possibility means giving up hope and denigrating all reforms short of revolution. The presence of revolutionary ideas is again essential, not only because of the need to recognize the limits of winning state power without transforming it, but also because the organization of popular power is central to sustaining, and a central question for, any left government.", "url": "https://www.jacobinmag.com/2015/08/greece-syriza-tsipras-elections-euro-left-strategy-die-linke/"}