{"authors": ["Joseph Grosso", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:47", "date_modify": "2020-05-04 19:54:47", "date_publish": "2015-11-17 00:00:00", "description": null, "filename": "2015_11_guatemala-molino-corruption-maras-gangs-cia-united-fruit_1588622087.html", "image_url": "https://images.jacobinmag.com/2015/11/17010357/guatemala-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_11_guatemala-molino-corruption-maras-gangs-cia-united-fruit_1588622087.html", "title": "Killing Guatemala", "title_page": "Killing Guatemala", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Yet the bloodshed long precedes the frightening specter of the tattooed youths of the Maras. And it’s wrapped up in a legacy of colonialism, US imperialism, and dispossession that stretches back almost two centuries.\nIndeed, if there is one thing Guatemala and its neighbors (the Northern Triangle of Guatemala, El Salvador, and Honduras) are known for, it is violence. Last year Honduras topped the world’s murder rate list, and El Salvador is on pace to do so this year.\nIncidentally, Molina’s name also came up in Montt’s first trial, when a witness testified that Molina was commander of a local garrison that burned down villages and executed Ixils. Molina was likely at least complicit in the 1998 murder of Bishop Juan Gerardi , which occurred two days after Gerardi oversaw the publication of a report echoing a UN truth commission that blamed the Guatemalan military for a great majority of the disappearances of two hundred thousand civilians during the civil war.\nThis summer a damning United Nations report revealed that a quarter of the money funding Guatemalan politics comes from criminal organizations, mainly from drug traffickers. Meanwhile, in August, a Guatemalan court granted a retrial to former President Rios Montt — whose 2013 conviction of genocide and crimes against humanity for a series of 1982–83 massacres against the Ixil population of the Quiche region that resulted in 1,771 deaths and the forced displacement of 29,000 people was thrown out on a technicality — despite Montt’s dementia diagnosis, which in the event of another conviction would put him under house arrest instead of in prison.\nAlready the scandal — which erupted this past spring — involved the vice president, the vice president’s private secretary, as well as the chief of the tax authority. When even the business community turned against him, Pérez Molina’s defiant rejection of calls for resignation fell on deaf ears, and the Guatemalan congress decisively voted to strip him of legal immunity. He quickly stepped down.\nThe past year has been a turbulent one for Guatemala. In September, months of mass demonstrations led to the resignation and arrest of President Otto Pérez Molina for his alleged role in a wide-ranging scandal that involved reducing tariffs in exchange for kickbacks.\nIndependence to Intervention\nIn the decades following Guatemala’s independence from Spain in 1821, the church played a dominant role and the question of land took center stage. The political battle took place between Liberals, who were largely secular and saw indigenous lands (and the indigenous themselves) as an obstacle to modernity, and Conservatives to whom the church was the bulwark of civilization and who were by extension more inclined to preserve indigenous communities.\nAfter a period of Conservative rule under pig farmer Rafael Carrera (1844–65), the Liberals came to power in an 1871 rebellion led by Justo Rufino Barrios and backed by the coffee growers. With the emergence of coffee as a commercial crop in Guatemala in the 1840s, the growers had become quite powerful. But their thirst for dominance was tempered by several factors: poor infrastructure, a shortage of labor, and that more than two-thirds of suitable land was public or communal.\nBarrios would change all that. Issuing a series of decrees that culminated in an 1877 law requiring all village communal land to be sold at auction (with most of the funds going to the government), Barrios transferred Guatemala’s publicly owned wealth to private coffee growers. Peasants using village land were given six months to pay for their plot or forfeit it; tens of thousands lost their land, and a majority soon found themselves ensnared in debt bondage.\nThe reforms had the desired effect. Between 1870 and 1900, the volume of Guatemala’s trade increased twentyfold. According to an 1890 coffee census, more than half of the coffee trees registered in the country were on large plantations, the highest concentration in Central America. This vastly unequal structure of landholding would come to dominate Guatemala’s future.\nIn Guatemala, the first half of the twentieth century was plagued by coups and dictatorships. Arguably the worst was Jorge Ubico, who came to power in an uncontested election in 1931 and developed into one of the Latin America’s cruelest — and colorfully eccentric — potentates.\nA numerology enthusiast (a star with the number five at its center was displayed above the presidential palace on holidays) and Napoleon aficionado (the president surrounded himself with Napoleon portraits and busts), Ubico was a passionate American client. Despite his admiration for the fascist regimes of Europe, Ubico moved against the German coffee interests that had long dominated coffee exports, confiscating their property in 1941 and sending some of the planters to US internment camps.\nUbico, like his American backers, was also obsessed with the specter of communism — he literally banned the words “trade union,” “strike,” and “petition.” And while he officially ended the odious debt bondage system, he issued a vagrancy law that mandated landless indigenous peasants work for landowners for 150 days a year. Peasants with limited land had to contribute labor for 100 days. Workers deemed insubordinate could be legally killed, and the government often commandeered workers with “leftover” days to build roads and other public works for no pay.\nThe common thread running through Ubico’s reign (and the decades preceding it) was the viral spread of the United Fruit Company (formed in 1899). Thanks to favorable contracts and extensions in 1924, 1930, and 1936, the company controlled an estimated 40 percent of Guatemala’s economy and owned 3.5 million acres of land (much of it uncultivated). While coffee was still king, bananas made up 27 percent of Guatemalan exports, giving United Fruit powerful leverage to hold down wages and working conditions — which it did, viciously.\nIn the weeks after the Allied victory in Europe, opposition suddenly erupted against Ubico. It began with organizing for higher pay. Educators, in their first overt act of dissent, announced they would refuse to march — as was always rigidly expected — in an annual Teachers’ Day parade scheduled for June 30, 1945.\nThe fuse was lit. Students and shopkeepers, probably inspired in part by Roosevelt’s rhetoric and the reforms of then–Mexican President Lazaro Cardenas, joined the teachers in a series of nonviolent protests. A day before the scheduled parade, the movement assembled for its largest protest, calling for Ubico’s ouster. Ubico responded by ordering his cavalry to charge the crowd, killing or injuring up to two hundred people. But for all its brutality, the dictator’s hold on power was surprisingly tenuous. On July 1, after briefly declaring a state of emergency, he resigned.\nAfter a tumultuous few months — which included a coup led by two younger officers against Ubico’s designated successor — a new constitution was written that enshrined term limits, codified the election of majors for the first time, banned censorship of the press, and sanctified the right to organize. Fair elections held in December 1945 marked the emergence of the first genuinely democratic period in Guatemala’s history.\nThe victor of the December elections was Juan José Arévalo, who won a resounding 85 percent of votes. Arévalo encouraged the formation of political parties and helped shepherd through New Deal–type legislation — a Social Security law guaranteeing workers’ rights to safe conditions, compensation for injury and health care, a labor code, and a National Production Institute to distribute credit and supplies to small farmers.\nIn the educational realm, more books were printed and imported and more libraries built than in the previous half century. Perhaps most significantly, in December 1949 Congress passed legislation allowing any peasant owning less than one hectare to petition for the right to rent unused land from nearby plantation owners.\nBy the time Arévalo’s successor, Jacobo Árbenz, was elected in 1951, the land question had become even more heated. Though the reforms the Arévalo government advanced improved the lot of the small urban working class (wages were 80 percent higher than they were during Ubico’s reign), the vast majority of Guatemala’s population was poor peasants.\nWhen Árbenz entered office, 2 percent of landowners held 72 percent of the land, and indigenous peasants were still obligated to work 100 to 150 days a year on plantations. It was clear that any serious land reform would necessitate a confrontation with the United Fruit Company.\nThat confrontation came under Árbenz. On June 27, 1952, the Guatemalan Congress passed Decree 900, which empowered the government to expropriate large plantations’ uncultivated land (since most of the land on large plantations met this criteria). Landowners would be compensated with twenty-five-year government bonds with 3 percent interest based on their confiscated land’s declared taxable value (something United Fruit obviously underreported to reduce its tax liability).\nBetween the newly confiscated lands and those seized earlier from German coffee growers, some one hundred thousand families received a total of 1.5 million acres of land during the eighteen months the program was in operation (about 16 percent of privately fallow land). While moderate in scope, the program stirred grassroots movements to expect and demand more. Land invasions increased and tensions soared.\nUnited Fruit, which had no shortage of connections and influence in Washington, called on the US government to help. They obliged. President Dwight Eisenhower and CIA head Allen Dulles devised a plan to overthrow Árbenz by the summer of 1953, and the coup was carried out in June 1954.\nAfter the putsch, dictatorship resumed and land reform was undone. With Guatemala’s vastly unequal social structure solidified, the groundwork was laid for decades of violence — culminating in the genocide perpetrated by the Montt dictatorship. Though the thirty-six-year Civil War ended in 1996, the violence reverberates to this day.\nOf all the American interventions in the twentieth century, Guatemala thus ranks near the top in terms of the devastation it caused. US involvement continued for decades after Árbenz’s ouster, with both direct and indirect support for the military government’s brutal campaign — a campaign that included over six hundred massacres and other gruesome violence like mass rape, even of children.\nAccording to “Guatemala: Never Again” — the study for which Bishop Gerardi was murdered — the Guatemalan military and its associated death squads were responsible for 80 percent of civilian killings during the civil war. For its part, the United Nations truth commission reported that “state forces and related paramilitary groups were responsible for 93 percent of the violations documented.”", "url": "https://www.jacobinmag.com/2015/11/guatemala-molino-corruption-maras-gangs-cia-united-fruit"}