{"authors": ["Erik Olin Wright", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:14", "date_modify": "2020-05-04 19:54:14", "date_publish": "2015-12-17 00:00:00", "description": null, "filename": "2015_12_erik-olin-wright-real-utopias-anticapitalism-democracy_1588622054.html", "image_url": "https://images.jacobinmag.com/2015/12/17010527/4602804480_65940acb55_z.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_12_erik-olin-wright-real-utopias-anticapitalism-democracy_1588622054.html", "title": "How to Be an Anticapitalist Today", "title_page": "How to Be an Anticapitalist Today", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nFor many people the idea of anticapitalism seems ridiculous. After all, capitalist firms have brought us fantastic technological innovations in recent years: smartphones and streaming movies; driverless cars and social media; Jumbotron screens at football games and video games connecting thousands of players around the world; every conceivable consumer product available on the Internet for rapid home delivery; astounding increases in the productivity of labor through novel automation technologies; and more. And while it’s true that income is unequally distributed in capitalist economies, it is also true that the array of consumption goods available and affordable for the average person, and even for the poor, has increased dramatically almost everywhere. Just compare the United States in the half century between 1965 and 2015: the percentage of Americans with air conditioners, cars, washing machines, dishwashers, televisions, and indoor plumbing increased dramatically. Life expectancy is longer; infant mortality lower. In the twenty-first century, this improvement in basic standards of living has also occurred in poorer regions of the world as well: the material standards of millions of people living in China since it embraced the free market have improved dramatically. What’s more, look what happened when Russia and China tried an alternative to capitalism. Aside from the political oppression and brutality of those regimes, they were economic failures. So, if you care about improving the lives of people, how can you be anticapitalist? That is one story, the standard story. Here is another story: the hallmark of capitalism is poverty in the midst of plenty. This is not the only thing wrong with capitalism, but it is its gravest failing. Widespread poverty — especially amongst children, who clearly bear no responsibility for their plight — is morally reprehensible in rich societies where it could be easily eliminated. Yes, there is economic growth, technological innovation, increasing productivity, and a downward diffusion of consumer goods, but along with capitalist economic growth comes destitution for many whose livelihoods have been destroyed by the advance of capitalism, precariousness for those at the bottom of the labor market, and alienating and tedious work for most. Capitalism has generated massive increases in productivity and extravagant wealth for some, yet many people still struggle to make ends meet. Capitalism is an inequality-enhancing machine as well as a growth machine. Not to mention that it is becoming clearer that capitalism, driven by the relentless search for profits, is destroying the environment. Both of these accounts are anchored in the realities of capitalism. It is not an illusion that capitalism has transformed the material conditions of life in the world and enormously increased human productivity; many people have benefited from this. But equally, it is not an illusion that capitalism generates great harms and perpetuates unnecessary forms of human suffering. The pivotal issue is not whether material conditions on average have improved in the long run within capitalist economies, but rather whether, looking forward from this point in history, things would be better for most people in an alternative kind of economy. It is true that the centralized, authoritarian, state-run economies of twentieth-century Russia and China were in many ways economic failures, but these are not the only possibilities. Where the real disagreement lies — a disagreement that is fundamental — is over whether it is possible to have the productivity, innovation, and dynamism that we see in capitalism without the harms. Margaret Thatcher famously announced in the early 1980s, “There is No Alternative,” but two decades later the World Social Forum declared “Another World is Possible.” I argue that another world — one that would improve the conditions for human flourishing for most people — is indeed possible. In fact, elements of this new world are already being created today, and concrete ways to move from here to there exist. Anticapitalism is possible, not simply as a moral stance toward the harms and injustices of global capitalism, but as a practical stance towards building an alternative for greater human flourishing.\nThe Four Types of Anticapitalism Capitalism breeds anticapitalists. Sometimes resistance to capitalism is crystallized in coherent ideologies that offer both systematic diagnoses of the source of harms and clear prescriptions about how to eliminate them. In other circumstances anticapitalism is submerged within motivations that on the surface have little to do with capitalism, such as religious beliefs that lead people to reject modernity and seek refuge in isolated communities. But always, wherever capitalism exists, there is discontent and resistance in one form or other. Historically, anticapitalism has been animated by four different logics of resistance: smashing capitalism, taming capitalism, escaping capitalism, and eroding capitalism. These logics often coexist and intermingle, but they each constitute a distinct way of responding to the harms of capitalism. These four forms of anticapitalism can be thought of as varying along two dimensions. One concerns the goal of anticapitalist strategies — transcending the structures of capitalism or simply neutralizing the worst harms of capitalism — while the other dimension concerns the primary target of the strategies — whether the target is the state and other institutions at the macro-level of the system, or the economic activities of individuals, organizations, and communities at the micro-level. Taking these two dimensions together gives us the typology below.\n1. Smashing Capitalism Given the way capitalism devastates the lives of so many people and given the power of its dominant classes to protect their interests and defend the status quo, it is easy to understand the attractiveness of the idea of smashing capitalism. The argument goes something like this: the system is rotten. All efforts to make life tolerable within it will eventually fail. From time to time small reforms that improve the lives of people may be possible when popular forces are strong, but such improvements will always be fragile, vulnerable to attack and reversible. The idea that capitalism can be rendered a benign social order in which ordinary people can live flourishing, meaningful lives is ultimately an illusion because, at its core, capitalism is unreformable. The only hope is to destroy it, sweep away the rubble, and then build an alternative. As the closing words of the labor tune “Solidarity Forever” proclaim, “We can bring to birth a new world from the ashes of the old.” But how to do this? How is it possible for anticapitalist forces to amass enough power to destroy capitalism and replace it with a better alternative? This is indeed a daunting task, for the power of dominant classes that makes reform an illusion also blocks the revolutionary goal of a rupture in the system. Anticapitalist revolutionary theory, informed by the writings of Marx and extended by Lenin, Gramsci, and others, offered an attractive argument about how this could take place. While it is true that much of the time capitalism seems unassailable, it is also a deeply contradictory system, prone to disruptions and crises. Sometimes those crises reach an intensity which makes the system as a whole fragile, vulnerable to challenge. In the strongest versions of the theory, there are even underlying tendencies in the “laws of motion” of capitalism for the intensity of such system-weakening crises to increase over time, so that in the long-term capitalism becomes unsustainable; it destroys its own conditions of existence. But even if there is no systematic tendency for crises to become ever-worse, what can be predicted is that periodically there will be intense capitalist economic crises in which the system becomes vulnerable and ruptures become possible. This provides the context in which a revolutionary party can lead a mass mobilization to seize state power, either through elections or through a violent overthrow of the existing regime. Once in control of the state, the first task is to refashion the state itself to make it a suitable weapon of socialist transformation, and then use that power to repress the opposition of the dominant classes and their allies, dismantle the pivotal structures of capitalism, and build the necessary institutions for an alternative economic system. In the twentieth century, various versions of this general line of reasoning animated the imagination of revolutionaries around the world. Revolutionary Marxism infused struggles with hope and optimism, for it not only provided a potent indictment of the world as it existed, but also provided a plausible scenario for how an emancipatory alternative could be realized. This gave people courage, sustaining the belief that they were on the side of history and that the enormous commitment and sacrifices they were called on to make in their struggles against capitalism had real prospects of eventually succeeding. And sometimes, rarely, such struggles did culminate in the revolutionary seizure of state power. The results of such revolutions, however, were never the creation of a democratic, egalitarian, emancipatory alternative to capitalism. While revolutions in the name of socialism and communism did demonstrate that it was possible “to build a new world on the ashes of the old,” and in certain specific ways improved the material conditions of life of most people for a period of time, the evidence of the heroic attempts at rupture in the twentieth century is that they do not produce the kind of new world envisioned in revolutionary ideology. It is one thing to burn down old institutions; it is quite another to build emancipatory new institutions from the ashes. Why the revolutions of the twentieth century never resulted in robust, sustainable human emancipation is, of course, a hotly debated matter. Some people argue that the failure of revolutionary movements was due to the historically specific, unfavorable circumstances of the attempts at system-wide ruptures —revolutions occurred in economically backward societies, surrounded by powerful enemies. Some argue that revolutionary leaders made strategic errors, while others indict the motives of leadership: the leaders that triumphed in the course of revolutions were motivated by desires for status and power rather than the empowerment and wellbeing of the masses. Still others argue that failure is intrinsic to any attempt at radical rupture in a social system because there are too many moving parts, too much complexity, and too many unintended consequences. As a result, attempts at system rupture will inevitably tend to unravel into such chaos that revolutionary elites, regardless of their motives, will be compelled to resort to pervasive violence and repression to sustain social order. Such violence, in turn, destroys the possibility for a genuinely democratic, participatory process of building a new society. Regardless of which (if any) of these explanations are correct, the evidence from the revolutionary tragedies of the twentieth century shows that smashing capitalism alone doesn’t work as a strategy for social emancipation. Nevertheless, the idea of a revolutionary rupture with capitalism has not completely disappeared. Even if it no longer constitutes a coherent strategy of any significant political force, it speaks to the frustration and anger of living in a world of such sharp inequalities and unrealized potentials for human flourishing, and in a political system that seems increasingly undemocratic and unresponsive. To actually transform capitalism, visions that resonate with anger are not enough; instead, a strategic logic that has some chance of actually accomplishing its goals is needed.\n2. Taming Capitalism The major alternative to the idea of smashing capitalism in the twentieth century was taming capitalism. This is the central idea behind the anticapitalist currents within the left of social-democratic parties. Here is the basic argument. Capitalism, when left to its own devices, creates great harms. It generates levels of inequality that are destructive to social cohesion; it destroys traditional jobs and leaves people to fend for themselves; it creates uncertainty and risk for individuals and whole communities; it harms the environment. These are all consequences of the inherent dynamics of a capitalist economy. Nevertheless, it is possible to build counteracting institutions capable of significantly neutralizing these harms. Capitalism does not need to be left to its own devices; it can be tamed by well-crafted state policies. To be sure, this may involve sharp struggles since it involves reducing the autonomy and power of the capitalist class, and there are no guarantees of success in such struggles. The capitalist class and its political allies will claim that the regulations and redistribution designed to neutralize these alleged harms of capitalism will destroy its dynamism, cripple competitiveness, and undermine incentives. Such arguments, however, are simply self-serving rationalizations for privilege and power. Capitalism can be subjected to significant regulation and redistribution to counteract its harms and still provide adequate profits for it to function. To accomplish this requires popular mobilization and political will; one can never rely on the enlightened benevolence of elites. But in the right circumstances, it is possible to win these battles and impose the constraints needed for a more benign form of capitalism. The idea of taming capitalism does not eliminate the underlying tendency for capitalism to generate harms; it simply counteracts their effects. This is like a medicine which effectively deals with symptoms rather than with the underlying causes of a health problem. Sometimes that is good enough. Parents of newborn babies are often sleep-deprived and prone to headaches. One solution is to take an aspirin and cope; another is to get rid of the baby. Sometimes neutralizing the symptom is better than trying to get rid of the underlying cause. In what is sometimes called the “Golden Age of Capitalism” — roughly the three decades following World War II — social-democratic policies, especially in those places where they were most thoroughly implemented, did a fairly good job at moving in the direction of a more humane economic system. Three clusters of state policies in particular significantly counteracted the harms of capitalism: serious risks — especially around health, employment, and income — were reduced through a fairly comprehensive system of publicly mandated and funded social insurance. The state provided an expansive set of public goods (funded by a robust tax system) that included basic and higher education, vocational skill formation, public transportation, cultural activities, recreational facilities, research and development, and macro-economic stability. And finally, the state created a regulatory regime to curb the most serious negative externalities of the behavior of investors and firms in capitalist markets — pollution, product and workplace hazards, predatory market behavior, and so on. These policies did not mean that the economy ceased to be capitalist: capitalists were still basically left free to allocate capital on the basis of profit-making opportunities in the market, and aside from taxes, they appropriated the profits generated by those investments to use as they wished. What had changed was that the state took responsibility for correcting the three principle failures of capitalist markets: individual vulnerability to risks, under-provision of public goods, and negative externalities of private profit–maximizing economic activity. The result was a reasonably well-functioning form of capitalism with muted inequalities and muted conflicts. Capitalists may not have preferred this, but it worked well enough. Capitalism had, at least partially, been tamed. That was the Golden Age — a faint memory in the harsh first decades of the twenty-first century. Everywhere today, even in the strongholds of Northern European social democracy, there have been calls to roll back the “entitlements” connected to social insurance, reduce taxes and public goods, deregulate capitalist production and markets, and privatize state services. Taken as a whole, these transformations go under the name of “neoliberalism.” A variety of forces have contributed to the diminished willingness and apparent capacity of the state to neutralize the harms of capitalism. Globalization has made it much easier for capitalist firms to move investments to places in the world with less regulation and cheaper labor, while the threat of capital flight, along with a variety of technological changes, has fragmented and weakened the labor movement, making it less capable of resistance and political mobilization. Combined with globalization, the increasing financialization of capital has led to massive increases in wealth and income inequality, which in turn has increased the political leverage of opponents of the social-democratic state. Instead of being tamed, capitalism has been unleashed. Perhaps the three decades or so of the Golden Age were just an historical anomaly, a brief period in which favorable structural conditions and robust popular power opened up the possibility for the relatively egalitarian model. Before that time capitalism was a rapacious system, and under neoliberalism it has become rapacious once again, returning to the normal state of affairs for capitalist systems. Perhaps in the long run capitalism is not tamable. Defenders of the idea of revolutionary ruptures with capitalism have always claimed that taming capitalism was an illusion, a diversion from the task of building a political movement to overthrow capitalism. But perhaps things are not so dire. The claim that globalization imposes powerful constraints on the capacity of states to raise taxes, regulate capitalism, and redistribute income is a politically effective claim because people believe it, not because the constraints are actually that narrow. In politics, the limits of possibility are always in part created by beliefs in the limits of possibility. Neoliberalism is an ideology, backed by powerful political forces, rather than a scientifically accurate account of the actual limits we face in making the world a better place. While it may be the case that the specific policies that constituted the menu of social democracy in the Golden Age have become less effective and need rethinking, taming capitalism remains a viable expression of anticapitalism.\n3. Escaping Capitalism One of the oldest responses to the onslaught of capitalism has been to escape. Escaping capitalism may not have been crystallized into systematic anticapitalist ideologies, but nevertheless it has a coherent logic: capitalism is too powerful a system to destroy. Truly taming capitalism would require a level of sustained collective action that is unrealistic, and anyway, the system as a whole is too large and complex to control effectively. The powers-that-be are too strong to dislodge, and they will always coopt opposition and defend their privileges. You can’t fight city hall. The more things change, the more they stay the same. The best we can do is to try to insulate ourselves from the damaging effects of capitalism, and perhaps escape altogether its ravages in some sheltered environment. We may not be able to change the world at large, but we can remove ourselves from its web of domination and create our own micro-alternative in which to live and flourish. This impulse to escape is reflected in many familiar responses to the harms of capitalism. The movement of farmers to the Western frontier in nineteenth-century United States was, for many, an aspiration for stable, self-sufficient subsistence farming rather than production for the market. Escaping capitalism is implicit in the hippie motto of the 1960s, “turn on, tune in, drop out.” The efforts by certain religious communities, such as the Amish, to create strong barriers between themselves and the rest of society involved removing themselves as much as possible from the pressures of the market. The characterization of the family as a “haven in a heartless world” expresses the ideal of family as a noncompetitive social space of reciprocity and caring in which one can find refuge from the heartless, competitive world of capitalism. And, in time-limited ways, escaping capitalism is even embodied in long distance hikes in the wilderness. Escaping capitalism typically involves avoiding political engagement and certainly of collectively organized efforts at changing the world. Especially in the world today, escape is mostly an individualistic lifestyle strategy. And sometimes it is an individualistic strategy dependent on capitalist wealth, as in the stereotype of the successful Wall Street banker who decides to “give up the rat race” and move to Vermont to embrace a life of voluntary simplicity while living off of a trust fund amassed from capitalist investments. Because of the absence of politics, it is easy to dismiss the escaping capitalism strategy, especially when it reflects privileges achieved within capitalism itself. It is hard to treat the wilderness hiker who flies into a remote region with expensive hiking gear in order to “get away from it all,” as a meaningful expression of opposition to capitalism. Still, there are examples of escaping capitalism that do bear on the broader problem of anticapitalism. Intentional communities may be motivated by the desire to escape the pressures of capitalism, but sometimes they can also serve as models for more collective, egalitarian, and democratic ways of living. Certainly cooperatives, which may be motivated mainly by a desire to escape the authoritarian workplaces and exploitation of capitalist firms, can also become elements of a broader challenge to capitalism. The Do It Yourself movement and the “sharing economy” may be motivated by stagnant individual incomes during a period of economic austerity, but they can also point to ways of organizing economic activity that are less dependent on market exchange. And more generally, the lifestyle of voluntary simplicity can contribute to broader rejection of consumerism and the preoccupation with economic growth in capitalism.\n4. Eroding Capitalism The fourth form of anticapitalism is the least familiar. It is grounded in the following idea: all socioeconomic systems are complex mixes of many different kinds of economic structures, relations, and activities. No economy has ever been — or ever could be — purely capitalist. Capitalism as a way of organizing economic activity has three critical components: private ownership of capital; production for the market for the purpose of making profits; and employment of workers who do not own the means of production. Existing economic systems combine capitalism with a whole host of other ways of organizing the production and distribution of goods and services: directly by states; within the intimate relations of families to meet the needs of its members; through community-based networks and organizations; by cooperatives owned and governed democratically by their members; though nonprofit market-oriented organizations; through peer-to-peer networks engaged in collaborative production processes; and many other possibilities. Some of these ways of organizing economic activities can be thought of as hybrids, combining capitalist and noncapitalist elements; some are entirely noncapitalist; and some are anticapitalist. We call such a complex economic system “capitalist” when capitalist drives are dominant in determining the economic conditions of life and access to livelihood for most people. That dominance is immensely destructive. One way to challenge capitalism is to build more democratic, egalitarian, participatory economic relations in the spaces and cracks within this complex system wherever possible, and to struggle to expand and defend those spaces. The idea of eroding capitalism imagines that these alternatives have the potential, in the long run, of expanding to the point where capitalism is displaced from this dominant role. An analogy with an ecosystem in nature might help clarify this idea. Think of a lake. A lake consists of water in a landscape, with particular kinds of soil, terrain, water sources, and climate. An array of fish and other creatures live in its water, and various kinds of plants grow in and around it. Collectively, all of these elements constitute the natural ecosystem of the lake. (This is a “system” in that everything affects everything else within it, but it is not like the system of a single organism in which all of the parts are functionally connected in a coherent, tightly integrated whole.) In such an ecosystem, it is possible to introduce an alien species of fish not “naturally” found in the lake. Some alien species will instantly get gobbled up. Others may survive in some small niche in the lake, but not change much about daily life in the ecosystem. But occasionally an alien species may thrive and eventually displace the dominant species. The strategic vision of eroding capitalism imagines introducing the most vigorous varieties of emancipatory species of noncapitalist economic activity into the ecosystem of capitalism, nurturing their development by protecting their niches, and figuring out ways of expanding their habitats. The ultimate hope is that eventually these alien species can spill out of their narrow niches and transform the character of the ecosystem as a whole. This way of thinking about the process of transcending capitalism is similar to the popular, stylized story told about the transition from pre-capitalist feudal societies in Europe to capitalism. Within feudal economies in the late Medieval period, proto-capitalist relations and practices emerged, especially in the cities. Initially this involved commercial activity, artisanal production under the regulation of guilds, and banking. These forms of economic activity filled niches and were often quite useful for feudal elites. As the scope of these market activities expanded, they gradually became more capitalist in character and, in some places, more corrosive of the established feudal domination of the economy as a whole. Through a long, meandering process over several centuries, feudal structures ceased to dominate the economic life of some corners of Europe; feudalism had eroded. This process may have been punctuated by political upheavals and even revolutions, but rather than constituting a rupture in economic structures, these political events served more to ratify and rationalize changes that had already taken place within the socioeconomic structure. The strategic vision of eroding capitalism sees the process of displacing capitalism from its dominant role in the economy in a similar way: alternative, noncapitalist economic activities emerge in the niches where this is possible within an economy dominated by capitalism; these activities grow over time, both spontaneously and, crucially, as a result of deliberate strategy; struggles involving the state take place, sometimes to protect these spaces, other times to facilitate new possibilities; and eventually, these noncapitalist relations and activities become sufficiently prominent in the lives of individuals and communities that capitalism can no longer be said to dominate the system as a whole. This strategic vision is implicit in some currents of contemporary anarchism. If revolutionary socialism proposes that state power should be seized so that capitalism can be smashed, and social democracy argues that the capitalist state should be used to tame capitalism, anarchists have generally argued that the state should be avoided — perhaps even ignored — because in the end it can only serve as a machine of domination, not liberation. The only hope for an emancipatory alternative to capitalism — an alternative that embodies ideals of equality, democracy, and solidarity — is to build it on the ground and work to expand its scope. As a strategic vision, eroding capitalism is both enticing and far-fetched. It is enticing because it suggests that even when the state seems quite uncongenial for advances in social justice and emancipatory social change, there is still much that can be done. We can get on with the business of building a new world, not from the ashes of the old, but within the interstices of the old. It is far-fetched because it seems wildly implausible that the accumulation of emancipatory economic spaces within an economy dominated by capitalism could ever really displace capitalism, given the immense power and wealth of large capitalist corporations and the dependency of most people’s livelihoods on the well-functioning of the capitalist market. Surely if noncapitalist emancipatory forms of economic activities and relations ever grew to the point of threatening the dominance of capitalism, they would simply be crushed. Eroding capitalism is not a fantasy. But it is only plausible if it is combined with the social-democratic idea of taming capitalism. We need a way of linking the bottom-up, society-centered strategic vision of anarchism with the top-down, state-centered strategic logic of social democracy. We need to tame capitalism in ways that make it more erodible, and erode capitalism in ways that make it more tamable. One concept that will help us to link these two currents of anticapitalist thinking is real utopias.\nReal Utopias Real Utopia is a self-contradictory expression. The word “utopia” was first coined by Thomas More in 1516, combining two Greek prefixes — eu, which means good, and ou, which means no — into “u” and placing this before the Greek word for place, topos. U-topia is thus the good place that exists in no place. It is a fantasy of perfection. How then can it be “real”? It may be realistic to seek improvements in the world, but not perfection. Indeed, the search for perfection can undermine the practical task of making the world a better place. As the saying goes, “the best is the enemy of the good.” There is thus an inherent tension between the real and the utopian. It is precisely this tension which the idea of a “real utopia” is meant to capture. The point is to sustain our deepest aspirations for a just and humane world that does not exist while also engaging in the practical task of building real-world alternatives that can be constructed in the world as it is that also prefigure the world as it could be and which help move us in that direction. Real utopias thus transform the no-where of utopia into the now-here of creating emancipatory alternatives of the world as it could be in the world as it is. Real utopias can be found wherever emancipatory ideals are embodied in existing institutions and proposals for new institutional designs. They are both constitutive elements of a destination and a strategy. Here are a few examples. Worker cooperatives are a real utopia that emerged alongside the development of capitalism. Three important emancipatory ideals are equality, democracy, and solidarity. All of these are obstructed in capitalist firms, where power is concentrated in the hands of owners and their surrogates, internal resources and opportunities are distributed in a grossly unequal manner, and competition continually undermines solidarity. In a worker-owned cooperative, all of the assets of the firms are jointly owned by the employees themselves, who also govern the firm in a one-person-one-vote, democratic manner. In a small cooperative, this democratic governance can be organized in the form of general assemblies of all members; in larger cooperatives the workers elect boards of directors to oversee the firm. Worker cooperatives may also embody more capitalistic features: they may, for example, hire temporary workers or be inhospitable to potential members of particular ethnic or racial groups. Cooperatives, therefore, often embody quite contradictory values. Nevertheless, they have the potential to contribute to eroding the dominance of capitalism when they expand the economic space within which anticapitalist emancipatory ideals can operate. Clusters of worker cooperatives could form networks; with appropriate forms of public support, those networks could extend and deepen to constitute a cooperative market sector; that sector could — under possible circumstances — expand to rival the dominance of capitalism. Public libraries are another kind of real utopia. This might at first glance seem like an odd example. Libraries are, after all, a durable institution found in all capitalist societies. In the United States, the vast public library system was to a significant extent founded by Andrew Carnegie, one of the ruthless robber barons of the Gilded Age. He was certainly no anticapitalist and, if anything, saw his philanthropic support of libraries as a way of strengthening capitalism as a system. Nevertheless, libraries embody principles of access and distribution which are profoundly anticapitalist. Consider the sharp difference between the ways a person acquires access to a book in a bookstore and in a library. In a bookstore, you look for the book you want on a shelf, check the price, and if you can afford it and you want it sufficiently, you go to the cashier, hand over the required amount of money, and then leave with the book. In a library you go to the shelf (or more likely these days, to a computer terminal) to see if the book is available, find your book, go to the check-out counter, show your library card, and leave with the book. If the book is already checked out, you get put on a waiting list. In a bookstore the distribution principle is “to each according to ability to pay”; in a public library, the principle of distribution is “to each according to need.” What is more, in the library, if there is an imbalance between supply and demand, the amount of time one has to wait for the book increases; books in scarce supply are rationed by time, not by price. A waiting list is a profoundly egalitarian device: a day in everyone’s life is treated as morally equivalent. A well-resourced library will treat the length of the waiting list as a signal that more copies of a particular book need to be ordered. Libraries can also become multipurpose public amenities, not simply repositories of books. Good libraries provide public space for meetings, sometimes venues for concerts and other performances, and a congenial gathering place for people. Of course, libraries can also be exclusionary zones that are made inhospitable to certain kinds of people. They can be elitist in their budget priorities and their rules. Actual libraries may thus reflect quite contradictory values. But, insofar as they embody emancipatory ideals of equality, democracy, and community, libraries are a real utopia. A final example of an actually existing real utopia is the new forms of peer-to-peer collaborative production that have emerged in the digital era. Perhaps the most familiar example is Wikipedia. Within a decade of its founding, Wikipedia destroyed a three-hundred-year-old market in encyclopedias; it is now impossible to produce a commercially viable, general purpose encyclopedia. Wikipedia is produced in a completely noncapitalist way by a few hundred thousand unpaid editors around the world contributing to the global commons and making it freely available to everybody. It is funded through a kind of gift economy that provides the necessary infrastructural resources. Wikipedia is filled with problems — some entries are wonderful, others terrible — but it is an extraordinary example of cooperation and collaboration on a very large scale that is highly productive and organized on a noncapitalist basis. There are many other examples in the digital world. If we imagine this model of collaboration being extended into the world of production of goods, not just information, then it is possible to imagine p2p collaborative production encroaching on the dominance of capitalism. Real utopias can also be found in proposals for social change and state policies, not just in actually existing institutions. This is the critical role of real utopias in long-term political strategies for social justice and human emancipation. One example is an unconditional basic income (UBI). A UBI simply gives everyone, without conditions, a flow of income sufficient to cover basic needs. It provides for a modest, but culturally respectable, no-frills standard of living. In doing so it also solves the problem of hunger among the poor, but does so in ways that puts in place a building block of an emancipatory alternative. UBI directly tames one of the harms of capitalism — poverty in the midst of plenty. But it also expands the potential for a long-term erosion of the dominance of capitalism by channeling resources towards noncapitalist forms of economic activity. Consider the effects of a basic income on worker cooperatives. One of the reasons worker cooperatives are often fragile is that they have to generate sufficient income not merely to cover the material costs of production but also to provide a basic income for their members. If a basic income were guaranteed independently of the market success of the cooperative, worker cooperatives would become much more robust. This would also mean that they would be less risky for loans from banks. Thus, somewhat ironically, an unconditional basic income would help solve a credit market problem for cooperatives. It would also underwrite a massive increase of participation in p2p collaborative production and many other productive activities that do not themselves generate market income for participants.", "url": "https://www.jacobinmag.com/2015/12/erik-olin-wright-real-utopias-anticapitalism-democracy"}