{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:14:57", "date_modify": "2020-05-04 16:14:57", "date_publish": "2015-07-01 21:37:37", "description": "View Dolly Parton's Fast Facts on CNN and learn more about the award-winning country music star.", "filename": "2015_07_01_us_dolly-parton-fast-facts_index_1588608897.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150812151736-dolly-parton-warhol-polaroids-tease-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2015_07_01_us_dolly-parton-fast-facts_index_1588608897.html", "title": "Dolly Parton Fast Facts", "title_page": "Dolly Parton Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the life of Dolly Parton, the Grammy Award-winning singer, song writer, producer and actress.\nPersonal\nBirth date: January 19, 1946\nBirth place: Locust Ridge, Sevier County, Tennessee\nBirth name: Dolly Rebecca Parton\nFather: Robert Lee Parton, farmer\nMother: Avie Lee (Owens) Parton\nMarriage: Carl Dean (May 1966-present)\nOther Facts\nHas received 49 Grammy Award nominations, and won eight competitive awards and one special award.\nHas sold more than 100 million albums worldwide.\nFounder of the Dollywood Foundation , which funds Dolly Parton's Imagination Library -- a program which began in Sevier County, Tennessee, and provides preschool-aged children with a book every month from birth to kindergarten. The program has spread to other parts of the country and internationally.\nWas born fourth of 12 children. Six of her siblings worked as professional musicians.\nTimeline\n1957 - Records her first song, \"Puppy Love,\" with Goldband Records.\n1959 - First guest appearance on the Grand Ole Opry at the age of 13.\n1964 - Moves to Nashville after graduating from high school.\n1967 - Joins \"The Porter Wagoner Show.\"\n1967 - First full-length album titled \"Hello, I'm Dolly,\" is released on Monument Records.\n1968 - Wins the Country Music Association award, with Porter Wagoner, for Vocal Group of the Year.\nJanuary 4, 1969 - Becomes a member of the Becomes a member of the Grand Ole Opry.\n1971 - \"Joshua\" becomes Parton's first solo single to top the US country charts.\nApril 1974 - Leaves \"The Porter Wagoner Show.\" Parton writes the song \"I Will Always Love You\" in honor of her professional break from her duet partner and mentor of seven years.\n1975 and 1976 - Receives the Country Music Association award for female vocalist of the year.\n1976-1977 - Her syndicated variety show \"Dolly!\" runs on television.\n1978 - Receives the Country Music Association Award for entertainer of the year.\nFebruary 15, 1979 - Wins a Grammy for Best Country Vocal Performance, Female, for the song \"Here You Come Again.\"\nFebruary 24, 1982 - Wins two Grammy Awards for the song \"9 to 5\": Best Country Vocal Performance, Female and Best Country Song.\nMay 3, 1986 - The theme park The theme park Dollywood opens in Pigeon Forge, Tennessee.\nMarch 2, 1988 - Wins a Grammy, with Emmylou Harris and Wins a Grammy, with Emmylou Harris and Linda Ronstadt, for Best Country Performance by a Duo or Group for the album, \"Trio.\"\n1987-1988 - Her primetime variety show on ABC, \"Dolly,\" airs for one season.\n1988 - Establishes the Dollywood Foundation.\n1992 - Whitney Houston releases her version of the song \"I Will Always Love You,\" which tops the Billboard Hot 100 for 14 weeks, a record at the time.\n1994 - Parton's autobiography titled \"Dolly: My Life and Other Unfinished Business\" is published.\n1999 - Is inducted into the Is inducted into the Country Music Hall of Fame.\nFebruary 23, 2000 - Wins a Grammy, with Emmylou Harris and Linda Ronstadt, for Best Country Collaboration with Vocals for the song \"After the Gold Rush.\"\nFebruary 21, 2001 - Wins a Grammy, with Gary Paczosa and Steve Buckingham, for Best Bluegrass Album for the album \"The Grass is Blue.\"\nFebruary 27, 2002 - Wins a Grammy for Best Female Country Vocal Performance for the song \"Shine.\"\nMay 19, 2001 - The waterpark, The waterpark, Dollywood's Splash Country, opens in Pigeon Forge, Tennessee.\nApril 14, 2004 - The US Library of Congress awards Parton the The US Library of Congress awards Parton the Living Legend medal.\n2005 - Named a recipient of the Named a recipient of the National Medal of Arts.\n2006 - Becomes a Becomes a Kennedy Center honoree.\nFebruary 12, 2012 - Receives a Receives a Grammy Lifetime Achievement Award.\nDecember 10, 2015 - NBC airs the movie, \"Dolly Parton's Coat of Many Colors.\" It is inspired by Parton's life and her song \"Coat of Many Colors.\"\nNovember 2, 2016 - Receives the Willie Nelson Lifetime Achievement Award at the 50th Annual Country Music Awards Show.\nNovember 30, 2016 - NBC airs \"Dolly Parton's Christmas of Many Colors: Circle of Love,\" a sequel to the original movie which aired in 2015.\nNovember 30, 2016 - In a video message, Parton announces that she has created the In a video message, Parton announces that she has created the \"My People Fund\" through her Dollywood Companies and hopes to give each family affected by the Great Smoky Mountain wildfires $1,000 a month for six months to help them get \"back on their feet.\"\nFebruary 15, 2017 - Wins a Grammy, with Pentatonix, for Best Country Duo/Group Performance, for a remake of her song \"Jolene.\"\nFebruary 10, 2019 - She also performs at the event for the first time in 18 years along with Miley Cyrus, Little Big Town, Katy Perry and others. Parton is celebrated in an all-star tribute at the 61st Annual Grammy Awards. She also performs at the event for the first time in 18 years along with Miley Cyrus, Little Big Town, Katy Perry and others.\nAugust 5, 2019 - Nashville Mayor David Briley declares the date Dolly Parton Day.\nNovember 26, 2019 - NBC airs \"Dolly Parton: 50 Years at the Opry.\" The two-hour special celebrates Parton's milestone as a member of country music's most esteemed institution.", "url": "https://www.cnn.com/2015/07/01/us/dolly-parton-fast-facts/index.html"}