{"authors": ["Por Cara Anna"], "date_download": "2020-05-04 20:15:57", "date_modify": "2020-05-04 20:15:57", "date_publish": "2015-05-30 15:09:33", "description": "NACIONES UNIDAS (AP) — Los varoncitos dijeron que se acercaron a los soldados franceses porque estaban hambrientos. Algunos eran tan pequeños que no comprendieron lo que los soldados les pedían a...", "filename": "_65ee47f725774022acb5ad1de8bc3951_1588623357.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9c4ae97913d64fcf9bae5828361e83f6/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_65ee47f725774022acb5ad1de8bc3951_1588623357.html", "title": "Sacude a ONU denuncias de abuso sexual de soldados franceses", "title_page": "Sacude a ONU denuncias de abuso sexual de soldados franceses", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nEn esta foto del 13 de febrero del 2006, Anders Kompass, representante del comisionado de derechos humanos de las Naciones en Guatemala, habla en la capital de ese país. Revelaciones acerca del abuso de niños por parte de soldados franceses en la República Centroafricana han causado indignación dentro y fuera del organismo internacional. Declaraciones calificadas como “estrictamente confidenciales” han revelado que los principales funcionarios de derechos humanos no actuaron durante varios meses sobre las denuncias que su propia oficina había recolectado, según se informó el 30 de mayo del 2015. (AP Foto/Moises Castillo, Archivo)\nEn esta foto del 13 de febrero del 2006, Anders Kompass, representante del comisionado de derechos humanos de las Naciones en Guatemala, habla en la capital de ese país. Revelaciones acerca del abuso de niños por parte de soldados franceses en la República Centroafricana han causado indignación dentro y fuera del organismo internacional. Declaraciones calificadas como “estrictamente confidenciales” han revelado que los principales funcionarios de derechos humanos no actuaron durante varios meses sobre las denuncias que su propia oficina había recolectado, según se informó el 30 de mayo del 2015. (AP Foto/Moises Castillo, Archivo)\nNACIONES UNIDAS (AP) — Los varoncitos dijeron que se acercaron a los soldados franceses porque estaban hambrientos. Algunos eran tan pequeños que no comprendieron lo que los soldados les pedían a cambio. Uno de aquellos, de 8 o 9 años, dijo que se lo hizo varias veces al mismo soldado “hasta que un día un chico de mayor edad lo vio y le dijo que estaba haciendo algo malo”.\nOtro niño, de 9 años, dijo que pensó que los soldados estaban orinando.\nUn pequeño de 11 años dijo que buscaba “envases sueltos para jugar” cuando un soldado francés lo llamó y le dio alimentos y un poquito de dinero a cambio de sexo oral. Otro, de 9, “fue golpeado duramente por su madre cuando le contó qué había sucedido”.\nInvestigadores de las Naciones Unidas oyeron relatos similares de abuso sexual por parte de varios niños en mayo y junio del 2014 en la República Centroafricana, donde los soldados franceses protegían un campamento de personas desplazadas en la convulsionada capital, Bangui.\nUn año más tarde, las revelaciones acerca del abuso de los varoncitos han causado indignación dentro y fuera del organismo internacional. Declaraciones calificadas como “estrictamente confidenciales” han revelado que los principales funcionarios de derechos humanos no actuaron durante varios meses sobre las denuncias que su propia oficina había recolectado.\nEl sábado, el alto comisionado para derechos humanos, Zeid Raad al-Hussein, dijo que su oficina despachaba un equipo a la República Centroafricana para investigar “posibles medidas adicionales para hacer frente a violaciones a los derechos humanos”, inclusive violencia sexual. La oficina preguntará a los “estados afectados” qué han hecho para investigar los abusos y procesar a los culpables.\nNo se han anunciado arrestos y no está claro dónde están ahora los soldados acusados, que apoyaban a una fuerza de mantenimiento de la paz de la ONU. La organización parece no poder decir cuándo concluyeron los abusos.\nEl viernes, se difundieron más documentos de una organización no gubernamental manejada por dos exmiembros de la ONU que reclaman una investigación independiente. Los documentos revelan que funcionarios de la ONU se esforzaron menos por ayudar a la investigación francesa de las denuncias que a investigar al miembro del grupo de derechos humanos que denunció los abusos a las autoridades francesas.\nOtro informe que contiene las denuncias de los niños, obtenida por The Associated Press, dice que la primera versión fue oída el 19 de mayo por un miembro del personal de derechos humanos y un funcionario de UNICEF de protección a la infancia. Las entrevistas continuaron hasta el 24 de mayo. Un miembro del equipo de derechos humanos, basado en Ginebra, comunicó el informe a las autoridades francesas en julio.", "url": "https://apnews.com/65ee47f725774022acb5ad1de8bc3951"}