{"authors": ["Joe Burns", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:46", "date_modify": "2020-05-04 19:52:46", "date_publish": "2015-01-17 00:00:00", "description": null, "filename": "2015_01__1588621966.html", "image_url": "https://images.jacobinmag.com/2015/01/17002711/afscme_sanitation_strikers_memphis1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_01__1588621966.html", "title": "Labor Law Won’t Save Us", "title_page": "Labor Law Won’t Save Us", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOne of the latest ideas to revive labor’s sagging fortunes is contained in a 2012 book, Why Labor Organizing Should be a Civil Right . The core idea, developed by Richard Kahlenberg and Moshe Marvit, is that discrimination against an employee for engaging in union activity should be an offense under the Civil Rights Act of 1964. The idea has gained support in the labor movement, and Rep. Keith Ellison (D-MN) has even introduced a bill in Congress to make the proposal a reality. More recently, Chicago labor lawyer and author Thomas Geoghegan endorsed the approach in his new book, arguing (somewhat implausibly) that labor could trade away exclusive representation (in essence, agree to “right to work”) to obtain this legal protection. Kahlenberg and Marvit argue that making labor a civil right is advisable for two main reasons. First, doing so would allow unions to go directly to federal court rather having to file unfair labor charges with the National Labor Relations Board (NLRB), an interminable process plagued by delays and subject to the whims of electoral politics. Union attorneys could take advantage of civil litigation tools such as discovery, jury trials, and punitive damages. The second reason lies more in the realm of politics: the authors believe civil rights are more palatable and familiar to the general public than traditional labor law principles rooted in exclusive representation. And using the language of rights, they argue, is a more effective way to appeal to the American populace. The authors should be commended for writing about labor’s crisis and raising important questions about labor’s renewal. Many analysts focus on reporting on particular struggles, but the labor movement needs more innovative tactics like the one Kahlenberg, Marvit, and Geoghegan propose. Critiquing the NLRB and the current state of labor law is also essential. By discussing labor rights as civil rights, the authors elevate union rights as fundamental human rights. Nonetheless, their approach has numerous shortcomings, chief among them an undue reliance on the law to turn around labor’s fortunes.\nChasing Pipe Dreams On a practical level, even proponents admit Ellison’s bill is not passing anytime soon. A Republican-controlled Congress, coupled with a Democratic Party with little interest in labor rights, means the chance of getting labor legislation approved is close to zero. More to the point, sixty years of failed labor initiatives — a stretch over which unions were much stronger — leaves little hope that the contemporary labor movement has the leverage to win significant labor law reform. Even if the legislation were somehow to pass, it would not significantly improve labor’s prospects. The aim of the legislation is fairly narrow, seeking only to outlaw some of the most blatant forms of anti-union discrimination. And there is little reason to believe that judges would allow the same level of scrutiny of labor discrimination that they do with other forms of overt racial or sexual discrimination. Nor should we overstate the effectiveness of the Civil Rights Act in eliminating employment discrimination. Even worse, the bill stakes labor’s salvation on the federal courts — the graveyard of union rights for more than a century. In the late 1930s, the Supreme Court sanctioned permanent replacement of striking workers and withdrew protection for effective strike tactics such as mass picketing and sit-down strikes. Over the years, judges increasingly tightened the noose around workers, limiting the issues workers could bargain over and tying unions’ hands in dealing with business shenanigans such as subcontracting or capital flight. Ellison’s legislation leaves untouched these judicially created impediments to union strength, which defang strikes and render collective bargaining virtually meaningless. Relying on reactionary federal courts — or hoping that electing more Democrats will make the judiciary less conservative — is not the answer to labor’s crisis. With the labor movement on life support, it can’t engage in diversions with little chance of success. Even more troubling, however, are a set of concerns that go to the heart of what type of labor movement we are trying to rebuild.\nIs There a Civil Right to Not Be in a Union? For decades, employers have argued that workers have individual rights that trump the rights of workers acting collectively. This dispute is central to labor history because it touches on the fundamental issue of whether unionism can modify the terms of wage labor. While unionists argued labor is not a commodity, a central tenant of anti-unionism was the right of individual workers to willingly agree to the terms of their exploitation, whether that meant crossing a picket line or refusing to join a union. In other words, trade unionists acting as a collective entity representing working-class interests prevented individual laborers from enjoying “liberty”: the freedom to sell their individual labor in the market. The alternate conception of labor liberty represented by unionism, in contrast, is rooted in solidarity and the necessity of workers joining together to prevent individual exploitation. Employers have long been hypocritical champions of individual workers rights. In the modern era, employer groups explicitly adopted the lingo and litigation approach of the Civil Rights Movement. That’s why anti-union groups have names such as the National Right to Work Foundation and the Center for Worker Freedom (the right-wing group spearheading the effort against the United Auto Workers’ unionization drive in Chattanooga, TN). For anti-union employer advocates, labor truly is a civil right —the right of individuals to undercut the collective. Employers rarely outright oppose union rights. Instead, they’ve created fictitious rights such as the “right to work” — the anti-collective idea that individual workers have a right to freeload by not paying dues — or the “right” of individual workers to scab by crossing picket lines. This of course begs the question: if workers have a civil right to engage in union activity, do they have a corresponding civil right to refrain from such activity? Once you accept the individualist civil rights logic, it is hard to say they do not. Yet without collective action there can be no labor movement. Traditional trade union economics asserted that individual workers lacked the right to sell their labor at a price which undercut the collective needs of workers. That, in a nutshell, is the point of unionization. Labor history can be seen as the heroic attempt of workers to raise the price of their labor above “free market” levels. Mass picketing, sit-down strikes, anti-scab action, closed shops, secondary tactics — all were geared towards preventing individuals from undercutting collectively set labor rates.", "url": "https://www.jacobinmag.com/2015/01/unions-civil-right-strike-joe-burns/"}