{"authors": ["Shawn Gude", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:32", "date_modify": "2020-05-04 19:50:32", "date_publish": "2015-04-17 00:00:00", "description": null, "filename": "2015_04__1588621832.html", "image_url": "https://images.jacobinmag.com/2015/04/17003710/baltimore-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_04__1588621832.html", "title": "Why Baltimore Rebelled", "title_page": "Why Baltimore Rebelled", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Days before social unrest in Baltimore reached levels unseen in decades, Dan Rodricks, the Baltimore Sun ’s resident liberal columnist, painted a picture of Saturday afternoon’s march against police violence. Peaceful. Family friendly. An expression of justifiable anger.\nBut he concluded somberly: “And as I write those words, the Freddie Gray march turned violent . . .”\n“The dream of the Next Baltimore is cracked.”\nWhat was the cause of Rodricks’s lamentations? The destruction of a handful of police cars, it seems, and the smashed windows of some businesses in Baltimore’s Inner Harbor.\nAnd the “Next Baltimore” occupying his imagination? A vision built not on pouring investment into long-neglected communities, but attracting young professionals and tourists. It’s a vision that left intact racial and class inequality — even as it trumpeted inclusiveness and opportunities to come.\nBaltimore, then, is like so many other cities with their own Freddie Grays: a place in which private capital has left enormous sections of the city to rot, where a chasm separates the life chances of black and white residents — and where cops brutally patrol a population deemed disposable.\nYesterday’s uprising occurred the same day Gray, the twenty-five-year-old whose spine was almost completely severed while in police custody, was laid to rest. Protests haven’t ceased since his April 19 death.\nThe rebellion began when police amassed at a West Baltimore mall, citing calls by students on social media for a “purge” and after issuing histrionic reports of a “gang partnership” to injure police. In the acute (if imbalanced) melee that ensued, police sprayed tear gas and shot rubber bullets; the young crowd threw bricks and water bottles. (Some police responded by chucking the objects back.)\nSpilling into adjoining neighborhoods, the demonstration escalated through the late afternoon and early evening. When I arrived around 5:30 at Pennsylvania and North, about a mile south of the mall, a pall of smoke obscured the road. I passed a couple burned-out police vehicles.\nThe source of the smoke was a looted CVS at the intersection. Some protesters screamed at the line of police arrayed across the road, but the crowd had thinned substantially. The occasional demonstrator bolted back after getting pepper sprayed. An assortment of packaged snacks, presumably from the drug store, were strewn across the ground.\nIntent on dispersing the remaining demonstrators and spectators, riot police fired flaming smoke bombs. They advanced in unison, wooden batons clacking against their plastic shields, chanting an unnerving cry: “Move back, move back, move back.”\nFurther down, at the next intersection, it was a picture of catharsis and unadulterated joy: two young men dancing to Michael Jackson — one in the middle of the street, the other on top of a yellow truck — the music mixing with the sounds of fire engines.\nBut of the entire scene, the most salient thing wasn’t the destruction wrought by protesters — the cop car demolished, the payday loan store smashed up — but by capital: the decrepit, boarded-up row houses, hovels and vacants in a city full of them.\nThese are the streets in which Maryland Gov. Larry Hogan has now declared a state of emergency, the same streets that would suffer from his austerity. They are the streets that have endured astronomic unemployment rates for decades, even as Democrats have run the city unrivaled. And they are the streets where police folded up Freddie Gray’s body “like origami,” then restrained him with leg irons in the back of a police van and delayed calling for an ambulance.\nAfter Saturday’s protests, Baltimore officials blamed property destruction on “outside agitators” (a charge that reeked of both red-baiting and hackneyed desperation). On Monday night, Mayor Stephanie Rawlings-Blake embraced a new term of abuse — “thugs” — and imposed a weeklong curfew. And still the results of the Gray investigation have yet to be released.\nThrough it all, the local governing elite has danced the liberal two-step: denounce the extremists, then placate with reassurances that reform is on the way — that grievances are justified, but only orderly marches are legitimate acts of protest. Anything else, they insist, would be a disservice to the memory of Freddie Gray.\nYet the unrest in Baltimore is a response to the unmitigated failure of this approach. The snails-pace of police reform at the Maryland Legislature didn’t spark an uprising. When Tyrone West died at the hands of police, and when Baltimore Police Commissioner Anthony Batts insisted that they were “changing and adapting the organization” after the cops got off scot-free, Baltimoreans didn’t revolt. And when police faced no charges in the death of Anthony Anderson, Charm City residents showed remarkable restraint.\nBut police immunity and dehumanizing poverty can only coexist for so long. If the future is uncertain, one thing is clear: it is only through resistance and struggle that a new, more just Baltimore will be born.", "url": "https://www.jacobinmag.com/2015/04/baltimore-freddie-gray-unrest-protests/"}