{"authors": ["Nikos Lountos", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:09", "date_modify": "2020-05-04 19:53:09", "date_publish": "2015-01-17 00:00:00", "description": null, "filename": "2015_01__1588621989.html", "image_url": "https://images.jacobinmag.com/2015/01/17002610/screen_shot_2015-01-20_at_8.46.51_pm-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_01__1588621989.html", "title": "Understanding the Greek Communists", "title_page": "Understanding the Greek Communists", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The prospect of a Syriza victory in Sunday’s Greek election is big news, and the international left has taken notice. The attention is welcomed, but Alexis Tsipras’ electoral prowess has obscured what the real political landscape in the country is like.\nAfter all, Syriza is not the only left-wing party in Greece, and by some measures it’s not even the largest. In organizational terms, the Communist Party of Greece (KKE) is bigger. Ignoring it, as most of the Left is content to do, means ignoring a force with important roots in the trade union movement and the longest history of all surviving Greek parties.\nCommunist Party representatives hold ten out of the forty-five seats on the board of Greece’s labor confederation, and in the last student union elections in 2014, its lists received 18.5 percent of the vote. Those affiliated with Syriza got only 6.5 percent.\nWhat’s more, many of the labor struggles of the last years cannot be understood without KKE participation, and in some cases — like that of the nine-month steel worker strike in Athens — it was KKE unionists who led the struggle. Even in electoral terms, the Communist Party had the largest share of votes on the Left from the fall of the dictatorship in 1974 until Syriza’s rise in May 2012.\nProof of the general pull to the left that Greece has experienced in recent years, in the elections of May 2012, the KKE not only avoided being squeezed by Syriza’s success, but had its best performance in twenty years (8.5 percent). But things changed immediately after, in the June elections. The party won only 4.5 percent, its worst result in the modern era.\nThe KKE’s rhetoric is clearly to Syriza’s left. Its programs declare that capitalism cannot be reformed, and that we shouldn’t have illusions of transforming European Union institutions. In a recent speech, Dimitris Koutsoumbas, the party’s general secretary said:\nKKE serves one goal: for the working class to take power so that we can live better days, with prosperity for the people. The proposals of KKE lead to this goal and follow this criterion. Not on the basis of how much the economy can take. Because this is a capitalist economy, which — under whichever management or government — produces crises, unemployment, and poverty.\nThis anti-capitalist discourse makes the Communist Party an easy target for those who label it a “political fossil” engaging in an out-of-touch ultra-leftism. Some — including members of its small internal opposition — attribute its recent electoral failures to this radical discourse.\nThe reality is that the KKE has been paying for its sectarianism more than its radicalism. The KKE not only opposes common action with other political forces on the Left, but it’s stood apart from the broader mass movement in recent years.\nOne of the most notorious examples of this mentality can be found in the KKE’s analysis of the “Squares’ movement,” the series of occupations and mass assemblies in squares that emerged in Greece in 2011. The Nineteenth Congress of KKE comments, “The so-called ‘movement of the outraged’ was supported, encouraged — if not even planned — by mechanisms of the ruling class, with the aim of manipulating, preventing radicalization.”\nIn recent analysis, party intellectuals claim that both the rise of the neo-Nazi Golden Dawn and Syriza are byproducts of the “confusion” of the movement developed in Syntagma Square. So, far from being an ultra-leftist party, in the traditional sense of the concept that describes parties that don’t recognize the need for any intermediate action but the call to revolution, the KKE is actually sketching out an unbridgeable gap between an indispensable revolution and the movement’s miserable condition today.\nThe level of the movement is, of course, measured by the number of votes the KKE takes in the elections. This circular argument produces a self-fulfilling prophecy: the movement cannot go forward if the party doesn’t become stronger, but the party is weak because of the movement’s low level of class consciousness.\nThis argumentation, in its essence, is not very far from Syriza’s claims that the moderation of its own slogans is a result of the supposedly low level of struggles.\nThis shouldn’t be all that surprising. After all, the two parties share a common history. The KKE was founded in 1918 as the Socialist Workers Party of Greece and took its present name in 1924. Its foundation was part of a twin birth with the General Confederation of Greek Workers (GSEE).\nIn a country for which the Great War started two years earlier, in 1912, with the First Balkan War, and ended four years later, in 1922, with the defeat of the Asia Minor Campaign, the antiwar movement fused with internationalist labor traditions from the recently annexed Macedonia and with inspiration from the Russian Revolution.\nPandelis Pouliopoulos, the party’s first general secretary, was removed from the leadership in 1927 for aligning with Leon Trotsky’s Left Opposition. In 1931, Nikos Zachariadis, with the support of Stalin’s Comintern, became the new leader of the party, beginning a conservative turn. An analysis of Greece as a half-feudal country served as a basis for replacing the goal of socialist revolution with that of a “bourgeois democratic” one.\nIn May 1936, the version of Popular Front tactics adopted by the Communists paralyzed it as the government crushed a tobacco worker revolt in Salonika and other labor insurgencies. The dictatorship imposed in August of that year almost completely destroyed the KKE.\nThe Communist Party, however, managed to resurrect itself and become a mass party within years, not least of all for its efforts resisting Axis occupation during World War II. Party membership rose from 15,000 in 1942 to 412,000 within two years.\nUnder the KKE’s leadership, the goal of national liberation was tied with the push for deep social change. But constrained by the Soviet Union, the KKE put its armed forces under Allied command in 1944, didn’t dare take power during the revolt of December 1944, and disarmed the movement two months later. When the Greek Civil War erupted in 1946, the Communists found themselves outgunned and less prepared than they would have been just a few years before.\nBut even after defeat in 1949, the KKE once again showed its resilience. Despite the massive repression, a new working-class movement helped the Greek Democratic Left’s (EDA, the front group of the underground KKE) electoral surge in 1958. A round of struggles in the 1960s culminated with the July Days of 1965, when successive governments imposed undemocratically by King Constantine collapsed under the pressure of mass mobilizations. EDA’s and KKE’s strategic limitations didn’t provide a way forward other than elections to a movement that wanted to challenge the whole regime.\nThe return of dictatorship in 1967 showed the power that the Greek ruling class still possessed. This defeat, combined with international crisis in the Communist parties, triggered by May ’68 and the Soviet response to the Prague Spring, led to the split of KKE’s Central Committee in two parts, and consequently into two parties, KKE and KKE Interior, which would later embrace Eurocommunism. It is in this second grouping that the majority of Syriza has its origins.\nIn the 1970s, the KKE survived as the bigger of the two parties and consolidated this position after the fall of the dictatorship. But following the trend of other Southern European countries, it couldn’t match the rise of the center-left (Pasok, the social democrats, went from 13.6 percent to 48 percent in seven years).\nThe KKE offered a moratorium to the first Pasok’s government in 1981, holding back any labor and student struggle against the social democrats. The party had run in the elections asking to be voted as a junior coalition partner in government. But in 1985, when Pasok made a sharp turn to austerity, the Communist Party joined the ranks of the labor movement and managed to gain from the disaffection from Pasok in the 1986 local elections, but distanced itself from the most militant sections of the working class who were launching an indefinite strike action.\nThe response of the two Greek Communist Parties to the new conditions was influenced by the changing global political climate in the late 1980s. Celebrating their common endorsement of the European Community and acceptance of private sector entrepreneurship, they merged into an electoral coalition (Synaspismos) that was later turned into a party. The decision to form a coalition government with New Democracy (June 1989), and some months later with both New Democracy and Pasok, led to the disappointment of hundreds of thousands of radicals.\nKKE split from Synaspismos in 1992 after having already seen the majority of its youth splitting to its left, but some of the KKE’s well-known cadre and MPs remained in the more moderate formation. Meanwhile, Pasok was left almost unchallenged in the movement against the neoliberal New Democracy government. The results of the 1993 elections reflect this: Synaspismos remained out of parliament, not being able to pass the 3 percent threshold. KKE fell to a new low, 4.5 percent.\nThe two decades that followed present the key to explaining today’s constellation of the Left. In a way, one could talk of a Greek exception: both radical parties passed through a bumpy period of reorganization and accumulation of forces, but with a general shift to the left.\nUnlike other European countries where Communist Parties were transformed into full-fledged social-democratic parties in the 1990s, in Greece this move was resisted. Greece was different, because the movement itself provided a milieu of new radicalization, forcing the left parties to compete in order to relate with it. The role of the organized presence of the anti-capitalist left in the struggles of that decade is also indispensable to understanding this process.\nThroughout the 1990s, the KKE managed to rebuild its youth section and the party machine, through the consecutive rounds of school student and university occupations and through leading the movement against the war in Yugoslavia in 1999. Until the first years of the 2000s, the Communist Party leadership, even as it avoided common action with the rest of the Left, still attempted to relate with the working class breaking from PASOK, even inaugurating a coalition with Dikki, a left-wing split from Pasok that won 6.85 percent in the 1999 European elections.\nBut a hard isolationism took over quite quickly within the Communist Party. The tactics of calling separate demonstrations during labor strikes gave way to completely separate calls for antiwar demonstrations during the Iraq War in 2003. In effect, the KKE stood at a safe distance from the explosion of activism around the anti-war movement, allowing the Pasok-controlled union bureaucracy to assume leadership of strike actions against the war.\nIsolationism was not another turn to the left. On the contrary, it was a result of an inability to combine the pressures coming from radicalizing movements with the electoralist strategy of the party. This turn had its reflection into a process of ideological re-positioning by the KKE’s leadership. A vivid example of this transformation is that after publishing the second volume of the history of the party, covering the years 1949–1968, in 2012, the central committee decided to directly rewrite the first volume of the history (1918–1949) that was published in 1991.\nThe rewriting is deep and iconoclastic, up to the point of recognizing that the Popular Front policy of KKE in the 40s led to the defeat of the 1944 uprising. If we don’t see this left turn as far as theory and history are concerned, through the prism of the tactics of isolationism in the real movement, the rebuff of the December 2008 uprising from KKE’s general secretary would seem an enormous contradiction.\nAleka Papariga, then general secretary of the party, said infamously that Communist Party was not supporting the events that erupted in Greece after the murder of a school student by a police office because “in the real popular revolution, not even one glass would break.” The KKE can make references to the civil war as the culmination of the class struggle in Greece — overshadowing even resistance to Nazi occupation — but reject barricades set up by school students.\nAll this doesn’t mean that the KKE was not part of the struggles. Communist militants and trade unionists have led strikes in a way that at some point made well-known neoliberal journalists (and their bosses) start refusing to invite KKE members to participate in TV debates, because it’s a party that “doesn’t respect the law.”\nThe KKE’s discourse claims that it isolates itself because the most important task is not to let the vanguard of the movement get carried away by the opportunist tendencies that shape the mass movements. The result has been that party didn’t manage to act as a home for the radicalized layers coming from two sides: the youth that could not see themselves in a revolution with no glasses broken, and other workers disillusioned from voting Pasok after 2011 and the introduction of the austerity programs.\nDuring the latest round of massive struggles since 2012, the gap between the KKE’s radical discourse and actual tactics grew even more apparent. Koutsoumbas began to say that there is no governmental solution to the crisis, except if the working class itself takes power: “Representatives of the workers, who will be elected in the workplace … will be controlled by those who elected them, will be revocable at any time, will not be taken out of production, will not have any extra privileges.”\nOn this line, he could have lots of common ground with Antarsya, the radical grouping of the extraparliamentary left. But, unlike Antarsya, the KKE says that fighting for not paying the debt or breaking with the European Union and the eurozone, are demands that can’t be articulated by the movement here and now, but they will be products of this “people’s power” in the distant future.\nThe KKE managed to regain some of the lost electoral ground in the 2014 European elections — a sign of another type of disillusionment, this time with perceived moderation on the part of Syriza. It seems that in Sunday’s general elections this rebound will go on. KKE positions itself as a left opposition to a coming Syriza government.\nBut this left opposition will only be useful if it’s willing to work in joint action with all the sectors of the working class who want to break with austerity using their own organized force, rather than just waiting for Syriza’s strategy of accommodation to fail.", "url": "https://www.jacobinmag.com/2015/01/understanding-the-greek-communists/"}