{"authors": ["Sean Monahan", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Christian Parenti"], "date_download": "2020-05-04 19:51:27", "date_modify": "2020-05-04 19:51:27", "date_publish": "2015-03-17 00:00:00", "description": null, "filename": "2015_03__1588621887.html", "image_url": "https://images.jacobinmag.com/2015/03/17003057/34thomas_paine-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_03__1588621887.html", "title": "Reading Paine From the Left", "title_page": "Reading Paine From the Left", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Not only was he a central personality in the “age of revolutions,” he was one of the first radicals to connect the cause of political democracy to economic demands. Because of that, he was touted as a champion not only of the rights of the commoners against aristocracy, but, as Eric Hobsbawm put it , “the radical-democratic aspirations of small artisans and pauperized craftsmen” against the owners of property.\nPaine was at the center of two of the great democratic revolutions of the late eighteenth century — the American and the French. (Beyond that, though he found the violence of the Haitian Revolution “distressing,” he considered it “the natural consequence of slavery,” which should “be expected everywhere.”)\nAs Harvey Kaye observes , the Communist Party published a collection of Paine’s writings in 1937, and hailed him as the “foremost fighter for world democracy,” the “chief propagandist and agitator of the revolution,” and a visionary radical who saw “beyond the limits of the bourgeois revolution,” attacked the “accumulation of property,” and proposed a “system of social insurance.”\nThe Prussian Forty-Eighter , disciple of Karl Marx, and Civil War Union Army Gen. August Willich praised Paine’s radical criticisms of authority at dozens of the birthday celebrations held by radical German-American organizations. Eugene Debs too was an open Painite, and at his trial for sedition for publicly opposing World War I, he cited Paine’s declaration, “My country is the world. To do good is my religion” as a model of the “wider patriotism” that he espoused.\nIn the nineteenth and early twentieth centuries, the only Americans who dared to openly claim Thomas Paine for their own were radical trade unionists, freethinkers, abolitionists, and socialists. As John Nichols points out , in 1856 the New York Times warned that the “many socialist Painites . . . and their affiliation to every species of radicalism in the land boded evil to the future of our republic.”\nOver the course of the nineteenth century, while ruling classes were cursing Paine’s name from pulpits and palaces, the growing radical workers’ movements were toasting to his memory and reprinting his works. The Irish Republicans , the Chartists of England, and the early American labor movement all lauded Paine and his ideas echoed across Europe in the Revolutions of 1848 . For generations, the revolutionary’s birthday was celebrated every January 29 by fledgling trade union and socialist movements on both sides of the Atlantic, who regarded Paine as one of their intellectual fathers and a role model for democratic revolutionaries.\nUnlikely, because Paine was a consistent advocate of a strong federal government and also a sharp critic of economic inequality and poverty who designed the world’s first fully fleshed-out scheme of social welfare provision. Beyond that, he introduced millions to a radical critique of private property and class society, and pointed to democratic politics as the solution.\nNonetheless, interest in Paine spiked during periods of crisis and democratic upheaval in the 1930s and again in the 1960s, and things changed when Ronald Reagan, in his 1980 acceptance speech for the Republican Party’s nomination for president, quoted the great revolutionary’s inspiring promise, “We have it our power to begin the world over again.” Since then, Paine has been readmitted into the lineup of US founders, and has recently been made the unlikely poster boy of the reactionary right, most notably by media personality Glenn Beck.\nAs a cult of personality around the “Founding Fathers” grew over the course of US history, the author of Common Sense was notably excluded. For about two hundred years, Paine’s image in mainstream American circles was utterly tarnished: Teddy Roosevelt’s view of him as a “filthy little atheist” sums up the prevailing sentiment. It’s no surprise that decades earlier Abraham Lincoln kept his admiration of Paine quiet.\nAcross the Atlantic, Paine was condemned as a traitor to the Crown and a dangerous rabble-rouser for his passionate defense of the French Revolution in The Rights of Man , convicted in absentia for seditious libel, and burned in effigy throughout Britain. No single person was seen as a greater threat to the political establishments of his day than Paine, both in the monarchies of Europe and in his own American Republic.\nIn the United States, then undergoing a dramatic religious revival , he was slandered as an “infidel” and a “drunk” for his attacks on Christianity and his rumored personal moral depravity. This, on top of his tirades against George Washington, the Federalists , and slavery , had decimated his reputation in the country he helped found.\nWhen Thomas Paine passed away at his small farm in New Rochelle, New York in 1809, he was impoverished and largely reviled.\nAnd so Paine stumbled to Europe, accidentally finding himself at the center of a new wave of revolutionary upheaval following the storming of the Bastille in France.\nPaine took his unshakeable faith in democratic government with him when he traveled to Europe in 1787. A student of science, Paine had designed an innovative iron bridge he hoped to build over the Schuykill River in Philadelphia, and he set forth for England with the simple purpose of finding investors for it. He had made a lot of powerful friends in the course of the Revolution, and the state of New York had gifted him a small farm seized from a loyalist, but Paine had donated all royalties from his publications to the cause of the young nation, and he could not finance his bridge’s construction on his own.\nBut Paine condemned in the harshest language the Federalists themselves, describing the Federalist Papers as “despotic” and saying of John Adams , “his head was as full of kings, queens, and knaves, as a pack of cards.” The Federalists’ fears of the tyranny of the majority could not clash more with Paine’s vision of popular sovereignty as the solution to all problems, and view that institutional checks placed on the people’s will was an aristocratic threat to liberty.\nIndeed, Paine was among the first to criticize the Articles of Confederation; in Common Sense he had remarked, “the continental belt is too loosely buckled.” In the pamphlet Public Good and several letters he wrote in the early 1780s, he called for a new continental convention to draft a common constitution along the radically democratic and centralized lines of Pennsylvania’s of 1776. Because of this he later remarked, “I ought to stand first on the list of Federalists.”\nThis was by far the most democratic constitution of the time. Paine took its unicameralism, its short office terms, and its universal male suffrage as the ideal against which he would criticize all other constitutions throughout his life, including those of the United States and France.\nAs Common Sense made the rounds, Paine took part in the political revolution in the province of Pennsylvania. As the old provincial assembly was continuing to favor reconciliation with the British, Paine and other radicals attacked the body as illegitimate on the grounds that its electorate had been restricted to property-owners. After ousting the old landed elite from power, the radicals called a popular provincial convention, which approved a new state constitution that featured a unicameral legislature based on universal male suffrage — allowing even indentured servants to vote — with one-year terms for office.\nBefore Paine’s writing, the word “republic” was commonly associated with mob rule and anarchy in mainstream discussion. After Common Sense had soaked through colonial society, a republic seemed to be the only just form of government. After all: “Of more worth is one honest man to society . . . than all the crowned ruffians that ever lived.” Paine’s work was crucial in winning over many to the cause of independence and republican government.\nWhereas previous anti-British pamphlets had used dry, legalistic language, citing precedents and past authorities, Paine deliberately avoided “every literary ornament” and crafted his message with “nothing more than simple facts, plain arguments, and common sense.” Not only did Paine’s work reach a much broader audience than previous attempts had, inspiring many to revolt, he succeeded in changing the very language of politics itself.\nHe published Common Sense in early 1776, what historian Gordon Wood describes as “the most incendiary and popular pamphlet of the entire revolutionary era.” Here, Paine does not criticize this or that policy or any political figure in particular — he takes on the very principles of monarchical government and hereditary privilege. The essay sold more than 150,000 copies within the first few month, including editions translated into German . Paine later recalled this as “the greatest sale that any performance ever had since the use of letters.”\nAs military tensions were flaring up between the British and the colonists, Benjamin Rush suggested Paine write a pamphlet in support of independence from Britain and republican government, though advising him to avoid inflammatory words. Paine agreed to write the work, but ignored the advice to tone down the language.\nIn a piece signed as “Humanus,” Paine lambasted Britain for “ravage[ing] the hapless shores of Africa, robbing it of its unoffending inhabitants to cultivate her stolen dominions in the West,” threatened “Independence” for America, and called for “continental legislation, which shall put a stop to the importation of Negroes for sale, soften the hard fate of those already here, and in time procure their freedom.” Under the pen name “Amicus,” he began to formulate an early social welfare scheme that would provide young married couples with “a reasonable sufficiency to begin the world with” and a fund “for the purpose of supporting us in our old age.”\nOn his arrival in Philadelphia, Paine quickly found a place in the community of radical craftsmen there, becoming editor of the Pennsylvania Magazine . He earned a name for himself as an articulate voice of political dissent, though he used pseudonyms for his more controversial articles.\nIn the 1770s, he fell in with circles of religious Dissenters and radical craftsmen in the London area and Lewes, and he developed an interest in science, technology, deism, and political philosophy. Through this dissident milieu he met Benjamin Franklin, who in 1774 encouraged Paine to immigrate to America and wrote him a letter of recommendation.\nOn his own, Paine found work as a journeyman , a tax collector, or a teacher; went through two marriages (the first soon left him a widower, and the second ended in separation); lived mostly on poverty wages; and had a difficult time holding a job for any extended period of time. His first foray into politics found him leading his fellow tax collectors in a doomed campaign for higher pay. The first half of Paine’s life, as historian Eric Foner put it , was a “period of unrelenting failure,” and grounded his lifelong identification with the plight — and resilience — of poor and working people.\nThomas Paine’s early life taught him to preach rebellion against inequality. He was born on January 29, 1737, in a small town called Thetford in the east of England to a humble Quaker family. His father trained him in the family craft — staymaking — though he ran away from home at age sixteen.\nJustice for All\nThe United States that Paine had left was still an overwhelmingly agrarian society. By contrast, England in 1787 was in the early stages of the industrial revolution. While enchanted by the possibilities of industrialization, Paine also noted the monstrous social inequality that accompanied it.\nAfter his arrival in Europe he traveled between London and Paris for a few years, trying to find investors for the construction of his bridge and befriending French Enlightenment thinkers and English radicals. When the French Revolution broke out in 1789, the Marquis de Lafayette invited him to Paris, where he witnessed firsthand the fervor surrounding the abolition of feudal privileges, the institution of a constitutional monarchy, and the Declaration of the Rights of Man and of the Citizen. Paine excitedly wrote to George Washington, “A share in two revolutions is living with some purpose.”\nAfter returning to London, Paine published Rights of Man , which laid out both a principled defense of the French Revolution and a damning criticism of the English monarchy and the aristocratic social system. The publication quickly sold thousands of copies, and he soon began work on a second part, which would mark a crucial development in his writing.\nRights of Man Part II goes beyond the critique of hereditary government and defense of political democracy seen in Common Sense and the first part of Rights of Man . Intended for the poor and working people of Britain, Part II specifically attacks social class and calls for not only republican government but also an elaborate system of social welfare provision.\nIn this work Paine draws a line in the sand between the virtuous producers and the idle rich who profit from the labors of others. He asks, “Why . . . does Mr. Burke talk of this House of Peers, as the pillar of the landed interest? Were that pillar to sink into the earth, the same landed property would continue, and the same ploughing, sowing, and reaping would go on. The Aristocracy are not the farmers who work the land . . . but are the mere consumers of the rent.”\nDespite his observation that “a great portion of mankind, in what are called civilized countries, are in a state of poverty and wretchedness” which was “far below” that of preindustrial societies, he did not wish to return to simple rural life as did philosophers like Rousseau. Rather, he wished to eliminate the evils of modern commercial life while maintaining its benefits.\nTo that end, Paine proposes not only the abolition of feudal privileges but also the introduction of large taxes on luxury goods and inheritances, and the use of the funds raised to pay for an elaborate welfare state. This would include direct welfare payments to the poor, public education for all children, old age pensions, income support for families with newborn children, and aid for funeral expenses.\nPerhaps most shockingly, this scheme would provided for a network of public work houses in which anyone would be admitted for public employment with full room and board “without inquiring who or what they are,” where anyone is free to “stay as long, or as short time, or come as often as he choose.”\nThis is not only a remarkably advanced welfare system for 1792 — it’s astonishing in its complete rejection of the sorts of paternalism that have so often accompanied later schemes of social relief. Paine saw reliance on charity and the Poor Laws as inadequate and humiliating. In his system, all the programs are universal, with no strings attached, and are “rights” that can be demanded.\nIn Rights of Man Part II , Paine shows that society — specifically, “aristocratical” society — creates poverty: “One extreme produces the other: to make one rich many must be made poor; neither can the system be supported by other means.”\nFor Paine, the cause of political democracy is inseparable from the economic demands of the poor, and the solution is democratic government: the poor can escape their wretched condition only through politics. Rights of Man Part II sold roughly two hundred thousand copies that year, by far outselling any political pamphlet in history at that time. Its message quickly reverberated through the “lower orders” of British society, as well as the rest of Europe and North America.\nIt was not long before the specter of revolution began to grow over Britain. Graffiti began appearing in town squares in the night with mutinous slogans like “No king” and “Equality.” Grumblings among the working classes began to be heard even in daylight. A British general in 1792 reportedly had this dialogue with some English workers causing a disturbance in a town near Durham: “Have you read this little work of Tom Paine’s?” “No.” “Then read it — we like it much. You have a great estate, General; we shall soon divide it amongst us.”\nIn panic, the British government soon began rounding up the most prominent radicals to be tried for treason, starting with Paine. The American narrowly escaped arrest and fled to France, and afterwards he was tried and convicted in absentia. Throughout the British Isles, loyalist mobs burned effigies of the radical in public processions. His parting shot was a warning that “when the rich plunder the poor of his rights, it becomes an example to the poor to plunder the rich of his property.”\nThe revolutionary French government awarded Paine honorary French citizenship and, on his arrival in the country, he was elected as a representative to the Convention for Calais, arriving just in time to herald the abolition of the monarchy and the birth of a republic.\nPaine could not speak French, and was therefore cut off from his usual base of popular support and had to rely heavily on his friends like Condorcet to keep him in the loop. As a result, he had a great difficulty finding a place in French Revolutionary politics, and nearly lost his life because of it.\nThough Paine is sometimes mischaracterized as “among the most moderate of the Girondins,” he was in fact one of the most radical democrats in the Convention, and befriended members of both political factions, including Jacobin leader Georges Danton. Two things marked Paine for suspicion in Robespierre’s mind: his association with Girondins such as Condorcet and his advocacy that the deposed king be spared the death penalty.\nWhile Paine agreed that Louis Capet was guilty of high treason, he argued for the punishment of exile rather than execution. This position was based on a principled objection to the death penalty: “as France has been the first of European nations to abolish royalty, let her also be the first to abolish the punishment of death.” Paine convinced nearly half of the Assembly, but not quite enough. In January 1793, the king was sent to the guillotine.\nAs the French Revolutionary War turned sour, Paris was riven by faction fighting, and the provinces were engulfed by peasant uprisings, Paine withdrew from the Convention in disaffection. At the end of 1793, Robespierre came to power and Paine was arrested along with everyone else associated with the Girondins.\nAfter riding out the Reign of Terror in Luxembourg Prison, Paine managed to avoid the guillotine by a fluke accident and, after the fall of Robespierre and the rise of the Directory, was finally released due to the intervention of the new American ambassador, James Monroe.\nHe lived with the Monroes for the next few years. Though still recovering his health, he stayed tuned in to political developments in the country and followed intently the crackdown against the Conspiracy of Equals, a group of ex-Jacobins aiming at the violent overthrow of the Directory, and the trial and execution of their leader, Gracchus Babeuf. Their thought would have a large influence on Paine.\nThe “Babouvistes,” as they were known, were the first modern revolutionary communist movement, and their assault on property was far more radical than anything Paine or other radicals had put forward. Taking the political theory of Rousseau in a radical new direction, they argued, “miseries and slavery are consequences of inequality, which is itself the result of property. Property is, therefore, the greatest scourge on society; it is a veritable public crime.” All differences in wealth are unearned — they accrue by the exploitation of others, or by the accident of naturally endowed strengths and talents — and therefore are undeserved.\nThe Babouvistes proposed a new Reign of Terror during which they would nationalize all private property, impose equal liability to work and provide an equal distribution of goods to each citizen. This plan was popular with the Parisian sans-cullottes, though many balked at the conspirators’ bloodlust.\nSpeaking in the same radical democratic republican language as Paine, the Babouvistes came to a much more fundamental critique of property and a wholly collectivist solution. Though the Conspiracy was discovered and its leaders arrested, the movement’s doctrine left a deep impression on Paine.\nHis Agrarian Justice , written in 1795–96, was Paine’s last great pamphlet and marked the completion of the social welfare project he had proposed in Philadelphia in 1775. The pamphlet reiterates in clear language Paine’s theory that inequality and poverty arise not from nature but from society. More clearly than in Rights of Man Part II , and plainly inspired by the Babouvistes, he traces the origins of this inequality to private property. Crucially, the cause of inequality in Agrarian Justice is no longer linked to an “aristocratic” system of privileges, as in all his previous works, but to the very institution of property itself.\nIn the author’s inscription, he states, “There are two kinds of property. Firstly, natural property,” in the land, air, and water of the earth, which the Creator gave all humanity an equal right to, and, secondly, “artificial or acquired property,” the products of labor of which “equality is impossible,” since that would require “that all should have contributed in the same proportion, which can never be the case.” He states, “Equality of natural property is the subject of this little essay. Every individual in the world is born therein with legitimate claims on a certain kind of property, or its equivalent.”\nHe goes on to argue, like John Locke had, that in the state of nature the earth and all its bounties were “the common property of the human race.” But unlike Locke, Paine insists that this right is not forfeited when land is claimed as private property for the sake of cultivation — “it is the value of the improvement only, and not the earth itself, that is individual property.”\nHe explains that such private property is justified because cultivation so greatly increases the productivity of the soil, but that in “all those who have been thrown out of their natural inheritance by the introduction of the system of landed property” are owed compensation for that loss by right.\n“Every proprietor, therefore, of cultivated land, owes to the community a ground-rent . . . for the land which he holds,” the funds from which would go towards a new scheme of social security. Again, Paine insists, “it is a right, and not a charity, that I am pleading for.”\nThe money raised by this ground rent would be distributed out as an equal payment to “every person, rich or poor” on turning twenty-one, guaranteeing to each citizen a modest inheritance, “means to prevent their becoming poor.” This proposal has often been interpreted as the first suggestion for a universal basic income, but that doesn’t seem to be exactly what Paine had in mind.\nWhile a basic income is usually seen as an anti-poverty measure designed to help the poor meet their living expenses with regular cash payments, Paine’s proposal takes the form of a one-time lump-sum grant given to each individual when they reach adulthood. He goes on to say, “With this aid they could buy a cow, and implements to cultivate a few acres of land; and [work for themselves] instead of becoming burdens upon society.” Paine hopes that recipients will use their social inheritance not to buy consumption goods, but to buy for themselves some means of production, and avoid entirely the precarious and pauperized life of wage labor.\nThis is a universal capital grant, not a basic income. Paine wants to make everyone the owner of productive property. Republican liberty, after all, requires economic independence and material security for everyone.\nBut in devising this scheme, Paine goes beyond, and contradicts, his initial claim to deal exclusively with “natural property.” The ground-rent he proposes would take the form of a 10 percent inheritance tax on all estates. The value of these inheritances, he realizes, includes “what is called personal, as well as . . . landed property,” and there is no clear way of parsing out the two.\nTherefore, he goes on to offer two criticisms of personal property itself, which he had defended in the preface as the just returns to one’s labor. The first is remarkable:\nPersonal property is the effect of society; and it is as impossible for an individual to acquire personal property without the aid of society, as it is for him to make land originally. Separate an individual from society, and give him an island or a continent to possess, and he cannot acquire personal property. He cannot be rich. So inseparably are the means connected with the end, in all cases, that where the former do not exist the latter cannot be obtained. All accumulation, therefore, of personal property, beyond what a man’s own hands produce, is derived to him by living in society; and he owes on every principle of justice, of gratitude, and of civilization, a part of that accumulation back again to society from whence the whole came.\nAs said the Babouvistes, now says Paine: one does not truly have a claim to the “full product of their labor,” since their very productivity is a creation of society. This argument is even more profound than that of Paine’s Ricardian Socialist followers; eighty years later Karl Marx would level a more developed version of this very criticism against the philosophy of Lasalle in his “Critique of the Gotha Program.”\nPaine’s second criticism is equally profound: “if we examine the case minutely it will be found that the accumulation of personal property is, in many instances, the effect of paying too little for the labour that produced it; the consequence of which is, that the working hand perishes in old age, and the employer abounds in affluence.” Here Paine sees property to be the result of the exploitation of labor by capital.\nGiven the depth of Paine’s criticism of the principles of private property, it is unclear why he is so devoted to defending a reformed version of the institution. It is clear that he sees “landed monopoly” as inseparably linked to “cultivation . . . one of the greatest natural improvements ever made by human invention,” and in his system he seeks to “remedy the evils and preserve the benefits” of the modern system.\nBut he seems to contradict himself in two respects: first, he seeks to preserve the benefits of large-scale cultivation and production, but his capital grant proposal has the aim of offering an escape from wage labor in large-scale cultivation and production; and second, he wants to create a system in which everyone appropriates the full products of their labor, but offers a profound criticism of the very idea of the right to “the full products of one’s labor.” The question remains: why not communism?\nNonetheless, Agrarian Justice is an enormously important development in working-class political thought. “The present state of civilization is as odious as it is unjust,” Paine argues. “It is absolutely the opposite of what it should be, and it is necessary that a revolution should be made in it.”\nSince a democratic republic requires economically secure and independent citizens, socioeconomic rights cannot be separated from political rights. Paine makes quite clear that addressing the issue of material inequality grows “spontaneously out of the principles of the revolution,” and that a “revolution in the state of civilization is the necessary companion of revolutions in the system of government,” in order “to give that revolution effect.” Marxists would later call this objective “social revolution.”\nModern socialists no doubt will see the specific form of Paine’s solution as insufficient. But he was, after all, writing at a time in which modern class antagonisms were “only just cropping up,” and which could then be thought of only “in their earliest, indistinct and undefined forms,” as Marx later said in defense of a different group of early socialist thinkers, who wrote in the decades after Paine.\nIt was quite reasonable to propose small proprietorship and commerce as a solution to inequality in the 1790s, even if we see that same solution as thoroughly obsolete today.\nWe should not overlook the significance of Paine’s fundamental critique of the regime of private property and his insistence that the political revolution must be followed by a social revolution that transforms those property relations.\nThe American revolutionary’s formula was groundbreaking: exploitation and inequality are the disease, and democratic politics is the remedy. This message reached hundreds of thousands of poor working people in a time when the Industrial Revolution had only just begun.", "url": "https://www.jacobinmag.com/2015/03/thomas-paine-american-revolution-common-sense/"}