{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:57", "date_modify": "2020-05-04 19:56:57", "date_publish": "2015-04-17 00:00:00", "description": null, "filename": "2015_04_free-market-conscious-capitalism-government_1588622217.html", "image_url": "https://images.jacobinmag.com/2015/04/17003525/canal-copy-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_04_free-market-conscious-capitalism-government_1588622217.html", "title": "The Free-Market Fantasy", "title_page": "The Free-Market Fantasy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "John Mackey spent his formative years trying to divine the purpose of his life. After much soul-searching and lots of reading, he made an important decision: come hell or high water “he would follow his heart wherever it led him.”\nSince 1980 his heart has led him to create and run Whole Foods Market — “a store that sells healthy food to people and provides good jobs.” More recently, Mackey has embarked on a grander mission: “to liberate the extraordinary power of business and capitalism to create a world in which all people live lives full of prosperity, love, and creativity — a world of compassion, freedom, and prosperity.”\nMackey is not your typical CEO. He hasn’t taken a paycheck for more than six years. He has also donated all his recent stock options to Whole Planet, a Whole Foods nonprofit that provides start-up microloans to poor people (primarily women) in more than fifty developing countries.\nMackey drives his early model Prius to work every day on a mission: he wants the planet to eat better, and he wants to teach other entrepreneurs the secrets of “conscious capitalism.” He believes that if businesspeople, and society more broadly, realize the incredible power of “conscious” businesses to create value and heal the planet, we can reverse the missteps of the past few decades.\nBy honoring all its stakeholders, Whole Foods creates an “operating system” that is “in harmony with the fundamentals of human nature” and the planet.\nFor the past thirty years companies have been told that their only social responsibility is to make a profit. In this ideological context, recent moves by mega-corporations like Kraft, Walmart, McDonald’s, Hewlett-Packard, Nordstrom, Nestlé, IKEA, Southwest Airlines, Zappos, and many more to scrutinize their supply chains and speed their adoption of sustainable practices is surprising and indicates growing concerns about the current global model of extraction, production, distribution, and consumption.\nIn 1972 researchers at MIT published their eye-opening study The Limits to Growth . The project used computer simulations to demonstrate the potentially devastating impact of exponential capitalist growth in a closed system with finite resources. Examining growth trends in human population, industrialization, pollution, and resource depletion, the report’s authors suggested possible scenarios of “overshoot and collapse” in the global system by the middle of the twenty-first century.\nIn the decades since, a shared global consciousness has emerged that humans are destroying the planet. Some scientists have even started referring to the time since the rise of industrial capitalism as the Anthropocene era, arguing that humans are altering the planet in ways similar to major geological events in the past.\nMackey agrees that the destructive actions of big corporations obsessed with the bottom line have damaged the environment, but he vehemently denies that the problem is capitalism. Mackey argues that true capitalism, or free-enterprise capitalism (free markets + free people), is a unique, inherently virtuous system that, properly harnessed, can heal the planet.\nSure, companies have been misbehaving recently, but before we throw the baby out with the bathwater, Mackey implores us to remember that most of the wonderful things we have in the world, like cars, computers, antibiotics, and the Internet, are a product of free markets, not “government edict.” The “wondrous technologies that have shrunk time and distance” and freed us from “mindless drudgery” have become possible only because of free market capitalism — “unquestionably the greatest system for innovation and social cooperation that has ever existed.”\nInstead of blaming capitalism for inequality and environmental degradation, Mackey suggests that we should look at the actions of governments. Departing from the dominant idea that states have retreated from the market over the past three decades, Mackey argues states have become more interventionist than ever, and that in the process they have “fostered a mutant form of capitalism called crony capitalism” that is to blame for many of the problems societies face today.\nMackey does not see crony capitalism as “real” capitalism. Instead it is a product of big government in which politicians trying to preserve their cushy jobs develop symbiotic, parasitic relationships with businesspeople too lazy or unimaginative to compete successfully in the marketplace.\nIn Mackey’s story, crony capitalism has been exacerbated by the rising power of the financial sector and shareholder value ideology — the idea that firms are nothing more than a stream of assets designed to maximize profits for shareholders. Mackey argues that this obsession with greed and profits has “robbed most businesses of their ability to engage and connect with people” and has created “long-term systemic problems” that destroy profitability and that can be deeply damaging to people and to the planet.\nInstead of trying to get a handout from the government or make a quick buck on the stock market, Mackey says that companies need to roll up their sleeves and rethink how to run a business. The first thing they need to do is to realize that a business is a “social system,” not a hierarchy. Everyone matters.\nThe free-market story is appealing. It references values like freedom, creativity, and beauty and counterposes itself against images of drudgery, dictatorship, and starvation. But the history of markets (and the firms that operate within them) is not a nature story.\nToday, the dominant discourse governing discussion of markets, states, and companies is neoliberalism, and Mackey’s free-market business model and historical narrative fit neatly within this framework. In this vision, the economic sphere is “an autonomous, self-adjusting, and self-regulated system that [can] achieve a natural equilibrium spontaneously and produce increased wealth.”\nBut the free-market historical narrative lacks empirical weight. As economic historian Karl Polanyi argued decades ago, capitalist markets are a product of state engineering, not nature.\nThe history of industrial development in the United States, often considered the epicenter of free markets, demonstrates the political nature of markets. The history of market formation in the United States reveals an industrial structure supplied by goods and capital extracted from slave labor and facilitated through a state-sponsored, genocidal land grab.\nFar-reaching government legislation protected domestic markets and infant industries from external competition, and federal and state governments played a central role in the development of physical infrastructure (canals, railways, telegraphy) and the creation of huge bodies of agricultural and industrial knowledge — all essential elements in the genesis of American industrial capitalism.\nAt the same time, society’s greatest inventions and innovations of the past two hundred years — rockets to the moon, penicillin, computers, the Internet — were not bestowed upon us by lone entrepreneurs and firms operating in free markets under conditions of healthy competition. They were the work of institutions: CERN and the Department of Defense created the Internet, while Bell Labs — a subdivision of AT&T, freed from market competition by federally granted monopoly rights — generated transistors, radar, information theory, “quality control,” and dozens of other innovations central to our epoch.\nNearly every advance in science, technology, and mathematics emerged from people working together at universities supported by government funding. Creativity and innovation come from many places. Companies produce influential innovations, but so do other institutions that operate outside the confines of the profit motive, competitive markets, and the bottom line.\nAs Cambridge professor of economics Ha-Joon Chang argues, this is neither theoretical quibbling nor simply a quest for historical “truth.” Instead, getting the historical narrative right is important because the stories we tell “deeply affect the very way in which we understand the nature and the development of the market, as well as its interrelationship with the state and other institutions.”\nDesignating the market as natural and the state as unnatural is a convenient fiction for those wedded to the status quo. It makes the current distribution of power, wealth, and resources seem natural and thus inevitable and uncontestable.\nBut of course this isn’t true. States shape, sustain, and often create, markets, including neoliberal markets. The complexion of those markets depends on the balance of class forces at any given point in time. Capitalist markets, and the inequality and degradation they engender, are a political creation not a product of nature. Nature and society (and states and markets) are inseparable — simultaneously produced by humans through ideological, political, and economic processes.\nUnderstanding this enables us to challenge the dominant idea of natural, free markets and the emancipatory potential of the firm promised by Mackey.\nFine. Free markets don’t exist and other institutions like states clearly matter. But how are these other institutions going to stop global warming and rainforest destruction and species extinction? States, aside from the big players, appear weaker than ever (with less autonomy, power, authority), and their ability to tell corporations what to do is limited by their need for economic development and their membership in international bodies like the World Trade Organization that explicitly prohibit most environmental restrictions.\nOn the flip side, transnational corporations are stronger than ever. One giant company, like Unilever or Walmart, affects millions of people around the world every day through its global supply chains. Free markets don’t exist, but maybe corporations are still the best, most sensible, way to heal the planet. They have reach, influence, and an unrivaled ability to coordinate action quickly.\nIn Mackey’s story an enlightened corporation with a positive mission that honors all its stakeholders can heal the planet. He says that a company can create a virtuous cycle of production and consumption that will stand the test of time if it treats its suppliers, its workers, and its community and the environment right.\n“Conscious capitalism,” while attractive in some respects, is not a solution to the environmental and social degradation that accompanies the system of for-profit production. The “coercive laws of competition” are inescapable in capitalism, which means that conscious business philosophies will be short-lived.\nMore important, even sustainable production in a for-profit system will consume and destroy the planet’s resources. Sustainable business practices are designed to make global production easier and more profitable for companies in an increasingly competitive global environment. While they make consumers feel good and improve efficiency and waste at the unit level, eco-practices don’t slow down production and consumption at the systemic level. They speed up these processes, devouring resources at an ever-expanding rate.\nThe widespread popularity of ethical consumption and lifestyle politics is a clear indication that people care about the environment and don’t want to destroy the planet. But the firm can’t be the driver of a radical project to reduce humanity’s ecological footprint. Firms are not democratic institutions, and they cannot escape the imperatives of capitalism.\nWhen consumers and environmental NGOs channel their desire for environmental justice through the firm, their desires get absorbed into business strategies for growth and expansion. By focusing on the firm, we legitimate its centrality and the entire for-profit production architecture.\nSociety must decide what kind of world it wants to live in, and these decisions must be made through democratic structures and processes. Buying better things is not a substitute for the hard political choices that societies need to make about limiting consumption and resource use, and finding a replacement for the psychological crutch of consumerism.\nStates seem toothless in the face of environmental degradation, but they are not inherently weak. They simply represent the existing balance of class forces. If we don’t want to live in an environmental wasteland, we must build up democratic institutions to organize production and consumption around the needs of humans, not the needs of capital.", "url": "https://www.jacobinmag.com/2015/04/free-market-conscious-capitalism-government"}