{"authors": ["Ed Rooksby", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:17", "date_modify": "2020-05-04 19:59:17", "date_publish": "2015-09-17 00:00:00", "description": null, "filename": "2015_09_jeremy-corbyn-labour-left-socialist-leader_1588622357.html", "image_url": "https://images.jacobinmag.com/2015/09/17005807/corbyn-heart-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_09_jeremy-corbyn-labour-left-socialist-leader_1588622357.html", "title": "Corbyn and the Left", "title_page": "Corbyn and the Left", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Pinch yourself. The Labour Party has elected a socialist as its leader. Not a “socialist” in inverted commas — an actual, bonafide old-school reformist socialist opposed to austerity, inequality, and war and in favor of nationalization, rent controls, and radical wealth redistribution.\nIndeed Jeremy Corbyn is almost certainly the most left-wing leader in party history.\nThis is an extraordinary development — not least because, up until a few weeks ago, pretty much everyone was agreed that the Labour left was an exhausted force. Certainly no one foresaw the groundswell of mass support that Corbyn’s campaign picked up after it launched in June, much less the thumping majority that he achieved — winning with 59.5 percent of the vote.\nMuch of the Right and indeed the center-left (which has been if anything more hostile to Corbyn than the Right) remain palpably stunned by his victory. This shock has been reflected in the panicked, petulant nature of much of the media’s treatment of Corbyn over the two weeks or so since he became leader.\nThis response is perhaps best described as a sort of desperate scandal-mongering in which Corbyn is denounced day in and day out, often for the most trivial of “offenses” — among other things for his dress sense and for not singing the national anthem.\nBut it’s worth pointing out that most of the radical left were taken as much by surprise by the Corbyn surge as anyone else. Indeed the phenomenon of “Corbynmania” runs counter to much of the radical left’s analysis of “labourism” for the past few decades. Corbyn and the movement around him have exploded what we had taken to be settled truisms about the absolute hopelessness of any attempt to harness the Labour Party as a vehicle for socialist advance.\nThis calls for significant rethinking by those of us outside the Labour Party left (much of which was reduced to the part of more or less passive onlookers as the mobilization around Corbyn catalyzed and surged ahead).\nThis doesn’t mean that we were wrong about there being structural limits, or deeply embedded obstacles and pitfalls, inherent in laborism or in parliamentary reformism more broadly. Corbyn is already beginning to run up against some of these, and he and the movement around him will certainly encounter them even more forcefully as they advance further.\nIt does mean, however, that we were substantially wrong about the prospects for a social-democratic insurgency within the Labour Party. While Labour has not been reclaimed, some of the commanding heights of the party have been seized — for now. None of us can claim in good faith to be sure about how things will develop from here. We are in new and uncharted territory.\nSo how can we explain these unexpected events? Three key factors stand out — first, the enervation of the Labour right, which was itself an unintended consequence of its own gradual hollowing out of the party; second, the transformation of the party’s leadership election system; and third, the specific form in which a European-wide process of anti-austerity radicalization crystallized in the United Kingdom.\nParadoxically, it was the crushing defeat of the Labour left in the 1980s that created one of the conditions for Corbyn’s victory some thirty years later. After “Bennism” was contained, the process of party recomposition under the “modernizing” right that reached its peak under Tony Blair was as much about the snuffing out of party democracy and disempowering the membership as it was about the shift to the neoliberal center in policy terms (indeed the former was largely the precondition for the latter).\nThis centralization of power led, over time, to a hollowing out of the party. The Right presided over an increasingly lifeless party structure. But this was a shallow and brittle hegemony. When the Corbyn challenge breathed life into sections of the membership again, the Right found that it simply didn’t have a rooted mass base of support in Constituency Labour Parties and branches to resist Corbyn’s advance.\nEd Miliband’s accession to the leadership in 2010 reflected a weakening of the Right’s grip over the party in some ways after the debacle of Iraq, the partial discrediting of neoliberalism with the onset of the 2008 crisis, and the general election defeat of Gordon Brown.\nHowever, almost as if he was ashamed about the effrontery he’d shown in beating the Right’s preferred candidate — his own brother, David — Ed Miliband thought it necessary to placate the Blairite wing by giving them something that would (they thought) shore up their domination in future.\nThe reform of the party electoral system (stemming from the 2014 Collins review) — in particular the introduction of a “one member, one vote” system and votes for supporters as well as members — was designed to dilute the power of the unions in leadership elections and thus, it was thought, guarantee that the “Right” candidates would be victorious in future contests.\nIt didn’t work out that way. What was meant to strengthen the hold of the Right over the party in fact provided a way for a candidate of the party’s “hard left” to take control. Corbyn, or a candidate like him, could never have won under the previous electoral college system. In more than one way, the ground for his shock victory was prepared by the party right over-reaching in seeking to ensure its total domination.\nThese two factors — the shallowness of the Labour right’s hegemony within a hollowed-out party and the reconstitution of the leadership election system — converged with a third: the emergence of a mobilized popular anti-austerity movement in support of Corbyn. More specifically, the Corbyn campaign gave concrete political expression to a radical mood bound up with a wider shift to the left across Europe.\nHowever, there’s an important difference from developments elsewhere in Europe. Whereas in other countries the radical anti-austerity mood crystallized in the form of electoral challenges from outside the established parties of social democracy, in Britain — no doubt in large part because of the peculiarities of the first-past-the-post national election system and the obstacles to the growth of new parties that comes with it — it took root within the traditional party of social democracy.\nIndeed what we are seeing in the UK now isn’t any longer the slow “Pasokification” of Labour but a simultaneous and rapid process of “Pasokification” and “Syriza-ification” — the emergence of a sort of dual power within Labour. This, of course, is a very unstable situation but one pregnant with opportunities. It’s also largely unprecedented.\nNevertheless Corbyn’s position is extremely precarious. Though the hollowing out of the party since the 1980s helped prepare the ground for Corbyn’s victory, this same hollowing out is also now a source of weakness for Corbyn.\nThe Labour left as an organized body, rooted among the structures of the party, has never been weaker than it is now. The Right occupy most of the strategic positions within the institutions of the party and are well dug in. The recent influx of new members — the shock force behind Corbyn’s victory — is unlikely to change the balance of forces within established party structures in the short term.\nGiven Corbyn’s vulnerability in relation to the forces ranged against him within the party, it is imperative to strengthen the grassroots movement around him. This is the only real counterweight that can be deployed against the pressures bearing down on him and his (small group of) comrades within the Parliamentary Labour Party.\nMaintaining the momentum of the Corbyn movement is key. But this is easier said than done.\nMuch of the problem in this respect is that in order to do this — lead the Labour Party within the structures of Westminster and provide a focal point around which a wider mobilized movement coheres — Corbyn is going to be pulled in two directions. In fact he’s got to make the Labour Party a vehicle for something it was designed to snuff out. He’s got to run the machine (inasmuch as he can run something he doesn’t fully control) against itself.\nAs a range of classic studies of the Labour Party have shown — notably those of Ralph Miliband and David Coates — one of the major functions of the party, embedded in its structural DNA, is “management of discontent” by systematically channeling extra-parliamentary struggle into more containable and much more harmless forms. Leading Labour while simultaneously providing leadership to a wider mass movement is going to be incredibly difficult.\nMuch here will turn on the ability of the movement to maintain a certain critical distance and autonomy in relation to Corbyn. This, in turn, demands that the movement goes beyond Labour Party members to encompass other forces on the Left too.\nIt was enormously encouraging in this regard to see that Caroline Lucas of the Green Party is keen to discuss electoral pacts with Corbyn in order to build what she calls a “progressive majority” alliance in Britain. The recent initiative to construct a “Corbyn network’” of grassroots campaigners is a very positive development, as well.\nMost groups on the radical left are eager to work with Corbyn. It remains to be seen whether Corbyn will decisively reach out to these other forces. If he does so, of course, this move is likely to encounter hostility and obstruction from the Labour right and Labour tribalists more broadly. But it’s either this or slow strangulation as the Right gradually rebuilds its hegemony over the party.\nNevertheless, in order to contribute positively to this process, the radical left will need to approach the business of working with the Corbyn movement with an openness and humility which doesn’t always come naturally to us.\nThe temptation will be to shoehorn the whole unpredictable and largely unprecedented process into preconceived schematic formulations about “reformism,” “left reformism,” “centrism,” the necessary emergence of more revolutionary groupings. But this will be a way of reasserting comfortable theoretical and organizational certainties and, thus, of not really having to think about the specifics of the current political situation.\nIf nothing else, the fact that we’ve been behind the curve during the process of mobilization around the Labour leadership contest and that Corbyn’s victory confounded a lot of what we had been saying about Labour and the demise of social democracy should be enough to make us think again about our strategic perspectives.\nMoreover, the fact that Corbyn’s campaign was uniquely successful at tapping a hitherto latent popular anti-austerity radicalism and mobilizing it — something that the radical left has signally failed to do in the seven years since the onset of the economic crisis — should give make us further pause for thought.\nWe will certainly be in no position to dictate terms to the Corbyn movement or to offer cocksure advice about “the necessity” of this or that revolutionary perspective. Neither is it at all likely that the vast bulk of the Corbyn movement be recruited to any of the existing radical left parties or their various affiliated organizations.\nThis is not, of course, to say that the Corbynistas themselves have nothing to learn. Indeed it must be an eye-opener for many of Corbyn’s newly politicized supporters to see the range of forces now lining up to oppose them in a tacit alliance — from the Tories, to most of the media, to some of the state, to much of the Labour Party itself. Simplifying only slightly, we can observe an unspoken, loose, but nevertheless distinct, closing of ranks among political, media, and state elites that reveals a truth about the locus of a fundamental political dividing line.\nIt’s not Labour versus the Tories. It’s the movement for radical change around Corbyn against the defenders and partisans of the established order including the large bulk of the Labour Party. And these forces command huge power and resources.\nThe recent remark on the part of an (unnamed) senior serving British general that a Corbyn government could face “a mutiny” from the army — something that sounds like the threat of a military coup — will have provided a further rude lesson about the sort of forces the Corbyn movement is up against and how difficult and risky the fight will be. A sharp learning curve is currently underway and in this respect the radical left, with its firm grasp of the realities of class conflict, can offer useful guidance.\nNevertheless, in any emerging recomposition of the British left in which forces working within the Labour Party are closely linked with those outside it, the radical left will participate as necessarily junior partners. The engine driving this new alliance will be those who’ve (re)joined the Labour Party in droves to get behind Corbyn. If it gets going, this will be a pluralistic movement whose course of development will be impossible to predict with any precision.\nThe worst thing the radical left could do would be to interpret it as a forum within which discrete reformist and revolutionary poles battle it out for hegemony. Instead it should be regarded as a sort of collective laboratory of struggle and ideas in which various currents work, experiment, and learn together — a joint endeavor in which none of the participants can claim to know all or even many of the answers in advance.", "url": "https://www.jacobinmag.com/2015/09/jeremy-corbyn-labour-left-socialist-leader"}