{"authors": ["Catarina Príncipe", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:41", "date_modify": "2020-05-04 19:58:41", "date_publish": "2015-02-17 00:00:00", "description": null, "filename": "2015_02__1588622321.html", "image_url": "https://images.jacobinmag.com/2015/02/17002753/tsipras-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_02__1588622321.html", "title": "First Days, First Decisions", "title_page": "First Days, First Decisions", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOn January 25, thousands of people took to the streets of Athens to celebrate Syriza’s electoral triumph. It was a victory that seemed implausible even four years ago. How, in that short time span, did a radical left coalition become a near-majority parliamentary force with widespread popular support? One important element was the speed with which austerity was applied in Greece. While the erosion of labor rights and the Greek welfare state had been underway for the last twenty years, the process gained a great deal of speed since the signing of the memorandum. The abrupt attack caused immediate popular resistance. European leaders learned from their mistakes: in Portugal, the second country to sign a memorandum with the troika, austerity was implemented much more gradually in order to avoid provoking the same response. Another central political difference between Greece and Portugal is the complete discrediting of the Greek center-left. When Pasok took on the role of neoliberal administrator of austerity, it opened up space for the oppositional left to grow and capture thousands of former Pasok voters and trade unionists. The success of Syriza is the success of the Left that refused compromises with liberalism: Dimar, the right-wing split from Syriza whose aim was to support a Pasok-led government, garnered only 0.5 percent of the vote in the January 25 elections. But Syriza’s victory isn’t due to Greece’s political context alone. In a moment of crisis, a political organization that wants to win social majorities needs to help coordinate and support self-organized solidarity networks, while at the same time advancing political proposals that build electoral power. For the last ten years, Greece has been a stage for very strong social movements, such as the student movement against higher education privatization in 2006, the European Social Forum in 2006, the big demonstrations against police violence after the murder of Alexis Grigoropoulos in 2008, and the occupation of Syntagma Square in 2011, which inspired similar movements around the world. These movements having been laying the groundwork for organized resistance to the troika and have politically activated a whole generation. The party-movement relationship is symbiotic: the party needed to buttress social resistance — precisely in order to open up the political space necessary to implement the movement’s demands. In doing so, they have constructed the only political project capable of attracting majority support in Greece today.\nThe Coalition Question Syriza fell short of an absolute parliamentary majority, electing 149 of the 151 MPs necessary to form a single-party government. Its decision to enter a coalition government with the Independent Greeks (ANEL), a right-wing anti-austerity party, has been the subject of much debate. The outcome is certainly not ideal. But in assessing whether the decision amounts to an error, we must take into account the difficulties of the situation and political dynamics within parliament. Had Syriza failed to form a majority government in three days, that opportunity would have been given to the second leading vote getter, New Democracy. To prevent this, Syriza would have had to ask for a “tolerance vote” in parliament — a request that other parties promise not to vote against Syriza’s proposals. But this alternative was no alternative at all: the only other anti-austerity party on the Left, the Communist Party of Greece (KKE), would have not backed Syriza in such a vote. The other potential partners for a coalition government would have been To Potami or Pasok, which would have forced Syriza to an unthinkable withdrawal from its debt renegotiation and broader social agenda. A failed tolerance vote would likely have precipitated new elections — an outcome favored by New Democracy, which has already begun reorienting itself by repudiating the leadership of former Prime Minister Antonis Samaras. The “soap affair” (the absurd moment when Alexis Tsipras arrived at the presidential palace to find that all the soap, toilet paper, towels, and even the Wi-Fi passwords had been taken away by Samaras and his crew) sparked intense criticism of Samaras in many right-wing newspapers, and some anticipate a new political trajectory in which the party competes for the center by rhetorically softening its neoliberal policies. New elections could very well have given New Democracy a victory, especially since so many Greek people say that they are willing to give Syriza, a brand-new political force of outsiders and mavericks, “just one opportunity” to show that it is capable of governing. Even if a new round of elections were not called instantly, the constant instability of a minority government would have risked showing Syriza (and, by extension, the entire radical left) to be “irresponsible” and incapable of taking steps to end the country’s humanitarian crisis. This would have benefited the Right enormously. Many on the Left rightly say that a certain amount of “irresponsibility” is precisely what is needed. But if in the eyes of the majority a Syriza failure is reason for a turn to the right, Greek society will be no closer to this “irresponsibility,” which can only be implemented with mass support. Moreover, a minority government would have had to compromise much more of its program than Syriza has had to (so far) in its coalition with ANEL. ANEL, after all, completely accepted Syriza’s Thessaloniki Program and received in return the only ministry they wanted — the Ministry of Defense. It’s true that this is not a small appointment, but it’s worth noting that Syriza designated Kostas Isichos of its Left Platform to be deputy minister of defense, a position the party can use to monitor and control the ANEL leader assigned to head up the ministry. So it can hardly be said that Syriza is unaware of the coalition’s risks and is not doing what it can to mitigate these risks. Syriza also assigned Tasia Christodoulopoulou, an important radical lawyer, to lead the Ministry of Migration. Called by the mainstream media “the soulless lawyer who wants to legalize all migrants,” Christodoulopoulo is also well known as one of the founders of the Solidarity 4 All Network. This is a sign that Syriza is not willing to compromise on its basic demands concerning migrants. Indeed, one of the government’s first measures immediately grants Greek citizenship to all children of migrants born in Greece. It is estimated that this measure will affect more than 200,000 young people, providing them access to school, education, and social security, as well as stopping expatriation proceedings. The only programmatic issue that is being temporarily postponed is Greece’s potential NATO exit. This is by no means a minor issue, but is perhaps also not the most urgent. Those standing in solidarity with Syriza will need to closely watch developments related to NATO extrication. Although a minority government has never taken power in Greece, it is legally possible to do it. But our answer should not be a pure “legalistic” one, but one that is capable of assessing the concrete political situation and the relation of forces within the parliament and society. Many criticisms leveled at the decision to form the coalition government are important and principled. It’s also true that this was not “the only option.” But in assessing them and drawing lessons, we must make sure our criticism does not ignore the real political dynamics at work, especially if we are to equip ourselves to effectively critically support Syriza in the months and years to come. We don’t get to choose the conditions in which we make history, but if we refuse to back down when history invites us onto its stage today, we can shape the conditions in which we make history tomorrow.\n“We Make Soaps Against Suicide” I had the opportunity to visit a solidarity center in Galatsi, one of the most populated areas of Athens. For five years, the center has attempted to provide solutions to the crisis, organizing cultural gatherings, language classes, and daycare — essential to helping the most vulnerable discover the collective experience of solidarity. The basement of the building is home to a small soap factory. All the materials are produced by unemployed people in the area, who use raw products bought in the market without intermediaries. The manufactured soaps are sold back to the market to help finance the center and provide basic necessities for the area’s unemployed. Making soap is seen as a way to restore a sense of dignity for people who have been thrown into extreme poverty. “We make soaps against suicide,” one of the volunteers at the center told us. Eduardo Galeano, the Uruguayan novelist, writes: “I don’t believe in charity. I believe in solidarity. Charity is so vertical. It goes from the top to the bottom. Solidarity is horizontal. It respects the other person. I have a lot to learn from other people.” I found a practical understanding of this idea in all the social solidarity structures I visited: they aimed to facilitate experiences of self-organization and political participation, laying a material basis for participants to contribute their voices to the democratic determination of Greece’s future — to enter the stage of history. This means that the goal is not only to resolve the daily problems of the most affected population, but also to communicate in practice that the social problems caused by the crisis — poverty, unemployment, hunger, lack of housing — cannot be solved individually. These initiatives maintain an autonomous relationship to Syriza. They are coordinated through the Solidarity 4 All Network, but their decision-making processes happen at a local level through assemblies. Confronted with the question of whether they want to continue their work and organization after the elections, the answer is always a positive one. For three reasons: the first is that they believe Syriza’s victory is the only way to end the depression-level conditions, but that these structures will still be essential in providing answers to the most impoverished populations. Secondly, they intend to continue working in a cooperative manner and to keep organizing more people and building autonomous institutions that can support a left government when it needs to confront the old structures. Finally, some have a clear understanding that they are experimenting with new ways of organizing and relating collectively, which may serve as a basis for dual power or even a post-capitalist society. This is perhaps one of the Greek left’s most interesting experiences: not only are solidarity structures not understood as “charity,” but also not as “socialist islands” in a capitalist context — there is a felt need to connect to broader political organization capable of contesting for state power. These structures were crucial in Syriza’s base of local support, and will prove critical to supporting the government if it comes under sharp attack.\nThe Masters of Symbolism From day one, Syriza’s government has undertaken a series of symbolic actions. To those on the Left used to seeing neoliberal policies obfuscated by optics, this might all seem very shallow. However, these actions are central to winning hegemony, because they are deeply connected to a very concrete political program. To start with, Prime Minister Alexis Tsipras swore on the Constitution and not the Bible when taking his governmental vows. The first time in Greek history with such an oath, it is connected to a political program that intends to diminish the economic and political importance of the church. For his first act as prime minister, Tsipras visited the monument to the communist resistance against fascism. This also has a very concrete meaning: it reclaims history from the KKE and reframes anti-fascism as the heritage of the Greek left as a whole. It is also a clear stand against ascendant fascism in Greece: by honoring the ones who fought against it in the past, they are communicating that they will be the ones continuing the struggle. The first morning Syriza took power, the government also removed the fences that stood in front of the parliamentary building. The bars had been placed there to “protect” the parliament from demonstrations. This symbolic act stems from a concrete political proposal: the rescuing of the parliament from the troika, as well as the intention to deepen the structures of democracy. Another very important act was the rehiring of Finance Ministry cleaners, who had been camping outside the ministry building in protest for more than nineteen months. Syriza’s success is clearly contingent on the support of the majority of the population. But this support can only be won by implementing tangible measures while also dislodging the prevailing “common sense.”", "url": "https://www.jacobinmag.com/2015/02/syriza-first-days-coalition-government/"}