{"authors": ["Pepijn Brandon", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:28", "date_modify": "2020-05-04 19:53:28", "date_publish": "2015-02-17 00:00:00", "description": null, "filename": "2015_02__1588622008.html", "image_url": "https://images.jacobinmag.com/2015/02/17002939/9440942299_4dbd2a4db2_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_02__1588622008.html", "title": "The Trouble with Dijsselbloem", "title_page": "The Trouble with Dijsselbloem", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Ever since his infamous half-handshake with Greek Finance Minister Yanis Varoufakis, Jeroen Dijsselbloem, the Dutch finance minister and temporary chair of the Eurogroup, has been the target of justified scorn. But with the Greek government blackmailed into submission yesterday, he is now enjoying his finest moment.\nInternationally, Dijsselbloem has become the subject of endless jokes and cartoons, in which he is either portrayed as the colorless bureaucrat in suit and tie being schooled by his stylish and intelligent Greek counterpart or, alternately, as Germany’s whip. But one question remains unanswered amid the power game between Greece’s left-wing government and the European Union’s neoliberal hardliners: why does Dijsselbloem take this so personally?\nInsignificant as this is from a psychological point of view, it does matter in terms of the clash of interests at the heart of the EU, as well as in the developing struggle for the soul of the European left.\nDijsselbloem’s entire political career marks him as a typical representative of right-wing social democracy. He joined the Dutch Labour Party in 1985, the same year that he graduated from high school. It was the last year the party was headed by Joop den Uyl, the iconic Labour leader who twice attempted and failed to ride out a coalition government with the Christian Democrats while maintaining the party’s left-wing course.\nOne year later, right-wing trade union leader Wim Kok took over. Kok was the architect of the labor movement’s historic capitulation, which laid the foundations for a quarter of a century of “social peace” accompanying the dismantling of what was once a showcase welfare state.\nKok became a poster boy for the Third Way, and the Dutch “polder model” of cooperation between party officials, trade unions, and employers was hailed by Bill Clinton and Tony Blair as the model of the future. During the 1990s, he headed two neoliberal governments that oversaw large-scale privatizations and severe social cutbacks. After stepping down as prime minister in 2002, Kok became a powerful figure in the Dutch business world, holding commissariats of Royal Dutch Shell, the ING bank, the privatized TNT-Post, and numerous other companies.\nThis is the Labour Party that Dijsselbloem was unreservedly in and of. Never in his career did he hold significant positions outside that narrow world, the Hague, and Brussels bureaucracy. His long, loyal, and uneventful path through compromise politics and neoliberal micro-management were the perfect preparation for his position as finance minister in the current coalition government, in which the Labour Party is the junior partner of the avidly free-market People’s Party for Freedom and Democracy.\nDijsselbloem’s unstinting devotion to the bureaucratic apparatus has gotten him into legal trouble. Contravening a direct court order, Dijsselbloem refused to reveal the name of the person with whom his predecessor made a shady tax-deal. In a highly atypical public-private partnership, an anonymous informer helped track down tax evaders in exchange for a share in the returns. For giving protection to this informer and the officials who made the deal with him, Dijsselbloem last November saw criminal charges brought against him — almost unprecedented for a Dutch minister.\nAs president of the Eurogroup, Dijsselbloem has been accused of protecting German interests. Given the leading role of Germany in enforcing the troika’s dictates and the strong economic and political ties between the Hague and Berlin, there is little doubt where Dijsselbloem’s loyalties lie. However, it is interesting to note that German EU representatives have expressed some worries that Dijsselbloem is still too strongly tied to Dutch interests. Hardly reassuring these critics, Dijsselbloem answered in the Dutch press by stating that in his view, Dutch interests are EU interests.\nThese are relatively minor diplomatic skirmishes in a German-Dutch relationship that is clearly harmonious on the whole. However, in understanding Dijsselbloem’s hardline position, it is important to note that there does indeed exist a specifically Dutch interest that he represents next to, and in support of, the German demands.\nAs one of the original six members of the European Coal and Steel Community, the EU’s predecessor, the Netherlands has always been a small but driving force behind European economic integration. If anything, its economic interest in the continued expansion of the EU has grown rather than diminished. The Netherlands is the second largest exporter in the EU, and more than 50 percent of its exports and re-exports remain in the EU.\nSignificantly, the twelve EU countries that have entered the union since 2004 form the fastest growing export markets for Dutch manufactural products. Furthermore, the Dutch continue to play an important international role in banking and financial intermediation — including vis-à-vis Greece. In 2011, the Dutch Central Planning Bureau estimated that the Dutch were responsible for 5 to 9 percent of bilateral loans to Greece. Major Dutch banks, primarily ING, held a further 3 billion euros in Greek obligations. Dijsselbloem, then, doesn’t merely represent German extortionist policies towards Greece, but homegrown commercial and financial interests as well.\nAll of this helps explain the eagerness with which Dijselbloem has taken up the whip. But it does not answer the question why he is so extremely sour about it. In comparison, Germany’s Wolfgang Schäuble personifies the extreme arrogance and self-assuredness of power, while IMF chief Christine Lagarde seemingly without effort plays the role of a shark with a smile.\nCheap psychological explanations abound. Here is a young and uptight MA in economics facing someone who could easily have been the relaxed, intellectually superior and annoyingly popular college professor handing him back a meager paper with a condescending smile.\nBut there is another dimension to this, more political and important for the future of the Left in Europe and the Netherlands. The promise of the Syriza government represents everything that postwar social democracy no longer is, and cannot return to. Underlying Dijsselbloem’s career is the perspective that at best, contemporary progressive politics can only be a variant of conservative politics with slightly more scruples.\nAs long as he remains defiant, and despite the limitations of his government’s agenda, Varoufakis represents an alternative to this position. The European right will detest this with unvarnished brutality. But it is mainstream social democracy that will feel the electoral repercussions most directly, and therefore is most bitter in its response.\nFor Dijsselbloem, extinguishing Syriza’s promise is imperative. It is a precondition for restoring the stability of the EU that he, his party, and economic elites so desire. But it is as necessary for the continuation of the dreamless, managerial, suit-and-tie progressivism from which he has never strayed.", "url": "https://www.jacobinmag.com/2015/02/eurogroup-jeroen-dijsellbloem-dutch-finance/"}