{"authors": ["Por Malcolm Ritter"], "date_download": "2020-05-04 20:04:42", "date_modify": "2020-05-04 20:04:42", "date_publish": "2015-11-30 22:19:55", "description": "NUEVA YORK (AP) — ¿Los cerebros del hombre y la mujer en verdad son distintos? No si uno observa la estructura general, de acuerdo a un nuevo estudio. Aunque partes específicas muestran...", "filename": "_ad855865fbea423997e523343b765fe4_1588622682.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2d045f63519d4220b6ba38e8ba7faf2f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ad855865fbea423997e523343b765fe4_1588622682.html", "title": "No hay distinción válida entre cerebro masculino y femenino", "title_page": "No hay distinción válida entre cerebro masculino y femenino", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nNo hay distinción válida entre cerebro masculino y femenino\nEn esta imagen del 26 de noviembre de 2014 se observa un tomógrafo que fue utilizado en la Universidad Carnegie Mellon de Pittsburgh para un experimento de rastrear datos del cerebro. Hombres y mujeres pueden lucir muy diferentes, pero un nuevo estudio señala que sus cerebros no se pueden dividir de una manera clara entre masculino y femenino. Partes específicas del cerebro muestran diferencias anatómicas, pero rara vez indican el género de una persona, de acuerdo a los investigadores. (Foto AP/Keith Srakocic, Archivo)\nEn esta imagen del 26 de noviembre de 2014 se observa un tomógrafo que fue utilizado en la Universidad Carnegie Mellon de Pittsburgh para un experimento de rastrear datos del cerebro. Hombres y mujeres pueden lucir muy diferentes, pero un nuevo estudio señala que sus cerebros no se pueden dividir de una manera clara entre masculino y femenino. Partes específicas del cerebro muestran diferencias anatómicas, pero rara vez indican el género de una persona, de acuerdo a los investigadores. (Foto AP/Keith Srakocic, Archivo)\nNUEVA YORK (AP) — ¿Los cerebros del hombre y la mujer en verdad son distintos? No si uno observa la estructura general, de acuerdo a un nuevo estudio.\nAunque partes específicas muestran diferencias de género, un cerebro individual rara vez cuenta con todos los rasgos “masculinos” o “femeninos”, según el reporte de los investigadores.\nEs como una mezcla: Algunas cosas son más comunes entre las mujeres, otras entre los hombres y a veces coinciden en ambos.\nEso contraviene la idea de que los cerebros se pueden dividir claramente en dos categorías de género, concluyeron Daphna Joel, de la Universidad de Tel-Aviv, y los coautores del estudio publicado el lunes en Proceedings of the National Academy of Sciences.\nUtilizaron tomografías de más de 1.400 cerebros y se enfocaron más en su anatomía que en su funcionamiento. Asignaron puntuaciones a los rasgos variables como grosor del tejido o el volumen de las distintas partes del cerebro. Se enfocaron en las características que mostraban mayores diferencias por género, y dividieron las puntuaciones en: zona predominantemente masculina, zona predominantemente femenina y un rango intermedio.\nLa pregunta clave: ¿Qué tan a menudo un órgano encajó en solo una de esas tres zonas? La respuesta fue: En menos del 6% de los cerebros sometidos a un análisis de una serie de datos. Fue mucho más común que un individuo encajara tanto en la zona masculina y femenina que dentro de un solo género.\nLos investigadores también utilizaron un proceso similar para analizar valoraciones psicológicas y de comportamiento de dos estudios previos, que incluyeron a más de 5.000 participantes, y nuevamente obtuvieron resultados similares.\nEn general, los resultados demuestran “que los cerebros humanos no pertenecen a una de dos categorías distintas”, masculina y femenina, concluyeron los investigadores.\nLarry Cahill, neurocientífico de la Universidad de California en Irvine y quien no participó en el nuevo estudio, estuvo de acuerdo en que los cerebros contienen varias mezclas de rasgos femeninos y masculinos. Pero eso no descarta las diferencias en cómo trabajan los cerebros de ambos sexos, subrayó.\nHay “una montaña de evidencias que demuestran la importancia de la influencia sexual en todos los niveles de la función neuronal de los mamíferos”, indicó.\nEl estudio demuestra lo mucho que debe importar el género, “aunque no tengamos claro el cómo”, dijo vía correo electrónico.\n___\nJournal: http://www.pnas.org\n___\nMalcolm Ritter está en Twitter como: http://twitter.com/malcolmritter Su trabajo se encuentra en: http://bigstory.ap.org/content/malcolm-ritter", "url": "https://apnews.com/ad855865fbea423997e523343b765fe4"}