{"authors": ["Por Lynne O'Donnell Y Asif Shahzad"], "date_download": "2020-05-04 20:14:12", "date_modify": "2020-05-04 20:14:12", "date_publish": "2015-01-17 17:26:10", "description": "SHORABAK, Afganistán (AP) — Afganistán y Pakistán, dominios de al-Qaida y del Talibán donde Estados Unidos libra la guerra más prolongada de su historia, encaran una nueva amenaza por la rápida...", "filename": "_4733aa8dc3774ceeb0b1d41f1d496b7b_1588623252.html", "image_url": "https://storage.googleapis.com/afs-prod/media/20122ea6f287487b90bba92c62763237/2848.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4733aa8dc3774ceeb0b1d41f1d496b7b_1588623252.html", "title": "Estado Islámico le apunta a Afganistán y Pakistán", "title_page": "Estado Islámico le apunta a Afganistán y Pakistán", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nFotografía de archivo del 5 de agosto de 2012, de talibanes paquistaníes patrullando la zona de Shawal en Waziristán del Sur. Una carta escrita en octubre por el gobierno paquistaní, cuya copia fue obtenida por The Associated Press, advirtió a los funcionarios de país que el grupo Estado Islámico ha comenzado a cortejar a los milicianos en el noroeste de Pakistán. (Foto AP/Ishtiaq Mahsud, Archivo)\nFotografía de archivo del 5 de agosto de 2012, de talibanes paquistaníes patrullando la zona de Shawal en Waziristán del Sur. Una carta escrita en octubre por el gobierno paquistaní, cuya copia fue obtenida por The Associated Press, advirtió a los funcionarios de país que el grupo Estado Islámico ha comenzado a cortejar a los milicianos en el noroeste de Pakistán. (Foto AP/Ishtiaq Mahsud, Archivo)\nSHORABAK, Afganistán (AP) — Afganistán y Pakistán, dominios de al-Qaida y del Talibán donde Estados Unidos libra la guerra más prolongada de su historia, encaran una nueva amenaza por la rápida expansión de la organización Estado Islámico, que ya controla un tercio de Siria y de Irak, según dijeron funcionarios a la Associated Press.\nExtremistas desencantados con el Talibán y otras agrupaciones, impresionados con los territorios conquistados por el Estado Islámico y por su refinada campaña publicitaria en las redes sociales, comenzaron a izar su bandera negra en regiones de ambas naciones controladas por extremistas.\nEn Pakistán, un video que circula en la red muestra supuestos combatientes decapitando un hombre al tiempo que juran lealtad al Estado Islámico. En Afganistán han circulado informes de rivalidades entre distintos grupos armados y de enfrentamientos entre elementos del Talibán y del Estado Islámico.\nAnalistas y funcionarios dicen que la cantidad de partidarios del EI que hay en Afganistán y Pakistán es reducida y que la organización es muy resistida por milicianos con fuertes lazos tribales. Sin embargo, la presencia incluso de una cantidad pequeña de elementos leales al Estado Islámico podría desestabilizar aún más la zona y complicar los esfuerzos por poner fin a una guerra que ya dura 13 años.\nEl Talibán sigue siendo la fuerza insurgente dominante, con casi 20 años de experiencia combatiendo a caudillos afganos y fuerzas multinacionales, pero “no tiene una ideología o una fuerza militar particularmente llamativas y se expone a quedar pasado de moda”, opinó un diplomático occidental que pidió no ser identificado porque estaba hablando de asuntos de inteligencia.\n“Los jóvenes afganos bien podrían verse atraídos por las tácticas más extremas y la pomposa publicidad de EI”, sostuvo. “Pueden encontrarlo atractivo o el Talibán puede sentir la necesidad de competir, radicalizándose y cometiendo acciones horrendas como hace EI”.\nEl Estado Islámico controla un tercio de Siria y de Irak, donde declaró un califato gobernado por una severa interpretación de la ley islámica, o sharia, y exigió lealtad al mundo musulmán. El Talibán, en contraste, opera solo en Afganistán y Pakistán y algunos líderes se mostraron proclives a entablar negociaciones de paz.\nPequeños grupos armados de Libia, Egipto y el Líbano juraron lealtad al líder de EI Abu Bakr al-Baghdadi, autoproclamado califa, y algunos describen los territorios que controlan como provincias del califato.\nEn la provincia afgana sureña de Helmand los residentes dicen que un ex comandante talibán llamado mulá Abdul Rauf está reclutando combatientes para el EI.\n“La gente dice que izó banderas negras y trató incluso de sacar las banderas blancas del Talibán en algunas zonas”, comentó Saifullah Sanginwal, líder tribal del distrito de Sangin. “Hay versiones de que 19 o 20 personas murieron” en combates entre el Talibán y el EI, agregó.\nEl ministro del interior de Pakistán Chaudhry Nisar Alí Khan dijo en noviembre que no había elementos del EI en su país, sino algunos combatientes que usaban su nombre. Sin embargo, una carta del gobierno escrita un mes antes y de la cual The Associated Press consiguió una copia decía que el EI estaba buscando apoyo y afirmaba contar ya con “12.000 simpatizantes” en el noroeste de Pakistán.\nUn video distribuido en diciembre muestra estudiantes y profesores de la Mezquita Roja de Islamabad sentados bajo una bandera del EI, jurando lealtad a al-Baghdadi mientras el clérigo Maulana Abdul Aziz la daba la bienvenida al grupo. La semana pasada, otro video distribuido por el EI mostraba a un ex vocero del Talibán en Pakistán jurando lealtad a esa agrupación junto con una decena de militantes y luego decapitando a un hombre identificado como un soldado.\nEl Instituto Pak para Estudios de la Paz, con sede en Islamabad y que sigue los pasos de los distintos grupos armados, dijo en un informe que el EI era “una amenaza real y cada vez mayor para Pakistán”.\n“Compromete la subsistencia de los principales actores militares, que ahora tienen que demostrar su capacidad operativa”, señala el informe.\nLos militantes del Talibán de Afganistán y Pakistán son leales al mulá Omar, un clérigo que lidera esa fuerza desde los años 90 pero que no es visto en público desde hace años. Las autoridades temen que una penetración del EI en la región traería aparejada la llegada de armas y dinero, desencadenando una brutal competencia entre bandas locales desencantadas con el silencio del mulá Omar y deseosas de probar lo que valen cometiendo atrocidades.\nAl EI, no obstante, le costará montar un desafío real al talibán, que está muy enraizado en la sociedad tribal pashtún, de acuerdo con Borhan Osman, investigador de la Red de Analistas de Afganistán.\nPero ahora que las fuerzas de la OTAN y Estados Unidos se dedican a entrenar a los afganos y no se enfrascan en combates, hay quienes creen que el EI puede ganar terreno y pasar a ser una verdadera amenaza en el futuro.\n“Debemos ser muy cuidadosos”, afirmó Nasir Khan Durrani, jefe de la policía de la provincia paquistaní de Khyber Pakhtunkhwa, fronteriza con la región tribal que es bastión de los alzados en armas. “Muy cuidadosos”.\n___\nLos periodistas de The Associated Press Rahim Faiez (en Kabul), Mirwais Khan (Kandahar, Afganistán), Riaz Khan (Peshawar, Pakistán), Abdul Sattar (Quetta, Pakistán), Adil Jawad (Karachi, Pakistán), Ishtiaq Mahsud (Dera Ismail Khan, Pakistán), Zaheer Babar (Lahore, Pakistán) y Matthew Lee (Islamabad) colaboraron para este reportaje\n___\nShahzad informó desde Peshawar, Pakistán\nLynne O’Donnell está en Twitter como: www.twitter.com/lynnekodonnell\nAsif Shahzad está en Twitter como: www.twitter.com/asiffshahzad", "url": "https://apnews.com/4733aa8dc3774ceeb0b1d41f1d496b7b"}