{"authors": ["Heather Cox Richardson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:40", "date_modify": "2020-05-04 19:50:40", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08_racism-reconstruction-homestead-act-black-suffrage_1588621840.html", "image_url": "https://images.jacobinmag.com/2015/08/17004858/richardson-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08_racism-reconstruction-homestead-act-black-suffrage_1588621840.html", "title": "Killing Reconstruction", "title_page": "Killing Reconstruction", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nNorthern victory in the Civil War was supposed to usher in a new nation. The slaughter of hundreds of thousands on the battlefields did not simply end slavery in America, it also created a new kind of national government designed to promote economic opportunity for everyone. As Northerners struggled to fight and fund a war of unprecedented magnitude, they replaced a prewar system run by a handful of wealthy Southern slaveholders with a government “of the people, by the people, and for the people.” That new, popular government took firm root in the country after the war, as citizenship was extended and all men got the right to vote. Between 1860 and 1870, it seemed, a Second American Revolution had finally aligned the Constitution with the promise of the Declaration of Independence that all men were created equal. It didn’t last. A year after the ratification of the Fifteenth Amendment, many soured on the idea of popular government. They looked to the South, where an observer warned that a “proletariat Parliament” dominated by black men was ruining South Carolina, and to the North, where the rising power of workers made a popular magazine snarl that “the interference of ignorant labor with politics is dangerous to society.” They concluded that not everyone should have a say in government. With this ideological shift, things changed fast. In 1875, the Supreme Court suggested that citizens could be denied voting rights so long as discrimination was not based on race. The next year, white voters took back the South. Lincoln’s vision of a government of the people, by the people, and for the people had lasted only about a decade. The usual story of Reconstruction blames its failure on the racism of Southern whites, helped by accidental President Andrew Johnson. But Confederates did not control national politics; their stock was too low after losing a war that had killed more than 600,000 Americans and cost more than $6 billion to control anything. Northerners controlled national politics. Reconstruction failed not because Southern whites opposed it — although most of them did — but because Northerners abandoned it. They came to believe that antebellum slaveholders were right in one important way: they had warned that poor workers must not be allowed to vote because, given the chance, they would insist on a redistribution of wealth. Northerners in 1861 began a four-year crusade to remake the American government so that wealthy men would not dominate it. They poured out their blood and sacrificed their brothers for that cause. Ten years later, that course would be reversed. America depended not on human equality, they came to think, but rather on what slaveholders had always said: the protection of property. The story of this momentous change depended on a strange twist of politics that brought together a coup in Paris, industrialization in New York City, and black suffrage in South Carolina in the year before a presidential election. Those three seemingly disparate events came together in a toxic mix that linked antisocialism and racism in American thought so tightly that they have never come undone.\nThe Threat from Below From March through May 1871, workers in Paris established a commune. This relatively minor development in world affairs became headline news in America because in 1866, after years of failure, entrepreneurs had finally completed a transatlantic telegraph cable that linked America to Europe. The Franco-Prussian War of 1870–71 had provided sensational copy to feed a nation hungry for exciting news after its own war. With the end of that conflict, editors turned to scenes from the Commune to fill their columns. They reported lurid stories of the Commune as a nightmare, a “wild, reckless, irresponsible, murderous mobocracy.” Workers in Paris had taken over the government and were confiscating all money, factories, and land. Their plan was to redistribute wealth from men of means to themselves. The Philadelphia Inquirer claimed that the “Communists of Paris” were operating with the “communistic idea ‘that property is robbery.’” In that, they were echoing the International Workingmen’s Association, which, the Boston Evening Transcript warned, was made up of “agrarians, levelers, revolutionaries, inciters or anarchy, and . . . promoters of indiscriminate pillage and murder.” During the Civil War, when American workers were laying down their lives to protect the nation, few Northerners would have believed that the working class would deliberately destroy society. Indeed, wartime Republicans thought that workers were key to a healthy economy, and they deliberately remade the government during the war to respond to the needs of those they believed were central to the Union cause. Pushing aside the Plains Indians, Republicans passed the Homestead Act to put every man on his own farm; they created public colleges and the Department of Agriculture to make sure poor farmers had access to the newest ideas. They funded a transcontinental railroad to take settlers to the Western fields and mines. Finally, they passed the Thirteenth Amendment to the Constitution, abolishing slavery. Republicans believed they were bolstering the economy by guaranteeing every man a chance to rise and “contribute to the greatness and glory of the Republic.” “What is beneficial to the people cannot be detrimental to the Government; for in this country the interests of both are identical,” said Illinois Republican Owen Lovejoy. “With us the Government is simply an agency through which the people act for their own benefit.” Schools and the Department of Agriculture would “increase the prosperity of agriculture, manufactures, and commerce.” The upfront costs would be “richly paid over and over again in absolute increase of wealth. There is no doubt of that,” insisted notorious budget hawk William Pitt Fessenden. When Northern Democrats howled in horror at the racial equality established by the Thirteenth Amendment, Republican James Ashley of Ohio retorted that their free labor would make America “the most powerful and populous, the most enterprising and wealthy nation in the world.” Only six years later, Republicans were willing to entertain the idea that, far from being the heart of America, workers were dangerous levelers. Far from advancing their interests, the government must be protected from their influence.\nIt Can Happen Here This about-face had its roots in the economic developments of the war years. The Civil War created a business boom in the North as industries met military needs. Congress passed high tariffs to protect domestic industry from foreign competition, recognizing that industry would need nurturing to enable it to bear the new manufacturing taxes Congress imposed. By the end of the war, thriving businesses produced iron, railroads, shovels, horseshoes, buttons, rain slickers, and every other thing soldiers or their families needed. But the boom did not spread prosperity to industrial workers. There was little labor agitation during the war as the drain of men to the battlefields kept unemployment low, but wages did not keep up with inflation. At the same time, government contracts poured tax dollars into the coffers of industrialists and financiers. As soon as the war was over, workers organized to demand that Congress level the economic playing field. As workers began to organize, growing industries brought immigrants to New York City, where they tended to vote for Democrats. New York State was Republican, but control of the city determined which way the state would swing in national elections. New York had far more electoral votes than any other state, giving its largest municipality special importance in national politics. In 1870, New York as a whole had swung into the Democratic column, which did not bode well for Republicans hoping to maintain control of the White House in 1872. So in 1871, furious that New York City workers, and immigrants at that, threatened their control of national politics, Republicans warned that what was happening in Paris could just as easily happen in America. Indeed, maybe it was already happening. The First International had established headquarters in the city in 1867, where they were fomenting disturbances, Republicans warned. They were at war against capital and property, and would force anyone who owned anything to divide it with those who had nothing. In their eyes, every small farmer was a member of the “landed aristocracy,” who should be forced to share his wealth. This philosophy would only appeal to poor, lazy, vicious men, who would rather steal from the nation’s small farmers and mechanics than work themselves. In April 1871 the New York Times noted that the very extravagances and horrible crimes of the Parisian Communists will, for some years, weaken the influence of the working classes in all countries. The great ‘middle-class,’ which now governs the world, will everywhere be terrified at these terrible outburst[s] and absurd[ities], they will hold a strong rein on the lower.\nThe Johnson Counterrevolution Southern Democrats had fought viciously against Republican Reconstruction measures, but Northerners ignored their racist howling. Republican attacks on workers in 1871 gave Southerners a powerful new weapon. Immediately after the war, white Southerners did all they could to reinstate racial dominance. They resurrected the prewar world of white supremacy, passing what became known as “Black Codes,” a series of laws that kept black Southerners in a state as close to slavery as the Thirteenth Amendment would permit. In Mississippi, courts could “apprentice” black children to white masters, and black men could be arrested, fined, and then “hired out” to anyone who paid their fines. Most states sentenced “vagrants” to forced labor, and the punishment for breaking the law was the lash, the chain gang, or a fine that required a prisoner to work for the man who paid it. Nowhere could a black person testify against a white person. Republicans refused to accept a “reconstruction” that remanded loyal black Unionists to quasi-slavery under the same men who had been fighting to destroy the Union less than a year before. They refused to seat the newly elected Southern congressmen. Then, while a committee hashed out a congressional plan for Reconstruction, Congress tried to spread equality to the South. In 1866, it expanded the scope of the Freedmen’s Bureau to enable it to buy land to put impoverished black and white Southerners onto homesteads and to get the education that they so sorely lacked. Republicans did not limit the operation of the measure to the Confederate states. They included the black and poor white populations in the border states, as well. Congress also provided for federal courts in states where African Americans could not testify or sit on juries. Republicans considered these relatively uncontroversial measures, designed to integrate the South into the national free-labor economy with the same sort of government programs that Republicans had advanced so successfully in the wartime Union. But they faced the resistance of Andrew Johnson. He vetoed the bills. In his veto messages, the president tied racism to fears of a dangerous underclass and hatred of the new federal taxes the Republicans had created during the war. Johnson offered a way for racists to oppose black rights by using a new, apparently principled, language about small government. Johnson enlisted traditional Southern racism to attack the argument that government should help poor men rise. Ignoring the benefits for white Southerners, he claimed the measures would simply give a handout to lazy blacks, paid for by hardworking white men. Homestead and education legislation was far beyond the scope of the government’s authority, he said. Congress had “never deemed itself authorized to expend the public money for the rent or purchase of homes for the thousands, not to say millions, of the white race who are honestly toiling from day to day for their subsistence.” He also claimed that the government “has never founded schools for any class of our own people.” While these statements were technically true, since the government had acquired by treaty the land distributed under the Homestead Act and the Land-Grant College Act provided means for states to establish colleges rather than providing federal schools, they threw a racist slur onto Republicans’ government activism. Johnson then undermined the argument that homesteads and education benefited the entire country. The homestead provisions of the new bill were simply a “system for the support of indigent persons,” he insisted. Why, he asked in a rhetorical question that misrepresented the bill, should the government provide homes for ex-slaves, when it had never done so for white men? Freedmen should work hard to succeed, not look for handouts. Johnson tied racism and fears of class warfare to the new national taxes imposed during the war. Republicans were using tax money to create an army of loyal bureaucrats that would suck the nation’s new taxpayers dry, Johnson said. The new requirements for federal courts and the “Freedmen’s Bureau” would cost more than $23 million, he insisted, and would create “an immense patronage,” including agents and officers and clerks, all funded by tax dollars. Johnson’s veto message laid out the argument that has dogged American politics ever since: that government activism means special help for black people paid for by hardworking white taxpayers.\nDivide and Rule This was the formula Southern white Democrats adopted in 1871. When Republicans began to attack Northern workers, Southern Democrats abandoned overtly racist arguments and instead began to insist that ex-slaves were forcing communism on the South. The Fifteenth Amendment established black male suffrage in 1870, and South Carolina had a black majority. This meant that white South Carolinians could argue that their state provided a perfect illustration of workers plundering the wealthy through the ballot box. Before the Civil War, wealthy white Southerners had explicitly warned Northerners that letting poor workers vote would destroy society. Slave owners argued that a society’s workers were strong and loyal, but they were also stupid, and must be kept down. Like logs driven into the ground to form the foundation of a house, these people were the “mudsill” of society, performing its menial labor. Their work supported the small, refined upper class, which led progress and civilization. Maintaining this system depended on keeping government in the hands of society’s best men. If members of the mudsill were allowed a say, they would demand policies that put more of the fruits of their labor into their own pockets. Allowing the mudsill to vote would mean an active government that would redistribute wealth. They would divert money to themselves and fritter it away, rather than permitting rich men to accumulate the fortunes that would enable them to improve society. Human progress would stop. Southern whites had achieved an ideal “harmony of . . . political and social institutions,” as a South Carolina senator said, by enslaving its mudsill according to race. The North, in contrast, made the grave error of letting its mudsill vote. Poor voters were fledgling revolutionaries. When Republicans guaranteed the suffrage to black men, they enabled Democrats to recall the planters’ argument that letting the “mudsill” vote would force a redistribution of wealth. Republican politicians would court black voters by promising policies that gave jobs and services to blacks, the argument went. Ex-slaves would do anything to get out of low-paying field work, so unproductive but highly paid government jobs would replace the actual production the South so desperately needed. A leading Democratic newspaper in New York claimed there would soon be “negro governors, negro mayors of cities, and negro occupants of every grade of office State and municipal.” What would fund such extravagance? Tax dollars paid by hardworking white men. This system would “corrupt” government, as those without property spent other people’s money. And since poor African Americans would not have to pay the taxes they levied, their governments would be “among the most wasteful and corrupt that ever existed.” Black governments would “perpetuate robbery,” making “extravagant expenditures” for roads, schools, hospitals, asylums, and other public institutions. Taxes would carry away the wealth of laborers, who would be ground into poverty. An active government would mean the nation’s hard workers would become slaves to unproductive, lazy African Americans. This was precisely the argument that white South Carolinians developed in 1871. The South Carolina legislature had a black majority. In reality, African-American legislators tended to vote in favor of propertied interests rather than workers, but white observers insisted they were radical levelers. To rebuild the shattered state, the legislature levied new taxes. But while taxes in South Carolina had fallen disproportionately on professionals, bankers, and merchants before the war, the new legislature placed taxes on land, making large landowners pay new, large tax bills. The same legislature also used state funds to buy land to sell to settlers — usually freedmen — at low prices. South Carolina Democrats railed in racist agony against the “crow-congress,” the “monkey-show,” but they also interpreted the new tax through a class lens. One observer commented that, with prominent white South Carolinians disenfranchised and black men voting, “a proletariat Parliament has been constituted, the like of which could not be produced under the widest suffrage in any part of the world save in some of these Southern States.” When the South Carolina government began to collect the new tax, a “Tax-payers’ Convention” insisted that workers were confiscating property. Northern Republicans who were unwilling to entertain the racist arguments of Southern whites picked up this new class argument. The New York Tribune explained that white South Carolinians trying to overthrow the black majority in the state were not racists; they were anticommunists. The problem in South Carolina was that African Americans were taking wealth away from hardworking white South Carolinians and redistributing it to “ignorant, superstitious, semi-barbarians,” who were “extremely indolent, and will make no exertion beyond what is necessary to obtain food enough to satisfy their hunger.” Ignoring the very real needs of a state rebuilding from a war that had destroyed its cities, fields, and people, the New York Tribune reported that the tax robbed property owners to support the “Nigger Government.” Explicitly, the New York Tribune compared ex-slaves to the Paris Communards. It ran an interview with Georgia Democrat Robert Toombs, a former slaveholder who had been a staunch secessionist and served as the first Confederate secretary of state. He explained that a mob was “the most dangerous class in the world to be trusted with any of the powers of government.” Unless voting was limited to men of property, “the lower classes . . . the dangerous, irresponsible element” would control government and “attack the interests of the landed proprietors.” According to Toombs: “Only those who owned the country should govern it, and men who had no property had no right to make laws for property-holders.” In the end, the Taxpayer’s Convention called only for the South Carolina government to trim its budget, but the convention’s work reached far beyond that lackluster end. White Southerners had managed to turn their racial animosities into an economic argument acceptable to northern Republicans. Republicans continued to link class and racial animosities. What was happening in South Carolina was just like what was going on in New York, they warned. Both were being ruled by “irresponsible non-property-holders.” Taxpayers must stand against the growth of the government, even for good ends, because it inevitably bred waste and corruption. When black men began to vote after the Civil War they had brought socialism to South Carolina.\nBetter Dead Than Red It appeared the nation could share the same fate. The timing of the South Carolina Taxpayer’s Convention spread its language widely across the North. In the next year’s presidential election, pro-Grant and anti-Grant factions fought for control of the Republican Party. Anti-Grant forces used the language of the convention to attack the Reconstruction governments that Grant supported in the Southern states. In Republican as well as Democratic newspapers, story after story repeated the idea that the Southern governments were corrupt, that lazy black legislators were using government contracts to funnel the wealth of white taxpayers to poor ex-slaves. When the economy crashed in 1873, Northern “reformers” were primed to attack “socialism” across the country. E. L. Godkin, the editor of the Nation, explained that African Americans were “but slightly above the level of animals,” and were plundering property holders. “The sum and substance of it all is confiscation,” he said. In the North, he went on, taxpayers had to beg for relief from those imitating South Carolina, and making “socialism in America the dangerous, deadly poison it is.” It was not taxation people opposed, an author wrote in Scribner’s Monthly , but rather “unjust, tyrannical, arbitrary, overwhelming taxation, producing revenues which never get any further than the already bursting pockets of knaves and dupes.” In 1875, the Supreme Court offered a way to guard America from this creeping socialism. In Minor v. Happersett , it ruled that citizenship did not necessarily guarantee voting. This opened the door for restrictions based on qualifications other than race, which was prohibited under the Fifteenth Amendment. In the election of 1876, whites took back the South. In 1880, the former Confederacy voted solidly Democratic. By 1890, the trend in America was to keep the vote from workers, immigrants, and people of color, even as white middle-class women won it at the state level. A push in 1889 to protect black voting and establish federal funding for schools created a backlash as people conjured up images of Reconstruction as an era when “a large mass of ignorant voters” had taken over government and “ruined” the South. “White voters, as a class, are the more intelligent, masterful, and powerful, and they are the property owners,” Harper’s Weekly noted. Black men simply wanted to confiscate white tax dollars. Southern whites appealed to “the business men of the North” to keep lazy black men from voting and imperiling “not only the properties of Southern, but of Northern men also — railroad stocks, state bonds, city bonds, county bonds, mining and manufacturing interests.” In 1890, the New York Times suggested limiting suffrage based on either education or property to keep poor workers from voting. Mississippi did just that. Other Southern states followed suit. Northern states also found ways to restrict voting by immigrants and poor whites. There was one final necessary step to keep poor voters from corrupting government: to reject any government workers and African Americans supported, even if they had won fair and square. In 1898, after a coalition of blacks and white Populists won control of Wilmington, North Carolina’s municipal government, 2,000 of the “best citizens” rioted to take back the city. It was imperative for the “ministers, lawyers, doctors, merchants, railroad officials, cotton exporters, and . . . the reputable, taxpaying, substantial men of the city” to enforce “white supremacy,” they said, because “thriftless, improvident” black men had used their votes to put their coalition into power. Property was not safe, and officials and police officers who had been hired under the coalition in the past were so “incompetent” that “highly esteemed” men and women were assaulted on the streets. In November 1898, a citizens’ council organized, burned a black-owned newspaper office, murdered between fifteen and sixty African Americans, and forced the fairly elected coalition members to resign their offices. One white man declared: “We . . . will never again be ruled by men of African origin.”", "url": "https://www.jacobinmag.com/2015/08/racism-reconstruction-homestead-act-black-suffrage"}