{"authors": ["Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis", "Mímir Kristjánsson"], "date_download": "2020-05-04 19:53:51", "date_modify": "2020-05-04 19:53:51", "date_publish": "2015-02-17 00:00:00", "description": null, "filename": "2016_03__1588622031.html", "image_url": "https://images.jacobinmag.com/2015/02/17002810/Clinton-signing-welfare-reform-1996-AP-1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_03__1588622031.html", "title": "Up From Liberalism", "title_page": "Up From Liberalism", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Decades before Tony Blair and Bill Clinton took power, Anthony Crosland posited another third way.\nCrosland, a British Labour politician, gazed upon the welfare state his party had swiftly built after World War II — the crown jewel of which was the National Health Service — and effectively pronounced socialists’ work complete. Even if further reforms were needed to loosen up Britain’s famously rigid class system, Crosland wrote in 1956, the welfare-state-plus-full-employment mix was so widely accepted that “the Conservatives now fight elections largely on policies which 20 years ago were associated with the Left, and repudiated by the Right.”\nIn this changed environment, Crosland held, socialists should let go of their traditional commitment to socializing the means of production and focus on the present.\nAcross the advanced capitalist world, social-democratic parties took his advice. They spent the postwar decades building up their own countries’ welfare states and using macroeconomic tools to bring about full employment and improve living standards. But, in keeping with Crosland, they didn’t fundamentally challenge private capital’s control over what, how, and where to produce, and for whom to produce it.\nWith few exceptions — the most prominent being the Democratic Party — these center-left formations acted as the electoral agents of a union movement whose power derived from its militancy.\nYet zoom out, and it’s easy to see now that both were still jostling on capital’s terrain. Sure, the postwar consensus was premised on a labor movement sufficiently organized and potentially disruptive enough to make business sweat (so much so that even center-right parties expanded or added new programs to stay electorally viable). But the welfare state couldn’t have sucked up an increasing share of national wealth if the captains of industry hadn’t thought their profits would continue to swell.\nThis is where Crosland’s avowed pragmatism — we must not confuse means with ends, he maintained — revealed its impracticality. When economic crisis began to swirl in the 1970s, the roots of social democracy showed themselves to be rather shallow. Full employment and an ever-more-comprehensive welfare state suddenly conflicted with the imperatives of business to turn a profit. And business still controlled the levers of economic activity.\nIt was a structural dilemma that social democracy could not solve by simply trying to weather the storm. Either the roots had to be plunged deeper, toward a more radical socialism, or the entire thing would tumble.\nAfter fits and starts, capital launched its political response: bust unions, enact deflationary measures, allow unemployment to rise, and roll back the welfare state.\nSocial-democratic parties played a central role in the attack. In some countries, like New Zealand, center-left formations implemented the rollbacks themselves. In most others, they succeeded pivotal conservative governments (like Margaret Thatcher’s), accepted the new order of things, and took their turn privatizing and cutting.\nWith traditional social democracy off the table, Clinton, Blair, and other Third Wayers pushed a new centrist program: reform the bureaucracy and state programs to make them run more like the private sector, abandon full employment to render labor markets slack, weaken ties to organized labor, and move closer to business.\nThe shift wasn’t to a smaller state necessarily, but a different kind of state — one less focused on directly providing social goods and economic security and more interested in using government to create markets and competition where there had been none.\nFor the poor and working classes, the results have been disastrous. Stuck with stagnant wages and an indifferent state, they tried to pad their living standards with consumer debt even as they were more exposed to life’s vagaries.\nMeanwhile, center-left parties were undermining their own basis of support. Workers increasingly stayed at home, seeing little point in voting for or being active in formations that now resembled their center-right foes. The mass struggles that provided the basis for both reformist and revolutionary left politics seemed like a thing of the past.\nRecent years have brought some stirrings of an alternative. The emergence of Jeremy Corbyn represents an unexpected opportunity to fight for socialist ideas within the Labour Party. And in the United States, the popular reception to Bernie Sanders’s presidential campaign shows there is a hunger among many for a politics with substance, a politics in their class interest.\nBoth phenomena — especially Sanders’s bid — are only baby steps in the right direction. We’ll need a more forthright anticapitalist politics to go further. But there is at last hope that Blair and Clinton’s Third Way may suffer the same fate as Crosland’s.", "url": "https://www.jacobinmag.com/2016/03/up-from-liberalism/"}