{"authors": ["Rob Hunter", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:51", "date_modify": "2020-05-04 19:54:51", "date_publish": "2015-04-17 00:00:00", "description": null, "filename": "2015_04_cold-war-soviet-union-west-repression_1588622091.html", "image_url": "https://images.jacobinmag.com/2015/04/17003301/3pmO3G0-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_04_cold-war-soviet-union-west-repression_1588622091.html", "title": "“Worse Regimes”", "title_page": "“Worse Regimes”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Frances Stonor Saunders’s new London Review of Books piece on Marxist historian Eric Hobsbawm’s file at MI5 is well worth reading, but it ends with an odd coda:\nThe two sides in the Cold War, finding each other irresistible, ended up in a contrapuntal relationship where, as George Urban put it, “they marched in negative step, but in step all the same.” They had their spies, we had ours. They had their files, we had ours. True, we didn’t have gulags. But what kind of democracy is it that congratulates itself on not having gulags? Never mind the dragnet surveillance, the burglaries, the smearing of reputations, the bugging of public telephone boxes, cafés, hotels, banks, trade unions, private homes, all this legitimised by the thesis that everyone is a potential subversive until proven otherwise — the problem is that the defenders of the realm took on the symptoms of the disease they were meant to cure.\nSomehow, in other words — and despite adopting similar methods — the West during the Cold War occupied a morally elevated position. Stonor Saunders hints that this is so because the “disease” — an Eastern Bloc with contrary geopolitical goals — antedated its Western “cure.” But the methods of control, surveillance, and repression listed by Stonor Saunders had all been pioneered in the capitalist world.\nShe also suggests a certain (dubious) moral superiority in the absence of gulags in postwar Britain. This is consonant with a tenacious conceit in Cold War history: despite mass internment and near-indiscriminate incarceration in the West in the twentieth century and beyond, only the Soviet Union was to be condemned for such practices. (It is also reminiscent of the persistent trope that the development of capitalism, unlike the development of communism, was free of violence, primitive accumulation, and mass dispossession).\nMass internment in the United States during World War II and the use of concentration camps in the decaying British Empire notwithstanding, only the Soviet Union can come in for opprobrium regarding such practices.\nStonor Saunders’ implicit assertion of a qualitative difference between the security services of two Cold War belligerents is only a recent entry in a long catalog of what might be called “worse regimes” claims, after the following passage from Piers Brendon’s The Decline and Fall of the British Empire, 1781–1997 :\nThroughout their imperial history the British always paid lip service to legality, but by the mid-1950s it was an open secret that Kenya had become a police state that dispensed racist terror. . . . Frequent reports of institutional cruelty reached the outside world, some of them reminiscent of worse regimes. When Kenya’s interrogators “screened” suspects, they generally began by softening them up with “a series of hard blows across the face” — the standard shock tactic used on prisoners in Stalin’s Lubianka. In most cases further beatings followed, some of them fatal. This treatment was variously justified on the grounds that the Mau Mau were subhuman and that it would purge them of political sickness or sin. But those who administered the violence displayed “a strong streak of sadism . . . under the red heat of action.” This was still more evident in further torments to which “screeners” subjected men and women, mostly Kikuyu. These included electric shocks, burnings, near-drownings, mutilations and sexual abuse.\nWhen “a series of hard blows across the face” were administered by the secret police, we are meant to see them as prima facie evidence of the horrors of Stalinism. However, when the same tactic was employed by British security forces in Kenya — and it’s hard not to read “they generally began by” as synonymous with “the standard shock tactic” — we are meant to merely regret the fact that, somehow, the face of state power appeared no different in the British Empire than it did in the Soviet Union.\nThat there should normally have been such a difference is usually taken for granted by writers like Brendon. Strangely, other explanations for the absence of such a difference are rarely considered.", "url": "https://www.jacobinmag.com/2015/04/cold-war-soviet-union-west-repression"}