{"authors": ["Eric Foner", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:31", "date_modify": "2020-05-04 19:52:31", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08__1588621951.html", "image_url": "https://images.jacobinmag.com/2015/08/17004905/foner-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08__1588621951.html", "title": "Struggle and Progress", "title_page": "Struggle and Progress", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Interview by Editors\nNo living historian has done more to shape our understanding of the American Civil War era than Eric Foner. A rare scholar who is both prominent outside the historical community and esteemed within it, over the course of a fifty-year career Foner has acquired virtually every award, tribute, and professional honor available to a historian in the United States.\nYet the true measure of his legacy lies not in accolades but influence. Foner’s most important books have transformed the way we see — and the way we teach — the origins of the Civil War, the significance of slave emancipation, and the politics of postwar Reconstruction.\nFoner grew up in a New York family equally devoted to historical scholarship and left-wing politics. His father, Jack, and his uncle, Philip, both taught history at City College before they were dismissed and blacklisted as Communists.\nFor the elder Foners, a radical approach to US history involved placing the black freedom struggle at center stage. “In the 1930s,” Eric later wrote, “the Communist party was the only predominantly white organization to make fighting racism central to its political program.” It was no coincidence that the family was friendly with W. E. B. Du Bois and Paul Robeson, or that Philip Foner’s five-volume selection of Frederick Douglass’s writings and speeches, which he completed while on the blacklist, was the first collected edition of its kind.\nFoner’s family background has produced occasional clumsy efforts at red-baiting, including a 2002 National Review essay which denounced him as a Soviet sympathizer and “left-wing polemicist.” In reality, Foner’s own contemporary political interventions have generally remained within the American liberal mainstream. Yet it would not be unfair to credit his Old Left upbringing with a major influence on his scholarly career.\nFoner’s first book, Free Soil, Free Labor, and Free Men (1970), which remains the standard work on the rise of the Republican Party, showed how antebellum Republicans were not merely critics of slavery, but exponents of a powerful political-economic ideology of their own. His most celebrated book, Reconstruction (1988), provided a synthesis that decisively rejected the racist folklore that had informed popular and scholarly treatments of the post–Civil War period for much of the twentieth century.\nIn these and other works, a central theme in Foner’s scholarship has been the contested terrain of freedom in American history. (This is no less true of his most recent book, Gateway to Freedom , on the antebellum underground railroad.) The Civil War era, in his view, represented a revolutionary clash of political ideas and forces — a period that unmade and then remade American society. The revolution, of course, remained unfinished — but it was a revolution nonetheless.", "url": "https://www.jacobinmag.com/2015/08/eric-foner-reconstruction-abolitionism-republican-party-lincoln-emancipation/"}