{"authors": ["The Left Platform Of Syriza", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:13", "date_modify": "2020-05-04 19:53:13", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07__1588621993.html", "image_url": "https://images.jacobinmag.com/2015/07/17004536/greece_protest_NO-e1435986306519-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07__1588621993.html", "title": "The Alternative to Austerity", "title_page": "The Alternative to Austerity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The following is an abridged version of the statement submitted by the Left Platform at today’s plenary meeting of Syriza’s parliamentary group.\nIn this critical moment, the Syriza government has no other choice than to reject the blackmail of the “institutions” who seek to impose an austerity program, deregulation, and privatization.\nThe government must declare to the “institutions” and to proclaim to the Greek people that, even at the last moment, without a positive compromise reflected in a program that will end austerity, provide sufficient liquidity to economy, lead to economic recovery, and include major writing-off of the debt, it is ready to follow an alternative progressive path which puts into question the presence of our country in the eurozone, while interrupting debt repayment.\nIn order to confront the pressures and unacceptable demands of the creditors, the process that could lead Greece out of the eurozone is a serious and complex enterprise, which should have been systematically prepared by the government and by Syriza. However, due to the tragic blockages that prevailed both in government and in the party, this has not been achieved.\nNevertheless, even now the government can and must respond to the blackmail of the “institutions” by posing the following alternative: either a program without any further austerity, providing liquidity, and leading to debt cancellation, or exit from the euro and default on the repayment of an unjust and unsustainable debt.\nIf required by the circumstances, the government has, even now, the possibility and the minimum of liquidity that is required to implement a transitional program to the national currency, which will allow it to implement its commitments towards the Greek people, and in particular to adopt the following measures:\nThe radical reorganization of the banking system, its nationalization under social control, and its reorientation towards growth. The complete rejection of fiscal austerity (primary surpluses and balanced budgets) in order to effectively address the humanitarian crisis, cover social needs, reconstruct the social state, and take the economy out of the vicious circle of recession. The implementation of the beginning procedures leading to exit from the euro and to the cancellation of the major part of the debt. There are absolutely manageable choices that can lead to a new economic model oriented towards production, growth, and the change in the social balance of forces to the benefit of the working class and the people.\nThe exit from the eurozone under present conditions is a difficult but feasible process that will allow the country to follow a different path, far away from the unacceptable programs included in the Juncker package.\nWe should emphasize that exiting the euro is not an end in itself, but the first step in a process of social change, of recovery of national sovereignty and of economic progress combining growth and social justice. It is part of an overall strategy based on productive reconstruction, the stimulation of investment, and the reconstitution of the welfare state and the rule of law.\nIn the face of the intransigent behavior of lenders, whose aim is to force the government of Syriza to full surrender, exiting the euro is a politically and ethically fair choice.\nExiting the euro is, finally, a path that includes confrontation with powerful domestic and foreign interests. That’s why the most important factor in addressing the difficulties that arise is the determination of Syriza to implement its program, drawing strength from popular support.\nMore specifically, some of the positive aspects of the exit include:\nRecovery of monetary sovereignty, which automatically means regaining the capacity to provide liquidity to the economy. There is no other way to cut the European Central Bank’s noose on Greece.\nThe elaboration of a development plan based on public investment, which will however also allow in parallel private investment. Greece needs a new and productive relationship between the public and private sectors to enter a path to sustainable development. The realization of this project will become possible once liquidity is reestablished, combined with national saving.\nRegaining control of the domestic market from imported products will revitalize and enhance the role of small and medium-sized enterprises, which remain the backbone of the Greek economy. At the same time exports will be stimulated by the introduction of a national currency.\nThe state will be liberated from the stranglehold of the European Monetary Union at the level of fiscal and monetary policy. It will be able to achieve substantial lifting of austerity, without unreasonable restrictions on the provision of liquidity. This will also enable the state to adopt measures which will bring fiscal justice and redistribution of wealth and income.\nThe possibility of accelerated growth after the initial difficult months. The resources that became inactive during the seven-year-long period of crisis can be quickly mobilized to reverse the disastrous policy of the memoranda, if there is sufficient liquidity and a stimulation of demand. This will open up the possibility of a systematic decline in unemployment and a rise in income.\nFinally, by leaving the EMU, Greece will not become less European, it will follow a path that differs from the one followed by the countries of the European Union core, an option which is already well advanced in countries such as Sweden and Denmark. The exit from the EMU not only will not isolate our country, but, on the contrary, will allow it to acquire a new role on the international scene. A role based on independence and dignity, very different from the position of an insignificant pariah as dictated by the neoliberal policies of the memoranda.\nThe process of an exit from the EMU requires of course political legitimacy and active popular support. The referendum demonstrated the will of the people to reject once and for all austerity regardless of the challenges raised by the foreign and the domestic establishment.\nIt is now clear that our government has been essentially forced to exit the euro because of the EU’s final refusal to accept reasonable proposals on debt relief, the lifting of austerity, and the rescue the Greek economy and society, as demonstrated by the new ultimatum sent after the referendum.", "url": "https://www.jacobinmag.com/2015/07/tsipras-euro-debt-default-grexit/"}