{"authors": ["Catarina Príncipe", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:09", "date_modify": "2020-05-04 19:58:09", "date_publish": "2015-10-17 00:00:00", "description": null, "filename": "2015_10_left-bloc-portugal-austerity-social-democracy_1588622289.html", "image_url": "https://images.jacobinmag.com/2015/10/17005913/9972051626_94f0d5468c_b-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_10_left-bloc-portugal-austerity-social-democracy_1588622289.html", "title": "Hope for the Portuguese Left", "title_page": "Hope for the Portuguese Left", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nLast Sunday, Portugal — one of the countries hardest hit by austerity — held national elections. For many mainstream commentators, the result was a vindication of these policies, with a right-wing coalition winning again. But the Right’s total share of the vote dropped and the radical left’s total rose, with the Left Bloc enjoying its best showing ever. This was an unexpected outcome, but it raises new questions about what the Left has to do to seriously contend for power and how Portuguese politics will realign in the future. The triumph of the right-wing coalition Portugal First’s (PaF) was not anticipated until a few weeks ago, when they finally overtook the center-left opposition Socialist Party (PS) in the polls. The coalition is composed of the Social Democratic Party and the Popular Party, the two right-wing parties (whatever their names) that governed Portugal over the last four years and applied troika-mandated austerity. Although they didn’t manage to win an absolute majority and their votes dropped to 36.9 percent, many people find it hard to understand how an unpopular government instituting unpopular policies could stay in power. With German Finance Minister Wolfgang Schäuble celebrating the victory of austerity policies, it is important to offer some explanation for why this was the case. The first factor was the Public Sector Purchase Program, which the European Central Bank introduced just before the elections and which reduced interest rates, allowing Portugal to fulfill the criteria imposed by the troika without having to ask for a second bailout. Greece, of course, never received help of this sort. This was a political maneuver by the European institutions to prevent a destabilizing upsurge from the Left. Another factor was the perceived drop in unemployment (“perceived,” because the reports were based on dubious accounting), a market upsurge (even while debt grew from 80 to 120 percent of GDP), the government’s clever, non-confrontational election strategy, and the country’s lack of a strong anti-austerity movement over the past two and a half years capable of resisting mainstream narratives about the need for shared sacrifice and support for the austerity program. Finally, the Socialist Party completely failed to assert themselves as a strong opposition party, fueling the sense that there was no real alternative. Not only was their political program unclear and hardly any different from the Right’s, their electoral campaign was weak, filled with mistakes and contradictory statements. The PS’s leadership — expected to be strong and able to capitalize on social discontent — proved itself incompetent.\nHope on the Left The election’s silver-lining came from the forces to the left of social democracy. The Left Bloc and the Portuguese Communist Party (PCP) won 10.2 and 8.2 percent, respectively. The Left Bloc had its best vote tally ever, garnering more than half a million votes. Although the victory of the right-wing austerity forces is a reality, almost 20 percent of the newly elected Portuguese parliament will be anticapitalist and anti-austerity. This is unprecedented in modern Portuguese politics: the polarization of politics in times of crisis is starting to be felt. The PCP’s results are not a surprise. The party has maintained steady electoral support for many years. The ups and downs of the Portuguese social movement and class struggle seem not to have a direct effect on votes for the PCP. This is also partially true for the Left Bloc’s results. However, the Left Bloc is the only “winner” of this election. Coming off a bad showing in the 2011 elections — in which it netted only 5.2 percent, losing almost half its support from 2009 — and a serious internal political crisis, the organization seems to be slowly recovering, disproving many who thought it would disappear from the Portuguese political map. What explains the turnaround? For starters, Left Bloc had a strong and public electoral campaign. Its prominent figures played a positive role, winning many of the debates between the different parties and bringing into the center of the discussion some of the most fundamental political topics: labor and precarity, migration, social security, dismantling of the social state and privatizations, pensions, and — crucially — questions around debt restructuring, Europe, and the euro. This last point is crucial. The Left Bloc has been refining its position toward the European Union (EU) and the euro. The expectation that the “Syriza effect” would harm the growth of the Left turned out to be mistaken. Although the other political forces tried to frame the Left Bloc as irresponsible and lacking credible solutions — stating that even the Syriza-led government had to accept that there are no other alternatives to austerity — the Left Bloc was capable of shifting this narrative by placing the political responsibility on the European elites, while at the same time strengthening its critique of the EU and the euro. This is not a small step: denouncing the democratic limitations of the EU and stating clearly that we will make no more sacrifices for the euro, while at the same time growing electorally, means that there is a fundamental opening of political space for the euro-critical radical left. The Left Bloc’s results have shown that the left strategy of appealing to the discontented social base of traditional social-democratic parties with a clear anti-austerity program — while also trying to reach out to those who are disillusioned with the current political system — is still the correct one. Also important to this strategy is a respectful relationship to social movements and maintaining political independence from the old center-left parties. Going forward, it remains the most sensible approach for the radical left. Of course, there are many lingering strategic questions and difficulties for the Left. To name two of the most important: the almost nonexistence of a labor and social movement, as well as a party that is still very focused on electoral outcomes and dependent on the goodwill of the mainstream media. It is still possible that the amazing rise of the Left Bloc will be followed by an extreme loss in electoral support (similar to what happened between 2009 and 2011), as voters again look to tactically support the PS in order to uproot the government. Also interesting to note is that the two parties that were formed by dissidents of the Left Bloc with widespread media coverage (Livre and Agir) have been doomed to political irrelevance, obtaining 0.72 percent and 0.38 percent respectively. The only small party to enter the parliament is PAN, which has an animal rights agenda and is is ready to support any government.", "url": "https://jacobinmag.com/2015/10/left-bloc-portugal-austerity-social-democracy"}