{"authors": ["Loren Balhorn", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:51", "date_modify": "2020-05-04 19:58:51", "date_publish": "2015-09-17 00:00:00", "description": null, "filename": "2015_09_european-union-refugee-crisis-germany_1588622331.html", "image_url": "https://images.jacobinmag.com/2015/09/17005424/Germany-fans-refugees-welcome-1.gif", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_09_european-union-refugee-crisis-germany_1588622331.html", "title": "Don’t Count on Merkel", "title_page": "Don’t Count on Merkel", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nRefugees in Germany have a problem. Or rather, the people of Germany, it would seem, have a problem with refugees. Xenophobic demonstrations, arson attacks on asylum-seeker shelters, and other ugly racist incidents — like the drunken neo-Nazis who urinated on immigrant children in the Berlin metro last month — have sparked a fierce, wide-ranging debate in Germany and internationally about the country’s willingness and ability to deal with immigrants fleeing war and poverty. Responses to the crisis have been mixed: hundreds of right-wingers laying siege to a shelter full of terrified asylum-seekers in the Saxon town of Heidenau represents perhaps the ugliest side of Germany’s response thus far, but at the same time, thousands of volunteers have shown solidarity and compassion, mobilizing a wide range of projects to welcome and assist incoming refugees.\nIs There Really a Crisis? The influx of refugees are coming primarily from Syria (around 120,000 in Germany and over 300,000 in the European Union as a whole, according to best estimates), North Africa, and the Balkans. In absolute numbers, the German system took on significantly more refugees in 2014 than any other European state, roughly 200,000, and currently processes one of the highest volumes of individual asylum applications in the world. However, relative to total national population, Germany was not even among the top three European receiving countries, and the number of refugees currently in Europe pales in comparison to the number of refugees found in parts of the Middle East and South Asia, or the 20 million people forced to flee their homes globally in 2014 alone. Mainstream hysteria about a “flood” of asylum-seekers threatening to overrun German and European social systems is just that: hysteria. For all of the dramatic scenes occurring in European cities, a significantly larger refugee crisis is occurring, and has been occurring, in the Global South for a much longer time. That said, the influx of refugees into Germany has increased five-fold since 2008 and, given current projections, will continue to grow at a fast pace. This represents a significant challenge to systems that are already inadequate in accommodating and integrating asylum-seekers. This year’s total of asylum applications has already exceeded last year’s, so we can expect the strain, and the political contortions resulting from it, to continue. The main story from the perspective of the mainstream Western European media is not the plight of the refugees themselves, nor the reasons behind the refugee crisis, but rather the response of the European public. For most of the summer headlines about growing anti-refugee sentiment, particularly but not exclusively in the eastern provinces of Germany, have dominated German and European news. Right-populist demonstrations against asylum-seekers have become a regular occurrence in the country, particularly in the eastern state of Saxony (which has had fifty this year), and physical attacks against refugees (or people who are perceived to be refugees) are on the rise. Most alarmingly, the German state has registered over thirty arson attacks on shelters since January 2015. This most recent wave of hate and violence builds on several years of rising xenophobic sentiment, which has been stoked by the mainstream media and politicians. For most of the year, particularly before the dramatic scenes in Greece, Macedonia, Hungary, and elsewhere forced German politicians to project an air of humanitarian concern, Germany’s political establishment waffled. When the Islamophobic Pegida movement began marching in the thousands in east German cities earlier this year, Social Democratic Party leader Sigmar Gabriel stressed the need to seek dialogue with the movement, appearing at a roundtable hosted by Pegida in January. As late as August, he stressed the danger that high numbers of refugees could strain Germany’s social system and provoke justified ire from taxpayers. Meanwhile, German Chancellor Angela Merkel, currently being praised in the British media as a leading light of humanitarian Europe, remained silent, preferring to allow lower-ranking Christian Democrats to handle the PR disaster (the slang word “to Merkel,” meaning to equivocate and avoid taking action, was recently nominated for the German youth word of the year). Both parties of the grand coalition engage in a discourse of “deserving” and “undeserving” refugees — those fleeing war and oppression in the Middle East are welcome in Germany, whereas those fleeing poverty in Europe’s southeastern periphery are not, and should be deported as soon as possible. (The fact that the majority of refugees from the Balkan states are Roma, Europe’s poorest, most oppressed, and most marginalized minority, is usually conveniently ignored). These kinds of arguments feed into public suspicion of asylum-seekers and bolster existing racist attitudes, making it easier for the far right’s more radical racism to gain a larger foothold in society. But both kinds of arguments also make perfect sense in the context of growing xenophobic rhetoric from both sides of the German political establishment. It was Thilo Sarrazin, a prominent Social Democrat, whose best-selling 2010 book Deutschland schafft sich ab (Germany abolishes itself) began to rehabilitate biological racism in mainstream political discourse. Horst Seehofer, minister-president of Bavaria and leader of the Christian Social Union, Merkel’s sister party in that state, regularly deploys racist populism in public speeches (at a 2011 party conference, Seehofer promised to defend Germany’s social system against immigration “down to the last bullet”). So for all their recent humanism and outrage at the ugly scenes brewing in Germany’s small towns, it was the grand coalition of Social Democrats and Christian Democrats who laid the ideological groundwork for this explosion. For years German politicians have used immigrants and asylum-seekers as public scapegoats to deflect attention away from the real causes of declining living standards — namely the austerity packages introduced in the mid-2000s by the ruling coalition of Social Democrats and Greens and happily continued by Merkel’s government since 2009. It is only within the last few weeks, as the public was inundated with stories of the dire situation on the borders of “Fortress Europe,” that the establishment switched course and began speaking in a more humanitarian tone. Even the Bild, Germany’s notorious right-populist tabloid, has launched a full-on campaign to encourage the German populace to reach out to and aid incoming asylum-seekers. Compared to the responses of many other EU states, Germany and its leader appear as veritable saints — as leading lights of a more just, humane Europe. But it would be a mistake to read this shift in tone as a campaign from above to welcome the thousands of desperate refugees on Germany’s doorstep. Instead, the German ruling class is seeking to save their own political skins by reflecting and channeling the outpouring of support that regular Germans have initiated in response to the crisis, as well as the growing international criticism of the German state’s policies thus far. For every horrific image of right-wingers opposing the right to asylum, there are more instances of ordinary Germans organizing welcome festivals for incoming asylum-seekers, donating food and clothing, and assisting in any way they can. When Hungarian authorities temporarily ceased passport controls and allowed thousands of refugees to board trains to Vienna and Munich, passengers were greeted by hundreds of dedicated volunteers, who eventually donated so much food and other goods that Munich police asked them to stop as the sheer quantity had become unmanageable. These are the Germans — not the crass opportunists in the federal parliament — who deserve praise. They have confirmed what socialists already know: that, on the whole, people are good and want to help each other. It is the capitalist system and the myriad ways it divides us both materially and ideologically that drive so many to do the opposite. Of course, the fact that many Germans reject the anti-immigrant racism of the Right and are actively organizing against this mood does not negate the existence of a well-organized and dangerous racist movement within the country, nor is it any guarantee that the mood cannot or will not shift in the near future. But it serves to counter the idea (also common among some sections of the Left) that Germany is a particularly racist and intolerant society, and opens up possibilities for a united pro-asylum and antiracist movement encompassing broad sections of not just the Left, but also the unions, religious institutions, and civil society. A movement like this could go beyond concrete material assistance to asylum-seekers and shift the national conversation on the question of immigration (not to mention imperialism and the resulting social fallout) as a whole.\nWho Are the Racists? As public concern over the anti-asylum backlash has grown, so has the public discussion concerning the origins of the violence. Many German politicians are quick to point the finger at the east, namely the five states of the former German Democratic Republic. It is true that racist violence disproportionately occurs in the eastern states — particularly Saxony, where over 20 percent of all racist attacks in Germany have been recorded this year. Though the highest number of arson attacks have actually occurred in Bavaria, one of the wealthiest regions of Germany, when measured against relative population the east does have more racist violence and higher levels of support for far-right political parties. The interior minister of Rhineland-Palatinate, Roger Lewentz, recently attributed this discrepancy to the higher levels of xenophobia in the east to a historical lack of contact with non-Germans. But this kind of explanation is both empirically problematic and analytically misleading for a number of reasons. Firstly, it assumes that racism and xenophobia are simply products of a lack of multicultural contact (the flipside of another argument mainstream German politicians are fond of, namely that racism is a product of too much immigration and multiculturalism), while ignoring the role played by the media and politicians in feeding anti-immigrant sentiments. It also suggests that absent contact with foreign cultures, people are racist by default. The language used by Lewentz, namely that multicultural coexistence “must be learned,” reinforces this idea. Earlier this year, left intellectual Raul Zelik also countered this logic, arguing that it is not a higher level of migrants that makes society more tolerant, but migrants’ political self-activity that makes racist ideas less acceptable and less powerful within the broader society. Rather than attributing the relatively low levels of racist violence in the west to a more enlightened or tolerant west German society, it is the vital role played by migrants themselves in organizing antiracist self-defense that has accomplished this. In the east, where twenty-five years of deindustrialization and de-population have made the region a relatively unattractive economic destination, this organizational history and capacity is much less prevalent. It is precisely the processes of deindustrialization and de-population — with unemployment twice as high in the east, and oftentimes much higher in the rural areas where the far right is strongest — that have led to widespread disenfranchisement and frustration in east Germany, providing a material base upon which over-simplified, racist worldviews can prosper. In a region where socialist politics are associated with the legacy of Stalinism on the one hand and the relatively tame establishment politics of the Party of Democratic Socialism (the largest component of what is now Die Linke) on the other, it should come as no surprise that seemingly radical far-right explanations are able to attract larger audiences in east Germany than they would elsewhere. At the same time, the far right’s strength is bolstered by the German (particularly the Saxon) state’s historical tendency to ignore and downplay the danger posed by the far right, while devoting inordinate resources to monitoring and prosecuting the activities of the far left — the Saxon police continue to prosecute antifascists who led nonviolent anti-Nazi blockades in Dresden five years ago, yet did not arrest a single marauding racist two weeks ago in Heidenau. German police agents — particularly in the east — are so deeply entwined with neo-Nazi structures that one could argue they contribute more to building the far right than tearing it down. Indeed, the last time the German state tried to ban the National Democratic Party (NPD, the closest thing Germany has to a modern Nazi party), the prosecution ultimately failed because too many leading NPD functionaries were in fact paid state agents. This has allowed deep neo-Nazi networks to establish themselves in some parts of the east, such as the region known as Saxon Switzerland, and these networks often serve as the only alternative youth cultures in rural and impoverished areas. Lastly, and most importantly, the far right might be stronger in the east, but it is also alive and well in the west. While most of the NPD’s electoral successes since reunification have occurred in the east, many of its leading cadre are west Germans who saw an opportunity for growth in the early ’90s and moved there. East Germany had plenty of its own far-right structures before the fall of the Berlin Wall, but it was western organizations that financed and professionalized their operations, and these organizations continue to operate on both sides of the former inter-German border. For example, Dortmund, a working-class city deep in the west’s industrial heartland, is notorious for right-wing violence against immigrants, leftists, and even bourgeois politicians. Portraying xenophobia as the domain of de-classed east German subproletarians, as so many do, distorts the reality on the ground and obscures the very real danger that far-right violence poses to the entire country — especially immigrants and asylum-speakers. The anti-refugee mood that has arisen in Germany is more complex and linked to longer-term trends in society, namely to what social scientist Oliver Nachtwey describes as a “nervous society.” Germany remains relatively insulated from the effects of the European crisis, but it is still undergoing the same long-term decline in social mobility and democratic participation the rest of the EU is facing. As wages stagnate and the parties of capitalist democracy become increasingly homogenous, fear of further social decline increases, as do perceptions that the system is becoming permanently dysfunctional. Lacking a visible left alternative and fueled by the racist rhetoric of Germany’s political establishment, this fear is projected on various “others” — lazy Greeks, criminal Balkan refugees, etc. In fact, Germany’s relative insulation from the European crisis actually exacerbates this dynamic — many Germans are frightened they’ll be pulled down to the level their government’s policies have already pushed the European periphery, and view immigrants and other groups as threats to their relative prosperity. This is why Germany’s new right has been able to hide behind the language of law and order, human rights, secularism, and the like. Rather than organizing masses of poor Germans behind slogans of racial superiority or eastern expansion, the German right is becoming increasingly attractive for sections of the country’s educated middle class. Today’s far right speaks of participatory democracy (only for whites, of course), of protecting middle-class standards of living, and defending LGBTQ and women’s rights against the invading refugees from the east. The ugly scenes of rampant xenophobia and the massive counter-response by the political establishment and, much more importantly, the wider German population, will probably impede this growth at least temporarily. But it is no guarantee for the future. As long as Europe proceeds down its current political and economic path these trends will continue — and make organizing a broad left alternative all the more necessary.", "url": "https://jacobinmag.com/2015/09/european-union-refugee-crisis-germany"}