{"authors": ["Charlie Post", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:36", "date_modify": "2020-05-04 19:52:36", "date_publish": "2015-04-17 00:00:00", "description": null, "filename": "2015_04__1588621956.html", "image_url": "https://images.jacobinmag.com/2015/04/17003632/Warehous28_01-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_04__1588621956.html", "title": "We’re All Precarious Now", "title_page": "We’re All Precarious Now", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "CP\nThe notion that there’s the emergence of a new social class or a new layer in the working class is something that goes back to the beginning of the neoliberal offensive in the late 1970s or early ’80s. The idea is that there’s a category of people whose conditions of life are marked by short-term, temporary, part-time work, at lower-wages without social protections or benefits.\nBy the late 1980s, there were a number of French sociologists who were talking about “precarious” work. In the English-speaking world, the book that’s attempted to make this argument most systematically is The Precariat , by Guy Standing. What he’s arguing is that the precariat is a distinct social class, separate from the working class. He defines the working class as the 1950s and ’60s unionized working class in the industrialized world: people who had full-time employment, job security, who stayed with their employer for twenty or thirty years, who could not be hired or fired at will and the like.\nThe precariat, according to him, is the growing number of people, particularly among youth and people of color, who are increasingly employed in non-union workplaces, and are part-time and most importantly to him precarious, short-term; people are constantly turning over jobs, moving from one job to another. Standing’s argument, then, is that it is this layer, the precariat, who have a more radical potential.\nThe problem I have with this is that I’m not sure empirically the description of the precariat as a distinct, precariously employed sector of the working class, or even distinct class, is in fact accurate. There’s a very good book by Kevin Doogan called New Capitalism? For the most part, it focuses on this issue of precarity.\nOn the one hand, there’s been a clear growth in part-time work: in health care, retail and big box–type stores. But what he points out is that while all of these employers are using more part-time work so that they don’t pay medical benefits or pensions, the work is very steady. People aren’t working for only a few months, but rather are working sometimes ten or fifteen years for the same employer, and they just can’t get full-time.\nDoogan argues that the reason that the notion of the precariat has gained so much resonance is not because there’s this growing number of people whose attachment to employment has become more precarious, or that there’s a distinct group with distinct interests, but instead the defeats of the last thirty years, the rise of neoliberalism and the dismantling of the welfare state, have made the consequences of unemployment much more severe for workers today than they were in the postwar period.\nWhen I was much younger, in my late teens and twenties, I was first radicalizing in the 1970s, and I had a lot of friends who’d get jobs at the post office or the Brooklyn Navy Yard. They knew that if they got laid off or fired for political activity, they could collect unemployment, get food stamps, probably get on Medicaid, or they could pick up another job quickly. Since the successful neoliberal offensive, we have seen that it is much harder to get full-time employment that have social benefits, and in general the welfare benefits have degraded or disappeared.\nThe consequences of getting laid off or fired today are much more severe today than they were just a few decades ago. This is what contributes to a growing sense of precariousness among all workers. That starts with workers who are so-called “privileged” with full-time jobs, down to those who are working part-time for Walmart with no prospect of a full-time job.\nThis has contributed, along with the series of defeats and declining organization of the workplace, to a growing sense that the objective social power that workers once had in this society has dissipated. This goes along with a tendency that many on the Left have had to believe that the relative decline in the percentage of the industrial working class is something new. They argue that there’s a historic change in the history of capitalism.\nThe reality is that the percentage of workers employed industrially has been shrinking since the 1880s and 1890s! This is a result not of geographic mobility of capital leaving the core, but the result of mechanization.\nWe have seen a very sharp increase in mechanization and in speed-up, or “lean production” — a hyper-scientific management where you break up jobs into very simple and repetitive operations, you eliminate or combine jobs, get people working even harder and faster.\nYou get a situation where today more cars are produced in the United States than in any time over the last one hundred years, but with many fewer workers, and the percentage of those workers organized in unions is very small because of the employers’ offensive.\nSo this notion of precarity goes along with the notion of deindustrialization. Unfortunately, it’s also the argument of the trade union officials! What they say is that the reason the trade union movement is in such bad shape is that employers have broken the post–World War II social contract: they’re no longer hiring us full-time, they’re no longer giving us benefits, and they’re moving to China. They say that instead of confronting the dead end of bureaucratic business unionism—reliance on the NLRB to maintain union density.", "url": "https://www.jacobinmag.com/2015/04/precarious-labor-strategies-union-precariat-standing/"}