{"authors": ["Stathis Kouvelakis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:32", "date_modify": "2020-05-04 19:53:32", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08__1588622012.html", "image_url": "https://images.jacobinmag.com/2015/08/17005350/A-referendum-official-puts-up-a-sticker-reading-301-polling-station-at-an-Athens-high-school-that-will-be-used-as-a-polling-station-for-Sundays-referendum-in-Greece_1436006734546914_v0_l-1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08__1588622012.html", "title": "After Syriza", "title_page": "After Syriza", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "SK\nYes, we think that we have to prepare for euro exit. That is absolutely clear!\nPopular Unity’s program has now been finalized and it will be published shortly. Preparation for euro exit is a fundamental point. This question has several aspects. The first is clearly the recuperation of political sovereignty, in a context where a government is confronted by a Holy Alliance of all the neoliberal powers.\nAs we have seen, deprived of monetary levers, we were taken hostage by the ECB. Syriza suffered that ever since February 4. Secondly, it is a means of making it possible to restart the economy, guaranteeing the supply of liquidity. Furthermore, it is an extremely important lever with regard to the debt question: if we instead go for a national currency, the debt will become almost unpayable, since no one would accept the repayment of a debt redenominated in a national currency. That places us in a position of strength.\nFinally, devaluation would make it possible to kickstart growth, indeed vigorously so: all countries that have found themselves in a situation of deep recession have only been able to restart the economy by making use of currency devaluation.\nThe choice is a simple one, really. Either we have currency devaluation, or else internal devaluation, meaning the structural adjustment plans imposed in order to reduce wages and pensions and drive down the cost of labor.\nCertainly, currency devaluation does create certain problems, but also opportunities: it boosts domestic production, it allows for exports to be substituted for imports, and makes exports more competitive. Without doubt it creates problems for some things that have to be paid for in hard currency: petrol, energy, some medications that have to be imported — although not all that much, since domestic production can provide a good part of that.\nAll that does open up temporary difficulties, in the transition phase. But as all the economists hostile to neoliberalism have shown — from Krugman to Stiglitz, and from Aglietta to Lordon — the debate is over. As they tell us, Greece’s best possible choice, and in reality the only viable one, is for it to return to a national currency; naturally, within the framework of a progressive policy to relaunch the economy, and which can also handle the problems that result from this. There will be inflationary pressures, but even in that context a left-wing government can protect wages.", "url": "https://www.jacobinmag.com/2015/08/greece-grexit-popular-unity-syriza/"}