{"authors": ["Howard Brick", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:10", "date_modify": "2020-05-04 19:50:10", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08_philip-randolph-army-segregation_1588621810.html", "image_url": "https://images.jacobinmag.com/2015/08/17005123/randolph-2-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08_philip-randolph-army-segregation_1588621810.html", "title": "The Other March on Washington", "title_page": "The Other March on Washington", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Please be informed that I am ready to serve in any unit of the armed forces of my country which is not segregated by race,” wrote Winfred Lynn to his local draft board in 1942 after learning of his conscription into the United States Army.\nThe thirty-six-year-old landscape gardener from Jamaica, Queens, New York City, loathed Nazi Germany, fascist Italy, and Imperial Japan but vowed to go “to prison or to die, if necessary, rather than submit to the mockery of fighting for democracy in a Jim Crow army.”\nOnly when his lawyers concluded that his case against the Selective Service would be stronger were he in uniform did Lynn submit to conscription. He saw duty in the Pacific, made the rank of corporal, and watched his case reach the Supreme Court, which declined to hear it on January 2, 1945, dashing what one black newspaper, proclaiming Lynn the “Hero of World War II,” termed “the most important legal battle to challenge segregation in the armed forces.” Only the Second World War’s end in 1945 brought him an honorable discharge and the outcome he had sought for three long years: freedom.\nWorrying that Lynn’s stance was too radical, even unpatriotic, the nation’s leading civil rights organization, the National Association for the Advancement of Colored People (NAACP), had declined to support his case. His first attorney was his younger brother, Conrad Lynn, who had been expelled from the Communist Party in 1937 for supporting Trinidadian workers’ strikes, contrary to the Party’s conciliatory Popular Front line.\nNext to join the defense was another radical, Arthur Garfield Hayes, a civil libertarian who had represented anarchists Nicola Sacco and Bartolomeo Vanzetti, evolutionist John T. Scopes, and the Scottsboro Boys. The chief supporter of Lynn outside the courtroom was a militant trade union, the Brotherhood of Sleeping Car Porters, comprised mostly of black train workers inclined to fight for race equality as well as economic gain.\nWinfred Lynn’s disregard of wartime pressures out of insistence upon equality bore the militancy of the Brotherhood, whose leader A. Philip Randolph was graced with imperturbability, a courteous bearing, and a mellifluous voice. Randolph visited the White House repeatedly as a chief race spokesman of the 1940s, striving to prevent a resurgence of the European colonialism and lynching that followed the First World War.\n“This is not a war for freedom,” he held in 1944. “It is not a war for democracy. It is not a war to usher in the Century of the Common Man . . . It is a war to continue ‘white supremacy,’ the theory of Herrenvolk, and the subjugation, domination, and exploitation of the peoples of color. It is a war between the imperialism of Fascism and Nazism and the imperialism of monopolistic capitalistic democracy.” Randolph organized a 1943 Harlem mass meeting on Lynn’s behalf and signed a letter lamenting “the sight of a Jim Crow American army fighting against Nazi racialism.”\nWith Randolph as the spearhead, this left-led black freedom movement of the 1940s made two signal breakthroughs: it widened access to jobs and compelled desegregation of the armed forces. Randolph had formed a March on Washington Movement around those demands, planning a rally of tens of thousands at the Lincoln Memorial on July 1, 1941.\nAs a socialist, he considered racism the product of economic insecurity and competition and held that “our present political and economic capitalist order is unable to satisfy the needs of modern man” because under it “one section of the population appropriates a part of the product which others have produced without giving any equivalent exchange.”\nIn the spring of 1941 the March on Washington Movement swelled with poor and working-class blacks, although the small black middle class viewed it as an irresponsible provocation and the Communist Party objected out of fealty to the Non-Aggression Pact between Joseph Stalin’s Soviet Union and Adolf Hitler’s Nazi Germany. All the same, the March on Washington Movement was impressively effective.\nWorried about the “international embarrassment” that would result from a demonstration against segregation in the nation’s capital, as Fortune magazine put it, President Franklin Delano Roosevelt agreed to issue Executive Order 8802, which established a Fair Employment Practices Committee (FEPC) to monitor defense contractors, just in time for Randolph to call off the protest march. It was the most significant federal civil rights advance since Reconstruction.\nIn the years that followed, Randolph forgot neither armed forces desegregation nor “the famous Winfred Lynn case,” as he called it in Congressional testimony in 1948. Jim Crow units had endured menial, humiliating work during the Second World War, and black Americans saw the military as a national institution with millions of employees whose desegregation would weaken the racial caste system.\nWhen Democratic President Harry S. Truman proposed universal military training and conscription as the Cold War set in, Randolph visited the White House to inform Truman that his own “frank, factual survey” found that “Negroes are in no mood to shoulder a gun for democracy abroad so long as they are denied democracy here at home.” If a draft were instituted while discrimination persisted, Randolph announced, he would “advise Negroes to refuse to fight as slaves for a democracy they cannot possess and cannot enjoy”: “Negroes are just sick and tired of being pushed around, and we just do not propose to take it, and we do not care what happens.”\nThis threat of mass draft resistance was radical — “treasonable,” said Georgia Senator Richard Russell — but sufficiently credible to disconcert Truman, who faced an election year as well as an accelerating Cold War struggle with the Soviet Union over Africa, Asia, and Latin America, whose peoples already were inclined to look askance at US claims to represent the “free world” given American racial segregation.\nWhen Truman issued Executive Order 9981 in 1948, abolishing racial segregation in the military, Randolph called off the civil disobedience campaign, having once again applied popular pressure to wrest a stunning civil rights victory by federal executive order.\nThat might mark the end of the story were it not for one final twist. Truman’s executive order was so vague about the timetable for military desegregation that some radicals saw it as postponing, rather than fulfilling, justice. Among them was Winfred Lynn, who joined a small band of radicals led by pacifists A. J. Muste and Bayard Rustin who vowed to carry the civil disobedience campaign forward.\nTheir Campaign to Resist Military Segregation — with Lynn the gardener as its treasurer — urged “Negro and white youth to refuse induction into segregated military establishments.” Just as A. Philip Randolph had honored Lynn’s wartime resistance in his testimony to Congress, so Lynn was following a credo first articulated by Randolph: “These rights will not be given. They must be taken.”", "url": "https://jacobinmag.com/2015/08/philip-randolph-army-segregation"}