{"authors": ["Panagiotis Sotiris", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:41", "date_modify": "2020-05-04 19:53:41", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07__1588622021.html", "image_url": "https://images.jacobinmag.com/2015/07/17004447/screen_shot_2015-07-02_at_3.33.05_pm-1-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07__1588622021.html", "title": "The Referendum as Rupture", "title_page": "The Referendum as Rupture", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The referendum to be held in Greece on Sunday is not a political debate. It is a battle in an ongoing war between Greek society and the European Union (EU) and the International Monetary Fund (IMF), which are trying to turn Greece into the most brutal recent experiment in neoliberal social engineering.\nCarl Schmitt once wrote that the only existentialist categories are those of friend and foe. It is exactly this that can explain the tactics of the EU, particularly Germany, during the Greek crisis. There has never been a negotiation. It has been from the beginning an existential war, in the Schmittian sense, one in which you are not looking for common ground or a compromise in your favor but for the full capitulation of the enemy.\nThis can account for the refusal to actually negotiate with the Greek side, despite the painful concessions the latter had made and its acceptance of austerity. That is why there were always new terms and new demands arising during the negotiations. That is why they refused any discussion of reducing Greece’s debt burden, exactly because it is debt that has been the most convenient tool for this open and cynical blackmail of an entire society.\nThe Greek government’s decision to hold the referendum was an act of rupture with the EU. We should remember that the EU is allergic to referendums after the traumatic experience of 2005 and is generally hostile to any exercise of popular sovereignty that undermines its neoliberal policies. Moreover, here we have a referendum not on a policy to be adopted but on a policy already implemented — actually for the core of the current version of the disciplinary European Economic Governance. Rejecting the creditors’ proposals equals rejecting the essence of the contemporary form of European integration.\nConsequently, for the EU and in particular Germany, the very decision to hold a referendum meant the end of negotiations. In a certain way the German tactic is simple: go through with the referendum. If there is a “yes” vote, you will get a new harsher austerity package. If there is a “no” vote, then brace for Greece’s exit from the eurozone (“Grexit”).\nIn this sense Greek Prime Minister Alexis Tsipras’s idea that after a massive “no” vote there will be a restart of negotiations is groundless. Even if they still want a humiliating deal and not a punitive forced exit, they will probably take advantage of the current condition (banks with no liquidity, capital controls, market collapse, cash shortages, and probable shortages in basic goods) and prolong it as a means to impose the full version of the politics of social devastation.\nThe idea of a referendum was correct, and it has liberated social forces and potential in a manner that we had not seen in the past few months. For the first time, we can see the forces of the Left — with the exception of the Communist Party, which remains entrapped in its paranoid leftism — giving an actual fight. But the referendum is not a negotiation. It is the beginning of the rupture.\nUnfortunately, Syriza has not been prepared for that. The fact that many Syriza heavyweights such as Yannis Dragasakis, Giorgos Stathakis, Dimitrios Papadimoulis, and others openly called for acceptance of any deal offered, in defiance of Tsipras’s insistence that there should first be a “no” vote, is an example of the limits of Syriza. Tsipras has shown courage and determination, refusing to capitulate and giving all his weight in favor of No. Nevertheless, he still presents the “no” vote as a negotiation tactic, making proposals even at the last minute, and not as the beginning of a broader confrontation.\nAt the same time, we already see a massive polarization of Greek society. The Yes campaign is combining a mobilization of bourgeois and middle-class strata (a very large number of professional associations support Yes) and the deployment of all forms of ideological warfare. The private media are propaganda machines for the “yes” vote, and Greek corporations openly threaten their employees with mass layoffs if there is a “no” vote, using the refusal to pay wages as a means to make the threat credible.\nFear is beginning to become the determining factor. At the same time, you see also signs of radicalization in the No camp, with people more ready than ever to accept the full cost of rupture if this opens up the prospect of an end to austerity.\nThe biggest problem is that we still lack what is most urgently needed: a coherent narrative for a rupture that is in fact inescapable. A sincere narrative that will speak about the initial difficulties and the long-term benefits of Grexit, provided that is done in a sovereign manner, and the need for a different developmental paradigm. A militant narrative that could also appeal to the people to support this strategy in an energetic fashion, accept the initial hardship, and fight fear. Syriza is still unwilling to face this challenge, and the radical left is still deficient regarding the need to move from slogans to programs.\nA “yes” vote would not only mean that the Greek government would have to sign a humiliating agreement. It would also mean a broader process of realignment of the political scene, including enormous huge pressure on Syriza (some of it exercised from within) to move to the right. Above all, it would be used to change the balance of forces in favor of capital and to preemptively reverse whatever aspirations the subaltern classes had.\nA massive win for No is the only solution, the only way to release dynamics and put an end to the automatic pilot of austerity and social devastation. But it will not be enough. It is more urgent than ever for the Left to actually face the challenges ahead of it.\nThe challenge is not to have some temporary breaths of dignity, some moments of victory, and a brief interval of popular sovereignty, before defeat and capitulation. The challenge is to prove that there can actually be a lasting alternative.", "url": "https://www.jacobinmag.com/2015/07/tsipras-syriza-greece-exit-default-european-union/"}