{"authors": ["Donna Murch", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:31", "date_modify": "2020-05-04 19:50:31", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08__1588621831.html", "image_url": "https://images.jacobinmag.com/2015/08/17004836/BLM-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08__1588621831.html", "title": "Ferguson’s Inheritance", "title_page": "Ferguson’s Inheritance", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nAs the one-year anniversary of Michael Brown’s killing rapidly approaches, within days of the fiftieth anniversary of the Watts Rebellion, we are invited to reflect on the connection between state repression and African-American mobilization past and present. Each generation has a moment when its members share an instance of collective experience that is forever etched into their memory. For the Civil Rights Movement and Black Power generation, it was unquestionably the open-casket funeral of Emmett Till. The disfigured remains of this fourteen-year-old boy became a mirror in which black youth witnessed their most vulnerable selves. The sight was so excruciating that it helped catalyze direct action protest from rural Alabama to the streets of Oakland for nearly a decade and a half. Today, for a broad swath of people ranging in age from those born in the waning years of the Black Power movement through the interstice between the twentieth and twenty-first centuries, this moment was embodied in Ferguson. The precise calculus of generation is elusive. As Jeff Chang has argued, “Generations are fictions.” And yet, we all have a personal and public sense of time that places us within a cohort of history. Whether we use the branding terms “the Hip Hop Generation” or “Generation X,” or the not-for-profit ring of “Millennial Youth,” particularly for those of us who came of age under presidents Ronald Reagan through Barack Obama, the events in this small municipality outside northern St Louis were profoundly meaningful. It might even be said that the events of the past year have helped distinguish the post-civil-rights generations from iconic baby boomers, because the months of mass protest announced what many of us feel is the most pressing domestic political crisis of our time: the emergence of a massive edifice of policing, surveillance, prisons, and punishment that is unprecedented in both US and global history. Built on recent centuries’ long substructure of white supremacy, but nurtured in an era of neoliberal retreat and technological advance, this massive state-building project, known alternately as mass incarceration, the new Jim Crow, the prison-industrial complex, or more simply, according to former New York Times journalist Chris Hedges, “the world’s most advanced police state,” has become a defining feature of our times. It is impossible to understand the enormity of the reaction to Michael Brown’s murder without recognizing the daunting shadow cast by state repression in the fifty-year aftermath of the modern Civil Rights Movement. Police left Michael Brown’s body in the street for nearly five hours, immersed in his own blood. Like the body of Emmett Till, the devastating sight of this murdered youth was intolerable. Word and image spread first to the residents of Canfield Green where he lay and then, through the digital magic of cyber networks, to the rest of the St Louis metro area, the nation, and the world. Twitter, Instagram, Facebook, and Vine carried the story beyond the city’s periphery, ultimately forcing mainstream media to reckon with its gravity. However, the media blitz focused not on the destruction of a person, but rather of property. The pattern continued in Baltimore, which is another economically devastated city located in the overlapping borderlands between the North and South that failed to attract sustained press coverage until fevered reports of “looting” became the focal point of the television news cycle. Even more important to the impact and longevity of Ferguson as site of protest and mobilization was the ingenuity and commitment of the protesters who refused to leave — even when confronted with tanks, military hardware, and clouds of tear gas. Instead they started publicly counting the days of sustained resistance and in so doing announced to St Louis County and the rest of the world that they would not stop until they had attained justice for Mike Brown and the many other men, women, and children shot down by police. The protest has been going on for nearly a year, and still, it continues. What made Ferguson into such a watershed moment was not simply the terror-inspiring image of police impunity, but that a large cohort of African-American youth decided to fight back and confront state authorities. Along the way, they developed allies and “co-conspirators,” in the words of Black Lives Matter cofounder Alicia Garza, from different ethnic and racial communities, more-affluent cities across the country, and international solidarity groups. This was nowhere more true than with Palestinians who tweeted from the West Bank in early August with instructions about how to mitigate the effects of tear gas. International exchange continued and deepened in the months that followed, as the twin threads of Boycott, Divestment, and Sanctions (BDS) against Israel and the burgeoning African-American-led movement against state-sanctioned violence inside the United States intertwined. During Ferguson October, activists launched a sustained organizing effort that spanned a four-day weekend meant to draw support from across the country in a Black-Power-style remix of Freedom Summer. After attending a hip-hop gathering including performances by local and nationally known artists such as Tef Poe, T-Dubb, and Dead Prez, I wrote the following words that captured for me the sheer force and beauty of the genesis of a new protest era unlike anything I had experienced firsthand: I have no words to express what is happening in Ferguson. In the name of Michael Brown, a beautiful black storm against state violence is brewing so dense it has created a gravity of its own, drawing in people from all over the US, from centers of wealth and privilege to this city whose most prosperous years were a century ago. It looks explicitly not only to St. Louis City and County police and other municipal law enforcement, but also to the imperial wars in the Middle East as sites of murder and trauma. The call repeated over and over is Stokely Carmichael’s: “Organize, Organize, Organize.” And this growing youth movement has all the ancestral sweetness of kinship. In the words of a local Hip Hop artist/activist, “Our grandparents would be proud of us.” Local police were not the only focus. Corporate chains Walmart and Quiktrip became flash points of conflict, even more so than the small businesses that the local news identified in the sensationalized coverage of looting in early August. Protesters frequently gathered outside the Department of Justice in St Louis, while flash mobs appeared regularly throughout the metro area. Consistently, activists sponsored three or four simultaneous direct actions at different locations every day, ranging from flash mobs at Walmart, to protesters whistling “FTP” in Morse code outside the police station. Organized actions abounded that would have warmed the heart of Saul Alinsky, like the beautiful baritone voice, replete with a full operatic chorus, that pre-empted the St Louis Symphony’s performance of Brahms’ Requiem . Demonstrators adapted the lyrics from the United Mine Workers’ anthem, “Which Side Are You On,” from the deadly labor strikes in the coal mines of Harlan County, West Virginia. Which side are you on friends?\nWhich side are you on?\nJustice for Mike Brown friends.\nJustice for us all. Afterwards, a multiracial group arranged strategically throughout the theater shouted “Black Lives Matter” over and over, a cappella. As they sang, protesters threw long, black-and-white cloth banners over the balcony, scrolled with signs and drawings including “Requiem for Mike Brown 1996 to 2014,” “Racism Lives Here” with an arrow pointing straight down to the skyline’s Gateway Arch, and “Come Join the Movement” adorned with a bright yellow shining sun. While local residents formed the core of this wave of protest, constant outside attention and migration of people to support this movement of organized resistance played a crucial role. Black Lives Matter sponsored its own “freedom rides” bringing nearly six hundred people of African descent from eighteen cities, including New York, Los Angeles, Toronto, Chicago, Austin, Atlanta, Winston-Salem, and Tucson. In addition to Black Lives Matter, the faith-based not-for-profit group PICO (People Improving Communities through Organizing), headquartered in Washington DC, provided support staff and resources from the earliest days of the protest. PICO organizers, in fact, helped stage a Moral Monday protest by local clergy in which they offered the sacrament of “repentance” to Ferguson police officers. To powerful effect, the clergy and other demonstrators called out the names of people who had been killed by the police, and rhythmically shouted after each victim, “Repent.” “Mike Brown — Repent,” “Vonderritt Myers Jr — Repent,” “Raneisha McBride — Repent.” And so on for hours. Protesters and ordinary people created and maintained memorials in the place where Michael Brown’s body lay, set up camp in front of the Ferguson police headquarters on South Florissant, and marched regularly along what a local minister called “The Jericho Road” stretching from Canfield Drive to the edge of Dellwood, a neighboring majority-black municipality. Demonstrators staffed pickets in front of the Ferguson police station for twenty-one hours a day, sharing rides and food as they crafted their own movement culture. Direct action protests like these later spread to the Shaw district of South St Louis, following the murder of eighteen-year-old Vonderritt Myers, who was shot six times in the legs and once in the face after a policeman employed by a private security firm mistook Myers’ sandwich for a gun. As this mosaic of struggle indicates, over the past year Ferguson and the greater St. Louis metro area has become a laboratory and genesis point for a new generation of activists against state-sanctioned violence. It has also helped inspire a new wave of twenty-first century iterations of Black Power both for local youth and for those across North America. These efforts, and the national and international press and social media coverage they generated, marked a turning point, a before and after, in which perception changed. Solidarity protests in New York, Los Angeles, and smaller cities throughout the country immediately followed, and in the process, a national collective memory was forged. This is not to say that what happened in Ferguson was something entirely new; it certainly was not. Anti-police brutality protest has a long history, and a small segment of its most recent past could be traced as far back as the late 1970s and 1980s, to the police murders of Eula Love, Eleanor Bumpers, Michael Stewart, and many, many others. But to understand the social dynamics of Ferguson and the many months of protest that have followed in an era of both cybernetic networks and of the “Arab Spring,” we need to look to more recent struggles. The campaigns seeking justice for Oscar Grant, Sean Bell, Troy Davis, Sakia Gunn, and Trayvon Martin are Ferguson’s direct lineal antecedents. In fact, the events in St Louis represented the culmination both of longstanding forces of repression and criminalization, as well as of resistance.\nRebellion and Repression In a speech at the National Press Club in 1986 — during Ronald Reagan’s second presidential term, on the eve of the Iran Contra hearings — James Baldwin reflected on the importance of history and of America’s discomfort in reckoning with the full burden of its meaning. One of the things that has always afflicted the American reality and the American vision is this aversion to history. History is not something you read about in a book, history is not even the past, it’s the present, because everybody operates, whether or not we know it, out of assumptions which are produced only, and only by, our history. Locating the exact origins of the current epidemic of police violence is not an easy task. Its causes are many and cumulative, ranging over a broad swath of time. As Robin Kelley and others have pointed out, the link between race and criminalization in the United States is at least as old as the Atlantic slave trade itself. Slave patrols from the antebellum era, convict leasing and the organized system of terror in the post-bellum and segregated South, as well as the turn toward Jim Crow justice in the years after the arrest of the Scottsboro boys are all part of the long history of race and criminalization. Equally important to this history is private as well as state violence, as seen in the brutal act of racial vigilantism that killed Emmett Till with impunity. But to understand the nature of Ferguson protest, it is essential to look at the major developments of the last half century that are often elided or ignored in popular media. Paramount to this history is the state response to the popular mobilizations of the postwar era and the criminalization of exactly the kinds of youth who participated in the popular upheavals of the 1960s urban rebellions and Black Power movement. It is in this moment of reaction that the seeds of contemporary police militarization were sown, as well as the divisions within the African-American community, which ultimately have made it difficult to organize in a unified way until very recently. There are many examples to illustrate this point. Take California, a state that has helped lead the expansion of America’s incarceration rate. The history of the Golden State generally, and Los Angeles specifically, is essential to understanding how America has become a “prison nation” in the years of reconquista (reconquest) following mass protest and civil unrest. California is home to Oakland’s Black Panther Party for Self-Defense, the Watts Rebellion, and the law enforcement commando unit SWAT. These historical developments are not coincidental, but directly related. California has the largest prison population in the United States, which in turn has the largest prison population in the world. Strikingly, 70 percent of the state’s prisoners come from Southern California, and the city of Los Angeles alone has the ominous distinction of housing the largest number of urban prisoners on the planet. In 2000 California incarcerated African Americans at a rate nearly four and a half times their representation in the general population, and Latinos at a rate three times as high. To paraphrase Cornel West, race really does matter to this history. High incarceration rates of populations of color are not a recent development. California is part of “Aztlán,” or “occupied land,” seized by United States after its war with Mexico in 1848. During the lead up to the Civil War and Reconstruction, the state caged significant numbers of Native Americans who were then leased out to public and private employers. It also had one of the highest rates of lynching, not exclusively as a form of racial control, but as a system of frontier justice for punishing transgression and social crime. By the turn of the twentieth century, California already had the highest rate of incarceration in the country. To put it bluntly, California has been putting large numbers of people in prison for a long time (especially those who are black, brown, indigenous, and poor). But in the late twentieth century, this tendency vastly accelerated, and the state began to export some of its most brutal methods, including SWAT, gang injunctions, and gang enhancements, to the rest of the country. But African Americans and Latinos fought back against these oppressive structures, past and present. The Watts Rebellion, or the Watts riot as it is more popularly known, was the largest civil disturbance in US history up until that point and was occasioned, unsurprisingly, by an incident of police brutality. In August of 1965, five days after the signing of the Voting Rights Act, the community of Watts in Los Angeles, California, erupted in violent protest over the police beating and jailing of a twenty-one-year-old African-American youth and the abuse of his mother. Watts surprised the rest of the country because it broke out in a moment of victory: the culmination of the southern Civil Rights Movement’s push for civil and electoral inclusion. For the first time in history, African Americans of both genders had been granted full voting rights, with the federal government guaranteeing systematic mechanisms of enforcement. In essence, the final legal plank in the southern system of Jim Crow had been demolished. Nevertheless, within several days after the passage of this historic legislation and the dispatch of federal voting rights marshals into the South, a cataclysmic urban rebellion erupted in an impoverished and largely ignored black migrant community on the West Coast. The Watts Rebellion signaled that, despite the dismantling of regional, legally enforced segregation, African Americans throughout northern and western cities faced profound forms of racial discrimination untouched by the decade-long mobilization in the American South. Paramount among these was the constant abuse of police power: arbitrary arrest, shootings of unarmed people, harassment, beatings and murders of children, and, in New York, the first generation of stop-and-frisk laws. Watts was in many ways emblematic of the problems of the black urban poor then and now. Located in the outer reaches of South Central Los Angeles, it was a direct portal for recent migrants from the American South. The forces of housing segregation and redlining contributed to overcrowding, with a quarter of a million people hemmed into an area of less than three square miles. In fact, Martin Luther King argued that Watts faced the worst overcrowding in the nation. Contained within strictly drawn boundaries, law enforcement over-policed and underserved this impoverished area in South LA. Not surprisingly, while African Americans made up 98 percent of residents, the police department was nearly all white and drawn from distant white enclaves. Perhaps more than any other neighborhood of its time, Watts embodied what two eminent social scientists have called “American apartheid.” Like the other urban rebellions of the 1960s and 1970s, the residents of Watts registered their anger at police, and “the racial state” more broadly, by taking to the streets. The rebellion lasted six days, from August 11 to August 17, 1965. It left thirty-four people dead and property losses totaling over $40 million. Ultimately, officials called in the National Guard to quell the disturbance, and it along with other branches of law enforcement caused the overwhelming majority of deaths and injuries. Looked at from hindsight, the Watts riot’s long-term causes, like those of the scores of other urban rebellions that swept through American cities in the 1960s to which Ferguson has been compared, hinged on two central issues: the political economy of race and the long-standing history of systemic police abuse and criminalization of Africans Americans. The urban rebellions and their political expression “Black Power” responded to what Bayard Rustin called the more “complex problems of housing, education, and jobs” in northern and western cities. Few places embodied the devastating effects of the overlapping systems of northern (and western) racial discrimination more than Watts. Watts was an urban portal for the poorest and most recent migrants from the South, and Eldridge Cleaver remembered his hometown as “a place of shame.” As newcomers settled at the social margins of the United States’ second-largest city, they faced intense racial and class segregation, miserable schools, and large-scale joblessness. A hostile and overwhelmingly white police force engaged in routine traffic stops of motorists of color, beatings, and harassment. Given the collective black suffering in South LA, the chance to actually fight back directly against these conditions thrilled many residents. Watts became emblematic of a new era of militancy that looked to armed self-defense, direct confrontation with the state, and economic redistribution as political imperatives. Indeed, many have argued that it initiated the new era of Black Power politics. Particularly for the young, the poor, and the economically marginal, Watts was a deeply meaningful rebellion that called attention to the everyday effects of racism and white supremacy. It made visible the problems of the urban north and its forgotten populations that had largely been untouched by the gains of the southern Civil Rights Movement. And while many journalists and popular histories have denounced these so-called “riots” as tragic and destructive failures that destroyed liberalism, it is important to recognize how profoundly they influenced US social welfare policy. During the Black Power era, postwar redistributive programs responded directly to the hundreds of thousands of people taking to the streets in protest. It is doubtful that without this massive wave of civil unrest sharp increases in federal funding for higher education targeted to students of color, community action programs, small business loans for “minority contractors,” and, more broadly, the expansion of social welfare infrastructure to impoverished populations of color would have been implemented. And while this remains an “inconvenient truth” to many, the specter of large-scale property destruction was indeed integral to protest tactics that won major concessions. Over the course of a single decade, from 1960 to 1970, state spending on housing and other urban policy issues expanded from $600 million to over $3 billion. Indeed, the federal government created a whole new agency to deal with the so-called “urban crisis”: the Department of Housing and Urban Development. For many Americans, this account challenges some of the most cherished understandings of the heroes and villains of the 1960s. So much of our current national memory focuses on the triumphant efforts of an interracial, nonviolent movement that overturned the inequities of Jim Crow. But if you really want to understand the problems facing today’s African-American communities, it is the history of regions outside the South that are most instructive. It is the urban North and West that directly anticipate the problems that we see today. Although our national post-racial narrative focuses almost entirely on the elimination of legal segregation, it is actually these lesser-known histories that best explain the problems of structural racism, police violence, and mass incarceration facing successive generations in the years after the Voting Rights Act’s passage. As many young people look back on the social movements of the 1960s and 1970s, they see only defeats. However, from the point of view of law enforcement and the state more broadly, this period represented an era of unprecedented delegitimization. It is hard to overestimate the anger and fear that militant black community mobilization inspired among authorities. City and state governments understood Watts, and the urban rebellions more generally, as apocalyptic destruction that should be punished. Like the iron fist and the velvet glove, the war on crime and the war on poverty were historically intertwined. Indeed, in 1966, a year after Watts, an ambitious former actor who had recently switched from the Democratic to the Republican Party, was elected governor of California on a law-and-order platform opposing “Beatniks, taxes, riots, and crime.” Significantly, Ronald Reagan won by capturing a majority of white, unionized households despite his opposition to organized labor. This same man would later vastly expand America’s devastating war on drugs in the 1980s. A decade before, however, Governor Reagan’s hardline stance prompted his counterpart in New York, the historically liberal Nelson Rockefeller — who had equally grand national ambitions — to reverse his earlier public-health approach to drug use and to launch the most draconian anti-drug laws in the country in 1973. So as the country arched to the right, the lesson that law enforcement drew from Watts was not that it needed to consider how its systematic mistreatment of African Americans had caused such large-scale destruction. No. Nor that greater community input was needed either. Instead, authorities responded to what they defined as an irrational wave of disorder by creating new and more repressive forms of policing that were modeled explicitly on American military campaigns abroad. During and after Watts, the LAPD arrested over 4,000 people and conducted large-scale house-to-house searches. In addition, law enforcement worked to acquire military-grade hardware and elite tactical units as part of its “counterinsurgency” campaigns against urban protests and Black and Brown Power organizations. In 1967, the department founded SWAT with a compact force of former military veterans. Subsequently, the LAPD deployed SWAT for the first time against the Southern California Black Panther Party’s office at Forty-First Street and Central Avenue. The commando force used a tank on loan from the National Guard and won Department of Justice authorization for a grenade launcher. SWAT marked a new era in law enforcement, not only for the city of Los Angeles, but for the rest of the country. It established a template for militarized policing across the country that laterally expanded in the overlapping domestic wars against drugs, gangs, and crime in subsequent years. In a move that influenced other police departments, the LAPD used federal monies from the Law Enforcement Assistance Administration (LEAA) to develop additional militarized units. Southern California law enforcement created a series of commando forces with ominous, martial sounding names, including TRASH, later renamed CRASH under community protest; Operation Safe Streets (OSS); and the district attorney’s own “Hardcore Drug Unit.” As this list of martial alphabet agencies demonstrates, starting with the invention of SWAT, Los Angeles helped lead the national militarization of policing. And it is here that we see the carceral thread linking the shocking scenes we saw in Ferguson to Watts and SWAT. This pre-history is almost entirely left out of the mainstream coverage of the events in St Louis, Baltimore, and other recent site of protest. At most, we hear a discussion of how the 1033 Program of the National Defense Authorization Act funded the adoption of surplus military hardware by police departments. But there is rarely a sustained discussion of the war on drugs, much less the bombastic response of law enforcement to the highly politicized urban uprisings of the 1960s that are Ferguson’s direct lineal antecedents. The events in Ferguson and other parts of the country cannot be understood without considering state repression against the mass political upheaval of the 1960s. Large-scale arrests and authoritarian response by police during Watts paved the way for this new repressive era marked by federal and local cooperation in law enforcement and the widespread use of military hardware for crowd control. The political backlash against Watts, subsequent urban rebellions, and the Black Power movement more broadly are crucial to understanding the rise not only of bipartisan support for law and order, but of the contemporary carceral state. Understanding the choice of the term “carceral state” requires some context. Its roots lie in a parallel movement in the university that has anticipated mass protest in the streets over police killings and subsequently flourished as protests have grown. Michel Foucault first popularized the term with the publication of Discipline and Punish in the mid-1970s. More recently, American academics have embraced the term carceral, from the Latin carceralis or carcer, of or belonging to prison, in order to identify a wide range of punitive state actions. These include aggressive policing; racist criminalization; moral panics and targeted punishment campaigns against illicit or informal economies; modes of incarceration across vectors of age, race, sex, gender conformity, and legal status; courts, prosecution, and parole; jails, prisons, asylums, and other forms of social immobilization; the school-to-prison pipeline; border patrol and immigrant detention; public and private surveillance; as well as restrictive and means-tested social service policies. This broad and capacious view of punishment has been chosen in order to analyze not only mass incarceration, but a more seismic shift from a redistributive to a punitive state in which carcerality, like the militarization of policing, saturates even the social welfare functions of governance in the late twentieth century. Los Angeles is so significant to this process because in many ways, as Mike Davis argued in City of Quartz , it is the paradigmatic carceral city. And this is nowhere more clear than in the periods spanning Ronald Reagan’s governorship and presidency. Just as the post-Watts militarization of police laid the foundation for the contemporary carceral state, under Reagan’s intensified wars on crime, drugs, and gangs in the 1980s, the martial imperative of southern California law enforcement grew stronger. According to the Los Angeles ACLU, “the political rhetoric about a ‘war’ on drugs and a ‘war’ on crime … helped turn the police into soldiers — not civil servants or guardians of the community order — making them sometimes more aggressive and forceful than they have a right to be in pursuit of criminals and suspects.”\nDomestic Wars The legacy and effects of the drug war are central to understanding the origins of the burgeoning movement inside the United States against state-sanctioned violence. In 1971, President Nixon coined the phrase the “war on drugs,” but in reality, it was neither a single coherent entity nor a war itself, but rather a succession of executive-sponsored domestic and transnational punitive campaigns that vastly expanded in the Reagan and Bush eras, but have also been ratcheted up under Democrats Bill Clinton and, arguably, our first black president, Barack Obama. At the federal, state, and local levels, this carceral turn in government resulted in the criminalization of large segments of the US population for illicit drug consumption, possession, and distribution. Indeed, in California like the rest of the nation, the war on drugs became the primary engine driving mass incarceration. As in the earlier era of protest and urban rebellion, Los Angeles proved integral to this national development. Arguably, it became the most important theater of the Reagan/Bush war on drugs. Federally funded, punitive campaigns against drugs and gangs helped erect a new martial infrastructure in the city, and the state applied the brunt of militarization unequally by focusing on historic African-American and Latino neighborhoods in South Central Los Angeles. Indeed, by 1992, the Los Angeles Sheriff’s Department gang database listed nearly half of African Americans between the ages of twenty-one and twenty-four in Los Angeles County as gang members. Los Angeles’ high-profile war on drugs reflected the policies of President Reagan’s national punishment campaign, including saturation policing, eradication of youth gangs, civil forfeiture, federalization of drug charges, and strict enforcement of mandatory minimum sentencing. At the street level, the use of massive police sweeps with spectacular displays of overwhelming force embodied the city’s militarized vision of law enforcement, as did Chief Daryl Gates’s repeated calls to arms. When the LAPD police chief testified before the Senate Judiciary Committee in Washington DC, he argued, “The casual drug user ought to be taken out and shot.” Behind his bombastic rhetoric lay a larger truth. In an era of drastic reduction of social services and deindustrialization, mass incarceration fueled by anti-drug and gang campaigns became de facto urban social policy for the residents of impoverished communities of color. The prescription for widespread joblessness and the illicit economies that accompanied urban divestment was simply to remove large numbers of people from the streets through prison warehousing. The United States’ multiple wars on drugs worked in symbiosis with related punitive campaigns against gangs, crime, and in the later years, terrorism. In Los Angeles, for example, much of the carceral infrastructure for the city’s war on drugs relied on geographically targeted gang sweeps together with anti-gang legislation and prosecution tools. By conflating drug crimes with street-gang membership, law enforcement set up a comprehensive net for the criminalization of nonwhite youth. Defining the war on drugs as a war on gangs justified the criminalization of everyday life in black and brown Los Angeles and other cities across the country. Modes of dress, movement, color of shoelaces, hand gestures, and mere association became defined as prosecutable offenses. Racially targeted policing combined with the denial of legal representation made it virtually impossible for youth to remove their names from gang databases. Anti-gang injunctions also relied on the poverty of their targets, who could rarely afford to hire lawyers. While anti-gang injunctions and databases provided mechanisms for surveillance, control, and the assumption of large numbers of minority youth into “the system” for minor offenses, ultimately gang enhancement legislation contributed even more to mass incarceration. In 1988, the California legislature passed the Street Terrorism and Prevention Act (STEP), which mandated that persons convicted of crimes who have been designated as gang members face additional charges and sentencing. In the initial 1988 law, prosecutors could “enhance” gang members’ sentences with from one to five years of additional time in state prison per offense. Subsequently, California’s Proposition 21 amended the STEP Act in 2000 by increasing gang enhancements from sixteen months to five years for nonviolent offenses and to ten, fifteen, twenty, and twenty-five years to life for violent offenses. The dense layering of STEP, including added prison time for gun charges and for crimes committed within one thousand yards of a school, meant that it was not uncommon for very young offenders to receive multiple consecutive life sentences. This repressive legal regime worked in tandem with the LAPD’s spectacular shows of force, mass arrests, and saturation policing. In the second week of April 1988, the police set up an impromptu holding facility in the Los Angeles Coliseum and proceeded to arrest over 1,400 people, including more African-American youth than in any other single incident since the Watts Rebellion in 1965. Over the course of the next six months, law enforcement jailed over 18,000 people. The scale and size of arrests in Los Angeles’ street-level drug war paralleled the repression following the Watts Rebellion. Unfortunately, while LA represents a particularly brutal historical theater of the drug war, America’s “second city” telescoped the future of the nation as a whole. In 2013, the Department of Justice estimated that 51 percent of those in federal prison were serving time for drug offenses.", "url": "https://www.jacobinmag.com/2015/08/ferguson-police-black-lives-matter/"}