{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:57:27", "date_modify": "2020-05-04 16:57:27", "date_publish": "2015-05-27 23:00:04", "description": "View the Bernie Sanders Fast Facts on CNN and learn about the 2020 presidential candidate and senator from Vermont.", "filename": "2015_05_27_us_bernie-sanders-fast-facts_index_1588611447.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150815171403-bernie-sanders-iowa-state-fair-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2015_05_27_us_bernie-sanders-fast-facts_index_1588611447.html", "title": "Bernie Sanders Fast Facts", "title_page": "Bernie Sanders Fast Facts - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here is a look at the life of US Senator Bernie Sanders, an independent senator from Vermont and former 2020 presidential candidate.\nPersonal\nBirth date: September 8, 1941\nBirth place: Brooklyn, New York\nBirth name: Bernard Sanders\nFather: Eli Sanders, a paint salesman\nMother: Dorothy (Glassberg) Sanders\nMarriages: Jane (O'Meara) Sanders (1988-present); Deborah (Shiling) Messing (married and divorced in the 1960s)\nChildren: With Susan Mott: Levi; stepchildren with Jane (O'Meara) Sanders: Heather, Carina, David\nEducation: Attended Brooklyn College, 1959-1960; University of Chicago, B.A. in political science, 1964\nOther Facts\nAlthough independent in the US Senate, Sanders has run as a Democrat in his two bids for the presidential nomination, in 2016 and 2020.\nHis father's family died in the Holocaust.\nDuring the 1960s, he spent half a year on a kibbutz in Israel.\nWas a member of the Young People's Socialist League while at the University of Chicago.\nThe longest serving independent member of Congress in American history.\nSanders applied for conscientious objector status during the Vietnam War\nTimeline\n1972, 1976, 1986 - Unsuccessful bids for governor of Vermont.\n1972, 1974 - Unsuccessful bids for the US Senate.\n1981 - Wins the race for mayor of Burlington, Vermont, by 10 votes, running as an independent.\n1981-1989 - Mayor of Burlington for four terms.\n1988 - Unsuccessful bid for the US House of Representatives.\n1990 - Wins a seat on the US House of Representatives by about 16% of the vote.\n1991-2007 - Serves eight terms in the US House of Representatives.\n1991 - Co-founds the Congressional Progressive Caucus.\n2006 - Wins a seat on the US Senate with 65% of the vote.\nJanuary 4, 2007-present - Serves in the US Senate.\n2012 - Wins reelection for a second term in the US Senate. Receives 71% of the vote.\n2013-2015 - Serves as chairman of the Senate Committee on Veterans' Affairs.\nApril 30, 2015 - Announces his run for the Announces his run for the Democratic presidential nomination in an email to supporters and media.\nJuly 12, 2016 - Endorses Hillary Clinton for president.\nAugust 21, 2017 - Sanders pens a Sanders pens a commentary article in Fortune magazine outlining his health care proposal \"Medicare-for-all.\"\nFebruary 26, 2018 - Sanders' son, Sanders' son, Levi Sanders, announces he is running for Congress in New Hampshire. He later loses his bid in the Democratic primary.\nNovember 6, 2018 - Wins reelection to the US Senate for a third term with more than 67% of the vote.\nJanuary 2, 2019 - The New York Times reports that several women who worked on Sanders' 2016 presidential campaign had come forward alleging they had experienced sexual harassment, pay disparities and targeted disrespect by campaign members. The New York Times reports that several women who worked on Sanders' 2016 presidential campaign had come forward alleging they had experienced sexual harassment, pay disparities and targeted disrespect by campaign members. Sanders immediately responds to the allegations, claiming that he was not aware of any of the claims and apologizes to \"any woman who feels like she was not treated appropriately.\"\nFebruary 20, 2019 - According to his campaign, Sanders raises nearly $6 million in the first 24 hours following the launch of his 2020 presidential bid.\nMarch 15, 2019 - , making it the first major party presidential campaign to employ a formally organized workforce. Sanders' presidential campaign staff unionizes , making it the first major party presidential campaign to employ a formally organized workforce.\nAugust 22, 2019 - Sanders unveils his $16.3 trillion Sanders unveils his $16.3 trillion Green New Deal plan.\nOctober 1, 2019 - After experiencing chest discomfort at a campaign rally, After experiencing chest discomfort at a campaign rally, Sanders undergoes treatment to address blockage in an artery. He has two stents successfully inserted.\nOctober 4, 2019 - The Sanders campaign releases a statement that he has been discharged from the hospital after being The Sanders campaign releases a statement that he has been discharged from the hospital after being treated for a heart attack. \"After two and a half days in the hospital, I feel great, and after taking a short time off, I look forward to getting back to work,\" Sanders says in the statement.\nFebruary 27, 2020 - Sanders' presidential campaign challenges the results of the Iowa caucuses partial recount just hours after the state's Democratic Party releases its results. In a complaint sent to the Iowa Democratic Party and Democratic National Committee, the Sanders campaign claims the state party violated its own rules by allowing the Buttigieg campaign to partake in the process because they didn't meet the proper requirements.\nFebruary 29, 2020 - , with Sanders coming in second behind Buttigieg and picking up 12 pledged delegates to Buttigieg's 14. The certification by the party's State Central Committee includes a 26-14, vote, saying the party violated its rules by complying with the Buttigieg campaign's partial recanvass and recount requests. The Iowa Democratic Party certifies the results from the state's caucuses , with Sanders coming in second behind Buttigieg and picking up 12 pledged delegates to Buttigieg's 14. The certification by the party's State Central Committee includes a 26-14, vote, saying the party violated its rules by complying with the Buttigieg campaign's partial recanvass and recount requests.\nApril 8, 2020 - Announces he is suspending his presidential campaign.", "url": "https://www.cnn.com/2015/05/27/us/bernie-sanders-fast-facts/index.html"}