{"authors": ["Jason Farbman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:57", "date_modify": "2020-05-04 19:54:57", "date_publish": "2015-12-17 00:00:00", "description": null, "filename": "2015_12__1588622097.html", "image_url": "https://images.jacobinmag.com/2015/12/17010600/zuck3.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_12__1588622097.html", "title": "We Don’t Want Mark Zuckerberg’s Charity", "title_page": "We Don’t Want Mark Zuckerberg’s Charity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The media-as-public-relations-machine was in full swing last week, abuzz over Mark Zuckerberg and Priscilla Chan’s public letter to their daughter that contained a $45 billion pledge to establish the Chan Zuckerberg Initiative.\nThe mainstream media produced an avalanche of praise. “Mark Zuckerberg Philanthropy Pledge Sets New Giving Standard,” announced Bloomberg Business, who declared that Zuckerberg and Chan were “setting a new philanthropic benchmark by committing their massive fortune to charitable causes while still in their early thirties.” From the Wall Street Journal came more praise: “Mark Zuckerberg and Priscilla Chan to Give 99% of Facebook Shares to Charity.”\nBut when BuzzFeed revealed the Chan Zuckerberg Initiative was not a nonprofit, but a for-profit Limited Liability Corporation (LLC), which has no obligation to actually engage in charitable activity, the tenor of some of the commentary became more negative. Was the donation to a Delaware-based LLC nothing more than a way to duck California taxes?\nThe truth is that both nonprofit and for-profit charities can and do serve as tax shelters for the obscenely wealthy. Non-profits themselves have few restrictions around them, and only require that 5 percent of a foundation’s assets each year be spent towards its stated charitable goals, including expenses and lobbying.\nStill, in the last few years we’ve seen the growth of ventures like Google.org, the charitable but largely for-profit division of Google created in 2006 with $900 million worth of Google stock. Freed from the even the limited guidelines to which nonprofits are held, some of the projects Google.org has poured money into have happened to also generate mountainous profits for Google.\nFor example, the One Laptop Per Child initiative’s stated mission to get $100 computers into the hands of “each and every one” of the world’s poorest children also captures lucrative data from millions of new computer users in almost entirely untapped markets.\nSimilar to Google.org, the Chan Zuckerberg Initiative chose a form that would allow them to invest in profit-making initiatives, including ones that could bring new profits to Facebook. Chan and Zuckerberg’s pledge to give everyone on earth access to the Internet, like the One Laptop Per Child initiative, will both provide real services for a great many people while simultaneously creating millions of new potential Facebook users (although they do perhaps overstate with the claim, “If our generation connects them, we can lift hundreds of millions of people out of poverty”).\nAt the same time, Chan Zuckerberg can take advantage of their status as a tax-qualified charity to save huge sums of money. As Forbes observed:\nThis generosity is also incredibly tax efficient . . . Donating appreciated stock is a much better tax move than selling it and donating the sales proceeds. After all, by donating the stock, the gain he would have experienced on selling it is never taxed . . . since [Chan Zuckerberg] is a tax-qualified charity, if it sells the stock it pays no tax regardless of how big the gain. And since Mr Zuckerberg will get credit on his tax return for the market value of what he donates, he can use that to shelter billions of other income.\nOf course, sizable donations to charity frequently receive glowing press coverage which is also quite valuable. The transformation of Bill Gates’s reputation — Zuckerberg’s childhood hero — after creating the Bill and Melinda Gates Foundation is instructive.\nThroughout the 1990s Microsoft’s hyperaggressive business practices resulted in a 2000 Justice Department verdict that Microsoft was a monopoly. Several billion dollars in fines from myriad US and European regulatory bodies followed and Bill Gates was widely painted as a bully in the popular press.\nThe PR turnaround afforded by the Bill and Melinda Gates Foundation might be the most effective — and expensive — in history. Today Bill Gates is treated by the media as an important thinker in the fight against disease and the debates around education reform. He is regarded as a humanitarian with something to say about making the world a better place, a regard that stands in contrast to his actual commitments.\nSince the early days of Microsoft, Gates has ardently supported patent law and its enforcement, which puts medicines out of reach for most, particularly in the Global South. He has also thrown millions at a host of education initiatives that are so anti-teacher that the American Federation of Teachers recently announced they would no longer take money from the Gates Foundation.\nZuckerberg has already attempted to use a big donation to improve his reputation and that of Facebook, which has repeatedly been caught capturing private information with the intention to monetize it. His $100 million donation to charter schools in Newark was timed just weeks after the release of the Zuckerberg biopic The Social Network, and right before the release of charter school booster documentary Waiting for Superman. Time will tell what this latest attempt at reputation management does for Zuckerberg’s public standing.\nEveryone has ideas about how the world should be different and those with vast fortunes have an inordinate amount of power to realize those visions. Sometimes the vision is for a cause like fighting malaria or providing homeless shelters. Other times it’s more self-interested, like when Bill and Melinda Gates put Windows computers in high schools, keeping Macs out and training a generation to use Windows machines.\nMore importantly, the concentration of so much power and reach in the hands of billionaire philanthropists presents real problems for democracy. Every dollar a billionaire realizes in “tax savings” is a dollar starved from the public coffers. The tens of billions Zuckerberg would pay in taxes could go a very long way to, say, enhancing the $69 billion budget allocated for public education this year.\nWhile the US government is certainly not a bastion of democracy, there are at least formal mechanisms that put tax-based, public funding in the realm of democratic decision-making. There are public budget proposals, hearings, and votes, and elections through which we can attempt to hold politicians accountable for their actions. We’ll most likely only have a vague idea what is happening with the money controlled by the Chan Zuckerberg Initiative; their LLC status will allow them to avoid making many tax documents public.\nThese sorts of charitable enterprises give even more control to capitalists — who already have outsized influence in our society — putting them in positions to make decisions that increasingly shape public life for all of us. People like Zuckerberg and Gates are unelected and unaccountable to anyone and face few, if any, repercussions for the negative consequences of their social experiments.\nZuckerberg’s education initiative exemplifies this outsized and damaging role. Despite his limited personal experience with public school — he attended the elite Phillips Exeter Academy and then Harvard — Zuckerberg has begun to commit serious sums of money to reforming public education. His signature donation was $100 million to replace Newark’s public schools with charters. Working with former Newark mayor Corey Booker and Republican Governor Chris Christie, the goal was to completely transform Newark’s schools in five years, and turn them into a model for restructuring other districts across the country.\nIn order to achieve reforms quickly, they had to bypass the process of public engagement. Free from the constraints of government deliberation, the plans of the nonprofit foundation were not made public until after key decisions had been made. Newark residents first learned about the program the afternoon Booker, Christie, and Zuckerberg announced it on Oprah.\nOnce the foundation was established, seats on its board were awarded to those who contributed more than $5 million. “A local philanthropist offered $1 million,” reported Diane Ravitch, “but he was turned away because the amount was too small.”\nThe Newark experiment was a resounding failure and did little more than line the pockets of consultants. Test scores didn’t rise considerably, teachers resisted merit pay, and the woman hired to run the district refuses to attend School Board Advisory meetings because they are still too hostile. The debacle still follows Zuckerberg. Last week, many of the most glowing reports of his $45 billion donation had to mention his previous philanthropic endeavor.\nZuckerberg has continued to make investments in education since Newark, claiming he’s learned from the experience and wants to improve. Still, he’s just one relatively new player in the education reform movement.\nThe Gates Foundation has spent hundreds of millions of dollars trying to restructure the US public school system, with $200 million going to Common Core — a curriculum initiative opposed by educators and parents across the country. Eli Broad Foundation has also spent lavishly — including a nearly $500 million plan to put half of Los Angeles students into 260 new charter schools. The Walton Foundation has spent over $1 billion supporting charters and vouchers.\nThe war on public education by the ultra wealthy — using tax-sheltered dollars which otherwise might have gone to improve public education — reveals a deep hostility to democracy.\nWe should demand better: Instead of waiting to see how his charity will impact our lives, Zuckerberg’s wealth should be put under democratic control, so we can collectively decide how it can be used to improve society.", "url": "https://www.jacobinmag.com/2015/12/facebook-zuckerbergs-charity-gates-philantrophy/"}