{"authors": ["Keeanga-Yamahtta Taylor", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:21", "date_modify": "2020-05-04 19:50:21", "date_publish": "2015-05-17 00:00:00", "description": null, "filename": "2015_05_baltimore-uprising-protests-freddie-gray-black-politicians_1588621821.html", "image_url": "https://images.jacobinmag.com/2015/05/17003743/11010529_10204370281677369_5605145168490003366_o-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_05_baltimore-uprising-protests-freddie-gray-black-politicians_1588621821.html", "title": "Black Faces in High Places", "title_page": "Black Faces in High Places", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "This year marks the fiftieth anniversary of many of the most significant events of the Black Freedom Struggle of the 1960s. Two years ago, we celebrated the March on Washington; last year we recognized the 1964 Civil Rights Act that ended Jim Crow apartheid in the South. This year, we have already seen commemorations of the anniversary of the Voting Rights Act, and summer’s end will see the fiftieth anniversary of the Watts Rebellion in Los Angeles.\nOf course, the country had seen rebellions in Rochester, New York; Philadelphia; and Trenton, New Jersey, to a name a few cities, in 1964, but up to that point, Watts was unprecedented in its scale, damage, deaths, and sheer ferocity in the summer of 1965. The uprising in South Central Los Angeles represented a stark conclusion to the nonviolent phase of the movement.\nThe acrid plumes of smoke that hung over the city of Baltimore are a stark reminder of the recent past of the 1960s. But the riots over the death of twenty-five-year-old Freddie Gray seen in Baltimore last week aren’t simply a replay of events that took place fifty years ago.\nThe inequities that ignited hundreds of American cities in the 1960s still exist and have, in fact, deepened over the last half century. Then as now, pervasive police violence and harassment defines the humiliation and powerlessness of life for millions of working-class and poor African Americans.\nBut what makes the Baltimore uprising different from an earlier era is that the vicious attacks on African Americans have unfolded at a time of unprecedented black political power.\nFewer than forty miles from Baltimore, in the nation’s capital, resides the nation’s first African-American president. There are forty-three black members of Congress and two senators — the highest number of black Congress members in American history. And just as the West Side of Baltimore was erupting against the police killing of Freddie Gray, Loretta Lynch became the first black woman appointed as attorney general.\nThis isn’t only a national phenomenon; it’s also reflected in local politics. In Baltimore, African Americans control virtually the entire political apparatus.\nMayor Stephanie Rawlings-Blake and Police Commissioner Anthony Batts have been the most prominent faces of political power in Baltimore over the last several weeks. But Baltimore’s city council has fifteen members, and a majority — eight — are African American, including its president. The superintendent of the public schools and the entire board of the city’s housing commission are African American. Across the United States, thousands of black elected officials are governing many of the nation’s cities and suburbs.\nIn this respect, the events in Baltimore are dissimilar from what happened in Ferguson, Missouri last summer. There, the small suburb just north of St Louis had a majority black population largely governed by a white suburban government, and the lack of black political power and representation became a narrative thread in popular explanations for what went wrong. Electing African Americans into political office in Ferguson thus became a focal point for many local and national activists.\nBut if the murder of Mike Brown and the rebellion in Ferguson was reminiscent of the old Jim Crow, then the murder of Freddie Gray and the Baltimore uprising is symbolic of the new black power.\nIn fact, pursuit of black electoral power became one of the principal strategies that emerged from the Black Power era. At the end of the 1960s, the calls for “community control” over the cities that black people lived in became louder. Such calls made sense: the “Great Migration” brought millions of African Americans into the nation’s cities and helped to elevate black concerns into political discussion (though they were rarely acted upon) and transformed many metropolitan demographics as blacks moved in and whites moved out.\nWhite political control of increasingly black cities exacerbated existing tensions over those cities’ conditions. In cities like Chicago, the patronage machine could draw in some black participation, but that hardly resembled any real black political or economic control of the city’s infrastructure. The destruction and instability caused by urban rebellions over the course of the decade advanced the idea among elites that perhaps more black control and ownership within the cities might help to calm the rebellious black population.\nToday, we have more black elected officials in the United States than at any point in American history. Yet for the vast majority of black people, life has changed very little. Black elected officials have largely governed in the same way as their white counterparts, reflecting all of the racism, corruption, and policies favoring the wealthy seen throughout mainstream politics.\nBaltimore is a telltale example. Mayor Rawlings-Blake may be African American, but under her leadership, large swaths of black Baltimore have remained poor, unemployed, and perpetually harassed and abused by the police.\nIn the last four years alone, more than one hundred people have won civil suits against police brutality. During Rawlings-Blake’s tenure, the city has been forced to pay $5.7 million to settle civil suits regarding police misconduct and brutality — an amount that does not include the $5.8 million Baltimore has paid to defend police who have abused the black public.\nDespite the lawlessness of the Baltimore Police Department, the mayor reserved her harshest comments for those involved in the uprising, describing them as “criminals” and “thugs.” For anyone remotely aware of Rawlings-Blake’s mayoral history, her lashing out at the victims of police corruption and brutality would not have been surprising.\nEven though unwarranted police attacks had been widely documented and adjudicated, a month prior to the unrest in Baltimore, the mayor blamed black men for violence in Baltimore. Invoking her inner Rudy Giuliani, Rawlings-Blake said of violence in the city: “Too many of us in the black community have become complacent about black-on-black crime. …While many of us are willing to march and protest and become active in the face of police misconduct, many of us turn a blind eye when it’s us killing us.”\nIgnoring the long history of racism and the epidemic of police terrorism in shaping black life in Baltimore, the mayor, as has become typical of the black political elite, blamed the problems of the city on the African Americans who live there.\nThe major difference between life in cities like Baltimore today and fifty years ago is not only the existence of a black political stratum that governs and manages much of black America, but also the ways this powerful black political class helps to deflect a serious interrogation of structural inequality and institutional racism. Instead, leaders from that political class resurrect old and convenient narratives that indict black families and culture as the central explanation for persistent racial inequality.\nTo maintain legitimacy within the Democratic Party, which most of these black politicians consider home, they toe the party line that emphasizes personal responsibility and rejects raising taxes to fund desperately needed social programs.\nAnd black elected officials either create or widen the space for whites to interrogate the moral habits of ordinary black people. When President Obama, Mayor Rawlings-Blake, and Attorney General Lynch refer to black protestors as “thugs” and “criminals,” white Republicans do not have to.\nBlack elected officials often invoke a sense of racial solidarity, familiarity, and insight into the lives of the black poor and working class — only to then chastise or blame ordinary African Americans for deteriorating conditions in their own neighborhoods.\nThis is not just a product of contempt for the black poor, but also the result of the pressures of governing big cities in an age of austerity. Cities have been thrust into competition with each other to attract capital, resulting in a race to the bottom to cut taxes and essentially shove out those in need of social services.\nFocusing on individual failure and lapsed morality (rather than structural inequities) justifies the budget cuts and shrinking of the public sphere that these black political elites are charged with carrying out. What African Americans in cities around the country need, according to this narrative, is personal transformation, not expanded social services.\nBlack political operatives operate in the same terrain as their white competitors. They compete to stay in the good graces of wealthy donors while maximizing political connections to bolster their campaign war chests. They, too, rely on aggressive policing to make up for the social problems created when poverty, gutted social services, and no prospects for success in American society converge and eventually combust.\nThe uprising in Baltimore has crystalized the deepening political and class divide in black America. This is a new development in the black freedom struggle that historically has been united across class lines to fight racism.\nFrom the White House to city halls across the country, the growth and maturation of the black political class has firmly placed them in a position of managing the crises that continue to unfold in black neighborhoods across the country. Black political operatives have no better solutions for ordinary African Americans than any other elected officials.\nIn Ferguson and now in Baltimore, it’s the movement in the streets that is bringing global attention to the racism and inequality that still thrives in American society — not black faces in high places.", "url": "https://jacobinmag.com/2015/05/baltimore-uprising-protests-freddie-gray-black-politicians"}