{"authors": ["Linsey Mcgoey", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:43", "date_modify": "2020-05-04 19:54:43", "date_publish": "2015-10-17 00:00:00", "description": null, "filename": "2015_11_philanthropy-charity-banga-carnegie-gates-foundation-development_1588622083.html", "image_url": "https://images.jacobinmag.com/2015/10/17010153/illo-mcgoey.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_11_philanthropy-charity-banga-carnegie-gates-foundation-development_1588622083.html", "title": "The Philanthropy Hustle", "title_page": "The Philanthropy Hustle", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nMeet Ajay Banga. The son of an Indian army officer, Banga was born in Khadki, a cantonment a few hours outside Mumbai. After studying economics at Delhi University, he took an MBA from the Indian Institute of Management and began an illustrious career working for corporate giants like Nestlé and PepsiCo. In 2010, Banga was appointed CEO of Mastercard, headquartered in Purchase, New York. He is one of only a handful of Fortune 500 heads to complete his primary, secondary, and post-secondary education entirely in India. Banga took on a healthy company and made it even more profitable. In 2009, Mastercard earned a profit of $1.5 billion on revenues of $5.1 billion. In 2013, profit reached $3.1 billion on revenues of $8.4 billion. The company’s stock has jumped 330 percent over the past five years. He’s been rewarded well for his efforts: last year Banga took home over $13 million and cemented his status as a darling of the business press, saluted in magazines like Fortune , and named the world’s “Top Wealth Creator” by Chief Executive magazine. He specializes in innovation. At least, that’s what business papers proclaim: Banga has “doubled down on technology,” “launched an in-house innovation arm,” and introduced Mastercard Contactless, a new wireless payment system. Most innovatively of all, he has narrowed his gaze on the world’s 2.5 billion “unbanked” inhabitants. As a feature in Fortune describes, Banga realizes that “much of the opportunity for the company is in parts of the world where a digital wallet is still decades away.” He’s at the forefront of a growing group of business leaders who appreciate that there are profits to be made in global poverty. What Fortune doesn’t add is where the money for Banga’s investments in the “unbanked” masses is coming from. A good deal of it is, in fact, not coming from the company he leads. It’s not coming from Mastercard shareholders, and it’s certainly not coming out of his ever-expanding pay packet. It’s coming from the coffers of the world’s most powerful philanthropic organization: the Bill and Melinda Gates Foundation. In 2014, the Gates Foundation announced an $11 million grant to Mastercard to establish a financial inclusion “lab” in Nairobi, Kenya. The grant will last three years, after which Mastercard has indicated that, should the venture prove sufficiently lucrative, the company may be willing to foot the bill for further financial expansion in the region. Mastercard’s management rationalized the grant in economic terms: investing in developing nations such as Kenya is risky, and there’s no guarantee that investments will pay off. As Mastercard explains in a press release, the money from the Gates Foundation enables the company to reach “new markets that may otherwise be commercially unviable.” The gift to Mastercard — and it is a gift, rather than a loan or an equity investment — is the latest in a long list of donations that the Gates Foundation has offered to the world’s wealthiest corporations. From Vodafone, a British company notorious for paying zero corporate tax in the United Kingdom, to leading education companies such as Scholastic Inc., the Gates Foundation doesn’t simply partner with for-profit companies: it subsidizes their bottom-line.\nThe Business of Altruism Increased charitable giving to the world’s wealthiest corporations is simply one novel aspect of a much bigger phenomenon: the growing power and clout of private philanthropic actors over global institutions such as the World Health Organization. With an endowment of $42 billion, the Gates Foundation spends about $3 billion each year towards causes that, at first glance, seem irreproachable. But the giving has hidden costs. Take donations towards the World Health Organization. In 2013, the Gates Foundation gave over $300 million to the UN health agency — the largest contribution from any donor that year, including the US government. What the Gates Foundation spends on global development yearly is almost as much as the overall operating budget of the WHO, and that doesn’t include its other philanthropic programs. The foundation expects something in return for its efforts. As Laurie Garrett suggested in a 2012 Foreign Affairs article, “few policy initiatives or normative standards set by the WHO are announced before they have been casually, unofficially vetted by Gates Foundation staff.” Some people argue this is a positive development. The Gates Foundation is praised often for its results-oriented philanthropic approach. Peter Singer, the controversial Australian philosopher who helped launch the “effective altruism” movement, has praised Gates and Warren Buffett for being the “most effective altruists” in history. The problem is that there’s little evidence to back this remarkable assertion. On the one hand, there’s no doubt that the Gates Foundation has done some good in the field of global health. But at the same time, it’s clear that, whatever the opinions of Singer and others, the foundation is not spending its money on the largest global health killers. Until recently, Gates was not even a proponent of a decades-long goal — championed since the WHO’s 1978 Alma-Alta Declaration — to strengthen primary health care systems and achieve universal health coverage. Far from being uniquely “effective,” grants made by the Gates Foundation “do not reflect the burden of disease endured by those in deepest poverty,” as the editors of the Lancet , the world’s leading medical journal, pointed out in 2009. The Gates Foundation has also aggressively called for US-based multinationals such as Monsanto to gain a stronger foothold in African nations, a move that worries observers like Daryll Ray, an agriculture expert based at the University of Tennessee, who fear the economic consequences of the foundation’s interventions for small farmers: [We need] to take farmers exactly where they are at the moment, and help them be more productive using their knowledge, and technology that would be appropriate to add to it, and then gradually move them into a higher rate of production, rather than talking about them buying Monsanto products, or other kinds of products that they can’t afford and have to buy every year, as in the case of hybrid seed. Criticism has also come from unexpected corners: Howard Buffett, the eldest son of Berkshire Hathaway CEO Warren Buffett, suggested on 60 Minutes in 2011 that the Gates Foundation’s bullish optimism about hybrid seeds is blind to the circumstances of developing nations: “We need to quit thinking about trying to do it like we do it in America.” In a 2011 book chapter, Oxford health economist David Stuckler and his colleagues argue that “global health is ruled by a few private donors who make decisions in secret. The capacity to decide what is relevant and how it will be addressed is in the hands of very few, who ultimately are accountable to their own interests.”\nAlms for the Wealthy The phrase “corporate philanthropy” seems destined to reside permanently inside a set of scare quotes: many progressives can’t bring themselves to utter the term without visible contempt. Defined as the charitable donation of corporate profits or resources to non-profit entities, it is seen as a whitewashing tool, as a way for a company to curry public legitimacy while diverting attention from its more unsavory practices. But this definition misses how corporate philanthropy has evolved. More and more, corporate philanthropy is not about corporations giving money to charity. Companies actually do remarkably little of that. As a 2002 Harvard Business Review article pointed out, over the previous fifteen year period, charity by US companies as a percentage of profits fell by 50 percent. More recently Slate reported that corporate giving had nosedived from a high of 2.1 percent of pre-tax profits during the mid 1980s to just 0.8 percent in 2012. Corporate philanthropy today is about private, tax-exempt donors such as the Gates Foundation giving their charity to corporations. The Gates Foundation is not the only philanthropic foundation offering donations to for-profits such as Mastercard. Other institutions such as the Ford Foundation have also given direct donations to for-profit firms, especially media companies, while the Wellcome Trust, Britain’s largest philanthropic organization, often makes grants to pharmaceutical companies. But the pace and scale at which the Gates Foundation has ramped up its donations to corporations has increased at such a speed that some of the most thoughtful experts on philanthropy aren’t even aware of the practice. To understand the novelty of the Gates Foundation’s grants to companies such as Mastercard, it’s useful to know what the grants are not. These are not endowment investments. Over the years, the Gates Foundation has faced a steady chorus of complaints for its penchant for investing its endowment in the same companies that perpetuate the environmental and health problems that its gift-giving aims to ameliorate. This practice is different, however. The Mastercard donation is also not an equity investment, either. They are donations that help to reduce corporate overhead, allowing some of the world’s wealthiest companies to offset the cost of expanding in new markets. Companies are not obligated to repay the grants, regardless of how profitable the gifts end up being. The Gates Foundation’s donations are just that: donations. For the corporations, they’re a freebie. For US taxpayers, they are a drain on public money.\nCorporate Solidarity The practice of philanthropic foundations subsidizing for-profit corporations is at once widely trumpeted — Mastercard issued a media release celebrating its gift from the Gates Foundation — and strangely unknown. Leading historians, sociologists and philosophers of philanthropy seem unaware of the phenomenon. A recent series of articles in Boston Review on the power and transparency of philanthropic foundations is instructive. The 2013 forum, titled “What are Foundations For?” was anchored by a lead article written by Rob Reich, a political scientist based at Stanford University who has raised some of the most thoughtful criticisms of large-scale philanthropic giving to date. Reich points out that little philanthropic spending actually reaches low-income individuals: the vast majority of foundation dollars go to well-endowed university alma maters; to cultural institutions frequented by the wealthy; to religious institutions that are free to hoard wealth rather than disburse it. Noting that philanthropic foundations “are plutocratic by nature,” Reich asks an important question: are unaccountable philanthropic organizations such as the Gates Foundation compatible with democracy? Some of the nation’s most renowned academics — including Pablo Eisenberg, Stanley Katz, Diane Ravitch, and Rick Cohen — offered considered responses to Reich’s article. Their commentaries provide a whistle-stop tour through the terrain of philanthropic management today, giving glimpses into a “wild west” sector that faces little regulatory oversight. Ravitch, a respected education historian, commented that philanthropic spending on public education is dominated by “three new behemoths”: the Gates, Eli and Edythe Broad, and Walton Family Foundations. She suggests that rather than foster a diversity of opinion, these entities are remarkably monolithic in their policy prescriptions and funding patterns, collectively pouring billions into shared efforts to link teacher remuneration to student test schools, increase online charter schools, and reduce collective bargaining rights. Eisenberg, a well-known philanthropy scholar, calls for legislative limits on the size of foundations: reducing their endowment size to no more than $10 or $15 billion. Gara LaMarche, a former executive at George Soros’s Open Society Institute and Chuck Feeney’s Atlantic Philanthropies, suggests that so little philanthropic money is actually trickling down to the global poor that we need to consider whether tax deductions are warranted at all. But curiously none of the fourteen respondents questioned an offhand remark by Reich, halfway through his short piece: “To be sure, foundations must direct their grants to public charities or, in tax parlance, 501(c)(3) nonprofit organizations,” Reich writes, adding that in “the United States, virtually any organization can be structured as a nonprofit so long as it promises not to distribute profits to its owners. So the public charity rule is no limit at all.” He’s right that the definition of nonprofits is extremely broad — almost licentiously so. But it’s not true that foundations must direct grants only to charitable entities. They are free to offer donations to for-profits that fulfill the foundation’s charitable mission — an extremely permissive criterion that donors such as the Gateses are interpreting in novel and unprecedented ways. There’s widespread confusion over exactly when the growing trend of foundation grants towards corporations first started. In 2012, Michael Meyer wrote a Columbia Journalism Review article exploring the Ford Foundation’s announcement of a gift of $1.04 million to the Los Angeles Times to expand its reporting. “A foundation giving money directly to a for-profit to supplement its reporting,” Meyer writes, “[is] unprecedented as far as I know.” But there are precedents. In 2010, the Gates Foundation offered $1.5 million to ABC News and a little over $1.1 million to NBC in 2011 “to support the national education summit.” The following year, the Gates Foundation gave another million to NBC, this time for the more vague purpose of “inform[ing] and engag[ing] communities.” Other for-profit media companies receiving Gates Foundation money in 2012 included Univision — a Spanish language broadcaster whose parent company, Univision Communications pulled in revenues of $2.6 billion in 2014. Traditionally, philanthropic grants to for-profits were rare, but this is no longer the case. The Gates Foundation has offered dozens of grants to for-profit companies around the world, including beneficiaries poised to profit from the Common Core standards. A frequent worry among teachers and parents is that Gates money helps position private firms such as Pearson and Microsoft to benefit from the testing industry that is tightening like a corset around students and teachers. While profiteering by charitable institutions is illegal — in 2013, New York Attorney General Eric Schneiderman’s office reached a $7.7 million settlement with the Pearson Charitable Foundation after the non-profit was found to have misused its charitable funds to generate revenue for Pearson, its corporate parent — precedent suggests that it’s perfectly legal for institutions like the Gates Foundation to hand money to parent corporations directly. Indeed, the Gates Foundation makes similar donations all the time. Scholastic, a company that, like Pearson, is a for-profit education publisher, has received over $6 million in grant money from the foundation. A November 2011 grant of $4,463,541 was designed to support “teachers’ implementation of the Common Core State Standards in Mathematics.” What’s not clear is why this counts as charity. Doesn’t Scholastic stand to gain from the expansion of textbook and testing materials accompanying the Common Core standards? The answer is a clear “yes,” which Scholastic pointed out itself in a 2014 press release lauding the performance of its digital education sector: “In 2014, the company booked $1.82 billion in revenue, a modest increase of 2 percent over the previous year’s $1.79 billion result. Profits were up considerably . . . Scholastic also expects sales of its digital education products to continue to increase. . .” On inquiry Chris Williams, a press officer at the Gates Foundation, responded that fulfilling a charitable objective does not preclude revenue generating activity. . . If a potential grantee is not a public charity and the exercise of expenditure responsibility is required, the foundation exerts all reasonable efforts and has established procedures to see that the grant is spent solely for the charitable purpose for which it was made. Williams is referring to IRS rules that require donors to take responsibility for ensuring grants to for-profits are used exclusively for charitable goals and not for private gain. However, his assurances are called into question by other Gates donations, such as a 2012 grant of $817,468 to Tutor.com, one of the largest online tutoring companies in the nation, to create an “on-demand” professional development system geared at math training for middle and high school teachers. Although Tutor.com’s website clearly indicates that the software has been trademarked, and schools are invited to “get a price quote,” news coverage of the donation never queried whether tying a charitable donation to proprietary tutoring software breaches the IRS stipulation that foundation grants must be used exclusively for charitable ends. Indeed, numerous for-profit education start-ups are indebted to the foundation. Another example, BetterLesson Inc., billed as the “Facebook for educators,” circulates free online lesson plans to teachers but charges schools a service fee. It has received over $3.5 million in grant money from the Gates Foundation. BetterLesson may well prove to be a useful tool for teachers. But it also charges a premium for that service — a cost borne by taxpayer-funded public education institutions. At a time of growing anger over dwindling educational resources in public schools, at a time when extreme poverty is on the rise in the United States — does yet another tech start-up deserve Gates’ charity? Foundation grants to for-profits may not be prohibited by law, but 501(c)(3) regulations clearly state that a private philanthropic foundation must not “be organized or operated for the benefit of private interests.” To remain eligible for tax exemptions, a foundation must engage in grant-making activities where “no part of the net income of which inures to the benefit of any private shareholder or individual.” Obviously, a number of Gates Foundation’s grants have directly benefited private companies, their management teams, and their shareholders. The question is, even if this contravenes IRS private benefit rules, does it really matter? On the one hand, the money going to for-profits is a lot less than grants geared at non-profit organizations – the foundation has given away over $33 billion to date, and the vast majority has gone to non-profits. On the other hand, it’s not just about the money — it’s the precedent. If a grant to Scholastic or Mastercard can be justified as charity — then why not a tax-deductible donation to Goldman Sachs or News Corp or Monsanto? The Gates Foundation has insisted that the private sector should play a stronger role in global development and now regularly subsidizes corporations who want to turn education, health care, and poverty alleviation into business ventures. A few years ago it seemed outlandish that a highly profitable company like Mastercard was receiving philanthropic grants. But the the role of foundations is evolving rapidly and soon it may seem odd that charity was once designated for those living in poverty; those who have no housing; those fleeing situations of domestic abuse; those reliant on food banks; those bankrupted by skyrocketing medical bills, and not to a multinational company taking a taxpayer-funded bet on the idea that what the poor really need is a new credit card.", "url": "https://www.jacobinmag.com/2015/11/philanthropy-charity-banga-carnegie-gates-foundation-development"}