{"authors": ["Herman Rosenfeld", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:57", "date_modify": "2020-05-04 19:57:57", "date_publish": "2015-10-17 00:00:00", "description": null, "filename": "2015_10__1588622277.html", "image_url": "https://images.jacobinmag.com/2015/10/17010027/21614946873_4cc7031b4c_h.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_10__1588622277.html", "title": "Beyond the NDP", "title_page": "Beyond the NDP", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIf the polls are to be believed, Canadian Prime Minister Stephen Harper’s Conservatives have lost ground since the start of the long campaign and are headed for defeat. If these trends continue, Canadian workers might get a respite from a neoliberal offensive that has been unrelenting and far-reaching. And if Harper loses, there would be a potential opening to begin to undo the dramatic right-wing shift that so many on the Left and center of Canadian politics predicted would never happen here. For the Left specifically, Harper’s defeat or weakening would present opportunities to organize collective resistance in and around the labor movement and to raise and deepen demands for renewed social programs, minimum-wage increases, infrastructure, and new challenges to the current social and economic regime. But a number of obstacles will remain: the inability and unwillingness of the electoral opposition — both the social-democratic New Democratic Party (NDP) and the centrist Liberal Party — to present real alternatives; the relative weakness (and lack of radicalism) of labor and other working-class-based social movements; the embedded strength of neoliberalism’s material and ideological gains; and the lack of any organized, class-based, socialist political movement or party with any resonance.\nLiving Under Harper In Canada, the damage done by Harper and his colleagues is everywhere to be seen. The economy is mired in slow growth, if not recession, with an increasing percentage of precarious jobs and terrible living conditions for key components of Canadian working people (in particular, indigenous communities) and the poor in urban centers, small towns, and agrarian areas. The country remains reliant on the extraction and export of raw materials, especially fossil fuels, and most damaging, the huge investments in the tar sands. Ten years of Harper have resulted in a reduction in the size and capacity of the elements of the state that limit private market dependence (health care, public pensions, etc). It has seen lower taxes for the well-off, as well as expanded capital mobility and an open and steady attack on unions and workplace action. It has reintroduced a Cold War–style foreign policy. In addition, there has been a deepening of neoliberalism in state institutions and throughout the economy (for example, new free trade initiatives, conservative judiciary appointments, and cuts to the Canadian Broadcasting Company) and the further cheapening of democratic norms (draconian “anti-terrorism” bills, restrictions on voting rights, new repressive forms of incarceration). Beating Harper should thus be a key goal for socialists, the labor movement, and the broader working class. It would be extremely naive to ignore the danger of another Harper majority, or minority — extended mandates for Margaret Thatcher, as well as Ronald Reagan and George Bush, helped institutionalize key political and structural changes (not to mention transform the cultural environments of the US and Britain). The longer conservatives remain in power, the more difficult and protracted is the struggle to undo the damage and move forward. Polls say that the general population is tired of Harper, and the Senate expenses scandal, intransigence over the Syrian refugee problem, cynical references to “old-stock Canadians,” and dog-whistle appeals to conservative voters reinforce the general cynicism about the Conservative government in spaces outside the party’s base. Harper’s campaign strategy has been to rely on the unprecedented length of the campaign; attack ads against Liberal leader Justin Trudeau and NDP leader Thomas Mulcair; and appeals to narrow interests and exploitation of wedge issues (such as the wearing of the niqab at citizenship swearing-in ceremonies). He has focused on winning over upper-middle-class and some working-class suburbanites; conservative elements within immigrant communities; financial elites satisfied with Tory policies; and western and rural, oil and gas-affiliated financial elites and economic interests.\nThe Electoral Alternatives There aren’t any clear electoral choices that can fundamentally challenge and undo the deep destruction that Harper and those before him wrought. The Liberals were the architects of much of the foundations that Harper built upon: free-trade agreements (NAFTA, others); changes to the structure of the state and cuts to the social wage; deregulation; enhanced capital mobility. And except for a brief interlude, they helped him strengthen military ties with the US in its “war on terror,” enact repressive laws (e.g., C-51, the “anti-terrorism” law), and deepen the country’s reliance on fossil fuels. Trudeau has no plan to change course. He’d merely soften such policies around the edges. His cynical pitch to what he calls the middle class involves running deficits to spend money on infrastructure. But while sorely needed and appearing to outflank Mulcair from the left, it is difficult to see this actually being applied. And his foreign policy shows no real deviation from that of Harper either. Mulcair and the NDP present a series of dilemmas and contradictions for socialists and the broader working class. If elected, they would be the first federal NDP government in Canadian history — whether ruling independently, in minority, or in agreement with or in coalition with the Liberals — and thus the first social-democratic party in power at that level. Though social democracy has moved to the right in the neoliberal era, that would still be significant. An examination of the three parties’ programs shows there are modest reasons to support the NDP. They promise spending increases, including on child care and infrastructure; restoring Post Office home delivery; reducing the pension age; rescinding C-51; increasing the minimum wage; and withdrawing subsidies to oil and gas industries. Mulcair has also stated his refusal to support the new TPP agreement, at least on the basis of its secrecy. All of these are important, and some could open up space for further struggles at the base, such as the minimum wage and Post Office home delivery. Under an NDP government, one would also expect a break from the attacks on civil servants and empirical analysis in state agencies, as well as some restoration of basic state capacities, like bringing back the long-form census. In addition, there would be better relations with First Nations and labor and less direct participation in military interventions (like ISIS bombing). But the fact remains that in key areas, Mulcair and the NDP’s policies aren’t fundamentally different from the status quo. On foreign policy, there’s support for NATO and Israel, and no effort to develop a left approach to international affairs that seeks to lessen international tension, weaken neoliberal capital and its projects, and facilitate the development of peoples and nations in the Global South. We get instead a sort of Harper Lite that dispenses with the most egregious international interventions. On the environment, Mulcair’s commitment to reviews of large projects is not the same as moving away from a fossil-fuel-based economy. The tar sands project remains, along with commitments to refine bitumen — rather than use what the country has to transit to renewables and leave the rest in the ground. On fiscal policy, he’s slavishly devoted to balanced budgets. The Liberals, meanwhile, have dragged out Paul Martin, the former prime minister, to argue that the country would need to borrow in order to get through another major recession or downturn. Mulcair has also refused to increase personal taxes and is calling for a measly 2 percent increase in corporate taxes. Even with the welcome opposition to the TPP, Mulcair still remains committed to free trade and expresses no willingness to challenge the prerogatives of private capital. His rhetorical attacks on Harper’s destruction of the manufacturing sector, in policy terms, only amount to a relatively ineffective series of subsidies to private capital and a rather inexplicable commitment to small business. There’s not a hint of economic planning or gearing a renewed manufacturing effort toward the needs of a different economic model. Moreover, the NDP’s infrastructure spending plan wouldn’t be enough to rebuild a robust public transportation system that serves as a key component of a sustainable urban/suburban development plan. Their plan might even be weaker than the Liberals’. They also devote insufficient resources to building affordable, public, and cooperative housing for working-class people. And we still await proposals to dramatically improve conditions on First Nation homelands, or eliminate poverty, or democratize the state, or nationalize the banks or energy resources. Moreover, many of Mulcair’s proposed reforms wouldn’t take hold for years and would require political agreements with the provinces. Working-class people could see material improvements under an NDP government, but the neoliberal status quo — crappy, insecure jobs; ongoing climate change; dramatic reductions in social programs; no real democratic control over our economic lives; ongoing threats of violence and instability in the international arena; a dramatically unequal world — would remain intact. Much of the NDP’s platform panders to what they describe as the middle class, in an attempt to appear more electable. What they don’t do is build the confidence of the Left and the working class that, if elected, they would actually resist elite pressure to swing right. They don’t educate people about the need to reject neoliberalism and its fundamental principles. And, if the NDP is so fearful of challenging the presuppositions of neoliberalism, if they’re so concerned about incensing financial markets and uncommitted voters, why would they respond any differently to, say, a capital strike when in office? Another alternative to the NDP is the Green Party, which has a few parliamentary seats and is led by the redoubtable Elizabeth May. The Greens’ platform is better in some respects than that of the NDP and Liberals, but the party doesn’t even pretend to embrace the anti-neoliberalism of their Green counterparts in the US. And they have little chance of doing more than picking up some seats and intervening on some issues. To their left, there are smaller radical parties. But they have little resonance in this election.\nWhat Should Be Done? It is clear that no fundamental change will happen as a result of this election. There are no political parties promising a challenge to capitalism, neoliberalism, or austerity or presenting a working-class-oriented strategy that embraces important structural reforms and an alternative vision. Getting rid of Harper is necessary, but that doesn’t mean supporting the Liberals, as their time in office indicates an approach, at least on economic issues, that is similar to the Conservatives’. Their current positioning around deficit spending for infrastructure investment is curiously to the left of the NDP. This could theoretically give the Liberals an opportunity to present themselves as the genuine alternative to Harper, leaving the NDP in the dust. The NDP offers modest improvements that would possibly provide some short-term relief for sections of the working class and deliver some promises that could legitimate key worker concerns (such as the $15 minimum wage). But progress in each of these areas requires important battles being waged by the labor movement and social movements from below. Currently, there are few signs of mass movements on any of these fronts. Unions are divided in their relationship with the NDP, reflecting a recognition of the party’s weakness, a confusion within working-class organizations about how to orient themselves in this era (and a realization that the NDP is just as confused), and the party’s unwillingness and inability to consistently represent working-class interests. In many ways, the NDP actually disorganizes the working class, offering a political vision that relies on the economic and political leadership of private capital and seeks to reinforce a middle-class identity and the separation of the working class’s different components. In fact, it’s hard to know what the party stands for other than getting elected. They’re so spooked by the Conservatives’ framing and so committed to winning over more right-leaning swing voters that they claim they’ll never run a deficit (or undo the odious balanced budget law). And yet everyone knows it is impossible and clearly won’t be done if they get elected. The idea that they have any guiding set of principles that reflects the interests of the working class is long gone. This feeds the cynicism about politics, and dampens movements for change. Unions in Canada tend to have narrow, sectoral approaches to politics and key policies, looking to protect the short-term interests of their members rather than the broader working class. In this period of growing precarity and division within the working class, such parochialism reinforces the notion that unions are privileged, and, in the unionized private sector, induces desperate attempts to strengthen the condition of the employers in their respective sectors. The NDP doesn’t challenge these limitations — it feeds them. The relations that key unions do have with the NDP are often ones of clientelism. They seek support for their pet policies in exchange for votes, rather than acting as a voice for the working class. And the NDP’s policies tend to reflect the more moderate and corporatist policies of individual unions, underscoring the severe limits of the current union movement. There are potential spaces where the union movement could unite to pressure a new government and organize support to repel challenges from capital to back away from the party’s more progressive policies (childcare, modest tax increases, pensions, minimum wage, health care spending, opposition to the TPP). There are also key nodes and connections with left individuals in the NDP caucus and in their policy and administrative entourage, and these could help push forward important initiatives. But they are limited and tenuous. The NDP’s campaign has brought about little of the sizzle, excitement, and critical depth that Jeremy Corbyn and Bernie Sanders have been able to spark in the UK and the US. These figures appeal to the frustrations of working-class people over the lack of advocacy for their interests in the face of ongoing declines in living standards. The NDP will not play that role. All in all, it might seem to make sense for socialists to vote for the NDP, simply as the lesser of evils, and see them as the most likely to defeat Conservatives. But given the sorry state of the NDP’s central campaign message, socialists would be better off organizing around key issues than working for NDP candidates — even if in some places they should probably still vote for the NDP. There is also a difference between the hard-edged neoliberal approach of Harper and the Trudeau Liberals. In instances where the NDP has no chance of challenging the Tories, a vote for a Liberal that can win — or a Green that can win — would make sense. There are also situations where young, left activists are running for the NDP or independent parties. Movement-building might be best served in the long run by supporting them. This strategy argues for a certain tactical flexibility, given the rather unique electoral moment. And, in the event that no party has a majority, we should argue in favor of an NDP-Liberal alliance, based on a platform that rejects the essential tenets of Harper’s Conservatives. We should have no illusions about how progressive this would be — it would in fact be distasteful in many ways — but it might be essential to bringing down Harper and opening up a new era of Canadian politics.", "url": "https://www.jacobinmag.com/2015/10/mulcair-stephen-harper-justin-trudeau-canada-election/"}