{"authors": ["Por Jim Vertuno"], "date_download": "2020-05-04 20:04:01", "date_modify": "2020-05-04 20:04:01", "date_publish": "2015-02-25 23:36:13", "description": "AUSTIN, Texas, EE.UU. (AP) — El archivo literario de la Universidad de Texas pagó 2,2 millones de dólares por la obra del Nobel colombiano Gabriel García Márquez —incluido el manuscrito de \"Cien...", "filename": "_be054786cb354685871f972ed3026878_1588622641.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9cbe337af9a84dc58cb9742fc20b6976/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be054786cb354685871f972ed3026878_1588622641.html", "title": "Texas pagó 2,2 millones por archivo de García Márquez", "title_page": "Texas pagó 2,2 millones por archivo de García Márquez", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nAUSTIN, Texas, EE.UU. (AP) — El archivo literario de la Universidad de Texas pagó 2,2 millones de dólares por la obra del Nobel colombiano Gabriel García Márquez —incluido el manuscrito de “Cien años de soledad”_, un precio que la escuela quería mantener en secreto hasta que la procuraduría estatal ordenó que se diera a conocer.\nAutoridades del Centro Harry Ransom de la universidad se negaron en noviembre a revelar el precio a The Associated Press, bajo el argumento de que dañaría las negociaciones para futuras compras. Pero el procurador decretó el 19 de febrero que la escuela no pudo demostrar que sufriría un perjuicio al dar a conocer la cifra y ordenó que el contrato se hiciera público.\nJen Tisdale, vocera del Centro Ransom, reveló la cifra de 2,2 millones de dólares a la AP, pero la universidad no dio a conocer el contrato de inmediato.\nEl archivo abarca más de 50 años y 10 libros, incluido el manuscrito de su afamada novela “Cien años de soledad” de 1967.\nAnteriormente la universidad había dado a conocer los precios de otras compras similares, por lo que el esfuerzo por mantener el costo del archivo del colombiano en secreto llamó la atención en círculos legales y literarios por su posible impacto en compras futuras de archivos y en la ley de registros públicos de Texas.\nEn 2005, el Centro Ransom pagó cinco millones de dólares por la cobertura del escándalo Watergate que hicieron los reporteros Bob Woodward y Carl Bernstein. También desembolsó 2,5 millones por el archivo del escritor Norman Mailer en 2008 y 1,5 millones de dólares por los archivos del Nobel de literatura J.M. Coetzee en 2011.\nEl Centro Ransom adquirió esas colecciones bajo la tutela de su ex director Thomas Staley, quien se retiró en 2013. La adquisición de la obra de García Márquez fue negociada por el nuevo director, Stephen Ennis, quien había trabajado previamente en la Biblioteca Folger Shakespeare y en la Biblioteca Emory de Manuscritos, Archivos y Libros Raros.\nGarcía Márquez murió en la Ciudad de México en abril de 2014. La compra de su archivo por parte de Texas ha generado críticas en Colombia y en México, donde vivió muchos años, por parte de aquellos que cuestionan por qué el material se queda en un país al que solía criticar. La familia insistió que la colección no fue vendida al mejor postor y fue ofrecida al Centro Ransom debido a su reputación como archivo literario de clase mundial.\nEl Centro Ransom tiene archivos extensos de escritores de la talla del argentino Jorge Luis Borges, William Faulkner y James Joyce. También se incluyen trabajos de otros ganadores del Nobel como Samuel Beckett, T.S. Eliot, Ernest Hemingway y John Steinbeck.\nLa escuela anunció la adquisición el 24 de noviembre y ese mismo día la AP solicitó el costo. Autoridades del Centro Ransom se negaron, citando inicialmente una ley estatal que protege los contratos en un proceso de ofertas competitivas. La AP introdujo una petición formal para revisar el contrato bajo la ley estatal de registros públicos, y el Sistema de la Universidad de Texas solicitó permiso a la procuraduría general del estado para retener la información del costo.\nLa división de registros abiertos del procurador general Ken Paxton dijo que la escuela no podía mantener en secreto el contrato ni el precio de compra.\n“Encontramos que ustedes no lograron demostrar que la liberación de información en cuestión dañaría de manera específica los intereses de la universidad en el mercado”, dijo el decreto.\nLa orden también señala que, incluso en un proceso de ofertas competitivas, por lo general la ley estatal no permite retener información sobre la oferta final una vez que se ha ejecutado el contrato. Defensores de la transparencia en los registros han advertido que una decisión a favor de la escuela hubiera sido dañina para una parte sustancial de la ley de registros públicos del estado.", "url": "https://apnews.com/be054786cb354685871f972ed3026878"}