{"authors": ["Ed Rooksby", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:18", "date_modify": "2020-05-04 19:59:18", "date_publish": "2015-08-17 00:00:00", "description": null, "filename": "2015_08_corbyn-miliband-yvette-cooper-labour_1588622358.html", "image_url": "https://images.jacobinmag.com/2015/08/17004926/18600192663_c808f7e767_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_08_corbyn-miliband-yvette-cooper-labour_1588622358.html", "title": "Why Jeremy Corbyn Scares the Right", "title_page": "Why Jeremy Corbyn Scares the Right", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "All the evidence indicates that left-winger Jeremy Corbyn is on course to win the British Labour Party’s leadership contest. The conventional wisdom on the British center-left — both within the party and among Labour-leaning media pundits — is that a victory for Corbyn would represent an utter disaster for the party.\nThe general thrust of their argument is that Corbyn supporters are unserious, unwilling to think responsibly about the necessary compromises of power, and are engaging in a form of narcissistic, self-indulgent “purity leftism” that, if Corbyn is successful in his leadership bid, is likely to condemn Labour to years of opposition in a tragic rerun of the party’s post-1983 “wilderness years.”\nThey’re wrong. For one thing, for all the warnings and finger-wagging in relation to the irresponsible, utopian dreaming purportedly constitutive of “Corbynism,” what Corbyn actually proposes in terms of policy is perfectly sensible and, in many ways, far too modest. His platform amounts, effectively, to a return to something like the form of Keynesian social democracy that was absolutely mainstream a few decades ago. That fact that these policies could be labeled “far left” shows how much public opinion has shifted among the British liberal-left since that time.\nFor another thing, their protestations that their opposition to Corbyn pivots on a hard-nosed, pragmatic assessment of what it takes to be electable — that their priority is to defeat the Tories and get Labour back in power — just doesn’t ring true.\nIf their position really did rest purely on electoral concerns, you would think that they might be slightly less hostile and dismissive of the candidate who is currently drawing huge crowds to political meetings around the country and slightly less confident in the electoral prospects of the other three candidates — Yvette Cooper, Andy Burnham, and Liz Kendall — who, let’s say, haven’t yet demonstrated any talent for electrifying the political landscape in quite the same way.\nTheir opposition to Corbyn is ideological, not based on realpolitik.\nIt’s notable that much of the Right seems to have grasped what’s happening in relation to Corbyn’s leadership campaign with much greater clarity and far-sightedness than most of the center-left punditocracy. Few serious figures on the Right see Corbyn as a gift to the Conservatives in the next election. Indeed, Tory big-hitter Ken Clarke recently warned his party that Corbyn’s “branch of left-wing populism would be hard to campaign against” and was clear, moreover, that Corbyn could win the next general election.\nOne of the key lines of argument cropping up with regularity among center-right commentators is that Corbyn’s momentum could herald a fundamental transformation in the political terrain.\nWriting in the Guardian, for example, Tory-supporting journalist Matthew d’Ancona suggests that “the sort of Conservatives who think intelligently and strategically” worry that the way Corbyn seems to have “stormed through the crash barriers of contemporary politics” suggests that the conventional rules of politics are shifting. The center-ground of British politics, in other words, appears to be moving to the left and, moreover, a Corbyn victory threatens to drag it even further in that direction.\nThis, indeed, is the fear articulated by the ultra-neoliberal Telegraph journalist Allister Heath, for whom a Corbyn victory “would be a disaster for the pro-capitalist cause” because it would transform the basic coordinates of mainstream political debate so that it “would become acceptable again to call for nationalizing vast swathes of industry.”\nMuch of the political right, then, certainly takes Corbyn very seriously, operating on the basis of a much more sophisticated understanding of what the remarkable momentum his campaign has generated seems to signify. It is an understanding that is sensitive to the dynamic nature of political common sense — it can shift and change — and to the way in which the contours of this common sense are currently, in the context of years of austerity and popular disillusionment with Westminster politics-as-usual, particularly volatile and in flux.\nIn comparison, much of the center-left appears trapped in a sort of Fukuyama-Blair moment that looks increasingly absurd. Perhaps the Right’s superior grasp of the political stakes is rooted in necessity. The raison d’être of this political tradition, after all, is to defend existing social inequalities of wealth and power, and this requires sensitive political antennae able to detect the emergence of potential serious challenges to these inequalities.\nAlthough it has taken nearly all observers by surprise, the Corbyn surge hasn’t simply materialized out of nothing. It is important to see it in the context of wider developments internationally. One could say that Corbynism is the specific expression in the UK of a wider phenomenon across Europe: a shift in the political balance of forces toward the left, and the rapid rise of radical anti-austerity parties and movements — most notably Podemos in Spain and Syriza in Greece.\nThis shift has been driven in great part by the intersection of two major factors — the impact of austerity on working people and the long-term crisis of social democracy. These two factors have converged in that social-democratic parties have almost uniformly failed to present any sort of coherent opposition to austerity and in many cases, of course, have administered it willingly as parties of government, accelerating a longer-term process of hollowing out party membership and voter turnout.\nIt’s worth noting in this regard that despite a slight rally under Ed Miliband, the Labour Party’s share of the vote has steadily declined since 1997. Indeed it was the failure of Labour’s core vote to turn out at the last general election that explains the gap between what the opinion polls suggested Labour’s support would be and its actual vote. This erosion of the traditional base of support for the established social-democratic parties has created a volatile situation in which challenges to those parties from the left can rapidly pick up steam.\nBut of course this process is not unfolding in a uniform or generic way across the continent. The radical mood sweeping much of Europe crystallizes within nationally specific social conditions and finds concrete expression in nationally specific political and organizational forms. In Spain the need for an alternative was given political expression by a new party, Podemos, which emerged from the 2011 “movement of the squares,” while in Greece anti-austerity forces cohered around a preexisting coalition of radical left organizations, Syriza (which later transformed itself into a unitary party).\nIn Britain, something quite distinct appears to be emerging. Whereas Podemos and Syriza, for all their differences, emerged to challenge established social-democratic parties (the PSOE and Pasok respectively) from without, the British challenge is manifesting itself within the structures of the traditional party of social democracy (or at least in close relation to these structures, inasmuch as Corbyn’s leadership bid has galvanized forces of support that go beyond the Labour Party).\nFurther, the specific British form of this challenge has emerged rather late in the day after a series of what, in retrospect, now seem to have been false starts — most notably the “Green surge” of a few months ago — as if this new radical mood was searching, in a kind of trial-and-error process, for an appropriate vehicle before finally settling (for now at least) on the movement currently coalescing around Corbyn.\nTo some extent it’s rather misleading to talk of the Corbyn surge as the form in which the radical mood across Europe has crystallized in Britain. Perhaps it’s more precise to say that the movement around Corbyn is the specific form in which this wider political-ideological shift has become concretized in England because, of course, the first serious mass political movement against austerity in the British Isles coalesced around the extraordinary Yes campaign for Scottish independence.\nIndeed, we could regard the Corbyn campaign as in part a contagion from Scotland — a radical and confident anti-austerity movement first incubated north of the border.\nOne of the key things that the Corbyn movement shares with political formations such as Podemos and Syriza is the conviction that any serious anti-austerity strategy cannot rely on protest and social mobilization alone and that the question of political power has to be confronted. That is, anti-austerity movements have to set their sights on winning government office as a necessary and central component of a wider, ambitious strategy of change.\nIt may well be that it’s this widely shared conviction that explains why the radicalism sweeping Europe has found expression in the UK in a movement to transform the Labour Party. After all, the peculiarities of the British electoral system make it very difficult for new and for smaller parties to gain a foothold in parliament, let alone win a parliamentary majority in a general election.\nNevertheless, a radical anti-austerity movement with Labour as its major political vehicle will encounter colossal problems and obstacles long before it gets anywhere near a general election victory. For one thing the Labour right will still dominate much of the party machinery even with Corbyn at its helm — and we should note that they’re plotting a “coup” even before the leadership election ballot papers have been sent out.\nBut despite the doubts that many of us will have about Corbyn’s chances of successfully transforming Labour into an instrument of radical social change, a victory for Corbyn in the leadership election would provide a massive psychological boost for the British left as a whole and open up huge opportunities for further advance. Indeed it would confirm the fears of Tories such as Heath and d’Ancona that the center-ground of British politics has indeed shifted decisively to the left.", "url": "https://www.jacobinmag.com/2015/08/corbyn-miliband-yvette-cooper-labour"}