{"authors": ["Michal Rozworski", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:40", "date_modify": "2020-05-04 19:56:40", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07_oxi-tsipras-syriza-euro-default-referendum_1588622200.html", "image_url": "https://images.jacobinmag.com/2015/07/17004456/19404835942_a3bcf2220a_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07_oxi-tsipras-syriza-euro-default-referendum_1588622200.html", "title": "The Political Crisis in Greece", "title_page": "The Political Crisis in Greece", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThis week has been a taste of what the economy would look like with a real rupture with the eurozone: uncertainty, elite blackmail, banks teetering on the brink, and the start of rationing. That the mobilization of Syriza and the Left outside it has overcome this and made Oxi (No) a possibility is impressive. Greece and its economy can expect no miracles either way today’s vote goes and for quite some time afterwards, but they deserve full international solidarity. And so as Greeks go to the polls, with the streets of Athens still buzzing from Friday night’s enormous Oxi!/No! rally in Syntagma Square, I’ve collected and parsed some of my notes on Greece from afar. A text on where things stand is first, followed by some notes on how things came to be.\nWhere Things Stand Five months of torturous, fruitless negotiations came to a head last week when the more-or-less polite dance around the table in Brussels abruptly broke down. Whether this was a costly demobilization or a calculated strategy to demonstrate the intransigence of the “institutions” doesn’t quite matter at this point. When Greek Prime Minister Alexis Tspiras called a referendum on a take-it-or-leave-it offer last Friday, he precipitated a political rupture, which soon started to foreshadow the economic rupture that Greece leaving or being pushed out of the euro would bring. This week the field of battle moved out of the stuffy rooms in Brussels into the streets of Athens and other cities in Greece. Sunday will be a test of how far the Greek population has been mobilized by forces of the Left. Given a choice between further recessionary measures to fund debt repayments amid an ever-deeper depression seemingly without end, it is no wonder that the No vote stands a fighting chance. This despite a concerted media campaign and transparent blackmail on the part of European political figures. The Greek media, whose ownership is extremely concentrated among the business elite that has much to lose from renewed radical social mobilization, have been a major part of the Yes campaign. European politicians of all stripes, including nominal social democrats, have called on Greeks to vote “yes,” playing up confusion and offering stern warnings. For instance, Martin Schulz, the president of the European Parliament from the German Social Democratic Party, called for a change of government in the event of a “yes” vote without seemingly batting an eye. Countering this has been a left presence in the streets that has by many accounts been revitalized by the sudden opening provided by the referendum. That Greece is holding a referendum, that it has imposed capital controls, and that its economy’s slow strangulation has gathered pace are the marks of a fundamentally political, rather than economic, crisis. This remains the basic lens. It isn’t to say that there is no economic crisis — one has been ongoing across Europe in various guises since the fallout from the 2008 crash — but that this week politics clearly dominates economics. Or put differently, economics is at the service of politics whether in the guise of frozen emergency liquidity to Greek banks on the one hand, or the decision to pay pensions rather than the International Monetary Fund on the other. The broad strokes of this post reflect the big, broad political exigencies. There is no good outcome for Greece at this point, but it is clear that all Europe can offer is a cycle of endless austerity, economic depression, and appeals to let the technocrats take over. The referendum process is unclear, but the political divide it has exposed has exceeding clarity: few understand the question, but most know exactly what the vote is about. The difficult question is what to make of the vote results. Where does the mobilization lead if Oxi carries? Is it to renewed negotiations, as Tsipras, Finance Minister Yanis Varoufakis, and the main current of Syriza contend? Or does it leave Greece moving further towards breaking off economic (and political) ties to the eurozone and the rest of Europe? The main economic question that has returned with a vengeance is the debt. A partial default or radical restructuring within the euro is an economic outcome that would do the most to save Greek capitalism from being further hobbled by austerity in the service of further debt repayments. Varoufakis is right that this gives Greece the best chance of restoring investment and growth along the old, pre-crisis, pre-bubble path. The problem is political: negotiated debt restructuring looks to be off the table for now. A unilateral default within the eurozone, while technically possible, also appears remote. The rules are being made up as things move along, but they are not being made by Greece or those friendly to it. Is the confidence of Tsipras that Oxi will allow for debt to be included in a potential new deal realistic? If the crisis has always been political, then the political stakes of the referendum have moved to a new level. The threat from the far right that has been growing across Europe, most violently and visibly in Greece with the fascist Golden Dawn, is now openly being tested by the European elite. The extent of economic destabilization has been immense. The banking sector is on the edge and at the mercy of emergency funds from the European Central Bank. Although people like German Finance Minister Wolfgang Schäuble say the risk of default is fully priced in, surely the financial sector across the world is busy this weekend revising its bets. Financial markets are based on confidence and trust, both of which are being sorely tested. The difficult question for Syriza if a real rupture happens will be how to sustain a war economy for months, not days or weeks. Months are what it would take to implement a new payments system, to reprogram a modern financial infrastructure, to reestablish financial links with Europe and the rest of the world, and regain access to international markets. In the meantime, food, fuel, and medicine would need to be rationed. These are technical problems to which there exist solutions, but they will take place within a political context of anger, confusion, and destabilization far greater than anything this week — and to be sustained, would require popular support far beyond that evidenced this week.", "url": "https://www.jacobinmag.com/2015/07/oxi-tsipras-syriza-euro-default-referendum"}