{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:27:13", "date_modify": "2020-05-04 16:27:13", "date_publish": "2015-04-01 18:20:28", "description": "Read CNN's Fast Facts about Saudi Arabia and learn more about the oil-rich, Middle Eastern kingdom, home to Islam's holiest cities, Mecca and Medina.", "filename": "2015_04_01_middleeast_saudi-arabia-fast-facts_index_1588609633.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190802124123-saudi-women-driving-super-tease.jpeg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2015_04_01_middleeast_saudi-arabia-fast-facts_index_1588609633.html", "title": "Saudi Arabia Fast Facts", "title_page": "Saudi Arabia Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at Saudi Arabia, a large, oil-rich Middle Eastern country bordering Yemen, Oman, the United Arab Emirates, Qatar, Kuwait, Iraq, Jordan, the Red Sea and the Persian Gulf. Saudi Arabia is home to Islam's holiest cities, Mecca and Medina.\nAbout Saudi Arabia\nArea: 2,149,690 sq km, about one-fifth the size of the United States\nPopulation: 34,173,498 (July 2020 est.) note: immigrants/foreign workers make up 38.3% of the total population, according to UN data (2019)\nMedian age: 30.8 years\nCapital: Riyadh\nEthnic Groups: Arab 90%, Afro-Asian 10%\nReligion: Muslim (85-90% Sunni and 10-15% Shiite, citizens only), Other (includes Eastern Orthodox, Protestant, Roman Catholic, Hindu, Muslim (85-90% Sunni and 10-15% Shiite, citizens only), Other (includes Eastern Orthodox, Protestant, Roman Catholic, Jewish, Buddhist and Sikh) (2012 est.)\nGDP (purchasing power parity): $1.775 trillion (2017 est.)\nGDP per capita: $54,500 (2017 est.)\nUnemployment: 6% (2017 est.) note: data are for total population\nOther Facts\nEconomy -\nSaudi Arabia possesses approximately Saudi Arabia possesses approximately 22% of the world's oil reserves. It is the world's largest exporter of petroleum liquids and relies on the oil industry for almost half of its GDP.\nForeign Relations -\nSince the end of Since the end of World War II, Saudi Arabia and the United States have maintained a relationship based on an exchange of oil for security. Their mutual interests have included the free flow of oil and fighting the spread of communism and extremist groups such as al Qaeda and ISIS. Saudi Arabia and the United States have not agreed on support for Israel or engagement with Saudi Arabia's regional rival, Iran\nSaudi Arabia was a founding member of the Arab League in 1945.\nIt currently maintains close ties with its neighbor, Bahrain, and helped the Sunni monarchy there put down an Arab Spring uprising in 2011.\nIn 2014, it began construction on a 600-mile barrier along the border with Iraq, to prevent border incursions by the terrorist group ISIS.\nReligion -\nThe Wahhabi, or Salafi, branch of Sunni Islam has been closely tied to the Saud family since the 18th century. When the Saud family established the modern country of Saudi Arabia in the 1930s, the Wahhabi interpretation of Islam become the country's official state-sponsored religion.\nOne of the five pillars of Islam is performing Hajj, by traveling to Mecca, Saudi Arabia, at least once. Approximately two million people a year make the pilgrimage.\nSaudi Arabia bans public worship by non-Muslims and severely restricts public displays of religion by non-Wahhabi sect Muslims, including Shiites.\nTimeline\nSeptember 23, 1932 - Abd-al-Aziz Bin-Abd-al-Rahman Bin-Faysal Bin-Turki Bin-Abdallah Bin-Muhammad Al Saud, also known as Ibn Saud, establishes the kingdom of Saudi Arabia, 30 years after Saud's family returned to the Arabian Peninsula from exile.\n1939 - Saudi Arabia declares its neutrality at the outbreak of World War II and maintains it for most of the war.\n1944 - California-Arabian Standard Oil changes its name to Arabian American Oil (Aramco).\nFebruary 14, 1945 - Ibn Saud meets with US President Franklin Roosevelt aboard the USS Quincy in the Suez Canal. Ibn Saud meets with US President Franklin Roosevelt aboard the USS Quincy in the Suez Canal. This meeting establishes \"the marriage of convenience\" between the two countries, which continues to this day.\nFebruary-March 1945 - Saudi Arabia declares war on Germany and Saudi Arabia declares war on Germany and Japan.\nOctober 24, 1945 - Joins the Joins the United Nations as a founding member.\n1948 - Sends several hundred troops to fight in the first Sends several hundred troops to fight in the first Arab-Israeli War after Israel declares its independence.\n1950 - Aramco begins sharing 50% of its income with the government of Saudi Arabia.\n1953 - Ibn Saud dies and is succeeded by his son Saud Ibn Abd al-Aziz.\nSeptember 14, 1960 - OPEC is formed in Baghdad, Iraq, by founding members Iraq, Kuwait, Iran, Saudi Arabia and Venezuela.\n1962 - Yemen's civil war pits Saudi Arabia and Yemen's civil war pits Saudi Arabia and Egypt against each other for five years.\nNovember 1964 - King Saud is deposed and replaced by his half-brother Faisal.\nMarch 25, 1975 - King Faisal is murdered by a nephew. His half-brother Khalid succeeds him.\nMarch 26, 1979 - Saudi Arabia severs diplomatic relations with Egypt after President Anwar Sadat signs the Saudi Arabia severs diplomatic relations with Egypt after President Anwar Sadat signs the Camp David peace treaty with Israeli Prime Minister Menachem Begin.\n1980 - The Saudi government gains full control of Aramco.\nSeptember 1980 - The eight-year-long war between Iran and Iraq begins. Saudi Arabia supports Iraq and the government of The eight-year-long war between Iran and Iraq begins. Saudi Arabia supports Iraq and the government of Saddam Hussein against the predominantly Shiite country of Iran, with billions in loans. The war ends in a stalemate in 1988.\nMay 1981 - Saudi Arabia, Bahrain, Kuwait, Oman, Qatar and the United Arab Emirates establish the Gulf Cooperation Council (GCC).\nJune 13, 1982 - King Khalid dies and is succeeded by his half-brother Crown Prince Fahd.\nNovember 1987 - Saudi Arabia and Egypt restore diplomatic ties.\nAugust 2, 1990 - Iraq invades neighboring Kuwait. King Fahd, fearing an Iraqi invasion, allows a multi-national force of more than 500,000 troops to set up military bases in the country. This angers many Saudis, who consider the foreign troops infidels.\nFebruary 27-March 1991 - US and coalition forces defeat Iraq and liberate Kuwait.\nJune 25, 1996 - A group of terrorists attack the US Air Force housing complex known as Khobar Towers in Dhahran. Nineteen service members are killed.\nAugust 7, 1998 - Almost simultaneously, Almost simultaneously, bombs explode at US embassies in Nairobi, Kenya, and Dar es Salaam, Tanzania, killing 224 people. More than 5,000 are wounded. Twelve of those killed in Kenya are US citizens. The bombings, orchestrated by al Qaeda, take place eight years to the day after US troops were ordered to Saudi Arabia in the aftermath of Iraq's invasion of Kuwait.\nJune 22, 2001 - US authorities indict thirteen Saudis and one Lebanese man for the 1996 Khobar Towers bombing.\n2003 - Saudi Arabia opposes the Saudi Arabia opposes the US invasion of Iraq.\nMay 12, 2003 - Assailants set off car bombs at three housing compounds in Riyadh, Saudi Arabia. Approximately 23 people are killed, including nine Americans.\nAugust 1, 2005 - King Fahd dies and is succeeded by his half-brother, King Fahd dies and is succeeded by his half-brother, Crown Prince Abdullah.\nJanuary 23, 2015 - King Abdullah dies and is succeeded by his half-brother, King Abdullah dies and is succeeded by his half-brother, Crown Prince Salman.\nApril 29, 2015 - King Salman, in a surprise power-shifting move, appoints Interior Minister Mohammed bin Nayef as crown prince, replacing his half-brother Prince Muqrin as his successor, and Defense Minister Mohammed bin Salman, his son, as deputy crown prince.\nDecember 14, 2015 - At least At least 17 women are elected to public office in the first elections in which women in the country are permitted to vote and to run for office.\nJanuary 2, 2016 - Saudi Arabia announces it has executed 47 prisoners who had been convicted of terrorism over the last decade -- Saudi Arabia announces it has executed 47 prisoners who had been convicted of terrorism over the last decade -- most prominently, a Shiite cleric named Nimr al-Nimr, who had spoken out against the ruling Al Saud family. This mass execution, which took place in 12 different Saudi sites, marks the country's highest one-year total in almost two decades. The executions spark demonstrations throughout the region.\nJanuary 4, 2016 - The Saudi government announces that all flights to and from Iran are suspended immediately, according to the Saudi Press Agency. In addition, The Saudi government announces that all flights to and from Iran are suspended immediately, according to the Saudi Press Agency. In addition, Bahrain announces it is severing ties with Iran, while the United Arab Emirates says it is \"downgrading\" diplomatic relations with Iran, and Sudan expels the Iranian ambassador and the entire Iranian diplomatic mission in its country.\nAugust 24-25, 2016 - meets with Saudi Foreign Minister Adel al-Jubier, crown prince Mohammed bin Nayef, deputy crown prince bin Salman and other representatives from the region, to discuss plans to end the escalating violence in Yemen. US Secretary of State John Kerry meets with Saudi Foreign Minister Adel al-Jubier, crown prince Mohammed bin Nayef, deputy crown prince bin Salman and other representatives from the region, to discuss plans to end the escalating violence in Yemen.\nAugust 25, 2016 - The The United Nations issues a report calling for an investigation into possible human rights violations in Yemen. The UNHCHR says the conflict between pro-Saudi government forces, Houthi and other rebels, has resulted in the death of 3,799 civilians, 6,711 wounded civilians, and millions of others displaced from their home. The humanitarian organization says air strikes by the Saudi-led coalition that it monitored made up the \"single largest cause of [civilian] casualties,\" approximately one-third of the deaths and injuries they recorded.\nMay 20, 2017 - During During US President Donald Trump's visit to Saudi Arabia, the two countries sign an arms deal in which the United States is selling Saudi Arabia tanks, fighter jets, combat ships and the THAAD missile defense system for nearly $110 billion, according to the White House. The deal is part of a more extensive ten-year $350 billion defense agreement which the White House says shows the US' commitment to Saudi Arabia and expands opportunities for American companies in the region.\nNovember 4, 2017 - The official Saudi news agency reports that the country's military intercepted a Yemen-borne ballistic missile north of the capital city of Riyadh, that was targeting King Khalid International Airport.\nNovember 7, 2017 - The Saudi Arabian Monetary Authority (SAMA) confirms that it has frozen the personal bank accounts of the royal family members and senior officials after the arrests related to the government's anti-corruption sweep.\nJUST WATCHED What happened to Jamal Khashoggi?: A timeline Replay More Videos ... MUST WATCH What happened to Jamal Khashoggi?: A timeline 04:45\nOctober 6, 2018 - Unnamed Turkish officials speaking to the Washington Post and Reuters say that Unnamed Turkish officials speaking to the Washington Post and Reuters say that Khashoggi was killed in the Saudi consulate in Istanbul. The Turkish government is investigating.\nOctober 10, 2018 - As concerns mount over the fate of Khashoggi and the growing diplomatic rift between Saudi Arabia and the West, some news outlets begin to withdraw sponsorship of the Saudi government's As concerns mount over the fate of Khashoggi and the growing diplomatic rift between Saudi Arabia and the West, some news outlets begin to withdraw sponsorship of the Saudi government's Future Investment Initiative (also known as \"Davos in the desert\"), which begins October 23.\nOctober 11, 2018 - A joint investigation team between the Kingdom and Turkey is created. Although Turkish authorities believe Saudi officials are not being entirely cooperative, permission is granted for Turkish authorities to enter the premises of the consulate and the residence of the consul general to investigate. The search takes place six days later.\nOctober 19, 2018 - After first reporting that Khashoggi had left the consulate the day of his disappearance, the Saudi government says that the journalist was killed during an altercation while at the consulate but takes no direct responsibility for his death. After first reporting that Khashoggi had left the consulate the day of his disappearance, the Saudi government says that the journalist was killed during an altercation while at the consulate but takes no direct responsibility for his death. According to the announcement on State TV, a Saudi commission will release a report on its investigation in one month. Five high-ranking officials are dismissed, and eighteen others are detained.\nOctober 22, 2018 - A senior Turkish official tells CNN that A senior Turkish official tells CNN that Mustafa al-Madani , a member of the 15-man team suspected in the death of Khashoggi, was captured on surveillance cameras around Istanbul dressed in Khashoggi's clothes the day the journalist was killed perhaps to give the appearance that it was Khashoggi who had left the consulate.\nOctober 23, 2018 - Crown Prince bin Salman addresses the killing of Khashoggi for the first time while speaking at the Future Investment Initiative conference. He describes the killing as \"heinous\" and says he will \"bring to justice\" those who are responsible while proclaiming \"We know that many are trying to use this painful thing to drive a wedge between Saudi Arabia and Turkey ... Justice will be seen in the end.\"\nOctober 25, 2018 - Members of the European Parliament vote overwhelmingly to adopt a resolution that urges EU countries to impose an Members of the European Parliament vote overwhelmingly to adopt a resolution that urges EU countries to impose an EU-wide arms embargo on Saudi Arabia.\nNovember 16, 2018 - despite the Saudi government's denials that the de facto ruler was involved, according to a senior US official and a source familiar with the matter. The CIA has concluded that Saudi Crown Prince bin Salman personally ordered the killing of Khashoggi, despite the Saudi government's denials that the de facto ruler was involved, according to a senior US official and a source familiar with the matter.\nDecember 9, 2018 - The source, who has read a translated transcript of an audio recording of Khashoggi's painful last moments, said it was clear that the killing on October 2 was no botched rendition attempt, but the execution of a premeditated plan to murder the journalist. According to a source briefed on the investigation, Khashoggi's last words were \"I can't breathe.\" The source, who has read a translated transcript of an audio recording of Khashoggi's painful last moments, said it was clear that the killing on October 2 was no botched rendition attempt, but the execution of a premeditated plan to murder the journalist.\nFebruary 23, 2019 - Saudi Arabia appoints its first female ambassador, naming Princess Reema bint Bandar Al Saud as ambassador to the United States.\nJune 19, 2019 - Agnes Callamard, the United Nations special rapporteur, said there is Agnes Callamard, the United Nations special rapporteur, said there is \"sufficient credible evidence\" that Saudi Arabia's crown prince bears responsibility for the murder of journalist Jamal Khashoggi and he should be investigated for it.\nSeptember 27, 2019 - it will be granting entry visas to tourists for the first time. Travelers from The Kingdom announces it will be granting entry visas to tourists for the first time. Travelers from 49 different countries will be able to enter through an e-visa and visa-on-arrival program. The new drive for tourism is part of the Vision 2030 project, which aims to reduce the country's dependence on oil, diversify the economy and promote the country's national identity.\nMarch 6, 2020 - They include Prince Ahmed bin Abdulaziz al Saud, a brother of King Salman, and Prince Mohammed bin Nayef, the king's nephew. Several senior Saudi royals are arrested in Riyadh. They include Prince Ahmed bin Abdulaziz al Saud, a brother of King Salman, and Prince Mohammed bin Nayef, the king's nephew.", "url": "https://www.cnn.com/2015/04/01/middleeast/saudi-arabia-fast-facts/index.html"}