{"authors": ["Kim Moody", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:29", "date_modify": "2020-05-04 19:58:29", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07_sweeney-trumka-chavez-seiu-unions_1588622309.html", "image_url": "https://images.jacobinmag.com/2015/07/17004538/94bdd9faedac08c94ed2a27863f83c14-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07_sweeney-trumka-chavez-seiu-unions_1588622309.html", "title": "Saviors From on High", "title_page": "Saviors From on High", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nWhen union membership began its rapid drop in the 1980s, many labor leaders began looking for new ways to stem the downward tide. The two main tactics they settled on were inward-looking: union mergers to boost membership and labor-management cooperation schemes and contract concessions to try to save jobs. The number of mergers rose from 31 in the 1970s to 35 in the 1980s and 42 in the 1990s, the bulk of them led by just five unions. While this produced some giant conglomerate unions like the Service Employees International Union (SEIU), the United Food and Commercial Workers (UFCW), and the United Steel Workers (with about two dozen jurisdictions in which steel workers were a tiny minority), it brought no real gains to the movement as a whole. And labor-management cooperation simply defanged what was left of the largely unofficial union resistance of the 1960s and 1970s. Decline continued apace. In 1995, after two decades of slumping real wages, a decade and a half of membership loss, and a decade of brutal work intensification some called “lean” and others “mean,” the complacent cold warriors who had run the AFL-CIO since its founding forty year earlier faced their first open challenge for the top leadership in the labor federation’s history. Calling themselves the “New Voice,” the challengers promised change: more organizing, independence in foreign policy positions, and greater racial and gender diversity in both leadership and membership — in short, a renewed labor movement. The three leaders who composed the New Voice slate had some credentials for the job. John Sweeney, SEIU president and the ticket’s presidential candidate, could take some credit for the inspiring 1990 victory of SEIU’s Justice for Janitors campaign in Los Angeles, which brought thousands of building service workers into the union. Richard Trumka, head of the United Mine Workers (UMW) and vice-presidential candidate, had led the successful no-holds-barred strike and occupation against Pittston in 1989. And Linda Chavez-Thompson of the American Federation of State, County, and Municipal Employees (AFSCME), vying for AFL-CIO executive vice-president, was one of the first Latinas to achieve a high position in a major US union. Innovation, militancy, diversity, and hope seemed possible. Twenty years later, the notion that changing the team at the top could revive organized labor has taken a beating. In 2012 a third of new union agreements contained no first-year wage increase, and by 2014, union membership was down nearly two million since the New Voice slate took office. Union-negotiated wage increases rarely surpassed an already low rate of inflation, and health care costs continued to shift from employer to worker. Perhaps above all, work itself became more and more a nightmare. The lean production of the 1980s morphed into a regime of breakneck pressure, electronic measurement, and surveillance that made Taylor’s stopwatch look quaint, and just-in-time production chains relying on outsourced, non-union jobs that seemed to drag the whole workforce down. To be sure, with the encouragement of the New Voice leaders, reliance on the National Labor Relations Board (NLRB) gave way to “neutrality” agreements in which willing employers allowed a simple majority show of support or an expedited election to bring union recognition. The problem was most employers weren’t willing. Over the long run, organizing never outstripped member losses for all but a few unions. The results of twenty years of “reform” proved to be flat wages and rising productivity that shifted income from labor to capital in a manner not seen since the Gilded Age.\nJohn Sweeney, who as president of the federation held the real power, was in many ways an unlikely reformer. One biographer described him as “a middle-of-the-road union leader.” In his many years as SEIU president, he tolerated double-dip salaries and shared leadership with people like New York’s Gus Bevona and Detroit’s Richard Cordtz that were known to be corrupt. And he hired the American Management Association to train his growing SEIU staff with the Harvard Business Review at the top of the curriculum, according to a sympathetic study by Michael Piore. On the other hand, he incorporated into SEIU the feminist-inspired “9 to 5,” which had been organizing women clerical workers, and brought on a small army of leftists and social movement activists as organizers. This contradictory cocktail — progressive experiments, business methods, and toleration of the old and dubious — goes some way toward explaining just what the New Voice put in place and why revitalization was an elusive goal. As Jeremy Brecher and Tim Costello remarked at the time, the approach of “the New Voice program was essentially to build a new AFL-CIO staff structure that largely by-passed the existing officers and departments.” A new bureaucracy was to be added to — or in some cases, replace — an older one, hopefully circumventing the conservative structure of the federation. As a longtime labor observer described the new changes in Labor Notes, “For every union problem there’s a new Washington solution.” Task forces, campaigns, policy institutes, a political training center, a Working Women’s Department, and other organizational innovations remained embedded in the federation’s hierarchical structure. Some, like Union Summer and the Organizing Institute promised an injection of new blood. Union Summer got off to an exciting start in 1996 with 184 campaigns in 20 cities, each with 4 to 55 volunteers. As an organizing effort, however, it was never very successful, and by this year had been reduced to 5 cities with a handful of volunteers in each. A similar fate befell the Union Cities program, which was launched in two dozen cities in 1997 with the purpose of coordinating local organizing drives through Central Labor Councils (CLCs). There were some early successes, most notably that by UNITE in Las Vegas, but, as Stanley Aronowitz wrote, “Within a few years it became evident that most CLCs, including New York and Chicago with large union memberships and even larger pools of unorganized workers, were simply unprepared to make the efforts.” Most CLCs that tried reverted to their traditional role as local political pressure groups. The Organizing Institute had been founded in 1989 by the old guard. Sweeney, however, increased its funding and brought it into the new Organizing Department. The institute’s mission was shifted somewhat to attract, train, and turn out scores of organizers, mostly recruited from outside the ranks of labor. The recruits would in turn get picked up by those unions that emphasized new organizing. The problem was that neither the New Voice leaders nor even the most promising programs they set up could change the essentially conservative culture of the unions. More often than not new organizers found themselves locked in the union hierarchy, still deploying old methods of organizing. Many simply dropped out. Nor was there anything in the New Voice program that proposed to mount the sort of assault on America’s unwilling employers that could begin to alter the balance of social power in the US economy. Organizing without a shift in power was not going to work. What was missing in all these changes and innovations was anything directed at activating or mobilizing labor’s ultimate source of power: its membership. Here, still in the millions, were workers with their hands on the levers of production of societies’ goods and services who, if mobilized, might actually challenge corporate America. So while Sweeney told the Wall Street Journal he was “very interested in union democracy and rank-and-file involvement,” he cautioned, “it can’t be accomplished overnight.” It was as though the idea of rank-and-file “involvement” had just appeared on the horizon. Herman Benson, whose Association for Union Democracy had been supporting union members fighting for participatory unionism for decades, wrote of the New Voice leadership, “They look everywhere except to what is most effective: the free independent democratic activity of union members inside their own unions.” None of the innovations and institutes addressed the massive pressures on working people on the job and in their daily lives. Even the AFL-CIO’s “America Needs A Raise” campaign never amounted to more than public relations and occasional symbolic actions. No doubt some of the changes wrought by the New Voice leadership were improvements on the past. Yet good, bad, or indifferent, it was all top-down. Of course, neither Sweeney nor his team could single-handedly divert the storm of economic change that battered workers and their unions in the US and across the world. But they might be held partially responsible for what organized labor did or didn’t do to resist capital’s use of these trends to beat down unions and working people in general. When Sweeney assumed the presidency of the AFL-CIO, strikes were already a disappearing form of resistance. Under his watch they shrank even further. From 1996 to 2000, according to the Federal Mediation and Conciliation Service’s (FMCS) count of all strikes, they were running just below 400 a year on average. From 2002 through 2006 work stoppages fell to an average of fewer than 300 a year. After that there were less than 200 a year, numbering a mere 154 in 2013. There was no institute or center concerned with successful strike strategy or tactics, much less concrete support for those who dared to strike. Perhaps the biggest disappointment was in the area of new organizing, the New Voice reformers’ top priority. Despite the refashioned Organizing Institute, the number of workers organized through the NLRB fell from an average of over a million in the 1980s to 934,000 in the 1990s, and to just over 900,000 in the first nine years of the 2000s when Sweeney was still in charge. The unions that embraced the neutrality agreement tactic did better on average for each campaign, but in the face of recalcitrant employers the number of such accords remained low. As measured by the FMCS such “voluntary” recognition campaigns rose from a mere 227 in 1998 to 420 in 2001, before falling back to 258 in 2004, the last year the FMCS recorded them. This never constituted more than ten percent of NLRB elections. Studies of successful organizing approaches done in the late 1990s and early twenty-first century all pointed to “member-based organizing” and organizing campaigns that “were more successful when they encouraged active rank-and-file participation in and responsibility for the organizing campaign.” Yet under Sweeney, most organizing was still dominated by union staffers operating in a hierarchical culture that routinely precluded rank-and-file control. In 2005, frustrated at how little reform efforts were yielding, the AFL-CIO split, with Sweeney’s own SEIU, now helmed by Andy Stern, leading five other unions out of the federation to organize the Change-to-Win (CtW) federation and the next round of top-down reform. Far from the tidal wave of new organizing and membership predicted by CtW, the new federation saw its ranks drop from 5.5 million in 2006 to 4.8 million in 2008, losing 458,083 in that year alone, even before the Great Recession hit full force. Between 2005 and 2010 organized labor engaged in its own top-down civil war, with the SEIU alone raiding some seven unions. By 2010 CtW was down to 4.3 million members after two of its major affiliates returned to the AFL-CIO. In that year, the SEIU’s growth machine ground to a virtual halt. Altogether, from 2005 to 2014, union membership fell by more than a million. Change from above may have done more damage than good. Indeed, the idea that a change at the pinnacle of labor’s bureaucratic hierarchy could save the unions from capital’s multisided attacks and the great economic shifts of the times was always an illusion.", "url": "https://www.jacobinmag.com/2015/07/sweeney-trumka-chavez-seiu-unions"}