{"authors": ["Panagiotis Sotiris", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:10", "date_modify": "2020-05-04 19:53:10", "date_publish": "2015-04-17 00:00:00", "description": null, "filename": "2015_04__1588621990.html", "image_url": "https://images.jacobinmag.com/2015/04/17003548/Giannis_Papanikos_Greece_Crisis_01-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_04__1588621990.html", "title": "The Other Greek Left", "title_page": "The Other Greek Left", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "PS\nThis problem also signifies the contradiction in the strategy of Antarsya. As I said, until 2009 or 2010, at the beginning of the crisis you could see the emphasis on the regroupment and realignment of the forces of the anticapitalist left as an end in itself. It was necessary to bring the left anticapitalist forces into a more unitary experience and experiment with a more mass line, without investing particularly in electoral terms.\nHowever, the problem is after the crisis it was obvious that the radical left should aim at broadening its appeal and playing a much more important role. I think it was exactly there that our main problems came to the surface.\nI insist on the first person plural of that — I would not like it to come across as just a criticism of other tendencies. We have all been carrying the traces, or the scars, of a whole period of crisis of the revolutionary left. Because what was the anticapitalist left until that period? What was the anti-capitalist left of the 1990s or the 2000s?\nIf you can see it, it was a left of resistance, of movement militancy, and of a general ideological and ethical defense of the revolutionary perspective. It did not have a coherent strategy, it was not a Left that could aim for power or hegemony, and it lacked a revolutionary strategy. Despite some urgent calls at the international level — I always remember the call by the late Daniel Bensaïd to open the debate on strategy — in fact this debate was never opened.\nYou can even say in a certain way this was also the problem of Syriza, it also represented a Left, although not anticapitalist, of resistances, movements, and general ideological defense of a socialist perspective. And within the confrontation of Syriza with political power, all the problems of the old conceptions coming from the right-wing tradition of Eurocommunism and its perspective of progressive governance re-emerge and cannot face the reality of the state, apart from the question of the European Union.\nI would say our left, the anticapitalist left, was still in a strategic crisis in this period and this led to losing important political moments, crucial moments, when this kind of inability to have an answer to the challenges of the day was made evident in the case of Antarsya. For example, we were the first tendency of the Left to realize you could have a concise program of transitional demands that could actually answer the crisis, be radical and anticapitalist, and at the same time have the sense of immediacy and be very easy to communicate to people.\nThat was the combination of the immediate stoppage of payments and annulment of the debt, the exit from the eurozone, the rupture with the European Union, mass nationalizations as part of a program of productive reconstruction. These were things you could say to people and they could realize that they were good starting points.\nAlong the way, it became obvious that there was an important process both of realignment of forces within the Left and of new divisions, especially on the question of the euro. At the same time, we lacked any kind of necessary audacity to make an open appeal to say, we could have built a broader coalition based on the negation of the debt, the exit from the euro, the nationalization, and some general references to socialist policy.\nIt was possible in that period. If that process had evolved — I’m not saying it was only our responsibility, one might pose the same question regarding the choices of the left currents inside Syriza — we would have had a very different landscape on the Left at the beginning of the movement, perhaps a very different balance of forces.\nSecondly, we had the Movement of the Squares. We were part of it, every day we were there in the squares. But we did not think what to do with it. This was neither a simple “sociological phenomenon,” nor just this impressive convergence of people who were militants with people who had never taken part in a movement. It was at the same time a crucial moment of repoliticization of society through this reclaiming of public space that people were looking for a new politics.\nHowever, we never thought: how are we going to transform this into a constituent process for a new left? We did not think of it. We thought of it afterwards. For example, I listen to many people impressed by the emergence of Podemos, and I think about this in a self-critical way, because we had something bigger — the Greek Movement of the Squares in 2011 was bigger than the indignados movement, and it embraced the whole left.\nThen, of course, we never realized that the question was about power. We did not realize it. We entered the electoral cycle of 2012 trying to be the best opposition at that time against the systemic parties. In fact, it was obvious that the political crisis was so deep, and people had realized after two years of intensive fighting, during which we had used all traditional and non-traditional means to pressure the government, that only a political rupture could put an end to austerity.\nSomeone should have offered them a political exit strategy, in the name of reclaiming governmental power. At that point, we did not have this position, but Syriza had it. I do not know if Syriza had it through some sort of insight, or from some opportunistic electoral maximalism in order to survive the pressure from other tendencies. However, it fit, it was the missing signifier in the political crisis.\nYes, the question was a question of power, and this initiated a new political sequence. The anticapitalist left did not stand up to that challenge because it had no actual revolutionary strategy. Because we have never had a serious conversation about how it is possible, in an advanced capitalist formation, to combine the question of governmental power with forms of popular power from below as part of a highly original version of a dual power strategy. We did not think of these questions.\nEven after 2012, after the electoral shock, in both the positive and negative aspects of it, we continued avoiding the elaboration of a strategy. If you enter an electoral cycle that will end with the possibility of a Syriza government, how do you become a useful vote? Not a vote of ideological commitment, but a vote that is useful in the parliamentary system?\nIf you could have your own original position regarding a left-wing government and the kind of program and politics it would need, then you could be able to say: “Okay, you vote for us, because if we are the crucial vote in parliament, we can push in that direction, or we will be the useful opposition in parliament.”\nHowever, we did not evolve our reading of the conjuncture. Even regarding the question of whether Antarsya could realign itself with other forces that were close to Antarsya — anti-euro socialists or communists, other forces — it took us too long to decide. This was a very big waste of political time and political capital in all this, until we managed to have a more unitary expression.\nSo it’s not that people turned their backs because they thought we were paranoid leftists or class renegades. It was because they said, “Yes, you are saying things that are more correct or more to the point, but this is a question of election, we need to find a useful vote.”\nI think we must take all this into consideration and attempt to actually think and change, because I think it’s not whether you make mistakes but whether you stop making the same mistakes — this is what makes the difference in life, not only in politics. You need to use the cathartic character, the catalytic character, of this whole process. Because we are in a very crucial position in Greece, in the sense that it is not the end of the game.\nIt is not 1981. In 1981, Pasok was hegemonic. It put in practice a certain version of the program of the reformist left which was a program of welfare state plus capitalist modernization. No one could offer an alternative. That’s why Pasok could incorporate and corrupt the left. It is not like that today. The new government is under immense pressure on the part of the European Union, and we have a continuous cynical coup d’etat against the sovereign will of the Greek people. It is a contradictory situation.\nHowever, even now, in this period of negotiations, whether it is June or even if it takes longer, there is place for an alternative. An alternative that actually answers these contradictions, not an expression of theoretical and political laziness, like a very simple leftist critic in the tone, “Oh, they are renegades, they will fail,” because this could be just an excuse for doing nothing.\nI am talking about an actual effort to present an alternative in the sense of what would it mean now in Greece for things to go a different way, to not miss this historical opportunity, and not be defeated by the European Union and international capital.\nWe need to have concrete suggestions regarding what a really left-wing government should do with the debt, with the euro, with nationalization, etc. We need a roadmap to exit the euro, on how to disobey, in very specific and practical terms, the European Union, on nationalizations, etc. We need concrete proposals for a new constituent process and how to combine profound institutional transformation with new forms of intervention of the popular movement.\nThis is the kind of politics that are necessary today. We do not need the politics of theoretical and political laziness and of simple criticism of government shortcomings. We need of course to criticize Syriza, insist on this criticism, but we must also elaborate an alternative.\nThis is what is at stake if we want also to be part of the exit from the problem. Because, if this historical cycle ends up with a full restoration of capitalist dominance in the political scene, then in the end we will all be part of the defeat. Then people will hold us equally responsible for missing the opportunity of turning Greece into the weakest link of the European chain.\nOf course, there is a broader historical dimension to this question. So this is what I think is the challenge for Antarsya, for the anti-EU forces in general, and in a certain different way for the left, anticapitalist forces within Syriza. We need to find ways to elaborate the alternative, this is for me the challenge.", "url": "https://www.jacobinmag.com/2015/04/antarsya-syriza-communist-party-greece-euro/"}