{"authors": ["Boaz Vilallonga", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:08", "date_modify": "2020-05-04 19:53:08", "date_publish": "2015-10-17 00:00:00", "description": null, "filename": "2015_10__1588621988.html", "image_url": "https://images.jacobinmag.com/2015/10/17010029/Catalan_National_Day.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_10__1588621988.html", "title": "The Catalan Left", "title_page": "The Catalan Left", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "BV\nYes, many of these concepts require an explanation. I’ll start with the idea of “Catalan Countries.”\nLegally, what is known as “Catalonia” refers to a northeast region in Spain, with Barcelona as its capital, and with an autonomous, devolved government and parliament. Historically, “Catalonia” included what is now known as “Département des Pyrénées-Orientales,” in France, with Perpignan as its capital. This French county is also known as “Northern Catalonia” and it was ceded by the Spanish monarchy to the French crown in 1659.\nCatalan language and culture are also a constitutive part of Valencia, the Balearic Islands, some Aragonese counties, the independent country of Andorra, and the Italian city of Alghero. This geographical area is what is known as the Catalan Countries.\nEven though the main object of Catalonian secession, as it is understood today, is the region within Spain, radical separatism expects to create a new nation-state comprising the area of the Catalan Countries.\nThis view has intense parallels with Basque irredentism and the reunion of all the provinces of the Basque Country (Euskal Herria), covering Álava, Guipúzcoa, Vizcaya and Navarre in Spain, and parts of the “Département des Pyrénées-Atlantiques” in France.\nThe idea of the Catalan Countries has been generally criticized by the Spanish left as “expansionist nationalism,” imperialism, or even racism. Critics miss a crucial point: the rhetoric of Catalan radical separatism builds on the struggles of national liberation and internationalism, two core tenets of many liberation movements in historical decolonization processes. Indeed, the movement for Basque national liberation was one of the first ones to apply colonial dialectics in the revolutionary socialist project for an independent Basque country. For instance, the works of the Basque nationalist Federico Krutwig, such as Vasconia, were directly inspired by the Algerian National Liberation Front.\nWhile the Basque roots of Catalan socialist separatism have been influential in the early beginnings of CUP, the political party has been able to build its own way to socialism. At the center of this socialist project there are three main tenets: the open assembly as the highest expression of participatory democracy, municipalism, and popular unity.\nAnyone, member or non-member, can attend a CUP assembly. This has been the system developed through the years in order to accommodate diverse political organizations and social movements into what originally began as a mere separatist political platform for Catalan municipal elections.\nStill today, local assemblies are the main body of power of CUP. In fact, several of these local assemblies had been opposed to running CUP in any other election than the local ones. The national assembly does not override the power of local assemblies: it derives its power from them and their members.\nThe national assembly is open to members, not to delegates. The national secretariat acts as executive committee, with no leadership role defined. Additionally, the CUP constitution has mechanisms to avoid consecutive reelections of committee members or representatives, in order to ensure that no personalism is created.\nCUP sees municipalism as the basic political foundation for building socialism. Political struggle and autonomy are better expressed in the local framework. In the beginning, the choice to work on the local level was rather instrumentalist and pragmatic: it was the best way to break the ground with a plausible, feasible alternative socialist agenda. Today CUP has 382 elected councilmen and sixteen mayors, including in the third most populated city in Catalonia.", "url": "https://www.jacobinmag.com/2015/10/catalan-referendum-spain-podemos-independence/"}