{"authors": ["Charlie Post", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:45", "date_modify": "2020-05-04 19:52:45", "date_publish": "2015-06-17 00:00:00", "description": null, "filename": "2015_06__1588621965.html", "image_url": "https://images.jacobinmag.com/2015/06/17004126/rtx15p9t-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_06__1588621965.html", "title": "The New Militant Minority", "title_page": "The New Militant Minority", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Since the publication of False Promises: The Shaping of American Working Class Consciousness in 1973, Stanley Aronowitz has been one of the most important left critics of the official US labor movement. His latest book, The Death and Life of American Labor , builds on and synthesizes much of this previous work, and is a provocative contribution to discussions of the road out of organized labor’s current crisis.\nAt the core of The Death and Life of American Labor is a powerful critique of “bureaucratic business unionism” — the strategy of the US labor officialdom. This strategy, which became dominant in the insurgent industrial unions during the Second World War, rests on three key pillars.\nFirst is the reliance on routine collective bargaining and the grievance procedure for the improvement and defense of the wages, benefits, and working conditions for the membership of their unions. Put simply, the most important industrial unions gave up contesting control over the labor process and recognized capital’s “right to manage” after the war.\nThe surrender of control over the introduction of technology, and the resulting speed-up and deskilling of work, was justified as a trade-off for higher wages and employment-based social benefits. Ultimately, reliance on routine bargaining and the grievance procedure produced membership passivity in unionized workplaces.\nThe second pillar of the labor officials’ strategy was reliance on the National Labor Relations Act framework for union recognition. Most US unions embraced the process in which the National Labor Relations Board (NLRB) defined bargaining units and organized elections that sanctioned representation by a single union. By the late 1950s, as capital became more aggressive in its resistance to new private sector union organization, the NLRB became an increasingly inadequate instrument for preserving or expanding union density.\nFinally, the labor movement relied on the corporate-financed and corporate-led Democratic Party to promote a “pro-labor” political agenda. The limited political victories labor and its allies won in the late 1960s and early 1970s were much more the result of the ferment among young workers and black militancy in this period than labor’s alliance with the Democrats.\nRather than creating a welfare state that provided benefits to all working people, the “barren marriage of labor and the Democrats” gave birth to “private welfare state” based on health care and pensions tied to employment and a public welfare state that provided meager benefits to the poorest sectors of the class.\nThe bureaucratic business union strategy was barely sufficient for defending and improving the wages and benefits for the slowly shrinking percentage of private sector workers organized by unions prior to the late 1970s. As employers became more aggressive in the late 1970s, business unionism has been unable to defend past gains, not to mention gain new ones.\nOver the past four decades, we have seen continuous retreat by labor. Concession bargaining has displaced industry-wide pattern bargaining, allowing the revival of wage-benefit-schedule competition among workers in the same industry and often the same workplace. The NLRB has overseen, and often facilitated, the near total collapse of private sector unionism, and state legislators across the country have launched a new offensive against the last bastion of unionism in the United States — the public sector.\nThe alliance with the Democrats has not even prevented the dismantling of the meager American welfare state and its replacement with pro-corporate “social service” programs like Obamacare.\nThe general thrust of Aronowitz’s vision for a new workers movement is also convincing. He emphasizes the need to rebuild workplace power through militant, democratic worker organizations. Such organization can only be created if organizers are willing to go outside the NLRB framework to reorganize the private sector. The key to this revival is the cohering of a new “militant minority” of worker leaders with a radical political vision that extends beyond the workplace.\nHowever, specific aspects of Aronowitz’s program for the building of a new workers movement are problematic. For Aronowitz the creation of a new Trade Union Education League (TUEL), the non-party Communist-led organization that brought together rank-and-file militants in existing unions and unorganized workplaces around a program of industrial unionism, union democracy, workplace militancy, and political independence in the 1920s must be on the agenda today.\nWhile the creation of a new TUEL should be the goal of the labor left, Aronowitz tends to discount the level of disorganization and demoralization among the contemporary “militant minority.” The integration of the most important organization of workplace radicals, the Communist Party, into the officialdom of the new industrial unions in the late 1930s disrupted the continuity of the militant minority. Combined with the impact of four decades of defeat, the weakness of the militant minority today will make the reorganization of this layer an extended and difficult process.\nLeft activists in the labor movement today need to recognize that the milieu around Labor Notes — its thousands of subscribers and the two thousand labor activists who attend their biannual conferences — is the necessary starting point for the reconstruction of a “militant minority” and the organization of a new TUEL.\nAronowitz also advocates what has become known as “non-majority unions” — workplace committees that act as unions (organizing around grievances, direct action, etc.) without attempting to immediately win representation elections. The path to new worker organization will probably take place outside the NLRB framework, as it did before 1938.\nHowever, Aronowitz’s advocacy of permanent, multiple, non-majority unions in each workplace is problematic. The “French model,” in which several unions contend continuously to represent workers, functions because near insurrectionary struggles in 1936, 1946–47, and 1968 made industry-wide bargaining mandatory. In the absence of mandatory bargaining or some sort of industry-wide “peak bargaining,” multiple unions could in fact make workers weaker, by allowing employers to pit one union against another in a race to the bottom.\nAronowitz is also critical of the attempt to “reform” the existing unions, citing examples in New York City (the “New Directions” caucus in the Transport Workers Union and the “New Caucus” in the Professional Staff Congress–City University of New York) that won office and became quite complacent once in power.\nIt is likely that the existing unions will not be the organizational framework for a new workers movement. This was certainly the case in the 1930s, as the Congress of Industrial Organizations displaced the conservative American Federation of Labor. However, it is a mistake to deprioritize the work of radicals and militants in existing unions where they still exist.\nAfter all, the initial waves of industrial workers organizing and struggling in the 1930s passed through the AFL federal locals. In those AFL unions where radicals abstained from joining (steel, West Coast maritime), AFL officials were able to disorganize workers’ attempts to strike for recognition. But in those AFL unions where radicals had a presence (auto, rubber, machine making, West Coast longshore), the radicals were able to provide leadership and a strategic vision that led to successful organization in the mid-1930s.\nClearly, the issue of the relative importance of electoral activity and organizing workplace actions needs to be debated more thoroughly in current union reform efforts. However, it is completely reasonable to expect that future waves of worker organizing will pass through the existing unions, requiring radicals to continue “reform work” in the existing unions.\nPerhaps the most contentious element of Aronowitz’s book is his analysis of the relative strategic importance of different segments of the working class in rebuilding the workers movement. Aronowitz argues that automation both reduced the numbers of industrial workers and deskilled those who remained to the point where most are mere “gauge readers” with little or no skill or workplace power.\nHe argues that this restructuring of work has created two new, growing strategic sectors — the mass of precariously employed, low-wage workers (disproportionately people of color and immigrants) in retail, service, health care, and other fields; and formerly new middle-class engineers whose symbolic labor is crucial to the development and implementation of automated production.\nWhile the organization of engineers and the low-waged into professional unions and workers centers are hopeful signs for the revival of the workers movement, Aronowitz’s claims that industrial workers are no longer central to the revival of the fortunes of the US workers movement are questionable.\nThough it is often summoned by liberal commentators, the decline in the number of manufacturing jobs as the result of technical innovation is not the primary cause of the decline of industrial union membership. According to Bureau of Labor Statistics (BLS) data, between 1994 and 2013 the manufacturing workforce dropped 33 percent, while union membership in manufacturing dropped 60 percent.\nNor is it clear that the growing numbers of low-wage workers in retail, services and health care are as precarious as Aronowitz implies. According to BLS and Census Bureau data, 90 percent of the US workforce is in “traditional” employer-employee arrangements, with less than 10 percent working for independent contractors or temporary agencies. Of the workers in “non-traditional” employment, almost 85 percent work full time.\nIn fact, while the number of workers employed by temporary agencies increased from 1.5 million in 1990 to 3.9 in 2000, by 2010 the numbers had dropped to 2.7 million. Organisation for Economic Cooperation and Development (OECD) data indicates that most part-time workers in retail, services, and health care are not “precarious” in terms of long-term employment — they often work for the same firm or in the same industry, part-time, for decades; they are just deprived of stable full-time employment.\nIn addition, the low-wage workers in the service and retail industry lack the social power to win and change the relationship of forces by themselves. This is often profoundly deskilled work, and workers are extremely easy to replace. Much of the Service Employees International Union (SEIU) organized “Fight for $15” and the United Food and Commercial Workers (UFCW) organizing at Walmart has been more theater than the exercise of real power to shut down a workplace.\nHowever, the growth of just-in-time inventory systems, where computers order supplies to be delivered on a nearly daily (if not hourly) basis, throughout the economy has made supply chains highly vulnerable. Successful organizing of fast food or the new Walmartized retail will require more strategically located (and often better paid, more full-time) workers in warehouses and logistics to exercise their greater social power.\nFinally, traditional industrial workers in manufacturing, transport, and telecommunications still have social power, despite automation and deskilling. The universalization of just-in-time inventory systems means that workers in transport and telecommunications have enormous social power. So do strategically placed workers making key components of other industrial products.\nTake the 1994 strike at the General Motors plant in Flint, Michigan that produced brake assemblies for all the GM plants in North America. Within four days, twenty-four out of twenty-six GM plants in the US, Canada and Mexico had been shut down by a “local” strike over forced overtime. If the strike had continued another forty-eight hours, auto experts expected the complete shutdown of GM’s operations.\nNor is computerization an unconditional blessing for capital. First, we need to do more concrete studies of the impact of computerization on the labor process. To what extent are computers in manufacturing — as in logistics — coordinating work still done by live humans? It is not clear that most industrial workers have been reduced to deskilled “gauge readers.” This is certainly not the case, as Aronowitz recognizes, in the auto industry.\nSecond, computerization and new technologies put more power in the hands of the skilled workers who maintain these machines. These skilled manual workers have as much, if not more potential social power than engineers engaged in symbolic labor. Given the attempts to broadband their labor (“multi-skill”) and reduce their wages and benefits, it is not impossible to see these skilled workers playing a crucial role in organizing unskilled workers as they did in the 1930s in the face of similar attempts to “dilute” their labor.\nFinally, industries where workers have been reduced to “gauge watchers,” such as in the petroleum refining industry, have nonetheless produced strong unions like the Oil, Chemical and Atomic Workers (particularly through the 1970s). In the 1930s, deskilled workers often exercised power by staying at their machines, engaging in sit-down strikes and factory occupations. It is not difficult to imagine workers who have today been reduced to monitoring self-acting machines exercising power through this sort of direct action.", "url": "https://www.jacobinmag.com/2015/06/american-unions-labor-aronowitz/"}