{"authors": ["Barbara J. Fields", "Karen E. Fields", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:52:22", "date_modify": "2020-05-04 19:52:22", "date_publish": "2015-06-17 00:00:00", "description": null, "filename": "2015_06__1588621942.html", "image_url": "https://images.jacobinmag.com/2015/06/17004412/03296v-1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_06__1588621942.html", "title": "How Race Is Conjured", "title_page": "How Race Is Conjured", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Interview by Jason Farbman\nIn the three years since Trayvon Martin was killed, the realities of police racism and violence, of segregation from schools to swimming pools, and of the legacy of slavery and Jim Crow have returned to mainstream discussions. And now as Confederate flags disappear in the wake of the murders in Charleston, racism is once again at the center of the popular consciousness.\nThere is a window, then, for the US left to push a deeper and broader conversation about the implications of racism and to build working-class organizations that fight for social justice for all.\nBut that opportunity will only be open to the degree we can overcome the ideological legacy of the last three decades. Since the 1980s, structural inequality has been increasingly replaced by personal responsibility as the main explanation for gross inequality. At the same time, attention to persistent and structural racism faded, supplanted by a focus on race and “race relations.”\nThis could not have been possible without the enshrinement of race as a natural category, the spread of the fiction that certain traits define members of one “race” and differentiate them from members of other races.\nNo one has better articulated why race cannot serve as the starting point for discussions about inequality in the United States — and what we miss when they are — than Barbara and Karen Fields, authors of the 2012 book Racecraft: The Soul of Inequality in American Life.\nBarbara and Karen were interviewed for Jacobin last week by Jason Farbman, a member of the International Socialist Organization in New York.", "url": "https://www.jacobinmag.com/2015/06/karen-barbara-fields-racecraft-dolezal-racism/"}