{"authors": ["Stathis Kouvelakis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:15", "date_modify": "2020-05-04 19:54:15", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07__1588622055.html", "image_url": "https://images.jacobinmag.com/2015/07/17004613/greece-oxi-no-flags-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07__1588622055.html", "title": "Cracks in the Deal?", "title_page": "Cracks in the Deal?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The scene in Athens is explosive. A mass rally is being held this evening in front of the Greek Parliament, where members are voting on the proposed agreement with the country’s creditors. The majority of Syriza’s central committee members (109 of 201) say they oppose the deal. Syriza’s local and regional branches have been issuing a wave of statements calling on the leadership to withdraw the agreement. And these statements have been approved overwhelmingly, often unanimously.\nYesterday, Greek Prime Minister Alexis Tsipras acknowledged in an interview with the public broadcaster that the accord was bad and that he “didn’t believe in it,” but that there was basically no other solution. He also said that he was not going to jump out of the boat.\nIn the most recent meeting of the party’s political secretariat, only a small minority backed the agreement and favored supporting the government. Finance Minister Euclid Tsakalotos, who reported on the accord, admitted that it wasn’t politically sustainable. Many members asked for the government to resign and that a “special task” government be constituted as a transition to snap elections in November, which would coincide with those in Spain.\nThe Left Platform of Syriza disagreed with this proposal, explaining that it would mean that Syriza MPs would condone for months a technocratic cabinet applying austerity. It instead called on the government to immediately rescind the agreement.\nThe Left Platform also announced that it will not vote for the agreement today. In an internal meeting, impressively attended yesterday and widely reported on by the media (journalists came en masse although it was made clear that they were not welcome), Left Platform leader Panagiotis Lafazanis categorically rejected the agreement, explaining that exiting the eurozone (“Grexit”) is the only solution and that the government should prepare for it.\nThe Left Platform will hold a public meeting next Monday in Athens to present its alternative proposal and call for Grexit. The trade-union sector of the party, overwhelmingly supportive of the Left Platform, is playing a leading role in organizing protests against the agreement.\nIn the first test on the social mobilization front, the Civil Servants’ Confederation (ADEDY) is on strike today against the accord. While participation seems rather low, the real metric is this evening’s gathering outside parliament.\n— Athens, Greece, 2 PM local time", "url": "https://www.jacobinmag.com/2015/07/syriza-debt-tsipras-left-platform-kouvelakis/"}