{"authors": ["Jennifer Mittelstadt", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:49:40", "date_modify": "2020-05-04 19:49:40", "date_publish": "2015-07-17 00:00:00", "description": null, "filename": "2015_07__1588621780.html", "image_url": "https://images.jacobinmag.com/2015/07/17004654/Signing_Of_The_Social_Security_Act-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_07__1588621780.html", "title": "Reimagining the Welfare State", "title_page": "Reimagining the Welfare State", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nSince the creation of the free-market Liberty League by the DuPont brothers in 1936, hostile corporate leaders, financiers, economists, and lawmakers have been bent on destroying Franklin Roosevelt’s New Deal welfare state. Wisconsin workers have seen their right to collective bargaining outlined in the New Deal’s Wagner Act gutted, while public pensions, created during the Great Depression to bolster public employment and ensure long-term economic security, have been attacked from Alaska to Florida. Congress also continues to chip away at the state-sponsored provision of basic needs, recently targeting the food stamp program (originally created under FDR) by proposing that all recipients hold jobs, suffer lifetime limits, and receive lower overall benefits. To many observers, it appears that the New Deal and its safety net have been shredded. Political scientists and others have argued that the perilous individual economic risk that Americans faced before the New Deal has been foisted back on them as its collective protections have withered. With the shocking growth in economic inequality that has arisen alongside cuts to the New Deal, freedom from want — the keystone of Roosevelt’s “Four Freedoms” — has been chipped away to a pebble. It’s enough to make Americans long for a revival of the politics of the 1930s. But we should be clear-eyed rather than nostalgic about the demise of the welfare state. The New Deal was a flawed welfare system. It was built through exclusions and inequities, embracing some Americans while cutting out many others. Though its programs enveloped a wider swath of citizens over time — more non-whites, more women, and more marginal workers — their entrance into the safety net was hard fought and politically controversial. The fractured inequities the New Deal produced among the populace never really disappeared and, in some ways, widened and sharpened the divide between those inside of the New Deal’s protective web and those beyond it. This was in part because New Deal programs were not the only vehicles for social welfare, but existed alongside other programs that also differentiated among citizens and their entitlements. The New Deal was never synonymous with the welfare state as many European countries developed it: comprehensive and universal social welfare programs for populations enjoying rough equal citizenship rights. Instead, the New Deal was part of a hodgepodge of varied and sometimes hidden social welfare programs — some public, some private — that rewarded different groups of Americans for different reasons. Seeing the New Deal alongside the unwieldy and unequal panoply of American social welfare prevents us from indulging in an exceptionalist narrative of its history, or embracing a misplaced nostalgia for a glorious historical moment.\nFor Whom Was the New Deal a Deal? For workers in steady industrial jobs, working year-round, the New Deal provided economic security through unionization, labor protections, and social insurance. The lucky Americans who held these jobs were largely male and white, beneficiaries of the sex and race-segregated labor markets of the time. Reinforced by the economic growth of World War II, the GI Bill, postwar prosperity, and the union-corporate accords of the 1950s, New Deal supports afforded these men — and their families — a higher standard of living, even when they were too old or sick to work, than any common citizens of the United States had ever experienced. Their unions protected them in the workplace. Their bank accounts were insured. For some, the Federal Housing Administration provided loans. Unemployment insurance offered unprecedented protection from the vagaries of the volatile capitalist economy. And Social Security offered the promise of retirement or, upon death, the protection of wives and children — a historic first for the working class. The New Deal cast the net of economic security wider than ever before, but not wide enough to bring in vast numbers of Americans who labored outside of the steady, salaried primary labor market. Unskilled non-industrial workers never made it inside the original New Deal’s safety net. Southern and Western representatives of agricultural interests would not abide social protections and entitlements for the largely non-white agricultural workforce in their states. Southerners lobbied for the right to discriminate against African Americans, whom they feared would leave plantations and domestic work for higher paid public works jobs. One DuPont vice president, an early member of the Liberty League, wrote angrily to a political sympathizer about the “Five negroes on my place in South Carolina [who] refused work this spring . . . saying they had easy jobs with the government.” If applied equally, the New Deal’s public works and public welfare programs could offer economic alternatives to poorly paid, exploited African-American agricultural and domestic labor. Southerners traded their votes for the white, male industrial programs of the New Deal in order to prevent such eventualities in their states. Domestic workers, employed throughout the country and largely non-white and female, were not entitled either to labor protections or social insurance. Non-whites, largely African Americans and Mexican Americans, were denied insurance or union protections because of their low status in the secondary labor market, and they were also discriminated against in New Deal recovery and public works programs. The National Recovery Administration gave hiring preference to whites and sanctioned separate, lower pay scales for African Americans. The Public Works Administration and Works Progress Administration offered fewer programs in the agricultural areas of the country where non-whites were concentrated. The Civilian Conservation Corps operated racially segregated camps, and the New Deal’s agricultural programs offered incentives to white landowners to throw African-American tenants and sharecroppers off the land. In the South and West, state and local leaders used the discretionary powers granted by the federal public assistance programs to limit cash assistance to African Americans. Women, like non-whites, found that the New Deal did not provide them a very good deal, at least not directly. In the 1930s, women constituted between 24–30 percent of workers in the labor market (their numbers in the labor market increased over the course of the decade). And although the Wagner Act legalized unionization, sex-segregated labor markets untouched by the New Deal meant that women only had access to about 10 to 15 percent of unionized jobs. Fired in the face of men’s perceived need to possess the scarce jobs of the 1930s, many women sought public works jobs to support themselves. But women only received about 12 percent of New Deal public works program jobs — less than half as much as their representation in the labor market. The New Deal public works jobs that were open to them often placed them in the traditional sex-segregated female positions in which they labored in the private sector, like domestic service, sewing, and nursing. Imagining them as secondary and non-essential, the New Deal cast women as less than full economic citizens, failing to offer even regular, salaried full-time female workers the same access to social and economic security as men. New Deal policymakers imagined women as fundamentally dependent on male breadwinners, and constructed New Deal social welfare programs around that image. Social Security — the keystone of the New Deal welfare programs — also yoked women to their husbands in old age. Married women who had paid into the Social Security program would have to share the payments of their higher paid husbands and forfeit their own. Policymakers instead siphoned off married women’s payments into the general revenues of the program.\nNetworks of Exclusion The New Deal was not just limited — it was also only one of numerous coexisting systems of welfare provision. Over the course of the twentieth century, millions of Americans derived social and economic support through myriad other government “welfare states” outside the New Deal orbit. These programs tended to accentuate the inequities institutionalized in the New Deal, bringing greater economic security to white, male breadwinners in the primary labor market. The military welfare state for veterans and active duty personnel shored up the economic and social security of the millions of Americans — overwhelmingly men — who served in the wars of the twentieth century. The post–World War II GI Bill was practically a New Deal of its own. It vaulted millions of American men and their families into the middle class through tuition payments and stipends, and home, farm, and small-business loans. GI Bills for the veterans of Korea and Vietnam, while not as generous as the original, continued the tradition of veterans’ support. With the creation of the all-volunteer armed forces in 1973, the military began to offer generous social and economic welfare programs in order to recruit and retain the mostly male personnel it needed. For the over ten million personnel who have served since then, and their tens of millions of spouses and children, the military has offered what might be the most comprehensive social welfare system in the United States. The post–World War II era tax system formed another bulwark, providing write-offs for heterosexual marriage, children, and home ownership. Often unrecognized, they operated as what Suzanne Mettler has called a hidden welfare state, but their credits helped build the Ozzie and Harriet suburbs that sustained millions of white men and their families. Many American men with good jobs in the primary labor market were also able to access a private safety net in addition to a public one. White-collar salaried workers for America’s large blue chip corporations — overwhelmingly male and white — as well as unionized blue-collar workers in America’s postwar factories — again, mostly male and white — negotiated private employer–provided insurance and medical programs. Subsidized and encouraged by the government through corporate tax incentives, private employee benefits supplied the largely male managerial and unionized industrial workforce a private supplement to the New Deal welfare state under which they were already covered. Franklin Roosevelt’s New Deal thus provided one important avenue of social welfare rather than the sole path to welfare provision. But even the more patchwork welfare states all worked in a kind of herky-jerky synchronicity to shore up the well-being of the initial beneficiaries of the New Deal, while leaving most non-whites and women with second-class social and economic citizenship.\nThe New Deal Legacy There is now a vigorous debate among historians about the New Deal’s legacy. Some, like Jefferson Cowie and Nick Salvatore, argue that the New Deal’s exclusions, while real, should not diminish its achievements. The Wagner Act, fair labor standards, Social Security, unemployment insurance, public assistance, and public works programs — all provided greater “collective economic security” to more Americans than ever before. The New Deal programs established the basis for a principle of social and economic protection that, they argue, could in theory be expanded to others. But a wealth of scholarship, by people like Ira Katznelson and Alice Kessler-Harris, reveals that sanguine analyses like these overlook the compromised foundation of the New Deal’s achievements: it was precisely the exclusion of blacks and Mexicans, and the imaging of women as dependent wives, that allowed for the creation of a New Deal welfare state for white male breadwinners in regularized industrial and union jobs. The architecture of protection for white men was built in part on the backs of those who were denied full economic and social citizenship. Good, protected jobs and social welfare existed now as a laudable opposite of lesser jobs — and lesser citizens. Southern and Western landowners could still exploit non-white labor in the fields or on the docks. African Americans and women would face barriers to challenging white men in the primary labor market, while married women would continue to be reliant on male breadwinners and provide needed domestic labor in those homes. The limited citizenship of many non-whites and women were traded for — and literally made possible by — the granting of full social and economic citizenship to white men. Over time New Deal programs did expand to include more Americans. Social Security was extended to nearly 90 percent of American workers by the 1970s so that by the mid 1970s, poverty among older Americans had dramatically declined. Unemployment insurance also expanded significantly, softening some of the hardship of the business cycle. New programs covering disabilities of various kinds, both through insurance and public assistance, were created from the 1940s through the 1970s, and in the past twenty years have constituted the fasting growing realm of social protection. As these expansions took place, marginal workers, women, and African Americans began to finally demand their own “New Deal.” In fact, entitlement to social support and economic protection constituted one of the central goals of both the Black Freedom Movement and the feminist movement. Women and nonwhites argued that the New Deal’s support programs were hallmarks of equal citizenship. In these ways, “rights” movements actually functioned as fights for equal access to the safety net that white men already enjoyed. But those already on the inside of the New Deal met the requests of women and non-whites for access to entitlements with sharp rebukes. Historians like Thomas Sugrue, Lisa Levenstein, and David Freund have documented how white, mostly male communities of workers and homeowners rejected African Americans’ claims to social protections they enjoyed, such as union-protected jobs, FHA loans, and access to public hospitals and schools. Marisa Chappell and Donald Critchlow have likewise demonstrated the ferocious backlash against women’s claims to equal employment opportunities and the feminist movement’s requests for social protections like childcare or maternity leave. Traditional New Deal supporters balked at including non-whites and women, who now sought first-class citizenship. Indeed, they turned on those aspects of the welfare state most likely to benefit non-whites and women — public assistance, food stamps, and public housing. Some in the traditional New Deal coalition colored the War on Poverty as a “black” program and rejected it even as Lyndon Johnson’s Great Society brought more highways, parks, and college loans to their suburban communities. They charged social movements demanding equal social protection with being divisive “individual rights” movements that undermined the imagined “collective spirit” of the “universal” New Deal and its legacy. Even today, the charge that social movements’ focus on “individual rights” somehow fractured the liberal left and killed the New Deal coalition and its social welfare legacies carries weight among liberal and left scholars, even though it patently echoes the original unequal exclusion and entitlement of the New Deal. Of course, this charge fuels even more fire among opponents of the New Deal, whose resistance to the inclusion of blacks and women formed an important prong of their assault. Conservative Republicans and Southern Democrats had already beaten back additions to the New Deal — they soundly rejected legislation for full employment and universal health care in the 1940s. But their plans for rollback of the existing welfare state accelerated in the 1960s and 1970s amid the breakdown of the postwar economic order, just as African Americans and women began to gain access to the more inclusive programs of the New Deal as well as additional modes of social welfare. In the 1980s, the frenzy over the “underclass” purportedly created by the War on Poverty and the obsession with eliminating Aid to Families with Dependent Children (AFDC) could not be understood without reference to the ways that racist and sexist ideas merged with philosophical support for “free” markets and opposition to “socialism” in the face of economic crisis. In the past ten years,the Right has skillfully employed gendered and racialized dog whistles to delegitimize government itself through a strategy of “welfare-ization” of the state. Republicans liken public school teachers and road builders to “welfare queens” who bilk the taxpayers through their bloated benefits and dependency on government. As Gov. Scott Walker said when he eliminated the right of Wisconsin’s public workers to collectively bargain for their wages and benefits: “We can no longer live in a society where public sector workers are the haves and the taxpayers who foot the bill are the have nots.” The jobs and pensions of government workers are now fair game.", "url": "https://www.jacobinmag.com/2015/07/fdr-social-security-gi-bill/"}