{"authors": ["Lois Weiner", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:30", "date_modify": "2020-05-04 19:50:30", "date_publish": "2015-09-17 00:00:00", "description": null, "filename": "2015_09_black-lives-matter-labor-day-dyett-strike_1588621830.html", "image_url": "https://images.jacobinmag.com/2015/09/17005434/0903_0601strikers_b-11-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_09_black-lives-matter-labor-day-dyett-strike_1588621830.html", "title": "A Labor Movement That Takes Sides", "title_page": "A Labor Movement That Takes Sides", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Here’s an urgent Labor Day challenge for organized labor: grapple with the simultaneously heroic and sordid history of unions in America, and use the past to inform the fight to revive the labor movement today. The emergence of Black Lives Matter demands that we remember not just those unions who fought for principles of racial equality, but those that capitulated to racism.\nToo many of labor’s supporters won’t criticize unions for their lack of internal democracy, seeing it as airing dirty laundry in public and thus weakening an already enfeebled progressive force. The fear is understandable, but labor’s desperately needed revitalization is unlikely to occur without unions and their supporters facing what is essentially an identity crisis.\nLabor’s opponents, who see, correctly, that unions have tremendous potential to derail the project of increasing wealth for the few at the expense of the many, are quick to expose labor’s dirty laundry. Our best defense against this is to confront the problems openly.\nAs it stands, unions can’t be counted on to be on the right side of the struggle between wage earners and the boss. What Kim Moody wrote in 1998 remains true: the AFL-CIO has the “vaguely class-oriented idea that the federation must speak for all ‘working families’ and turn up the ‘street heat’ to organize the millions.” But they simultaneously cling to the illusion that they will be rewarded for cozying up to capital, accepting all but its worst excesses.\nWe see this with the American Federation of Teachers (AFT), which collaborates with the National Endowment for Democracy (NED). Through NED, the AFT aids the US State Department’s undercutting of unions unfriendly to US capitalism, subverting efforts by teacher unions across the world to fight the global project to destroy public education. NED also promotes the Center for International Private Enterprise, which supports the “development of market-oriented institutions around the world” and is led by the US Chamber of Commerce president.\nSo while (sort of) fighting education privatization in the US, the AFT also pushes free-market policies. Which side is the AFT on?\nTo be sure, there is positive change occurring in organized labor, as seen in the Fight for 15 campaign, the new understanding of and support for immigration rights, and the greater willingness to recognize systemic racism in response to Black Lives Matter. But these are constrained by the unions’ lack of internal democracy and unwillingness to break with business (unionism) as usual.\nUnions can’t fix every social problem, and ought not be expected to do so, but to win the loyalty and trust of working people, labor has to embrace and act on the principle that if it’s a social justice problem, it’s a labor issue.\nWhen AFL-CIO President Richard Trumka acknowledges the contradiction of police unions’ membership in AFSCME, that both Michael Brown’s mother and killer are union members and “our brother killed our sister’s son,” he begins to do that. However, it’s not enough to talk. We need to enforce the principle that solidarity, social justice, and democracy are as “union” as wages and benefits. When unions make these labor issues, they become the connective tissue of a broad social movement that wins public loyalty and trust in labor battles.\nWhat does this kind of unionism actually look like? One source of guidance is historic labor struggles, like the Battle of Virden in Illinois. An 1898 mineworkers strike, this story shows both the difficulty and potency of interracial organizing in worker struggles.\nAs historian Carl Weinberg explains, to break the miners’ strike, which had deep, social support and was organized by an extraordinarily courageous, militant union, employers brought up black workers from Alabama by train. African-American union miners, mainly from Springfield, helped patrol the tracks approaching Virden to aid their striking “brother miners.”\nIn a remarkable show of solidarity, “penniless Black miners and their families who arrived in Virden refused to serve as strikebreakers once they learned the truth of the situation.” While the strikers won the immediate battle, the operators’ divide-and-conquer tactic of recruiting blacks to break the strike did harm that lasted long after the strike — the tactic was partly successful in convincing white Illinois miners that blacks would be strikebreakers. Weinberg concludes that the limit of the miners’ success in the Battle of Virden was “the powerful and ongoing scourge of racism in the region.”\nThe other part of this story is how leaders of black pro-union miners interacted with racist miners and negotiated with the union apparatus. The letters of Richard L. Davis, a black spokesman in the 1880s and 1890s for many African-American miners in Ohio and three southern states, show he had a tough sell as an intermediary with the white majority and white national leadership of the United Mine Workers. But what a salesman he was.\nIn one letter he responds to a black miner who justifies going to coalfields near Seattle and breaking a strike. Striking white miners and the Seattle labor movement as a whole responded with vicious, violent racism to this scabbing, yet Davis’s commitment to interracial solidarity is unswerving.\nHe first asserts the need to fight for racial equality in the union and the coalfields, then turns the issue around and asks the strikebreaking miner,\nsuppose that you were working in a place and the company brought in three or four hundred white men to take your places, what would be the result? I fancy you would not speak as you do now. No, sir, you would pick [up] your gun if you had one, and you would try to kill every white man that you saw, whether he was your enemy or not.\nAnd to the strikebreaker’s argument that “28 years ago he was a chattel slave; today he is a free American citizen,” Davis writes:\nHow utterly false! None of us who toil for our daily bread are free . . . Does any negro think that an operator thinks any more of him than he does of a white man? If you do, you are sadly mistaken, for I remember several instances right here in this valley: whenever the colored men asked for that which was something like right and just, the answer was, whenever you colored men want the same as the whites do then we have no further need for you . . . it is not a white man’s country; it is partly ours as well.\nDavis then urges black strikers to defend their rights to be treated as equals, a right they forfeit when they allow themselves to be used as replacement workers.\nWe hear reverberations of Davis’s ideas in battles that aren’t conventionally understood as labor struggles — yet must be if we take social justice to be a labor principle as dear as not crossing a picket line. “You are not better than us; you are not smarter than us; and you do not love these children more than we do,” Jitu Brown said on Friday, announcing that he and the other Chicago activists involved in the Dyett hunger strike, now in its third week, won’t be letting up.\nThe strikers are demanding the recognition of their rights as parents to be involved in deciding what school their children attend. They are pushing back against “systemic disinvestment” in Chicago public schools by the powerful elite that runs the city, including Mayor Rahm Emanuel, President Obama’s former chief of staff. The school district is dismantling neighborhood schools and the African-American community with them.\nActivist teachers in the Chicago Teachers Union have been supporting the Dyett 12, as they’re called, but the hunger strikers deserve and need far more help from other unions — especially the Illinois state teachers unions, the Illinois AFL-CIO, and the two national teachers unions.\nA letter from both state teachers unions to the Illinois Legislative Black Caucus does not constitute the solidarity Dyett hunger strikers should expect from labor. Given organized labor’s historic complicity in racial segregation in Chicago and Illinois schools, it’s an embarrassingly token gesture.\nI was recently asked by a union activist, “How many backs do we have to watch?” My answer: as many as we want to watch ours. That’s the meaning of solidarity. Let’s live it this Labor Day by taking sides.\nBlack Lives Matter and hunger strikers in the #Fight4Dyett are giving US unions an opportunity to reinvigorate themselves.", "url": "https://jacobinmag.com/2015/09/black-lives-matter-labor-day-dyett-strike"}