{"authors": ["Kevin Ovenden", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:00", "date_modify": "2020-05-04 19:54:00", "date_publish": "2015-01-17 00:00:00", "description": null, "filename": "2015_01_syriza-greece-elections-tsipras_1588622040.html", "image_url": "https://images.jacobinmag.com/2015/01/17002454/16206073456_193f6d83f8_z1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_01_syriza-greece-elections-tsipras_1588622040.html", "title": "A Greek Election Primer", "title_page": "A Greek Election Primer", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nGreece has been the European country hardest hit by the global crisis unleashed following the 2008 financial crash. It is also the eurozone state upon which the most devastating austerity measures have been imposed by the troika of the European Union, the European Central Bank and the International Monetary Fund. It is against that background that the Greek workers and social movements have sustained the highest levels of resistance to austerity and an increasingly authoritarian state anywhere in Europe. That has combined with the collapse of the stabilizing, parliamentary political structures cobbled together when Greece emerged from dictatorship 40 years ago. The result is extreme political polarization. With large doses of capitalist conciliation, perforce, to popular militancy, the political compact of the mid-1970s – the period of the metapolitefsi, or regime change – did hold remarkably well. For four decades, a country which had recently experienced civil war between the radical Left and a highly authoritarian Right saw uninterrupted rule by the center-left and center-right, the Panhellenic Socialist Movement (PASOK) and New Democracy. In the 1990s, Greece joined the twenty-first century project of the euro. Old Europe was, it was claimed, ineluctably modernizing — the south becoming more like the centrist, post-ideological north. In the person of Costas Simitis, Greece had its own Blairite photocopy. Until now. “Things fall apart,” wrote the great Irish poet Yeats, “the center cannot hold.” What is loosed and at stake now in Greece is not merely the possible election of a left-led government opposed to austerity. That alone would be welcome. It would be a terrific riposte to the claque of consensus commentators who have mocked the Left for failing to grow out of a deep crisis of global capitalism, which ought to be our recruiting sergeant. More profoundly, the battlelines in Athens today are about more than the conventional politics of who will form a government, its policies and prospects. They center on the conventions of politics themselves — whether there can be an alternative to soul-destroying corporate capitalism, whether politics is to remain but a plaything of a detached caste of haughty timeservers or is to be itself democratized as part of a radical transformation of society as a whole. So while there are fruitful comparisons to be made between the prospects of a Syriza-led government following the election on January 25 and the experiences — good and bad — of the reforming governments of Andreas Papandreou in Greece or of Francois Mitterrand in France in 1981, something else is in the air. Any government of the Left now comes not out of the containment of popular radicalism which we saw in the late 1970s, but out of its resilience and re-emergence in response to today’s long crisis. What seemed like a crescendo in 1981 turned out to be a dying prelude to a neoliberal offensive which mustered its forces internationally through the swift reversal of popular reform and progressive hopes in Athens and Paris. That is not our predestined fate today. A different tune is in the air, competing with the drumbeat of austerity, war and xenophobic, anti-Muslim racism resounding from Berlin, Paris and London. It is the hopeful melody of forty years ago when dictatorships fell and everything seemed possible. A Greek friend once described to me what it was like coming into the socialist movement just a few years later, in 1980. “It was like arriving late at a party,” she said. “As you climbed the stairs up to the host’s flat streams of people were tumbling down. All a little the worse for wear, and all telling you just how good it had been.” Newsflash from Athens today: the party is not over. It’s from that standpoint that I am sending these dispatches over the coming weeks. And I’m starting today with the following background note.\nRules of the Game Greece accounts for only 2 percent of European output. But the unintended consequence of the euro experiment is that developments in Athens take on a significance not felt since classical antiquity. So all the major news organizations are upping their coverage of all things Greek. The business paper of record, the Financial Times , is introducing daily its readers to parties such as Dimar (just as it enters the dustbin of history), explaining the minutiae of the Greek political system, and parsing the speeches of Syriza’s Alexis Tsipras and other Greek figures. From the opposite standpoint – of solidarity with Syriza – colleagues from the radical left internationally are also following the election campaign avidly. Two dangers face coverage from the Left. One is to ignore the political developments, maneuvers and establishment interventions which serious mainstream journalism is overly fixated upon. The other is to become a left version of a White House correspondent and to lose sight of the clash of great social forces — of the sentiments, views and hopes of the mass of working people — on which even the most opaque passage of a political leader’s speech or the most arcane of electoral stratagems turn. Underway now in Greece is a historic clash between the Left and the Right, between — as Malcolm X once put it — the oppressed and the oppressor, the exploited and the exploiter. It is taking place primarily on the field of national parliamentary elections. It is important to understand the Greek electoral and political system, therefore, not because that represents the horizons of the future which is being contested, but precisely in order to understand just what is being fought out. The Electoral System The Greek parliament is elected by a version of proportional representation. Any party list of candidates which gets over 3 percent of the vote nationally is represented in the parliament. The 3 percent hurdle was introduced explicitly to prevent the Turkish and other minorities in northern Greece electing their own MPs under their own banner. The first 250 MPs are allocated proportionately to the share of its vote to each party with more than 3 percent. Additionally, a “bonus” of fifty seats is given to the party which comes first. The bonus rule was introduced to avoid coalitions, which would historically have given parties of the radical left some leverage, and to corral electoral politics along the lines of a two party system headed by the conservative New Democracy and the social-democratic Pasok. So 151 MPs are required to form a majority government. The outgoing government — a coalition of New Democracy and Pasok — had just 153 MPs. Such is the decline of the mainstream center. Forming a Government There is a great premium on coming first in the election, even if that does not in itself provide enough MPs to govern alone. The party which comes first is constitutionally entitled to have the first opportunity to form a government, by including other parties if necessary. If it cannot form a majority in parliament, then the opportunity passes to the second largest party, and so on. Three years ago the general election resulted in no party being able to form a government and a fresh vote was held a few weeks later resulting in New Democracy forming a coalition and Syriza as the second largest party and official opposition.\nWhere the Parties Stand Every single party associated with the coalition implementing eurozone austerity over the last three years and more has suffered a popular backlash. Most dramatic has been the fate of Pasok. When party founder Andreas Papandreou closed his victorious election campaign in 1981 he spoke to a rally of near one million people (rather disturbingly, for anyone of the Left, to the Teutonic foot-stomping of Carl Orff’s Carmina Burana!). Today, Pasok might not cross the 3 percent hurdle for representation in the parliament. To repeat – the historic party of Greek social democracy could be out of parliament. Andreas Papandreou was from one of the great dynasties which dominated Greek politics last century and which were as important as ideology in the formation of governing alliances and political parties. The other — the Karamanlis clan — had the New Democracy franchise. His son, George, already debased the family heirloom when his government signed up to the troika’s memorandum and began the austerity programme before collapsing to third place in the 2012 elections. Now George Papandreou has left Pasok and formed his own party – the Movement of Democratic Socialists. It too might fall short of 3 percent and be out of parliament. When Andreas broke from the liberal center to form Pasok he could rightly claim that he was justified in splitting the center bloc against the monarchist Right because he was giving a genuine voice to the social democratic Left, independent from the liberals. George is providing a voice only for the Papandreous. And it will not be heard beyond their own parlor. Complacent social democratic leaders elsewhere should take note. For a time Popular Orthodox Rally (LAOS) – equivalent in Britain to something between Ukip and the British National Party – was in the governing coalition. Implementing austerity brought popular retribution to the national populists. What emerged from the wreckage was the explicitly neo-Nazi Golden Dawn. It stands on between 5 and 7 percent in the opinion polls. That is down from the 9 percent it won in 2014. That’s testament to the inspiring anti-fascist and anti-racist movement in Greece, including my friends in the anti-fascist KEERFA coalition, with Pakistani and other immigrant communities at its center. But the uncomfortable, sobering reality is this: the Left is on course to win the election. Syriza may form a government. But the fascists will also be in the parliament – even though their leaders are in jail awaiting trial. And the Nazis’ support is most concentrated in the police and other repressive state structures. A breakaway, to the right, from Syriza called Dimar was also part of the pro-memorandum bloc of austerity measures. It has disappeared. The old saw about the socialist left was that we are always so fragmented and prone to splits. In Greece it is the center and center-left that comprises groupuscules. Its leading force now is essentially a media confection called The River (the 1980s British Social Democratic Party minus the gravitas and onetime support). It stands for nothing except for an idea — or rather the ghost of an idea — of something called the center. Its policy is that neither the extremes of the Left nor the Right should be given power. So it must be in any coalition government to moderate the extremes. It has barely 6 percent.\nThe Center Cannot Hold Greek politics is now polarized along two axes — left and right, and pro- and anti-memorandum. All parties and political initiatives are pulled along those axes. Of the parliamentary forces, to the Left stands Syriza – firmly top in the opinion polls with around 30 percent and a 3 percent lead over New Democracy. To its left is the Communist Party (KKE), which has for the last few years pursued a radical line, eschewing previous policies of broad “national democratic alliances” in favor of revolutionary rhetoric and calls for full-blooded socialism. It is polling around 5 percent. The Financial Times and other news organizations are perhaps mindful of their readers’ nerves by introducing piecemeal the fact that were the prospect of a radical left government not bad enough, there is also in Greece a mass, combative, extra-parliamentary left with formidable youth following. And it has elected councillors too. New Democracy provides the main pole on the Right. It is historically the Tory or Christian Democratic party of Greece. But its leader now, Antonis Samaras, in fact defected from the party in the 1990s on a national chauvinist basis. The absurdly Ruritanian, anti-Macedonian nationalism of New Democracy (with Pasok not far behind) was not enough for him and he formed his own hardline nationalist (and racist) party. Now he is back as leader of New Democracy. For British friends, it is as if Enoch Powell had become Tory prime minister. Following the tragedy at the offices of Charlie Hebdo in Paris this week, it was Samaras who made the most incendiary of interventions of any European leader. He linked the atrocity explicitly to the presence of migrants in Europe. In a recent vote of confidence in parliament he was content to allow the government to be represented in his absence by a notorious fascist who jumped from the LAOS party to New Democracy. The space on the Greek political spectrum which belonged to the center-right is now occupied by something even more virulent. And to its right stands the Golden Dawn, which seeks to provide shock troops against the labor movement and left on behalf of the oligarch industrialists while masquerading as an anti-memorandum, popular force. Between these poles all other ventures are ground like wheat against mill stones. The Independent Greeks, a Ukip-type party but avowedly anti-memorandum, is struggling to stay above 3 percent. It has some media and establishment backing. For it offers the business class a wild card in the event of a Syriza victory. The Independent Greeks say they will support an anti-memorandum government led by Syriza, but on a “national” not Left wing basis. In the rest of Europe the distinction between a left government opposing austerity and a “national unity” government opposing eurozone measures but on a national-capitalist basis is purely hypothetical. The pace of political developments in Greece makes the distinction real and present. It is part of the calculations of the elite in Greece and their hirelings, not an academic or sectarian debate on the Left.", "url": "https://www.jacobinmag.com/2015/01/syriza-greece-elections-tsipras"}