{"authors": ["Keeanga-Yamahtta Taylor", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:22", "date_modify": "2020-05-04 19:50:22", "date_publish": "2015-10-17 00:00:00", "description": null, "filename": "2015_10_black-lives-matter-freddie-gray-civil-war_1588621822.html", "image_url": "https://images.jacobinmag.com/2015/10/17010117/15734486307_53a2139d45_z.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2015_10_black-lives-matter-freddie-gray-civil-war_1588621822.html", "title": "How We Get Free", "title_page": "How We Get Free", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "On April 12, 1865, the American Civil War officially came to end when the Union Army accepted the unconditional surrender of the Confederacy on the steps of a courthouse in Appomattox, VA. The Union Army, led by two hundred thousand black soldiers, had destroyed the institution of slavery; as a result of their victory, black people were now to be no longer property but citizens of the United States.\nThe Civil Rights Act of 1866, the first declaration of civil rights in the United States, stated that\ncitizens of every race and color, without regard to any previous condition of slavery or involuntary servitude, shall have the same right, in every State and Territory in the United States . . . to full and equal benefit of all laws and proceedings for the security of person and property, as is enjoyed by white citizens.\nThere was no ambiguity that the war had buried chattel slavery once and for all. Days after the surrender of the Confederacy, Abraham Lincoln rode into Richmond, VA, the former capital of the slaveholders, where he stood upon the stairs of the former Confederate capitol building and told a large gathering crowd of black people days into their freedom,\nIn reference to you, colored people, let me say God has made you free. Although you have been deprived of your God-given rights by your so-called Masters, you are now as free as I am, and if those that claim to be your superiors do not know that you are free, take the sword and bayonet and teach them that you are — for God created all men free, giving to each the same rights of life, liberty and the pursuit of happiness.\nOne hundred and fifty years later, on April 12, 2015, at nine in the morning, 217 miles north of the Appomattox courthouse, Freddie Gray, a twenty-five-year-old black man, was arrested by the Baltimore police. His only apparent crime was making eye contact with the police and then running away. Gray was loaded into a van. By the time he emerged forty-five minutes later, his neck had been snapped and 80 percent of his spinal cord severed.\nThe distance from the end of the Civil War, with the birth of black citizenship and civil rights, to the state-sanctioned beating and torture of Gray constitutes the gap between formal equality before the law and the self-determination and self-possession inherent in actual freedom — the right to be free from oppression, the right to make determinations about your life free from duress, coercion, or threat of harm. Freedom in the United States has been elusive, contingent, and fraught with contradictions and unattainable promises — for everyone.\nBlack people were not freed into an American Dream, but into what Malcolm X described as an “American nightmare” of economic inequality and unchecked injustice. The full extent of this inequality was masked by racial terrorism.\nOne hundred years after Emancipation, African Americans dismantled the last vestiges of legal discrimination with the Civil Rights Movement, but the excitement of the movement quickly faded as American cities combusted with black people who were angry and disillusioned at being locked out of the riches of American society. Hundreds of thousands of African Americans participated in the uprisings in search of resolutions to the problems of lead poisoning, rat infestations, hunger and malnutrition, underemployment, poor schools, and persisting poverty.\nWhere liberals and radicals often converged was in the demand that blacks should have greater political control over their communities. For liberals, black electoral politics was a sign of political maturity as the movement left the streets for the poll booth, urban governance, and community control. The problem was not “the system;” it was exclusion from access to all that American society had to offer.\nSome radicals were also lured by the possibility of self-governance and community control. Indeed, it was a viable strategy, given that much of black life was controlled by white elected officials and white-led institutions. The question remained, however: could the machinery wielded in the oppression of blacks now be retooled in the name of black self-determination?\nIf freedom had in one era been imagined as inclusion in the mainstream of American society, including access to its political and financial institutions, then the last fifty years have yielded a mixed record. Indeed, since the last gasps of the black insurgency in the 1970s, there are many measures of black accomplishment and achievement in a country where black people were never intended to survive as free people.\nIs there no greater symbol of a certain kind of black accomplishment than a black president? For those who consider mastery of American politics and black political representation as the highest expression of inclusion in the mainstream, we are surely in the heyday of American “race relations.” Yet, paradoxically, at a moment when African Americans have achieved what no rational person could have imagined when the Civil War ended, we have simultaneously entered a new period of black protest, black radicalization, and the birth of a new black left.\nNo one knows what will come of this new political development, but many know the causes of its gestation. For as much success as some African Americans have achieved, 4 million black children live in poverty, 1 million black people are incarcerated, and 240,000 black people lost their homes as a result of the foreclosure crisis — resulting in the loss of hundreds of millions of dollars in black savings.\nNever before in American history has a black president presided over the misery of millions of black people, the denial of the most basic standards for health, happiness, and basic humanity. Entertainer and activist Harry Belafonte recalled his last conversation with Martin Luther King Jr, in which King lamented, “I’ve come upon something that disturbs me deeply. . . . We have fought hard and long for integration, as I believe we should have, and I know that we will win. But I’ve come to believe we’re integrating into a burning house.”\nThe aspiration of black liberation cannot be separated from what happens in the United States as a whole. Black life cannot be transformed while the country burns all around it. The fires consuming the United States are stoked by the widespread alienation of low wage and meaningless work, unaffordable rents, suffocating debt, and the boredom of poverty.\nThe essence of economic inequality is borne out in a simple fact: there are 400 billionaires in the United States and 45 million people living in poverty. These are not parallel facts; they are intersecting facts. There are 400 American billionaires because there are 45 million people living in poverty. Profit comes at the expense of the living wage.\nCorporate executives, university presidents, and capitalists in general are living the good life — because so many others are living a life of hardship. The struggle for black liberation, then, is not an abstract idea molded in isolation from the wider phenomenon of economic exploitation and inequality that pervades all of American society; it is intimately bound up with them.\nThe struggle for black liberation requires going beyond the standard narrative that black people have come a long way but have a long way to go — which, of course, says nothing about where it is that we are actually trying to get to. It requires understanding the origins and nature of black oppression and racism more generally. Most importantly, it requires a strategy, some sense of how we get from the current situation to the future.\nPerhaps at its most basic level, black liberation implies a world where black people can live in peace, without the constant threat of the social, economic, and political woes of a society that places almost no value on the vast majority of black lives. It would mean living in a world where black lives matter.\nWhile it is true that when black people get free, everyone gets free, black people in America cannot “get free” alone. In that sense, black liberation is bound up with the project of human liberation and social transformation.", "url": "https://jacobinmag.com/2015/10/black-lives-matter-freddie-gray-civil-war"}