{"authors": ["Patrick Ethridge"], "date_download": "2020-05-04 20:14:02", "date_modify": "2020-05-04 20:14:02", "date_publish": "2016-09-07 13:22:00", "description": "A federal judge Tuesday shot down Gage County's effort to get a new trial or to reduce a jury's $28.1 million verdict awarded to six people who went to prison for the brutal killing of a Beatrice...", "filename": "_67dfa66102ff4c2fba6ee10bae41a02b_1588623242.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_67dfa66102ff4c2fba6ee10bae41a02b_1588623242.html", "title": "Judge rules against Gage County", "title_page": "Judge rules against Gage County", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A federal judge Tuesday shot down Gage County’s effort to get a new trial or to reduce a jury’s $28.1 million verdict awarded to six people who went to prison for the brutal killing of a Beatrice woman that was later tied by DNA to another man.\nSenior U.S. District Judge Richard Kopf said his only “semi-surprise” is that the jury didn’t award more.\n“It is, to put it bluntly, laughable to suggest that the jury verdict was excessive,” he wrote in an order Tuesday afternoon.\nIn a similar case, he said, New York City agreed to pay $41 million to the Central Park Five.\nOn July 6, at the end of a four-week trial in Lincoln, a federal jury in Lincoln found Gage County liable for a reckless cold-case investigation led by Sheriff’s Deputy Burdette Searcey and involving psychologist and reserve Deputy Wayne Price. The investigation run four years after the rape and murder of Helen Wilson led to the arrests of six people.\nFive of them confessed or entered no contest pleas in the case. All six later were cleared by DNA testing on evidence from the 1985 murder scene.\nThis summer, the federal jury awarded Joseph White, Ada JoAnn Taylor, Thomas Winslow, Kathy Gonzalez, James Dean and Deborah Shelden $28.1 million in damages, giving each $1,000 per day they had served in prison.\nTogether, the six spent 75 years locked up before White got DNA testing that tied Bruce Allen Smith to the crime in 2008.\nBy then, Smith had died in an Oklahoma prison. Shelden, Dean and Gonzalez had completed their sentences in the Wilson case, but White, Winslow and Taylor still were behind bars.\nThe six sued Gage County, the sheriff and deputies calling the cold-case investigation so reckless it violated their civil rights.\nDuring the federal trial, attorneys for the six said Searcey relied on statements that contradicted crime scene evidence to get a judge to sign off on arrests, then used the threat of the death penalty to pressure them into giving statements implicating others; and, after talking with Price, two of the six came to believe they had suppressed memories, which could come back in dreams.\nAfter the verdict, Melanie Whittamore-Mantzios, an attorney for Gage County, filed motions arguing that Kopf should disregard it and find in the county’s favor or grant a new trial, citing alleged misconduct by an attorney for the six and by the judge.\nShe also argued the damages were excessive and that the county at minimum was entitled to a $1,095,000 reduction of the verdict because it included time Winslow served in prison on an unrelated assault.\nKopf denied the motion Tuesday, saying there was no basis to reduce the award. He said the jury could have believed, as Winslow testified, that his life “became an absolute living hell” after publicity in the case that involved the rape of an elderly woman.\n“My only semi-surprise is that Winslow was not awarded more money by the jury,” the judge wrote.\nAs for the alleged misconduct, Kopf said the defense never raised objections to comments he made off-the-record out of the presence of the jury or to Maren Chaloupka putting the word “Innocent” on a screen during closing arguments or asking supporters to stand.\nKopf said attorneys for Gage County could have made a motion for mistrial or asked that an instruction be given to the jury. They did not, he said.\nHe said the defendants may not like prior rulings by the Eighth Circuit Court of Appeals, which reversed previous rulings made by him and ultimately sent the case to a jury trial.\n“But the Court of Appeals has made it abundantly clear that the evidence was plainly sufficient to go to the jury against all defendants on all claims. After hearing the evidence in the second trial, that is also my conclusion,” Kopf said.\nIn a separate order, Kopf granted attorney fees and expenses of $1,721,520, shaving $151,346 off the request.\nThe county is likely to appeal, although Whittamore-Mantzios didn’t return a request for comment.\nGage County Chairman Myron Dorn said the Board of Supervisors planned to meet with its team of private-practice attorneys on Sept. 28, but said he believed the board will move that meeting up to next week.\nCounty Attorney Roger Harris was not available for comment Tuesday.", "url": "https://apnews.com/67dfa66102ff4c2fba6ee10bae41a02b"}