{"authors": ["Joe Starkey Joe Starkey"], "date_download": "2020-05-04 20:18:19", "date_modify": "2020-05-04 20:18:19", "date_publish": "2016-06-19 19:18:57", "description": "A quote from Jim Rutherford leapt off the page after the Penguins won the Stanley Cup. \"I want to thank Ray Shero for his contribution, and I thank Craig Patrick,\" Rutherford told Yahoo...", "filename": "_19b44f0c0c9b4c0580aae3f8e4e0106a_1588623499.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_19b44f0c0c9b4c0580aae3f8e4e0106a_1588623499.html", "title": "Starkey: Penguins blessed with line of standout general managers", "title_page": "Starkey: Penguins blessed with line of standout general managers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A quote from Jim Rutherford leapt off the page after the Penguins won the Stanley Cup.\n“I want to thank Ray Shero for his contribution, and I thank Craig Patrick,” Rutherford told Yahoo Sports. “Their fingerprints are on here.”\nClassy move. Brought me back to June 12, 2009, the night the Penguins won the Cup in Detroit. One of the first things Shero said was “Craig Patrick deserves some credit for this.”\nShero followed the latest Penguins’ run, and even though he now works for the rival New Jersey Devils, he felt pangs of pride. Many of his former players and co-workers — people he hired, including associate GM Jason Botterill — were part of it.\nShortly after the Penguins raised the Cup, Shero sent Rutherford a congratulatory text. Despite being inundated with such notes, Rutherford promptly sent a reply.\n“Even when I got fired, Bottsie, Fitzy (Tom Fitzgerald), all those guys, knew how I felt about Jimmy from our dealings with him,” Shero said Friday. “I was really happy for him. He’s one of the nicest people I’ve met in the game.”\nThat being said, Shero admits if he hadn’t won a Cup here, he wouldn’t know how to feel.\n“We would be having a different conversation,” he said. “That would have been really, really tough, to see them do what we couldn’t do. I’m happy for a lot of people there — players, coaches, training staff, front office. A lot of people took a lot of (stuff).”\nHow lucky are Penguins fans? Not only have they been blessed with a string of legendary players, going back to Mario Lemieux in 1984, but also a savvy line of general managers. Patrick was enshrined into the Hockey Hall of Fame 15 years ago. Rutherford is well on his way as the only GM of the modern era to win a Cup with two franchises. Shero’s record in nine years includes a Cup, two appearances in the Final and a record of 411-230-64.\nSo even if most would agree Patrick and Shero had run their courses here and were flaming out by the end, their best work helped the next guy build a champion. That theme runs all the way back to Tony Esposito, who barely lasted a year but secured two players without whom Patrick and Lemieux might never have raised a banner: Mark Recchi, a fourth-round pick in 1988; and goalie Tom Barrasso, acquired via trade.\nBefore Esposito, there was Ed Johnston, who went to great lengths to put the Penguins in position to draft Lemieux and traded for Paul Coffey.\nEach of the Penguins’ Cup-winning GMs — Patrick, Shero, Rutherford — was indisputably the right man for the moment. All made perfectly timed trades in their title years. But does Shero win it all without key players Patrick provided, including an obscure eighth-round pick from 2002 named Max Talbot?\nDoes Rutherford win it all without all the young players — Matt Murray, Bryan Rust, Conor Sheary, Brian Dumoulin, etc. — secured during the Shero regime? Not to mention players such as Kris Letang (third-round pick from the Patrick era) and Chris Kunitz? Nobody’s complaining about that Kunitz contract extension anymore, are they?\n“I kept reading about Kunitz this year. He’s done. He stinks,” Shero said. “Really? Really? Because now he’s won three Stanley Cups. I don’t know why he didn’t shoot at a wide-open net in Game 6, but he has won three Stanley Cups.”\nSo many links connect the Penguins’ three championship GMs through their better moves. And their worst — like the way Rutherford turned water (Rob Scuderi) into wine (Trevor Daley). Shero parlayed two excellent Patrick picks — Ryan Whitney, Alex Goligoski — into Kunitz, Matt Niskanen and James Neal. Rutherford took Neal and turned him into Patric Hornqvist.\nThe line through Shero and Rutherford is particularly interesting. Consider the Jordan Staal trade. Shero agreed to send Staal to Carolina in exchange for Brandon Sutter and the No. 8 pick (which would become Derrick Pouliot). That was clear. The third piece was not. Rutherford offered his second-round pick. Shero demanded Dumoulin, a defenseman.\nRutherford reluctantly agreed.\n“I remember Jimmy saying, ‘Ron Francis loves this kid,’ ” Shero said. “We had seen Dumoulin for three years at Boston College and thought he could play — but to see him on the top pairing with Kris Letang winning a Cup? Whoa, that’s pretty good.”\nWe could go on here. Sutter became Nick BoninoBoninoBoninoooo! And don’t you wonder what would have happened if Shero hadn’t plucked John Hynes away from Wilkes-Barre to become New Jersey’s coach? Mike Sullivan likely wouldn’t be here.\n“It’s crazy,” Shero said. “The hands of fate, right?”\nJoe Starkey co-hosts a show 2 to 6 p.m. weekdays on 93.7 FM. Reach him at jraystarkey@gmail.com.", "url": "https://apnews.com/19b44f0c0c9b4c0580aae3f8e4e0106a"}