{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:26:32", "date_modify": "2020-05-04 20:26:32", "date_publish": "2016-10-28 21:06:00", "description": "DEAR DOCTOR K: I have frequent back pain. I usually take acetaminophen (the Tylenol brand), but I hear it may not be effective for back pain. Is there anything to that? DEAR READER: If you'd...", "filename": "_ea4d49e4964c4a4591acd7b222d98566_1588623992.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ea4d49e4964c4a4591acd7b222d98566_1588623992.html", "title": "Mild exercise,alternative therapies can relieve back pain", "title_page": "Mild exercise,alternative therapies can relieve back pain", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DEAR DOCTOR K: I have frequent back pain. I usually take acetaminophen (the Tylenol brand), but I hear it may not be effective for back pain. Is there anything to that?\nDEAR READER: If you’d asked me that question even a year ago, I would have said, “Acetaminophen works fine for most people.” Lots of people are bothered by back pain. When it strikes, all you want is relief -- and fast. Many folks turn to over-the-counter pain relievers like acetaminophen and non-steroidal anti-inflammatory drugs, or NSAIDs (ibuprofen, naproxen and aspirin).\nMost doctors I know would have shared my impression that acetaminophen works for back pain. I respect the opinions of seasoned doctors, but I also know that there is no substitute for actually studying a question. Indeed, a recent study has challenged my long-standing assumption about the value of acetaminophen for back pain.\nResearchers wanted to know if acetaminophen shortened the time from the start of acute back pain (back pain that comes on suddenly) to complete relief. What they found was surprising.\nFor people who used acetaminophen only when their back pain bothered them, it took about 17 days to get complete relief. For those who took the medication three times a day, it also took about 17 days for full relief. And for those who took a placebo -- a sugar pill with no medicine at all -- the time to recovery was 16 days. In other words, the medication made no difference in how fast back pain went away and stayed away. In addition, all three groups had similar experiences in terms of the severity of their pain, disability and function.\nDoes this mean that you shouldn’t bother to use acetaminophen for back pain? Not necessarily. Randomized studies like this can tell you the reaction of the average person in the study. But people are all different. It may be that some people really do get good relief from acetaminophen, even if the average person doesn’t. So if it works for you, stick with it.\nBut acetaminophen does have its own risks and side effects. Taking too much acetaminophen can seriously damage the liver. Ideally, the average healthy adult shouldn’t take more than 3,000 milligrams a day.\nThe safest option is to try to get through the worst of your back pain without medication:\n-- Use cold compresses or an ice pack, not heat, immediately after an injury. About 48 hours after back pain hits, heat may be more helpful. The warmth soothes and relaxes aching muscles.\n-- Try to keep moving. A limited amount of activity is better than lying in bed. Ask your doctor about appropriate exercises to start sooner rather than later. Exercise therapy can help heal acute back pain and help prevent a repeat episode.\n-- Chiropractic manipulation, acupuncture, massage or yoga provides relief for some people with acute back pain. Several studies support using these alternative/complementary therapies.\nMany people can relieve their back pain with these simple measures. If they don’t provide complete relief, then non-prescription NSAID medicines often will do the trick.\n(This column ran originally in October 2014.)", "url": "https://apnews.com/ea4d49e4964c4a4591acd7b222d98566"}