{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:08:00", "date_modify": "2020-05-04 20:08:00", "date_publish": "2016-11-09 19:47:13", "description": "To the editor: The \"wonderful news\" that our county judge and Commissioners Court perpetrated on us at court Tuesday morning, Nov. 8, about saving $9 million in bond interest due to getting...", "filename": "_28044b86305f4d4caa3eacf1835024ac_1588622880.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_28044b86305f4d4caa3eacf1835024ac_1588622880.html", "title": "Thank developers, population boom for paying county debt", "title_page": "Thank developers, population boom for paying county debt", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "To the editor:\nThe “wonderful news” that our county judge and Commissioners Court perpetrated on us at court Tuesday morning, Nov. 8, about saving $9 million in bond interest due to getting a AAA Moody’s rating issued straight out of the Agitation and Propaganda Department of our county government.\nFirst, they’re claiming they’ve only saved $9 million over 25 years! It’s a lot of money, but it’s nothing in comparison to the massive spending increases they’re throwing onto the backs of our citizens.\nSecond, the reason Moody’s upgraded Montgomery County’s debt rating is because of two factors, the first of which is large population growth. Therefore, we shouldn’t thank Commissioners Court at all. Rather, we should thank George Mitchell, developer of The Woodlands, Bruce Belin, developer of several Lake Conroe communities, and the citizens of Montgomery County who have chosen, for one reason or another, to increase our population.\nThird, the second factor of the Moody’s upgrade was because they patted us on the back for the fact that the county leaders have successfully increased taxes far faster than the population growth and consummately have spent far more in the government than the rate of population growth. The county leaders have gotten away with that ruse, because the citizens have slept gently as our political leaders have lullabied us by claiming they were “fiscal conservatives” when in fact they’re wild-eyed spenders of every penny of ours they can grasp.\nEric Yollick\nThe Woodlands\nAre celebrity activists Leaving now?\nTo editor:\nTo all those so-called celebrities and liberal elites who said they would move out of the USA if Trump was elected, Godspeed. Of course they’re not going to leave the greatest country in the world. They live in a world of their own, make millions of dollars, fly around the world in private jets and tell us how to live.\nLast night, the normal, everyday Americans, who work hard for a living, some from paycheck to paycheck, spoke. Now it’s up to Mr. Trump to follow through on his promises. I pray he succeeds. God Bless America\nRobert Haddox\nMontgomery\nhelp them pack\nTo the editor:\nWith the general election finally over, and the dust has settled, so to speak, I, being a retired person in excellent health, would like to offer my services to some of the many people, namely Whoopi Goldberg, Eddie Griffin, Jon Stewart, Al Sharpton, Samuel L. Jackson, Raven Symone, George Lopez and Cher, to name a few, to assist them in packing up their belongings, so they can leave the United States of America in a timely manner, as they would leave if Trump was victorious.\nSusanne Freitas\nMontgomery", "url": "https://apnews.com/28044b86305f4d4caa3eacf1835024ac"}