{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:19:30", "date_modify": "2020-05-04 20:19:30", "date_publish": "2016-11-15 06:00:00", "description": "SIOUX CITY | Phyllis Marie Williams, 77, of Sioux City, passed away Sunday, Nov. 13, 2016, at a Sioux City hospital, surrounded by her loved ones. Services will be 10:30 a.m. Thursday at...", "filename": "_fc3245f6264a4d349c08aa3df83382f5_1588623570.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fc3245f6264a4d349c08aa3df83382f5_1588623570.html", "title": "Phyllis Williams", "title_page": "Phyllis Williams", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SIOUX CITY | Phyllis Marie Williams, 77, of Sioux City, passed away Sunday, Nov. 13, 2016, at a Sioux City hospital, surrounded by her loved ones.\nServices will be 10:30 a.m. Thursday at Waterbury Funeral Service of Sioux City. Burial will be in Graceland Park Cemetery. Visitation will be 4 to 8 p.m. Wednesday, with family present 6 to 8 p.m. and a prayer service at 7 p.m., at the funeral home.\nPhyllis was born on Oct. 22, 1939, in Iowa City, Iowa, the daughter of Marvin J. and Eunice (Sisson) Price. Phyllis grew up in southwestern Iowa.\nShe married Rolland A. Spencer in 1952. They later divorced. Phyllis married Don Williams of Sioux City in 1961. He passed away in 2001. Phyllis worked as a waitress at various businesses, including the Crystal Truck Stop, Diamond Horseshoe, Younker’s Cafe, and Bonanza.\nShe enjoyed playing bingo, fishing, adult coloring books, spending time with her family, and having coffee with her Prime Living friends.\nSurvivors include children, Randy (Kevin) Spencer of Maurice, Iowa, Cheri (Paul) Boeckman of Wall Lake, Iowa, and Chris (Wayne) Hardin of Morrill, Neb.; brother, Kermit (Betty) Price of California; stepbrother, Fred (Mary Ellen) Burns of Cromwell, Iowa; grandchildren, Kellie, Jane, Lisa, Jean, Wayne, Michelle and Wayne Jr.; 19 great-grandchildren; one great-great-grandchild; and special friends, Susan Sack and Darrell Merkley.\nPhyllis was preceded in death by her parents; two husbands; and twin great-grandsons, Keaton and Keegan.\n.obitLogo {margin: 0 auto; width: 300px;}", "url": "https://apnews.com/fc3245f6264a4d349c08aa3df83382f5"}