{"authors": ["Steven Parfitt", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:38", "date_modify": "2020-05-04 19:56:38", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_09__1588622198.html", "image_url": "https://images.jacobinmag.com/2016/10/17230844/momentuuuuum1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09__1588622198.html", "title": "Labour’s Witch Hunt", "title_page": "Labour’s Witch Hunt", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nA specter is haunting the British Labour Party — the specter of Trotskyism. All the powers of the old party leadership have entered into a holy alliance to exorcise this specter: deputy leaders and general secretaries, Blairites and Brownites, the soft left and the hard right. This echo of the Communist Manifesto would have been a fitting opening to deputy Labour Party leader Tom Watson’s own manifesto about leftist infiltration of the party. Right now, as the party goes through its second leadership campaign in a year, Watson and other opponents claim that Jeremy Corbyn’s base swarms with Trotskyists who have entered the Labour Party to bore from within. Their paranoia has been fed by an unprecedented rise in party membership. At the time of the last general election in May 2015 it stood at around two hundred thousand. That number has now jumped to more than half a million, including more than 125,000 in the two weeks following the European Union referendum. The British Labour Party is now the largest left-of-center party in Europe. Watson only recently presented Corbyn with a dossier meant to prove his claims of Trotskyist infiltration. Corbyn’s campaign team responded that Watson should stop peddling conspiracy theories. But British newspapers have taken up Watson’s line and run with it. Is there anything to the story?\nBetter Dead Than Red Trotskyism’s use as a political swear-word in Britain peaked in the 1980s, with Leon Trotsky long since buried and the Labour Party very much out of power. In the first few years of that decade the Left and Right of the party fought for control, and the Right won. Senior Labour members of parliament (MPs), including party leaders Michael Foot (1980–83) and Neil Kinnock (1984–1992), came to think that the main obstacle to their recovery of a parliamentary majority were the left-wing “entryists,” Trotskyists who joined the Labour Party en masse since the 1960s. The most famous of those groups was the Militant Tendency. Militant achieved a majority among the membership of the Liverpool District Labour Party in 1982, and in 1983 they won a majority on the Liverpool City Council. The council then went into open battle with the central government. They opposed rent rises for council houses, and borrowed money in defiance of Thatcher’s policy to cap rates increases in order to build new housing and clear some of the worst slums that disfigured the city. This program won them a good deal of local support. It did not, however, endear them to Neil Kinnock and the Labour leadership. In September 1985 the Militant-controlled council decided to get around the rate-capping policies of the Thatcher government by handing out redundancy notices to council employees. They intended these redundancies as a temporary measure that would be reversed once they secured a loan from overseas, which they eventually did. But Neil Kinnock did not let the opportunity go to waste. At the next Labour conference in October he attacked the left wing of the party, and associated it with the “grotesque chaos of a Labour council hiring taxis to scuttle round a city handing out redundancy notices to its own workers.” A purge followed. The leadership proscribed Militant as an illegal party within a party. They hauled members or suspected members of Militant before the National Executive Committee to face possible expulsion. Hundreds, maybe thousands of Labour Party members were ostracized in this way. Some entire local Labour Party branches, including the Liverpool District Labour Party, were dissolved and replaced with “loyal” ones. Many non-Trotskyist figures on the Left tried in vain to stop the purges, including then-junior MP Jeremy Corbyn. Kinnock’s stand against the Trotskyist scourge won him plaudits from the right-wing press. Yet the tabloids that celebrated his purge in 1985 did not extend the same courtesy to him during the 1987 and 1992 general elections, both of which he lost. Having managed to enfeeble his own left wing, Kinnock never propelled the right and the center into power.\nThe Return of the Left The Trotskyist scare faded away after the 1980s. Neil Kinnock finally resigned in 1992, and after his successor, John Smith, died in 1994, the way was clear for Tony Blair and Gordon Brown to finish the job that their predecessors had started and push the Left to the fringes of British politics. After Blair and Brown came Ed Miliband in 2010. “Red Ed,” as the right-wing newspapers called him, was not much of a revolutionary. But he did make one change that would pave the way for Jeremy Corbyn. Miliband abandoned the existing system for choosing the party leader, which since the 1980s had accorded nearly equal voting rights to the MPs, the trade unions, and the party members, and replaced it with an open primary. The right and center of the party thought that this change would further reduce the influence of the trade unions and guarantee that future Labour leaders would be elected from their faction. They forgot about the Law of Unintended Consequences. Miliband lost the 2015 election, and resigned as Labour leader. A leadership contest ensued. Jeremy Corbyn, a relatively unknown MP from the isolated left of the party, faced three contenders from its right and center. As Corbyn emerged from obscurity, and from more than hundred-to-one odds to win, the fixers and backroom dealers that had once run Labour under Tony Blair reemerged to condemn him as an extremist, and his supporters as entryists who would push it away from what the grandees grandly called “Labour values.” Tony Blair advised Labour supporters who sympathized with Corbyn’s message to “get a heart transplant.” Peter Mandelson, adviser and PR man to Blair and Kinnock, publicly called for Corbyn’s three opponents in the race to drop out so that they could frame the election as illegitimate. Those contenders briefed against each other to the press in the hope that the other two would drop out and leave one to battle Corbyn alone. The anti-Corbynistas called this mythical “unity” candidate ABC — Anyone But Corbyn. But none of the three could agree on who that Anyone should be. Corbyn won 60 percent of the vote and became party leader. The ground was laid for Labour’s current civil war. Corbyn’s supporters created a new organization, Momentum, to capitalize on his unexpected success and consolidate the Left’s position within the party. The Right, meanwhile, decided to go underground. With characteristic modesty they compared their coming struggle against Corbyn with the French resistance during the World War II. Some of their faction would oppose Corbyn from the outside, which anonymous briefers to the right-wing Daily Telegraph called the “Free French” strategy. Others, following a “Maquis” strategy, would accept jobs in Corbyn’s ministerial team and wait for the right time to strike. Through this combination of pressure from within and without, the majority of Labour MPs hoped to undo the leadership election and take back “their party” from its members.\nSeeing Red Since his election, Corbyn’s opponents in Parliament and the press predicted that each test of Labour’s electoral strength would lead to his fall. In the December 2015 Oldham by-election and the May 2016 local elections, virtually every major media outlet predicted electoral disaster for Labour. When those did not come to pass, you could hear the sound of a hundred journalists all jamming the backspace button, deleting pre-prepared stories of Corbyn on his way out. The vote to leave the European Union finally gave the Labour right their chance to strike. Corbyn campaigned for Remain, but there were rumblings that he was a reluctant and unenthusiastic advocate for the cause, even a closet Leaver. All hell broke loose the day after the Leave victory. Even as Prime Minister David Cameron resigned, and Conservatives looked like they might turn on each other, Labour MPs moved against Corbyn. They initiated a vote of no confidence in their leader. Nearly fifty parliamentarians abandoned their shadow cabinet posts over the next few days. Many of them posted long, self-justifying letters of resignation on social media. When the no-confidence motion came to a vote, 172 Labour MPs favored it. Forty remained loyal to their leader. It seemed as if Jeremy Corbyn’s stint as party leader had come to an end. Almost the whole spectrum of newspaper opinion, from Guardian liberals to the reactionaries of the Daily Mail and the Sun, had already decided that he should go — now they thought the moment had finally come. But Corbyn and his supporters hung on, and insisted that only the party members who had voted for them could vote them out. A new leadership campaign, only ten months after the last one, began in July. Corbyn’s original challenger, Angela Eagle, pulled out after the party establishment flagged up her support for the Iraq War as a major problem. A little-known Welsh MP, Owen Smith, stepped forward to act as the “ABC” candidate. After Watson failed to broker a deal with the unions to have Corbyn step down, he openly defected to the opposition. The party’s National Executive Committee prevented more than one hundred thousand new party members from voting in the leadership election, and went to court to defend that decision. The Labour civil war entered a new phase. As it did, the ghostly figure of a goateed, bespectacled revolutionary reappeared on the front lines. Everything was ready for Tom Watson’s anti-Trotskyist manifesto.\nThe Dossier On August 10, 2016, the Labour Party deputy leader wrote a public letter to his leader about what he called “the increase in members of proscribed organisations attempting to join the party.” He asked Corbyn to confirm whether he still agreed that members of proscribed groups, such as Militant (now known as the Socialist Party), should remain ineligible for membership in the Labour Party. Watson ended his letter with a document, supposedly distributed widely among far-left members who had infiltrated Momentum. It detailed plans to take over local branches of the Labour Party by making branch meetings so boring and confrontational that the other members would stop attending and leave the left-wing rump to pass unanimous resolutions unchallenged. This document came from a book on Militant, written in the 1980s by the journalist Michael Crick and republished in 2016 — with an endorsement on the cover from Tom Watson. The dossier went one better. Making use of publicly available statements and websites, Watson alleged that three Trotskyist groups — Workers’ Power, Labour Party Marxists, and the Alliance for Workers’ Liberty — were trying to infiltrate local Momentum groups and use them to take over party branches. Once achieved, they would demand the mandatory reselection of MPs, or in other words to have local party branches select the Labour candidate for their seat before every election, rather than select that candidate only when the sitting MP resigned or was defeated at the polls. Reselection has always been a demand of the Left to make MPs more accountable to the members — and a threat to MPs from the right and center of the party, who fear that such a measure will leave them at the mercy of local left-wing activists. There is no surer way to raise the blood pressure of Labour parliamentarians to the point of coronary failure. Next, Watson noted that Socialist Party members participated in some pro-Corbyn rallies and worked with Momentum to organize others, while some local Labour branches held unofficial meetings to which other left parties would be invited to attend. The rot also extended to trade unions affiliated with the Labour Party. Union members who belonged to the Socialist Party and Labour Party Marxists took the lead in calling for their unions to demand the mandatory reselection of MPs, and planned for left-wing trade unionists to take over their local party branches. Members of Socialist Resistance and the Alliance for Workers’ Liberty helped to run the phone banks for Corbyn’s first leadership campaign. Finally, the Socialist Workers Party organized training courses to help their members to “work alongside Labour Party members and supporters.”", "url": "https://www.jacobinmag.com/2016/09/labour-party-trotskyist-entryist-militant-tendency-kinnock-corbyn/"}