{"authors": ["Our View", "Faith", "Politics", "The Meaning Of Life"], "date_download": "2020-05-04 20:28:12", "date_modify": "2020-05-04 20:28:12", "date_publish": "2016-11-01 03:29:00", "description": "Religious people — and that includes the faithful and the clergy — have been a vital part of the political life of the United States since its founding. Their views have fueled the big...", "filename": "_91764872cd644c609037927d04cebe45_1588624092.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_91764872cd644c609037927d04cebe45_1588624092.html", "title": "Our view: Faith, politics and the meaning of life", "title_page": "Our view: Faith, politics and the meaning of life", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Religious people — and that includes the faithful and the clergy — have been a vital part of the political life of the United States since its founding.\nTheir views have fueled the big debates of the time — as advocates to end slavery, pacifists opposed to wars, foot soldiers in the fight for civil rights and advocates calling for the protection of voting rights. Religious people also have spoken out loudly against gay marriage (or for), battled over abortion rights and pushed for laws to restrict birth control. People of faith hardly speak with one voice. They are as divided as any other citizens.\nIt is no wonder that in the 2016 election, the issue of how religious institutions can participate (or not) in electoral politics is back. The Rev. Larry Brito of St. Anne Parish brought the question home to Santa Fe earlier this month when he sent a letter to parishioners emphasizing the need to vote for “pro-life” candidates. He was careful not to endorse a particular candidate. After all, churches are nonprofits and can’t take sides in elections. They can lose their protected Internal Revenue Service tax status should they step too far into partisan politics. However, it is clear from Brito’s letter that he is urging parishioners to vote against Democratic nominee Hillary Clinton — and that is a step too far.\nIn his letter, Brito denounced the group, Planned Parenthood, saying, “We have one candidate who has been endorsed by this evil organization and has proudly embraced their endorsement.” That, of course, would be Clinton. He went on to say, “We have to insist that any of our representatives (whether Democrat, Republican or Third Party) will be advocates for the unborn child and thus Pro-Life. I challenge you to take a look at the voting records of your national and local legislators on the issue of Life. Where do they stand?”\nWhile the Catholic Church is unequivocal in its opposition to abortion, the actual teaching of the Church in regard to voting — as is often the case with Catholics — is more complex than what is laid out in Brito’s letter. Archbishop John C. Wester, without directly naming Brito, issued this statement to provide broader guidance to Catholic voters after The New Mexican reported on the priest’s letter to parishioners.\n“It is understandable that emotions are running high,” Wester said. “This is certainly true for those of us who care deeply about the sanctity of human life, particularly vulnerable human life in the womb. Yet these emotions do not give us license to espouse positions that do not embrace the full moral teaching of our Catholic tradition. Nor do they allow leaders in the Church to endorse or denounce a candidate because of his or her position on a given issue.”\nCatholics are asked to consider all issues and attempt to cast votes in keeping with the full teachings of the church — Wester suggests they read U.S. bishops’ document, Forming Consciences for Faithful Teaching, as a guide. It states clearly that the “church’s leaders are to avoid endorsing or opposing candidates or telling people how to vote.” Endorsements can be overt, or they can be more subtle, as Brito’s was.\nThe whole discussion of what it means to be “pro-life” should not be limited simply to abortion. An anti-abortion candidate who also advocates elimination of food benefits, deportation of all immigrants, wants to cut health subsidies or supports the death penalty is not truly pro-life. But a pro-abortion choice candidate — keep it legal but rare, for example — who also works to alleviate poverty, assists immigrant families, helps single mothers so they raise their babies and seeks to end the death penalty, actually is working to improve life for all.\nWhatever their politics, churches, synagogues or mosques that want to keep their tax-free status should stop urging members to choose one candidate over another. Teach the faith and let individuals follow their consciences. We do not live in a theocracy, after all. Jesus himself, after all, cautioned his flock, “Render to Caesar the things that are Caesar’s, and to God the things that are God’s.” He had the right idea.", "url": "https://apnews.com/91764872cd644c609037927d04cebe45"}