{"authors": ["Jason Schulman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:55:37", "date_modify": "2020-05-04 19:55:37", "date_publish": "2016-11-17 00:00:00", "description": null, "filename": "2016_12_where-is-our-labor-party_1588622137.html", "image_url": "https://images.jacobinmag.com/2016/11/17231927/schulman-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_12_where-is-our-labor-party_1588622137.html", "title": "Where Is Our Labor Party?", "title_page": "Where Is Our Labor Party?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "As Bernie Sanders thundered and gesticulated this election season, many paid attention. Few had been exposed to such an unflinching social-democratic program, or heard an analysis of society that blamed inequality and exploitation on the “billionaire class.”\nBut if Sanders inspired allegiance unlike any other left-wing candidate in decades, his decision to run within the Democratic Party invited caution from many on the socialist left. The Democrats, after all, are dominated by representatives of the capitalist class, imposing grave limitations on any left-wing candidacy under its umbrella.\nWhy was the Sanders wave such a novelty in American politics? And why was the senator forced into such a predicament — choosing between his cherished status as a political independent and any chance of national relevance in a two-party system? The answer lies in a missing labor party. The US is alone among advanced capitalist countries in lacking one. But another question then arises: why is the US such an exceptional outlier?\nWerner Sombart’s classic Why Is There No Socialism in the United States? provides a good place to start the search. Writing in 1906, Sombart sought to explain why the Socialist Party of America (SP) was so marginal compared to its continental European counterparts and, secondarily, why the American Federation of Labor (AFL), the strongest union federation at the time, had no interest in socialist politics — or even in building a labor-based party.\nIf “modern Socialism follows as a necessary reaction to capitalism,” Sombart reasoned, “the country with the most advanced capitalist development, namely the United States, would at the same time be the one providing the classic case of Socialism, and its working class would be supporters of the most radical of Socialist movements.”\nYet clearly this hadn’t happened. Sombart offered two explanations as to why. First, the two major political parties cribbed the platform planks of oppositional parties when they grew sufficiently large and threatening. This was particularly common for the Democratic Party, which effectively absorbed the People’s (Populist) Party in 1896, and lifted parts of the Socialist platform in the 1930s.\nSombart’s primary explanation, however, was prosperity — US workers were simply too well off (and too able to scale the social ladder) to support the founding of a labor or mass socialist party. Workers, bathed in affluence, developed a conservatism and even a “love” for capitalism; “all socialist Utopias,” Sombart famously concluded, “came to nothing on reefs of roast beef and apple pie.”\nNot everyone bought Sombart’s thesis. Over the next century, thinkers offered competing explanations of America’s political “exceptionalism.” Some blamed anti-black and anti-Chinese racism for reducing the viability of a labor party in the 1890s. Others (including Karl Kautsky and Vladimir Lenin) focused on the early presence of universal manhood suffrage for whites, arguing that it removed the kind of class-based political grievances that fueled the formation of labor parties elsewhere.\nThe institutional features of the American political system (federalism, presidentialism, and single-member, winner-take-all electoral districts) was another target. Morris Hillquit, a Socialist Party founder, placed himself in this camp, asserting that the structure of American politics made most trade union leaders see a labor party as an electoral pipe dream.\nInstitutional analyses were matched by an equally passionate emphasis on political ideology. Historian Louis Hartz declared that the prevalence of egalitarianism in the US minimized or eliminated the status-based grievances that would have made a labor party possible. Hartz considered the dominant liberal ethos of the country so “socialist” that “Americanism” effectively became a “substitute socialism,” ensuring a labor party would never get off the ground. The late US socialist leader Michael Harrington shared this view and considered the Democratic Party a “labor party in disguise.”\nBut when it comes to the labor party question, is America really so exceptional?\nAgainst Exceptionalism\nCount Robin Archer among the skeptics. For Archer —author of the 2010 book Why Is There No Labor Party in the United States? — the conventional wisdom mistakenly relies on comparisons with Europe. Archer instead urges us to look at the US’s most similar New World counterpart: Australia.\nIn the 1890s, Australia and the US were both suffering through the worst depression of the nineteenth century. Their unions were utterly defeated in a series of major industrial confrontations. Yet contrary to their US comrades, Australian unionists responded by establishing one of the earliest and most electorally successful labor parties in the world.\nThe nationwide Australian Labor Party (ALP) took office for the first time in 1904 and returned in 1908. These were short-lived minority governments, but in 1910 it formed a majority government supported by half the electorate. No social-democratic government approached this level of support until the New Zealand Labour Party and the Swedish Social Democrats took office in 1938 and 1940, respectively.\nBack in the US, operating in similar conditions, the AFL ignored labor party campaigners and retained its commitment to the Democratic Party and “pure-and-simple” unionism (which held that organized labor should concern itself with the workplace more than the state). The decision to reject the party-building option soon hardened into settled doctrine, dooming attempts to get an independent working-class politics off the ground.\nArcher uses the Australia comparison to shoot down an array of claims about US exceptionalism. For example, while it’s true that American workers enjoyed high living standards compared to their European counterparts in the 1890s, the conditions of Australian workers were higher still.\nIn addition, Australian unionists had the same “basic racial antipathies as their American counterparts,” and yet “this was quite compatible with the establishment of new industry-wide unions and a labor party.” However deplorable, this racial animus bound white workers together against immigrant “colored labor,” and for years the ALP officially supported, “the cultivation of an Australian sentiment based on the maintenance of racial purity.” Championing White Australia enabled Labor to pose as the Australian nationalist party and win support among middle-class racists.\nArcher also downplays racism as a particularly important wedge between American workers in the late nineteenth century. The US labor movement, he argues, had not yet fully embraced racial hostility toward southern and eastern European immigrants, and the great migration of black workers to northern factories had not yet occurred.\nKautsky and Lenin’s explanation — that because basic political rights already existed in the United States, American workers didn’t develop European levels of class consciousness and organization — comes in for criticism as well. While Australian men enjoyed equal rights, this did not impair efforts to create the Labor Party. Quite the contrary: in both cases, Archer contends, the prior achievement of suffrage “legitimized efforts to engage in political mobilization, and provided a ready-made electoral arena in which to undertake this task.”\nSimilarly, labor leaders and the pro-labor press in Australia regarded the dominance of liberal values “as an opportunity rather than as a constraint. They saw themselves as defenders of these values, which, they argued, were being threatened by contemporary social developments.”\nWhat about the electoral rules of the game in the US? Did the election system and federalism derail attempts to launch a labor party? In the late nineteenth century, both countries used a first-past-the-post system based primarily on single-member districts. Yet in Australia (thanks to the geographic concentration of working-class voters in many areas), labor parties often overcame such thresholds and elected members to parliament.\nFederalism also fails as an explanation. Archer argues that while it made nationwide change more difficult to achieve in the early twentieth century, the decentralization of the state also made it easier for the Australian labor movement to establish a political foothold.\nSo why then, despite widespread interest, did US workers fail to form a labor party? At the top of Archer’s list: the degree of armed repression in America, which significantly outstripped anti-union violence in Australia. As Archer writes: “While troops in Australia faced outwards towards imaginary foreign threats, troops in the United States faced inwards towards imaginary domestic threats.”\nWhen repression did befall Australian workers, it acted as something of an impetus, convincing many unionists that they needed to form a party and contest parliamentary elections. In the US, anti-labor crackdowns had no such silver linings. They destroyed the base of semi-skilled and unskilled workers needed to establish a labor party, and made craft union leaders fearful of taking strong electoral steps.\nArcher’s second reason for the absence of a US labor party is ethno-religious cleavages, which created “a hurdle that Australian unions did not have to jump.” AFL leaders worried that establishing a labor party would force their members to choose “between union solidarity and loyalties rooted in conflicting religious commitments. They concluded that, in such a contest, God would prevail and the unions would be destroyed.” In other words, labor leaders believed that the tendency of Americans to vote based on their religious and ethnic identities would condemn both trade unions and their labor party to oblivion.\nLastly, Archer examines the problems of Marxist organizations themselves. Fights between Marxists and followers of Ferdinand Lassalle — rivals in the German socialist movement who disagreed about whether the state was a class-based entity that existed to maintain capitalist exploitation — raged in the United States, but found no equivalent in the Australian labor movement.\nIronically, it was avowed Marxists who took a “pure-and-simple” unionist perspective that saw establishing a labor party “as an overt or covert attempt to undermine the unions.” Personal recriminations, deep distrust of opponents, and dogmatic certainty characterized both sides, but Archer claims that it was the paradoxical strength of a sectarian version of Marxism — which opposed the independent working-class political action that Marx himself supported — that helped undermine the possibility of an American labor party.\nSquandered Opportunities\nArcher’s analysis goes a long way toward explaining why a nationwide labor party didn’t emerge around the turn of the century. But the reasons why a party still failed to emerge after the formation of the Congress of Industrial Organizations (CIO) in the 1930s remain somewhat murky.\nPart of the explanation, as the sociologist Barry Eidlin has shown, is that that unlike their counterparts elsewhere, Roosevelt and the Democrats responded to farmer and labor insurgency with cooption rather than coercion, using the Great Depression to “broaden their coalition with appeals to the ‘forgotten man’ and policy offerings that absorbed some working- and agrarian-class fractions.” Roosevelt’s support for the Wagner Act, in particular, strengthened ties between labor and the Democrats, as union officials like Amalgamated Clothing Workers (ACWA) president Sidney Hillman and Teamsters president Daniel Tobin became prominent Democratic Party advisers and officials.\nBut why did the CIO unions refuse to organize a labor party when, as Eidlin notes, there was such a “disconnect between Democratic Party rhetoric defending labor rights and the reality of Democratic governors using state troops to break strikes”?\nSome scholars, like historian Eric Davin, hold the CIO leadership responsible. In the early 1930s, local labor parties ran candidates in at least twenty-three areas and won control of the local government of Berlin, New Hampshire. Central labor councils in at least ten other places advocated building a national labor party, as did state labor federations in New Jersey, Rhode Island, Vermont, and Wisconsin. At the 1935 AFL convention, which led to the creation of the CIO, various unions submitted proposals for a labor party; a resolution endorsing the idea only narrowly failed.\nBut by 1936, John L. Lewis, president of the United Mine Workers of America (UMW) and the CIO, and Sidney Hillman, head of the ACWA, had founded Labor’s Nonpartisan League — a move designed to ensure the CIO would remain loyal to the ostensibly pro-labor Roosevelt.\nThe impact of Lewis and Hillman’s decision was soon evident. When rank-and-filers in the South Bend local of the fledgling United Auto Workers (UAW) defeated a resolution to back Roosevelt — proposing a farmer-labor party instead — the CIO leadership sprung into action. Lewis dispatched Adolf Germer, his personal representative, to convince the UAW delegates to backtrack on their plans. If they dug in their heels, he said, the CIO would rescind the UAW’s funding to organize the auto industry. The rebels relented.\nBy this point, historian Mark Naison writes, “ties between the labor movement and the national Democratic Party had become so powerful that labor leaders, whether radical or mainstream, could not challenge them without jeopardizing their careers.” Those who did so, like Communist Party trade unionists who supported Henry Wallace’s Progressive Party in 1948, soon found themselves booted from organized labor.\nIt was the complete failure of Wallace’s presidential campaign that led union leaders like Walter Reuther, once an advocate of building an independent labor party, to shelve the idea in favor of pushing for social-democratic welfare programs through the Democratic Party.\nAssuming that the Republicans would win the presidency in 1948 (and fearful of more anti-union legislation like the Taft-Hartley Act, which the Republican Congress had passed a year earlier) the UAW executive board had initially called for a new party after the election. Walter’s brother Victor even planned an educational conference featuring leaders of British and Canadian social democracy.\nBut when Harry Truman unexpectedly triumphed, Walter threw his lot in with the Democrats, despite the growing potential of American organized labor — which by 1950 was larger and more powerful than ever before — to go its own way.\nReuther now claimed that “in Europe … where you have rigid class groupings, there labor parties are a natural political expression because there you have a highly fixed and class society. But America is a society in which social groups are in flux … I believe that we have a society that is not rigid in character along class lines, and that is the great hope of America.” A former Socialist, a union leader once labeled “The Most Dangerous Man in Detroit,” was now echoing Werner Sombart.\nBy the mid-1960s — as Lyndon Johnson constructed his “Great Society” and waged a “War on Poverty” — it seemed like the Reutherite strategy of social-democratizing the US through the Democratic Party’s liberal wing was finally being realized. But this moment proved quite brief. The War on Poverty was, as Martin Luther King said, “shot down on the battlefields of Vietnam,” and the dominant wing of the Democratic Party would soon move from liberal Keynesianism to neoliberalism.\nThe last real attempt to found an independent labor party came in the 1990s. Led by the late Tony Mazzocchi, leader of the Oil, Chemical and Atomic Workers International Union (which has since merged with the United Steelworkers), the effort initially went by the name Labor Party Advocates (LPA). In 1996, the LPA declared itself the Labor Party (LP).\nTheir timing seemed opportune, given Bill Clinton’s support for the North American Free Trade Agreement (NAFTA), the election of more progressive leaders in the AFL-CIO, and the rebirth of a left wing in American unions after decades of institutionalized, conservative anticommunism.\nBut the expected revitalization of the labor movement “didn’t pan out,” former LP national organizer Mark Dudzic acknowledges, and the party floundered. Unable to “enter electoral politics from a position of strength,” the LP couldn’t garner much interest from the majority of US union officials. The transformation of LPA into the LP proved to be premature.\nOnce again, the efforts of US workers to build a party that represented their interests had come up short.\nWill There Ever Be an American Labor Party?\nOver the past few decades, organized labor’s size and influence has steadily declined. The dominant, business-backed wing of the Democratic Party does almost nothing that could be construed as pro-labor. And even though Bernie Sanders ran a staunchly pro-labor campaign on the Democratic ticket, the majority of national union leaders refused to support his primary bid, endorsing the “inevitable” winner Hillary Clinton instead. What Nelson Lichtenstein calls labor’s “institutional conservatism” runs rampant within most unions; they dare not risk losing a bet even when winning yields so little.\nStill, many rank-and-filers did support Sanders, and millions of other Americans endorsed his social-democratic message. So are the grounds for an independent labor party more fertile today?\nIt’s hard to say. Even if the current union leadership wanted to make a clean break with Democratic Party politics — and the recent primary indicates they clearly do not — organized labor is in a seriously weakened state. While the Australian experience proves that an electoral system with high barriers isn’t an automatic death sentence for labor parties, union-based formations elsewhere in the world were established when workers represented a “rising class.” It would be hard to characterize the US working class this way today, even if the illusion of the United States as a middle-class society is vanishing.\nThe establishment of a labor party may have to wait until a genuinely new mass union movement arises — and with it the radical political currents that once flourished in the United States. But Dudzic is right: whatever the difficulties, however delayed its birth, “a labor party remains the great unfinished business of the US working class.”", "url": "https://jacobinmag.com/2016/12/where-is-our-labor-party"}