{"authors": ["Madison Guernsey Mguernsey Journalnet.Com"], "date_download": "2020-05-04 20:07:22", "date_modify": "2020-05-04 20:07:22", "date_publish": "2016-11-17 04:43:00", "description": "POCATELLO — It’s been a tiring year for Idaho State football. The losses, injuries, long bus rides and exposed youth: Mike Kramer notes it all when he laments the unrealized potential of the...", "filename": "_6527fb6398704c5eadaafdee54faa937_1588622842.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6527fb6398704c5eadaafdee54faa937_1588622842.html", "title": "ISU football notebook: Kramer lays out reasons for failures as season finale looms", "title_page": "ISU football notebook: Kramer lays out reasons for failures as season finale looms", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "POCATELLO — It’s been a tiring year for Idaho State football.\nThe losses, injuries, long bus rides and exposed youth: Mike Kramer notes it all when he laments the unrealized potential of the 2016 Bengals.\nISU’s sixth-year head coach inherited a program with low Academic Progress Report numbers and was forced to put his recruiting focus on strong academic students while coping with restricted practice hours and scholarship penalties levied by the NCAA. The team has maintained high academic standards since, but the recruiting process hasn’t changed. It’s school over football, and overloaded fall schedules, Kramer says, detract from time in the weight room.\nKramer said players find jobs to support themselves in the summer, eliminating many opportunities for summer conditioning, which leads to injuries. The Bengals have suffered a multitude of injuries this season, causing a detriment to their depth, talent level and ability to compete.\n“The problem is that guys stay here in the summer. They’ve got to find jobs,” Kramer said Wednesday at his weekly press conference. “In Division I, you don’t do it. You go to school and you get paid to stay and you get cost of attendance and you stay and lift weights and you eat and you eat and you eat and you’re bigger and stronger and faster.”\nThe Bengals are 18-49 under Kramer with a high point of an 8-4 2014 campaign and a low of 1-10 in 2012. ISU has suffered through three nine-loss seasons with a fourth looming if the Bengals (2-8, 1-6 Big Sky Conference) can’t pick up a win Saturday in their season finale against Weber State (6-4, 5-2), which needs a win to stay alive in the FCS playoff hunt.\nKramer has been vocal all season about his displeasure with playing back-to-back Pac-12 teams in nonconference play and having to bus to various locations, sometimes over multiple days.\n“The issue very simply is, A, how we travel, B, who we schedule in the nonconference, C, how we can stay lucky and more healthy and, D, who we can recruit,” Kramer said. “Who can recruit is limited by our own self because we recruit far and above the standards the NCAA requires and far and above the standards ISU requires. So, all four of those factors make a play into who’s playing for us in these games.”\nKramer continued: “I’m trying to get summer school for football. I need summer school for football. We can take less of an academic load during the school year. Our guys are taking 16, 17, 18 credits, so they graduate on time, because graduation’s really important and it should be in every program.\n“If you take 18 credits vs. 12 credits during the (fall) semester, you have less time to be in the training room. Without summer school room and board, our guys have to take full loads, super full loads, to graduate on time or even ahead of schedule, which is the goal of our university and athletic teams.\n“That means we’re not here in the summer. During the fall, we’re here. We’re super busy academically. We’re taking a bigger load and graduating in four years rather than five years. So, we’re worn out. We’re exhausted taking 18 credits, period. Then add on the fact you’re playing Division I athletics, wow. And then you’re taking a 62-hour bus ride. That’s what it took for us to get to and from (Eastern Washington) last week.”\nFrustration? Excuses? Factors?\nAll of the above, perhaps.\nNO STARTING QUARTERBACK NAMED FOR SATURDAY\nKramer didn’t name a starting quarterback Wednesday, but hinted senior Trae Pilster could get his second start in the season finale. Pilster played the second half against Montana in place of concussed starter Tanner Gueller and made his first career start against Eastern Washington.\nKramer noted Weber State’s strong man-to-man press defense, which he said is best navigated by a mobile quarterback.\n“The one thing you can do against all the Cover 1 is run your quarterback,” Kramer said. “I think Trae Pilster has shown he can run,” Kramer added with a wink.\nKramer said earlier in the press conference his quarterback options are Gueller, Pilster, Tom Jewell, Robert Kvinsland and senior wide receiver KW Williams, who was a first-team all-conference quarterback in high school.\nJENKINS OUT AGAINST WEBER STATE\nKramer said Wednesday junior linebacker Mario Jenkins will not play Saturday against Weber State. Jenkins has played the last two games with a cast on his right hand and wrist. He leads the Bengals and is third in the Big Sky in tackles with 93. Jenkins has also tallied 9.5 tackles for loss, three sacks, two interceptions, four pass deflections and a forced fumble.\nJenkins, the 2014 conference freshman of the year, missed last season with a torn ACL and is being held out for precautionary reasons.\n“Everybody’s green-lighted him,” Kramer said. “We sat with him and said, ‘It’s just not worth the risk.’ Is there a chance the injury could get worse? Yes, there certainly is. No medical degree could tell me not.”\nSenior Jake Pettit will start at weak-side linebacker in place of Jenkins. Pettit has 29 tackles, 1.5 tackles for loss and 1/2 sack this season.", "url": "https://apnews.com/6527fb6398704c5eadaafdee54faa937"}