{"authors": ["Rachel Alexander"], "date_download": "2020-05-04 20:25:45", "date_modify": "2020-05-04 20:25:45", "date_publish": "2016-09-08 00:00:00", "description": "The Wednesday apartment fire that killed two people and left a firefighter with third-degree burns started accidentally and could have been controlled much more easily if the building had a...", "filename": "_caf44abe9a6e41ec859b6dfb87cc87a7_1588623945.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_caf44abe9a6e41ec859b6dfb87cc87a7_1588623945.html", "title": "Injured Spokane firefighter taken to Harborview Medical Center in Seattle", "title_page": "Injured Spokane firefighter taken to Harborview Medical Center in Seattle", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Wednesday apartment fire that killed two people and left a firefighter with third-degree burns started accidentally and could have been controlled much more easily if the building had a sprinkler system, fire officials said.\nSpokane Fire Department Assistant Chief Brian Schaeffer said the likely cause was either smoking or an overloaded power strip found in apartment 49, where the blaze started. It spread quickly through the building, which was built before sprinkler systems were required.\nCharles McKenzie, the injured 29-year-old firefighter, was flown to Harborview Medical Center in Seattle Wednesday night with severe burns across his upper torso and arms.\nMcKenzie said on Facebook he’s scheduled to undergo the first of what will likely be several surgeries Friday for a burn on his shoulder.\nMcKenzie tore the door off apartment 49 and was trying to drag the male resident’s body out into the hallway when the fire hit a flash point, spiking to temperatures Schaeffer said were likely over 1000 degrees Fahrenheit.\n“The gear is definitely not meant to protect you from anything over 300 degrees,” Schaeffer said. With his firefighting gear compromised, his body had to absorb the heat of the fire.\nIn spite of his injuries, Schaeffer said McKenzie stayed in the burning room long enough to do a sweep of the apartment and check for other people who might need to be saved. He met Schaeffer on the stairs outside the building, not realizing how injured he was.\n“His helmet was melted around his face,” Schaeffer said. The material on his turnout coat had started to degrade and was burned along the arms and shoulders.\nBefore firefighters arrived on scene, Schaeffer said a Good Samaritan also helped rescue people from the building. Antony Jones went door-to-door alerting people to the fire and helping them escape with their pets. He tried to get into unit 49 to rescue the man inside, but had to turn back due to flames.\nThe fire quickly spread to units above and next to the original apartment and ran into the attic. Both sides of the building were heavily charred Thursday, and the mailbox slot on unit 49 had melted. Water still dripped onto the sidewalk outside the ground units. Outside, charred mattresses and pots and pans were piled in heaps outside the units with the most damage.\nFirefighters worked through the night to get the fire completely out, leaving mid-Thursday morning.\nJohn Goodman, the president of the Spokane Firefighters Union, said McKenzie was “in good spirits” when he was transported to the Seattle hospital, although “he’ll be there for a while.”\nHarborview maintains the region’s largest center for burn treatment.\nOn Facebook, McKenzie said the love and support he’s been getting is “unreal” and wrote, “I did what every guy on this job would do.” He was hired by the Spokane department last fall and previously worked as a volunteer paramedic in Moscow, according to his Facebook page.\nHis sister Michelle said he’s more commonly known as Chuck Mac, the name his Facebook profile is under. In an email, she said McKenzie went into the Air Force straight out of high school and spent three years on active duty before becoming a reserve.\n“He just loves to help others and make sure they are safe and cared for. He is very stubborn to the boot so if he wants to do something, there is no stopping him,” she wrote.\nMcKenzie has been with the department for about a year and was two weeks away from ending his probationary period, Schaeffer said Wednesday.\nThe blaze, at the Rosewood Club Apartments, 401 E. Magnesium Road, also killed a couple in their mid- to late 60s and displaced other tenants. The Spokane County Medical Examiner’s office has not yet identified the victims.\nNeighbors said Wednesday that the woman was disabled and on oxygen, but Schaeffer said no oxygen tanks were found inside the apartment.\nHe said the fire may have flashed over when a large amount of material inside the apartment reached a high enough temperature to allow the flames to spread nearly instantaneously.\n“Everything ignites nearly at the same time,” he said.\nThe woman was wheelchair-bound, he said, which may have prevented her from escaping the fire quickly.\nThe man in the apartment did not have mobility issues, Schaeffer said, but added it’s not uncommon for people to become disoriented during a fire because of all the chemicals and carbon monoxide in the air.\n“It clouds your judgment,” he said.\nThere are currently 10 open cases with the Red Cross involving residents from the apartments, but many units in the 24-apartment building are in decent shape.\n“The building is still standing. They’re going to be able to rebuild,” Schaeffer said.", "url": "https://apnews.com/caf44abe9a6e41ec859b6dfb87cc87a7"}