{"authors": ["Ellen Marks", "Assistant Business Editor"], "date_download": "2020-05-04 20:21:48", "date_modify": "2020-05-04 20:21:48", "date_publish": "2016-07-12 20:02:03", "description": "Hugh Jackman is reprising his role as Wolverine for the third installment of the stand-alone series. Principal photography began this month and will run through August in Albuquerque, Rio Rancho,...", "filename": "_f99fa8a32c67423286fcc607ba3b9488_1588623708.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f99fa8a32c67423286fcc607ba3b9488_1588623708.html", "title": "Hugh Jackman and `Wolverine' to film in NM", "title_page": "Hugh Jackman and `Wolverine' to film in NM", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Hugh Jackman is reprising his role as Wolverine for the third installment of the stand-alone series. Principal photography began this month and will run through August in Albuquerque, Rio Rancho, Abiquiu and Chama. (Courtesy of Twentieth Century Fox)\nHugh Jackman is suiting up for the third installment of the “Wolverine” franchise.\nAnd New Mexico is getting a piece of the pie.\nThe New Mexico Film Office announced the project as “Fox Louisiana Production” on Tuesday, although it’s clear the film is “Wolverine 3″ based on the director and producers.\nThe feature is directed by James Mangold, who was at the helm of “The Wolverine” in 2013.\nIt is also being produced by Hutch Parker and Simon Kinberg who produced “X-Men: Days of Future Past.” Parker also produced “The Wolverine.”\nAccording to the state Film Office, principal photography began this month and will run through August in the Duke City, Rio Rancho, Abiquiu and Chama.\nThe production will employ about 130 New Mexico crew members and two New Mexico cast members, as well as 600 extras throughout the production, the film office stated.\n“New Mexico continues to be a top player in the film and television industry,” said Nick Maniatis, Film Office director. “This latest production announcement is a testament to the hard-working and talented people in our state who have become a vibrant, sustainable and diverse contributor to our economy.”\nAlso starring in the film is Boyd Holbrook, who is a regular on the Netflix series “Narcos.” He has appeared in past New Mexico-made films “Jane Got a Gun,” “The Host” and “The Reunion.”\nHolbrook will play the lead villain opposite Jackman and Patrick Stewart. He will play a relentless, calculating and intense head of security for a global enterprise who is set against Jackman’s clawed Wolverine/Logan hero.\nEriq La Salle, Stephen Merchant, Elise Neal and Elizabeth Rodriguez will also star.\nAccording to the Internet Movie Database, the estimated budget for the film is $127 million. Production began in New Orleans in May. It is slated for a March 3 release.", "url": "https://apnews.com/f99fa8a32c67423286fcc607ba3b9488"}