{"authors": ["Linda Tuccio-Koonz Linda Tuccio-Koonz"], "date_download": "2020-05-04 20:05:00", "date_modify": "2020-05-04 20:05:00", "date_publish": "2016-08-16 04:00:00", "description": "Imagine if there was one night when Michael Jackson wound up in the same room with Prince and Madonna, and they hung out and jammed together. It was just that sort of thing that inspired “The...", "filename": "_aacd8307639545c4bc4df16c42f79ffc_1588622700.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aacd8307639545c4bc4df16c42f79ffc_1588622700.html", "title": "‘Millions Dollar Quartet’ on stage at Westchester Broadway Theatre", "title_page": "‘Millions Dollar Quartet’ on stage at Westchester Broadway Theatre", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Imagine if there was one night when Michael Jackson wound up in the same room with Prince and Madonna, and they hung out and jammed together. It was just that sort of thing that inspired “The Million Dollar Quartet,” only the real-life stars were from an earlier era, and there were four.\nIn this case it was Elvis Presley, Johnny Cash, Jerry Lee Lewis and Carl Perkins. They met at Sun Record Studios in Memphis, Tenn., on the night of Dec. 4, 1956. That story is told in the musical on stage at Westchester Broadway Theatre in New York.\n“People may have heard about (the legendary recording session), but it’s not something everyone would know,” said Hunter Foster, who is directing the production and was involved in the original Broadway company. “I did not know it happened until I got involved in the show. There’s a recording of the whole night. You can buy the recording and hear them goofing off — talking and drinking.”\nFoster said the musical is compelling because audiences learn about the artists’ lives, not just the songs that made them four of the biggest names in music history.\n“This isn’t just about being a star; it’s about going back to your roots and looking at what made you want to make music in the first place.” It’s easy to get lost in the celebrity of it, he said, but there’s something to rediscovering your original dreams and desires.\n“We all think we know who these guys are. But here we sort of see them in their youth, before certain problems arose for each of them. It was when they had their whole lives ahead of them.”\nFoster said there’s a great quote that record/music producer Sam Phillips has at the end of the play: “I wish all of those boys would have had a little more happiness in their lives.”\n“Million Dollar Quartet” embraces the sounds of that time period through each of the artists’ different styles. Foster said he has noticed the musical appeals to a wide range of ages — from older folks who grew up with their tunes, to people in their 20s who are just discovering them. It’s clear from many interviews that some of these stars, such as Presley and Perkins, influenced artists such as the Beatles.\n“The music lives on,” he said. “It feels like there’s a broad spectrum of people who know this music and love it, and love hearing it live.” That goes for kids, too, he said. “Some of these songs, like ‘Hound Dog’ and ‘Whole Lotta Shakin’ Goin’ On,’ and even ‘Folsom Prison Blues’ are part of pop culture. Kids will love Jerry Lee Lewis and Elvis’ antics. It’s very family friendly.”\nDrama and romance are also part of “Million Dollar Quartet,” because Phillips is deciding whether to sell his business to a larger company, and Presley’s girlfriend, Marilyn Evans (Dyanne in the show), was with him that December evening.\nWritten by Colin Escott and Floyd Mutrux, “Million Dollar Quartet” was nominated for three Tony Awards in 2010. Foster, who played Phillips in previous productions, said he has “never seen a show that gives audiences so much joy, and has a real story, real heart and great music.”\nlkoonz@newstimes.com; Twitter@NewsTimes.com", "url": "https://apnews.com/aacd8307639545c4bc4df16c42f79ffc"}