{"authors": ["Ben Bromley", "News Republic"], "date_download": "2020-05-04 20:08:13", "date_modify": "2020-05-04 20:08:13", "date_publish": "2016-12-21 00:00:00", "description": "A Baraboo company is among five whose state tax credits have been revoked. Last week, Wisconsin Economic Development Corporation staff submitted a Tax Credit Revocation Report to the...", "filename": "_caba646c5e334560bacaf53fa231baab_1588622893.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_caba646c5e334560bacaf53fa231baab_1588622893.html", "title": "WEDC revokes $69K in Teel tax credits from 2010", "title_page": "WEDC revokes $69K in Teel tax credits from 2010", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Baraboo company is among five whose state tax credits have been revoked.\nLast week, Wisconsin Economic Development Corporation staff submitted a Tax Credit Revocation Report to the agency’s board of directors. Five companies, including Teel Plastics of Baraboo, must return portions of tax credits awarded in past years to create jobs.\nTeel saw nearly $69,000 of the $159,000 it was awarded in 2010 revoked. The state claims the plastics maker didn’t create or maintain full-time jobs as agreed.\nTeel repaid the tax credits in July, a month after they were revoked.\nThe company didn’t respond to the News Republic’s requests for comment.\nIn 2010, the former Wisconsin Department of Commerce awarded Teel up to $149,000 in tax credits for the creation of up to 39 new jobs in Baraboo through June 2013. Teel was required to create those jobs and retain its existing 206 employees to receive the full credits.\nTo receive any credits, the company was required to maintain through June 2015 all existing 206 jobs as well as any new jobs for which tax credits were received.\nIn 2010, Teel received $68,760 in credits for creating 18 new full-time jobs.\nBut in April 2012, Teel sold the pultrusion division of its company, reducing its payroll by about 30 employees. Those employees remained employed in Baraboo, only with a different company, Razor Components.\nBecause of that sale, WEDC spokesman Mark Maley said, the company didn’t maintain the 18 jobs it created in 2010, and was in violation of its contract. WEDC revoked the tax credits that had previously been earned.\nThe state revoked more than $1 million in tax credits from the five companies in recent months. The credits were issued between 2010 and 2013. Four companies were targeted for failing to create jobs, a fifth because investors pulled out.\nThe revocation of nearly $350,000 in credits issued to HUSCO International got statewide attention because the Waukesha company has close ties to Gov. Scott Walker. HUSCO was rapped for laying off 97 employees and outsourcing their work to foreign countries. The company’s general counsel won an appointment to the UW Board of Regents from Walker last year, and his father chaired Walker’s presidential campaign.\nKansas City-based appraisal company Novation Companies was hit hardest, with the revocation of $664,000 in tax credits. The former subprime mortgage lender declared bankruptcy this year.", "url": "https://apnews.com/caba646c5e334560bacaf53fa231baab"}