{"authors": ["Adam Gaffney", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:43", "date_modify": "2020-05-04 19:51:43", "date_publish": "2016-11-17 00:00:00", "description": null, "filename": "2016_11_obamacare-medicare-medicaid-trump-election_1588621903.html", "image_url": "https://images.jacobinmag.com/2016/11/17232025/13157937113_b47de124d8_k-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_11_obamacare-medicare-medicaid-trump-election_1588621903.html", "title": "Health Care in the Age of Trump", "title_page": "Health Care in the Age of Trump", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nTuesday, there should be little doubt, was a toxic day for health — and health care — in America. The implications of the election are widespread and multifaceted, ranging from the catastrophic impact a Trump presidency will have on climate change — and the attendant global health consequences — to the squeeze on reproductive health care access that will likely follow the rise of the Right. At the state level, important health care–related ballot initiatives went down in defeat, including a universal health care referendum in Colorado and an initiative in California that was set to mildly loosen Big Pharma’s tentacle-like grip on the state’s finances (it would have merely allowed the state to purchase drugs at the discount already available to the federal government). Big Pharma and the insurance industry poured huge sums into lobbying campaigns against these initiatives — money that was evidently well spent. Even more ominously, Republicans now control both the executive and legislative branches, giving them the chance to remold the nation’s health care system into something both uglier and more lucrative for the nation’s corporate health care interests (Pharma stocks soared the day after the election). For those of us who predicted (and hoped) that the coming health care divide would be between centrist-liberal and left-progressive visions, this election constitutes a complete upheaval in the political landscape of health reform. Some important questions arise. What might Republicans have in store for health care? What will the politics of health care reform look like going forward? And how can we keep the dream for single-payer alive?\nThe Trump/ Ryan Agenda Trump’s views on health care are inchoate, derivative, and largely irrelevant. While he has occasionally praised the benefits of single-payer plans in the past (going so far as to laud the Canadian system and the Scottish NHS), he now largely serves up typical conservative talking points. The danger, therefore, is not in some unique Trumpian health care vision, but in the successful enactment of the GOP’s health care agenda: repealing major provisions of the Affordable Care Act (ACA) and/or replacing it with an ostensibly more market-driven system. As Sarah Kliff writes at Vox, Republicans already passed a bill (vetoed by Obama) that would have repealed the major insurance coverage provisions in the ACA, which could potentially strip some 22 million people of health insurance. This would be tantamount to a humanitarian disaster: suddenly wresting insurance from this many people could kill upwards of twenty thousand people a year (methods for this rough calculation are here). And of course, such carnage would disproportionately affect the usual victims: the working class and racial minorities. Whether Republicans would actually seek to pass such a bloodthirsty law, however, is unclear, and there are many reasons to be skeptical (it could be very politically damaging and adversely affect key health care industry players, to name just two). But at the very least, it seems probable that Republicans will attempt to roll back the ACA’s coverage expansion in some way, while at the same time “reforming” the system along conservative, market-based lines. For a taste of what they will likely pursue, unimpeded by Obama’s veto, we can turn to the health care blueprint of Paul Ryan and the House Republicans. Released in June, the thirty-seven-page document outlines a package of policy proposals — much of it based on long-established health care policy ideas — that would advance so-called “consumer-driven healthcare” (e.g. health-savings accounts), partially shred the health safety net, privatize Medicare, and increase profits for Big Pharma at the expense of public health. Some of these ideas have bipartisan roots. For instance, Ryan and company want to limit the tax exclusion for employer-provided health insurance plans — a more drastic version of the ACA’s “Cadillac Tax,” which penalizes workers with more comprehensive health plans. In addition, the Republicans wish to promote and expand “workplace wellness” — occasionally Orwellian programs that the ACA also favored. At the same time, Ryan calls for weakening the ACA’s protections for those with pre-existing conditions (he’d only protect those who maintain continuous coverage), and undermining Medicaid coverage by reducing and restructuring federal funding and giving greater control to the states. Perhaps most destructively, the GOP blueprint effectively advocates ending Medicare, by “transforming the benefit into a fully competitive market-based model” that it calls “premium support.” Under the House Republicans’ mislabeled “Medicare” system, beneficiaries would no longer be entitled to a set of benefits, but instead to a voucher that would cover or offset the cost of a selected plan. Voucher in hand, consumers would then shop in a new “Medicare Exchange” for a plan of their choice: either traditional Medicare (i.e. a Medicare public option) or one of an array of competing private plans. Of course, those with more money to supplement their voucher could buy more comprehensive plans, while low-income seniors would be stuck with the basics. Indeed, that’s exactly the neoliberal health care approach: health care benefits are to be dispensed according to one’s economic means. It’s also worth noting that this vision of competing “Medicare” health care plans is consistent with the long-standing “managed competition” model of health reform, which was at the ideological core of both the Clinton-era health reform of the early 1990s and the ACA’s marketplaces. Yet whereas the ACA marketplaces were meant to expand health care coverage (however problematically, inadequately, and wastefully) via public subsidies, the new Medicare marketplaces would be used to corrode and fragment the program from within. Finally, the GOP document promotes the 21st Century Cure’s Act, a bill that would be an enormous gift to the pharmaceutical industry (at the cost of public health). How much of Ryan’s agenda will come to pass under a Trump administration is unknown. But even if a small portion is approved, it would cause great harm.\nPopularity and Politics How about the politics of health care policy, for this election and beyond? Trump campaigned aggressively to repeal the ACA, which apparently turned out to be a smart political move. The recently announced ACA marketplace premium hikes — of around 22 percent — also might have contributed to Trump’s late surge. The ACA, to be clear, has undoubtedly helped large numbers of people. By expanding Medicaid and, to a lesser extent, by granting subsidies to purchase insurance on marketplaces, the law has extended health insurance to an additional 20 million people. It’s also brought some reforms to the insurance industry — eliminating annual limits, providing free preventive care, etc. Yet under the ACA, the greatest injustices of the US health care system — including substantial rates of uninsurance and underinsurance — have persisted. For the vast majority of the country who did not gain new coverage under the ACA, it very well might seem that things are getting worse. And when rising premiums, copayments, and deductibles squeeze stagnant or meager incomes, the blame is no doubt often directed — fairly or unfairly — at the ACA. “America is already great” is a poor slogan for those who remain uninsured, those who are hit with soaring drug prices, or those who are forced to decide between paying a medical deductible or paying rent. The very structure of Obamacare has also undermined its ability to build public support. Unlike Medicare, Obamacare was not a new universal benefit. And the difference, it seems, is born out in the poll numbers. A Gallup Poll published earlier this year, for instance, found that a slight minority — 51 percent — favored repealing the ACA, while only 48 percent wanted to keep it in place. In contrast, according to a 2015 Kaiser Family Foundation poll, some 77 percent of the public describes Medicare as a “very important government program.” No politician can afford to openly attack Medicare (even Republicans describe, dishonestly, their approach as an attempt to rescue it). In contrast, the ACA has been politically vulnerable from its first day. The law certainly helped millions gain insurance coverage, but it did so through a complicated system of means-tested benefits instead of through a universal benefit — the creation of which might have helped generate the social solidarity needed for its preservation.", "url": "https://www.jacobinmag.com/2016/11/obamacare-medicare-medicaid-trump-election"}