{"authors": ["Luke Savage", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:17", "date_modify": "2020-05-04 19:58:17", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_09_jeremy-corbyn-labour-leadership-democracy-doug-saunders_1588622297.html", "image_url": "https://images.jacobinmag.com/2016/10/17230905/15059865318_4fe1222d2e_k-11-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09_jeremy-corbyn-labour-leadership-democracy-doug-saunders_1588622297.html", "title": "The Case for Party Democracy", "title_page": "The Case for Party Democracy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nBarring an ugly surprise, Jeremy Corbyn will easily win re-election as leader of the British Labour Party later this week. But while Corbyn will undoubtedly emerge stronger, he and his supporters can expect to face a continuing barrage of attacks from the usual suspects in the media and the Labour right. One likely refrain will be that Corbyn’s victory, however large, lacks legitimacy because it rests on an energized minority of activists out of step with the rest of the electorate. Party democracy, we will be told, is anathema both to electoral success and the goal of representing the majority of society. While these arguments are anything but new, recent debates provide an excellent opportunity to put these narratives to the test. So, does party democracy really matter? Should party members have a role in determining policy and directing leadership? And if so, why?\nParty Democracy, Redux In broad terms, the two most common perspectives on party democracy can be summarized as follows. The first, espoused by skeptics, is that the more democratic a party’s internal structures, the more likely it will become a vehicle for single-issue groups or marginal sects whose quixotic views and dilettantish zeal threaten its appeal to the wider population. The second, by contrast, holds that only internal mechanisms at least nominally democratic in character will encourage mass participation and foster the dynamism needed to win elections and, perhaps even more importantly, build real popular support for a program. Historically, views on party democracy have varied greatly depending on the context — liberal, socialist, and communist parties have all housed different perspectives on the debate at one point or another. But if the second view is today represented by figures like Jeremy Corbyn and Bernie Sanders, the skeptical one is often found throughout liberal commentary and analysis. Corbyn in particular has made increasing member participation both a personal priority and a criterion for success. And it’s paid off. Labour’s total membership has risen from a relatively modest 187,000 just prior to the 2015 election defeat to a startling 600,000 as of July — easily overtaking the previous modern peak (405,000 in 1997) and making Labour the first mass party in the advanced capitalist world this century. Not everyone, however, has applauded the explosion in membership. Skeptics have variously portrayed the membership surge as the work of far-left infiltrators; a resurgent, zombified reincarnation of retrograde “Old Labour” politics; or the result of an influx of self-indulgent, middle-class socialist hipsters. Last week, Corbyn’s leadership opponent, Owen Smith, mused about expelling members of Momentum — the internal party organization that grew out of Corbyn’s 2015 leadership campaign — from the party altogether. Regardless of the operative caricature, the implication is clear: Labour’s increasingly mass membership is essentially narrow and sectarian, representing the parochial flourishing of a minority political view in one of Britain’s two major parties and endangering its prospects by backing policies and leadership antithetical to the political mainstream. A recent column by Doug Saunders of the Globe and Mail typified this argument. Entitled “More democracy within parties, less democracy without,” the piece is nothing if not clear: Two forces are at work in any election: The will of tens of millions of voters in the actual democratic showdown, and the influence of far smaller groups of political-party members. As we’re learning this year, those two forces often work against each other. More party “democracy” often produces candidates who are beholden to party insiders rather than the larger electorate. After equating Corbyn and Sanders with Trump (and regurgitating a number of other baseless caricatures), Saunders concludes that the two leftists’ push for mass participation and greater internal democracy represent nothing more than niche campaigns that put their respective parties’ electability at risk. Putting aside the article’s inaccuracies (polls repeatedly showed Sanders would fair better against Republican rivals than Hillary Clinton, and Corbyn’s Labour was essentially even in the polls until the recent attempt to oust him), Saunders succeeds in encapsulating the familiar case against party democracy. But are he and his fellow skeptics right?\nThe Problem With Parliamentarism At the core of Saunders’s argument and others like it is the notion that democratic legitimacy rests in the hands of parliamentarians or legislators, who are elected by the whole country. For example, he writes: Mr. Corbyn became [Labour] leader last year as a result of rule changes that allowed him to sell tens of thousands of £3 party-membership cards to supporters, overriding the resistance of the established party and its MPs [members of parliament] . . . he lost the faith of more than three-quarters of his MPs, who voted to oust him. But another party rule change prevented them from doing so: The faux-democracy of those £3 cards trumped the real democracy of tens of millions of voters and their MPs (only 2 per cent of Britons are political-party members), and he will likely hang on as leader this way for some time. It’s a truism that in any liberal-democratic system, the legitimacy of political decisions rests on the popular mandate that legislators at least nominally receive in general elections. But it’s quite wrong to imply, as Saunders does, that MPs had, or should have had, the authority to oust their party leader by way of a parliamentary vote. Given how immovable the political cultures of a good number of Western democracies have become, many commentators seem to forget that parties are, first and foremost, private institutions. Labour isn’t simply an appendage of the state or a creature of parliament, even if its representation there forms the most important and publicly visible part of its existence. MPs from every party may be chosen by voters, but candidates, leadership, and policies are determined completely by internal party structures (democratic or otherwise). In the parliamentarist view, political legitimacy does indeed emanate from the people, who elect representatives in what Saunders calls the “wider democratic showdown.” But for Saunders and his ideological brethren, popular involvement beyond the routine practice of voting in elections is (and should be) severely limited. Membership participation, either in the form of candidate or leadership selection, let alone party policy, is conceived of as both an electoral weakness and a potentially illegitimate encroachment on parliamentary democracy itself. When taken to its logical conclusion, this view essentially recasts democratic politics as an ongoing confrontation between a permanently embedded cluster of parties directed almost exclusively by unelected professional apparatchiks. Ordinary members have negligible influence and, consequently, the wider public cannot fundamentally alter the composition of the political class — its choices are limited to whatever options that class serves up at elections. Yet this view misunderstands the origins of the Labour Party itself. Labour, like many other left and socialist parties, originated in the early twentieth century on the back of mass mobilization and discontent. Even before the party itself was constituted, popular participation was widespread in churches, community halls, and trade unions. This is not simply arbitrary historicism: recalling these origins, even more than one hundred years later, is vital because they clearly demonstrate the limits of conceiving democracy in purely parliamentary terms. Whatever Labour’s subsequent shortcomings as a vehicle of popular democracy, its genesis should remind us of the vital role that left parties can play as democratic organs in civil society. But as recent history shows, they first have to be internally democratic.\nParty Democracy and the Case of Labour Today’s Parliamentary Labour Party is, to put it mildly, not particularly representative of the communities it represents throughout the country. In 1979, 40 percent of Labour MPs came from a manual occupation. That figure is now just 7 percent, according to an analysis by the Smith Institute. A full 29 percent entered parliament after working as political staffers; another 18 percent came out of business or finance, 10 percent began their careers in media, and 12 percent started in law. Only 15 percent have roots in the trade union movement that founded the party. The numbers from parliament as a whole are even more striking: the average British MP is male, aged fifty-one, and university-educated. A full 33 percent of MPs attended private schools (compared to a national average of 7 percent), and one in four had a background in politics. In short, Westminster politics has turned into a career path for upper-middle-class professionals, drawn from an incredibly narrow range of occupations. If the ostensible goal of democratic politics — let alone democratic socialist politics — is to represent and reflect the desires and interests of ordinary people, the British system is failing miserably. So how did it come to this? The particular causes of Labour’s own transformation are quite complex. The Blairite project of the 1990s was more middle-class, metropolitan, and liberal than the party during the premierships of Jim Callaghan, Harold Wilson, Clement Atlee, or Ramsey MacDonald (though middle-class liberals had been part of the Labour coalition since the decline of the Liberals in the 1920s). At the core of its diagnosis was the notion that successive election defeats could be chalked up to the party’s inability to embrace “modernization” (which, in the Blairite formulation, implied zealous assimilation to the central tenets of both Thatcherism and neoliberal globalization.) This was in major part, the Blairites understood, thanks to an activist base that still viewed Labour as a vehicle for democratic socialism. The lingering trauma from the toxic internal debates of the 1980s offered an opportune psychological backdrop for the thoroughgoing restructuring of the party that followed. Not only were party members and constituencies disempowered but, mimicking a strategy pioneered by the Clintons in the US, Blair actively sought to antagonize them to shore up support with the Murdoch press, the City of London, and other right-wing interests. Despite Blair’s three successive election victories, Labour shed millions of voters between 1997 and 2010, disproportionately from the working class. As Ed Miliband observed in a 2010 article for the Fabian Society: Five million voters were lost by Labour between 1997 and 2010, but four out of the five million didn’t go to the Conservatives. One-third went to the Liberal Democrats and most of the rest simply stopped voting. It wasn’t, in the main, the most affluent, professional voters that deserted Labour either . . . You really don’t have to be a Bennite to believe that this represents a crisis of working-class representation for Labour — and our electability. The decline of Labour’s internal democracy, in other words, coincided with a growing severance from a significant chunk of its social base. The party’s increasingly professional composition has had very real consequences for its policy agenda and overall ideological outlook. Nowhere is this more evident than in the phenomenon of MPs with metropolitan backgrounds parachuting into Labour heartlands they have little or no connection to. Writing on the occasion of David Miliband’s departure from UK politics in 2013, the Guardian’s Aditya Chakrabortty highlighted this disconnect by way of a thought experiment: imagining Miliband’s replacement in the northern constituency of South Shields by a working-class woman named Karen. After 12 years of David Miliband as MP, the local Labour party has opted for a local candidate, a woman born and raised in the area. Karen is a bus driver with a disabled husband, who has lived in a three-bedroom home for years — but the coalition thinks they have too much space and has cut their housing benefit. So when Karen attacks Cameron’s bedroom tax, she draws on personal experience of being forced to downsize. With his “frictionless ascent from thinktanks to backroom Labour politics to the cabinet,” Chakrabortty wrote, “David Miliband is typical of the gilded class who masquerade as our delegates in Westminster.” He continued: The consequences of this narrowness are easy to see . . . Think about the Class of 45: Ernie Bevin — a former lorry driver; Peter Mandelson’s granddad, Herbert Morrison — a grocer’s assistant. And, the father of the NHS, Nye Bevan: a bolshie ex-miner. However different their politics, it’s hard to imagine any of these three accepting a retrospective law imposing benefit sanctions on unemployed people refusing private “workfare”, as Ed Miliband’s party did last month. The consequences of diminished internal democracy, then, are anything but abstract. Not only has Labour become less representative of the communities that send its MPs to parliament, but the party’s increased professionalization has actively disconnected it from their needs, wounding its long-term electoral prospects. Lacking the ability to shape the party’s agenda or determine who stands at general elections, many have withdrawn their support and a good number have become alienated from politics altogether. The parliamentarist view, with its skepticism of party democracy, simply offers no solution to such an impasse.", "url": "https://www.jacobinmag.com/2016/09/jeremy-corbyn-labour-leadership-democracy-doug-saunders"}