{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:24:07", "date_modify": "2020-05-04 20:24:07", "date_publish": "2016-10-10 15:40:00", "description": "Robert Lind Horton, 71, of Fort Atkinson, passed away unexpectedly on Thursday, Oct. 6, 2016, at the University Hospital in Madison. Bob was born on Aug. 12, 1945, in Sioux City, Iowa, to...", "filename": "_efbcabd145bf49268eb82eeecc1496be_1588623847.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_efbcabd145bf49268eb82eeecc1496be_1588623847.html", "title": "Robert Lind Horton, 71, Fort Atkinson", "title_page": "Robert Lind Horton, 71, Fort Atkinson", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Robert Lind Horton, 71, of Fort Atkinson, passed away unexpectedly on Thursday, Oct. 6, 2016, at the University Hospital in Madison.\nBob was born on Aug. 12, 1945, in Sioux City, Iowa, to Robert and Helen (Hagberg) Lind.\nHe graduated from Gordon High School in Decatur, Georgia, in 1963. He earned his bachelor of science degree in 1967 and his master of science degree in 1969 from Georgia Tech. He received his Ph.D in mathematics with a minor in computer science from the University of Wisconsin-Madison in 1973.\nBob taught for more than 50 years at the college level, beginning as a teaching assistant at Georgia Tech and UW-Madison. After receiving his doctorate, he taught at North Dakota State University, Northern Illinois University, Gonzaga University and the UW-Whitewater.\nDuring his 34-year career at UW-Whitewater, Bob spent over 25 years as coordinator of the Management Computer Systems Program. Under his leadership, UW-Whitewater was named the No. 1 Four-Year Computing Degree Program in North America eight times by the Association of Information Technology Professionals.\nBob served on the Advisory Board at Washington High School in Milwaukee, and was instrumental in creating the iFair for Milwaukee area middle and high school students to introduce them to the many careers available in the Information Technology Field.\nBob was a member of the First United Methodist Church in Fort Atkinson where he served in many capacities including Drama Team, liturgist, greeter, small group facilitator and helping in the kitchen with Feed Your Soul.\nHe enjoyed many activities with his family including cheering on his Georgia Tech Yellow Jackets, Milwaukee Brewers, Madison Mallards and Green Bay Packers.\nBob appeared in dozens of shows over his theatrical career, including several with his daughters, Nicole and Ashley. He also directed five Youth FACT productions, and was looking forward to the winter/spring show for 2017.\nHe loved hiking, highlighted by hikes on the Appalachian Trail, to the bottom of the Grand Canyon and to the top of Mt. Crested Butte. He also loved fishing and was a master of the backyard grill.\nBob was a selfless and giving person. As his last earthly act, he donated organs so that others might have a chance at life.\nOn Sept. 4, 1976, Bob married Eve Henson at First Congregational United Church of Christ in DeKalb, Ill. They just recently celebrated their 40th wedding anniversary.\nBob is survived by his wife, Eve Horton of Fort Atkinson; one son, Robert (Elise Morrison) Lind, of Seattle, Wash.; two daughters, Nicole Horton of Lancaster, Pa., and Ashley Horton of Minocqua; and two grandchildren, Connor Lind Morrison of Seattle, Wash., and Grayson Andrew Jordan of Minocqua.\nHe also will be missed by his brothers-in-law, sisters-in-law, nieces, nephews, and great-nieces and great-nephews.\nBob was preceded in death by his parents; and his stepfather, Bert Horton.\nThe memorial service will be Tuesday, Oct. 11, at the First United Methodist Church, 320 S. Main St., Fort Atkinson, with the Rev. Russell Frees Jr. officiating.\nVisitation will be held at the church at 1 p.m. with the service to follow at 2 p.m.\nCommittal will be Wednesday, Oct. 12, at 11 a.m. at Evergreen Cemetery in Fort Atkinson.\nThose planning an expression of sympathy may wish to consider a memorial to the First United Methodist Church in Fort Atkinson, Samaritan’s Purse, The Georgia Tech Foundation or RZIM (Ravi Zacharias International Ministries).\nThe Nitardy Funeral Home in Fort Atkinson is assisting the family.\nwww.nitardyfuneralhome.com", "url": "https://apnews.com/efbcabd145bf49268eb82eeecc1496be"}