{"authors": ["Chris Treadway", "Karina Ioffee", "Staff Writers"], "date_download": "2020-05-04 20:13:34", "date_modify": "2020-05-04 20:13:34", "date_publish": "2016-06-28 18:06:24", "description": "Admission is free to the Fourth of July celebrations being held by cities in West Contra Costa. ALBANY: The annual Green, Red, White & Blue Celebration will have activities and competitions,...", "filename": "_db40e165b15f4d3885529bdd8d81ab3f_1588623214.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_db40e165b15f4d3885529bdd8d81ab3f_1588623214.html", "title": "Fourth of July Celebrations in West Contra Costa", "title_page": "Fourth of July Celebrations in West Contra Costa", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Admission is free to the Fourth of July celebrations being held by cities in West Contra Costa. ALBANY: The annual Green, Red, White & Blue Celebration will have activities and competitions, classic cars, food and entertainment for all ages from noon to 4 p.m. July 4 at Memorial Park, 1325 Portland Ave. Attractions will include bluegrass music by Bill Evans & Friends, games for children and families, a petting zoo, face painting, a rock climbing wall, a zip line, jump houses, the East Bay Vivarium show, local food trucks, the annual Diaper Derby and mustache and beard and watermelon eating contests, and classic car and pet shows.\nFun bands will be available for $5.\nStart the fun early at the annual Albany Lions Club pancake breakfast from 9 a.m. to noon at the Veterans Memorial Building.\nDetails: 510-524-9283. BERKELEY: The city’s annual July 4 celebration will have a full day of entertainment, activities and food from noon to 10 p.m. at the Berkeley Marina on the shoreline at the foot of University Avenue, with a fireworks display closing the festivities. Live musical entertainment will include Tito y su Son de Cuba, The Queue, The Rusty String Express and a special performance by the United States Air Force Band of the Golden West. Troupe Tangiers and Sharifa’s Habibis belly dancers will perform and roving entertainers will be found around the shoreline.\nThe Buddy Club Stage will have family entertainment at Shorebird Park.\nOther offerings will include food trucks and vendors, booths with handmade crafts, live pony rides, a petting zoo, Nerf tag and Sumo Soccer near Skates, an inflatable bouncy area, mini-train rides, giant slides, and water bubble balls and a free photo booth hosted by Looking Glass Photo.\nAdmission is free.\nVehicle parking at the marina is $15 for the day. The area is accessible by bicycle from the bicycle overpass over Interstate 80 and free valet bike parking will be offered near Adventure Playground, which is also open for the day. To come by bus take AC Transit 51B from the Downtown Berkeley BART station until 6 p.m.. To leave on AC Transit after the fireworks, walk out over the freeway overpass to University and Fifth Street.\nDetails: www.AnotherBullwinkelShow.com . EL CERRITO: A full day of live music and family entertainment will fill Cerrito Vista Park, 950 Pomona Ave. at Moeser Lane in El Cerrito, at the July 4 Festival from 10 a.m. to 7 p.m. The lineup for the 18th annual worldOne Festival at the event will feature Main Stage performers Real Vocal String Quartet, Steep Ravine, Kahlil Wilson, Reggae Angels, West African Highlife Band, Carlitos Medrano and Non-Stop Bhangra.\nOther scheduled performers include DJ Doug Wendt, DJ Gregg McVicar and emcee DJ worldOnelove, Magical Nathaniel and Brasarte-Carnival Brasileira, and Circus Imagination will return with its animal-free audience-participation shows geared for young children.\nThe 10th annual El Cerrito Art Association Show and Sale on Pomona Avenue will spotlight works available from local artists, and there will also be vendor, food and community booths on the street and in the park.\nChildren’s offerings will include enjoy the carnival games, face painting, a rock climbing wall, bounce houses, and carnival rides for young children.\nFree bike valet parking will be available on Moeser Lane.\nThe festival will kick off with an advance celebration in the park on July 3 that will include a special Circus Imagination show at 4 p.m. and a free performance by Hawaiian slack key guitarist Patrick Landeza, joined by dancers Mahealani Uchiyama and Halau KaUaTuaHine on the Main stage from 5 to 7 p.m. Bring a picnic dinner or purchase cuisine from the ADOruBOwl food truck.\nDetails: www.el-cerrito.org/july4festival . HERCULES: A morning 5K run and walk, a parade and a festival at Refugio Valley Park will be offered at the Independence Day celebration from 7 a.m. to 3 p.m. July 4. Registration for the third annual l Hercules Dynamite 5k Run/Walk presented by the Hercules Rotary Club opens at 7 a.m. and starts at 8:30 a.m. A one-mile fun run will follow at 8:45 a.m. and a Kids Run at 9:30 a.m.\nThe festival and expo at Refugio Valley Park, 1515 Refugio Valley Road, will have food, information and entertainment from 7 a.m. to 3 p.m.\nThe parade will set out at 10:45 a.m. from Redwood and Sequoia streets, turning onto Sycamore Avenue and proceeding to the entrance of Refugio Valley Park.\nFor more details and run registration visit www.hercules4thofjuly.com . RICHMOND: Celebrate Independence Day with three unique events to choose from on the Richmond waterfront. The city’s annual fireworks display on July 3 will begin about 9:15 p.m. and be visible along the waterfront, including Marina Bay Park at the foot of the Richmond Parkway, where the Recreation Department is hosting live blues music and a youth play area (activities for a fee) starting at 5:30 p.m. The 20-minute fireworks display Another vantage point on July 3 is the Craneway Pavilion inside the historic Ford Point building at 1414 Harbour Way South, which will host a free Independence Day celebration that features the Oakland Symphony, which will play selections during the evening and perform patriotic music during the fireworks. There will also be food for sale and paid parking will be available starting at 5 p.m. Access to the Craneway Pavilion and the wharf will begin at 6:30 p.m.\nAbout a mile away, the SS Red Oak Victory, berthed at the Port of Richmond, will hold its own celebration, offering dinner aboard the historic ship or at one of the food trucks outside. Grab some food, then watch a flyby of a World War II vintage P-51H Mustang and stay for the fireworks. 6 to 10 p.m. Tickets are $45 and must be purchased in advance. Call 510-237-2933 for more information. On July 4, the party continues with a special wine tasting and hors d’oeuvres at Riggers Loft Wine Company, which opened this March next to the Red Oak Victory in the Port of Richmond, followed by an all-you-can eat barbecue and views of fireworks displays in Sausalito and San Francisco. Tickets are $100. For more information and to reserve tickets, call 510-233-2065. SAN PABLO: Music, children activities, food, arts and crafts, and a nighttime fireworks display are among the offerings at the city’s Fourth of July Family Celebration from 4 to 9:30 p.m. at the El Portal Soccer Field, 2600 Moraga Road. Performers will include the Rjae Haas Band from San Jose with classic rock; Los Chicos del 512 with a tribute to the late singer Selena; vocalist Abe Cortez with a tribute to Al Green; and a salute to Motown and R&B by Talk of the Town.\nAdmission and parking are free, while there is a fee for games and activities.\nDetails: www.sanpabloca.gov/July4th . Contact Chris Treadway at 510-262-2784 or ctreadway@bayareanewsgroup.com . Follow him at Twitter.com/christreadway . Stay up-to-date on West Contra Costa news at IBABuzz.com/westcounty .", "url": "https://apnews.com/db40e165b15f4d3885529bdd8d81ab3f"}