{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:08:29", "date_modify": "2020-05-04 16:08:29", "date_publish": "2016-04-07 18:06:35", "description": "Read CNN's Fast Facts on Shirley MacLaine and learn more about the actress, dancer and author.", "filename": "2016_04_07_us_shirley-maclaine-fast-facts_index_1588608509.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/140203120218-56-oscar-best-picture-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2016_04_07_us_shirley-maclaine-fast-facts_index_1588608509.html", "title": "Shirley MacLaine Fast Facts", "title_page": "Shirley MacLaine Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here is a look at the singer, dancer, best-selling author and Oscar-winning actress, Shirley MacLaine.\nPersonal\nBirth date: April 24, 1934\nBirth place: Richmond, Virginia\nBirth name: Shirley MacLean Beaty\nFather: Ira O. Beaty, school administrator\nMother: Kathlyn (MacLean) Beaty, drama teacher\nMarriage: Steve Parker (1954-1982, divorced)\nChildren: Stephanie Sachiko \"Sachi\" Parker\nOther Facts\nNominated for six Academy Awards and won one.\nNominated for six Primetime Emmy Awards and won one.\nHas said she believes in reincarnation and UFO's.\nIs named after the child star Shirley Temple.\nTimeline\n1950s - Performs in a \"subway circuit\" production of \"Oklahoma.\"\nMay 28, 1953 - Makes Broadway debut in \"Me and Juliet\" as a member of the chorus.\n1954 - As the understudy for star Carol Haney in \"The Pajama Game\" on Broadway, MacLaine gets her big break after the lead actress hurts her ankle. Hollywood producer Hal Wallis is impressed by MacLaine's performance and offers her a film contract.\n1955 - Makes her film debut in Alfred Hitchcock's \"The Trouble with Harry.\" Also co-stars with Dean Martin and Makes her film debut in Alfred Hitchcock's \"The Trouble with Harry.\" Also co-stars with Dean Martin and Jerry Lewis in \"Artists and Models.\"\n1955-1971 - Stars in close to 25 movies, including \"Some Came Running\" in 1958, \"The Apartment\" in 1960, \"Irma La Douce\" in 1963, and \"Sweet Charity\" in 1969.\n1960s - Supports Robert F. Kennedy's presidential campaign, protests the Supports Robert F. Kennedy's presidential campaign, protests the Vietnam War and advocates for civil rights.\nJanuary 1, 1970 - MacLaine's memoir, \"Don't Fall Off the Mountain,\" is published. It's the first of 15 books penned by the actress.\n1971-1972 - Helps Democrat George McGovern campaign for president.\n1973 - Spends three weeks in China leading an all-female delegation on a tour sanctioned by the Communist government. She makes an Oscar-nominated 1975 documentary about the trip, \"The Other Half of the Sky: A China Memoir.\"\nSeptember 11, 1977 - Wins a Primetime Emmy Award for Outstanding Special Comedy, Variety or Music, for her role in \"Gypsy in my Soul.\"\n1978 - Visits Visits Fidel Castro at the Presidential palace in Havana while on a trip to Cuba. After telling him that she liked his uniform, he gives her a replica of one of his uniforms, according to MacLaine's memoir, \"My Lucky Stars.\"\n1984 - Wins the Oscar for Best Actress for her role as Aurora Greenway in \"Terms of Endearment.\"\n1994 - Walks nearly 500 miles across Spain on a spiritual pilgrimage called El Camino de Santiago. During her month-long solo journey, MacLaine sleeps in shelters and begs for food. She chronicles the trek in her book, \"The Camino: A Journey of the Spirit.\"\n2011 - Receives France's most prestigious award for the arts, the Legion of Honor.\n2012-2013 - Portrays a fashionable New Yorker on the hit show, \"Downton Abbey.\"\nDecember 8, 2013 - Receives the Kennedy Center Honors for her achievements in the performing arts.", "url": "https://www.cnn.com/2016/04/07/us/shirley-maclaine-fast-facts/index.html"}