{"authors": ["Nathan J. Robinson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:55:16", "date_modify": "2020-05-04 19:55:16", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_09_bill-clinton-crime-hud-prisons-constitution-habeas-corpus_1588622116.html", "image_url": "https://images.jacobinmag.com/2016/10/17230920/Screen-Shot-2016-09-23-at-10.55.36-AM1-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09_bill-clinton-crime-hud-prisons-constitution-habeas-corpus_1588622116.html", "title": "The Evictor-in-Chief", "title_page": "The Evictor-in-Chief", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn addition to the Violent Crime Control Act, Bill Clinton signed two other major pieces of anti-crime legislation. 1996 brought the Anti-Terrorism and Effective Death Penalty Act (AEDPA), which legal journalist Lincoln Caplan calls “surely one of the worst statutes ever passed by Congress and signed into law by a president.” As Caplan explains, “the heart of the law is a provision saying that, even when a state court misapplies the Constitution, a defendant cannot necessarily have his day in federal court.” AEDPA was a political response to the Oklahoma City bombing and the perception that death row inmates were given unduly generous helpings of appellate procedure. It drastically accelerated executions, creating what judge Stephen Reinhardt called “a twisted labyrinth of deliberately crafted legal obstacles” that prevent death row inmates from raising issues successfully on appeal. AEDPA thereby inhibited the ability of judges to fix unsound convictions, and examine the substantive rather than procedural issues in a case. With the Supreme Court having interpreted AEDPA’s requirements literally, according to Caplan, the law “has become an enormous source of frustration on the federal bench.” That’s because it “trips up federal judges who try to undo unjust convictions, rendering them powerless to address procedural unfairness — and, at worst, preventing them from granting a potentially innocent person a new trial or release, or even stopping his or her execution.” One federal judge even admitted to Liliana Segura of the Intercept that “I suspect that there may well have been innocent people who were executed because of the absence of habeas corpus.” Because habeus corpus is such a fundamental right, even some conservatives have looked askance at AEDPA. Republican-appointed judge Alex Kozinski of the Ninth Circuit has called AEDPA “a cruel, unjust and unnecessary law that effectively removes federal judges as safeguards against miscarriages of justice.” And Daniel Patrick Moynihan argued that AEDPA would “introduce a virus that will surely spread throughout our system of laws.” Serious arguments have been made that the law should be declared unconstitutional, since it is a legislative attempt to eliminate a fundamental right. AEDPA’s harms are more than merely theoretical. According to a Columbia Law School study of death penalty cases from 1973 to 1995 “courts found serious, reversible error in nearly seven of every ten of the thousands of capital sentences that were fully reviewed during the period.” The errors were so numerous that “state courts threw out 47 percent of death sentences due to serious flaws, a later federal review found ‘serious error’ — error undermining the reliability of the outcome — in 40 percent of the remaining sentences.” As Lincoln Caplan explains, AEDPA eliminates the mechanism for correcting those mistakes. Without habeas corpus, “[i]nstead of later being found not to deserve the death penalty, as happened in seventy-three percent of the cases, or instead of being found innocent, as happened in nine percent of the cases, these defendants likely would have been put to death.” But AEDPA was not the only way the administration restricted criminal offenders’ access to courts. Clinton also signed the Prison Litigation Reform Act, another legislative attempt to curb perceived excesses of justice. The PLRA was designed to restrain prisoners from filing lawsuits over their conditions; the perception was that too many prisoners were complaining of having their rights violated. Instead of having these allegations dealt with by the courts, the PLRA tried to shift them back to the in-prison administrative grievance process. Unfortunately, prison administrations are not terribly reliable safeguards of prisoners’ rights. The functional effect of the PLRA was therefore to allow for abuses of inmates to go unchecked. As Ian Head wrote in the New Republic, the act “laid waste to the ability of incarcerated people to bring prison officials to court for violations of their constitutional rights, whether it be racial discrimination, lack of medical care, or brutality by prison guards.” The New York Times condemned the PLRA, writing that it “insulate[d] prisons from a large number of very worthy lawsuits, and allow abusive and cruel mistreatment of inmates to go unpunished.” One particularly troubling aspect of the PLRA was its requirement that prisoners show “physical injury” in order to bring a successful suit over prison conditions. Because all kinds of conditions are abusive but do not cause lasting injury, this has severely circumscribed the brutalities that can be remedied. As the Times explained, the requirement has been used to dismiss suits over all kinds of inhumane acts, including: “strip-searching of female prisoners by male guards; revealing to other inmates that a prisoner was HIV-positive; forcing an inmate to stand naked for 10 hours.” Courts have also found that prolonged isolation and even prison rape do not necessarily meet the “physical injury” requirement. The PLRA also includes some almost gratuitous additional difficulties for inmates. Filing a case in federal court usually costs several hundred dollars, but courts can typically waive the fee for indigent litigants. The PLRA eliminates the fee waiver for prisoners. Instead, it “requires indigent prisoners to pay the filing fees for their lawsuits by paying part up front and then making monthly installment payments of twenty percent of their previous month’s income until the fees are paid in full.” Of course, since inmates often earn something like forty cents an hour, this means months of work. The result is that thanks to the PLRA, any prisoner whose rights are abused and who needs a judicial remedy must effectively sign himself up for permanent indenture to the courts. The PLRA contributed to the ever-expanding thicket of legal barriers between criminal offenders and the enforcement of their constitutional rights. It was one of several pieces of legislation that Clinton signed into law without objection, each punishing criminals further, without any evidence that doing so would have socially salutary effects. But Clinton’s pursuit of criminals went beyond signing Congress’s bills; Clinton also incorporated the “tough-on-crime” attitude into the policies of administrative agencies under his control.\nMama Greene Ann Greene was known as “Mama Greene” among residents of the Alemany housing project in San Francisco. She sat on the board of the tenants’ association and served as captain of her building. She always involved herself with the life of the community, “making sure the trash stays picked up and people don’t play their music too loudly at night.” But when Greene’s thirty-eight-year-old son, Ladell, who did not live with her, was arrested on drug charges, the San Francisco Housing Authority immediately filed eviction papers against Ann Greene. The Housing Authority insisted that her son had stayed at her house, and that this was sufficient to evict her. Greene’s eviction notice came as a result of the “one-strike” policy adopted by the Department of Housing and Urban Development (HUD). The Clinton administration introduced administrative guidelines that required public housing authorities to evict anyone who committed a drug crime. Previously, public housing authorities had been reluctant to evict tenants for criminal infractions, fearing constitutional concerns. The Clinton rule clarified that it was official administration policy to evict people after a single offense, no matter what. The policy was personally directed by the president. Speaking in defense of his decision, Clinton said: For some, one strike and you’re out sounds like hardball. Well, it is. If you mess up your community, you have to turn in your key. There is no reason in the world to put the rights of a criminal before those of a child who wants to grow up safe. Clinton insisted that HUD would be taking vigorous measures to ensure local housing authorities were complying, promising that “there will actually be penalties for housing projects that do not fight crime and enforce ‘one strike and you’re out.’” His speech announcing the rule included no acknowledgment of the possibility of error or overzealousness on the part of housing authorities, and Clinton bragged of the increasing numbers of drug arrests taking place in housing projects. The one-strike policy had wide consequences for those seeking public housing. Tens of thousands of people were explicitly rejected for public housing on “one-strike” grounds annually. Human Rights Watch noted that given America’s high felony conviction rate, 3.5 million people were made ineligible for public housing as a result of the rule. But this understates matters, since the Clinton policy encouraged eviction for criminal acts, not criminal convictions. That meant that even if a person was still under a presumption of innocence in the criminal courts, having not yet been convicted of anything, HUD could still move to take away their public housing. To say that one had not been convicted of a crime was no defense; even if a person was later found not guilty in a court, she could still be barred from public housing. In fact, one needn’t even be arrested for a crime; the housing authority’s word was sufficient. This gave housing authorities an extraordinary amount of discretion over eviction, and left tenants with few remedies when a “one-strike” eviction was initiated. Given that HUD adopted an explicit presumption of guilt, it was impossible to even know how to exonerate oneself and keep one’s housing. As a result, the horror stories were numerous. As Wendy Kaplan and David Rossman documented, evictions could happen over matters as trivial as “a petty fight between adolescent girls.” In one case, a family was evicted because the parents would not eject their fourteen-year-old son, who had been convicted of vandalizing school property (and received only community service from the juvenile court). In another, a seriously ill sixteen-year-old was arrested for drug possession, and barred from public housing. When his mother let him stay one night in her apartment so that he could go to a doctor’s appointment at the hospital next door, the housing authority began eviction proceedings against the mother. (The boy’s charges would ultimately be dismissed in juvenile court, but this was irrelevant.) The one-strike rule meant that public housing tenants were at constant risk of eviction. They didn’t just need to avoid arrest; they needed to avoid committing any act that would give the housing authority grounds to believe one had committed a criminal act. Tenants therefore had to be on edge at every moment, making sure not just to behave lawfully, but to behave in a manner that would please the authority. The effect was an extraordinarily intrusive regulation of poor people’s behaviors, one that turned housing projects into unaccountable police states. But even walking on eggshells was not enough. The Clinton administration also insisted on construing the rules so that eviction could be initiated “without regard to the tenant’s knowledge of the drug-related criminal activity.” That meant that even though a tenant may have had no idea a crime was being committed, they could be evicted anyway. Tenants were not only responsible for their own acts, but also those of their guests, including things the tenant did not know about and had no way to know. When an appeals court finally overturned this policy after Clinton left office, it noted the senselessness of punishing people for crimes they had no knowledge of. After all, “imposing the threat of eviction on an innocent tenant who has already taken all reasonable steps to prevent third-party drug activity could not have a deterrent effect because the tenant would have already done all that tenant could do to prevent the third-party drug activity.” Yet even though this policy was both unhelpful and unfair, the Clinton administration went to court to defend it, insisting upon the right to evict people for offenses of which they were unaware. The stepped-up enforcement meant that there were plenty of cases like that of Ann Greene. There, was, for example, sixty-three-year-old Oakland public housing resident Pearlie Rucker, who lived with a mentally disabled daughter, two grandchildren, and one great-granddaughter. The Oakland housing authority sought to evict her “because her daughter was found in possession of cocaine three blocks from the apartment” even though “Rucker [had regularly searched] her daughter’s room for evidence of alcohol and drug use and … never found any evidence or observed any sign of drug use by her daughter.” Also in Oakland was seventy-one-year-old Willie Lee, who had resided in public housing for over twenty-five years. When Lee’s grandson, who lived with him, was caught smoking marijuana in the parking lot, the housing authority moved to evict Lee.", "url": "https://www.jacobinmag.com/2016/09/bill-clinton-crime-hud-prisons-constitution-habeas-corpus"}