{"authors": ["Micah Uetricht", "Branko Marcetic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:11", "date_modify": "2020-05-04 19:51:11", "date_publish": "2016-12-17 00:00:00", "description": null, "filename": "2016_12_el-mozote-el-salvador-war-reagan-atlacatl-massacre_1588621871.html", "image_url": "https://images.jacobinmag.com/2016/12/17232650/el-mozote-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_12_el-mozote-el-salvador-war-reagan-atlacatl-massacre_1588621871.html", "title": "Remember El Mozote", "title_page": "Remember El Mozote", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\n“Which son of a bitch says that?” It was December 11, 1981 in El Mozote, a small town in El Salvador, and the major wanted to know which one of his men had refused to kill the children. The military had just spent an entire day murdering its hundreds of inhabitants. Now, just the town’s kids were left. Gathered outside a schoolhouse in which a number of the children were being kept, the soldiers had had an argument. Some didn’t want to kill the kids, many of whom were under twelve years old and some of whom were infants. The major, without hesitation, walked over, scooped a little boy from a crowd of kids, flung him into the air, and speared him with a bayonet as he came back down. There was no more arguing. The boy was one of over eight hundred slaughtered that day and the next, thirty-five years ago. El Mozote was neither the first nor the last mass atrocity in El Salvador’s nightmarish civil war. The rape and murder of four US churchwomen by the National Guard, the assassination of Archbishop Oscar Romero while he held mass, the massacre of at least three hundred civilians at Sumpúl River, a similar mass killing a year later at Lempa River, the execution-style murder of six Jesuit priests, their housekeeper, and her daughter at the University of Central America — the list of horrors goes on and on, and is so long and brutal that it risks overshadowing the daily dumpings of bullet- and torture-riddled bodies of those who dared to speak out against the hard-right government on city streets and in public parks during the Salvadoran Civil War, which stretched from 1980 to 1992. The overwhelming majority of these atrocities was carried out by the Salvadoran National Guard and the death squads to which many of their soldiers and other sympathizers belonged. Their aim was to destroy the Farabundo Martí National Liberation Front (FMLN in its Spanish acronym), a coalition of leftist guerrillas with strong support throughout the country; any workers, peasants, and religious workers who sympathized with them; and any other dissenters who disagreed with the program of the corrupt, right-wing government, which could not have existed or endured without US backing. At its height, the United States was giving over $1 million a day to the Salvadoran government in various forms of training, arms, military advising, and other aid in an attempt to prevent a Sandinista-style takeover by the FMLN and its supporters. “By the late 1980s,” Walter LaFeber writes, US aid “approached 100 percent of the Salvadoran government budget.” During the war, no suppression of democracy and egregious human rights violations by El Salvador’s government went too far for the United States, particularly under Ronald Reagan. Every murder of civilians, every rape, every execution of leftist-sympathizing clergy, every mass killing of innocents was justified by a zealous anticommunism that sought to maintain crushing levels of poverty and wealth and political power in the hands of a tiny, brutal, US-friendly elite with no popular support but the full backing of American power behind it. The El Mozote Massacre was unique in the sheer number of innocent lives lost, and perhaps for the wanton brutality exhibited during it. It should be remembered for these reasons. But it should also be remembered because it was not unique. Quantitatively, it was the largest atrocity committed in El Salvador during the civil war and one of the worst in the history of the Americas; qualitatively, it was of a piece with US policy of tacitly encouraging or looking askance at such acts, then covering them up. Over eight hundred innocent men, women, and children were slaughtered over two days at El Mozote and surrounding hamlets. Not only was the loss of these lives not enough to convince the United States to change its brutal course in El Salvador, but the Right sprang into action to downplay the massacre and attack the journalists who first reported it.\nOperation Rescue The killings, which are most clearly laid out in Mark Danner’s The Massacre at El Mozote, an expanded version of a New Yorker article, came during Operation Rescue, an eleven-day scorched-earth operation aimed at the La Guacamaya region, just south of El Mozote and the location of the command post of the People’s Revolutionary Army (ERP), Morazán’s leading guerrilla group and one of the five members of the FMLN. La Gaucamaya also happened to be home to Radio Venceremos, an underground radio station that specialized in spreading guerrilla propaganda, reporting on guerrilla and social-movement organizing, and merciless mockery of the government. The station enraged the Salvadoran military. Lieutenant Colonel Domingo Monterrosa Barrios, the commander of the Atlacatl battalion unit which carried out the operation, said that “so long as we don’t finish off this Radio Venceremos, we’ll always have a scorpion up our ass.” Atlacatl was trained and equipped by the US government. Monterrosa himself had spent some of his early years attending courses at the School of the Americas, which has long churned out Latin American soldiers responsible for subsequent human-rights abuses and coups throughout the hemisphere. The battalion landed in Perquín, Morazan, on December 8 and, after recruiting ten locals against their will as guides, began moving southward. Along the way, the more than one-thousand-strong battalion killed seven men in a nearby village whose names matched a list of suspects while aircrafts bombed the hillsides around El Mozote. At one point, bombs fell close to the town and damaged its school. It was the kind of situation that might have prompted people to flee the town and escape what appeared to be almost certain, approaching death. The guerrillas, who themselves were packing up and escaping in advance of the operation — including Radio Venceremos, whose members lugged heavy radio equipment as they fled — tried to warn some townspeople to join them. But the locals had every reason to stay in El Mozote. Days before, Marcos Díaz, the owner of the town’s general store, had been informed by an officer about the coming operation, and told that while anyone found in El Mozote would be spared, those outside would not. Later, speaking to a gathering of hundreds of townspeople, Díaz — who was the richest man in town and well-respected — put his reputation at stake, insisting that nobody leave. Most did not. Upon hearing this news, many inhabitants of the surrounding towns made the trek up to El Mozote, seeking refuge. Beyond this, however, it was inconceivable that El Mozote would become a target of government forces. The guerrillas had never been able to establish a foothold in this town of mostly Protestant evangelicals, who tended to look sourly on communism. Many townspeople also likely reasoned that their odds would be better staying in a town without guerrillas than to be caught somewhere else with them, which would almost certainly result in death. So it was that hundreds of people were sheltering in the town when the soldiers arrived on the evening of December 10 (coincidentally, the forty-third anniversary of the adoption of the Universal Declaration of Human Rights). The battalion wasted no time. Marching into its deserted streets, soldiers banged on the doors, ordering the inhabitants out. They did not find any guerrillas or the equipment for Radio Venceremos. Shouting and pushing, the hundreds of Atlacatl members gathered the people into the street, some carrying infants or holding onto children, and ordered them to lie face down. The gathered prisoners laid in the street for an hour while soldiers walked up and down, hitting and kicking the civilians, pointing their rifles at them and bellowing insults and questions amid the children’s crying. When Marcos Dìaz protested that he had been assured no harm would come to the town, he was met with laughter from the soldiers. The soldiers then began collecting jewelry and other valuables from the townspeople, before sending them back into their homes, warning them against showing “even so much of their noses.” According to Danner’s account, the soldiers knew there were no guerrillas among the townspeople. By this point, there were no longer any lists of suspects. Rather, their aim — at least to begin with — was to interrogate the townspeople and find out how the guerrillas were transporting their supplies and where they were getting their weapons. The townspeople had no such information. At 5 AM the next day, before the sun had risen, the soldiers again pulled the sleepless townspeople from their houses, pushing them with their rifle butts, and made them form two lines: one for the women and children, another for the men. After standing for hours, the women were sent to the house of a local merchant while the men were taken to the local Church of the Three Kings. According to the Tutela Legal report later produced on the atrocity, even the soldiers didn’t know what was to come next. Monterrosa called a meeting with several other high-ranking officers, after which they gave an order: exterminate the people. All of them. The thirty to forty men of the third section of the Fifth Company, under Lieutenant Salvador Augusto Guzmán Parada, were helicoptered in, while the rest of the battalion was withdrawn and forbidden from entering the town without authorization. It took the soldiers just one hour to “interrogate” the men before the killing started. Around 8 AM, the soldiers started decapitating the men with their machetes inside the church, where the men lay face down on the dirt floor. They then dragged the headless bodies to the church’s convent to pile them up. Soon, however, they switched to taking the men out in groups of around four each, blindfolded and their hands tied behind their backs, marching them out to the forests, ordering them to lie on the ground, and then shooting them in their heads. Rufina Amaya, the massacre’s sole survivor, recalled to Danner seeing her husband led out in one of the first groups. She and her son watched as he and another man were gunned down while trying to escape, then beheaded as they lay dying. After this, there was no illusion about what was taking place. Terror and hysteria filled the house where the women and children were kept, as they watched groups of men march out into the woods, then disappear, followed by screaming and begging, then gunfire, and, finally, silence. At noon, a group of soldiers entered the house and informed the women it was their “turn.” The men had already been released, the soldiers explained, and now the women would be led out in groups and set free to do what they wished. They started picking out and removing the older girls and younger women, some as young as ten, hitting the mothers who clung onto the girls with their rifles. Soon after, those left in the house could hear the screams of their daughters coming from the hills as the soldiers took turns repeatedly raping them over the next eighteen hours, before killing them. One of the guides told Danner that the soldiers would emerge from the forest joking about their fondness for the twelve-year-olds. While this was going on, the soldiers began taking the women out in groups of around twenty. Instead of setting them free, they murdered them just as they had the men. After a while, terrified children and crying infants were all that remained in the house. Other soldiers were piling up the bodies in some of the town’s houses, then setting them alight. Those who had opted to leave the town and hide in the hills later reported seeing plumes of smoke rising from the town, wafting up along with the scent of burning meat. Rufina was led out in one of the last groups, and managed to get away in the midst of confusion when the woman at the head of her group spotted the corpses in one of the burning houses and started screaming that the soldiers were killing people. The other women began begging and resisting the soldiers. Rufina, at the back, dropped to her knees and begged God for forgiveness. When the soldier behind her went up to help the others with the women at the front, she crawled between a pine and crab-apple tree, unseen, fifteen feet away from the house they were being led into. That evening, the soldiers looted Marcos Dìaz’s store, quenching their thirst with sodas. Then, they turned to the children. Apart from the girls, whose screams could still be heard coming from the hills, they were the only ones still alive. The soldiers entered the house and began slashing the children with machetes, breaking their skulls with their rifles and choking them to death. The youngest children were crammed into the church’s convent, where the soldiers unloaded their rifles into them. Around thirty more children were killed in the morning, when the soldiers went from house to house, collecting those who had missed out on the carnage. These children, some as young as two years old, had their throats cut or were hung from the trees. Rufina, who was still lying undiscovered between the pine and crab-apple trees, had four of her children in the house, including an eight-month-old daughter. She could hear the screams of her children, crying out for her as they were killed. She crawled across the road underneath a barbed-wire fence, hid in a patch of maguey, and dug a small hole for her to bury her face into and cry. Later, after very nearly being discovered by a soldier, she crawled away and was found days later by the FMLN, the sole surviving eyewitness to the massacre. The soldiers set fire to every building that contained the bodies of the dead or in which they had been killed. They also killed the animals and burned the town’s crops. Over the course of a day’s work, they had slain more than eight hundred people, half of whom had come from El Mozote. More than 40 percent of the dead were younger than ten years old.\nReagan’s Response Word of the massacre soon spread beyond El Mozote. Several weeks after the killings ended, the guerrillas made contact with Raymond Bonner of the New York Times and invited him to Morazán, where he arrived with Susan Meiselas, a photographer, on January 3. The Washington Post’s Alma Guillermoprieto would get there several days later. Both spent days hiking through the mountains before reaching El Mozote; Bonner and Meiselas arrived on January 6. “My strongest memory,” Meiselas told Danner, “was this grouping of evangelicals, fourteen of them, who had come together thinking their faith would protect them. They were strewn across the earth next to this cornfield, and you could see on their faces the horror of what had happened to them.” The reporters had more grotesque stories than they knew what to do with. “We started smelling it from Arambala,” Guillermoprieto told Danner, referring to a municipality near El Mozote. The most traumatizing thing was looking at these little houses where whole families had been blown away — these recognizable human beings, in their little dresses, just lying there mummifying in the sun. We walked . . . to the center of town, where there was [a sacristy], and, in it, a stupefying number of bones. There was a charred wooden beam lying on top of the bodies, and there were bones sticking up, and pieces of flesh. You could see vertebrae and femurs sticking out. No attempt had been made to bury the bodies. Both Guillermoprieto and Bonner published front-page stories detailing the massacre on January 26 — based in large part on their interviews with Rufina Amaya. The two had been the first reporters on the scene, where it was immediately clear that scores had been killed — most of the decaying bodies were still lying about. The guerrillas put the number slain at seven hundred, though it was impossible at the time for anyone to obtain an accurate count. Even if that figure was exaggerated, the number of victims clearly totaled in the hundreds. El Mozote had become a slaughterhouse, and Bonner and Guillermoprieto — and Amaya — had told the world. But the Reagan administration was not happy with their reporting. Human rights atrocities like the rape and murder of the American nuns and the assassination of Romero had grabbed headlines and raised questions about what the United States was doing in the country — whether American aid was bankrolling widespread, indiscriminate, unjustifiable slaughter in its supposed attempts to fight Communism. In response to outcry from the burgeoning Central American peace movement, Congress required the administration to certify that the Salvadoran regime was making progress on upholding human rights in order to continue to receive US dollars. Reports of such a large-scale massacre in the country’s two most important newspapers suggested that such progress was not being made. Following the publication of the articles detailing the massacre, the US embassy sent an official, Todd Greentree, to collect evidence at El Mozote for their own report on the incident. At the time, the human rights certification was being discussed in Congress; Greentree openly admitted to Danner years later, “The primary policy objective at the time was to get the certification through” — apparently no matter what the human rights situation was like on the ground. Greentree and Major John McKay of the defense attaché’s office received briefings from Salvadoran officers, who predictably denied any massacre. The two Americans then attempted to examine the areas where the massacre had taken place, but they were in hostile territory under guerrilla control. When their helicopter attempted to land near El Mozote, they came under fire. They eventually interviewed some inhabitants of a refugee camp in the nearby municipality of Gotera, but were accompanied by Salvadoran soldiers, making honest and open discussion impossible. Though Greentree could sense terror on the part of some refugees and received a strange silence from the soldiers he interviewed, leading him to tell Danner that while it was clear “something bad had happened,” he could not secure an exact story. Greentree and two other Americans attempted to convince some soldiers to take them into El Mozote, but halfway there, the soldiers refused to go any further. The official US investigation into the massacre at El Mozote never actually made it into El Mozote and did not speak to Rufina. That didn’t stop Greentree from writing a cable, eventually sent under Ambassador Hinton’s name and then used in testimony to Congress, that cast doubt upon and downplayed the reports of mass slaughter, despite Greentree’s later admission that his account was shaped almost entirely by Salvadoran army accounts — the very army, of course, that was desperate to keep open the spigot of money and support from Washington to maintain the brutal war against the FMLN. After Danner questioned Greentree at length about the cable, Greentree eventually admitted the cable “wasn’t a satisfactory account” and implied, perhaps unwittingly, that he distorted the truth in the cable to serve US strategic aims in the region. The admission surely made for shocking reading when Danner’s article was first published, in 1993. But by then Greentree’s cable had long accomplished its task for the Reagan administration: throw enough doubt onto the accounts of the massacre to dismiss Bonner and Guillermoprieto’s reporting and ensure that the US could continue funding wholesale slaughter in the country. “[T]he cable supplied to officials in the State Department a number of arguments that they might find useful in impeaching the press accounts of El Mozote — deeply misleading arguments that would form the basis of the government’s effort to discredit the reports of the massacre,” Danner wrote. Two days after the cable arrived, Assistant Secretary of State for Inter-American Affairs Thomas Enders went in front of a House subcommittee to make the Reagan administration’s case for continued funding of the far-right Salvadoran regime. El Mozote was on everyone’s minds, and Enders masterfully obfuscated the facts of the massacre and the broader human rights situation in El Salvador. Dishonestly, he stated that there weren’t even as many residents in El Mozote as the Post and Times reports suggested were murdered (both articles made clear that the massacre took place in El Mozote and a number of surrounding hamlets), that the US investigation had not led to any evidence of a massacre, and that Bonner and Guillermoprieto were parroting guerrilla propaganda. “The [human rights improvements] are slow in coming . . . But they are coming,” he told the subcommittee. Evidence of the massacre brushed aside, Congress soon voted to affirm that progress and thus keep the Salvadoran killing machine humming.\nMedia Apologists Guillermoprieto and Bonner’s respective reportage on the slaughter of hundreds of civilians had failed to force an end to US support for a brutal regime. But maintaining their Central American intervention wasn’t enough for the US right. The reporters, and Bonner in particular, had to be punished for exposing what they had seen in El Mozote. Danner writes that “Bonner and his ‘credulity’ had become a minor cause célebre in the press and on the television talk shows.” The Wall Street Journal wrote a long editorial on February 10 that spent several paragraphs attacking Bonner and Guillermoprieto. “There is such a thing as being overly credulous,” the piece read. A coauthor of the editorial, George Melloan, told a reporter that “obviously Ray Bonner has a political orientation” to his coverage. A right-wing newsletter cited by the Journal, Accuracy in Media, accused Bonner of playing a role in “a propaganda war favoring the Marxist guerrillas.” Six months after the editorial, the New York Times removed Bonner from Central America. The paper’s executive editor at the time, A. M. Rosenthal, denied that he had pulled Bonner because of pressure from the Right. Whether or not this is true (in interviews both recent and at the time, Bonner claims he doesn’t think it is), Danner wrote that the decision had a major impact on the way the paper covered the Salvadoran Civil War: “The New York Times editors appeared to have ‘caved’ to government pressure, and the Administration seemed to have succeeded in its campaign to have a troublesome reporter — the most dogged and influential in El Salvador — pulled off the beat.” Bonner went on to write a book, Weakness and Deceit: America in El Salvador’s Dirty War, which came out in 1984 and was republished this year. The reader quickly understands why the Right sought to make Bonner a target: he was a meticulous reporter who unflinchingly reported on the US-trained and -funded barbarity that was overtaking the country, while also prying scores of documents out of the American government’s hands through Freedom of Information Act requests and convincing his US contacts in the country to covertly provide him with numerous, damning documents that the State Department refused to give him. Bonner assembled a dense record of brutality in writing the book — and no doubt would have exposed even more had he stayed on the Salvadoran Civil War beat until the conflict’s conclusion in 1992. Few today would deny that the massacre took place, that somewhere around eight hundred civilians were killed, and that the Atlacatl battalion carried it out. But that vindication is little comeuppance for the activists whose corpses continued to show up on San Salvador’s streets; or the six Jesuit priests and their housekeeper and her daughter who were executed at the University of Central America; or the tens of thousands throughout the country who were murdered and the hundreds of thousands who were displaced — all in the years following El Mozote. Bonner and Guillermoprieto were eventually vindicated, and Rufina spent the rest of her life telling the world what had happened at El Mozote. But their reporting and Rufina’s testimony couldn’t stop the United States from propping up a depraved, quasi-fascistic regime in El Salvador for nearly a dozen years, thanks in part to the government’s apologists in the US media.\nEscaping Justice The perpetrators of the killing have never faced justice. In fact, many appear to have been rewarded. Lieutenant Colonel Monterrosa is one of the clearest examples. He perished three years later in a helicopter crash. (Though different stories of his death exist, one has his obsession with crushing Radio Venceremos killing him: the FMLN lured him into a trap that led him to believe he had finally captured the guerrillas’ radio transmitter and could destroy the station. But the transmitter was actually a bomb, and exploded in mid-air.) He was given a hero’s treatment in his country and in the press. As the New York Times reported at the time, he received what was almost a state funeral, with a mass in downtown San Salvador attended not just by top military and civilian brass, but by US military advisers and the US ambassador. A priest declared him a martyr and his death a national tragedy. The Times piece itself — written in the post-Bonner era by James LeMoyne, who proved much more sympathetic to the Reagan administration’s view on El Salvador — dwelt more on his “military talents” and his representation of “the possibility of change in a traditionally corrupt and often brutal army,” while mentioning his involvement in the El Mozote Massacre only once, halfway through the article, as an example of the modern Salvadoran army’s “contradictions.” One US Embassy official told the Washington Post that his death was “a major setback for El Salvador . . . just when things seemed to be going well.” “US officials repeatedly identified Monterrosa as one of the brightest and most effective commanders, the sort of man who inspired his units to previously unheard of military success,” the Post wrote. It didn’t contain a single reference to El Mozote. A number of those involved received promotions over the following decade. Captain Walter Oswaldo Salazar — who, according to Danner, berated his men after the operation for questioning what they had done (“Goddamnit, if I order you to kill your mother, that is just what you’re going to do”), and justified the decision to kill the children on the basis that “they’ll just grow up to be guerrillas” — became a lieutenant colonel. Major Natividad de Jesus Caceres Cabrera — the man who had tossed and impaled the little boy at his troops’ reluctance to kill children — became a colonel. Attempts to obtain justice received their greatest setback in the form of 1993’s General Amnesty Law, which shielded the perpetrators of all crimes during the Salvadoran Civil War, both guerrillas and soldiers, from accountability. While the blanket amnesty sounds “balanced” on its face, the fact that the overwhelming majority of killings and atrocities were carried out by the government meant that the government was the principal beneficiary of the provision. The law passed just five days after a truth commission published its report on the conflict, finding evidence of widespread human rights abuses. But things are changing in El Salvador. In 2012, in a tearful speech, then-president Mauricio Funes of the FMLN (which is now one of the country’s two major political parties) apologized for what was done in El Mozote, one month after asking for forgiveness for the massacre and three years after apologizing for civil war–era crimes more generally. And earlier this year, the country’s Supreme Court struck down the Amnesty Law as unconstitutional, opening the door to bringing those perpetrators who are still alive to justice. In October, a judge ordered the El Mozote case reopened, calling for military and other records to be turned over and, eventually, for a public hearing to be held. Those guilty of crimes will not face jail terms, however. Rather, the goal is to get a full, accurate accounting of decision-making behind the massacre, and for perpetrators to admit their roles and ask forgiveness. This builds on earlier efforts to hold the guilty accountable. In January of this year, former general José Guillermo García-Merino, who had served as defense minister from 1979 to 1983, was deported from Florida. García-Merino had not only been involved in atrocities, but had blocked investigations into a number of atrocities — including at El Mozote. He had lived in Plantation, Florida since 1989, when the first Bush administration had granted him political asylum. Prior to this, in 2002, a US court in Florida ordered García-Merino to pay $55 million to three Salvadoran citizens tortured under his watch. Most of those involved in El Mozote have managed to escape legal repercussions for their actions. But efforts like these may help ensure they don’t escape the judgement of history.", "url": "https://jacobinmag.com/2016/12/el-mozote-el-salvador-war-reagan-atlacatl-massacre"}