{"authors": ["Brian Christopherson Lincoln Journal Star"], "date_download": "2020-05-04 20:12:11", "date_modify": "2020-05-04 20:12:11", "date_publish": "2016-10-28 01:43:00", "description": "LINCOLN — There can be a balance to it, knowing those occasions when to live for another down and not force the issue, always mindful of field position. \"It will be, I think, a very...", "filename": "_dac5770ea47d4ec3a51e8b36eb6514bc_1588623131.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dac5770ea47d4ec3a51e8b36eb6514bc_1588623131.html", "title": "Riley says Huskers must be aggressive on offense", "title_page": "Riley says Huskers must be aggressive on offense", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN — There can be a balance to it, knowing those occasions when to live for another down and not force the issue, always mindful of field position.\n“It will be, I think, a very important field-position game, for sure,” Husker coach Mike Riley said after Thursday’s practice. “Their defense has been very stingy, so when we get good field position we have to get some points. We have to make them pay. And then the longer we make them drive, obviously the better for us.”\nBut let it be clear: Riley wants his offense to be on the attack Saturday night against a Wisconsin defense that ranks fourth nationally in points allowed (14.3 per game).\n“On the other side of it, which kind of talks out of both sides of my mouth, we have to be aggressive, we have to get some big plays,” he said. “I think big plays could be a deciding factor in this game, because it flips field position, whether it’s special teams or offense.”\nSpace for DPE: In regard to special teams, Riley has expressed hope about punt returner De’Mornay Pierson-El getting more space to work. He has 109 yards on 11 returns, a return average that places him 28th in the country.\nWhile Nebraska’s net-punting woes have been well-documented here — the Huskers are 128th out of 128 among FBS teams — Wisconsin isn’t much better, ranking 119th.\n“I hope we’ve made some strides that way. It will only come out in the ballgame,” Riley said of freeing up Pierson-El. “You need a little bit of luck. You need the right kind of punt. And then with the right timing of giving some room, and then we’ll see how we do. That is a definite goal, and hopefully something we’ve made some strides in, and make it come alive in a game.”\nEmbracing road challenge: Riley knows the crowd noise will be significant Saturday night.\nHe also believes the Huskers will handle it the right way. “I don’t think we’ll let that be the deciding factor in the game.”\nNU once again practiced with artificial crowd noise pumped into Memorial Stadium on Thursday.\n“I think our best teams on the road have been teams that really had tremendous confidence and kind of embraced the idea of being on the road.” Riley said. “They enjoyed going into another ballpark and beating another team and were not in any way intimidated by crowd, environment, noise, whatever it might be.\n“I have great faith that this team is like that.”\nHe feels his team has handled the practice noise “pretty good” this week, though there were some false starts up until Thursday’s workout.\nCarter’s progress: There are no late surprises on the injury front.\nJunior tight end Cethan Carter (elbow) is still out as expected, set to miss his third game after being injured against Illinois on Oct. 1.\n“He is running. Doing a little bit of lifting — not with his arms as much as his legs,” Riley said. “And he has worked against the bags a little bit blocking. Caught a few balls. So he’s coming back. We won’t know for a few days if he’ll be available for Ohio State or not.”\nRiley expressed some optimism about the health of his beat-up O-linemen. “It appears our tackles are feeling better,” he said of Nick Gates and David Knevel, who have battled ankle injuries.\nThe coach also said running back Devine Ozigbo, who has carried the ball just once in the past two games, has felt better through the week.\n“So I think we’re pretty stable that way,” he said of the injuries.\nJunior safety Kieron Williams did go home to Louisiana for personal reasons and missed the past two practices, but will rejoin the team Friday morning and be ready to play.\nGet some sleep: For a big game, it’s not easy to keep your team from bouncing off walls while waiting for a 6 p.m. game.\n“I’ve thought about this game in particular that way,” Riley said. “It will be a long wait for a much-anticipated game. I hope they sleep in well. That would be great. Then it won’t seem so long.”\nRemembering 2011: Riley has coached a team at Camp Randall Stadium before. In 2011, he took Oregon State there to play a Wisconsin team that lost only two games and won the Rose Bowl that year.\nThe Badgers beat the Beavers 35-0 early in the season.\n“Oh, my gosh, it was horrible,” Riley said. “Russell Wilson, it was like the coming-out party for him. ... I remember a great atmosphere. It was a great college football day. They were a good team.”\nStat to know: While time of possession can sometimes be overrated, it’s worth noting both teams are used to owning the football a lot.\nWisconsin is 10th nationally in time of possession (34:25 per game) and Nebraska 12th (34:15).\nQuotable: On whether he senses a little more buzz around his team to play Wisconsin, Riley said, “I can’t make it overly dramatic because I don’t think it is. I think this team likes playing (every week) and getting ready to play, but there might be a little bit more of a buzz right now.”", "url": "https://apnews.com/dac5770ea47d4ec3a51e8b36eb6514bc"}