{"authors": ["Maunette Loeks Digital News Editor Mloeks Starherald.Com"], "date_download": "2020-05-04 20:08:39", "date_modify": "2020-05-04 20:08:39", "date_publish": "2016-10-27 18:00:00", "description": "A Scottsbluff man has been charged with illegally possessing weapons in violation of a protection order. According to an affidavit filed in Scotts Bluff County Court, police had received...", "filename": "_982cdcbad2504ddc8612e02dddd74d4d_1588622919.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_982cdcbad2504ddc8612e02dddd74d4d_1588622919.html", "title": "Scottsbluff man charged with illegal possession of firearms", "title_page": "Scottsbluff man charged with illegal possession of firearms", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Scottsbluff man has been charged with illegally possessing weapons in violation of a protection order.\nAccording to an affidavit filed in Scotts Bluff County Court, police had received information that Joseluis A. Arellano, alias Jose Arellano, had purchased eight handguns on Oct. 11 and Oct. 12 from a local handgun dealer. Arellano has an active protection order that prevents him from purchasing a firearm.\nThe protection order was confirmed to be valid and a search warrant was issued for Arellano’s home. Inside Arellano’s home, officers seized ten handguns, two shotguns and three rifles. Authorities also allegedly seized a baggie of suspected methamphetamine and two pipes with suspected methamphetamine residue.\nArellano has been charged with eight counts of being a felon in possession of a firearm, a Class ID felony; one count of possession of a controlled substance, a Class IV felony; and possession of drug paraphernalia, an infraction.\nHe is scheduled to appear in court for arraignment on Friday, having posted a $26,000 bond to be released from jail.", "url": "https://apnews.com/982cdcbad2504ddc8612e02dddd74d4d"}