{"authors": ["Jedediah Britton-Purdy", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:39", "date_modify": "2020-05-04 19:54:39", "date_publish": "2016-11-17 00:00:00", "description": null, "filename": "2016_11_donald-trump-election-polls-whites-working-class_1588622079.html", "image_url": "https://images.jacobinmag.com/2016/11/17232016/PA-trump-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_11_donald-trump-election-polls-whites-working-class_1588622079.html", "title": "How Trump Won", "title_page": "How Trump Won", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn an election this close — which, it should be noted, was actually a win for the Democrats under an honest popular-vote system rather than the anachronistic and indefensible Electoral College — many things made the difference. Voter suppression in Wisconsin might have been enough. FBI director James Comey’s eleventh-hour letter almost certainly was. But something big seems to have happened, if exit polls are reliable (which is, you can’t say too many times, a big “if”): The parties swapped a chunk of their class constituencies. More poor and lower-middle-class people voted Republican in this election than the last. More upper-middle-class and rich people voted Democrat. And union voters abandoned the Democrats dramatically. Exit polls are frequently unreliable, and we need to be cautious in drawing on them. But they also aren’t useless. Comparing CNN 2016 exit poll data with Roper Center data from 2012, we see some very important changes. Obama won only voters with household incomes under $50,000, but he did it overwhelmingly, 60–38, and lost all higher-income groups — a class warrior after all! Clinton won those lower-income voters by only 52–41. So yes, she won, but with an eleven-point decline in the Democrats’ advantage. For voters with household incomes between $50,000 and $100,000, the numbers change very little: 46–50 for Obama, 46–52 for Clinton. But go over $100,000, and things get interesting again. Romney won those well-off voters handily, 54–44, as Republicans generally do. Trump barely hung on at about 48–47. That’s a nine-point gain for the Democrats. Clinton was much weaker than Obama with union-household voters: he won them 58–40, she only 51–43. That’s a ten-point loss. None of the other big demographic numbers are nearly as dramatic. Some are questionable — results showing Trump doing better among Latinos than Romney, for instance, are hard to square with Clinton’s outperforming Obama in counties with heavy Latino populations. And a Spanish-language exit poll shows stronger Latino support for Clinton than the CNN numbers. But the interesting number is the finding that Trump did about the same as Romney among white voters: 58–37 for Trump versus 59–39 for Romney. Trump didn’t attract more of them than Romney, but based on the income results, he does seem to have attracted different ones — specifically voters the Democrats have relied on in the past. What about gender? According to the exit polls, Romney beat Obama 52–45 among men, while Trump beat Clinton 53–41. Obama beat Romney 55–44 among women, and Clinton got 54–42 among them — about the same as Obama. Clinton seems to have lost some non-Republican male voters to Libertarian candidate Gary Johnson, but not much else changed. So it’s true that white people and men — especially white men — elected Trump. But they did not support him in meaningfully greater numbers than they did Romney. That wasn’t what was distinctive in Trump’s victory. What does this all mean? The numbers are compatible with at least three explanations, each with some plausibility and anecdotal support and with very different valence.\n1. Race, but this is complicated This scenario turns on a class-differentiated response to Trump’s racial and nationalist identity politics. It’s awkward at the very best to claim that voters who supported Trump after supporting Obama were motivated by simple, dug-in racism. But Trump’s campaign made race salient in a distinctive way, which neither Romney nor McCain ever did, and may have sounded a bell of white identity politics that simply no one had rung before him. It may both have driven away richer voters and attracted poorer whites. 2. Economics The scenario rests on lower-income and union voters developing a post-2008 sense of economic abandonment by the Democrats based on how the party has actually governed in recent years, including both the trade agreements like the Trans-Pacific Partnership and NAFTA and a finance industry that it strongly embraces. It was activated by Trump’s disingenuous but effective economic populism, the highlighting of Clinton’s relations to Wall Street, and the Obama-Clinton administrations’ trade deals. As with race, Trump made these issues salient in ways that no one did in 2008 or 2012. 3. Credibility and media This one is less about the class-or-race dyad and instead about a more personal and contingent sense of the candidates’ respective credibility. Clinton’s numbers went down hard after FBI director James Comey’s letter announcing sort-of new emails connected with her private server. Maybe this mattered a lot more to the voters who peeled off to Trump. For people in the Fox/Breitbart right-wing information ecosystems, Trump exaggerates sometimes, but Clinton is a liar and crook. A chunk of those voters are working people who, fifty years ago, might have been getting their basic political information from a union, and are now getting it from a conspiracy-minded far right that convinced them they had a civic duty to vote against the corrupt liar in the race.", "url": "https://www.jacobinmag.com/2016/11/donald-trump-election-polls-whites-working-class"}