{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:28:59", "date_modify": "2020-05-04 20:28:59", "date_publish": "2016-11-25 15:19:00", "description": "Seems there are always the haves and the have-nots. With Tennessee’s statewide duck season set to open Saturday, a lack of water in some areas across the Volunteer State has quite a few duck...", "filename": "_336b63e212064243bb62d1a476191d6d_1588624139.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_336b63e212064243bb62d1a476191d6d_1588624139.html", "title": "Duck opener could be feast or famine", "title_page": "Duck opener could be feast or famine", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Seems there are always the haves and the have-nots.\nWith Tennessee’s statewide duck season set to open Saturday, a lack of water in some areas across the Volunteer State has quite a few duck hunters riding high and dry.\nWhere there’s water, there are ducks. At least that’s the scenario for most of the region, but unfortunately, some wildlife management areas are below normal pool levels due to the extended drought. As a result, some blinds are not accessible, and those hunters will not get the season off to a very good start.\nOthers are excited and chomping at the bit to get the show going. Several ducks entered the area the last few weeks despite an extended spell of above average temperatures.\nDue to lingering drought conditions, the ducks are concentrated into areas where food and water are present. That may be great if you have a blind in such an area, have access by boat or are willing to wade shallow backwaters to reach slash water.\nIt has been an unusual year, and the strange weather patterns have lingered through late fall. Above normal temperatures have dominated the scene for several months, accompanied by a drought that’s stubborn to loosen its grip.\nAll across West Tennessee, popular hunting areas are in need of rain and runoff. Some private hunt clubs have been able to pump up grain fields. However, most are hurting for water with some very disappointed duck hunters sweating it out in a dust bowl.\nSooner or later, the rains will come. However, that doesn’t do much to soothe the pain when your personal blind or hunting spot doesn’t have water and you don’t have a place to hunt.\nKentucky Lake has been at or below winter pool for the last couple of months. When the reservoir is low, it has a negative impact on several of Tennessee Wildlife Resources Agency’s wildlife management areas that rely on gravity to help flow water into the units.\n“We need rain in most of our units with the exception of Dover, where levels reached normal pool at midweek after our pumping efforts,” said TWRA area manager Ronnie Cole. “Several popular areas are hurting for water such as Camden bottoms, where levels there were about one and a half feet below normal. Big Sandy is about sixteen inches below normal, and Gin Creek is about a foot shy.\n“West Sandy is about two feet below normal. We just haven’t had enough rain this fall to fill the areas like it normally does.”\nWhile low water is playing havoc with some waterfowlers’ opening day plans, there are some duck hunters who will benefit from the dilemma of others.\n“Dover Bottoms has a lot of ducks using it and so does Gin Creek, Big Sandy, Camden Bottoms and West Sandy,” Cole said. “Some blinds will do very well, as ducks have flocked to what little water is available.”\nRain was falling at midweek, but the forecast did not paint a picture of heavy downpours, which is what waterfowlers across Middle and West Tennessee were hoping for. This area isn’t alone as to its thirst. Arkansas, Missouri and western Kentucky were also hurting for water in popular hunting areas.\nMeanwhile, there’s always water on Kentucky Lake, and in times past, drought conditions worked in favor of the open water. But this year, things are different. A lack of aquatic vegetation has proven to be a high hurdle to climb this year for both anglers and early season waterfowlers.\nWithout the grass beds, ducks don’t have much reason to hang around the open water mudflats and backwaters except to use them for resting areas. The vegetation in times past has been the salvation for the early season duck hunters on Kentucky Lake, as it provided good food sources for early arriving species such as greenwing teal, gadwall, wood ducks, shovelers and a few other puddle ducks such as pintails and mallards.\nNot many members of the diving duck family have arrived just yet. There are a few buffleheads, but not many scaup or ringnecks are here just yet. Odds are not in favor of good hunting on the open water, but things could change once all the activity stirs up what ducks are here.\nSo opening day this year could be great for a small percentage of blinds that are fortunate to have enough water sufficient to float decoys.\nSome blinds have the potential to have a banner opening day. The haves and have-nots. Seems very few hunters have it good all year, and some of the ones who stand to have a great opener may be the ones on the short end of the stick later in the season when cold weather descends and ice enters the picture.\nWater giveth, and it taketh away!\nReady or not, the season opens Saturday for a two-day segment. After that, hunters have a five-day closure before the second segment opens on Dec. 3 for a 58-day straight stretch. Tennessee’s statewide season ends Jan. 29, 2017.\nYoungsters will get an extended season with two special youth hunts slated for Feb. 4 and 11. Each year, kids get two separate Saturday hunts once the regular season ends.\nSTEVE McCADAMS is The Post-Intelligencer’s outdoors writer. His email address is stevemc@charter.net.", "url": "https://apnews.com/336b63e212064243bb62d1a476191d6d"}