{"authors": ["Catherine Dominguez"], "date_download": "2020-05-04 20:08:17", "date_modify": "2020-05-04 20:08:17", "date_publish": "2016-09-02 17:47:00", "description": "Montgomery County Judge Craig Doyal was all smiles – shaking hands and hugging everyone, including the bailiff – as he entered the courtroom Friday morning for an arraignment hearing involving the...", "filename": "_8f9b316df98b45bbb9b2d2cd4de17de6_1588622897.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8f9b316df98b45bbb9b2d2cd4de17de6_1588622897.html", "title": "Trial date set for county judge, commissioners", "title_page": "Trial date set for county judge, commissioners", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Montgomery County Judge Craig Doyal was all smiles – shaking hands and hugging everyone, including the bailiff – as he entered the courtroom Friday morning for an arraignment hearing involving the Texas Open Meetings Act charges against him, two commissioners and a political consultant.\nPrecinct 2 Commissioner Charlie Riley, Precinct 4 Commissioner Jim Clark, political consultant Marc Davenport are charged with conspiracy to circumvent TOMA for their alleged involvement in negotiating the details of a $280 million road bond passed by voters in November.\nFollowing the 45-minute hearing, visiting Judge Randy Clapp, of Wharton County’s 329th state District Court, set a Nov. 7 trial date for all four. However, it is still unclear whether the cases will be tried individually or as one.\nJudge Lisa Michalk, of the 221st state District Court, recused herself from the case because the Commissioners Court funds her budget.\nChris Downey, the special prosecutor assigned to the case by former 9th state District Court Judge Kelly Case last year, said the cases probably will be combined, adding he would know more on that in early October.\n“It’s still an evolving process,” said Downey, noting the Friday hearing was simply to meet the defense attorneys and discuss a timetable to disclose evidence. “We will have much more meaningful conversation at the next court setting because the (defense attorneys) will finally have a chance … to look at the documents.”\nAccording to Downey, the case is unusual because all the evidence was gathered by a grand jury subpoena.\n“Because of that, it is shrouded in grand jury secrecy and we sought the judge’s authority to release that evidence now to the various defendants,” Downey said. “We now have to review a lot of the testimony to determine how it can be disseminated and still respect that secrecy. The law does not allow me to release everything that happened in grand jury.”\nDowney said over the next month, with guidance by the judge, he will review the testimony and more than 700 documents investigated by the grand jury and release some of that information to the attorneys for Doyal, Riley, Clark and Davenport.\nHigh-profile Houston-based attorney Rusty Hardin is representing Doyal and flanked the county judge as he strolled into the courtroom Friday morning. Conroe-based attorneys E. Tay Bond, Doug Atkinson and Steve Jackson are representing Clark, Riley and Davenport, respectively.\nHardin declined to answer questions following the hearing but said the next step is to review the evidence that will be made available from Downey.\nA Montgomery County grand jury issued the indictments June 24 after a six-month investigation into communications in August 2015 that led to commissioners approving the placement of the road bond on the November 2015 ballot.\nAn Aug. 24 Open Records request by The Courier showed dozens of emails involving the judge, certain county commissioners, Davenport and others, including members of The Woodlands-based Texas Patriots PAC, regarding the framework of the road bond.\nMany emails occurred between Aug. 11 and Aug. 21. Commissioners took no action on a November 2015 road bond at their final meeting Aug. 11 before the Aug. 24 deadline to place a referendum on the ballot. However, on Aug. 21, Doyal and Riley announced they had reached a memorandum of understanding with the Patriots PAC that opened the door for the November road bond referendum, which commissioners approved Aug. 24. The bond package did not include the controversial Woodlands Parkway extension or the Robinson Road project in Oak Ridge North.", "url": "https://apnews.com/8f9b316df98b45bbb9b2d2cd4de17de6"}