{"authors": ["Branko Marcetic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:59:27", "date_modify": "2020-05-04 19:59:27", "date_publish": "2016-11-17 00:00:00", "description": null, "filename": "2016_11_chuck-schumer-bernie-sanders-financial-industry-fundraising_1588622367.html", "image_url": "https://images.jacobinmag.com/2016/11/17232155/8641156170_dfc05c4e96_b-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_11_chuck-schumer-bernie-sanders-financial-industry-fundraising_1588622367.html", "title": "Sen. Chuck Schumer (D-Wall Street)", "title_page": "Sen. Chuck Schumer (D-Wall Street)", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Two years later, as Donald Trump prepares to enter the Oval Office, the new Senate minority leader is well-positioned to take the Democrats in a more populist direction.\nThe solution was simple. “We must convince Americans that government can be on their side and is not just a tool of special interests,” he argued. Democrats would have to make it clear “that we will make government the people’s champion, not captive to the powerful.” Paraphrasing Bill Clinton, he urged the party to “prove that the era of big corporate influence over government is over.”\nNearly two years ago, Chuck Schumer stood at the podium of the National Press Club and delivered a prescient speech . Speaking in the wake of the Democrats’ midterm election drubbing, Schumer warned of an impending political crisis that would introduce a new level of acrimony into the body politic if “middle-class decline” continued apace.\nWall Street’s Man on Capitol Hill\nSchumer was first elected to the New York State Assembly in 1974, a twenty-three year-old fresh out of Harvard Law School. He quickly staked out a position as one of the more liberal Democrats in the chamber, and occupied the same ground through the 1980s in the US House.\nDuring the 1990s, however, Schumer evolved into a self-avowed “angry centrist.” Moving with the political tide of the era, Schumer became a tough-on-crime Democrat, reversing his opposition to the death penalty and helping write the infamous 1994 crime bill that fueled mass incarceration. Running for the Senate in 1998, he claimed his Republican opponent was “not close to being as tough on crime as Chuck Schumer.”\nIt was upon entering the Senate that Schumer truly came into his own, making a name for himself doing what, more than anything else, has defined his political career: raising millions of dollars from industries whose interests he ardently defends.\nConsider some of the descriptions of Schumer and his fundraising prowess:\nA “jackhammer” for whom “‘no’ is the first step to ‘yes.’”\nAn “animal” who “would so assiduously plow through his assigned fundraising call sheets that he once ran out of prospects” and started calling numbers from the phone book at random.\n“[C]onstantly looking for new donors, and will even badger Republicans for cash.”\n“[T]he only guy who can be given a $25,000 check and say, ‘You can do a little better than that.’”\n“He’ll ask money of anyone.”\nThis 2008 account of Schumer’s fundraising approach demonstrates the kind of desperate shakedown that he’s turned into an art over his decades in office:\nDonors describe the Schumer pitch as unusually aggressive: He calls repeatedly to suggest breakfast or dinner, coffee or cocktails. He enlists intermediaries to invite prospects to events and recruits several senators to tag along. And he presses for the maximum contribution — “I need you to max out,” he is known to say — then follows up by asking that a donor’s spouse and four or five friends write checks, too.\nSchumer’s persistence has paid off. For decades, he has led the pack in corporate contributions. Between his ascension to the Senate in 1999 and his reelection in 2004, he raised $27.5 million. By 2005, he was among the top of the fundraising heap for various industries, including accounting, real estate, and commercial banks, and was the number one recipient of tobacco money. By 2008, he had received more money from the securities and investment industry than any congressman other than John Kerry. In 2009, he received 15 percent of all Wall Street donations, raising close to double that of any other senator, and five times more than any GOP senator that year.\nIt’s true that Schumer doesn’t follow the Wall Street line in every single case. He voted for the 2010 Dodd-Frank bill, for instance.\nBut throughout his career, Schumer has consistently interceded on behalf of business interests, particularly those that have filled his campaign coffers. In 2001, together with Bill Clinton’s deregulation-happy treasury secretary, Robert Rubin, and a host of other business, labor, and academic experts, Schumer formed the “Group of 35,” which used zoning laws and tax breaks to clear the way for office space and high-rise development in New York City. Three years later, he slipped a tax break into an unrelated bill that helped advance the construction of a mega-mall in Syracuse — a project developed by a donor who had given to Schumer and both parties.\nWall Street is by far the best looked after among Schumer’s business constituents. After taking $1 million from the hedge fund and private equity industry, Schumer killed Democratic efforts to double taxes on their profits, arguing the tax hike would spark an exodus of jobs from New York and the US and unfairly single out the industry. (For some perspective, the private equity industry paid out $1.1 trillion worth of profits to investors worldwide that year.)\nSchumer was also one of twenty-seven Democrats who voted against a 2010 amendment to break up too-big-to-fail banks. When Massachusetts senator Elizabeth Warren expressed concerns about appointing as vice chair of the Federal Reserve a former Citigroup executive (a bank that already had its tentacles deep inside the Obama administration), Schumer replied that “three years at Citibank, I think, should be an asset rather than a liability.”\nLast year, he proposed giving multinationals stashing profits overseas a tax break even larger than the one Obama suggested. Over the course of his career, Schumer has fought attempts to regulate credit-rating agencies, successfully halved the fees that Wall Street firms pay to the SEC, and helped repeal the Glass-Steagall Act on the basis that “we could find London or Frankfurt or years down the road Shanghai becoming the financial capital of the world.”\nSchumer has never been coy about his affinity for the financial industry. After teaming up with then–New York City mayor Michael Bloomberg in 2007 to commission a study on the future of New York’s financial industry — which concluded that less regulation on Wall Street would prevent firms from moving to London — Schumer said: “We are not going to rest until we change the rules, change the laws, and make sure that New York stays No. 1 for decades on into the future.”\nThe same year, he praised Wall Street effusively: “So much of what happens in this town is because we are the world financial sector. It helps support our museums, it provides the tax base for schools and health care. If we lose being the financial center, the rest goes down the drain.”\nAnd Wall Street loves him right back. “His knowledge and support for the industry has been consistent,” Katherine Wylde, president of the Wall Street–friendly Partnership for New York City, said in 2015. John G. Gaine, president of the Managed Funds Association, calls Schumer a “guardian of America’s capital market and, more parochially, New York’s economic interest.”\nSchumer isn’t just a prolific fundraiser for his own campaigns. After seeing him action, the Democrats put Schumer in charge of the Democratic Senatorial Campaign Committee (DSCC) in the mid-aughts. Under Schumer, the DSCC ended up accumulating nearly twice as much money as its GOP equivalent. Between 2004 and 2008, the DSCC raised a record $240 million, increasing its Wall Street donations by half.\nKenneth Gross, an attorney at the Wall Street law firm Skadden Arps, told the Financial Times in 2006 that financial institutions viewed the contributions to the DSCC as a “twofer.” “Schumer is a noted fundraiser in his own right,” he explained. “[I]f you can be responsive to a solicitation, you are really getting an extra bang for your buck.”\nAs head of the DSCC, Schumer also spent his time pushing the Democrats even further to the center. He pressed the party to avoid calling for tax increases, and instead focus on “tax enforcement” and auditing more millionaires. “That shows the pragmatism of the Democratic Party,” Schumer argued.\nAsked about revamping the 2002 Sarbanes-Oxley Act, which established reforms to improve financial disclosures and protect investors from accounting fraud, Schumer replied: “We need to re-examine the balance [between regulation and competition] in a global context. You can’t put your head in the sand.”", "url": "https://www.jacobinmag.com/2016/11/chuck-schumer-bernie-sanders-financial-industry-fundraising"}