{"authors": ["Josh Wright"], "date_download": "2020-05-04 20:22:35", "date_modify": "2020-05-04 20:22:35", "date_publish": "2016-12-30 00:00:00", "description": "MOSCOW, Idaho – Jim Hayford first described Eastern Washington’s wobbly finish on Friday night as a ship leaking water. Then he shifted analogies ever so slightly to mention how his team was...", "filename": "_549a28c1ecd0480c911633861f5d581c_1588623755.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_549a28c1ecd0480c911633861f5d581c_1588623755.html", "title": "Eagles hold off late rally by Vandals to win Big Sky opener", "title_page": "Eagles hold off late rally by Vandals to win Big Sky opener", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MOSCOW, Idaho – Jim Hayford first described Eastern Washington’s wobbly finish on Friday night as a ship leaking water. Then he shifted analogies ever so slightly to mention how his team was leaking oil during an earlier Idaho run.\nGood thing for the Eagles that they played magnificently for most of the other 30 minutes.\nEastern held off a frenzied comeback attempt from rival Idaho to pocket a 69-62 win at Cowan Spectrum in the Big Sky Conference men’s basketball opener for both teams.\nThe Eagles snapped a three-game losing streak and moved to 9-5. The Vandals (5-7, 0-1) lost for the sixth time in eight games.\nAnd they got even worse news off the court.\nCoach Don Verlin said after the game that senior point guard Perrion Callendret, Idaho’s second-leading scorer last year, is likely done for the year with a knee injury that he sustained in the second game of the season.\nWithout Callandret, junior guard Victor Sanders has shouldered much of the scoring load. And in the last 6 minutes against the Eagles, he almost singlehandedly brought Idaho back.\nSanders poured in 27 of his 32 points in the second half and scored nine consecutive points during UI’s 19-2 run in the closing minutes. The Vandals turned a 60-38 deficit into a five-point game on a Sanders jumper with 1:54 left.\nBut they got no closer.\n“I don’t know (if) a lot of Big Sky teams are going to win here, so it was a great way to start conference play,” said Hayford, Eastern’s sixth-year coach.\nEWU’s two active seniors, Jacob Wiley and Felix Von Hofe, combined for 45 points. Von Hofe supplied the clutch shots, including the dagger with 59 seconds left – a 3-pointer that extended the Eagles’ lead to 66-57.\nIt was Von Hofe’s sixth triple of the game, and it came just after Sanders missed a 3-point attempt that would have made it a one-possession game.\n“I though they did a great job of executing their offense,” Verlin said. “I thought we gave them way too many open looks there in the first half. Lost Von Hofe too many times. Gave them too many open looks, and that’s what really got us in trouble.”\nEastern had 16 turnovers in the second half, eight of which came during Idaho’s closing rally. Sanders alone had five steals in the second half. But he bemoaned the fact that Idaho had to resort to full-court pressure in the first place.\n“We shouldn’t even be in that position,” Sanders said of the 22-point hole. “Start of the game, I don’t think we came out as ready as we needed to.”\nThis was Idaho’s first game at Cowan Spectrum since the Vandals’ football team completed their 9-4 season. With students on Christmas break, the announced attendance was 1,107.\nWhether the surroundings had anything to do with it, the Vandals played with little energy or emotion for the first 25 minutes.\n“These games over break over always tough,” Verlin said. “No band. Very few cheerleaders. But that’s no excuse. You know, we had three great days of practice, so I thought we were going to play really well.”\nEastern equaled its season high with 10 blocked shots, five from Wiley. And it held Idaho to 30.5 percent shooting from the field. The Vandals went through two severe droughts: In the first half, they missed nine straight shots and after halftime, they went 1 of 12 from the field at one point.\nUI also let a few questionable calls (or non-calls) get to them. Late in the first half, Sanders griped after getting whistled for a foul on a Ty Gibson 3-point attempt. It wasn’t the first time he chirped to officials, and one of the referees motioned to the UI bench to have Sanders quiet down.\n“I felt like we fell below the line a little bit with our behavior,” Verlin said.\nAdded Sanders, “It’s part of the game, but as players we have to do a better job of ignoring the refs and ignoring the calls, and that starts with me being a leader on the team. I can’t react to bad calls or whatever and let it affect me. Don’t let them see me sweat.”", "url": "https://apnews.com/549a28c1ecd0480c911633861f5d581c"}