{"authors": ["David Taylor"], "date_download": "2020-05-04 20:12:23", "date_modify": "2020-05-04 20:12:23", "date_publish": "2016-12-05 00:35:20", "description": "Dayton has spoken. An overwhelming crowd of residents delivered their expectations and hopes to city leaders and Kendig Keast Collaborative who has been contracted by the Dayton Community...", "filename": "_24c7acc361a64723bd6d5ae7f5dcd787_1588623143.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_24c7acc361a64723bd6d5ae7f5dcd787_1588623143.html", "title": "Dayton residents speak out about their future", "title_page": "Dayton residents speak out about their future", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dayton has spoken. An overwhelming crowd of residents delivered their expectations and hopes to city leaders and Kendig Keast Collaborative who has been contracted by the Dayton Community Development Corporation and the city of Dayton to manage the growth at the city’s doorstep.\nThe unexpected turnout had officials scrambling to open a larger ballroom to accommodate the crowd that seemed to never stop coming.\nOnce the meeting got under way, Kendig Keast senior associate Luis Nunez guided the discussion and exercises meant for those present.\nThe host of residents were seated at round tables to allow for open and frank conversation and enough room to commit to paper their concerns.\nThe first exercise was intended for individuals alone and turned in within 15 minutes.\nThe second was more of a team effort and required making some lists of concerns and solutions.\nOnce the information was gathered, a team captain at each table reported to the entire group their concerns and solutions.\nWith some ideas, there was a smattering of applause while others received enthusiastic support, but the concerns and ideas for the future seemed synonymous throughout each group.\n“I liked everyone’s ideas,” said Richard Libey. “Everybody wants to keep the old and build the new. I like a mixture of both.”\nThe Dayton High School junior was one of the youngest at the meeting, but felt it important enough to encourage his dad to go to the meeting and take him.\n“I’d like to go to college and then come back to my hometown,” he said. He wanted to be an integral part of the process.\n“We’ve been planning [on coming to] this for a couple of weeks,” his dad Richard said.\nThe father and son showed up at 4:30 p.m. to get a good seat for the 6 p.m. meeting and have their voice heard.\n“It’s imperative we get this right,” his dad said.\nBusiness owners in the downtown area were happy to hear residents say they wanted to keep the downtown area vibrant, even more so than it is now.\nAdam Passarelli, who owns a barber shop on Main Street next to Country Kitchen, considered the meeting important enough to close his business early to be there.\n“The growth is coming to Dayton, no matter what,” he said.\n“We need to look to the future with our plans and decide which way we’re going to go,” he said.\nLike organizers, Passarelli was pleasantly surprised with the turnout and the content of the meeting.\n“I’d like to see another one and it was so good to see so many people participating,” the barber said.\nProbably the bravest man in the room was railroad engineer Ronnie Mahaffey.\nThe father and community volunteer in Dayton knew he might draw some ire, but residents were understanding that he has no control over the situation.\n“It sounds like everybody is pretty much on the same page with their ideas,” he said.\n“We need to fix up and revitalize downtown, we need to bring industries in, and commercial retail.”\nMahaffey echoed most of the residents’ sentiments regarding restaurants.\n“We don’t need more fast food places; we need nice, sit down restaurants where we can take our family,” he said.\nMahaffey, who also volunteers with the Dayton High School Junior ROTC program, parroted what others were also saying: “We need more things for the kids to do in Dayton!”\nOver and over, traffic was addressed, including the railroad, but Mahaffey didn’t take any offense to the comments.\n“The rail is a necessary evil,” he said. “That rail has been there 100-plus years and it isn’t going anywhere.”\nMahaffey said the railroad is considering more and more traffic and he’s heard plans for them to double-track it all the way into Houston.\nCity Manager David Douglas was smiling from ear to ear during the meeting.\n“The meeting was wonderful! It covered a lot of information and I’m just blown away by the attendance,” Douglas said. “We had a widespread cross-section of the community that voiced their concerns, and they voiced their desires and it gave us a roadmap for the future.”\nDouglas also announced an early Christmas surprise for residents.\n“A fly-way over the railroad tracks in Dayton at the Highway 90 crossing is currently being studied by the Texas Department of Transportation,” he said to the jubilant crowd.\n“TxDOT has indicated that this item has come up on their radar screen due to dangers associated with trains crossing major highways,” he said.\nDouglas also announced that the schedule for the study and initiation of actual construction is normally five (5) years.\nNunez was stunned with the results of the meeting.\n“Well, I’ve never seen attendance like this in all of my planning career,” he told the Dayton News.\n“That is unbelievable! To have 150-plus folks show up for a meeting like this says a lot about the community and it’s future, and their commitment to a quality future,” he said. “The meeting exceeded everyone’s expectations.”\n“Not just because of the attendance, but because of the quality of the feedback and the comments provided by everyone in attendance,” Nunez said.\nThe next phase will be for Kendig Keast to draft the comprehensive plan, or the so-called “Existing City Report,” which will capture a lot of the existing conditions as they are in the community.\n“That will set the foundation for the creation of the plan, or the Future City Report,” Nunez said. “In other of words, the first part of the process is to compile the research and data and the future city will be the actual plan moving forward.”", "url": "https://apnews.com/24c7acc361a64723bd6d5ae7f5dcd787"}