{"authors": ["Tom Munday", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:56", "date_modify": "2020-05-04 19:56:56", "date_publish": "2016-12-17 00:00:00", "description": null, "filename": "2016_12_fidel-castro-cuba-trump-embargo-socialism_1588622216.html", "image_url": "https://images.jacobinmag.com/2016/12/17232407/fidelistas-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_12_fidel-castro-cuba-trump-embargo-socialism_1588622216.html", "title": "Fidelistas After Fidel", "title_page": "Fidelistas After Fidel", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Emely is in her forties, living in the outer edges of central Havana. She belongs to a recent wave of upwardly mobile Cubans, economically emancipated by relaxed property and private enterprise laws.\nOf all Cubans, who talk politics far more freely than you might expect, it is precisely those of Emely’s type who are assumed to be most hostile to the government. She is after all, a member of a rising “middle class” who international pundits so confidently predict will usher about change in Havana.\nCertainly, she is critical of the government in some respects. She paints it as disorderly and fickle, prone to random policy lurches; reacting clumsily to threats real and imagined. The material situation of the country is also ripe for criticism. Smartphones, laptops, and selfie sticks appear readily available, but basic consumer goods, like toilet paper and shampoo, are often hard to come by. Realizing that fancy soaps can be coveted like precious gems gives you some sense of the mundane frustrations of daily life in the Western hemisphere’s only Communist state.\nSo when Emely raises a finger to the air and quite proudly proclaims “Soy Fidelista!” it takes me back somewhat. Until now we have skirted around the topic, mostly focusing on minor grievances and grumbles. I deliberately avoid the topic of Castro for fear of being the know-it-all, patronizing European left-winger; thoughtlessly fawning over Cuba’s socialist credentials while disregarding its often unlovely character. Yet in my desperation to avoid one pitfall I appear to have tripped into another. Emely is sincere and forceful in her attitude toward the Castro regime, the problems of which she significantly ascribes to the state of siege endured by the island for nearly sixty years.\nJorge lives in the neighborhood. He too talks freely about his general gripes and looks forward to the impending influx of Yanqui dollars. But he also relates to me a story of a son who left the country for Spain and becomes visibly upset explaining that, for a time, he was forced to sleep on the streets of Madrid. Jorge expresses exasperation at the callousness with which his son was treated. I notice in his framing as sense of “over there”: the capitalist other. It sheds some light on the state of political discourse in Cuba.\nFor all the flaws of the island state, Cubans seem proud of their system. More than just a nationalistic pride, peppered with glib nods towards their world-class health and education systems, the people I talk to exhibit a spirit of purpose in their understanding of the world. I get the distinct impression that, however flawed, the socialism of Cuba has seeped into the bones of its citizens and become a naturalized part of their identity and experience.\nWhen my conversation with Emely takes a distinctly political turn and we stumble into the vagaries of class and the class system, she takes me out onto her balcony to show to me that here too class is alive and well. The alley below snakes behind the terraces. A few houses down, a family — ten people or so — sits, conversing loudly in a concrete garden. Even from a distance they are clearly not part of Cuba’s rising middle, a fact that that Emely corroborates. Like Jorge, Emely’s framing is striking: she quite explicitly spares “the system” from blame. Class is a bug, not a feature, and one she wants to be rectified with haste. It is fascinating to listen to someone, who elsewhere would be in a prime position to consider themselves “apolitical,” understand class struggle instinctively.\nThe difference between how Cubans view their political system and how it is viewed from abroad is stark. In the West, on the one hand, Cuba is skewered as nothing more than a tropical police state, with Castro used interchangeably with Pinochet. On the other, the Communist Party has put half-century’s worth of self-aggrandizement to good use: every billboard on every highway proclaims the achievements of the nation. Lost between these two points is the nuanced experience and understanding of the Cuban people.\nCuba now stands at a crossroads. The death of Fidel has long been anticipated to be the beginning of the end. The government, in full knowledge of this, has painstakingly laid the groundwork for a much-delayed rapprochement with the United States, hoping to stabilize itself through an inevitably turbulent transition. The election of Donald Trump has only added to this instability.\nBut this potentially dramatic heightening of tensions, at a moment when the last front of Cold War finally looked to be closing, may well force Cuba into a worthwhile moment of introspection.\nAs a robust welfare state looks to be generations away in their superpower neighbor and under attack across the rest of the Western world, Cuba is afforded a brief moment of sobriety to take stock of its fortunes. When I visited earlier this year, the embrace of the United States was foreshadowed with a mix of trepidation and hope. Already I had seen American flags flying from Cuba buildings; souvenir shops most notably, no doubt looking to get ahead of the curve.\nHabanero taxi drivers I had spoken to were practicing English stock phrases. Yet many exhibited a certain hesitancy — an understanding that the route forwards would be fraught with difficulties. For one, the blockade, a great wrong committed against Cubans by their northern neighbor, weighs heavily on the national psyche and is not forgotten lightly. The Emelys and Jorges do not for a second allow themselves to believe in simple US magnanimity. They see clearly, far more so than those of us on the outside looking in, that fancier soaps could be the death of much of what they cherish about their country.\n2016 is not 1989 — there is no David Hasselhoff stand-in to bellow “Looking for Freedom” over the ruins of the old society. The world across the Straits of Florida is at the point of implosion. They want none of it: keenly aware that the West is inviting them into a house which is collapsing around our ears. Where this leaves long-term détente with the United States is anyone’s guess, but it is clear that the appetite for change is uneven. Their desire for free access to basic commodities is as pressing as their fear of being sucked into a US black hole and spat out as another Puerto Rico.\nThe wet dreams of Washington hacks will remain a fantasy I suspect: so long as Havana treads carefully we are unlikely to see a color revolution here. Whether Cuba can survive another few decades of blockade is a different matter. Nevertheless, in ordinary Cubans like Emely and Jorge the raw materials are present to revitalize the revolutionary ideals on which 1959 was founded, while understanding that a siege mentality cannot bind a society indefinitely. Cubans need hope and inspiration.\nIn the final days of my stay in Cuba, I take a taxi from Trinidad, on the southern coast, back to Havana in the northwest. The journey takes almost five hours. The driver is as happy to talk as anyone else. He tells me he has spent significant time abroad, predominantly Spain, and yet has always returned to Cuba. Listen to the Miami expats and the idea would seem absurd; to get out only to get back in. He evidently disagrees. “Spain is a disaster,” he intimates. Yes, life can be tough here, but — particularly for an immigrant — it’s tough in Spain too.\nIt’s tough in a lot of places. It’s tempting to see that as hopelessness, but I think it points to something else. Perhaps it’s pragmatism; certainly it encompasses a sophisticated understanding that “elsewhere” is not the promised land of fancy soap. The well-trodden path is there, but the destinations it leads to are not always desirable. Cuba has its own way to make.", "url": "https://www.jacobinmag.com/2016/12/fidel-castro-cuba-trump-embargo-socialism"}