{"authors": ["Robert Marchant"], "date_download": "2020-05-04 20:17:31", "date_modify": "2020-05-04 20:17:31", "date_publish": "2016-12-25 05:00:00", "description": "Dr. Debbie Palmer began a successful career in medicine with some cardboard and felt-tip pens. It was a sixth-grade school project back in the 1970s, and Palmer’s lifelong quest to...", "filename": "_0d09a6958ac647778e2924b9ec0f8ff6_1588623451.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0d09a6958ac647778e2924b9ec0f8ff6_1588623451.html", "title": "Greenwich dermatologist writes book on skin care", "title_page": "Greenwich dermatologist writes book on skin care", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dr. Debbie Palmer began a successful career in medicine with some cardboard and felt-tip pens.\nIt was a sixth-grade school project back in the 1970s, and Palmer’s lifelong quest to understand the body’s largest organ began in her family’s den in Michigan.\n“I went to the library and got a book on skin, then I drove my bike to the store, and I got a piece of cardboard and some markers. I drew a cross-section of skin: hair follicles, layers of skin, in the den.”\nHer mother, Meral, was bewildered and a little concerned about her fascination with the human epidermis, but the budding doctor would not be deterred from her pursuit.\n“I said this is the coolest thing in the world,” she recalled. And her mom is very proud today.\nNow as a successful dermatologist with a practice in Harrison, N.Y., Palmer has come out with another project on skin — a much more advanced study than the one she began years ago. Her latest book, “Beyond Beauty” takes a holistic approach to healthy skin and ways to look and feel better.\nRather than look at the ways a person can retain youthful-looking skin through lifts and peels and other quick-fixes, Palmer advises a path to good skin-health through diet, exercise, sleep and relaxation. She wrote the book with Valerie Latona, former editor-in-chief of “Shape Magazine.”\nPalmer, a resident of the Glenville section of town, writes about the importance of a healthy diet and the value of anti-oxidants — in a person’s diet or as an ointment — to keep cells healthy.\nUnstable chemical elements inside the body can trigger biochemical reactions, she said.\n“In science, we call them reactive oxygen species. They are responsible for the sagging of the skin, brown spots, fine lines and wrinkles, the aging process,” she said. Foods that are rich in anti-oxidants help those unstable molecules from doing damage, leading to healthier skin.\nGood skin also benefits from good sleep, she said.\n“It’s really important to get the proper amount of sleep, your body regenerates while it’s sleeping, and you can repair it,” she noted.\n“Mental relaxation is also important,” she said. “You can get that through meditation, exercise or a religious connection...Learn how to relax in the way that works for you.”\nGood maintenance in the forms of sunscreen and lotions also help. Palmer also has her own line of skincare products, Replere, available on-line and at Greenwich Pharmacy.\nHer book, available at Amazon, was written in an easy and accessible style, one that follows her manner with patients.\n“I like talking with people, and it’s gratifying to help them,” she said. “I love that personal relationship.”\nThe dermatologist says people who want healthier skin should avoid what she calls the “treadmill” approach, one heavy on procedures.\n“I’ll see patients, and they want an injection, or a cream. They say ‘make me look younger.’ I try to bring other aspects in - it’s not what you inject or what laser you use, or what cream you put on your skin. Are you eating well, sleeping well, are you exercising? It’s multiple things pulled together,” she said.\nA married mother of two youngsters, Palmer follows her own advice and has dewy skin. She enjoys skiing, golf, reading and long walks at Tod’s Point. Plenty of restful sleep and a diet laden with vegetables and minimally processed foods also contribute to her healthy glow.\nAs she’s learned through the years, she said, “Your skin is a reflection of what’s on the inside.”\nRobert.Marchant@scni.com", "url": "https://apnews.com/0d09a6958ac647778e2924b9ec0f8ff6"}