{"authors": [], "date_download": "2020-05-04 20:29:06", "date_modify": "2020-05-04 20:29:06", "date_publish": "2016-09-12 16:37:00", "description": "The Tractor Supply Co. of Corinth is encouraging all proud and potential pet owners to mark their calendars for Saturday. As their main event for Pet Appreciation Week, the store will connect...", "filename": "_664d1c3bec654548a56fc48b99b370fc_1588624146.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_664d1c3bec654548a56fc48b99b370fc_1588624146.html", "title": "Local store celebrates Pet Appreciation Week", "title_page": "Local store celebrates Pet Appreciation Week", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Tractor Supply Co. of Corinth is encouraging all proud and potential pet owners to mark their calendars for Saturday. As their main event for Pet Appreciation Week, the store will connect community groups with families in celebration of the area’s furry friends. A “purr-fect” atmosphere for animal lovers, the special day will include pet adoptions, samples, giveaways, drawings for gift cards and other family-friendly activities. In addition to fun-filled recreation, there will be deals on pet products, from food and treats to toys, crates and more on Wednesday, Sept. 14 through Sunday, Sunday, Sept. 18. “Pet Appreciation Week is a time when our love for animals really shines,” said Harold Settlemires, manager of the Corinth Tractor Supply store. “It’s an opportunity for us to celebrate the love of pets, find great homes for local adoptable animals and showcase the community partners and rescues who care for these animals year round.” Supporting community groups in their work to find good homes for dogs and cats, Pet Appreciation Week will help raise awareness of the importance of spaying and neutering pets as well as provide information on proper pet care and nutrition. Pet Appreciation Week is open to the public and all leashed, friendly pets. A Dog Wash and Wiley’s Kettle Corn will be set up. This year’s community partner for Saturday, Sept. 17 is the Corinth/Alcorn Animal Shelter. The shelter will be onsite from 10 a.m. to 3 p.m. Tractor Supply Co. is located at 1983 Highway 72 East in Corinth. (For more information, pet adoption details and planned activities, contact the Tractor Supply store at 662-286-811. For more information on Pet Appreciation Week, visit Facebook.com/TractorSupplyCo or TractorSupply.com.)", "url": "https://apnews.com/664d1c3bec654548a56fc48b99b370fc"}