{"authors": ["Darrell Ehrlick Photography Bob Zellar"], "date_download": "2020-05-04 20:11:39", "date_modify": "2020-05-04 20:11:39", "date_publish": "2016-12-09 12:00:00", "description": "The trouble with Sharon Weatherwax-Ripley and her husband, Ben Ripley, is there's no one to pull the reins in on their holiday decorating. Not even Santa Claus himself with years of practice...", "filename": "_c0df76879d5b4390b5ec283ea7efeb3f_1588623099.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c0df76879d5b4390b5ec283ea7efeb3f_1588623099.html", "title": "A Home for the Holidays", "title_page": "A Home for the Holidays", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The trouble with Sharon Weatherwax-Ripley and her husband, Ben Ripley, is there’s no one to pull the reins in on their holiday decorating.\nNot even Santa Claus himself with years of practice on a herd of hopped-up reindeer would be able to throttle back the preparations of this Billings home.\nAnd why would he?\nHolidays in the Ripley house are a time to connect with family and celebrate traditions, including a main Christmas tree with delicate glass ornaments and a time for “community pruning.”\nThat’s what Weatherwax-Ripley calls it.\nEvery fall, around Halloween, she puts pruning shears in her car and starts looking for blue spruce trees -- their grayish-blue branches make the perfect holiday trim for wreaths.\n“I always ask, and I try to ask nicely,” Weatherwax-Ripley said.\nShe spots a blue spruce in need of a trim and asks the owner if she could prune it for them. Admittedly, there are some strange looks at first.\n“Normally, they think I’m nuts,” Weatherwax-Ripley said. “But you have ask nicely and explain.”\nShe just loves using the freshly grown spruce and other plants around her yard during Christmas time.\nHer decorations really encompass two parts of the house -- indoors and outdoors. Everything outdoors is fresh, including wreaths she hand-makes from her trimming adventures.\nEach part of her house looks like it came from a holiday magazine. There are perfectly-shaped wreaths, a Christmas village and five Christmas trees total.\nAs part of her tradition, the decorating doesn’t begin until after Halloween. That’s not to say she isn’t constantly thinking about new decorations or prowling things like YouTube for ideas.\nFor nearly three weeks, she’s busy transforming the home into a Winter Wonderland of holiday-themed decorations.\nSome traditions just happened, like when she once disassembled a Christmas wreath from a store to see if she could make it smaller. Once she had reverse-engineered it, she thought, “Oh, is that all there is to that? Well I could do that.”\nAnd she did.\nOther items have a sentimental spot in her home, like the tree with glass decorations, some of which have been part of her or her husband’s family for decades. Other ornaments she’s collected from friends and family for years.\nShe started collecting The New England Christmas Village when she learned her husband had always been enamored by the lighted decorative villages at Gainan’s.\n“I don’t know of many who collect the New England Village, but I did it because the first piece I bought was Ben’s Barber Shop because my husband is Ben,” Weatherwax-Ripley said. “Thankfully, we don’t have a lot of room to expand so I cannot buy more.”\nDecorating and finding new ways to flex her creativity comes natural for a person who found her own plans for an outdoor pizza oven as well as discovered how to light the large oak tree in the front yard using lights and PVC tubing from a sprinkler system.\n“We don’t have kids so I think we have more time and energy to devote to decoration,” Weatherwax-Ripley said.\nIn addition to the large tree with glass decorations, there’s one that features shells Ripley has collected from around the world. Another tree that sits on the bar area of the kitchen features fruit and vegetable ornaments.\nMaybe the most unique tree, though, is upside-down.\nThat’s right.\nBolted to a floor joist, it hangs from the ceiling.\n“We wanted a tree where we spend a lot of time but we had three dogs and there was not a spot safe for wagging tails,” Weatherwax-Ripley said.\nBy suspending the tree, it gave fewer targets to wagging tails.\n“I had to buy three trees to find this out, but the best kind is the inexpensive kind,” Weatherwax-Ripley said.\nThe perfect upside-down candidate was an artificial tree with hinged branches. By bending them slightly, she can make it look as if the tree defies gravity.\nThe Christmas-decorated house that takes two to three weeks to create is usually disassembled and put away in a matter of several days.\n“The house feels empty and a little sad,” Weatherwax-Ripley said. “But gardening comes a month later.”\nWeatherwax-Ripley decorates for the enjoyment of the season -- for her family and friends who love to visit. Still, that hasn’t stopped some folks from noticing and appreciating the effort.\n“Once, we came home and there was a note on our driveway, written in chalk,” Weatherwax-Ripley said. “It said thank you for decorating.”", "url": "https://apnews.com/c0df76879d5b4390b5ec283ea7efeb3f"}