{"authors": ["Lance Selfa", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:32", "date_modify": "2020-05-04 19:52:32", "date_publish": "2016-03-18 00:00:00", "description": null, "filename": "2016_03__1588621952.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2016/03/18175447/nafta.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_03__1588621952.html", "title": "The Same Bosses", "title_page": "The Same Bosses", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOne of the standard media frames for the 2016 election is the idea that both the racist billionaire Donald Trump and the self-declared socialist Bernie Sanders are “populists” — and nowhere is their supposed populism more pronounced than on the issue of trade. It’s true that both Trump and Sanders have spoken out against free-trade agreements — like the North American Free Trade Agreement (NAFTA) between the US, Canada, and Mexico — and at certain US economic competitors, most of all, China. Sanders’s opposition to trade deals that Hillary Clinton has defended throughout her career may have helped him pull off a stunning upset to win the Michigan primary on March 8. Exit polls of voters in the primary showed that 58 percent thought trade deals cost US jobs. Among that group, Sanders beat Clinton by ten percentage points. This effect may have been more limited than Sanders hoped. He got walloped by Clinton a week later in Ohio and North Carolina, which have both seen huge declines in manufacturing jobs due to offshoring and competition from overseas. For his part, Trump has called attention to the plight of hundreds of workers at a Carrier air conditioner factory in Indianapolis. In a video that went viral on social media, Carrier executives were caught on tape telling workers that they would be laid off and their jobs shifted to the company’s plants in Mexico. Amid boos and catcalls from workers, the bosses can be heard justifying the layoffs as strictly a business decision. Trump has claimed that if he were president, he’d give Carrier executives twenty-four hours to reverse their decision — or to suffer a huge increase in tariffs on their products imported from Mexico. For a billionaire who has stated openly in the past that offshoring jobs is a smart business move, Trump’s bluster about Carrier may be hard to take seriously. But applause lines like “Let’s make America great again” (from Trump) or “American workers should not be forced to compete against people in Mexico making 25 cents an hour” (from Sanders) pack a punch. It’s obvious that Donald Trump’s scapegoating of immigrants and China is designed to galvanize supporters in the US against foreign bad guys — an us-versus-them competition where “Americans,” from the bottom of the economic ladder to the top, are in it together. This is straight-up economic nationalism that anyone on the Left will recognize as identical in logic to military nationalism. Sanders, on the other hand, is a passionate opponent of corporate greed and the “billionaire class.” But he weakens his own case against corporate America by accepting elements of the us-versus-them logic of economic nationalism. The truth is that the victims of free trade and neoliberal policies are working people around the world, not just in the US. To build an effective resistance, we need a left and a labor movement that understands its biggest enemy is corporate America itself, not unfair trade from abroad — and its biggest potential ally is the working classes of other countries, organized in solidarity against the corporations that rule over all of them.\nThe Effects of NAFTA Trump and Sanders have distinct bases of support among voters — something the media routinely ignore. Nevertheless, the two candidates, in different ways, are tapping into a social and economic reality that the ideological defenders of free trade ignore — that the mass of American workers have seen their incomes stagnate and their living standards decline throughout the era of the rise of globalization and free-trade policies since the 1980s. As economist and New York Times columnist Paul Krugman, a partisan of Hillary Clinton, admits; Much of the elite defense of globalization is basically dishonest: false claims of inevitability, scare tactics (protectionism causes depressions!), vastly exaggerated claims for the benefits of trade liberalization and the costs of protection, hand-waving away the large distributional effects that are what standard models actually predict. In the heyday of the economic boom in the decades after World War II, high school–educated workers with good union jobs could expect to buy a home, take vacations, send their kids to college, and have a secure retirement. But as a recent Pew Center study showed, the storied American middle class has eroded to the point where, for the first time, it represents less than half of US households. The groups that have experienced the greatest downward mobility, according to Pew, are all people without four-year college degrees. Non-college high school graduates are more than twice as likely as in 1971 to be in what Pew defines as “lower-income” households. Most of the occupations associated with the greatest declines in living standards are traditionally thought of as “blue-collar” or “pink-collar” jobs: sales, administrative services, mechanics and repairers, operators, and transportation. Traditional manufacturing-sector jobs were on a long-term decline in the US economy for decades before NAFTA went into effect in 1993 and China’s entry into the World Trade Organization in 2000 — two milestones cited by Sanders and Trump. But there’s no doubt that the decline accelerated in the 2000s, when what the Bureau of Labor Statistics calls “production, transportation, and material moving occupations” dropped from 17 percent of all jobs to about 13.5 percent from 2000 to 2009 — a decline of 4.2 million overall. A number of researchers associate this decline with trade, especially related to China joining the WTO. But there’s more than one factor at work, as former Labor Secretary Robert Reich explained: There’s a lively debate among researchers as to whether trade or technology is more responsible for the decline in factory jobs. In reality the two can’t be separated. Were it not for technological breakthroughs, we wouldn’t have the huge cargo containers, massive container ports and cranes, and satellite and Internet communications systems that have created highly efficient worldwide manufacturing systems. These “worldwide manufacturing systems” form supply chains that run from factories in Asia to Walmart shelves in the US — with US-based manufacturers, retailers, shippers, and financiers holding ultimate control over the whole process. As Dhanjoo Ghista and Apek Mulay explained, US multinationals, or MNCs, “realized that if US goods could be manufactured abroad in China, imported back to the United States without import duties and sold to American consumers, the corporate profits of MNCs would increase exponentially.” NAFTA has created an integrated manufacturing system in the auto industry, in which parts manufacturing, trade, and assembly is conducted in Mexico, the US, and Canada. Companies shift production between the three countries based on calculations about what is most profitable. Even after NAFTA went into effect in late 1993, employment in US auto parts and manufacturing increased from 1.1 million to 1.3 million by 2000. The number of jobs then dropped to about 1 million by 2005-6 — before falling off a cliff in the onset of the 2007-8 Great Recession. Employment in this sector hit bottom at around 623,000 in mid-2009, before the Obama administration’s auto bailout plan and the onset of an office recovery. Auto parts and manufacturing now employs about 925,000, about 50,000 workers below January 1990 figures, according to the Bureau of Labor Statistics. These figures don’t mean that NAFTA had no effect on the jobs and conditions of US autoworkers. But it is clear that auto employment didn’t simply take a one-way nosedive from the moment NAFTA was passed. What else was involved? This period in the auto industry has been one of declining union membership, speedup, two-tiered wages, and greater subcontracting across North America. In 2009, the Obama administration’s bailout plan for the industry tore up union contracts, enforced two-tiered wages, and required the surrender of a generation’s worth of work rules. It was the US government under a Democratic Party president that demanded these concessions, not the Mexican or Canadian governments. Meanwhile, auto manufacturers from Europe and Japan have opened plants in right-to-work Southern states within the US, where unions are at their weakest. As socialist author Kim Moody wrote in his book In Solidarity: Shrinking membership in industries with growing employment can be partly explained by a geographical restructuring of several industries, notably automobiles, meatpacking, trucking and construction. In these cases, it was the unions’ inability to follow work to new sites, often in the South, that led to declining membership. One drastic effect of NAFTA has been the destruction of small farming in Mexico when that sector was forced into an unfair competition with US agribusiness. By some estimates, more than one million farmers have been driven from the land. Many of the victims moved to Mexican cities or crossed the border into the US without documents to find work. This example illustrates a couple of critical factors about free trade in the neoliberal era. First, free-trade agreements like NAFTA are engineered for the benefit of US business, as levers to pry open sectors of other countries’ economies to investment and services. Second, they allow for the free movement of capital across borders, but not the free movement of labor. In fact, the era of NAFTA coincided with a huge increase in border security and repression that produced a record number of deportations — more than two million — under the Democratic Obama administration. Two conclusions should flow from this: first, it’s a distorted picture to focus on NAFTA or other free-trade agreements purely or even primarily in terms of their effects on US workers. And second, socialists and labor activists won’t successfully challenge the impact of neoliberal free-trade policies on workers of any nation by pitting US workers against “people in Mexico making 25 cents an hour” — instead, they must organize initiatives to promote cross-border solidarity and legalization of Mexican workers, who are a de facto part of the US labor force. In stark and obvious contrast to Trump’s scapegoating of all immigrants, Bernie Sanders’s powerful ad in support of immigrant workers in Immokalee, Florida, shows that he understands one part of this picture. But Sanders’s solidarity with immigrant workers clashes with his rhetoric blaming trade agreements or China for the deteriorating living standards facing US workers. That rhetoric points in the opposite direction of solidarity by accepting the competition between workers of different countries — and in that sense, there is a connection with the nationalistic scapegoating of Trump.\nWho to Blame Another important point to make is the simple fact that most of the lowest-paid jobs in the US — like those in food service and personal care — have nothing to do with trade. These are among the types of jobs that have expanded the most since the Great Recession, and they pay below-livable wages of around $20,000 a year. These are the jobs that would benefit most from a $15-an-hour minimum wage and a union. Writing in a different context in 2000 — at the height of the Clinton “miracle economy” — economics journalist Doug Henwood made a point that holds up well today: I’m not going to deny that plant relocations to Mexico and outsourcing contracts in China have put a sharp squeeze on US manufacturing employment and earnings, and the threat of those things has greatly reduced the bargaining power of US workers. How much has this contributed to downward mobility and increasing stress? The econometricians say that trade explains, at most, about 20-25 percent of the decline in the real hourly wage between 1973 and 1994 . . . That still leaves 75-80 percent to be explained, and the main culprits there are mainly of domestic origin. I’d say an important reason that trade doesn’t explain more of our unhappy economic history since the early 1970s is that 80 percent of us work in services — and a quarter of those in government — which is largely exempt from international competition. What did “globalization” have to do with Teddy Kennedy and Jimmy Carter pushing transport deregulation, or with Reagan’s firing the air traffic controllers, with Clinton’s signing the end-of-welfare bill, or with Rudy Giuliani being such a repressive pig? What does “globalization” have to do with cutbacks at public universities or the war on affirmative action? While lots of people blame the corporate downsizings of the 1990s on the twin demons, globalization and technology, the more powerful influences were Wall Street portfolio managers, who were demanding higher profits — which they have gotten, by the way, which is one of several reasons why the Dow has done so well. For racists like Donald Trump, there’s nothing contradictory about spewing filth about Mexicans, immigrants, and Muslims and opposing — not always consistently — free trade. This sort of “America First” politics of combining racism (including antisemitism) with economic nationalism and protectionism characterizes far-right figures from Charles Lindbergh in the 1920s to Patrick Buchanan in the 1990s. That’s why it’s problematic when left-of-center writers like Rolling Stone’s Matt Taibbi and author Thomas Frank, in otherwise useful articles on the Trump phenomenon and his anti-working-class agenda, tend to overlook this. Taibbi, for example, wrote in Rolling Stone, “Reporters have focused quite a lot on the crazy/race-baiting/nativist themes in Trump’s campaign, but these comprise a very small part of his usual presentation. His speeches increasingly are strikingly populist in their content.” The Nation’s Rick Pearlstein, a longtime analyst of the Right in US politics who attended the same New Hampshire rally that Taibbi was writing about, disputed Taibbi’s read on the rally: “[T]he race-baiting and the nativist themes rained down like dirty dollar bills at a strip joint,” Pearlstein wrote in In These Times. Trump plays on the anxieties of his supporters — both economic and racial — and tries to direct anger toward a mélange of “thems”: Mexicans, Muslims, and the Chinese, as well politicians and bureaucrats who Trump claims are betraying the nation. Despite singling out the Carrier layoff video, Trump doesn’t talk about the company’s executives in the same way — he characterizes them as businessmen with whom he can make a deal. Likewise, as left-wing journalist William Greider wrote in the Nation, when Trump talks about corporations seeking tax shelters overseas, he doesn’t blame them, but puts the onus on politicians for not offering them a “tax holiday” — which would mean, in essence, giving in to the corporations’ blackmail.", "url": "https://www.jacobinmag.com/2016/03/sanders-trump-nafta-tpp-china-mexico-populists/"}