{"authors": ["Bill Mccutcheon Paris Post-Intelligencer"], "date_download": "2020-05-04 20:20:23", "date_modify": "2020-05-04 20:20:23", "date_publish": "2016-10-04 01:07:00", "description": "A mountain bike trail is being proposed at the former Camp Hazlewood location at Kentucky Lake. The Paris Parks and Recreation Department and the Paris-Henry County Chamber of Commerce...", "filename": "_a82cd714f4ab49b78ec29428695f40ac_1588623623.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a82cd714f4ab49b78ec29428695f40ac_1588623623.html", "title": "PARIS, TN: Henry County may get mountain bike tail", "title_page": "PARIS, TN: Henry County may get mountain bike tail", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A mountain bike trail is being proposed at the former Camp Hazlewood location at Kentucky Lake.\nThe Paris Parks and Recreation Department and the Paris-Henry County Chamber of Commerce Tourism Committee are working on the plan.\n“As the former Girl Scout camp property is now owned by Tennessee State Parks, we are negotiating with the state officials, but it looks very promising,” City Parks Director Tony Lawrence told members of the Parks Board Monday afternoon.\nIn other items, Lawrence said multiple projects are either under way or almost completed at McNeill Park.\n“Work on the girls softball/T-ball field is about fifty percent finished,” he said, “with our Public Works Department doing some extensive grading.\n“Friends of McNeill met recently and are moving forward on lighting the new T-ball field.”\nLawrence also reported a concrete backstop has been completed on the Babe Ruth field with net installation yet to be done, making it about 70 percent complete.\n“Jacob Pooler has taken the T-ball field as an Eagle Scout project, with Tri-Turf providing sod and other needs,” he said.\nMeanwhile, work will start soon on expansion and upgrades on one of the restroom facilities at the park.\n“The new treadmills have arrived and are already being used at the Civic Center,” Lawrence reported.\n“We’re not going to even start on the major renovations of the basketball courts at Ogburn Park,” he said.\nThe current surfaces there are to be torn up and completely replaced with a concrete surface similar to that of the city tennis courts at Henry County High School.\n“That means we are likely going to wait until the first of the year to even start on it, and hopefully can have it finished by our staff.”\nA disc golf tourney Sept. 11 at Eiffel Tower Park drew about 36 participants.\n“That’s about what we’ve been averaging for the last couple of years,” Lawrence said.\nMeanwhile, basketball signups are ongoing for the upcoming youth season. Signups are being held from 5-7:30 p.m. at the Atkins-Porter Recreational Building.\n“We’ve already had about 65 sign up,” Lawrence said, “but, as usual, many wait until the last minute, so we’re expecting many more than that the last week.”", "url": "https://apnews.com/a82cd714f4ab49b78ec29428695f40ac"}