{"authors": ["Herman Rosenfeld", "Sam Gindin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:52:25", "date_modify": "2020-05-04 19:52:25", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_09__1588621945.html", "image_url": "https://images.jacobinmag.com/2016/10/17230749/Screen-Shot-2016-09-13-at-11.46.49-AM1-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09__1588621945.html", "title": "Follow the Money", "title_page": "Follow the Money", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nEver since the sit-down strikes of the 1930s, the cycle of “Big Three” auto bargaining has been a major economic and political event, an indicator of the progress of the class struggle in North America. If such interest has sagged of late, it charged back into the news with the aggressive declaration of Unifor’s president, Jerry Dias, that winning new investments for Canada is at the top of the union’s agenda in its current bargaining round with General Motors (GM), Ford, and Chrysler. Dias followed up this challenge to management’s right to unilaterally decide investments with the audacious warning that if these US-based corporations don’t deliver on bringing a fair share of investments to Canada, they can expect a strike. This has set up a confrontation with GM in particular, which has adamantly stated that it won’t negotiate over where to put its profits. Its investment decisions, it asserted, will be made by GM alone and only after the contract has been put to bed — effectively saying, with GM’s typical amalgam of arrogance and paternalism, that it will decide once the workers have shown they will behave. A remarkable aspect of these incompatible stances between GM and Unifor is that both the company and the union are taking different positions than they have in the past. The truth is that when it suited GM, it regularly brought its investment decisions to the table. In every bargaining round in the United States since the end of the 1970s, GM used the threat of withholding investment and the promise of bringing new investments to get wage restraint or, more often, concessions from the United Auto Workers (UAW). And for its part, the Canadian section of the union has, over most of that same period cautioned, against its current position, that collective bargaining is not the terrain for dealing with new investment. Jobs were a political issue to be resolved at the level of the state and to attempt to deal with it in bargaining would, the Canadians claimed, only lead to disaster.\nStruggles in the 1980s Threats by employers to withhold investments if the workers don’t fall in line is, of course, a constant of life under capitalism. For Canadian autoworkers, it was especially highlighted in the early eighties when, in response to their refusal to accept concessions, GM declared that the Canadians up in the attic of the international union weren’t going to set the standard for the very much larger and more significant workforce on the American main floor. To bring this home, GM went so far as to talk of pulling out of Canada. Peter Trueman, the generally staid news anchor at Global TV, reacted to the threat by angrily noting that companies elsewhere “had been nationalized for less.” But this reflected the mood before neoliberal ideas came to so completely dominate public thinking. Adolph Reed has characterized neoliberalism as capitalism without a labor opposition, and the early 1980s was a time when such opposition still held capital at bay. The Canadians went on strike in spite of GM’s threat and not only won their demands (as documented in the National Film Board documentary Final Offer) but in the years that followed GM made their largest-ever investments in Canada. Of course, even then the union could hardly dismiss the industry’s threats. Those threats are always real; the companies have the power, undemocratic as it is, to deny investment. Currently, North American sales have recovered since the deep crisis of 2008–9 (sales are strong in the United States and have been at record levels in Canada). Profits are impressive by any measure. Yet the recovery of production has varied sharply across North America. US assembly of vehicles has surpassed pre-recession levels and Mexican assembly is booming, but Canadian assembly seriously lags. Going forward, things look to be even worse; announced investments in North America have, as the media and the union have noted, dramatically shortchanged Canada. With the auto majors continuing the shift in assembly plants away from the Great Lakes to the US South and to Mexico, and with investments in Canadian engines stagnating, this also threatens a good part of the Canadian auto components sector. In this context, as courageous as it may seem for the union to declare that it will go on strike for investment and jobs, it does seem incongruous to threaten to close plants that the companies don’t seem all that interested in keeping going. It is true that workers can, even in bad times and in plants destined for closure, impose significant short-term costs on their employer and so defend or improve their compensation. It is, however, another thing to imagine that such short-term costs, on their own, could be enough to reverse long-term strategic decisions over investment. The Unifor leadership certainly has enough bargaining experience and savvy to appreciate this limit. Their bravado about deploying the traditional strike weapon as the solution to the complex issue of worker insecurity could be based on the expectation that GM is ready to invest here but needs a push to declare its plans during bargaining. Or, if that is not expected to be the case, it may be that it is not so much GM that Unifor is addressing with its strike threat as it is the provincial and federal governments. That is, the union may be using the high profile of bargaining in the auto sector, and the drama of a possible strike, to highlight the jobs issue politically, and thereby place it firmly on the political agenda. This is where the union has argued in the past the jobs issue in the auto industry always belongs. All this poses a series of questions: Does Unifor’s attempt to secure new investments through collective bargaining represent a powerfully militant, innovative approach on its part? Or could it be walking into a trap the automobile companies have set? If the government offers subsidies — the only public response being bandied about so far in the media, the industry, or the union — is this really a solution?\nThe Quagmire of Investment Bargaining It isn’t surprising that the overwhelming concern of workers with decent-paying jobs is hanging on to them, all the more so in an era that has witnessed the overall decline in comparable full-time jobs. Yet unions have also traditionally grasped that this couldn’t be resolved in bargaining. The availability of jobs was understood to be dependent on a wide range of factors largely beyond the scope of bargaining: the state of the economy, the quality of the product, the age of the facility, corporate competency and technological expertise, the strength of the supplier base, impact of exchange rates, new competitors, strategic decisions to directly enter new markets, etc. And so collective bargaining, even in bad times, has generally set the job question aside — reduced work time to share the work being the singular exception — and focused on improving the compensation and conditions of work. In the early 1980s this issue became a major point of conflict between the Canadian side of the union and its American parent, and eventually a key factor in the subsequent breakaway of the Canadians to form their own union. While the Americans put jobs at the center of their demands, the Canadians argued that if new investment was the main bargaining demand, the company would undoubtedly counter by insisting that any significant union demands got in the way, and that it would only offer the investments in exchange for concessions — basically that the workers “buy” their jobs. Bargaining would shift from workers making demands for improvements, to corporations being the demand-initiators. Moreover, any concessions made by workers in one facility would create pressure to do the same in competing facilities. The cancer of concessions would therefore create a downward spiral in wages and working conditions without alleviating worker insecurity. Having opened this door, concessions would become a regular feature of bargaining and the union’s role would largely be constrained to repeatedly begging for jobs and selling the consequent concessions to their members as successes. Which is of course what happened. The UAW came out of every bargaining round from 1979 on heralding a “historic breakthrough” that “guaranteed job security.” But there was no way to enforce the corporate side of the trade-off. Investment promises take a number of years to implement and the companies might either be unable to fulfill those promises or simply refuse to do so in light of “changing circumstances.” In line with the agreement, plants weren’t closed during the life of the agreement, but they were instead temporarily “mothballed” until the agreement expired, at which time the companies were free to permanently close them. The companies then announced a new list of closures going into the next bargaining round, leaving the union desperately focused on shortening the list and “winning” another “historic agreement” — a cycle that was, all too predictably, to repeat itself over the following decades. With worker compensation and conditions eroded while job security remained as elusive as ever, the strength and credibility of the American union steadily faded. Today the debates about trying to bargain jobs are no longer abstract or speculative questions; the wretched numbers are there for all to see. Before the concessions began, the UAW had some 750,000 members at the Big Three in the United States based on historical sources; today they have under 120,000, according to the UAW, an astounding loss of over 630,000 jobs or over 80 percent of the former jobs. There is no denying that all kinds of factors were at play — Japanese competition, the impact of new technologies, and reorganization of work — but whatever the explanation, there can be no more powerful evidence of the failure of the strategy to bargain jobs.\nTheir Freedoms Versus Ours What then of government subsidies as the answer to jobs? Here too, some history is relevant. Through most of the twentieth century, it was generally accepted that the Canadian auto industry, dependent on US-based corporations, could not survive under conditions of free competition with the Americans. The US market dwarfed that of Canada and the United States was where the technology, productive capacities, and decision-making were overwhelmingly concentrated. (GM’s research and development budget, for example, has routinely exceeded the R&D expenditures of the total of all sectors of Canadian manufacturing). For the Canadian industry to survive, tinkering with the market through lower corporate taxes or higher subsidies couldn’t do the trick, even though Canada’s corporate taxes are by now among the lowest of any major manufacturing country. For policy makers in the early days of the industry and through the 1970s, it was obvious that the freedom of corporations to sell cars here entirely made outside the country would prevent Canada from developing an auto manufacturing capacity. Direct state intervention was essential, and it took the form of imposing an import duty (tariff) on the entry of such vehicles. Crucially, this wasn’t to keep US-based corporations out, but to encourage them to come and produce within Canada (an added inducement for them to do so was that if a company located production in Canada, it qualified for duty-free entry into other countries of the British Commonwealth). The tariffs did bring assembly plants but as they relied on expensive component parts unavailable in Canada the trade deficit in the auto industry kept growing. The limited scale of the Canadian assembly plants left them relatively inefficient and unable to generate significant offsetting exports of vehicles to the United States. In the mid 1960s, this dilemma was resolved by moving to what was an early global precursor of integrated international production. Under the Canada-US Auto Pact, the Canadian and US industries would be integrated, with the free flow of vehicles and components moving both ways but with one crucial caveat: Canada was allowed to have certain “safeguard” protections. The union had lobbied hard to win these safeguards, which basically stipulated that if any of the auto majors wanted duty-free access to the Canadian market they would have to match Canadian sales with Canadian assembly. This concession reflected concerns on the part of both the auto companies and the American state that if the Canadian trade deficit in auto continued to grow, the Canadian government might, out of desperation, be forced to introduce more stringent limits on trade. Indeed, the elected heads of the union bargaining teams of GM, Ford, and Chrysler had opposed the union’s formal support for the auto pact, and called for stronger import controls to sustain the building of a all-Canadian car, to which they even gave a name: the Beaver. The significance of the safeguards the union won in the auto pact was made especially clear in the late 1970s, as Japanese companies dramatically expanded their share of the US market, leading UAW leaders there to agree to collective bargaining concessions to make “their” companies more competitive. The Canadians, less socialized into identifying with the American-based companies as “theirs,” and backed by the Auto Pact’s safeguards, instead focused on mobilizing for new politically enforced safeguards. They demanded further state regulation of foreign corporations, preventing them from undercutting other workers. This, they argued, was key to really defending jobs. But with the defeat suffered by those forces opposed to “free trade” in the 1988 election, and the coming into force of the Canada-US free trade agreement, the Canadian auto industry was left to the whims of the free market and the strategic and profit priorities of the companies. Though free-trade agreements rigorously limited state intervention to impose social standards, they did not prevent state subsidies to foreign corporations to affect the location of production. Competitive subsidies became an add-on to free trade (as one blogger said, for corporations, the cost of investing moved a bit closer to being “free”). This actually placed unions in the position of calling for subsidies on behalf of corporations who were already among the wealthiest corporations in the world and increasingly favored by competitive cuts in corporate taxation. Unions calling for subsidies for “their” companies — while other workers faced layoffs and closures, and while curtailed spending on public services impacted public employees and their clients faced the consequences of curtailed spending on public services — were unlikely to gather many allies. The call for subsidies are interpreted as shifting what would be autoworker concessions onto the backs of the broader public. Without a more ambitious political campaign speaking to all workers in the name of full employment, social justice, and collective services, any union calling for subsidies risked being seen as simply “taking care of its own.” In the end, subsidies did not prevent the auto industry from shifting its plants from the Great Lakes area to the American South. With the companies having already decided to move to the US South and Mexico, and this also being the tendency of new foreign-based investors, the competition over attracting new investment was primarily a matter of which Southern state would give the corporations the most. Offers from the North served primarily as an added bargaining chip. The largest subsidy of all (apart from the bailouts of the banks, of course) was given by the US and Canadian governments to the auto industry in 2009, in the midst of the financial crisis. As its part of saving the industry from potential bankruptcy, Canada made a commitment to contribute $10.8 billion to GM and $3.8 billion for Chrysler, based on each company’s share of North American assembly in Canada. The implication was that as the industry emerged from the crisis, Canada’s share of continental assembly would be maintained. Yet once GM had the money, Canada’s share of assembly fell and remained significantly below the 16 percent share of production that the subsidy had been based on. Offering the big dollars but leaving the unilateral power of investment decisions in the hands of corporations proved, once again, to do little for Canadian jobs.\nReframing the Problem The problem with trying to get new investments through collective bargaining is not that it’s a bad demand — the union can hardly ignore this concern — but that it may effectively become the only demand, while the company is virtually invited to raise concessionary demands. And absent a broader political campaign, the pressure on the companies to commit to investments is limited, as is the pressure on the government to insist on such commitments and then guarantee that they are actually met. Moreover, if is not backed up by a forceful broader campaign, the union will inevitably find itself on the defensive in the court of public opinion. Going into this round of bargaining, Unifor has various things going for it. No-one can plausibly put the blame for the crisis in the Canadian auto industry on the workers. Investing in Canada comes with no penalty to the companies and the union in fact has the economic space to make gains. As Dias has constantly emphasized, independent studies rank the Canadian plants among the very top plants in North America in terms of productivity and quality, while the Canadian health care system and the low value of the Canadian dollar mean that Canadian labor costs are relatively low compared to the United States (even the auto majors themselves generally concur with these facts). In any case, labor costs in assembly plants are only 7 percent of manufacturing and roughly 4 percent of the selling price of a vehicle. And when all business costs, labor and non-labor, are rolled, as a recent study by the global consulting firm KPMG of ten major auto-producing countries has shown Canada ranks only behind Mexico — and no-one seriously argues that we should be reaching for Mexican standards. Moreover, the social and political climate has changed over the past few years. A growing backlash against the extremes of corporate power and inequality is ready to be tapped. The union has sensed this change but to really ride this wave and contribute to its development requires a demonstrated commitment to take on larger, more general struggles. When unions could win their demands based on their workplace power alone, such considerations weren’t all that important. Today they are crucial. The obvious strategic demand to focus on in bargaining is ending the shameful two-tier wage structure under which newly hired workers, who do the same work other unionized workers, start at 60 percent of the wage, remain there for three years, and only reach parity with their coworkers after completing their tenth year, while they are forever excluded from achieving an equivalent pension plan. (It is in fact a multi-tier wage scheme since some groups of workers — called “Supplementary Workforce Employees” at GM — are likely to never get to the top level). This is not only a matter of a just demand and one that speaks to strengthening the union for future battles, but it also positions the union to gain popular support for its immediate struggles. What makes taking on the issue all the more important at this moment is that it is still a relatively new program; if left to become part of the given landscape it will be all the harder to reverse in the future. Heady calls for union renewal — now common in the labor movement — can’t help but sound hollow when the members expected to carry out that renewal are alienated from the union because of the wage discrimination that two-tier involves. It is impossible to explain to new members why, when union educationals emphasize equal pay across gender, the equal treatment of workers of the same gender is so casually set aside. It is also hard to imagine calling on worker solidarity when, for example, younger workers who are denied a defined benefit plan in retirement are asked to support the defense of such a plan for the older workers alone. Nor can the union credibly speak of the wrongs imposed on low-paid and precarious workers without a union when its own collective agreements allow for second-class citizenship with second-class wages. And though the union is committed to expanding unionization, its inability or refusal to take on this internal inequity in its unionized workplaces can’t help but act as a barrier in attracting the confidence of potential new union recruits. Taking on the struggle against two-tier, including striking over it, would add to rather than take away from the focus on bargaining for new investment. This is because it holds out, alongside a broader employment campaign that would connect with the general frustrations around jobs that concern workers across all sectors, the possibility of public pressure on the auto companies to do what they would not otherwise do. Corporations have over recent decades gotten almost everything they asked for in the way of free trade, taxes, social service cutbacks, and labor legislation. Though this has fattened their profits and the wealth of stockholders, the alleged trade-off — they would invest and improve our lives — hasn’t materialized, as had been noted even by the Bank of Canada. This widespread corporate failure suggests that “we have no alternative” but to insist on governments taking on the task of directly creating jobs throughout the economy by way of investment in long-neglected physical infrastructure and in expanding the public services that have been eroded or neglected. Instead of elected governments standing idly by while unelected corporations destroy or move the country’s productive capacity, what needs to be placed on the agenda is the development of the state capacity to take over such facilities and its equipment, an engineering capacity to convert them, and a planning capacity to integrate them into production for social use. In the case of auto, if the companies continue to refuse to invest and facilities are put at risk of shutting down, the government should stand ready to take over these facilities — as the union should have called for with the closing of the Oshawa truck plant and other facilities — and look to integrate them (and component plants affected by the lack of investment by the auto majors) into a plan that keeps people working to address otherwise unmet needs. The key for such projects would be the environmental transformations that will be needed through the rest of the century: from electric cars to public transit; from refurbishing every home and office to revamping the country’s physical infrastructure; from modifying every piece of machinery and equipment to new standards, to building the equipment for the shift to renewable energies. Reorienting the economy to planning would also mean coordinating with like-minded governments and social forces for planning more socially just international economic relations, not coordinating to the ends of freeing markets to the benefit of multinational corporations.", "url": "https://www.jacobinmag.com/2016/09/unifor-caw-auto-workers-big-three-uaw-unions-manufacturing/"}