{"authors": ["Mario Batali"], "date_download": "2020-05-04 20:05:46", "date_modify": "2020-05-04 20:05:46", "date_publish": "2016-07-31 13:22:02", "description": "I am not a big frosting fan, but this double-barreled combination of a mascarpone filling and a whipped cream frosting is right in my wheelhouse. Local strawberries always add sweet and tangy...", "filename": "_ca75b77bd6594da7860d8b0597f06984_1588622746.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ca75b77bd6594da7860d8b0597f06984_1588622746.html", "title": "Strawberries are a treasure between coupled cake layers", "title_page": "Strawberries are a treasure between coupled cake layers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "I am not a big frosting fan, but this double-barreled combination of a mascarpone filling and a whipped cream frosting is right in my wheelhouse. Local strawberries always add sweet and tangy deliciousness to every single bite, and they’re totally worth the trip to your farmers market. The olive oil cake is yummy enough to stand on its own, if you prefer to serve it with just berries and whipped cream. We’re deep in summer, after all, and that gives you the right to serve this seasonal cake exactly as you please.\nMario Batali is the chef behind 25 restaurants.\nStrawberry-Mascarpone Olive Oil Cake\nFor the strawberries\n2 pints strawberries, rinsed and hulled (about 4 cups)\n2 tablespoons agave nectar\nZest and juice of 1 lime\nFor the cake\nButter, for the pan\n2 cups cake flour, plus more for the pan\n2 teaspoons baking powder\n1 teaspoon kosher salt\n1/2 cup extra-virgin olive oil\n1/4 cup whole milk\n1 tablespoon pure vanilla extract\n6 large eggs, separated\n1 1/2 cups sugar\nFor the frosting\n1 tablespoon pure vanilla extract\n6 tablespoons sugar\n1 1/2 cups heavy cream\nFor the filling\n1 cup mascarpone cheese\n1/2 cup heavy cream\n1 teaspoon Grand Marnier or orange extract\nMake the strawberries\nCombine the strawberries, agave, lime zest, and lime juice in a medium nonreactive bowl and toss to thoroughly coat the strawberries. Let stand for 20 minutes. Separate the juices from the fruit; refrigerate the fruit and leave the juices in the bowl on the counter.\nMake the cake\nPosition a rack in the upper third of the oven and preheat to 350 degrees. Butter and flour two 8-inch cake pans.\nSift together the flour, baking powder and salt in a bowl; set aside.\nIn the bowl of a stand mixer fitted with the whip attachment, combine the olive oil, milk, vanilla, egg yolks, and 1 1/4 cups of the sugar. Mix on high speed, until the mixture is airy and light in color, 5 to 7 minutes. Turn off the mixer and scrape down the sides of the bowl; add the dry ingredients and replace the whip with the paddle attachment. Mix on medium speed until smooth, about 1 minute more.\nIn the clean bowl of a stand mixer fitted with a clean whip attachment, whip the egg whites to medium peaks. Add the remaining 1/4 cup sugar and continue whipping until stiff peaks form, about 1 minute more. Stir one-quarter of the egg whites into the cake batter until evenly incorporated; gently fold in the remaining egg whites until just combined.\nDivide the batter between the prepared cake pans and bake for about 45 minutes, until a toothpick inserted in the center of each cake comes out clean. Remove the cakes from the oven and let cool for 15 minutes. Run a knife around the edges of each, and turn them out onto wire racks to cool completely, at least 30 minutes.\nMake the frosting\nPlace the bowl of a stand mixer and the whip attachment in the freezer to chill for 10 minutes.\nCombine the vanilla, sugar and heavy cream in the chilled bowl and whip at medium speed until medium peaks form, about 2 minutes.\nCover and refrigerate until well chilled, at least 1 hour.\nMake the filling\nIn the clean bowl of a stand mixer fitted with a clean whip attachment, combine the mascarpone, heavy cream and Grand Marnier; whip until firm peaks form, about 2 minutes. Cover and refrigerate until ready to use.\nAssemble the cake\nUsing a serrated knife, trim the tops of the cakes as necessary so they are level. Place the cake rounds on a clean, dry surface and brush half of the reserved strawberry liquid on the cut side of the first cake round; repeat on the cut side of the second cake round.\nCheck the filling and frosting to be sure they are very stiff; if not, rewhip until stiff. Evenly spread one-quarter of the mascarpone filling over the cut side of the bottom cake layer. Arrange the strawberries standing upright, stem-end down, over the mascarpone layer and trim as necessary to create an even layer. Pour the remaining filling over the strawberries and fill in any empty spots.\nPlace the second cake layer over the strawberry layer, cut side down, pressing gently to secure it. Using a thin spatula, spread the frosting in a thin layer over the top and sides of the cake. Chill for at least 15 minutes or up to overnight before serving. Serves 10.\nPer serving: 694 calories; 42 g fat (19 g saturated fat; 54 percent calories from fat); 70 g carbohydrates; 46 g sugar; 207 mg cholesterol; 348 mg sodium; 9 g protein; 2 g fiber.", "url": "https://apnews.com/ca75b77bd6594da7860d8b0597f06984"}