{"authors": ["Chris Rickert", "Wisconsin State Journal"], "date_download": "2020-05-04 20:19:31", "date_modify": "2020-05-04 20:19:31", "date_publish": "2016-10-29 10:30:00", "description": "There is something about listening to a baseball game on the radio that can’t be replicated on TV. Instead of the actual visuals in front of your eyes, you get the images in your mind,...", "filename": "_e06580dbb10e42f5b6b775acaded39b6_1588623571.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e06580dbb10e42f5b6b775acaded39b6_1588623571.html", "title": "Chris Rickert: Waterloo native Tom Hamilton handles radio magic for Cleveland Indians", "title_page": "Chris Rickert: Waterloo native Tom Hamilton handles radio magic for Cleveland Indians", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "There is something about listening to a baseball game on the radio that can’t be replicated on TV.\nInstead of the actual visuals in front of your eyes, you get the images in your mind, painted by local broadcasters. At least one I know of describes the color of the players’ jerseys, shoes, caps and “trousers.” Play-by-play and color commentators can develop a repartee that makes you feel like you’re sitting next to them in a bar.\nIt’s a kind of low-tech sublime you just don’t get with all the exploding graphics, reams of obscure statistics and incessant replays in the typical nationally televised World Series broadcast.\nAs the Cleveland Indians’ voice on the radio, Wisconsin native Tom Hamilton keeps his focus on the game.\nHamilton\n“Radio is my first love. As a play-by-play guy, that’s the ultimate,” Hamilton told me by phone Friday morning from Chicago, where he was getting ready for last night’s game against the Cubs at Wrigley Field.\nTV “is really an analyst’s medium,” he said, because the camera is doing the play-by-play. In radio, you “really are painting the picture for your listeners.”\nHamilton, 62, grew up on a dairy farm outside Waterloo, and later in town. He gets back to Wisconsin to see family, including his brother Robert, who’s built a 300-win baseball team at Sun Prairie High School.\nHe started his broadcasting career in Shell Lake. He’s also spent time working in Appleton and Watertown, and calling UW football games from Milwaukee. This is his 27th year with the Indians — the only major league team he’s ever broadcast for — and his third World Series.\nThere’s so much more information available to share with listeners these days, he said, and you can “give stats and numbers until you’re blue in the face,” but eventually it’s “just in one ear and out the other.”\n“You don’t want to overwhelm the broadcast,” he said.\nUnfortunately, Indians fans outside of the range of Cleveland’s WTAM-AM aren’t getting to hear Hamilton this Series. Major League Baseball’s contract with ESPN Radio dictates that affiliates must carry the ESPN broadcasters’ call. It would be like having the Brewers in the Series and not being able to listen to Bob Uecker on Madison’s WIBA-AM.\n“It’s a real shame,” Hamilton said. Indians fans “would prefer not an impartial broadcast.”\nNo doubt about that. As a lifelong Cubs fan, I was one of those people who would turn down the volume on the TV and turn up the call from Harry Caray and, more recently, Pat Hughes.\nThis year is a big year for people like me, given the Cubs’ long history of losing. Hamilton pointed out that when Cubs lead-off batter Dexter Fowler came to the plate in the first inning in Cleveland on Tuesday, he was the first black player for the Cubs to appear in a World Series.\n“If they want to suffer a few more years,” Hamilton said of Cubs fans, “that’s OK with me.”\nJust for the record, we don’t, as I’m sure Hamilton knows.\nFew people are better at understanding what pulls at a fan’s heartstrings than the home-team radio guys.", "url": "https://apnews.com/e06580dbb10e42f5b6b775acaded39b6"}