{"authors": ["Robbie Nelson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:21", "date_modify": "2020-05-04 19:53:21", "date_publish": "2016-11-17 00:00:00", "description": null, "filename": "2016_11_donald-trump-democratic-party-welfare-state_1588622001.html", "image_url": "https://images.jacobinmag.com/2016/11/17232231/28551620735_46571ea913_z-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_11_donald-trump-democratic-party-welfare-state_1588622001.html", "title": "Engines of Solidarity", "title_page": "Engines of Solidarity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe election of Donald Trump has rocked the political landscape, producing a deep sense of fear, mourning, and rage. With reactionary populism not just ascendant but set to assume power over the federal government, the Left must offer a clear alternative capable of defeating Trump’s brand of politics. The Democratic Party’s strategy — yoking the prospects of some of the most marginalized to a cosmopolitan professional class and a socially liberal donor base — has failed to even advance a liberal agenda, much less hold back the Republican Party and Donald Trump. What can the Left offer in its place? What can meet the pressing needs of a population ground down by neoliberal capitalism, while simultaneously producing structures and policies that create a basis for longer-term power? Socialists and progressives should begin arguing for, and rebuilding, what I call “engines of solidarity.” Constructing engines of solidarity means moving beyond the liberal view of solidarity as a sympathetic disposition and instead binding people together in relationships of shared material interest. It means ameliorating the brutality of life under capitalism while fashioning a working class that is more structurally unified and in closer political conversation with socialist ideas. More concretely, it means significantly expanding the welfare state. Over the years, socialists have produced serious critiques of the welfare state under capitalism, and it would be a mistake to ignore the contradictions and limitations of social-democratic reforms. But the fact remains that workers in the advanced capitalist world are socially fragmented and politically alienated, and winning significant social progress is exceedingly difficult without a more united working class. The welfare state is one of the best and most readily available tools we have to make that happen.\nReducing Disparities, Boosting Power Historically, welfare states in the Global North have been funded through broad-based taxation on wages (payroll taxes) and consumption (value-added taxes). In other words, the working class has largely paid for its own welfare state. Rather than directly redistributing wealth downward, social-democratic welfare states have traditionally reduced disparities within the working class and established a higher minimum standard of life. That, in turn, has indirectly channeled social wealth from the 1 percent to the rest of the population. How? Because exploiting large wealth and power disparities within the working class is one of the primary ways the capitalist class boosts its profit margins (and political hegemony). By elevating the living standards of the poorer and more desperate segments of the working class, we put a squeeze on capital’s game of arbitrage (in which it shifts financial flows from high-wage sites to low-wage ones) and strengthens the bargaining power of labor, from fast-food workers to increasingly proletarianized white-collar workers. In doing so, robust welfare states tie crucial elements of the middle classes to the political program of working-class empowerment. Despite their relative affluence, US workers in the education and medical industries, as well as office workers, downwardly mobile professionals, and many small business owners struggle to pay for health care, housing, and college tuition. While “the precariat” might not describe a new social class, precarity is endemic in modern capitalist life for everyone but the plutocrats. Building a generous welfare state is the surest way to transform that precarity into solidarity. Bernie Sanders’ platform provides a good starting point: single-payer health care, free higher education, universal child care. Each would significantly improve the living standards of workers and poor people. Equally importantly, each is informed by two key principles that would begin to transform the US’s fractured welfare state into an engine of solidarity.\nUniversal and Visible The first principle is universality. Meager, means-tested social programs have become liberals’ bread and butter over the past thirty years. Unfortunately, these programs don’t win broad-based support. A large body of research — and a cursory look at opinion polling — indicates that universal programs like Medicare and Social Security are the most consistently popular, and the most difficult to erode legislatively. Superficially, Medicare is more regressive than a means-tested program: beneficiaries receive it regardless of their income. But progressivity should be the guiding principle of the tax code, not the provision of government services. Donald Trump’s children should enjoy access to free public college education — Donald Trump should just have to pay higher taxes to fund it. Introducing universality would also go a long way toward remedying historic injustices embedded in the welfare state. In recent decades, scholars have documented the many ways the mid-century welfare state excluded Americans along lines of race, gender, geography, and occupation. The first wave of Social Security and labor regulations did not reach agricultural or domestic workers, or the unwaged. Local and state supervision of benefit provision resulted in widespread racial discrimination. Formed against the backdrop of a patriarchal social structure and a racial caste system (which was undergirded by the power of Southern Dixiecrats), the fragmented, vitiated American social state undermined its own ability to generate mobilized majorities willing to defend it at the same time it unfairly denied many people benefits. Then, for good measure, it constructed programs that stigmatized those at the bottom. Our job is to reverse these inequities with universal measures that bring in the previously disenfranchised. And since the aim of the welfare state is to reduce inequality within the working class, these universal programs should be augmented by policies — like pay equity and affirmative action — that are designed to mitigate discrimination against women and people of color. Of course, even some of the programs in Sanders’ platform, like free child care or free higher education, are not strictly universal. Those without children or those not attending college wouldn’t receive them. But recipients would span a wide range of racial, class, and geographical backgrounds (and the programs would disproportionately benefit poorer and more marginalized populations). What’s more, all Americans would have family members, co-workers, or friends clearly and directly benefiting from the welfare state. The worker in small-town Iowa would no longer feel alienated and tense during tax season, sweating over which form to fill out simply to receive a government benefit. The young unemployed man in Cleveland might feel like he had a democratic relationship with the state instead of just being subjected to its carceral apparatus. Which leads us to the second key principle: visibility. Social-democratic programs must be designed so recipients clearly understand what the programs do, and how they benefit from them. One major problem with the contemporary American welfare state is its submerged nature. Largely invisible at best and terribly complicated at worst, the very structure of the social state undermines its viability. Take the Home Mortgage Interest Deduction. A tax expenditure that costs the federal government over $70 billion per year, the deduction is generally not considered “welfare” by its recipients — even though it transfers money from federal coffers to homeowners. In 2012, about 77 percent of HMID benefits flowed to households with annual incomes of more than $100,000. The Earned Income Tax Credit is another semi-submerged welfare program, but mostly for poor and working-class people with children. While the EITC serves as a vital economic lifeline for millions of people, the complexity of the claiming process means that about 20 percent of those eligible for the program don’t receive any benefits. (Although EITC is less stigmatized than TANF, the cash assistance program for the poor, it also effectively subsidizes low-wage employers.) The byzantine Affordable Care Act has its own political problems. Expanding Medicaid and ending discrimination against those with pre-existing conditions were clearly good things. But most Americans, both through their daily experience and the messaging of the political media, see the insurance exchanges and the individual mandate as the legislation’s primary components. And that hasn’t been a boon. Means-tested subsidy formulas, high-deductible plans, hidden costs, and hours spent navigating the system — not to mention the fact that the health care system remains expensive and immiserating for most — have all conspired to keep public support below the 50 percent line.\nAn Emancipatory Social State Expanding the welfare state — visibly and universally — is the linchpin of a viable left program that can bring down Trump and the Republican Party. But socialists shouldn’t feel compelled to limit our vision to policy proposals thrown around in a Democratic primary. Sanders’s platform is good policy and good politics, but we also need to seriously consider measures that establish a radical pole anchoring the policy imagination of social democracy. We shouldn’t omit more radical programs like a generous Universal Basic Income or a federal jobs guarantee. We shouldn’t shy away from advancing a confiscatory carbon tax, or a large wealth tax. At the same time, we should remain mindful of the traditional socialist critiques of social democracy. The most prominent one: under social-democratic capitalism, the working class will only ever be a junior partner in a corporatist arrangement between labor, capital, and the state. If popular forces gain enough ground to seriously threaten profit margins and corporate power, capital and the state switch from a cooperative mode to a repressive one. In other words, the social-democratic class compromise is an unstable one. This critique is an important one, and the neoliberal pushback over the last few decades confirms its validity. We can’t ignore it in our longer-term thinking about the kind of future we might want, and the paths we might take to get there. But this isn’t the 1970s. Most of us on the Left would gladly swap the political and economic contradictions of advanced social democracy for the ones we currently face. Other socialist critics have pointed to the ways in which the welfare state imposed authoritarian relationships on beneficiaries. In the US, for example, social workers would often arrive unannounced at the homes of mothers on welfare, or peep into their residences to make sure they didn’t have a partner around. Fortunately, welfare states can take much more emancipatory forms. We need social programs that are universally and automatically disbursed by the federal government, that don’t impose humiliation as a condition of receipt. In addition, we should see the struggles against state violence and surveillance — police harassment, prisons, ICE — as crucial to securing a truly emancipatory social state. As it stands, the task that confronts us is to help refashion the working population into a class for itself. The recent welfare politics of the Democratic Party — particularly its insistence on means-testing, complex subsidization, and wonkish convolution — have seriously contributed to the political situation we now find ourselves in.", "url": "https://www.jacobinmag.com/2016/11/donald-trump-democratic-party-welfare-state"}