{"authors": ["Richard Seymour", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:38", "date_modify": "2020-05-04 19:51:38", "date_publish": "2016-11-17 00:00:00", "description": null, "filename": "2016_11_british-prison-officer-strike-corbyn-law-order-blair_1588621898.html", "image_url": "https://images.jacobinmag.com/2016/11/17232313/strangeways-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_11_british-prison-officer-strike-corbyn-law-order-blair_1588621898.html", "title": "What Do the Screws Want?", "title_page": "What Do the Screws Want?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Punishing the Punished It goes without saying in Britain that criminals shouldn’t be allowed to live pleasurable lives. When Chris Grayling, as justice secretary, banned books in prison, he was swimming with the stream. The oft-repeated complaint that prisons are a doss, “little holiday camps,” has as its precept the idea that any comfort, any satisfaction, is an unwarranted humoring of thieving little toe-rags and dangerous villains. Give them nothing, lock them up, throw away the key. The only problem is, no one really knows what a criminal is, beyond tautology. Everyone at least assumes that prison is a place where we put criminals, notwithstanding the odd miscarriage of justice. But that is just to replace one tautology with another. A lot of harmful behavior is not punished, and a lot of relatively harmless behavior is. You can break financial regulations with impunity, and go to jail for drug possession. It would be more accurate to say that prison is one of the places where we put some of the people who are broken down by life — self-medicating addicts, the poorly educated, people who have had chaotic childhoods, the poor and desperate, and those who cope with various mental health problems. This is not say they are simply victims; insofar as they are victimized, they have often been victimizers. But the constitution of crime as a classification of behavior is notoriously raced and classed: the behavior that is deemed most punishable, whether antisocial or not, is that most associated with the sociability, survival strategies, and self-medication of the poor. “Crime” is not a stable category. The norms and social stereotypes that become congealed in law change over time. And the law is not just its documents; it is always materialized in its apparatuses and rituals. It is up to individual police officers, who embody these apparatuses and inhabit these rituals, who bring to bear their professional ideology and moralism, to judge what constitutes a situation demanding intervention. They decide who is let go, who is frisked, and who is tormented at the station for a confession. They decide which protesters are “law-abiding” and which are “anarchists” or “terrorists.” Criminalization is a process in which police officers play a leading role. And they bring to bear a dominant ideology which normalizes the historical and existential presuppositions of the social order they police. So it is entirely unsurprising that they typically tend to capture and punish the poor and oppressed, those who have already been shoved to the bottom of every possible pile. Criminalization is a process wherein we punish people for the ways in which they have already been punished.\nThe Purpose of Guards Prison officers are there to administer the punishment. They often see their role as pastoral and caring. Group 4, the security firm, has recently produced a sweet little pamphlet for its prison guards about caring for trans prisoners. But even carers can be sadists. The British prison service is packed full of them. Before we heard a mumbling word about Abu Ghraib, anyone who cared knew all about prisoners being subject to “sustained beatings, mock executions, death threats, choking and torrents of racist abuse.” Anyone vulnerable is a potential target for violent and sexual assault in many of Britain’s jails. Young offenders are held in “modern-day dungeons,” where they run the risk of being raped by cellmates or have their arms broken during “restraint” by staff. It would be nice to think that all of this was aberrant, the odd failure of professional ethics. And to an extent that is true: not every prison officer rapes or beats a prisoner. Perhaps the majority struggle to be decent. But the context of their job is not innocent of these abuses either. What is the logic of punishment in the first place, if it is not one of humiliation? How are people continually humiliated without explosions of violence, unless they are controlled with overwhelming force? The surge in prison violence over the last couple of years, which includes serious assaults aimed at prison officers, may well have inflamed the punitive violence of prison officers. The brutal beating of prisoners being relocated from Bedford amid the recent riot would barely have even raised an eyebrow, if anyone had heard about it. They were asking for it, it would be assumed. But that would overlook the obvious fact that the entire penal system is based on organized violence against prisoners, and that this has now reached a crisis point. To put it another way, prison has nothing to do with crime reduction. If it were about that, it would be an extraordinarily bad solution. If punishment humiliates, if brutality brutalizes, the one thing that humiliated and brutalized people rarely do is peaceably adapt and “integrate.” Imprisonment materializes the social categories of deviancy in the punished bodies of prisoners. Punishment is the evidence of deviancy, in other words, the proof that the stereotype applies. For reasons which may bear reflecting on, late neoliberalism seems to have required a systematic expansion of these categories, however dysfunctional in other ways. The recent explosions across several prisons come just over a quarter of a century after the rebellion at Strangeways Prison in Manchester. Strangeways had hoovered up the rejects of local working-class communities, often products of “care,” and put them in cells for twenty-three hours a day, only allowing them out once a day to empty their buckets of feces and piss. It had humiliated them until the point at which three hundred inmates took over the jail, and held on to it for twenty-five days under a torrent of death threats from prison guards and media obloquy. What is happening now, and part of what prison officers are panicking about, looks a lot like a cluster of little Strangeways riots: not as overtly politicized, but hardly obscure in the “grievances” and furies giving rise to them. This is what has prison officers worried, and what has driven them to militancy against the government. For all that they are the ones who materialize the violence which politicians prescribe, they are also the ones who are most likely to bear the violent reaction. They won’t be assaulted or murdered as often as prisoners, but that is cold comfort. They can manage the toll that their job takes on them by punishing the prisoners more for it, but they must realize there is a viciously circular logic to that. On top of that, austerian budget cuts have reduced their numbers relative to the prison population. So they took illegal strike action. What do the screws want, now that they’ve joined the side of the crooks? They want the right to be screws. They want the government to hire many more staff to manage these turbulent, overflowing jails, as quickly as possible. The Prison Officers Association (POA) welcomes all announcements along those lines, and lauds government proposals to target armed forces personnel as potential recruits. Certainly, the POA — one of the unions to support Jeremy Corbyn as Labour leader — would also like to reduce overcrowding, end privatization, and mitigate some of the horror. The habitus of the job tends to make many prison officers a little less gung-ho than the media-orchestrated consensus. Most personnel in the criminal justice system are aware that the prison population needs to be reduced, and grimly cynical about ministerial grandstanding. But as a group of professionals whose job is the organization of controlled violence, they are in antagonism with prisoners, arrayed against them with an impressive arsenal of kinetic force. If prisoners ever went on “strike” — and a riot can be called that in a way — the screws would be the ones wielding lethal violence. Besides, the government is steadfastly refusing to countenance reducing prison numbers and indeed are looking to prison expansion, and the deployment of special squads of officers trained to crush riots, so the fight is about staff numbers. What the screws became outlaws for, in other words, is to become better law enforcers. To win an increase in their repressive capacity. This is not only a sectional interest, but also, from their point of view, all they have to manage an increasingly frightening situation. And they are the ones whom the government expects to manage it. But victory on those terms is pyrrhic, and one which can only defer and magnify the confrontations building up in this situation. And in this situation, the “law and order” fetish begins to look more and more like the pathology it is.", "url": "https://www.jacobinmag.com/2016/11/british-prison-officer-strike-corbyn-law-order-blair"}