{"authors": ["Michele Parente"], "date_download": "2020-05-04 20:20:06", "date_modify": "2020-05-04 20:20:06", "date_publish": "2016-06-19 13:00:00", "description": "Tucked away in a nondescript office park in Carlsbad, the luxury resale business Designer Vault recently opened a chic, chandeliered, appointment-only showroom to market what it claims to be the...", "filename": "_e877de0289c2435da1c1a54c2e1ebced_1588623606.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e877de0289c2435da1c1a54c2e1ebced_1588623606.html", "title": "Re-selling swank is big business", "title_page": "Re-selling swank is big business", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tucked away in a nondescript office park in Carlsbad, the luxury resale business Designer Vault recently opened a chic, chandeliered, appointment-only showroom to market what it claims to be the largest collection of vintage Chanel in the nation — more than 1,500 handbags and accessories worth an estimated $2 million.\nLess than three miles away, the headquarters for Fashionphile, which has boutiques in Beverly Hills and San Francisco, has floor-to-ceiling shelves and walk-in safes brimming with high-end designer purses, wallets and jewelry by Louis Vuitton, Prada, Dior, Cartier and many others. The bustling operation and abundant inventory is prompting the company’s move to a new 30,000-square-foot warehouse in Carlsbad in July.\nWelcome to the booming business of selling swank.\nWhile demand for lower-market, so-called “gateway” designer bags — Coach, Michael Kors, Kate Spade, Tory Burch, et al. — is in decline, premium luxury resale is one of the fastest growing segments of the retail industry, generating from $16 billion to $25 billion a year, according to several studies.\nSales are being fueled by a seemingly insatiable and recession-proof desire for exclusive leather goods, brands that retain much of their original value and the ease of online sales, consignment, authentication and global shipping.\n“We’re bursting at the seams,” said Sarah Davis, 44, co-owner of Fashionphile, which has been in the pre-owned luxury business since 1999.\nFrom an aspirational first-timer in San Diego looking for the cache of a designer bag without the baggage of a full-retail price, to luxury house VIPs in New York unloading their freebie logo trinkets, to the brand-driven affluent consumer class in China, resale shoppers are increasingly turning to upscale e-commerce companies for their treasure hunts.\n“People buy and sell for all sorts of reasons. Sellers, of course, are looking for cash, which many turn around and use on another bag,” said Christina Samoylov, the 27-year-old owner and founder of Designer Vault.\n“People who buy vintage, where there’s only one anywhere, are making a statement. They’ve got a unique sense of style,” she said. “Today, people are more money conscious and I think with all that’s going on (online), it’s much easier to afford luxury.”\nSan Diego only represents a small share of the market for these costly Chanel clutches or cult-favorite Hermès Birken bags, with most goods shipped to New York, San Francisco, Los Angeles and China. The owners of Designer Vault and Fashionphile estimated that as much as 95 percent of their sales are conducted online.\n“We ship out at least 300 bags a day,” said Fashionphile’s Davis.\nLast week, the company’s website touted its resale prowess:\n“This week’s payout: $707,083.29; Items paid this week: 1053.” In a press release, Fashionphile reported year-over-year growth of more than 50 percent in 2015 and record sales of $3 million in February.\nThe company’s slogan, “Shop. Sell. Repeat,” is an indicator of the constant flow of goods that come through Fashionphile’s “procurement department,” which logs in about 120 items a day for consignment or resale, from Rolex watches to Balenciaga bags to one-of-a-kind Chanel surfboards.\nOn a recent Monday, an employee was inspecting a newly arrived lipstick pink Hermès Birken bag. Among the most coveted luxury items on the market, a brand-new Birken from Fashionphile can sell for more than the retail price from Hermès itself.\n“There’s demand and no supply,” Davis said. “These are limited edition items, VIP only, wait-list only.”\nLate last week, Fashionphile’s website displayed nearly two dozen Birken bags, ranging from $7,950 to $21,500, including a lipstick pink Epsom Candy Birken 35 for $12,500.\nOver at Designer Vault’s newly minted Parisian-like salon, owner Samoylov displayed a sampling of rare, limited-edition Chanel pieces that at first glance looked more like novelty items. They included: a black and gold Lucite jewelery box handbag, complete with makeup mirror ($5,000); an oversized, clear plexiglass Chanel perfume bottle on a chain shoulder strap ($11,500); and a giant pearl that opened up as a small carrier, or minaudière, on a chain ($25,000).\nThe products’ uniqueness factored into their value, as did who had owned or worn them before — Rihanna, Kim Kardashian, Miley Cyrus and others.\n“When celebrities are seen with something on the red carpet or in a movie, it definitely raises the price,” Samoylov said.\nThe idiosyncratic Cyrus, for example, wore the perfume bottle bag, filling it with — what else? — Fruit Loops.\n“That was it,” said Samoylov, “everyone had to have it.”\nBack in April 2010, when the country was less than a year out of the Great Recession, Fashionphile got positive reviews from The Wall Street Journal, which tested the site as part of an article that asked, “If it’s love at first sight that makes a woman drop $1,000 on a designer handbag, what should she do when the affair is over?”\nBad economic times can be good for businesses like Designer Vault, Fashionphile or Authentic Luxury Goods, a brick-and-mortar store in downtown San Diego that caters to women as well as professional men looking for gifts for their wives or girlfriends.\nWhen money is tight, people want to offload their pricy nonessentials; concurrently, consumers in the market for high-end designer goods are looking for prestige at a discount.\nWhen the economy is hot, sales heat up even more.\n“It’s a logical niche and it’s a win-win on both sides, for the seller and the buyer,” said Steven Osinski, a marketing professor at San Diego State University.\n“For the demographic that can purchase these (luxury bags), even when there’s a recession, when things slow down, they are less affected.”\nThe luxury resale and consignment industry, which includes bag and apparel sites like The RealReal, Tradesy and SnobSwap, is being driven by women, Osinski said.\n“The aftermarket for women is just greater than it is for men. As a gender, women are more fashion conscious and seek out better deals,” he said. “From an e-commerce perspective, women outspend men by about 60/40.”\nThe female clientele varies as widely as the color choices for the Chloé crossbody Drew bag.\nThere are the socialites from La Jolla and Rancho Santa Fe who sell their Chanels to Designer Vault when they’re done with them. They tend not to buy used bags, Samoylov said.\nThere was a young woman at Fashionphile’s Carlsbad boutique recently weighing whether to trade in her older Louis Vuitton bag for $300 on the spot or put it up for consignment, where she may or may not get more for it.\n“I don’t know. I really need the money,” the conflicted bag-owner said.\nAnd then there are “the obsessives,” as Davis calls them. There are the consumers who spend so much on designer goods, they garner star-status, receiving free gifts and getting first access to the most in-demand bags.\n“If you’re a VIP at Louis Vuitton, you’re obsessed,” Davis said.\nThese VIPs, she said, sometimes fear losing their place on the wait-list line so much, when they get the call that a particular bag is available, they’ll buy it, even if it’s not the model or color they want.\n“They’re afraid to insult their salesperson and get kicked to the back of the line, so they say yes and sell it to us, brand-new,” Davis marveled.\nAnd then there are the shopaholics.\n“We had a businesswoman from Palm Springs call us to come pick up her collection. She had $150,000 worth of bags and needed money. She couldn’t make payroll.”\nBoth Samoylov and Davis seemed destined for the luxury business.\nSamoylov was a self-described tomboy growing up in Ohio who also happened to have a cat named Oscar de la Renta. Her merchandising degree from L.A.’s FIDM Fashion Institute isn’t what got her into resale. It was a pair of Prada boots, which her husband — whom she met while working as a personal shopper at Tiffany’s — had tossed into the trash.\nShe wound up selling them on eBay for $80 and “it kept spiraling and I kept consigning,” she said.\nDavis, who is from South Pasadena, started one of the earliest resale sites by happenstance, while still in law school. Early success was fleeting; she lost her domain name and had to start over with Fashionphile. She’d eventually bring on a CEO, Ben Hemminger (also her brother-in-law), who helped expand the company’s reach.\nWhat these two entrepreneurial women didn’t plan on was becoming P.I.s. Fraud in the luxury retail industry is so pervasive, and knock-offs have become so sophisticated, the woman have had to rely a complex system of verification.\nEach of them described in detail how their authentication teams check for holograms (on Chanel and select other brands), the leading, or white space, around the logo lettering, specific fonts, the thickness of lettering, ink boldness, crispness of printing, precise leather and lining colors, stitching, correct clasp or closure for that model, patina or sheen on the hardware, date codes, and more.\n“Here’s our graveyard,” Davis said, pointing to a small box of handbags determined to be fakes. They represented a fraction of her inventory.\nThese days, in the world of big-ticket items, having a stockpile of authentic goods is like money in the bank.\n“We have something better than money,” Samoylov said. “We have product.”", "url": "https://apnews.com/e877de0289c2435da1c1a54c2e1ebced"}