{"authors": ["Needles Desert Star"], "date_download": "2020-05-04 20:19:27", "date_modify": "2020-05-04 20:19:27", "date_publish": "2016-11-08 22:02:00", "description": "Sale raises funds for liver transplant patient NEEDLES —Esther Proa is putting on a yard sale with all the proceeds going toward the Calderon family to help with medical and medication...", "filename": "_cd816aa50ad0415e810321f19833ad13_1588623567.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cd816aa50ad0415e810321f19833ad13_1588623567.html", "title": "Needles in brief", "title_page": "Needles in brief", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sale raises funds for liver transplant patient\nNEEDLES —Esther Proa is putting on a yard sale with all the proceeds going toward the Calderon family to help with medical and medication expenses. It will be held Nov. 10-12 from 7 a.m. to 5 p.m. at 577 California Ave.\nSteve Calderon received a liver transplant on Sept. 8 and will be staying in the Los Angeles area for several months with his family to continue receiving twice a week treatment. To donate items to the yard sale contact Esther Proa at 760-326-2405.\nSt. Ann bake sale set Nov. 20\nNEEDLES — The annual fall bake sale of St. Ann Catholic Church offers a variety of toothsome goodies, including dessert treats for Thanksgiving Day.\nThe sale continues from 8 a.m. to noon Sunday, Nov. 20, in Fr. Hanley Hall behind the church at the corner of Third and D streets.\nSoup, Salad, Sandwich returns\nNEEDLES — The Women’s Club of Needles holds their semiannual ‘Soup, Salad and Sandwich’ luncheon from 11 a.m. to 2 p.m. PST Sunday, Nov. 20.\nLunch is served up in the historic clubhouse at 305 W. Broadway and includes a choice of homemade soups and sandwiches, salad, coffee or tea. A variety of dessert will also be available for purchase.\nTickets, at $5 each, are available from club members or at the door. Call Chris Mills at 760-977-2989 or Tena McGee at 760-985-4050.\nJoin Santa’s Workshop\nNEEDLES — Sign up youngsters five through 13 now for the city Recreation Department’s annual Santa’s Workshop. Between 11 a.m. and 3 p.m. Saturday, Dec. 10, each participant will make five Christmas gifts in the rec center at 1705 J St. Cookies and cocoa will be served.\nSpace is limited to the first 40 participants; the program fills quickly so register early at the rec center. The cost is $25 each child, which must be paid by Dec. 5. Call Jennifer Valenzuela, 760-326-2814.\nOl’ St. Nick comes to Route 66\nNEEDLES — Ol’ St. Nick is to return once again to Route 66 in Needles on Dec. 3. The annual Christmas celebration features booths open from 10 a.m. to 5 p.m. Call Jan Jernigan at 760-326-4007 to reserve a spot. The traditional lighted parade is organized by Mary Gonzales, call 760-326-7151 to enter.\nLearn about 4-H Club\nMOHAVE VALLEY — 4-H clubs offer a variety of programs for youth age five to 19 in the Tri-state area.\nFor more information about 4-H Youth Development, contact Gerald W. Olson, Extension Agent, 4-H Youth Development at 101 East Beale St., Suite A, Kingman, AZ 86401; or call 928-753-3788.\nVisit BPO Elks Lodge 1608\nNEEDLES — All Elks and guests are welcome to BPO Elks Lodge 1608, 1000 Lilyhill Dr. Call 760-326-1608. Snacks are available on Sundays from 1 to 4 p.m. for a donation; tacos are served Mondays from 5 to 6:30 p.m.; dinners on Tuesday from 5:30 to 7 p.m.\nComing up:\nNov. 11 - Burgers and fries from 5 to 7 p.m.; sock hop starting at 7 p.m.\nNov. 12 - Elks man a food booth in the 90th anniversary celebration of Route 66.\nNov. 13 - Veterans honored with a free breakfast from 8 to 11 a.m.\nNov. 15 - Salad and baked potato bar by Sally.\nNov. 22 - Albondigas soup and salad by Carl.\nNov. 24 - Happy Thanksgiving dinner 2 to 5 p.m.\nNov. 29 - Prime rib by Randy’s Crew.\neCigarette sales require license\nSACRAMENTO — Starting Jan. 1, sellers of electronic cigarettes (eCigarettes), vaping devices, and other related products will be required to obtain a Cigarette and Tobacco Products Retailer’s License from the California State Board of Equalization.\nThis license must be obtained prior to making retail sales of these products to consumers. It will cost $265 for a 12-month period, and must be renewed annually at that price. Sellers should also have a California Seller’s Permit. Visit www.boe.ca.gov.\nBecome a museum patron\nNEEDLES — The Needles Regional Museum now offers patron memberships for persons or organizations willing to lend committed financial support to the goals of the museum at 929 Front St.\nAccording to museum secretary Cheryl Mangin, the museum is a 501(c)(3) nonprofit organization committed to the preservation and protection of the rich history of Needles and the surrounding Mojave Desert. Donations made to both the museum and Community Thrift Store, as well as memberships are tax deductible.\nMemberships cost $20 for individuals, $30 for families. Business memberships are available at the Bronze level for $100, Silver for $250, Gold for $500, or Platinum for $1,000.\nVisit the museum Monday through Saturday between 10 a.m. and 2 p.m. Private tours are available by request.\nAttend wine tasting mixer\nNEEDLES — History meets history in delicious fashion as the historic Galleano Winery visits for a tasting in the historic El Garces Harvey House on Wednesday, Dec. 7.\nThe second annual Tri-state wine tasting mixer by the Needles Chamber of Commerce begins at 4:30 p.m. PST. Donation is $10.\nEnjoy wine and hors d’oeuvres while networking and strolling around the El Garces and the newly-renovated fountain in the courtyard. Donation is $10. Visit the chamber at Front and G streets, call 760-326-2050.\nCommodities distributed\nNEEDLES — U.S. Department of Agriculture commodities will be distributed on Friday, Nov. 11, from 9 to 11 a.m. at Bonnie Baker Senior Center, 149350 Ukiah Trail, Big River; and on Saturday, Nov. 19, 9 a.m. to 1 p.m. at St. Vincent de Paul, 839 Front St., Needles.\nFree to low income county residents, commodity distribution is coordinated by Community Action Partnership of San Bernardino County. Visit www.sbcounty.gov/capsbc/; call 909-723-1500.\nRec to increase water releases\nPAGE, Ariz. — The Bureau of Reclamation is to increase water releases from Glen Canyon Dam the week of Nov. 7 for a high flow experiment. Peak magnitude is expected to be 36,000 cubic feet per second for 96 hours to move accumulated sediment downstream to help rebuild beaches and backwater habitats.\nThe experiment will not change the total annual amount of water released from Lake Powell to Lake Mead. Releases later in the water year will be adjusted to compensate for the high volume released during this high flow experiment.\nVFW plans activities\nMOHAVE VALLEY — Veterans of Foreign Wars Post 404 offers a variety of special activities for members and guests. The post is at 10287 Barrackman Rd. in Mohave Valley. Call 928-788-3202.\n• Thursday, Nov. 10, bartenders serve a crock pot lunch from 11 a.m. to 2 p.m.\n• Friday, Nov. 11, the Starrtroupers perform their ‘Sentimental Journey’ show at 5 p.m.\n• Weekend: The Post and Auxiliary hold their Buddy Poppy drive from 8 a.m. to 4 p.m. Nov. 11, 12 and 13 at Ace Hardware, Safeway and Smith’s in Mohave Valley and the Avi Resort and Casino. Donations for poppies benefit the relief fund, which helps veterans and their families.\n• Saturday, Nov. 12, the Post serves a steak dinner from 5 to 7 p.m. Karaoke will be provided.\n• Sunday, Nov. 13, the Auxiliary serve an S.O.S. breakfast or a basic breakfast from 9 to 11 a.m.\n• Monday, Nov. 14, Monday Night Football and food begins at 5 p.m.\n• Tuesday, Nov. 15, Wii league bowling and food starts at 4 p.m.\nMotorcycle parts rummage\nBULLHEAD CITY — Eagle Motorcycle Parts and Hooch’s 95 Bar and Grill team up for a ‘hardly used motorcycle parts and accessories rummage sale and swap meet’ on Saturday, Nov. 19.\nThe event runs from 10 a.m. to 2 p.m. at Eagle, 2106 Hwy. 95 in Bullhead City. Booths go for $10 in advance, $15 on the day of the sale. To reserve one send email to michelle@eaglemotorcyclerentals.com or call 928-257-4332. Hooch’s will be barbecuing on the site.\nWeather station down\nNEEDLES — For the whole month of October the National Weather Service’s Needles Weather Station was off line due to a part that failed and was in short supply.\nThe part has now been replaced and the Needles Weather Station is now fully operational and should be stable from here on out, according to the Las Vegas office of the NWS.\nA violent storm knocked the station off line on Aug. 26. There was no speculation if the two incidents were related.\nWomen’s council to meet\nBULLHEAD CITY — The November luncheon meeting of the Colorado River Women’s Council will be held Thursday, Nov. 10.\nThe meeting begins at 11 a.m. MST in the Bullhead Area Chamber of Commerce building, 1251 Hwy. 95.\nContact Heather Brennan, heather@hzbaz.com; 702-325-4565.\nHoliday counting down at library\nNEEDLES — The San Bernardino County Public Library is offering its first ever Holiday Countdown with an assortment of fun items. Incentive rewards are offered for every 30 items checked out through Dec. 29, including:\nNov. 1-15: Pez candy dispensers with characters from Frozen, Disney Pixar, Hello Kitty and Teenage Mutant Ninja Turtles.\nNov. 16 – 30: Library tumblers in various colors.\nDec. 1 – 15: Star Wars key chains, starring Yoda and Darth Vader.\nDec. 16 – 29: Superhero Brick Characters featuring Iron Man, Spider-Man, Captain America, and more.\nLimits on rewards are subject only to available supply. Visit the Needles Branch Library, 1111 Bailey Ave. at J Street; call 760-326-9255.\nLibrary offers special programs\nNEEDLES — The Needles branch of the San Bernardino County Library begins a new cycle of special programs through Nov. 19.\n• Mondays from noon to 1 p.m. ‘Tiny Hoppers’ inspires interaction between toddler and parent, focusing on development of gross motor skills, following directions, body awareness and a sense of rhythm.\n• Wednesdays from 3 to 4 p.m. Storytime for all ages provides fun for the whole family when books meet songs, rhymes, puppets and more.\n• A book club for adults meets from 11:30 a.m. to 12:30 p.m. Thursdays Nov. 10; Dec. 1 and 15.\n• The library joins the entire world in celebrating Native American Heritage Month in November. Visit the library catalog to learn more about America’s first people.\n• Thanksgiving is the theme Tuesday, Nov. 15, from 3 to 4 p.m. Read ‘Run Turkey Run,’ make a leaf wreath, try turkey skee ball.\n• Tuesday, Dec. 20, from 3 to 4 p.m. board The Polar Express, make a snow globe, play winter bingo and enjoy a snowball toss.\nHistorical society turns 25\nBULLHEAD CITY — The Tri-state community is invited to celebrate the 25th anniversary of the Colorado River Historical Society Museum and Heritage Days from 10 a.m. to 2 p.m. Saturday, Nov. 12.\nThe celebration takes place at Colorado River Heritage Center in Community Park, 1251 Hwy. 95 in Bullhead City. The event offers living history presentations, displays of regional history and American Heroes, plus prizes at an old fashioned cakewalk. Hot dogs, soda and water will be available for purchase. Call the CRHSM at 928-754-3399.\nExperience dementia\nBULLHEAD CITY — Gain some idea of what those with dementia suffer from in a Virtual Dementia Tour experience offered Nov. 16 and 17 at Joshua Springs Senior Living community. The free program is expected to fill quickly, make reservations by calling 928-763-1212.\nTours lasting about 45 minutes will be offered Wednesday from 10 a.m. to 4 p.m. and Thursday from 4 to 7 p.m. The program commemorates National Alzheimer’s Disease Awareness Month.\nFeed a Family program launched\nNEEDLES — Residents of Needles, Laughlin, Lake Havasu City, Kingman, Golden Valley and Bullhead City stand to benefit in the fifth year of the Feed a Family program launched by Laughlin’s Aquarius Casino Resort.\nThe Women’s Club of Needles coordinates distribution of food contributed locally by the program.\nThrough Dec. 25 Aquarius Ace-Play cardholders can contribute points toward a Thanksgiving or Christmas meal for families in need. A box of food large enough for a family of four is purchased for every 12,000 points contributed. Last year the program fed 1,140 families; this year’s goal is to exceed 12,000.\nJoin Boom Box Parade\nBULLHEAD CITY — The Colorado River Women’s Council presents the Christmas Boom Box Parade at 6 p.m. MST Friday, Dec. 2.\nFor entry information contact Cathy Stubblefield at 928-727-5173 or Louise Zaborsky at 928-763-3646. This year’s themes are How the Grinch Stole Christmas and the Spirit of Giving.\nJoin religious education program\nNEEDLES — St. Ann’s Catholic Church has begun their religious education program for students in grades one through 12. Classes are held every Sunday from 9:15 to 11:45 a.m. which includes the Mass.\nRefer questions to Diane Eaton of the religious education program. Call the parish center at 760-326-2721 between 8 a.m. and noon weekdays.\nApply to service academy\nYUCAIPA — Service academy nomination forms must be submitted to the district office of Dist. 8 U.S. Rep. Paul Cook by Nov. 28.\nVisit http://cook.house.gov to download the forms and check criteria to be eligible for a congressional nomination. Call Jan Leja at 909-707-4900.\nTax program reinstated\nSAN BERNARDINO — The state controller’s office has reinstated the Property Tax Postponement Program after it was suspended by the legislature in 2009 due to lack of funding, according to Oscar Valdez, county tax collector.\nThe reinstated program allows low-income seniors and disabled individuals to defer residential property tax payments for current-year taxes.\nFunding is limited, applications will be processed on a first-come, first-served basis. Get applications at 268 West Hospitality Lane in San Bernardino; online at www.sco.ca.gov under the Public Services tab; or by calling 800-952-5661.", "url": "https://apnews.com/cd816aa50ad0415e810321f19833ad13"}