{"authors": ["Premilla Nadasen", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:28", "date_modify": "2020-05-04 19:50:28", "date_publish": "2016-02-16 00:00:00", "description": null, "filename": "2016_02__1588621828.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2016/02/16173700/clinton.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_02__1588621828.html", "title": "How a Democrat Killed Welfare", "title_page": "How a Democrat Killed Welfare", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Bill Clinton’s 1992 election was meant to be a turning point in American politics. Liberals breathed a sigh of relief, believing him to be a much-needed break from the Reagan-Bush era of “small government” and social welfare cuts.\nBut the optimism surrounding Clinton’s election — and favorable assessments of his time in office since — ignore the destruction his administration brought to poor and working people, especially African Americans, and mask not only the continuation but intensification of anti-poor policies. Rather than offering a reprieve from punitive austerity, Clinton took the Reagan-Bush agenda a step further. If his administration was a turning point, it turned us in the wrong direction.\nIn 1994, Clinton signed the Violent Crime Control and Law Enforcement Act, the largest crime bill in history, which allocated $10 billion for prison construction, expanded the death penalty, and eliminated federal funding for inmate education. The act intensified police surveillance and racial profiling, and locked up millions for nonviolent offenses such as drug possession. It helped usher in the era of mass incarceration that devastated communities of color (for which Clinton himself has recently apologized).\nClinton’s simultaneous expansion of federal law enforcement and shrinking of the federal workforce to its lowest level in thirty years reallocated taxpayer dollars from employing people in social service jobs to putting more cops on the streets.\nThe starkest example of the many racist and anti-poor measures directed at African Americans and passed during his administration was the 1996 welfare reform bill, which transformed welfare from an exclusive and unequal cash assistance system that stigmatized its recipients into one that actually criminalized them.\nThe Personal Responsibility and Work Opportunity Reconciliation Act ended traditional welfare by turning a federal entitlement, Aid to Families with Dependent Children (AFDC), into block grants, or Temporary Assistance to Needy Families (TANF). TANF established tougher mandates on poor single mothers and gave states more flexibility in how they spent welfare dollars (opening the door for increased discrimination against minorities).\nIt prohibits anyone from receiving assistance for more than two consecutive years or for more than five years over the course of their life. The act also requires aid recipients to be employed, in most cases, at least thirty hours a week to get their welfare checks, amounting to an hourly wage well below the legal minimum.\nOnce recipients reach their program time limit, TANF forces them even further into the labor market with little consideration of how they could ensure their children are properly cared for or whether paid employment will earn them an adequate wage. Many more are not even able to find work. A 2012 report by the Urban Institute concluded that for recipients with barriers to employment, TANF did little to help them find jobs.\nSweeping in scope, TANF contains clauses to bolster marriage, mandate job training, and offer parenting classes. The “flexibility” that was a hallmark of the welfare reform bill enabled states to shift welfare funds away from direct cash assistance toward child care programs or subsidies for companies hiring welfare recipients, meaning that a greater portion of public welfare dollars went to the private sector.\nStates were pressured to reduce welfare rolls — now the singular quantitative measure of success for the program — and used multiple strategies to deter the needy from applying for aid. They implemented complicated and demeaning application procedures and relied on fingerprinting and drug testing to weed out the “criminal element” — even though there was little evidence of widespread criminal activity among recipients.\nThe net result was that all recipients and applicants were assumed to be potential criminals. Surveillance of low-income women punished black women in disproportionate numbers, resulting in more black children in foster care and black women in prison. Today, welfare and law enforcement work together to closely monitor the parenting of poor mothers.\nThese punitive policies were not new, but rather an extension of a long, racialized attack on welfare. AFDC was not controversial when it was instituted in the 1930s. Many people subscribed to traditional ideas about gender roles, believing that poor single mothers without a male breadwinner should be supported by the state in order to enable them to stay home and care for their children.\nThe overwhelming majority of recipients at the time, however, were white women. Women of color were considered less deserving of assistance. State and local social administrators of AFDC, especially in the South, systematically excluded African Americans and Mexican Americans from welfare receipt through “suitable home clauses” and “employable mother laws,” which denied assistance to mothers who didn’t keep “proper” homes or who it was believed could get a job and become self-supporting.\nAs black migration to the North intensified, more women of color applied for assistance, resulting in opposition to the welfare program. Journalists wrote about welfare fraud and the “problem” of black migration, and there were growing calls to get people off the rolls. In 1967, the Johnson administration instituted a Work Incentive Program (WIN), the first-ever mandatory federal employment rule for AFDC, requiring states to direct a portion of their welfare population to employment programs.\nThis landmark legislation shifted the role of welfare away from support for single mothers toward one of requiring those mothers to take paid employment outside the home. Although symbolically important because it signaled a new direction in federal policy, WIN was never adequately funded nor effectively enforced. The welfare rights movement in the 1960s and 1970s opposed the mandatory work rules and fought for higher monthly benefits, tempering some of these regressive policies. But only temporarily.\nThe punitive approach to addressing poverty was a result of the way race and poverty had become intertwined in the national debate. In the 1960s, urban social disorder, black demands for economic equality, and federal anti-poverty initiatives drew the nation’s attention to the persistent problem of black poverty. But the dominant liberal approach explained poverty as a product of black culture, reinforcing the notion that certain poor people were responsible for their own poverty.\nMost notoriously articulated by Daniel Patrick Moynihan in “The Negro Family: The Case for National Action,” the culture of poverty argument suggested that a dysfunctional family structure — in particular single-parent families — was a primary reason for persistent African-American inequality.\nThe solution became one of attempting to instill proper values of work and marriage in black men and women. Poor black women were demonized as “welfare queens,” a trope popularized by Reagan in the 1970s and 1980s, which implied that black women chose welfare over work and milked the system for all it was worth. This rhetoric was used to justify sweeping cuts in welfare spending.\nLikewise, Clinton’s welfare reform bill was rooted in a culture of poverty argument, evidenced by his racially coded language of dependency and people taking advantage of the system. Stereotypes about women were the foundation of the 1996 welfare reform debate.\nClinton alluded to the fear of black street crime, drug use, crack babies, the breakdown of the family, and the drain on public dollars. His primary goal in dismantling AFDC, as he put it, was to end the “cycle of dependence” and “achieve a national welfare reform bill that will make work and responsibility the law of the land.”\nClinton did not offer a departure from either earlier liberal policies that blamed the poor for their poverty or neoliberal economics. Instead, he turned what had been a few piecemeal reforms into a systematic overhaul of federal policy that led to the criminalization of the welfare poor. He redirected state resources away from financial support for the needy and toward surveillance and criminalization.\nIn an era of market worship, those who couldn’t demonstrate self-reliance or independence were identified not only as unworthy of assistance, but as a potential threat to the core institutions of American society.\nClinton’s dismantling of welfare, couched in a language of personal responsibility and public policy correction, was the culmination of a trend among both Democrats and Republicans to deter and discourage poor women of color from applying for assistance. In this regard, there was little new about the “New Democrat.”", "url": "https://www.jacobinmag.com/2016/02/welfare-reform-bill-hillary-clinton-tanf-poverty-dlc/"}