{"authors": ["Julius Whigham Ii"], "date_download": "2020-05-04 20:15:16", "date_modify": "2020-05-04 20:15:16", "date_publish": "2016-09-10 00:29:36", "description": "Two 13-year-old boys were arrested Friday on allegationsthat they hurled large rocks at passing cars in Palm City, theMartin County Sheriff’s Officesaid. The boys confessed to throwing rocks...", "filename": "_a15c60febabf44d3ae2b700c13ad87b0_1588623316.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a15c60febabf44d3ae2b700c13ad87b0_1588623316.html", "title": "Martin sheriff: Two teens charged with throwing rocks at cars", "title_page": "Martin sheriff: Two teens charged with throwing rocks at cars", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Two 13-year-old boys were arrested Friday on allegationsthat they hurled large rocks at passing cars in Palm City, theMartin County Sheriff’s Officesaid.\nThe boys confessed to throwing rocks on separate dates at cars driving along Southwest High Meadows Avenue, the sheriff’s office said. They were taken to the Martin County Jail, then transferred to the juvenile detention center in Fort Pierce. The teens are being charged with five felonies, including throwing a deadly missile into an occupied vehicle and aggravated battery, the sheriff’s office says.\n-\n» Download our PostNOW app to get the latest Breaking News\nThe Palm Beach Post is not identifying the teens because they have not been charged as adults.\nSheriff’s officials say two people were injured in one of the rock-throwing incidents when a driver and passenger were hit by a 16-ounce rock and flying glass. There were at least six victims and investigators expect that others will come forward, the sheriff’s office said.\nLast week, deputies began investigating reports of rocks being thrown at cars near the Sunset Trace development. One woman told deputies she had rocks thrown at her car in mid-August, according to a probable-cause affidavit. On Sept. 2, a man was injured as a large rock struck his car as he drove past the Sunset Trace development.\nInvestigators were able to locate the suspects with the help of students from Hidden Oaks Middle School, the sheriff’s office said.", "url": "https://apnews.com/a15c60febabf44d3ae2b700c13ad87b0"}