{"authors": ["Lois Weiner", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:55:32", "date_modify": "2020-05-04 19:55:32", "date_publish": "2016-09-17 00:00:00", "description": null, "filename": "2016_09_labor-day-unions-militancy-bernie-sanders_1588622132.html", "image_url": "https://images.jacobinmag.com/2016/09/17230605/teacher-rally-e1473083528115-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09_labor-day-unions-militancy-bernie-sanders_1588622132.html", "title": "Dream Big on Labor Day", "title_page": "Dream Big on Labor Day", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In presidential election years, by Labor Day most US labor unions have long halted organizing, shifting their resources to elect a Democrat to the White House. Members are told having a Democratic president will give us — that is, union officials — access to politicians with whom they can negotiate over labor’s concerns.\nThis year is no exception. AFL-CIO president Richard Trumka, along with almost every union (most recently the Teamsters), urges members to help elect Hillary Clinton, in order to stop Donald Trump and protect what workers have earned. It’s a strategy that labor has employed for decades. And it’s one we have to abandon — not only if we’re going to make advances, but even if we are going to truly safeguard what has been won.\nJust this year, the Sanders campaign so clearly showed labor activists and officials how to expand prospects for progressive change by challenging the bipartisan status quo and articulating a program for the real needs of working people. Bernie should have taught them that to win political battles and economic gains labor needs to argue for a new politics.\nInstead unions try to frighten us to vote for a candidate who will, at best, continue policies that have degraded work and life for the vast majority of working people.\nYes, we must protect what the working class and unions have earned through generations of struggle and sacrifice — gains, it should be noted, that have been seriously compromised by the Democrats’ acquiescence to the corporate “common sense” of a social order that benefits the wealthy at the expense of the rest of us. But if we want to safeguard remaining protections — to say nothing of winning improvements — we’re undercutting ourselves by backing Clinton, a candidate who has sold out “on welfare, crime, race, labor, trade, drugs, and media.”\nAt the very least, if labor is going to try to rally votes for Clinton, it needs to do so with a program aimed at creating a progressive movement that will fight Clinton on her agenda. Put the choice as Adolph Reed has: defeating Trump is essential and that means voting for a candidate who is a “lying neoliberal war-monger.” Yet organized labor’s strategy with endorsing Clinton has been the exact opposite.\nLabor officialdom and even much of the movement’s supposed left wing has adopted a seemingly practical policy that is in fact self-defeating.\nWe are told we don’t need to build an independent party because we can support the Democratic Party to achieve the “left wing of the possible,” as the labor-supported Working Families Party (WFP) contends. But this strategy severely constrains us in its definition of what is possible. The labor-friendly stance the WFP advocates as the “left wing” of the possible is already endorsed in liberal media, even in the business section, with repeated stories suggesting that growing social inequality is destabilizing the society (and, implicitly, profits). Increasingly stories in popular media explain that unions are needed to provide a social ballast.\nThe political tide has turned in favor of unions, and yet labor refuses to use this momentum. And it continues backing a party that can be counted on to betray even the tepid promises it makes during campaigns.\nThough the WFP claimed success in helping elect Democrat Dannel Malloy as Connecticut governor, the party now calls Malloy a “major disappointment… pulling from the Republican playbook.” The WFP must now organize against their winning candidate, to pressure Malloy to support legislation making large, profitable corporations pay a fee for employing workers at less than $15 per hour.\nThe unions have embraced the idea that we should love Clinton and the Democrats because with them, labor will have a “seat at the table.” This “seat” is strictly for union officials to have personal access to politicians, a relationship that is assumed to be more powerful than mobilization, force exerted on the streets and in the workplace, and other forms of collective action.\nA seat at the table won’t change the menu: austerity and dispossession. Union officials will continue to be limited to begging for scraps without a far stronger rank-and-file allied with social movements to alter power relations.\nLabor Day is a time to remember how the legal protections workers still have were won by scores of people fighting tooth and nail for what they were told was impossible. We continue their struggle by supporting workers organizing for voice, dignity, and power at the workplace and within their own unions.\nFor example, New York City’s newly organized childcare workers, mostly women of color earning poverty-level wages, have just voted down a miserable settlement their union insisted was the best that could be done. Their action shows how members can take back the unions, democratize them and force them to fight for what they need — even in the face of a labor apparatus that dismisses what members want as impossible.\nThis Labor Day, ditch labor officialdom’s embrace of capitalism’s myopic, self-serving vision of what’s possible. Instead, dream and organize for what we need and deserve, not what we’re told we must accept.", "url": "https://www.jacobinmag.com/2016/09/labor-day-unions-militancy-bernie-sanders"}