{"authors": ["Salem News"], "date_download": "2020-05-04 20:06:45", "date_modify": "2020-05-04 20:06:45", "date_publish": "2016-08-08 04:00:00", "description": "By KEVIN HOWELL Staff Writer The annual Leetonia Artisans Festival will return this year, but with a new name and date.", "filename": "_de4fb74548ec4583a77bc0f3988691f7_1588622805.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_de4fb74548ec4583a77bc0f3988691f7_1588622805.html", "title": "Festival in the Park scheduled Aug. 28 at Wick Park", "title_page": "Festival in the Park scheduled Aug. 28 at Wick Park", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By KEVIN HOWELL\nStaff Writer\nThe annual Leetonia Artisans Festival will return this year, but with a new name and date.\nNow called the Festival in the Park, the event has been moved up a month, scheduled for 10 a.m. to 5 p.m. Aug. 28 in Wick Park. Admission and parking is free.\nAccording to event co-chair Toni Manzetti, the festival was renamed this year since the original founder, Ruthie Roose, passed away last year - the 30th anniversary of the event. She said in tribute to Roose, the festival committee elected to rename the event. The date has been moved up a month in an attempt to avoid other festivals in September, she added.\n“The name and time may be different, but the spirit still remains,” Manzetti said.\nIn addition to craft and food vendors, the festival will include a full slate of entertainment. This year’s schedule includes DJ Jack Cavanaugh, Pastor Kari Lankford, Niki Slaven, the Leetonia High School marching band, The Beat Brothers and tentatively Jodie Lewis. There will also be a car show sponsored by the Washingtonville VFW.\nNotable additions to this year’s schedule include the return of an auction and the celebration of the village’s sesquicentennial anniversary.\nManzetti said that following the death of Roose, the return of the auction is another tribute. John Hively will conduct the auction at 4 p.m., selling items donated by vendors.\nThe village will also mark its sesquicentennial anniversary this year and local historian Linda Lutz will display a continual loop of Leetonia background information and photos to celebrate. There will also be a number of commemorative items available for purchase.\nVendor spaces 15-foot by 15-foot cost $30 with a donated auction item and $40 without, food vendors are $50 and church and non-profit are $10. The deadline for reservations is Aug. 20; a $5 fee will be charged for those received after that date. Forms are available online at leetonia.org.\nManzetti said there are currently 35 vendors signed up, but the committee hopes to see 50 or 60 for the event.\nAll proceeds from the festival benefit the parks and recreation board.\nFor information contact Manzetti at 330-853-5489 or co-chair Sue Buchanan at 330-427-1713.", "url": "https://apnews.com/de4fb74548ec4583a77bc0f3988691f7"}