{"authors": ["The New Mexican"], "date_download": "2020-05-04 20:05:44", "date_modify": "2020-05-04 20:05:44", "date_publish": "2016-10-21 05:50:00", "description": "Thursday afternoon was a must-win for the St. Michael’s Horsemen. So, they took care of business with a convincing 7-1 win over Las Vegas Robertson in a District 2-1A/4A boys soccer match to...", "filename": "_75ef3f50bbbd477783d33cc9781110ab_1588622744.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_75ef3f50bbbd477783d33cc9781110ab_1588622744.html", "title": "Prep roundup: St. Michael’s boys soccer beats Robertson, 7-1", "title_page": "Prep roundup: St. Michael’s boys soccer beats Robertson, 7-1", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Thursday afternoon was a must-win for the St. Michael’s Horsemen.\nSo, they took care of business with a convincing 7-1 win over Las Vegas Robertson in a District 2-1A/4A boys soccer match to move into third place with just one district match left. That, too, is a must-win match in the eyes of head coach Mike Feldewert as St. Michael’s takes on Taos at Eco Park on Saturday.\n“This was the first step to taking care of business,” Feldewert said.\nHowever, the Horsemen (7-11-1 overall, 6-4-1 2-1A/4A) needed to beat the Cardinals in order to improve their standing in the district but also their odds of reaching the Class 1A/4A State Tournament.\nIt was a 1-all score when Justice Johnson scored his second goal of the match off a corner kick, just like he did on his first goal. The score stayed that way until the second half, and St. Michael’s unleashed a scoring onslaught. Lucas Curry opened the half with a penalty kick goal to make it 3-1, then came goals from Berkley Reynolds, Kiran Smelser, Hayden Lee (his first as a varsity player) and Connor Crumm.\nIt was a good sign for the Horsemen, considering that junior forward Graham Gesten missed the match to heal his strained hamstring he suffered two weeks ago.\n“Justice, he’s just a sophomore,” Feldewert said. “Berkley scores, and he’s a freshman. Kiran scores, and he’s an eighth-grader. That’s good production out of your youngsters.”\nSanta Fe Prep 5, Abq. Sandia Prep 2\nThe Blue Griffins were looking to make a statement in a nondistrict match at Sun Mountain Field, and they did by taking a 4-1 lead at the half against the Sundevils.\nPatrick Boyd recorded his third hat trick of the season, with two coming in the first half, while Trevor Wilson and Elliott Thornburg each had a goal to round out the scoring. Prep head coach Hersch Wilson lauded the defensive effort of Harrison Trainor.\n“He’s just back there, and he’s solid,” Wilson said. “I don’t think his heart rate ever gets above 90 [beats per minute]. He’s just so calm and cool.”\nThe Blue Griffins (14-3) finish the regular season on the road at Las Vegas Robertson on Saturday.\nMonte del Sol 12, Questa 2\nIt’s rare that the Dragons invoke the 10-goal mercy rule on an opponent, which happened against the Wildcats in a 2-1A/4A match at the Municipal Recreation Complex. However, Monte del Sol head coach Mazatl Galindo praised Questa’s effort.\n“I don’t think the final score is as important as the wonderful bunch of kids from Questa,” Galindo said. “That is what all coaches should strive for, and I know I do. A bunch of kids who are trying to establish a program. They never give up. They always compete and keep their chin up and show class.”\nEsteban Quintero led the Dragons with seven goals, while Ulises Gutierrez added a pair of goals. Jose Orozco had three assists to go with one goal.\nMonte del Sol ends the season at 13-3-2, and 9-2-1 in district, good for second place.\nGirls soccer\nSanta Fe Prep 9, Pojoaque Valley 0\nThe Blue Griffins (11-6, 6-3) scored six goals in the first half and cruised to a 2-1A/4A win over the Elkettes at Chris Peterson Memorial Complex.\nLynn Robey and Anna Swanson each had two goals in the opening half for Prep, while Abby Stranahan and Mackenzie Allison completed the scoring ladder in the opening 40 minutes. Hayden Colfax, Ariane Talou and Olivia Lenfestey each had a goal in the second half.\n“It was a beautiful night, and I was impressed as always at [the Elkettes’] resilience to play us and they played well,” Prep head coach Steph Coppola said. “It was a well-rounded effort by everybody,”\nSanta Fe Prep’s last district match will be an away game against Robertson on Saturday.\nSt. Michael’s 7, Las Vegas Robertson 1\nThe Lady Horsemen continued their 2-1A/4A winning streak to 52 by cruising past the Lady Cardinals in Las Vegas.\n“It was a cold night, but a warm ride back,” St. Michael’s head coach Gerzain Chavez said.\nSt. Michael’s (14-5, 9-0) built a 4-0 lead in the first half. Monse Camarena and Tiana Baca each scored two goals.\nThe Lady Horsemen look to continue their winning ways through their last district match against Taos on Saturday.\nVolleyball\nSt. Michael’s 3, Pojoaque Valley 0\nJust like they did last week in a sweep of Las Vegas Robertson, the Lady Horsemen exacted a measure of revenge against a 2-4A foe in a sweep of the Elkettes in Perez-Shelley Gymnasium. St. Michael’s (13-6, 5-2) won 25-21, 25-21, 25-20.\n“We’ve been working hard in practice to run a strong offense and defense as a team,” Lady Horsemen head coach Josie Adams. “We would also really like to congratulate our five senior girls for winning their last home game on senior night.”\nThe Lady Horsemen will play their district finale Oct. 27 against West Las Vegas.", "url": "https://apnews.com/75ef3f50bbbd477783d33cc9781110ab"}