{"authors": ["Amna A. Akbar", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:54", "date_modify": "2020-05-04 19:51:54", "date_publish": "2016-08-04 00:00:00", "description": null, "filename": "2016_08__1588621914.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2016/08/04100519/blm.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_08__1588621914.html", "title": "Policing Black Radicalism", "title_page": "Policing Black Radicalism", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The most prominent image of Micah Johnson comes from his Facebook: arrayed in a purple patterned dashiki, fist raised, expression somber. Reports after the Dallas shooting heavily emphasized the symbolism in the photograph. The dashiki and fist — widespread artifacts of black power, love, and resistance — became suggestions of motive, red flags that should have brought on police scrutiny sooner.\nThese symbols, summoned as indicators of motive for Johnson’s murder of five Dallas police officers, telegraph something important about our regime of policing: whiteness is the baseline for lawfulness; and assertions of political and cultural identity in communities of color are abnormal, suspect deviations.\nThat is how Johnson’s military training and participation in the US war in Afghanistan become less explanatory of his shooting than his dashiki.\nAs the press and police pivoted from the dashiki and fist to make unlikely connections between Johnson’s shooting, black nationalism, and #BlackLivesMatter organizing, it became almost certain that we will see increased surveillance and infiltration of black communities and black radical spaces.\nThe Feds have been scouring social media accounts of black organizers and flying surveillance planes over protests since Ferguson. (Not to mention local police surveillance.) But reports of knocks on the doors of leaders in the Movement for Black Lives suggest surveillance and infiltration will intensify.\nOf course, such policing tactics were put to use in past eras of rebellion: going back to European colonization of the United States, each wave of black resistance has been met with repression and surveillance.\nThis time, the named target will be those willing to take up arms against police, but the casualties will ripple through the black youth movement, with its battle cry for a more equal and free society.\nThe obvious antecedent for efforts like these is J. Edgar Hoover’s Civil Rights–era Counter Intelligence Program (COINTELPRO). In the name of law and order, the FBI spied on, disrupted, infiltrated, and discredited radical political formations from the mid 1950s into the 1970s.\nThe agency’s focus was black leadership and organizations: the program famously targeted Malcolm X and Martin Luther King Jr, but it also focused on undermining powerful collectives of young people like the Black Panther Party and the Young Lords.\nBut there is a more recent precursor to politically motivated surveillance: the Countering Violent Extremism (CVE) program championed by the Obama administration. In the last eight years, the FBI has developed a sprawling apparatus to police the ideas and collective formations that take shape in Muslim communities.\nTactics include extensive knock-and-talks, aggressive deployment of informants and undercover police — to the point of constructing and provoking plots — regular combing of social media, and surveillance of spaces where Muslims gather, from the mosque to Muslim student associations.\nThe policing attempts to catalog ideas that correlate, allegedly, with greater likelihood of committing terrorist acts. The theory is specious for all sorts of reasons, including — as with the case of Micah Johnson’s portrayal in the media — the way it collapses expressions of culture and identity with threats to the state.\nYet across the country the FBI and joint terrorism task forces have collaborated with state and local police to monitor and influence the political ideas taking shape in Muslim communities.\nThe CVE framework poses American and Muslim identities as opposite poles, and identifies manifestations of devout religious practice — growing a beard, regularly attending a mosque — and critiques of US treatment of Muslims at home and abroad as indicators of growing extremism.\nGovernment reports inflate and collapse connections between critical discourse, commonplace cultural practices, and willingness to undertake violence against the state. In the way it situates adopting Muslim cultural practices or articulating critique of US foreign policy as indicators of proclivity toward terrorism, the framework demands submersion of Muslim identity in service of the American project.\nBut the United States does treat Muslims around the world as suspect: it kills, captures, surveils, bombs, dehumanizes, and occupies them in the name of global progress, peace, and security. Muslims live this reality across diasporas.\nBut under the lens of CVE, naming this dispossession, dehumanization, and violence is distorted from an expression of solidarity, shared humanity, or critical politics into a sign of disloyalty.\nThis kind of policing generates a fear among Muslims of exploring or pushing critique — let alone organizing resistance — at the same time it justifies widespread surveillance of all Muslims.\nThe message of CVE policing is clear: we are here, we are watching. What you say will be held against you. When the state targets critique and resistance of state violence in communities of color, it punishes speech that is central to the articulation of what it means to be a person of color in this country.\nPoor communities of color are on the receiving end of the most brutality and inequality enacted by the state: their experiences constitute the most basic contradictions of a liberal democratic society, where the promise of equality and freedom coexists with structural inequality and violence.\nCVE taxes and undermines the possibilities of resistance. It compels acquiescence to the social, racialized order. It forces code switching. It represses dissent and stifles rebellion. It destroys an ability to transform the world, because it undermines the imagination of those people who have the largest stake in changing it.\nUnder a CVE framework, naming your condition and expressing anger about its causes and consequences become signs of dangerous difference. Resistance to white supremacy and cultural and political expressions of self become justifications for policing.\nThe policing of opinions and resistance easily expands from those who may be expressing radical difference to all those within the target community — American Muslims, or black folks. We should be equally concerned with both.\nThe suggestion that Micah Johnson’s blackness is the reason that he killed police officers suggests that CVE is coming home to black America — and doubly so to those already targeted as Muslims.\nThere will be door knocks, more aggressive informants and undercovers, close examinations of Twitter, Snapchat, and Facebook feeds. While the public face of any such program will be focused on black extremism, the black youth movement will be a central target.\nThe black youth movement has brought international attention to America’s cardinal and ongoing sins against black people: Black communities are surveiled, dispossessed, dehumanized, killed, arrested, brutalized, and torn apart by the state every day.\nThe movement has reconfigured long-standing conversations about race, policing, and mass incarceration into more honest referendums on the state of white supremacy in this country. It has forced a more probing conversation about the purpose and history of policing in the United States.\nIn the liberal imagination, policing is about law and order, a neutral value that serves all. In the radical imagination, American law is anything but neutral, rooted as it is in the history of enslavement and colonization.\nPolicing is a tool of the unequal status quo, emerging out of slave patrols, to keep the dispossessed without property, the hungry without food, the insecure uncertain, while protecting the wealth of the wealthy and justifying the power of the state.\nThe initial images of policing in Ferguson were that of war: Michael Brown’s body in the street surrounded by police, tanks and tear gas aimed at the bodies of protesters. But if tanks, sirens, and bodies are the obvious footprint of policing, surveillance and infiltration are no less significant.\nNow, as ever, we should be paying attention to the narratives around criminality, and rallying to protect spaces for dissent and democracy. Policing enforces ideology, not just law.\nA CVE approach to policing will try to quash this naming, this protest, this rebellion. In the name of security, it will attempt to disrupt and dismantle this wave of black resistance. The only way to persist is for us — black and Muslim communities, and beyond — to come together to develop strategies of resistance and solidarity against the surveillance state.", "url": "https://www.jacobinmag.com/2016/08/cointelpro-fbi-black-panther-party-young-lords-hoover/"}