{"authors": ["Yanis Varoufakis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:21", "date_modify": "2020-05-04 19:58:21", "date_publish": "2016-09-17 00:00:00", "description": null, "filename": "2016_09__1588622301.html", "image_url": "https://images.jacobinmag.com/2016/09/17230602/euro-e1473048611941-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09__1588622301.html", "title": "Europe’s Left After Brexit", "title_page": "Europe’s Left After Brexit", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn just eleven months, the Greek “Oxi” and Brexit shook up both the European Union and Europe’s left. Exasperated by the EU’s mixture of authoritarianism and economic failure, a segment of Europe’s left is now calling for a “break with the EU,” which would mobilize left-wing support for exit referenda across the continent. Their analysis has come to be known simply as “Lexit.” DiEM25, the transnational Democracy in Europe Movement, rejects the Lexit logic in favor of an alternative agenda for Europe’s progressives. Undoubtedly, the Left must confront — with all its energy and imagination — the European Union’s practice of depoliticizing decision-making. In fact, this task also falls on other European democrats, Greens, and liberals. These formations may not consider themselves Left, but share our duty to resist Brussels’s authoritarian incompetence. The question is not whether progressive forces must clash with the EU establishment and current practices. The question is in what context, and within what overarching political narrative, this confrontation should take place. Three options present themselves.\nOption 1: More Europe Standard variety euro-reformism — practiced typically by social democrats — calls for “more democracy,” “more Europe,” and “reformed institutions.” But this option is founded on a fallacy: the European Union has never suffered from a democratic deficit that could be rebalanced with more democracy and a few reforms. As I argue, the EU was intentionally constructed as a democracy-free zone that would keep the people out of decision-making and defer to a cartel of big business and international finance. Saying that the European Union suffers from a democratic deficit is like saying an astronaut on the moon suffers from an oxygen deficit. The standard process of inter-governmental deliberations and gradual treaty changes cannot hope to reform the European Union’s institutions. For this reason, calls for “more Europe” are misguided: under the present regime and with the existing institutions, this can only result in a European Austerity Union. This reformist position would likely formalize and legalize the Schäuble Plan and grant the European Union the power to veto national budgets, massively curtailing democracy across the federation. In turn, the crisis afflicting Europe’s weakest citizens will deepen, the xenophobic right will gain strength, and the EU’s disintegration will speed up. With this in mind, pro-democracy progressives have no alternative besides spearheading a head-on clash with the European Union establishment. This brings us to the second and the third options.\nOption 2: Lexit Tariq Ali, among others, has eloquently made the case for left-directed exit referenda. Stathis Kouvelakis, post-Brexit, summed up the position: “we have to play the referendum game, while blocking the forces of the xenophobic and nationalist right from winning hegemony and diverting the popular revolt.” In short, to beat right-wing misanthropy, we have to support their referenda that will remove our states from the EU. But Lexit is neither realistic nor consistent with the Left’s fundamental principles. Most immediately, it is unlikely that exit referenda — movements that have been devised and led primarily by the Right — will help the Left block their opponents’ political ascendancy. But further, to do so would be to contradict some of the Left’s longest held convictions about social transformation. The Left used to be good at separating static from dynamic analyses. Since Marx, drawing on Hegel, prioritized process over outcomes, we took into account the direction of change, not just the state of the world. This distinction is crucial for our analysis of the European Union. For example, the position we should have taken before the creation of the common market and the eurozone cannot be the same after these institutions were established. It was, therefore, perfectly consistent to oppose Greece’s entry into the common market and into the eurozone and, later, to oppose Grexit. Even more significantly, our strategy depends greatly on whether we start with a borderless Europe in which workers exercise free movement or with the Europe of the early 1950s where nation-states controlled borders and used them to create a new category of proletarian called gastarbeiters. This last point highlights Lexit’s danger. Given that the European Union has established free movement, Lexit involves acquiescence to — if not actual support for — the reestablishment of national border controls, complete with barbed wire and armed guards. History should guide us. The Left should have demanded common minimum wages in exchange for its support for the single market. Instead, it hoped to enact them after its establishment, a goal that has been frustrated time and again. With that in mind, do Lexit supporters truly believe that the Left can surpass the xenophobic right by endorsing the latter’s call for building new fences? Further, Lexit would have ripple effects. For example, do the plan’s proponents believe that the Left will win discursive and policy wars against the fossil fuel industry after supporting the re-nationalization of environmental policy? If the European Union disintegrated under these conditions, the Left would face monumental defeats on both fronts.\nOption 3: Disobedience Within the EU The third option, proposed by DiEM25, rejects both the euro-reformist’s call for “more Europe” and Lexit’s support for abolishing the EU-level altogether. Instead, we suggest a pan-European movement of civil and governmental disobedience that will produce a surge of democratic opposition to how European Union elites do business at the local, national, and international levels. At DiEM25, we do not believe that the EU can be reformed through the usual policy-making channels, and certainly not by bending the existing rules on budget deficits by .5 or 1 percent of national income — as France’s, Italy’s, Spain’s and Portugal’s governments are doing. Vicenç Navarro recently wrote “parliaments still have power, including the power to question austerity policies.” This is technically correct, as the Syriza government’s first five months in power demonstrated. But Navarro is, regretfully, wrong when he uses the new Portuguese government as an example. He claims that the Socialist-led coalition “stopped the application of the austerity policies imposed by the European Commission.” I wish it were true. But before getting the mandate to form a government from troika-friendly, right-wing president Aníbal Cavaco Silva, the parties of the Portuguese left had to agree to the previous governments’ “commitments to the Eurogroup” — that is, they ceded to the troika’s existing program before their government even formed, confining themselves to only delaying the introduction of fresh austerity measures. So, yes, national parliaments and governments do still have power — the power to do what our Syriza government did during the Athens Spring, before capitulating on the night of the referendum. With the European Central Bank ready to start a bank run — or even close down a country’s banking system — a progressive national government can only use its power if it is prepared for a rupture with the troika. This is where DiEM25 agrees with the Lexit camp: a clash with the European Union establishment cannot be avoided. Where we diverge, however, is in their assumption that this can take the form of a campaign to leave the EU. We reject this wholeheartedly and suggest instead a campaign of willful disobedience, targeting the European Union’s unenforceable rules at the municipal, regional, and national levels while making no move whatsoever to leave. Undoubtedly, the institutions will threaten the rebel governments and finance ministers who adopt DiEM25’s agenda with expulsion, with panics, with “bank holidays” — just as they threatened the Greek government, and me personally, in 2015. When they do, it is crucial not to succumb to the fear of exit but to look them in the eye and say: Bring it on! The only thing we fear is your sole offering: the perpetuation of the debt-deflationary spiral that drives masses of Europeans into hopelessness and places them under the spell of bigotry. If we do not blink, then either they will blink — in which case the European Union will be transformed — or the EU will be torn asunder by its own establishment. If the Commission, the European Central Bank, Berlin, and Paris dismember the European Union to punish progressive governments that refuse to abide by their policies, it will galvanize progressive politics across Europe in a manner that Lexit could never do. Consider the profound difference between the following two situations. First, the European Union establishment threatens progressive, democratically elected governments with expulsion when they refuse to obey its authoritarian incompetence. Second, progressive national parties campaign alongside the xenophobic right for exit. This is the difference between clashing with the EU establishment in a manner that preserves the spirit of internationalism, demands pan-European action, and differentiates us fully from the xenophobic right, and walking hand-in-hand with nationalisms — and, inescapably, reinforcing their hegemony — while allowing the European Union to portray the Left as indistinguishable from the likes of Nigel Farage and Marine Le Pen. Naturally, the DiEM25 agenda must develop strategies that will allow our cities, regions, and nations to rebel against the European Union’s threats. It must also include plans to deal with the EU’s collapse if its establishment is foolish enough to make good on its threats against disobedient national governments. But these strategies and plans are profoundly different from initiating the European Union’s disintegration as the Left’s own objective. In short, DiEM25 refuses to endorse exit as an end-in-itself or even to deploy it as a threat. But we shall not be deterred from governmental disobedience when faced with the threat of forced exit.\nA New International The Left’s traditional internationalism founds DiEM25: our position on the European Union reflects precisely this. I hope my comrades will permit me to remind them that when Marx and Engels adopted “workers of the world, unite” as their slogan they did not reject the importance of national culture or of the nation-state. Rather, they rejected the idea of a national interest and the view that struggles must prioritize the nation-state level. DiEM25’s proposed rebellion would deliver authentic democracy to local governments, national governments, and the European Union. We do not prioritize the EU over the national level — as the reformists do — nor do we prioritize the national over the regional or the municipal level. Alas, several European leftists insist on the reverse: prioritizing the national over the international. Stefano Fassina, for example, takes DiEM25 to task by arguing — via Ralf Dahrendorf — that democracy at the EU level “is not possible… because a ‘European people,’ a European demos for a European democracy, doesn’t exist.” He goes on: among the idealists and the euro-fanatics, some still think that the European Union can transform itself into a kind of nation-state, only bigger: the United States of Europe. This left-wing objection to a pan-European movement defies understanding. In effect, it argues that supranational democracy cannot exist because a demos must be characterized by national and cultural homogeneity. I can just imagine Marx’s rage at hearing this! Just as I can imagine how puzzled it would leave the left-wing internationalists who dreamed of — and struggled for — a transnational republic. The Left, lest we forget, has traditionally opposed the bourgeois belief in a one-to-one relationship between a nation and a sovereign parliament. The Left countered that identity is created through political struggle, whether it be class struggle, postcolonial struggle, the struggle against patriarchy, the struggle to smash gender and sexual stereotypes, and so on. DiEM25, therefore, by calling for a pan-European campaign of disobedience against transnational elites — in order to create the European demos that will ensure democracy — aligns with the Left’s traditional approach. Fassina and others now attack this approach, arguing for a return to a one-nation-one-parliament-one-sovereignty politics, in which internationalism is reduced to cooperation between nation-states. Fassina evokes Antonio Gramsci to support his prioritization of the national level. He writes that Gramsci advocated for the category of “national-popular” to give popular roots and hegemonic capacity to that Italian Communist Party, which in its symbol had the red flag with a hammer and sickle resting on the flag of Italy. To be sure, Gramsci argued that, to achieve international progress, the Left had to create local and national progressive movements. But he did not prioritize the national over the transnational level nor argue that transnational democratic institutions are either infeasible or undesirable. In true Gramscian spirit, DiEM25 insists that our European rebellion should happen everywhere — in towns, in regions, in nation-state capitals, and in Brussels — without prioritizing one level over any other. Only through this pan-European network of rebel cities, prefectures, and national governments can a progressive movement become hegemonic in Italy, in Greece, in England — indeed anywhere. Someone may cheekily ask: “Why stop at the EU level? As internationalists, why don’t you campaign for worldwide democracy?” Our answer is that we do campaign for global democracy from an internationalist perspective. DiEM25 is building strong links with Bernie Sanders’s movement in the United States and is signing up members in Latin America, Australia, and Asia. But — for better or for worse — history has delivered a borderless EU, with some programs worth preserving. The Left must defend this absence of borders, these climate change policies, even the Erasmus program, which gives young Europeans the opportunity to mingle in a borderless educational system. Turning against these splendid artifacts of an otherwise regressive European Union would contradict the Left’s core principles.\nDiEM25’s Progressive Agenda for Europe Progressives must fight to re-politicize and re-democratize decision-making. Donald Trump in the United States, right-wing Brexiters in Britain, and Le Pen in France all rose up in the wake of an economic crisis caused by a twin crisis: the disaster of financialization and the failure of liberal democracy. The question for Europe’s Left, as well as for progressive liberals, Greens, feminists, and so on, is whether this struggle can be won through reform, exit, or, as DiEM25 suggests, a campaign of disobedience within but also against the European Union. DiEM25 was formed to build a genuine alternative: a borderless surge of unifying politics across Europe — EU and non-EU countries alike — based on an alliance of democrats across various political traditions at all levels of political engagement (towns, cities, regions, and states). To those who dismiss DiEM25’s call for a pan-European democratic movement as utopian, our answer is that transnational democracy remains a legitimate, realistic long-term goal, one that resonates with the Left’s time honored internationalism. But it must be accompanied by a precise plan for immediate action. First, oppose any talk of more Europe now, when reform would, under the present circumstances, translate into the iron cage of institutionalized austerity. Second, present Europeans with a blueprint to redeploy existing institutions in order to stem the economic crisis, reverse inequality, and reinvigorate hope. Third, ensure that this blueprint considers how to maintain internationalism in the event that the European Union establishment’s incompetent authoritarianism causes the its disintegration. “The EU will be democratized. Or it will disintegrate!” This remains DiEM25’s guiding pronouncement. We cannot predict which will occur, so we struggle for the former while preparing for the latter. And we do this by working towards a progressive agenda that engages the grassroots level and progressive experts. Its purpose? To defeat the worst enemy of European democracy: euro-TINA, the reactionary dogma that there is no alternative to current policies besides the European Union’s dismantlement. DiEM25’s antidote is, indeed, this progressive agenda, which we will be rolling out in consultation with local, regional, and national actors over the next eighteen months. Putting this together will demonstrate to defeated, disheartened, and disillusioned Europeans that, astonishingly, there is an alternative. The agenda will be pragmatic, radical, and comprehensive, comprising policies that can be implemented immediately to stabilize Europe’s social economy, while granting more sovereignty to city councils, prefectures, and national parliaments; proposing institutional interventions that will reduce the human cost if the euro collapses and the European Union fragments; and devising a process that enables Europeans to generate a shared identity with which to bolster their reinvigorated national cultures, parliaments, and local authorities. DiEM25’s Progressive Agenda for Europe will unify a progressive international to counter the nationalist international that is gaining strength all over the world.", "url": "https://www.jacobinmag.com/2016/09/european-union-strategy-democracy-yanis-varoufakis-diem25/"}