{"authors": ["T. Ballard Lesemann Special To The Post"], "date_download": "2020-05-04 20:06:41", "date_modify": "2020-05-04 20:06:41", "date_publish": "2016-11-16 19:00:00", "description": "A dynamic relationship between visual art, original music, and community-supportive local venues is well pronounced in Charleston these days, perhaps more lively and collaborative than ever...", "filename": "_9167dfb979354d8481ad681d9d2c9b99_1588622801.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9167dfb979354d8481ad681d9d2c9b99_1588622801.html", "title": "Pecha Kucha creates platform for local music as part of arts festival", "title_page": "Pecha Kucha creates platform for local music as part of arts festival", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A dynamic relationship between visual art, original music, and community-supportive local venues is well pronounced in Charleston these days, perhaps more lively and collaborative than ever before. A case in point happens Friday night when Parliament Charleston, the Charleston Music Hall and the Charleston Arts Festival partner up to examine, discuss and celebrate all dimensions of this artistic crossroads under the bill “Pecha Kucha XXV: All Things Musical.”\n“This is the third Pecha Kucha event to be held at the Charleston Music Hall,” says venue director and Parliament Charleston board member Charles Carmody. “It’s easy to accommodate the presentation and audience here. It fits well, I think, and it doesn’t cost a ton of money to bring in outside production.”\nCarmody worked closely with local arts enthusiast Terry Fox, a founding member of Parliament Charleston (a collective of local business owners, entrepreneurs and freelancers) to organize this edition of Pecha Kucha. “Being Pecha Kucha 25, we wanted it to be a bigger one, so we decided to do it ‘all things musical’” says Carmody.\n“Pecha Kucha XXV: All Things Musical” was initially booked for Oct. 5 at the venue, but the threat of Hurricane Matthew led to a postponement. Rescheduled for Nov. 18 with emcee Charlton Singleton at the helm, the event will feature eight locally based presenters — Jerrod Wilkins, Lisa Moran, Dan McCurry, Matt Monday, Ann Caldwell, Kelly Rae Smith, Alex Harris and Jonathan Gray — each of whom will be are allowed 20 “powerpoint slides.” Musical performances by Hunter Park (of She Returns From War), the Very Hypnotic Soul Band, and the Plantation Singers will be interspersed as well.\nAs the longtime musical director and conductor of the Charleston Jazz Orchestra, trumpeter and vocalist Singleton regularly works with a variety of colleagues. With his experience as the frontman at the quarterly CJO concerts on the Music Hall stage, he’ll certainly feel comfortable as he hosts the Pecha Kucha event.\n“Since this Pecha Kucha is ‘All Things Musical’ the show will obviously have that as the theme,” says Singleton. “I think that the versatility of all of the speakers and participants will be on showcase, per usual. Most Pecha Kucha shows always introduce the audience to new people or something new about one of the presenters that you may not know of.\n“All of the presenters that I’ve seen and heard in past presentations have been extremely passionate about what they present,” Singleton adds. “I don’t expect anything to change with this presentation.”\nArtistic partnership\nThe original Pecha Kucha kicked off 13 years ago in Japan as a collaborative presentation and lecture series between creative entrepreneurs and artists. The format was designed as a six-minutes-and-40-seconds presentation and divided up between 20 slides shown at 20 seconds apiece.\nParliament Charleston helped bring the concept to the Lowcountry six years ago, organizing a series of presentation at various art-friendly venues around town. Last spring, Parliament Charleston hooked up with the Charleston Arts Festival and brainstormed over a music-based theme for the 25th Pecha Kucha event in Charleston.\n“It was Terry Fox’s idea of hosting Pecha Kucha 25 as an elevated Charleston Arts Festival event, so that was very exciting,” says Charleston Arts Festival director Andrew Walker, a musician who straddles the art and industry side of things. “Having a specifically music-focused one is especially cool, since I’m also a musician. I got to help them pick who was chosen from this wide spectrum of artists and industry people in this town, and it’s such a diverse musical community.”\nAs the organizer of the long-running Jail Break art-and-music events at the Old City Jail, Walker wanted to expand the programming and spirit of the series into something new this year. He retired the “Jail Break” name this fall and introduced the Charleston Arts Festival as the new series.\nWalker assisted Fox and Carmody with some of the booking and production ideas, but he gives the two major credit for taking charge on Friday’s event. “I’m putting my feet up on this one,” Walker laughs. “This particular one is really a Terry Fox/Charles Carmody moment. I look forward to attending, sitting back, and enjoying the event.”\nCarmody, who also is a musician on the side, says it was surprisingly challenging to book the presenters and artists for “Pecha Kucha XXV: All Things Musical.”\n“There are so many unique musicians and artists in Charleston, which made it super difficult,” he says. “But I’m pleased that we have such a diverse group this week. We wanted it to be as diverse as possible — in musical genre, acumen, and job title. The ones we chose each have unique stories that go beyond their musical sides.”\n“The industry is certainly growing here, and there’s more and more interest coming here, as with New Music Confab and more and more venues booking events,” Carmody adds. “I thought it would be great to hear from musicians as well as music industry folks who are working and subsisting in Charleston.”\nCollaboration is trendy\nSome might have noticed a few similarities between Pecha Kucha events and another collaborative phenomenon, TED (Technology, Entertainment, Design), which hosts events featuring live speakers and discussion, also held around the world.\nTEDxCharleston organizers independently booked and presented a “Tipping Point” event at the Charleston Music Hall on Oct. 19. The bill featured an impressive variety of international businessmen, filmmakers, musicians, comedians, managers, tech CEOs, and many others.\n“At first glance, you could say that they are extremely similar,” says Singleton. “The fact that there is usually a time limit is probably one of the most similar traits. TED events are just as fabulous, but personally, they seem a bit more corporate, even though there are musical and other artsy presentations.”\n“Pecha Kucha is shorter in the presentation format than TED, but there are similarities,” says Carmody. “I think all of these events offer new and unique platforms for people to commune and connect. There are pretty easily obtained ideas that you can grasp and quickly talk with your neighbors in the venue. That’s what it’s all about.”\nWalker agrees that the Charleston-based Pecha Kucha events share goals with TED events, but he’s certain that “Pecha Kucha XXV: All Things Musical” offers a very local-spirited platform.\n“Our goal with all of these events is ultimately to create platforms for us as artists,” he says. “When you’re a visual artist or musician, it’s hard to find a venue and self-promote these days, so we exist to enable everybody who’s doing creative things. With Pecha Kucha 25, it feels like things are speeding up and moving ahead.”\nMeet the presenters\nAttendees can expect to hear stories and comments from very different directions from the Pecha Kucha presenters on Friday, ranging from the perspective of musicians and producers to club owners and managers.\nPresenter Lisa Moran is a locally based Toronto transplant who ran the indie record label Three Gut Records and worked for years as songwriter Sufjan Stevens’ production and tour manager before forming the Arts Council, an artist management company that specializes in concert production.\nMusician and indie label executive Dan McCurry is a classically trained pianist, songwriter, and veteran music scenester. Since 2012, he’s guided the vibrant Charleston label Hearts & Plugs, home to such regional pop/rock acts as Brave Baby, Grace Joyner, Slow Runner, Elim Bolt, and Gold Light.\nCharleston native and hip-hop artist Matt Monday kicked off his musical career in the mid-2000s under the name “Righchus,” releasing a handful of independently produced collections and singles. His latest release, “Filthy,” stems from his recent work as founder and director of the multimedia Southern Wealth In Music (S.W.I.M) Group.\nMusic journalist and fashion enthusiast Kelly Rae Smith currently works as the music editor for the weekly Charleston City Paper. When she’s not interviewing bands and songwriters, attending local shows, or tracking down music scene news bits, she tends to her retro clothing and accessory boutique, Runaround Sue Vintage.\nLongtime Charleston resident Ann Caldwell is a highly versatile, revered vocalist, producer, storyteller and bandleader. Capable of handling just about anything from jazz, gospel, and spiritual styles to blues and rock ‘n’ roll, she regularly performs solo and full-band gigs around town, and she conducts the Charleston-based Magnolia Singers. A favorite of Piccolo Spoleto over the years, the ensemble specializes in Carolina-born Gullah songs, stories, poems, and rhythms.\nVenue owner and booking agent Alex Harris has been running the popular Charleston Pour House on James Island for more than a decade. As one of the busiest music venues in Charleston, the Pour House averages more than 300 shows per year on its main stage inside and on its outdoor stage on the back deck. Harris’ support of the local band scene, local charities, and local artists is well respected within Charleston art and music community.\nVeteran musician Jonathan Gray may be best known in the local scene as the bassist and co-founding member of ’90s/2000s pop/rock band Jump, Little Children, but he’s collaborated with a wild variety of artists in recent years — from the Latin-based Garage Cuban Band and experimental Western Polaroids to various projects with the Jazz Artists of Charleston and local theaters. Gray and his 11-year-old daughter Isabel recently completed an expedition to Antarctica.\n“I expect that each presentation at this Pecha Kucha will be pretty different, but many will certainly touch on the trials and tribulations of being an artist in the Charleston area,” says Carmody. “I’m sure that will come through. Also, the topic diversity within the music scene will be there as well.”", "url": "https://apnews.com/9167dfb979354d8481ad681d9d2c9b99"}