{"authors": ["Mitchell Abidor", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:00", "date_modify": "2020-05-04 19:50:00", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_09_leon-blum-popular-front-france-socialists-ps-fascism_1588621800.html", "image_url": "https://images.jacobinmag.com/2016/10/17230934/Screen-Shot-2016-09-23-at-10.43.34-AM1-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09_leon-blum-popular-front-france-socialists-ps-fascism_1588621800.html", "title": "Assessing Léon Blum", "title_page": "Assessing Léon Blum", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nEighty years ago, as the Popular Front, led by the Socialist Party, was voted into power in France, workers across the country decided to hasten its promised reforms, striking and occupying factories to ensure that their demands were met: a forty-hour work week, higher wages, paid vacations, and union rights. They occupied factories with the knowledge that, with the Socialists in power and the Communists supporting the government, they ran no risk of being attacked and driven from their bastions. Instead, they settled in with food, wine, and accordions, turning working France into a festival. And with the government acting in their favor, they won many of their demands. In 2016, with the Socialists in power, people again took to the streets, this time protesting against the government’s drive to chip away at the rights fought for and obtained over decades of working-class struggle. Far from being protected by a Socialist government, they found themselves attacked by the police, demonstrations banned or restricted to routes of less than a mile. This bookending of protest movements says all we need to know about the descent of the Socialist Party, from one of the two great parties of the French working class to just another force aimed at imposing austerity. But it also speaks to the differences in the figures heading the nominally socialist governments. Today it is François Hollande, someone of no obvious left-wing credentials. In 1936 it was a leader of true stature: Léon Blum. Pierre Birnbaum’s biography, Léon Blum: Prime Minster, Socialist, Zionist, provides us with a brisk and insightful introduction to Blum’s life and ideas.\nThe Young Léon Blum Nothing of Blum’s role in history was foretold by his youth. Born in 1872 into an Alsatian Jewish family relocated to Paris, Blum was, first of all, an aesthete, a discerning literary critic for several reviews in late nineteenth-century France. As a young man he was, most notably, an expert on Stendhal, who was perhaps his strongest early influence. If Blum was, as he was called, “the first true Stendhalian of modern times,” it was not just for his admiration of Stendhal as one of the greatest stylists of the French language. Nor was it simply because Stendhal inspired him in his skewering of bourgeois morality in his brilliant On Marriage, a book that called for the liberation of both partners in marriage from social constraints. Oddly, it was his love of Stendhal that would set him on the path to the Socialist Party, for, as Birnbaum writes, “Blum also shared Stendhal’s contempt for money and commerce, and [his characters’] cult of the French Revolution.” Blum was a perfect example of what Birnbaum calls the “State Jew.” This figure of the Jew who enters the halls of government, either as elected representative or highly placed functionary, could not have existed without the Republic, which, in turn, owed its existence to the revolution. Both, in turn, won veneration from many French Jews, freed from some of the constraints that existed elsewhere in Europe. Which, of course, does not mean that anti-Semitism wasn’t rampant, and few French Jews were as directly and consistently the target of Jew-hatred as Blum. During the Dreyfus Affair the Right hated Dreyfus, but he at least was a soldier. Birnbaum points out that the self-presentation of his vocal supporter Blum, who entered politics thanks to the affair, “seems to have encouraged anti-Semitic pamphleteers to describe him as the exact opposite of Dreyfus: an effeminate personality instead of a manly one.” Attacks on Blum the Jew would be a constant through World War II. Blum’s assumption of power in 1936 itself elicited a famous interpellation by the anti-Semitic deputy Xavier Vallat: “Your accession to power, Mr. Prime Minister, is undeniably an historic date. For the first time this old Gallo-Roman country will be governed by a Jew.” For Birnbaum, Blum’s position as socialist leader Jean Jaurès’s heir flowed naturally from his Jewishness: “Jewish socialists identified with Jaurèsian messianism, direct descendant of the French Revolution they so greatly admired.” Blum inherited Jaures’s form of socialism, “a deeply original synthesis of individualism and collectivism, the values of the French Revolution and the theory of class struggle, revolution, and reform.” Perhaps no idea of Jaures’s would more influence Blum than his statement in Etudes Socialistes that “the Republic is the political form of socialism.” For Blum, then, the republican state “should be used to define, protect, and guarantee the condition of the working class.” In 1927, nine years before the Popular Front victory, he provided the theoretical basis for its imposition of pro-working class measures by saying that “the government derives [this right] from its prerogatives as a public power, from its command over firms, and from its national and legislative sovereignty.”\nA Workers’ Government The gestation period of the Popular Front lasted over two years, dating to February 6, 1934 and the riots in Paris by the ultra-right that nearly overthrew the Radical government, whose corruption was demonstrated by the Stavisky Affair, in which Alexander Stavisky, who had close ties to members of the government, swindled hundreds of millions of francs. A firm response was demanded from the Left, and on February 13, 1934 two separate marches were called, one by the Socialists, the other by the Communists. The two parties had been at daggers drawn since the split in the Socialist Party at the 1920 party congress that had led to the foundation of the French Communist Party (PCF), where Blum led those opposed to affiliation with the Comintern, and there was some fear as the two marches approached each other. Blum would write of the day: We advanced. The space between the leading elements of the two columns of marchers grew smaller with every passing second . . . Would the encounter lead to a clash? . . . The two columns now stood face to face, and identical shouts broke out on all sides. Identical songs were sung. The two columns met, but there was no clash, only fraternization. This ad hoc unity was formalized on July 14, 1935, when the united left held a massive demonstration, and ten months later, on May 3, 1936, the Popular Front government emerged victorious from the second round of the legislative elections, with the Radical Party and Socialists official participants in the government, and the Communists remaining as outside supporters. The Communists’ stance was not to Blum’s liking. “If the Communists do not associate themselves with us in the exercise of conquered power the disappointment will be great within, and no doubt outside our ranks.” Though PCF secretary Maurice Thorez, along with the rest of the party leadership, would have preferred to take this step, the Comintern decided otherwise. Despite the PCF’s enormous gain of sixty-two seats, from its previous ten, and the Socialists’ gain of forty-nine seats, Thorez justified what was officially his and the Central Committee’s decision by saying that Communist entry into the government would cause “panic and confusion” and would lead the Radicals to leave the government, ending the experiment before it could truly begin. This Communist cautiousness would manifest itself throughout the strikes and occupations that would be set off by the Popular Front’s electoral victory. Defining May-June 1936 is as difficult as defining May-June 1968. Blum had a Jaurèsian notion not just of the French Revolution, but of revolution, one that dismissed not just the need for, but even the possibility of armed revolution. A lecture Blum delivered in 1917 explains his vision of working-class revolution: “A revolutionary act occurs … each time the working class achieves significant progress sooner than would have been the case in the normal course of events … Reform is revolutionary, and revolution is reformist.” By this standard the events of May and June 1936 were a revolution, one that the syndicalist Pierre Monatte would credit to the electoral victory of the Popular Front: “The decisive factor in the unleashing [of the strike wave] was the arrival of the Popular Front government . . . Suddenly, it was no longer possible to put up with things as they were . . . The trigger was pulled.” Strikes and occupations occurred throughout France. Birnbaum is right when he says that “reform without revolution: this was the symbolic significance of the Popular Front.” But the reforms it led to were far from symbolic: the government sat with the unions and the employers’ association and imposed the Matignon Accords on the bosses on June 7, granting across-the-board wage increases of 20 percent, two weeks paid vacation, collective bargaining rights, and the establishment of unemployment insurance. These gains were epochal, and the Popular Front government, and Blum, are still remembered fondly for their implementation. The Popular Front aimed at ameliorating existing conditions, not overturning them. Blum, with his vision of the state, the republic, and socialism, can hardly be blamed for not becoming the French Lenin. Those further to the left saw things differently. As the strike wave continued to spread even with the signing of the accords, the leader of the independent socialist left Marceau Pivert would say “Everything is possible,” and Leon Trotsky would proclaim that “The French revolution has begun.” Maurice Thorez, leader of the PCF, on the other hand, announced that, “It is important to know how to end a strike when satisfaction has been obtained.” As Birnbaum laconically phrases it, “The Popular Front experiment ended all too soon. The hopes that had been raised were quickly dashed.” The Matignon Accords, which were only accepted grudgingly, were combated by the bourgeoisie, capital fled, strikes and occupations broke out again, production dropped, unemployment rose, and the middle class, the source of the Radical Party’s strength, began to abandon the Popular Front project. The Right reawakened, and when Blum refused to ban a rally by the right-wing French Social Party, the Communists called for a demonstration against it. Police fired on the demonstrators, and Blum now became “the murderer Blum” in the Communist press. By 1937 the Radicals had had enough, and refused to grant Blum the sweeping powers he needed to deal with the economic crisis and capital flight. So within a year Blum was out of office and almost every Popular Front gain had been rolled back. It can perhaps be said this shows the limitations of the Blumian notion of revolution through reform: unlike changes resulting from a revolutionary state, these could be largely undone in a single election. Given the scope of the strike movement the actions of Blum and Thorez have been viewed as constituting a brake, if not a betrayal of the possibilities of May-June 1936. But a closer examination of facts reveals that things were not quite as Trotsky and Pivert claimed. In the first place, the Popular Front victory was not as sweeping as initially appears. Though the Popular Front won by 1,200,000 votes, their vote total had increased by 300,000, or 3 percent, over the Left’s results in 1932. Not a small increase, but hardly a tidal wave, so the support across France was not all that overwhelming. And if the Socialists gained seventeen seats over the previous elections, and the Communists an impressive sixty-two (also receiving almost eighty thousand more votes than the Radical Party), the Radicals had lost fifty, so the swing was a total of twenty-nine seats. Thorez’s fears of alienating swathes of the French population were not groundless. It is unquestionably astounding that twelve thousand enterprises went on strike, and that nine thousand were occupied. Like Trotsky, the French owning class saw the strikes as the beginning of the “sovietization” of France. Based on the workers in a cookie factory in Paris having taken over and run their enterprise, and the insistence by militants elsewhere that other workers were ready to do the same, has led some, both then and now, to say that the revolution had indeed begun. But as the historian Antoine Prost would write, in the overwhelming majority of cases, the calls for workers’ control “were simple threats, and they were rare.” As a participant recounted: “There were dances, and all of that . . . We sang, we were happy. Even if we knew we were later going to return to work. Even so, we had a good time together.” Criticisms that things could have gone further must then be at least questioned and credit granted for what was actually accomplished. Blum’s view of the role of the government was that it was a force for good, and his ability to have his administration act to meet working peoples’ needs won him real support. Birnbaum includes a sample of the letters of thanks Blum received from French workingmen, and it is clear that for the average French worker, May and June 1936 were revolutionary. And yet, however positively Blum can be viewed over these two months, after July 1936 his role in international affairs cannot be seen so sanguinely.", "url": "https://www.jacobinmag.com/2016/09/leon-blum-popular-front-france-socialists-ps-fascism"}