{"authors": ["Greg Lee"], "date_download": "2020-05-04 20:13:29", "date_modify": "2020-05-04 20:13:29", "date_publish": "2016-12-21 00:00:00", "description": "BOISE – Being an underdog is nothing new to the University of Idaho football team. For the Vandals to find themselves 13 1/2 - to 15-point underdogs to Colorado State – depending on which...", "filename": "_0f74597b51964e78ad0486ecafe3d033_1588623209.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0f74597b51964e78ad0486ecafe3d033_1588623209.html", "title": "Heading into Potato Bowl, Vandals have embraced role as underdogs all season", "title_page": "Heading into Potato Bowl, Vandals have embraced role as underdogs all season", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BOISE – Being an underdog is nothing new to the University of Idaho football team.\nFor the Vandals to find themselves 13 1/2 - to 15-point underdogs to Colorado State – depending on which oddsmaker you look at – is neither surprising nor frightening.\nIdaho (8-4) and CSU (7-5) face off at 4 p.m. Thursday in the Famous Idaho Potato Bowl at Boise State’s Albertsons Stadium.\nThe Vandals were picked to finish eighth in the Sun Belt. They finished tied for third at 6-2.\nSo they don’t mind one more challenge.\nTruth be told, they embrace it.\n“We’re just kind of that guy in the classroom who sits there and is really quiet that you better not mess with because he’ll fight you until the end,” Vandals head coach Paul Petrino said.\nAccording to the Las Vegas experts, the Vandals were underdogs in seven games.\n“We were probably an underdog in every game we played all year, maybe with the exception of two,” Petrino said. “Being underdogs is not a big deal at all. We probably should be, and we think that’s great.”\nThe players have no qualm playing the role of the hunter.\n“We’ve been underdogs pretty much in all of our games, so we kind of prefer it, honestly,” senior tight end Trent Cowan said. “I think a lot of the guys embrace that mentality.”\nSophomore linebacker Tony Lashley agreed.\n“It just sets the bar for us defensively and offensively,” Lashley said. “We go out there and have high expectations and being the underdog helps us strive to make that happen.”\nIn the week leading up to the bowl game, Petrino has talked about his players being overachievers.\n“I’ve told the players from day one the greatest compliment you can ever have is to have somebody call you an overachiever,” Petrino said. “We want to be overachievers. We’re going to fight for four quarters. We’re going to keep that game close and find a way to win in the fourth quarter.”\nPetrino said just because his players embrace the tag as underdogs doesn’t necessarily mean they believe it.\n“One of the biggest differences is we don’t think we’re the underdogs, where in the past we probably did,” Petrino said. “We had on the back of our shirts all winter: ‘Expect to Win.’ We get to the fourth quarter, we expect to win. So that’s probably the biggest difference.”\nThe Vandals won just two games in Petrino’s first two years. Many of the seniors who endured those lean times have earned the reward of perseverance.\n“We’ve got a lot of guys who have been here for four years and fought through a lot of adversity and some tough times, but they just kept grinding and kept fighting and believing if you work hard and do things right and choose character then good things will happen,” Petrino said.\nIn the Vandals’ two previous bowl games in 1998 and 2009 – both in Boise – they were underdogs and they won.\nDon’t be surprised if the Vandals have a chance late in the game.\n“I really expect our guys to go out and play as tough as they can,” Petrino said. “As long as they do that, as long as they give great effort and play tough, we’ll get to the fourth quarter and see what happens.”\nAustin Rehkow could play key role\nIdaho coach Paul Petrino was asked if special teams could be pivotal when the Vandals take on Colorado State.\nHe affirmed as much, citing the impact that former Central Valley standout Austin Rehkow, a senior, has had with his leg.\n“We’re very fortunate. Austin Rehkow is probably the best punter in the country,” Petrino said. “Somehow people didn’t vote for that. I don’t know how they vote for guys who rugby punt over him. Don’t get that. He is the best punter there is and will punt for a long time on Sundays. And he’s worked really hard to improve and make himself a really good field-goal kicker.”\nA first-team All-Sun Belt selection at punter, Rehkow averaged 42.6 yards in all games this season and has a 46.3 career average.\nRehkow has made 26 of 29 field-goal attempts and is 35 for 35 on point-after tries this season.", "url": "https://apnews.com/0f74597b51964e78ad0486ecafe3d033"}