{"authors": ["Don Maines"], "date_download": "2020-05-04 20:19:53", "date_modify": "2020-05-04 20:19:53", "date_publish": "2016-11-04 16:05:01", "description": "Much of Adrianna Rodriguez's role in Purple Box Theater's production of \"August: Osage County\" is performed by her eyes. Rodriguez, 36, of Pasadena portrays Johnna, a Cheyenne woman whom a...", "filename": "_68cdad9fb41d41039fe15d4394f721d4_1588623593.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_68cdad9fb41d41039fe15d4394f721d4_1588623593.html", "title": "'Osage' actress's performance based on glances, expressions", "title_page": "'Osage' actress's performance based on glances, expressions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Much of Adrianna Rodriguez’s role in Purple Box Theater’s production of “August: Osage County” is performed by her eyes.\nRodriguez, 36, of Pasadena portrays Johnna, a Cheyenne woman whom a frustrated, once-famous poet named Beverly Weston hires to be a live-in cook and caregiver for his drug-addled, chain-smoking wife, Violet.\n“She is a silent observer,” Rodriguez said of her character. “Her eyes are always moving, taking in the interaction between Violet and Beverly, then Barbara and her husband, Bill, and Violet and her daughters.\n“Johnna is in and out in almost every scene; so she gets a good feel for each character and what makes them tick,” Rodriguez said. “In her own little way, she is like the glue, trying to keep it all together.”\n“August: Osage County,” the story about how an Oklahoma family comes apart at the seams when the patriarch goes missing, plays through Nov. 13 at the Friendswood theater, 1309 W. Parkwood.\nThe pl;ay is the second show for Rodriguez at Purple Box Theatre. Both she and Friendswood City Council Steve Rockey, who plays Beverly Weston, appeared in the theater’s recent mystery, “Web of Murder.”\n“He’s great,” said Rodriguez. “He’s funny.”\nVictoria Reyes of League City plays Ivy, the spinster middle daughter of Beverly and Violet Weston.\n“Violet is really, really mean, and Ivy is very shy and timid,” said Reyes. “She is the only daughter who stayed close to home, and she gets beaten up a lot by her mom.”\nAs Violet, Friendswood realtor Deborah Winters Chaney is “so amazing, so fabulous, so real,” Reyes said, “it makes me feel very much like Ivy. It doesn’t take a whole lot of acting to cower when Violet says mean things.”\nIvy’s younger sister, Karen, is played by Gina McPherson, also of League City.\n“She is very happy until she arrives to all of this horrible stuff going on,” said McPherson. “At first, she is pretty self-absorbed, how she goes on and on about herself. It’s kind of funny. She’s pretty ‘out there.’”\nKaren is accompanied by her shifty fiancée, a Florida playboy who flirts with Karen’s 14-year-old niece and gets caught smoking a joint with her.\n“What I love about Karen is that she has a lot of meaty layers that don’t show up until the end of the play,” said McPherson. “You don’t see them at the beginning.”\nAs the family matriarch, Violet is not a good example on parenting for McPherson, who is divorced and rearing two daughters, ages 15 and 12, who attend Clear Falls High School and League City Intermediate.\n“They are the most supportive daughters in the world,” McPherson said. “Since I got back into acting two years ago, they have encouraged me to keep at it. I’m a little too much of a ‘good friend’ to them, but there is a lot of laughter.”\nThe oldest of Violet’s three daughters, Karen, is played by Christine Jones of Webster.\nKaren decides to clean up the play’s toxic messes by taking control of the household, but she soon finds that to be an impossible task in a family so dysfunctional.\nThe 2013 film version of the play scored Academy Award nominations for Meryl Streep as Violet and Julia Roberts as Karen.\nThe epic, tragicomic play by Tracy Letts contains a prologue, followed by three acts. It won the 2008 Pulitzer Prize for Drama after premiering at the Steppenwolf Theatre in Chicago.\nThe play transferred to Broadway with 11 members of the original cast, including the playwright’s father, Dennis Letts, as the family’s patriarch.\n“August: Osage County” won Tony Awards for best play, direction, scenic design and acting honors for two Chicago actresses, Deanna Dunagan (lead) as Violet and Rondi Reed (featured) as Violet’s spunky sister, Mattie Fae Aikin.\nMattie Fae is portrayed by Teresa McLemore of Pearland, whose new granddaughter, coincidentally, is named Maddie Kay.\n“It was meant to be, I guess,” said McLemore, who is 61.\nA counselor at Carleston Elementary School in Pearland, she added, “I get to act every day. I’m on the microphone in the cafeteria. I announce the spelling bee and different parent programs.”\nIn addition, McLemore has recently performed in “The Sound of Music” at Pasadena Little Theatre, “The Philadelphia Story” at Clear Creek Community Theatre and “The Best Christmas Pageant Ever” for Kids’ Backporch Productions in Pearland.\n“Of course, everybody knows me for my Cher imitation,” laughed McLemore. “Mattie Fae is a whole lot like me.”\nMidway through Act III, Mattie Fae utters perhaps the funniest line in the play when she deflects a monumental problem into the lap of another character.\n“It’s a zinger,” said McLemore. “I love it. It’s a great blackout line.”\nMattie Fae’s husband, Charlie Aiken, is played by Pat Monks, 58, of Clear Lake.\nMonks is a native of Rush, Ireland, where his entire family participated in shows at Millbank Theatre.\nPurple Box Theatre artistic director Cathy Holbrook directed the production.\nThe title of the play is an homage to the playwright’s late mentor, Howard Stark, who penned a poem, “August: Osage County,” that was published in “Family Album: a Collection of Poetry” in 1995.", "url": "https://apnews.com/68cdad9fb41d41039fe15d4394f721d4"}