{"authors": [], "date_download": "2020-05-04 20:23:45", "date_modify": "2020-05-04 20:23:45", "date_publish": "2016-11-09 06:28:00", "description": "Twenty years after President Bill Clinton narrowly carried Alcorn County over Republican Bob Dole, Hillary Clinton lost the county in a landslide Tuesday to Donald J. Trump. Alcorn County...", "filename": "_3417cd8a53f94666a203b10171334469_1588623825.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3417cd8a53f94666a203b10171334469_1588623825.html", "title": "Trump carries county as Republican trend deepens", "title_page": "Trump carries county as Republican trend deepens", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Twenty years after President Bill Clinton narrowly carried Alcorn County over Republican Bob Dole, Hillary Clinton lost the county in a landslide Tuesday to Donald J. Trump. Alcorn County continued its hard turn to the right in presidential votes, giving Trump/Pence an easy win with 80 percent of the vote. Meanwhile, voter turnout was short of election officials’ expectations, coming in behind the participation level of 2008 and near that of 2012. Trump carried the county with 11,616 votes to Hillary Clinton’s 2,609 (18 percent). Third-party candidates barely registered, with Libertarian Gary Johnson taking 164 votes (1 percent). Since Dole’s loss of the county 20 years ago, the Republican presidential ticket has improved its fortunes with each passing term. Dole took 45 percent of the vote, losing to Clinton by about 240 votes in an election that saw third-party candidate Ross Perot take more than 900 Alcorn County votes (8 percent). Four years later, George W. Bush won the county with 57.5 percent of the vote. In 2004, he increased the margin to 60 percent as he won reelection against John Kerry. The margin continued to accelerate as Barack Obama was elected president. John McCain took 71 percent of the vote in 2008, and Mitt Romney hit 75 percent in 2012. Hillary Clinton’s best showing came in the Democratic-leaning South Corinth precinct, where she took 55 percent of the vote. Turnout for the election was 14,956, including 1,378 absentee ballots tabulated with these results and 367 affidavit ballots to be added later. Election officials said it felt like a record-breaker in the making in recent weeks, but the total falls a bit short of the approximately approximately 15,400 votes in 2008. The 2012 total was about 15,000. Several, including Fourth District Election Commissioner Sandy Mitchell, expressed surprise that the turnout was not more. Turnout at the Kossuth precinct, however, reached 1,300, exceeding her prediction of 1,150. “I was really pleased with how it went,” she said. “The poll workers did an excellent job.” The circuit clerk’s office had a busy day fielding questions from residents. Many had address issues, leading to the affidavit ballots, and some had been purged from the voter rolls after not participating in a couple of federal elections. “I’ve never had our phone ring like it did today,” said Deputy Clerk Crystal Starling. At least 10 people came in to register to vote on Tuesday, said Circuit Clerk Joe Caldwell. In the regional races on Tuesday’s ballot, the county’s vote for Mississippi Supreme Court District 3 Place 1 was a squeaker, with Jim Kitchens Jr. leading at 3,642 (31 percent), just ahead of John Brady with 3,626 (31 percent). Bobby Chamberlin had 2,319 (20 percent), and Steve Crampton had 2,034 (17 percent). U.S. Rep. Trent Kelly (R) of Saltillo easily carried the county in his reelection bid with 11,077 (80 percent). Other totals were Jacob Owens (D), 2,277 (17 percent); Chase Wilson (Libertarian), 267 (2 percent); and Cathy L. Toole (Reform), 154 (1 percent). Vote totals for the other third-party presidential candidates were Darrell Castle (Constitution), 53; “Rocky” Roque De La Fuente (American Delta), 7; Jim Hedges (Prohibition), 12; and Jill Stein (Green), 37.", "url": "https://apnews.com/3417cd8a53f94666a203b10171334469"}