{"authors": ["Scott Maben"], "date_download": "2020-05-04 20:12:26", "date_modify": "2020-05-04 20:12:26", "date_publish": "2016-12-13 00:00:00", "description": "Gee Automotive Cos., the regional auto dealership group founded in Spokane, will become one of the largest dealership groups on the West Coast with the acquisition of Ron Tonkin Dealerships in...", "filename": "_6898a798c076445ba3b342cdec009f3a_1588623146.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6898a798c076445ba3b342cdec009f3a_1588623146.html", "title": "Gee Automotive acquires Ron Tonkin Dealerships in Oregon", "title_page": "Gee Automotive acquires Ron Tonkin Dealerships in Oregon", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Gee Automotive Cos., the regional auto dealership group founded in Spokane, will become one of the largest dealership groups on the West Coast with the acquisition of Ron Tonkin Dealerships in Portland.\nGee announced the deal Tuesday, saying the two family-based businesses share core values. Terms of the acquisition were not released.\nThe deal expands Gee Automotive’s presence in the Portland market, where Gee owns and operates Gresham Subaru.\n“Since its founding in 1983, the common theme in all of the Gee Automotive operations has been ‘families serving families’ – a value shared by the Tonkin family, which has been providing Portland families with cars for more than 50 years,” said CEO and Dealer Principal Ryan Gee.\nGee Automotive includes dealerships in Washington, Oregon and North Idaho. The company sells new Honda, Subaru, Buick, GMC, Porsche, Cadillac and Kia vehicles, as well as used cars and trucks.\nTonkin opened in 1960 with a Chevrolet store. Today the family has 21 new car brands and one exotic Italian motorcycle store, MotoCorsa.\nAll Tonkin employees’ jobs, pay and benefits will be secure under Gee’s ownership, said Ed Tonkin, co-president of Ron Tonkin Dealerships.\n“Our top priority throughout this strategic business decision was to ensure Tonkin employee retention, well-being and opportunity,” Tonkin said. “Our family is confident that Gee will be a good steward of our employees and corporate culture and we are excited to see the company grow under their leadership.”\nBrad Tonkin, co-owner of the dealership group, will remain with the company and serve as platform president.\nThe Tonkin name will remain on all of its dealerships, and its brand will continue to grow and expand in the Portland area, the companies said in a joint statement.\n“A fundamental business objective with this acquisition is to continue to build on our culture of customer service and employee engagement,” they said. “We are looking forward to building and ensuring a bright future for the company.”\nGee Automotive Cos. include its flagship hub in Liberty Lake as well as dealerships in Coeur d’Alene, Kirkland, Washington, Tacoma and Gresham, Oregon.\nGeorge Gee founded his first auto dealership, selling Pontiacs, in Spokane in 1983. The company lost Hummer and Pontiac sales after General Motors shut down those makes, but Gee acquired Spokane Kia in 2011, becoming the exclusive Kia dealer for the Spokane and Coeur d’Alene areas.\nAuto dealerships have been undergoing a series of major consolidations in recent years. Last year, a fast-growing Texas car dealership purchased Dave Smith Auto Group in Kellogg. The deal with RFJ Auto Partners Inc. allowed Smith, which operates two of the highest-volume stores in the nation, to expand the Dave Smith Motors line across the West, according to Ken Smith, president of the new group.\nThe Chrysler-Dodge-Jeep-Ram and Chevrolet-Cadillac-Buick-GMC stores in Kellogg sell close to 10,000 vehicles a year.", "url": "https://apnews.com/6898a798c076445ba3b342cdec009f3a"}