{"authors": ["David Thompson"], "date_download": "2020-05-04 20:22:01", "date_modify": "2020-05-04 20:22:01", "date_publish": "2016-12-14 15:34:37", "description": "Ozen overcame a fourth-quarter collapse and a last-second shot attempt from Central's Anastacia Mickens to survive with a 42-41 win Tuesday night at home. The win moves the Lady Panthers to...", "filename": "_eb202a421cb546adabec320cf88445f0_1588623721.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eb202a421cb546adabec320cf88445f0_1588623721.html", "title": "Lady Panthers narrowly defeat Central", "title_page": "Lady Panthers narrowly defeat Central", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ozen overcame a fourth-quarter collapse and a last-second shot attempt from Central’s Anastacia Mickens to survive with a 42-41 win Tuesday night at home.\nThe win moves the Lady Panthers to 2-0 in District 22-5A play, and the Lady Jaguars fall to 0-2. The win also evens the season series between the cross-town rivals after Central defeated Ozen in the YMBL tournament.\n“We always say the stuff that happens before district doesn’t really matter,” Ozen coach Tammy Walker-Brown said. “These are the ones that count and I’m very happy that we were able to hold on to this one.”\nBehind 10 first-half points from sophomore Ashlei Kirven, the Lady Panthers cruised to a 21-14 halftime lead. But Mickens, who finished with a game-high 18 points, came out firing in the second half, scoring her teams’ first 12 points of the third quarter to cut the lead to 25-24.\nOzen however, finished the quarter on a 10-4 run to extend its lead to 35-28.\nOzen led 42-35 with 4 minutes left in the game, but failed to score again as Central crept back into the game\nwith free throws from Mickens and her teammates.\nCentral had a final shot with two seconds remaining to win the game, but hit the side of the rim as time expired.\n“These are the kinds of games you need to win throughout your season,” Walker-Brown said. “These wins build character and help you learn how to play in a loud environment like this one.”\nKirven finished with a team-high 14 points and 10 rebounds for Ozen, while Briona Nash added eight points, including two three-point shots.\nOzen and Central will play each other for the final time this season at Central on Jan. 20.\nDThompson@BeaumontEnterprise.comTwitter.com/DaveTh89", "url": "https://apnews.com/eb202a421cb546adabec320cf88445f0"}