{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:06:16", "date_modify": "2020-05-04 20:06:16", "date_publish": "2016-12-03 14:45:00", "description": "What color are our stars? — Mira, 8, Ontario Dear Mira,", "filename": "_6ba37b4c192344cb9b90f188e5318168_1588622776.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6ba37b4c192344cb9b90f188e5318168_1588622776.html", "title": "Ask Dr. Universe: What color are our stars?", "title_page": "Ask Dr. Universe: What color are our stars?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "What color are our stars?\n— Mira, 8, Ontario\nDear Mira,\nJust the other night, I grabbed my binoculars and looked up to the starry sky. At first the stars looked white, but when I looked closer I noticed some appeared more blue and red.\nI was curious to find out exactly what color they were, so I visited my friend George Newman. He’s a physics and astronomy instructor at Washington State University.\nHe said that a star mostly emits the kinds of light that our eyes see as red or blue.\n“The thing that determines which color they give off most is their temperature,” he said.\nYou may have seen the connection between color and temperature if you’ve ever made toast. The little wires inside the toaster glow red and you can feel the heat coming off them.\n“We think of red as hot, but blue is actually hotter,” Newman adds.\nLook closely at a flame and you’ll notice it’s made up of different colors, too. The bluish part is hotter than the reddish-orange part of the flame. It’s similar with stars.\nThe hottest stars are bluer. The cooler ones are redder. Of course, the cooler ones are still super hot.\nAnd while stars may be hot at their surface, they are even hotter in their middles. Stars burn because of nuclear reactions that are continuously happening at their core. The reactions create a lot of heat and pressure.\nStars actually maintain their heat for most of their lives. But sometimes their temperatures change, as do their colors.\nYoung clusters of stars in the galaxy contain some of the most massive stars, which are super bright and very blue.\n“There are plenty of these big hot blue stars being born in the galaxy and universe, but they burn out a lot faster, so there are a lot less of them around,” Newman said.\nStars gradually grow brighter over most of their lives. Then most puff up and cool off right near the end. They become even brighter, but redder. Older clusters will contain more stars like red giants.\nOne blue supergiant in our galaxy is called Rigel. While Rigel is a blue star now, it will likely puff up and get redder like another star in our galaxy, Betelgeuse.\nBetelgeuse is an old, red giant. It will eventually explode in an event we call a nova, and probably become a black hole.\nIn fact, our sun will also become a red giant one day, too. But probably not for 5 billion years or so. The life of a star is really long and it can involve lots of different changes. The next time you look up to the night sky, remember that there’s more there than at first meets the eye.\nSincerely,\nDr. Universe\nAsk Dr. Universe is a science-education project from Washington State University. Send your own question to Dr. Universe at AskDrUniverse.wsu.edu.", "url": "https://apnews.com/6ba37b4c192344cb9b90f188e5318168"}