{"authors": [], "date_download": "2020-05-04 21:09:07", "date_modify": "2020-05-04 21:09:07", "date_publish": "2016-09-12 21:56:00", "description": "The Jacinto Foundation is making its case to the tourism board. Jacinto Foundation Executive Director Beth Whitehurst spoke during the regular meeting of the Corinth Area Convention & Visitors...", "filename": "_ff123eafbfd54b6e97e12a067c41acda_1588626547.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ff123eafbfd54b6e97e12a067c41acda_1588626547.html", "title": "Jacinto Foundation seeks support of tourism board", "title_page": "Jacinto Foundation seeks support of tourism board", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Jacinto Foundation is making its case to the tourism board. Jacinto Foundation Executive Director Beth Whitehurst spoke during the regular meeting of the Corinth Area Convention & Visitors Bureau on Monday in an effort to lay the groundwork in establishing a relationship with the board — the first step in possibly finding a new source of operating money in case the foundation’s funding is slashed by the Alcorn County Board of Supervisors. “For the first time in more than half a century, we are trying to find funds to pay basic expenses,” said Whitehurst. Alcorn County supervisors, who have considered pulling funding for the Jacinto Foundation, will adopt a budget on Wednesday. The possibility of pulling funding from the foundation was discussed in August by the Alcorn County Board of Supervisors. The Supervisors are expected to decide whether or not to fund the Jacinto Foundation during their budget meeting on Wednesday. Whitehurst emphasized the ways Jacinto is good for business in Alcorn County. She said visitors to the historic courthouse visit area businesses, shops and gas stations. “We encourage visitors to come to Corinth to shop and eat,” she said. “And it is not like we are competing with places in Corinth for food.” She said Jacinto’s most viable tourism event is the July Fourth Festival, which brought in approximately 2,500 people in 2016 — an “off” year for state politics. Syndicated political columnist Sid Salter has called the festival one of the “must attend” events for candidates seeking statewide office in Mississippi. “When you go to Jackson each year for the Corinth day at the Capitol, anybody who has run for statewide office has likely already been to Alcorn County to speak at the July Fourth Festival,” said Whitehurst. “The most often used phrase by statewide candidates this summer was ‘I was told if you want to win you have to speak at Jacinto.’” Whitehurst also addressed a number of rumors that have been making the rounds in the last two weeks. One rumor is that if Alcorn County does not fund the Jacinto Foundation that the park adjacent to the courthouse will revert to Alcorn County. Whitehurst said this is not true, as the Foundation has a 99-year lease with an automatic 99-year renewal. “And my personal favorite, that because the Jacinto Foundation receives government funds it is a government agency,” said Whitehurst. “The Jacinto Foundation is a private non-profit corporation that receives support from government agencies, including the Alcorn County Board of Supervisors. It is no more a governmental agency than a person who receives food stamps is a state employee.” She said the most frustrating thing is that except for a few people on the Alcorn County Board of Supervisors and in the Jacinto area, things are currently going very well for the Jacinto Foundation. Saturday saw between 150 and 200 visitors to Jacinto, including several who contributed to the tourism tax by buying pizzas for the Boy Scouts who were repairing the park’s swinging bridge, she said. “Oddly enough, because of the bad publicity many people in the area have discovered that they do not have to leave Alcorn County to go to a natural area,” Whitehurst said. “The Jacinto Foundation is in a really good place right now. But we need to keep the lights on and the courthouse lawn mowed.” The Jacinto Courthouse was the first county seat, back when Alcorn, Prentiss and Tishomingo were part of “Old Tishomingo County.” In 1969 the building was the first entity in Alcorn County to be placed on the National Register of Historic Places. “If history is half the story in Alcorn County, Jacinto is in chapter one,” Whitehurst said, referring to the slogan on promotional materials for Corinth tourism. In other CACVB news, the board approved funding for the 2017 American Salers Junior Association’s Junior National Show. The board will provide $3,000 up front and $50 for every room/night the event brings into town over 30 up to a maximum of $5,000.", "url": "https://apnews.com/ff123eafbfd54b6e97e12a067c41acda"}