{"authors": ["Robert Harding Robert.Harding Lee.Net"], "date_download": "2020-05-04 20:14:15", "date_modify": "2020-05-04 20:14:15", "date_publish": "2016-11-06 23:45:00", "description": "DEWITT — U.S. Rep. John Katko and Democratic challenger Colleen Deacon accused each other of misleading voters and tangled on several issues Sunday during the final televised debate of the 24th...", "filename": "_f8fcb3898d094138ba802dd62d0d798d_1588623255.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f8fcb3898d094138ba802dd62d0d798d_1588623255.html", "title": "Sparks fly at final TV debate before election between Rep. John Katko, Colleen Deacon", "title_page": "Sparks fly at final TV debate before election between Rep. John Katko, Colleen Deacon", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DEWITT — U.S. Rep. John Katko and Democratic challenger Colleen Deacon accused each other of misleading voters and tangled on several issues Sunday during the final televised debate of the 24th Congressional District race.\nAt an hour-long debate hosted by WSYR, Deacon, D-Syracuse, said Katko’s campaign distorted her position on fighting the Islamic State, a terrorist group operating mainly in Iraq and Syria. Ads have been airing in central New York claiming that Deacon doesn’t have a plan to fight the terrorist organization.\nMoments later, Katko, R-Camillus, addressed the commercials that have aired against him seeking to tie him to Republican presidential nominee Donald Trump. Deacon has said that Katko publicly announced he wouldn’t endorse Trump when it was politically expedient to do so. Katko denied that charge.\nIn a rare moment of agreement, both candidates said that a constitutional amendment is needed to overturn the Supreme Court’s Citizens United decision that has had a dramatic effect on how campaigns are financed. But it didn’t take long for the sparring to restart.\nWhen asked by moderator Dan Cummings about the contributions he’s received from political action committees, Katko dismissed the idea that the money has influenced his actions as a lawmaker.\nDeacon pounced and suggested that the reason the GOP congressman doesn’t support a version of the “no fly, no buy” bill — a measure that would prevent suspected terrorists from purchasing guns — is because of donations he’s received from the National Rifle Association.\n“He supports the piece of legislation that the NRA supports,” Deacon said, referring to an alternative, but similar measure that Katko has cosponsored. “So I think that the shows the gun lobby has influenced John.”\nKatko said Deacon was “twisting things around” to make it seem he doesn’t support prohibiting those on the no-fly list from buying guns. He added that her claim ignored his 20-year career combating violent crime as a federal prosecutor.\nDeacon, turning to Katko, said it was about his record in Congress. She then claimed he doesn’t support universal background checks for gun purchases.\n“That’s just not true,” he said.\nBut Deacon didn’t stop there. She raised a story that was used against Katko during the 2014 election — the gun that was stolen out of his truck 16 years ago and used in a robbery.\nKatko was issued the gun when he was a federal prosecutor after receiving a death threat.\n“So you think that person shouldn’t have to go through a universal background check after they do their time,” Deacon said. “I think it’s obvious that you’re not supporting bipartisan commonsense gun legislation that 90 percent of Americans support.”\nKatko called Deacon’s claim “outrageous.”\n“To use that at this point just smacks of desperation,” he said.\nOther highlights from the debate:\n• The candidates were asked for their positions on the Hyde Amendment, which bans the use of Medicaid to cover abortion services. Deacon supports repealing the Hyde Amendment, which she says impacts low-income women. Katko doesn’t support getting rid of the ban.\n• Cummings asked the candidates if American security would be threatened if we accept Syrian refugees. Deacon said there is an intense vetting process in place to screen refugees before they get enter the U.S. Most of the refugees, she noted, are women and children.\nKatko disagreed that the vetting process is the most intensive. He said terrorist groups, most notably ISIS and al-Qaeda, want to infiltrate the West by disguising themselves as refugees.\n• Deacon and Katko also clashed over FitzPatrick Nuclear Power Plant in Oswego County. Deacon was asked if she supported the Clean Energy Standard, which the state adopted to subsidize nuclear energy. She came out in support of the subsidies that helped keep FitzPatrick operating in Scriba.\nBut Katko said she ignored the issue when she worked in U.S. Sen. Kirsten Gillibrand’s office. He added that his opponent opposes the development of any more nuclear power plants.\nDeacon accused Katko of “making things up.” When the news about FitzPatrick’s possible closure first broke, she said she was finishing up her final week as Gillibrand’s top aide in the region. The announcement was made in mid-September 2015. She left Gillibrand’s office to launch her congressional campaign on Oct. 1.\nKatko, though, reiterated his point that she was the point person for Gillibrand in the district. He then claimed she’s “anti-nuke.”\nThe debate airs at 7 p.m. Sunday on WSYR channel 9. It will air again at 8 p.m. Monday on Me-TV channel 9.2, Verizon FiOS channel 470 and Time Warner Cable channel 1240.\nVoters in the 24th Congressional District will go to the polls Tuesday to decide whether Katko will get a second term or if Deacon will be their new representative.\nThe district includes all of Cayuga, Onondaga and Wayne counties, plus the western portion of Oswego County.\nKatko will appear on the Republican, Conservative, Independence and Reform ballot lines. Deacon has the Democratic and Working Families Party lines.", "url": "https://apnews.com/f8fcb3898d094138ba802dd62d0d798d"}