{"authors": ["Loren Balhorn", "Mark Bergfeld", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic"], "date_download": "2020-05-04 19:58:30", "date_modify": "2020-05-04 19:58:30", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_09_berlin-elections-die-linke-afd-merkel-cdu-spd_1588622310.html", "image_url": "https://images.jacobinmag.com/2016/10/17230911/Screen-Shot-2016-09-22-at-9.10.02-AM1-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09_berlin-elections-die-linke-afd-merkel-cdu-spd_1588622310.html", "title": "The Elections in Berlin", "title_page": "The Elections in Berlin", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Two weeks after the worrying performance of the right-wing Alternative for Germany (AfD) in Mecklenburg-Vorpommern, last Sunday’s elections in the German capital of Berlin have allowed the country’s left to breathe a reluctant sigh of relief.\nDie Linke enjoyed significant gains in the western part of the city and it remained the strongest party in the east, albeit with some losses. The party’s gains are encouraging, particularly for demonstrating that the Left can be successful with a consistently antiracist and pro-refugee message.\nThere is no doubt, however, that Sunday’s real winner was once again the AfD. The right-populist party secured a plurality of votes in many eastern neighborhoods Die Linke once took for granted, despite fielding multiple candidates openly associated with the far right.\nIn Berlin, as in the rest of the country, the political center continues to buckle — Germany’s two largest parties, the Christian Democrats (CDU) and Social Democrats (SPD), received some of their worst results in postwar history, although the SPD managed to hold onto its position as the strongest governing force.\nNegotiations are just beginning, but the CDU’s disastrous losses make a “Red-Red-Green” coalition between SPD, Greens, and Die Linke likely.\nThe vote in Berlin both confirms the city’s status as a cosmopolitan metropolis in which the forces of the center left enjoy broad hegemony, as well as reflects the wider national trend in which the parties of the center shed voters to both the left and right and the AfD establishes itself as the main destination for protest voters. The Alternative for Germany received its best results in the city’s poorer suburbs, followed by the middle-class neighborhoods in the west.\nThe SPD and Greens appear to have a consistent but diminishing hold over voters in the core districts of the city, while Die Linke made gains, particularly in areas with large immigrant communities, and received a better-than-expected result on the whole. Of particular note is the party’s success in the northern parts of Neukölln, a largely working-class, multi-ethnic neighborhood subject to intense gentrification in recent years, where the party more than doubled its result to over 20 percent.\nThat said, a drift among German workers towards right-populism can also be detected: according to exit polls, 27 percent of “workers” voted for the AfD, compared to 18 percent for the SPD, and 16 percent for Die Linke. While the urban, white-collar middle- and working-classes seem to respond to the crisis by moving left, large sections of the traditional center and working class are veering right.\nThis ongoing realignment remains an open-ended process, seen in both the rise of the AfD as well as the recovery of the Free Democrats, who enjoyed one of their first electoral successes since getting booted out of the Bundestag three years ago. It suggests that time may be running out for Germany’s period as a bastion of European stability, and will probably mean further electoral surprises in the future.\nThe leadership of Die Linke, for its part, has made its position clear: the election in Berlin ought to serve as an example for the entire country. The three parties of the center left bear what Gregor Gysi recently described as a “historical obligation” to counter the right-populist tide by forming progressive coalition governments, first on the state level, and on the national level next year. Party co-chairs Bernd Riexinger and Katja Kipping echoed these sentiments at a press conference on Monday. Some SPD and Green politicians have begun entertaining the notion as well, as the CDU, suffering heavy losses to the AfD, is an increasingly toxic political brand with whom few want to be associated.\nIt remains unclear, however, on what political basis such a coalition would operate. Any hopes that the Social Democratic Party is tacking to the left, even out of sheer opportunism, were dashed by the party’s decision on Monday to endorse the controversial CETA free-trade agreement, against which 320,000 people protested last weekend across Germany.\nThe Greens, largely a party of the socially liberal middle class, have proven remarkably ideologically flexible in recent years, joining conservative and social-democratic governments alike. Should a Red-Red-Green coalition ultimately emerge, Die Linke will be the only party of the three with any real credibility on social questions, and as a junior partner will be placed under tremendous pressure to compromise on many of its core issues.\nA repeat of 2001-2011, when Die Linke governed Berlin together with the SPD and lost nearly half of its voter base, seems possible.\nGiven the fragility of the political center and the dim prospects for achieving tangible progressive reforms as the weaker half of a coalition government, it makes strategic sense for Die Linke to pursue a path of principled opposition. Yet such a perspective is difficult to convey in a context where the overwhelming majority of Linke voters favor participation in government. Faced with such a mandate, it will be extremely difficult for the left wing of the party to assert a plausible alternative without the support of social movements, which in turn are few and far between at the moment.\nBerlin’s reputation as a chaotic, open city where the radical left asserts a modicum of hegemony in public life may have been deserved ten or twenty years ago, but the city today looks drastically different. The powerful squatter and antifascist scenes that developed in the 1980s and 1990s have both reached historical lows, with many erstwhile squatter neighborhoods transformed into rows of expensive, renovated apartments.\nThe autonomist left, for its part, is still disoriented and weakened by the collapse of its largest organization, the Antifaschistische Linke Berlin, a few years ago. Meanwhile, Berlin has gone from being a “no-go area” for capital to one of the most attractive sites for investment in Europe, littered with booming IT firms and bright-eyed online startups. Entire neighborhoods have been transformed in a short time, limiting the scope for the sorts of autonomist strategies that have often predominated on the city’s radical left.\nThe balance sheet is not all negative, however. Recent victories for the social movements include the popular referendum to stop private development of the Tempelhofer Feld park, and campaigns around rising rents have shifted the discourse in the Left’s favor both in the city as well as across the country. Nevertheless, these sporadic initiatives have not coalesced into a sustained movement, nor has the organized left grown very much as a result. The hundreds of thousands who marched against TTIP and CETA across the country last weekend mark a refreshing exception to this rule, but arguably little more.\nIt seems possible, although by no means certain, that Berlin could serve as a template for a national Red-Red-Green government in one year’s time. Should such a coalition emerge, it will likely be weak politically, held together by an opposition to the AfD’s xenophobia and a popular mandate to govern from the center left, but with little room to do so given the turbulent economic and political climate, and confronted with a growing right-populist backlash, particularly among marginalized and rural voters, as well as sections of the middle class.\nIt also remains to be seen what consequences this series of electoral disasters will have for the Christian Democrats, who are under increasing pressure to do something to shore up support among their voting base. Angela Merkel’s eleven years in power have been characterized by a centrist neoliberal style that functioned well in times of relative stability, but is ideologically defenseless when challenged from the right.\nAs sections of the party grow increasingly vocal in their criticisms of the chancellor and push for more aggressive deportation policies, wider divisions in the ruling party could begin to emerge. First signs of an impending shift could be seen at Merkel’s press conference on Monday, when she expressed openly that she wished she could “turn back time” and change course on the refugee crisis.\nWith the further disarray of the political center likely, the outcome of the 2017 elections is completely uncertain.", "url": "https://jacobinmag.com/2016/09/berlin-elections-die-linke-afd-merkel-cdu-spd"}