{"authors": ["Vincent C. Caponi"], "date_download": "2020-05-04 20:15:32", "date_modify": "2020-05-04 20:15:32", "date_publish": "2016-11-10 18:41:07", "description": "Among America’s greatest strengths are those who have put their lives on the line to defend our country. From the 18-year-old high school graduate who just enlisted, to the veterans of all...", "filename": "_b238987947e74bd69264d4bff12f378a_1588623332.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b238987947e74bd69264d4bff12f378a_1588623332.html", "title": "Serving those who served us", "title_page": "Serving those who served us", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Among America’s greatest strengths are those who have put their lives on the line to defend our country.\nFrom the 18-year-old high school graduate who just enlisted, to the veterans of all our wars and conflicts who depend on the Department of Veterans Affairs (VA) for health care and benefits, we as a nation have an obligation to serve those who have served us.\nIn 2014, Congress passed The Veterans Access, Choice and Accountability Act — more commonly referred to as the Veterans Choice Program — to solve some of the well-publicized challenges that veterans had been experiencing in accessing Veterans Affairs healthcare services. The program was designed to enable veterans, under certain circumstances, to receive primary, inpatient and outpatient specialty care, as well as mental health services, from non-VA health care providers. It was intended, in short, to solve the access challenge by giving our veterans more options for their care.\nUnfortunately, it hasn’t quite worked as intended. Access-related issues persist for too many veterans. And some have even experienced a new, unintended consequence of the program: a poor credit rating. That’s because in some cases, payment to non-VA providers for health services has been held up so long that the providers are demanding payment from the veterans themselves.\nAt St. Vincent’s Medical Center, part of Ascension, the nation’s largest nonprofit health system, we are stepping up to do our part to help address this situation. We are working to ensure that our service members, veterans, and their families can connect to resources that enhance their well-being.\nWhy are we getting involved? Because we’re committed to providing compassionate, personalized care for all with special attention to those persons living in poverty and most vulnerable. Right now, no population is more vulnerable and more deserving of our compassion and support than our nation’s veterans.\nOur St. Vincent’s Medical Center advocates are contacting veterans and homeless veterans groups, as well as other community organizations, to get the word out to veterans in need. With our presence in southern Connecticut, we hope to make a substantial impact on veteran participation and access to quality care.\nSt. Vincent’s care providers receive special training to be sensitive to military culture, know how to appropriately screen veterans based on their prior duty assignments, and understand service-related illnesses that veterans may experience. We are proud to offer programs that heal both the physical and hidden wounds of war.\nAll of these efforts are designed to help make the Veterans Choice Program at St. Vincent’s Medical Center effective for retired and discharged members of our armed forces. To help ensure the most effective service on a sustained basis, Ascension has organized a system-wide monitoring effort to quickly unearth and address any issues that may arise, and share best practices across our health system and with VA.\nSt. Vincent’s is purposely — and purposefully — wading into a complex program with significant challenges. But the men and women in our community who have sacrificed so much for us deserve access to high quality health care. Working together, we have every confidence that our Veterans Choice public-private partnership will advance care for our military veterans and ultimately provide ideas on how to improve the delivery of health care in the general population as well.\nVincent C. Caponi is president and CEO of St. Vincent’s Medical Center.", "url": "https://apnews.com/b238987947e74bd69264d4bff12f378a"}