{"authors": ["Richard Seymour", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:17", "date_modify": "2020-05-04 19:56:17", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_09__1588622177.html", "image_url": "https://images.jacobinmag.com/2016/10/17230926/Screen-Shot-2016-09-23-at-12.42.17-PM1-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09__1588622177.html", "title": "The Bastards Live", "title_page": "The Bastards Live", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Whither Tony Blair? Every now and again, the guru appears in public to make a confused, glassy-eyed statement, regurgitating half-remembered platitudes and memories. Blair has always been vaguely incoherent when not scripted, the structure of his speech resembling a stream of consciousness rather than an argument.\nHere he is, recounting his glory days as “that bastard”:\nThere are two types of politics on the left – one is what I’d call the culture of protest and the other is the culture of government. I’m the face on the placard. I’m that bastard, let’s get rid of him. The other culture is the guys holding the placard. They don’t really want to be in power, they want to make the people in power respond to their concerns. It’s a different culture. These two different cultures are trying to cohabit in the same organisation. I don’t see how these two cultures cohabit, because the guy holding the placard hates the guy whose face is on the placard.\nThough clichéd, there is a logic to what Blair is saying here, and it is that coexistence is impossible. It looks like a prospectus for a split, or for a protracted war of attrition. So what, one might think? The Labour leadership race is about to conclude, with no Blairite in the running and likely a strong victory for Corbyn. The attack-dog Dan Hodges has signaled that for the Blairite camp, Owen Smith is a busted flush. They have politically emasculated themselves and, even if they split, it is unlikely that they will take much with them.\nSome on the Left confidently declare that Blairism is finished, and we can move on.\nIn a way this is true. The specific coordinates of “Third Way” thinking that made sense in the 1990s, as an adaptation to Thatcherite success amid a period of relative capitalist dynamism, no longer obtain. The attempt to adjust to the post-credit crunch era merely accentuated all the haughty Victorian ugliness of Blairism.\nThe moralistic anti-welfare discourse that was always a part of the mix became a rationale for austerity and bullying the unemployed. The nationalistic, family-values, socially conservative elements morphed into outright anti-immigrant chauvinism — “British jobs for British workers.” On top of that, of course, they were no longer able to offer public-sector investment as part of the mix, because that depended on City-driven growth that had just collapsed.\nIt may be forgotten just how off-putting Blairism was for core Labour voters, particularly in its decline. New Labour was always charmed by the City and the rich, and there was rarely a problem that they couldn’t envision a right-wing businessman solving. Now, while guaranteeing the profits of the banks so that the failed system could be restored, they were touting austerity, and bringing Lord Freud in to oversee draconian pension reforms. Meanwhile, as they kicked their own base, their highest-profile MPs were caught taking bribes from businessmen or siphoning off expenses.\nIf you want to know why Labour came out of the 2010 election with its lowest share of the vote since 1983 and its lowest membership since 1918, the contempt the party demonstrated toward its own base while grovelling to the rich is a big part of the reason.\nTo New Labour’s immense surprise, just enough party members and affiliates were aggrieved with their performance that their candidate was narrowly defeated in the 2010 leadership election. Even so, they gained a great deal of influence over the new leadership.\nEd Miliband didn’t have any organized basis with which to outflank the Blairites, so he allowed them to impress their priorities on policymaking. This entailed adopting right-wing populist language on welfare and immigration, and broadly accepting the parameters of austerity, even while trying to talk about some nebulous idea of a ”responsible capitalism.” Yet the Blairites seem to have assumed that people would blame Miliband’s outrageous leftism for the defeat in 2015. Party members again astonished them, this time by crushing their candidate, who received less than 5 percent of the vote.\nIt is not hard to understand, therefore, why some think Blairism has seen its day. While Blairites are hardly keeping their counsel, the most truculent opponents of Jeremy Corbyn seem to come from the party’s old right. It is they, together with some on the soft left, who orchestrated the coup against Corbyn. And as much as many of them played a pivotal role in the creation of New Labour, they seem to understand that this won’t play well right now.\nIn a little-known event back in May, Corbyn delivered the keynote address to the annual conference of the Blairite lobby, Progress. He was introduced respectfully by the chair, Angela McGovern, and delivered a characteristically conciliatory speech stressing areas of agreement and emphasizing that Labour was and always had been a broad church.\nThis was never going to be enough for Progress, but still he was received without rancor. It was as if they needed their members to get a measure of their quarry, as if they knew that they would get nowhere if they could not at least appear to empathize with the Corbynistas.\nAnd indeed, even from the second of Corbyn’s victory, Peter Mandelson’s memo to fellow mourners laid a great deal of emphasis on the obvious — but, for them, difficult — fact that the Blairites had lost the argument. And, crucially, it would take time to regain that ground:\nNobody will replace him, though, until he demonstrates to the party his unelectability at the polls. In this sense, the public will decide Labour’s future and it would be wrong to try and force this issue from within before the public have moved to a clear verdict. We must be ready when this happens. We can put forward as compelling a critique of Corbynism as we like but unless we have built in the meantime a coherent, modern and inspirational alternative to him — one that manages to tap in to the passions and emotional commitment of the party as well as speak convincingly to the public — the party will not be ready for a replacement.\nAlso note the tone of the New Labour pressure group, Labour Tomorrow, another voice of the party’s right. In a piece co-written by former Home Secretary David Blunkett and Baroness Dean, it argues that:\nWe need to ask much more fundamental questions about where the new ideas are coming from, how we devise an attractive offer in an era of austerity and how we organise our party to campaign in the digital age. Recent events have shown we do not have the answer to these questions and not nearly enough work is being done to try and address them. But if we can’t answer these questions as a Party, how can we expect to make an offer to the country?\nThis is a significant shift from the complacency of the “modernizers” in the runup to Corbyn’s victory. It also marks a break from the tone-deaf spite of some backbench MPs. It tacitly recognizes that simply pointing out that they believe Corbyn is “unelectable,” and that his supporters don’t really want to govern, is at best ineffectual and worst counterproductive to their ends.\nCurrently, the Blairites are thinking several steps ahead. Their strategy is to split off as much of Corbyn’s soft-left support as possible, and use it to break the Corbyn wedge. As in the 1980s, they hope that in so doing the soft left will exhaust itself and hand the leadership over to a revived and confident new right. Indeed, the evidence is precisely that by letting the soft left and the old right lead the resistance from the backbenches, they are achieving just that.\nTo that end, they advocate a “legacy group” to carry on Owen Smith’s “soft left” critique of Corbyn in the coming years. Only a fool would imagine that this is because Progress suddenly believes there is mileage in the politics of Ed Miliband. And just in the nick of time, a number of anti-Corbyn backbenchers have declared a relaunch of the old soft-left Tribune group. In the interim provided by their holding up the rearguard of the battle, they aim to reconstitute themselves and work out what a twenty-first-century Blairism could look like.\nCrucially, they are not talking about a split. It is very clear that they regard coexistence with the current membership as an impossibility. Blair and some of his allies openly declare that the membership is the problem, but the preferred way of expressing this is to attack proxies like Momentum or “Trots.” They mean to fight, but to fight from within. This means gradually converting waverers, and driving the rest out in demoralization.\nTheirs is a long game. They are used to letting others do their dirty work, while they operate as a tightly knit minority forging alliances behind the scenes. They have form in allowing demoralization and acrimony to do a lot of their work, while they slowly appropriate just enough of the thematics of their opponents to gain the edge. And they have no qualms about brutally antidemocratic practices, even if they prefer to outsource where possible.\nBlair’s talent for “delegating nastiness” was infamous back in the day. In some ways, they resemble the popular caricature of a Leninist vanguard: professional politicians who aspire to bring correct theory, strategy, and tactics to an otherwise passive and largely incapable base.\nTo put it another way, they’re the bastards. Proudly so. They aim to be the ones whose faces appear on the placards, because that is their conception of how political power operates, and how “good” is achieved. And they’re banking on the fact that while Corbyn’s politics goes with the grain of long-term social-demographic and political developments in the United Kingdom, theirs go with the grain of continuity and power.\nThey know that Corbyn’s project, as any big transformative project must be, is fragile. And they’re waiting.", "url": "https://www.jacobinmag.com/2016/09/corbyn-blair-new-labour-momentum-progress/"}