{"authors": ["Barry Eidlin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:04", "date_modify": "2020-05-04 19:58:04", "date_publish": "2016-08-21 00:00:00", "description": null, "filename": "2016_08__1588622284.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2016/08/21094802/mu.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_08__1588622284.html", "title": "From Class to Special Interest", "title_page": "From Class to Special Interest", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nWriting in the Washington Post last September, the unimpeachably mainstream economist Larry Summers proclaimed, “We . . . know that stronger unions are not just good for their members, they are good for our country and our descendants. Strengthening collective worker voice has to be an important component of any realistic American inclusive growth agenda.” His record as one of the leading architects of business-friendly Clintonomics notwithstanding, Summers’s call for stronger unions was a welcome change from the “more education and training” nostrums and tax-policy fixes usually on offer from mainstream liberalism. Summers’s focus on unions highlighted the real problem underlying growing inequality: the vast power imbalance between labor and capital. But the fact that even someone like Summers is concerned about labor’s weakness shows how dire the situation has become. After forty years of relentless attacks, union ranks have dwindled from a peak of one-third of workers in the 1950s to just over one-tenth today (including 6 percent in the private sector). The decline in density has been matched by a decline in unions’ social, economic, and political clout. In the decades after World War II, master contracts in auto, steel, mining, and trucking set the pattern for wages and working conditions in other major industries. Labor leaders like United Mine Workers head John L. Lewis, United Auto Workers president Walter Reuther, and Amalgamated Clothing Workers leader Sidney Hillman were household names whose actions were considered worthy of regular mainstream news coverage. Today, many union leaders cite nonunion competition as a rationale for accepting wage and benefit cuts, and few receive much attention outside the world of labor scholars and activists. Even in leftist and progressive circles, unions have fallen out of favor as a topic of conversation. How did we get to this point, where unions are so feeble that Summers and like-minded elites — no doubt concerned with the systemic instability produced by capital’s unchecked power — are fretting about the withering of labor? And while unions have declined across the industrialized world, why has the drop been so sharp and so dramatic in the United States? For people like Summers, as well as much of the labor leadership, the answer is US labor law. As a 2008 policy brief from the AFL-CIO argues: The National Labor Relations Board (NLRB) representation process has become a virtually insurmountable series of practical, procedural and legal obstacles. Instead of a protective shield, the NLRA now acts as a sword that is used by corporations to frustrate employees’ freedom of choice and deny their right to collective bargaining. This legalist explanation is often buttressed with reference to Canada, where many workers are employed by the same companies and are members of the same unions as their US counterparts, yet have not suffered the same fate. A 1985 AFL-CIO report makes the case well: Canada has roughly the same type of economy, very similar employers and has undergone the same changes [i.e., labor market shifts] that we previously have described with respect to the United States. But in Canada, unlike the United States, the government has not defaulted in its obligation to protect the right of self organization; rather Canada’s law carefully safeguards that right. More than thirty years later, much of this remains true. While Canadian unions aren’t in great shape, 31.5 percent of workers are still covered by union contracts, compared to 12.3 percent in the United States. (In 1985, those numbers were 39 percent and 18 percent, respectively.) But the Canada-US comparison is more revealing — if less favorable to partisans of the labor-law explanation — when we look even further back. There was a time when Canadian unionists looked to US labor with admiration — not the other way around. Examining the driving forces behind that role reversal offers important clues as to why US labor is so emaciated today.\nDistant Cousins In the middle of the twentieth century, Canadian unionists envied their southern neighbors. US workers, they thought, were the beneficiaries of more robust labor laws that allowed them to better their conditions with greater ease. “There has been a more positive attitude toward collective bargaining in the United States than in Canada,” the noted Canadian industrial relations scholar H. D. Woods argued in 1962. While such statements are striking today, they didn’t come from nowhere. Union density was higher in the United States than in Canada throughout the 1940s, and for much of the twentieth century, the two countries’ density numbers were quite similar. It wasn’t until the mid 1960s that the familiar gap took shape. However, this chasm didn’t open up because of some sea change in labor law. Many of the measures that ostensibly account for Canada’s higher union membership were only adopted in the 1970s and 1980s — a decade or more after the divergence was under way. Why, then, did the United States and Canada part ways? The answer to that question lies in the 1930s and 1940s, a period more associated with worker unrest and progressive New Deal legislation than with US labor’s decline. But it was precisely the US government’s response to that worker unrest — and the structure of the resulting political coalitions and policy frameworks — that ultimately weakened labor. Comparing the United States to Canada draws this out. In Canada, workers had to fight longer to win basic labor rights. While President Roosevelt and his New Deal administration quickly responded to labor unrest with legislative reforms like the 1933 National Industrial Recovery Act and the 1935 National Labor Relations Act (also known as the Wagner Act), successive Canadian governments steadfastly rebuffed labor’s demands. In the early 1930s, Conservative prime minister R. B. Bennett responded to labor with what he called the “iron heel of ruthlessness.” His government jailed or deported prominent organizers, banned the Communist Party, censored radical literature, and disrupted meetings. The unemployed were rounded up and shipped to remote work camps. When the Liberal William Lyon Mackenzie King replaced him in 1935, his approach to labor differed only in its lighter touch. As labor militancy escalated, King placed ever-tighter restrictions on workers’ ability to strike and refused to pass legislation compelling employers to bargain with workers. It wasn’t until 1944, nearly a decade after the Wagner Act, that King enacted a Canadian equivalent called P. C. 1003. Even then, he did so under duress. A wartime strike wave threatened Canada’s ability to supply its army, and a series of unexpected electoral defeats and near misses at the hands of an insurgent farmer-labor party called the Cooperative Commonwealth Federation (CCF, the precursor to today’s New Democratic Party) forced his hand.\n“Mistranslating” Class Conflict By the end of World War II, the state’s reaction to worker militancy had reorganized politics and labor policy in both countries, but in different ways. Roosevelt’s reforms convinced unions to abandon any effort to form an independent labor party and instead join the New Deal coalition. In Canada, the ruling parties’ repressive and dismissive attitude toward unions pushed them reluctantly into the arms of the fledgling CCF, paving the way for a Canadian labor party after decades of fits and starts. On paper, the two countries’ legal frameworks were quite similar. P. C. 1003 was even modeled on the Wagner Act. However, the conditions under which the two frameworks were formed gave rise to distinct organizational goals and disparate trajectories over time. The US approach was aimed at articulating and promoting labor rights; the Canadian rules sought to contain class conflict. This produced two key differences. First, US policymakers designed their administrative structure to mimic the court system. Adjudication of labor questions was kept separate from dispute resolution and conciliation, while enforcing labor-board decisions was left to the regular courts. By contrast, Canadian policymakers created a system that blended adjudication and conciliation and granted greater autonomy to labor boards to enforce their own decisions. Second, the United States adopted a nonpartisan structure, with National Labor Relations Board (NLRB) members appointed by the president to serve as ostensibly impartial judges. In Canada, however, the labor regime was generally a tripartite structure, with designated representation on federal and provincial labor boards for labor, management, and government. These structural differences shaped the way that class conflict translated into the political realm. Canadian labor law focused on enforcing industrial peace and therefore understood class conflict as such. In addition, the establishment of the CCF at the federal and provincial levels lent legitimacy to labor issues and imposed electoral costs for ignoring them. Labor militancy prodded lawmakers into passing reforms, which strengthened Canadian labor law over time. In the United States, that process was blocked. Episodes of class conflict were “mistranslated” either as questions of legal rights that had to be balanced against competing employer rights, as the narrow special interests of a key Democratic Party constituency, or as personal problems unrelated to politics. In each case, this mistranslation diffused the political effect of worker unrest and weakened US labor law.\nThe Legal Trap In the United States, channeling class conflict into a legal-rights framework created comparable incentives for both employers and unions: Management “lawyered up” and looked to exploit technical loopholes, while unions focused more on sharpening their legal arguments than educating and mobilizing members. Additionally, by creating a statutory equivalence between the opposing parties, the rights framework obscured the inherent power imbalance in the employment relationship. At the same time, tighter integration with regular courts exposed the NLRB’s decisions to substantive judicial review. This engendered a dynamic where judges would weigh employees’ recently established collective rights (as enshrined in the Wagner Act) against employers’ more deeply entrenched property rights. Needless to say, property rights have tended to win out. That concern with balancing worker and employer rights also led to the establishment of the “employer free speech” doctrine. Theoretically intended to allow workers to “hear both sides” before deciding to join a union, this innocuous-sounding provision allows employers to systematically threaten and intimidate employees to prevent them from unionizing. The situation was different in Canada. There, the emphasis on mitigating class conflict produced a more interventionist labor-law regime that prioritized quickly settling disputes over legal proceduralism. While this placed serious constraints on labor, it also constrained employers, who were less able to drag out labor negotiations and otherwise thwart unions. On top of this, state intervention prevented union leaders from developing the idea — common in the United States — that the government protected labor rights. By making class conflict more of a political issue, the state put a target on its back. Across firms and industries, workers recognized that the government’s actions might directly affect them, perhaps adversely. Canadian labor’s closer ties to the political left reinforced this perspective. The combination fostered a more independent, more oppositional union movement that could call bull on Canadian employers’ charges that the laws were tilted in labor’s favor.\nSpecial Interest? US labor’s political alliance with the Democratic Party, along with the structure of the labor boards, meant that unions were often cast as a narrow special interest housed within the Democratic Party. Ironically, their special-interest hue was a consequence of the NLRB’s ostensibly nonpartisan structure — the Wagner Act’s authors wanted to prevent the board from factionalizing along class lines. What they got instead, starting with President Eisenhower, was a body that factionalized along party lines. NLRB appointees no longer represented “the public,” but rather the political agenda of the president who appointed them. Labor law became a political football, with Democratic and Republican appointees taking turns reversing each other’s decisions. But the back-and-forth bent in a pro-management direction. The courts that reviewed NLRB decisions favored narrow readings of the law that privileged employers’ property rights over workers’ collective rights. In addition, labor’s special-interest identity meant that calls for pro-labor reforms were dismissed as political payback rather than being seen as a legitimate way to pacify class conflict. By contrast, Canada’s tripartite structure gave labor, capital, and the state a stake in maintaining its long-term legitimacy while preventing US-style political polarization. Symbolically, the triumvirate framework reinforced labor’s identification as a class representative at the same time it undermined employers’ ability to portray business interests as synonymous with the public interest. A legitimated labor-law framework, a state intent on enforcing industrial peace — together they generated a postwar dynamic whereby labor unrest led to state intervention, which then culminated in legislative amendment of labor laws. For Canadian unions, this dynamic reinforced the importance of mobilizing members to win demands. And for capital and the government, it reinforced the importance of a strong labor regime to discipline workers.\nClass Conflict or Alienation? As inflationary pressures sparked employers to reassert their “right to manage” starting in the late 1960s, strike rates soared in both countries. But while the initial uptick in industrial unrest was comparable in the United States and Canada, the impact was different. For Canadian labor, increased worker militancy had a galvanizing effect. Unions’ greater political independence through the New Democratic Party (NDP), coupled with closer organizational ties to other social movements, encouraged it to think of itself (and act as) a class representative. Labor continued to fight for broader social reforms while also mobilizing political pressure outside the halls of Parliament. As a result, Canadian unions were better equipped to withstand the increased employer and government attacks on labor beginning in the 1970s and 1980s. In the US, worker militancy deepened divisions between a restive rank and file and an increasingly conservative union leadership. Labor leaders’ alliance with the Democratic Party, combined with Cold War isolation from the left and social movements, encouraged them to think and act as an interest group. Constrained by a conceptual and organizational straightjacket, labor sought economic improvements at the bargaining table while trying to win political reforms using inside influence and lobbying. The US labor leadership saw the surge in rank-and-file combativeness as a threat, not an opportunity. But as labor’s cachet within the Democratic Party eroded and employer and government attacks intensified, labor’s underlying organizational weakness was exposed — allowing employers to engage in what United Auto Workers president Douglas Fraser (1977–1983) despairingly called a “one-sided class war.” As for the state, Canadian government officials responded to the uptick in class conflict in the time-honored manner: they introduced legislative reforms that shored up the labor regime. US government officials, however, interpreted the crisis as the product not of class conflict but of individual worker alienation in postindustrial society. The legislative tweaks they proposed involved improving human-resources practices rather than labor law — so the legal environment, already tilted toward capital, continued its anti-labor slide.", "url": "https://www.jacobinmag.com/2016/08/eidlin-united-states-canada-unions-labor/"}