{"authors": [], "date_download": "2020-05-04 20:21:52", "date_modify": "2020-05-04 20:21:52", "date_publish": "2016-07-03 20:57:48", "description": "LONDRES (AP) — Theresa May, la principal aspirante del Partido Conservador para reemplazar a David Cameron como primer ministro de Gran Bretaña, prometió el domingo unificar a su dividido partido...", "filename": "_02e5e13b1de54457913f90bafeb28bde_1588623712.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e1279d19050d47d3ab530db39de756ee/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_02e5e13b1de54457913f90bafeb28bde_1588623712.html", "title": "May promete unificar a Gran Bretaña tras triunfo del Brexit", "title_page": "May promete unificar a Gran Bretaña tras triunfo del Brexit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nMay promete unificar a Gran Bretaña tras triunfo del Brexit\nLa secretaria del Interior de Gran Bretaña, Theresa May, anuncia sus aspiraciones a reemplazar a David Cameron como primer ministro, el 30 de junio de 2016. Cameron renunció en cuanto se conoció el resultado del referendo del 23 de junio sobre la salida británica de la Unión Europea. (AP Foto/Matt Dunham)\nLa secretaria del Interior de Gran Bretaña, Theresa May, anuncia sus aspiraciones a reemplazar a David Cameron como primer ministro, el 30 de junio de 2016. Cameron renunció en cuanto se conoció el resultado del referendo del 23 de junio sobre la salida británica de la Unión Europea. (AP Foto/Matt Dunham)\nLONDRES (AP) — Theresa May, la principal aspirante del Partido Conservador para reemplazar a David Cameron como primer ministro de Gran Bretaña, prometió el domingo unificar a su dividido partido y país mientras gestiona una salida lenta y negociada de la Unión Europea.\nLa secretaria del Interior, quien mantiene una fuerte ventaja frente a otros cuatro rivales conservadores antes de que la dirigencia vote el martes, se considera la mejor para tender un puente entre los fervientes partidarios de pertenecer a la UE y aquellos que rechazan seguir en ella.\nMay dijo que bajo su liderazgo, el Reino Unido no podrá declarar formalmente su intención de irse del bloque comunitario hasta el año entrante, lo que significa que el llamado Brexit —la salida británica— no sucederá sino hasta 2019.\nDe acuerdo con el Artículo 50 del tratado de la Unión Europea, los países miembros que soliciten formalmente salirse del grupo de 28 países deben dar un espacio de dos años para negociar nuevos acuerdos con socios de la UE.\n“Lo que es importante es que hagamos esto en el tiempo correcto para conseguir el mejor acuerdo para Gran Bretaña. No debemos invocar el Articulo 50 inmediatamente”, declaró May en entrevista con la cadena BBC. “No debe ser antes de finales de año. Necesitamos establecer nuestra propia posición negociadora”.\nMay apoyó oficialmente los esfuerzos de Cameron a favor de mantenerse en la UE, pero ella misma evitó hacer campaña. El domingo dijo que su relativa neutralidad le ayudará a construir consenso entre los 17 millones que votaron a favor del Brexit y los 16 millones que sufragaron en contra en el referendo del 23 de junio.\n“Me queda claro que Brexit significa Brexit”, dijo la funcionaria. “Lo que necesitamos hacer es juntar las dos partes, unir a los partidarios del ‘irse’ y a los del ‘quedarse’, y unir al país”.\nCameron renunció en cuando se conoció el resultado del referendo. Además de May, hay cuatro candidatos conservadores a sucederlo.\nLa votación del martes en la que participarán 330 legisladores conservadores eliminará al candidato menos popular. Posteriormente, el jueves, habrá otras dos votaciones internas de partido y el 12 de julio se reducirá a dos candidatos. Los dos que sobrevivan pasarán semanas buscando apoyo entre los casi 150.000 miembros de base del partido y para el 9 de septiembre se declarará un ganador.\nSondeos de la prensa local a conservadores indican que May podría tener asegurado el voto de más de 100 legisladores, mientras que los otros tres —Michael Gove y Andrea Leadsom (opuestos a la UE) y Stephen Crabb (pro UE)— tendrían 20 cada uno. El ex secretario de Defensa Liam Fox (también anti UE), solo ha asegurado un puñado de votos y se considera que podría ser el primero en ser eliminado en la votación del martes.", "url": "https://apnews.com/02e5e13b1de54457913f90bafeb28bde"}