{"authors": ["Houston Chronicle"], "date_download": "2020-05-04 20:16:58", "date_modify": "2020-05-04 20:16:58", "date_publish": "2016-12-21 16:04:28", "description": "All shows are free unless otherwise noted. Galleries Anya Tish Gallery: \"Eduardo Portillo: Planos Moldeados,\" through Saturday; 4411 Montrose; 713-524-2299, anyatishgallery.com.", "filename": "_2eb2c6eded69423ba084bf57761ece0f_1588623418.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2eb2c6eded69423ba084bf57761ece0f_1588623418.html", "title": "Art gallery and museum listings: Dec. 22-28", "title_page": "Art gallery and museum listings: Dec. 22-28", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "All shows are free unless otherwise noted.\nGalleries\nAnya Tish Gallery: “Eduardo Portillo: Planos Moldeados,” through Saturday; 4411 Montrose; 713-524-2299, anyatishgallery.com.\nArt of the World Gallery: “Fernando Botero,” through Feb. 11; 2201 Westheimer; 713-526-1201, artoftheworldgallery.com.\nBarbara Davis Gallery: “All of the Above,” group show, through Dec. 31; 4411 Montrose; 713-520-9200, barbaradavisgallery.com.\nBrandon Gallery: “An Introduction to Earth Photography: Bill Daniel and David Janesko,” through Jan. 21; 1708 Westheimer; 713-522-0369, brasilcafehouston.com/thebrandon.\nBlueOrange Art: “Houston vs. Dallas,” group show, through Thursday; 1208 W. Gray; 713-527-0030, blueorangehouston.com.\nCapsule Gallery: “Jewelry Edition: Vol. 3,” through Dec. 31; 3909 Main; 713-807-7065, capsulegallery.com.\nCardoza Fine Art: “New World,” works by Bret Shirley, through Jan. 15; 805A William; 713-386-9708, cardozaartgallery.com\nCatherine Couturier Gallery: “Deck the Walls,” group show, through Jan. 7; 713-524-5070, catherinecouturier.com.\nCindy Lisica Gallery: “Pop Presence,” group show, through Dec. 31; 4411 Montrose; 713-807-7760, cindylisica.com.\nDavid Shelton Gallery: “Ian Swanson: cynics milk,” through Friday; 4411 Montrose; 713-393-7319, davidsheltongallery.com.\nDeborah Colton Gallery: “Dorothy Hood: Select Paintings” and “Bert Long: Looking for the Right Time,” through Jan. 28; 2445 North Blvd.; 713-869-5151, deborahcoltongallery.com.\nDevin Borden Gallery: “David Lackey: Witnesses,” through Jan. 13; “Todd Hebert: Cups, Coolers, Watermelon and Bottles,” through Friday; 917 Main; 713-529-2700, devinborden.com.\nGallery Sonja Roesch: “Luminous,” group show, through Dec. 31; 2309 Caroline; 713-659-5424, gallerysonjaroesch.com.\nGray Contemporary: “Shawn Stipling: In Other Words” and “Cecilia Vissers: The Edge of the Sea,” through Jan. 7; 3508 Lake; 713-862-4425, graycontemporary.com.\nGremillion & Co: “Ann S. Adams: A Dialogue With Nature,” through Jan. 7; 2501 Sunset, 713-522-2701, gremillion.com.\nGspot Contemporary Art Space: “Margaret Ann Withers /Adrift,” through Jan. 3; 310 E. 9th; 713-822-4842, ggallery.com.\nHiram Butler Gallery: “Inadmissible Evidence,” annotated press photographs from the collection of Murray Moss, through Jan. 7; 4520 Blossom; 713-863-7097, hirambutler.com.\nHooks-Epstein Galleries: “Kermit Oliver,” through Jan. 7; 2631 Colquitt; 713-522-0718, hooksepsteingalleries.com.\nInman Gallery: “Jamal Cyrus: STANDARDZENBLUZ,” through Dec. 30; 3901 Main; 713-526-7800, inmangallery.com.\nKoelsch Haus: Works by Katie Maratta and Kelli Scott Kelley, through Dec. 31; 801 Richmond; 713-862-5744, koelschgallery.com.\nLaura Rathe Fine Art: “The Worlds of Hunt Slonem,” through Jan. 7; 2707 Colquitt; 713-705-5044, laurarathe.com.\nMcClain Gallery: “Gary Lang: WanderWonder” and “Jeff Shore/Jon Fisher: Clockworks,” through Thursday; 2242 Richmond; 713-520-9988, mcclaingallery.com.\nMoody Gallery: “Pat Colville: Hardscapes,” through Jan. 7; 815 Colquitt; 713-526-9911, moodygallery.com.\nNicole Longnecker Gallery: “Julian Lorber: How We Play,” and “Nicole Pietrantoni: Natural Complexities,” through Jan. 7; 2625 Colquitt; 713-591-4997, longneckergallery.com.\nRedbud Gallery: “Michael Horvath: The Fleet,” through Jan. 3; 303 E. 11th; 713-854-4246, redbudgallery.com.\nSamara Gallery: “December Group Show,” through Dec. 31; 3911 Main; 713-999-1009, samaragallery.com.\nSicardi Gallery: “Melanie Smith: Abandoned Bodies and Uncertain Futures,” through Saturday; 1506 W. Alabama; 713-529-1313, sicardigallery.com.\nTexas Gallery: “Still(ed) Life: An Exhibition in Two Parts,” group show, through Jan. 14; 2012 Peden; 713-524-1593, texgal.com.\nWilliam Reaves | Sarah Foltz Fine Art: “Contemporary Texas Regionalism: A Holiday Show” through Friday; 2143 Westheimer; 713-521-7500, reavesart.com.\nWilliams Tower Gallery: “The Block,” works by Glassell School of Art fellows, through Jan. 5; 2800 Post Oak Blvd.; 713-553-5060.\nZoya Tommy: “Agnes Bourely: Happily Imperfect,” through Jan. 7; 4102 Fannin; 832-649-5814, zoyatommy.com\nMuseums\nArt Car Museum: “Lives Matter,” through Jan. 29; 140 Heights; 713-861-5526, artcarmuseum.com.\nArt League Houston: Ayanna Jolivet McCloud’s “Score: Field Work,” Jennifer Ling Datchuk’s “Blackwork” and Trey Duvall’s “Loschmidt’s Column,” through March 11; 1953 Montrose; 713-523-9530, artleaguehouston.org.\nAsia Society Texas Center: “In the Wake: Japanese Photographers Respond to 3/11,” through Jan. 1; and “3DPRK: North Korean Portraits by Matjaz Tancic,” through Feb. 26; $5; 1370 Southmore; 713-496-9901, asiasociety.org.\nBlaffer Art Museum: “Blake Rayne: Cabin of the Accused” and “Analia Saban,” through March 18; 4173 Elgin, University of Houston; 713-743-9521, blafferartmuseum.org.\nContemporary Arts Museum Houston: “Angel Otero: Everything and Nothing,” through March 19; “A Traveling Show,” through Jan. 15; 5216 Montrose; 713-284-8250, camh.org.\nCzech Cultural Center: “Josef Lada Prints,” through Jan. 31; 4920 San Jacinto; 713-582-2060, czechcenter.org.\nGalveston Arts Center: Rachel Gardner’s “Prey,” Rena Wood’s “Interpreting Memory” and “Beyond Bindings: The Book as Art,” through Jan. 8; 2127 Strand, Galveston; 409-763-2403, galvestonartscenter.org.\nHolocaust Museum Houston: “Genocide: Man’s Inhumanity to Humankind,” through Dec. 31; $12; 5401 Caroline; 713-942-8000, hmh.org.\nHouston Center for Contemporary Craft: “CraftTexas,” through Jan. 8; “Best If Used By,” Artist Hall, through Jan. 15; 4848 Main; 713-529-4848, crafthouston.org.\nHouston Center for Photography: “The Surface of Things,” through Jan. 15; 1441 W. Alabama; 713-529-4755, hcponline.org.\nKaty Contemporary Art Museum: “Alfredo Gisholt: For the Love of Paper,” through Jan. 15; 805 Ave. B, Katy; 832-541-7981, katycam.com.\nLawndale Art Center: “Double Digits: Lawndale’s Studio Artist Program, 10 Years and Counting,” through Thursday; 4912 Main; 713-528-5858, lawndaleartcenter.org.\nThe Menil Collection: “Picasso: The Line,” and “Andy Warhol: Sunset” (screens 6 p.m. Wednesdays), through Jan. 8; “Holy Barbarians: Beat Culture on the West Coast,” through March 12; 1533 Sul Ross; 713-525-9400, menil.org.\nMuseum of Fine Arts, Houston: “Ancient Luxury and the Roman Silver Treasure from Berthouville,” through Feb. 5; “Emperor’s Treasures,” through Jan. 29; “Degas: A New Vision,” through Jan. 8; “Julian Onderdonk and the Texan Landscape” and “A Texas Legacy: Selections From the William J. Hill Collection,” through Jan. 2; “Helen Levitt: In the Street,” through Jan. 2; $7.50-$23; 5601 Main; 713-639-7300, mfah.org.\nProject Row Houses: “Round 45: Local Impact,” installations by Regina Agu, JooYoung Choi, Sally Glass, Jesse Lott and Ann Harithas, Tierney Malone, Harold Mendez and Patrick Renner, through Feb. 21; 2521 Holman; 713-526-7662, projectrowhouses.org.\nStation Museum of Contemporary Art: “Friendly Fire: Houston Sculpture,” through Feb. 5; 1502 Alabama; 713-529-6900, stationmuseum.com.", "url": "https://apnews.com/2eb2c6eded69423ba084bf57761ece0f"}