{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:13:22", "date_modify": "2020-05-04 20:13:22", "date_publish": "2016-11-24 05:35:00", "description": "There is nothing quite like rivalry week in college football, but the landscape has changed dramatically in recent years, much of it owing to the success of the Southeastern Conference. In...", "filename": "_0cc8309da3ba41ad856d7d5b39d33fba_1588623202.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0cc8309da3ba41ad856d7d5b39d33fba_1588623202.html", "title": "LORAN SMITH COLUMN: Rivalries have evolved over the years in college football", "title_page": "LORAN SMITH COLUMN: Rivalries have evolved over the years in college football", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "There is nothing quite like rivalry week in college football, but the landscape has changed dramatically in recent years, much of it owing to the success of the Southeastern Conference.\nIn the ’50s and’60s, before television reared its influential head, you found out about Ohio State-Michigan, Harvard-Yale, Texas-Texas A&M, Army-Navy and USC-UCLA from the Associated Press (sometimes on Monday) and Movietone News at your local theatre.\nThere was some suspense to it all, which has been eliminated. Thirty seconds after the final score, you can grab your iPhone and bring yourself up to date with game details from those distant places like Columbus, Ann Arbor, Los Angeles, College Station, Norman and Madison. Even Tuscaloosa was a “fer” piece. Baton Rouge and Knoxville required the greatest of effort and resources to visit.\nIt was fascinating to read about the Little Brown Jug. Bill Stern on radio made your imagination run rampant, and then you found out years later he made things up. Even so, college football has always held sway with the rank and file in America.\nIt wasn’t that the SEC messed things up, but the league is responsible for making it different. When then Commissioner Roy Kramer talked the league into taking in Arkansas and South Carolina, this brought about 12 teams, which meant the rules allowed the SEC to determine its champion with a playoff.\nWhen the Big Ten, Southwest, Big Twelve and other conferences realized each SEC school was making millions from the championship game, heads were turned and action was taken to follow suit.\nAccompanying this initial expansion was the rush to a playoff system, which sounded the death knell of certain rivalries; Two of the most storied rivalries — Texas A&M-Texas and Missouri-Kansas — went by the wayside when those schools joined the SEC. When Nebraska joined the Big Ten, college football saw the ending of the Oklahoma-Nebraska matchup.\nThe SEC did a good job of preserving the Georgia-Auburn rivalry and the Alabama-Tennessee rivalry when it expanded. When Georgia Tech left the SEC in 1964, Georgia kept the big game with Tech intact, which brings up an interesting vignette.\nWhen Tech was looking for a head coach to replace Bud Carson, Bobby Dodd, who took the lead role in getting the Yellow Jackets out of the SEC, interviewed Johnny Majors. Dodd told Majors the Tech job would be “the best job you could have, if you just didn’t have to play the University of Georgia every Saturday after Thanksgiving.”\nThis rivalry has been a keen one, but is best described by the late Bill Cromartie, the author, whose books on the series carried the title, “Clean Old Fashioned Hate.” That is an apt description when you consider that most experts familiar with the Alabama-Auburn rivalry always note that there is bitterness as thick as an early morning fog.\nEven with an eight-year losing streak to Tech, the Georgia fans endured bitterness, but mostly focused on the Bulldogs’ inability “to get the job done.” That probably is the same with Tech, which has endured two seven-year winning streaks by Georgia.\nTech’s getting out of the SEC, however, took something out of the rivalry, and the move to go independent did not fill the coffers as Dodd thought it might. By 1966, the Braves and Falcons brought competition for the sports dollar, which eventually influenced Tech to return to a conference. The Jackets were pleased to have the opportunity to become a member of the Atlantic Coast Conference.\nIt is interesting to note that a big turning point came about when Vince Dooley was named the Georgia coach and began his career with a five-year streak over his in-state rival. Since the Dooley era began, the pendulum has swung in the Bulldogs’ direction, with the Red and Black holding a 39-13 advantage.", "url": "https://apnews.com/0cc8309da3ba41ad856d7d5b39d33fba"}