{"authors": ["Thomas Clouse"], "date_download": "2020-05-04 20:06:55", "date_modify": "2020-05-04 20:06:55", "date_publish": "2016-11-04 00:00:00", "description": "While many students, parents and one lawmaker spoke Thursday in support of letting suspended football player Robert Barber return to class at Washington State University, attorneys representing...", "filename": "_b0c6d6022e4942e0b7227fac7fee729f_1588622815.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b0c6d6022e4942e0b7227fac7fee729f_1588622815.html", "title": "Court filing says WSU football player Robert Barber hit unconscious student as he lay on the floor, threatened cop in 2015", "title_page": "Court filing says WSU football player Robert Barber hit unconscious student as he lay on the floor, threatened cop in 2015", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Court filing says WSU football player Robert Barber hit unconscious student as he lay on the floor, threatened cop in 2015\nWhile many students, parents and one lawmaker spoke Thursday in support of letting suspended football player Robert Barber return to class at Washington State University, attorneys representing the school filed court documents this week that shed new light on the actions leading to his suspension.\nThe documents say the “undisputed facts” are that Barber punched another student at a party in July, then punched him again as the student lay unconsious on the floor.\nThe documents also detailed a 2015 incident when Barber was cited for threatening an off-duty police officer.\nThe filing provides the most detailed account to date about the allegations against Barber and how the school handled his disciplinary hearing. The paperwork was filed this week in response to a motion by Barber’s attorney asking a Whitman County Judge to issue a stay in Barber’s suspension, which would allow him to attend school while the issues are addressed.\nDanielle Hess, a Senior Assistant Attorney General representing WSU, refuted earlier claims by Barber’s attorney about the Student Conduct Board hearing regarding the fight on July 23 that left one man with a concussion and another with a broken jaw.\nHess wrote that Barber “chose not to be accompanied by an attorney at the hearing.”\nVideo of the fight that was part of Barber’s conduct-board hearing showed Barber striking the man, Jackson Raney, who suffered the concussion. The video also showed Barber striking Raney after he was down on the floor. Barber admitted he was the person in the video punching the man, who was on his back.\n“At the time of the assault, (Barber) said he felt someone push him from the side, which made him feel threatened, and he reacted to it by punching the person,” Hess wrote. “When asked if he still felt in danger once (Raney) was lying on the ground, Mr. Barber answered yes. He said he just ‘didn’t think’ and ‘felt threatened.’”\nAt the end of the hearing, Barber apologized for injuring Raney and requested community service instead of expulsion or suspension.\nOn Sept. 13, the board rejected Barber’s claims of self-defense.\n“The man you struck was not even looking toward you when you struck him,” WSU wrote in documents submitted to the court. “And certainly, after he was on the ground and unconcious, he was no threat to you, but you still struck him again.”\nThe conduct board also took into account an incident in March 2015 when it expelled Barber. That decision that was later changed by the University Appeals Board to a suspension that will last until July 2017.\nIn the incident last year, Barber apparently had become upset after a friend was arrested for disorderly conduct. Barber hit the side of another student’s car and began yelling expletives, including, “I hate white people.”\nBarber then pointed to an off-duty police officer and said, “Once these officers leave I’m going to beat the shit out of you,” according to court records.\nEven after the off-duty cop informed Barber that he was an officer, Barber continued to threaten him. The officer called 911 and Barber responded by taunting him using profanity, saying, “What? Are you a little (expletive)? Now you’re gonna call 911?”\nBarber was subsequently arrested and cited for misdemeanor harassment.\nAt his Conduct Board hearing for that incident, Barber said he became angry because people were laughing at his friend. He was ordered to write a “reflection” paper in which he wrote: “I know that I would get in serious trouble for physical assault.”\nBased on the officer encounter and the allegations from the July 23 fight, the Conduct Board “determined that expulsion was the proper sanction because Mr. Barber was a risk to other members of the community,” Hess wrote. “Because of the seriousness of Mr. Barber’s violations, allowing him to return to WSU could … pose a threat to other students.\n“Based on the foregoing, WSU respectfully requests that the Court deny Mr. Barber’s motion for a temporary restraining order,” Hess wrote.\nAs of Thursday, the Whitman County judge had not set a hearing to decide the matter.", "url": "https://apnews.com/b0c6d6022e4942e0b7227fac7fee729f"}