{"authors": ["Joshua Fechter"], "date_download": "2020-05-04 20:07:24", "date_modify": "2020-05-04 20:07:24", "date_publish": "2016-07-07 23:05:20", "description": "San Antonio-based convenience store company CST Brands Inc. announced Thursday that it completed the $408 million sale of its 79 in California and Wyoming to 7-Eleven — a measure taken to pay down...", "filename": "_70b7c60f99864eafa5f998997e8e2d47_1588622844.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_70b7c60f99864eafa5f998997e8e2d47_1588622844.html", "title": "CST Brands finalizes $408 million sale of California, Wyoming stores to 7-Eleven", "title_page": "CST Brands finalizes $408 million sale of California, Wyoming stores to 7-Eleven", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "San Antonio-based convenience store company CST Brands Inc. announced Thursday that it completed the $408 million sale of its 79 in California and Wyoming to 7-Eleven — a measure taken to pay down the company’s debt.\nCST — which operates the Corner Store chain of convenience stores — agreed to sell its 76 stores in California and three in Wyoming to 7-Eleven in May, two months after two activist investors joined the board and pressured the company to explore “strategic alternatives to further enhance stockholder value.”\nThe San Antonio convenience store operator expects to see a tax benefit via a like-kind exchange with its February acquisition of the Georgia-based Flash Foods convenience store chain, which had 165 stores, the company said in a release Thursday. CST took on $300 million of fresh debt from that sale.\nCST also agreed to pay subsidiary CrossAmerica Partners LP about $18.2 million to compensate for a decrease in fuel revenue resulting from the sale. CrossAmerica Partners, which CST acquired in 2014, holds a 17.5 percent interest in CST’s wholesale fuel business CST Fuel Supply LP.\nCST’s aggressive expansion plans since it spun off from Valero Energy Corp. in 2013 have left it saddled with $1.32 billion in debt. S&P Global Ratings warned earlier this year that CST’s credit rating be downgraded if the convenience store operator fails to tamp down its liabilities.\nThe San Antonio company is at the center of a bidding war between the foreign owners of 7-Eleven and Canada’s Alimentation Couche-Tard Inc., Circle K’s parent company, which have each entered bids for CST. A consortium of private equity firms including Blackstone Group and Apollo Capital Management also offered to buy CST. CST is reportedly considering another round of offers before deciding whether to sell.\njfechter@express-news.net\nTwitter: @JFreports", "url": "https://apnews.com/70b7c60f99864eafa5f998997e8e2d47"}