{"authors": ["Vivek Chibber", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:55:53", "date_modify": "2020-05-04 19:55:53", "date_publish": "2016-03-22 00:00:00", "description": null, "filename": "2016_03_working-class-capitalism-socialists-strike-power_1588622153.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2016/03/22162728/Screen-Shot-2019-08-22-at-4.27.00-PM.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_03_working-class-capitalism-socialists-strike-power_1588622153.html", "title": "Why the Working Class?", "title_page": "Why the Working Class?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Yet there is more to the focus on class than just the moral argument. The reason socialists believe that class organizing has to be at the center of a viable political strategy also has to do with two other practical factors: a diagnosis of what the sources of injustice are in modern society, and a prognosis of what are the best levers for change in a more progressive direction.\nAfter all, there are lots of groups who suffer indignities and injustices — racial minorities, women, the disabled. Why single out workers? Why not just say that every marginal and oppressed group ought to be at the heart of socialist strategy?\nNow it is true, of course, that workers face all sorts of indignities and material deprivation, and any movement for social justice has to take this as a central issue. But if this is all there is to it, if this is the only reason we should focus on class, the argument falls apart pretty easily.\nMost people know that socialists place the working class at the center of their political vision. But why exactly? When I put this question to students or even to activists, I get a range of answers, but the most common response is a moral one — socialists think that workers suffer the most under capitalism, making their plight the most important issue to focus on.\nEconomic and political power is in the hands of capitalists, whose only goal is to maximize profits, which means that the condition of workers is, at best, a secondary concern to them. And that means that the system is, at its very core, unjust.\nCapitalism is an economic system that depends on depriving the vast majority of people of these essential preconditions for a decent life. Workers show up for work every day knowing that they have little job security; they are paid what employers feel is consistent with their main priority, which is making profits, not the well-being of employees; they work at a pace and duration that is set by their bosses; and they submit to these conditions, not because they want to, but because for most of them, the alternative to accepting these conditions is not having a job at all. This is not some incidental or marginal aspect of capitalism. It is the defining feature of the system.\nSo, in a society in which most people don’t have job security, or have jobs but can’t pay their bills , in which they have to submit to other people’s control, in which they don’t have a voice in how laws and regulations are made — it’s impossible to achieve social justice.\nThere are many things that people need to lead decent lives. But two items are absolutely essential. The first is some guarantee of material security — things like having an income , housing , and basic health care . The second is being free of social domination — if you are under someone else’s control, if they make many of the key decisions for you, then you are constantly vulnerable to abuse.\nHolding the Lever\nIt follows that the first step to making our society more humane and fair is to reduce the insecurity and material deprivation in so many people’s lives, and to increase their scope for self-determination. But we immediately run into a problem — the political resistance of elites.\nPower is not distributed equally in capitalism. Capitalists decide who is hired and fired, and who works for how long, not workers. Capitalists also have the most political power, because they can do things like lobby, fund political campaigns, and bankroll political parties.\nAnd since they are the ones who benefit from the system, why should they encourage changes in it, changes that inevitably mean a diminution in their power and their bottom line? The answer is, they don’t take very kindly to challenges, and they do their best to maintain the status quo.\nMovements for progressive reform have found time and again that whenever they try to push for changes in the direction of justice, they come up against the power of capital.\nAny reforms that require a redistribution of income, or come from the government as a social measure — whether it’s health care, environmental regulations, minimum wages, or job programs — are routinely opposed by the wealthy, because any such measures inevitably mean a reduction in their income (as taxes) or their profits.\nWhat this means is that progressive reform efforts have to find a source of leverage, a source of power that will enable them to overcome the resistance of the capitalist class and its political functionaries.\nThe working class has this power, for a simple reason — capitalists can only make their profits if workers show up to work every day, and if they refuse to play along, the profits dry up overnight. And if there is one thing that catches employers’ attention, it’s when the money stops flowing.\nActions like strikes don’t just have the potential to bring particular capitalists to their knees, they can have an impact far beyond, on layer after layer of other institutions that directly or indirectly depend on them — including the government.\nThis ability to crash the entire system, just by refusing to work, gives workers a kind of leverage that no other group in society has, except capitalists themselves.\nThis is why, if progressive social change requires overcoming capitalist opposition — and we have learned over three centuries that it does — then it is of central importance to organize workers so that they can use that power.\nWorkers are therefore not only a social group that is systematically oppressed and exploited in modern society, they are also the group best positioned to enact real change and extract concessions from the major center of power — the bankers and industrialists who run the system.\nThey are the group that comes into contact with capitalists every day and are tied in a perennial conflict with them as a part of their very existence. They are the only group that has to take on capital if they want to improve their lives. There is no more logical force to organize a political movement around.\nAnd this isn’t just a theory. If we look back at the conditions in which far-reaching reforms have been passed over the past hundred years, reforms which improved the material conditions of the poor, or which gave them more rights against the market ­— they were invariably based on working-class mobilization. This is true not only with the “color-blind” measures of the welfare state, but even with such phenomena as civil rights and the struggle for the vote.\nAny movement that extended benefits to the poor, whether they were black or white, male or female, had to base itself on a mobilization of working people. This was true in Europe and the Global South as much as it was in the United States.\nIt is this power to extract real concessions from capital that makes the working class so important for political strategy. Of course, the fact that workers also form the majority in every capitalist society and that they are systematically exploited only makes their plight all the more pressing. This combination of moral urgency and strategic force is what places the working class at the center of socialist politics.", "url": "https://www.jacobinmag.com/2016/03/working-class-capitalism-socialists-strike-power"}