{"authors": ["Judith Stein", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:01", "date_modify": "2020-05-04 19:58:01", "date_publish": "2016-11-17 00:00:00", "description": null, "filename": "2016_11__1588622281.html", "image_url": "https://images.jacobinmag.com/2016/11/17232036/8138547957_6b8b40c7db_b-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_11__1588622281.html", "title": "A Losing Coalition", "title_page": "A Losing Coalition", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Everyone agrees that Hillary Clinton’s losses among white workers in the North and lower turnout among African Americans, Hispanics, and young people cost her a very winnable victory.\nGiven our identity-determined culture, these demographic groups are boxed into separate categories. We speak of Rust Belt whites who need jobs, but blacks who need police justice. When discussing Baltimore, we forget that a huge Bethlehem Steel plant and satellite industries that offered blacks good jobs no longer exist. While African Americans need police justice, in the end their situation is not so different from the Rust Belt whites.\nIt is our ideology that blinds us to these connections: the idea is that one of the highest items on the black agenda must be something uniquely for blacks, and that racial disparity is the only disparity that counts.\nBut the Democratic losses, I would argue, all stem from the same cause: the hollowing out of middle- and working-class America over the past forty years.\nThe first question must be, how did this happen? Well-funded and well-organized Hillary Clinton was running against the terribly flawed Donald Trump. Even many people who voted for him recognized his failings — whether it was his demagogic racial appeals, his ignorance, or his temperament.\nSo how did she lose to such a man? An easy response is she had flaws of her own. Indeed she did. And one reason it was so easy for Republican caricatures to stick was that she has a vacant core. Although she has an excellent resume, her limited list of achievements made it easier for Republicans to fill in the blanks.\nBut she could have overcome the personal. Indeed, she won more votes. A more fundamental problem was her reliance on the Democrats’ coalition for the twenty-first century — new business elites (banks, Google, Facebook, etc.), professionals, women, and racial minorities.\nThe notion of an “Emerging Democratic Majority” was first articulated by John Judis and Ruy Teixeira in 2004 (Judis has since repudiated it). The most obvious group excluded from this new formulation was the white working class, which throughout this campaign has been stereotyped as a dying, heroin-addicted, resentful bunch. Those more sympathetic offered condescending pity. We can see the Emerging Democratic Majority theory at work when one Clinton campaign manager said, “we can never win back West Virginia.”\nThe white working class is more complicated and diverse than those in West Virginia. But let’s look at West Virginia, in particular McDowell County, a coal county featured in a recent video at the Guardian.\nThe video touted McDowell as Trump country and interviewed assorted people expressing support for him. But the reporters neglected to examine the primary results. If they did, they would have found that although Trump won McDowell on the GOP line, Bernie Sanders beat him 1,488 to 785. Even Hillary Clinton outpolled Trump with 817 votes.\nIsn’t there something more complicated going on here than racism, sexism, and bitterness? Yes, in the general election, Trump won McDowell handily. But only 36 percent of registered voters cast ballots (compared to about 58 percent nationwide). This was hardly a rousing Trump victory.\nAnd it was not West Virginia that turned the election for Trump. It was white workers, especially union workers, in Iowa, Wisconsin, Michigan, and Pennsylvania, who had voted for Obama, but now backed Trump.\nObama won white union workers by a margin of 18 percent; Clinton did so by only 8 percent. So, let’s look at the white working-class voters who mattered. Despite the “New Democratic Coalition” theory, they continued to vote Democratic through 2012. 2016 showed they were still vital to Democratic victories. Many of them voted for the first major party presidential nominee that attacked NAFTA and other trade deals that symbolized the policies that destroyed their lives or neighborhood. In a much-touted election for change, this was really the only group that changed.\nGenerally, in electoral transformations, there is a massive increase in the electorate and a transfer of party allegiance. This happened in 1936, creating the New Deal coalition. Sometimes, there is not so much an increase in voters but a shift in demographic groups between parties. This happened in the Reagan victories in 1980 and 1984.\nNothing of the sort occurred in 2016. Trump’s Republican votes were not significantly less or more than Mitt Romney’s in 2012. (He might have gotten fewer among upper-class and more among lower-income Republicans.) But Clinton’s numbers were far behind Obama’s in 2008 and 2012 in all of the demographic groups in his coalition.\nSo this was not a change election in the traditional sense. There were no massive switches in party affiliation, no surge in popular voting. It was very close: Clinton won by several hundred thousand votes (out of about 121 million).\nBut it was a change election in the sense that northern working-class whites voted for change, and, given the declining participation of other elements in the Clinton coalition, that was enough to turn the election to Trump. Moreover, the economic discontent that drove some voters to Trump resonated too among Clinton voters.\nBut then the question arises: why didn’t African-American voters, who turned out for Clinton in far lower numbers than for Obama, also embrace Trump? Trump’s flirtation with racism and racists made him anathema to most blacks, even if they agreed with him on NAFTA.\nWhites could dismiss his words as talk. Salena Zito, writing in the Atlantic, observed that “the press take him [Trump] literally but not seriously; his supporters take him seriously, not literally.” She is right, but blacks could not dismiss the words. Democratic pollster Geoff Garin concluded that blacks were a lot more pessimistic in 2016 than in 2012 about their prospects under Clinton economics. For many, the response was to not vote.\nSo, we are back to the notion of the New Democratic Coalition. The weakness was always that it was an electoral coalition, not a governing coalition. This means that what we face is a question of ideology rather than tactics or strategy.\nThe economic agenda of the banks, the Googles, and the upscale professionals of the world cannot provide good jobs to racial minorities in the coalition. Minority participation in the new coalition means racial representation. Wells Fargo’s diversity did not prevent it from exploiting its customers and workers. The exclusion of white workers from the new coalition meant the exclusion of black and Hispanic workers as well.\nBill and Hillary Clinton — and Obama, too — never aimed to strengthen the working class, only to provide the opportunity to leave it. A new Democratic coalition has to scrap this idea and build upon the broad economic discontent that allowed Donald Trump to win. And I think it can be done. Because Trump’s coalition is no more viable than the one that was too puny to elect Clinton.", "url": "https://www.jacobinmag.com/2016/11/hillary-clinton-donald-trump-working-class-election/"}