{"authors": ["David Simon - My Thoughts Exactly"], "date_download": "2020-05-04 20:04:30", "date_modify": "2020-05-04 20:04:30", "date_publish": "2016-11-27 10:45:00", "description": "Both the Maui Pro and World Cup of Surfing are wading through a little bit of a lull during their respective waiting periods. The women’s Championship Tour finale progressed through two full...", "filename": "_84b5fe5ecc53456ab07c29c881b3dece_1588622670.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_84b5fe5ecc53456ab07c29c881b3dece_1588622670.html", "title": "All 6 Hawaii wahine survive day 1 at Maui Women’s Pro", "title_page": "All 6 Hawaii wahine survive day 1 at Maui Women’s Pro", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Both the Maui Pro and World Cup of Surfing are wading through a little bit of a lull during their respective waiting periods. The women’s Championship Tour finale progressed through two full rounds on its opening day, but hasn’t gotten the call yet to resume. The World Cup just began its waiting period on Friday, though round one is still yet to get underway.\nBut opening day was a good one for Hawaii’s wahine, who comprise six of the 12 remaining competitors. Things started off with the wildcard invitational heat, which was won by Brisa Hennessy. She managed to come through against Bethany Hamilton, Summer Macedo and Mahina Maeda. There weren’t a lot of waves for the women to be too particular, but Hennessy took control with her selection and execution, outmaneuvering the others to get into the main draw.\nNot satisfied with that accomplishment, Hennessy went on to take out Johanne Defay in the second round. Hennessy is likely to be a full-timer on the world tour someday, so this experience and success can be invaluable down the road. It’s a disappointing finale for Defay, who won’t improve upon her fifth-place ranking.\nHennessy was one of four Hawaii women to win four consecutive second-round head-to-head heats. Coco Ho got things started against Laura Enever, who gave a valiant effort but is still nursing an injury after competing at the Peahi Women’s Challenge. It’s been a solid second half of the season for Ho. After exiting in round two in the season’s first four events, she made at least round three in all six since.\nAlessa Quizon then pulled off an upset against Sage Erickson. It’s been a rough year for Quizon, but she’s won at least one heat in each of the final three events. This one comes against a red-hot Erickson and hopefully gives her some confidence going into next year’s Qualifying Series gauntlet.\nAfter Hennessy’s win, Malia Manuel took care of business against Chelsea Tuach. It was actually a bit of good luck for Manuel to draw Tuach and not Hennessy, who is more familiar with the location. It’s already a great result for Malia, who can move up but now can’t fall in the final rankings. She came into the event ranked seventh, but barely ahead of Sally Fitzgibbons and Erickson, each of whom lost in round two.\nManuel now looks ahead to round three, where she’ll take on two-time defending Maui champ Carissa Moore and Lakey Peterson. Thankfully it’s a non-elimination heat, because that’s about as tough a draw as can be reasonably expected at this stage of the event.\nTatiana Weston-Webb won her opening-round heat to jump directly into round three. She’ll move ahead as her heat’s top seed against Hennessy and Stephanie Gilmore. Tati is almost certainly cemented into that fourth spot in the rankings. The only way she could finish third would be to win the event and for Moore to lose in the fourth round. With one win under her belt this season, it’s certainly possible, but that’s the only scenario that creates any movement in the top four.\nThe only bit of qualification drama remaining is on the shoulders of Bianca Buitendag. Her scenario is simple: win the event or miss next season’s world tour. Coming into the contest, Buitendag knew she’d need to both win it and have Enever lose in round two. Half of that has occurred, so the South African moves ahead knowing what she needs to accomplish. Though she is capable, she’s only made finals day twice this season.\nWith six Hawaii wahine left — Weston-Webb, Hennessy, Ho, Quizon, Moore and Manuel — there’s a good chance of some high finishes in Hawaii’s lone women’s CT contest. Hopefully the waves cooperate enough to close the season in style.\n•••\nDavid Simon can be reached at dsimon@thegardenisland.com.", "url": "https://apnews.com/84b5fe5ecc53456ab07c29c881b3dece"}