{"authors": ["J. W. Mason", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:38", "date_modify": "2020-05-04 19:57:38", "date_publish": "2016-11-17 00:00:00", "description": null, "filename": "2016_11_finance-banks-capitalism-markets-socialism-planning_1588622258.html", "image_url": "https://images.jacobinmag.com/2016/11/17232250/socialize-finance-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_11_finance-banks-capitalism-markets-socialism-planning_1588622258.html", "title": "Socialize Finance", "title_page": "Socialize Finance", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "At its most basic level, finance is simply bookkeeping — a record of money obligations and commitments. But finance is also a form of planning — a set of institutions for allocating claims on the social product.\nThe fusion of these two logically distinct functions — bookkeeping and planning — is as old as capitalism, and has troubled the bourgeois conscience for almost as long. The creation of purchasing power through bank loans is hard to square with the central ideological claim about capitalism, that market prices offer a neutral measure of some preexisting material reality. The manifest failure of capitalism to conform to ideas of how this natural system should behave is blamed on the ability of banks (abetted by the state) to drive market prices away from their true values.\nSomehow separating these two functions of the banking system — bookkeeping and planning — is the central thread running through 250 years of monetary reform proposals by bourgeois economists, populists, and cranks. We can trace it from David Hume, who believed a “perfect circulation” was one where gold alone was used for payments, and who doubted whether bank loans should be permitted at all; to the nineteenth-century advocates of a strict gold standard or the real bills doctrine, two competing rules that were supposed to restore automaticity to the creation of bank credit; to Proudhon’s proposals for giving money an objective basis in labor time; to Wicksell’s prescient fears of the instability of an unregulated system of bank money; to the oft-revived proposals for 100 percent reserve banking; to Milton Friedman’s proposals for a strict money-supply growth rule; to today’s orthodoxy that dreams of a central bank following an inviolable “policy rule” that reproduces the “natural interest rate.”\nWhat these all admonitions and proposals have in common is that they seek to restore objectivity to the money system, to legislate into existence the supposedly real values that lie behind money prices. They seek to compel money to actually be what it is imagined to be in ideology: an objective measure of value that reflects the real value of commodities, free of the human judgments of bankers and politicians.\nSocialists reject this fantasy. We know that the development of capitalism has from the beginning been a process of “financialization” — of the extension of money claims on human activity, and of the representation of the social world in terms of money payments and commitments.\nWe know that there was no precapitalist world of production and exchange on which money and then credit were later superimposed: Networks of money claims are the substrate on which commodity production has grown and been organized. And we know that the social surplus under capitalism is not allocated by “markets,” despite the fairy tales of economists. Surplus is allocated by banks and other financial institutions, whose activities are coordinated by planners, not markets.\nHowever decentralized in theory, market production is in fact organized through a highly centralized financial system. And where something like competitive markets do exist, it is usually thanks to extensive state management, from anti-trust laws to all the elaborate machinery set up by the ACA to prop up a rickety market for private health insurance. As both Marx and Keynes recognized, the tendency of capitalism is to develop more social, collective forms of production, enlarging the domain of conscious planning and diminishing the zone of the market. (A point also understood by some smarter, more historically minded liberal economists today.) The preservation of the form of markets becomes an increasingly utopian project, requiring more and more active intervention by government. Think of the enormous public financing, investment, and regulation required for our “private” provision of housing, education, transportation, etc.\nIn a world where production is guided by conscious planning — public or private — it simply doesn’t make sense to think of money values as reflecting the objective outcome of markets, or of financial claims as simply a record of “real’’ flows of income and expenditure.\nBut the “illusion of the real,” as Perry Mehrling calls it, is very hard to resist. We must constantly remind ourselves that market values have never been, and can never be, an objective measure of human needs and possibilities. We must remember that values measured in money — prices and quantities, production and consumption — have no existence independent of the market transactions that give them quantitative form.\nIt follows that socialism cannot be described in terms of the quantity of commodities produced, or the distribution of them. Socialism is liberation from the commodity form. It is defined not by the disposition of things but by the condition of human beings. It is the progressive extension of the domain of human freedom, of that part of our lives governed by love and reason.\nThere are many critics of finance who see it as the enemy of a more humane or authentic capitalism. They may be managerial reformers (Veblen’s “Soviet of engineers”) who oppose finance as a parasite on productive enterprises; populists who hate finance as the destroyer of their own small capitals; or sincere believers in market competition who see finance as a collector of illegitimate rents. On a practical level there is much common ground between these positions and a socialist program. But we can’t accept the idea that finance is a distortion of some true market values that are natural, objective, or fair.\nFinance should be seen as a moment in the capitalist process, integral to it but with two contradictory faces. On the one hand, it is finance (as a concrete institution) that generates and enforces the money claims against social persons of all kinds — human beings, firms, nations — that extend and maintain the logic of commodity production. (Student loans reinforce the discipline of wage labor, sovereign debt upholds the international division of labor.)\nYet on the other hand, the financial system is also where conscious planning takes its most fully developed form under capitalism. Banks are, in Schumpeter’s phrase, the private equivalent of Gosplan, the Soviet planning agency. Their lending decisions determine what new projects will get a share of society’s resources, and suspend — or enforce — the “judgment of the market” on money-losing enterprises.\nA socialist program must respond to both these faces of finance. We oppose the power of finance if we want to progressively reduce the extent to which human life is organized around the accumulation of money. We embrace the planning already inherent in finance because we want to expand the domain of conscious choice, and reduce the domain of blind necessity.\nThe development of finance reveals the progressive displacement of market coordination by planning. Capitalism means production for profit; but in concrete reality profit criteria are always subordinate to financial criteria. The judgment of the market has force only insofar as it is executed by finance. The world is full of businesses whose revenues exceed their costs, but are forced to scale back or shut down because of the financial claims against them. The world is also full of businesses that operate for years, or indefinitely, with costs in excess of their revenues, thanks to their access to finance. And the institutions that make these financing decisions do so based on their own subjective judgment, constrained ultimately not by some objective criteria of value, but by the terms set by the central bank.\nThere is a basic contradiction between the principles of competition and finance. Competition is supposed to be a form of natural selection: Firms that make profits reinvest them and thus grow, while firms that make losses can’t invest and must shrink and eventually disappear. This is supposed to be a great advantage of markets over planning. But the whole point of finance is to break this link between profits yesterday and investment today. The surplus paid out as dividends and interest is available for investment anywhere in the economy, not just where it was generated.\nConversely, entrepreneurs can undertake new projects that have never been profitable in the past, if they can convince someone to bankroll them. Competition looks backward: The resources you have today depend on how you’ve performed in the past. Finance looks forward: The resources you have today depend on how you’re expected (by someone!) to perform in the future. So, contrary to the idea of firms rising and falling through natural selection, finance’s darlings — from Amazon to Uber and the whole unicorn herd — can invest and grow indefinitely without ever showing a profit. This is also supposed to be a great advantage of markets.\nIn the frictionless world imagined by economists, the supercession of competition by finance is already carried to its limit. Firms do not control or depend on their own surplus. All surplus is allocated centrally, by financial markets. All funds for investment come from financial markets and all profits immediately return in money form to these markets. This has two contradictory implications. On the one hand, it eliminates any awareness of the firm as a social organism, of the activity the firm carries out to reproduce itself, of its pursuit of ends other than maximum profit for its “owners.”\nThe firm, in effect, is born new each day by the grace of those financing it. But by the same token, the logic of profit maximization loses its objective basis. The quasi-evolutionary process of competition ceases to operate if the firm’s own profits are no longer its source of investment finance, but instead flow into a common pool. In this world, which firms grow and which shrink depends on the decisions of the financial planners who allocate capital between them.\nThe contradiction between market production and socialized finance becomes more acute as the pools of finance themselves combine or become more homogenous. This was a key point for turn-of-the-last-century Marxists like Hilferding (and Lenin), but it’s also behind the recent fuss in the business press over the rise of index funds. These funds hold all shares of all corporations listed on a given stock index; unlike actively managed funds they make no effort to pick winners, but hold shares in multiple competing firms.\nPer one recent study, “The probability that two randomly selected firms in the same industry from the S&P 1500 have a common shareholder with at least 5% stakes in both firms increased from less than 20% in 1999 to around 90% in 2014.” The problem is obvious: If corporations work for their shareholders, then why would they compete against each other if their shares are held by the same funds?\nNaturally, one proposed solution is more state intervention to preserve the form of markets, by limiting or disfavoring stock ownership via broad funds. Another, and perhaps more logical, response is: If we are already trusting corporate managers to be faithful agents of the rentier class as a whole, why not take the next step and make them agents of society in general?\nAnd in any case the terms on which the financial system directs capital are ultimately set by the central bank. Its decisions — monetary policy in the narrow sense, but also the terms on which financial institutions are regulated, and rescued in crises — determine not only the overall pace of credit expansion but the criteria of profitability itself. This is acutely evident in crises, but it’s implicit in routine monetary policy as well. Unless lower interest rates turn some previously unprofitable projects into profitable ones, how are they supposed to work?\nAt the same time, the legitimacy of the capitalist system — the ideological justification of its obvious injustice and waste — comes from the idea that economic outcomes are determined by “the market,” not by anyone’s choice. So the central bank’s planning role has to be kept out of sight.\nCentral bankers themselves are quite aware of this aspect of their role. In the early 1980s, when the Fed was changing the main instrument it used for monetary policy, officials there were concerned that their choice preserve the fiction that interest rates were being set by the markets. As Fed governor Wayne Angell put it, it was essential to choose a technique that would “have the camouflage of market forces at work.”\nMainstream economics textbooks explicitly describe the long-term trajectory of capitalist economies in terms of an ideal planner, who is setting output and prices for all eternity in order to maximize the general wellbeing. The contradiction between this macro vision and the ideology of market competition is papered over by the assumption that over the long run this path is the same as the “natural” one that would obtain in a perfect competitive market system without money or banks.\nOutside of the academy, it’s harder to sustain faith that the planners at the central bank are infallibly picking the outcomes the market should have arrived at on its own. Central banks’ critics on the right — and many on the left — understand clearly that central banks are engaged in active planning, but see it as inherently illegitimate. Their belief in “natural” market outcomes goes with fantasies of a return to some monetary standard independent of human judgment — gold or bitcoin.\nSocialists, who see through central bankers’ facade of neutral expertise and recognize their close association with private finance, may be tempted by similar ideas. But the path toward socialism runs the other way. We don’t seek to organize human life on an objective grid of market values, free of the distorting influence of finance and central banks. We seek rather to bring this already-existing conscious planning into the light, to make it into a terrain of politics, and to direct it toward meeting human needs rather than reinforcing relations of domination. In short: the socialization of finance.\nIn the US context, this analysis suggests a transitional program perhaps along the following lines.", "url": "https://jacobinmag.com/2016/11/finance-banks-capitalism-markets-socialism-planning"}