{"authors": ["Loren Balhorn", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:00", "date_modify": "2020-05-04 19:59:00", "date_publish": "2016-09-17 00:00:00", "description": null, "filename": "2016_09_germany-die-linke-afd-xenophobia-right-merkel_1588622340.html", "image_url": "https://images.jacobinmag.com/2016/09/17230628/afd-now-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09_germany-die-linke-afd-xenophobia-right-merkel_1588622340.html", "title": "Three Hours to Midnight", "title_page": "Three Hours to Midnight", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Sunday’s elections in the German state of Mecklenburg-Vorpommern saw the right-populist Alternative for Germany (AfD) secure a comfortable second-place finish, mobilizing tens of thousands of non-voters and taking tens of thousands more from mainstream parties. With its fourth major victory this year, it seems that the AfD — and with it a national presence for the far right in Germany — is here to stay, and no one seems quite sure what to do about it.\nFollowing the Alternative für Deutschland’s big victories in three state elections last March, their success on Sunday was anything but unexpected. Yet the numbers are troubling. The AfD won 20.8 percent and unseated Angela Merkel’s Christian Democratic Union (CDU) as the second strongest party in the state.\nTheir rise has been met by frustration and helplessness from the political center and even Die Linke (which received its worst election result in twenty-five years, 13.2 percent), underlining the depth of Germany’s political drift to the right over the last few years.\nWhatever the future brings, it is increasingly clear that a major shift with long-term implications has taken place in the German political landscape and the Left is ill-equipped to deal with it.\nMecklenburg-Vorpommern, or “M-V”, is not exactly a cross-section of German society. Like all five of the “new federal states,” M-V’s economy was decimated by the collapse of East German industry in the early 1990s, and its tourism- and service-economy-based recovery has been modest.\nToday the state has some of the highest poverty rates in the country while also being the least densely populated; the 2 percent of the population that lives in M-V is also overwhelmingly German (only 4 percent are categorized as being of foreign origin). Although net migration into the state crept above zero in 2013 and has remained there since, many of Mecklenburg-Vorpommern’s smaller municipalities, particularly along the Polish border where the AfD won a plurality of votes in several districts, face major economic decline and dwindling populations.\nThese socio-economic conditions are reflected in a breakdown of the election results conducted by Spiegel Online. AfD voters were statistically more likely to be men over thirty-five with low to moderate levels of education — women, eighteen to twenty-four year-olds, and the highly educated voted for the AfD in relatively low numbers — and more likely to live in the poorer and more isolated parts of the state.\nThis statistical differentiation, however, is relative. Overall, the AfD enjoyed spectacular gains across all social groups and did particularly well among the traditional base of the Left, receiving a plurality of votes from workers, the unemployed, and small business owners. Only white-collar employees and civil servants voted for the AfD in numbers significantly below average.\nEven more alarming is the fact that the party mobilized over fifty thousand voters who sat out the previous election, raising total participation to over 60 percent, and also attracted voters from the other political parties in relatively equal numbers — demonstrating that the party has become the main vehicle for protest votes across broad sections of society.\nWhen asked, only 25 percent of AfD voters reported actual support for the party, whereas 66 percent described their vote as a means of punishing the mainstream parties. That said, their primary reason for doing so is clear: the majority, 52 percent, were most concerned about “refugees,” in contrast to the majority of voters in M-V overall, of whom 53 percent identified “social justice” as their top priority.\nAlthough Mecklenburg-Vorpommern is not representative of Germany as a whole, the AfD’s success now puts it in nine of Germany’s sixteen state parliaments with good prospects for the federal elections next year. The AfD cannot expect to achieve the same result in most of the country’s densely populated and more prosperous western states, but its performance in Baden-Württemburg last spring and the 10-14 percent it regularly receives in national polls suggest that the party has managed to tap into deeply rooted xenophobic sentiments and link them to a national-populist agenda that increasingly attracts support from frustrated and socially marginalized voters.\nSince driving out its more moderate wing, the AfD has gradually stabilized around the leadership of Alexander Gauland and Frauke Petry, both highly educated professionals and erstwhile conservatives, flanked by a mix of regional right-wing politicians of various stripes who increasingly flirt with the far right in and outside of their own party. Capitalizing on the refugee crisis, the AfD has moved away from its traditional neoliberal and anti-EU rhetoric and instead focused on topics of the traditional far right: anti-refugee fearmongering, law-and-order policing, and economic populism, while remaining careful to avoid openly associating with organizations such as the Neo-Nazi National Democratic Party (NPD), which watched the AfD take away a large chunk of its voter base on Sunday.\nThis has allowed the AfD to build a coalition of frustrated middle- and working-class Germans who, framed in the language of “Western values” and “integration,” seek to recover or at least retain the relative privileges they enjoy under the welfare state against encroachment by feared “others.” It does so far more effectively than any of its explicitly far-right counterparts ever could, and is now not only the largest but also the only far-right party represented at the state level. Known cadre of the extreme right operate inside the AfD across the country, facilitating a mainstreaming of ethnic nationalism and racism not only ideologically, but also by allowing far-right extremists to appear as normal conservative citizens.\nAs Oliver Nachtwey argues in his recent book Downward Mobility, the “neo-authoritarian” current coalescing around the AfD can be found in many parts of German society, and is not a phenomenon limited to the lower classes nor the east. Its growth is intrinsically linked to the decline in social mobility and equality across Germany and Europe since the 1980s, the neoliberalization of official social democracy, and the inability of the Left to mobilize more compelling counter-narratives.\nSunday’s results show that most AfD voters do so at least partially for reasons that are simply racist. Nevertheless, they also show that many of these voters are driven by social alienation and frustration with the political establishment, of which they consider Die Linke to be a part. Lacking a plausible political alternative, more and more Germans are turning to right-wing populism to express their discontent with stagnant wages and declining social mobility, and being caught up in a wave of xenophobic fear and hatred at the same time. Nachtwey argues that these groups provide followers with a coherent narrative and worldview to real and perceived changes in the economy and society, contrasting the perceived decline and insecurity of today’s Germany with an idealized, socially harmonious past.\nThus, pointing to the fact that M-V has a low number of foreigners and thereby implying that AfD voters’ racism is irrational misses the point — although racism as a political weapon necessarily relies on fear and hatred of a perceived “other,” it is often just as much an expression of social alienation and political frustration. Somehow changing this equation by establishing a compelling left project with social and organizational roots is desperately needed to reverse this pattern.\nThe helplessness of the political establishment, not to mention the crisis of the Left, was on full display yesterday in M-V’s capital city, Schwerin. Every party in Parliament suffered losses to the AfD, particularly the CDU and the NPD, and every party blamed their losses on the refugee issue and the populist atmosphere generated by the AfD’s campaign; Merkel even admitted as much during the G-20 summit in China on Monday. Particularly eerie, but perhaps representative of German official politics as a whole these days, was the sight of jubilant social democrats, who lost fifteen thousand votes to the AfD and 5 percent of the vote total compared to 2011, celebrating the continuation of their weak coalition government as a political victory.\nEchoing the attitudes of the rest of the mainstream parties, Die Linke’s candidate for minister-president, Helmut Holter, complained that the party’s “five years of constructive opposition” and sober policy suggestions were unable to break through the AfD’s populist rhetoric. Although his frustration is perhaps understandable, comments like these indicate that the party is just as overwhelmed and helpless in the face of the AfD as the SPD and everyone else in German politics.\nDie Linke in Mecklenburg-Vorpommern has been widely criticized for running a politically incoherent campaign that ranged from suffocatingly awkward to downright cringey, and one certainly hopes that this disaster leads to political reflection and reorientation within the ranks. Nevertheless, the collapse in M-V points to deeper contradictions and limitations of the party that cannot be remedied by hiring a better graphic designer or marketing agency a few months before election time.\nDie Linke in the east largely seeks to change society by winning political office, as it currently does in Brandenburg and Thuringia and previously did in Berlin and M-V, but in doing so is increasingly viewed as a party of the establishment. Although Die Linke often softens the edges of austerity and introduces a handful of meaningful reforms in the states it governs, the compulsions of budget consolidation and low economic growth mean that the party is more often than not held responsible for the very austerity and neoliberalism it ostensibly joined government to end.\nThis evolution was illustrated at a press conference on Sunday when SPD minister-president Erwin Sellering, asked which parties he would approach to form a new coalition, explained: “We governed well with the CDU for the last ten years, and we governed well with the Left for eight years before that.” Holter had publicly entertained the notion of joining a CDU government to block the AfD days before the election.\nMoreover, the refounding of the party in 2007 largely failed to stem the decline of local party structures, in which the average member is often over seventy years old and young activists are few and far between. The parliamentarization of the party is thus not only the conscious choice of certain sections of the leadership, but also the inevitable result of a breakdown of the party from below — even if the party leadership in the east chose to pursue a different strategy, it is unclear with what social forces it could begin to do so. Although the party will likely perform slightly better in the Berlin elections later this month, there is little reason to believe that this trend will be halted or reversed over the medium to long term.\nThe period in which Die Linke could remain relevant as a protest party in the west and a governing party in the east may be coming to a definitive end with the rise of the AfD. Although opinions on Sunday’s elections are mixed inside the party, there exists a general consensus that more of the same will not suffice to resolve the current impasse. Gregor Gysi and Klaus Lederer, central figures of the party’s parliamentarist wing in Berlin, opened the coming strategic debate on Sunday evening with a joint position paper calling for a minimum program of progressive reforms around which to build new social and parliamentary majorities.\nThe paper reads like conventional coalition politics with a radical gloss and is unlikely to signal a shift in the party’s thinking, but suggesting a concrete alternative to more of the same is easier said than done. The advocates of a more “movement-oriented” approach within Die Linke must also confront the fact that the social movements have failed to mount an effective response to the rise of the Right.\nNationwide mobilizations against EU austerity and the AfD scheduled in Berlin for Friday and Saturday of last week were far below organizers’ expectations and failed to have a meaningful impact. This dynamic — heavy electoral losses for the Left in Parliament and a low level of mobilization in the streets — suggests a deeper crisis of strategy as a whole.\nGermany remains far from approaching the Midnight of the Century, nor do a series of electoral successes for the Alternative for Germany mean that the far right will inevitably become a major force in German politics, but the developments of the last year are cause for real alarm and serious thinking about how the Left and German civil society as a whole can respond more effectively in the future.", "url": "https://jacobinmag.com/2016/09/germany-die-linke-afd-xenophobia-right-merkel"}