{"authors": ["David Wahlberg", "Wisconsin State Journal"], "date_download": "2020-05-04 20:21:47", "date_modify": "2020-05-04 20:21:47", "date_publish": "2016-11-14 18:45:00", "description": "The Wisconsin Hospital Association, the Wisconsin Medical Society and a dozen other health care stakeholder groups on Monday asked Gov. Scott Walker to consider how self-insuring state workers...", "filename": "_fbb03ae04c2b4b43ab5b1440303fff72_1588623707.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fbb03ae04c2b4b43ab5b1440303fff72_1588623707.html", "title": "Health care groups ask Walker to consider impact of self-insurance", "title_page": "Health care groups ask Walker to consider impact of self-insurance", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Wisconsin Hospital Association, the Wisconsin Medical Society and a dozen other health care stakeholder groups on Monday asked Gov. Scott Walker to consider how self-insuring state workers could impact the state’s health care market and economy.\n“The potential repercussions for the state, for taxpayers, for state employees, for Wisconsin health care organizations, and for the Wisconsin economy are significant and could be far-reaching,” the groups said in a memo to Walker.\nThe Group Insurance Board, which oversees benefits for nearly 250,000 state and local government workers and their family members, is expected to vote Nov. 30 on whether to shift to self-insurance beginning in 2018.\nCurrently, nearly all of the workers and dependents, almost 100,000 of whom are in Dane County, are covered by 17 HMOs that receive premiums and accept the risk for claims.\nUnder self-insurance, the state would pay benefits directly and take on the risk. One or more companies might help administer the program. It’s possible self-insurance might be mixed with parts of the current program.\nMany of the HMOs are owned by regional health care systems around Wisconsin, which has one of the most competitive health insurance markets in the country. In Dane County, the HMOs include Dean Health Plan, part of SSM Health; Group Health Cooperative of South Central Wisconsin; Physicians Plus, part of UnityPoint Health; and Unity, part of UW Health.\nConsultants have said that moving to self-insurance could cost $100 million a year — or save $42 million, largely by avoiding $18 million in Affordable Care Act fees, cutting $11 million in administrative costs and eliminating $11 million in insurance company profits.\nWalker said any savings would be used on public education.\nThe Walker administration has talked about the possibility of switching to self-insurance since at least 2013. This July, the Department of Employee Trust Funds sought bids from companies to run a self-insured, or self-funded program, starting in 2018.\nThe Wisconsin Association of Health Plans has long opposed the move, saying it would hurt the state’s health insurance market. Some legislators have expressed concerns about the impact on regional health care systems.\nThe memo sent to Walker Monday came from the state’s hospital and doctor associations, along with the health plans group, the Rural Wisconsin Health Cooperative, the Wisconsin Counties Association, the Cooperative Network and M3 Insurance. Associations representing chiropractors, psychiatrists, anesthesiologists, emergency doctors, ophthalmologists and radiologists also supported it.\n“As leading Wisconsin health care stakeholders, committed to reducing the per capita cost of health care while promoting a better patient experience and improving the health of Wisconsin’s citizens, we urge you to consider the impact a change to self-funding could have on Wisconsin’s health care and health insurance markets,” the groups wrote.\nThe current state worker health benefits program “has been remarkably successful in using choice and competition to control costs, improve quality, and maintain financial stability and value for taxpayers,” they said. “Any alternative the state considers should be held to this high standard.”\nWalker spokesman Tom Evenson didn’t immediately respond to a request for comment.", "url": "https://apnews.com/fbb03ae04c2b4b43ab5b1440303fff72"}