{"authors": ["Pete Caldera"], "date_download": "2020-05-04 20:25:43", "date_modify": "2020-05-04 20:25:43", "date_publish": "2016-06-18 21:24:33", "description": "MINNEAPOLIS – Starter Michael Pineda put his team in a four-run deficit, but the Yankees scored two runs in each of the final three innings to win 7-6 against the Twins before 30,760 fans at...", "filename": "_c7fd7baa93004264904e8b58a6ff2bd6_1588623943.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c7fd7baa93004264904e8b58a6ff2bd6_1588623943.html", "title": "Yankees come back to beat Twins, 7-6", "title_page": "Yankees come back to beat Twins, 7-6", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MINNEAPOLIS – Starter Michael Pineda put his team in a four-run deficit, but the Yankees scored two runs in each of the final three innings to win 7-6 against the Twins before 30,760 fans at Target Field on Saturday afternoon.\nAlex Rodriguez hit a two-run homer in the seventh off starter Ricky Nolasco, Carlos Beltran hit a game-tying two-run homer off right-hander Kevin Jepsen in the eighth, and Jacoby Ellsbury delivered a two-run single off Ryan Pressly.\nIt was the Yankees’ third straight win in this four-game series against the Twins (20-48), owners of the AL’s worst record.\nAnd it was the Yankees’ 13th win in their last 15 games at Minnesota.\nBeltran homered for the fifth time in his last 10 games. After ex-Twin Anthony Swarzak pitched 1.1 innings of scoreless relief, Andrew Miller (4-0) pitched the eighth and kept the game tied at 4-4. Aroldis Chapman gave up solo homers to Eduardo Escobar and Kurt Suzuki in the ninth before recording his 13th save.\nBrett Gardner’s sacrifice fly had given the Yanks (34-34) a 7-4 lead.\nPineda lasted 5.1 innings, giving up four runs (three earned) on six hits, with no walks and nine strikeouts.", "url": "https://apnews.com/c7fd7baa93004264904e8b58a6ff2bd6"}