{"authors": ["Ron Shawgo", "The Journal Gazette"], "date_download": "2020-05-04 20:12:10", "date_modify": "2020-05-04 20:12:10", "date_publish": "2016-11-21 15:58:01", "description": "A vote of no confidence in IPFW Chancellor Vicky Carwein was approved by the university's Faculty Senate today after about half the school's tenured faculty signed off on a petition to oust...", "filename": "_819c28967e09464985ce168278ba3c6e_1588623130.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_819c28967e09464985ce168278ba3c6e_1588623130.html", "title": "IPFW faculty senate votes no confidence in chancellor", "title_page": "IPFW faculty senate votes no confidence in chancellor", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A vote of no confidence in IPFW Chancellor Vicky Carwein was approved by the university’s Faculty Senate today after about half the school’s tenured faculty signed off on a petition to oust her.\nIn addition, the senate approved a resolution that would seek to reinstate academic programs the administration announced last month would close to save money.\nAfter the vote, Carwein sent a email to the campus community stating her intention to stay after receiving backing from Purdue University President Mitch Daniels. A copy was obtained by The Journal Gazette.\n“President Daniels and the Purdue Board of Trustees have communicated to me their support and their desire that I remain as Chancellor given anticipated changes and those currently in process,” her email states. “I intend to do so.”\nThe no confidence resolution passed by a vote of 27-12 with five abstentions, said Jeffrey Malanson, presiding officer of the Faculty Senate and an associate professor of history.\nA six-page document titled “A Faculty Notice of No Confidence in Chancellor Carwein” had circulated since last month for tenured faculty to sign. It charged that Carwein failed to adequately represent the interests of the campus in studies that have led to the suspension of several programs and a proposal to split the school into two colleges.\nAmong the 225 tenured faculty, 108 tenured and five emeritus faculty members signed the notice, according to Monday’s resolution.\nFor more on this story, visit www.journalgazette.net later today or see Tuesday’s print edition of The Journal Gazette.\nrshawgo@jg.net", "url": "https://apnews.com/819c28967e09464985ce168278ba3c6e"}