{"authors": ["Michael A. Mccarthy", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:21", "date_modify": "2020-05-04 19:52:21", "date_publish": "2016-08-14 00:00:00", "description": null, "filename": "2016_08__1588621941.html", "image_url": "https://images.jacobinmag.com/2016/08/14123329/GettyImages-1762244-e1515951240252.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_08__1588621941.html", "title": "The Monetary Hawks", "title_page": "The Monetary Hawks", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nSince the mid-1970s, governments have carried out a one-sided class war on behalf of capitalists, which we have come to know as neoliberalism. Nowhere is this easier to see than the United States. Once-thriving manufacturing cities are now ghost towns of decay and unemployment, trade unions have watched their memberships go into decline and have been forced to concede in contract after contract, and wages for workers have stagnated. Most have seen the hope of a secure retirement fade away, and will have to work well into their twilight years just to make ends meet. This is the result of a deliberate war against the working class. But those winning this war didn’t do so through political force alone, as the story is often told. Even more critically, hawkish policymakers used subterranean tactics to change the constraints that workers, their organizations, and firms confronted on seemingly impersonal and apolitical capitalist markets. Just weeks after Ronald Reagan fired over eleven thousand striking air traffic controllers, the chairman of the Council of Economic Advisers, Murray Weidenbaum, put the administration’s broader labor policy into perspective. “We are not telling labor and management what to do,” he said, “We are subjecting them to the fundamental force of market pressures.” Throughout his remarks Weidenbaum made clear the main economic goal of the Reagan administration — lowering inflation. To do so, they had to weaken labor’s ability to make wage gains and discipline firms they viewed as too generous in negotiations. “As we set a tighter environment,” the chairman said, “when labor and management sit down to bargain, they will have to crank in a lower rate of inflation.” The administration achieved this through the monetary policy of the Federal Reserve. In the annals of labor, the firing of Professional Air Traffic Controllers Organization (PATCO) workers in August 1981 is often treated as a key catalyst in the decline of working-class power. The story goes that PATCO conferred legitimacy to strikebreaking, emboldening firms to oppose unions, leading to the era of concessionary bargaining that followed. The proof would seem to be obvious. Average first-year wage increases on major contracts covering a thousand or more workers fell from 10.1 percent in 1981 to 3.2 percent in 1982. The Bureau of National Affairs reported in 1982 that 427 negotiations involved union concessions by the end of the year. But the PATCO strike was more the exception than the norm — it was an illegal, public-sector strike. And the continued decline in union density — which had begun by 1955 — under Reagan was driven almost exclusively by private-sector losses. Public-sector unions actually made gains in the Reagan years. Treating PATCO as the key labor event of the period eclipses an even more fundamental shift in American capitalism already well underway. The era of concessionary bargaining, initiated under President Carter with the 1979 Chrysler bailout, was spurred on by the Federal Reserve’s deflationary monetary policy. And at the center of this story was a central banker, a Wall Street darling, and a member of the Democratic Party, Paul Volcker. By embracing a restrictionist monetary policy, Volcker and the Fed increased interest rates and in turn changed how capitalist markets for labor operated. With the support of the state and finance, central bankers intentionally pressured firms to cut their labor costs by changing market dynamics, weakening workers’ capacity to make and win demands. The history underscores a basic feature of capitalism: class struggle is political, but it is always constrained by political economy.\nThe Inflation Crisis The story begins with inflation, a silent thief. American inflation has typically taken off during wars, but the inflation of the 1970s was a new force, rising from negligible in the mid-1960s to double-digits by the early 1980s — 13.7 percent in March 1980. Inflation posed a major obstacle for capitalist growth and American dominance on the world market. It became the defining macroeconomic event of the postwar period. Inflation destroyed the Bretton Woods system of exchange rates, taxed capital stock, bankrupted the thrift industry, undermined government securities, eroded wealth and purchasing power, weakened American firms vis-à-vis their foreign trading partners, and hindered foreign investment. In 1971 a series of measures known as “the Nixon shock” had decoupled the value of the dollar with gold, turning it into a free-floating currency. With the fixed exchange rate cut, the dollar bore the heavy burden of performing well relative to competing currencies like the pound, franc, mark, and yen. And now returns on assets held in the dollar would in part reflect changes in the value of the currency itself. This worried Wall Street investors and with inflation on the rise, in 1974 Federal Reserve chair Arthur Burns increased interest rates and tightened credit. This contributed to a recession but also helped to reduce inflation to 5 percent by 1976. In the year of the recession, 1974, wages also stopped rising with productivity. The price of bullion had been a key indicator for the Federal Reserve — an increase in the price of gold signaled to central bankers a decline in Wall Street confidence in the dollar, while a decrease expressed greater confidence in the currency. Gold prices fell 50 percent in the twenty months following Burns’s intervention. But the macroeconomic fix to capital’s inflation woes was a short-lived one for central bankers. In August 1975, amid Burns’s reign at the Fed, Volcker, a tall, grumbling, ten-cent stogie-smoking economist, was named president of the Federal Reserve Bank of New York. The role gave him a permanent seat at the Federal Open Market Committee (FOMC), the preeminent committee within the Federal Reserve that sets its main policies. In some of his first contributions, he warned against the optimism of Burns and many of the other committee members. When Volcker considered their econometric models’ predictions of continued reduced inflation, he concluded that they failed to take account of “the important factor of expectations” on the part of America’s workforce. To defeat inflation, Volcker needed to crush those expectations. His pessimism proved correct. In the beginning of 1977, inflation began to creep up again. By 1978, the confidence barometer of Wall Street signaled major worries about the dollar — the price of gold had skyrocketed. Wall Street certainly had something to brood over; America’s currency was losing against its competitors, especially the German mark. Financial investors understood that a weakened dollar was a source of volatility in the international money markets. According to Volcker, who reflected at once as both a custodian of the state and a representative of finance, “our moral obligation to prevent debasement of our currency coincided with our self-interest.” Above all else, the members of the FOMC and Volcker himself operated with a cost-push theory of inflation that specifically pointed to labor power as the driver. Despite their public comments to contrary, privately they understood that inflation was more about the balance of class forces than the amount of money in the economy. And this reflected in the monetary policies they pursued. Their analysis wasn’t new. After wage and price controls were lifted in the wake of World War II, inflation jumped up from 8.5 percent in 1946 to 14 percent in 1947. At the time, many in Congress argued that a key cause was the spread of industry-wide union contracts that included wage increases. The idea was revisited by a new generation of technocrats in 1970, when the OECD released the report, Inflation: The Present Problem. The report again identified labor demands as the source. It urged OECD governments to shift away from the goal of full employment and instead use fiscal and monetary policy to raise unemployment rates to weaken the ability of labor to drive up wages. Technocrats understand that macroeconomic policy shapes class struggle. A similar view was developed at the Fed. In 1977, concerns were raised that “business did not appear to be pressing as actively as they might to hold labor costs down, fearing the impact of strikes and assuming that inflation would continue.” In 1978, their sense of urgency about union settlements intensified, worrying that wage settlements would drive inflation increases. In April, members of the FOMC specifically worried about a contract that was negotiated in the coal industry by the United Mine Workers. If it set a pattern and others negotiated similar contracts, the Fed was sure that it would drive up inflation. Volker told Carter in a short meeting in 1979 that he thought an induced recession was the only way to beat inflation, something presidents typically don’t like to do when they’re running for reelection. The next day he was unexpectedly appointed to be the Federal Reserve’s chairman by the president. By then the rate of inflation was the highest it had been since the few years after World War II. In his role as chair, Volcker put American workers in the Fed’s crosshairs. The Fed under Burns and then G. William Miller took a tepid approach to interest rates, raising the target rate by quarter-percent increments at their meetings to try to slowly bring inflation down. They would set a target rate then buy or sell Treasury bills to reach it. But for all practical purposes, it wasn’t working. Volcker moved to a more monetary approach, not supplying reserves to banks through open-market operations but holding non-borrowed reserves at a fixed level. Instead of injecting reserves into the banking system through buying Treasury securities, his strategy forced banks low on funds to bid against each other for the federal funds. The result drives up the interest rate. Central bankers believed this bought political cover. In part, this is why Carter supported Volcker’s plans. If inflation was, as monetary theory tells us, a problem of too much money driving up prices, then the Fed restricting money would be a direct way to deal with it. By indirectly setting interest rates and inducing recession, their real goal, they believed that the public would have a harder time understanding that the economic slump was caused by monetary policy.\nThe Reserve’s Offensive Volcker’s position about what the Fed should do hardened in the months after he joined the FOMC. The Times once described him as a “monetary pragmatist,” but a more accurate description is “monetary hawk,” as he explicitly used a restrictionist monetary policy to wage a one-sided class war against working people and their unions. Milton Friedman had said that “inflation is always and everywhere a monetary phenomena.” But monetary policy was just a means for Volcker — the real goal wasn’t simply to reduce the amount of money in circulation, it was to alter the balance of class forces. By controlling interest rates the Fed could manipulate the behavior of firms; increasing them made borrowing to finance investment or consumption more expensive, while lowering them made it cheaper. As the cost of borrowing went up, firms were pushed by market forces to be even more austere. By changing the conditions under which firms made a profit, restricting the money supply was the main means to discipline and weaken unions as wage-setting institutions in the United States. Prior to Volcker taking over the Fed, efforts to stabilize the dollar had failed. By October 1978, the treasury secretary, Michael Blumenthal, was pushing Carter to approve major increases in the interest rate. An attempt to stabilize the dollar by replenishing US international reserves by issuing $6 billion in Treasury bonds in German marks, Swiss francs, and Japanese yen had already proven fruitless. So in 1979, following Carter’s famous “crisis of confidence” speech about energy dependence, Volcker and the Fed tightened money to an unprecedented level — initiating a recessionary shock to the system that would last nearly four years but whose impact on working-class lives continues to bear its mark. Restricting the supply triggered increases in the interest rate, intentionally lowering consumer demand and slowing down the economy as a whole. Carter also pushed the Fed to impose mandatory credit controls, the so-called “credit crunch,” to force banks to stop lending so much. Borrowing came to a halt, the economy went into a recession, and voters didn’t reelect Carter. Shortly after Reagan took office in 1980 he said, The policies that this Administration is putting forward for urgent consideration by the Congress are based on the fact that this Nation now faces its most serious set of economic problems since the 1930s. Inflation has grown from 1 to 1 ½ percent a year in the early 1960s to about 13 percent in the past 2 years; not since World War I have we had 2 years of back-to-back double digit inflation. To be sure, Reagan clashed with Volcker over high interest rates — which at one point were well over 20 percent — tax cuts, and the budget deficit. And some, like Treasury Secretary Donald Regan, were outspoken critics of the Fed’s monetary policy and Volcker himself. Nevertheless the change in administration did not alter the Fed’s course — the new administration approved even as the economy worsened. Volcker induced even more severe downturns through monetary tightening in 1981 and 1982. There is no gainsaying the fact that Volcker himself believed that inflation was the result of wage gains. In a statement before the Committee on Banking, Finance, and Urban Affairs in 1981, Volcker said that, “So far, only small and inconclusive signs of moderation in wage pressures have appeared.” Just a year later, before the Joint Economic Committee of the US Congress, Volcker spoke in atypically simple language about the issue — he was notoriously vague in hearings. He told Congress that in order to continue to put downward pressure on inflation, which had been dropping steadily since 1980, “progress will need to be reflected in moderation in the growth in nominal wages. The general indexes in worker compensation still show relatively little improvement.” By improvement, of course he meant “lowering.” On entering the White House, Reagan’s economic program promised to tighten the money supply to curb inflation and it remained a key part of the first administration’s domestic agenda. Within a month, after a private meeting at the White House with the chair, Reagan said to the press corps that, “I have confidence in the announced policies of the Federal Reserve Board . . . The administration and the Federal Reserve can help bring inflation and interest rates down faster by working together than working at cross-purposes.” Again, Volcker shocked the system, tightening the money supply and inducing a recession in 1981 that was even more severe than his 1979 downturn. The unemployment rate reached nearly 11 percent by November 1982 from around 7 percent in July 1981, the highest it had been since the Great Depression. And as a result, labor unions faced a double pressure, from those in the labor market, laid off and desperate to find work, and employers who were squeezed by high interest rates. Inflation dropped off substantially by 1982 and continued to fall into 1983 — recession had nasty consequences, but it also broke wage and price increases. But much to Reagan’s frustration interest failed to decline along with it. Mortgage rates had climbed well over 18 percent by the end of 1981 (they only fell under 10 percent again in 1986). The shock had severely depressed credit-sensitive industries like real estate, housing construction, and auto. Despite rising unemployment coupled with high interest rates, Reagan continued to finger inflation as the primary problem for American capitalism. At a press conference in February of 1982, in the midst of the Volcker shock when the unemployment rate was at 9 percent and climbing and Volcker himself was vilified throughout the country, Reagan called inflation “our number one enemy” and repeated his “confidence in the announced policies of the Federal Reserve.” Volcker wasn’t just loathed by American workers; large sections of capital were also hostile to the Fed’s monetary policy. Homebuilders and automobile dealers mailed two-by-fours and car keys to the Federal Reserve in protest. After the agricultural sector was hit, indebted farmers blocked the entrance to the Board of Governors with their tractors. The policies dealt an especially damaging blow to manufacturing — about $6 billion in manufacturing assets were decimated between 1980 and 1983 alone. In Washington, both Democrats and Republicans called for Volcker’s head. But throughout the recession, Volcker remained beloved by finance. He was more sensitive to signals of confidence coming from Wall Street than even the presidency and had been their unwavering advocate. Scribbling in his diary on June 6, 1983, about reappointing Volcker to Fed chair again Reagan wrote, “? do I reappoint him as Chmn. of the Fed Aug. 1 or change. The financial mkt. seems set on having him. I don’t want to shake their confidence in the recovery.” Reagan employed an interesting definition of “recovery,” as unemployment was still over 10 percent at the time. In the end, Wall Street held sway over public opinion for the president, and Volcker was reappointed. He would remain in the position until 1987 when he stepped down and was replaced with another memorable central banker, Alan Greenspan.", "url": "https://www.jacobinmag.com/2016/08/paul-volcker-ronald-reagan-fed-shock-inflation-unions/"}