{"authors": ["Sam Gindin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:12", "date_modify": "2020-05-04 19:52:12", "date_publish": "2016-03-17 00:00:00", "description": null, "filename": "2016_03_workers-control-coops-wright-wolff-alperovitz_1588621932.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2016/03/17162032/5750316447_1c0f20649e_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_03_workers-control-coops-wright-wolff-alperovitz_1588621932.html", "title": "Chasing Utopia", "title_page": "Chasing Utopia", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThis year marks the five-hundredth anniversary of Thomas More’s Utopia — the book that introduced the term “utopia” into radical thought during the early days of capitalism. In More’s story, a fictional character matter-of-factly declares, “wherever you have private property and money is the measure of all things, it is hardly ever possible for a commonwealth to be governed justly or happily.” Half a millennium later, this idea — that private ownership of the means of production is the central barrier to a better world — has much purchase on the Left, with many calling for an economy based on direct worker and community control. Michael Albert and Robin Hahnel were at the forefront of such demands, attempting to establish the practical feasibility of a “participatory economy” beginning in the early 1990s. Writing after the 2008 financial crisis, Hahnel re-emphasized the importance of believing in a plausible alternative: without it, he said, “we cannot expect people to take the risks necessary to change things” nor “forge a strategy of how to get from here to there.” More recent advocates have moved on from the problem of confidence to the problem of strategy. Three prominent left intellectuals are at the center of such efforts: Richard Wolff, Gar Alperovitz, and Erik Olin Wright. Working more or less independently, their arguments nevertheless coincide and have found a ready audience among activists disillusioned with unions, electoral politics, and their own experience in social movements, but inspired by experiments in popular control in Latin America. With interest growing, the participatory economy has been dubbed the “next big idea on the Left.” Partisans of popular control advocate the gradual, direct takeover of workplaces by groups of workers, within capitalism, alongside a similarly immediate expansion of cooperatives (co-ops) and spreading of decentralized participation into every aspect of social life. Over time, these quantitative changes will effect a qualitative change, with capitalism giving way to a society based on substantive economic and social democracy. For Richard Wolff, a political economist, capitalism’s defining problem is exploitation. Capitalists — by virtue of their control over the means of production — buy labor power, organize it, and control the surplus that workers create for both their own consumption and, above all, for the productive reinvestment that keeps this cycle going. But Wolff doesn’t think we’ll end exploitation by trying to regulate markets or turning to statist alternatives, whether social democratic or communist. Given the power relationships embedded in capitalism, he thinks industries inevitably capture regulators and fiscal expansion grows the system instead of altering it. And central planning merely supplants capitalists with state bureaucrats. Like much of the American left, Wolff is sympathetic to unions. But he sees them as no longer capable of leading social change. Instead, he presents a syndicalist-leaning alternative based on the creation of Worker Self-Directed Enterprises (WSDEs) that are focused on the “internal organization of productive enterprises” and “positioning workers within each productive enterprise as themselves the appropriators of that enterprise’s surpluses.” Historian Gar Alperovitz, equally optimistic, argues that workers already have a material foundation for joining this revolution in property relations. Distancing himself from the widespread view of the past three decades as a period of perpetually lowered expectations, Alperovitz predicts in What Then Must We Do? that more and more people will embrace a turn against capitalist social relations as “the economy continues to deteriorate, offering few alternatives other than innovating and taking things into one’s own hands.” He takes it a step further, asserting that the “next American revolution” is already underway. “Socialism,” Alperovitz tells us, “is as common as grass in the US” (adding parenthetically “well, maybe not that common . . . but still very common indeed”). In a chapter entitled “Everyday Socialism, All the Time, American Style,” Alperovitz notes that the “quiet democratization” of the American economy has led “more than 40 percent of the population” to join co-ops and over ten million to become members of employee stock-ownership plans (ESOPs). ESOPs, he adds for emphasis, include “three million more [members] than are members of unions in the private sector.” Erik Olin Wright, a Marxist sociologist, is more theoretically ambitious and nuanced in his discussion than Alperovitz. He rightly rejects the determinist strain in vulgar Marxism, and though he expects that the struggle to replace capitalism will include serious conflicts and localized ruptures, he sensibly views an insurrectionary solution as outmoded in an era when capitalism is primarily coupled with liberal democracy. Moreover, Wright fears that the corollary of a rupture — the “dictatorship of the proletariat” — risks a more severe authoritarianism. This doesn’t mean he aligns himself with anarchist-tinged social movements implacably hostile to the state; he sees the state as an important site of struggle. But like Wolff and Alperovitz, he adopts a gradualist “metamorphosis” framework and places considerable weight on the eclectic development of “interstitial alternatives” that grow in the cracks of capitalism — “real utopias” that can eventually spread to capitalism’s core. The appeal of microcosms of a future world, such as co-ops and WSDEs, speaks to a common desire for substantive control over our daily lives, as well as a hope that such institutions might act as strategic battering rams for reaching socialism. Moreover, the Marxist-inflected populism of this approach seems to offer an escape from either working within the system and getting co-opted, or waiting for a revolution that never comes. For many activists it also seems to contain the added bonus of sidestepping the messy complexities involved with confronting the state — even though the state stands at the center of property relations and capitalist power. In the end, however, this strategic orientation doesn’t cut it.\nEnds and Means Difficulties quickly emerge in proposals to introduce worker self-management within capitalism, particularly when it comes to ownership. Albert and Hahnel were always careful to insist workers did not own their particular workplace, even if they controlled it — the workplace belonged to society as a whole. They argued that workers should “direct” their workplaces because they are the ones “most affected” by what happens there, but in order for socialist democracy to work, everyone affected by workplace decisions — other workers as well as consumers and the community — must have a say in how to spend the surpluses generated by production. However, thorny questions about ownership — and the mediation between means and ends more broadly — arise when worker control is implemented within capitalism, a system in which the institutionalization of property requires that ownership legally and substantively reside somewhere. If state ownership is rejected as a proxy for the commons and if ownership in worker-controlled enterprises is in the hands of the workers, then these groups of workers essentially become their own capitalists. They have ownership rights, mobilize their own finances, and control and reinvest “their” surplus for their own advantage. The significance of having legally authorized property rights was driven home in the aftermath of Argentina’s 2001 economic crisis. While workers took over shuttered factories, they needed the clear collateral of property rights to avoid being denied financing and credit to purchase components and supplies in advance of sales. The state gave into this demand, but only on the condition that the workplaces become co-ops, meaning workers inherited the debts of the “recuperated” factories and were also responsible for their losses. The most militant workers balked at such an arrangement. They wanted a role in managing the workplaces, but argued the state should legally take them over, finance their renewal, and link them together in a plan across workplaces. Those demands were generally defeated. So workers ended up with co-ops and were triply undermined as competitors within capitalism: they started with facilities capitalists had left undercapitalized and uncompetitive; they were saddled with debt; and they had to put their own savings into the facilities or accept lower wages to address the issues of debt and new investment. The case of Argentina casts doubt on the notion that having more worker-controlled workplaces or co-ops readily translates into an increasingly egalitarian social order. Without an alternative institutional mechanism for coordinating productive activities, competitive markets — which Hahnel described as “the cancer of socialism” — transform differences in assets, skills, locational advantages, and product valuation into stark inequalities between workers and communities. The negative impact of such inequalities on social solidarity was made painfully evident in the former Yugoslavia, which had implemented full market socialism. The uneven distribution of historic and geographic advantages meant that inequalities across firms were also expressed regionally. Where this overlapped with ethnic and clientelist political structures, it dangerously aggravated ethnic tensions. And as northern Yugoslavia developed closer economic ties with Europe, these inequalities were amplified. One of the most important of the inequalities generated by competition — an inescapable part of capitalism — is unemployment. If successful enterprises drive unsuccessful ones out of business and if worker collectives prefer not to hire and share profits with workers just entering the workforce, what happens to workers left without a job? Wolff has pondered this question, and acknowledges that an economy populated by WSDEs would require state intervention to fight unemployment. But his antipathy toward the state leaves him with a surprisingly naïve answer: “Instead of a period of receiving regular unemployment payments, [workers] could choose to get the total payments in advance as initial capital for a WSDE.” Sending workers who have failed to find jobs back into the competitive jungle, or offering workers just entering the workforce a chance to compete with those already established, sounds a lot like solutions offered by the libertarian right. And it ignores the fact that the one place with such a program — Italy — has unemployment rates double those of the US. One model that appears, on the surface, to better address the problem of fragmented working-class ownership is the Quebec Solidarity Fund (QSF) — one of the examples of “real utopias” that Wright praises. The QSF is distinct in that the state subsidizes workers to invest in a “solidarity fund” and places ownership and investment decisions not in the hands of dispersed workers or sub-groups of workers but in a larger collectivity — in this case, a central union body. While Wright acknowledges that the QSF doesn’t challenge capitalism, he still seems to believe it can contribute to the larger project of doing so. This is mistaken. Putting labor leaders in charge does not in itself guarantee a better politics. Indeed, the QSF was originally designed to divert populist attention from radical demands like control of private financial institutions — not to democratize the economy. In reality, worker participation in the QSF consists mostly of sharing in the uniquely high tax breaks granted to those who contribute to the fund (a benefit that has helped mute criticism of corporate tax breaks). The QSF also provides the Quebec Federation of Labour with clientelist opportunities such as high-paying jobs at the top and remuneration for activists who sell the program in workplaces. Above all, the fund’s concern for high returns and legitimacy in investment circles has prevented it from using its funds to favor unionized firms, refraining from investments in anti-union firms, considering creative conversions, or showing any significant affinity for social investments. In this regard, Wright’s misleading identification of Quebec as a “social economy” seems to reflect a tactical determination on the Left to find positive examples that spur optimism. To its credit, Quebec has introduced progressive programs like child care. But the overall story is not all that different from other jurisdictions. Students and unions have been marching in the streets against tuition increases, public-sector cutbacks, wage freezes, and environmental degradation. Yet in Quebec, as elsewhere, no “social economy” has replaced the set of policies we identify as “neoliberalism.” More ambitious proposals that slowly collectivize property without directly limiting capital’s power are even more likely to come up against serious barriers. The Meidner Plan in Sweden is a useful illustration. The Meidner Plan, designed by the LO (Sweden’s labor central) in the 1970s, proposed an annual levy on profits that would then be converted into shares and placed in a central fund controlled by unions (which at the time represented over 80 percent of workers). The funds could be democratically allocated to regional and sectoral development and, over time, majority ownership of the nation’s productive assets would shift from private owners to the Swedish working class. But the issue of time turned out to be a major problem: throughout the transition, the Swedish economy would remain dependent on the same private corporations the plan sought to expropriate. Warning that they would instinctively hold back long-term investment if their property rights were threatened, and arguing that efficiency, stability, and even living standards would suffer irreparable damage if the transfer of ownership took place, corporations mobilized aggressively against the Meidner Plan. Countering business’s threat demanded a broad, aggressive response, including blocking corporations from running down their assets or leaving the country. But such a dramatic rupture with capitalism was not on the agenda, and the LO’s proposal — elegant in theory but contradictory economically and politically — went down in defeat and was never revived.\nCheerleading A sober assessment of the successes and failures of experiments in worker ownership is essential. Unfortunately, the weakness of the Left has reinforced a tendency to exaggerate the significance of promising struggles. Desperate for good news, activists wildly applaud each worker takeover or “breakthrough.” But as the novelty fades, what we get is not hardheaded analysis but a shift in attention to the next inspiring action — and then the next. A case in point is Republic Windows in Chicago. After an announced closure, a sit-down, a change in ownership, and another announced closure, workers — with no hope of finding another owner — courageously took the step of establishing a workers’ co-op. A flurry of enthusiastic articles followed, with the hope that it might spur a long-awaited resurgence of the labor movement. But when that didn’t quickly come to pass, Republic dropped off the Left’s radar. There was almost no discussion about the distressing eventual outcome: of the original 240 workers who faced the first closure announcement in 2008, only 17 remain, and due to competitive pressures, they pay themselves near or below the minimum wage (as “co-owners,” they’re not covered by minimum-wage laws). The tragedy of Republic Windows highlights the limits of sporadic, more or less arbitrary takeovers, especially when — as is the norm — the factory in question has been spurned by capital but remains subject to the same competitive relations between enterprises. Though admirable as defensive measures, factory takeovers are not inherently threatening to the status quo, nor do they necessarily lead to the deeper understandings, commitments, and strategic capacities that could provide the basis for a future challenge to capitalism. A more dramatic illustration is the wave of takeovers in Argentina, which sparked especially intense excitement on the international left. Buoyed by the support of surrounding communities; the solidarity of workers from other taken plants; and the piquateros (mobilized groups of unemployed workers), workers successfully blocked state attempts to evict them from their recuperated factories. Moreover, in the process of operating these workplaces, workers learned new skills, a higher priority was placed on health and safety, workers tended to be more flexible in sharing workloads, and hierarchies within the workplace and income stratification were substantially flattened (particularly where struggles to keep workplaces open were most acute). As in past moments of profound political turmoil, the actions of workers confirmed the radical potential and centrality of the working class. Marina Kabat, a close observer of these developments, rightly characterized the Argentinian events as “one of the greatest achievements of the workers’ movement.” But Kabat also counseled caution: “To overlook their limits and contradictions will not help to preserve them [nor] develop their complete potential for the future.” Though these actions represented concrete alternatives for particular groups of workers and their communities — and left important legacies — they did not develop into an alternative model for society as a whole. Plants were taken over out of desperation, not strategic preference. Without a conscious strategy for overall social transformation, especially the need to go further and win state power in order to support, expand, and coordinate the takeovers and eliminate competition as a driving force, a break with capitalism was never a genuine possibility. Takeovers remain on the agenda in Argentina today, but their growth has slowed amid a fall in closures. As of 2014, there were some three hundred worker-owned operations covering nearly fourteen thousand workers — a fraction of Argentina’s two hundred thousand registered businesses and less than one-tenth of 1 percent of the country’s workforce. Worker takeovers haven’t touched prosperous workplaces or the “commanding heights” of the economy. Another popular micro-alternative is the co-op, a form of business based on the egalitarian principle of one member, one vote. There’s no disputing the achievements of co-ops, but it’s important not to exaggerate their significance. While Marx famously praised worker cooperatives as “represent[ing] within the old form the first sprouts of the new,” he also insisted that “they naturally reproduce, and must reproduce, everywhere in their actual organization all the shortcomings of the prevailing system.” Formal equality in co-ops doesn’t necessarily mean that everyone participates equally; as in electoral democracy, bureaucracies and elites (and indifference) readily thwart the promise of equal voting rights. Additionally, over 90 percent of co-ops are consumer co-ops, meaning the main owners aren’t the people who work there. Even in worker–owned cooperatives, membership and employment don’t always coincide: at Cooperative Home Care Associates, America’s largest worker-owned cooperative, only half the workers are co-op members. This isn’t unusual: many co-ops are co-ops in name only, and some large ones even openly encourage special stock ownership that weakens membership control. Co-ops are also not nearly as autonomous from capitalism’s dictates as advocates imply. Credit unions — the most prevalent kind of co-op — have had to enter financial markets to raise the funds to service their base, and are therefore effectively integrated with Wall Street. Some were even implicated in the 2008 financial crisis. A look at Mondragon, the iconic, six-decade-old co-op in the Basque Country, reveals the limitations of co-ops. Boasting a workforce of 80,000, and operating on a global scale through 150,000 companies with annual sales of $16 billion, Mondragon is a living demonstration that it is possible to run a business that has a formally democratic structure, a significantly flattened income and power structure, and a humane, planned layoff model. Still Mondragon falls far short of Albert and Hahnel’s ideal. While the executive-to-worker income ratio is 6.5:1 — a fraction of the 350:1 in the US — it still leaves top managers inhabiting a different world than workers. And, as Sharryn Kasmir has shown in her research, participation in decision making has primarily been of interest to lower-level management — not workers. Recent developments have brought additional troubles. Competitive pressure drove the closing of one of Mondragon’s largest operations (Fagor, an appliance manufacturer with 3,400 workers), and the co-op finds itself increasingly reliant on temporary workers at home as well as growing production abroad that uses workers who are hired labor, not co-op members. In short, co-ops, once an integral part of radical political movements, are now largely integrated into the capitalist order. They may lobby for particular changes, but they no longer mobilize alongside those fighting capitalism. Instead, the main interest of co-op members is generally no more radical than getting a higher selling price or lower buying price in the market — nothing to scoff at, but also nothing to make capitalists sweat. Even with these shortcomings, takeovers and co-ops do have some positive strategic attributes. The enthusiasm for employee stock-ownership plans, in contrast, is downright puzzling. Under ESOPs, workers are partially compensated through company shares that are held in trust until they retire or leave. A notable proponent, Alperovitz concedes that ESOPs are far from perfect but still cites them as evidence of “evolutionary reconstruction” in the advance of democracy. Yet ESOPs were introduced to undermine workplace democracy and worker power, not enhance it. Corporations like Proctor and Gamble, IBM, Coca-Cola, and UPS chose employee stock-ownership plans for the tax breaks and to help keep unions out (or at least limit their mobilization against wage or benefit concessions by offering a partial “offset”). As a Federal Reserve paper examining the relationship between union bargaining and ESOPs concluded, “ESOPs create incentives for unions to become weaker bargainers.” From the perspective of challenging capitalism, ESOPs aren’t prefigurative, but integrative. The stock holdings offered to workers involve no redistribution of power, and what workers generally “share” in terms of corporate revenue is merely a slice of what they recently gave up. In attempting to establish the hegemony of the idea of ESOPs, Alperovitz coyly quotes none other than former president Ronald Reagan: “I can’t help but believe,” Reagan said in a speech in 1987, “that in the future we will see in the United States and throughout the western world an increasing trend towards the next logical step, employee ownership.” But far from suggesting the power of an idea whose time had come, Reagan’s endorsement (as the full speech makes clear) signaled his comfort with a mode of organization that no longer threatened the establishment. My point is not to dismiss the importance of strategies designed to increase worker control and ownership. In general, factory takeovers and co-ops should be enthusiastically supported. But what’s missing in so much recent analysis is a sober, comradely investigation of their strengths and weaknesses so that, over and above solidarity, we can learn from them rather than add to existing illusions — thereby gaining a better appreciation of what transforming society would really require.\nThe State and Working-Class Agency For all its purportedly radical goals, the movement for worker control within capitalism offers up curiously apolitical strategies to get there. They prioritize challenging property relations, but pay scant attention to the need to enter and transform the state, and seem to have little appreciation for how inter-firm competition helps reproduce capitalism’s social relations and priorities. Linked to these shortcomings is the short shrift given to political agency and the kinds of class political capacities — as opposed to economic capacities — that “getting there” demands. This relative disinterest in power and agency is the movement’s most fundamental weakness. How would workers actually take over workplaces not abandoned by capital? Is it right to expect workers to even want to do so given the uncertainties and lack of institutional support? What preparations are being made for the inevitable counter-attack from the state if this movement actually begins to threaten the economy’s dominant corporations and limit private capital accumulation? And beyond any threats from the state, how will these fragments of a new social order be coordinated and sheltered from the destructive pressures of domestic and international competition? Organizing outside the state is undoubtedly important. Yet at some point, anticapitalist movements can’t avoid taking the struggle into the state. Historically, when workers have gone to the brink in terms of militancy but refused or lacked the strength to engage with the state, their rebellions faded or were brutally crushed. To ignore or downplay the need to build a movement that can take on state power is to lose by default. A systematic consideration of the state isn’t just an issue for “later,” after the movement has become an actual threat. Rather, it is an immediate challenge — even when viewed in strictly economic terms. Though worker-owned enterprises and co-ops have proven they can survive in particular niches or in economic spaces largely abandoned by corporations, confronting capitalism’s major banks and corporations is a completely different matter. It strains credulity to expect worker-led enterprises to march out of capitalism’s shadows and replace corporate capital without the kind of support that can only come from states. The problem is not only that WSDEs and co-ops are disadvantaged from the beginning in terms of the workplaces and sub-sectors they have inherited, nor that they confront such a massive gap in financial, managerial, and technical resources as well as established connections to inputs and markets. Above all, it is that competition trumps everything. Despite isolated exceptions, competing on capital’s terms while trying to hang on to values that don’t enhance competitiveness means repeatedly facing a choice between jettisoning those values and accepting defeat in competitive terms. One common response to this dilemma is lobbying for special provisions for WSDEs and co-ops to partially correct the competitive disadvantage. These range from the easily agreed-upon policy of more “training,” to favorable start-up and financial subsidies and substantive technical and research support. Yet while survival may make such responses necessary, they also further legitimate the destructive impact of the competitive game. The day-to-day realities of competition tend to fragment solidarities, pushing worker collectives to look out for themselves — making winners feel little need to foster broader solidarities and losers feel cynical about worker control. The vortex of competitive pressures also spins its way into the inner workings of the collectives, giving greater weight to skills that markets deem more valuable and reproducing in-plant hierarchies that boost profitability. The divisions can also be self-inflicted, as when Wolff insists on categorizing workers along the axis of productivity, determined on the basis of whether they make a direct contribution to the creation of a surplus. Whatever purpose this might serve in analyzing capitalism (dubious at best), the distinction is especially counterproductive in building class-based solidarity. Giving some workers a higher status than others reinforces the lower status often accorded to laborers like office workers and cleaners (generally more precarious workers, often women and immigrants). The verbal gymnastics of describing so-called non-productive workers as nevertheless important or labeling them “enablers” does little to equalize their status. (Similarly, telling lower-paid fast-food workers they are less exploited than autoworkers because they don’t produce as much surplus value does little to build bonds of solidarity across the working class.) There are reasons to hope worker-controlled enterprises flourish economically. But their success does not, by itself, produce a working class with the capacities to win the coming political battles. Mondragon, the most successful of the co-ops, is again instructive. Founded by an antifascist Catholic priest named Father Arizmendiarrieta, Mondragon was tolerated and even supported by the Franco regime because it was seen as “an entrepreneurial alternative to working-class activism and socialism.” That anti-radical tendency survives to the present. Mondragon workers have been notably absent from much of the ideological and cultural currents swirling about in the rest of the Basque and Spanish working class. Though they have sometimes participated in broader struggles, the economic leadership of Mondragon has not been matched by a political leadership. This is not just a matter of lackluster solidarity but an indication that Mondragon, for all its achievements, accepts the rules of capitalism and tries to carve out a competitive space within it. “We live in a market economy,” its president recently stated, adding, “and that we cannot change.” In grappling with the dilemma of competitive success versus class formation, one point must be made: trying to enact policies that “level the playing field” is the wrong approach. What’s needed is to change the rules of the game, so that the measure of success is not a “competitiveness” that undermines solidaristic and egalitarian values. Changing the rules of the game means constraining the disciplining power of competition — limiting rather than extending freer trade, and constricting the ability of capital to remove productive enterprises from the communities that enriched them. This also implies giving greater weight to inward-oriented development and introducing a significant degree of economic planning. Moving in this direction, rather than working within the existing rules of capitalism, requires taking the struggle to the state — not just against the state, but inside the state and with the goal of transforming the state. This brings us back to the question of agency. If the key to achieving a participatory economy lies in the capacity to change the rules of the game and transform the state, then the evaluation of WSDEs and co-ops can’t rest on whether this or that enterprise is economically successful but whether they contribute to building a working class with the vision, confidence, class sensibility, smarts, and institutional strength to democratize the economy.\nPoliticization So what would the politicization of WSDEs, co-ops, and related forms of participatory democracy look like? What does acknowledging the need to confront the state and build class capacities imply for their daily functioning? How would this broader role change as the stage of the struggle changes? And if politicization is to be generalized and sustained, doesn’t it demand, as a complement to these primarily economic institutions, a specifically political institution — a party (or parties)? Consider consumer and credit co-ops. In the past they often had close links to socialist movements and as left politics waned, so did the political nature of the co-op movement. Re-politicizing co-ops would mean rejoining the socialist movement: becoming active again in socialist-oriented campaigns, integrating socialist education into their contacts with members and the community, extending their facilities to serve as cultural and political spaces (coffee shops, bookstores, pubs, places for public forums). Especially intriguing is the suggestion, which has roots in some past practices, that co-ops set aside a portion of sales to fund union, community, and socialist organizing. Buying co-op would then amount to more than just the expression of a consumer preference. It would signal a commitment to a larger political project. In the case of worker-owned enterprises, politicization represents a more radical challenge. As emphasized above, a strategy based on taking over plants abandoned by capital while accepting the competitive straitjacket of capitalist markets may make a certain practical sense. But it simply cannot be a base for social transformation. Politicizing worker self-management demands a focus on the context within which they operate. To accomplish this politicization, WSDEs must be integrated into larger complexes — whether organized on a regional or sectoral basis — that directly meet social needs, and they need to be at least partially sheltered, through a significant degree of planning, from the destructive pressures of competition. The scale required for such planning can only happen at the level of the state. For his part, Alperovitz has constructively pointed to the democratic import of municipally owned utilities. This focus on the local state should be extended to manufacturing, construction, and service operations — constructing “soviets” of a sort. What this strategy emphatically does not seek is more effectively inserting workplaces into global value chains and international competition. If — as part of a struggle for inward-oriented as opposed to free-trade-led development — state and para-state institutions could begin guaranteeing markets for local production (e.g., hospital bedding and supplies, books for schools and universities, material and equipment for construction and environmental refurbishing), this might buttress the prospects of worker-managed enterprises. So too could the creation of a public corporation to oversee the conversion of plants (in sectors like auto) to address this century’s long-term environmental needs vis-à-vis public transportation and the energy-efficient refurnishing of factories, offices, and homes. Among other things, the presence of such structures might itself encourage workers — concerned about the future of their workplace and aware of its potential productive capacities — to initiate takeovers that could then fit into the overall environmental or social provisions plans. This is new territory. There is abundant evidence that workers can organize workplace production, but have little experience in democratically developing broader social plans that can also incorporate enough workplace autonomy to make worker self-management meaningful. How far this can go within capitalism shouldn’t be exaggerated, but testing it does seem fruitful for developing the economic skills, institutional abilities, and political links — as well as highlighting the many unresolved problems — essential for moving on to more ambitious interventions. A particularly significant blind spot for the workplace-control movement has been public-sector workers — especially considering that their unions are essentially the last bastion of trade unionism. In Wolff’s case, this oversight seems to follow from his minimal interest in “non-productive” workers. But the broader reason for the neglect lies in the absurdity of applying segmented worker ownership to the public sector; it doesn’t seem especially worthwhile to think about workers in the tax department or welfare department “owning” tax collection or the distribution of food stamps. Yet if the transformation of the state is paramount, then the role of public-sector workers is also crucial. At worst, ignoring it may lead to workers — concerned with their sectional interests — becoming a damaging obstacle to the state’s democratization. But at best, it could seriously broach the issue of moving us to a different kind of state. In the past, some public-sector workers have tentatively forged alliances with clients as part of an effort to protect their jobs and enhance their bargaining position. Could this defensive tactic be extended to institutionalize new worker-client relationships directly within the state — e.g., setting up worker-client councils inside the welfare department to address problems with welfare provision; establishing teacher-parent councils to restructure the school system; and forming similar councils for health care, housing, transportation? Thinking through these questions of politicization — whether it means rethinking industries, workers’ relationship to the state, or workers’ role within the state — makes it possible to conceive of the project of self-management as not bypassing unions but perhaps even fostering the conditions for their revival. To what extent does the revivification of unions and the re-emergence of struggle among their members lie in developing a broader class sensibility that links common frustrations to the need for larger workplace and community class solidarities that can challenge what is produced, how, and for whom — questions basic to the question of self-management? One of the few cases in which the state does come up in the participatory economy project is in participatory budgeting: a process that provides ordinary citizens the chance to shape local priorities. There are good reasons to cheerlead this exercise in democratic financing. Participatory budgeting brings in marginalized constituencies and develops individual and collective literacy about a particular dimension of state activity. And the process is attractive to some because they see it as taking power from the state and giving it to the base, rather than entering the state. The problem is, by their very nature, budgets function as disciplining constraints. If raising taxes, control over investment and jobs, and restrictions on capital flows are outside the realm of discussion — as is the norm in these pecuniary discussions — then the most important challenge is obscured: how to modify or overcome the constrictions people face. Participatory budgets thus end up limiting, not expanding, political possibilities. In this context, politicization would include not only equalizing opportunities for participation (transportation costs, child care) and democratizing technical expertise (by pushing bureaucrats to popularize their explanations and becoming, as a Brazilian academic suggested, “technodemocrats”), but carrying out the educational and organizing work to challenge budgetary constraints and locate them in the political economy of class power. At present, the politicizing of WSDEs and co-ops would revolve around consciously integrating political concerns into their economic activity — building a class sensibility, developing relations across their constituent parts, engaging the state, and taking steps that begin the process of transforming the state. Yet as with the economy, piecemeal transformation has its limits. If and when this movement confronts a new stage brought on by the larger movement it is part of — such as a left government coming to power with a commitment to democratize the state — the changed circumstances would raise the stakes for worker self-management. The continued dependence of the new government and society on a hostile capitalist class, along with the state’s still-undeveloped capacity to take over, restructure, and democratize major sections of capital, would make a period of uncertainty and crisis virtually inevitable. It is at this critical moment that the economic skills and potentials of worker self-management could escape their marginal station within capitalism and become a central political factor. It is here that the “symbiotic relationship” Wright speaks of between alternative economic institutions and related movements on the one hand, and the state on the other — naïve in ordinary times under capitalism — would also become meaningful. As co-ops and social movements acted in concert to carry out the collective provision of basic necessities like food, health, energy, and transportation; as land, idle factories, and ports were taken over; as plant and equipment were prevented from being relocated abroad; as workplace councils were established and linked to others in the sector or region — as all this exploded, “worker and community self-management” would take on a qualitatively new meaning. And if it were to be successful, it would also have to demand the kind of practical state support that helps midwife a “different kind of state.” Finally, the politicization of worker control and co-ops cannot happen without introducing another institution, one that straddles the world of worker enterprises and co-ops as a “partially autonomous realm of activity.” What Thad Williamson has observed of Wright’s “real utopias” applies even more to the other advocates of alternative economic institutions like co-ops, worker self-directed enterprises, and all their cousins: “Consideration of politics as a partially autonomous realm of activity generally takes a back seat.” Neither the politicization of the alternative economic institutions nor the future transformation of the state is possible without the existence of a specifically political institution — a socialist party (or more likely, parties) grounded in these alternative institutions but with a larger (and longer-term) vision and strategic sensibility. Its distinct role is to focus not so much on more radical policies — though that’s important as well — but on building the individual and collective capacities for analyzing and evaluating, for democratic deliberation and strategizing, for organizing and building solidarity, and for endeavoring to make “workers” into a class with the ability to win state power and transform the state.", "url": "https://www.jacobinmag.com/2016/03/workers-control-coops-wright-wolff-alperovitz"}