{"authors": [], "date_download": "2020-05-04 20:22:04", "date_modify": "2020-05-04 20:22:04", "date_publish": "2016-10-31 22:10:00", "description": "The annual Halloween celebration on Franklin Street saw a crowd of 25,000 people Monday night as organizers made a few changes in the name of safety. As in recent years, Chapel Hill leaders...", "filename": "_a5fc2a38a7919330efe8eff4a566912a_1588623724.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a5fc2a38a7919330efe8eff4a566912a_1588623724.html", "title": "One arrest made at Homegrown Halloween celebration", "title_page": "One arrest made at Homegrown Halloween celebration", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The annual Halloween celebration on Franklin Street saw a crowd of 25,000 people Monday night as organizers made a few changes in the name of safety.\nAs in recent years, Chapel Hill leaders are trying to tamp down how wild the festivities can get during the Halloween celebration. Before starting the Homegrown Halloween movement, the event was expensive and dangerous for the town.\nThis year, Halloween revelers saw new hours for the event. In the past, authorities allowed the party to run until about 11 p.m. Monday night, the party wrapped up at 10:30 p.m.\nSadie Hoffman said people will still find time to pack in the fun, and the party will likely continue after the event ends.\n“I think people will still be hanging around the sidewalks anyway,” Hoffman said.\nAuthorities said the streets were entirely cleared of people by 11 p.m. The street was reopened to traffic at about 11:35 p.m.\nDuring the celebration, revelers had the chance to be anyone or anything they wanted for a few hours. Lauren Munach got a lot of looks dressed as a jellyfish but things remained calm, even around presidential candidates.\n“Everybody is really friendly, so things are going real well,” said party goer Guilham Dellamalva, who was dressed as Republican presidential nominee Donald Trump.\nOne arrest was made during the event following a report of a person being groped, authorities said. Information on charges in connection to the incident were not available.\nOrange County Emergency Services said four people were treated at the event- three for alcohol-related issues and one for an unspecified medical issue. One of the alcohol related issues resulted in a person being transported to UNC Hospital.\nTo keep the party small, access to the street was blocked to outsiders and there were checkpoints for dangerous items and alcohol.\nOther precautions were the same as last year and access to downtown areas was restricted. About 200 police officers were expected to be on the scene.", "url": "https://apnews.com/a5fc2a38a7919330efe8eff4a566912a"}