{"authors": ["Connor Kilpatrick", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:07", "date_modify": "2020-05-04 19:52:07", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_10_democratic-party-clinton-trump-white-voters-workers_1588621927.html", "image_url": "https://images.jacobinmag.com/2016/10/17231436/vote-here-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_10_democratic-party-clinton-trump-white-voters-workers_1588621927.html", "title": "This Didn’t Have to Happen", "title_page": "This Didn’t Have to Happen", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "It may seem hard to believe in a country where Donald Trump has a shot at becoming president, but people make rational political decisions. Most of the time, at least.\nWhen an affluent voter in a high tax bracket who owns a business and a nice house shows up and votes for a Republican, that is a rational decision. And when a lower-income voter who has little access to health care and pays rent to a landlord shows up to vote for a Democrat, that is also a rational decision.\nAnd for most of the population in most of the country, this is still how votes for the two parties break down: more affluent voters pull the lever for Republicans and less affluent voters do so for Democrats.\nIf every adult living in the United States turned out to vote on every Election Day, and was forced to choose only between the two parties, it is almost certain that the Republican Party in its current form would lose not only the presidency but every state legislature and congressional race.\nThe problem though is that affluent people show up on Election Day with a lot more frequency than the less affluent. The Republican-backed voter suppression laws have had a huge effect. But this predates that. Over the years the policy preferences of voters and nonvoters have diverged sharply, particularly when it comes to class-based issues. Voters are far more conservative when it comes to things like the welfare state, wealth inequality, and labor unions than nonvoters are. So if more of these nonvoters began to show up at the polls, we would suddenly have an electorate dramatically more supportive of the kind of social-democratic program favored by Sanders and his supporters.\nOne explanation could be that the affluent party, the GOP, is much better and more consistent at rewarding electoral loyalty to their constituents through concrete, material economic policy than the less affluent party, the Democrats, is for their lower-income constituency. When George W. Bush took power, he delivered to his constituency immediately: capital gains and top marginal tax rates were slashed and the Department of Labor was gutted, making it harder for his voters’ employees to check their bosses’ power. More than sweet promises and a dozen roses once a year, the GOP put a ring on it.\nBut when Obama took power, he passed the Heritage Foundation’s health-care plan and dropped organized labor’s central priority — the Employee Free Choice Act — even as he oversaw the Democratic Party’s greatest congressional majority in years. Regardless of whatever constraints he had and the small but real victories his administration offered for workers (Medicaid expansion, the overtime rule, etc.) it’s just true that his Republican predecessor delivered more to his affluent voters, and more quickly, than Obama did to his less affluent voters.\nThe Republican Party is simply better at being a party of capital than the Democratic Party is at being a party of the working classes. And it’s not an accident.\nLast week, Seth Ackerman wrote a piece pushing back on Vox’s study of lower-income Trump voters. He ended that essay with a pretty undeniable fact: despite all the talk of a GOP in decline, they control Congress and the vast majority of state governments. The party that had been beaten back into the minority for most of the twentieth century now, in the 2010s, can not only obstruct but govern. And perhaps one reason they’re able to have that power is due to the fact that there is a massive, untapped portion of the electorate — downscale whites — who just don’t vote anymore.\nWhile we hear constantly that they’re demographically dying out, white workers without a college degree remain at least 63 percent of the working class and in twenty years, will be a “mere” 49.5 percent. That’s a ton of potential voters. Ackerman’s argument was that instead of writing off lower-income Trump supporters as hopeless racists who’ll always vote for white supremacy over their wallets, we should instead attempt to forge a broad, working-class political program that could win them over.\nPretty quickly, the pundits had a collective brain melt. How dare we argue that the left-of-center party use a working-class program to appeal to these working-class bigots! In one illuminating discussion, I saw a high-profile political commentator state that this was a ridiculous strategy because the Democratic Party already gets the non-racist share of the white working class to show up. And that the only way these poorer whites would come to the table is if the Democratic Party promised to explicitly or implicitly protect white supremacy.\nThe implication here is that the huge number of low-income whites who simply stay home on Election Day (or the much smaller number who pull the lever for the GOP) can only be operating — or failing to operate — out of racism.\nIt was suddenly clear: the liberal commentators who hold this view believe that their party and its record on both campaigning on and enacting a working-class program was so obviously good that to be a worker and fail to vote for the Democratic Party must signal some greater, all-encompassing ideological drive that overpowered class interest.\nTo this punditocracy, that overriding ideology that thwarts a vote for “the working-class party” must be white supremacy. And thus this huge chunk of downscale white voters who don’t vote at all (and the smaller chunk who vote GOP) would only change their behavior if the Democratic Party became a White Man’s Party in the old Dixiecrat mold or if they somehow, sitting in their homes, managed to overcome their racism through personal enlightenment.\nThis couldn’t be farther from the truth.\nLet’s look at McDowell County, West Virginia. The Guardian zeroed in on McDowell due to Trump winning 91.5 percent of the Republican primary vote. They of course left out the fact that more than three times as many Democratic Party ballots were cast and that nearly twice as many people voted for Sanders as voted for Trump — but we’ll give them a pass because at the time of the primary, the GOP race was effectively decided. Fair enough. McDowell County will likely go for Trump in November. Just as it did for Romney in 2012.\nAnd yet in 2008, Barack Obama won McDowell handily with 53 percent of the vote. Recent studies have shown that Obama won across the country in 2008 with far more white working-class voters than commonly thought. Even though he lost many of them four years later in 2012 — they either stayed home or went with Romney. Trump’s strength in the Midwest this year appears to stem in part from white working-class ex-Obama voters. As one older, ex-mine worker in McDowell says to the Guardian, “I voted for that black guy two times.” He’s now with Trump.\nHow does a liberal pundit explain this? If these voters are such obstinate racists who’ll always choose upholding “white supremacy” over their pocketbooks, why did they give Obama a shot in the first place? Did they think he wasn’t really black? Why didn’t they vote in 2008 like they did in 2012 and plan to in 2016? Did they simply expect Obama to help uphold white supremacy and, when he got into office, found that he acted “too radically for blackness”? Was inviting Jay-Z to the White House the moment where Obama lost the white working class forever?\nOr, perhaps, in the wake of the worst financial crisis since the Great Depression, Obama and his party simply failed to make the lives of voters in McDowell County substantially better. Since Obama, the Democrats have campaigned in every subsequent election under the galvanizing cry of “Hey, it could’ve been worse.” Maybe these McDowell voters question how it was that the wealthiest Americans recovered so quickly from the crash while they and their families and neighbors were worse off than ever.\nIs this really a crazy hypothesis? Staying home on Election Day or — in a two-party system — voting for “the other guys” is certainly something no left-of-center person wants to see. But it’s not an insane or necessarily ideological decision when your life has fallen apart during the eight years one particular party has held the White House. While Obama at least delivered Medicaid expansion to West Virginians, his presumptive successor campaigned on, “We’re going to put a lot of coal miners and coal companies out of business.” And while Clinton promised to enact programs to ease the loss of those livelihoods, Bill Clinton made similar promises about easing the job losses of NAFTA. To no one’s surprise, they didn’t materialize. I’d say that’s some well-earned skepticism.\nWhen it comes to the nature of the white working class, I agree with civil rights leader Bayard Rustin: they are neither inherently conservative nor liberal. Which way they break is determined by politics and organization — not destiny or their whiteness.\nRacism can be fought, defeated, or overruled by working-class politics. Or it can be brought front and center. As Ackerman pointed out in his article, West Virginia in the 1920s was a bastion of reaction — the KKK and coal operators ran the state. In the 1930s and up through the 1970s, it was a hotbed of labor unions, class struggle, and a hell of a lot of Democratic Party votes. Hubert Humphrey, who rose to prominence for his commitment to both civil rights and the welfare state, crushed Richard Nixon and George Wallace in West Virginia with 49.6 percent of the vote. Was this because the whites of West Virginia were simply less racist than the whites of Georgia, who helped Wallace carry their state? Or was it because West Virginia was the site of class struggle and labor politics in a way that Georgia at that time was not?\nIn fact, the greatest determinant of whether a white working-class person votes GOP or Democrat is still whether or not he or she is in a labor union. A union is, after all, an organization that, ideally, keeps its members focused on their material, class interests even between elections. They build solidarity between people who might otherwise dislike, distrust, or even hate each other. They keep working people focused on their inherent commonality in a way that no privilege-checking session, feel-good campaign ad, or BuzzFeed quiz ever can. That’s why they’re powerful. And that’s why the rich despise them.\nAnd while labor-union membership has been in decline overall for decades now, the potential for workers to organize is as strong as ever — even under twenty-first-century capitalism. As sociologist Beverly Silver has pointed out, the spread of just-in-time production means a relatively small number of workers still “can bring an entire corporation to a standstill.” And even with globalization, “the potential geographical scale of the impacts of these stoppages has increased.”\nEven today strategies and technologies to diminish workers’ rights in education and transportation have resulted in the first stirrings of union drives from charter school teachers and Uber drivers. As much as we hear otherwise, capitalism will always need workers to make their profits and will thus always be vulnerable to the potential of organized labor. That is the core truth of a capitalist economy that Marxists understand — no matter how zany we can get about other things — and that liberals do not.\nIt also means we’re inoculated from other catechisms that bear no resemblance to the historical record. The belief that “racism” is a transhistorical phenomenon that can and will always destroy working-class solidarity is not only wrong, it fundamentally aligns — almost like an ideological partnership — with the same belief we hear in the press all the time that organized labor can only hope to manage its extinction and nothing more. And that the working classes are obsolete.\nTogether, these beliefs — perpetual racism and the hopelessness of labor fighting back against capital — form a politics that is fundamentally conservative. And in this retreat from a politics of class solidarity and working-class self-determination, the professional classes have stepped in and taken the wheel.\nToday, the Democratic Party can count on the votes of millions of working-class Americans, largely people of color. And yet it’s an open secret that the party’s program is led by the affluent professional class at best and enlightened Silicon Valley billionaires at worst. Obama himself has hinted that he’s interested in going into venture capital after his presidency. Organized labor — always a junior partner in the Democratic Party even at its height — is now something closer to Donny in The Big Lebowski. Frail, meek and at death’s door, he must always “shut the fuck up.”\nThat means that while this form of liberal politics can probably scare up enough votes to win a few elections, it’s fundamentally incapable of not only governing but of changing society for the better. It surrenders Congress and the majority of state legislatures to the most fiendish right-wing maniacs in the country. And it’s a politics that’s fundamentally limited even in its ability to help fight racial discrimination.\nAfter all, the two most significant and expansive pieces of federal legislation on civil rights in the twentieth century were signed by two presidents who won the votes of the white working class — Harry Truman and Lyndon B. Johnson. And it was Walter Reuther’s United Auto Workers that provided financial support to Martin Luther King and the Civil Rights Movement — not “woke” corporate executives.\nIt’s true that working-class politics has been torn apart by racial strife in the past but the opposite is equally true. Black and white workers in the Jim Crow South were able to organize unions together even if racist political appeals always had to be fought off. How strange it is to believe that a white forty-year-old worker in 2016 is just as much or more driven by racial animosity than his Southern 1937 Jim Crow equivalent. (A recent Reuters survey puts Trump’s support among non-college Southern whites at 55 percent for those over fifty years of age, but only 39 percent for those forty-nine and younger.) And as much as liberals like to point out that the supposed “bellwether” Macomb County, Michigan — the home of many unionized autoworkers — went for Nixon in 1968 and Reagan in 1980, it is equally true that they repeatedly reelected David Bonior, one of the most left-wing members of the House of Representatives. In 1976, even at the height of the busing riots, Carter won the county, just as he won the nation’s entire white working-class vote, North and South.\nPolitics, especially working-class politics, is complicated. Well-funded reactionaries will always be able to find weak points in such a coalition. That doesn’t mean that “white supremacy” is destiny. In 1980, Reagan did in fact win working-class whites — but with the exception of black voters, he won pretty much every demographic that year. Even ones that had historically gone for Democrats. Women, Catholics, you name it. Yet studies in 1984 showed that most people sided with the Democratic Party on questions of welfare spending. They just believed that the Democrats, unlike Reagan, were incompetent at managing the economy.\nIs that racism? Or is it the fact that Carter put the economy into recession in order to save bondholders? This is the president who went on television to tell working Americans that from now on, they’d have to do more with less. The president whose appointee to the chair of the Federal Reserve, Paul Volcker, said in 1979: “The standard of living of the average American has to decline.” I’d call that a pretty good indicator that his party wasn’t that interested in its working-class constituents.\nAfter all, “doing more with less” certainly didn’t apply to the wealthy of this country. Do liberals think the working classes simply wouldn’t notice that this new frugal standard applied only to themselves? While Reagan ran on “Morning in America,” the Democrats became the party of austerity and balanced budgets. Dukakis, in his 1988 convention biopic, was depicted as mowing his own lawn with an old-fashioned push-mower. Apparently, a gasoline-powered motor would just be too decadent.\nThe pundit class, however, can’t see these flaws. As members of wealthy, coastal communities, its backers see only the symbolic achievements of the twenty-first-century Democrats and none of the failures. We are talking about a class of people who believe the anger and bitterness of white working-class middle Americans in 2016 is rooted in the anxiety that “their whiteness has lost its value.” No, it couldn’t be that they’ve lost their livelihoods, families, or homes — it’s that they’ve just been told George Wallace isn’t coming to save them after all. It’s not only not true, it’s garbage politics. In effect, it is nothing more than academic jargon used by the affluent to dismiss and slander working people’s rightful belief that as a society grows far wealthier (as the United States has over the past several decades), they’re entitled to rising expectations — no t diminished ones.\nThanks to WikiLeaks, we now know that Apple CEO Tim Cook and Bill Gates — the billionaire who has been leading the movement to destroy public education — both made it onto Clinton’s shortlist for running-mate. This is the party rejected by white workers supposedly out of “racism” and nothing more — not the party of civil rights and Medicare. The obstinate belief that good and sincere pro-labor politicians like Sherrod Brown, Elizabeth Warren, Tom Perez, and Keith Ellison are in the driver’s seat of the Democratic Party is simply a delusion. If the Democratic Party is Madison Square Garden, then Andrew Cuomo, Chuck Schumer, and the Clintons sit courtside, chatting with the players. Sanders, Warren, and Brown are up in the nosebleeds.\nSo what is to be done when the Democratic Party of 2016 can win neither Congress nor the majority of state governments? According to the pundit class, we’re supposed to just wait. A decade or two. Instead of adopting Sanders’s class politics to win over the entire working class, many liberal pundits would prefer we simply wait twenty years when the white working class will no longer be a majority of workers. Demography, they seem to believe, is political destiny. Somehow, I kind of doubt that an eighty-six year-old senator Chuck Schumer will announce in the year 2036 that his party intends to finally “extinguish the billionaire class.”\nI can understand how appealing it is to believe that it’s simply “miserable, angry whites” and their racism that’s holding back the Democratic Party from becoming either a social-democratic powerhouse or one that can at least expand on the achievements of its mid-century golden age all over again. It certainly seems easier to just wait patiently than to fight some of the most powerful people in the country for control over a party that is, structurally, far more theirs than ours — likely, irrevocably so.\nBut demographics won’t turn the party of Silicon Valley into the party of Chicago’s South Side or West Virginia’s coal country. All that waiting will do is prolong the undeniable suffering felt both by Trump and Clinton’s working-class supporters — and the large number of low-income Americans who don’t vote at all. Because that suffering isn’t exclusive to downscale Trumpists — “the deplorables” — it’s everyone who works or desperately hopes to work for a measly wage in order to survive. In other words, not the pundits who have next to nothing in common with them.\nIt’s not just “vulgar class-first” issues where the Democrats are failing — the party’s nationwide marginalization means, in much of the country, it’s been decades since it’s been this difficult to start or join a labor union or have access to abortion services. Despite having largely shed the “racist” white working class from the Democrat’s electoral coalition, the black-white wage gaps are now larger today than they were in 1979. And therein lies the central irony of the Democrats’ tighter rhetorical embrace of social liberalism alongside a staunch rejection of populist class politics: they actually made far more progress on the former when they were a party capable of the latter.\nThe belief that bringing in the nonvoting white working class requires surrendering on commitments to gender equality and antiracism is simply that — a belief. Sanders simultaneously attracted the support of white working-class voters in states like Indiana, Wisconsin, and Michigan even as he repeatedly championed Black Lives Matter and the fight against racial discrimination. There was no Sister Souljah moment with Bernie. The idea that bringing in certain segments of the working class automatically negates the coalition’s commitment to social liberalism is a myth.\nAmong non-Evangelical Protestants, black voters still disproportionately oppose same-sex marriage even as they disproportionately vote Democratic. In 2008, African-American Protestants strongly supported Prop 8 in California. By our punditocracy’s “working-class contaminant” theory, the Democratic Party would be forced to choose here between commitment to same-sex marriage and their black Protestant voters. Yet neither has been “purged” from the coalition. And, steadily, progress has been made — far more Democrats, black Protestants, and Americans support same-sex marriage now than they did fifteen years ago.\nSo while we’re told about just how insane white workers are for voting the way they do, I frankly don’t find it surprising. Many still vote for today’s affluent, professional-class Democratic Party with low expectations. Some, with no labor union or political organization to corral them, fall back onto reactionary prejudices and throw in with people like Trump for the worst reasons.\nAnd most, understandably, just stay home on Election Day. Until we change that fact, social justice in the United States will continue to remain out of reach for everyone who has to work for a living.", "url": "https://www.jacobinmag.com/2016/10/democratic-party-clinton-trump-white-voters-workers"}