{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:27:54", "date_modify": "2020-05-04 16:27:54", "date_publish": "2016-07-18 20:09:05", "description": "Read CNN's International Criminal Court Fast Facts for a look at the ICC.", "filename": "2016_07_18_world_international-criminal-court-fast-facts_index_1588609674.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/120710014230-icc-thomas-lubanga-sentence-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2016_07_18_world_international-criminal-court-fast-facts_index_1588609674.html", "title": "International Criminal Court Fast Facts", "title_page": "International Criminal Court Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the International Criminal Court (ICC), a court comprised of 123 states from around the world.\nFacts\nAlthough created by the Rome Statute, a treaty first brought before the United Nations, the ICC operates as an independent entity.\nThe court is located in The Hague, Netherlands.\nThe ICC is the \"court of last resort,\" and came into force on July 1, 2002. The court tries four types of crimes: genocide, crimes against humanity, crimes of aggression and war crimes. It is not intended to replace a national justice system.\nThe United States is a signatory to the treaty, but not a party.\nCases are referred to the court by national governments or the United Nations Security Council.\nTimeline\nJuly 17, 1998 - The Rome Statute is adopted by 120 states, informally establishing the permanent ICC. Seven members of the United Nations vote against the statute: the United States, China, Iraq, The Rome Statute is adopted by 120 states, informally establishing the permanent ICC. Seven members of the United Nations vote against the statute: the United States, China, Iraq, Israel Libya , Qatar and Yemen\nJuly 1, 2002 - The Rome Statute enters into force after ratification by 60 countries.\nOctober 12, 2016 - Burundi votes to withdraw from the ICC, but is still listed as a party.\nNovember 10, 2016 - Gambia notifies the ICC that it is withdrawing, citing bias against Africans. Gambia notifies the ICC that it is withdrawing, citing bias against Africans. Gambia cancels its withdrawal in February 2017.\nOctober 27, 2017 - , becoming the first member state to do so. Burundi effectively withdraws from the ICC , becoming the first member state to do so.\nSelected Trials\nJean-Pierre Bemba\nLaurent Gbagbo and Charles Blé Goudé\nGermain Katanga and Mathieu Ngudjolo Chui\nNovember 24, 2009 - The trial begins against former Congolese rebel leaders\nNovember 21, 2012 - The trial against Katanga and Ngudjolo Chui is separated into individual cases.\nDecember 18, 2012 - Former rebel leader of\nMarch 7, 2014 - \"as an accessory to one count of a crime against humanity (murder) and counts of war crimes (murder, attacking a civilian population, destruction of property and pillaging)\" for the 2003 attack.\nMay 23, 2014 - Katanga is sentenced to 12 years in prison.\nJanuary 18, 2016 - After an appeal for a sentence reduction, Katanga's ICC jail term officially ends, although he remains in Congolese custody as the Democratic Republic of Congo investigates additional charges against him. The trial begins against former Congolese rebel leaders Germain Katanga and Mathieu Ngudjolo Chui. They are accused of three counts of crimes against humanity and seven counts of war crimes stemming from attacks on the village of Bogoro that occurred between January and March 2003.The trial against Katanga and Ngudjolo Chui is separated into individual cases.Former rebel leader Ngudjolo Chui is acquitted of charges of war crimes and crimes against humanity. Katanga is found guilty \"as an accessory to one count of a crime against humanity (murder) and counts of war crimes (murder, attacking a civilian population, destruction of property and pillaging)\" for the 2003 attack.Katanga is sentenced to 12 years in prison.After an appeal for a sentence reduction, Katanga's ICC jail term officially ends, although he remains in Congolese custody as the Democratic Republic of Congo investigates additional charges against him.\nThomas Lubanga\nJanuary 26, 2009 - The trial begins for Congolese warlord,\nMarch 14, 2012 - Lubanga is convicted of war crimes for using children under the age of 15 as soldiers.\nJuly 10, 2012 - Lubanga is sentenced to 14 years in prison. He is the first person to be convicted and sentenced by the ICC. The trial begins for Congolese warlord, Thomas Lubanga , who is accused of \"conscripting and enlisting children under the age of 15 years and using them to participate actively in hostilities (child soldiers).\" Lubanga is convicted of war crimes for using children under the age of 15 as soldiers.Lubanga is sentenced to 14 years in prison. He is the first person to be convicted and sentenced by the ICC.\nAhmad al-Faqi al-Mahdi\nBosco Ntaganda\nSeptember 2, 2015 - The trial begins for\nAugust 28-30, 2018 - Closing arguments in Ntaganda's trial take place. The trial begins for Bosco Ntaganda, who stands accused of 13 counts of war crimes and five crimes against humanity which allegedly took place in 2002-2003 in Ituri, Democratic Republic of Congo.Closing arguments in Ntaganda's trial take place.\nNovember 7, 2019 - Ntaganda is sentenced to 30 years in prison by unanimous vote. This is the longest sentence ever handed down by the ICC and Ntaganda is the first person to be convicted of sexual slavery by the ICC. Ntaganda's time served from March 22, 2013 to present will be deducted from his sentence.", "url": "https://www.cnn.com/2016/07/18/world/international-criminal-court-fast-facts/index.html"}