{"authors": ["Amanda Cuda"], "date_download": "2020-05-04 20:28:21", "date_modify": "2020-05-04 20:28:21", "date_publish": "2016-09-02 20:49:02", "description": "DERBY — Howard Towne has been in and out of hospitals for his heart condition for more than 20 years. As a result, the 64-year-old Ansonia resident has had his blood drawn seemingly...", "filename": "_b9c529f9b68e47f789ab0c4e604676d6_1588624101.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b9c529f9b68e47f789ab0c4e604676d6_1588624101.html", "title": "Tapping into IV takes pain out of blood draws", "title_page": "Tapping into IV takes pain out of blood draws", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DERBY — Howard Towne has been in and out of hospitals for his heart condition for more than 20 years.\nAs a result, the 64-year-old Ansonia resident has had his blood drawn seemingly countless times. It’s often an unpleasant experience. On one of his trips to an area hospital, staff stuck him with needles so many times that “I was perforated. Everything was black and blue.”\nWhen he was rushed to Griffin Hospital’s intensive care unit recently for another incident, Towne thought he knew what to expect. But he was surprised.\nThe hospital is one of a handful in the country — and the only one in Connecticut — using the PIVO system, designed by San Francisco-based company Velano Vascular. The system allows nurses and doctors to draw blood from a patient by accessing his or her existing intravenous medication line, instead of repeatedly sticking the patient with a needle.\nGriffin began using the system in its ICU almost two years ago as part of a pilot program with Velano. Griffin Chief Medical Officer Fred Browne said he first heard about the device at a conference and was immediately taken with the idea.\nBlood draws have to be done constantly in the hospital, he said, particularly in intensive care. And they are, literally and figuratively, a pain.\n“I’ve never in my career in medicine met anyone who enjoyed getting stuck with a needle,” said Browne, also vice president of medical affairs at Griffin.\nAside from the discomfort, he said, drawing blood can be difficult in some patients, including chronically ill or older patients whose veins aren’t as plump and easily accessible as those of younger, healthier patients. For Towne, who typically has his blood drawn around the clock during a hospital stay, the PIVO was a welcome addition.\n“The nice thing about this is that you don’t get black and blue,” he said. “I’ve never had this before. I love it.”\nThough PIVO is only in five hospital systems nationwide, Velano co-founder and CEO Eric Stone said and his partner, Pitou Devgon, hope to eventually have it in all hopsitals. Stone said Devgon, who is a doctor, came to him with the idea for PIVO several years ago, after a discussion with a patient.\n“She said ‘Why do you keep sticking me for blood draws? Why don’t you use (the IV line)?’ ” Stone said. Devgon took it to heart, and began developing a way to use the IV as a conduit for withdrawing blood.\nBrowne said the idea isn’t unprecedented. Even before PIVO, there were ways to draw blood without multiple pokes, but preparing the body for these methods was often invasive. For instance, some patients with chronic illnesses, such as cancer, have a device called a port installed that allows them to get medication and get blood drawn. But this involves surgery.\nPIVO can be used in connection with nearly any IV line. Sometimes, the line isn’t compatible with the device because of where the line is placed, or some other issue. But Griffin uses PIVO with 70 to 80 percent of its intensive care patients, said Edward Valente, clinical manager of the ICU.\nRight now, Griffin only uses the device in the ICU, but Browne said he hopes it will eventually be used hospital-wide. Valente said given how much easier and more comfortable the system is than conventional blood draws, he also expects it to catch on quickly.\n“It has the potential to become the next wave of how everyone is drawing blood,” he said.", "url": "https://apnews.com/b9c529f9b68e47f789ab0c4e604676d6"}