{"authors": ["James Green", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Kate Aronoff", "Alyssa Battistoni"], "date_download": "2020-05-04 19:52:16", "date_modify": "2020-05-04 19:52:16", "date_publish": "2016-04-02 00:00:00", "description": null, "filename": "2016_04__1588621936.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2016/04/02131257/3907212018_7c3e67ea85_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_04__1588621936.html", "title": "The Price of Life", "title_page": "The Price of Life", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Some relatives of the perished miners derived a degree of satisfaction from this unprecedented verdict and punishment, even though the judge denied requests for restitution funds for the victims’ families and even though Blankenship was cleared of several felony charges. Others were less content. What Blankenship did “shouldn’t have been misdemeanor,” declared the father of one victim. “It should be a felony.”\nShe sentenced the former coal baron to a year of supervised release and fined him $250,000, a penalty that far exceeded the federal guidelines.\nOn April 6, nearly six years to the day after the lethal disaster — and just a few months after the jury found Blankenship guilty of intentionally flouting federal mine safety laws, but acquitted him of any direct responsibility for the deaths — the judge, the daughter of a coal miner, told the defendant : “You should be someone we are able to tout as a West Virginia success story,” but instead “we are here as a result of your part in a dangerous conspiracy.”\nTwenty-nine miners had died on April 5, 2010 in an explosion at Massey’s Upper Big Branch mine in Montcoal, West Virginia. This tragedy, the Mine Safety and Health Administration later concluded, was a direct result of safety violations at the mine. Faced with volleys of public condemnation, Blankenship later surrendered control of the corporation he ran for twenty-eight years and descended into retirement under a golden parachute worth $80 million.\nIn November 2015, when a federal grand jury indicted former Massey Energy CEO Donald L. Blankenship for willfully violating government safety regulations in order to maximize coal production, it suddenly seemed possible that a top corporate executive might be held accountable for miners killed on his company’s property.\nThe Coal Wars\nWhile the loss of life in the Montcoal explosion was the coal industry’s worst since 1970, the tragedy fits into a pattern of corporate malevolence going back more than a century.\nThe disaster at the Monongah mines near Fairmont, West Virginia on December 6, 1907 epitomized the industry’s antipathy for human life. After an explosion shot through the mine, the corpses of nearly four hundred men and boys — mostly immigrants — were pulled from the rubble; so many that the undertakers ran out of coffins.\nThe state’s coal operators — some of the most rapacious in the country — were backed up by elected officials who issued apologetics for deadly mine accidents. Politicians like the state’s Republican governor, who declared, “It is but the natural course of mining events that men should be killed and injured by accidents,” and coal operators like “King” Sam Dixon, the Englishman who controlled Fayette County’s mines, newspapers, and Republican officials.\nWhen two of his mines blew up in 1906, killing 135 men and boys, county coroners’ juries found “human error” at fault, even though Dixon had violated mine safety laws. It was no surprise King Sam escaped indictment: he had handpicked the jury members, largely from the ranks of coal company officials and political cronies.\nAmerican coal miners learned the hard way that they could only rely on themselves and their labor union, the United Mine Workers of America (UMW), for protection while they toiled underground. They knew they would get no help from the federal government: the Bureau of Mines, created in 1910 and controlled by leading industrialists, had no regulatory or enforcement powers of any kind.\nThe coal companies viciously fought any attempts at worker self-organization. In West Virginia, coal operators hired spies, “gun thugs,” scabs, and deputy sheriffs to crush the organizing efforts of mine workers, who wanted safer working conditions, living wages, civil liberties, freedom from company stores, and an end to rampant wage theft.\nIn 1912 and 1913, mountaineer miners fought a virtual war against their employers in an attempt to organize several thousand miners and free themselves from company tyranny. During the same two years, more than five hundred men and boys perished in West Virginia mines. Not a single coal company was charged.\nRarely did a week pass in coal country without news that a miner, or a group of miners, had been killed or trapped in a slate fall, suffocated by methane, or scorched in a firestorm. During the first six years of the twentieth century, rock falls, mine gases, train accidents, and explosions killed 1,011 men and boys in the Mountain State’s collieries, an appalling loss of life by any measure.\nBut over the next six years, the death rate doubled as more inexperienced miners joined the workforce, as more machinery appeared underground, and as foremen pressured the men to increase output. While the state’s coal production soared, more than two thousand workers perished in the mines, a mortality rate twice the national average for mine workers.\nMine company executives and state officials blamed the grim death toll in West Virginia’s collieries on careless, inexperienced miners, especially immigrants. And to be sure, these workers did suffer unusually high rates of injury and death. What these officials omitted, however, was that mining became more dangerous every year because coal operators felt compelled by competitive market forces to introduce dangerous new machinery and, at the same time, to avoid the cost of making their mines safer.\nSam Dixon’s twelve mines, for instance, produced an impressive ten thousand tons in 1906. But since the market could handle much more, the mine owner ordered his engineers to sink shafts deeper into the mountains. In his newer mines, managers replaced mules with motorized engines and installed mechanical cutting machines, which allowed for tremendous increases in productivity.\nBut these innovations also created new dangers. The deafening noise prevented the miners from hearing the sounds that preceded cave-ins, which killed far more miners than explosions. The new cutting machines also produced blinding swirls of fine coal particles that added to the volatility of the already dusty mines.\nAs they drove mines further into the mountains, Dixon and his pit bosses paid little attention to West Virginia’s mine safety laws, including the ban on working more than twenty miners in a mine with only one opening. And his workers suffered the consequences. On February 8, 1906, one of Dixon’s pit bosses sent thirty-five men to work in the Parral mine, which had just a single entrance. An explosion blasted through the mine, killing twenty-three men.\nIn the face of such lethal conditions, workers continued to agitate. In 1920, a second mine war erupted when union miners attempted to organize the rest of the state’s mines. The offensive reached a climax the following year, when more than eight thousand armed workers marched across the state and fought a four-day battle with company forces around Blair Mountain, a standoff that ended only when the US Army intervened.\nBut the uprising, the largest armed insurrection in modern American history, failed to advance the union cause. Mountain State miners suffered through more than a decade of hard times and mine disasters before New Deal labor reforms opened the gates for union organizers in 1933. In the years that followed, the UMW’s presence in West Virginia’s coalfields helped reduce mine worker deaths by one-third.\nThat pattern persists to the present. Since 1995, 330 non-union coal miners have been killed at work, compared to 88 UMW members, according to the union’s health and safety department.", "url": "https://www.jacobinmag.com/2016/04/massey-blankenship-indictment-coal-appalachia/"}