{"authors": ["Jeremy Gerlach"], "date_download": "2020-05-04 20:07:07", "date_modify": "2020-05-04 20:07:07", "date_publish": "2016-10-10 00:53:10", "description": "As the smell of corn, cattle and deep-fried grub wafted overhead on a clear Sunday afternoon, hundreds of kids, parents and other visitors romped through the South Texas Maize. The sprawling...", "filename": "_215a9987f1fe4b078de3540f13eba08c_1588622827.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_215a9987f1fe4b078de3540f13eba08c_1588622827.html", "title": "Families find unplugged Sunday fun at corn maze", "title_page": "Families find unplugged Sunday fun at corn maze", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As the smell of corn, cattle and deep-fried grub wafted overhead on a clear Sunday afternoon, hundreds of kids, parents and other visitors romped through the South Texas Maize.\nThe sprawling attraction, part of the Graff 7A Ranch near Hondo, Texas, includes the namesake corn maze, massive slides, bouncy platforms, climbing hay bales, a pumpkin patch and just about every other type of ranch-style recreation imaginable. About 45 minutes west of San Antonio on U.S. Hwy 90, the site attracts about 4,000 visitors during peak days, and is typically open each year from September through mid-November.\nFor owner Laurie Graff, who manages South Texas Maize with her husband, Ken Graff, the chance for families to detach from their phones, televisions and video games for some country-sized fun will always be the ranch’s biggest draw.\n“Even in 2016, people are hungry for unplugged entertainment,” she said. “The corn maze, the hay rides ... these are things that our patrons can’t do in their backyards or apartment balconies, and they ... certainly can’t do on their phones.”\nThe Graff 7A Ranch, run by five generations of the Graff family since the 1800s, began hosting the South Texas Maize attraction in 2001. Since then, the venue has seen steady growth over the past 15 years, Graff said. Sunday’s crowd — which came after the ranch set an attendance record Saturday with more than 8,000 visitors, had a more modest-sized attendance of about 4,500, according to staff estimates.\n“Most of our crowd typically comes over from San Antonio,” Graff said. “But we’ve got people coming from Victoria, Laredo, the Valley — from all over.”\nAt the entrance to the maze, New Braunfels parents Kristina Jenkins, 29, and Todd Jenkins, 33, were coaxing their 4-year-old son, Jacob, into the corn-filled labyrinth.\n“He couldn’t wait to get out of the car, but now he thinks he’s going to get lost in there,” laughed Kristina Jenkins, as Jacob hid behind his dad. “He wants you to go in first, Todd.”\nAs Todd Jenkins walked into the rows of stalks, veering out of sight, Jacob finally ran into the maze after him.\n“I knew we’d get him,” Kristina Jenkins said, jogging off after her kid. “He doesn’t do anything unless his dad does it first.”\nAcross the ranch, Daisie Williams, 19, was watching her younger stepsister, Meghan, 8, bounce on a massive, trampoline platform — dubbed a “corn popper” as kids bounce like hot kernels — embedded in the ground.\n“We’re from Jourdanton, so this was a huge drive for us,” Williams said. “We’ve been here before, but the corn poppers are new.”\nBoth sisters are typically active on Facebook, YouTube or Instagram on weekends, but Williams said hanging out at a ranch has been a closer way for the pair to connect.\n“Our parents just got married this year, and this is ... kind of our first family trip together,” Williams said. “Meghan is pretty cool ... so I’m glad we’re getting to do this.”\nNext to the corn poppers, dozens of visitors flocked through the ranch’s vast pumpkin patch, some pausing to pick out a future jack-o-lantern.\nGrandparents Rosie Castellanos, 51, and Jeff Garcia, 53, both from San Antonio, watched as their four, young grandchildren rummaged through the rows of gourds.\n“Everybody wants a pumpkin, but no one wants to carry it themselves,” Garcia sighed. “That’s the fastest way to convince them that they are only getting one — make them each carry one for a few hundred feet.”\nAfter the kids made their selection, Castellanos was quick to offer a solution.\n“We’ll just put it in the stroller,” she said.\nFor all the pumpkins, mazes, slides, trampolines and hay rides, Graff said the ranch might make an exception for one electronic element in the future.\n“We’ve had a couple of the dads ask about getting a flatscreen TV put in so we can check the scores of Texas A&M games,” Graff chuckled. “We’re considering it.”\njgerlach@express-news.net", "url": "https://apnews.com/215a9987f1fe4b078de3540f13eba08c"}