{"authors": ["Peter Frase", "Mike Davis", "Liza Featherstone", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis", "Mímir Kristjánsson"], "date_download": "2020-05-04 19:53:35", "date_modify": "2020-05-04 19:53:35", "date_publish": "2016-06-21 00:00:00", "description": null, "filename": "2016_06__1588622015.html", "image_url": "https://images.jacobinmag.com/2016/06/21144942/teaser.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_06__1588622015.html", "title": "Social Democracy’s Breaking Point", "title_page": "Social Democracy’s Breaking Point", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Patrick Iber and Mike Konczal have an essay at Dissent in which they use the Bernie Sanders phenomenon as an opportunity to explain the theories of Karl Polanyi, and what they mean for the future of progressive politics.\nPolanyi was a Hungarian emigré to Vienna and later England and the United States, a veteran of the interwar period that gave us the Great Depression and the rise of fascism.\nHis most famous work, The Great Transformation , was written in the 1930s and 1940s. In it, he attempted to diagnose the failures of the free-market capitalism of his time, which in his view had given rise to the reaction and war he lived through.\nHis central point, and the one which has been most influential on contemporary liberals, is that there has never been any such thing as an unfettered or natural free market.\nRather, all really existing social formations involve complex ties between people based on a variety of norms and traditions. As Iber and Konczal put it, “the economy is ’embedded’ in society — part of social relations — not apart from them.”\nFor this reason, the attempt to establish unfettered and unregulated markets is doomed: a pure free-market society is a utopian project, and impossible to realize, because people will resist the process of being turned into commodities.\nThis is an important insight, and to this point there’s not much about it that I can disagree with. The problem arises when one tries to derive a complete political strategy from this analysis. This is where I part ways with the Polanyian analysis that Iber and Konczal offer.\nThey suggest that the vision of “socialism” offered by Polanyi, and also by Bernie Sanders, ultimately just involves subjecting capitalism to some humane and democratic limits. They quote a passage in which Polanyi defines socialism as “the tendency inherent in an industrial civilization to transcend the self-regulating market by consciously subordinating it to a democratic society.”\nPolanyi does not seem to think that markets or capitalist property relations could be superseded (although the later parts of The Great Transformation introduce some ambiguity on this point). Capitalism will only be humanized and controlled. Iber and Konczal attribute something like this idea to Bernie Sanders: “people use democracy to change the rules governing our national political economy.”\nThere is a long tradition, especially associated with Leninism, that rejects this program on the grounds of “reformism.” According to this view, the Polanyi perspective is inadequate because it embraces reforms that ameliorate capitalism.\nThis is taken to be a distraction from the need to build a revolutionary force that can seize state power, overthrow the ruling class, and reconstruct property relations. This is a perspective that Iber and Konczal quickly dismiss: a traditionally Marxist idea of having the state seize the means of production which, they say, has been abandoned even by most who identify as socialists.\nI consider myself a socialist and a Marxist, although a questionably “traditional” one. My objection to the Polanyian analysis is somewhat different, however, from the one Iber and Konczal adduce.\nI am very much a “reformist” in the sense that my day-to-day politics involves working for things like universal health care or stronger unions or a less corrupt local government. (This, it should be noted, was also true of many historical communist militants, even if they looked forward to the seizure of power as their horizon.) Where I part company with the Polanyian left — and in some ways, also the traditional Marxist left — is in where I think such struggles ultimately lead.\nSome time ago, I wrote a bit about the way Polanyian ideas influence advocates and defenders of the welfare state. In response to sociologist Daniel Zamora’s attack on the theory of Michel Foucault, I noted that for many left critics of neoliberal capitalism, the project of the Left is conceived in Polanyian terms, and is therefore limited to the struggle to cushion workers from the vagaries of the market, while leaving the basic institutions of private property and wage labor in place.\nThus there can be nothing beyond a welfare state that protects the working class from the workings of an unfettered market.\nThere are two distinct objections that I would raise against this project. One is basically normative: a world of somewhat humanized wage labor isn’t the one I want to live in, even if it would be better than the one we live in now.\nThis is rooted in the anti-work socialist tradition, which insists that the ultimate goal of socialist politics isn’t to make wage labor nicer, but to abolish it altogether. Since I’ve written extensively about that elsewhere, I won’t repeat those arguments here.\nThe second objection has to do with the long-term viability of Polanyian welfare capitalism as an equilibrium within capitalism. The fundamental distinction I would make, between Marxist and Polanyian social democracy, does not have to do with debates over reform or revolution.\nIn other words, I accept the proposition that in the near term, the socialist project unfolds through incremental struggles that win material gains for workers, within the context of capitalism.\nBut the end point of Polanyi’s socialism is really the regime that the theorist of the welfare state, Gøsta Esping-Andersen, called welfare capitalism.\nThat is, it is still a society in which the means of production are privately controlled by a small elite, and most people must sell their labor to survive. It differs from unfettered capitalism because of the presence of things like unions, regulations, and social safety-net programs, which partially — but never totally — decommodify labor.\nIt is at this point that we discover the divide between the Polanyian perspective and the Marxist alternative I’m proposing. It all turns on the question of whether this regime is viable.\nWhat is viability? A concise definition comes from the sociologist Erik Olin Wright — who comes from a Marxist background, but whose work has strong Polanyian overtones.\nHe has worked extensively on defining “real utopias” that could be offered as alternatives to the present system. He argues that any such utopias must satisfy three criteria: desirability, achievability, and viability. The first two are what they sound like: is this where we want to go, and can we get there?\nAs noted above, I think the Polanyian vision is somewhat lacking in terms of desirability. But it would still be a step forward.\nAnd on the question of achievability, I have no real quibbles: I support reformist struggles for the welfare state because I view them as achievable, compared to the alternative strategies of building an insurrectionary communist party, or writing sectarian polemics and waiting for capitalism to collapse on its own.\nViability is where all the problems arise. Wright defines the viability question as follows: If we could create this alternative, would we be able to stay there or would it have such unintended consequences and self-destructive dynamics that it would not be sustainable?\nRecall the definition of Polanyian socialism as the situation in which people use democracy to change the rules governing our national political economy.\nIs that a stable equilibrium, acceptable to both capitalists and workers? Or is it an inherently unstable situation, one which must break toward either the expropriation of the capitalist class, or the restoration of ruling-class power?\nUnlike the Polanyians, I think the welfare state is, in Wright’s terms, not viable. Unlike Wright, however, I do not think that this invalidates it as a goal. Rather, I think that socialist politics is inevitably a task of building the crisis.\nAnd the great tragedy of postwar socialism was the perverse division of political labor it gave rise to, between revolutionaries who refused to engage with reformist politics, and reformists who were unable or unwilling to deal with the crisis that their victories inevitably produced.\nSo, what makes social democracy non-viable as a stable system? For this, we need to turn to the Polish economist Michal Kalecki, and his famous 1943 essay “Political Aspects of Full Employment.”\nThe core insight of that essay is that economic struggles between workers and bosses are ultimately not about the size of the wage, or the stability of employment, or the generosity of benefits. They are about power.\nIt is possible to construct arguments showing that putting unemployed workers back to work would be good for capitalists too, in the sense that it would lead to faster growth and more profits.\nBut as Chris Maisano explains in his exegesis of Kalecki, the biggest barriers to the maintenance of full employment are primarily political in nature, not economic.\nThis is because in a situation of low unemployment, workers are less afraid of what Kalecki called the “power of the sack.” As they become less afraid of the boss, they begin to demand more and more of the capitalists.\nUnions and social-democratic parties strengthen; wildcat strikes proliferate. Eventually this dynamic calls into question not just profits, but the underlying property relations of capitalism itself.\nWelfare capitalism thus reaches what we could call the “Kalecki point,” where its viability has been fatally undermined.\nIn that situation, employers become willing to take drastic action to get workers back into line, even at the expense of short-term profitability.\nThis takes many forms, including state-led attacks on unions and the refusal of capitalists to invest, a “capital strike” in which money is moved overseas or simply left in the bank, as a way of breaking the power of the working class.\nDavid Harvey, in his Brief History of Neoliberalism , essentially portrays the right-wing turn of the 1980s as a reactionary resolution of this crisis: a move away from the Kalecki point that entailed a restoration of capitalist class power rather than a leap into socialism.\nJonah Birch provides a useful case study of France’s Mitterrand government during this period, which pushed the boundaries of the social-democratic compromise and was finally forced back by the power of capital.\nThe failure of the Rehn-Meidner plan, which was essentially a gradualist scheme to socialize the means of production in Sweden, provides a similar example.\nSo far I’ve argued that the social-democratic class compromise is inherently non-viable, and tends toward conflict and crisis. But another way to look at it is that welfare capitalism can be made viable, but only in a way that subverts its socialist promise.\nThis is because the “power of the sack” can be reconfigured into other kinds of disciplinary power, depending on the nature of the particular welfare-capitalist regime we’re talking about.\nRecently, I discovered (via Mariame Kaba), the work of Elizabeth Hinton. Hinton’s work focuses on Lyndon Johnson’s 1960s “Great Society” expansion of the welfare state, and its connection to the construction of the carceral state — the rise of mass incarceration and militarized policing.\nShe shows that while the Great Society was expanding access to things like income support and health care, a simultaneous “War on Crime” was subjecting the poor, and especially the black poor, to increased surveillance and state repression.\nHer analysis indicates that this was not an accidental juxtaposition, but part of a cohesive reconstruction of the relationship between the state and the working class.\nThis is easily comprehensible in terms of the contradictory nature of the welfare state and the problem of the Kalecki point. Without the welfare state, workers are disciplined by the power of the sack — or, in situations where workers are sufficiently organized and cohesive to resist the boss anyway, by private militias.\nIn the era of the welfare state, however, the partial decommodification of labor creates a great danger to capital, because it enhances the autonomy of workers, whether employed or not, to make demands on capital and the state.\nIt was just this recognition that drove organizers like Frances Fox Piven and Richard Cloward to organize welfare recipients in the late 1960s.\nPolice violence, drug wars, mass incarceration, onerous requirements on benefit recipients: these are all ways of disciplining the worker in the era of the welfare state, in the absence of the power of the sack.\nThis also means that struggles against police oppression and incarceration are not parallel or ancillary to class struggle and the movement for socialism, but are fundamental to it: they attack the disciplinary regime that maintains the stability of our particular regime of capital accumulation.\nFor the the more Polanyi-ish, and Pollyana-ish, it’s possible for us all to get along in a world where workers have comfortable lives and the bosses still make money. That’s the vision that seems to animate Iber and Konczal’s explainer.\nThe alternative Marxist argument is that capitalism is defined by the power struggle between workers and capital, and the Polanyian version of socialism attempts to elide that contradiction in favor of a vision of harmonious coexistence.\nWhere this vision fails is not in the short term but in the long run. It leaves the Left ill-equipped to address the inevitable crises that a successful reformist program generates, and I would argue that the belief in the possibility of permanent class compromise contributed to the defeat of the Left and the victory of neoliberalism.\nSo the problem isn’t that we can’t win reformist victories for workers. History has shown that we can. The problem is what comes after victory, and we need a theory of socialism and social democracy that prepares our movements for that phase.", "url": "https://www.jacobinmag.com/2016/06/social-democracy-polanyi-great-transformation-welfare-state/"}