{"authors": ["Lily Geismer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 20:00:03", "date_modify": "2020-05-04 20:00:03", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_11_bill-clinton-poverty-tour-hillary-new-markets_1588622403.html", "image_url": "https://images.jacobinmag.com/2016/10/17231514/BN-BS704_hillar_P_20140228151001-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_11_bill-clinton-poverty-tour-hillary-new-markets_1588622403.html", "title": "The Places Left Behind", "title_page": "The Places Left Behind", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOn July 5, 1999, Bill Clinton sat on the porch of a dilapidated rental home in Tyner, Kentucky, the first stop on a four-day, nationwide tour. As he crisscrossed the country over the next few days, Clinton touched down in places with some of the highest rates of unemployment and persistent poverty in the US: Clarksdale, Mississippi; East St Louis; the Pine Ridge Reservation in South Dakota; South Phoenix, Arizona; and Watts, California. These sites couldn’t have been more different from Silicon Valley and Wall Street, Clinton’s usual stops on his jaunts around the country extolling the New Economy and his administration’s pro-growth agenda. And that was the point. As Clinton explained to audiences along the way: “I am making this tour of America for one simple reason: I want everybody in America to know that while our country has been blessed with this economic recovery, not all Americans have been blessed by it.” Clinton’s trip prompted immediate comparisons to Lyndon Johnson’s tour of Appalachia in 1964 to build support for the War on Poverty and Robert Kennedy’s high-profile visits to Kentucky, Mississippi, Pine Ridge, and several urban areas in the mid-1960s. But while Clinton traversed much of the same ground as his Democratic predecessors, his larger purpose diverged in significant ways. The tour’s aim wasn’t to expose the problems of the “Other America,” but to draw attention to these places’ potential as “New Markets.” The administration saw the trip as akin to its overseas trade missions, orchestrated to explore investment opportunities in emerging markets like China and the Balkans, with corporate executives in tow. For his domestic tour, Clinton invited CEOs and representatives of several major corporations and financial institutions including Bank of America, Citigroup, and Fannie Mae, as well as several cabinet secretaries, members of Congress, and figures like Jesse Jackson and Democratic Leadership Council founder Al From. “We came here in the hope that with the help of the business leaders here,” Clinton told an audience in Appalachia, “we could say to every corporate leader in America: take a look at investing in rural and inner-city America. It’s good for business, good for America’s growth, and it’s the right thing to do.” Clinton’s tour proved a legislative success, building support for his New Markets program. Before he left office, Congress passed a series of tax incentives and investment loans to encourage corporate and venture capital funds to flow into areas “left behind” in the New Economy. In the years since Clinton’s departure, the program has gotten relatively little attention. This election season, it’s his anti-crime initiatives and trade policies that have received the bulk of scrutiny — and from which Hillary Clinton has distanced herself. She’s done no such thing, however, for the New Markets initiative. She’s embraced both the program and much of the neoliberal vision that underpinned it. And that’s why — despite flying under the radar — the New Markets program is worthy of renewed attention. Few initiatives better crystallize the Clintons’ and other New Democrats’ “Third Way” faith in markets and the private sector to solve poverty and economic inequality.\nThe New Markets initiative sprung from a variety of disparate sources. The first was Harvard Business School professor Michael Porter’s influential 1995 article “The Competitive Advantage of the Inner City.” Porter argued that “[i]nner cities hold untapped potential for profitable businesses” due to their “competitive advantages”: central location, an underemployed labor pool, and particularly an underserved market for retail, as well as financial and other personal services. A more unlikely source was Jesse Jackson, who just a decade earlier had run for president on a staunchly social-democratic platform. In the mid-1990s, the longtime activist had turned his attention to urban and rural communities’ lack of access to capital. In April 1998, Jackson launched a campaign called “Close the Gaps. Leave No American Behind” in Appalachian Ohio. The next month he met with Clinton and encouraged him to make the same effort to channel economic resources to distressed communities in the US that the federal government was pursuing in its international development policy. In early June 1998, Gene Sperling, then the director of the National Economic Council, convened a task force of representatives from a range of agencies to consider whether there was more the government could do “to act as a catalyst for greater private sector economic activity in America’s untapped markets.” The group developed a set of legislative proposals that sought to leverage $15 billion in private sector investment. The centerpiece was the New Markets Tax Credit (NMTC), which offered a write-off worth up to 39 percent to corporations, venture funds, and community development banks that invested in businesses like shopping centers, factories, retail stores, and technology firms in places where the individual poverty rate reached at least 20 percent. The group also devised a program to fund several community development venture capital companies in low- and moderate-income communities through government loan debt guarantees. Earning bipartisan support, the program eventually passed with modifications as part of the Community Renewal Tax Relief Act of 2000 and was signed into law on December 21, 2000 as one of Clinton’s final acts in office. The new law, the outgoing president proclaimed, represented “the most significant effort ever to help hard-pressed communities lift themselves up through private investment and entrepreneurship.” The overall program embodied Clinton’s view of the government’s role: to serve not as a source of direct services or even funding, but as a catalyst for private sector growth. “It’s the perfect embodiment of the ‘Third Way’ philosophy,” Clinton explained. “It’s not government alone, it’s not private sector alone, but it’s a partnership.” And an uneven one at that. The private sector would assume the dominant role in this partnership, with very meager allocations for social services. While Clinton’s programs promised to bring capital reinvestment and job opportunities to areas that for decades had been abandoned, they simultaneously reinforced the notion that retail opportunities and access to credit — rather than more social services and government funding — would solve the problems that beset distressed communities and their residents. The New Markets program also rested on the notion that the market and private investment would integrate these spaces both economically and socially back into the broader nation. Yet by routinely identifying them as “pockets of poverty” or “places left behind by the new economy,” the Clinton administration positioned locations like Appalachian Kentucky as distinct, isolated, and anomalous in the otherwise-roaring economy. Clinton and his advisers never considered the possibility that the acute distress of these communities might point to a fundamental flaw in their macroeconomic policy and the New Economy’s dependency on the service, financial, and technology sectors. Nor did they discuss how the forces of corporate globalization — which they themselves championed — had decimated many of the places they were trying to help. Instead, Clinton advanced the idea that the “places left behind” could push the economic boom of the 1990s to new heights. As he explained in a speech in a Walgreens parking lot in East St Louis, investing in underserved communities could boost economic prosperity for the entire nation. “I say to myself every day when I get up, now what can I do to keep this going?” he told those assembled, referencing the expanding economy. “The only way to keep it going — more growth with no inflation; more jobs and higher wages without bringing it to a halt — is to have new people working, and new people buying.” Unlike JFK’s mantra that “a rising tide lifts all boats,” Clinton held that spending at the bottom of the ocean would keep the yachts at sea level afloat. In Watts, Clinton was even more explicit about the beneficiaries of this model of upward redistribution: “Every time we hire a young person off the street in Watts and give him or her a better future, we are helping people who live in the ritziest suburb in America to continue to enjoy a rising stock market.” While such spin might have made the New Markets program more palatable to wealthy suburbanites and congressional Republicans, the comments also demonstrated how dependent Clinton’s anti-poverty strategy was on the tools and mechanisms of the New Economy. Even one of the New Economy’s main champions voiced doubts. In a memo to the president, Treasury Secretary Larry Summers warned: “[T]he real test of what we are doing with the New Markets Initiative will be whether we can sustain the flow of capital and the business connections that are now being made when the next downturn comes.” Clinton never grappled with that observation, at least not publicly. But it has proven quite prescient.\nThe Great Recession threw into sharp relief the limitations of Clinton’s market-based scheme. Because his New Markets program didn’t mandate that corporations remain in unprofitable areas, many closed their factories, service centers, and franchises when the downturn came. Left to rely on the vagaries of the market, many resource-starved communities have continued to be just that. Even worse, these programs’ fixation on profitability led several companies and banks to recognize the exploitative potential of low-income areas. The supposed saviors of struggling residents instead ensnared them in a web of predatory loans, foreclosures, and credit card debt. The rise in mass incarceration and the loss of social services — which Clinton frequently promised market forces would replace — piled on still more hardship. Many of the places Clinton visited during his New Markets tour have been the hardest hit by this unforgiving onslaught. In East St Louis, for example, the foreclosure crisis devastated the city, causing significant budgetary woes that resulted in sharp cuts to public services. By 2013, the city suffered from the nation’s highest per-capita murder rate and had come to serve not as a model, but a cautionary tale. Despite this track record, however, the NMTC continues to receive support, both in Washington and on Wall Street. Several leading firms and funds have taken advantage of the tax credit to invest in charter schools and other projects located in underserved areas, eager to pay less taxes at the same time they line their own pockets. What’s less clear is what the capital that has stuck around is doing to improve the lives of children and their families in poor communities. If anything, the program has contributed to the economy’s uneven recovery, which has restored the fortunes of Wall Street and left the people of Appalachia, East St Louis, and Pine Ridge out in the cold.", "url": "https://www.jacobinmag.com/2016/11/bill-clinton-poverty-tour-hillary-new-markets"}