{"authors": ["Nicole E. Rogers For The State Journal"], "date_download": "2020-05-04 20:12:28", "date_modify": "2020-05-04 20:12:28", "date_publish": "2016-11-11 11:00:00", "description": "When Lady Mary Crawley found herself in bed with a dead Turkish houseguest, it seemed her respectable life might be over. With the help of some trusted servants and a bit of luck, she...", "filename": "_741892c6cc2e4b8b9c5fdccd96f37735_1588623148.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_741892c6cc2e4b8b9c5fdccd96f37735_1588623148.html", "title": "Dockery's latest role far cry from 'Downton Abbey'", "title_page": "What to watch this week: Dockery's latest role far cry from 'Downton Abbey'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When Lady Mary Crawley found herself in bed with a dead Turkish houseguest, it seemed her respectable life might be over.\nWith the help of some trusted servants and a bit of luck, she manages to keep her secret shame hidden ... for a while, anyway. Guilt, circumstance, and the relentless eavesdropping in the Crawley household forces a slow confession of her indiscretion that relieves her conscience, saves her reputation and, most importantly, maintains the respectability of the family name.\nThings turned out all right for Lady Mary, if you recall.\nFor Letty Raines, on the other hand, it’s not so clear.\nLetty is the down-on-her-luck anti-heroine of “Good Behavior,” premiering Tuesday on TNT. Lady Mary, of course, is the well-to-do countess-in-waiting of “Downton Abbey,” which wrapped its six-season run earlier this year.\nBoth are played by Michelle Dockery, whose clipped, high-borne accent of English society has been traded for the mutable intonations of a practiced thief. The only refined life to which Dockery’s latest character is exposed is that of her unlucky victims as she pilfers their belongings from their expensive hotel rooms.\nReleased from prison for the titular good behavior, and trying to maintain an honorable life — at least when it comes to booze, drugs, and the appearance of propriety — Letty finds herself at an ethical crossroads when she overhears one of her marks making a deal for a hired assassination. Her newfound conscience propels her to do what she can to stop the hit, but old habits are what they are, and Letty finds herself in a sticky and dangerous situation.\nThe curiosity of a figure so familiar as a good and righteous person, Lady Mary Crawley, crumpled on the floor of a seedy motel room in a haze of drugs and regret — she left a son behind when she was sent to prison, and her mother won’t let her near him now — is enough to warrant “Good Behavior” at least a first look.\nBut Dockery’s deftness with a truly conflicted and broken woman who is finding few allies along her rocky road to redemption is reason to stick around for another episode. Her self-assuredness when she dons a disguise to pull off a job only makes her inability to keep her real self together that much more maddening: Why not just pretend to be the person you want to be, and maybe it’ll stick? She listens to self-affirming empowerment lectures, but something seems to get derailed when Letty is deciding to be the best Letty she can be.\nTerry Kinney (“Oz”) plays Christian, her parole officer, a kind, honest recovering alcoholic and role model who knows a little something about falls from grace and the one person who seems to think Letty has what it takes not to end up back in prison. Her recent behavior, though, might suggest otherwise. “Good Behavior” premieres at 8 p.m. Tuesday with two episodes on TNT.\nOh, it’s “Magic”: Billed as “magic meets documentary,” ABC’s “David Blaine: Beyond Magic” aims to be his “most revealing performance yet.” In the hour-long special, Blaine — who has been encased in a block of ice, submerged underwater while in a plastic case, stranded atop a 100-foot pedestal, enclosed in a sphere of water, suspended upside down, enclosed in a transparent box strung up above the Thames River, and strapped into a rotating gyroscope, all of which are not so much magical feats as they are tests of endurance — will shock and amaze the likes of Johnny Depp, Margot Robbie, Drake, Patrick Stewart, Steph Curry, Emma Stone, David Beckham and other celebs. Blaine’s specials are unique in that the camera is turned on the viewer’s reaction, rather than the illusionist’s performance, playing with the idea of just who is doing the performing. In the case of his A-list audiences, the unrehearsed and unscripted reactions are the real show. “David Blaine: Beyond Magic” airs at 9 p.m. Tuesday on Ch. 27.\nRead the book, see the movie ...: “Shooter,” a new USA drama based on the Stephen Hunter novel, “Point of Impact,” and the Mark Wahlberg movie of the same name, stars Ryan Phillippe as Bob Lee Swagger, a decorated marksman drawn out of exile to foil a plot to kill the president. The plan doesn’t go smoothly, and Swagger realizes he has been set up, and his family is in danger. Omar Epps stars as Swagger’s one-time commanding officer, now a Secret Service agent. “Shooter” premieres at 9 p.m. Tuesday on USA.", "url": "https://apnews.com/741892c6cc2e4b8b9c5fdccd96f37735"}