{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:23:49", "date_modify": "2020-05-04 20:23:49", "date_publish": "2016-11-25 16:56:26", "description": "David Weekley Homes has been delivering customer satisfaction for 40 years with quality homes and open floor plans that suit the needs of buyers. Now, home buyers can live in the...", "filename": "_edea506699f84e958c4a7cc3cfcd59c8_1588623829.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_edea506699f84e958c4a7cc3cfcd59c8_1588623829.html", "title": "David Weekley Homes: Cane Island in Katy offers diverse styles", "title_page": "David Weekley Homes: Cane Island in Katy offers diverse styles", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "David Weekley Homes has been delivering customer satisfaction for 40 years with quality homes and open floor plans that suit the needs of buyers.\nNow, home buyers can live in the award-winning, master-planned community of Cane Island in Katy. David Weekley Homes builds in the three sections of Deer Creek, Oak Pointe and The Trails, which combine the best of small-town charm and big-city amenities. The sections have a variety of options to suit buyers’ needs - diverse architectural styles and floor plans, patio homes and 65-foot homesites.\nThis community has something for everyone, including a showcase home that is ready for immediate move-in. Located at 6922 Harvest Lane in Cane Island - Oak Pointe, The Broadstone is a one-story, three-bedroom home consisting of 3½ baths and a four-car garage. Priced at $460,000, this home features more than 3,200 feet of living space with an open-concept floor plan, including kitchen with granite countertops, and an owner’s bath with soaking tub and shower.\nBuyers can imagine celebrating the holidays in their new home in Cane Island - Oak Pointe. The Grimes, located at 2206 Karankawa Trail and ready now, can make that dream a reality. This one-story, three-bedroom home with 3½ baths and a two-car garage is priced at $449,543 and features 2,900 feet of living space. Situated on a 65-foot homesite, homeowners can enjoy the two porches, the rotunda off of the foyer, owner’s bath and walk-in closet.\nFor more information about David Weekley Homes in Cane Island, call 800-758-3238 or visit one of the fully-furnished model homes open daily for tours.", "url": "https://apnews.com/edea506699f84e958c4a7cc3cfcd59c8"}