{"authors": ["Carisa Cegavske"], "date_download": "2020-05-04 20:06:29", "date_modify": "2020-05-04 20:06:29", "date_publish": "2016-11-26 18:13:00", "description": "About 500,000 acres could be preserved as wilderness if the proposed Crater Lake Wilderness becomes reality. Creating a new wilderness area requires an act of Congress, and no new...", "filename": "_9f7a4950132f4e218005981039c3c4b1_1588622789.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9f7a4950132f4e218005981039c3c4b1_1588622789.html", "title": "Wilderness area proponents hope to preserve forests, rivers", "title_page": "Wilderness area proponents hope to preserve forests, rivers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "About 500,000 acres could be preserved as wilderness if the proposed Crater Lake Wilderness becomes reality.\nCreating a new wilderness area requires an act of Congress, and no new legislation has been drafted to make that happen, yet. Wilderness advocates said U.S. Sens. Ron Wyden and Jeff Merkley and U.S. Rep. Earl Blumenauer, D-Portland, have expressed interest. Representatives of the Crater Lake Wilderness campaign handed 37,000 signatures from supporters to Wyden this week.\nThe local environmental nonprofit Umpqua Watersheds is one of the architects of the proposal along with Portland-based Oregon Wild. Campaign members told The News-Review editorial board this week that they were looking to protect virgin, old-growth forest in roadless areas, along with the forests of Crater Lake National Park itself.\nA wilderness designation would prevent new roads from being built and new areas being opened up to wheeled traffic. Wilderness areas are open to public use, but people must visit them on foot or on the back of an animal. Horses, mules, even llamas will do. Bicycles aren’t allowed. Neither are snowmobiles or ATVs or cars.\nAbout a third of the land proposed for wilderness designation is within the borders of Crater Lake National Park itself. Other portions of the wilderness proposal would connect existing wilderness areas including Mount Thielsen Wilderness and Sky Lakes Wilderness into a 90-mile corridor along the southern Cascades. Small, separate areas considered ecologically sensitive would also be carved out, and additional land adjacent to the Boulder Creek and Rogue-Umpqua Divide Wilderness areas would be added.\n“Old growth forest is what we’re talking about here, ancient forest. We want to see the small percent that’s left protected,” said Bob Hoehne of the Crater Lake Wilderness campaign.\nHoehne said wilderness advocates also want to protect the headwaters of the South Umpqua, Rogue, Deschutes and Klamath rivers. And they want to protect drinking water and keep streams cool enough to save the spring Chinook salmon on the South Umpqua River from extinction.\nPerhaps the most controversial part of the proposal involves land near Diamond Lake Resort. The proposed wilderness surrounds Diamond Lake, but leaves a buffer up to a mile wide around it.\nThat’s not enough, according to Diamond Lake Resort Marketing Director John Jonesburg, who believes the resort would ultimately have to shut down if the wilderness proposal passes. Most of his customers want to ride bicycles and snowmobiles and enjoy other activities that aren’t allowed in wilderness areas, he said.\nCheyanne Rico, Crater Lake Wilderness campaign coordinator for Umpqua Watersheds, points to red lines on the proposed wilderness map showing the snowmobile trails — about 865 miles of them — that would not be affected. She said wilderness advocates hoped to negotiate with Diamond Lake Resort to ensure they weren’t including popular areas for snowmobiling and other motorized activity within the proposed wilderness boundaries, and said they were surprised when the lines of communication were abruptly cut.\nJonesburg said he doesn’t trust that those red lines will remain. He fears that once the wilderness proposal gains federal approval, something he believes is sure to happen, wilderness advocates will want to add to the area they’ve secured. He worries that once Diamond Lake is the center of a wilderness area, one day environmentalists will turn around and ask why motorboats are allowed on the lake.\n“They don’t have a good track record. The environmentalists just take, take and take and then the people that want multiple use just don’t get to use it anymore,” he said.\nThe resort is now represented by a Douglas Timber Operators attorney and has been instructed to break off all communications with the wilderness advocates, Jonesburg said.\nDouglas Timber Operators Executive Director Bob Ragon said a wilderness designation is just too restrictive.\n“To propose a wilderness area of that magnitude in that area just seems to be counter to what we’re looking for and that is recreational opportunities, managing the forest to minimize fire and all that kind of stuff. It just flies in the face of how we can use our national forests,” Ragon said.\nRagon’s point of view has won agreement from groups ranging from hunting and snowmobiling associations to the Roseburg Area Chamber of Commerce, to the Douglas, Jackson and Klamath County boards of commissioners.\nA resolution opposing the wilderness designation, drafted by Douglas Timber Operators, was passed in November by the Douglas County commissioners in hopes of swaying Oregon’s Congressional delegation against the plan.\nThe primary concern raised in that document is that a forest fire that started in a wilderness area, or the park, would be allowed to burn and could spread to campgrounds, summer cabins and lodges.\nRico said there’s a common myth that fires can’t be fought in designated wilderness areas. It can, she said, with modified techniques and even with motorized and mechanized equipment with special permits. Rico said one reason for the buffer around Diamond Lake is to allow for fuel reduction and other firewise activities that would protect the lodge and private cabins from a forest fire.\nHoehne added that old growth forests withstand fire better than do timber plantations that have been repeatedly harvested over the years.\nCrater Lake Wilderness advocates say they don’t want to limit recreational activities already happening in the area, and that it’s only the undeveloped areas that qualify for wilderness protection. Hoehne, who frequently brings his own motorboat to Diamond Lake, said he has no interest in preventing others from bringing their boats too.\nHoehne said many of the areas covered by the wilderness proposal are the headwaters of creeks and rivers where the coldest, clearest water pours into creeks, starting its journey from the mountain to the sea. Those cold temperatures are important to the salmon who spawn there, most notably the spring Chinook. Building roads in those areas would damage that watershed, he said, and the fish.\n“We could be losing one of the icons, the spring salmon run, on the South Umpqua River on our watch. They could go extinct,” he said.\nWilderness proponents argue designated wilderness areas can be a boon to the economy. Studies from the Center for Western Priorities and Headwaters Economics suggest that wilderness can give nearby communities an economic advantage, both by boosting tourism and by encouraging retirees and businesses to relocate to an area, bringing money with them.\nCrater Lake Wilderness supporter Susan Applegate said she believes the wilderness designation would also help, not harm, the Diamond Lake Resort’s bottom line.\n“People seek an element of wild. They want to be in remote areas. They want to be closer to not just a facsimile of nature but in the middle of it itself,” she said.", "url": "https://apnews.com/9f7a4950132f4e218005981039c3c4b1"}