{"authors": ["Rod Boshart Journal Des Moines Bureau"], "date_download": "2020-05-04 20:20:44", "date_modify": "2020-05-04 20:20:44", "date_publish": "2016-09-06 22:28:00", "description": "DES MOINES | Look for an Iowa history class coming to an elementary school near you if it's not there already. That's the message Tuesday from Gov. Terry Branstad - one of Iowa's leading...", "filename": "_c1975c17640d4f48a4595e665d225c73_1588623644.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c1975c17640d4f48a4595e665d225c73_1588623644.html", "title": "New school emphasis planned for Iowa history", "title_page": "New school emphasis planned for Iowa history", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DES MOINES | Look for an Iowa history class coming to an elementary school near you if it’s not there already.\nThat’s the message Tuesday from Gov. Terry Branstad - one of Iowa’s leading history buffs - and members of an advisory panel who recommend making an Iowa history requirement that’s already in the state’s administrative code but not being enforced part of a new social studies standard in classrooms.\n“I believe the emphasis on our state’s history needs to be a priority in our classrooms,” Branstad told his weekly news conference held at the Jackson Elementary School on Des Moines’ southeast side. “We do have a proud history and heritage and we want to preserve that history and heritage so that future generations will know the wonderful things that Iowans have done throughout our history.”\nAn Iowa History Advisory Council the governor established last year found that 53 percent of about 600 Iowa educators and stakeholders who responded to a survey indicated they are not including Iowa history in social studies classes, although it is required by state administrative rule. Council facilitator Stephanie Wager of the Iowa Department of Education added that about one-fourth of the educators surveyed weren’t offered an Iowa history class when they were elementary students.\n“This Iowa history problem is not just one for those who care passionately about the subject. It is a problem for all Iowans. Knowing about your community and your state helps make you a better citizen in your community,” said Wager, who participated in Tuesday’s news conference. “Preparing students to be good citizens is the original purpose of public education.”\nWager and Branstad said they expect that new social studies standards being released this fall for public comment will incorporate the requirement. She said Iowa code currently requires schools to teach history sometime between first grade and sixth grade, but state officials haven’t been enforcing the requirement.\n“It’s a difficult thing to have accountability around,” said Wager, who noted the Iowa history unit if “suggested” by the department but added there is a “lack of communications” regarding the requirement that is in the Iowa code but not in the state’s educational standards.\nThe advisory council -- made up of a student, teachers, college professors, as well as members representing a wide range of history organizations - recommended the state develop recognition programs to celebrate Iowa history and awards that recognize outstanding Iowa history teaching.\nOther proposals called for developing online Iowa history courses for high school and college students as well as K-12 social studies teachers; creating a variety of Iowa history curriculum materials that support new Iowa history standards and promote best practices in the teaching and learning of state and local history, and encouraging Iowa public and private colleges and universities to offer Iowa history classes and create professorships whose focus is Iowa history.\nThe new recommendations coincide with a $100,000 grant the Library of Congress recently awarded the Iowa Department of Cultural Affairs in order to digitize primary source materials from both the Library of Congress and the State Historical Museum of Iowa. Department Director Mary Cownie said the project will focus on a range of topics in Iowa history, including the Underground Railroad, Herbert Hoover and Iowa’s peacemaking role in the Cold War.\nThe full report can be found on the Iowa Department of Education’s website.", "url": "https://apnews.com/c1975c17640d4f48a4595e665d225c73"}