{"authors": ["Shannon Tompkins"], "date_download": "2020-05-04 20:31:31", "date_modify": "2020-05-04 20:31:31", "date_publish": "2016-10-27 00:23:00", "description": "Texas' Rolling Plains, a mosaic of mostly grasslands peppered with mesquite and other modest trees, in no way resembles the scenic, verdant, rocky hills of Greece. And the Rolling Plains'...", "filename": "_94947403bbc647eab8edea0d7a61d5ff_1588624291.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_94947403bbc647eab8edea0d7a61d5ff_1588624291.html", "title": "Texas' quail population drought is over", "title_page": "Texas' quail population drought is over", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Texas’ Rolling Plains, a mosaic of mostly grasslands peppered with mesquite and other modest trees, in no way resembles the scenic, verdant, rocky hills of Greece.\nAnd the Rolling Plains’ fist-size, ground-dwelling bobwhite quail, looking like feathered, upside-down light bulbs with stubby legs, are not likely to be mistaken for the huge, colorful, soaring phoenix of Greek mythology.\nBut there are connections to be made between the two. Rolling Plains quail, like the mythic phoenix, have risen from the ashes of a fire that all but consumed them. And so have quail in a couple of other regions of Texas.\n“It’s been a long time - decades, in some cases - since we’ve had as many quail in some parts of Texas as we have this year,” said Robert Perez, upland game bird program leader for Texas Parks and Wildlife Department. “The numbers from some areas are the highest we’ve seen since the department began conducting standardized surveys in 1978.”\nNumbers game\nThis is welcomed news, especially to Texas quail hunters. Their numbers, like those of the explosive, challenging and oh-so-delicious quail they pursue, had shrivelled to just a shadow of the legions that had headed afield each autumn, braces of pointers zigzagging ahead of them. But Texas’ 2016-17 statewide quail hunting season, which opens Saturday and runs through Feb. 26, is expected to attract as many as 100,000 wingshooters, five times more than just four seasons ago.\nRain’s a major factor behind the recent resurrection of quail in much of the state, just as a lack of rain played a large role in driving quail numbers down in those same regions.\nTexas’ statewide quail population - bobwhite and scaled or “blue” quail - has been declining for decades.\nThe most dramatic decline occurred in the eastern half of the state, where changing land use destroyed much of the complex mix of grasslands and brush habitats that part of the state’s native bobwhites require or so fragmented them that they could not support self-sustaining populations. Regions such as East Texas’ Pineywoods, the Oak Savannah to its west and Central Texas’ Edwards Plateau saw their once thriving bobwhite populations almost wholly evaporate over the past 50 years.\nBut areas where large amounts of suitable quail habitat, primarily native grasslands mixed with brush, remained - the Rolling Plains, South Texas, portions of the coastal prairie and Trans-Pecos - quail held their own, their numbers bouncing up and down with annual changes in habitat conditions.\nThat dramatically changed with a decade of drought and blisteringly hot summers that settled over most of Texas, peaking with the record-setting drought/heat of 2011. Quail habitat withered, and with it the grassland cover the birds require for nesting cover, the insects and seeds and young greenery on which they feed and the brush and thick grasses they use to hide from the predators that constantly hunt them. The reduced nesting cover made nests more vulnerable to predation. The lack of ground moisture, crucial for temperature control during egg incubation, further reduced nesting success. The nesting season window narrowed. And even when hens did successfully hatch a clutch, the lack of insects and other forage, plus the much reduced escape cover, meant few of those chicks would survive to adults.\n“From 2010 to 2013, quail and quail hunters really tanked,” Perez said.\nEach August since 1978, TPWD wildlife staff have conducted standardized quail surveys along randomly selected, 20-mile roadside survey lines in most of the ecological regions of Texas. The surveys, which include birds observed and heard, give managers an index of that year’s quail population - an index that can be compared with the long-term averages, giving managers crucial insight into population trends.\nStunning drop\nIn 2013, the quail index - the average number of bobwhite quail observed along the dozens of 20-mile sample lines - for the Rolling Plains region of northwest-Central Texas was 2.8 birds. The long-term average was 20.9. The population index that year was just 10 percent of average. No one had ever seen quail numbers drop so low.\nIt was much the same in South Texas’ brush country, the state’s other major quail stronghold. In 2013, the bobwhite index was 5.76. The long-term average was 17.3.\nThen the drought broke.\n“In a lot of the state, we’ve had three consecutive years of good rains and mild winters and summers,” Perez said. “Quail took advantage of it.”\nThe rains that began in 2013 triggered a flush of vegetation that has built each successive year in some regions such as the Rolling Plains and South Texas. The resulting increase in nesting and escape cover, insects and other forage, triggered a burst of quail nesting activity. In some areas, good habitat, ground moisture, mild springs and not-so-hot summers stretched the quail nesting window over months instead of weeks. Some quail hens attempted as many as four nests, losing early ones to predation, before pulling of a successful clutch.\nThe good habitat and mild winters allowed more quail than normal to survive winter, typically the toughest time for the birds.\n“If you get two consecutive years of good conditions, quail can really respond,” Perez said. “If you get three consecutive years of excellent conditions and good carry-over from winter, like they’ve seen in some parts of the Rolling Plains and South Texas, the birds can really build their numbers.”\nAnd that’s exactly what they have done in some regions over the past three years.\nThis year, the mean number of quail counted on TPWD survey routes in the Rolling Plains was 50.24, the highest in the survey’s 38-year history and more than double the long-term average.\nSouth Texas, where the 2015 index of 20.5 was the highest since 1999, saw a slight slip this year to about 14 quail per route. But that doesn’t mean areas of the Brush Country’s are not lousy with quail, Perez said.\nA stretch of hot/dry weather hit the region during July, and that may have hurt survival of quail chicks. But rains in late summer greatly benefitted the birds and could have triggered a burst of late hatches.\n“There’s some very strong quail populations in South Texas,” he said.\nThe quail boom also reached into the Trans-Pecos, where scaled quail dominate. Consecutive wet, mild years have triggered a boom in “blues.” The 2015 scaled quail index in the region jumped to almost 28 birds per survey route, up from 5.6 in 2014 and well above the long-term average of 16.2.\nThis year, the mean rose to 30.5 scaled quail per route, the highest since 1981.\nTexas’ coastal prairies were the only region of the state to see a significant drop in quail population this year.\nAnd the reason was a case of too much of a normally good thing. Flooding rains that hit the Texas coast during spring and early summer swamped much of the coastal prairie during prime quail nesting season.\nLoss of nests and young birds to flooding appears significant; the region’s survey index dropped from above average for the past three years to far below average this year.\nOverall, however, areas of Texas still holding considerable quail habitat - Rolling Plains, South Texas and Trans-Pecos - are seeing something special this year. There are more quail in some areas of the state than there have been in a generation.\n“It’s got the potential to be a very special kind of year,” Perez said.\n“We’re at the top of the cycle in some areas. If you are a quail hunter, this could be the season you talk about years from now.”", "url": "https://apnews.com/94947403bbc647eab8edea0d7a61d5ff"}