{"authors": ["Heather Ann Thompson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:10", "date_modify": "2020-05-04 19:58:10", "date_publish": "2016-09-17 00:00:00", "description": null, "filename": "2016_09__1588622290.html", "image_url": "https://images.jacobinmag.com/2016/09/17230703/attica-uprising-1971-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09__1588622290.html", "title": "Remembering Attica", "title_page": "Remembering Attica", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "HT\nIt was clear to me quite early on that the rebellion was a pivotal part of the story, but the more, perhaps, lastingly important part of the story was the way in which two things unfold: one, the state’s determination — really a shocking level of determination — to make sure that no members of law enforcement or politicians were ever held accountable for the atrocities at Attica.\nAnd then at the same time, the truly remarkable spirit of struggle that lived on well past Attica, on the part of both the hostages and the prisoners — that no matter how marginalized, no matter how attacked, no matter how dismissed by the public as well as politicians, they never give up. Their struggle takes thirty years for the prisoners, plus, forty years for the guards, plus, to be heard.\nRight after the rebellion, of course, it was such a disaster that there had to be some form of an investigation. The initial investigation into Attica is a criminal investigation. That is to say, what crimes were committed, either in the course of the rebellion or during the retaking. And the plan, ostensibly, was that both prisoner and law enforcement crimes were going to be equally investigated and equally prosecuted should they exist.\nWhat happens, of course, is only the prosecution of the prisoners — fifty-two prisoners get indicted — so the first big story after the rebellion is the indictment of these prisoners for over 1,400 crimes. It’s really an extraordinary state indictment, probably one of the largest series of indictments ever, in American history, or certainly in New York State. So all prisoner energies are taken up defending themselves.\nThere are ultimately five trials, and in one of the most remarkable defense efforts in American history — akin only to what happens in the South during Freedom Summer or perhaps surrounding the Scottsboro Boys years earlier — young law students and lawyers from across the country descend on upstate New York and offer their legal services to these prisoners.\nAnd then, of course, there are the civil cases: both the prisoners and the hostages try to get the state to be accountable via civil rights charges, on the part of the prisoners, and via the workman’s compensation system, on the part of the hostages.\nDid they get justice? No. They got recompense. They got restitution, finally, in the form of money, for some of the damages of what they suffered. For example, the killing of someone at Attica would net a family $6,500 when all was said and done.\nIt was pathetic, but it allowed them to get the story told, so in that sense it was incredibly important. That spirit is one of the ultimate legacies of Attica: that as much as this rebellion touches off one of the worst backlashes in American history that results in us being the largest jailer in the world, it was also an enduring story of struggle.", "url": "https://www.jacobinmag.com/2016/09/attica-prison-anniversary-blood-in-the-water-thompson/"}