{"authors": ["Dave Kamper", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:57", "date_modify": "2020-05-04 19:59:57", "date_publish": "2016-12-17 00:00:00", "description": null, "filename": "2016_12_labor-unions-trump-politics-locals_1588622397.html", "image_url": "https://images.jacobinmag.com/2016/12/17232418/sol-idarity-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_12_labor-unions-trump-politics-locals_1588622397.html", "title": "The Workers Versus Trump", "title_page": "The Workers Versus Trump", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Many will debate how we got here: the decisions made and not made, the candidates chosen and not chosen, the issues left ignored, the roads not taken. All that deserves to be discussed. But for now the point is, we’re here. A narcissistic bully is going to be president, and he will be backed up by an extremist, reality-denying right-wing Congress.\nFor many of us in the labor movement the burning question now is, “What is to be done?” When union folks ask this question, we often have in mind a specific plan, a set of tactics, or a strategic direction. But in this political moment something else is required. More important than a roadmap is for those of us in the labor movement who want to do something to resist Trumpism — from rank-and-file members to national leaders and everyone in between — to talk honestly and urgently about the need to build greater human capacity to carry out our goals and build more power.\nThe threats Trump’s victory and the Republican sweep pose to unions are numerous and have already been articulated by labor experts. Anti-union politicians like Paul Ryan and Mitch McConnell will now be in a position to pass far-right legislation that Republicans serving during the George W. Bush administration could only dream of implementing: national right-to-work, defanging the Fair Labor Standards Act, weakening the Equal Employment Opportunity Commission even more than it already has been. The fledgling graduate employee union movement will likely be imperiled, and Obama’s overtime protections will be fair game.\nIn the face of Trump’s bald racism, xenophobia, misogyny, and threats to use the levers of state power against his personal enemies, mere survival isn’t an option for unions. If we hunker down and simply wait for the storm to pass, the house of labor will likely sustain irreparable damage and become even weaker than it is today.\nAs Joe Hill said, we shouldn’t mourn. We should organize. Indeed, we must organize.\nThe only organized force capable of effectively resisting Trump and the Right in the present moment is organized labor. The Democratic Party has proven that it is either incapable — or unwilling — to be the voice of the voiceless in the United States today. Organized labor cannot resist Trump as an appendage of a political party. It must find its own voice.\nBut how do we find our voice? Many in the labor movement support laudable goals: we must build power in all directions and challenge every step of the Trump agenda. We must defend the targeted — immigrants, women under assault, ethnic and religious minorities — and we need to do so both inside and outside the confines of our unionized workplaces.\nYet the facts on the ground seem to deflate these aims pretty quickly. The reality is that there aren’t enough of us in the labor movement, and we don’t have enough resources. That has arguably always been true in the labor movement, but it’s more true now. The combined annual dues income of all the unions in the United States, at every level, is less than what Walmart takes in in two weeks. Our people power is more robust, but not nearly enough to make up the difference. Unions don’t have enough resources to do everything they need let alone everything they want. Every single decision labor unions make is also a decision not to do something.\nSimply put, to challenge Trumpism and rebuild the power of organized labor, unions are going to have to get better at saying “no” and marshaling their resources strategically. We have to decide that an idea may be amazing and worthwhile, but it can’t be justified against the other needs we have. For example, in the days after the election, numerous social media posts called for a general strike on January 20, the day Trump will be inaugurated.\nA general strike would be cathartic, and even if only a relatively small number of people participated, could send a powerful message. But taking that idea seriously would mean that those committed to it would spend all their time and energy over the next two months organizing one event that would likely include only people already on our side. At the risk of sounding like a capitalist, any reasonable cost-benefit analysis would show that channeling our resources to this kind of goal simply doesn’t make sense.\nA second challenge facing unions is their voluntary nature. The number and commitment of organized people (and organized money) we can rally around our goals are entirely dependent upon the willingness of folks to give their time to the union.\nAnd voluntarism isn’t just about individuals participating in their unions. The whole structure of the labor movement is built on voluntary cooperation. As Jack Nicholson memorably put it in Hoffa: “The fucking local is a ship upon the sea.” The AFL-CIO and Change to Win are only loose confederations. The constituent unions that belong to them are under no obligation to even listen to what they say, let alone act on their suggestions.\nThose internationals, in turn, have only limited ability to make state federations, regional councils, or locals follow their lead. When labor hierarchies do try to impose their vision from above in the face of the wishes of those below, as SEIU learned in California a few years ago, the most likely result is expensive chaos.\nIt’s useful to dwell on this point for a moment, because nearly all of us in the labor movement have felt frustration when it seems like another union (or our own) might be wasting its time. I’ve had these kinds of conversations hundreds of times: why does that union steward spend so much time helping that one member, who frankly doesn’t seem like a great employee, when there are so many other problems in the workplace? Why is this union putting all its effort behind a particular piece of legislation, when it has no chance of passing? Why are these two unions in a jurisdictional fight with each other over this workplace, when so many other shops remain unorganized? Many union members and leaders look at the scale and scope of our potential power, even now in our days of decline, and lament that that power is not put to higher purposes.\nThe answers to these questions stem in large part from the fact that we are a voluntary movement. The great pacifist, radical, and labor leader AJ Muste accurately described the labor movement as equal parts army and town meeting. When we are all singing from the same hymn sheet, we are indeed more powerful than capital’s hoarded gold. But getting to that point is a political process.\nIt’s an exercise in persuasion, persuasion that has to take place at every level of the labor movement: from shop stewards convincing rank-and-file members to vote for a strike, to getting different unions in the same industry to put aside their jurisdictional differences and work together. And those efforts in persuasion, themselves, require the expenditure of labor’s scarce resources. Our fellow union members and leaders have their own agency and their own ideas. All of us (or almost all) are good-hearted, thoughtful, well-intentioned, committed people who want to do right, but have different views on what that means. It’s messy. It’s complicated. It’s the American labor movement.\nAnd so our first mission, I believe, before we figure out the best strategy to take on Trumpism, is to increase our capacity. In the medium and long run, of course, that means things like organizing new unions and raising more money, but in the short term it means persuading our fellow union members and leaders that political action needs to be more important than it is right now, that it needs more resources, more time, and more people. More.\nThis is not about giving money to political parties, or just paying attention to elections. Building political power is about the labor movement developing its own internal capacity to engage in political action. In my experience, union members are only asked to think about politics for three months every two years. At union meetings, I often ask members to raise their hands if they ever talk to their next-door neighbor about their union or their politics. After counting the number of people who respond, I always have fingers left over.\nThe untapped potential of our members is profound. If even a relatively small percentage of unionists were convinced to put their time and energy into organizing political action — a voter registration drive, a demonstration at a congressional town hall, raising money for independent labor political activity — we could do an enormous amount to weaken the Right’s anti-worker agenda.\nThis is tougher than it sounds. Given the resource constraints mentioned above it means asking unions, as collectives, to say no to some important things. Contracts matter. Grievances matter. Professional development, safety committees, and so many other things matter. But in this moment the question of what matters most in rebuilding the power of the labor movement is a burning one. If we are going to focus more on building the independent political power of unions some of these other priorities may get short shrift.\nTo be sure, there are times and places where we can get the best of both worlds. It is always important to look for opportunities to tackle multiple objectives at once. For example, grievances around an employer’s bullying of immigrant members are an opportunity to engage in broader political fights while also enforcing a contract.\nThe Chicago Teachers Union, to pick an obvious example, has shown a remarkable ability of late to combine efforts on behalf of its own members with broader political advocacy on behalf of the city’s minority communities. And it’s also true that good organizing work can expand our resources by bringing more people into the fold, or getting more work from those already involved. Union money given to political parties right now, for example, could more effectively be used to fund a union’s independent political activity.\nBut, to be blunt, it is an escapist fantasy to believe that those opportunities will always be present. Sometimes the hard choices will have to be made. And the only way we will be able, as a labor movement, to make those hard choices is to engage in a political process within our own unions that lays bare the harsh facts: we don’t have enough to do everything, and to rebuild progressive working-class power and fight Trumpism we will have to do less of what we have done before.\nThis will manifest itself in very concrete ways in unions across the country. For example, a union local I know runs an amazing professional development conference for thousands of union members. It’s a social and professional highlight, but it takes thousands of person-hours to do, hours that aren’t available for battling the rising right. Another small-town union local I know spends a lot of its dues money sponsoring a hockey tournament for the city’s kids. It makes the union a valued institution in that town, and is worth its weight in gold when the contract is up, but can they spare the dollars if they are serious about building the political capacity to defend and represent working people?\nThere are serious consequences to saying no to things we are already doing. And we must always look for opportunities to add deeper value to what we already do. Can the union support the hockey tournament, but make sure on game days that they’re also passing petitions to oppose cuts to special education services, or registering voters, or handing out literature from a table, or something else that is political but also preserves a community connection? The answer to this will sometimes be yes, and when it is we should embrace the opportunities to handle two challenges at once.\nBut as I noted before, we cannot and should not fall prey to the comforting lie that unions can be all things to all people. There will be times and places where the hard calls have to be made. A union that tries to do everything ends up able to do nothing. The highest form of political cowardice that union leaders — from shop stewards to international presidents — engage in is when they tell union members that the union can continue to do more and more without asking anything more from the members.\nThat being said, let us never forget that power in the labor movement is not a zero-sum game. And that is why this is not just about priorities, but about capacity. Power is either organized people or organized money. If we have more, we can do more. If a union doubles the number of members prepared to devote time and energy to the cause, then it probably can continue to do what it has done while also expanding its efforts in the political arena.\nIf unions (especially those representing professional employees, who are almost always relatively underpaid but much more rarely in absolute poverty) ask their members to support dues increases, then they will have more financial resources to support independent labor-driven political action. This is, itself, a political task. We must persuade each other that it’s worth it to do more for the labor movement. We must do this the way all the best things are done in unions: one conversation at a time.\nThe task before all of us who want to take on the radical right is to engage those realities and make a persuasive case of the need to refocus and expand our capacity. Don’t take it for granted. Don’t expect immediate acquiescence. Every union member and leader should begin the hard conversations right now with their fellow unionists. That’s the first step to victory.", "url": "https://www.jacobinmag.com/2016/12/labor-unions-trump-politics-locals"}