{"authors": ["Bill Buley - The Garden Island"], "date_download": "2020-05-04 20:26:40", "date_modify": "2020-05-04 20:26:40", "date_publish": "2016-11-22 11:00:00", "description": "You’ll learn one thing quickly when you sit down for Hawaii Children Theatre’s production of “School of Rock the Musical Youth Production.” Sure, they’re acting, but man, these kids really...", "filename": "_e8487b7b1189466c9c94780f08c3e791_1588624000.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e8487b7b1189466c9c94780f08c3e791_1588624000.html", "title": "This ‘School’ will rock you", "title_page": "This ‘School’ will rock you", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "You’ll learn one thing quickly when you sit down for Hawaii Children Theatre’s production of “School of Rock the Musical Youth Production.”\nSure, they’re acting, but man, these kids really do rock. They roll. They sing. They dance. You might think you’re going to a musical at the Kauai War Memorial Convention Hall, but as the show goes on, one thing is clear: This is a concert. This is one ripping concert by some of the island’s finest young musicians you don’t want to miss in its final weekend.\nFirst, let’s set the stage.\n“School of Rock the Musical Youth Production” is a new musical based on the popular Paramount film written by Mike White, which starred Jack Black. The musical follows Dewey Finn, a failed, wannabe rock star who decides to earn a few extra bucks by posing as a substitute teacher at a prestigious prep school. But forget the academics. Dewey is a rocker at heart and shares that passion with his students, reluctant at first, but who come to support him, even tossing aside parental protests for the ending battle of the bands.\nThe performance seems to start a little slowly as the story is developed. But it gets rolling with the number, “You’re in the Band,” by Dewey and students, and from there, the audience is hooked.\n“The School of Rock,” while having a large, talented cast, really belongs to Pierce Bivens, who plays Dewey Finn. It’s a natural role for Bivens, who doesn’t even appear to be acting. He’s a gifted musician and actor who commands the stage with his voice and guitar. Bivens delivers an amazing performance, start to finish and seems bound for an entertainment career. He’s that good and has that much fun on stage.\nSabryn Rudinoff plays Principal Rosalie Mullins to perfection — the strict, no-nonsense school leader who, it turns out, is a Stevie Nicks fan and can hold her own, especially when she sings, “Where did the Rock Go?” in the second half. Fortunately, her role takes on more prominence.\nThe student band Finn puts together really is playing those instruments. Taylor Mielke-Suizu, as Freddy Hamilton, tears it up on the drums. Zeke Gamby rocks away as guitarist Zack Mooneyham. Emily Hartshorn delivers a strong bass performance. Tanner Hubbard, as Lawrence, plays a mean one-handed keyboard without so much as sweating. Melina Ventura is ideal to play Summer Hathaway, doubtful of Finn at first, but becomes the dedicated band manager. Jackson Gamby shows off her strong voice as Tomika with a short rendition of “Amazing Grace.” Ned Schneebly and Patty are played by Taj Gutierrez and Trinity Kermin. Gutierrez steals some scenes near the end, but we won’t explain how to avoid ruining a good surprise. And Kerwin, as the nagging, goal-oriented girlfriend, tries to be the voice of reason — but no one, fortunately, listens.\nThere are many strong songs, but “Stick it to the Man,” by Dewey and students is just flat out fun. There’s no way you can just sit still for this one. You have to tap your feet, nod your head or clap your hands — perhaps even sing quietly to yourself.\nThere’s a talented crew behind the scenes. Director Ed Eaton keeps the show on just the right pace and gives Bivens a chance to shine, but not to the point where others don’t get their turn in the spotlight.\nThis is the final weekend to see this delightful musical.\nShows are 7 p.m. Friday and Saturday and 4 p.m. Sunday. The $10 ticket is a bargain for all the talented musicians you’ll get to see and hear. Buy tickets at the door or at the HCT website, www.hawaiichildrenstheatre.org.", "url": "https://apnews.com/e8487b7b1189466c9c94780f08c3e791"}