{"authors": ["Michael Gallagher Assistant Editor"], "date_download": "2020-05-04 20:14:37", "date_modify": "2020-05-04 20:14:37", "date_publish": "2016-12-02 21:00:00", "description": "At 106,400 acres, does another 705 acres make a difference in the L.T. Murray Wildlife Area near Ellensburg? It might if you’re an elk. In November, the state Department of Fish and Wildlife...", "filename": "_b9a0591ba8994ee29c88ad42b604795f_1588623277.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b9a0591ba8994ee29c88ad42b604795f_1588623277.html", "title": "L.T. Murray Wildlife Area adds another 705 acres", "title_page": "L.T. Murray Wildlife Area adds another 705 acres", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "At 106,400 acres, does another 705 acres make a difference in the L.T. Murray Wildlife Area near Ellensburg? It might if you’re an elk.\nIn November, the state Department of Fish and Wildlife announced a series of state land purchases including purchasing a 705-acre parcel south of Cle Elum for $811,000 from the Nature Conservancy.\nThe transaction was the conclusion of an agreement that started with the Nature Conservancy’s purchase of 48,000 acres of Plum Creek Timber Company forest land in Kittitas County for $49 million in 2014.\nOne primary purpose of the Nature Conservancy purchase was to eliminate the traditional checkerboard ownership of forest land in Kittitas County — alternating parcels of public and private ownership.\nWilliam Meyer, habitat biologist with the state Department of Fish and Wildlife, said the department has always intended to purchase the property, but since it takes awhile to acquire grant funding, the Nature Conservancy acted as an intermediary.\nJulie Sandberg, real estate manager with the department of Fish and Wildlife, said this section will be the last one purchased in that area of the north Manastash.\n“We’ve been working on that landscape for years,” Sandberg said.\nLand qualities\nNear the top of the list for reasons for acquiring the property is it is an elk calving area, used by the largest elk herd in the state.\n“It’s key for elk survival,” Meyer said.\nBeyond serving that critical purpose, the property has an interesting history.\n“That particular section had an old spotted owl circle, one for the highest density of owls in the state,” Meyer said.\nMeyer said it was also a section of forest where Plum Creek Timber utilized what was then called experimental forestry techniques in the 1990s.\n“It was an early attempt to do forestry in a more environmentally friendly manner,” Meyer said.\nWhat that mean is Plum Creek used strip cuts rather than clear cuts.\n“A fair percentage standing is older forest,” Meyer said.\nOn top of all that, the land is at the headwaters of the Cle Elum River.\nThe land has a lot of uses for a wide range of wildlife species, but it’s an area enjoyed by humans as well.\n“A major piece of this is preserving public access,” Meyer said.\nMeyer said the area is used for dispersed recreation — hiking, hunting, fishing, camping and activities of that nature. Public access is a key issue because even though the property was previously under private ownership with Plum Creek, it fairly open to public use.\n“People took it for granted that they had access to the land,” Meyer said.", "url": "https://apnews.com/b9a0591ba8994ee29c88ad42b604795f"}