{"authors": ["John C. Ensslin"], "date_download": "2020-05-04 20:14:12", "date_modify": "2020-05-04 20:14:12", "date_publish": "2016-11-09 23:29:09", "description": "Donald Trump’s upset victory over Hillary Clinton confounded most pollsters and political operatives. But two veteran New Jersey campaign operatives agreed Wednesday that Trump rode into the...", "filename": "_aaaf2d38871b4b7a8a5dfbd3297388d0_1588623252.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aaaf2d38871b4b7a8a5dfbd3297388d0_1588623252.html", "title": "N.J. campaign operatives discuss Trump's path to the White House", "title_page": "LISTEN: N.J. campaign operatives discuss Trump's path to the White House", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Donald Trump’s upset victory over Hillary Clinton confounded most pollsters and political operatives.\nBut two veteran New Jersey campaign operatives agreed Wednesday that Trump rode into the White House on a rising tide of voters who wanted change more than anything else.\n“There’s a desire for change in the country and I think many people overlooked how strong that desire was,” said Michael DuHaime, a Republican strategist who served on Governor Christie’s gubernatorial and presidential campaigns.\nDerek Roseman, a Democratic operative, who currently serves as spokesman for gubernatorial candidate Phil Murphy, noted that Clinton held a slim lead in the popular vote despite losing in the Electoral College.\nHe said that narrow popular vote margin shows just how divided the country remains.\nRoseman also said it is very difficult for either party to retain control over the presidency for more than two terms.\n“The American people seem to have this desire to only give one party an eight year rental on the White House before they decide to take it out.”\nThe two men offered their analysis of the election results during the taping of a Record Talk Radio podcast in Newark.\nDuHaime said one major takeaway he drew from the results was the fact that for the first time since 2000 the turnout in the presidential race did not increase.\nTrump got fewer votes than Mitt Romney received in 2012, but Clinton also drew about 7 million fewer votes than were cast for President Obama, DuHaime noted.\nTrump relied less on some of the traditional tools that modern campaign have come to rely upon, such as polling, analytics and massive get-out-the-vote efforts.\nBut in the end, those things didn’t matter, DuHaime said.\n“I think for all the talk of campaign mechanics and all the things that Derek and I do as operatives, at the end of the day, the candidates need to inspire people,” DuHaime said.\n“And I think Secretary Clinton, for all the good work she’s done over the years, did not engender the same passion that President Obama did when he ran,” he added. Roseman said he does not believe the vote was against Obama, whose approval ratings remain high.\n“I don’t see this as a repudiation necessarily of the president. President Obama is still considered a relatively popular guy,” Roseman said. “That is if polling is to be believed anymore.”\n“But I think this is just something in the body politic that a lot of pollsters missed and a lot of us political professionals missed,” he added. Email: ensslin@northjersey.com", "url": "https://apnews.com/aaaf2d38871b4b7a8a5dfbd3297388d0"}