{"authors": ["Raul Garcia Staff Writer"], "date_download": "2020-05-04 20:13:57", "date_modify": "2020-05-04 20:13:57", "date_publish": "2016-11-22 02:35:00", "description": "RIO HONDO — Giddy-up, partner. City leaders are hopeful its Cowboy Christmas parade will draw visitors into town. The city announced recently it will host its annual Christmas parade...", "filename": "_6fe22094ac36457d9729536995bbc0d8_1588623237.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6fe22094ac36457d9729536995bbc0d8_1588623237.html", "title": "Rio Hondo hoping for big crowd at Christmas parade", "title_page": "Rio Hondo hoping for big crowd at Christmas parade", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RIO HONDO — Giddy-up, partner.\nCity leaders are hopeful its Cowboy Christmas parade will draw visitors into town.\nThe city announced recently it will host its annual Christmas parade on Dec. 10 at 6 p.m. for its residents and surrounding communities to kick off the holiday season.\nCity Administrator Ben Medina said it is the first community event leaders and the local businesses are gearing up for to bring visitors into town since the Rio Hondo Lift Bridge closed for repairs.\nLocal business owners have seen a loss in customers and traffic through town since the end of September when the bridge closed to undergo $12 million in renovations and upgrades.\nMedina said vendors will be set up under City Hall selling merchandise for Christmas after the parade.\n“In this time that the bridge is closed it will be a little bit safer,” Medina said. “We are hoping everybody will come out and join the city of Rio Hondo.”\nMedina said even though the parade is small and humble it will be a good thing to come out and see.\nThe parade is an annual tradition held by the city.\nIt will begin at the Dollar General on Colorado Avenue and end at Rio Hondo City Hall.\nAdmission to enter a float or group in the parade is free. Applications must be picked up at City Hall to be a parade participant.\nNormally hundreds of Rio Hondo residents attend the parade to see the floats and support family and friends participating in the event.\nThis year will be the 16th annual Christmas parade. Every parade is different because of the parade themes that have changed from year-to-year.\nNormally the high school band, local businesses and organizations march down the street in Christmas hats strolling to Christmas songs under the chilly night sky.\n“It’s a great community event for everyone,” Medina said.", "url": "https://apnews.com/6fe22094ac36457d9729536995bbc0d8"}