{"authors": ["Christian Wihtol"], "date_download": "2020-05-04 20:18:22", "date_modify": "2020-05-04 20:18:22", "date_publish": "2016-06-23 07:00:00", "description": "From 2013 to 2015, private, for-profit Agate Resources became an increasingly attractive acquisition target for Centene Corp., as Agate’s Trillium Health Plan subsidiary ballooned in revenues and...", "filename": "_d1feaf2d17a84bbd9b0b7083eecc2726_1588623502.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d1feaf2d17a84bbd9b0b7083eecc2726_1588623502.html", "title": "By the end of 2015, Trillium had a $41.3 million surplus", "title_page": "By the end of 2015, Trillium had a $41.3 million surplus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "From 2013 to 2015, private, for-profit Agate Resources became an increasingly attractive acquisition target for Centene Corp., as Agate’s Trillium Health Plan subsidiary ballooned in revenues and profits, Agate documents show.\nBy the time Centene moved ahead with buying Agate/Trillium last year for $109 million, Trillium was on track to post a hefty cash reserve of $41.3 million, Trillium’s financial statements show.\nPlus, Trillium’s total annual revenues had grown to $523 million by 2015 — the great majority of it coming from the government, which pays Trillium to care for the fast-increasing number of low-income Lane County residents covered by the government’s Oregon Health Plan. Trillium revenue was up from $245 million just two years earlier.\nThe revenue growth, and Agate’s track record of being able to pull increasing profits out of the money it was receiving from the government, burnished Agate’s value.\nAgate in 2011 first began contemplating putting itself up for sale, and in January 2013 began talking with Centene, according to documents Agate gave to its shareholders explaining the sale.\nBut in January 2014, the talks went sour, and Centene “informed us that it was terminating discussions and withdrawing from the process,” the sale plan states.\nAgate in early and mid-2014 then began wooing Centene, giving Centene the latest Trillium financial results, according to the sale document.\n“In April and in June 2014, (Agate) gave Centene updates on Agate’s quarterly financial performance,” the sale document states. After seeing the new numbers, Centene resumed the purchase talks, the sale document states, and after a series of meetings, the sides settled on terms in January 2015. Agate shareholders approved the sale in June 2015.\nProgress in the sale negotiations coincided with the sharp improvement in Trillium’s profits and overall finances.\nIn 2013, Trillium had $245 million in revenues, mainly payments from the government to fund health care to Oregon Health Plan patients. Trillium paid out $218 million to hospitals and other care providers in 2013, and, after paying its own staff and other costs, managed to squeeze out a $3.9 million profit that year, raising the company’s capital and surplus — in effect, its reserves — to $20.1 million by the end of 2013.\nIn 2014 and 2015, Trillium’s business swelled as the federal and state governments greatly expanded eligibility for OHP, adding tens of thousands of Lane County residents onto the government-funded care rolls. Trillium’s revenues boomed to $407 million in 2014, and after payouts to hospitals and other care providers of $320 million, and other expenses, Agate was able to make a profit of $22.2 million, the records show.\nIn 2015, Trillium’s revenues swelled to $523 million, again courtesy of the expanding OHP patient rolls. After paying hospitals and other providers $434 million and covering its own operating costs, Trillium was able to net a profit of $14.1 million. That gave it total capital/surplus of $41.3 million by the end of 2015, according to the financial reports.\nTo continue receiving money from the government to care for OHP and other low-income Medicaid patients, coordinated care organizations such as Trillium must meet government standards of care provision in a wide range of categories, from health screening to emergency room visits. The state puts no limit on how much profit Trillium and other coordinated care organizations make, or how they use the profit, for example, paying dividends to shareholders, or saving it up before putting the CCO on the market for sale.\nCentene specializes in buying and running health insurers such as Trillium that manage government-funded health care for Medicaid and Medicare patients. Centene says it is expert at ensuring quality care in a cost-conscious way. In its latest fiscal year, it reported $356 million in profits on $21.3 billion in revenues.\nFollow Christian on Twitter @ChristianWihtol . Email christian.wihtol@registerguard.com .", "url": "https://apnews.com/d1feaf2d17a84bbd9b0b7083eecc2726"}