{"authors": ["Rory Fanning", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:36", "date_modify": "2020-05-04 19:59:36", "date_publish": "2016-05-25 00:00:00", "description": null, "filename": "2016_05__1588622376.html", "image_url": "https://images.jacobinmag.com/2016/05/25152507/vietnam-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_05__1588622376.html", "title": "When Soldiers Resist", "title_page": "When Soldiers Resist", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "On August 10, 1965, less than two months after General William Westmoreland launched the first major offensive by American ground forces in Vietnam, Congressmen L. Mendel Rivers (D-South Carolina) and William Bray (R-Indiana) sponsored an amendment to the Selective Service Act, the law that outlined the terms of the military draft. Rivers and Bray added only four words to it: “knowingly destroys, knowingly mutilates.”\nRepulsed by a mass protest on the Washington Mall on the twentieth anniversaries of the atomic bombing of Hiroshima and Nagasaki — where draft cards were publicly burned by those summoned to Vietnam — the congressmen led a charge to instill fear in the hearts of would-be war resisters.\nRivers, the self-proclaimed “granddaddy of the war hawks” and an enthusiastic segregationist, promoted his amendment before Congress:\nIt is a straightforward clear answer to those who would make a mockery of our efforts in South Vietnam by engaging in the mass destruction of draft cards . . . This is the least we can do for our men in South Vietnam fighting to preserve freedom, while a vocal minority in this country thumb their noses at their own government.\nBray said of those who dared burn their draft cards:\nThey were generally a filthy, sleazy beatnik gang; but the question which they pose to America is quite serious . . . This proposed legislation to make it illegal to knowingly destroy or mutilate a draft card is only one step in bringing some legal control over those who would destroy American freedom.\nThe amendment passed the House 393 to 1, with 40 not voting. Those who burned their draft cards would now be subject to five years in prison and a $10,000 fine.\nForty-five days later, David Miller, a member of the National Mobilizing Committee to End the War in Vietnam (the MOBE) and the Catholic Worker, responded to the new law by burning his draft card in front of his assigned military induction post in Syracuse, New York. Miller said of the events leading up to the burning:\nWithin days of moving to the Catholic Worker house in New York City in June 1965, I wrote to my draft board in Syracuse to tell them where I was but that I would not cooperate with them in any other way. . . . The draft board’s response was to reclassify me #1-A delinquent, which was the highest classification possible. It meant that my name went to the top of the list.\nAfter torching his card, the twenty-two–year-old Miller, dressed in a dark, well-pressed suit and standing on a sound truck surrounded by the media and onlookers, held up a banner that read, “End the Draft, Stop the War.” The FBI arrested Miller. Within a month, five more potential draftees had publicly burned their cards.\nThe following month Lieutenant Henry Howe, who was stationed at Fort Bliss, New Mexico, unfurled a sign at a small peace rally in El Paso with “End Johnson’s fascist aggression” written on it. Howe became the first active duty soldier to publicly protest the Vietnam War. He was court-martialed and sentenced to two years hard labor in Fort Leavenworth.\nA year and a half later, Miller was sentenced to three years in jail after the Supreme Court declined to hear his appeal. Burning draft cards, in its estimation, was not protected speech. The MOBE responded to the sentence by calling for coordinated marches in forty cities that mobilized more than one hundred thousand demonstrators in February 1967.\nAs these protests were being carried out, US forces were launching Operation Junction City — one of the largest air-mobile assaults in history — over the Tay Nihh province in South Vietnam. Nearly three thousand Viet Cong and three hundred American soldiers died in the attack. Despite its size, the operation would win no long-term strategic advantage for the United States.\nFar from being a deterrent, as Rivers and Bray had hoped, the “knowingly destroys, knowingly mutilates” amendment to the Selective Service Act only inspired greater resistance. The Student Nonviolent Coordinating Committee (SNCC) declared their opposition to the war by urging blacks not to “fight in Vietnam for the white man’s freedom, until all the Negro people are free in Mississippi.” In 1967, 64 percent of all eligible African Americans were drafted, but only 31 percent of eligible whites. During 1965–66, the casualty rate for blacks was twice that of whites.\nOn April 28, 1967, soon after Nina Simone released her scathing anti-Vietnam war song, “Backlash Blues,” Muhammad Ali issued the following statement on his own decision to resist the war:\nNo, I am not going ten thousand miles from home to help murder and burn another poor nation simply to continue the domination of white slave masters of the darker people the world over.\nHe chose possible prison time over induction.\nBy 1968, as the Vietnam War grew increasingly unpopular, war resisters, numbering in the thousands, were returning their draft cards to their designated federal buildings, which was seen as even greater act of defiance than card burning because officials would have the resister’s name and address handed directly to them.\nFor many drafted, any remaining trust in the competency of the generals and politicians ordering them to fight disappeared on the morning of January 30, 1968, fifteen days after more than five thousand women marched on Washington DC in front of Congress to show opposition to the war.\nOn the Lunar New Year, a major holiday in Vietnam, more than seventy thousand North Vietnamese and Viet Cong soldiers conducted surprise coordinated attacks on one hundred cities in South Vietnam. The bloody images of what would soon be dubbed the “Tet Offensive” flashed around the world.\nFollowing Tet, incidents of fragging, where US soldiers would attempt to kill their commanding officers — usually with explosives devices such as grenades and claymore mines — skyrocketed. The army began keeping records of these assaults in 1969. By the end of 1970, over three hundred had occurred, resulting in seventy-three deaths and five hundred injuries.\nIn early 1970, US brass in Vietnam began restricting access to explosive devices and weapons. “Enlisted men could no longer be trusted with weapons,” reports David Cortright in Soldiers in Revolt. In addition to the fragging incidents, soldiers were laying down their weapons and refusing to fight at record rates. From 1967 to 1971, conscientious-objector rates within the army rose 400 percent and nearly 200 percent among marines.\nIn 1969, soon after the United States began secretly dropping what would amount to a half million tons of bombs on Cambodia, peace activist Randy Kehler returned his draft card to his local draft board and flatly refused to file for conscientious objector status.\nApplying for CO status would require too much cooperation with the government, Kehler said. He was sentenced to twenty-two months in federal prison. Daniel Ellsberg cites Kehler as an inspiration for his decision to release the Pentagon Papers in 1971.\nOn October 15, 1969, on the four-year anniversary of the first draft card burning in opposition to the Rivers and Brays amendment, hundreds of thousands turned out for the National Moratorium demonstrations in protest of the war. Journalist Walter Cronkite called these marches “historic in its scope. Never before had so many demonstrated their hope for peace.”\nAlthough the war would drag on for five long years, the United States never recovered from the Tet Offensive. Troop levels and bombing missions in Vietnam were scaled back. The multi-pronged efforts of draft resisters, journalists, mass demonstrations, civil rights organizations, peaceful and bloody resistance by US soldiers within the ranks, and the unwavering efforts of millions of Vietnamese — despite overwhelming casualties — to resist an occupying superpower, ended the war in Vietnam.\nThis Memorial Day, we might take some time to thank the war resisters who eventually stopped the likes of Rivers and Bray — men who “knowingly destroyed and knowingly mutilated” the lives of at least two million Vietnamese, and almost sixty thousand US soldiers.", "url": "https://www.jacobinmag.com/2016/05/vietnam-gi-movement-war-resisters-draft/"}