{"authors": ["Staff Reports"], "date_download": "2020-05-04 20:22:31", "date_modify": "2020-05-04 20:22:31", "date_publish": "2016-08-19 00:00:00", "description": "DALLAS — Police say a man unhappy about a recent DUI arrest attacked and injured a Dallas police officer outside the borough police station on Thursday. Sean Mulloy, 44, of Dallas Township,...", "filename": "_f06d3587127d45d2bb9e9030ddf36005_1588623751.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f06d3587127d45d2bb9e9030ddf36005_1588623751.html", "title": "Man Accused Of Attacking Luzerne County Police Officer", "title_page": "Man Accused Of Attacking Luzerne County Police Officer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DALLAS — Police say a man unhappy about a recent DUI arrest attacked and injured a Dallas police officer outside the borough police station on Thursday.\nSean Mulloy, 44, of Dallas Township, showed up at the police station at about 12:15 p.m. Thursday and started wrapping a chain around an outside railing, Dallas police Chief James Drury said.\nWhen Patrolman James Martin came outside the station to ask Mulloy what he was doing, Mulloy swore at Martin and struck him twice with a closed fist, according to a criminal complaint filed by Dallas police.\nDrury said Mulloy “went berserk,” punched Martin in the head and dragged him into a “wrestling match.”\nMulloy resisted arrest and struggled as Martin attempted to restrain him, the complaint states. A Dallas Township police officer arrived at the scene and helped take Mulloy into custody.\nMartin — a 29-year veteran officer, according to Drury — was transported to an area hospital for treatment of elbow and ankle injuries. Drury did not know Martin’s condition as of Thursday afternoon and said he was headed to the hospital to check on the injured officer.\nMartin arrested Mulloy on suspicion of DUI last week, according to Drury.\nMulloy came to the police station several times this week, angry that his car had been impounded following that arrest, Drury said. Mulloy could not afford to retrieve the vehicle from the lot where it had been towed and asked police to pay for it, the chief said.\n“No one would give him money to get it out,” Drury said.\nMulloy was charged with two felony counts of aggravated assault, and misdemeanor counts of simple assault and resisting arrest.\nHe was arraigned late Thursday afternoon before Magisterial District Judge James Tupper.\nMulloy told Tupper he is unemployed and has lived in the same Midland Drive home since he was a child.\nTupper ordered Mulloy to be held at Luzerne County Correctional Facility in lieu of $150,000 bail.\nAs uniformed Dallas police officers led Mulloy off to jail, Drury praised police departments from throughout the Back Mountain and state police who rushed to the scene as soon as they heard Martin call for backup.\n“I want to thank every single officer,” Drury said.\nA preliminary hearing is scheduled for Aug. 25 before Tupper.\nCourt records indicate Mulloy has been charged with DUI three times, not including last week’s arrest. He was charged with DUI in Dallas in 1991, in Laflin in 2007 and in Dallas Township in 2008.", "url": "https://apnews.com/f06d3587127d45d2bb9e9030ddf36005"}