{"authors": ["Christopher Phelps", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:20", "date_modify": "2020-05-04 19:59:20", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_10_tom-hayden-sds-port-huron-counterculture-protest-vietnam_1588622360.html", "image_url": "https://images.jacobinmag.com/2016/10/17231412/tom-hayden-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_10_tom-hayden-sds-port-huron-counterculture-protest-vietnam_1588622360.html", "title": "Tom Hayden (1939-2016)", "title_page": "Tom Hayden (1939–2016)", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The New York Times gets a great deal wrong in its obituary today for Tom Hayden, starting with the first sentence’s claim that he “burst out of the 1960s counterculture.”\nThe tired cliché that reduces the sixties to sex, drugs, and rock’n’roll, in this case as so many others, distorts both chronology and significance.\nHayden burst out of the Midwest, not Haight-Ashbury. He cut his teeth on the Michigan Daily, not the East Village Other. He was a working-class Catholic from Royal Oak, Michigan, one of the outer rings of Detroit. To see him as a product of the counterculture gets it precisely backwards.\nHayden’s youthful trajectory points, rather, to the early New Left that began awakening in the stiflingly conformist atmosphere of the late 1950s, one whose radicalism was focused in thought and action aiming to surmount race, bureaucracy, and war — and not on the experimentation with hair, dress, music, and psychedelic mind expansion that captivated the hippie counterculture.\nThe hippies were by and large apolitical; Hayden and his kind were political from start to finish.\nA black-and-white group image snapped of the Students for a Democratic Society 1963 national council meeting in Bloomington, Indiana, offers photographic proof. Hayden stands off to the side. The participants all raise the clenched radical fist, but are dressed in madras shirts, chinos, pleated skirts, and in one case even a tweed coat over a sweater. They appear ready for a sock hop after a long day in the library stacks. Thick glasses abound. There is not a beard or mustache in sight.\n“Nerdy” springs to mind sooner than “groovy.”\nIn separate places the Times’s obituary calls Hayden “a founder of Students for a Democratic Society” and claims that he “joined thirty-five like-minded activists at Ann Arbor in 1960 and formed Students for a Democratic Society.” All of this is erroneous, unless we generously grant that Hayden was an early SDS member who lived in Ann Arbor. Hayden didn’t join SDS until 1961, more than a year after its creation. In 1960 he skipped the SDS convention, which was in New York, to attend the Democratic National Convention in California.\nIt was Alan Haber, a slightly older Ann Arbor denizen, who in 1960 came up with the brilliant name “Students for a Democratic Society” — its most radical word being for, since that implied the United States was not democratic. Even Haber was retooling, though, not founding. SDS was a new name for the Student League for Industrial Democracy, descended from the Intercollegiate Socialist Society founded in 1905.\nHaber worked hard to recruit Hayden, who in 1960 was preoccupied with the National Student Association, a liberal group later found to have had funding from the Central Intelligence Agency.\nThese details aren’t pedantry. It means something, for example, if the paper of record places the words “participatory democracy” in the fifteenth paragraph of an obituary, where they might not be seen by readers or recognized, when they are at the very essence of the subject’s contribution to history.\nThe Port Huron Statement is hands down the most important document of sixties student radicalism, and Tom Hayden was its primary drafter. He was first among equals when several dozen university students came together at a Michigan camp of the United Auto Workers in Port Huron in the summer of 1962 to discuss and reshape that document.\nHayden did not, as the Times obit bizarrely claims twice, begin writing the political manifesto of his generation from a jail in Albany, Georgia, as a freedom movement organizer in 1961. He did write a missive there calling for SDS to achieve a greater clarity of mission. But he was only commissioned to write the organization’s core statement at a meeting in Ann Arbor on New Year’s Eve at the very end of that year, and his sustained writing of the draft was in New York in the first half of 1962.\nWhat made the Port Huron Statement impressive was not its specific demands but its broadbrush evocation of idealism, especially in its opening section on “Values.” It called for replacing “power rooted in possession, privilege, or circumstance” by “power and uniqueness rooted in love, reflectiveness, reason, and creativity.”\nThe answer was participatory democracy: the principle that individuals should share in decision-making affecting their lives and that society should be structured accordingly, that politics should bring people out of isolation to shape a “common participation,” and that work life should be imbued with meaning and dignity. All of this was in answer to the cynicism and apathy the early SDSers saw as afflicting so much of American life, including student life.\nThe phrase “participatory democracy” was not coined by Hayden; Arnold Kaufman, a philosopher, expressed it first. But Hayden gave it a new poetry, one inspired partly by books — by Albert Camus, C. Wright Mills, and John Dewey, among others — but especially by the black freedom movement he had witnessed in action. Hayden had collaborated with the Student Nonviolent Coordinating Committee (SNCC) up close. It breathed participatory democracy.\nThe process of the document’s adoption also manifested the ideal, for without the contributions of other SDS members, Hayden would never have gotten it right. It was they — Haber, Bob Ross, and others — who told him to move the “Values” section to the top of the document, not bury it in the middle. If they had not done so, the Port Huron Statement might have gone into the dustbin of radical pamphlets rather than inspiring a generation, for its declaration of “Values” expressed in words what the Berkeley Free Speech Movement would manifest in action two years later, and what students the nation over would identify with avidly even in the moment of opposition to the Vietnam War.\nTom Hayden’s Port Huron moment illustrates precisely this: one doesn’t have to be the founder of a group, merely a joiner, to make one’s mark; being a radical is not necessarily about looking like one; and the eloquent articulation of radical principles can inspire and guide mass action.\nMuch more could be said about Tom Hayden’s subsequent life, whether in his shaggier and more revolutionary late-sixties incarnation or his rightward drift thereafter as as an elected official who never forsook his radical youth. In our present raw moment there is something of comfort to be taken from Hayden’s biography as a radical who emerged from the parish of Father Coughlin, the bilious right-populist of his day. Are there, perhaps, future radicals among the young white male “deplorables” taken in by today’s bilious demagogue?\nI met Tom Hayden only once — in Ann Arbor, naturally. I was surprised that a figure so imposing in legend was so diminutive in stature, and delighted to find his persona hinting of an Irish-American leprechaun: sprightly and gifted with a playful sense of mirth.\nWhat remains indelibly radical about Tom Hayden’s contribution to American history, obscured as it may be in obituaries, is his eloquent articulation of democratic values that demand a wholly new society for their fulfillment, taken in combination with his lifelong belief that hope lies in political action.\nDon’t mourn, participate.", "url": "https://www.jacobinmag.com/2016/10/tom-hayden-sds-port-huron-counterculture-protest-vietnam"}