{"authors": ["Nathan J. Robinson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:55:19", "date_modify": "2020-05-04 19:55:19", "date_publish": "2016-09-17 00:00:00", "description": null, "filename": "2016_09__1588622119.html", "image_url": "https://images.jacobinmag.com/2016/09/17230636/bill-clinton-crowed-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_09__1588622119.html", "title": "Bill Clinton, Superpredator", "title_page": "Bill Clinton, Superpredator", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Perhaps the only surprising thing about this is that anybody is still surprised.\nBill Clinton has always been a person who says one thing to the NAACP, and another to white audiences. What happened in Philadelphia may have startled the young black activists who sought to challenge Clinton, but it shouldn’t have. For twenty years, Bill Clinton has shown a tendency to reverse himself on prior commitments, most especially those made to African American constituencies.\nRather, it was simply the most blatant expression of traits that have been present in Clinton’s character since his early political career. From the very beginning, Clinton’s political success has been built on his skillful maneuvering between different rhetorical stances, his “triangulation” between right and left.\nBut for those acquainted with Clinton’s political history, there was nothing especially “baffling” about his behavior in Philadelphia.\nWhich was the real Clinton: the one who apologized for his crime bill, or the one who snapped at people who criticized his crime bill? Was Clinton a good-hearted and progressive-minded criminal justice reformer, or an insensitive relic of the “tough on crime” era who still believed in conservative fables about roving sociopathic African American preteens? To many observers, the whole thing seemed paradoxical.\nBill Clinton’s words were certainly curious. A man who has always portrayed himself as a friend to black Americans, Clinton had seemed just as sincere in his apology for his actions as in his later defense of them.\nClinton went on to defend every aspect of his criminal justice policy, chiding the activists by suggesting that they didn’t care about victims. This was despite his having previously apologized to the NAACP for his role in expanding the prison system, saying “I signed a bill that made the problem worse . . . and I want to admit it.”\nI don’t know how you would describe the gang leaders who got thirteen-year-olds hopped up on crack and sent them out in the streets to murder other African-American children! Maybe you thought they were good citizens, [Hillary] didn’t. You are defending the people who kill the lives you say matter.\nGiven that Hillary herself had just disowned the words and apologized for using them, one might therefore have expected Bill Clinton to display a similar contrition when confronted by the activists in Philadelphia. But when they mentioned the phrase “superpredator,” he exploded in unqualified defense of the term:\n“Looking back,” she said, “I shouldn’t have used those words, and I wouldn’t use them today.” She emphasized her commitment to children, and mentioned the importance of ending the notorious “school-to-prison pipeline” that ensnares so many young African Americans.\nAt that point, Clinton moved on, and Williams was escorted from the event by Secret Service. But faced with the prospect of continuing to be dogged by sign-wielding Black Lives Matter supporters, Clinton soon repudiated her use of the phrase in a conversation with the Washington Post’s Jonathan Capehart.\nClinton: If you give me a chance to talk, I’ll come to your side . . . You know what! Nobody’s ever asked me [this] before. You’re the first person to ask me and I am happy to address it. But you are the first person to ask me.\nWilliams: I know that you called black people “superpredators” in 1994, please explain it to us. You owe black people an apology.\nClinton: Do you want to hear the facts or do you just want to talk?\nClinton: Well, can I talk, and then maybe you can listen to what I say. Fine. Thank you very much. There are a lot of issues in this campaign. The very first speech that I gave back in April was about criminal justice reform.\nHillary Clinton: I think we’ve got somebody saying [something] here, have you? [reading sign] “Bring them to heel?”\nAt first, Clinton seemed bewildered by the criticism. When a Black Lives Matter activist named Ashley Williams crashed a Clinton fundraiser holding a sign with the infamous quote, a tense exchange ensued:\nBy that time, the “tough on crime” political rhetoric of the 1990s was under strong criticism. The Black Lives Matter movement arose as a reaction to decades of abusive policing practices and failed criminal justice policies. To a new generation of activists, Hillary’s having called kids “superpredators” seemed perverse.\nHer words were not controversial at the time. But in the 2016 election, they proved a source of significant embarrassment.\nThey are not just gangs of kids anymore. They are often the kinds of kids that are called “super-predators.” No conscience, no empathy. We can talk about why they ended up that way but first we have to bring them to heel.\nBut it was a particular couple of sentences in Hillary Clinton’s gang monologue that would haunt her, and would be the direct cause of Bill Clinton’s news-making outburst twenty years later. Describing the type of juvenile gang members she was referring to, Hillary said :\nGangs were a scourge, she suggested, and to deal with them we must exercise the full might of the law’s brawny arm. “We need to take these people on,” she declared.\nThe seeds of the “superpredator” scuffle were sown many years earlier. At an event in New Hampshire in 1996, Hillary Clinton had been discussing the administration’s “organized effort against gangs.” She described gangs as a nationwide problem, one requiring a muscly policy response, with our generation having to face up to gangs “just as in a previous generation we had an organized effort against the mob.”\nOf course, one could perhaps take issue with Clinton’s equation of hushing and democracy (“Hush and Listen” sounding like the official slogan of a folksy police state run by bayou Stalinists). But the testiest part of the exchange, and the one that made the next morning’s headlines, concerned the phrase “superpredator.”\nHe challenged the activists’ portrayals of his record on welfare and crime. He insisted that thanks to his policies, poverty had decreased and our streets were safer. Clinton claimed that the protesters simply didn’t want to know the facts, as evidenced by the vehemence of their clamor: “They won’t hush. When someone won’t hush and listen, that ain’t democracy. They’re afraid of the truth. Don’t be afraid of the truth.”\nOn the evening of April 7, 2016, at a campaign event in Philadelphia, Bill Clinton lost his temper. Clinton had found himself noisily confronted by members of the Black Lives Matter activist group, who repeatedly interrupted his speech to denounce him. The activists carried signs that read “Welfare reform increased poverty” and “Clinton crime bill destroyed our communities.”\nA Threat to Civilization\nThe myth of the “superpredator” would have terrible consequences for American children. In the mid 1990s, fueled by alarmist pseudo-scholarship by quack criminologists, a number of politicians sounded the alarm about a concerning new trend: the rise of a new breed of sociopathic juvenile delinquent, incapable of empathy and hellbent on robbing, raping, and terrorizing every decent churchgoing middle American community.\nThe 1980s and 1990s were a heyday for nationwide moral panics. The coming of the superpredators was just one of the paralyzing terrors of the period, which also included widespread fear of Satanic abuse at daycares and razorblades in Halloween candy. The superpredator legend, however, was more deeply insidious.\nThe term was coined by John DiIulio Jr, a professor at Princeton University. DiIulio interpreted rising juvenile crime statistics to mean that a “new breed” of juvenile offender had been born, one who was “stone cold,” “fatherless, Godless, and jobless,” and had “absolutely no respect for human life and no sense of the future.”\nDiIulio and his coauthors elaborated that superpredators were:\nRadically impulsive, brutally remorseless youngsters, including ever more preteenage boys, who murder, assault, rape, rob, burglarize, deal deadly drugs, join gun-toting gangs, and create serious communal disorders. They do not fear the stigma of arrest, the pains of imprisonment, or the pangs of conscience. They perceive hardly any relationship between doing right (or wrong) now and being rewarded (or punished) for it later. To these mean-street youngsters, the words “right” and “wrong” have no fixed moral meaning.\nFor devising this theory, DiIulio was rewarded with an invitation to the White House, where he and a group of other experts spent three and a half hours with President Clinton.\nConfirming DiIulio’s analysis was James Q. Wilson, the conservative political scientist who had devised the theory of “broken windows” policing. The broken windows theory posited that minor crimes in a neighborhood (such as the breaking of windows) tended to lead to major ones, so police should harshly focus on rounding up petty criminals if they wanted to prevent major violent crimes.\nPut into practice, this amounted to the endless apprehension of fare-jumpers and homeless squeegee people. It also created the intellectual justification for totalitarian “stop and frisk” policies that introduced an exasperating and often terrifying ordeal into nearly every young black New Yorker’s life.\n“Broken windows” had very little academic support (it hadn’t been introduced in a peer-reviewed journal, but in a short article for the Atlantic), but Wilson still felt confident in pronouncing on the “superpredator” phenomenon. He predicted that by the year 2000, “there will be a million more people between the ages of fourteen and seventeen than there are now” and “six percent of them will become high rate, repeat offenders — thirty thousand more young muggers, killers and thieves than we have now.”\nDiIulio and Wilson said that it was past time to panic. “Get ready,” warned Wilson. Not only were the superpredators here, but a lethal tsunami of them was rising in the distance, preparing to engulf civilization.\nAs James C. Howell documents, just a year later, as crime rates continued to decrease, DiIulio “pushed the horizon back ten years and raised the ante.” This time DiIulio projected that “by the year 2010, there will be approximately 270,000 more juvenile super-predators on the streets than there were in 1990.” Like a Baptist apocalypse forecaster, the moment the sky didn’t fall according to prophecy, a new doomsday was announced, with just as much confidence as the last.\nSo despite all evidence to the contrary, segments of the Right continued to anticipate “a bloodbath of teenager-perpetrated violence,” perpetrated by “radically impulsive, brutally remorseless” “elementary school youngsters who pack guns instead of lunches” and “have absolutely no respect for human life.”\nThe notion gained political cache, and was spoken of in Congress and on the national media. It was even propagated, and given a major credibility boost, by one or two prominent liberals, perhaps the most prominent of whom was Hillary Rodham Clinton.\nThere was always a race element to the superpredator theory, which is why The New Jim Crow author and legal scholar Michelle Alexander says Clinton “used racially coded rhetoric to cast black children as animals.”\nIt wasn’t just subtext; DiIulio spoke in explicitly racial terms. “By simple math,” he wrote, “in a decade today’s 4-to-7-year-olds will become 14-to-17-year-olds. By 2005, the number of males in this age group will have risen about 25 percent overall and 50 percent for blacks. [emphasis added] To some extent, it’s just that simple: More boys begets more bad boys . . . [The additional boys will mean] more murderers, rapists and muggers on the streets than we have today.”\nDiIulio speculated that “the demographic bulge of the next 10 years will unleash an army of young male predatory street criminals who will make even the leaders of the Bloods and Crips — known as OGs, for ‘original gangsters’ — look tame by comparison . . . ” DiIulio explained that these boys traveled in “wolf packs,” and that black violence “tended to be more serious” than white violence, “for example, aggravated assaults rather than simple assaults, and attacks involving guns rather than weaponless violence.”\nMichelle Alexander may therefore overstate the extent to which the superpredator language was “coded” in the first place; the theory’s most prominent advocate was openly stating that the “wolves” in question were black. He could only have been more explicit about his meaning if he had simply written the “n-word” over and over on the op-ed page of the Wall Street Journal.\nIn the years since, nearly everyone has abandoned the superpredator story, for the essential reason that it was, to put it simply, statistically illiterate race-baiting pseudoscience. As a group of criminologists explained in a brief to the Supreme Court, “the fear of an impending generation of superpredators proved to be unfounded. Empirical research that has analyzed the increase in violent crime during the early- to mid-1990s and its subsequent decline demonstrates that the juvenile superpredator was a myth and the predictions of future youth violence were baseless.”\nIn fact, the criminologists had “been unable to identify any scholarly research published in the last decade that provides support for the notion of the juvenile superpredator.” Among the criminologists who filed the brief were John DiIulio and James Q. Wilson, who humbly conceded that their findings had been in error.\nThe harm done to young people, however, was incalculable.\nHaving been scientifically diagnosed as remorseless and demonic, poor children accused of crimes were increasingly given the kind of harsh punishments previously reserved for adults. New York University criminologist Mark Kleiman says there was a direct link between that single “fallacious bit of science” and the expansion of the use of the adult justice system to prosecute children.\n“Based on [the superpredator theory],” Kleiman writes, “dozens of states passed laws allowing juveniles to be tried and sentenced as adults, with predictably disastrous results.” As the Equal Justice Initiative has observed, “the superpredator myth contributed to the dismantling of transfer restrictions, the lowering of the minimum age for adult prosecution of children, and it threw thousands of children into an ill-suited and excessive punishment regime.”\nIn early 1996, the Sunday Mail described the panic that was overtaking Illinois:\n“It’s Lord of the Flies on a massive scale,” Chicago’s Cook County State Attorney Jack O’Malley said . . . We’ve become a nation being terrorized by our children . . . ” Already, the State of Illinois has introduced new laws to deal with this terrifying new “crime bomb,” ruling that children as young as 10 will be sent to juvenile jails. The State is rushing construction of its first “kiddie prison” to replace the traditional, less punitive “youth detention facility” to enforce the get-tough policy of jail cells instead of cozy dormitories.\nThe shift to viewing kids as comparable to the worst adult offenders allowed all manner of abuses to be inflicted on young people for whom the effects are especially damaging. Juvenile solitary confinement has been routinely used in American prisons, despite having been recognized as a form of torture by United Nations Human Rights Committee. Kids have been held in tiny cells for twenty-three hours per day, leading to madness and suicide.\nThe practice produces stories such as that of Kalief Browder, who was sent to Rikers Island jail at the age of sixteen, spending two years in solitary confinement awaiting trial for stealing a backpack, and ultimately killing himself after finally being released and having the charges dropped. A joint report by the ACLU and Human Rights Watch, which interviewed over one hundred people who had been held in solitary confinement while under the age of eighteen, summarized some of the intense psychological torment inflicted:\nMany of the young people interviewed spoke in harrowing detail about struggling with one or more of a range of serious mental health problems during their time in solitary. They talked about thoughts of suicide and self-harm; visual and auditory hallucinations; feelings of depression; acute anxiety; shifting sleep patterns; nightmares and traumatic memories; and uncontrollable anger or rage. Some young people, particularly those who reported having been identified as having a mental disability before entering solitary confinement, struggled more than others. Fifteen young people described cutting or harming themselves or thinking about or attempting suicide one or more times while in solitary confinement.\nHousing juveniles in adult facilities can be an equally inhumane practice in itself. As the weakest members of the population, juveniles housed in adult facilities are likely to be brutally raped by older inmates, and are at an increased risk of suicide.\nT. J. Parsell was sent to prison in Michigan at the age of seventeen for robbing fifty-three dollars from a one-hour photo store using a toy gun. He describes his arrival:\nOn my first day there — the same day that my classmates were getting ready for the prom — a group of older inmates spiked my drink, lured me down to a cell and raped me. And that was just the beginning. Laughing, they bragged about their conquest and flipped a coin to see which one of them got to keep me. For the remainder of my nearly five-year sentence, I was the property of another inmate.\nTeenagers like Parsell were being housed in adult facilities long before the “superpredator” horror stories. But the more young offenders are dehumanized, the more dilapidated becomes the thin barrier of empathy that keeps society from inflicting psychological, physical, and emotional torment on the weak. As Natasha Vargas-Cooper writes, while “the scourge of the super-predators never came to be … the infrastructure for cruelty, torture, and life-long captivity of juvenile offenders was cemented.”\nBut to say the “superpredator” notion has been “discredited” is to overestimate the extent to which it was accepted in the first place, and risks exonerating those who recited the term during the mid nineties. The moment the “superpredator” concept was introduced, reputable criminologists stepped forward to rebut it. Few serious scholars gave the notion any credence, and they made their objections loudly known.\n“Everybody believes that just because it sounds good,” the research director of the National Center for Juvenile Justice told the press in 1996. Harvard government professor David Kennedy said that “What this whole super-predator argument misses is that [increasing teen violence] is not some inexorable natural progression” but rather the product of “very specific” social dynamics such as the easy availability of guns.\nOther public policy experts called the idea “unduly alarmist” and said its proponents “lack a sense of history and comparative criminology.” DiIulio himself didn’t try to persuade the rest of his field; the Toronto Star reported that “asked recently to cite research supporting his theory, DiIulio declined to be interviewed.”\nThe political conservatism of the theory was hardly smuggled in under cover of night. DiIulio’s “Coming of the Super Predators” first appeared in William Kristol’s conservative Weekly Standard, and the handful of scholars who peddled the theory had strong, open ties to right-wing politics, so it was plainly partisan rather than scholastic.\nEven the language used by the professors, of “Godless” and “brutal” juveniles without “fixed values,” was plainly the talk of Republican Party moralists, rather than dispassionate social scientists. Nobody in the professional circles of a “children’s rights” liberal like Hillary Clinton would have given the “superpredator” concept a lick of intellectual credence, even when it was at the peak of its infamy.\nIt was therefore deeply wrong to spread the lie even when it was most popular. Yet to defend it in 2016, as Bill Clinton did, is on another level entirely.\nWhen Bill Clinton said in Philadelphia that he didn’t know how else one would describe the kids who got “thirteen-year-olds hopped up on crack and sent them out to murder” other kids, he revived an ugly legend that led to the incarceration and rape of scores of young people.\nSpeaking this way can still have harmful ripple effects. When Washington Post writer Jonathan Capehart reported Hillary Clinton’s apology for her remark, he implied that superpredators did exist, but that they didn’t include upstanding young people like the Black Lives Matter activist who had challenged Clinton. Folk tales are slow to die, and people’s fear of teen superpredators is easily revived.\nIt took years to debunk this tale the first time around; once people believe that young people are potential superpredators, they become willing to impose truly barbaric punishments on kids who break the law.\nAfter all, if such offenders are not actually children, but superpredators, one need not empathize with them. One can talk in terms like “bring them to heel,” which is the sort of thing one says about a dog.\nIt may have been surprising, given that Hillary Clinton has made a strong effort to connect with African-American voters, that Bill Clinton would have revived a nasty racist cliché about animalistic juveniles. But in fact, this simultaneous maintenance of warmth toward individual African Americans and support for policies that hurt the African American community has been a consistent inconsistency throughout Bill Clinton’s political career.", "url": "https://www.jacobinmag.com/2016/09/bill-clinton-hillary-superpredators-crime-welfare-african-americans/"}