{"authors": ["Jedediah Britton-Purdy", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:40", "date_modify": "2020-05-04 19:54:40", "date_publish": "2016-12-17 00:00:00", "description": null, "filename": "2016_12_bernie-sanders-kenosha-chris-hayes-msnbc-town-hall-trump_1588622080.html", "image_url": "https://images.jacobinmag.com/2016/12/17232724/25989181150_2173577257_k-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_12_bernie-sanders-kenosha-chris-hayes-msnbc-town-hall-trump_1588622080.html", "title": "Power and Persuasion", "title_page": "Power and Persuasion", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Bernie Sanders’s nationally televised MSNBC town hall in Kenosha, Wisconsin earlier this week was a vivid reminder that political argument is strange, hard, and absolutely necessary to the Left. It was also a reminder of what political argument looks like when it is not pious or tribal, but instead entirely serious about both power and principles.\nThe network put Sanders in a United Auto Workers hall in a place that voted narrowly for Donald Trump on November 8, the first time Kenosha had supported a Republican since Richard Nixon in 1972. Sanders sat on stage with host Chris Hayes and a panel of Trump voters. There were two blue-collar guys, one a union member and longtime Republican, the other an Obama voter who had backed Sanders in the Democratic primary. There was a pair of women whose backstories were less developed, one with a middle-class affect of slightly strained businesslike niceness, the other working class and blunt to the point of pugnacity.\nIt was with the second woman, Gail Sparks, that Sanders had his most memorable exchange of the evening. Reema Ahmad, a Muslim audience member and community organizer had just spoken about Trump’s “campaign of hate.” Jamie Selena, the other woman Trump voter, quickly insisted, “I would never want to see anyone thrown out [of the country] just because of their beliefs. It’s awful.”\nThe two men also distanced themselves from Trump’s anti-Muslim and anti-immigrant appeals, which they called unconstitutional and “unimplementable.” But Sparks said, “I hope he does” deport undocumented migrants, and went on to blame them for low wages at her factory job: “Because there are so many illegals in there, I can’t get the pay I should get.” She went on to report, “it’s been said on the radio” that undocumented people dodge traffic tickets and taxes — “they go to Mexico and hide.”\nSparks was not looking like the most promising prospect for Sanders when, a minute later, she took control of the stage to ask the audience, “Who pays for the Medicare, for the Medicaid?” and raised her palms upward to amplify the reply, “We do.” “And” — she went on — “down on the streets, do you ever feel like we are becoming the silent minority? . . . The people? . . . Who listens to us, really?”\nIt sounded like a classic Trump cocktail: nativism, economic threat, political alienation, and grim hints that “the people” is a smaller and more exclusive group than those who happen to live, work, or even vote here.\nThen Sanders stepped in. He asked — a little professorially — whether Sparks believed that Social Security and Medicare should not be cut. She strongly agreed. He pivoted to “a very fair point” Sparks had raised: who will pay for the programs?\n“What all of us need to know,” Sanders said, “is that over the last twenty-five years in this country, there has been a massive transfer of wealth . . . from you to the top one-tenth of one percent. The middle class has shrunk, and trillions of dollars have gone to the top one-tenth of one percent. Do you think it’s inappropriate to ask those people to start paying their fair share of taxes, so that we can adequately fund Medicaid and make public colleges and universities tuition-free? Is that an unfair thing to ask?”\nSparks missed only a beat: “I don’t think it’s an unfair thing to ask. The one-percenters, they got rich off us. So it’s time they put back.”\n“That’s all I’m saying,” Sanders replied to applause, and what seemed to be newfound agreement from Sparks. It was, for a moment, as if the seasoned social democrat had exorcised Trumpism, with its nativist nightmares, and brought old-fashioned class politics blinking into twenty-first century daylight.\nSome were less impressed. Writing in Vox, Jeff Stein threw cold water on Youtube-fueled enthusiasm for Sanders’s deft forensics. Yes, the audience cheered Sanders’s attacks on economic inequality, the political establishment, and trade liberalization, Stein acknowledged. But there was plenty of skepticism about who would foot the bill for universal health care and free higher education, and concern that raising the minimum wage would just raise prices.\nThe anti-Sparks was Mary Magdalen Moser, who called tuition-free college “so absurd” that it was “the moment I stopped listening to anything else that came out of [Sanders’s] mouth.” For Stein, such comments show that the Rust Belt is not peopled by social-democratic stalwarts just waiting for a candidate.\nFair enough. But to interpret Sanders’s exchanges with Trump voters and other audience members as a kind of focus-group test for social democracy misses the most important thing Sanders was doing: persuading. (“Persuasion,” coincidentally, is what the Clinton campaign headquarters ostentatiously told operatives in Michigan, just across the lake from Wisconsin, to ignore.)\nMost people, unlike academics and political professionals, tend not to have stable sets of policy views that line them up for or against what Sanders calls democratic socialism (or any other ideology, for that matter). They have experiences — frequently of frustration, often of disrespect. They have, too, a sense of friends and enemies.\nPersuasion — political argumentation — organizes these elements into what are antiseptically called policy views.\nAt the first cut, what Sanders’s interlocutors thought about social spending depended on whether it would serve their enemies, as Gail Sparks seemed to start out suspecting, or make their enemies pay their fair share, as she concluded when Sanders brought her around to “it’s time they put back.”\nDemocratic Party liberals are not very good at having enemies. (All-out attacks on the character of one person don’t count, no matter how richly Donald Trump deserved them; neither does the condescension of Hillary Clinton’s “basket of deplorables” line.) Some combination of decency, nervousness, and conviction that there must be a win-win pony hiding somewhere leaves them seemingly unable to say that, on certain fronts, they favor some Americans having less so that others can have more. But that is distributional politics, and all real politics has a distributional edge, whether or not it can speak its name.\nIn fact, skepticism and complaints from Trump voters at the forum — about being asked to pay for others’ education when they have paid for their own children’s, about whether anyone really deserves more than “the opportunity” to go to college — were reminders that the Right has always had a distributional politics, one based on the zero-sum suspicion that someone, somewhere, is getting something undeserved, and possibly even picking your pocket.\nFrom individual suspicion of taxes and social provision, this politics builds the larger-scale protection of great fortunes that is the raison d’etre of the modern Republican Party. Just how easily the “who will pay for it?” question came, when the US already devotes 17 percent of its economy to health care under the present private-public hodgepodge (much more than other rich countries, which have more socialized health systems), and is pouring money into insurance and pharmaceutical coffers, is a sign that left distributional politics has faded.\nThe superior cost efficiency of single-payer systems should be as commonsensical as “Who will pay?” Instead, too often common sense is the common sense of business.\nSanders’s comfort with the languages of friends and enemies doesn’t mean he descended into a Trumpist festival of enmity. (Trump rallies were rhetorical first-person-shooter games in which the candidate smoked a series of internal and external enemies.) Over and over, Sanders posed principles, often as questions or as expressions of his own conviction. Do you think Medicare and Social Security should not be cut? Do you think it’s unfair to ask the wealthy to pay more in taxes? “I think it’s grossly unfair that working-class kids do not have the income to pay for college.”\nSanders was striving to bring the Kenosha audience into a principled discussion, but he clearly knew that, to make that happen, he had to convince people of the principles they might share. These were not abstract points of political theory, but concrete demands on the state and other citizens, rooted in a sense of what you need, and where you might get it.\nThe core point of universalist programs is to turn legitimate self-interest into a common interest, and, through the expansion of social rights (housing, education, health care), to relax the paranoiac worry that someone else, probably less deserving, is sneaking off with your share.\nThe most poignant aspect of the forum may have been its setting: a UAW hall. Just a few decades ago, especially (but by no means only) in the upper Midwest, organized labor was intimately involved in the political life of the country. Union halls doubled as spaces for civic life and democratic engagement.\nUnions would carry out political education — not in the anodyne, civics-class sense, and not even in the stronger sense of organizing needs and grievances into agendas, though that was important. Most of all, they taught members how to think about the exercise of power and its consequences. In that work, solidarity was not just a pleasant or noble feeling, but a source of concrete leverage.\nThis kind of political knowledge was vivid in its absence at the Kenosha forum: audience members talked about electing Trump as a chance to shake the system a little, a way of dodging a distasteful vote for Hillary. They assured one another that Trump’s anti-Muslim posturing would go nowhere — after all, wouldn’t it be unconstitutional? They skidded back and forth between seemingly giving up on the government and professing total faith in its self-discipline and virtue. Amid it all, Sanders tried to replicate some of the political work that unions did at their peak.\nYet despite conjuring up old union values in the heart of the old union country, Sanders’s arguments were anti-nostalgic. He didn’t offer any Springsteen- (or Reagan-) style paeans to the factory. Instead, he praised the service-industry workers of Nevada: “There’s nothing holy about someone in a factory making more money than someone making beds. If you have a strong union — every human being has the same needs, whether you work in a factory or you work in a hotel.” The people who clean the toilets in Las Vegas, Sanders said, don’t need to be low-wage workers, or second-class citizens.\nBut that takes democratic power, and behind power is organizing. People who learn to use such power are changed by it: larger-minded but also more realistic, more radical but also more experienced. Sanders was working in Kenosha to remind people how it might feel to center a politics on that kind of power.", "url": "https://www.jacobinmag.com/2016/12/bernie-sanders-kenosha-chris-hayes-msnbc-town-hall-trump"}