{"authors": ["Treva Lind"], "date_download": "2020-05-04 20:22:27", "date_modify": "2020-05-04 20:22:27", "date_publish": "2016-11-27 00:00:00", "description": "Jeff Edwards admits he’s easy to find at the Corbin Senior Activity Center, where he works as its new director. First, at 37, Edwards tends to be the youngest guy around. Visitors then...", "filename": "_c107f9f57bf044358e5e09bf2fe68602_1588623747.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c107f9f57bf044358e5e09bf2fe68602_1588623747.html", "title": "New director brings youthful energy to Corbin Senior Activity Center", "title_page": "New director brings youthful energy to Corbin Senior Activity Center", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jeff Edwards admits he’s easy to find at the Corbin Senior Activity Center, where he works as its new director.\nFirst, at 37, Edwards tends to be the youngest guy around. Visitors then notice the twang of his Memphis accent.\n“Usually, people ask me where I’m from,” said Edwards, who found his way to Spokane via his wife, who is from here. “Texas is usually their first guess.”\nHe joined Corbin on Oct. 1, after previous youth nonprofit work and a stint doing marketing and ad copywriting.\n“It was the energy here that let me know I was in the right place – down to the board members and including all the programs Corbin offers,” said Edwards, who credits more than 100 volunteers as contributing to the center’s vitality.\nHe sees one of his first jobs as introducing more Spokane-area residents to the center’s programs and social offerings. Corbin has close to 1,000 members who pay annual dues of $26 for individuals, or $36 for a couple.\n“I have a heart for seniors 2 miles down the road who don’t know we’re here,” he said.\n“This is like Grand Central Station for seniors. There’s sewing, classes about different cultures. We have a Wii bowling activity. There’s everything from tap-dancing grannies to day trips. We have a trip going to China next year.\n“We partner with Meals on Wheels as a congregate site and also a drop-off location where people take the meals out to residents.”\nEdwards replaced longtime director Christa Richardson, who retired, and he jumped into the position just as the two-story center, at 827 W. Cleveland Ave., prepares to start a long-awaited $400,000 elevator installation project. Other work will add fire sprinklers and power system upgrades.\nBut center members also see Edwards as someone to deliver other updates, said board President Jen Taylor, from improving the center’s online presence to marketing for better visibility both in the Emerson-Garfield neighborhood and Spokane. That includes attracting more baby boomers.\nEdwards already has taken steps for the center’s website redesign, and he organized a new veterans lunch after finding business sponsorships, Taylor said.\n“He has the skills and a view of what future members are going to look like,” said Taylor, 45. “He immediately set out looking for grants and found $2,000 to renew and update all of Corbin’s social media and website. He’s a go-getter.”\nRaised near Memphis, Edwards graduated in 2001 from Union University in Jackson, Tennessee, with a political science degree. After college, he went to work at the nonprofit Youth Villages, which he said works with emotionally troubled youth in about 12 states.\nEdwards most recently was assistant director of foster care and adoption for the Memphis office.\n“It turned into a 13-year career in nonprofit management,” said Edwards, who later earned a master’s degree in public administration. “While working there, I met a pretty lady from Spokane.”\nHis wife, Jennifer Edwards, is an East Valley High School graduate who worked at Youth Villages after earning a degree in social work from Eastern Washington University. They married in 2007.\nThe couple had talked about moving here before their children – ages 7, 4, and 2 – got much older.\n“It’s hard to find work clear across the country,” Edwards said, “but it just so happened about two years ago, I started a blog for friends to cover serious issues, often veteran issues, with humor.”\nHis blog, Unprecedented Mediocrity, grew to attract more than 2 million readers. With that success, he left Youth Villages just over a year ago to focus full time as a freelance marketing writer. The family moved to Spokane in August 2015.\nEdwards also is a veteran; he joined as a U.S. Marine Corps Reserve member at age 17 and served about six months in Iraq during 2003. He was part of the 3rd Battalion, 23rd Marine Regiment, based in the city of Al Kut shortly after Baghdad fell, before the insurgency began.\n“We were welcomed,” he said. “There were random firefights here and there, but for the most part, it was dealing with the aftermath. I write about that a lot on my blog; I write from the absurd, and it takes people’s guard down if they laugh about it.”\nAfter his Iraq tour, he worked briefly in China, teaching public school English before returning to Youth Villages. Although his writing work became successful, Edwards said he felt a tug a few months ago to return to nonprofit management.\n“I decided I wasn’t cut out to work alone at home in the basement,” said Edwards, as he glanced around his lower-level office. “I realize the irony that I still work in a basement, but people find me, and I have a window.”\nHe’s since stopped freelancing but still writes occasional blog posts.\n“I wanted to jump back into nonprofit management. I was always part of a group that could have a social impact.”\nAt Corbin, he oversees an annual budget of about $400,000. He’s among about four employees, he said, and some seniors work there short-term to learn job skills, in partnership with Aging and Long Term Care of Eastern Washington or AARP.\nThe center recently received a $300,000 state grant toward its elevator project that’s expected to start in January and wrap up by the end of March, he said. At the former church, people in wheelchairs now use a long winding ramp on the building’s north side.\nEdwards said another priority is to ensure that Corbin remains financially solvent. As do other regional senior centers, Corbin receives some Spokane Park Board funds, he said. But fundraisers, donations, memberships and some tour income contribute significantly to its budget.\n“We have some kind of fundraising event about once a month, but we have a lot of social events,” he said. People also can rent space in its Henderson Room for events.\nCorbin mainly draws members from north Spokane, but some travel from Spokane Valley, Mead and Chattaroy.\n“People will go where the activities are,” he said. “Technically, anyone from 18 and older can join the center. I joined. It helps support the institutions of the center.”\n“I was talking to a young lady, in her 90s now, and she’s been coming here for 30 years. I thought how remarkable it is that those volunteer hours and dollars are still hard at work today. It’s not uncommon that memberships last for decades.”\nIntergenerational activities also aren’t uncommon, Edwards said. For example, the China trip likely will attract an older grandchild or young adult child attending with a senior.\nEdwards’ work so far has included meeting with other aging agencies and nonprofits, and attending a regular meeting among directors of senior and youth centers. When in the wider community, he’s surprised to hear people say they don’t know about the center.\nCorbin started as a senior program in 1967, in the former Corbin Park Methodist Church. After organizers secured grant money, the first activities were launched that year.\n“Many people have told me they don’t know what they’d do without the activity center,” Edwards said. “The more seniors stay engaged and communal, they lead healthier lives.\n“Membership means something a little different to every member. Some like coming to the building. Some just like the tours. Some just like the activities, like tap-dancing grannies.”\nOverall, Edward said he enjoys living in Spokane, including outdoor activities and winter.\n“My kids got to build a snowman that stood up for the first time,” he said. “I do miss … good sweet tea. I don’t even order sweet tea anymore, because I just sit there and judge it.”\nBut he’s found another benefit here from his interaction with Corbin’s older generations. “I love the candidness of the conversations. I can walk into any room, talk to someone, and gain from a lifetime of experiences. It’s a good spot to be for someone my age.”", "url": "https://apnews.com/c107f9f57bf044358e5e09bf2fe68602"}