{"authors": ["Rick Smith", "Wral Techwire Editor"], "date_download": "2020-05-04 20:19:06", "date_modify": "2020-05-04 20:19:06", "date_publish": "2016-11-04 01:50:00", "description": "NetApp is laying off some 650 workers - or 6 percent of its work force - in the latest round of job cuts to hit the tech storage firm. However, a spokesperson won't say how many layoffs will...", "filename": "_71cfcb4b0f60fcd7b9250dbc2128ca39_1588623546.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_71cfcb4b0f60fcd7b9250dbc2128ca39_1588623546.html", "title": "NetApp cuts 6% of work force, won't say how many layoffs to hit RTP", "title_page": "NetApp cuts 6% of work force, won't say how many layoffs to hit RTP", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NetApp cuts 6% of work force, won’t say how many layoffs to hit RTP\nNetApp is laying off some 650 workers - or 6 percent of its work force - in the latest round of job cuts to hit the tech storage firm.\nHowever, a spokesperson won’t say how many layoffs will be made at its RTP locations.\nThe spokesperson did tell WRAL TechWire that NetApp won’t meet job targets agreed to as part of tax incentives in return for expansion.\nThe latest cuts come just nine months after NetApp laid off 12 percent of its workers.\nThe layoffs were announced Thursday.\nNetApp is seeking to refocus as a company on emerging flash memory technology as the storage industry undergoes a major transformation with cloud computing and appliance virtualization impacting traditional server technology.\n“Over the past year, our CEO George Kurian has shared how NetApp has been transforming our business to improve productivity and lower our cost structure to align with our revenue expectations and fund investment in growth areas,” NetApp said in an email statement sent to WRAL Tech Wire.\n“We are starting to see results from these investments that position us to lead in the parts of the market that are growing, like all flash arrays, next-generation data centers and hybrid cloud solutions.\n“On November 3, we communicated to our employees that we will be undertaking a global restructuring as a part of planned transformation efforts. This will impact approximately 6 percent of our work force. We remain confident that with sustained execution, we can expect a return to moderated growth in our FY18 (which begins in May 2017).”\nNetApp has invested heavily in its RTP campus over the years and dedicated a 155,000 square foot lab in May 2014. At the time, NetApp said it expected to add “on the order of 150 new positions” to a work force that was then estimated at around 1,600.\nIn a Q&A with WRAL TechWire, the spokesperson said the company remained committed to the RTP operation but that agreed-to job targets would not be hit and that NetApp “defaulted” on an agreement in 2015.\nNetApp declined to “break out employee numbers by location.”\nThe spokesperson also would not say how many layoffs were made in RTP in the March layoffs. “We do not break out employee numbers by location,” she said. “In our last 10-K filed in June 2016 we disclosed that approximately 1,110 employees across the company were affected as part of our March 2016 restructuring plan.” Asked about the commitments to receive the so-called Job Development Investment Grants, or JDIGs, she noted:\n“We entered into job creation contracts in [calendar year] CY2004 and CY2007 and we met our targets for both contracts.\n“We entered into a third contract in CY2012 and met our requirements for CY2013 and CY2014.\n“Given the state of the industry, we defaulted on the job creation target for CY2015, and don’t foresee an opportunity to meet the growth projection terms of this contract for this current calendar year. We will work with the state to determine the appropriate next steps.”\nResponding to questions about the importance of RTP to NetApp (Nasdaq: NTAP), she explained: “The team at our RTP facility focuses on product development, marketing, field operations, research and development, and customer success, support and services. The mission of staff in the two global labs at the RTP site -- to develop the innovations our customers need --continues to be a vital part of our corporate strategy. “We are committed to RTP and our facility here is a key asset for our business going forward.”", "url": "https://apnews.com/71cfcb4b0f60fcd7b9250dbc2128ca39"}