{"authors": ["Scott Maben"], "date_download": "2020-05-04 21:07:09", "date_modify": "2020-05-04 21:07:09", "date_publish": "2016-11-09 00:00:00", "description": "Running on little sleep after a trade mission to China followed by Tuesday’s election, Idaho Gov. Butch Otter was buoyant Wednesday about a Donald Trump presidency, the state’s lively economy and...", "filename": "_d017fad1751440ae91f2fc6bdd54187a_1588626429.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d017fad1751440ae91f2fc6bdd54187a_1588626429.html", "title": "In Coeur d’Alene stop, Idaho governor ‘bullish’ on Trump presidency", "title_page": "In Coeur d’Alene stop, Idaho governor ‘bullish’ on Trump presidency", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Running on little sleep after a trade mission to China followed by Tuesday’s election, Idaho Gov. Butch Otter was buoyant Wednesday about a Donald Trump presidency, the state’s lively economy and plans to better prepare its workforce.\n“I’m bullish. I’m really optimistic on a Trump administration,” Otter said in remarks to several hundred businesspeople and community leaders in Coeur d’Alene.\nThe billionaire businessman’s victory over Hillary Clinton “was, if not a mandate, at least a manifestation we didn’t want things to go on that were going on,” the Republican governor said.\nHe also expressed gratitude for the Electoral College giving voice to states with smaller populations. Without it, Idaho would have little influence on national elections, Otter said.\n“Because of our four electoral votes, when (Trump) hit 274 votes, I said yes!” he said. “If we didn’t have the Electoral College, eight cities in the United States could elect the next president.”\nAnd despite initial market jitters overnight, the surge in the stock market Wednesday reflects investors’ expectation that Trump will deliver on campaign promises to lower taxes and offer incentives for large corporations to repatriate large stockpiles of cash parked offshore, Otter said.\n“I tell ya, they’re all waiting in line to bring that money home,” he said.\nOtter also said he was encouraged by Trump’s conciliatory tone in Tuesday night’s victory speech. “He’s a totally different person” than Americans saw throughout the campaign, he said.\nThe governor also gave a shoutout to the trade delegation he led last week to China, the state’s second-largest export destination behind Canada. The group visited Beijing, Shanghai and Guangzhou to promote emerging high-tech products as well as potatoes, milk, wheat and hay.\n“The world is waiting for a lot of stuff,” Otter said. “All they need is everything we’ve got, and we can supply that.”\nThe state’s economy is doing well, he said, pointing to an expanding manufacturing payroll, healthy construction activity and housing starts that are up 24 percent over last year.\nA concern, however, is the 30,500 residents presently out of work, even though employers can’t fill 22,800 jobs because of a serious skills gap, Otter told the lunch crowd at the Best Western Plus Coeur d’Alene Inn. That includes 5,800 jobs in the health care sector, as well as many positions as long-haul truckers, he said.\nThree years from now, Idaho is expected to have 95,000 jobs it can’t fill, according to a Department of Labor projection.\nOtter said he’ll be back before the Legislature in the upcoming session with his proposal to offer adult students scholarships to finish college degrees or professional certificates and advance their prospects in the job market. Lawmakers turned down his $5 million college completion program in the last session.\n“You’re going to see it again,” he promised.\nOtter said state leaders next year also will need to review Idaho’s involvement in Obamacare, which Trump repeatedly has vowed to repeal.\nHe expects the changes “will unleash the private insurance companies to work their magic in the marketplace. Lord knows, we might even be able to buy insurance from Washington, if we want, or Montana, across state lines.”\nAfter the Affordable Care Act was passed, the state reluctantly set up a state insurance exchange, named Your Health Idaho, which provides plans to about 107,000 previously uninsured residents. Nearly 90 percent who buy insurance through the exchange qualify for federal tax credits to offset the cost.", "url": "https://apnews.com/d017fad1751440ae91f2fc6bdd54187a"}