{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:17:29", "date_modify": "2020-05-04 20:17:29", "date_publish": "2016-10-02 15:24:00", "description": "Joseph Roy Dee Jr. (Roy), 84, of Aliceville, Alabama, passed away peacefully in his home Sept. 30. He was the only child of Joseph Roy Dee and Page Massie Dunlap Dee, born Jan. 25, 1932, in...", "filename": "_b4c18a9898954854a32d406a2461044c_1588623449.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b4c18a9898954854a32d406a2461044c_1588623449.html", "title": "Obituary: Joseph Roy Dee Jr.", "title_page": "Obituary: Joseph Roy Dee Jr.", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Joseph Roy Dee Jr. (Roy), 84, of Aliceville, Alabama, passed away peacefully in his home Sept. 30.\nHe was the only child of Joseph Roy Dee and Page Massie Dunlap Dee, born Jan. 25, 1932, in St. Petersburg, Florida.\nOn Feb. 23, 1952, Roy married Mary Ann Fanning at St. Francis Church, Tuscaloosa, Alabama. She preceded him in death in May 2013.\nHe is survived by 11 children, Coleen (Merle) Butterick, Teresa (Jim) Salmon, Katie (Steve) Banks, J. (Debbie) Dee, Susie Crabb, Annie Dee (Ed Sikora), Sara (Dave) Kroeger, Ellen Bass, Patty Dee (Danny Hutchinson), Jean (Matt) Lewis, and Mike (Shannon) Dee. Also survived by 33 grandchildren, Katrina Butterick, Michael (Heather) Butterick, Sean (Katie) Salmon, Ian Salmon, Melanie Banks, Page (Jay) Kuhlman, Shelly (TJ) Euell, Joseph (Lindsey) Dee, Erin (Chris) Denniston, Patrick Dee, Stanton (Lindsey) Crabb, Rachel (Michael) Bernhard, Seth (Jodie) More, Jesse (Leslie) More, Mary Sikora, Martha Sikora, Taylor Dee, Amanda Dee, Ben (Lauren) Kroeger, Drew Kroeger, Alissa (Scott) Trail, Amber Wilkinson, Adam (Elizabeth) Wilkinson, Chelsea Bass, Callie Bass, Gena (Leroy) Kelley, Nicholas Fischer, Colin Fischer, Alexis (Jonathan) Brown, Jessica Lewis, Victoria Dee, Isabella Dee, Lily Catherine Dee and 26 great grandchildren.\nPreceding him in death were his parents, his wife of 61 years, and son, John Richard Dee.\nRoy received his grammar school education at St. Paul’s School, St. Petersburg, Florida, at St. Mary’s School in Mount Carmel, and the public schools in Fairfield, Illinois. He spent one year at Admiral Farragut Military Academy in St. Petersburg, Florida and received his high school diploma from St. Leo’s Academy in St. Leo, Florida.\nHe attended Notre Dame University for one year and finished his formal education at the University of Alabama, majoring in business administration.\nPrior to joining Dee Drilling Company in 1956, he worked for two years at the First National Bank of St. Petersburg, Florida. He served as past president of Dee Building, Dee Drilling Company, Illinois Mid-Continent Company and Dee River Ranch.\nHe is noted for taking a rotary rig from Illinois to Ohio in 1964 to drill wells using “advanced hydraulics” and was featured on the cover of “Hughes Ridgway” magazine in 1965. He was one of the original 81 Unit Holders of the Gatorade Trust and sat on the board of Atlanta LaSalle for several years.\nHe was a member of Corpus Christi Catholic Church in Macon, Mississippi and former member of St. Mary’s Catholic Church in Mount Carmel. He was a supporter/partner of the Dwelling Place in Brooksville, Mississippi and a member of the Elks, Fourth Degree Knights of Columbus, Moose, Eagles, Union League Club of Chicago and St. Petersburg Yacht Club.\nRoy was an oil producer, avid farmer, fisherman and hunter. While residing in Mount Carmel, he was an expert shooter and long-time member of the Grayville Gun Club.\nThere will be a visitation Oct. 4, from 5 - 7 p.m. at Dogwood Chapel in Aliceville, Alabama. The funeral service will be Wednesday at 10 a.m. at Corpus Christi Catholic Church in Macon, Mississippi.\nIn lieu of flowers memorial contributions may be made to St. Mary’s School Building Fund or Wabash General Hospital Foundation Scholarship Fund in Mount Carmel, Illinois, The Dwelling Place in Brooksville, Mississippi, or Invest An Acre at www.investanacre.org. Skelton Funeral Home in Reform, Alabama is handling arrangements.\nEnvelopes are available at Short-Cunningham Funeral Home, 527 N Mulberry St., Mount Carmel, Illinois 62863.\nCondolences may be made online at www.short-cunninghamfh.com.\nShort-Cunningham Funeral Home is honored to assist Roy’s family.", "url": "https://apnews.com/b4c18a9898954854a32d406a2461044c"}