{"authors": ["Tony Potter Staff Writer Tpotter Hibbingdailytribune.Net"], "date_download": "2020-05-04 20:11:02", "date_modify": "2020-05-04 20:11:02", "date_publish": "2016-10-30 11:00:00", "description": "HIBBING — An Intuit-centric, technology driven accounting firm that works to educate, integrate and utilize user-friendly software and its compatible third party applications has received a huge...", "filename": "_24d06ee631bb4d6b88a2e1cf9980fb3c_1588623062.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_24d06ee631bb4d6b88a2e1cf9980fb3c_1588623062.html", "title": "Hibbing business named ‘Firm of the Future’", "title_page": "Hibbing business named ‘Firm of the Future’", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HIBBING — An Intuit-centric, technology driven accounting firm that works to educate, integrate and utilize user-friendly software and its compatible third party applications has received a huge honor.\n24hr Bookkeeper of Hibbing was recently voted as Intuit’s 2016 Global Firm of the Future. Results of the competition were revealed last week.\n“I was very excited and glad to see our efforts paid off,” said Karine Woodman, founder of 24hr Bookkeeper. “I couldn’t believe that our firm located in a small town is a global winner. We’ve competed against so many others in larger firms and/or other countries. It’s been an honor.”\nThe firm was recognized for its adoption of cloud technologies, vibrant online presence and laser-sharp focus on reshaping the way they meet the needs of their small business clients to ensure long-term success for their practice.\n“24hr Bookkeeper perfectly embodies all of the qualities of a Firm of the Future,” said Rich Preece, vice president of Intuit Small Business Group Accountant Segment. “We salute them for integrating online technologies in all aspects of their business as well as their dedication to becoming a trusted advisor to their small business clients. Their success is an inspiration to Intuit and all firms looking to take their practice to the next level.”\nThe contest began in June with Intuit looking for the most future-ready accounting firm across the globe. An overwhelming number of entries were received from Australia, Canada, the United Kingdom and the United States. 24hr Bookkeeper was named as a top four finalist.\nIn the final open voting period of the judging process, Intuit worked with the four finalists to produce a professional video expressing why they deserved to be recognized as a Firm of the Future, emphasizing their leadership, vision, technological advancements and how they’ve built their firm to be future-ready. The public then voted for their favorite video, ultimately selecting 24hr Bookkeeper as the winner.\n“It’s a great feeling. Knowing that people voted for me was inspiring,” Woodman said. “I feel we are supported by our clients, members of the accounting industry and our vendors.”\n24hr Bookkeeper used many marketing efforts to promote voting, including a Facebook campaign. Staff tapped their network to vote for them and asked for the community’s support as well during the contest.\n“I was hoping that my chances were good. as I have a large network of people throughout the United States,” Woodman said. “However, we never knew where we were sitting throughout the voting, so we pushed through the end.”\nBy being named Intuit’s 2016 Global Firm of the Future, 24hr Bookkeeper was awarded a cash prize of $15,000 — including $5,000 for being a top four finalist. They also earned an all-expense-paid trip to the third annual QuickBooks Connect in San Jose, Calif., where they were connected to, educated and inspired by an all-star speaker lineup along with thousands of business owners, entrepreneurs, accountants and developers in attendance.\nWoodman said they are honored to be recognized by Intuit.\n“Implementing online technologies into our practice has changed the game for us and really helped our firm evolve, opening up new ways to boost our roles as strategic advisors to clients,” she added. “We are humbled by the opportunity to compete alongside so many progressive, future-ready firms, and are thankful to the public who voted for us.”\nThe experience at the QuickBooks Connect was exciting as well.\n“I had so many people walking up to me for pictures and congratulating me,” Woodman said. “So many people have said so many kind words that I feel like the most special person in the world.”\nWinning the designation defines what’s important to 24hr Bookkeeper’ staff.\n“We are a representation of a firm that takes care of our clients and uses technology to work smarter, not harder,” Woodman added.\nThis also proves that hard work does pay off, she said.\n“This will create a lot of opportunity for us, and we have Intuit’s support and efforts to help us propel forward,” Woodman said. “We are going to continue our marketing efforts to grow the businesses in 2017 and work to box up our systems to offer as a business opportunity to other accounting professionals.”\nShe said she doesn’t plan to defend her title next year.\n“It will be time for someone else to have the opportunity to shine,” she said. “We are glad to be the first women-owned business winners as well as the first global winner.”", "url": "https://apnews.com/24d06ee631bb4d6b88a2e1cf9980fb3c"}