{"authors": ["Julia Perkins"], "date_download": "2020-05-04 21:06:40", "date_modify": "2020-05-04 21:06:40", "date_publish": "2016-11-25 21:44:42", "description": "BETHEL - Three fourth-graders sit at a blue table in the back of their science and social studies classroom at Johnson Elementary School, pedaling on what looks like an indoor exercise...", "filename": "_0b175d33b08c49f1b6eb3375c41bc9fe_1588626400.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0b175d33b08c49f1b6eb3375c41bc9fe_1588626400.html", "title": "At Bethel elementary schools, students move and learn", "title_page": "At Bethel elementary schools, students move and learn", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BETHEL - Three fourth-graders sit at a blue table in the back of their science and social studies classroom at Johnson Elementary School, pedaling on what looks like an indoor exercise bike.\nThese desk-bike combos, called kinesthetic learning tables, allow children to move their feet while listening to their teacher or doing other class activities. Johnson has used the tables since 2015 after winning a $22,000 grant from the Bethel Education Fund. Rockwell Elementary School got them last academic year with the help of the Parent Teacher Organization.\nNowell Ibarra, one of the fourth-graders, described the tables as fun and relaxing.\n“When I’m on it, I feel like my brain is moving to learn,” he said, grinning as he leaned forward in his seat and pumped his legs.\nThat is the point, said Johnson Principal Alison Salerno. Exercise increases brain activity, which then helps the students learn, she said.\n“We know that movement enhances and stimulates cognitive development, so we chose to incorporate it in the classroom to improve students’ engagement, focus and retention of information,” Salerno said.\nThe tables also reduce stress, she said, because movement releases neurotransmitters that make the students happier and thus more motivated.\n“When students are stressed, they have more difficulty learning and remembering because their brains go into a defensive mode, which activates the more primitive parts of the brain, thereby hindering learning,” she said. “So when you’re incorporating the kin[esthetic] tables in the classroom, you’re providing movement, you’re decreasing stress and promoting positive attitudes.”\nOwen Powell, a fifth-grader who often uses the kinesthetic tables, said he has noticed this, too.\n“Here I’m usually very stressed,” he said, while sitting at one of the traditional desks in his math class. Then he looked at his classmates at the kinesthetic tables. “Over there, I’m not that stressed.”\nSome classrooms have other types of unconventional seats, such as “wobble” stools or chairs with an exercise ball as the seat. Fourth-grade teacher Theresa Schrader received two grants totaling $2,000 from Target to bring these seats to her room.\nHer students said they love sitting on them.\n“Once we enter Ms. Schrader’s room, we can take all the stress out of our bodies,” fourth-grader Olivia Chamberlain said.\nRockwell also has kinesthetic learning desks, wobble stools and a “disco” seat students can rock and bounce around on. The Parent Teacher Organization gave $200 to each classroom last year for the supplies.\n“They’re able to focus more and concentrate more on the work in front of them when they’re able to move,” Principal Trisha Soucy said.\nAmy Gusitsch, who first told Salerno about the tables when she served as president of the Parent Teacher Organization and now works at the school, said kinesthetic learning has positively affected her fourth-grade daughter.\n“She’s able to exert some of her energy and learn,” Gusitsch said. “She really benefits from the movement...It’s a huge impact on her learning style.”\nAt least one of the rooms students visit each day has the tables. Salerno said teachers set up a rotating schedule or let students sit there when they get antsy.\nSoucy said teachers also incorporate movement into their lessons. For example, in math, the teacher might assign numbers to sections of the room, so that when he or she asks the students what two plus two is, they run to the No. 4 section, instead of staying in their seats and writing the answer.\nTeachers in both schools also have “shake breaks” between lessons so students can get their energy out and be ready to learn again, the principals said.\nThe kinesthetic equipment has been particularly beneficial for students with behavioral problems or those who have trouble focusing, the principals said. On the bikes, these students can get their energy out.\n“[For] your reluctant learners, you’ve now created a venue to build motivation through positive movement,” Salerno said.", "url": "https://apnews.com/0b175d33b08c49f1b6eb3375c41bc9fe"}