{"authors": ["Rand Wilson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:33", "date_modify": "2020-05-04 19:59:33", "date_publish": "2016-11-17 00:00:00", "description": null, "filename": "2016_11_labor-for-bernie-our-revolution-rand-wilson-labor-party-third-party-unions_1588622373.html", "image_url": "https://images.jacobinmag.com/2016/11/17232239/bernieiowa_850_611-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_11_labor-for-bernie-our-revolution-rand-wilson-labor-party-third-party-unions_1588622373.html", "title": "Labor After Bernie", "title_page": "Labor After Bernie", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "RW\nI was Labor Party Advocates #9, meaning I was the ninth member to join Labor Party Advocates, the predecessor to the party. And I was an early and ardent advocate, working to build the Massachusetts chapter from the start. Tony Mazzocchi, the former leader of the Labor Party and president of Oil, Chemical, and Atomic Workers Union, was my mentor.\nHe’s probably rolling over in his grave right now. But we achieved more through the Sanders campaign, within the Democratic Party, than in thirty years of my calling for a Labor Party.\nI think getting to a genuine working-class party is a lot harder than we thought. In particular, when you come up against the reality of municipal and state-level politics, there’s the daily necessity for union leaders to work with politicians, primarily from the Democratic Party (though sometimes from the Republican Party as well) to get things done, to get your appropriations, to win a contract on some particular building trades job, to pass legislation for safe staffing.\nIn the day-to-day life of the union, you’re expected to deliver for your members, and to do that, you’re going to have work with incumbent politicians, with Democratic Party politicians. Naturally they will expect you in turn to support them. So what are you supposed to do? Go off and support some third-party candidate who’s going to wreck their chances of winning? Supporting a minor party candidate because they’re perfect and inadvertently electing your worst enemy will certainly piss off your friends.\nI think we had that experience in the Labor Party — that once you get down to the grassroots level, real politics is a lot thornier, and a lot more complicated, particularly in the winner-take-all tyranny that we have with our two-party system. Third-party activity is really difficult.\nWe tried to get around this dilemma by building the Labor Party without doing electoral politics — without nominating or supporting Labor Party candidates, and instead focusing on organizing around issues like single-payer health care and free college tuition. But it was too complicated. People understand politics to be of an electoral nature. That idea of a party without candidates was too confusing for people.\nThat’s why I’m “Dem-enter.” Bernie’s campaign showed some possibilities in the Democratic Party that frankly I hadn’t envisioned. Part of that has to do with the time we’re in. The party has drifted so far to the right, and become so neoliberal and corporatist that it actually created this opportunity for insurgency. I want to be a part of that insurgency.\nOur objective should still be to have a working-class party. The issue is how do you get there? Look at how the Greens did in this election — they maybe picked up ten seats out of 275 races, and Jill Stein didn’t even get close to the 5 percent threshold needed for federal matching funds. I think it shows you how difficult it is to get taken seriously as a third party in a deeply divided country where people don’t want to waste their vote or have their vote help elect their worst nightmare.\nIt doesn’t look like the Stein vote had much of an impact because it was so pathetically small, but again, people use their votes wisely. If she’d gotten two million votes, or three million votes, everybody would be saying, “You just elected Donald Trump!” And for many well-meaning, progressive people who allied themselves with her politics, some people would probably stop speaking to you. It’d be very divisive in the real world.\nThe Green Party is so disconnected from movements. I bet if you look at her vote, it wasn’t a vote of feminists or Black Lives Matter or labor or even environmentalists who supported her. It’s not indicative of those movements — it’s disconnected — it’s this every-four-years phenomena. That’s not the way you’re going to build an alternative.\nSo with all of the problems of building a third party, we might be better off with trying to pursue a party within a party. It’s a strategy that’s been tried and abandoned before. It’s not like it’s an original idea.\nI’ve never been a Democrat in the past so I’ve never been a part of it. But look at what was accomplished by Bernie’s campaign in this moment, where the social, economic, and political factors aligned so that issues of inequality and the corruption of politics by Wall Street special interests are at the forefront. Maybe now is a good time to challenge the Democratic Party to be either the party of Wall Street or the party of the people. Let’s see if we can call the question. I’m up for that.\nBut I know many people are disgusted with the party. I have a friend who’s worked at GE for many years, up in Lynn, Massachusetts, and before that, at a GE plant in Fitchburg. He’s a lifelong union guy, a working-class, gun-toting factory worker. He lives in a little town in Massachusetts called Westminster, and he’s the chair of the Democratic Party there. He was a big Bernie guy.\nBut after the primary, he was so disgusted with what happened to Bernie that I had to talk him off the cliff of quitting the Democratic Party. I said, “Don’t quit now! I’m just getting into it.” A few months later, he says, “Okay, now I want to be part of taking over the Democratic Party. How are we going to do that?” I said, “Join Our Revolution.”", "url": "https://www.jacobinmag.com/2016/11/labor-for-bernie-our-revolution-rand-wilson-labor-party-third-party-unions"}