{"authors": ["Chris Mays Cmays Reformer.Com", "Cmaysbr On Twitter"], "date_download": "2020-05-04 20:29:13", "date_modify": "2020-05-04 20:29:13", "date_publish": "2016-08-17 01:58:24", "description": "BRATTLEBORO >> Central Fire Station plans were approved Monday night, marking the second project of three to move towards construction as part of the town's police-fire facilities...", "filename": "_11f3f67f83184b2ba99f7ac18ff536d9_1588624153.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_11f3f67f83184b2ba99f7ac18ff536d9_1588624153.html", "title": "Brattleboro Central Fire Station Plans Approved", "title_page": "Brattleboro Central Fire Station Plans Approved", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BRATTLEBORO >> Central Fire Station plans were approved Monday night, marking the second project of three to move towards construction as part of the town’s police-fire facilities project.\n“The existing fire station on Elliot Street will get some renovations and we’re doing an addition on the back with a new apparatus bay and a few other support spaces,” Ray Giolitto, of Northeast Collaborative Architects, told the Development Review Board. “It’s similar to what we had (proposed) a few years ago except the second floor above the new apparatus bay is gone.”\nThree new engine bays are part of the design, which involves having space to fit larger vehicles. The two bays currently facing Spring Street will remain the same and will house the fire department’s smaller vehicles. Part of one of the bays facing Elliot Street will be used for a new administrative area.\nA new hose tower will be installed as part of the northwest corner addition. At three stories high, the bottom floor will be used for storage. A captain’s office, lieutenant’s office, small training room and station watch desk are going to be in an area where the new and existing buildings meet.\nEngineer Kevin Thatcher said there was “no work really proposed” in front of the existing station except the regrading of pavement in order to create a handicap-accessible parking space. Three other parking spaces facing Spring Street also were approved.\nThe DRB approved of the project but required that timers be put on lights. Zoning Administrator Brian Bannon said he could look at a landscaping plan after the town’s Planning Department did not support having only one species of trees on the property.\nWith ground broken at the West Brattleboro Fire Station, the downtown station is up next for construction. The police department is expecting to relocate to 62 Black Mountain Road and will share space with the Reformer newspaper once renovations there are completed. A second environmental assessment is underway to check out materials from the printing process found in the sanitary sewer system on the site.\nCall Chris Mays at 802-254-2311, ext. 273.", "url": "https://apnews.com/11f3f67f83184b2ba99f7ac18ff536d9"}