{"authors": ["Jacob Thorpe"], "date_download": "2020-05-04 21:06:58", "date_modify": "2020-05-04 21:06:58", "date_publish": "2016-12-27 00:00:00", "description": "Field position jump starts Golden Gophers The Minnesota offense could not put together a scoring drive against the Washington State defense early on, going three-and-out on its first drive...", "filename": "_24483d1cec3045ea89f80cbaaebe3b2b_1588626418.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_24483d1cec3045ea89f80cbaaebe3b2b_1588626418.html", "title": "Key moments in WSU’s 17-12 defeat to Minnesota in Holiday Bowl", "title_page": "Key moments in WSU’s 17-12 defeat to Minnesota in Holiday Bowl", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Field position jump starts Golden Gophers\nThe Minnesota offense could not put together a scoring drive against the Washington State defense early on, going three-and-out on its first drive and failing to cross midfield in three attempts. But the Minnesota defense forced a three-and-out of its own halfway through the second quarter, and a short WSU punt gave the Golden Gophers the ball on the WSU 40. Minnesota mustered a game-tying field goal to get back on equal footing with the Cougars.\nTip-drill turns into touchdown\nNeither team could summon much offense, but at least the Cougars were ahead 6-3 in the middle of the third quarter. It appeared that the worst Minnesota could do was tie the game when quarterback Mitch Leidner’s 3rd-and-8 pass was tipped by Marcellus Pippins in the end zone. But wide receiver Drew Wolitarsky caught the ball on its way to the ground, scoring a touchdown and giving the Gophers a lead they would not relinquish.\nInterception puts Gophers in control\nLuke Falk has led many a fourth quarter comeback during his time as the Washington State quarterback, and he had a chance for more heroics with the ball at his own 18-yard line and the Cougars trailing 10-6 with 4:40 left in the game. A 23-yard pass to Robert Lewis was a promising start to the drive, but on 4th-and-6 Falk’s pass was intercepted by Ayinde Adekunle, setting the Gophers up in WSU territory with the lead, the ball and not much time left in the game.", "url": "https://apnews.com/24483d1cec3045ea89f80cbaaebe3b2b"}