{"authors": ["Jerry Davis For The State Journal"], "date_download": "2020-05-04 20:04:36", "date_modify": "2020-05-04 20:04:36", "date_publish": "2016-11-16 11:00:00", "description": "BLUE MOUNDS -- The only thing Jim Lease won’t be able to help hunters with during the nine-day gun deer season, beginning Nov. 19, is shooting and field dressing their deer. But once a...", "filename": "_e0d6cea8701f49539ab3dcc7d8a8ead5_1588622676.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e0d6cea8701f49539ab3dcc7d8a8ead5_1588622676.html", "title": "Jerry Davis: One-stop-shop to make deer season easier for area hunters", "title_page": "Jerry Davis: One-stop-shop to make deer season easier for area hunters", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BLUE MOUNDS -- The only thing Jim Lease won’t be able to help hunters with during the nine-day gun deer season, beginning Nov. 19, is shooting and field dressing their deer.\nBut once a hunter takes possession of a deer, everything else can be handled by Uncle Jimmy’s Deer Processing employees.\nLease, 58, took over a popular, strategically-located deer registration and processing location on County Hwy. ID, between Mount Horeb and Blue Mounds. While in-person registration became less necessary since electronic registration kicked in last year, there are still numerous tasks hunters cannot do with a cell phone or computer. Some hunters also need assistance with the new registration system.\nWhile processing venison is Uncle Jimmy’s primary task, he’s added sampling deer for chronic wasting disease, assisting hunters register their deer, and accepting venison donations from hunters. In addition, Alex Lease, Jim’s nephew, has carved out a spot in the building for his taxidermy studio.\nAlex Lease, 25, has five years’ experience in taxidermy. He moved his Outdoor Addiction studio from Cottage Grove.\nThe business location of Uncle Jimmy’s is historical. It was homesteaded by Ebenezer Brigham in 1839. Brigham was an important businessman, among other things, in what is now Dane County. Brigham County Park (Dane County)and Town of Brigham (Iowa County) were named for him.\n“We have a few tables in the entrance and have coffee, a soda machine, sell cheese, some fresh meat products, and ice cream,” Jim Lease said.\nJimmy’s is one of 291 assistance in-person stations across the state, but most are stationed in existing businesses. They all help, however, in being ready to being hunters up to speed with electronic registration, or simply do the registration for them. If required deer sampling, for some purpose, is needed in the future, the locations could help fill that bill.\nWhen the archery season gets more active and when gun deer seasons open, Uncle Jimmy’s will be open daily. Otherwise, hunters can call the business at 608.437.DEER (3337), or use one of the three numbers listed on the front door.\nSpecialty venison items can be ordered instead of simply grinding and cutting the carcass. Test results have been quick to come back from the State during the archery season. Lease holds any deer donations until the sample results are available.\n“We still have the hamburger patty-making machine Dick used. It dates back to 1958,” Lease said. “So far business from the archery season has been great. Several western elk have been dropped off, too.\n“One of the good things about this business is that the customers who come in are all in a good mood. They’ve been outdoors hunting, got their deer, and can almost taste that good venison meat on a grill,” he added.\nUnlike the previous deer in-person registration stations which got paid by the state to register, this assistance program is gratis. Lease does get paid (by the state) for sampling deer for CWD testing and for processing donation deer.\nCustomers do not pay for either of these services.", "url": "https://apnews.com/e0d6cea8701f49539ab3dcc7d8a8ead5"}