{"authors": ["Judith Stein", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:19", "date_modify": "2020-05-04 19:52:19", "date_publish": "2016-06-11 00:00:00", "description": null, "filename": "2016_06__1588621939.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2016/06/11120944/loc.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_06__1588621939.html", "title": "Why Did White Workers Leave the Democratic Party?", "title_page": "Why Did White Workers Leave the Democratic Party?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Interview by Connor Kilpatrick\nBernie Sanders makes liberals say the darndest things.\nThe senator from Vermont spent the better part of 2016 pitching his “socialism” as a continuation of the best in the American reform tradition. And that meant embracing by name the domestic achievements of Franklin Roosevelt and Lyndon Johnson.\nSuddenly, however, some liberal pundits weren’t so sure about those legacies. The stubborn old socialist was looking back on the past through rose-colored lenses, they said. And hearing him champion the populist economic reforms of the good old days was enough to make them rethink the foundations of the Democratic Party’s most impressive legislative accomplishment: the New Deal.\nWhy would elite liberals become so ambivalent about the reforms that, with one brief interruption, helped hand their favored party control of Congress for sixty years? The same set of policies they long touted as the kind of “responsible” and “pragmatic” reforms that radicals could learn from?\nThe answer: racism. Only white supremacy, these chastened liberals argued, marshaling the work of some recent historians, made both the New Deal and the golden age of organized labor possible.\nJust as Scandinavian social democracy was purportedly built on a foundation of ethnic homogeneity, so too did the New Deal prosper because of racial exclusion. And when black Americans began to demand their rights, the New Deal — and organized labor — imploded as racist white workers fled the Democratic Party for Ronald Reagan.\nIn its outlines, this story draws on a powerful left-wing critique of the New Deal — an unsparing exposure of social democracy’s contradictions that radicals from Leon Trotsky to Martin Luther King would have understood.\nIn the hands of today’s liberal intelligentsia, however, it functions somewhat differently. For them, the arc of twentieth-century politics shows that the Democratic Party’s turn away from economic populism is not the fault of its affluent elite, but of the still-unvanquished racism of reactionary white workers.\nIn the following interview with Jacobin editorial board member Connor Kilpatrick, Judith Stein explains why she disagrees. While other historians have neatly divided “race” and “economic policy,” Stein has focused on the connection between the two throughout her scholarly career. Her first book examined the Pan-African leader Marcus Garvey, as an exemplar of the black nationalism that permeated African-American political life from 1890 to the Great Depression.\nShe then moved to the New Deal era, when the wage worker became a central actor in black politics. Stein decided to focus on the steel industry — the only place (other than coal) where African Americans worked in both the South and the North.\nThis line of inquiry — the result of which was Running Steel, Running America: Race, Economic Policy, and the Decline of Liberalism — took her South, to Birmingham.\nThat examination of race and the decline of the postwar steel industry led to her next book, The Pivotal Decade: How the United States Traded Factories for Finance in the Seventies, a study of the decisions that pushed the Democratic Party away from New Deal liberalism.\nContrary to today’s liberals, Stein argues that it wasn’t the racism of white workers that forced the Democratic Party to the right on economics. It was powerful political and business elites, who chose to abandon organized labor and turn the Party of Roosevelt into the Party of Clinton.", "url": "https://www.jacobinmag.com/2016/06/white-working-class-new-deal-racism-reagan-democrats/"}