{"authors": ["Jennifer Denevan Laughlin Nevada Times"], "date_download": "2020-05-04 20:18:17", "date_modify": "2020-05-04 20:18:17", "date_publish": "2016-10-19 21:13:00", "description": "LAUGHLIN — The Cougars football team left it all on the field for Senior Night as they beat the visiting Mountain View Saints 26-8 on Oct. 14. Before the game even began, Laughlin took some...", "filename": "_8b29621afd5a4828b90942237c0081e6_1588623497.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8b29621afd5a4828b90942237c0081e6_1588623497.html", "title": "Cougars end home season on high note", "title_page": "Cougars end home season on high note", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LAUGHLIN — The Cougars football team left it all on the field for Senior Night as they beat the visiting Mountain View Saints 26-8 on Oct. 14.\nBefore the game even began, Laughlin took some time to recognize its seniors who would be playing in their last home game of their high school careers for football and volleyball. Jacob Fields, Carlos Durazo, Josh Deltiempo, Zach Cushing, Jeremy Coffey, Austin Coulson, Mikey McCloskey and Coda Abatti each were announced and escorted by their friends and family.\nVolleyball players were also recognized. Courtney Colburn, Bailey Wirth, Veronica Gantenbein, Mary Smith, Sierra Batrin, Erin Dillon, Amanda Miller, Jalynn Quibell and Nicole Petrich were also escorted by friends and family. Each student had their best memories and future plans announced as they walked in front of the home crowd.\nAbatti showed how much he wanted to win his last game on Cougar Field by leading the Cougars with 278 rushing yards on 37 attempts and four touchdowns. Andrew Braaksma had 57 yards on 14 attempts. Kainoa Keahilihau had 31 yards on seven carries.\nThe Saints were frustrated offensively much of the game, but they weren’t without their sparks. Tyrell Brooks completed 19 of 42 passing attempts for 231 yards, one touchdown and one interception.\nIsaiah Johnson made eight receptions for 132 yards and one touchdown. Terrence Brooks caught seven passes for 67 yards and Daniel Reyes had 32 yards on four receptions.\nLaughlin started with the ball and put together a sustained drive that ended with an Abatti touchdown with about 7:58 left on the clock in the first quarter. An onside kick gave the Cougars an extra possession but a couple of miscues including a fumble forced a punt.\nThe Cougars would get two more scores to end the half with a 20-0 lead. The Saints weren’t about to go down without a fight and so they went to the air. Brooks and Johnson connected for a touchdown with about 10:04 to go in the third. Terrence Brooks caught the two-point conversion to make the score 20-8.\nAbatti earned his final touchdown with 2:14 left on the clock in the third quarter. The remainder of the game was defense with neither team getting into an end zone again. An error at the end of the game did strip Laughlin’s Dherick Asis of a defensive touchdown but the victory was already sealed.\nSaints coach Raymond LeBoeuf said he felt his boys did a good job of trying to execute their game plan. There are still some things they need to clean up in order to help the running game improve, he continued.\nTyrell Brooks played a really good game, LeBoeuf said. The kids know the Saints will go for it on third and fourth downs so they’re prepared to make those plays, he added.\nLeBoeuf said they believe in their defense, in the team and in going for it on fourth down. It’s not seen as a desperation attempt but rather, just another opportunity to get the first down and keep the drive going, he continued.\nCougars coach Walt Hemingway was complimentary of the Saints and their perseverance. The Saints only had 12 players and then went down one during the game due to injury, leaving them with just enough players to be on the field. All their players had to play both offense and defense most of the game.\nHemingway said he was very impressed with how the Saints didn’t give up and played hard the entire game.\nRegarding how the Cougars played, Hemingway said his players simply wanted to win. It was discussed all week long and they felt like this was the game to earn the “w” and they did just that, he added.\nWinning and being able to celebrate that win will help the team build up an ongoing winning attitude that will help them see more victories, Hemingway said.\nThe Cougars travel to Las Vegas to take on the Agassi Prep Stars on Friday, Oct. 21. Varsity plays at 7 p.m.", "url": "https://apnews.com/8b29621afd5a4828b90942237c0081e6"}