{"authors": ["Matt Karp", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:21", "date_modify": "2020-05-04 19:52:21", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_10__1588621941.html", "image_url": "https://images.jacobinmag.com/2016/10/17231300/24481148172_f851f14905_k1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_10__1588621941.html", "title": "The Popular Populist", "title_page": "The Popular Populist", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Dozens of other surveys yield similar results. Nearly everybody, it seems, likes Bernie — but why? And what can his personal popularity tell us about the future of the social-democratic “political revolution” Sanders would like to ignite?\nFemale Americans like Bernie (by a count of 60 percent to 39 percent). Male Americans like Bernie (58 to 36 percent). Black Americans like Bernie (67 to 21 percent). White Americans like Bernie (57 to 36 percent).\nEarlier this month, an Economist/YouGov poll found that 59 percent of Americans have a favorable opinion of Sanders, while only 33 percent hold an unfavorable one.\nQuietly, though, something less predictable has happened. Bernie Sanders has become — by a considerable margin — the most popular politician in the United States.\nThe general election campaign between Hillary Clinton and Donald Trump has gone pretty much as everyone expected: a months-long carnival of the absurd and the grotesque, culminating in Trump’s self-destruction and Clinton’s methodical march to power.\nThe current political moment makes Sanders’s immense popularity all the more striking: today, most Americans look upon their political leaders with intense skepticism if not open disdain.\nThe two major presidential candidates, notoriously, are as well-hated as Sanders is well-liked. According to The Huffington Post’s poll aggregator, about 54 percent of Americans view Clinton unfavorably; for Trump, the number is 63 percent and trending even higher. The Donald, it turns out, is an extremely unpopular populist.\nBut Clinton and Trump, despite their historic unpopularity, are not outliers among the larger American political class. According to the same Economist/YouGov poll, the favorability numbers for congressional leaders and rival candidates are just as dismal:\nIn the large and general swamp of public opinion about politicians, only Barack Obama (+10 percent) and Joe Biden (+11 percent) can raise their heads above the waterline. And neither one — despite not having faced a competitive election in four years — approaches the approval rating of the junior senator from Vermont.\nSanders hasn’t always been so well-loved. When he kicked off his campaign last spring, he was virtually unknown, barely registering on national surveys. Even after months of hard campaigning, last October Sanders’s Huffington Post favorability remained at about 37 percent. That’s about where Tim Kaine or John Kasich stands today — a respectable number for a second-tier politician not yet well-known enough to be comprehensively disliked.\nBut over the last twelve months, everything has changed. Even as the primary campaign grew more contentious — and the leadership of the Democratic Party closed ranks to defeat the left-wing insurgent — Sanders actually saw his national favorability numbers rise higher and higher.\nBy February, he was the most popular candidate in the field, and by June, he had become the most popular politician in the country. Now removed from the presidential race, Sanders is more popular than ever. (Sanders’s numbers are most dazzling in polls of all American adults. But even among the older, more conservative population of registered and/or likely voters, he remains exceptionally well-liked.)\nFor the liberal commentariat, Sanders’s large and enduring popularity is something of an embarrassment. During the primary campaign, a chorus of pundits agreed that America’s apparent love affair with the left-wing senator came down to just one factor: he had not been attacked by Republicans. This mantra, accompanied by a dismissal of polling data and an abuse of historical precedent, formed the core of the “electability” argument for Clinton.\nSanders, in this view, was (and remains) some kind of endangered species, a helpless creature saved from his natural predators by the protective embrace of the Clinton Democratic Party. Like a socialist spotted owl, Sanders could exist only on the sufferance of his noble and self-sacrificing liberal patrons. “I know you may not be there for me now,” as Hillary Clinton has told young Sanders voters, “but I will be there for you.”\nIt’s absurd, of course, to suggest that Sanders never sustained hits from the Right (mostly of the red-baiting variety). But far more damaging were the punches from the Clinton campaign and its allies, who sought to portray Sanders as the tribune for a reckless, naive left, constitutionally unfit to lead the country.\nIn this effort, Clinton was able to summon the considerable institutional and intellectual resources of the Democratic Party. Before a single ballot was cast, 180 of 232 congressional Democrats had already endorsed Clinton, compared to three for Sanders. And when polls in Iowa and New Hampshire showed the Vermont leftist gaining on the front-runner, Clinton’s allies got in formation.\nDemocratic senators joked about hammers and sickles. Democratic congressmen mocked Bernie’s call for “free lunches.” And Democratic propagandists in the media — essentially, the entire salaried pundit class — coordinated their efforts to savage Sanders’s “irresponsible” platform, denounce his “extreme” vision of popular politics, and paint his supporters as confused children who were also, in all probability, violent and cultish misogynists.\nIn other words, Sanders may not have seen the worst of the radical right, but he did absorb an unprecedented hurricane of attacks from the organized center, America’s most powerful and well-connected faction. While the Clinton campaign itself often avoided direct assaults on Sanders, allied forces in the professional media were more than up to the task. Their goal, as Tom Frank has recently made clear, was not just to weaken Sanders as a candidate, but to disarm and delegitimize the growing left-wing movement behind him.\nYet through it all, his national popularity climbed higher and higher. Among political independents, whom the center tends to regard as something like the sacred foundation of American democracy, Sanders’s favorability now stands at a shimmering 62 to 30 percent.\nNeedless to say, this is not a typical trajectory for losing presidential candidates. Ted Cruz, often described as Sanders’s ideological mirror image, has a national favorability of -31 percent (The numbers for Mitt Romney, Marco Rubio, and Jeb Bush are just as ugly). Nor have previous liberal upstarts — from Howard Dean to Jerry Brown — achieved anything comparable to Sanders after they came up short.\nSo why is Sanders still such a favorite — not just among leftists, but with the country as a whole?\nThe simplest explanation, though it seldom occurs to those whose paychecks argue otherwise, is that he stands for popular things. The two most strongly supported policy reforms in America — aggressive financial regulation and a much higher minimum wage — were front and center in his campaign. Social Security expansion and free public college, although scarcely on the national radar before Sanders championed them, are now hugely popular, too.\nJust as important, Sanders stands against unpopular things. For over twenty-five years, about 60 percent of Americans have consistently said that the country’s wealth distribution is unfair and that the wealthy pay too little in taxes. In the past decade, an equally robust 60 percent majority has expressed dissatisfaction with the size and power of major corporations. Another 60 percent believe major donors exert far more influence on Congress than regular people.\nAmericans loathe the thing called “Wall Street” almost as much as they loathe the thing called “Ted Cruz.” National surveys regularly find large majorities saying that Wall Street banks do more harm than good. This April, even Republican primary voters in New York and Pennsylvania agreed.\nOf course, national polls also generally find that Americans dislike “government,” and are wary of “government trying to do too many things.” For mainstream Democrats, these results prove that what the country truly wants is not any of the things it has asked for, but what Democrats would prefer to give it anyway: fiendishly convoluted tax credit schemes and impenetrable “market-based” health reforms.\nAfter all, what could be less like “government” than a more byzantine tax code and mandatory enrollment in the administrative hell of a federally supported private market? It’s almost as if 60 percent of Americans are right, and the policy agenda of the Democratic Party is not dictated by public opinion, but by the ideological preferences of its donor class.\nLike a socialist Kool-Aid Man, Bernie Sanders burst through this wall, his pitcher filled to the brim with populist rhetoric and unabashed wealth redistribution. He broke all the invisible Democratic rules about how to talk about the economy: he didn’t make unconvincing efforts to belittle “government,” he didn’t talk a lot of guff about “small business,” and he didn’t shy away from language that might cause some Republican to utter the deadly hex word “entitlement.”\nEven at the level of style, Sanders avoided the robotic syncopation and corny parallelisms that have come to define professional political speech in the twenty-first century. A lifelong independent, Sanders was blissfully incapable of producing “Democrat Voice.”\nInstead, he railed hoarsely, repetitively even, against “the one percent,” while promising direct benefits for everyone else. In other words, he tossed out the Democratic Party playbook and built his campaign around attacking what Americans hate and embracing what Americans like. It wasn’t enough to win the party’s nomination, but it has been enough to make him the most popular leader in the country.", "url": "https://www.jacobinmag.com/2016/10/bernie-sanders-polling-favorability-trump-hillary-clinton/"}