{"authors": ["Erik Olin Wright", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:42", "date_modify": "2020-05-04 19:57:42", "date_publish": "2016-04-23 00:00:00", "description": null, "filename": "2016_04__1588622262.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2016/04/23124140/5495876260_84c0bfe866_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_04__1588622262.html", "title": "How to Think About (And Win) Socialism", "title_page": "How to Think About (And Win) Socialism", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nDylan Riley’s essay, “An Anticapitalism That Can Win” raises two clusters of criticisms of my book Envisioning Real Utopia and my Jacobin article “How to Be an Anticapitalist Today.” The first concerns my conception of socialism as an alternative to capitalism; the second my approach to the strategies of social transformation needed to transcend capitalism. I think, in fact, we are not as far apart in our understanding of socialism as he seems to think, but we do differ in fundamental ways in our understanding of how to get there.\nEconomic Ecology Riley is quite critical of my proposal for a reformulation of the concept of socialism. I will first briefly describe my argument, and then respond to Riley’s criticisms. In Envisioning Real Utopias, I argue that three different kinds of power are deployed in all economic structures: economic power, based on the control over economic resources; state power, rooted in control over rule-making and rule-enforcing over territory; and social power, which I define as power rooted in the capacity to mobilize people for cooperative, voluntary collective actions. Different kinds of economic structures (or modes of production) can then be distinguished on the basis of which of these three forms of power is most important in determining control of the process of production and the extraction and use of the social surplus generated through production. More specifically, capitalism can be distinguished in these terms from two post-capitalist alternatives: Capitalism is an economic structure within which the means of production are privately owned and the allocation and use of resources for different social purposes is accomplished through the exercise of economic power. Investments and the control of production are the result of the exercise of economic power by owners of capital.\nStatism is an economic structure within which the means of production are owned by the state and the allocation and use of resources for different social purposes is accomplished through the exercise of state power. State officials control the investment process and production through some sort of state-administrative mechanism.\nSocialism is an economic structure within which the means of production are socially owned and the allocation and use of resources for different social purposes is accomplished through the exercise of “social power.” In effect this is equivalent to defining socialism as pervasive economic democracy. Democracy means “rule by the people,” but this expression does not really mean, “rule by the atomized aggregation of the separate individuals of the society taken as isolated persons”; rather, it means rule by the people collectively organized into associations (parties, communities, unions, etc.). This is rule through the exercise of social power. These definitions of capitalism, statism, and socialism are ideal types. In the world, actual economies are complex forms of combination of these power relations. They are ecosystems of economic structures that vary according to how these different forms of power interact and intermix. To call an economy “capitalist” is thus shorthand for a more cumbersome expression such as “an economic ecosystem combining capitalist, statist, and socialist power relations within which capitalist relations are dominant.” The idea of economies as ecosystems dominated by particular relations of production can be used to describe any unit of analysis — firms, sectors, regional economies, national economies, even the global economy. These power relations also interpenetrate within individual units of production, so particular enterprises can be hybrids operating in the economic ecosystem that surrounds them. Again, within such complexity we can still call an economy “capitalist” when it is the case that the distinctive form of power within capitalism — economic power — is dominant within the overall economic system. For example, in all capitalist economies, state power directly organizes significant forms of production of goods and services. The economy remains capitalist, however, to the extent that this exercise of state power in the economy is effectively subordinated to the capitalist exercise of economic power. There are all sorts of mechanisms built into the capitalist state which attempt, more or less successfully, to sustain this kind of subordination. Thus, while capitalist economies do contain forms of statist economic relations, the economic system remains capitalist. If such capitalist mechanisms of subordination of state power are weakened through some process, then the economy can be described as having an increasingly statist character. With this understanding of economic structures, the possibility of socialism depends on the potential to enlarge and deepen the socialist component within the overall economic ecosystem and weaken the capitalist and statist components. This would mean that in a socialist economy, the exercise of both economic power and social power would be effectively subordinated to social power; that is, both the state and economy would be democratized. This is why socialism is equivalent to the radical democratization of society. Riley agrees with the idea that socialism implies a radical democratization of the economy and the state, but he rejects my formulation of this idea in terms of social power within capitalist economies. He writes: Capitalists and landowners in particular have historically been very effective at using social power. There are numerous examples of firms and agribusinesses cooperating to share technology, to control output and prices, to establish long-term relations with suppliers, to lobby the government to pursue their interests, or to exclude politically undesirable workers. Therefore, it’s important to emphasize that the relevance of social power for socialism depends on the class that wields that power. Without this sort of specification, there is little reason to think that the extension of social power by itself is likely to lead to socialism or to even move society in the direction of socialism . . . There is an additional problem with Wright’s concept of social empowerment. Associational power is not necessarily an independent source of power, but can be produced and conditioned by economic power. Capitalists can rather easily convert their resources into associational power. Riley’s criticisms here reflect a misunderstanding of my argument. Riley is absolutely correct that the sheer existence of social power does not indicate the emergence of socialist relations. When voluntary association and collective action reflects the exercise of capitalist class power, this is a capitalist configuration, as in the examples Riley cites of firms cooperating for various purposes. But my argument in Envisioning Real Utopias is not that social power as such is the criterion for socialism; rather, the criterion is that socialism is based on the dominance of social power in determining the use of economic resources and the allocation of the surplus. To say that democratic social power is dominant over economic power and state power means that the capacity for collective action of workers and other popular social forces is the dominant form of power in the economy. This is a claim about class relations for it describes the power relations within the relations of production. If this occurs at the macro-system level we can call the economy socialist; when it occurs within specific economic organizations or spaces, then we say that those organizations and spaces have a socialist character even if they exist within an economic system that remains dominated by capitalist relations. This way of understanding the complexity of economic structures has a historical basis. Most Marxists recognize that proto-capitalist forms of economic activity emerged within societies that remained feudal. The long, slow development within feudalism of such proto-capitalist practices into capitalist relations is a central part of the analysis of the transition from feudalism to capitalism as dominant forms of economic organization. The fact that the emergence of proto-capitalist relations within feudalism helped feudal elites solve various problems does not imply that these new relations weren’t significant precursors to capitalism; it simply helps explain some of the conditions which helped stabilize these new relations and enabled them to take root and develop. What is less familiar is the idea that socialist relations of production can emerge as a salient feature of the economic structure of capitalist economies. What does this mean concretely? What are instances of socialist relations of production within capitalism? Here are a few examples: Worker-owned cooperatives in which the means of production are owned by the workers and production is governed through democratic mechanisms.\nThe social and solidarity economy in which production is oriented to meeting needs and governance is organized in a variety of democratic and quasi-democratic ways.\nCommunity land trusts in which land is taken out of the market, its use specified through the conditions of the trust, and the trust itself is governed by some kind of community-based board.\nPeer-to-peer collaborative production of use-values such as Wikipedia or the Linux operating system.\nState production of public goods to the extent the state is democratically subordinated to social power. This includes a wide range of goods and services: caregiving services — health care, child care, elder care, disability care; public amenities for community events and processes — things like community centers, parks and recreation facilities, theaters, art galleries, and museums; education at all levels, including continuing education, lifelong learning centers, and skill retraining centers; conventional physical infrastructure; and a range of public utilities. All of these examples, in different ways, embody some aspects of socialist relations of production insofar as democratic forms of social power plays a significant role in the organization of economic activities. But of course, these examples also often take a hybrid form in which features of capitalist relations are also present. Worker-owned cooperatives often have some non-member employees, for example. Capitalist corporations may pay some of their employees to participate in peer-to-peer collaborative production — Google pays some of its software engineers to contribute to the development of Linux, even though Linux itself is an open-source, free software system that is part of the creative commons. Enterprises in the social and solidarity economy sometimes get grants from private foundations and philanthropists whose resources come from capitalist investments. State provision of public goods is often heavily shaped by capitalist power. The articulation of the capitalist, statist, and socialist elements in this complex array of social forms is messy, ambiguous, and contradictory. Nevertheless, the above examples all constitute ways of organizing economic activities in which democratic social power plays some role. And to the extent that this is the case, we can describe these as socialist or proto-socialist forms within a system that remains dominated by capitalism. Riley rejects the strategy of “transforming societies from articulated wholes into hybrid structures combining elements of socialism, capitalism, and statism.” He adds dismissively that “From this point of view, even the US counts as ‘partly socialist.’” He is right: I do think the United States is “partly socialist” in precisely the sense that it already contains a significant set of diverse economic forms that would themselves fit comfortably in a socialist economy. The question, then, is whether or not it is possible to build a strategy for socialism around the task of expanding and deepening these socialist elements within capitalism.\nStrategic Logics of Transformation The general view of economic systems outlined above has implications for the way we think about social transformation. In particular, it allows for the possibility that alternatives can develop inside the world as it is, and potentially do so in ways that over time erode the dominance of capitalism itself. In my previous Jacobin article, I differentiated four strategic logics: smashing, taming, escaping, and eroding capitalism. There is no need here to go over the details of these. The smashing strategy corresponds to the classical idea of revolution; taming and eroding roughly correspond to the idea of transformation through some more gradual process of reform and metamorphosis. I reject the plausibility of rupture and endorse the possibility of transforming capitalism through taming and eroding capitalism. Riley is highly critical of this conclusion, arguing that a revolutionary rupture is the necessary condition for these more incremental strategies to have any real prospect of working. He writes: Wright’s political instincts are obviously quite radical, but his strategic recommendations are woefully inadequate. The basic problem is that Wright tells us nothing about what is still the central task of any viable strategy for winning socialism: destroying the entrenched political and economic power of the capitalist class. Without some plausible strategy for at least decisively weakening the power of private owners of the means of production, it is unclear how a generous basic income or any of his other real utopias could be established . . . [T]he strategy of eroding capitalism requires a prior political break — a decisive confrontation with the capitalist state. To realize Wright’s real utopia, then, an approach informed more by military strategy and less by biology seems requisite. Riley is especially dismissive of any variety of social democracy, and is thus quite critical of the attention I pay to exploring the possibility of taming capitalism (described as a “symbiotic transformation” in my book): Wright’s account of strategy is marred by an enervating social-democratic orientation that leads away from a real engagement with the revolutionary socialist tradition. This is most evident in the contrasting discussions of ruptural and symbiotic transformations in his book on real utopias. Most of the short chapter on ruptural transformations is a critique based on the premise that they are unlikely to be in the material interests of the majority of the population. By contrast, Wright’s long and sympathetic chapter on symbiotic transformations devotes exactly one paragraph to critiques of social democracy. This distribution of attention is surprising, because ruptural transformations are the only examples of successful transitions to non-capitalist societies, however authoritarian they may have been. In contrast, social democracy and anarchism are, from the perspective of achieving socialism, clear examples of failure. Riley is certainly correct in the claim that the revolutions of the twentieth century “are the only examples of successful transitions to non-capitalist societies,” but this is hardly an endorsement of ruptural strategies, at least if one accepts that the result of such attempts was authoritarian statism rather than an emancipatory alternative to capitalism. My argument was never that ruptures as such are not possible, but rather that the evidence suggests that system-level ruptures do not create favorable conditions for building socialism, understood as a democratic, egalitarian, solidaristic alternative to capitalism. I make two main arguments for the implausibility of ruptural strategies, especially in complex, advanced capitalist societies. First, I argue that if a revolutionary socialist party gained power and launched a system-level rupture as the starting point for socialist construction, this would generate a long transition in which the living standards of most people would significantly decline. Even if we assume that the rupture occurs against a background of long term economic decline, this would still impose great hardships on workers. Under democratic conditions (freedom of speech and association with open competitive elections, etc.) it is not plausible that the political coalition for the transition would remain intact over several election cycles in a context of deep economic disruption and widespread privation. The result would be, if elections were held, that the revolutionary party pursuing rupture would be defeated and the transition would be reversed. Second, if, in the face of these conditions, the socialists refused to give up power and opted for an antidemocratic solution in which opposition was repressed, then a transition out of capitalism might be sustainable, but the destination would not be socialism as understood here. Given the level of social disorder and conflict that would be unleashed under these conditions, the coercion by such a state would not simply consist of short-term emergency measures, but would be institutionalized as broad authoritarian statism. This has certainly been the outcome of attempts at revolutionary anticapitalist ruptures in the last century. Riley’s suggestion that “military strategy” is the appropriate way of thinking about the struggle for transcending capitalism is a recipe for the self-destruction of socialist aspirations. But what about Riley’s judgment that “social democracy and anarchism are, from the perspective of achieving socialism, clear examples of failure”? To be sure, twentieth-century social democracy never achieved “socialism” in the sense of creating an economic system in which socialist relations were dominant. But in terms of taming capitalism in ways that allowed for greater space for socialist relations within capitalist economies, social democracy achieved significant successes for at least some time: the dramatic reduction of risks faced by workers in the labor market through the partial decommodification of labor; the provision of an expansive array of publicly provided goods and services that constituted significant components of living standards and enhanced the quality of life; modest measures of worker social empowerment within capitalist firms through unions and works councils and other mechanisms; and the realization of a low level of income inequality in the economy as a whole. Capitalism remained dominant to be sure; all of these developments occurred within limits imposed by the continued capitalist control over investment. But this does not mean that they were failures from the socialist point of view: at its peak, northern European social democracy presided over a less capitalist capitalism, a capitalism with a stronger current of (though still subordinate) socialism. The fact that ultimately this development was arrested and at least somewhat reversed does not negate its achievement.\nThe Problem of the Capitalist State Even if one accepts my argument that capitalist economic systems should be treated as heterogeneous ecosystems dominated by capitalism rather than as totalities, and that socialist economic organizations and processes can exist within a capitalism-dominated system, there is still the problem raised by Riley that the existence of the capitalist state ensures that such elements could never actually act like “invasive species” capable of eroding the dominance of capitalism. “The inauguration of socialism will not resemble the introduction of an invasive species,” Riley writes, “for the simple reason that capitalist economies, unlike ecosystems, are backed by political institutions that are specifically designed to eliminate such species as soon as they begin to threaten the system.” The central point of a rupture, then, is to transform the capitalist state in such a way as to make it a suitable instrument for facilitating the construction of alternative economic relations. I disagree with this account. While the capitalist state’s structures are not well-suited for facilitating the expansion of socialist organizations, they are beset with enough internal contradictions that they do not necessarily block such development. In particular, there is a chronic tension in capitalist states between the imperatives for state action in the short run to stabilize capitalism and the long-term dynamic consequences of those actions. These temporal inconsistencies can become contradictions in which the capitalist state would tolerate, and perhaps even encourage, economic practices rooted in social power because of the ways these help solve immediate problems even though they might have long-term effects that undermine the dominance of capitalism. Historical evidence for this possibility can be found first in the history of feudalism, and also in the experience of twentieth-century social democracy. The feudal state facilitated merchant capitalism even though in the long run the dynamics of merchant capitalism was corrosive of feudal relations. Mercantile capitalism helped solve immediate problems for the feudal ruling class, and this is what mattered. Similarly, in the middle of the twentieth century, the capitalist state facilitated the growth of a vibrant public sector and public regulation of capitalism associated with social democracy. Social democracy helped solve a series of problems within capitalism — it helped reproduce capitalism — while at the same time expanding the space for various socialist elements in the economic ecosystem. The fact that this array of state actions contributed to the stability of mid-twentieth-century capitalism is sometimes taken as an indication that there was nothing non-capitalist about these policies, and that they could not in any way be considered corrosive of capitalism. This is a mistake. It is entirely possible for a form of state intervention to have the immediate effects of solving problems for capitalism, and even strengthening capitalism, and nevertheless set in motion dynamics that have the potential to erode the dominance of capitalism. Indeed, it is precisely this property of social-democratic initiatives that eventually lead to the attacks on the capitalism-encroaching practices of social democracy under the banner of neoliberalism. Capitalists came to see the expansive affirmative state as creating progressively sub-optimal conditions for capital accumulation. One interpretation of the episode of social-democratic success and then reversal is that this just shows that reforms within capitalism that threaten capitalism are unsustainable. In the end, the capitalist state lives up to its mission of protecting capitalism by eliminating such threats. The alternative interpretation is that this arena of struggle and possibility is much less determinate. After all, even after four decades of neoliberalism, many of the achievements of the welfare state remain in place.", "url": "https://www.jacobinmag.com/2016/04/erik-olin-wright-real-utopias-capitalism-socialism/"}