{"authors": ["Por The Associated Press"], "date_download": "2020-05-04 20:04:42", "date_modify": "2020-05-04 20:04:42", "date_publish": "2016-05-04 20:16:03", "description": "Los Rolling Stones pidieron al virtual candidato republicano Donald Trump que deje de tocar sus canciones en sus actos de campaña. La banda dijo en un comunicado enviado el miércoles que...", "filename": "_0de7f84e6c4245cab2474b02a78bf40b_1588622682.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e03050fc860d48dc9bd3ba82da5491a4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0de7f84e6c4245cab2474b02a78bf40b_1588622682.html", "title": "Los Rolling Stones piden a Trump que no toque sus canciones", "title_page": "Los Rolling Stones piden a Trump que no toque sus canciones", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Los Rolling Stones pidieron al virtual candidato republicano Donald Trump que deje de tocar sus canciones en sus actos de campaña.\nLa banda dijo en un comunicado enviado el miércoles que nunca dio autorización al equipo de Trump para usar su música y que “han solicitado que cesen cualquier uso inmediatamente”.\nUna vocera de la campaña de Trump no respondió de inmediato a los llamados que se le hicieron para conocer sus comentarios o para decir si contaban con una licencia para tocar las canciones de los rockeros británicos.\nTrump, quien es un aficionado de la música, ha incluido canciones de los Rolling Stones en sus actos de campaña por meses como parte de una banda sonora diversa que va de Elton John a la ópera y las canciones clásicas del rock, como “You Can’t Always Get What You Want” de los Stones, que ha sonado bastante en sus eventos. El martes en la noche en otro acto de campaña sonó “Start Me Up”.\nAdele y el vocalista de Aerosmith Steven Tyler pidieron que el candidato dejara de usar sus canciones para levantar los ánimos entre sus partidarios. Neil Young también se quejó cuando el millonario dueño de bienes raíces usó “Rockin’ in the Free World” al anunciar que arrancaría su campaña el año pasado. En todos esos casos la campaña de Trump dejó de usar las canciones.\nLos políticos no necesitan el permiso de los artistas para tocar su música en los actos de campaña, siempre y cuando la organización política que representan o el foro en el que estén cuente con una licencia general de las organizaciones de derechos de autor ASCAP y BMI para toda la música en su repertorio.\nPero los artistas sí tienen algunos recursos. BMI, por ejemplo, ha dicho que cuenta con una clausula en su acuerdo de licencia que permite a sus compositores o editoras objetar el uso de sus canciones. También tienen la capacidad de exlucir esas canciones de la licencia.", "url": "https://apnews.com/0de7f84e6c4245cab2474b02a78bf40b"}