{"authors": ["Philip Fishman"], "date_download": "2020-05-04 20:21:55", "date_modify": "2020-05-04 20:21:55", "date_publish": "2016-09-04 02:48:43", "description": "Florida Atlantic welcomed Southern Illinois to FAU Stadium Saturday night with high hopes for a good start to the 2016 season. And those hopes were turned into good results as the Owls...", "filename": "_d2647f530ce74da39c822c1aa6d02372_1588623715.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d2647f530ce74da39c822c1aa6d02372_1588623715.html", "title": "Owls hold off Salukis to open season with victory", "title_page": "Owls hold off Salukis to open season with victory", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Owls hold off Salukis to open season with victory\nFlorida Atlantic welcomed Southern Illinois to FAU Stadium Saturday night with high hopes for a good start to the 2016 season.\nAnd those hopes were turned into good results as the Owls defeated the Salukis 38-30 in a close encounter not decided until an FAU fumble recovery in the game’s final minutes.\n“Our guys were starting to recognize that we were wearing our opponent down,” Florida Atlantic coach Charlie Partridge said. “You saw the potential in all three phases.”\nIt began as a back-and-forth affair, with both teams featuring flashes of their high powered, up-tempo offenses throughout the first quarter.\nOwls junior running back Greg “Buddy” Howell Jr. began the scoring with a 48-yard run at the 12:49 mark on the first possession for FAU. Howell rushed for two TDs and 129 yards on 16 carries on the night.\n”The belief in Buddy goes to another level,” Partridge said.\nThe Salukis (0-1) came right back on a seven-play, 79-yard march, tying the score at 7-7 on a 3-yard off tackle run by sophomore running back Jonathan Mixon.\nWith 4:03 left in the quarter, Howell again broke away for a 37-yard TD run to give the Owls a 14-7 lead. Josh Straughan, recently named the starting quarterback for Southern Illinois, returned the favor on an 11-yard pass to Billy Reed with 23 seconds left in the quarter, knotting the score at 14-14. Straughan threw for 367 yards and one score.\nA 48-yard field goal by Austin Johnson highlighted a 7-play, 44-yard march, giving the visitors a 17-14 lead to begin the second quarter scoring.\nA spectacular, thrice deflected 85-TD yard pass that finally landed in the outstretched arms of wide receiver Tavaris Harrison briefly gave the Owls a 21-17 lead.\nSouthern Illinois struck back quickly on 69-yard run by running back Daquan Isom, giving Southern Illinois a 24-21 halftime lead.\nFlorida Atlantic took the lead for good, 28-24, on a 12-play, 75-yard scoring drive, highlighted by a 2-yard TD run by quarterback Jason Driskel, to open the third quarter.\nA 14-play, 77-yard drive culminated in a 4-yard TD pass to Tyler Cameron, extended the Owls’ lead to 35-24 with 5:35 left in the quarter.\nThe Owls stingy defense came up big in the fourth quarter as a Southern Illinois field-goal attempt of 50 yards was blocked by Bednarik Award Watch List nominee Trey Hendrickson.\n“We’re going to bring it all year and I’m excited what this team holds,” Hendrickson said.", "url": "https://apnews.com/d2647f530ce74da39c822c1aa6d02372"}