{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:21:29", "date_modify": "2020-05-04 20:21:29", "date_publish": "2016-12-30 14:11:00", "description": "The following arrests information was taken directly from Gordon County Jail records. Arrests were made by the Gordon County Sheriff’s Office except where otherwise indicated. Law enforcement...", "filename": "_292da89f67404c70ae7c54a173fa07df_1588623689.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_292da89f67404c70ae7c54a173fa07df_1588623689.html", "title": "Arrest Records from the Saturday, December 31, 2016 issue of the Calhoun Times", "title_page": "Arrest Records from the Saturday, December 31, 2016 issue of the Calhoun Times", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Arrest Records from the Saturday, December 31, 2016 issue of the Calhoun Times\nThe following arrests information was taken directly from Gordon County Jail records. Arrests were made by the Gordon County Sheriff’s Office except where otherwise indicated. Law enforcement officials are in compliance with Ga. Code 50-18-72 of the Open Records Act in releasing reports of arrests. People with similar names may not be the same as those listed in reports. All people are presumed innocent until proven guilty in court.\nMonday, Dec. 26\nJasman, David Ray, 36, 136 Shoreline Drive, Rome, arrested and charged with aggravated assault, driving on roadways laned for traffic, DUI, driving while license is suspended or revoked, maximum limits, no passing zones, obstruction or hindering LEOs, reckless driving, use of safety belts in passenger vehicles, vehicles to drive on right side of roadways, feeling or attempting to elude police officers.\nRedd, Shanay Danette, 27, 210 Hendricks Boulevard, Chattanooga, TN, arrested and charged with fugitive from justice.\nBruner, Ronald Steven, 53, 166 Fog Road, Resaca, arrested and charged with driving while license suspended or revoked.\nHarris, Martez Keith, 23, 109 Twin Oaks Drive, Calhoun, arrested and charged with driving while license is suspended or revoked.\nHenderson, Hannah Michelle, 17, 16 Wilkerson Road, Rome, arrested by CPD and housed.\nLovelace, Rontez Deon, 30, 1913 Rolling Brook Drive, Cleveland, TN, arrested and charged with driving while license is suspended or revoked.\nWade, Remington Cheyanne, 17, 10 Kenington Road, Rome, arrested by CPD and housed.\nTuesday, Dec. 27\nBarnett, Robert Dwayne, 52, 2312 Trimble Hollow Road, Adairsville, arrested and charged with bench warrant, probation violation.\nBennett, Rudolf Walter, 61, 711 Southhampton Sr., Dalton, arrested and charged with failure to appear.\nHendricks, Joshua Michael, 36, 126 Lance Road, Calhoun, arrested and charged with probation violation.\nLuffman, Jack Eugene, 69, 4751 S. Dixie Road, Resaca, arrested and charged with criminal trespass, stalking.\nMitchell, Jessica Paige, 29, 138 Taylor Bridge Road, Resaca, arrested and charged with failure to appear.\nMorgan, Tiffany Lashley, 34, 138 Taylor Bridge Road, arrested and charged with parole violation.\nButler, Jackson Cain, 17, 205 Whitehill Drive, Calhoun, arrested by CPD and housed.\nGonzalez, Reymaldo, 37, 107 Colton Drive, Calhoun, arrested and charged with theft by conversion.\nMiah, Mohammed Jabir, 22, 61A St. Dunstan Drive, Scarbrough, ON, arrested and charged with maximum limits, reckless driving.\nSchmitz, Kennan Keontae, 20, 171 Highland Drive, Calhoun, arrested by GSP and charged with DUI.\nTrujillo, Angelica, 42, 416 Beamer Road #4, Calhoun, arrested by CPD and charged with no license, too fast for conditions.\nWednesday, Dec. 28\nAutry, Charles Lewis, 54, 143 Stendall Drive, Calhoun, arrested and here for court.\nBruner, Ronald Steven, 53, 166 Fog Road, Resaca, arrested by FPD and housed.\nCooper, Ezekiel Dakota, 25, 121 Housing Authority, Calhoun, arrested and charged with drug-related objects, possession of methamphetamine, theft by shoplifting.\nFredrick, Demetrice C, 33, 4302 Palm Springs, East Point, arrested and charged for criminal trespass.\nHeadspeth, Derrik, 27, 2980 Delmar Lane NW Apt. B2, Atlanta, arrested and charged for criminal trespass.\nHeadspeth, Kevin Devon, 26, 2980 Delmar Lane NW Apt. B2, Atlanta, arrested and charged with criminal trespass.\nJones, Victor, 34, 1944 Hollywood Road, Atlanta, arrested and charged with criminal trespass.\nMiller, Kevin Christopher, 28, 2670 Highway 41 S, Calhoun, arrested and housed for CPD.\nMoses, Dustin Anthony, 25, 421 Jolly Road #3, Calhoun, arrested and housed for CPD.\nNichols, Anthony Lamar, 35, 82 Waylon Circle NW, Cartersville, arrested by PRO and charged with probation violation.\nPugh, Victoria Leigh, 43, 700 Saqovia Drive, Crossville, TN, arrested and charged with probation violation.\nTilley, Frank Allen, 53, 225 N. Williams Street, Calhoun, arrested and charged with driving while license is suspended or revoked.\nWilkey, Kay Forest, 54, 121 Northview Drive, Calhoun, arrested and charged with possession of methamphetamine, simple battery FVA.\nWilliams, Tammie Tamara, 42, 42 Mockingbird Circle, Rome, arrested and charged with bench warrant.\nSilvers, Austin Trent, 17, 318 Oostanaula Bend SW, Calhoun, arrested and charged with disorderly conduct.\nWilson, Evelyn Marie, 47, 119 Rocky Lane, Calhoun, arrested and housed.", "url": "https://apnews.com/292da89f67404c70ae7c54a173fa07df"}