{"authors": ["Mike Stivers", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:56", "date_modify": "2020-05-04 19:54:56", "date_publish": "2016-10-17 00:00:00", "description": null, "filename": "2016_10_uft-suspensions-nyc-schools-teachers-discipline_1588622096.html", "image_url": "https://images.jacobinmag.com/2016/10/17231227/nyc-students-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_10_uft-suspensions-nyc-schools-teachers-discipline_1588622096.html", "title": "Suspending Solidarity", "title_page": "Suspending Solidarity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn November 2011, Richard Farkas, vice president of the United Federation of Teachers, New York City’s teachers’ union, testified before the city council. He delivered an earnest critique of the “no-excuses” discipline policies dominant in the Department of Education during the era of former mayor Michael Bloomberg. Farkas advocated for a more holistic understanding of student behavior and noted that youth “would be better served by less emphasis on discipline and a greater emphasis on prevention and intervention.” He made explicit the gross racial disproportionality of the policy’s outcomes as well as the role of high-stakes testing in incentivizing suspensions — it’s hard to keep challenging students engaged with test-driven curriculum, and students’ scores don’t count if they’re expelled. The UFT’s position was clear: the union was opposed to a punitive system of discipline. Fast forward to July of this year when Mayor Bill de Blasio and Schools Chancellor Carmen Farina introduced a new discipline code which, with some potential loopholes, bans suspensions for students through the second grade, vows to remove metal detectors from some school buildings, and includes a commitment of $47 million “to support school climate initiatives and mental health services.” This move away from the harshest policies of years past seems aligned with what the UFT advocated for in 2011. The policy also vindicates what many educators have argued for years: punitive, “no excuses” discipline policies are correlated with a host of negative social and academic outcomes. These policies, which are often explicitly based on “broken windows” theories of policing, further alienate already struggling students. For these reasons, progressive educators have long rejected them outright. So many teachers were confused when in August, current UFT president Michael Mulgrew announced the union’s rejection of the new discipline policy. Mulgrew was also president in 2011 when the UFT was actively pushing for less suspensions and more restorative practices to keep students in schools. The contradiction from the UFT appears confusing at first. But it makes sense given the history of the union and its long-ruling UNITY Caucus. UNITY-controlled UFT has been and continues to be a union that takes principled stands for social justice only when doing so also accords with its own internal prerogatives. This most commonly takes the shape of more public funding for union jobs but is also connected to more generic organizational goals of power and public image. The UFT’s position in 2011 made political sense — the union was fighting back against a mayor deeply hostile to it. And no policy had been proposed, so the union’s support was purely theoretical. In 2016, it’s not immediately clear how the new discipline policy benefits the union, so it’s being rejected. The UFT’s repudiation of the new DOE policy and simultaneous failure to mount a member-driven campaign for the issues that affect students, parents, and teachers alike is of a piece with the union’s larger, misguided strategy. The UFT leadership’s failure to activate their membership, combined with their tightly controlled style of political brokerage with City Hall — a strategy built around press conferences, letters to public officials, and op-eds — has left the union too weak to engage in struggles that could build the power of New York’s working class.\nTeachers Want What Students Need (Sometimes) In fairness to the UFT, in both instances, 2011 and 2016, the union advocated for fully funded and staffed programs that divert students from the criminal justice system. In Mulgrew’s recent letter to Chancellor Farina spelling out the union’s opposition to the new policy, he implored the DOE to first ensure that every school has “a functioning Pupil Personnel Team responsible for helping students with behavioral problems” and “increasing staff training in de-escalating student crises,” among other proposals. He made clear that “the ‘Zero Tolerance’ policies of the previous administration clearly backfired — they never led to a nurturing school culture or even-handed discipline.” The UFT has argued that the DOE isn’t providing the resources necessary to implement a genuine alternative to suspension. Mulgrew is rightly identifying a practice common to the city department of education in mandating new programs or policies without providing funding or programmatic support. The opinions of teachers confirm this; according to the New York Daily News, “62 percent of union leaders in schools polled in January said their schools do not have sufficient staff to provide intervention services to help students who act out.” Mulgrew is also right to highlight programs already required in the discipline code that, if well-funded, could reduce suspensions and other punitive punishments. This demand for more robust public services is exactly the kind a public-sector union should be making. Furthermore, while the UFT is often characterized as self-interested and shortsighted, they advocate for jobs that have ripple effects beyond increasing the union’s rolls. Aside from providing a quality standard of living for educators, funding for restorative programs benefit students who suffer from under-resourced schools and families who are too busy or overworked to participate fully in their child’s schooling. The UFT does want more members and more dues money — and that’s a good thing. Yet Mulgrew was also unequivocal in rejecting the new citywide discipline policy. “Children who are in crisis and who are disrupting classrooms,” he wrote, “are not going to be helped by this plan to ban suspensions in grades K-2, and neither will the thousands of other children who will lose instruction as a result of those disruptions.” Mulgrew also noted in his letter that “Better management [of existing disciplinary programs] would also result in more schools developing a positive culture of discipline and respect.” Nowhere does the UFT president mention the importance of an engaging curriculum, a school-wide culture of collaboration, or robust counseling services — programs that progressive educators have long advocated for as potential solutions to punitive discipline. Given the overall lack of funding and administrative initiative behind restorative programs, the new suspension policy might seem to be another unfunded mandate from the DOE. It’s not yet clear how that $47 million will be distributed and used. So challenging the policy seems like a practical position by the UFT. Yet in doing so the union is effectively lining up to the right of the DOE. It’s hard to see how this stance benefits anyone but those who demonize the union as unconcerned with the most underserved students. The UFT’s position harms students who learn from a young age that school is a marginalizing and punitive environment. It inconveniences parents who are then required to provide child care and possibly forego wages. Perhaps most importantly, it marks entire communities, overwhelmingly communities of color, as having youth who are “troubled” or “at-risk,” code words for targets of policing both in school and out. Understandably the union wants robust programs staffed by trained educators. But by coming out against even marginally progressive policies that could benefit the city’s most oppressed populations — poor, working-class communities of color — the union is alienating the very constituencies that could be critical allies in securing the funding and political will necessary to see those programs materialize. Unfortunately, the UFT is more willing to further cement its image as narrowly self-interested and bureaucratic rather than transform itself into a socially concerned and solidaristic union. Most New Yorkers are not going to know the restorative programs the union is advocating for. Parents are going to read stories in the Daily News and the New York Post claiming that the union is fighting against a policy that prevents five-year-olds from being suspended. They are going to remember when their child, relative, or neighbor was removed from the school building. And they will associate the UFT with such heavy-handed disciplinary policies.\nLack of a Social Vision If the union had the will to embrace a more social vision of unionism, they would spend more time waging grassroots campaigns against the forces that harm teachers, students, and parents alike. Chronic underfunding of schools, overcrowding, constant and expensive standardized testing, the privatization of public education through charter schools, and a teacher turnover rate of more than 35 percent every five years in New York City are just a few issues the UFT could aggressively target. The turnover rate is particularly relevant to the notion of discipline. Turnover brings in a new crop of inexperienced educators into the New York school system every few years. This turnover is worst in charter schools. And effective classroom management, the kind that can keep students engaged in the curriculum and the school community, is a craft best performed by experienced educators. Unfortunately, this is exactly the demographic that is leaving teaching in droves. The UFT laments this unfortunate reality, but their failure to activate their membership leaves them impotent to challenge it. Like the frequently maligned turnover rate, the UFT also lambasts charter schools, but has had little success in preventing their spread, even with their supposed ally and charter school skeptic de Blasio in City Hall. When it comes to overly punitive disciplinary policies, charter schools are some of the worst offenders. As George Joseph writes at CityLab, “though the charter school student population represents just under 7 percent of [NYC’s] total, charter schools accounted for nearly 42 percent of all suspensions, according to the latest available state data, from 2014.” Unsurprisingly, the charter schools that suspend most are located in New York’s historically black neighborhoods: Harlem, Crown Heights, Brownsville, and East New York. The UFT’s simultaneous rejection of the new DOE suspension policy and failure to mount a member-driven campaign for the issues mentioned above encapsulates the union’s misguided strategy. The UFT takes on the politically expedient fights it thinks it can win so as to increase membership. In the process it ignores the broader concerns of the city at large. And it often loses even those smaller battles because the teacher force it is trying to advocate for is inactive and removed. A more nuanced and politically productive response to the suspension policy by the UFT would have been one akin to that of the New York Civil Liberties Union, which in the wake of the announcement remarked that “We think [it is a] positive development, but will be monitoring implementation.” Or that of the Urban Youth Collaborative, whose coordinator Kesi Foster told Chalkbeat that it was “progress . . . a step in the right direction” and pushed the DOE to move toward more wide-ranging reforms. “Transformative change,” Foster said, “would expand that same understanding and compassion” to high-school and middle-school students at risk of suspension. Instead, the union chose a rhetorical line which confirms the accusations of its most ardent critics, no matter how incomplete or ungenerous those accusations may be. It makes the union, both in substance and appearance, one unwilling to lend its support to New York’s most oppressed groups.\nUNITY’s Troubled History Of course, this myopic, business-union ideology is practically built into the constitution of the UNITY Caucus, the ruling faction within the UFT since its inception in 1960. When the social-movement-oriented Teachers Union of the 1930s and 1940s was effectively destroyed by the state for its communist leadership and confrontational politics, the UFT arose from its ashes and established itself as the more conservative alternative to its predecessor. Historian Clarence Taylor writes in his book on the Teachers Union that as the UFT emerged, The brand of teacher unionism advocated by the TU, social unionism linking community concerns, would be pushed aside to focus on improved working conditions, increased salaries, and benefits. With the UFT as the collective bargaining agency, issues that were critical to black and Hispanic communities — such as the practice of assigning the least experienced teachers to their schools and segregating the student body — would be marginalized. Sometimes the internal interests of the union will naturally dovetail with those of the city’s working and middle classes at large, as they do in reducing class size, hiring teaching support staff, and implementing school-based wraparound services like medical care and counseling (all of which result in more UFT members). But sometimes these interests don’t naturally cohere, and the UFT has a less than stellar record in these moments — most famously in their 1968 trio of strikes against community control of schools in Ocean Hill-Brownsville. Episodes like this make it hard to disentangle the union’s genuine disregard for broader social concerns from the long-standing propaganda from those who want to weaken one of the most powerful unions in the country. When the concerns of the city at large don’t seamlessly converge with those of union members, only an explicit ideology of social unionism — like that most powerfully exemplified by the Chicago Teachers Union — can help resolve these contradictions. Unfortunately, the more conservative philosophy of the UFT described by Taylor continues today in the UNITY Caucus. By rejecting the mayor’s marginally improved plan to eliminate suspensions through the second grade and reduce the use of metal detectors, the UFT has further distanced itself from working-class communities. These are the same communities that, if allied with, could aid in the UFT’s transformation from a bureaucratic provider of workplace benefits to an organization capable of altering the politics of the city on a mass scale. Unfortunately, this service-provider model has been the philosophy of UNITY since its inception. There’s no reason to think it will change any time soon.", "url": "https://www.jacobinmag.com/2016/10/uft-suspensions-nyc-schools-teachers-discipline"}