{"authors": ["Bo Petersen"], "date_download": "2020-05-04 20:09:18", "date_modify": "2020-05-04 20:09:18", "date_publish": "2017-10-28 23:01:00", "description": "The last time state regulators set a new beach-building restriction line, they went county by county to get people's input. The process took more than a year. This time they did it in one...", "filename": "_fb5fa67ee2514bdbb7f0cec7237ef931_1588622958.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fb5fa67ee2514bdbb7f0cec7237ef931_1588622958.html", "title": "Furor over new South Carolina beach-building restrictions leaves regulators with a mess", "title_page": "Furor over new South Carolina beach-building restrictions leaves regulators with a mess", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The last time state regulators set a new beach-building restriction line, they went county by county to get people’s input. The process took more than a year.\nThis time they did it in one fell swoop, with three public hearings, giving the public two months to respond.\nWhat happened? Capt. Sam’s Spit.\nThe job became a rush after the Legislature in 2016 set a Dec. 31, 2017, deadline for establishing a restriction baseline that can’t be moved any closer to the ocean — a line that, as proposed, could jeopardize a few thousand properties up and down the coast that are at least partly on the wrong side of it.\nThe line would be the point seaward of which is determined to be an active beach that shouldn’t be built on.\nThe regulation deadline came amid a hard-fought lobbying campaign over developing Capt. Sam’s Spit on Kiawah Island, a debate that came to a head when a developer’s lobbyist “verbally attacked” a legislator at the close of a committee hearing, according to three lawmakers.\nReports of the incident angered lawmakers and led to a virtually unanimous vote to approve the Dec. 31 deadline. Now the legislators — aware of the emotions behind the move and a little taken aback at the furor the sudden drop of the lines has brought — are trying to fix it, at least retroactively.\nConfused\nOnce the baseline is set, owners couldn’t build or repair storm damage without a costly special permit that can take more than a year to win. The line could affect property values as well as insurance rates or coverage.\nThe measure could grind to a virtual halt millions of dollars of beachfront real estate sales and construction, some Realtors said.\nDozens of businesses, business groups such as the Myrtle Beach Chamber of Commerce and coastal governments have joined hundreds of beachfront property owners to ask the state to delay the new line to give owners more time to assess its impact and decide whether to appeal.\nGov. Henry McMaster, state legislators and U.S. Rep. Mark Sanford, R-S.C., are pressing the S.C. Department of Health and Environmental Control too. The owners, they say, are at a loss and a share of the billion-dollar tourism economy threatened.\nDHEC isn’t much better off. No one can be sure just how long the owners have to appeal the new lines — that’s how confused this mess has become little more than a month before the lines are scheduled to take effect.\nThe owners are thought to have a year to appeal from the day the lines are imposed. But attorneys who have studied the statutes say they have only 15 days.\n“A regulation cannot trump a statute. The statute is clear. If the revisions aren’t challenged by the expiration of the 15 days, it becomes a final decision and is not subject to review as a contested case,” said Charleston attorney Mary Shahid. “The Administrative Law Court won’t have jurisdiction to hear the challenge.”\nDHEC staff did not return messages and emails asking for comment.\nTail wagging\nSen. Chip Campsen, R-Isle of Palms, is among officials exploring the possibility of appeal extensions and even a deadline date change when the General Assembly convenes in January.\nThe deadline and the ensuing rush “really, it was Capt. Sam’s Spit, the tail wagging the dog,” Campsen said. “It’s a problem. Property owners need time to decide whether they want to appeal, and have time to establish an appeal. I think there’s a good chance we could get it done in January.”\nBut the lines, announced in early October, would be enforced as of early December.\nDHEC has been legally hamstrung enforcing the baseline since 1992, when David Lucas, an Isle of Palms resident, successfully sued the agency for denying him permits, arguing in a landmark case that it amounted to an illegal taking of his property without payment.\nSince then, the agency has granted 71 of 72 special permit applications for construction at least partly seaward of the baseline. That’s fewer than three per year. Only 48 have been built, and only 28 of those have been new buildings.\nBut the lackluster enforcement led to a new round of beachfront management rule recommendations, including the Dec. 31 deadline.\nAgain, property owners are mulling suing.\n“Isn’t this akin to the taking of land under eminent domain,” said Claude Burns, of Rock Hill, who owns a beach house on Edisto Beach.\n“I wish it were eminent domain. At least I’d get paid for (losing my house),” said Bill Fuller, of Greenville, who owns a beachfront lot on Edisto that he soon planned to build on.\nComing out of a blistering in public hearings last week, DHEC is looking at its options, say officials who have been in contact with the agency.\nBill Eiser, the former DHEC oceanographer who helped put together the “setback” line restrictions, has given the agency staff his suggestion: approve the parts of the line that would be moved seaward, where property owners don’t have a concern, by the Dec. 31 deadline.\nMeanwhile, hold off approving the parts that would be moved back, across properties where owners are concerned, to give them the time they are seeking. The state statute clearly allows the line to be determined part by part, he said — that’s what DHEC did last time, county by county. Eiser is now a coastal development consultant.\n“I do believe (the agency) is going to give property owners ample time to establish their appeals,” he said.", "url": "https://apnews.com/fb5fa67ee2514bdbb7f0cec7237ef931"}