{"authors": ["Alex N. Press", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Alex Gourevitch", "Matt Karp", "Chad Pearson", "Lily Geismer"], "date_download": "2020-05-04 20:00:07", "date_modify": "2020-05-04 20:00:07", "date_publish": "2017-05-11 00:00:00", "description": null, "filename": "2017_05_hillary-clinton-onward-together-trump-resistance_1588622407.html", "image_url": "https://images.jacobinmag.com/2017/05/11112216/30464713010_d10c0fff1e_k.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_05_hillary-clinton-onward-together-trump-resistance_1588622407.html", "title": "Still Not an Activist", "title_page": "Still Not an Activist", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Six months after losing to Donald Trump, Hillary Clinton is rebranding herself as an activist.\nIn an interview last week with CNN’s Christiane Amanpour at a Women for Women International event, Clinton described herself as “back to being an activist citizen and part of the resistance.”\nSetting aside what period of her life Clinton considers her “activist citizen” past — That time she and Bill crossed a picket line on their first date? The days when she could get away with calling black kids “superpredators”? — what will Sister Hillary’s activism entail?\nFor starters, she is building a new political organization. The group, expected to be called Onward Together (a play on her campaign slogan “Stronger Together”), will focus on sending money to organizations “working on the resistance to President Donald Trump’s agenda.” It’s too early to tell what that actually means, but judging by those on the Onward Together team, it looks to be more of the same top-down strategy.\nClinton has brought on Dennis Cheng, her campaign’s finance director and one-time chief development officer of the Clinton Foundation, and has named Minyon Moore to the new organization’s board. Cheng spent much of 2016 escorting Clinton to some of the country’s richest locales, with Silicon Valley, Beverly Hills, and the Hamptons among the duo’s stops (presumably the Rust Belt was unworthy of Cheng’s attention). Moore works as a lobbyist for the Dewey Square Group, which helped subprime lender Countrywide win wide influence among DC politicians.\nSo much for “the resistance.”\nBut what of the substantive issues Clinton is addressing?\nIn her CNN interview, Clinton emphasized economics, insisting that the country must grapple “with a lot of these hard issues that are right around the corner like robotics and artificial intelligence and things that are really going to be upending the economy for the vast majority of Americans.”\nHer comments represented a sharp break from the final months of the 2016 election season, when — as Democratic pollster Stanley Greenberg put it — the Clinton campaign was “totally silent on the economy and future plan that would be helpful to people.” It seems that left criticism, combined with Trump’s opportunistic messaging about deindustrialization, has made Clinton change her tune.\nPerhaps the crushing election loss played a role, too. As Mike Davis itemizes in a recent essay, in almost all of the counties that flipped from Barack Obama to Trump, “a high-profile plant closure or impending move had been on the front page of the local newspaper: embittering reminders that the ‘Obama boom’ was passing them by.” While pundits continue to laugh off mentions of “economic anxiety,” this pattern points to both the political and moral imperative of addressing the current wave of job flight.\nClinton, to her credit, appears belatedly aware of the economic suffering plaguing workers across the country. So what remedies does she have in mind?\nUnfortunately, her recent speeches have little to offer in this respect. She’s back to working with the Harry Walker Agency, the speakers bureau that arranged her widely criticized talks to Wall Street executives. And her public remarks have had less to do with the economy than social media.\nIn a speech at Planned Parenthood’s annual gala last week, Clinton took the opportunity to talk about . . . memes. Referencing a photo of a uniformly white and male House Freedom Caucus discussing health care cuts, Clinton asked, “Could you believe those photos of men around that conference table, deciding how to strip away coverage for pregnancy and maternity care?” before adding: “I gotta say, my favorite Internet meme about this were the dogs sitting around the table discussing ‘feline care.’ I found that so on point.”\nThe next day, while being fêted as a Gloria Awards’ Women of Vision honoree, Clinton descended even deeper into social media myopia. Speaking to the crowd, she said, “I just want all these Twitter trolls out there to know that maybe if you had left us alone, we might have gone out longer in the woods for our walks, but every time you hit those 140 characters demeaning women’s voices and rights, we’re comin’ back at you.”\nAs the GOP works overtime to shovel as much money as possible to the ultra-rich, Hillary Clinton is concerned with Twitter trolls.\nThis is a drastic case of conflating one’s social media notifications with the country’s political landscape. Maybe someone should inform Clinton that the Internet is not the forum in which real-life struggles over political power are decided. But with gargoyles like Cheng, Moore, and Democratic operative David Brock around her, we shouldn’t hold our breath.\nDespite claiming the banner of “the resistance,” it’s these neoliberal cronies who enable Trump. They lend their services to the same politicians who created the socioeconomic environment that birthed Trump. They move in elite Beltway social circles, only interacting with working-class people during photo ops. They’re incapable of stanching the bleeding from the wounds inflicted by the Trump administration and its congressional allies.\nClinton’s resistance is anti-democratic: it’s about giving millions of dollars to other people who already have millions of dollars, all because they hobnob together at the same cocktail parties and adhere to the same arbitrary norms of civility.\nClinton can call her new money-funneling scheme and Twitter wars “activism” if she wants, but none of us should expect anything different from what we saw during the 2016 campaign. Democratic Party elites and their rich donor flunkies have nothing to offer a resistance with teeth: they’re the enemies, still.", "url": "https://www.jacobinmag.com/2017/05/hillary-clinton-onward-together-trump-resistance"}