{"authors": ["Greg Bates For The State Journal"], "date_download": "2020-05-04 20:16:21", "date_modify": "2020-05-04 20:16:21", "date_publish": "2017-11-11 09:35:00", "description": "MENASHA – If defense wins championships, the Waunakee football team is in prime position to capture its sixth state title. The Warriors allowed just 140 yards — the majority of those coming...", "filename": "_55bd94bd090148929045b6ef3b25001d_1588623381.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_55bd94bd090148929045b6ef3b25001d_1588623381.html", "title": "WIAA football playoffs: Defense helps send Waunakee to state title game", "title_page": "WIAA football playoffs: Defense helps send Waunakee to state title game", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MENASHA – If defense wins championships, the Waunakee football team is in prime position to capture its sixth state title.\nThe Warriors allowed just 140 yards — the majority of those coming late with the game in hand — and forced four turnovers as Waunakee beat Green Bay Southwest 35-14 in a WIAA Division 2 state semifinal at Calder Stadium on Friday night.\nThe defense was dominant. Plain and simple.\n“We played awesome,” Waunakee coach Pat Rice said. “I thought it was an outstanding effort. … To hold them in check the way we did, create some short fields for the offense, I think that was really a key for us.”\n“Anytime you’re going to get that many turnovers, you’ve got a chance to be pretty successful.”\nThe win sends Waunakee to the Division 2 state title game against Brookfield Central at Camp Randall Stadium next Friday.\nIt will be the Warriors’ ninth appearance in the championship game, but first for any player on the current roster.\n“It’s really exciting,” Rice said. “The kids have worked so hard and it’s a culmination of a lot of dreams for these kids, and hopefully we can finish it up at Camp Randall.”\nThe defense almost overshadowed a powerful performance by the Waunakee offense. The Warriors amassed 382 yards. Javian Dayne – son of Heisman Trophy winner Ron Dayne, the former University of Wisconsin and NFL running back – racked up 156 yards on 27 carries and quarterback Nate Carter threw for 183 yards and a touchdown.\nRice intended to have a balanced attack, and that worked to perfection.\n“I thought our offense did some very good things,” Rice said. “We hurt ourselves a little bit in the first half with some penalties and got ourselves behind the chains, but once we got out of our own way a little bit, I think we were better.”\n“Our defense kept giving us opportunities.”\nWaunakee, which is ranked No. 1 in Division 2, came into the game allowing just 6.2 points per game and had recorded five shutouts. It had a shutout going through three quarters, but the No. 9 Trojans scored twice in the fourth quarter against the Warriors’ reserves.Waunakee scored 17 of its 35 points off turnovers. The defense was swarming to the ball all night.\n“It was just a complete team effort, just staying on our keys,” said Waunakee defensive back Jeremy Werner, who had two of his team’s three interceptions. “We had a great week of practice – shout out to our scout team, they gave us a great look. We just executed to the best of our ability, stayed on our keys. Just making plays, that’s what we do.”\nWaunakee (13-0) got in Green Bay Southwest (11-2) territory on all six of its first-half drives, scoring two touchdowns and two field goals.\nWaunakee didn’t waste any time getting its offense going. After a field goal and a three-and-out by the defense, the Warriors’ L.O. Johnson had a 7-yard touchdown run to make it 10-0 in the opening quarter.\nFacing a third-and-9 midway through the second quarter, Carter hit Josh Block in stride over the middle on a slant for a 28-yard touchdown to put Waunakee up 17-0.\nWaunakee’s defense didn’t surrender its first first down – it was by penalty, in fact -- until there were three minutes left in the first half. The Trojans had just 25 yards in the opening half\nDayne got into the act with touchdown runs in the third quarter, from 7 and 13 yards out to put the game out of reach.\nWerner can’t believe he’ll play his final high school game for a state title.\n“This is what we’ve been working for since fourth grade, and we’ve got a lot of seniors on this team and the juniors have stepped up,” Werner said. “It’s just overwhelming.”\nGreen Bay Southwest 0 0 0 14 — 14\nWaunakee 10 10 15 0 — 35\nW — FG Saxby 33\nW — Johnson 7 run (Marek kick)\nW — Block 28 pass from Carter (Marek kick)\nW — FG Marek 29\nW — Dayne 7 run (Marek kick)\nW — Dayne 13 run (Olsen run)\nSW — Keener 13 run (Czamecki kick)\nSW — 33 pass from Howard (Czamecki kick)\nTEAM STATISTICS\nFirst downs — SW 8, W 17. Rushing — SW 22-65, W 43-195. Passing yards — SW 107, W 187. Passes (Comp.-Att.-Int.) — SW 7-18-3, W 17-23-0. Fumbles-lost — SW 3-1, W 0-0. Penalties-yards — SW 9-75, W 8-70.\nINDIVIDUAL LEADERS\nRushing: SW, Komis 9-32. W, Dayne 27-156.\nPassing: SW, Howard 7-18-3-107. W, Carter 16-22-0-183.\nReceiving: SW, Keener 4-64. W, Johnson 5-51.", "url": "https://apnews.com/55bd94bd090148929045b6ef3b25001d"}