{"authors": ["Michael Scott"], "date_download": "2020-05-04 20:09:48", "date_modify": "2020-05-04 20:09:48", "date_publish": "2017-02-12 02:00:00", "description": "As a young man struggling and unwilling to accept homosexuality, I found comfort in the misleading notion that I could overcome being gay. When I became a Christian at the age of 17, I became...", "filename": "_1f46473a7dc44d50b2ca362abcdc7687_1588622988.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1f46473a7dc44d50b2ca362abcdc7687_1588622988.html", "title": "Reader View: Conversion therapy created self-hatred, self-destruction", "title_page": "Reader View: Conversion therapy created self-hatred, self-destruction", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As a young man struggling and unwilling to accept homosexuality, I found comfort in the misleading notion that I could overcome being gay. When I became a Christian at the age of 17, I became involved in the ex-gay or conversion therapy movement.\nIn 1989, I went to my first ex-gay conference at the age of 18. Entirely naïve and committed to the idea that this was my intense spiritual trial, I attended weekly. Throughout the course of my therapy, strict and archaic gender stereotypes were taught and enforced. I was told repeatedly that I needed to learn to like football, to lower my voice, to avoid being a “weak” man, to wear certain types of underwear that “real men” wore and to adopt more masculine behaviors.\nThe program teaches you that you can be healed, and in approximately three years, one could overcome homosexual behaviors, have a heterosexual marriage, children and a so-called normal life. I immersed myself in this program for 10 years, and after almost a decade, realized I was failing. I hit a crisis point when I was unable to make my homosexuality disappear and doubled down my efforts.\nSpurred forward by the teachings to become a macho male figure, I joined the Army and volunteered for the 82nd Airborne Division — the toughest and most masculine thing I could think to do.\nIt was also the most dangerous thing I could do, as it led to being thrust into a violent, debauchery-filled environment. During my time in the Army, I was outed, ridiculed, rejected and made to feel as though I did not belong. Alienated and forced to deal with homophobic slurs and comments, I was eventually sexually assaulted and then discharged under “Don’t Ask, Don’t Tell.”\nAfter my discharge, I went through a period of self-destructive behaviors and eventually found my way back into ex-gay therapy, which had only become darker and more robust in its teachings of self-hatred, guilt and shame. Only after discovering genuine therapy through the U.S. Department of Veterans Affairs was I able to get my life on the right track and face the realization that there is no truth in ex-gay teachings.\nEx-gay therapy contributed to many harmful factors in my life. The problem with this type of therapy — aside from its clear lack of success and false teachings — is that licensed practitioners often hide it in insurance reports as cognitive behavioral therapy, or CBT. Other practitioners unfortunately have no training at all — a two-week course in the case of my counselor. Regardless of how this so-called therapy is administered, it is dangerous and does not promote mental health.\nThis pseudo-counseling style provides truly damaging therapy and sweeps legitimate mental health issues under the rug, as counselors seek to blame any and all issues on homosexuality, rather than looking at the real root of the problem. In my case, the pressing issues I faced were depression and obsessive-compulsive disorder, but ex-gay therapy led me to believe being gay caused all of my problems. This line of thinking is severely harmful and placed tremendous damage on my psyche and well-being.\nI still have faith and am a member of the Episcopal Church, yet I cannot condone the types of teachings I received. As one who now holds a master’s degree in social work, I want to use my voice and skills to help others, and I can attest that conversion therapy does not work and causes significant, lasting damage. I support the prohibition of conversion therapy in New Mexico and urge our lawmakers to take a stand to keep from perpetuating a cycle of trauma and destruction.\nMichael Scott lives in Albuquerque.", "url": "https://apnews.com/1f46473a7dc44d50b2ca362abcdc7687"}