{"authors": ["Mark Dawidziak", "The Plain Dealer"], "date_download": "2020-05-04 20:25:43", "date_modify": "2020-05-04 20:25:43", "date_publish": "2017-11-19 10:40:01", "description": "Macy's Parade, Mark Twain Prize and Marvel series top the week's TV choices (videos) CLEVELAND, Ohio – The week's viewing choices include a new Marvel series based on a comic book co-created...", "filename": "_d17a0cf0eb6e4605b5d670cf6f81d7d7_1588623943.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d17a0cf0eb6e4605b5d670cf6f81d7d7_1588623943.html", "title": "Macy's Parade, Mark Twain Prize and Marvel series top the week's TV choices (videos)", "title_page": "Macy's Parade, Mark Twain Prize and Marvel series top the week's TV choices (videos)", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Macy’s Parade, Mark Twain Prize and Marvel series top the week’s TV choices (videos)\nCLEVELAND, Ohio – The week’s viewing choices include a new Marvel series based on a comic book co-created by Brian K. Vaughan, who grew up in Rocky River and Westlake:\n“The Kennedy Center Mark Twain Prize” (8 p.m. Monday, Nov. 20, WVIZ Channel 25 and WEAO Channel 49): Comedian and late-night host David Letterman is honored in Washington, D.C., with the Mark Twain Prize for American Humor at a Kennedy Center for the Performing Arts gala. Among those giving Dave his due are Bill Murray, Steve Martin, Jimmy Kimmel, Norm Macdonald, John Mulaney, Amy Schumer, Paul Shaffer, Martin Short, Eddie Vedder and Jimmie Walker. Murray and Martin are past recipients, as are Richard Pryor, Jonathan Winters, Bob Newhart, Lily Tomlin, Neil Simon, George Carlin, Carol Burnett and Eddie Murphy.\n“Marvel’s Runaways” (Tuesday, Nov. 21, Hulu): The first Marvel series on streaming service Hulu is “Gossip Girl” creators Josh Schwartz and Stephanie Savage’s adaptation of the comics by Vaughan and Adrian Alphona. Vaughan was one of the principal writers and executive producers on “Under the Dome,” the CBS series based on Stephen King’s novel. “Runaways” stars Rhenzy Feliz, Lyrica Okano, Virginia Gardner, Ariela Barer, Gregg Sulkin and Allegra Acosta as six teenagers who united against a common foe: their villainous parents. Vaughan is a St. Ignatius High School graduate, class of ’94.\n“Macy’s Thanksgiving Day Parade” (9 a.m. Thursday, Nov. 23, WKYC Channel 3): “Today” anchors Matt Lauer, Savannah Guthrie and Al Roker are hosts for the 91st edition of the New York City parade. Featured celebrities include 98 Degrees, Lauren Alaina, Cam, Sabrina Carpenter, Andra Day & Common, Sara Evans, Jimmy Fallon & The Roots, Andy Grammer, Angelica Hale, Olivia Holt, Nicky Jam, Wyclef Jean and Smokey Robinson. Broadway numbers will be performed by the casts of “Anastasia,” “Dear Evan Hansen,” “Once on This Island” and “SpongeBob SquarePants - The Broadway Musical.”\n“Anne of Green Gables: The Good Stars” (8 p.m. Thursday, Nov. 23, Channel 25 and Channel 49): Author L.M. Montgomery’s free-spirited Anne Shirley (played by Ella Ballentine) returns to PBS and turns 13, facing complex situations with friends, adults and Gilbert. Milestones include first sleepovers, culinary misadventures and shifting relationships. Martin Sheen is back as Matthew Cuthbert.", "url": "https://apnews.com/d17a0cf0eb6e4605b5d670cf6f81d7d7"}