{"authors": ["Jake Prinsen", "News Republic"], "date_download": "2020-05-04 20:12:23", "date_modify": "2020-05-04 20:12:23", "date_publish": "2017-04-16 20:28:00", "description": "A major fundraiser for the University of Wisconsin-Baraboo/Sauk County will feature success stories from the college’s faculty and students. On Thursday evening, the university’s Friends of...", "filename": "_62ed020da96a40e0a72e8494e74616ed_1588623143.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_62ed020da96a40e0a72e8494e74616ed_1588623143.html", "title": "Students and faculty to keynote UW-Baraboo fundraiser", "title_page": "Students and faculty to keynote UW-Baraboo fundraiser", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A major fundraiser for the University of Wisconsin-Baraboo/Sauk County will feature success stories from the college’s faculty and students.\nOn Thursday evening, the university’s Friends of the Campus Foundation will host its annual Grape and Gourmet Gala at the Trappers Turn Golf Club, 2955 Wisconsin Dells Parkwy, Wisconsin Dells. The celebration features fine wines, gourmet food, and silent and live auctions.\nFriends of the Campus Foundation Board President Tim Teelin said the evening is intended to showcase the university, along with its dedicated faculty and students.\n“It’s an opportunity for our guests to meet and talk with the students as well as faculty,” he said.\nA gourmet dinner will be prepared that evening by the culinary teams of Trappers Turn and Kalahari Resorts. Each of the four courses will be served with paired wines to bring out the subtle flavors of the food.\nThe formal program begins at 6:15 p.m. with a message from Teelin and Charles Clark, dean of UW-Baraboo, and concludes with a live auction and dessert. In between, guests will hear UW-Baraboo success stories from students and faculty.\nWhile past galas have only featured student testimonies, Teelin said this year’s celebration will feature a faculty member‘s unique story as well.\n“We have students tell how they got where they are, and some of these stories are just simply phenomenal,” he said. “This year, we’ll be doing something a little different in that we’re also going to showcase a faculty member.”\nThat faculty member is UW-Baraboo mathematics professor Kirthi Premadasa, who will be named chair to the Mathematical Association of America’s Wisconsin Chapter April 22.\nFriends of the Campus Foundation Board secretary Aural Umhoefer said she’s looking forward to the student and faculty presentations, so that guests can see the high caliber of students and educators at the university.\n“We have all kinds of students on campus – adult students who are coming back to school for the first time, as well as traditional students,” she said. “It’s good for people coming to the event to learn more about our faculty and students, in addition to enjoying a wonderful gourmet meal.”\nTeelin said the gala usually brings in between $50,000 and $60,000, the lionshare of which is used for the group’s scholarship program.\n“We are so pleased to be able to provide scholarships to students, both young and old, who are working hard to gain an education and to be the leaders of tomorrow,” Teelin said. “All of the proceeds from this event help students to achieve their goals and to build their future.”", "url": "https://apnews.com/62ed020da96a40e0a72e8494e74616ed"}