{"authors": ["Mike Fitts Special To The Post"], "date_download": "2020-05-04 20:03:57", "date_modify": "2020-05-04 20:03:57", "date_publish": "2017-10-08 15:00:00", "description": "COLUMBIA — When looking to book legendary classic rock band ZZ Top for your big annual get-together, it’s best to start early. For the South Carolina State Fair, that means January is the...", "filename": "_9c4c279ed70f4a8aa53f0527192b4a83_1588622637.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9c4c279ed70f4a8aa53f0527192b4a83_1588622637.html", "title": "For the South Carolina State Fair, the show is all in a year’s work", "title_page": "For the South Carolina State Fair, the show is all in a year’s work", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "For the South Carolina State Fair, the show is all in a year’s work\nCOLUMBIA — When looking to book legendary classic rock band ZZ Top for your big annual get-together, it’s best to start early.\nFor the South Carolina State Fair, that means January is the time to start pursuing some acts for the big grandstand shows coming up in October. The fair staff works for months to line up acts in a variety of genres from country to rhythm and blues, fair general manager Gary Goodman said. That means pursuing groups early in the year and keeping in contact as they make their tour plans, which can take months.\nBooking grandstand acts is just one of the major tasks that keep the State Fair staff working year-round, said Goodman, who has been managing the staff for 33 years. Running the Fairgrounds near downtown Columbia with its many events and the scholarships program keep the staff busy, plus the months of planning to make sure the State Fair shines every year.\n“The majority of people think we all show up three or four days before the fair and open things up and the fair happens,” Goodman said.\nIn fact, the fair has a staff of 30 people working year-round to take care of all the organization’s responsibilities, including being ready for the organization to expand to 350 workers during the fair’s two-week run, which this year runs from Wednesday to Oct. 22.\nBooking stage acts is one of the longer-term efforts, Goodman said.\nFor a longtime touring act such as ZZ Top or R&B singer Keith Sweat, the fair tries to gets on their radar to see what’s possible, then continue to contact them as they make their plans, he said. For other up-and-coming acts, it can be best to book them early in the year with the expectation that they will gain momentum as singles are released, Goodman said.\nAmong the newer stage acts giving the fair a broad potential audience this year: Disney Channel performer Sabrina Carpenter, who should be a favorite for young teens, he said.\nFinding the judges\nThe staff also spends months lining up judges and contestants for the many livestock and animal events that are the most traditional part of a state fair. The fair staff works with Clemson Extension and other groups to connect with young people and encourage them to bring their animals to the fair’s contests and exhibitions, Goodman said.\nThese events are connected to the fair’s history as an agricultural conference and exhibition, for farmers to share experiences and show their wares. “I really think that’s the heart of the fair,” he said. “If we lost our focus on agriculture, we wouldn’t be any different than Carowinds.”\nAnother major part of the fair that takes months of advance work: the many contests, from baking to art to flowers. Judging has to be arranged and entries need to be received and evaluated before the fair starts, in dozens of categories.\nBefore the fair opens, the organization hires its own outside inspectors to scrutinize all rides, in addition to the state’s inspectors, Goodman said. Rides also are scrutinized daily by operators during the event.\n“There are no shortcuts to safety,” he said.\nAfter the fair\nWhen the fair cleanup ends, the work will keep right on going for the State Fair staff. They also oversee events at the fairgrounds, which does a steady business throughout the year of corporate gatherings, expos and other shows.\nOne major show, the Craftsmen’s Christmas Classic Arts and Crafts Festival, will open on Nov. 3, just two weeks after the State Fair ends.\nAnother feature of the fall season is Gamecock football parking. The State Fair leases its largest parking lot, with 4,100 spaces, to the University of South Carolina for its Gamecock Club to use, Goodman said. Other lots on the fairgrounds are operated by the State Fair itself on game days.\nThe fair also administers its Ride of Your Life Scholarship program. It awards 50 scholarships per year that provide $6,000 over a four-year term for those attending college in the state. The staff has to examine from 350 to about 500 applications to come up with a list of 50 recipients each year, Goodman said. Since 1987, the fair has granted more than $2.7 million in scholarships to students.\nAll the revenue streams beside the fair help the organization have stable revenue, Goodman said. The fair, run by a nonprofit organization set up by the Legislature, pays its own expenses and funds its scholarship program through revenue it generates.\nThat’s a different structure than in North Carolina, where the state fair is run by the Department of Agriculture and Consumer Services. The Georgia National Fair is run by a separate state-launched organization, the Georgia Agricultural Exposition Authority, and there also is a privately managed Georgia State Fair.\nThe stable income from the rest of the year’s activities can help when rain affects state fair turnout, Goodman said. In his 33-year tenure as general manager, he remembers one year when it rained for eight days during the fair’s two-week run, and the receipts were down substantially.\n“There are some pretty lean years,” Goodman said.\nFor Goodman, this will be his 33rd and last S.C. State Fair as general manager. He is retiring at 69. Longtime Assistant Manager Nancy Smith will succeed him in January.\nTo Goodman, the biggest change during his tenure has been the higher demands and expectations of customers. They expect better features and are less patient with waiting to park or in long lines than the customers of decades past, he said.\nEven in the age of digital entertainment, he still sees a role for state, county and regional fairs. They can add better attractions and amenities, yet still bring generations together for the sights, sounds and smells of the fairground, he said. Adults will take their own kids to the fair, just as they went with their own parents once, he said.\n“The fair atmosphere will allow different generations ... to connect,” Goodman said.", "url": "https://apnews.com/9c4c279ed70f4a8aa53f0527192b4a83"}