{"authors": ["Lynn Henning", "The Detroit News"], "date_download": "2020-05-04 20:09:44", "date_modify": "2020-05-04 20:09:44", "date_publish": "2017-11-22 03:53:33", "description": "East Lansing — Wheeling onto Michigan State's campus Tuesday, amid November's usual menu of gray skies and chilly air, was a reminder of some past Spartans football lore. Forty-five years...", "filename": "_bb45c295f60649439584d9d2d431c45f_1588622984.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bb45c295f60649439584d9d2d431c45f_1588622984.html", "title": "Henning: Dantonio was calm after storm Spartans needed", "title_page": "Henning: Dantonio was calm after storm Spartans needed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "East Lansing — Wheeling onto Michigan State’s campus Tuesday, amid November’s usual menu of gray skies and chilly air, was a reminder of some past Spartans football lore.\nForty-five years ago this week, the Spartans said goodbye to Duffy Daugherty. On that frigid Saturday at Spartan Stadium, with snow banks piled high after the Yukon had made an early visit to East Lansing, MSU beat Northwestern. Daugherty, who six and seven years earlier had been playing for national championships, headed that bleak day for a mostly forced retirement as the Spartans prepared for a future reunion with their old Daugherty-Biggie Munn days of grandeur.\nThis instead is what they got:\n■Denny Stolz: three seasons, fired after a horrific NCAA probation sentence.\n■Darryl Rogers: four seasons, left for Arizona State, with his AD, Joe Kearney, when MSU’s president showed he knew a lot about oppression and not much about sports.\n■Muddy Waters: three awful years, fired.\n■George Perles: 12 years, highlighted by a Rose Bowl, low-lighted by a nasty showdown with another MSU president when Perles decided he wanted to be coach as well as athletic director, all before he, too, was axed.\n■Nick Saban: five seasons, an extraordinary job of taking on a mess and eventually constructing a Saban-level team, until his bosses made it known he was just another football coach, which sent him to national championships at LSU and Alabama.\n■Bobby Williams: three seasons, fired, leading to John L. Smith, the product of a computer-printout hiring who proceeded to show that computers, while generally trustworthy, can also bungle fantastically.\nIt brought to East Lansing in December 2006 a man who Tuesday stood at a lectern inside of Spartan Stadium.\nMark Dantonio was a reminder that MSU’s football status, despite a few permanent welts, is back to the general health Dantonio early on delivered and has since rediscovered.\n‘You bounce back’\nThe Spartans are 8-3 and should wrap up at 9-3 if they keep their wits Saturday at Rutgers. Finish 9-3 and Michigan State would resemble a string of past Dantonio teams that were yearly heavyweight contenders until last year’s team got T-boned with a 3-9 finish.\n“A little bit of a life moment,” said Dantonio, who talked Tuesday about a one-year team turnaround, as well as string of non-football topics, from Thanksgiving blessings to where he was on Nov. 22, 1963, when John F. Kennedy was assassinated (third grade, Wilson Elementary School,\nZanesville, Ohio). “We had not lost like we had last year. But any time you go through something like that, where there’s a lot of frustration, you bounce back a little bit stronger. I think sometimes you have to go to those depths — to find yourself a little bit, to reach down.”\nBefore we turn Dantonio into Jimmy Stewart and cue a seasonal re-run of “It’s A Wonderful Life,” remember where the Spartans were 90 days ago.\nThey not only had been recently discharged from a triage unit after that 3-9 catastrophe of 2016, they were dealing with serious, ugly player losses. Three players were exiled after being charged with sex-offense felonies following a January off-season apartment incident.\nThere had been attrition beyond the jailed trio. There were thoughts MSU and Dantonio might have slipped nightmarishly into MSU’s past football timeline, where upheaval was the norm.\nBut it is Thanksgiving 2017, and football is back to being celebrated in step with a holiday designed to mark grace and blessings.\nReality is a good benchmark by which to measure this season’s Spartans.\n‘Now on the rise’\nIt’s brutally tough in this college-football era to draw regular bowl invites and annually please customers and alums. Look at Nebraska. Tennessee. Florida. UCLA. Texas A&M. Big names. Great programs, at least in the past. Nebraska and Tennessee got greedy and decided those old nine- and 10-victory seasons weren’t quite good enough, not unless you won at least that many games every year and never had a brush with something more mortal.\nEach school now would kill to have what Philip Fulmer had at Tennessee or what Frank Solich and even Bo Pielini brought to Nebraska’s prairies.\nIt isn’t greatly different in East Lansing. Dantonio was generally forgiven for last year’s ditch-drive but would have been in the boosters’ crosshairs had this year not gone at least semi-smoothly.\nBut this autumn of MSU football has been, more than a revival, a reaffirmation. His team is headed to a billboard bowl game. More important, Dantonio’s recruiting has more of the rock-hard talent he generally has brought to past classes. All while he competes with a team nearly bereft of seniors.\nThat’s a powerful formula to have in a university’s possession when so many schools, with even deeper pockets and perhaps more at stake, are fighting to even approach the seasons MSU has been racking up, last year’s accident aside.\n“I tend to look at this program right now as on the rise,” he said Tuesday, as MSU’s new hockey coach, Danton Cole, who is bolting together his own renaissance team in East Lansing, listened, preparing to take the press-conference mic. “Got a young football team that believes in itself. A team that believes in itself. That’s confident. A team that understands they will get better.”\nIn college football, it’s wise, of course, to never assume. Brian Lewerke, the Spartans’ splendid quarterback, needs to stay in one piece Saturday and again next season. This is a fragile game. Turnarounds can go either way.\nBut what the folks in East Lansing have seen, firmly, in 2017 is that the pre-2016 years were no mirage. This is a football program. A strong one.\nAs they say on the truck commercial, built to last.\nlynn.henning@detroitnews.com\ntwitter.com/Lynn_Henning", "url": "https://apnews.com/bb45c295f60649439584d9d2d431c45f"}