{"authors": ["Angie Jackson"], "date_download": "2020-05-04 20:16:23", "date_modify": "2020-05-04 20:16:23", "date_publish": "2017-01-26 12:00:00", "description": "Lowcountry residents will want to keep an umbrella handy Thursday morning. There's a 60 percent chance of showers, mainly before 11 a.m., according to the National Weather Service. Clouds...", "filename": "_b068cb6de6ed4a2da5ce70cb21cf7407_1588623383.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b068cb6de6ed4a2da5ce70cb21cf7407_1588623383.html", "title": "Showers, clouds Thursday morning to give way to sunshine in Charleston", "title_page": "Showers, clouds Thursday morning to give way to sunshine in Charleston", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Showers, clouds Thursday morning to give way to sunshine in Charleston\nLowcountry residents will want to keep an umbrella handy Thursday morning.\nThere’s a 60 percent chance of showers, mainly before 11 a.m., according to the National Weather Service. Clouds earlier in the day should gradually give way to sunshine. The morning is already off to a warm start in the 60s, and the high will be near 72.\nToday is the last day in the low 70s before a cool down on Friday. Highs will be in the mid to high 50s for several days.\nA flood warning continues for the Edisto River at Givhans Ferry. By 6 a.m., the river had reached 9.87 feet, just below flood stage of 10 feet.\nMeteorologists expect the river to rise to 10.9 feet by Saturday evening. Additional rises are possible.\nMariners on Lake Moultrie should be aware of strong winds and rough waves up to 2 feet. A lake wind advisory will be in effect today from 11 a.m. until 6 p.m.\nHere’s a look at the weather ahead in the Charleston area:\nTonight: Partly cloudy, with a low around 40.\nFriday: Sunny, with a high near 57.\nSaturday: Sunny, with a high near 54.\nSunday: Mostly sunny, with a high near 57.\nMonday: Sunny, with a high near 54.\nTuesday: Sunny, with a high near 59.\nWednesday: Mostly sunny, with a high near 63.", "url": "https://apnews.com/b068cb6de6ed4a2da5ce70cb21cf7407"}