{"authors": ["Jim Shay", "Cedar Attanasio"], "date_download": "2020-05-04 20:05:41", "date_modify": "2020-05-04 20:05:41", "date_publish": "2017-08-29 10:12:05", "description": "Friends and family are mourning the deaths of the two Fairfield men killed Saturday evening when their boat crashed into the New Haven breakwater, ejecting them. One onto the rocks and the...", "filename": "_4aa48aaad7944180956c976b39f68208_1588622741.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4aa48aaad7944180956c976b39f68208_1588622741.html", "title": "Funeral set for 1 victim in fatal boating accident", "title_page": "Funeral set for 1 victim in fatal boating accident", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Friends and family are mourning the deaths of the two Fairfield men killed Saturday evening when their boat crashed into the New Haven breakwater, ejecting them.\nOne onto the rocks and the other into Long Island Sound.\nThe boat struck the 4,200-foot breakwater on the western side of the harbor, killing Michael Murphy, 53, and Scott Trautman, 46.\nAs the investigation of a boating accident continues, funeral services have been set for one of the victims. Calling hours for Trautman will be held from 4 to 8 p.m. Wednesday in the Lesko & Polke Funeral Home, 1209 Post Road, in Fairfield. On Thursday at 10:30 a.m. in Trinity Episcopal Church of Southport friends may join his family for a service to celebrate Trautman’s life.\nFuneral services for Murphy have not yet been announced.\nThe accident happened at one of three stone walls that shelter New Haven Harbor.\n“I am just numb,” said Dan Ford, a local lawyer. “Mike Murphy was a very close friend to me and my brothers and sisters. He was so supportive of many local charities. Especially the St. Patrick’s Scholarship Dinner, the AOH breakfast and the Connecticut Irish Open. These events will no longer be the same without him there. I cannot fathom this terrible tragedy.”\nMurphy and Trautman were aboard Murphy’s 2017 32-foot Sea Fox power boat heading south in New Haven Harbor during the evening hours Saturday.\n“At some point, Murphy’s vessel struck the north side of the west break wall in the harbor area. Both Murphy and Trautman were ejected from the vessel and sustained fatal injuries,” the state Department of Energy and Environmental Protection said in a news release.\nOn Sunday morning, a boater found Murphy’s boat overturned near the west breakwater in New Haven Harbor. The command center issued an urgent marine information broadcast and launched a 45-foot boat from Coast Guard Station New Haven. West Haven and Milford marine units joined the search.\nA Coast Guard HH-60 Jayhawk helicopter crew from Cape Cod was involved in the search that covered a 61-square nautical miles.\nThe Coast Guard found Trautman on the rocks of the breakwater.\nThe search for Murphy ended around 8:30 p.m. Sunday when the Connecticut State Police dive unit located his body.\nCoast Guard Petty Officer Steve Strohmaier said Monday the two men were not wearing life jackets.\n“If you hit a breakwater at, say, 35 mph — and I don’t know how fast they were going — obviously there are no seat belts on the boat and the people just get catapulted,” said Bruce Williams, vice president of Captain’s Cove in Bridgeport.\nMurphy was an avid boater and golfer.\n“He’s always loved the water,” said his brother-in-law Rick Kral, of Greenwich. “Very safe person.”\nKral said Murphy was putting together a golf tournament to benefit the family of Chris Huges, 54, who died in a boating accident in Maine on June 1.\nMurphy was vice president of Alinabal group in Milford.\n“The Alinabal family has lost one of its most beloved friends, colleagues, and gifted leaders,” said Steve Bennett, director of human resources. “Mike spent 23 years with Alinabal, serving the last 19 as vice president and general manager helping lead the company to unprecedented success in that time, while simultaneously laying the groundwork for continued success. Along the way he befriended, mentored, and inspired countless Alinabal employees. Our thoughts and prayers go out to his family at this very difficult time.”\nMurphy served on the board of directors for Bridgeport-based Goodwill of Western and Northern Connecticut since 2006.\nDuring his tenure he served as treasurer, vice chairman and chairman of the board. He served on the board of Helms Housing, an associated organization providing low-income housing to people in need.\n“There is a profound sense of loss within the Goodwill family,” said president and CEO Vickie Volpano. “Mike has been a guiding light, great friend and supporter of our organization for more than a decade. He made an immeasurable impact on our Goodwill, and for that, we are forever grateful.”\nHe is survived by his wife Kim and two children, a 17-year-old boy in his senior year at Fairfield Preperatory High School and a 21-year-old daughter who studies at Loyola University in Maryland.\nMurphy graduated from Fairfield Prep in 1982.\n“The Fairfield Prep Community is deeply saddened by the tragic loss of Mike Murphy,” said a school spokeswoman.”We extend our heartfelt sympathy, thoughts, and prayers to all his family and friends.”\nTrautman is survived by his wife Danika; his children, Courtney, 13; William, 11,’, and Samuel, 9; his parents, Diane Johnson and Richard Trautman; and sister, Tiffany Mahoney.\nCalling hours for Trautman will be held from 4 to 8 p.m. Wednesday in the Lesko & Polke Funeral Home, 1209 Post Road, in Fairfield Center. On Thursday at 10:30 a.m. in Trinity Episcopal Church of Southport, friends may join his family for a service to celebrate Scott’s life, with a reception immediately following.\nDaniel Tepfer contributed to this report.", "url": "https://apnews.com/4aa48aaad7944180956c976b39f68208"}