{"authors": ["Jessica Patrick"], "date_download": "2020-05-04 20:17:18", "date_modify": "2020-05-04 20:17:18", "date_publish": "2017-12-12 13:16:00", "description": "A family-owned restaurant in downtown Cary is offering something very special this holiday season -- a tandoori masala-style turkey that has a story to go with it. In Samreen Nawaz's...", "filename": "_183578fdc97701c5a3f4f23c6d1e696f_1588623438.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_183578fdc97701c5a3f4f23c6d1e696f_1588623438.html", "title": "Cary restaurant offers a new kind of holiday turkey", "title_page": "Cary restaurant offers a new kind of holiday turkey", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A family-owned restaurant in downtown Cary is offering something very special this holiday season -- a tandoori masala-style turkey that has a story to go with it.\nIn Samreen Nawaz’s household, turkey has been a Thanksgiving tradition for years.\n“I moved to America from Pakistan at an early age with my parents, and suddenly I had American friends,” said Samreen, who owns Kababish Cafe with her husband, Yusuf. “Suddenly I was part of Halloween, Fourth of July, Christmas and Thanksgiving, which was such a family gathering, and I wanted to find out what people did [to celebrate].”\nSamreen, age 14 at the time, saw that Thanksgiving was all about getting together with family and friends, and she saw that turkey seemed to be the center of that gathering. “I told my mom, let’s bring home a turkey, just season it the way you do with chicken,” said Samreen.\nThen, one day while watching TV, Samreen saw a chef marinate and bake a turkey. “I learned that turkey has a tough exterior, so I made a mixture of spices, yogurt and olive oil and marinated it for at least two days,” said Samreen.\n“When I took it out of the oven days later, my dad couldn’t believe it.”\nThe Nawaz’s tender, flavorful turkey became a Thanksgiving staple, and friends, family and neighbors would come over each year to partake.\nEver since, Samreen and Yousuf have always served the same turkey to their kids on Thanksgiving, and, when Kababish Cafe opened more than two years ago, they had no doubt that the tradition would continue. Today, the restaurateurs are still offering the perfectly-seasoned masala turkey, but to their customers, during the holiday season.\nYousuf has added a few additional spices to Sam’s original recipe over the years to create the perfect turkey. Cumin, coriander, yogurt, lemon juice, salt, red chillies, fried onions, black and green cardamom, nutmeg, mustard seeds, fresh pepper, paprika, turmeric, chaat and garam Masala (a cinnamon mixture) and olive oil all contribute to the turkey’s flavor.\nIf those spices don’t provide enough flavor, the Kababish turkey is also served with fresh sauces, like a sweet and tangy tamarind sauce, a yogurt sauce and a mint chutney.\n“The turkey is a secret family recipe,” said Samreen. “But I will tell you that one of those secrets is kiwi, which is a wonderful meat tenderizer.”\nYousuf and Samreen also offer a variety of homemade sides to accompany the turkey, like scratch-made mashed potatoes, salad and freshly baked naan and garlic naan.\nThe chefs recommend their gaajar halwa for dessert, which is a sweet carrot dish topped with almonds and a customer favorite.\n“We’re always available to help with parties, catering,” said Samreen. “Just give us three days of notice so it can marinate for two days. I want it to taste exactly how it should be.”\nTo order a Kababish turkey, call Sam and Yousuf at 919-377-8794 or visit their website.", "url": "https://apnews.com/183578fdc97701c5a3f4f23c6d1e696f"}