{"authors": ["Cayla Harris"], "date_download": "2020-05-04 20:12:09", "date_modify": "2020-05-04 20:12:09", "date_publish": "2017-07-24 21:47:58", "description": "WASHINGTON — It is no secret that President Donald Trump's administration is anti-Obamacare — but Sen. Chris Murphy believes that efforts to undermine the healthcare law may be illegal. In a...", "filename": "_30c1832eba1849858cb41e73bee89236_1588623129.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_30c1832eba1849858cb41e73bee89236_1588623129.html", "title": "Murphy questions legality of anti-ACA campaign", "title_page": "Murphy questions legality of anti-ACA campaign", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WASHINGTON — It is no secret that President Donald Trump’s administration is anti-Obamacare — but Sen. Chris Murphy believes that efforts to undermine the healthcare law may be illegal.\nIn a July 21 letter to Health & Human Services Secretary Tom Price, Murphy — along with Sens. Cory Booker, D-N.J., and Brian Schatz, D-Hawaii — requested information regarding the department’s use of taxpayer funds to produce anti-Obamacare advertisements.\n``We are concerned that the use of appropriated funds to promote legislation pending before Congress violate both HHS’s constitutional responsibility to implement existing law, and legal prohibitions against using taxpayer dollars to lobby in favor of pending legislation,” the senators wrote.\nThe letter follows a Daily Beast report last week that HHS used taxpayer money allocated for the promotion of the Affordable Care Act to fund a series of videos posted to Price’s Twitter account, featuring individuals who say they have been hurt by the healthcare law.\nThe videos were then retweeted by official HHS Twitter accounts and spread on the department’s Facebook page.\nFormer White House officials told the Daily Beast that it was customary for HHS videos to be shot and edited by outside contractors who charged about $550 an hour for their services. HHS has released 23 testimonial videos to date.\nSome of the clips end with a shot of HHS’ logo, accompanied by a tiny asterisk with the words “produced at U.S. taxpayer expense.”\nThe senators’ letter claims the department may have violated several pieces of legislation aiming to keep federal resources nonpartisan — including the Anti-Lobbying Act, the Hatch Act and the Consolidated Appropriations Act.\nIt ends with a request for a breakdown of any HHS expenditures for the social media campaign.\n``The ACA is the law of the land, and HHS officials have an obligation to uphold and implement it,” the senators wrote.\nCayla.harris@hearstdc.com", "url": "https://apnews.com/30c1832eba1849858cb41e73bee89236"}