{"authors": ["Journal Satff"], "date_download": "2020-05-04 20:22:13", "date_modify": "2020-05-04 20:22:13", "date_publish": "2017-01-07 01:22:00", "description": "If you purchased an Idaho Lottery ticket in Oneida County you could become $1 million richer. The Idaho Lottery has confirmed the winning ticket for last night’s raffle was sold at a retail...", "filename": "_840e38b5901b46eaa40f9e53418d2874_1588623733.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_840e38b5901b46eaa40f9e53418d2874_1588623733.html", "title": "$1 million lottery ticket sold in Oneida County", "title_page": "$1 million lottery ticket sold in Oneida County", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "If you purchased an Idaho Lottery ticket in Oneida County you could become $1 million richer.\nThe Idaho Lottery has confirmed the winning ticket for last night’s raffle was sold at a retail location in Oneida County. The winning number is 065236; however, no additional information will be released until the ticket is claimed in Boise.\nIn addition to the top prize, the Idaho Lottery has also confirmed two $10,000 winning tickets were also sold in Oneida County and Bannock County. The $10,000 winning ticket numbers are 049724 and 087727.\nJeff Anderson, the Idaho Lottery Director said there are more than 6,700 prize winning tickets in this year’s raffle.\n“We strongly encourage everyone who played the Idaho $1,000,000 Raffle to check their tickets carefully for winners,” Anderson said. “All players holding Idaho $1,000,000 Raffle tickets should sign the back of them and keep them in a safe place until claiming their prize.”\nPlayers have 180 days from the night the winning ticket was drawn to claim their prizes. Both the $1 million prize and the two $10,000 prizes must be claimed at Idaho Lottery Headquarters in Boise.\nTo check tickets for winning numbers, players can visit idaholottery.com, call the winning numbers hotline at 208-334-4656, use the Idaho Lottery’s Check-a-Ticket app or visit an Idaho Lottery retail location.\nThis year’s edition of the Idaho $1 million raffle returned more than $800,000 to the Idaho Lottery’s beneficiaries, Idaho public schools and the state’s Permanent Building Fund.", "url": "https://apnews.com/840e38b5901b46eaa40f9e53418d2874"}