{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:10:22", "date_modify": "2020-05-04 20:10:22", "date_publish": "2017-12-07 15:46:57", "description": "Holly Janet Allen, age 58, of Austin, died Monday, Dec. 4, 2017, at home surrounded by her children and close family. Holly was born on May 16,1959, to Merton and Vernetta (Klapperick)...", "filename": "_6fd03f7f3e134c3292859a5465ca6030_1588623022.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6fd03f7f3e134c3292859a5465ca6030_1588623022.html", "title": "Holly Allen -- Austin", "title_page": "Holly Allen -- Austin", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Holly Janet Allen, age 58, of Austin, died Monday, Dec. 4, 2017, at home surrounded by her children and close family.\nHolly was born on May 16,1959, to Merton and Vernetta (Klapperick) DeBoer in Austin and graduated from Austin High School.\nHolly married the love of her life, Randy Allen, Dec. 30, 1988. Holly loved to take care of her family and be with her kids and grandkids. She enjoyed going to the casino, being in the sun, camping and other outdoor activities. She loved collecting clowns and antiques.\nSurvivors include her children, Mark (Mikayla) Austin, Austin, Kevin Austin, Austin, and Joseph Allen, Rochester; grandchildren, Alexcia, Jaxon, Benzley, Easton, and Ronan; sisters, LaVonne (Phil) Jackson, Peoria, Ariz., Ginger Taylor, San Tan Valley, Ariz., and Hope (Tom) Wurster, Medford, Minn.; brothers, Hal DeBoer, Auburn, N.Y., and Sidney DeBoer, Austin; sisters-in-law, Frances DeBoer, Austin, Rhonda (Brian) Bridgeman, Austin, and Patty (Clay) Erway, Ore.; brothers-in-law, Rob (Gloria) Allen, Patterson, Calif., Juan Capote, Rochester, Mark Austin Sr., father of Mark and Kevin; and lots of cousins.\nShe is preceded in death by her husband, Randy; brother, Timmy; brother-in-law, Milo; sister-in-law, Renae; her parents, Merton and Vernetta; parents-in-law, Rose and Russ; and grandkids, Noah and Isabelle.\nA funeral service will be held at 2:30 p.m. Saturday, Dec. 9, at Mayer Funeral Home, with Father Raul Silva officiating. Friends may call from 12:30 p.m. until the time of the service on Saturday. Interment will be in Oakwood Cemetery.\nIn lieu of flowers, the family prefers memorials.", "url": "https://apnews.com/6fd03f7f3e134c3292859a5465ca6030"}