{"authors": ["Christopher Heimerman - Cheimerman Shawmedia.Com"], "date_download": "2020-05-04 20:05:19", "date_modify": "2020-05-04 20:05:19", "date_publish": "2017-06-02 22:37:00", "description": "DeKALB – It’s easy to get distracted while taking a tour of Ron Cress' backyard at 3060 Wedgewood Drive. A chipmunk scurries across the path as he walks. Birds of all sorts sing. Each way you...", "filename": "_720bc5302cfc47c78fc1dd868431a845_1588622719.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_720bc5302cfc47c78fc1dd868431a845_1588622719.html", "title": "DeKalb man not willing to hedge on native plants", "title_page": "DeKalb man not willing to hedge on native plants", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DeKALB – It’s easy to get distracted while taking a tour of Ron Cress’ backyard at 3060 Wedgewood Drive. A chipmunk scurries across the path as he walks. Birds of all sorts sing. Each way you look, enormous native plants reach for the sky.\nThose plants, however, have drawn two warning letters from the city. The second, dated May 15, stated that if he didn’t trim his “weeds” to less than eight inches in height by May 24, he’d be fined $50, and a lien could be put on his house.\nCity Attorney Dean Frieders said Cress “could expect a notice to appear in court at any time.”\n“I might be in jail tomorrow,” Cress joked.\nThe city’s external maintenance code says all grasses, annual plants and vegetation are to be kept under eight inches in height. Trees, shrubs, cultivated flowers and gardens, and ornamentals are exempt.\nOrnamental is an operative word, City Attorney Dean Frieders said.\n“In Mr. Cress’ case, according to our ordinance, we interpret what’s on his property as weeds, rather than ornamental,” he said.\nCress, a volunteer with DeKalb County Community Gardens, is the lead steward of Walnut Grove Vocational Farm, a 10-acre savanna prairie restoration just north of Kirkland that people with special needs help maintain.\nHe is trying to get the municipal code amended. To him, the grasses aren’t weeds. They promote more wildlife, from insects to critters, “and on up the food chain,” he said.\nHe’s spoken at multiple Citizens Environmental Commission meetings, and has been joined by several supporters – including Anna Marie Coveny of the DeKalb Area Women’s Center, which has two rain gardens and has been cited for the same ordinance violation.\nBoth spoke at Thursday’s meeting, and the commission decided it will hold a public hearing at its July 6 meeting, to get input on how to rewrite the ordinance. Cress has already worked with Dan Kenny, a member of the commission and the community gardens’ executive director, to amend the code’s language.\nUltimately, the commission can only make a recommendation to the City Council, which would need to approve the change.\n“I want to make the changes as minimal as I can, in the hope it has a greater chance to be passed,” Cress said.\nCoveny said the native plants in her center’s rain garden was cut back in December, albeit reluctantly.\n“We didn’t dig them out, so therefore they’re going to grow again,” she said. “It was a gesture of good intent. We didn’t want to do that.”\nShe said in the wintertime, rain gardens provide shelter for birds and insects. The gardens have been there about 10 years.\n“It makes you wonder, why is the sky falling now?” Coveny said.\nShe said the plants are more than ornamental – the garden is functional, a green solution to stormwater runoff. Through extensive landscaping and extension of downspouts into the basin of the gardens, pressure is taken off old storm sewers, and water is kept away from the building. Whereas turf grass has short roots, native plants’ roots can grow several feet in length, to slow the water and serve as a sort of filtration system, as well.\n“They’re not weeds,” Coveny said. “The ordinance was written for weeds in turf grass. I feel we’re not in violation. These are native Illinois prairie plants.”\nIn fact, she said, the gardens are part of the University of Illinois Extension Service’s Master Gardener site.\nMayor Jerry Smith said it behooves the city to consider a change.\n“Am I sympathetic to Ron Cress? Certainly,” Smith said. “We are a greener society today than when these original ordinances were written. We’re moving along as expeditiously as possible, but sometimes these things take longer than some people would think.”\nSmith said the commission’s liaison, Public Works Director Tim Holdeman, is also working with Cress.\nFrieders said one way around the issue is for residents to have their property rezoned as a prairie grass installation, and that the city can help with a professional design.\n“We’re always happy to have someone go through that process,” Frieders said.\nHe said oftentimes, residents with sump pumps who are interested in native plants take advantage of the water discharged to help promote growth. To address complaints from a neighbor, Cress has moved his sump pump’s discharge from his backyard to in front of his garage door. He said it would have cost at least $2,000 to direct the water into city sewers, and the other option was paying $300 a day in fines.\nFrieders said Cress’ situation is somewhat unprecedented.\n“We have not had a case where I can think of, where the party refused to take responsibility,” he said. “The last stop in that process would be taking them into circuit court and asking for an order from a judge.”\nFrieders said if Cress truly wants his day in court, he’ll get it.\n“If a property owner believes it’s an ornamental installation, it will ultimately be up to a judge to determine whether it’s weeds or landscaping,” he said.\nCress harvests seeds from his variety of native plants, and the seeds are planted at the vocational farm.\nHis yard boasts myriad species of native plants, but he wants even more variety. He said most of his native species are mid- to late-summer bloomers, so what looks like weeds now will flower in a few weeks.\nA deer track meanders through his backyard. He said a couple of years ago, a doe dropped off her newborn fawn one day, and returned in the evening.\n“I think she sensed this is a safe place, a safe harbor,” he said. “Listen. Do you hear that? The birds come into this yard. In the yards on both other sides, there’s a void.”\nMilkweed weaves through the bed in the front yard. The primary food for monarchs is a hot topic, with the butterfly species’ population in decline.\n“But there are lots of other insects that fit into that category,” Cress said. “When people buy pest-free plants, they’re closing off part of the food chain.”\nHe said he and his wife, Monica, strongly considered trimming the plants down to six inches.\n“I don’t want to have a lien on my house, but in another six months, we’ll just be back out of compliance again,” he said. “I thought, doggone it, I’m right. There’s a lot of value in nature plants.”", "url": "https://apnews.com/720bc5302cfc47c78fc1dd868431a845"}