{"authors": ["Daryl Bell"], "date_download": "2020-05-04 20:24:26", "date_modify": "2020-05-04 20:24:26", "date_publish": "2017-10-07 04:00:00", "description": "There will be a fish fry fundraiser for former West Philadelphia High School basketball star Clarence “Eggy” Tillman on Sunday, Oct. 15, from 4-9 p.m., at 22nd Street Cafe, 1262 S. 22nd St. The...", "filename": "_bc3227f66bbf44a6a7257b5ce61624f4_1588623866.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bc3227f66bbf44a6a7257b5ce61624f4_1588623866.html", "title": "Simmons to help raise funds for 'Eggy' Tillman", "title_page": "Daryl Bell: Simmons to help raise funds for 'Eggy' Tillman", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "There will be a fish fry fundraiser for former West Philadelphia High School basketball star Clarence “Eggy” Tillman on Sunday, Oct. 15, from 4-9 p.m., at 22nd Street Cafe, 1262 S. 22nd St. The proceeds will go toward getting a motorized scooter for Tillman, who has been slowed by several physical ailments.\nThe 22nd Street Cafe is owned by former Southern High, La Salle University and Sacramento Kings star Lionel Simmons.\n“It’s just getting together to help someone who needs our help,” said Simmons. “It’s an opportunity for people to see people they haven’t seen in a while. It’s also an opportunity to help Eggy.”\nLegend recognizes Legend.\nTillman grew up in South Philly and Simmons remembers seeing him play. He’s even played a few pickup games with Tillman. Because of knee, hip and spinal problems, Tillman is unable to get around and enjoy life. He’s been unable to work because of his maladies; basic daily tasks such as walking are difficult.\nWhen Simmons heard Tillman’s former West Philadelphia High School teammates Gene Banks and Joe Garrett along with Tillman’s former Rutgers University teammate Kevin Black established a GoFundMe account to raise $10,000 to obtain a special motorized scooter, he decided he wanted to help.\n“I just wanted to help someone who needed help,” said Simmons. “That’s what its all about. We’re doing this to help a good guy.”\nEggy became a household name and a Philadelphia schoolboy legend in the 1970s as a member of the West Philadelphia High School Speedboys basketball team.\nA fluid 6-foot-8 forward who could hit a jumper from either side of the basket with accuracy, Tillman complemented Banks and Garrett in 1977 as West Philadelphia rolled to a 30-0 record and was named the nation’s top-ranked team.\nWhen Banks and Garrett graduated along with Mike Nichols and Darryl “City Lights” Warwick, it was Tillman who helped keep West Philly’s winning tradition going.\nBack then, Tillman ran with the grace of a gazelle and walked with the stature of a king. Not anymore. Now slowed by several severe physical ailments, the 56-year-old Tillman is basically sedentary. He uses a cane to move but it’s not much help. Tillman’s immobility has been a big factor in his gaining weight.\n“It’s been very tough,” said Tillman, who was a McDonald’s All-American basketball team selection as a high school senior. He was one of two Philadelphia players selected to the 1978 team. The other was Roman Catholic’s Reggie Jackson who would play at the University of Maryland.\nTillman went on to play at the University of Kentucky before he transferred to Rutgers University. He would later spend several seasons playing professionally in Europe, South America and the Caribbean. He graduated from Alvernia University with a degree in behavioral health in 2010.", "url": "https://apnews.com/bc3227f66bbf44a6a7257b5ce61624f4"}