{"authors": ["Chris Bosak"], "date_download": "2020-05-04 20:15:07", "date_modify": "2020-05-04 20:15:07", "date_publish": "2017-02-01 18:10:47", "description": "DANBURY — Praxair, a Danbury-based industrial gas company, announced this week it has started a hydrogen facility that will recover byproduct streams from The Dow Chemical Co.’s Freeport, Texas,...", "filename": "_ce1918b5e41d44f6985fee47a4bc2c6c_1588623307.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ce1918b5e41d44f6985fee47a4bc2c6c_1588623307.html", "title": "Praxair starts up hydrogen facility in Texas", "title_page": "Praxair starts up hydrogen facility in Texas", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DANBURY — Praxair, a Danbury-based industrial gas company, announced this week it has started a hydrogen facility that will recover byproduct streams from The Dow Chemical Co.’s Freeport, Texas, operations.\nUnder a long-term contract, Praxair will supply high-purity hydrogen back to Dow in order to meet the company’s needs in southeast Texas. The hydrogen will also be used by Praxair to help supply increasing customer demand in the region.\n“Freeport is Dow’s largest chemical site in the world and we are proud to be supporting their continued growth in the U.S. Gulf Coast. This opportunity to further serve our customers in the region is why we extended our pipeline to Freeport,” Dan Yankowski, president of Praxair’s global hydrogen business, said in a release. “Capturing byproduct hydrogen for use in the refining and petrochemical industries is consistent with our mission of making our planet more productive.”\nPraxair has also signed a long-term contract with Dow to supply nitrogen to the company for use in its chemical production facility. The nitrogen supply is expected to start in 2019. Dow will use both gases to support the production of a number of specialty chemicals used in various markets, including automobile manufacturing, coating applications and chemical intermediates.\nPraxair’s knowledge and operating experience in processing hydrogen, coupled with Dow’s new sources, are enabling hydrogen to be produced to meet industry demands with significantly lower carbon dioxide emissions than by conventional means.\n“We are pleased to continue our strong relationship with Praxair through this new project,” said Jack Broodo, president, Dow Feedstocks and Energy. “In working with Praxair, we address our strategic vision of developing growth projects that result in environmental benefits to our industry and surrounding communities.”\nPraxair is a major employer in Danbury and had 2016 sales of $11 billion. Last year it announced it will be merging with Linde, a German-based industrial gas company.\ncbosak@hearstmediact.com; 203-731-3338", "url": "https://apnews.com/ce1918b5e41d44f6985fee47a4bc2c6c"}