{"authors": ["Nico Savidge", "Wisconsin State Journal"], "date_download": "2020-05-04 20:13:41", "date_modify": "2020-05-04 20:13:41", "date_publish": "2017-10-24 10:40:00", "description": "UW-Madison faculty are reviewing a proposal that calls for the Wisconsin School of Business to suspend admissions into its full-time Master of Business Administration program for one year while...", "filename": "_c325175cc0064d5a8c8d048ffaa51ab3_1588623221.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c325175cc0064d5a8c8d048ffaa51ab3_1588623221.html", "title": "University of Wisconsin proposal: Suspend full-time MBA during review of programs", "title_page": "University of Wisconsin proposal: Suspend full-time MBA during review of programs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "UW-Madison faculty are reviewing a proposal that calls for the Wisconsin School of Business to suspend admissions into its full-time Master of Business Administration program for one year while leaders undertake a long-term review of program offerings, officials said Monday.\nThe head of the school’s MBA programs acknowledged in an email to current students last week that officials are considering a plan that could include discontinuing the full-time program.\nThat proposal, which the business school outlined in greater detail Monday, would pause admissions, and involve “a timely review of how the WSB graduate portfolio should evolve,” according to school officials.\nDuring a meeting with the program’s current students Monday to discuss the plan, business school Dean Anne P. Massey stressed that a final decision about the future of the full-time MBA program has not been made.\nBusiness school faculty are expected to vote on the proposal in November.\nBut Massey argued UW-Madison needs to respond to a changing market, citing national trends that indicate students are moving away from the traditional, two-year MBA model as other options — such as online programs and one-year degrees — become more popular.\n“To be relevant, to be agile, in order to be significant, we’ve got to always refresh and renew and review,” Massey told the students. “It would be irresponsible for me or the faculty or the school more broadly to not have these discussions.”\nThe State Journal obtained a recording of Massey’s meeting with students in UW-Madison’s Grainger Hall after business school officials denied a reporter access to the event, saying it was for students only.\nIt’s not clear when the plan would suspend admissions. A spokeswoman said timing will depend on if and when faculty approve the proposal, and whether they make changes to it. The business school is accepting applications now for next fall’s MBA class.\nAbout 200 students are currently enrolled in the full-time program, and they will be able to finish their degrees no matter what happens with the proposal, business school officials have said.\nThe plan also would not affect the school’s evening and executive MBA programs.\nBut several students have said they are concerned that a decision to suspend the program or shut it down permanently could tarnish its reputation and reduce the value of their degrees.\n“We all left our jobs to come to this school, and now we are seeing that our whole MBA program’s reputation is at stake,” first-year student Pradeep Raghuwanshi said after leaving Monday’s meeting.\nRather than suspend admissions, Raghuwanshi said he would rather see the business school continue its full-time MBA during the long-term review, saying he was concerned that even a temporary move could reduce students’ interest in the Wisconsin program.\nApplications for full-time MBA programs nationally have declined in each of the last four years, according to a survey of institutions by the Graduate Management Admission Council, and several major universities have shuttered their programs.\nThe trend is less clear at UW-Madison — the number of applications for the full-time program, which enrolls about 100 students per year, averaged 466 from for the fall 2010-14 classes, then spiked to 800 for the 2015 class, and has since declined to 548 for this fall’s cohort. Massey attributed the jump to a change in how applications were classified.\nIn response to concerns about the program’s reputation, officials countered that the value of a Wisconsin School of Business degree is strong because of the institution’s curriculum, faculty and professional connections — not the format of its programs.\nAnd Massey told students that successfully innovating in response to trends in business and higher education “adds value to your degree.”\n“I do not want to be a player, I want to be a leader,” she said.", "url": "https://apnews.com/c325175cc0064d5a8c8d048ffaa51ab3"}