{"authors": ["Julian Guerrero", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Erik Forman", "Charlie Post", "Jane Mcalevey", "Robin D. G. Kelley"], "date_download": "2020-05-04 19:58:02", "date_modify": "2020-05-04 19:58:02", "date_publish": "2017-10-12 00:00:00", "description": null, "filename": "2017_10_flint-sit-down-strike-anniversary-autoworkers_1588622282.html", "image_url": "https://images.jacobinmag.com/2017/10/12214656/FlintStrikeCalendar-min.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_10_flint-sit-down-strike-anniversary-autoworkers_1588622282.html", "title": "The Flint Militants", "title_page": "The Flint Militants", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOn February 8, 1937, John L. Lewis, leader of the fledgling Committee of Industrial Organizations (CIO), met with Frank Murphy, the newly elected governor of Michigan. Just over a month earlier — and just two days before Murphy started his term — hundreds of autoworkers had seized two General Motors (GM) plants in Flint, paralyzing the massive corporation’s production line. The workers’ new tactic — the sit-down strike — was threatening to fundamentally change the balance of power between workers and management. Recognizing what was at stake, GM cut the heat to the occupied plants, hoping the cold would break the sit-downers’ morale. But the strikers were determined to stay. They sent Murphy a defiant telegram in response to rumors that he might mobilize the National Guard to evict them, announcing that they would be pulled out dead before they walked out on their own. Murphy had to do some quick electoral math. On one side, there was Michigan’s most powerful employer. On the other were workers and their families, who would never vote for him again if he broke a strike. Murphy turned to Lewis, demanding that he “do something.” Lewis replied: “I did not ask these men to sit down. I did not ask General Motors to turn off the heat. I did not have any part in either the sit-down strike or the attempt to freeze the men. Let General Motors talk to them.” He wasn’t being evasive. While Lewis was determined to organize industrial workers, he was wary of the sit-down. Getting no help from the CIO’s leader, Murphy tried to split the difference. He ordered the nearly four thousand soldiers to shut down the highways into Flint, hoping to prevent the United Auto Workers (UAW) from calling in reinforcements. Then he tried Lewis again, demanding that he remove his strikers from the plants. He backed it up with a signed order permitting the National Guard to use force if necessary. But something had changed in Lewis. No longer willing to leave it up to the workers and management, Lewis stood fully behind his members. He told Murphy (perhaps apocryphally): Tomorrow morning, I shall personally enter General Motors plant Chevrolet No. 4. I shall order the men to disregard your order, to stand fast. I shall then walk up to the largest window in the plant, open it, divest myself of my outer raiment, remove my shirt, and bare my bosom. Then when you order your troops to fire, mine will be the first breast that those bullets will strike. Lewis’s shift from ambivalence to militancy captures the dynamic of the Flint Sit-Down Strike. After years of industrialization built on their backs, workers were standing their ground — and actors across the economy, from GM bosses to labor leaders, were forced to take note. Spurred on by socialists and communists, organized labor grabbed a seat at the table, much to the chagrin of the ruling class. Eighty years later, the Flint Sit-Down Strike offers an enduring lesson: that with a well-organized rank and file and a class-conscious leadership, an ambitious union can bring down the most powerful corporations in the world.\nExpansion and Crisis 1920s America was a nation in transition. The expansion of mass production industries and the collapse of agricultural prices triggered widespread migration. Millions of rural families in the South packed up and moved to northern towns and cities, lured by the promise of higher-paying factory jobs. The number of working women rose by almost 30 percent over the decade, and black farming families’ arrival in cities created the conditions for integration on a scale the US had not yet seen. The rapid changes in the American workforce disrupted what little momentum the labor movement had built up. Employers played organized workers against the unorganized, skilled workers against the unskilled, employed against the unemployed, and the traditional working class against newcomers. Bosses used race and ethnicity to divide and conquer, and pushed for non-union “open shops” across the country. American workers saw little way out of this bleak situation. The bosses’ blacklists, their “yellow dog contracts” (which forbid union membership as a condition of employment), and their vast network of saboteurs hobbled workers’ efforts to build solidarity. Courts jailed union leaders and granted pro-employer injunctions. When coercion and the law wouldn’t quell militant workers, employers used private and public police forces to violently break strikes. The AFL, battered and beleaguered, struggled to survive the onslaught. The federation’s membership was concentrated in just a few industries — construction, coal, railroads, printing, water transportation, music — while the rapidly growing manufacturing sector was virtually union-free. A conservative, hidebound institution, the AFL still organized by craft rather than industry, leaving out less skilled workers. The AFL not only didn’t attract the immigrant and black laborers joining mass-production industries — it often fought against them. The federation’s leadership had also come to accept capitalism’s basic tenets and sought collaboration — rather than confrontation — with employers. They red-baited the socialists, communists, and radicals trying to push the unions in a more militant direction. Certain locals barred communists completely. The labor movement suffered as a result. At the end of the 1920s, union members made up just 10.2 percent of the more than thirty million non-agricultural workers — an almost 20 percent decline over the decade. Then, on Black Tuesday, 1929, the bottom fell out of the economy. Fourteen billion dollars vanished in a single day. Anywhere between 13.3 million and 18 million workers found themselves unemployed, and an estimated 1.5 million homeless people wandered the country, seeking jobs, relief, any means to survive. Those lucky enough to find work endured plummeting wages. The proliferation of shantytowns, the waves of roving migrants, the long bread lines — all testified to the state’s ineffective response and the chasm between the political mainstream’s rhetoric and working people’s everyday struggles. This polarized atmosphere pushed workers toward more militant action, but they still lacked support. More than once, workers clamored for union representation, signed cards, and later ripped them up when the AFL declined to support their union drives and strikes. By 1933, AFL membership had fallen to a new low.\nThe Militant Minority In 1934, titanic labor battles broke out in Minneapolis, Toledo, and San Francisco. Struggles at the workplace spilled into the streets and transformed each city in the process. The seminal victories convinced the AFL to form the Committee of Industrial Organizations (later renamed the Congress of Industrial Organizations). Initially, the CIO aimed to organize the steel industry, but autoworkers, backed by left-wing unionists, were already struggling against their powerful industry and its dehumanizing conditions. After some notable wins, autoworkers demanded their own international within the AFL. In August 1935, the UAW was born. Less than a year later, the AFL leaders decisively lost the fight for control over the nascent international, ceding power to the rank-and-file leadership, many of them militants from the Communist Party (CP) and Socialist Party (SP) who had earned the trust of autoworkers in local struggles. The radical unionists were but a fraction of the UAW’s membership — and the union itself only represented a fraction of all autoworkers — but they had run aggressive organizing drives and deployed militant strike tactics over years of painstaking work. The UAW hoped to generalize this strategy across the auto industry. The first target was GM. Like most automakers, the massive company imposed inhumane, dictatorial rule in its plants. Foremen denigrated workers with pejorative nicknames and timed their employees’ every move to increase productivity. Workers who disagreed with their foreman immediately lost their jobs, with no chance to appeal. Even after workers’ shifts ended, foremen wielded immense power. As socialist activist Genora Dollinger explained, bosses expected their employees “to bring them turkeys on Thanksgiving, gifts for Christmas and repair their motor cars, and even paint their houses.” Things were especially bad for woman. “In one department of A.C. [a GM division],” Dollinger noted, “the [young women] had all been forced to go to the county hospital and be treated for venereal disease [that was] traced [back] to one foreman.” GM not only ran its plants with an iron fist, it also practically owned Flint. Politicians cycled in and out of employment with GM, and open support for workers would guarantee electoral defeat. This meant that the UAW had to do their organizing clandestinely. Slowly, over most of 1936, it built up its membership. The SP played an important role in this process, but CP militants were also crucial. Beginning in 1926, the CP had established cells in factories, published dozens of shop papers, and cultivated a leadership layer among autoworkers. The UAW relied heavily on these networks for recruitment. After signing up a few hundred autoworkers in Flint, the UAW was confident the time was right for a strike. It chose the sit-down tactic because a few workers could launch it, inspiring thousands to join in. The initial plan was to wait for January 1937, when labor-friendly Frank Murphy would begin his term. In fact, the union leadership tried to stop spontaneous actions from breaking out at GM plants. But a sit-down strike in Cleveland in late December 1936 and the subsequent transfer of unionists out of the Flint Fisher Body Plant No. 1 got the battle in Flint started early.\nThe Strike Begins At 7 AM on December 29, 1936, workers at Fisher Body Plant No. 1 sat down. By 8 PM, workers in Body Plant No. 2 had seized their building, barricading the entrances to maintain control of the plants. The workers formed a broad strike committee that met daily to discuss problems, make decisions, and boost morale. While they elected an executive committee to carry out the day-to-day tasks, the strikers themselves retained decision-making power. This democratic structure flowed from the CP’s conviction that a successful strike depended on the rank and file, especially since the number of occupying workers remained relatively small compared to those not participating. Outside the plant, the CP — particularly its women members — helped build a strike kitchen for the workers and picketers. CPers Dorothy Kraus and Margaret Anderson created the Women’s Auxiliary, which established a speaker’s bureau, publicity committee, nursery, and first-aid station. GM, meanwhile, fumed at the two halted production lines. The company first turned to the courts to jumpstart the plants. Though it won an injunction against the workers, the court order backfired when it was revealed that the presiding judge had invested hundreds of thousands of dollars in GM stock. Legal avenues exhausted, the automaker decided to take more aggressive action. On January 12, the company shut off the heat to the occupied plants, and the police smashed the ladders the strikers were using to receive food and visitors. When picketers rushed the entrance, a street brawl broke out. Half of Flint’s police force descended on the protesters with clubs, tear gas, buckshot, and firebombs. The workers in the plant threw metal hinges, nuts, and bolts at cops and blasted frigid water from the roof with a fire hose. They overturned four police cars to form a barricade. The fight dragged on for hours, eventually drawing a sizable crowd. Using loudspeakers mounted on a UAW car, Dollinger appealed to the witnesses. Inspired by her words and the scene unfolding in front of them, hundreds of citizens marched into the middle of the fight, handing the UAW a victory. The battle motivated Dollinger to establish the Women’s Emergency Brigade. The women wore red berets and armbands emblazoned with the initials “EB.” They wielded clubs, bars of soap in socks, and blackjacks. During some of the strike’s most pivotal moments, this group would prove to be a crucial defender of the sit-downers.\nPlant No. 4 The street fight, nicknamed the “Battle of the Running Bulls,” boosted the workers’ confidence. But the UAW and GM remained deadlocked in contract negotiations. Union leaders came to believe that the workers had already exhausted their best tactic and struggled to come up with a new idea to break the stalemate. Kermit Johnson, a member of the SP’s left wing, proposed seizing another plant — specifically, Chevrolet Plant No. 4, where GM built the engines for every Chevrolet in the world. Taking No. 4 would bring production to a standstill. GM, fully aware of the potential chokepoint, stationed plant police and anti-union guards outside the engine-building facility to deter workers from joining their comrades. (The UAW also had relatively weak support at the plant.) Most of the UAW leadership, including Walter Reuther, thought Johnson’s plan was too risky. Reuther’s reputation among the strike leaders was enough to kill the proposal, but Johnson didn’t give up. His wife, Dollinger, wrote to the SP leadership begging for help. The party sent its labor secretary, Frank Trager. At a large SP-sponsored gathering in Flint, Trager threw his support behind Johnson’s plan. The workers saw no other alternative to the stalemate and voted overwhelmingly for the proposal, overriding the leadership’s concerns. The strike leaders assented, but devised a ruse: they told most of the workers to seize Plant No. 9, a misdirection that they hoped would throw off the GM’s informants. It worked. GM concentrated their police forces at the decoy location. On February 1, workers, picketers, and the Women’s Emergency Brigade charged the officers protecting Plant No. 9. GM called in reinforcements from across the complex, leaving the real target vulnerable. Johnson and a couple hundred autoworkers sprung into action. They pushed out the facility’s supervisors and held Plant No. 4, shutting down GM’s production line entirely. Losing No.4 dealt GM a mighty blow. The company now recognized that they could only smash the strike if Murphy mobilized the National Guard. But the automaker once again underestimated its employees. The successful seizure of Plant No. 4 had emboldened the workers, who were now prepared to fight until the death. Fearing political suicide, Murphy refused to send in soldiers. In a last ditch effort, GM once again killed the heat to the seized plants and prepared to send in the police. The strikers responded by opening the plants’ large windows to freeze the fire-fighting equipment and nullify GM’s insurance contracts. Realizing that an intensified struggle would drive the autoworkers to destroy expensive machinery, GM backed down. Just days later, management agreed to the UAW’s single demand: that the automaker recognize the union as the sole bargaining agent for the entire GM workforce. The UAW and its members had brought one of the most powerful American corporations to its knees.", "url": "https://jacobinmag.com/2017/10/flint-sit-down-strike-anniversary-autoworkers"}