{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:27:53", "date_modify": "2020-05-04 20:27:53", "date_publish": "2017-02-28 07:00:00", "description": "CEDARTOWN — Allegations of an incident in the middle of the night and threats against family members were part of a court filing last week for a temporary protection order issued against suspended...", "filename": "_ccbbd3c70f374767b05da48ef9ec5b36_1588624073.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ccbbd3c70f374767b05da48ef9ec5b36_1588624073.html", "title": "Polk school chief served with temporary protection order", "title_page": "Polk school chief served with temporary protection order", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CEDARTOWN — Allegations of an incident in the middle of the night and threats against family members were part of a court filing last week for a temporary protection order issued against suspended Polk School District Superintendent Darrell Wetherington.\nTallapoosa Circuit Superior Court Judge Michael Murphy signed the temporary protection order requiring that Weth­erington stay away from his estranged wife, Jennifer Wetherington.\nThe order was delivered to Wetherington on Friday by deputies from the Crisp County Sheriff’s Office, according to Polk County Sheriff Johnny Moats.\nWetherington, who was suspended with pay during a Feb. 21 special called session of the Polk County Board of Education, has been staying with his family in Cordele, Moats said.\nThe temporary protection order alleges Wetherington was engaged in stalking activities leading up to an incident at Westside Elementary School on Feb. 17 that prompted school board action. Jennifer Wetherington is a teacher there.\nShe said she was surprised when Wetherington showed up at her classroom, according to a police report. She told police she attempted to break off the conversation several times, after Wetherington said he brought her a soda, which she said she never requested.\nJennifer Wetherington claims he was also involved in an extramarital affair and since their split has “refused to stop contacting her.”\nDivorce papers filed earlier this month cited the reason for the breakup of their marriage as irreconcilable differences.\nThe request for the protection order also gives details on an incident that allegedly occurred at 12:30 a.m. on Feb. 17 prior to the incident at Westside Elementary.\nJennifer Wetherington alleges she woke up around 12:30 a.m. that day at their Meadow Lakes Drive home to her estranged husband banging on her garage door.\nShe said in the court filing she was “grilled” by her husband for approximately two hours about what she “was turning into the Board of Education hearing.”\nThe filing also alleges Wetherington threatened to “take care of” his estranged wife’s family if she tried to call for help.\nWetherington has been ordered to stay 300 yards away from his estranged wife, avoid any contact with her or her family, and refrain from any harassing behavior. A court date was also set for March 14 to give Wetherington a chance to show any cause as to why the petition shouldn’t be granted. Polk County Police Chief Kenny Dodd said Darrell Wetherington has declined to speak with officers.", "url": "https://apnews.com/ccbbd3c70f374767b05da48ef9ec5b36"}