{"authors": [], "date_download": "2020-05-04 20:28:44", "date_modify": "2020-05-04 20:28:44", "date_publish": "2017-12-06 12:00:00", "description": "Jake Gyllenhaal struggled to get into the right mindset for his latest film 'Stronger' in which he plays a victim of a terror attack. The 36-year-old actor is attracting Oscar buzz for his...", "filename": "_8df5806ddf9547a79fcf945c858f0004_1588624124.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8df5806ddf9547a79fcf945c858f0004_1588624124.html", "title": "Jake Gyllenhaal struggled to shoot Stronger", "title_page": "Jake Gyllenhaal struggled to shoot Stronger", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jake Gyllenhaal struggled to get into the right mindset for his latest film ‘Stronger’ in which he plays a victim of a terror attack.\nThe 36-year-old actor is attracting Oscar buzz for his latest role as real-life American author Jeff Bauman, who was severely injured in the Boston Marathon bombing in 2013, losing both his legs in the atrocity.\nThe movie - directed by David Gordon Green - was based on Bauman’s own memoir which documents how he struggled to adjust to life after the bombing and Gyllenhaal admits he doubted whether he could have gone through what Bauman did.\nSpeaking to the Metro newspaper, Gyllenhaal said: “I am playing a guy who survived and thrived, and some part of acting is wish fulfillment, in that you believe you are like the characters you are playing. But I realized I didn’t think I’d have been able to do what Jeff did. And so there was always this extraordinary doubt and fraudulence in my mind as I was exploring the role. Then, about halfway through shooting, I realized I was being very tough on myself and doubting myself. It was exactly how Jeff felt. He doubted himself and his own masculinity.”\nGyllenhaal spent a lot of time with Bauman to get to know him and understand what he went through and he soon realized what damaging effects his injuries had on him.\nHe said: “When we first met, Jeff wasn’t very forthright about his feelings. He was drinking and partying and not really coming to terms with what had happened. He talks a lot about it now but it took him a long time. Jeff is a complicated human being but he is always laughing. That’s the biggest thing I took away from this.”\nThe Boston Marathon bombing killed three people and left hundreds injured and Bauman was among 16 people to lose limbs.\nThe bombing only happened four years ago and Gyllenhaal understands why people may think it’s too soon to tell that story on the big screen.\nHe said: “We have been very mindful with this film. And if people haven’t seen it, and don’t know what the movie is about, they might think it’s too soon [to do a film like this]. But I do understand the sensitivities around it.”", "url": "https://apnews.com/8df5806ddf9547a79fcf945c858f0004"}