{"authors": ["Chris Bosak"], "date_download": "2020-05-04 20:05:47", "date_modify": "2020-05-04 20:05:47", "date_publish": "2017-03-12 05:00:00", "description": "NEW MILFORD — Chad Yonker sees the power in giving back to the community. He believes in it so much he donates half the profits of his company to community organizations. At the same time,...", "filename": "_ea7b2d4c9b4f4ff5baa9e76345c8ee00_1588622747.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ea7b2d4c9b4f4ff5baa9e76345c8ee00_1588622747.html", "title": "Community-first business model working for New Milford insurance firm", "title_page": "Community-first business model working for New Milford insurance firm", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEW MILFORD — Chad Yonker sees the power in giving back to the community.\nHe believes in it so much he donates half the profits of his company to community organizations. At the same time, Yonker does not take a salary or other compensation for running GoodWorks Insurance.\n“We love this business model. We think it’s a great way to operate in this business,” Yonker said. “We use GoodWorks as a platform to give back to the community.”\nYonker said many people put off donating to charity because they are unsure of the best time to do so. It becomes a Catch 22 situation, he said. The more they donate, the less money they have to grow additional wealth. If they grow that wealth, however, they would have more to donate.\n“People say ‘I’ll donate next year when I have more money.’ But they say that over and over,” said Yonker, a former hedge fund manager who continues to work as a professional investor and entrepreneur.\nPurchasing insurance through GoodWorks offers a solution in that people or businesses buy something they need anyway and donations are made to the community. Clients can choose which agencies receive donations, giving their favorite charity an added revenue stream. GoodWorks gives to organizations in education; health care and safety.\n“GoodWorks gives back on a regimented basis,” Yonker said.\nShould an office struggle during a year and not turn a profit, GoodWorks will still donate a minimum of $15,000 to the community.\nGoodWorks has offices throughout Connecticut, Massachusetts and New York, and is looking to expand into other states. GoodWorks took over New Milford Insurance in 2012. James Kick, who owned New Milford Insurance and is now a senior vice president with GoodWorks, said the offices in Connecticut and Massachusetts are interconnected and can service policies from other locations.\n“New Milford has grown fairly substantially since it became part of GoodWorks,” Yonker said. “People are getting more comfortable with us doing what we say we are going to do.”\nKick has embraced the social business model said he would not have sold his business to anyone other than Yonker. GoodWorks retained Kick, as well as longtime employees Cindy Tyrseck and Susan Poulter. Tyrseck and Poulter have worked together for more than 15 years.\n“I have a tremendous amount of respect for my employees and (Yonker) came in with contracts for everyone,” Kick said. “I absolutely support GoodWorks and the model and what they do for nonprofits. It’s a unique program and the real deal.”\nNew Milford Visiting Nurse Association is a major beneficiary of the local GoodWorks office.\nAnother beneficiary of the insurance company’s business model is Reset, a Glastonbury-based nonprofit agency that supports entrepreneurship and shares a similar social philosophy with GoodWorks. Reset specializes in social enterprise and supporting entrepreneurs in helping to solve community challenges.\nGoodWorks presented Reset with a $5,000 grant in unrestricted funding last summer.\n“They’re a great example of a company that’s doing so much more than turning a profit,” Ojala Naeem, Reset managing director, said. “They’re committed to supporting the next generation of businesses.”\nLike any company, however, it takes customers to grow and thrive. Yonker realizes that just because GoodWorks has a unique, community-based model, that doesn’t mean customers will automatically come through the door.\n“I think it gets us into the conversation we otherwise wouldn’t be in,” Yonker said. “But we still have to compete on a fundamental basis and we do that extremely well. We still have a local feel, but we work with big national insurance companies.”\nGoodWorks offers a variety of insurance coverages, such as home, auto, motorcycle, boat, life and commercial. It is also branching out into employee benefits and investments.\n“It only works to the degree that the community wants to get behind it,” Yonker said. “If people are behind it, it will be successful and help the community. If not, then this type of business model won’t work.”\nJoseph Grachmal founded GoodWorks in 2006 with two offices and a charity-first philosophy. Yonker got involved with the company in 2008 as an investor and board members. After GoodWorks started to struggle as a company, Yonker took over the business in 2011.\nYonker’s investment company put a significant amount of capital into GoodWorks and revived the company to the point that it is becoming one of the largest independent insurance providers in the Northeast. Revenues for the company are up 200 percent since 2011.\nYonker said he’d like to see other companies adopt a similar business model. He understands how that would be difficult for existing companies as they are used to reaping 100 percent of the profits and “it’s difficult to go backwards.”\nNew businesses, however, can be formed with social issues and the community as a major focus. Social entrepreneurship is a growing trend throughout the U.S.\n“We’ve been purpose-driven from the beginning,” Yonker said. “We like the model and see a great future for it.”\ncbosak@hearstmediact.com; 203-731-3338", "url": "https://apnews.com/ea7b2d4c9b4f4ff5baa9e76345c8ee00"}