{"authors": ["Jim Meehan"], "date_download": "2020-05-04 20:06:56", "date_modify": "2020-05-04 20:06:56", "date_publish": "2017-06-22 00:00:00", "description": "The Portland Trail Blazers wanted Zach Collins and dealt a pair of first-round picks to Sacramento to acquire the former Gonzaga Bulldog during Thursday’s NBA Draft. The 19-year-old...", "filename": "_5ed9904f5a78468282f2ceaadf3f108b_1588622816.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5ed9904f5a78468282f2ceaadf3f108b_1588622816.html", "title": "Blazers trade for Gonzaga’s Zach Collins at No. 10 in NBA Draft", "title_page": "Blazers trade for Gonzaga’s Zach Collins at No. 10 in NBA Draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Portland Trail Blazers wanted Zach Collins and dealt a pair of first-round picks to Sacramento to acquire the former Gonzaga Bulldog during Thursday’s NBA Draft.\nThe 19-year-old forward/center didn’t have to wait long – roughly an hour in a fast-moving first round – before hearing his name called by NBA commissioner Adam Silver at the Barclays Center in Brooklyn.\nPortland swapped the 15th and 20th picks to Sacramento. Collins donned a Kings’ cap after his selection was announced but he had been informed of the trade. The trade became official about an hour later.\nAsked in an ESPN interview how he went from coming off Gonzaga’s bench to being a lottery pick, Collins said, “All I can say is that playing behind a guy like (Przemek Karnowski) all year and learning from him, and having the type of trust coaches had in me the whole time, to go in and produce in those small minutes I have to attribute it to staying in the gym and working on things I couldn’t necessarily show in every single game.\n“But I knew when I got a good opportunity I’d go out there and perform.”\nThe only Zag drafted higher than Collins was Adam Morrison, who went No. 3 to Charlotte in 2006.\nCollins can anticipate making in the neighborhood of $2.5 million in his first season, $3 million in year two and $3.5 million in his third season under the NBA rookie salary scale.\nCollins became the seventh Zag taken in the first round. He’s GU’s third lottery pick (top 14) in the last five years, joining Kelly Olynyk in 2013 and Domantas Sabonis in 2016.\nThe versatile 7-footer should provide immediate help to Portland’s frontcourt at both ends of the floor. The Trail Blazers rely heavily on guards Damian Lilliard and CJ McCollum, who combined for 50 points per game last season.\nCenter Jusuf Nurkic (10.2 points, 7.2 rebounds) added an interior presence after being acquired in a February trade from Denver for center Mason Plumlee.\nPortland power forwards/centers from the 2017 season included Ed Davis (4.3 points, 5.3 rebounds), Meyers Leonard (5.4 points, 3.2 rebounds) and Noah Vonleh (4.4 points, 5.2 rebounds). Veteran center Festus Ezeli missed the season with an injury and isn’t expected to be with the team next year.\nCollins played on highly successful teams in high school and in his one season with the Zags. Portland won 54, 51, 44 and 41 games the last four seasons. GU’s first one-and-done player joins a squad that went 41-41 last year and lost in the first round of the Western Conference playoffs.\nCollins helped GU (37-2) reach the NCAA championship game.\n“It definitely helped with confidence and made me realize I can play with the best players in the country,” Collins said in a phone interview with CSN Northwest. “The culture really shaped what type of player I am and why I’m in this draft.”\nCollins incorporated his hometown into his outfit. He wore shoes with “Las Vegas” in script and the liner of his suit jacket featured several of the famous “Welcome to Fabulous Las Vegas” signs.\nCollins was joined at his green room table by dad Mike, mom Heather, sister Taylor, agent Mark Bartelstein and Gonzaga assistant coach Brian Michaelson.\nPortland added Purdue power forward/center Caleb Swanigan with its 26th pick.", "url": "https://apnews.com/5ed9904f5a78468282f2ceaadf3f108b"}