{"authors": ["John Mcdermott"], "date_download": "2020-05-04 20:16:06", "date_modify": "2020-05-04 20:16:06", "date_publish": "2017-06-25 01:00:00", "description": "The endangered Marsh Tacky horse has been called a living, breathing link to the history of Daufuskie Island. These days, a different breed of pony has found its way to the isolated South...", "filename": "_aee388fa5bbb4f349633d7cddf7fd133_1588623366.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aee388fa5bbb4f349633d7cddf7fd133_1588623366.html", "title": "On business: New plot twist for South Carolina island made famous by Pat Conroy", "title_page": "On business: New plot twist for South Carolina island made famous by Pat Conroy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "On business: New plot twist for South Carolina island made famous by Pat Conroy\nThe endangered Marsh Tacky horse has been called a living, breathing link to the history of Daufuskie Island.\nThese days, a different breed of pony has found its way to the isolated South Carolina spit, just off Hilton Head.\nIt’s known as a stalking horse. And it’s running a high-stakes race.\nIn the saddle is Odeon Singapore Ltd., an affiliate of a Netherlands-based maker of sausage casings. It has sunk more than $27.5 million into Daufuskie’s bankrupt Melrose Resort, according to court documents.\nThe lender wants to cut its losses — and the sooner the better.\n“Time is costing us,” said Charles Kelley, a Houston bankruptcy attorney who represents Odeon.\nIt’s the latest turn of the page for Daufuskie, which was introduced to the world in 1972 by late South Carolina author Pat Conroy, who chronicled his stint as a teacher on the sea island in “The Water is Wide.” A film version titled “Conrack,” starring Jon Voight in the lead role, was released two years later.\nThe latest drama on the Calibogue Sound getaway centers on the future of Melrose, which sank into bankruptcy in March for the second time since 2009 — and is slowly but surely deteriorating.\nOdeon is seeking a speedy sale of the shuttered resort to close out the bankruptcy. The rub is that the plan could leave other Melrose creditors with little to nothing.\nThe debate perked up last week, with lawyers arguing over the proposed deal at a hearing in downtown Charleston.\nThe meat of the matter was the “stalking horse” bid, or the opening offer for the resort.\nOdeon, as the secured creditor, gets to dictate the terms. And it has decided it won’t settle for less than $19 million, an $8.5 million haircut.\nThe lender set the minimum price low purposely, to entice other bids, according to Kelley. Any net proceeds beyond $19 million would be split evenly between Odeon and the rest of the creditors.\n“If we’re taken out, we’re OK with that,” Kelley said.\nShould no other bids materialize, Odeon would be handed the keys to Melrose, though it hasn’t determined whether it would keep or sell it. The resort includes an inn, rental cottages, a Jack Nicklaus-signature golf course, tennis courts, an equestrian center and a marina.\n“It needs to be put back to work,” Kelley said.\nOdeon previously has tried to take title to the property, which is accessible only by boat. Its predecessor, Lex Van Hessen Holding BV, filed a foreclosure lawsuit in 2014, after efforts by the current owners to redevelop and reopen the property faltered.\n“At some point ... there was enough straw that the camel’s back broke,” Kelley said.\nA Beaufort County courthouse sale was set for early March. That was scrubbed when Melrose’s owners — a group of Utah businesses — filed for federal bankruptcy protection at the 11th hour.\nThe next auction is scheduled for Aug. 30, and it still faces some challenges. Linda Barr, an attorney with the U.S. Bankruptcy Court’s trustee office in Columbia, called the sale terms one-sided, all to Odeon’s advantage.\n“I see the deal being just to their benefit and not anyone else’s,” she said last week.\nAlso, the odds are “quite remote” that the auction will attract multiple offers in such a short period, Barr said.\nCharleston attorney David Wheeler, who represents a Utah resident with a $1 million claim, agreed. He pointed out that, as of last week, a real estate firm hadn’t been hired to promote Melrose to other buyers.\n“I think 60 days is an unrealistic amount of time to market this property,” Wheeler said.\nMelrose attorney Rick Mendoza provided the counterpoint. The Columbia lawyer has a lengthy legal relationship with the troubled resort, having represented its previous owners in the 2009 bankruptcy.\nAs he sees it, the Odeon proposal is the one and only shot that other Melrose creditors will get at recouping at least a portion of their money.\n“We know if we don’t go forward with this process there won’t be anything for anyone else,” Mendoza said.\nThe do-or-die argument seemed to seal the deal. U.S. Bankruptcy Court Judge John Waites agreed to approve the ground rules of the auction.\n“I guess this is a make or break for you,” Waites said.\nMendoza nodded in agreement.", "url": "https://apnews.com/aee388fa5bbb4f349633d7cddf7fd133"}