{"authors": ["Gene Sapakoff"], "date_download": "2020-05-04 20:06:54", "date_modify": "2020-05-04 20:06:54", "date_publish": "2017-11-15 18:00:00", "description": "Andruw Jones was leading the South Atlantic League in home runs at 17. He hit two home runs in a World Series game for the Atlanta Braves at 19. Jones, 40, also played for the New York Yankees...", "filename": "_2eff435cda364cf8b70ae011066bcf88_1588622814.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2eff435cda364cf8b70ae011066bcf88_1588622814.html", "title": "RiverDogs get former Braves, Yankees outfielder Andruw Jones as Hot Stove speaker", "title_page": "RiverDogs get former Braves, Yankees outfielder Andruw Jones as Hot Stove speaker", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Andruw Jones was leading the South Atlantic League in home runs at 17. He hit two home runs in a World Series game for the Atlanta Braves at 19. Jones, 40, also played for the New York Yankees alongside Derek Jeter and Alex Rodriguez while completing his Major League career with 434 home runs.\nThose are some of the reasons the Charleston RiverDogs feel Jones is a good speaker pick for their 14th annual Hot Stove Banquet and Auction, scheduled for Feb. 2 at the Charleston Marriott’s Crystal Ballroom.\nJones, a native of Curacao who currently works for the Braves as a special assistant in the Baseball Operations department, hit .254 and played in 76 postseason games. He had 10 consecutive 20-homer seasons. But Jones is best remembered for his defense in centerfield: 10 Gold Gloves and range-factor statistics that helped make Braves Hall of Fame pitchers Greg Maddux, John Smoltz and Tom Glavine so successful.\nHe also stole 152 bases.\nJones will join a list of Hot Stove speakers that have included Smoltz, Glavine, Ryne Sandberg, Bobby Cox, Goose Gossage and Jim Bouton.\nIndividual tickets to the Hot Stove Banquet are $75 and can be purchased online at riverdogs.com and rileyparkevents.com.\nGroups can reserve a table of eight for $600 and a table for ten at $750 by contacting the RiverDogs Special Event Department at 843 577-DOGS.", "url": "https://apnews.com/2eff435cda364cf8b70ae011066bcf88"}