{"authors": ["Miles Kampf-Lassin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Joe Allen", "Nicole Colson", "Chris Brooks", "David Golumbia"], "date_download": "2020-05-04 19:56:54", "date_modify": "2020-05-04 19:56:54", "date_publish": "2017-10-31 00:00:00", "description": null, "filename": "2017_10_jeff-bezos-amazon-rahm-emanuel-chicago_1588622214.html", "image_url": "https://images.jacobinmag.com/2017/10/31105910/GettyImages-450831302.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_10_jeff-bezos-amazon-rahm-emanuel-chicago_1588622214.html", "title": "Don’t Trust Jeff Bezos - or Rahm Emanuel", "title_page": "Don’t Trust Jeff Bezos — or Rahm Emanuel", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nConsidering the power corporations wield over the economy — choosing when to relocate jobs and where to stash offshore accounts — we shouldn’t be surprised that cities across the country are offering massive giveaways in hopes of attracting one of the world’s largest tech companies. Mayors in forty-three states, along with Washington, D.C., and Puerto Rico, want Amazon to build its new North American headquarters in their own urban enclaves, so they’re ready to give the company billions of dollars in tax credits and other incentives. Stonecrest, an Atlanta suburb, even offered to rename itself Amazon and appoint CEO Jeff Bezos as “mayor for life.” These taxpayer-funded subsidies for highly profitable corporations are known as “corporate welfare.” Studies show that state and local governments give away $80 billion to corporations every year, while federal subsidies cost taxpayers at least $100 billion annually. This comes on top of hundreds of billions of dollars in tax breaks, mortgage deductions, and other handouts. It all adds up to a free market that costs the public a fortune. Of all the brazen offers on the table, one in particular stands out. Chicago Mayor Rahm Emanuel has put together $2.25 billion in subsidies to entice Bezos to open shop in the Windy City. Meanwhile, he’s slashed public services and hiked taxes. Just this month, Emanuel presented his 2018 budget, which includes additional costs for rideshare services and a 28 percent increase in fees for calling 911. City Council member Carlos Ramirez-Rosa says the new budget “nickel-and-dimes working-class Chicagoans while giving the mayor’s rich and powerful campaign donors a free pass.” These new taxes come on the heels of the largest increase in property taxes in modern Chicago history. Another hike is slated for 2020. Since taking office, Emanuel has implemented new taxes on water, sewer, telephone use, and garbage pickup, to name but a few. Altogether, he has raised the cost of living for an average Chicago family by at least $1,700. Meanwhile, he’s privatized more and more public services, from the public schools’ janitorial services to the Skyway, the toll road that connects the city to northern Indiana. Critics allege that raising billions of dollars on the backs of ordinary Chicagoans in order to give it away to a powerful tech company is just the kind of corporate-friendly scheme that has earned Emanuel the nickname “Mayor 1 Percent.” “It’s disturbing to see elected officials like Rahm Emanuel trying to stuff billions more into Jeff Bezos’s pockets,” says Amisha Patel, executive director of the Grassroots Collaborative, a Chicago-based coalition of social-justice organizations. “Chicago needs real solutions for working families, not more lavish handouts to the ultrawealthy.”\nMiseducation How can a city that has to massively raise taxes and fees afford billions in giveaways? According to Chicago Teachers Union (CTU) Vice President Jesse Sharkey, it comes down to priorities. “Mayor Emanuel’s hypocrisy is overwhelming,” Sharkey says, explaining: During his budget address, the mayor emphasized that he was raising taxes to cover the true costs of city services, but Amazon doesn’t have to pay for the true costs of their new building. The proposed multi-billion-dollar giveaway reminds us that Emanuel cares about the rich and their downtown showcase at the expense of everyone else. Sharkey knows a thing or two about how the mayor makes decisions. As vice president of the CTU, he helped lead educators in a historic 2012 strike. While the teachers came out on top in that fight, Mayor Emanuel’s handpicked school board closed fifty public schools the next year — the largest single round of school closures in US history. Soon after, the board enacted severe budget cuts and laid off a thousand employees, targeting the union’s membership. More recently, reports have surfaced showing that Chicago Public Schools (CPS) CEO Forrest Claypool, an Emanuel appointee, cut the special-education program budget by $29 million. At the same time, he’s trying to increase payments to outside consultants to a total of $28 million: almost enough to fully restore special-education services to the schools. These cuts to public education align with Emanuel’s broader policy of hollowing out public resources. Just after he became mayor, he shut down half of the city’s mental health clinics, helping to make the Cook County Jail the largest mental hospital in the nation. Meanwhile, Chicago continues to deal with horrific levels of gun deaths, concentrated in poor communities of color. Amisha Patel connects this segregated violence to the city’s refusal to invest in these neighborhoods. “Chicago has become a poster child of the deadly consequences of this neoliberal approach,” says Patel. “The communities that the mayor has continued to disinvest in are the same communities experiencing high levels of violence.” Such is life in a city with a neoliberal administration, hell-bent on recruiting the richest of the tech world while turning its back on its own residents.\nWhat Bezos Offers What does Jeff Bezos, the tycoon who is making city leaders grovel for the chance to become his new home, bring to the table? Amazon claims that their new headquarters will create 50,000 new jobs and bring in up to $5 billion in construction spending. That may sound like a lot, but a closer look at what this development would bring tells a different story. Without a trained workforce ready to take these tech jobs, they will go to transplants. One only has to look at San Francisco — a shell of its former self, full of businesses and housing developments for the wealthy but lacking basic amenities for the poor — to see what a tech-company paradise looks like. Further, a corporation as viciously antiunion as Amazon will ensure its new employees remain unorganized and unable to collectively bargain. And if workers try to unionize? The company could just pack up and move away. Once the new workers move into the city, longtime residents will likely see their housing costs grow while facing snarled traffic and increased congestion. The new headquarters might displace long-term residents as the city becomes unaffordable for anyone in the lower economic strata. None of these consequences are likely to worry Amazon’s corporate brain trust, however. They are probably too busy celebrating the Trump administration’s decision to allow them to begin drone deliveries, a technology that will significantly reduce the company’s already precarious workforce. Bezos, for his part, has his hands full counting his riches. He became the wealthiest man in the world after soaring stock prices netted a cool $9 billion over the course of a single night. Bezos’s $90 billion nest egg speaks to the larger issue behind these offers: why are cities scrounging together tributes for a company led by a merchant prince? The answer lies with the logic of capital. Free trade deals allowed companies to move jobs overseas in order to avoid labor and environmental regulations, leaving American workers vulnerable. As a result, cities across the country have lost the industries that previously served as their economic engines. So, when a powerful corporation like Amazon offers to revitalize an urban economy, mayors jump at the chance, joining a race to the bottom that only ends in hollowed-out communities, gilded cities, and multibillionaire profiteers.", "url": "https://www.jacobinmag.com/2017/10/jeff-bezos-amazon-rahm-emanuel-chicago"}