{"authors": ["Jonah Walters", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:28", "date_modify": "2020-05-04 19:51:28", "date_publish": "2017-08-29 00:00:00", "description": null, "filename": "2017_08_beware-your-local-food-cooperative_1588621888.html", "image_url": "https://images.jacobinmag.com/2017/08/29100219/coopwars-wordpress.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_08_beware-your-local-food-cooperative_1588621888.html", "title": "Beware Your Local Food Cooperative", "title_page": "Beware Your Local Food Cooperative", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In 1969, a band of draft-dodgers established a commune “to grow flowers and make pottery” near an abandoned train depot in Georgeville, Minnesota. One of them brought a video camera. His short documentary survives today.\nA narrator’s voice lopes its way across some homemade footage of overgrown train tracks: “We talk to the outside world,” the voice narrates, “but we have an ambivalent attitude toward it.”\nBut before long, these ambivalent communards would venture to the city to participate in the burgeoning food co-op movement. In 1970, an underground newspaper in Minneapolis proclaimed “GOOD FOOD FOR STRONG REVOLUTIONARY BODIES AT THE PEOPLES’ PANTRY.”\n“There’s no reason why some time in the not-too-distant future (five years?) most of the Twin Cities’ food needs cannot be served by peoples’ co-ops,” wrote one cooperative member at the time. “One thousand co-ops each providing 1,000 people with healthful and inexpensive food grown on nearby farms by non-exploitive (and non-exploited) farmers is not just a pipe dream.”\nPipe dream or no, this utopianism was short-lived. By 1975, sectarian conflicts had spiraled out of control. As an organizer of the Peoples’ Warehouse, one of the city’s largest co-ops, told a film crew decades later, “We were sitting on bags of flour, smoking joints and reading our comic book, Invasion of the Stalinoids ,” when about twenty-five militants carrying steel pipes entered the co-op. “They were full of class rage — at us! Because we were the bourgeoisie!”\nAfter a righteous denunciation, the interlopers seized control of the cooperative by force. The Peoples’ Warehouse had become a battleground in the violent intra-left struggle remembered today as the “co-op wars.”\nDuring the 1970s, two factions jostled for control over some two dozen food cooperatives in the West Bank neighborhood of Minneapolis. On one side, there were the decentralists, with strong ties to the communitarian ethos of the hippie generation. On the other side, there was a brigade of Maoist true believers, whose strategy for prolonged people’s war required wresting control of the food co-operatives from the flower children.\nThis group was known as the Co-op Organization (CO), and later simply as The O. It started as a clique of self-styled guerillas, schooled in the messianic Marxism-Leninism of the late New Left. It ended, in the words of one former member, as an experiment that “blew up in the lab, so to speak, flinging the research staff far and wide.”\nThe decentralists were enamored of organic foods farmed on back-to-the-land communes by former student radicals like themselves. Because they alienated most of their working-class neighbors, they remained few in number. The CO, on the other hand, following the model of the Black Panther Party, wanted to use the cooperatives to distribute staples like Wonder Bread and canned soup to as many community residents as possible, in the hopes of attracting mass support for the revolutionary struggle they planned to wage.\nBut neither group seemed especially interested in the rich tradition of cooperative enterprise that already existed among black residents of the West Bank neighborhood, who had intermittently organized co-op groceries and mutual aid societies since at least the 1940s.\nGary Cunningham, a cooperative organizer (and today the husband of Betsy Hodges, the sitting mayor of Minneapolis), sympathized with the CO at first. But then the CO tried to seize the Bryant-Central Co-op, founded by Cunningham’s uncle Moe Burton, a community organizer with ties to the Socialist Workers Party and the Black Panthers.\n“There were shots fired that night at our house,” he recalled to the same film crew. “We got up the next morning and went to the co-op and it was like a scene from a Western. We pretty much beat them up. I think I broke one of the guys’ arms.”\nIn the end, their campaign of co-op takeovers failed to propel the CO to the head of a mass insurrection. Nor did the decentralists succeed in erecting their utopia of farmers markets. The decentralists dispersed. The CO degenerated. The conflict died down.\nStill, today, older residents of the Twin Cities may shudder to hear newcomers speak casually of food co-ops, as if they know nothing of the war.", "url": "https://jacobinmag.com/2017/08/beware-your-local-food-cooperative"}