{"authors": ["Colin Gordon", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Adam Gaffney", "Timothy Faust", "Christopher Baum", "Sean Petty"], "date_download": "2020-05-04 19:51:42", "date_modify": "2020-05-04 19:51:42", "date_publish": "2017-07-24 00:00:00", "description": null, "filename": "2017_07_trumpcare-obamacare-us-health-care_1588621902.html", "image_url": "https://images.jacobinmag.com/2017/07/24212915/14140v.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_07_trumpcare-obamacare-us-health-care_1588621902.html", "title": "A Brief History of American Health Reform", "title_page": "A Brief History of American Health Reform", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIt is a simple fact of politics in capitalist democracies that private interests shape, and often simply decide, public policies. Many issues of broad or collective concern — investment, employment, the allocation of resources — are made outside the political arena altogether, with policy called in only to mop up failures. Both electoral politics and the legislative process in the United States are notoriously capital-intensive, the fate of candidates and policies largely determined by private demands and private resources. Some, as the economist Anthony Downs famously observed in 1957, “are more important than others politically, because they can influence more votes than they themselves cast.” The result, as recent research has laid bare, is not just the glorious irrelevance of the median voter, but a seemingly impenetrable engine of elite domination generating both stark inequality and policies designed to make it starker. All of this is especially true, and especially destructive of the public good, in the American health care system — a monstrosity that gobbles up nearly a fifth of the country’s gross domestic product while dramatically outspending and underperforming its international peers. In health care, private providers and private financing mechanisms were well ensconced long before any meaningful public intervention. The stakes are very high and, historically, a diverse array of private health interests have spent lavishly on political campaigns, and haunted congressional hearings and anterooms. But what has shaped health policy, and stymied reform for the last century, is not so much the combined clout of private interests as it is the tangle of compromise and competition that’s emerged from the scrum as they jockey for influence over policy, for advantage over each other, and for unfettered access to public spending. Over the last century, the terms of that corporate compromise have been altered through changes in medical care, and changes in the ways medical care is sold, underwritten, packaged, subsidized, regulated, and consumed. The influence of private interests has persisted but, from the first consideration of “health security” in the Progressive Era to the tortuous repeal of the Affordable Care Act over the last few months, which interests have weighed in — or prevailed — has shifted. Tracing those shifts (sometimes subtle, sometimes profound) is important not just to our understanding of the history, but also to our efforts to win a more just health system. The case for universal, equitable coverage is airtight. And it commands substantial public support. But in order to get there, we need to know what, or who, we are up against.\nNo Deal, New Deal, Raw Deal When the idea of public coverage was first broached on the eve of the First World War, the American health care system was a very different beast. Medicine was scarcely a profession, whether measured by status or income. Hospitals were where one went to die. Pharmacies, virtually unregulated, trafficked in snake oil and promises. The closest thing to health insurance on the market was an installment plan for a coffin and flowers. And the risk that most Americans faced was not the cost of being sick or injured, but the cost of missing a paycheck as a result. In response, US reformers — motivated both by the human costs of industrial capitalism and their European peers — proposed a modest state-level program of indemnity insurance for workers, financed equally by public, employer, and employee contributions. The fledgling American Medical Association (AMA) wasn’t wholly opposed to the idea, which would have created a stable revenue stream. But state and local medical associations objected to any interference in the patient-doctor relationship and any hint of “contract” practice (in which doctors were salaried or paid on a per-capita basis). Employers bristled at the notion that health care should be considered a cost of employment, and at the prospect of plans passing in some states and not others. Samuel Gompers’ American Federation of Labor (which preferred higher wages to stigmatized public benefits) was lukewarm, although many state federations pressed for passage. The insurance industry, for its part, dug in hard. The counter-offensive, spearheaded by Prudential’s Frederick Hoffman, was animated in equal parts by the industry’s anxiety over creating a regulatory precedent and by Hoffman’s conviction that “lesser races” were uninsurable. Major insurance firms (led by Prudential and Metropolitan) sought common cause with employers and doctors, and bankrolled a furious publicity campaign that (with a boost from American entry into World War I) successfully portrayed the pursuit of health security as “UnAmerican, Unsafe, Uneconomic, Unscientific, Unfair, and Unscrupulous.” This early episode in American health reform was not especially consequential; the idea was only floated in a few states and approved in none of them. But it set in motion a pattern of opposition marked by persistent arguments and assumptions — that health care was a consumer good rather than a public good, that any departure from fee-for-service provision was tantamount to socialism, and that “the color line” precluded broad or universal coverage. It also set in motion a pattern of health politics in which health interests — doctors, hospitals, insurers, employers, unions, and others — proved willing and able to mobilize political resources, cobble together strategic alliances, and deploy apocalyptic claims to fend off or recast reform. Through the 1920s and into the New Deal era, organized medicine emerged as the most strident and deep-pocketed of these interests. The AMA battled virtually any alternative to fee-for-service care, a tack that (ironically in the long run) saw them ally with the insurance industry in the hope that the latter would not interfere with private practice. And the AMA put their money where their mouth was, devoting nearly $1 million a year to lobbying and public relations work. Cowed by this formidable opposition, the architects of Social Security quietly dropped a health insurance title early in the drafting process, but remained confident that they could bring the AMA around over time. They were wrong.\nBargaining for Health Over the next decade, the push to add payroll-based health coverage to Social Security gathered steam, but so too did the political clout of the AMA. More importantly, a seemingly minor footnote in World War Two–era labor relations appeared that would at once affect the future of health care and the constellation of stakeholders. Leery of inflation in an overheated wartime economy, the National War Labor Board closely monitored labor-management contracts — capping wages and using tax breaks to encourage compensation in the form of fringe benefits such as paid vacations, onsite child care, and employment-based health coverage. The emergence of a “private welfare state” organized around job-based provision transformed health care’s corporate compromise. For employers, looking to roll back or slow the growth of the New Deal state, private benefits served as potent evidence of the willingness and ability of markets to solve social problems. For labor, still toying with the goal of national health insurance, winning coverage at the bargaining table seemed a second-best option and a powerful organizing tool. For insurers, the innovation of employment-based group coverage (in which employers pooled risk) erased the “moral hazard” of individual coverage. And for doctors and hospitals, job-based coverage promised a vast new market of covered patients, at little political expense. As promising as this new arrangement was — both for private coverage and for health care’s key stakeholders — it was plagued by two problems. First, it was a shaky compromise. For the moment, insurers and employers and providers were willing to follow the AMA’s political lead. But in the longer run, the private welfare state pitted these interests against each other — especially once employers began to object to rising costs. Second, it was an insufficient compromise. At the time, job-based coverage was increasing in leaps and bounds: between 1940 and 1950, the share of Americans with private health coverage jumped from 9.1 to 50.3 percent. But then growth slowed, peaking at about 80 percent in the early 1980s and then slipping back, to 71.6 percent in 1990, and to 67.2 percent by 2015 — lower than it had been in 1960, despite the infusion of new coverage under the ACA. Just as the postwar compromise was struck, in other words, it faced two troubling questions. What would happen when the interests of insurers and doctors and employers were not so neatly and easily aligned? And what would happen when the promise of private coverage, as a surrogate for national health insurance, petered out?\nMopping Up In the short term, as collective bargaining delivered more expansive coverage and the health sector expanded to accommodate the influx of insured patients, these were but quietly nagging questions. Of more immediate concern, once the AMA had stifled the last gasp of national health insurance in 1948, was what do about those for whom jobs would not deliver coverage — the elderly, those not working, and those toiling on the wide margins of the labor market. As debate shifted to coverage for the poor and elderly, the AMA continued to amass political clout: “Those of us with deep convictions,” as AMA president James Foristel observed in 1956, “must do more than vote.” Insurers established a political and lobbying arm, the Health Insurance Association of America, the same year. And employers, ably represented by the Chamber of Commerce and a slew of other industry and trade associations, had recovered all and more of the political ground they had lost in the Depression and war years. At the same time, however, cracks were beginning to form in the corporate compromise. Increasingly, this political firepower would be deployed against erstwhile allies, as much as against the broader threat of state encroachment. Employers, having championed job-based coverage in the first decade after the war, were beginning to worry about its scope and its costs. As labor — then at the peak of its postwar bargaining clout — won more expansive and dependent coverage, some employers drifted back to the argument that health care was not (or should not be) considered their burden. Those offering coverage fretted about free-riding competitors who were not. And, as the cost of group plans rose, employers began to confront those — labor, doctors, hospitals, insurers — they held responsible. Insurers championed the increasingly lucrative line of group-based private coverage and the light hand of state-based insurance regulation. They were leery of the political push for indigent and elderly coverage (what would eventually take shape as Medicaid and Medicare), even as they privately conceded that having public policy pick off the poorest risks might not be a bad thing. And they occupied an increasingly uncomfortable position between the demands of providers on one hand and employers on the other. Doctors, at least as represented by the AMA, remained strident opponents of any public coverage, and worried that any concession would “invite the camel’s nose of socialized medicine inside the tent.” But, to the degree that doctors were worried about professional autonomy, they also began to acknowledge privately that insurance actuaries and cost-conscious employers posed as much of a threat as the wide-eyed Leninists of their nightmares, who continued to press for national health care. On the long path to Medicare and Medicaid in 1965, these interests worked more to shape the legislation to their liking than to block it outright. The AMA would have preferred the status quo, but managed to cleft Medicare in two — the core (Part A) program covering hospitalization, and a smaller voluntary program (Part B) covering doctor’s bills. Doctors and hospitals won a blank-check commitment to “usual, customary, and reasonable” reimbursement rates for services. Insurers and employers both grumbled about creeping socialism, but had no real objection in the end to programs that strengthened job-based provision by mopping up around its limits and failures.\nThe Business of Health, the Health of Business The implementation of Medicare and Medicaid once again reordered American health politics. As with major social insurance innovations before and after, beneficiaries of the new programs (especially Medicare) became a powerful force in their own right. Providers — even those who saw Bolshevism lurking behind every public benefit — found lots of elbow room at a generous public trough. Insurers came out confident that there was now a hard and fast line between public and private risk and responsibility. But employers, who bore the brunt of the health care inflation that began to spiral after 1965, started sounding the alarm. The corporate compromise was now a confrontation — providers and insurers on one side, payers (mostly employers) on the other. In this new context, business interests quickly eclipsed the AMA and others. In part, this was the AMA’s fault: it had been slow to grasp the implications of changes in health delivery and finance, it was hemorrhaging members, and its tirades against socialized medicine seemed increasingly thin and quaint. As Lyndon Johnson observed in the final weeks of the Medicare debate, “Chickens are real dumb. They eat and eat and eat and never stop. Why they start shitting at the same time they’re eating, and before you know it, they’re knee deep in their own shit. Well, the AMA’s the same. . . . [T]hey’re knee deep in their own shit and everybody knows it.” Employers, meanwhile, claimed an immense stake in the health care system and almost seamless access to political power. “The AMA will send carloads of lobbyists up the hill on an issue,” gloated a lobbyist for the Washington Business Group on Health, “and we only have to write one note.” And for employers, the issue was simple: health care cost too much, and they were being stuck with too much of the bill. While a few large unionized firms flirted with the idea of national health insurance in the early 1970s (reasoning that getting others to pay their share was the best solution), most just looked for ways to shed the burden. This put employers — retreating from full employer financing to the now-familiar tangle of copayments and split premiums and deductibles — at odds with labor. And it put employers at odds with providers and hospitals and insurers, as efficiency and “managed competition” and new reimbursement schemes took center stage. Doctors were horrified by the business offensive: “Passengers who insist on flying the aircraft,” AMA president Richard Roth sniffed in 1976, “are called hijackers.” But there was no stopping it. Through the 1980s, the health reform zeitgeist was focused singularly and relentlessly on cutting business costs, yielding little more than a federal blessing of Health Maintenance Organizations. In 1992, spurred largely by business anxieties about costs, the Clinton administration took its turn in the health reform mosh pit. The administration’s Health Care Task Force, as its records make painfully clear, was dismissive of bold solutions and carefully solicitous of health interests — a policy approach, as one critic put it, “close to handing blank paper to special interest lobbyists and saying, Hey you do it.” Those interests were happy to weigh in, but at this point their goals were so diverse and contradictory that a legislative solution seemed more elusive with each passing day. Doctors and hospitals flooded the task force with recommendations and concerns, yet seemed resigned to the fact that they were the targets of any reform — that in the end either the state or the insurance companies were going to curtail professional autonomy with cost-conscious managerial solutions. (Some pointed out that single-payer health insurance might be the best guarantor of both cost control and medical practice, a suggestion that was at once sensible and blasphemous.) Employers were torn, seeing reform (depending on their health costs and liabilities) as an opportunity to socialize the costs or escape them altogether. The first option here, which both reaffirmed the principle of job-based coverage and spread its costs, was an employer mandate. The Chamber of Commerce was leery of committing to a mandate before they know what concessions could be wrung out of labor and providers and insurers, and — after flirting with reform for a few months — pulled its support. Smaller firms, in the Chamber and in organizations like the National Federation of Independent Business, wanted nothing to do with mandated coverage. The Health Insurance Association of America led the opposition to the Clinton plan, most notably by sinking $14 million dollars into the “Harry and Louise” advertising campaign. As is still the case, insurers were primarily worried about new federal regulatory standards that would narrow the industry’s actuarial discretion — to risk-rate coverage based on age or preexisting conditions, or to deny coverage altogether. But, at least early in the debate, the industry’s “Gang of Five” (Prudential, CIGNA, Aetna, MetLife, and John Hancock) broke with the HIAA, confident to take the lead in both shaping the bill and administrating its plans. Like employers, however, leading insurers realized that other interests had the administration’s ear, and drifted to the sidelines. This was a pattern of influence — evident as early as the run-up to Medicare and Medicaid in 1965 — that was now the norm in health politics. Health interests did not just react to legislative proposals; they shaped and reshaped them from the earliest stages. The only real obstacles they faced were the conflicting demands and political muscle of other health interests.", "url": "https://www.jacobinmag.com/2017/07/trumpcare-obamacare-us-health-care"}