{"authors": ["Lorenzo Zazueta-Castro", "Staff Writer Follow", "Lorenzozazueta", "Function D S Id", "Var Js Fjs D.Getelementsbytagname S", "P", "Http", ".Test D.Location", "'Http' 'Https' If", "D.Getelementbyid Id"], "date_download": "2020-05-04 20:23:08", "date_modify": "2020-05-04 20:23:08", "date_publish": "2017-12-28 01:37:00", "description": "McALLEN — A federal district judge sentenced a 41-year-old man to more than five years in prison for his role in an attempt to smuggle more than 5 kilos of cocaine into the country. District...", "filename": "_f2ef51ba3a674055890a1e6b1852044a_1588623788.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f2ef51ba3a674055890a1e6b1852044a_1588623788.html", "title": "Five-year sentence for man caught with cocaine at port of entry", "title_page": "Five-year sentence for man caught with cocaine at port of entry", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "McALLEN — A federal district judge sentenced a 41-year-old man to more than five years in prison for his role in an attempt to smuggle more than 5 kilos of cocaine into the country.\nDistrict Judge Micaela Alvarez on Wednesday sentenced Jorge Olivares to 62 months in federal prison. Olivares will also serve three years of supervised probation upon his release and is expected to participate in a drug rehabilitation program, according to court notes.\nOlivares was facing up to 10 years in federal prison in connection with a January attempt to smuggle more than 10 pounds of cocaine into the country, according to a criminal complaint.\nOlivares was arrested Jan. 24 by U.S. Customs and Border Protection officers working at the Pharr-Reynosa International Bridge after they discovered bundles of cocaine he attempted to smuggle inside his Chevrolet Malibu, the complaint states.\nOlivares a U.S. citizen whose hometown was not identified in the complaint, told authorities he was headed into the United States from a home in Reynosa, Tamaulipas, upon being referred for a secondary inspection during crossing.\nDuring the inspection officers discovered 5.86 kilograms of cocaine hidden within the dash of Olivares’ vehicle, the complaint states.\nOlivares, who admitted to being the owner of the vehicle, told authorities that as far as he knew no repairs had been performed on the vehicle in months prior to his attempt at the port.\n“Olivares stated the drugs had been placed in the vehicle by an unknown person, and the vehicle was dropped off at his home in Reynosa, Tamaulipas, Mexico, the complaint states. “Olivares stated that shortly thereafter, he proceeded to cross the vehicle into the United States.”\nIn May, Olivares agreed to plead guilty to one count of the indictment against him — import of drugs — in exchange the government agreed to dismiss the three remaining counts against him which included attempt/conspiracy to sell, distribute or dispense, conspiracy to distribute drugs, and sell, distribute and dispense narcotics, according to the court record.\nlzazueta@themonitor.com", "url": "https://apnews.com/f2ef51ba3a674055890a1e6b1852044a"}