{"authors": [], "date_download": "2020-05-04 20:10:54", "date_modify": "2020-05-04 20:10:54", "date_publish": "2017-08-12 07:00:09", "description": "'Spider-Man' spin-off 'Silver & Black' will be released on February 8, 2019. Sony has announced the release date for the upcoming Gina Prince-Bythewood directed movie, which will hit cinemas...", "filename": "_6cf031e89fb840608f489c061c126b49_1588623054.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6cf031e89fb840608f489c061c126b49_1588623054.html", "title": "'Spider-Man' spin-off Silver and Black gets release date", "title_page": "'Spider-Man' spin-off Silver and Black gets release date", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "‘Spider-Man’ spin-off ‘Silver & Black’ will be released on February 8, 2019.\nSony has announced the release date for the upcoming Gina Prince-Bythewood directed movie, which will hit cinemas four months after the previously announced October 2018 release of ‘Venom’, starring Tom Hardy.\nAnd fans could be in for a treat as it was previously revealed that Spider-Man could feature in the same universe as ‘Venom’, ‘Silver & Black’, and the other Spider-Man movies being made by Sony.\nAmy Pascal recently revealed the studio’s plans for the iconic superhero, seemingly confirming that Spider-Man - who is played by English actor Tom Holland - will feature in a number of spin-off movies.\nAmy explained: “Those movies will all take place in the world that we are now creating for Peter Parker.\n“They’ll be adjuncts to it, it may be different locations but it will still all be in the same world, and they will be connected to each other as well.”\nAsked if Spider-Man will feature in the Venom or Silver & Black films, Amy said: “There’s always a chance.”\nBy contrast, the studio has previously insisted the spin-off movies would not include Spider-Man, despite his connections to the main protagonists.\nMeanwhile, Tom has confirmed a ‘Spider-Man’ trilogy is in the works.\nThe 21-year-old actor revealed ‘Spider-Man: Homecoming’ will be followed by two further standalone movies that will allow Marvel to develop the story of the superhero.\nTom explained: “Yes, there is what we call the arc of the character. There is still a lot of room for Peter Parker and Spider-Man, especially, to grow in the next two movies.\n“He’s definitely not the finished article by the end of ‘Spider-Man: Homecoming’ and I really look forward to exploring the different ways he can grow up and ... go through puberty I guess. It’s going to be an exciting couple of movies.”\nAsked to clarify what he meant by a “couple of movies”, Tom said: “There will be a ‘Spider-Man 2’ and 3.”", "url": "https://apnews.com/6cf031e89fb840608f489c061c126b49"}