{"authors": ["Bob Walsh"], "date_download": "2020-05-04 20:10:37", "date_modify": "2020-05-04 20:10:37", "date_publish": "2017-12-03 21:00:00", "description": "The following column is new to the Daily Herald. Each column will feature timely health advice and the collective wisdom of many health experts. Some weeks it will be all about feeling good, other...", "filename": "_c60ac0e3f20b4807a9a9c7253a2fdc95_1588623037.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c60ac0e3f20b4807a9a9c7253a2fdc95_1588623037.html", "title": "Dr. Bob: Addressing alcoholism during the holidays", "title_page": "Dr. Bob: Addressing alcoholism during the holidays", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The following column is new to the Daily Herald. Each column will feature timely health advice and the collective wisdom of many health experts. Some weeks it will be all about feeling good, other times it will be more about factual knowledge designed to develop or maintain good health. Either way I hope the advice and recommendations will be of value. — Dr. Bob\nFive years ago last week I received a call from the California Police Department notifying me that my brother had been found dead in his Arrow-Bear cabin. The family had known for years of his alcohol problem. At the time of his death he had lost his wife, kids, career, and virtually everything, except his desire for alcohol.\nAlcoholism is so common that virtually every family has at least one person who fits the title of alcoholic.\nFor many the holidays are a time of family get-togethers, gift giving and thankfulness for the year coming to an end. However, for others it is a time of overeating, overdrinking and endless celebrations. As with many things in life knowing when to stop or having the ability to stop can make all the difference.\nEach year, Utah establishes a new record for the number of gallons of alcohol consumed. While most Utahans will experience a so-called “Safe and Sane” holiday season, the holidays for others will provide an excuse for over indulgence, including alcohol. While certainly not all of those having a little “holiday cheer” are alcoholics, many may find themselves drinking beyond what is considered safe, as well as reasonable.\nWhen they first met in the spring of 1935, the backgrounds of William Wilson and Robert Smith could not have been more different, but also more alike. One was a successful businessman whose Wall Street investments had made him rich before the crash of the late ’20s. The other was a medical physician who was experiencing financial ruin due to a habit they both shared.\nAs you may have guessed, both were alcoholics. In 1934 Wilson was admitted to Towns Hospital in New York and agreed to subject himself to the “belladonna cure” This was a popular treatment calling for morphine and the hallucinogen drug belladonna. As the story goes, under the influence of this combination of drugs Wilson experienced “his spiritual awakening.”\nFor several months, following his new-found mission in life, Wilson sought out drunks to “work on”. On a trip to Akron Ohio, where he was seeking a new job, he was introduced to Dr. Robert Smith. Dr. Smith’s medical career was in financial ruin due to his inability to control his drinking.\nIt was Wilson’s determination, combined with Smith’s desperation that led to their task of keeping each other sober and helping others to do the same.\nOn June 10, 1935 (the official founding of Alcohol Anonymous) Smith took his last drink. By 1939, Wilson had finished writing the Twelve Steps and an extended explanation of the AA philosophy known today as the “Big Book.” Wilson and Smith soon discovered that they were most successful in keeping alcoholics abstinent when they attended meetings on a regular basis and were assured of complete privacy and anonymity. Wilson became Bill W., and Smith became Dr. Bob (No relation to the writer of this health column).\nIt was not until 1940 that AA gained attention on a wide-scale basis. It was a feature article in the Saturday Evening Post, one of the leading magazines of the day, that gave the organization its real break. Following the article, thousands of inquiries were received and there was a dramatic increase in members. It was during this time a prayer was composed that would eventually be repeated millions of times in AA meetings through the world:\n“God grant me the serenity to accept the things I cannot change, the courage to change the things I can, and the wisdom to know the difference.”\nFor most adults, moderate alcohol use is probably not harmful. However, some 18 million adult Americans have an Alcohol Use Disorder (AUD). This means their drinking causes them distress and harm.\nAlcoholism, or alcohol dependence, is a disease that causes\n1) Craving, a strong need to drink;\n2) Loss of control — not being able to stop drinking once you have started;\n3) Physical dependence — experiencing withdrawal symptoms;\n4) Tolerance — the need to drink more alcohol to get the same feelings or effect\nWhat follows is a commonly accepted quiz to assist in identifying those that may have AUD:\n1) Drinking more or longer than having planned to;\n2) Wanting to cut down or stop but are unable to;\n3) Spending excessive time recovering from drinking;\n4) Feeling a strong need to drink;\n5) Finding that drinking or being sick from drinking is interfering with family, job or school;\n6) Giving up or avoiding activities so you can drink;\n7) Finding yourself in a dangerous situation due to your drinking;\n8) Having to drink more and more to feel the effect of alcohol;\n9) Experiencing withdraw symptoms such as nausea, sweating, trouble sleeping, shaking, or anxiety when you go without alcohol.\nIf you answered yes to two or more of these questions, alcohol may be becoming an issue in your life.\nThere are a wide variety of community resources in the Provo Orem area, including AA. The challenge is to take that first step and get help.", "url": "https://apnews.com/c60ac0e3f20b4807a9a9c7253a2fdc95"}