{"authors": [], "date_download": "2020-05-04 20:26:55", "date_modify": "2020-05-04 20:26:55", "date_publish": "2017-03-03 07:00:00", "description": "Sir Tom Jones thinks Elvis Presley \"wouldn't be too sure\" about his relationship with his ex-wife Priscilla Presley. The 'She's A Lady' hitmaker has grown close to the 'Naked Gun' actress...", "filename": "_00d3f0f8abb8467ca25a63e3c2e4ace1_1588624015.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_00d3f0f8abb8467ca25a63e3c2e4ace1_1588624015.html", "title": "Elvis Presley wouldn't be too sure about Priscilla romance", "title_page": "Tom Jones: Elvis Presley wouldn't be too sure about Priscilla romance", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sir Tom Jones thinks Elvis Presley “wouldn’t be too sure” about his relationship with his ex-wife Priscilla Presley.\nThe ‘She’s A Lady’ hitmaker has grown close to the ‘Naked Gun’ actress since his beloved wife Linda died of cancer last year, and while addressing rumours that they are dating for the first time, the Welsh singer has admitted he’s unsure how the late King of Rock ‘n’ Roll would feel about them having dinner and hanging out together.\nThe 76-year-old music legend said: “I really don’t know how Elvis would feel about us having dinner together - he probably wouldn’t be too sure.\n“But Elvis was a great man. It’s nice to know that Priscilla and I are still in touch after all this time.”\nSir Tom also revealed that the pair bonded over his song ‘Elvis Presley Blues’ from his 2005 album ‘Long Lost Suitcase’, but that they don’t spend much time talking about music.\nHe told The Sun newspaper: “I did a song on my last album called Elvis Presley Blues and she liked it because she said it was a beautiful tribute to Elvis and she enjoyed it.\n“Musically, that’s about as much as we talk about. But she’s been a friend of mine since 1968 when I first met her with Elvis.”\nExplaining their relationship, he added: “We were friends and Elvis passed away of course. But you know, we’ve kept in touch.\n“We’ve been in each other’s lives for years and she is one of a bunch of people that I know in Los Angeles and we do hang out.”\nTom and Priscilla, 71 - who previously dated ‘Pop Idol’ boss Nigel Lythgoe for three years and enjoyed a romance with singer Julio Iglesias - first met in 1968 while she was still married to Elvis Presley and remained friends even after the ‘Blue Suede Shoes’ hitmaker passed away in 1977.\nBut despite their long-lasting friendship, the couple want to take their new romance slowly.\nA source previously said: “Tom has had a difficult year with Linda’s death and Priscilla has been an amazing support.\n“Tom and Priscilla are courting. There is a spark between them but they are taking it slowly. It really is early days but they get on so well.”", "url": "https://apnews.com/00d3f0f8abb8467ca25a63e3c2e4ace1"}