{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:16:20", "date_modify": "2020-05-04 20:16:20", "date_publish": "2017-04-08 04:00:00", "description": "Scene…Alliance Française of Greenwich’s Focus on French Cinema’s 13th annual festival had a record-breaking number of participants in Greenwich last weekend with nearly 7,000 cinephiles watching...", "filename": "_9b94a6399a10466e89f580ce88f93f2b_1588623380.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9b94a6399a10466e89f580ce88f93f2b_1588623380.html", "title": "The Dish: Alliance Francaise sets attendance record at 13th fest", "title_page": "The Dish: Alliance Francaise sets attendance record at 13th fest", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Scene…Alliance Française of Greenwich’s Focus on French Cinema’s 13th annual festival had a record-breaking number of participants in Greenwich last weekend with nearly 7,000 cinephiles watching its offerings. The festival honored legendary director Claude Lelouch as well as a delegation of directors and actors from Québec for the FFC 2017 Tribute to the Cinéma of Québec. Bow Tie Cinemas was sold out for the weekend with a lineup of more than 20 U.S. and world premiere films including the North American premiere of Lelouch’s restored version of the classic “A Man and A Woman” (“Un homme et une femme”). Also introduced was Jerôme Salle’s biopic, “L’Odyssée,” on the life of the legendary Captain Jacques-Yves Cousteau, highlighted by a discussion with Cousteau’s daughter-in-law Jan Cousteau and coral reef expert David Kline. For more info and photos of the festival, visit www.focusonfrenchcinema.com.Out there…Stamford’s State Street Debating Society Man of the Year dinner honoring Stamford resident and attorney Tom Cassone takes place at 6:30 p.m. Tuesday at Water’s Edge (Giovanni’s II), Post Road, Darien. The event was rescheduled because of the snowstorm last month. The evening will feature an open bar, hors d’oeuvres and dinner. Guests expected for the event include Gov. Dannel Malloy, Supreme Court Justice Andrew McDonald and former State House Minority Leader Larry Cafero. Tickets are $100 per person. For tickets and more info, call 203-329-8253.Out there…Shatterproof, a national nonprofit organization dedicated to ending the devastation of addiction, is hosting its first annual gala “A Chef’s Tasting” at Richard’s of Greenwich from 6:30 to 9 p.m. April 26. The event honoring Greenwich residents Leslee and David Rogath will feature tastings from restaurants including Gaia, Barcelona, Coals Pizza Grilled and HAPA Food Truck. The organization, founded by Easton resident Gary Mendell who lost his son to addiction, will raise funds in support of its mission to help ease the destruction that addiction causes families. For tickets and more info on the event, visit www.shatterproof.org/spbenefitScene…Global Lyme Alliance’s Annual Greenwich Gala took place last Saturday at the Hyatt Regency Greenwich raising nearly $800,000 to fund research and a cure for Lyme disease and other tick-borne illnesses. More than 450 supporters attended the event including Greenwich resident, TV journalist and women’s empowerment advocate Gretchen Carlson, who served as emcee; U.S. Sen. Richard Blumenthal; U.S. Rep. Jim Himes; novelist Jay McInerney, and UFC lightweight fighter Jim Miller. The evening honored Dr. Harriet Kotsoris, GLA’s chief scientific officer and founder of its scientific advisory board, and singer/songwriter Marina Morgan, a Lyme disease sufferer who sung her hit song “Paralyzed” to a standing ovation. Global Lyme Alliance headquartered in Greenwich will hold a major fundraiser at Cipriani in New York City on Oct. 11. For more info, visit GLA.org.Out there…The Greenwich Historical Society is hosting a cocktail reception, book signing, dinner and lecture with distinguished historian, journalist and author Walter Isaacson on April 20 at Greenwich Country Club. Isaacson’s book, “The Innovators: How a Group of Hackers, Geniuses and Geeks Created the Digital Revolution,” will be the topic of discussion. Isaacson, president and CEO of the Aspen Institute, is the former chairman and CEO of CNN and editor of “Time Magazine.” He is the best-selling author of biographies that include “Steve Jobs,” “Einstein: The Life of a Genius,” “Benjamin Franklin: An American Life” and “Kissinger: A Biography.” Tickets are $375 each. For tickets and more info, visit http://www.greenwichhistory.org/adult.php#isaacson or call 203-869-6899, Ext. 15Out there…Greenwich rockers Billy and the Showmen will perform at Armonk House on Bedford, Road in Armonk, N.Y., from 9 p.m. to midnight April 15. For more info, call 914-219-5860.And that’s all for now.Later…Got a tip? Seen a celebrity? E-mail Susie Costaregni at thedish2@yahoo.com.", "url": "https://apnews.com/9b94a6399a10466e89f580ce88f93f2b"}