{"authors": [], "date_download": "2020-05-04 20:27:07", "date_modify": "2020-05-04 20:27:07", "date_publish": "2017-06-23 20:30:59", "description": "A defamation lawsuit filed by Dr. Luke against Kesha's mother has been dismissed. Music producer Luke - whose real name is Lukasz Gottwald - was suing Rosemary Patricia 'Pebe' Sebert for...", "filename": "_dd5af54022ec4ffabcc381f7599ef6ad_1588624027.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dd5af54022ec4ffabcc381f7599ef6ad_1588624027.html", "title": "Dr Luke's lawsuit against Kesha's mother dismissed", "title_page": "Dr Luke's lawsuit against Kesha's mother dismissed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A defamation lawsuit filed by Dr. Luke against Kesha’s mother has been dismissed.\nMusic producer Luke - whose real name is Lukasz Gottwald - was suing Rosemary Patricia ‘Pebe’ Sebert for defamation and tortious interference in Tennessee, United States, after he alleged she worked with her daughter to tarnish his name and reputation after they disagreed about a part of a contract.\nPebe countersued with claims of “intentional and negligent infliction of emotional distress, misrepresentations and fraudulent inducement” against the producer, which she previously claimed arose as a direct result from his alleged sexual assault on her daughter.\nHowever, she dropped her counterclaim last year and now she and Luke have released a joint statement after his suit was dismissed.\nThe statement read: “Dr. Luke vigorously disputes and denies that he ever raped Kesha Sebert, and he is asserting claims of defamation in a New York court against Kesha Sebert for making statements to the contrary, which statements Dr. Luke adamantly maintains are false.\n“Pebe admits she has no firsthand personal knowledge of the events occurring on the night of the alleged rape. Pebe was not present that night. At that time, Pebe was in Nashville, and Kesha was in Los Angeles. The dispute between Kesha and Dr. Luke about the events of that night is the subject of the New York case, and will be decided in that case. Accordingly, all parties believe it is appropriate to dismiss this Tennessee case and focus their attention on the New York case.”\nKesha has accused Dr. Luke of sexual assault and that case is set to go ahead in New York.", "url": "https://apnews.com/dd5af54022ec4ffabcc381f7599ef6ad"}