{"authors": ["Megan Ryan"], "date_download": "2020-05-04 20:17:17", "date_modify": "2020-05-04 20:17:17", "date_publish": "2017-11-07 20:08:42", "description": "Kyle Gibson was 29 years old, had an 8.20 ERA and was back in Pawtucket, R.I. Five years into his major league career without a breakout season — and only one with an ERA below 4.00 — and...", "filename": "_ef6b3033edfc4c319f20db12b712fedc_1588623437.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ef6b3033edfc4c319f20db12b712fedc_1588623437.html", "title": "Sports psychology, once viewed skeptically, enhances athletes' mental game within the game", "title_page": "Sports psychology, once viewed skeptically, enhances athletes' mental game within the game", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kyle Gibson was 29 years old, had an 8.20 ERA and was back in Pawtucket, R.I.\nFive years into his major league career without a breakout season — and only one with an ERA below 4.00 — and the Twins pitcher found himself yet again with the Class AAA Rochester Red Wings. In his first six starts of the 2017 season with the Twins, he hadn’t lasted six innings or given up fewer than three runs despite having switched up and improved his workout plan and throwing angle.\nOn the field at McCoy Stadium that May day, Gibson caught sight of a familiar shock of white hair. It was Rick Aberman, who holds a Ph.D. in developmental psychology and family therapy and has about 30 years of experience in sports psychology. A common sight at Twins batting practice at Target Field, Aberman — who has worked with the club since the early 1990s — happened to be making his once-a-month visit with the Red Wings.\n“Hey, Doc, I’d love to talk to you a little bit,” Gibson said. The next day, the two sat in the dugout ahead of batting practice, and Aberman quickly pinpointed Gibson’s troubles.\n“He was hitting the nail on the head. Everything he saw,” Gibson said. “He was like, ‘Listen, I can see you carrying the struggles. I can see it in your face. I can see it in your demeanor.’ ”\nAberman’s official job with the Twins as peak performance director, which he’s held for 10 seasons, speaks to the burgeoning role of sports psychology in helping athletes navigate the mental side of performance and achieve a competitive edge. The field first gained prominence in the U.S. about 50 years ago, but the Twins are the only team of the Twin Cities’ six major professional sports franchises to officially have a sports psychology professional on staff.\nAberman said his job is to “see things differently,” and he does a lot of watching and making himself easily accessible to players.\n“Most of the people I see are pretty successful at what they do,” he said. “They know how to catch. They know how to throw. They know how to hit. … But I’m always wondering, ‘OK, so what’s going on in their life that’s getting in the way?’ ”\nFor Aberman, it was clear Gibson’s internal monologue while on the mound was a little something like this: “OK. First and second. I need to get a ground ball right here.” And when he didn’t: “I’m a failure.”\n“I was putting so much pressure on myself with each pitch,” Gibson said. “And it just, it was starting to weigh on me.”\nThe field\nWhen Eastern European countries dominated the Olympics in the 1970s, part of the reason for their success — minus the doping — was focusing on helping athletes understand their minds. So competitors in individual Olympic sports and hockey, from which many Eastern European players came to the U.S., were some of the early adopters.\nIn Minnesota, mental skills coach Hans C. Skulstad of the Center for Sports and the Mind in Golden Valley and psychologist Justin Anderson of Premier Sport Psychology in Edina said they see hockey players the most. That’s in part because of the popularity of the sport in the state and also the financial demands of it. An hourlong session with Skulstad is about $90 while private sessions at Premier are about $175.\nCharlie Maher, sports psychologist and director of psychological services for the Cleveland Indians, is one of the more well-known names in the field and first started working with athletes 30 years ago. While he’s done most of his work in baseball, he has also worked with several hockey teams, including the Wild in the 2000s. Maher said what makes hockey and baseball especially suited for accepting sports psychology is the culture of development from the minor league systems.\nIt’s part of Major League Baseball’s most recent collective bargaining agreement, the only one of the six major U.S. leagues to include it: “Each Club shall provide Players with access, on a voluntary basis, to confidential sports psychology resources in a private space.”\nA spokesman from the Vikings said the team has contracted with a consultant for several years. Spokespeople for the other Minnesota teams said they do not regularly use sports psychology services.\nPremier Sport Psychology, which began in 2009, contracts with professional teams as well as U.S. national teams and has provided services for the University of Minnesota’s athletic department since 2011. According to Anderson, the director and founder, the clients range from athletes as young as 6 years old to NBA starters; they are all sorts of performers, from equestrian competitors to musicians.\nThe firm also employs a mix of professionals: three licensed psychologists, including Anderson, one mental game coach and one postdoctoral fellow. Essentially, only licensed professionals can call themselves psychologists. But others — those with a master’s degree in kinesiology, licensed psychologists without specific training in sports, even gurus and motivational speakers — can all work to elicit better performances, too.\nAs a way to verify the most qualified sports psychology practitioners, the Association for Applied Sport Psychology, which began in 1986, has certified more than 600 practitioners and advocates there’s room in the field for licensed psychologists and mental skills coaches alike.\n“Both sides are extremely valuable, and depending on what the client needs, both sides can provide a lot,” said Jack Watson, a former president of AASP. “They need to work well enough together so that the performance person understands where their boundaries of competency and training end to refer those people to the psychologist and vice versa.”\nThe spectrum\nOn one end of the sports psychology continuum are what people typically think of: the mental skills aspects, like on-field focus. In the middle, there are life skills: everything from nutrition to substance use. And on the other end is behavioral health, such as psychological conditions of anxiety or depression. Techniques vary as well, from therapy to visualization to heart rate variability training.\n“When people hear sports psychology, they think, like, you’re going to lay on a couch and talk about your feelings,” said Nick Rallis, a former Gophers linebacker. “But for me, it was psychological training, just another component of preparation for competition.”\nRallis took an interest in sports psychology on his own as a sophomore and started seeing Anderson through the athletic department, eventually convincing many of his teammates to do the same. Bethany Brausen, a former Gophers women’s hockey captain and now assistant coach, worked with Carlin Anderson, another of Premier’s psychologists.\n“Everything you do, whether it’s your nutrition or your workouts or your practices or your games or your team-building, everything is revolved around trying to create the best people, the best players and the best program,” Brausen said. “And the mental side of that is really the foundational piece of all of it.”\nWild defenseman Matt Dumba said his junior Western Hockey League team, the Red Deer Rebels, brought in sports psychologist Derek Robinson. And from working with Robinson from age 16 to when he joined the Wild in 2013, Dumba learned strategies he still benefits from as a pro.\n“You don’t want to be too high or too low. You really can’t let one play define your game, your season, how you’re playing, how you’re feeling,” Dumba said. “It’s not about that, and you’ve just got to trust the process, that what you’ve been doing is the right things, and believe in that.\n“He’s a great dude,” Dumba said of Robinson. “He worked with all the guys and whenever you wanted to work with him or use him. I ended up using him lots and developing visualizations before the game and what my kind of set routine was. And I’ve kind of used that ever since.”\nChristian Horn first worked with Skulstad when he was the captain of Benilde-St. Margaret’s hockey team after teammate Jack Jablonski endured a paralyzing spinal cord injury in a December 2011 game. Horn returned a few years later when re-evaluating his hockey career in the midst of transferring from the Gophers program and has continued as he pursues an NHL career.\nOne of the quirkier exercises the pair does is when Skulstad places live mouse traps on Horn’s thighs while the hockey player sits on the couch. Skulstad then throws rubber balls at Horn for him to catch, as a way to illustrate the difference between fear and danger and the body’s fight, flight or freeze response. Horn then translates his calm reaction in the office to intense on-ice situations.\n“Hans has turned my life around, not just in my sport but at home, relationships I have with my parents, my sister, everyone at my house and my family,” Horn said. “I’ve become a better human being.”\nFormer Gophers swimmer David Plummer started seeing Justin Anderson after he just missed making the 2012 U.S. Olympic team. His father had died when he was in college, and that general counseling need drove him just as much as potential performance improvements.\n“A lot of it just came in the form of relieving stress and letting me operate the way I was training myself to operate,” Plummer said. “Going into 2012, I put so much stress and ridiculously high expectations on what I was doing, that I was in a really stressed state for the month leading into Olympic trials. And it was very different leading into 2016.”\nPlummer not only made the 2016 Olympics, he won a gold and bronze medal.\nMore athletes embrace sports psychology now, but it’s been a slow acceptance.\n“Initially, there was a lot of reluctance,” Maher said. “It was perceived many times by coaches and players, athletes, as something negative, meaning you have a problem, you’re screwed up, you cannot do well and you need somebody to help. There’s still that element of a problem, and particularly in men’s sports where there’s that macho attitude.”\nMaher said many athletes are coming to see it as just another support service, like strength and conditioning or athletic training: a way, Maher said, to take “athletes who are doing very well and make them better.”\nThe results\nFor Gibson, the change came with a simple mind-set shift, moving baseball from a “need” to a “want.”\nIt took some time for that mentality to manifest on the field. Gibson did a second stint in the minors in July, but his turnaround eventually helped the Twins reach the playoffs. The Twins won Gibson’s last eight starts of the season, and Gibson finished with a 12-10 record, dropping his ERA to 5.07.\n“I was slowly over the last year and a half … losing confidence and losing the identity in myself as who I was as a pitcher, and it took a little bit to get that back,” Gibson said. “I’ve kind of felt the mentality-wise that Dr. Aberman talked about has really kind of sunk in and given me some more confidence and allowed me to look at who I am as a pitcher with a better lens and realize that one outing doesn’t determine whether I’m a good pitcher.\n“He had seen how I was reacting to certain things and saw my body language, and he probably knew what he needed to tell me,” Gibson said. “It just so happened that that was exactly what I needed to hear.”", "url": "https://apnews.com/ef6b3033edfc4c319f20db12b712fedc"}