{"authors": ["Tim Gallagher"], "date_download": "2020-05-04 20:05:20", "date_modify": "2020-05-04 20:05:20", "date_publish": "2017-11-19 09:30:00", "description": "CORRECTIONVILLE, Iowa | I reach out to Dean Norris on Tuesday, attempting to track down his wife, Kim Norris, for a warm tale about Christmas lights. I'd been told she shows her Christmas spirit...", "filename": "_2e173220b9ff480dbb1db935975c5c57_1588622720.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2e173220b9ff480dbb1db935975c5c57_1588622720.html", "title": "GALLAGHER: Family basks in the light of thanks", "title_page": "GALLAGHER: Family basks in the light of thanks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CORRECTIONVILLE, Iowa | I reach out to Dean Norris on Tuesday, attempting to track down his wife, Kim Norris, for a warm tale about Christmas lights. I’d been told she shows her Christmas spirit by lighting up their corner of Correctionville.\nKim Norris, I soon learn, is scaling back, or delaying, her light show this year. Delays occasionally arise when one’s engaged in a lifesaving battle.\nIt could also be that Kim Norris wants to cast an additional glow on Thanksgiving 2017. Her gratitude runs deep, bringing her to tears late in our interview on Thursday night.\nNorris, 47, was diagnosed with breast cancer in February, not long after doctors noticed something amiss on her second mammogram in as many months. They ordered a biopsy, which was done on the wrong spot.\nThe reason: She had cancer in two spots, within four centimeters of one another.\nThe fact another spot turned up meant the cancer spread. Thankfully, an MRI revealed it hadn’t marched beyond that location. And, it wasn’t detected in her lymph nodes.\nNorris went for a second opinion at the Avera Cancer Institute in Sioux Falls, and ended up receiving her treatment there. First, the medical staff attacked her breast cancer with chemotherapy that preceded surgery. Doing so allowed doctors to test her cancer’s response to treatment before the mass was removed.\n“We had a port placed in April and then I had a chemotherapy treatment once every three weeks for six treatments over a period of 18 weeks,” Norris says.\nBoth spots were gone by the fifth treatment. Following the sixth and final chemo treatment, Norris underwent a bilateral mastectomy and hysterectomy on Aug. 28 and began reconstruction. The combined surgical efforts lasted seven hours.\n“I had a complete pathological response,” says Norris, a St. Luke’s College grad who has worked for 12 years in two stints at Siouxland Women’s Health Care in Sioux City. “The markers, or clips, those areas had no cancer cells after surgery.”\nNorris remained in the hospital for five days, then came home to recuperate for four weeks. During that time, she developed a staph infection and had a setback beneath her right expander, which surgeons removed on Sept. 28, requiring a five-day hospital stay.\nThat area has now been given time to heal. Doctors will readdress it in surgery on Nov. 30.\nIn the meantime, Norris has kept working and tending to her family, her community, and others. She and husband Dean shake their heads in astonishment, saying they’ve been overwhelmed by support in and around Correctionville, her hometown and the couple’s residence for 18 years.\nDean, a longtime coach of several sports in the River Valley Community School District, watched as his softball players tied pink bows in their hair throughout the summer, their way of highlighting breast cancer awareness and the fighting spirit of Coach Norris’ wife.\nDean’s fellow employees at the state Mental Health Institute in nearby Cherokee hosted a benefit organized by the Cherokee County Pork Producers. Kim’s coworkers created t-shirts in her honor and sported those shirts with jeans every Thursday, Kim’s customary day off. As with most “jeans day” efforts in the workplace, a collection was taken. In each of 18 weeks of Kim’s chemo regimen, she reported to work at Siouxland Women’s Health Care on Monday and found an envelope awaiting her. Each week, the envelope contained either cash or gift cards she and Dean could use to make ends meet.\nThere was more.\n“People I wouldn’t send cards to sent me cards,” Kim says. “Does that sound bad?”\nActually, it’s what honesty sounds like.\nAnd while the couple has insurance (the price tag on just the first of six rounds of chemo came to $91,000), there were related costs that friends, neighbors, coworkers, fellow Grace United Methodist Church members and strangers helped pick up. For example, it isn’t cheap to drive back and forth to Sioux Falls and stay there multiple nights. That happened several times.\n“We’d get home, pull in and notice that someone had mowed our lawn,” Kim says.\nJust then, tears begin to trickle. She and Dean laugh, not realizing the memory of freshly cut grass would cause her to cry.\n“I couldn’t have done this without my family, either,” Kim continues. “It was hard talking to our sons, Trevor (age 20) and Carter (14) about this, but they were so strong. And Dean has been with me at every appointment, every step of the way, doing everything at home. He is my rock.”\nI’ve known Dean for many years. The Plainview, Nebraska native is a true giver when it comes to his adopted community, a coach for seemingly every season, an enthusiastic, patient pro who has touched the lives of hundreds of kids in his career, a teaching/coaching run that began at the Nebraska School for the Deaf and continued at the Boys and Girls Home in Sioux City.\nDean shrugs, deflecting praise, quickly mentioning others and now, how the small things matter even more. Like how food throughout this year would show up on their doorstep, gifts that parents of former players frequently gave to help the family.\nSo, my Christmas lights column this week didn’t pan out. The better story did. Kim Norris remains cancer free. Her Facebook posts detailing this battle prompt friends to schedule mammograms they otherwise may have skipped. “I could not have had a better outcome,” she says. “If I can help others, this is worth it.”\nAfter a pause, she mentions her parents, Phil and Edna Sevening, of Correctionville. They, too, have been at her side every step of this journey. And, brother Rob Sevening, who resides in Tyler, Texas, shaved his head to show his support before making an 880-mile trip to join her at a chemo treatment.\nKim searches for another image on her phone, scrolling past group photos showing the River Valley softball players, her coworkers, her prayer warriors and a pink wristband bearing the message, “Hope for Kim.” She finds the picture she seeks; it shows 10 of her life’s biggest treasurers standing at her side, 11 wide smiles celebrating Kim’s ringing of the bell to conclude her last chemo treatment.\nThis breast cancer survivor remains thankful for her health; thankful for the love she’s been shown; and committed to a newfound spirit of thanksgiving, a light she says that has changed her and her family.\n“We will do things differently,” she says.", "url": "https://apnews.com/2e173220b9ff480dbb1db935975c5c57"}