{"authors": ["Dave Kamper", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:26", "date_modify": "2020-05-04 19:59:26", "date_publish": "2017-01-17 00:00:00", "description": null, "filename": "2017_01__1588622366.html", "image_url": "https://images.jacobinmag.com/2017/01/17233032/seiu-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_01__1588622366.html", "title": "Labor’s Narrow Window", "title_page": "Labor’s Narrow Window", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Now is not the time to tighten our belts. Labor must invest in member power now if we’re going to save ourselves later.\nThis is an understandable decision — a Trump presidency will undoubtedly be disastrous for both workers’ lives and union budgets. But signaling such a retreat before Trump is even in office is also a significant strategic error and one that will do great harm to unions’ ability to fight for working people in the face of right-wing headwinds.\nAccording to a recent report , the Service Employees International Union is implementing an immediate 10 percent cut in spending, rising to 30 percent by the beginning of 2018. Bloomberg’s Josh Eidelson writes that SEIU president Mary Kay Henry told staffers in a memo that the assaults on labor expected of a Trump presidency and an anti-worker Congress “require us to make tough decisions that allow us to resist these attacks and to fight forward despite dramatically reduced resources.”\nIn my estimation, we have about eighteen months until the worst comes. None of the attacks unions will face amount to a death sentence, but they will hurt. How much they hurt will depend on how ready we are to face them.\nThe question before us, then, is: how much stronger can unions make themselves before the full force of the onslaught hits us?\nAny new Friedrichs decision will have to wait until a new Supreme Court justice is appointed and confirmed, and then the right case needs to find its way to the Supreme Court docket (the likeliest candidate, Janus v. AFSCME , is still awaiting a hearing before the seventh circuit Court of Appeals). The Senate Democrats may delay for a while and could filibuster a national right-to-work law.\nIt will take a while for the Trump administration and its congressional allies to get things into place and implement their agenda. It will take months, even years, for a new NLRB to begin to roll back recent pro-worker decisions, just as it took a pro-worker NLRB years to undo the work of the Bush administration.\nWe do have a critical weapon here: we know what’s coming. We know exactly what is going to happen to the working class under President Trump: an assault on worker rights the likes of which we have never seen. But we also know this: the American labor movement will not cease to be on January 20. And what we do right now will affect just how brutal that assault will be.\nTime to Spend\nTo make ourselves stronger, we must spend our resources. Union power comes from organized money and organized people; now is the time to spend the former to increase the latter.\nSEIU is right to be worried that the financial resources of unions are going to be constrained in the coming years. There will indeed be a time when unions at all levels need to have hard conversations about where to spend precious dollars and what to cut (conversations that unions should have been having all along).\nOf course, this us not a surprising decision from SEIU, given their model of organizing in recent years. While many SEIU locals are doing innovative organizing work, a key national strategy of SEIU has been political deal-making with friendly state governors to win organizing rights for large groups of home-based caregivers. While this has resulted in winning unions for thousands of workers, such a political strategy will bear little fruit in the face of GOP dominance in both federal and state governments.\nWhere SEIU is wrong is in thinking that saving a few dollars now will make any genuine difference down the road. SEIU’s decision to cut its budget now suggests that it believes holding onto money is more important than using the money to build power. The force multiplier for unions is, and always has been, people power. This isn’t an expression of sentiment, but of cold logic. Unions can never match global capital dollar for dollar. When we win, we do so by using our financial resources to leverage greater member power.\nSEIU’s now-public decision to slash its budget will send a message to union leaders around the country that austerity — not building power — is the order of the day.\nWhen unions spend resources to build member power, amazing things can happen. The Chicago Teachers Union is nearly everyone’s favorite example of a union that has turned itself around and built real power in the workplace. That didn’t just happen — once their rank-and-file caucus took power, CTU members made conscious efforts to use their dues income to build member power. They created an organizing department and spent money to staff it with good organizers. They doubled their money for member training.\nThe CTU wasn’t just transformed through a change of mindset by its leaders and activists — they put their money where their mouth was, and it paid off.\nNow is the time for unions to spend. The highest priority for spending during these precious months must be worker leadership, development, and education. Sooner or later unions are going to have fewer paid staff, and member-leaders will need to be able to do more of a union’s routine tasks on their own.\nMember-leaders can and in many places in the United States do handle grievances, negotiate contracts, and do all the other things that staff normally do. But in many unions, especially public-sector unions in blue states that collect fair-share fees and therefore have plenty of money, it is common practice for those roles to be played by staff. If labor is to avoid complete decimation under Trump, now is the time to educate and train union members themselves to carry out that activity.\nUnions often do member training on the cheap. Now is the time to do more. Sometimes members can’t afford to take time off of work to get union training; unions will need to pay members for their time. Unions will need to spend resources on transportation, child care, and food to set up training opportunities. Those costs add up, but the money needs to be spent.\nUnions should, perhaps paradoxically, prepare for a future with fewer union staff by hiring more staff in the short term. When I became a union staffer, I was told repeatedly that it was my job to work myself out of a job. Many union staff believe this, but the inertia of established institutions and the pressure to expand a union’s bureaucratic structures makes this easier to say than to do. Adding staff is an easy way for a union to feel like it has added capacity, but that will only be successful in the long term if “working yourself out of a job” ceases to be a cliché.\nMany people with organizing experience and leftist political views are looking for work in the wake of the 2016 elections. They should be hired into the labor movement to teach organizing skills to members.\nThis is also the time to work on the unglamorous aspects of union infrastructure. Does a union have the membership database technology it needs? Does it have people who are trained to get the most out of that database? How much is a union spending on rent, and is it worth it to buy property so as not to have to pay rent when income flows are lower? Is a union making do with aging technology, which will only cost more to replace the longer it waits?\nIt would also behoove unions to raise dues rather than cut back. Call it a crisis levy or a solidarity assessment. We need everything we can raise and spend to take maximum advantage of the window before us. Raising dues would also send a powerful message to both friends and enemies of the labor movement that we aren’t backing down or knuckling under — we’re gearing up for the struggle, and we intend to win.\nThis is easier said than done. Too many unions have (consciously or not) adopted neoliberal framings of union dues as a cost that should be minimized rather than a tool to build power. These unions often brag about keeping dues low, seemingly unaware that wanting a union to use its resources efficiently isn’t the same as wanting a union to have fewer resources. These unions will have a hard time doing an about-face and changing their tune on dues.\nThis is why SEIU’s decision to cut can trigger a national negative feedback loop that spirals down to disaster. According to their LM-2 filings with the Department of Labor, SEIU has more than $150 million in cash and investments. Once the new Friedrichs hits, those assets are going to trickle away. Is it better to let them drip out year after year, as the union fights an increasingly desperate rearguard action to stay alive, or is it better to spend it now to build power, when power can still be built?\nAround the time of Governor Scott Walker’s anti-union “budget repair” bill, I knew organizers in Wisconsin who asked what they could have done between the November 2010 elections and the introduction of Act 10 in February 2011. There was much they could have done, but labor leadership in Wisconsin didn’t believe the worst was going to happen. Nationally, we know for certain that it is.\nWe need to act while the window of opportunity is still open. We have precious months in which to build power to fight.", "url": "https://www.jacobinmag.com/2017/01/labor-trump-unions-right-to-work-budget-seiu-dues/"}