{"authors": ["Jennifer Harper The Washington Times"], "date_download": "2020-05-04 20:28:46", "date_modify": "2020-05-04 20:28:46", "date_publish": "2017-01-19 18:45:02", "description": "The mainstream news media adored President Obama for eight years, and they continue to adore him as he leaves office. Incoming President Donald Trump, however, has faced both contempt and critical...", "filename": "_5f9f75a18868b6479dbf86915c73f696_1588624126.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5f9f75a18868b6479dbf86915c73f696_1588624126.html", "title": "Trump, Twitter shift media power balance", "title_page": "Trump, Twitter shift media power balance", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The mainstream news media adored President Obama for eight years, and they continue to adore him as he leaves office. Incoming President Donald Trump, however, has faced both contempt and critical coverage from journalists and broadcasters throughout his campaign and the tradition continues. There’s no press honeymoon now and not much chance for one in the future.\nOver 90 percent of broadcast coverage about Mr. Trump was negative, according to an extensive analysis of major network stories during a 12-week period at the height of the campaign, many based on narratives established by the Democratic Party itself. Mr. Trump’s personal wealth, tax returns, “sexist rhetoric” and immigration policies were under constant scrutiny.\n“The public now knows it is not getting news from the news media. It’s getting leftist propaganda,” said Brent Bozell, founder of the Media Research Center, the conservative press watchdog that conducted the study. “The liberal media were the second-biggest losers on election night. But as opposed to Hillary Clinton, their loss continues. Their credibility is shot, quite possibly for good.”\nDuring his 17-month quest for the White House, Mr. Trump constantly pushed back against journalists and news organizations, lashing out on social media, specifically citing “fake news” and “hit jobs” in the press right up to his inauguration. Aides to the incoming president also have discussed moving the traditional press room out of the White House to a larger, less-rarefied location next door, and Mr. Trump said he would have veto power over the journalists who populate it.\nSocial media, including Mr. Trump’s vaunted Twitter account, have changed the balance of power.\n“Our new president is a master of communicating directly with the world in his own way, and social media enables him to bypass the press,” said veteran pollster John Zogby. “Meanwhile, the mainstream press is out of the loop, suffering from fewer viewers and subscribers, and threatened by serious distrust from the public. Ironically, the media seem to need Trump more than vice versa because he is such good drama and copy for them.”\nMr. Zogby sees some historical parallels in Mr. Trump’s media strategy employing new communication channels.\n“He communicates via Twitter just like Presidents Warren Harding and Franklin Roosevelt used the radio and John F. Kennedy mastered the art of television. New medium, new world. I am troubled by his thin skin and his potential capacity to alienate world leaders, but as he himself would remind us he won and things are different.”\nAmericans did not overlook all that Trump-bashing.\nMultiple Rasmussen Reports surveys conducted throughout the campaign revealed that, on average, six out of 10 voters said the news media were setting the agenda for the election; close to 70 percent said the press tried to help their favored candidate Mrs. Clinton. A Gallup poll confirmed the trend just three days before the election.\nBut the manipulations took their toll on the mainstream press’ credibility.\n“Americans’ trust and confidence in the mass media ‘to report the news fully, accurately and fairly’ [have] dropped to [their] lowest level in Gallup polling history, with 32 percent saying they have a great deal or fair amount of trust in the media. This is down 8 percentage points from last year,” Gallup reported.\nMr. Trump’s vigorous, candid counterattacks against media coverage and his campaign foes could very well have helped him win the election, however. Political style in troubled times is a factor, according to academic research.\n“Potential voters who see the nation as being in dire economic straits view a presidential candidate as more presidential when he or she uses high-intensity, emotional language,” noted a study from Ohio State University.\nIt all boils down, said lead author David Clementson, “to which candidate does better matching his or her language intensity with their audience.”", "url": "https://apnews.com/5f9f75a18868b6479dbf86915c73f696"}