{"authors": ["Dave Matter St. Louis Post-Dispatch"], "date_download": "2020-05-04 20:06:24", "date_modify": "2020-05-04 20:06:24", "date_publish": "2017-12-29 06:15:00", "description": "HOUSTON • Bowl games can be wily, unpredictable and painstakingly long, and that was absolutely the case Wednesday in Houston, where during the three-hour, 35-minute Texas Bowl, Missouri rarely...", "filename": "_994890adfe9a40d6835a922e044833ab_1588622784.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_994890adfe9a40d6835a922e044833ab_1588622784.html", "title": "Offensive struggles sank Mizzou's chances in bowl game", "title_page": "Offensive struggles sank Mizzou's chances in bowl game", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HOUSTON • Bowl games can be wily, unpredictable and painstakingly long, and that was absolutely the case Wednesday in Houston, where during the three-hour, 35-minute Texas Bowl, Missouri rarely looked like the team that won six consecutive games to earn a spot at NRG Stadium against Texas, a middling team from the Big 12 that capitalized on enough Mizzou mistakes to win 33-16.\nIn the program’s first bowl loss since 2010, the Tigers’ unstoppable offense stopped early and often and their defense shook off early blunders to play one of its best games in years. That wasn’t the blueprint through MU’s second half of the regular season. This time, though, Barry Odom’s defense forced Texas (7-6) to punt on 11 of 14 possessions, consistently penetrated the line of scrimmage and made stops when it mattered as the Longhorns converted just six of 18 third downs. After a miserable start to the season, Mizzou’s defense made strides during its six-game winning streak but suffered a relapse in the regular-season finale at Arkansas. Though the Tigers (7-6) didn’t force a turnover for the first time in three months, Odom’s defense played well enough to win Wednesday’s game.\n“They don’t get enough credit for how good they are on defense,” Texas coach Tom Herman said. “But I think if you look at the numbers and that six-game winning streak they had, you know their defense played lights out. They finished the year 13th in tackles for loss, and I think 23rd or 24th in sacks. That’s a really good defense.”\nBut not good enough to overcome Mizzou’s most troubling unit Wednesday, an offense that rarely created its own fortune. Backed up to its own goal line most of the night, the Tigers weren’t operating with a full playbook — not with a condensed pocket for Drew Lock to buy time for deep routes to develop and Texas blitzers invading his space in a hurry.\nFor the second straight year Mizzou led the Southeastern Conference in yards per game, but that production came under the guidance of since departed offensive coordinator Josh Heupel and offensive line coach Glen Elarbee, who left for Central Florida shortly after the Texas Bowl matchup was set. Odom handed the play-calling to tight ends coach Joe Jon Finley for the bowl game, but with Texas punter and game MVP Michael Dickson regularly burying the Tigers inside the 10-yard line, Finley needed a reliable running game to create space for the offense. That became Mizzou’s undoing. The Tigers attempted 16 running plays inside their own 20-yard line and averaged just 3.1 yards per carry — and 15 of those yards came on the final play of the first half. Playing against a three-man defensive line most of the night, the offensive line rarely created alleys for MU’s running backs. Mizzou also committed four costly false start penalties inside its 20.\n“When you’re sitting on the 5-yard line the playbook thins down to probably five to 10 plays,” Lock said. “And they’re definitely not shots downfield. You feel for (Finley) a little bit because that’s not a representation of how good of a coach he is.”\n• MIZZOU TALK: Sound off about the 2017 season\n• EYE ON THE TIGERS: Dave Matter’s Mizzou blog\n• SCHEDULE/RESULTS: 2017 Mizzou football\n• STANDINGS: SEC football\n• PODCAST: Dave Matter in ‘Eye On The Tigers’\nThe performance might have underscored the importance of Heupel, who took over as UCF’s head coach Dec. 5 and hired away Elarbee to coach his O-line. It’s unclear if either coach was given the chance to stay with the Tigers through the Texas Bowl, but that didn’t stop defensive end Marcell Frazier from pinning Mizzou’s problems on the departed coaches.\n“Realistically, Heupel left us in a bad position,” Frazier said. “It is what it is. And Elarbee left us in a bad position. As men they have to look in the mirror. They let a whole bunch of teenage boys down, 18- and 19-year olds. They left and they have to do what’s best for their family, but I think it showed up a little bit today. We were doing things (on offense) we haven’t done since maybe the Auburn game. It showed up.”\nTo beat Missouri’s balanced attack, Texas flooded the secondary with defensive backs, usually two deep in coverage to guard against the long ball, and used their five-man fronts to outmuscle MU’s five- and six-man protections against the run and the pass. The Longhorns consistently stonewalled Mizzou’s running game, holding the Tigers to 3.6 yards per carry on 34 attempts. Only two opponents held Mizzou to a worse rushing average all season: Purdue (2.9) and Georgia (2.5).\nTexas also forced three turnovers: Lock’s fourth-quarter interception and fumbles by Lock, tailback Ish Witter and tight end Albert Okwuegbunman. Texas also tallied a safety when center Trystan Castillo sailed a shotgun snap into the end zone.\nIt was the fourth game under Odom that Mizzou finished minus-4 in the turnover margin, following this year’s game against Auburn and 2016 games against Tennessee and Georgia. Not surprisingly, Mizzou lost all four.\n“I don’t know if we were too uptight,” Odom said. “I think that we were very anxious to go play and settle down a little bit.”\nMizzou’s offensive struggles lead into the offseason’s two biggest plot points: Lock’s NFL draft decision and Odom’s choice to run the offense. Lock, advised by the NFL’s Draft Advisory Council to return to school for his senior season, wants to see whom Odom hires as coordinator before making his decision. He has until Jan. 15. Both unanswered questions could be resolved next week.", "url": "https://apnews.com/994890adfe9a40d6835a922e044833ab"}