{"authors": ["Mick Lasalle"], "date_download": "2020-05-04 20:28:55", "date_modify": "2020-05-04 20:28:55", "date_publish": "2017-01-04 14:57:17", "description": "You probably know what kind of experience to expect from “Hidden Figures,” so the task of this review is more or less to tell you that you’re right. And that’s mostly good news. The...", "filename": "_255fefaf61ff4b40b18f41cb25b09338_1588624135.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_255fefaf61ff4b40b18f41cb25b09338_1588624135.html", "title": "‘Hidden Figures’ shines a light on NASA’s behind-the-scenes heroes", "title_page": "‘Hidden Figures’ shines a light on NASA’s behind-the-scenes heroes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "You probably know what kind of experience to expect from “Hidden Figures,” so the task of this review is more or less to tell you that you’re right.\nAnd that’s mostly good news.\nThe film is old-fashioned in a good way, classical and well-acted, and the fact that it has no surprises keeps it from being disappointing even as it keeps it from being great.\nIt tells the story of three black women who worked at NASA in the very early days of the 1960s, back when the Soviets were outpacing us in the race for the moon. It takes place, not in Houston, but in NASA’s Northern Virginia headquarters, which is important, as this was the South before civil rights.\nIn a very early scene, the three women, stuck on the side of the road with car trouble, are approached by a white highway patrolman. The dynamic is positively weird — the women have to practically do everything but kiss his ring — and it would be nice to be able to say that, more than 50 years later, that kind of tension is foreign to our modern understanding.\nAll three of these real-life women all made contributions to American space exploration, but Katherine Johnson (Taraji P. Henson) is at the center of the film. A math prodigy from childhood, she was one of a team of people assigned to double-check NASA’s mathematical calculations.\nGradually, she began to stand out from the pack and assume greater importance, though at the time no one expected genius in the form of a woman, or a black person, or most especially a black woman, so nothing was easy for her.\nDorothy Vaughan (Octavia Spencer) was the leader of a computing team, back when the word “computers” referred to people who did computations. Eventually, she would become an expect in computers as we now know them. And Mary Jackson (Janelle Monae) became an aerospace engineer.\nBecause it’s based on fact, “Hidden Figures” is not as immediately satisfying as a fictional version of this story might have been. For one thing, the women remain as “hidden figures.” Though they achieve professional respect and security in their positions, people don’t fall over themselves to tell them how right and wonderful they are, and the movie doesn’t overestimate their impact. “Hidden Figures” is quietly, cumulatively, calmly gratifying.\nTheodore Melfi (“St. Vincent”), who directed and co-wrote the film, based on the book by Margot Lee Shetterly, does a nice job of organizing and telling a complicated story, involving three women and their personal and professional lives.\nWhere the movie lets us down is in the matter of tone. It feels light — at times, too light — and so we get a scene of the three women dancing around the house, which is obligatory in all Hollywood movies dealing with female friendship.\nMore problematic is the recurring scene of Katherine having to run to the bathroom. Apparently, in the division in which Katherine worked, there were no “colored” bathrooms, and so she had to walk (or run) a half mile every time she needed to relieve herself. But the movie underscores these scenes with music suggesting that this situation is comic or at least farcical, when it’s neither.\nHenson, Spencer and Monae all excel, conveying the intensity and worthiness of these women’s ambitions even as they deal (almost in a matter-of-fact way) with obstacles that are maddening. Through them we see the shadows of thousands and millions of others in our history, whose gifts dried up unused and unrecognized. The waste is painful to contemplate, and so it’s right that movies to celebrate where they can.\nKevin Costner is nicely cast as Al Harrison, Katherine’s boss, who is mostly too busy to differentiate the very smart people on his staff from the flat-out geniuses. Costner is a useful actor to have in period films, because he can slip into that mid-century vibe like nobody else.\nIt’s more than just short hair and a white shirt, but rather a whole way of being, an attitude, the life history. In a way, he’s the most authentically 1962 thing in the movie.\nSpeaking of 1962, the late John Glenn missed seeing “Hidden Figures” by a few days, and that’s too bad, especially since they got a 28-year-old actor (Glen Powell) with a full head of hair to play Glenn back when he was a bald 40-year-old. And that’s the beauty of film in a sentence. If nature won’t give you a full head of hair, Hollywood can at least correct the oversight.\nRunning time: 127 minutes\nMPAA rating: PG (profanity)", "url": "https://apnews.com/255fefaf61ff4b40b18f41cb25b09338"}