{"authors": ["Chris Villani"], "date_download": "2020-05-04 20:09:31", "date_modify": "2020-05-04 20:09:31", "date_publish": "2017-01-02 09:15:49", "description": "DirecTV customers awoke to a 2017 without one of their local channels yesterday after negotiations between Hearst Television and the broadcast satellite service provider broke down, leaving...", "filename": "_cfb5141b6f674fb49874fd5261e1ed22_1588622971.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cfb5141b6f674fb49874fd5261e1ed22_1588622971.html", "title": "Deal dispute forces WCVB off DirecTV", "title_page": "Deal dispute forces WCVB off DirecTV", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DirecTV customers awoke to a 2017 without one of their local channels yesterday after negotiations between Hearst Television and the broadcast satellite service provider broke down, leaving Channel 5 in the dark on DirecTV platforms beginning at 12:01 a.m.\n“We have made significant investments to deliver top-tier programming to our viewers and DirecTV is seeking the right to carry our stations at below market rates, which is neither fair nor reasonable,” WCVB President and General Manager Bill Fine said in a statement. “We regret the inconvenience DirecTV’s demands have imposed on its subscribers, and we will keep you fully informed of developments.”\nThe carriage agreement expired at the stroke of midnight on New Year’s Eve and Fine stressed the station has not been “blacked out.”\n“You may continue to receive our station for free, over the air, and, where available, from your local cable or satellite operators,” he said.\nStill, losing DirecTV viewers can impact the station’s bottom line, Boston University communications professor Tobe Berkovitz told the Herald.\n“When you’re having your ratings count towards how much you can charge for your ad revenue, if all of a sudden you’re losing a decent chunk of your audience, it can’t help,” Berkovitz said. “This is the modern world of television where stations, or the station ownership groups or the networks, battle it out with the providers.”\nWhile WCVB’s network, ABC, does not have any major NFL or college football events coming up, the return of new episodes for network comedies and dramas may be enough to fire up consumers to push both sides to reach a deal.\n“Everybody sort of flexes their muscles and you find out who has the biggest muscles,” Berkovitz said. “But these things tend to get worked out.”\nTransmitted out of Needham, WCVB is the flagship station for Hearst Television and broadcasts more than 36 hours of locally produced news each week.", "url": "https://apnews.com/cfb5141b6f674fb49874fd5261e1ed22"}