{"authors": ["Joel A. Erickson", "Jerickson Theadvocate.Com"], "date_download": "2020-05-04 20:04:40", "date_modify": "2020-05-04 20:04:40", "date_publish": "2017-11-19 22:42:00", "description": "Tommylee Lewis hadn't returned a punt all season. The offseason arrival of Ted Ginn Jr. had taken that job from Lewis, who'd offered glimpses of brilliance in the role as a rookie but had...", "filename": "_082babc48b6e4ec8bdc427aa18f3b7a2_1588622680.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_082babc48b6e4ec8bdc427aa18f3b7a2_1588622680.html", "title": "Tommylee Lewis makes a big impact for Saints on first punt returns of season", "title_page": "Tommylee Lewis makes a big impact for Saints on first punt returns of season", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tommylee Lewis makes a big impact for Saints on first punt returns of season\nTommylee Lewis hadn’t returned a punt all season.\nThe offseason arrival of Ted Ginn Jr. had taken that job from Lewis, who’d offered glimpses of brilliance in the role as a rookie but had also been frustratingly inconsistent.\nFumbling problems by Ginn put Lewis under the lights against Washington, and with the game hanging in the balance, Lewis responded with two big returns that played a key role in the Saints’ improbable 34-31 comeback at the Superdome.\n“Those were huge for the team,” Lewis said. “I secured the ball, most importantly, and got positive yards for the offense.”\nLewis found out earlier this week that he’d be replacing Ginn as the punt returner. Despite Ginn’s experience, the Saints ranked 30th in the NFL in punt returns entering the game, and New Orleans decided to make a change.\n“It was a gut (decision),” Payton said.\nLewis was given free rein on returns, both kickoff and punt. The results were pedestrian on kickoffs — Lewis averaged 20.7 yards on three returns — but paid off in a big way on punts.\nHe got his first chance in the fourth quarter with Washington leading 24-13, and Lewis ripped off a 24-yard return, the longest for the Saints all season to set up a Wil Lutz field goal.\nLewis brought his second return chance back 14 yards in overtime to help set up the game-winning field goal.\n“We were going to be aggressive today in the return game, kickoffs, we brought them out regardless,” Payton said. “Late, that last one was huge.”", "url": "https://apnews.com/082babc48b6e4ec8bdc427aa18f3b7a2"}