{"authors": ["Jonah Walters", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:13", "date_modify": "2020-05-04 19:51:13", "date_publish": "2017-03-17 00:00:00", "description": null, "filename": "2017_03_augusto-sandino-nicaragua-somoza-us-imperialism-sandinista_1588621873.html", "image_url": "https://images.jacobinmag.com/2017/03/17234234/o-sandino.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_03_augusto-sandino-nicaragua-somoza-us-imperialism-sandinista_1588621873.html", "title": "Remembering Sandino", "title_page": "Remembering Sandino", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nCome, morphine addicts, come and kill us in our own land. I await you before my patriotic soldiers, feet firmly set, not worried about how many of you there may be. But keep in mind that when this happens the Capitol Building in Washington will shake with the destruction of your greatness, and our blood will redden the white doom of your famous White House, the cavern where you concoct your crimes. –Augusto César Sandino, San Albino Manifesto. 1927. On February 21, 1934, thirty-one years to the day before Malcolm X was gunned down at Manhattan’s Audubon Ballroom, a similarly historic assassination took place in a much smaller country a few thousand miles to the south. That evening, General Augusto César Sandino attended a banquet held by the new president of Nicaragua to celebrate the end of a decades-long civil conflict. Presumably, Sandino felt confident that his movement’s success had secured him a degree of influence in the recently reunified nation. After all, he was visiting the presidential palace to further negotiate the terms of an ongoing ceasefire that the new government had eagerly endorsed. For the previous six years, Sandino had led a violent insurgency in the Nicaraguan highlands. Derided as a bandit, he was in fact the head of an internationally recognized revolutionary movement against the prolonged American occupation. And, in 1933, his rebels succeeded — a civilian president took office following a smooth election, the last Marines withdrew, and a new era of peace and political stability seemed imminent. In the decades leading up to that February evening, twin assailants had menaced Nicaragua. On the one hand, the people faced the homegrown threat of petty despotism, embodied in that era by Anastasio Somoza, an American ally who commanded a domestic paramilitary closely aligned with the Marines — the despised National Guard. Meanwhile, the specter of Yankee invasion cast a constant shadow over the nation’s internal affairs. North Americans had maintained a consistent presence in Nicaragua since the middle of the nineteenth century, when Tennessean William Walker, together with his filibuster militia, exploited a civil war to seize control of the country, briefly reinstitute slavery, and divert revenue from Nicaragua’s lucrative transisthmian corridor into his own coffers. Walker met his death before a Honduran firing squad in 1860, but the North Americans kept coming. Wealthy investors coveted Nicaragua’s topography: its wide lakes and deep rivers seemed perfectly suited for an interoceanic canal . Prospectors launched a number of expeditions in the latter half of the nineteenth century, dreaming of bisecting the nation in the service of the booming North American shipping industry. But when the United States selected a different location for its Caribbean canal in 1903, Nicaraguan president José Santos Zelaya asked overseas financiers to fund a Nicaraguan shipping route. Irate, the United States soon dispatched Marines to assist in Zelaya’s ouster, and in 1912 the US military established a permanent presence in Nicaragua, presumably to protect the newly completed Panama Canal from the possibility of a foreign-financed competitor. This occupying Marine force remained in place until Sandino’s army of anti-imperialists sent them running twenty-one years later. It’s hard to overstate the historical significance of Sandino’s insurgency, both for the region and for the world. For one thing, it was among the earliest examples of successful guerrilla warfare, inspiring countless revolutionary movements to adopt similar tactics all over the world, especially in Latin America. For another, it provoked the United States to use aerial bombardments against a clandestine movement — a first in world history and a harbinger of the horrors later rained down on civilians in countries like Vietnam, Afghanistan, and Yemen. It also produced the Small Wars Manual, a counterinsurgency document devised by Marine commander Mike Edson, who led the American effort to neutralize Sandino’s army; this tactical guide to counterinsurgency has been repeatedly repurposed in the years since it was first developed, most recently by General David Petraeus in Iraq. Finally, and most importantly for his fellow Nicaraguans, Sandino’s example inspired the Sandinista National Liberation Front (FSLN), the leftist guerrillas whose successful revolution in 1979 terrified Ronald Reagan and galvanized the international left in a time of deep crisis and confusion. But on that evening in 1934, Sandino’s legacy remained ambiguous. As he sat at the bargaining table surrounded by old foes and erstwhile allies, the general had no way of knowing his silhouette would one day dominate the Managua skyline. Nor could he have imagined that his signature wide-brimmed hat would become the emblem of a very different Nicaraguan revolution. What happened immediately after the banquet helped transform Sandino from an unlikely local hero into an enduring national icon. We don’t know all, or even many, of the details. We know Sandino passed through the gate of President Juan Bautista Sacasa’s Managua palace in the company of several associates, including his brother Socrates. We know Somoza’s private army, the National Guard, promptly intercepted their vehicle. We know — or rather, we think we know, based on turncoat testimony — that the Guardsmen took the revolutionaries to a crossroads, bound their hands, and shot them each in the head. And we know that a detachment of National Guardsmen under the command of one Rigoberto Duarte — whose son would serve in the government of conservative president Arnoldo Alemán (1997–2002) — took Sandino’s corpse to a poor neighborhood in Managua and buried him in wet dirt and sewage. Here’s where facts start to blur into folklore. One optimistic yarn says that the poor residents of the Larreynaga neighborhood exhumed Sandino’s body and transported it elsewhere for a hero’s burial — perhaps to the rocky highlands of the Segovias, where he had made his home and waged his war. But the more common tale is a dark and sour one: it holds that the assassins decapitated the slain revolutionary and, on Somoza’s orders, sent his head to the Marines as a gesture of friendship and goodwill. Whatever happened that night, the murder had immediate effects on the country. The National Guard launched a massive offensive against Sandino’s loyalists, annihilating what remained of his movement just as it was poised to begin a radical experiment in decentralized self-government in the agrarian Río Coco region. Then the militia began to operate with impunity throughout the country; soon their power outstripped that of President Sacasa’s civilian government. Two years after Sandino’s murder, the National Guard deposed Sacasa and installed Anastasio Somoza, inaugurating a brutal family dictatorship that would endure for more than forty years. A new era had come about, but it was precisely the future Sandino’s sympathizers had most feared.\nA Changing World From the time of his birth until his death thirty-nine years later, Augusto Sandino’s world was in flux. Imagine the Central American isthmus at the dawn of the twentieth century. In the Guatemalan highlands, a peculiar hybrid of American-style plantation slavery and feudal landlordism persisted: indigenous workers toiled on massive coffee farms for the benefit of criollo elites. Military men, burdened by a worldview equal parts Napoleon and Quixote, passed the presidency around like a disease, occasionally getting assassinated for their efforts. A planned national railroad languished unfinished, ensconced in overgrowth sixty miles from its destination in the capital city. Meanwhile, a common quip derided Honduras as too poor even for an oligarchy, and in some ways it was true — while an ascendant bourgeoisie based in the provincial city of San Pedro Sula made a good living exporting bananas, deprivation remained widespread and severe. As the export economy grew, malnourished peasants flocked to banana-producing coastal regions to beg for work. But even for its well-fed beneficiaries, the banana bonanza soon turned out to be a Trojan horse: American troops landed in 1903 — the first of seven invasions in twenty years — and the term “banana republic” entered the international diplomatic lexicon. Further to the south, the thin tendril of land we now recognize as Panama — then still part of Colombia — extended unmolested from the southern border of Costa Rica to the swollen hump that shapes the top of South America. The pressure of plummeting coffee prices caused turmoil all over the region, but perhaps nowhere more acutely than here, where a bloody civil war inaugurated the new century. The United States salivated on the sidelines, watching the melee from Caribbean battleships and still dreaming of a canal-shaped sliver of land. This was the world Augusto Sandino entered in 1895, the unwanted son of a Spanish creole and his indigenous servant. By the time of his assassination, the region had been transformed. By then, Guatemala was ruled by a US-supported strongman, a devotee of Franco and Mussolini who shrewdly turned the nation’s “vagrant” and indigenous populations into reserve armies of forced labor; soon, roads and train tracks crisscrossed the mountainous nation, and a US air base followed shortly after. The revolution in Mexico terrified regional elites with its shades of communism and inspired workers’ strikes and peasant protests across the region. Meanwhile, Panama emerged as a US client state par excellence, a corridor for maritime vessels piled high with North American wealth, well-guarded by Yankee soldiers. To understand Sandino’s story, we need to situate him within this dramatic story of epochal transformation, especially as it developed in Nicaragua. For most of the nineteenth century, Nicaraguan elites attached their hopes for a prosperous future to the dream of a North American canal. William Walker’s purloining of the presidency in Nicaragua (in fact, dissatisfied with the presidency, he ultimately crowned himself king) gave the Liberal and Conservative parties the common cause they needed to end their civil war in 1858. From then until 1893, a power-sharing agreement allowed both factions to coexist in relative harmony. Of course, it didn’t hurt that the rivals were united in their shared reliance on North American trading partners, not to mention their common taste for luxury imports. Nicaragua remained impoverished. Nevertheless, a healthy layer of both upwardly-mobile merchants and entrenched oligarchs prospered. Their enterprises produced a lot of coffee, some beef, some rubber, some sugar, and traded with national neighbors like Costa Rica as well as with financial powerhouses on the New York Stock Exchange. The United States had its fingers in the national stew as well, ensuring unrestricted access to cheap Nicaraguan goods for its merchants. This relationship, which united American companies and Nicaraguan elites in the country’s exploitation, led to the agro-export boom of the 1870s and 1880s. Throughout it all, domestic elites eagerly awaited the massive influx of North American investment sure to accompany the construction project they all believed was imminent. This aspiration contributed to a healthy dose of national exceptionalism in Nicaragua. An excellent book by historian Michel Gobat describes the thorough Americanization of the nation’s ruling elite during this time, who pursued a project of liberal state-building modeled on the United States while indulging their Anglophilic tastes in luxury goods and culture. Eventually, the perceived excesses of North American bootstrap ideology would so alienate the most conservative oligarchs that they would turn on both the United States and capitalism, aligning with Sandino’s anti-imperial rebellion while advancing their own vision of a restored premarket hierarchy. But for now, Nicaragua’s ruling class was cocooned in its sense of predetermination, its certainty that unprecedented prosperity would soon arrive in the form of a foreign waterway. Soon, however, the conflict in Panama led to the infamous Hay-Bunau-Varilla Treaty and to the establishment of the US canal zone in that country. Suddenly stripped of a dream that had been incubating for generations, the Nicaraguan elite went into crisis. The rest of the story is well known: the United States booted Nicaraguan president Zelaya after he tried to rescue his class’s diverted dream and then, almost in the same breath, recalled Nicaragua’s sovereign debt. Panic swept through the parlors of the Americanized ultra-rich. Taking advantage of this manufactured chaos, the Yankees went for the jugular — they rammed through the now infamous Dawson Pact, which placed Nicaragua’s national finances under the direct management of American officials. Confronted with the indignities of this “dollar diplomacy,” the Nicaraguan ruling class fractured. And so did the national peace: violence erupted in 1912, when Liberal generals declared war on a Conservative president, who promptly asked the Marines to intervene. This was all the pretense the United States needed to launch its invasion and initiate two decades of military occupation. Gobat characterizes this brief upsurge as a “bourgeois revolution denied,” emphasizing the righteous anger ordinary Nicaraguans directed at members of the ruling class irrespective of their political affiliation. Waves of anti-elite violence whipped through both Liberal and Conservative enclaves as the bickering oligarchs duked it out among themselves. But the rival parties hurriedly found common ground when grassroots violence spun out of control. In 1927, Liberal rebel leader José María Moncada acquiesced to the Yankee invaders, accepting continued North American oversight in return for a restored Liberal presidency. Sandino and his followers saw this as an unforgivable betrayal. As Sandino described it later, “Moncada realized he could achieve his old ambition of becoming president . . . without considering that the country was being surrendered anew to the [North American] interventionists.” Sandino refused to lay down his guns and led a battalion of faithful soldiers into the hinterland. Meanwhile, his one-time Liberal comrades accepted the terms of the armistice and established themselves as civilian rulers. The period of guerrilla insurgency began — and Sandino’s legendary San Albino Manifesto announced the new conflict to the world. Taking shelter in remote areas, Sandino’s faithful waged a clandestine war against the Marines and their local collaborators, both Liberal and Conservative, working to eject the traitorous vendepatrias (country-sellers, more or less) and restore sovereignty to Nicaragua. Sandino’s swashbuckling exploits are the stuff of legend. His military expeditions between 1927 and 1933 have been well studied, and an impressive online repository of primary sources documents the details of his insurgency. But the specific political character of Sandino’s revolutionary movement — not to mention his eclectic personal ideology — remains murky and misunderstood.\nThe True Sandino? In 1936, the dictator Anastasio Somoza published a book called The True Sandino, or The Agony of the Segovias. It was later republished in 1974, when a revolutionary movement named for Sandino’s insurrection threatened the power of Somoza’s son. For many years this was the only book about Sandino available in Nicaragua. But Somoza’s “true Sandino” was a caricature of the rebel leader, a boogieman devised to vandalize the memory of the Segovia insurgency and to prevent Sandino’s reputation as a folk hero from taking hold. Throughout, Somoza characterized Sandino’s fighters as a “ruthless band” of criminals, fallen under the spell of a pagan bolshevik with an appetite for carnage. Predictably, Sandino appeared as the antithesis of all things Nicaraguan — if Nicaragua was Catholic, liberal, and calm, Sandino became apostate, radical, and ruthless. Somoza’s smear campaign more or less succeeded, for a time. By the 1960s, however, young Nicaraguans saw an opportunity for popular mythmaking on a national scale. One of these, a bespectacled librarian named Carlos Fonseca, went on to form the Sandinista National Liberation Front (FSLN) in 1963. His writing helped restore Sandino as a symbol of popular liberation. Sandino’s name and image have since become ubiquitous in Nicaragua. But the prolonged tug-of-war over his memory has created a fog around his specific political orientation, a haziness only intensified by his maddeningly eclectic personal ideology. The very conditions of his birth implicated him in the continent’s dark history of sexual coercion and racial hierarchy — a common origin story that unfortunately made Sandino and many others like him sympathetic to eugenics-inflected and pseudo-spiritual race thinking. What’s more, Sandino claimed to have witnessed the 1912 Marine invasion that resulted in the killing of national hero Benjamin Zeledón, whose corpse was hoisted into a stinking ox cart before the young Sandino’s eyes — and before the eyes of an outraged nation. Nine years later, generalized poverty compelled Sandino to move to Mexico in search of work. (The fact that a pesky constable was on his trail after an attempted murder in his native Niquinohomo undoubtedly helped light a fire under the hotheaded migrant’s feet.) Sandino arrived in Mexico at an exciting political moment. The Mexican Revolution’s long period of armed conflict was drawing to a close, and a broad social coalition had emerged to defend the rebels’ hard-won reforms, institutionalized in the 1917 constitution and embodied by ascendant president Álvaro Obregón. Working in an oil field owned by North American Standard Oil, Sandino had a front row seat to the twin processes of proletarianization and rising class struggle then sweeping the region. There, he began to assemble his ideological collage. In Mexico, Sandino encountered the international Communist movement and began to consider the possibility of social revolution, but he also became enamored with the millenarian race thinking then in vogue throughout the region and with the occultism that, for some, represented the era’s zeitgeist. Viewed from one angle, Sandino’s socialist credentials appear airtight: he maintained a relationship with the Communist International via the Mexican Communist Party throughout his entire political life. For a time, he collaborated closely with Augustín Farabundo Martí, the Salvadoran revolutionary who founded the short-lived Central American Communist Party. What’s more, Sandino routinely corresponded with Peruvian Marxist José Carlos Mariátegui, who published the Nicaraguan firebrand’s letters in his journal Amauta, a significant radical outlet at the time. Sandino even volunteered to tour Europe with the Comintern’s World Anti-Imperialist League, but the trip was ultimately called off. But he was also a millenarian spiritist, deeply immersed in the early-twentieth-century fascination with the occult that spread like wildfire through the parlors and meetinghouses of the United States and post-revolutionary Mexico. One spiritist organization in particular had a profound effect on Sandino’s political development: the Magnetic-Spiritual School of the Universal Commune (EMECU), founded and controlled by Basque occultist Joaquín Trincado. Trincado believed that a universal substance united all human beings in a shared metaphysical essence. He sharply distinguished his philosophy from occult spiritualism — which he and his followers viewed as baseless superstition — by borrowing from political and scientific trends. Like any good religious utopian, Trincado fleshed out his vision of the good society by swiping elements of the prevailing philosophies of the day, and so his universal commune — the social expression of universal spiritual enlightenment — took on a distinctly socialistic flavor in the crucible of revolutionary Mexico. Sandino’s revolutionary aspirations found a spiritual counterpart in Trincado’s utopia. But Trincado and his followers also bought into the eugenics-inflected ideology of racial perfection then popular among Latin American intellectuals. This notion — which Mexican philosopher José Vasconcelos most famously expressed in 1925 — held that race mixing in the Americas had created a physically perfect, spiritually ideal, and politically transcendent version of humanity. This retrograde belief informed Trincado’s politics as much as it did his spirituality. Trincado believed that the enlightened members of what he called “the Adamic race” — Spanish America’s demographic gift to history — would people his universal commune. To achieve this, he attempted to organize the Hispanic-American Oceanic Union, a political vehicle intended to unite the Spanish-speaking American countries as a first step toward his utopian civilization. The ideology Sandino learned from Trincado was undoubtedly racist and reprehensible, despite at least one leftist’s misguided attempt to rehabilitate it. In the Nicaraguan context especially, Sandino’s millenarian race thinking had chilling overtones. To this day, half of Nicaragua’s landmass remains populated by Afro-descendant and indigenous people who have long maintained an oppositional posture toward the state. And for good reason: the Nicaraguan government, headquartered on the country’s mestizo Pacific side, repeatedly annexed and invaded the self-governing indigenous territories on the Atlantic coast throughout the nineteenth and twentieth centuries. In fact, national unification — code for mestizo control over indigenous territories — was a core aspiration of Zelaya’s developmentalist state. Despite reportedly maintaining a positive relationship with many indigenous Miskitu during his guerrilla campaign, Sandino’s records reveal that he continued to think of his anticolonial struggle in explicitly racial terms; his surviving writings are peppered with references to the supreme “Indo-Hispanic race.” This racialized thinking, along with a series of specific tactical disagreements, put Sandino at odds with the Comintern. When it lionized Sandino, the left-wing FSLN quietly expunged much of this troubling ideological content, assembling an image of the guerrilla leader that looked far more like Farabundo Martí than Joaquín Trincado. But at least one piece of this occultist history remains firmly embedded in the twenty-first century’s updated and reimagined “Sandinismo.” The FSLN, which now controls the Nicaraguan state, still uses the slogan of Trincado’s school as its own. “Siempre más allá” (roughly, “Ever Further Onwards” or “Always Beyond”), a mantra that once decorated spiritist pamphlets in 1920s Mexico, can today be found emblazoned on Sandinista election posters throughout Nicaragua.", "url": "https://jacobinmag.com/2017/03/augusto-sandino-nicaragua-somoza-us-imperialism-sandinista"}