{"authors": ["Daily Herald"], "date_download": "2020-05-04 20:07:41", "date_modify": "2020-05-04 20:07:41", "date_publish": "2017-12-27 23:25:00", "description": "BYU head football coach Kalani Sitake today announced the hiring of Aaron Roderick as the passing game coordinator, and Fesi Sitake and Ryan Pugh as assistant coaches on Jeff Grimes’ offensive...", "filename": "_9b733112c1f4409289841cdde3cf4f50_1588622861.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9b733112c1f4409289841cdde3cf4f50_1588622861.html", "title": "BYU football announces three new offensive coaches", "title_page": "BYU football announces three new offensive coaches", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BYU head football coach Kalani Sitake today announced the hiring of Aaron Roderick as the passing game coordinator, and Fesi Sitake and Ryan Pugh as assistant coaches on Jeff Grimes’ offensive staff.\nCurrent assistant coach Steve Clark will remain on the staff to complete the available positions, according to a press release from BYU Athletics. BYU will hire an additional assistant coach in January. The NCAA allows schools to hire a 10th football assistant coach starting on Jan. 9. Specific position responsibilities on the staff will be announced once that position is hired.\n“I have worked on the same staff with Aaron for 12 years, so I know firsthand how Aaron’s versatility and experience will be a tremendous asset to our staff,” Sitake said. “He brings valuable play-calling and coordinating experience and his ability to teach the game is impressive. As we all know, Aaron played here (1996-98) as well so I’m happy to welcome Aaron back to BYU.\n“Fesi is one of the game’s up-and-coming young coordinators. He has done a great job with his opportunities to build a strong resume and improved his team wherever he has been. He is an excellent recruiter and excels as a mentor to his players. I’m excited to have him come to BYU and help teach the young men in our program.\n“Ryan is an impressive young coach with great leadership qualities and a championship mindset. Jeff (Grimes) coached Ryan as a player at Auburn, where he was an All-American center. Ryan knows well what Jeff strives to accomplish as a coach, having not only played for him, but also coached alongside him already at Auburn, Virginia Tech and LSU.”\nA former Cougar wide receiver and graduate assistant coach, Roderick, 44, returns to Provo with 18 years of coaching experience, including seven seasons as a coordinator. Roderick previously coached at Utah, Southern Utah, Snow College and BYU.\n“I’m excited for the opportunity to work at BYU and return to my alma mater,” Roderick said. “I look forward to working again with Kalani Sitake, someone I have a great deal of respect for as both a person and a coach. I am eager to work with Coach Grimes on his staff and contribute to the success of BYU football.”\nFesi Sitake, 31, comes to BYU with seven years of coaching experience, including five seasons as a coordinator. He joins BYU from Weber State University in Ogden, where he was the offensive coordinator the past two years after two seasons as the Wildcats’ passing game coordinator.\nSitake has seven years of coaching experience, including the past four seasons at Weber State. He oversaw the Wildcat offense as offensive coordinator the past two years after serving as the passing game coordinator his first two seasons in Ogden.\n“I am thrilled to be a part of Cougar Nation. My father graduated from BYU, and I’ve had many family members come through this amazing institution, so it’s a surreal moment for my family and me to embark on this journey at BYU,” Fesi Sitake said. “I am so grateful for President Worthen, Vice President Richardson, Tom Holmoe and Coach Kalani Sitake for trusting me with this opportunity. I also want to thank Jerry Bovee and Coach (Jay) Hill for an incredible experience at Weber State. I’ve been around some incredible coaches in my career, and I’m excited to bring the knowledge I’ve gained to this program. I look forward to mentoring the young men I associate with and contributing to what is an already rich tradition at BYU.”\nPugh, 29, joins the staff with six years of experience, including the past two seasons as the offensive line coach at the University of Texas San Antonio. Pugh spent three seasons as a graduate assistant under Grimes at Auburn (2012), Virginia Tech (2013) and LSU (2015). He also had a graduate assistant stop at Cincinnati in 2014.\n“My wife and I are extremely grateful to Coach Sitake for the opportunity to join the Cougar football program,” Pugh said. “BYU is a national brand and iconic program with a storied history of success that I am humbled to now be a part of. I also want to thank Coach (Frank) Wilson and UTSA for a great two years in San Antonio. I cannot wait to be in Provo and get to work with the outstanding coaches and young men at BYU.”\nClark, a coaching veteran of more than two decades, remains on the staff after coaching tight ends the past two seasons. Clark’s position group was led by freshman All-American Matt Bushman, who led FBS freshmen tight ends with 49 receptions and 520 receiving yards. Bushman had the most production from a tight end at BYU since consensus All-American Dennis Pitta in 2009.\nAaron Roderick\nRoderick has coached receivers, quarterbacks, running backs and linebackers during his 18-year coaching career and been an offensive coordinator five seasons and passing game coordinator two years. He most recently coached at the University of Utah, where he served 12 seasons on former Cougar Kyle Whittingham’s staff. Three of the seven 10-win seasons in Utah football history have come with Roderick calling the offensive plays, including three of the four achieved during Roderick’s time at Utah.\nRoderick was Utah’s co-offensive coordinator and quarterbacks coach his last two years on the staff in 2015 and 2016 and served as Utah’s passing game coordinator from 2012-2013. His first stint as co-offensive coordinator at Utah was in 2010, when Utah tied for 23rd in the nation in scoring offense, averaging 33.1 points a game. Roderick also called the plays for Utah during the last six games of the 2009 season when the Utes finished ranked No. 18 in the nation with a 10-3 record.\nAfter coaching the wide receivers for his first nine seasons at Utah, Roderick moved to the quarterbacks in 2014 as the passing game coordinator. Quarterback Travis Wilson played his last two seasons under Roderick and finished his career as the Utah record-holder for QB starts (39) and games played (46) and No. 2 all-time with 24 career wins.\nRoderick also coached two of the seven Ute receivers in school history to reach 1,000 yards in a season. David Reed set Utah single-season records for receptions (81) and yards (1,188) in 2009 and led the Mountain West Conference in receiving yards per game (91.4). Dres Anderson had 1,002 receiving yards in 2013, led the Pac-12 in yards per reception (18.91) and finished fourth in yards per game (83.5). Roderick has helped seven receivers gain opportunities in the NFL, including draft picks Reed (fifth round) and Freddie Brown (seventh round).\nBefore going to Utah in 2005, Roderick spent two seasons as the offensive coordinator, quarterbacks coach and recruiting coordinator at Southern Utah in 2003-04. Roderick oversaw a Thunderbird offense in 2004 that finished 21st in the NCAA FCS in total offense (412.5 ypg) and 14th in passing offense (270.5 ypg) — at the time a school record. SUU quarterback Casey Rehrer ranked sixth in Division I-AA in total offense and 19th in pass efficiency under Roderick’s tutelage, while receiver A.J. Smith finished fifth in the country in receptions per game (7.18 rpg).\nRoderick coached running backs at Snow College in 2002 after beginning his coaching career as a graduate assistant at BYU, assisting with the linebackers in 1999 and receivers in 2000 and 2001.\nA native of Bountiful, Roderick was a three-sport all-state athlete at Bountiful High School prior to earning All-America honors at Ricks College in Rexburg, Idaho, where he broke the school’s single-season punt and kick return records.\nAfter two years at Ricks College from 1994-95, Roderick redshirted at BYU in 1996 as a member of the Cougars’ 14-1 Cotton Bowl team. Roderick went on to start as a receiver and return specialist in 1997 and 1998 and also earned academic all-conference accolades. BYU went 29-11 in Roderick’s three seasons on the team.\nRoderick graduated from BYU with a degree in sociology in 1998 before earning a master’s of sociology from his alma mater in 2002. He served a two-year mission in Bogota, Columbia, for The Church of Jesus Christ of Latter-day Saints. He has two children, Rachel and Quin.\nFesi Sitake\nSitake has seven years of coaching experience, including the past four seasons at Weber State. He oversaw the Wildcat offense as offensive coordinator the past two years after serving as the passing game coordinator his first two seasons in Ogden. Sitake, who coached quarterbacks at WSU, has served as a coordinator for five seasons during his career.\nIn 2017, Sitake helped lead the Wildcats to a Big Sky Conference title, a school-record 11 wins, two wins in the FCS playoffs, a top-10 national ranking and the No. 18 FCS scoring offense at 33.7 points per game. He engineered the Wildcat offense that included first-team All-Big Sky selection and All-America selections tight end Andrew Vollert and offensive lineman Iosua Opeta. Senior quarterback Stefan Cantwell also posted the fifth-most single-season total offense yards in school history (3,583). The Wildcat offense had eight players that earned Big Sky All-Conference honors.\nIn 2016, Sitake helped lead Weber State to a 7-5 record, a third-place finish in the Big Sky Conference and WSU’s first trip to the FCS Playoffs in seven years. In 2015, he served as the passing game coordinator for a Wildcat team that finished 6-5, its first winning season in five years.\nPrior to joining the Weber State staff in December 2013, Sitake spent three seasons coaching at his alma mater, Southern Utah, on current BYU assistant head coach Ed Lamb’s coaching staff. He served as a student assistant, wide receivers coach and passing game coordinator.\nSitake was part of the Southern Utah team that finished 8-5 in 2013 and advanced to the FCS Playoffs for the first time in school history. Under Sitake’s tutelage, wide receiver Fatu Moala garnered second-team all-Big Sky Conference honors after leading the team with 65 receptions for 810 yards and nine touchdowns in 2012.\nIn 2011, Sitake was instrumental in developing a young Thunderbird receiving corps into a productive unit, including overseeing the maturation of true freshman Brady Measom, who wound up leading the team in receptions and earning Great West Conference Rookie of the Year honors from both the coaches and the media.\nAs a player, Sitake was a two-time Great West All-Conference performer at Southern Utah and finished his career as one of the top wide receivers in SUU history. As a senior in 2010, he had 877 receiving yards, the ninth most in Thunderbird history at the time, and finished sixth in the nation in receptions per game. He also excelled as a return specialist and during his junior year finished seventh in the country in punt return average.\nSitake is a native of Sandy. He served a mission for The Church of Jesus Christ of Latter-day Saints in Riverside, California. He and his wife,Holly, are the parents of three children, Sefesi, Cayson and Emerson.\nRyan Pugh\nPugh has spent the past two seasons at UTSA coaching the offensive line. He has six years of coaching experience, including three years as a graduate assistant under Grimes. Last year he helped the Roadrunners to their first winning season since 2013.\nA former player under Grimes as well, Pugh started coaching at UTSA in 2016. Under Pugh, the Roadrunner offensive line led the way for an offense that scored a program-best 379 points en route to the school’s first bowl game in history, the 2016 New Mexico Bowl. Offensive tackle Jevonte Domand picked up honorable mention All-Conference USA honors.\nIn 2015, Pugh coached with Grimes at LSU with the offensive line. The Tigers went 9-3 and finished No. 16 nationally. The offensive line blocked for a running game ranked No. 7 nationally and tops in the SEC at 256.8 yards per game.\nPugh spent the 2014 season at Cincinnati as a graduate assistant. He helped tutor first-team all-conference selections offensive tackle Eric Lefeld and offensive guard Parker Ehlinger as the Bearcats went 9-4. Prior to Cincinnati, Pugh was at Virginia Tech in 2013 and helped the Hokies earn another bowl trip and an 8-5 overall record.\nPugh started his coaching career as a graduate assistant at his alma mater, Auburn, in 2012. Pugh helped eventual Rimington Trophy winner Reese Dismukes and 2014 NFL Draft second overall pick offensive tackle Greg Robinson.\nA four-year letterwinner at Auburn from 2007-10, Pugh earned All-America honors as a senior and was a finalist for the Rimington Trophy. He was a three-time All-SEC selection and was the starting center for the Tigers’ 2010 national championship team.\nPugh was also an academic award winner as a four-time SEC Academic All-Conference selection, CoSIDA Academic All-District selection and a Lowe’s Senior CLASS Award finalist in 2010.\nHe signed with the Carolina Panthers as an undrafted free agent in 2011.\nA native of Hoover, Alabama, Pugh graduated cum laude with his bachelor’s degree in building science from Auburn in 2012. He is married to the former Cathey Lee Dalton.", "url": "https://apnews.com/9b733112c1f4409289841cdde3cf4f50"}