{"authors": ["Jovan Alford"], "date_download": "2020-05-04 20:23:25", "date_modify": "2020-05-04 20:23:25", "date_publish": "2017-11-10 19:02:00", "description": "Now that it's clear that sexual violence is a problem, the creator of #MeToo would like the conversation to change. The names of perpetrators don't matter anymore, activist and writer Tarana...", "filename": "_113d1182b2094808823b76531ce668e7_1588623805.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_113d1182b2094808823b76531ce668e7_1588623805.html", "title": "The next step for #MeToo creator isn't a hashtag", "title_page": "The next step for #MeToo creator isn't a hashtag", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Now that it’s clear that sexual violence is a problem, the creator of #MeToo would like the conversation to change.\nThe names of perpetrators don’t matter anymore, activist and writer Tarana Burke said. It’s time to focus on the systems that allow sexual violence to flourish.\n“There will always be a new person,” she said. “I want to keep the conversation going, but it needs to progress.”\nIt took a massive celebrity scandal to bring mainstream awareness and recognition to decades of activism. To her, it’s a watershed moment that’s astounding and humbling -- but not surprising. The time to move is now.\n“We often don’t think about what happens after there’s this groundswell of support,” she said. “Everyone feels good about it in the moment, but then you have to sit with that disclosure after the fact.\n“We’re hoping to help people create a way to process after the hashtag.”\nPut survivors at the forefront of the movement\n“Every one of those hashtags is a human being. There is a person behind that who is sharing something of themselves that is deeply personal,” she said.\nPeople need to support survivors, but support takes different forms: counseling, legal advice, shelter, maybe. Each situation calls for a different resource.\n“Part of the job is to find out what they need,” she said. ”#MeToo is about helping people find those resources.”\nAs the conversation moves forward she wants to center it around those whose experiences are often overlooked -- women of color. She wants them to know that #MeToo is still for them, just as it was more than 10 years ago when it started.\n“If we don’t center the voices of marginalized people we’re doing the wrong work,” she said. “The message is no different now than it was 10 or 11 years ago.”\nDuring CNN’s Tipping Point town hall on sexual harassment Thursday, Burke wasn’t alone in her concerns about what happens next.\nFormer US Rep. Mary Bono said it may be hard for a 24-year-old single working woman to come forward. “Now courage and a voice are great, but they don’t put food on the table if you lose your job,” Bono said.\nActivist and professor Anita Hill said people need to understand that sexual harassment and assault happens to women of all ages and all races.\n“Until we can believe all women -- every woman’s voice has value -- none of us really will be seen as equal.”\nWhat men can do\nMen hold the cards when it comes to interrupting rape culture, Burke said.\nDon’t laugh at jokes that demean women or make light of sexual violence. Speak up when you see a coworker being harassed. Offer support without fear of being too nosey. They can always decline.\nTake action\nGet involved in your community. Really, though -- get involved in your community.\nJoin community groups. Volunteer at a rape crisis center. Find out who your elected officials are and what they stand for. Find out what your schools are teaching children in sex education class.\nResearch laws in your state. Do they require sexual harassment training? Do they protect freelancers and contractors?\nThis what Burke means when she talks about the systems.\n“The message of #MeToo is the same across the board. Sexual violence knows no race, no color, no gender, or class. But the response to sexual violence does, and I don’t want us to get pigeonholed into a racialized or classist or sexist or gendered response to this moment.” –– (CNN)", "url": "https://apnews.com/113d1182b2094808823b76531ce668e7"}