{"authors": ["Sentinel"], "date_download": "2020-05-04 20:24:26", "date_modify": "2020-05-04 20:24:26", "date_publish": "2017-12-26 11:33:47", "description": "Staff report It was a long climb back for Nashoba Regional wrestler Lucas Cordio. After an injury kept him out of the title match at the 2016 Division 2 state championship wrestling...", "filename": "_d1eb2d21fafd4b3780c2c212d0382f7d_1588623866.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d1eb2d21fafd4b3780c2c212d0382f7d_1588623866.html", "title": "Cordio Captures State Title", "title_page": "Cordio Captures State Title", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Staff report\nIt was a long climb back for Nashoba Regional wrestler Lucas Cordio.\nAfter an injury kept him out of the title match at the 2016 Division 2 state championship wrestling meet -- where he settled for a fourth-pace finish at 145 pounds -- Cordio redoubled his efforts.\nAll of that hard work paid off in his junior season, as Cordio captured the Division 2 state championship at 152 pounds. Cordio defeated North Attleboro’s Nick Gould, 21-7, in the championship match on Feb. 18 and was named the tournament’s Outstanding Wrestler, as Nashoba finished eighth as a team.\nCordio went on to place second at the all-state championships, and was named the Sentinel & Enterprise Wrestler of the Year.\nIncredible success on the mat and a tireless work ethic have placed Cordio’s journey at No. 7 among the Sentinel & Enterprise’s top 10 local sports stories of 2017.\nDespite turning heads throughout his career, a state title had eluded Cordio until his junior season.\nHis determination and focus never wavered, even as others were eager to sing his praises.\n“I don’t pay a lot of attention to rankings,” Cordio said in January, before winning the title, after masswrestling.com ranked him as the top wrestler in the state at 152 pounds. “You can be the No. 1 wrestler and then not even place. I haven’t won a state title yet, and until that happens it doesn’t matter where I am ranked.”\nThrough hard work and pure grit, mission accomplished.\nCheck back tomorrow when we unveil the No. 6 entry in our countdown of the top local sports stories of the year.", "url": "https://apnews.com/d1eb2d21fafd4b3780c2c212d0382f7d"}