{"authors": ["Ben Tarnoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:48", "date_modify": "2020-05-04 19:54:48", "date_publish": "2017-08-29 00:00:00", "description": null, "filename": "2017_08_bill-gates-wont-save-us_1588622088.html", "image_url": "https://images.jacobinmag.com/2017/08/29113715/issue26-3-Artboard-1wp.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_08_bill-gates-wont-save-us_1588622088.html", "title": "Bill Gates Won’t Save Us", "title_page": "Bill Gates Won’t Save Us", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Silicon Valley prides itself on solving problems. Whether it’s colonizing Mars or finding a parking spot in San Francisco, the tech industry promises to tackle humanity’s greatest challenges. Yet on the most urgent challenge of all — how to stop climate change before it renders large portions of the planet uninhabitable — it has made vanishingly little progress.\nIt’s not for lack of trying. Eager to take advantage of what venture capitalist John Doerr called “the biggest economic opportunity of the twenty-first century,” from 2006 to 2011 investors poured a staggering $25 billion into companies that vowed to radically reduce our reliance on fossil fuels. It seemed like a perfect fit: Silicon Valley could fulfill its vision of itself as an instrument of human salvation by literally saving the world, while collecting the vast profits that would presumably flow from spearheading a global energy transformation.\nThe result was a disaster. By 2011, VCs had lost more than half of the money they had invested over the previous five years. Nearly all of Silicon Valley’s clean energy startups had gone bust or were about to. With the exception of a few high-profile outliers like Tesla, Silicon Valley fled the sector and “cleantech became a dirty word,” according to TechCrunch. The aversion has persisted ever since, although in December 2016, Bill Gates announced a new billion-dollar fund called Breakthrough Energy Ventures that aims to rekindle VC enthusiasm for clean energy.\nBut Breakthrough Energy Ventures is likely to suffer the same fate as its predecessors, for the simple reason that venture capital is a terrible model for funding innovation. If the goal is major advances in how we generate, store, and distribute clean energy, as well as how we remove massive quantities of carbon dioxide from the atmosphere — all of which are critical for keeping global warming under the 2°C limit widely seen by scientists as catastrophic — then venture capital is the worst possible way to get there.\nVenture capital is designed to demand large returns in the short term. This makes VC firms unlikely to support the sort of research that produces technological breakthroughs, which requires generous financing over long periods of time. Science operates on a different timetable than capitalism.\nMost VC funds are structured as ten-year partnerships. This usually means they’re looking for startups headed for an “exit” — an IPO or an acquisition by a bigger company — within three to five years. Gates’s Breakthrough Energy Ventures is organized as a twenty-year fund, in the hopes of giving founders a bit more breathing room. But this still sets an unforgiving pace for startups to achieve exponential growth. Because most startups will fail, VCs must select companies they believe can scale fast enough to pay off ten to a hundred times their investment. One or two superstars will make up for the many duds, enabling the fund to provide a competitive return.\nVC firms are impatient and greedy because the market demands it. It doesn’t matter what’s in your heart: even philanthropically inclined investors like Gates must function under these constraints. VCs simply can’t afford high-risk, capital-intensive projects that don’t offer the possibility of a quick and sizable payout. As a result, they’re good at bankrolling the next Tinder or Snapchat, but bad at financing the more ambitious technologies needed to purge the carbon from our energy and our air.\nSo if venture capital isn’t capable of funding the innovation we need, what is? The same entity that has funded every major innovation since World War II: the state. It is an article of faith in Silicon Valley, and in corporate America more generally, that the private sector is entrepreneurial and risk loving while the public sector is stagnant and risk averse. The truth is nearly the exact opposite.\nIn one field after another, publicly funded research has supplied the private sector with its most pioneering and profitable inventions. That’s because the public sector can afford to be everything the private sector can’t: patient, generous, and insulated from the iron discipline of the market. This is most powerfully true in the case of the industry that most loudly proclaims its entrepreneurialism — Silicon Valley. The computer, the Internet, the smartphone — these are just a few of the technologies that wouldn’t exist without piles of public money. The state bears the risk of radical innovation so that companies and their investors can reap the rewards.\nWhen it comes to clean energy, other countries understand this dynamic far better than the United States. In fact, as the economist Mariana Mazzucato has observed, one of the reasons that the US has lagged behind other countries in renewables is its “heavy reliance on venture capital to ‘nudge’ the development of green technologies.” China, by contrast, has opted for a strong “push” from the state. In 2015, China installed one wind turbine and one soccer field’s worth of solar panels every hour. Its lavish public funding of solar panel manufacturers has helped produce a 80 percent drop in world prices, driving down the cost of renewable energy everywhere. And larger investments are on the horizon: earlier this year, China’s National Energy Administration announced that the government planned to invest more than $360 billion in renewables through 2020.\nChina may be especially aggressive, but it’s not alone in its reliance on public institutions. Around the world, the state is leading the charge on clean energy. The single biggest actor in the “climate finance” landscape is state investment banks, which invested $131 billion in renewables in 2014 — compared with $46 billion from commercial banks, and a measly $1.7 billion from venture capital and private equity.\nPublic institutions aren’t just funding research into new technologies — they’re also funding decarbonization using existing technologies. This is a critical point too often obscured by Bill Gates and other clean energy capitalists: we already have the technology to transition to a zero-carbon energy system. We even have a detailed road map for what the transition would look like, thanks to Stanford scientist Mark Z. Jacobson and his colleagues, who have plotted out how to convert all fifty states to 100 percent clean energy by 2050.\nOf course, innovation can help ease and accelerate this process — it can also find ways to scrub centuries of carbon emissions from our atmosphere. In fact, without major technological advances, we are unlikely to keep warming within the 2°C limit. But we’ll never generate those advances if we surrender society’s most important investment decisions to billionaires like Gates.", "url": "https://www.jacobinmag.com/2017/08/bill-gates-wont-save-us"}