{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:09:13", "date_modify": "2020-05-04 20:09:13", "date_publish": "2017-11-18 22:20:19", "description": "The H.O.M.E. Crafts Fair featuring home-made goods from Maine was held all day Saturday at the First Congregational Church in Old Greenwich. Tracey Hair, executive director of the H.O.M.E....", "filename": "_c31e893b31ac410ca8b4955ac855fac6_1588622953.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c31e893b31ac410ca8b4955ac855fac6_1588622953.html", "title": "Crafts Fair to raise money for Maine’s neediest", "title_page": "Crafts Fair to raise money for Maine’s neediest", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The H.O.M.E. Crafts Fair featuring home-made goods from Maine was held all day Saturday at the First Congregational Church in Old Greenwich.\nTracey Hair, executive director of the H.O.M.E. Inc., located in the town of Orland, Maine, who was on hand at the church said her organization has a multifaceted approach to dealing with poverty in her state by giving those in need the tools to rise above it. She said that her organization consists of a homeless shelter, a foodbank, a learning center with daycare, alternative high school and college-level programs and a craft co-operative that sells home-made Maine goods such as were available at the fair at First Congregatonal Church.\nHair said all money from sale of the goods goes to H.O.M.E. and is used to serve the poor. Hair also said that H.O.M.E. has had a decade long relationship with the First Congregational Church, “The First Congregational Church members are so kind and helpful. We come down once a year for the fair and during the summer youth group members from the church come up and help our organization in various ways, even helping with construction of homes for those in need.”\nFirst Congregational Church member Libby Craig said the fair, located in the church auditorium, has hours of 11 a.m. to 1 p.m. on Sunday.", "url": "https://apnews.com/c31e893b31ac410ca8b4955ac855fac6"}