{"authors": ["Haley Church"], "date_download": "2020-05-04 20:10:52", "date_modify": "2020-05-04 20:10:52", "date_publish": "2017-05-21 17:19:00", "description": "MOUNT CARMEL — The final performance. The final bow. The final Greatest Show on Earth. Nick Lambert joined the Ringling Bros. and Barnum & Bailey Circus in August of 2015. Little did he...", "filename": "_278edb20e704457da03702a349e3ceb4_1588623052.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_278edb20e704457da03702a349e3ceb4_1588623052.html", "title": "Albion native reflects on time spent in the Ringling Bros. Circus", "title_page": "Albion native reflects on time spent in the Ringling Bros. Circus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MOUNT CARMEL — The final performance. The final bow. The final Greatest Show on Earth.\nNick Lambert joined the Ringling Bros. and Barnum & Bailey Circus in August of 2015. Little did he know, he’d be a part of the end of an era.\n“The reason that I really wanted to join the circus is that I needed to find a place that would pay me and house me,” he laughed.\nLambert had a friend who worked for Feld Entertainment, the owners of the circus, and quickly applied. They responded almost as quickly, with two prerequisites — must enjoy living with coworkers and riding trains.\n“They shipped me down to Dallas, Texas, and started working backstage,” he said.\nIn November of 2015, Lambert auditioned to be a clown and had his first onstage performance in Rosemont, Chicago.\n“In between the train runs you could just go sit in the vestibules and watch the world go by,” Lambert said. “Being from a small town, to know that when your go through these other small towns, it makes you think that there are other towns exactly like yours. For me, it made the world more human.”\nIn addition to the scenic train rides, Lambert enjoyed meeting the people he performed for.\n“We would get to meet all of these interesting people from all over,” he said. “Last week there was a lady who was 98-years-old and she sat in the very front row and her son was there and said she had never missed the circus. She was something else.”\nNot many people know how many hours go into working for the circus, Lambert said. Loading up all of the equipment takes six or seven hours, each performance and pre-show is three or four hours — with sometimes up to three performances a day — and then nearly constant traveling to a new city.\n“If you did not prepare yourself, it would be a hard time,” he said. “Shows would usually be at 11 a.m., 3 and 7 p.m., so we would finish at about 9 p.m.— and then load up starts and it takes another six hours, and then you pack up the train, put all of the props back into the wagons and take off to the next city. It was worth it — but no one tells you how much work it would actually be.”\nFinding time for yourself was also difficult while working as a circus performer. There were 12 rooms in Lambert’s train car, and lucky for him as an official performer, he got a sleeping compartment he could actually stretch his arms out in.\n“The room that I had before that was called a ‘coffin room’ and I could not stretch my arms their full length,” he lamented. “You miss the things that are normal — like getting a haircut or going to the market.”\nLambert didn’t realize how quickly his stint in the circus would come to an end.\nOn May 1, 2016, after years of public and PETA critique, Asian elephants performed in the Ringling Bros. circus for the last time. They were retired to the Ringling Bros. Center for Elephant Conservation.\n“They are always trying to give the audience what they want,” Lambert said. “First to have the elephants leave, that was hard — that was hard on a lot of performers because it was a staple of the show. I don’t know if it’s one of the Ringling brothers that said it or not, but they said that ‘elephants and clowns are the two pegs the circus is built on.’ So they got rid of one of the pegs.”\nLambert said it was compelling to watch the circus reorganize itself without its centerpiece — without one of the pegs. No one was really expecting the 146th production of the circus to be its last. On Jan. 14, 2017, Feld Entertainment announced that the final performances of the Greatest Show on Earth would be this month.\nAs a part of the red unit — one of the two performing circus units — Lambert performed his last show earlier this month.\n“It was a sellout crowd and lots of people were giving us condolences and good wishes for our futures,” Lambert said. “Lots of people were crying, lots of people were sympathetic — audiences members and performers as well.”\nLambert said he was very nervous during the last show because of the finality of it all.\n“It was rough, it really was. It was really emotional for me,” he said. “I had just stumbled into the circus. It was a means for me to travel, to learn and to grow — but I never ever thought in my 29 years of living that I would be working as a circus clown for the Ringling Bros and Barnum & Bailey circus. But for some of the people, that has been their whole lives. You have to take into account that this is someone’s dream that they’ve wanted all of their life that is being taking away from them. Which is why you can’t just say, ‘Oh, this is just another show closing.’”\nThe more than a century old circus may take its final bow, but the curtain will never close on the memories it created not only for audiences, but for the performers as well.\nThe final Ringling Bros. and Barnum & Bailey circus performance will be broadcast live from New York tonight, May 21, at 6 p.m. Central Standard Time, both on ringling.com and on Facebook Live.", "url": "https://apnews.com/278edb20e704457da03702a349e3ceb4"}