{"authors": ["Keeanga-Yamahtta Taylor", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:03", "date_modify": "2020-05-04 19:51:03", "date_publish": "2017-01-17 00:00:00", "description": null, "filename": "2017_01_womens-march-dc-trump-protests-inauguration_1588621863.html", "image_url": "https://images.jacobinmag.com/2017/01/17233237/womens-march.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_01_womens-march-dc-trump-protests-inauguration_1588621863.html", "title": "How to Build a Mass Movement", "title_page": "How to Build a Mass Movement", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The United States has just experienced a corporate hijacking. If Trump’s inaugural speech did not alert you to the fact that they intend to come after all of us, then you are not paying attention.\nThe scale of the attack is as deep as it is wide, and this means that we will need a mass movement to confront it. To organize such a movement necessarily means that it will involve the previously uninitiated — those who are new to activism and organizing. We have to welcome those people and stop the arrogant and moralistic chastising of anyone who is not as “woke.”\nThe women’s marches in Washington, DC and around the country were stunning, inspiring, and the first of a million steps that will be needed to build the resistance to Trump.\nBut look around social media, and you can read critiques and even denunciations of the marchers: Where were all of these people before? Why are they only getting involved now? Why doesn’t the march have more radical demands? Why did march organizers, who are politically liberal, allow only . . . liberals to speak?\nAll this is a sign of a political immaturity that continues to stunt the growth of the American left.\nWere liberals on the march? Yes! And thank god. The movement to resist Trump will have to be a mass movement, and mass movements aren’t homogeneous — they are, pretty much by definition, politically heterogeneous. And there is not a single radical or revolutionary on earth who did not begin their political journey holding liberal ideas.\nLiberals become radicals through their own frustrating experiences with the system, but also through becoming engaged with people who became radical before them. So when radicals who have already come to some important conclusions about the shortcomings of existing system mock, deride, or dismiss those who have not achieved the same level of consciousness, they are helping no one.\nThis isn’t leadership, it’s infantile. It’s also a recipe for how to keep a movement tiny and irrelevant. If you want a movement of the politically pure and already committed, then you and your select friends should go right ahead and be the resistance to Trump.", "url": "https://www.jacobinmag.com/2017/01/womens-march-dc-trump-protests-inauguration"}