{"authors": ["Peter Gowan", "Mio Tastas Viktorsson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Matt Bruenig"], "date_download": "2020-05-04 19:55:04", "date_modify": "2020-05-04 19:55:04", "date_publish": "2017-08-22 00:00:00", "description": null, "filename": "2017_08_sweden-social-democracy-meidner-plan-capital_1588622104.html", "image_url": "https://images.jacobinmag.com/2017/08/22112113/5343290338_2c6bc54aac_b-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_08_sweden-social-democracy-meidner-plan-capital_1588622104.html", "title": "Revisiting the Meidner Plan", "title_page": "Revisiting the Meidner Plan", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nConfronting the power of capital in the United States will require a plan. We may be confident that the concentration of capital in the hands of a tiny minority represents both the primary obstacle to economic equality and one of the most fundamental threats to democracy in America, but without a concrete agenda capable of securing control over capital for the people, we will never succeed in overcoming these problems. The potential benefits of public control over the 30 percent of the national income which flows to capital are immense: a society which can provide a level of comfort, security, and freedom currently unknown by most, a massive reduction in racial and gender wealth gaps, and a healthier democracy. As such, the question of how to secure control of capital for the people must be engaged seriously, honestly, and by drawing upon the lessons of others who have tried to do so before.\nA New Hope In the 1970s, the Swedish Landsorganisationen (LO) blue-collar trade union confederation took it upon themselves to ask the same questions — albeit, under different national circumstances. Sweden’s postwar welfare state had been built around a model designed by LO economists Rudolf Meidner and Gösta Rehn. The model stressed Keynesian fiscal policies, centralized collective bargaining between unions and employers, low inflation, and a push for wage equalization through a “solidarity in wages” policy. Meidner summed up the principles behind this policy in 1993: First, equal work should be equally paid, regardless of the profitability of the firm, the size or location of the workplace. What matters is the kind and nature of work, and the skills which are needed to perform it. The second aim of the policy is the equalizing of wage differentials, but not their total elimination. Different wages should be paid for different kinds of work. The solidarity in wages policy had a number of beneficial impacts. First, by making wage demands the subject of central bargaining, it enabled unions to secure rising living standards without creating an inflationary spiral. Secondly, it ensured that unproductive firms would not be able to stay afloat by underpaying their workers. This would lead to workers being made redundant, but this was considered a feature of the model — low productivity enterprises would be replaced by new jobs in more productive firms and industries through massive investments, active labor market policies, and an extensive welfare state to ensure nobody suffered significant hardship in the intervening period. It became clear that there was a side effect which threatened the solidarity upon which this economic model was built. Wage restraint in profitable firms kept inflationary pressures down, but it did so by creating huge excess profits for business owners. Exposés by C. H. Hermansson in the 1960s showed that a vast proportion of capital in the Swedish economy was controlled by a mere fifteen families. A government-commissioned inquiry confirmed Hermansson’s findings, and Meidner summed up the public mood: “Solidarity in the politics of wages had led to a lack of solidarity in the politics of profits.” Profits created by wage restraint and state investment were being concentrated in the hands of a tiny minority. Under these circumstances, workers found themselves asking why they weren’t sharing the benefits. And so it was determined by the LO that a way to redistribute such excess profits had to be found. The “Meidner Group,” an expert commission whose members also included Gunnar Fond and Anna Hedborg, was appointed in 1973 to create a proposal to achieve three aims: to shore up the solidarity wage policy by ensuring wage restraint didn’t enrich the owners of profitable firms; to counteract the concentration of private capital; and to give employees more control over the workplace. The result, published two years later and adopted by the LO congress in 1976, was one of the most ambitious democratic socialist policy proposals ever seriously considered in a developed economy. It would confront not only the question of who reaps the benefits of excess profits, but also the question of who owns, controls, and manages the workplace. If fully implemented, a number of “wage-earner funds” would have been set up, financed through profit-related payments from firms in the form of voting shares, and administered through union-dominated boards. In this way, as firms produced profits for their shareholders, the wage-earner funds would gain larger and larger stakes in the company until they became the majority owners. Excess profits would no longer benefit only the rich and powerful, and the benefits of holding capital would be shared across society. The funds would be controlled by workers within entire branches of industry, thereby ensuring that they would not provide an unequal benefit to workers in the most profitable companies and not contribute to increased differences in wages between workers — unlike other profit-sharing schemes bound to specific companies as have periodically been seen in the US and other countries in the past. It was estimated by the Meidner group that wage-earner funds would have majority control over the stock market within a few decades. In order to prepare for this transition, dividends paid to the wage-earner funds would initially be divided between reinvesting in companies, further increasing the share owned by workers, and financing research, expertise, education, and training for workers to assist them in the running of their companies. Of considerable relevance to current debates over concentration of capital is the Meidner group’s finding that the modern economies of the west are filled to the brim with measures against monopolies, cartels or trusts. But nonetheless, nobody denies that the direction of economic development is essentially controlled by and for owners of capital, and their interests. It was not sufficient to have — as Sweden did — decades of social-democratic government, an interventionist state, and powerful labor unions. Without changing who owns capital, economic development would continue to favor the rich and powerful.\nThe Employers Strike Back It goes without saying that employers’ resistance to such a plan was intense, sustained, and effective. In addition, the SAP (the Swedish Social-Democratic Party) defeat in the 1976 elections by a right-wing coalition ensured that capital had time to fully mobilize against the proposal. By the time the SAP returned to power in 1983, the proposal had been watered down as a result of retreats and compromises by the labor movement and lukewarm support — even outright opposition — from the SAP leadership. A form of wage-earner funds were introduced in 1984, but with extremely limited worker involvement, funded only for seven years by a small excess-profits tax instead of through share issues, and they never controlled more than 7 percent of the Swedish stock market. Meidner described the final product as “a pathetic rat,” with most of the key principles of economic democracy, wholesale redistribution of capital ownership, and solidarity wage policy having been abandoned or substantially undermined. The funds were privatized after 1992 by a right-wing government. The Meidner Plan failed. But it is crucial for us to remember that it was a political failure rather than an economic failure. The LO took on the employers and lost, but their plan for a transition to a democratic-socialist economy lives on, and it can help to guide our own attempts to give people control over their workplaces, to reduce inequality through public ownership of capital, and to build a sustainable economic model that can end mass unemployment while keeping inflation under control.\nReturn of the Socialists There are lessons to be learned from the proposals, debates, and reality of wage-earner funds in Sweden, but that does not mean that the situation translates to other societies and time periods on a wholesale basis. Sweden in 1976, or even 1991, is a very different country to the US today. In order to sketch out how wage-earner funds in the US could be implemented, and how they would have to be modified compared to the Meidner proposals, it is worth looking over the key differences in summary. A primary concern is the absence of the Rehn-Meidner economic model, of full employment, low inflation, an expansive welfare state, and active labor market interventions. Our belief is that any social-democratic or socialist government elected in the US should immediately set about pursuing similar policies — both because they are independently beneficial, and because they create conditions which will allow wage-earner funds to thrive. A second glaring difference between the two contexts is that Sweden had an immensely higher union density (over 70 percent, and rising to over 80 percent in the mid-1980s) than the US had at any point during its history. The context in which wage-earner funds are plausibly attainable would likely be accompanied by a considerable growth in the strength of organized labor, but it would be unreasonable to assume this automatically translates to near-universal unionization as existed in 1970s Sweden. As such, it will likely be necessary for the state to own the wage-earner funds on behalf of the people, in order to avoid a justified critique that we are handing control over the economy to unrepresentative bodies (private sector union density was 6.6 percent in 2014). However, as giving people control over their workplace is a core principle, we have to go further than this. The French comité d’entreprise model may offer a way forward. For a country renowned for its relatively powerful labor movement, one would be surprised to hear that only 5 percent of France’s private sector employees are union members. However, in any company with over fifty employees, elections must be held for a representative council with extensive influence over the management of the company. Most workers choose to support representatives from one of France’s union confederations, and the introduction of industrial elections offers a promising way to jump-start the connection between workers and trade unions in the US. Crucially, representative councils would also provide an avenue for employee control over how the shares owned by wage-earner funds are used. The workers in a firm should be enabled to use the people’s shares to secure improvements in their lives and livelihoods. There are important questions about how to balance out the public interest with the interests of workers in each particular firm — questions which will require further study and discussion. What is not in question is that elected worker representatives in each company should have immensely more control over their businesses than they do at present — through French-style councils as well as worker representation on boards, employee ombudsmen, strengthened collective bargaining, and representation in the structures of wage-earner funds and having legal rights over how the shares are used.\nThe Funds Awaken The below diagram is an overview of how ownership of companies could be restructured over time. The existing owners of capital (primarily the rich, whether directly, through diversified private index funds, or any other instrument) would retain their shares, but those shares would be diluted through new issuances every year (Meidner proposed that these should be 20 percent of profits, we think that this is a good starting point). The voting shares of the funds would thereby gradually increase in value until capital income and control over the economy lies in the hands of the public. The state would ensure that each fund holds a diverse portfolio of stock to ensure they, on the whole, track the performance of the economy at large but would grant their boards, which should be comprised of government appointees and worker representatives, substantial operational autonomy. The boards would set overall policy, but committees tailored to each industry should also be established, including individuals appointed by the board, worker representatives, and other stakeholders (such as consumer groups, local authorities, and environmental or minority group representatives). A share of profits would be sent to a central clearing fund, for the same purpose as in the original Meidner proposal — to provide expertise, research, education and information to workers in the running of their companies. It may be prudent to exempt genuinely small businesses from having to issue shares to wage-earner funds. Fear of mom-and-pop stores and self-employed tradespeople being expropriated contributed to the scare tactics used by employers, and the political risk incurred by including them would likely outweigh any benefits accrued. If an exemption is included it should be extremely carefully designed to avoid companies using loopholes to avoid issuing shares to wage-earner funds. It should be obvious to observers that removing the most powerful opponents of better wages and conditions will strengthen traditional labor strategies — union organization, collective bargaining, and — where necessary — industrial action. Those employed in small firms not covered by wage-earner funds will benefit immensely from this more favorable climate. Finally, it is of the highest importance that we exercise caution in how the capital income that funds acquire is distributed. Meidner repeatedly stresses that the money should not be seen as a direct tool of fiscal policy, and releasing vast quantities of money into the economy at once can create the inflationary spirals that the Rehn-Meidner model was designed to avoid. The use of capital income in the wider economy should be subject to carefully drafted fiscal rules — analogous to those imposed on the Norwegian government pension funds — designed to ensure long-term economic stability, growth and equalization.", "url": "https://jacobinmag.com/2017/08/sweden-social-democracy-meidner-plan-capital"}