{"authors": ["Staff Reports"], "date_download": "2020-05-04 21:06:16", "date_modify": "2020-05-04 21:06:16", "date_publish": "2017-12-14 17:16:00", "description": "It only took Scott Frost two seasons as a head coach to win one of the biggest honors in college football. Frost on Thursday was named the 2017 Eddie Robinson Coach of the Year, the reward...", "filename": "_ea17b0df6c5b487585062c39c1d0b306_1588626376.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ea17b0df6c5b487585062c39c1d0b306_1588626376.html", "title": "Scott Frost named 2017 Eddie Robinson Coach of the Year recipient", "title_page": "Scott Frost named 2017 Eddie Robinson Coach of the Year recipient", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It only took Scott Frost two seasons as a head coach to win one of the biggest honors in college football.\nFrost on Thursday was named the 2017 Eddie Robinson Coach of the Year, the reward for leading the Central Florida turnaround from an 0-12 team in 2015 to a 12-0 program by 2017.\nAfter leading the Knights to the American Athletic Conference championship on Nov. 25, Frost took the head coaching job at Nebraska. Frost and his staff, however, are still leading UCF preparations for the Peach Bowl.\nFrost left his position as offensive coordinator at Oregon to become UCF head coach in 2016. His first Knights team made a bowl game and finished 6-7 a year ago, before being the last remaining FBS unbeaten this season and making a New Year’s Six bowl.\nThe Eddie Robinson award honors the former Grambling University head coach and is presented by the Football Writers Association of America. Frost is the first coach from a school that isn’t a current member of a Power Five conference to win the Eddie Robinson award since Fisher DeBerry of Air Force in 1985.\n“Scott Frost is one of the up-and-coming coaches in college football,” said 2017 FWAA President Dave Jones of the PA Media Group. “What he did at UCF was nothing short of remarkable in just two seasons.”\nIn conjunction with presenting sponsor, the Allstate Sugar Bowl, the FWAA selected Frost over seven other finalists: Bill Clark of UAB, Lane Kiffin of Florida Atlantic, Jeff Monken of Army, Lincoln Riley of Oklahoma, Kirby Smart of Georgia, Dabo Swinney of Clemson and Jeff Tedford of Fresno State.\nFrost last week was named the Home Depot Coach of the Year and received that award during ESPN’s college football awards show in Atlanta. Also this week, he has been named one of four finalists for the George Munger Collegiate Coach of the Year Award (presented by the Maxwell Club and announced Jan. 3) and one of seven finalists for the Paul “Bear” Bryant Coach of the Year award (announced Jan. 10).\nThe Eddie Robinson official presentation will be Jan. 6 at the Sheraton Atlanta Hotel where Frost will be handed the bust during a reception in conjunction with the national championship game.\n“I’m very proud of what this group of student-athletes and coaches has accomplished during my tenure at UCF,” Frost said last week. “The Knights should be in the conversation for the American Athletic Conference championship year in and year out. UCF should be a Top 25 program year in and year out. I believe this program is well on its way to establishing that level of success.\n“The next head coach at UCF is inheriting an incredible group of young men and is more fortunate than he probably knows to be working at this place.”", "url": "https://apnews.com/ea17b0df6c5b487585062c39c1d0b306"}