{"authors": ["Hilary Goodfriend", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Branko Marcetic", "Micah Uetricht", "Jonah Walters"], "date_download": "2020-05-04 19:50:58", "date_modify": "2020-05-04 19:50:58", "date_publish": "2017-05-15 00:00:00", "description": null, "filename": "2017_05_el-salvador-civil-war-reagan-cold-war-death-squads-sandinistas_1588621858.html", "image_url": "https://images.jacobinmag.com/2017/05/15142023/maura-clarke-sandinista-scarf.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_05_el-salvador-civil-war-reagan-cold-war-death-squads-sandinistas_1588621858.html", "title": "Not Just Nuns", "title_page": "Not Just Nuns", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOn December 2, 1980, four bodies were unearthed in the Salvadoran countryside. The corpses, some of which bore signs of rape, were found in what Eileen Markey describes as a “hastily dug grave at the edge of the Cold War.” The four were soon identified as North American churchwomen, assassinated by US-trained Salvadoran death squads: Ita Ford, Dorothy Kazel, Jean Donovan, and Maura Clarke, the latter the subject of Markey’s biography A Radical Faith: The Assassination of Sister Maura. The women’s murders were brutal, but they also seem uncannily banal amid the omnipresent violence in the El Salvador on the eve of what would be a twelve-year civil war. Still, their slaughter drew international outcry, causing great discomfort for the incoming Reagan administration as it sought to scale up political and military support for the Salvadoran military dictatorship. The US-backed regime was at war with a growing leftist insurgency born out of frustrated peaceful movements for democratic reforms and an end to the semi-feudal and oligarchic distribution of wealth and power in the country. In a bid to stave off any revolutionary aspirations sparked by Cuba in 1959 and enflamed by Nicaragua in 1979, the United States pumped hundreds of millions of dollars into the bloodthirsty Salvadoran military as its forces massacred entire villages; murdered and disappeared tens of thousands of civilians; and assassinated opposition politicians, labor leaders, priests, and even, as Markey’s book vividly recalls, US-born nuns. After the murders, Reagan’s UN ambassador Jeane Kirkpatrick callously declared that “those nuns were not just nuns.” Her comments, intended to suggest that Maura, Ita, Dorothy and Jean somehow deserved their fate, sparked outrage. But Markey’s account of one of those nun’s lives reveals that in some ways, Kirkpatrick was not wrong: they were much more than “just nuns.” These were fiercely courageous women who risked their lives to support the most vulnerable victims of US foreign policy in their struggle for dignity and self-determination. And they did so in the name of their Catholic faith. “Maura’s life as a missionary in Central America maps the reach of US power and delineates the Faustian calculus Washington, DC, adopted” in its anticommunist crusades, Markey writes. It also maps the extraordinary countermovement of US solidarity activists and internationalists who, like Sister Maura, “changed sides” to join the revolution. In this exhaustively researched and deeply loving biography, Markey ascribes radical agency to one of the victims of El Salvador’s civil war violence better known for her death than for her life’s work. In so doing, she reveals the key role played by people of faith, local and foreign, in the liberation movements that challenged both their domestic oppressors and their US backers.\nMission and Empire Markey does meticulous work reconstructing Maura’s remarkable trajectory. The author paints a vibrant picture of Maura’s working-class childhood in the then-sparsely populated Irish-Catholic Rockaways in Queens, New York in the 1930s and 1940s, a quiet, small town in the winter and a packed vacation haven in the summer. Maura was the daughter of Irish immigrants, her father an Irish independence revolutionary who met his wife when she nursed one of his wounded comrades back to health. This heritage of rebellion would later help shape Maura’s understandings of oppression, struggle, and even the use of violence as the communities she served began to take up arms against their adversaries. But the young Maura wasn’t much of a radical. Her Irish-American community was devotedly Catholic, fiercely patriotic, and virulently anticommunist. The Maryknoll order that Maura would enter in 1950 at age nineteen was no exception. Its overseas missions tended to follow expanding US imperial interests across the globe, often serving the role that the Peace Corps would soon provide of projecting a positive image of the United States without challenging the role its policies played in perpetuating the systems of poverty that the missions worked to alleviate. Markey depicts Maura as a girl drawn to Catholic mission work out of a sense of vocation but also of adventure. She didn’t want to cloister herself in a convent, but rather to be part of the world. Her first overseas mission was to Nicaragua in 1959, the year that Castro triumphed in Cuba, overthrowing the US-backed Batista dictatorship. Maura’s mission, however, had no such revolutionary ambitions. Quite the opposite: she flew from Miami to Managua with the mother-in-law of Anastasio Somoza, the head of the National Guard and key figure in the despotic ruling dynasty that, as Markey observes, “ran Nicaragua more as a business enterprise than as a nation.” Maura was assigned to Siuna, a remote mountain town formed around a Canadian gold mine with all the associated vices and misery. In addition to the local church, the missionaries ran a school and a hospital. They were welcomed by the Somoza regime and later received aid from its principal ally, the United States, through President John F. Kennedy’s Alliance for Progress. Markey writes, “The Maryknoll mission sought to improve the lives of people in Siuna by giving them some skills to ascend the existing social structure. The sisters didn’t question the justice of the structure itself.” But things in the church were changing, and sisters like Maura began to change along with them.\nOut of the Cloisters, Into the Streets In 1959, Pope John XXIII had convened a Second Vatican Council, assembling Catholic leaders for what would become a radical shake-up of church doctrine. In 1962, the year Maura became sister superior of the Siuna mission, the council sent shockwaves through the Catholic world by authorizing mass to be celebrated in local languages, freeing the teachings of the church from an elite order of Latin-speaking guardians to be understood and interpreted by any worshipper. In 1968, the Medellin Conference of Latin American Bishops went further, declaring that the church had a “preferential option for the poor” and advancing a notion of “structural sin” that transferred its gaze from individual shortcomings to oppressive systems of power. This marked the emergence of the liberation theology movement, which would dramatically transform both the church and the Left in Latin America. As a result of Vatican II, the Maryknoll order adopted changes that shifted congregants’ relationship to authority. The sisters transitioned from charity work to community organizing. They formed Christian Base Communities (CBCs), using scripture to help their congregants develop a critical analysis of their reality and act collectively to change it. The order itself became more democratic, and Maura Clarke helped advocate for the deepening engagement with society at large. The nuns were moving out of the cloisters and into the streets. In 1970, Maura began to work in the slums of Managua. This time, her mission was very different. She and her colleagues shared their neighbors’ poverty and their struggles; she accompanied her community as it became increasingly active in social movements met with escalating state repression and marched beside them in the streets, supporting students occupying the National Cathedral and ministering to hunger strikers demanding the release of political prisoners. Following the devastating 1972 earthquake, she organized CBCs in a refugee camp and supported the community’s campaigns for dignified living conditions. The influence of liberation theology in the revolutionary movements of countries like Nicaragua and El Salvador is difficult to overstate. Across Latin America, and in Central America in particular, the spread of liberation theology and CBC organizing produced a significant portion of the bases for the mass movements that fed leftist insurgencies and supported them in the streets. The Somoza regime and its allies began condemning any collective advocacy for basic human rights as communist subversion. Maura’s activities and those of her colleagues became more and more risky and clandestine, but she was undeterred. As a nun, Maura considered solidarity with the struggle of the poor for decency and agency to be her highest calling, and as the stakes grew higher, she repeated John 15:13: “No greater love is there than this, to lay down one’s life for one’s friends.” Many of her students and peers joined the Sandinista National Liberation Front (FSLN), whose ranks included prominent priests putting the new doctrine into practice. By then, Markey writes, for Maura, “the political and the religious had merged.” As the Sandinistas’ challenge to the Somozas heated up, Maura returned to the United States in 1976. By now a seasoned radical, she educated US Catholics about the FSLN struggle and the complicity of the US government in the regime’s crimes. She even participated in the occupation of the Nicaraguan consulate to the United Nations. Her consciousness-raising work and that of fellow returning missionaries laid the groundwork for the US-based Central American sanctuary and solidarity movements that would emerge in force in 1980.\nMartyrdom The Sandinistas finally toppled the Somozas in 1979. Maura could have returned to join in the exhilarating work of building a new, more equitable society, but she chose El Salvador, a tiny country in the grips of violence unlike anything she had witnessed in Nicaragua. Before beginning what would be a tragically short-lived mission, Maura celebrated the first anniversary of the Sandinista revolution. Markey includes a striking snapshot of Maura beaming in the streets of Managua with an FSLN handkerchief prominently displayed around her neck. She quotes Maura explaining her decision, in a notable use of the first-person plural: “We’ve won here. They still haven’t won in El Salvador.” The nun’s words echo those whispered by revolutionaries across Latin America: Si Nicaragua venció, El Salvador vencerá (“If Nicaragua triumphed, El Salvador will triumph”). As the reader knows it eventually must, here Markey’s narrative takes a dark turn from the jubilation and hope of FSLN Nicaragua. The author presents an appropriately grim sketch of El Salvador in 1980: a landscape of death, abject poverty, and brutal, indiscriminate violence. Maura arrived shortly after the shocking assassination of beloved Salvadoran Archbishop Oscar Romero on March 24, 1980, by right-wing death squads. Before his murder, Romero had appealed for more Maryknoll sisters to accompany the terrorized poor majority in the intensifying struggles for basic rights. Nuns in El Salvador were receiving death threats from the US-backed military regime and its associated paramilitary groups. The right-wing extremists that governed the country trumpeted the slogan, Haz patria, mata un cura (“Be a patriot, kill a priest”), and after Romero’s murder, it was clear that no one was safe. In accepting the mission, Maura knew that there was a chance, even a likelihood, that she would meet the same fate as the archbishop. She went anyway. Markey’s research yields plenty of fascinating details. A month before Maura, Ita, Dorothy and Jean’s murders, for example, the US Embassy held an election night party. Following the news of Reagan’s victory, the Salvadoran military officials attending shot off celebratory rounds by the pool while the oligarchs sneered at their Carter administration hosts, calling them communists. Visiting the small, tormented nation in 1982, Joan Didion wrote, “terror is the given of the place,” and that “the dead and pieces of the dead turn up in El Salvador everywhere, every day, as taken for granted as in a nightmare, or a horror movie.” But in Didion’s report, truth is illusory; facts and numbers appear subjective and distorted, and the horrors which she nervously witnessed remain, despite her powerful prose, never fully communicated or comprehended. Not so for Maura Clark. The radical tenants of her faith rendered the conflict irrefutably simple: it was a righteous struggle of the oppressed against their oppressors. In El Salvador, Maura worked on the frontlines of the war in the northern mountains of Chalatenango, a stronghold of resistance besieged by state terror in those earliest stages of the war between the right-wing military dictatorship and the leftist Farabundo Martí National Liberation Front (FMLN) insurgency. Maura and her fellow clergy aided victims of the violence in Chalatenango, secretly ferrying refugees to camps in the capital; providing food, clothing, and medical supplies to those in need; and filing reports on the mounting human rights violations. Soon, death threats arrived in Maura’s parish, but the sisters refused to restrict their activities. They followed the path of clergy like Rutilio Grande, a Salvadoran priest murdered in in 1977, who before death prophetically warned: I am fully aware that very soon the Bible and the Gospels will not be allowed to cross the border. All that will reach us will be the covers, since all the pages are subversive . . . So that if Jesus crosses the border at Chalatenango, they will not allow him to enter. They would accuse him, the man-God . . . of being an agitator, of being a Jewish foreigner, who confuses the people with exotic and foreign ideas, anti-democratic ideas . . . Brothers, they would undoubtedly crucify him again. One night, the three nuns and one lay missionary set off from the airport together, and never made it home.", "url": "https://jacobinmag.com/2017/05/el-salvador-civil-war-reagan-cold-war-death-squads-sandinistas"}