{"authors": ["Angelique S. Chengelis", "The Detroit News"], "date_download": "2020-05-04 20:26:55", "date_modify": "2020-05-04 20:26:55", "date_publish": "2017-12-29 01:56:19", "description": "Tampa, Fla. — Michigan quarterback Brandon Peters has been described in the past as being quiet and soft-spoken, not loud enough in the huddle and on the line of scrimmage. Now, teammates...", "filename": "_729730d63e47480c81ad416f39252154_1588624015.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_729730d63e47480c81ad416f39252154_1588624015.html", "title": "Patterson transfer 'put a little fire' in UM's Peters", "title_page": "Patterson transfer 'put a little fire' in UM's Peters", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tampa, Fla. — Michigan quarterback Brandon Peters has been described in the past as being quiet and soft-spoken, not loud enough in the huddle and on the line of scrimmage.\nNow, teammates are using terms like “swagger” to describe Peters’ style, and have said that he’s taking a leadership role and becoming more vocal.\nPeters, who will be Michigan’s starting quarterback in the New Year’s Day Outback Bowl, seemed to deliver a message loud and clear on Thursday after Outback Bowl practice — he is not intimidated by the addition of Ole Miss transfer Shea Patterson.\nPatterson will enroll at the start of the year and likely will find out later in January whether the NCAA will waive the transfer rule and allow him to immediately compete. He and several teammates have transferred from Ole Miss after additional NCAA punishment. They are seeking to prove the program exhibited “egregious behavior” in misleading the players to come to Ole Miss in an effort to have the transfer rule waived.\nPeters admitted that the arrival of Patterson, the No. 1 quarterback in the 2016 class, has given him added motivation.\nMore: UM’s Winovich still mulls NFL, awed by ChadTough effort\n“It’s like someone coming into your house and taking something from you,” Peters said after practice Thursday. “You’re not going to let that happen. I’m not going to let someone come into my house and take something from me. It’s kind of that mindset.”\nPeters, who has participated in some high school football All-Star camps with Patterson, said he didn’t have much reaction to the transfer news.\n“I’m not worried about that right now,” Peters said. “Just focused on the game.\n“You just can’t worry about it too much. I just try to focus on myself and what I can do to get better. When you start worrying about other people and that kind of stuff, that can kind of throw you off a little bit and kind of mess with your mind. Just try to stay away from stuff like that and just focus on what I can do.”\nTight end Sean McKeon, one of Peters’ close friends on the team, said he has seen a positive reaction from Peters after the news of Patterson’s transfer.\n“He’s doing what he’s always done, just working hard,” McKeon said Thursday. “Put a little fire in him I think. He’s had a great bowl camp. He’s practicing really well. He’s being vocal, being a real leader for this offense. I think it’s great to see. Excited to see him play in the bowl game.”\nPeters competed 37 of 64 passes for 486 yards in five games played. Perhaps most important is that he has thrown four interceptions and no interceptions.\nMore: Bowl gives UM’s Devin Bush Sr. chance to show coaching chops\nMichigan coach Jim Harbaugh likes what he has seen from Peters, who started three games late in the season but missed the regular-season finale against Ohio State after suffering a concussion the week before at Wisconsin.\n“He’s been really good. Locked in, performing well,” Harbaugh said. “Been throwing the ball good. Been sharp. Mechanics are getting better and better. Just naturally he’s got a lot of talent, and just getting better with the mechanics every time he has an opportunity to go out on the practice field.\n“Every rep is great for him because it’s one of those positions that you can watch a play and it’s always something that you can see to get better at or coach. It’s not nitpicking, it’s just coaching. There’s always something in a quarterback’s play that you can coach or talk about and learn from. Every opportunity he has to go out on the field is great for him.”\nPeters’ teammates have seen him come into his own this season, especially since he took over as starter. He is now the No. 1 quarterback and will be challenged in the spring by Dylan McCaffrey, who is redshirting this year, Patterson and early enrollee freshman Joe Milton.\nSenior left tackle Mason Cole, who will tie a program record when he makes his 51st start in the Outback Bowl on Monday, said Peters’ confidence has grown.\n“The kid’s got a little swagger to him,” Cole said this week. “He runs around like he owns the place, and that’s what you want.”\nPeters laughed a bit when told of the swagger description.\n“I feel comfortable out there making all the calls and everything,” he said. “I guess if you want to say swagger, I guess so.”\nMore: Michigan QB John O’Korn reflects on ‘roller-coaster’ career\nHe was disappointed he had to miss the Ohio State game. Certainly, he understood why, considering he was still having post-concussion headaches midweek of the Ohio State game preparations. Peters was finally cleared midway through the next week.\n“I was down,” Peters said. “I was kind of mad. I wanted to get out there and play against Ohio State. It would have been a great opportunity. Felt like I was letting my team down now being able to get out there and compete.”\nNow he said he has a chance to make a statement in the bowl game and make it clear he runs the Michigan house as far as quarterback is concerned.\n“I’m not going to say the teams that I got a chance play against this year were bad teams, but playing against a good SEC team, an 8-4 team, being able to have a breakout game and play well, I think I could make a huge statement,” Peters said.\nachengelis@detroitnews.com\ntwitter.com/chengelis", "url": "https://apnews.com/729730d63e47480c81ad416f39252154"}