{"authors": ["Alexis Zanghi", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Ed Burmila", "Mindy Isser", "Elizabeth Capelle", "David Madden", "Peter Marcuse"], "date_download": "2020-05-04 19:49:42", "date_modify": "2020-05-04 19:49:42", "date_publish": "2017-11-15 00:00:00", "description": null, "filename": "2017_11_rent-landlords-housing-minneapolis-gentrification_1588621782.html", "image_url": "https://images.jacobinmag.com/2017/11/15111823/landlord.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_11_rent-landlords-housing-minneapolis-gentrification_1588621782.html", "title": "Making Rent and Rent-Making", "title_page": "Making Rent and Rent-Making", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn 1981, Minneapolis was facing an affordable housing crisis. Rents had risen 61 percent in the five years since the repeal of Nixon-era rent controls; they were expected to increase another 10 percent the following year. A number of condominium conversions had decreased available units, and the city’s vacancy rate had fallen from 4 to 3.4 percent. With rent increasing as much as 7.6 percent in just a few months, tenants found that they could not survive. The cost of an efficiency unit consumed roughly 30 percent of the household budget for an individual making minimum wage. At the time, fifty thousand of Minneapolis’s residents had incomes below the federal poverty level, and, of these, ten thousand very low-income residents paid more than half of their income towards rent. In response, tenants organized for a city ballot referendum on rent control that would have limited the amount landlords could increase rent per year — a practice now referred to as rent stabilization — while also prohibiting owners from converting rentals into condos. The Minnesota Multi-Family Housing Association, a lobbying group that works to “protect the interests of multi-family housing at all levels of government,” argued that “rent control would hurt citizens by increasing taxes on residential, commercial and industrial properties … and also lead to declining neighborhoods by creating strong incentives for landlords to increase their cash flow by deferring maintenance.” The movement for tenants’ rights in Minneapolis was not isolated. A 1979 report from Congressional Quarterly detailed a “New Urban Housing Crisis” confronting American renters, a group which accounted for roughly one third of the population. The national vacancy rate was 5.7 percent; rent increases were outpacing stagnating incomes; more than half of renter households were cost-burdened. As the price of homeownership escalated, many Americans faced the prospect of permanent tenancy. Meanwhile, landlords insisted that these rent increases were not keeping up with “utility costs, maintenance, property taxes, insurance, mortgage financing and other expenses.” The parallels with today’s housing crisis are so striking as to be redundant. Despite the national vacancy rate being significantly higher (7.7 percent), 49 percent of renter households remain cost-burdened. Of these, a quarter are severely cost-burdened. The market, rent control critics imply, will fix this problem through supply and demand. In theory, an improved vacancy rate and increased housing availability would alleviate household cost burdens. But rents continue to rise, even as zoning grows more flexible and multi-family housing construction returns to pre-recession levels. If the housing market is so efficient as to not require intervention, why does affordable housing remain in crisis?\nCost Burdens In September, roughly fifty people gathered in the basement of Calvary Baptist Church in Minneapolis’s Whittier neighborhood to hear residents of 2611 Pleasant Avenue South describe their units, their new landlord, Villa Nova Properties, LLC, and its management company, Nexus Real Estate Services. Inquilinxs Unidxs por Justicia (United Renters for Justice), a tenants’ rights group in Minneapolis that organizes “to the left and from below,” put the event together. Flora Dominguez explained that her windows do not fully close, which means inadequate insulation during winter in the country’s coldest city. Further, the condensation that collects year-round is producing mold. Dominguez’s fourteen-year-old son has asthma, and the mold, not to mention the cockroaches in neighboring units, were major concerns. During an interview, Dominguez estimated that rent consumed a little less than half of their family’s monthly budget — what the Joint Center for Housing Studies considers “severely cost-burdened.” The Dominguez family faced a 15 percent rent increase; meanwhile, fifteen families who live at 2611 Pleasant Avenue were facing eviction and displacement. Obie Lopez said he knew the building was being sold when the owners started making small cosmetic improvements, but he was already in eviction proceedings. He had lived in Whittier for twenty-four years and founded the neighborhood’s community garden. Nexus refused to deposit his rent checks and was already showing the home he shared with his three children to prospective renters. (Under pressure from Inquilinxs, Nexus relented, and Lopez was permitted to stay in his unit.) Following Dominguez’s and Lopez’s statements, the group marched from Calvary Church to Nexus’s nearby office, papering it with signs that read RENT CONTROL NOW. When asked how she hoped her landlord would respond, Dominguez replied, “No more rent increases, because frankly, if we’re living in these buildings, it’s because we don’t have the means to be living elsewhere.” Buildings like 2611 Pleasant Avenue are considered naturally occurring affordable housing (NOAH), or Class B and C properties. Class B apartments are older buildings with some maintenance issues that attract lower-income tenants. Class C apartments are in worse condition: more than twenty years old, in need of renovations and infrastructural improvements, and located in less desirable areas. Units in Class B and C buildings account for three-quarters of the Twin Cities’ affordable housing stock. In recent years, Minneapolis has primarily added units in Class A buildings — new-build, “luxury” rentals, a sector that’s growing increasingly soft. Of the 5600 new units planned for 2016, only one in ten were designated affordable. Even then, affordability is measured by the region’s average median income: $90,400 for a family of four. As a result, subsidized, affordable units remain out of reach for low-income households, and they rely on naturally occurring affordable housing: Class B and C units. So do landlords and investors. In June, Multi-Family Executive declared Class B and C apartments “the darlings of investors for this year and the next.” While Minneapolis has a fund intended to preserve what it calls “at-risk properties in opportunity areas,” the federal government does not subsidize NOAH units: market constraints determine their affordability, which leaves these properties vulnerable to speculative investment. Cited for numerous housing code violations, Dominguez and Lopez’s former landlord Q.T. Properties sold 2611 Pleasant Avenue and thirteen other buildings to Villa Nova, a related entity of Just Home Properties, which specializes in “creative solutions for owners of problem properties.” Such investments are relatively low-risk in Minnesota. The state doesn’t have a just-cause eviction ordinance, which means that landlords can evict tenants with as little as one month’s notice and for almost any reason. Renters have been displaced after a new owner decides their credit score is insufficient (regardless of rental payment history) or after having a baby. The Greater Minnesota Housing Trust, an affordable housing nonprofit, estimates that the city loses five thousand affordable units each year. Households that are not displaced still face significant hardship: a study by the Minneapolis Department of Public Health has found that 40 percent of the city’s households are cost-burdened. With some of the worst racial disparities in the nation, Minneapolis’s percentage of cost-burdened households can rise to 70 percent in neighborhoods that are majority people of color. As affordable housing reaches “crisis” levels — a low vacancy rate, massive rent increases with as little as a month’s notice — these communities have few recourses.\nA Brief History of Rent Control A few blocks away from where Dominguez and Lopez live, seven mayoral candidates gathered for a forum on affordable housing in yet another church. We were in Stevens Square, a low-income, majority cost-burdened neighborhood comprised almost exclusively of naturally occurring affordable housing. As the candidates bickered over the precise meanings of words like “gentrification” and “displacement,” the forum went over time, allowing for only one question from the audience: “Do you support rent control? Why or why not?” The audience had been mostly reserved, but the mention of rent control filled the church sanctuary with overwhelming whoops and applause. The response prompted Jacob Frey, then a city councilman running for mayor, to leap out of his chair and declare with Macronian zeal: “It depends what you mean by rent control.” He had a point. In the United States, “rent control” is often reduced to a single paradigm, based on regulations undertaken after World War II, but it’s a varied practice that traces its history to the early modern era. In 1592, following the Spanish Armada’s invasion, the French court issued a temporary moratorium on rent payments in Brittany; in 1649, it issued a jubilee for indebted tenants. Shortly after an earthquake in Lisbon on November 1, 1755, the King of Portugal froze rent payments at October rates, and ordered refunds on any increases paid. Governments have long enacted rent-control measures to prevent price gouging during times of housing scarcity. Modern legislation emerged in Europe and the United States as an emergency measure during World War I. Increased urbanization and the wartime lull in construction had reduced vacancy rates to as low as 1 percent in major cities, which induced landlords to start raising prices. Following rent strikes and pressure from tenant unions, local and state officials created fair-rent commissions and instituted price ceilings. As wages rose and housing supply improved in the 1920s, rent controls were relaxed then eventually repealed. When the United States entered World War II, the federal government once again put rent controls in place. They continued until 1950, coinciding with one of the largest housing stock expansions in the country’s history. At that time, even conservatives considered rent control a necessary social intervention; an article in the Cornell Law Review warned that too-high rents would “create class feeling.” After the postwar housing shortage ended, some cities, like New York, maintained first-generation rent controls on housing built before 1947 in hopes of allowing essential low- and middle-income workers, like teachers and EMTs, to live in the neighborhoods where they worked. Some criticized these measures for negatively impacting the housing supply by discouraging investment in new developments — despite the fact that most new construction was exempt from rent control — and encouraging property abandonment and neighborhood divestment. But this supply-side analysis omitted several key elements that impact housing supply. Identified by Peter Marcuse in a 1981 study called “Rent Control and Abandonment: What the Figures Show,” these factors include stagnated wages, increased housing operating costs, neglected public services, and redlining practices. This supply-side oversimplification also served an agenda: later that year, the same criticisms justified federal legislation that threatened to eliminate housing subsidies in cities with rent control laws. Around this time, second-generation rent controls attempted to reconcile tenants’ needs for affordable housing with landlords’ concerns regarding returns on investment. Instead of a firm price ceiling, initiatives like rent stabilization limited how much rents can increase annually, accounting for increased maintenance costs and taxes. But measures that undermine tenant protections — such as California’s Ellis Act, which permits wholesale building evictions if a landlord intends to sell — have hampered rent stabilization programs’ efficacy. Tenants will always have limited resources relative to their landlords. Absent substantial disincentives and sufficient enforcement, property owners will find ways to extract maximum profit on the backs of tenants. The new crisis hasn’t produced stronger tenant protections. Instead, market urbanists focus on increasing supply, urging cities to repeal outdated zoning regulations, eliminate off-street parking requirements, permit accessory dwellings, increase housing density, and encourage mixed-use development. But these solutions cannot help tenants who are facing hardship and displacement now. Without a better understanding of what constitutes “affordable,” new housing developments will do little to substantively aid low-income households, already unable to cover rent on supposedly affordable units.", "url": "https://jacobinmag.com/2017/11/rent-landlords-housing-minneapolis-gentrification"}