{"authors": ["Staff Reports"], "date_download": "2020-05-04 20:31:56", "date_modify": "2020-05-04 20:31:56", "date_publish": "2017-04-19 17:00:00", "description": "(Calhoun, Ga.) -- According to the American Cancer Society, skin cancer is by far the most common form of cancer. In observance of National Skin Cancer Awareness Month, Gordon Hospital, in...", "filename": "_b765174f2bac4987bdc7d4099d68902c_1588624316.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b765174f2bac4987bdc7d4099d68902c_1588624316.html", "title": "Gordon Hospital to offer free skin cancer screening", "title_page": "Gordon Hospital to offer free skin cancer screening", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "(Calhoun, Ga.) -- According to the American Cancer Society, skin cancer is by far the most common form of cancer. In observance of National Skin Cancer Awareness Month, Gordon Hospital, in partnership with the Skin Cancer and Cosmetic Dermatology Center, will offer free skin cancer screenings on Monday, May 1 from 4 – 5:30 p.m. at the Harris Radiation Therapy Center to give people the opportunity to have their skin checked by health professionals.\nSkin cancer begins in the cells of the skin. The three main types of skin cancers are basal cell skin cancers, squamous cell skin cancers, and melanomas. Basal and squamous cell skin cancers are the most common and are usually found on parts of the body that are regularly exposed to the sun. Basal and squamous cell cancers are unlikely to spread, but it is still necessary to treat them early to prevent further damage. Melanomas are not as common, but they are much more dangerous. Though almost always curable in its early stages, melanomas are likely to spread if left alone. The American Cancer Society estimates that in the United States alone in 2017, about 87,110 new melanomas will be diagnosed and about 9,730 people are expected to die of melanoma.\nLimited space is available, so please call 706.879.5850 to register for this free screening.\nAbout Gordon Hospital\nFounded in 1935, Gordon Hospital is proud to be a member of Adventist Health System. With 45 hospitals in nine states, Adventist Health System is a faith-based healthcare organization headquartered in Altamonte Springs, Florida. A national leader in quality, safety, employee engagement, and patient satisfaction, Adventist Health System’s more than 80,000 employees maintain a tradition of whole-person health by caring for the physical, emotional, and spiritual needs of every patient.", "url": "https://apnews.com/b765174f2bac4987bdc7d4099d68902c"}