{"authors": ["Tribune Staff Report"], "date_download": "2020-05-04 20:28:30", "date_modify": "2020-05-04 20:28:30", "date_publish": "2017-01-07 05:00:00", "description": "Jane Logan Gordon, a retired IBM employee, died on Friday, Dec. 23, 2016. She was 78. She was born on Dec. 25, 1937 to the late Ruth Comegys Logan and William Moncure Logan. She spent her...", "filename": "_8e62fb20b7be4add9eab2a2b5129e57c_1588624110.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8e62fb20b7be4add9eab2a2b5129e57c_1588624110.html", "title": "Jane Logan Gordon, 78, retired IBM employee", "title_page": "Jane Logan Gordon, 78, retired IBM employee", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jane Logan Gordon, a retired IBM employee, died on Friday, Dec. 23, 2016. She was 78.\nShe was born on Dec. 25, 1937 to the late Ruth Comegys Logan and William Moncure Logan. She spent her early years in Philadelphia and Washington, D.C. Gordon was educated in the public schools of both cities and graduated from the Philadelphia High School for Girls in June 1955.\nShe worked her way through Howard University and graduated with a bachelor’s degree in mathematics and physics. She started a career in education as a junior high school mathematics teacher, serving briefly in the public schools in Washington D.C. and for six years at Sayre Junior High School in Philadelphia. In 1968, she began a 25-year career with IBM. Robinson enjoyed an exciting and rewarding career in a variety of assignments providing technical support for mid-range IBM systems. She savored the friendships made during her IBM career and continued them long after her retirement.\nHer family said she embraced retirement from IBM with unbridled enthusiasm, rekindling a love for travel and competitive bridge. She combined both interests by participating in tournaments around the country and delighting in friends that she made in the bridge world.\nRobinson’s enthusiasm for NFL football was evident in her more than 30 years as an Eagles’ season ticket holder. She enjoyed nothing more than those outings at the stadium for home games.\nShe was preceded in death by her sister, Lois A. Baker.\nShe is survived by: her niece, Susan Baker; nephew, Michael Baker (his children, Kahri, Kaleb, Logan, Josie and Isabella); cousins, Courtney Higginbotham, Phyllis Simms, Harriet Logan, Rosemary Townes, Gordon Townes and Linda, Jamir and Karim Ahmed.\nA memorial service will be held Thursday at 11 a.m. at West Laurel Hill Cemetery and Funeral Home, 225 Belmont Ave., Bala Cynwyd.\nIn lieu of flowers, the family requests that any gifts be made to the American Cancer Society at www.cancer.org, 1 (800) 227-2345 and/or Howard University Development/ Giving, Washington D.C. at https://giving.howard.edu/, (202) 238-2340.", "url": "https://apnews.com/8e62fb20b7be4add9eab2a2b5129e57c"}