{"authors": ["Sam Mckewon", "World-Herald Service"], "date_download": "2020-05-04 21:07:07", "date_modify": "2020-05-04 21:07:07", "date_publish": "2017-12-21 17:20:00", "description": "LINCOLN — Nebraska’s not done with its 2018 recruiting class. Not by a long shot. But coach Scott Frost — who has spent the last three weeks juggling duties at two schools — said Wednesday...", "filename": "_d6d2c7d79f714f10b71a66b1c1c4c17d_1588626427.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d6d2c7d79f714f10b71a66b1c1c4c17d_1588626427.html", "title": "Frost's first recruits usher in new era of Nebraska football", "title_page": "Frost's first recruits usher in new era of Nebraska football", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN — Nebraska’s not done with its 2018 recruiting class. Not by a long shot.\nBut coach Scott Frost — who has spent the last three weeks juggling duties at two schools — said Wednesday he was pleased with how NU’s class was shaping up after Day 1 of the new December signing period.\nThe Huskers won a few high-profile battles. They lost a few, too.\nOn Wednesday, they signed 10 players, including the quarterback Frost coveted most, an in-state star committed for more than two years and three junior college prospects.\nAs of Wednesday night, recruiting services had NU’s class ranked among the weakest in the Big Ten. Then again, Minnesota had 25 signees. NU had less than half of that.\nFrost, speaking by phone from Central Florida, said he expects to sign a class of more than 20.\nFor now, he preached prudence.\n“One thing we weren’t going to do was sign kids to fill spots,” Frost said. “We want kids who we know can become good people and can become good football players. We have a lot of work left to do here in January, but I’m excited about the guys we have on board, and I think a lot of things will shake out after signing day, so we’ll know which kids are available and which kids we can go after.”\nThis is the first year of the December signing period voted into law by the NCAA last spring. Prospects who sign Wednesday, Thursday or Friday avoid the “circus” of the next months, Frost said. He likes the early signing period for that reason. But it created a time crunch for him and his assistants, all of whom are helping UCF prepare for the Peach Bowl. So they crammed in what they could.\nSome highly rated commits dropped the Huskers. Others hopped on, such as quarterback Adrian Martinez of Fresno, California.\nFrost is a big fan of Martinez, a 6-foot-2, 205-pound consensus four-star who picked NU over Tennessee.\n“Adrian was my favorite guy in the country,” Frost said. “We didn’t think we had a chance to get him at our previous school, but now, getting to Nebraska, he was interested. He was like a lot of kids on offense are going to be when we have time to get out and share our message and our vision with them.”\nThree recruits on offense bought in Wednesday, making for a happy Husker breakfast, lunch and late afternoon snack.\nFirst, just after 8 a.m., Atlanta receiver/tight end Katerian Legrone officially switched from UCF to NU, signing his letter of intent. Legrone was the second of two UCF commits to follow Frost — and position coach Sean Beckton — to Nebraska.\n“I already had a great relationship with the coaches, so when Nebraska offered me the scholarship it was pretty much a no-brainer,” Legrone said. “Coach Beckton is my guy. He’s pursued me from the jump. We talk four times a week. It was real important when Coach Beckton went to Nebraska.”\nBeckton was a longtime UCF aide who left his alma mater.\n“He’s one of the best men I know, and a couple of those kids were committed to him at UCF, and they called him and told him they wanted to play for him and for us,” Frost said. “A few of them were good enough players for us to think they’d be really good in the Big Ten. When they called and said they wanted to come with us, it was an easy decision.”\nJust before noon, the Huskers picked up junior college All-America running back Greg Bell, who posted two 1,000-yard seasons at Arizona Western and picked NU over Tennessee live on a TV station in his hometown of San Diego. Bell visited Dec. 8.\n“It was good,” Bell said of his visit. “It was cold, but it felt like family out there, and I feel like Coach Frost has something special going on out there.”\nBell, who ran for 1,217 yards and 11 touchdowns in 10 games this season, will have two years of eligibility. He is NU’s first junior college running back signee since Kenny Wilson in the 2006 class, and he adds intrigue to a position that didn’t have a 500-yard rusher.\nLater in the afternoon, receiver Jaron Woodyard — Bell’s Arizona Western teammate — reaffirmed his commitment to Nebraska, signing via Periscope video from his home in Maryland. Along with Jones County (Miss.) Junior College safety Deontai Williams, NU had three junior college signees.\nIn three years under Mike Riley, the Huskers didn’t sign any.\n“I don’t want to make a living off of junior college players, but if they’re good kids and we think they can play and add to what we’re doing, we’re going to give them an opportunity,” Frost said. “I think you’re crazy if you rule out any option or any method of getting players that can help you win football games.”\nOther prospects didn’t sign Wednesday.\ntight end Justin McGriff from Tampa, Florida, indicated he will sign with NU Friday. tight end Messiah Swinson from Long Island, New York, will sign with either Missouri or Nebraska on Friday; he attended his grandmother’s funeral Wednesday. Butler County (Kan.) Community College linebacker Will Honas told The World-Herald on Wednesday that he could sign with Nebraska, Iowa or Kansas State this week, but he might visit Wisconsin in January and bring the Badgers into the mix.\nTwo receivers from Florida — Jeshaun Jones and Marcus Riley — chose Maryland and Louisville, respectively, over Nebraska. Longtime NU commit Cameron Brown, as many recruiting analysts expected, flipped to Ohio State, joining his St. Louis Christian Brothers teammate Kamryn Babb as a Buckeye.\nThat meant all seven of Riley’s ballyhooed receiver/cornerback commits in the 2018 recruiting class dropped the Huskers. The leader of the seven, Brendan Radley-Hiles, pushed his announcement date to Jan. 6 but didn’t list the Huskers in his top four.\nThough Radley-Hiles often got the publicity, the true tentpole, Beatrice tight end Cameron Jurgens, was the first prospect to commit, back in the summer of 2015.\nJurgens looked hard at LSU, but two conversations with Frost convinced him to stay with Nebraska. Jurgens said he got “chills” thinking about helping resurrect Husker football. Frost, who called Jurgens an “elite” talent, has the ability to evoke such feelings.\nEven over the phone Wednesday, Frost invoked his former coach Tom Osborne and spoke of what once made NU great — its reliance on the walk-on program. He said fans get too enamored with star rankings. He cautioned anyone overlooking the current roster, which he said had more talent than the 4-8 record would suggest.\nFrost is bullish on his system, staff and worldview. He played for great Nebraska teams. He believes he knows how to get there again.\n“The kids are really going to have a lot of fun playing for us, playing in our schemes,” Frost said. “And we’re going to make them better. And the ones who don’t want to come along will be left behind, but the ones that do are going to develop and become a lot better for it.”", "url": "https://apnews.com/d6d2c7d79f714f10b71a66b1c1c4c17d"}