{"authors": ["Matt Bruenig", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:10", "date_modify": "2020-05-04 19:57:10", "date_publish": "2017-01-17 00:00:00", "description": null, "filename": "2017_01_rich-universal-basic-income-piketty-passive-income-capital-income_1588622230.html", "image_url": "https://images.jacobinmag.com/2017/01/17232928/euroshandshake-1200x800-1-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_01_rich-universal-basic-income-piketty-passive-income-capital-income_1588622230.html", "title": "The Rich Already Have a UBI", "title_page": "The Rich Already Have a UBI", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe universal basic income — a cash payment made to every individual in the country — has been critiqued recently by some commentators. Among other things, these writers dislike the fact that a UBI would deliver individuals income in a way that is divorced from working. Such an income arrangement would, it is argued, lead to meaninglessness, social dysfunction, and resentment. One obvious problem with this analysis is that passive income — income divorced from work — already exists. It is called capital income. It flows out to various individuals in society in the form of interest, rents, and dividends. According to Piketty, Saez, and Zucman (PSZ), around 30 percent of all the income produced in the nation is paid out as capital income. If passive income is so destructive, then you would think that centuries of dedicating one-third of national income to it would have burned society to the ground by now.\nTithing to the 1 Percent In 2015, according to PSZ, the richest 1 percent of people in America received 20.2 percent of all the income in the nation. Ten points of that 20.2 percent came from equity income, net interest, housing rents, and the capital component of mixed income. Which is to say, 10 percent of all national income is paid out to the 1 percent as capital income. Let me reiterate: one in ten dollars of income produced in this country is paid out to the richest 1 percent without them having to work for it. Even if you exclude the capital component of mixed income (since it is connected to work even if the income is not from labor) and housing rents (since these are imputed to homeowners rather than paid to them as cash), that still means that, from equity income and interest alone, the top 1 percent receives 7.5 percent of the national income without having to work for it. Put another way: the average person in the top 1 percent receives a UBI equal to 7.5 times the average income in the country. If passive income is so destructive, then the income situation of the 1 percent surely is a national emergency! Where does the 1 percent get its meaning with all of that free cash flowing in?", "url": "https://www.jacobinmag.com/2017/01/rich-universal-basic-income-piketty-passive-income-capital-income"}