{"authors": ["Steve T. Gorches - Columnist"], "date_download": "2020-05-04 20:06:06", "date_modify": "2020-05-04 20:06:06", "date_publish": "2017-11-17 01:36:48", "description": "It may not quite be like Forrest Gump and his future wife: “Me and Jenny go together like peas and carrots.” But you can definitely use a metaphor about Michigan City head coach Phil Mason and...", "filename": "_c945d3ea662f40d5a8d80663501b6c9c_1588622766.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c945d3ea662f40d5a8d80663501b6c9c_1588622766.html", "title": "Gorch on the Porch: Friendship forged from football", "title_page": "Gorch on the Porch: Friendship forged from football", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It may not quite be like Forrest Gump and his future wife: “Me and Jenny go together like peas and carrots.” But you can definitely use a metaphor about Michigan City head coach Phil Mason and assistant Roydon Richards being married to football.\nOr maybe they’re spouses to each other through football.\nHow else do you explain one of them going over to the other’s house at 1 a.m., every Friday during high school football season, even though they were coaching different teams?\n“Every Friday night at around 1 o’clock he would knock on our back door before he went home after the game,” Richards said about Mason when the duo was at Hammond Morton and Andrean, respectively. “At first, he’d only come over if one of us lost, and then he’d always come over. So I would have food ready for us. My wife always wondered why he didn’t just come to the front door.”\nMason and Richards began at the same school — East Chicago Central with Richards starting there as a defensive coordinator in 1990, then head coach in 1994, while Mason arrived in ’95 as Richards’ D-coordinator.\n“He’s my best friend,” Mason has said on multiple occasions.\nIronically, their first game together was at Kokomo to open the regular season, and now they’ll be together at Kokomo again for an historic Class 5A semistate contest on Friday night.\nThey have a bond that has lasted through a combined eight coaching jobs and three counties over the span of 22 years.\n“I was looking for a teaching job and East Chicago has an opening,” Mason recalled. “We eventually were both at Hammond schools (Richards started at Morton in 1999, while Mason’s first head-coaching position was at Clark the same year) and when I went to Wheeler, he stayed at Morton.”\nThey faced each other both years Mason was at Clark — both wins by Morton, 14-0 and 7-6. After that, Mason was head coach at Wheeler from 2001 through 2005, then went to Andrean to be an assistant under Brett St. Germain for two years before ascending to head coach in 2008.\nThose two games in Hammond were the only times they faced as head coaches (Andrean beat Morton in 2006 when Mason was an assistant), and that’s how they wanted it for logical reasons.\n“We vowed to not play each other during the regular season so we could scrimmage each other every summer, and then pick each other’s brain during the season,” Richards said.\nOf course, one of the times that brain-picking usually took place was at 1 a.m., after Friday night games.\n“We’ve just always fed off each other and worked well together,” said Mason in a bit of an understatement since two years at Michigan City have produced a 16-7 record so far and the program’s first sectional and regional titles.\nTheir friendship even resulted in the ultimate anomaly in Lake County football: a whole team actually liking Andrean.\nMost Lake County teams aren’t fond of Andrean. Whether it’s conference foes such as Highland and Munster (you should have heard some of the things Munster people were saying about Mason in the press box during City’s 28-14 sectional-opening victory four weeks ago) to more competitive conference rivalries with Lowell and Griffith (Mason called Andrean-Griffith games “a bloodbath”) to everyone else not in the same conference.\nHeck, even Lake Central has a reason to not like Andrean since plenty of players who lived in the LC district ended up at the Catholic school in Merrillville (yes, the Pirates just down the street on Broadway don’t have Andrean on their Christmas card list, either).\nBut while Richards was at Morton, his players and Andrean players had a mutual friendship. Sure, it was probably due to their scrimmages in the summer that were laid back and naturally friendly. But nonetheless, the Governors and 59ers truly liked each other and it was illustrated on two different occasions a year apart.\nIn 2010 when Morton won its only regional title — also a bit of irony since the win came at Concord, just like City’s first regional title last week — the semistate game at home against Fort Wayne Dwenger was moved to Saturday for travel considerations.\nSo, as Morton was practicing on Friday, here comes a bus with Mason and the rest of Andrean’s team, which lost a tough regional game at home against South Bend St. Joseph the week before.\n“They showed up to wish us luck in our semistate game,” Richards said. “It was really cool.”\nThe following season in the first week of sectional, Mason and Andrean had another heartbreaking loss. It was the ultimate gut-punch when the undefeated 59ers lost at home to Wheeler. The loss hit the Morton kids hard too, even though they were still on the field when they received the news.\n“We were playing our sectional game (at Gary West Side) and we heard the Andrean score during the game a few times, and were thinking, ‘oh, they’ll come back,’” Richards said. “Then my quarterback, Chris McCormack, came to the sidelines to get a play, and we heard it announced, ‘Final score, Wheeler 12, Andrean 7.’ Chris actually went down to a knee and was a little emotional.\n“He told me, ‘Coach, you gotta call him (Mason), you gotta call him.’ I told him, ‘Chris, run the play and we can call him after the game.’”\nYou can bet that 1 a.m. meeting was emotional.\nThey’ve been through a lot in between East Chicago and their success this season that’s unprecedented at Michigan City. Well, it’s not unprecedented for the coaching duo since Mason has been to multiple semistates and Richards led Morton to its first sectional and regional titles.\nDespite making history this year with the hope of more to come, Richards still likes those early days of their friendship a little more.\n“That was when it was fun to coach and it wasn’t all about records and trophies,” Richards recalled fondly.\nHe’s probably right, but these trophies are making Wolves’ fans very, very happy.\nReach sports editor Steve T. Gorches at sgorches@thenewsdispatch.com or (219) 214-4206. Follow him on Twitter @SteveTGorches.", "url": "https://apnews.com/c945d3ea662f40d5a8d80663501b6c9c"}