{"authors": ["Eli Francovich"], "date_download": "2020-05-04 20:13:11", "date_modify": "2020-05-04 20:13:11", "date_publish": "2017-02-18 00:00:00", "description": "A public school funding proposal unveiled by state Republicans earlier this month could reduce the amount of money Spokane’s poorest schools receive, according to local school...", "filename": "_3217ae1b57d24f17a785c52d60919792_1588623191.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3217ae1b57d24f17a785c52d60919792_1588623191.html", "title": "State Republican education funding proposal jeopardizes poorest students, Spokane educators say", "title_page": "State Republican education funding proposal jeopardizes poorest students, Spokane educators say", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A public school funding proposal unveiled by state Republicans earlier this month could reduce the amount of money Spokane’s poorest schools receive, according to local school administrators.\nRepublican lawmakers counter it is more transparent and accurate.\nThe proposal requests that school districts’ poverty rates be calculated using U.S. Census data. Currently, Washington school districts use free and reduced lunch percentages to report low-income schools and students to the state.\n“I’m hoping it goes away,” said Linda McDermott, Spokane Public Schools’ chief financial officer, of the proposal. “But if it doesn’t, we’re going to have to really make sure we understand the financial implications for us.”\nSen. Michael Baumgartner, R-Spokane, said the change improves accuracy and would send money to the students who need it most.\n“When schools self-report free and reduced lunch numbers, the numbers can be much less accurate, and the schools can be incentivized to increase the numbers on free and reduced lunch,” Baumgartner said.\nThe proposal has passed the Republican-controlled Senate, but not the Democrat-held House of Representatives where it will be negotiated.\nAccording to census data, about 25 percent of children in the Spokane area under the age of 18 live in poverty. However, 56 percent of Spokane students receive free or reduced lunch. Under the new proposal, full funding for high-poverty schools would only be awarded if 30 percent of the district qualifies using census data.\nIt’s not clear whether districts would be pro-rated if they fell below that 30 percent mark, McDermott said. The exact impact of the change isn’t clear. McDermott said the district currently receives about $8.5 million for its poorest students through the Learning Assistance Program.\nAccording to the bill, “an additional $2,000 to $5,000 per pupil guarantee for students in poverty. School districts with a poverty rate above 30 percent would receive $5,000 based on the number of poverty students exceeding the 30 percent threshold. Poverty rates would be calculated using small area poverty estimates by the United States Census Bureau as opposed to the number of students qualifying for free and reduced price lunches.”\nSpokane Public Schools Superintendent Shelley Redinger said that portion of the proposal would hurt students, a message she’s shared with lawmakers.\n“I just think we need to serve the students real-time,” she said. “The real-time needs. Not on past collection of numbers.”\nA related problem with changing the metric used to determine poverty is that other forms of state funding use free and reduced numbers. For example, McDermott said funding for K-3 class size reduction is different for high-poverty schools – as determined by free and reduced lunch percentages.\n“This is a huge shift,” McDermott said. “And the district doesn’t completely understand the why of the shift.”\nFree and reduced lunch is funded by the federal government, although it’s often used as a proxy to measure poverty in schools.\nIt’s not always an accurate comparison. To qualify for reduced prices or free lunch, families have to be at or below 185 percent of the federal poverty level – or an annual income of about $44,000 for a family of four.\nIn 2012, 31 million U.S. students were enrolled in the free and reduced lunch program.\nIn 2015-16, 44 percent, or 477,828 Washington students, received free or reduced lunch. U.S. Census data reported that 248,383, or 15.7 percent, of Washingtonians under 18 lived in poverty.\n“I certainly have concerns about that proposal,” said Sen. Andy Billig, D-Spokane. “You don’t help kids out of poverty simply by changing a label. You actually have to invest in their success.”\nBillig said he’s heard three main concerns about the Republican’s budget proposal, one of which is the change in how poverty is measured.\nRepublicans say the bill is designed to increase transparency and gives special needs students, homeless students and students who speak English as a second language more support.\nAlthough the Washington Education Association doesn’t support the Republican funding proposal, Rich Wood, an association spokesman, said it’s unclear how low-income students would be affected.\n“There is not enough accurate data right now to say definitely what the impact would be on any school or any school district,” he said.", "url": "https://apnews.com/3217ae1b57d24f17a785c52d60919792"}