{"authors": ["The New Mexican"], "date_download": "2020-05-04 20:22:36", "date_modify": "2020-05-04 20:22:36", "date_publish": "2017-06-22 01:00:00", "description": "Santa Fe Animal Shelter & Humane Society: Mirabor is an adorable 10-year-old female calico cat who enjoys playing with her toys and getting attention from our staff. She’s a large kitty who...", "filename": "_dc6b5b1d5a44411693616fb9bb5a90b7_1588623756.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dc6b5b1d5a44411693616fb9bb5a90b7_1588623756.html", "title": "Pet connection, June 22", "title_page": "Pet connection, June 22", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Santa Fe Animal Shelter & Humane Society: Mirabor is an adorable 10-year-old female calico cat who enjoys playing with her toys and getting attention from our staff. She’s a large kitty who happens to be a purring machine. Dante, a 7-month-old mixed breed male dog, loves playing with dogs his size. He’s doing well with his basic commands and will make one family a great companion.\nThese and other animals are available for adoption from the shelter at 100 Caja del Rio Road. The shelter’s adoption hours are from 11 a.m. to 6 p.m. daily. Visit adoptable animals in the community during the shelter’s weekend mobile adoption events: from 11 a.m. to 1 p.m. Friday, Adobe Propane, 17818 U.S. 84/285; from noon to 3 p.m. Saturday, PetSmart Santa Fe, 3561 Zafarano Drive; and from 11 a.m. to 2 p.m., Keller Williams Realty, 130 Lincoln Ave. Visit www.sfhumanesociety.org or call 505-983-4309, ext. 1610.\nEspañola Valley Humane Society: Suki is a sweet young female cat who is still a bit on the shy side. She’s 10 months old and will make a great addition to a quiet, mellow home. Rex, an 18-month-old mixed breed male dog, has a heart of gold. He was injured by a group of stray dogs and although he’s healed nicely, he is still shy and fearful. He can be timid in new situations, but with a reassuring hand and patience, he’s sure to make someone a great companion.\nThese and other animals are available for adoption at the shelter, 108 Hamm Parkway. The shelter is open from 10 a.m. to 4:45 p.m. Monday through Saturday and from noon to 4:45 p.m. Sunday. Call 505-753-8662 or visit www.evalleyshelter.org.\nFelines & Friends: A litter of four kittens found living under a shed in Santa Fe are doing well with their foster family and ready for new homes, preferably with a sibling or other young cat. Two are Turkish-Angora mixes, while another is a brown tabby mix and the fourth has a black-and-white tuxedo coat. Check them out at the group’s Petco adoption center.\nCats of all ages are available for adoption from Felines & Friends and can be visited at Teca Tu at DeVargas Center and Petco on Cerrillos Road and Santa Fe Cats. Adoption advisers are available from 1 to 4 p.m. Thursday through Sunday at Petco. For more information, call 505-316-CAT1 or visit www.fandfnm.org.\nThe Horse Shelter: Treasure is a 6-year-old, 15 hands, black-and-white pinto mare who is in training with Dale Fastle. Treasure and 12 other horses will be available for adoption at the group’s training event July 15 at the Santa Fe Rodeo Grounds.\nFind other adoptable horses at www.thehorseshelter.org or call 505-471-6179.", "url": "https://apnews.com/dc6b5b1d5a44411693616fb9bb5a90b7"}