{"authors": ["Danny Shapiro"], "date_download": "2020-05-04 20:09:43", "date_modify": "2020-05-04 20:09:43", "date_publish": "2017-11-21 18:35:59", "description": "Without forewarning or explanation, Jason Henderson is no longer Lamar University's athletic director, after more than five years on the job. Henderson briefly gathered the Lamar athletic...", "filename": "_c2611289c5ac43c5a4177e1443a2637c_1588622983.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c2611289c5ac43c5a4177e1443a2637c_1588622983.html", "title": "Lamar AD's swift exit leaves questions", "title_page": "Lamar AD's swift exit leaves questions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Without forewarning or explanation, Jason Henderson is no longer Lamar University’s athletic director, after more than five years on the job.\nHenderson briefly gathered the Lamar athletic staff Monday morning to announce he was leaving the position he held since June 2012, according to Lamar sports information director James Dixon.\nAttempts to reach Henderson for comment were unsuccessful.\nLamar released a statement Monday naming Norman Bellard as the school’s interim athletic director.\nThe statement made no mention of Henderson’s departure, and his biography has been removed from the Lamar athletic website.\n“Norman Bellard’s involvement with Lamar University, as a student-athlete, distinguished alumnus, Cardinals fan, and as a long-standing member of our staff, makes him uniquely qualified to serve as interim Athletic Director,” Lamar University President Kenneth Evans said in the statement. “We look forward to his leadership and vision as we move forward at this moment of unprecedented opportunities for Lamar University athletics.”\nNo timetable was given for hiring Henderson’s replacement, but according to the statement, “a full national search will begin immediately.”\nThe move came less than 24 hours after Henderson, 38, attended Sunday’s Lamar\nmen’s basketball game against Cal State-Bakersfield.\nHenderson, in his 11th year with the school, was named Lamar’s interim athletic director in 2011 before officially taking over in June 2012.\nNon-revenue sports, like cross country, women’s golf and men’s tennis, saw sustained success during Henderson’s tenure.\nThe school’s bigger sports - notably football and men’s basketball -struggled.\nAverage attendance at football games dropped from 11,000 in 2012 to 6,600 this season.\nLamar football on Saturday finished its worst season (2-9) since the program’s 2010 rebirth.\nMen’s basketball hasn’t made the NCAA Tournament since the 2011-12 season.\nBilly Tubbs, who preceded Henderson as Lamar’s athletic director, said he was surprised when he found out Henderson was no longer with the university.\n“Something I’ve learned is that all good athletic directors are winning lots of games,” Tubbs said. “It’s a tough ask and it’s hard to satisfy everybody, but I had no idea this was going to happen.”\nHenderson made $129,530 during the 2017 year.\nBellard has been with Lamar since 2015 as the assistant to the president for community relations and athletics program liaison.\nHe will continue that role in addition to his new duties.\n“My primary goal will be to continue to put a quality product on the fields and courts that is attractive to the community, both on campus and beyond,” Bellard said in the statement.\nDShapiro@BeaumontEnterprise.comTwitter.com/DannyShapiro13", "url": "https://apnews.com/c2611289c5ac43c5a4177e1443a2637c"}