{"authors": ["Dan La Botz", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Corey Robin", "Branko Marcetic", "Paul Heideman"], "date_download": "2020-05-04 19:59:13", "date_modify": "2020-05-04 19:59:13", "date_publish": "2017-07-26 00:00:00", "description": null, "filename": "2017_07_democratic-party-better-deal-schumer-unions-sanders-trump-kamala-harris_1588622353.html", "image_url": "https://images.jacobinmag.com/2017/07/26135833/3563755707_dc12d01864_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_07_democratic-party-better-deal-schumer-unions-sanders-trump-kamala-harris_1588622353.html", "title": "A Bullshit Deal", "title_page": "A Bullshit Deal", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The Democratic Party, in the person of Sen. Charles Schumer of New York, has launched a new slogan for its 2018 midterm cycle: “A Better Deal.”\nThe notion is to relate their current list of uninspiring policy proposals to Franklin Roosevelt’s New Deal of the 1930s and the Great Depression.\nAs the New York Times summarized Schumer’s launch, there’s some recognition of the party’s need to speak to working people’s concerns: a $15-an-hour minimum wage, an attempt to lower the cost of prescription drugs. But given that we have 20 million uninsured and may soon have 40 million, lowering drug costs doesn’t really speak to the seriousness of the problem. And Schumer’s emphasis on job-training programs, that old meritocratic, business-friendly policy of Democrats long favored by centrists like Bill Clinton — but with a long history of failing to actually ameliorate inequality or empower workers — hardly speak to the needs of millions of unemployed, underemployed, low-paid, and contingent workers.\nAfter being battered by Bernie Sanders, beaten by Donald Trump, and shown to be uninspiring and useless to even core sectors of their base, when offered an opportunity to show that they aren’t completely deaf to the needs and demands of the vast majority of the country, this is the best they can come up with. One has to wonder what the hell they are thinking.\nThe Dems fail to take up any of the slogans that allowed their populist competitors from both the left and the right to humiliate them in the last election. We see nothing in Schumer’s op-ed about universal, single-payer health care (and have heard next to nothing from others in the party on this, despite its widespread popularity). Nothing there about free college education, despite how wildly popular this proved to be during Sanders’s campaign. Nor — perhaps because, insofar as the “Better Deal” is aimed at workers at all, it’s aimed at a long-outdated notion of what the working class is that doesn’t take into account the actual diversity of the working class — is there anything about how black lives matter, nor immigrant rights, nor women.\nAnd it comes as no surprise that Schumer’s better deal doesn’t even mention labor unions. Labor law reform to make it easier for workers to organize unions, promised since Jimmy Carter and never taken up seriously by Bill Clinton or Barack Obama, has disappeared altogether.\nDo Schumer and the Democrats really think that they can link this pathetic program to the candidacy of another centrist like Kamala Harris — recently anointed by the Clinton money-machine managers — and somehow win in 2020? The establishment apparently thinks that they need another Barack Obama: cosmopolitan, with just enough political experience, but not enough to be a “Washington insider”; socially progressive, but not too far out; and most importantly, willing to take up the burden of managing global capitalism for New York banks.\nThe millions of young voters who were disappointed by Obama, inspired by Sanders, infuriated by Debbie Wasserman-Schultz, and then terrified by Trump will not be enthused by calls for a slightly better deal.\nThe American people don’t want a new deal or a better deal. As both Sanders and Trump said, the game is rigged, the cards have been stacked, the dealers are crooked. And the joint is run by the mob. Let’s get out of here. They can take this deal and shove it.\nWe need a new politics that gives expression to grassroots resistance. We want a party that pledges expanded Medicaid, a national health care system, free college education, jobs for all, living wages, respect for black lives, and protection for immigrants. We want a party that recognizes that working people are black and Latino, majority female, often LGBTQ, and that all of us want peace and a healthy planet.\nWe want the banks and corporations brought to heel and labor unions empowered. As the old song says, we want to own those banks of marble and take control of those corporations, using their wealth for the public good.\nThat’s not the New Deal, or the New Frontier, or the Great Society, or the Better Deal. It’s a society of democratic socialism. It won’t come from the Chuck Schumers of the world. It will have to come from us.", "url": "https://www.jacobinmag.com/2017/07/democratic-party-better-deal-schumer-unions-sanders-trump-kamala-harris"}