{"authors": [], "date_download": "2020-05-04 20:08:52", "date_modify": "2020-05-04 20:08:52", "date_publish": "2017-11-27 17:00:00", "description": "Capitol Broadcasting Company has purchased the Holly Springs Salamanders of the Coastal Plain League. Capitol (CBC) is the parent company of WRAL-TV, WRALSportsFan.com and the Durham...", "filename": "_d7c4a14408a06b47e3d3e7a687a863c3_1588622932.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d7c4a14408a06b47e3d3e7a687a863c3_1588622932.html", "title": "Capitol Broadcasting purchases CPL's Holly Springs Salamanders", "title_page": "Capitol Broadcasting purchases CPL's Holly Springs Salamanders", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Capitol Broadcasting Company has purchased the Holly Springs Salamanders of the Coastal Plain League. Capitol (CBC) is the parent company of WRAL-TV, WRALSportsFan.com and the Durham Bulls.\nCBC and the summer collegiate team announced the agreement Monday morning, and Mike Birling, the new vice president of baseball operations at CBC, said the company is excited about the future of Salamanders baseball.\n“We know a lot of those fans come to Bulls games; we want them to try the Salamanders as well,” he said.\nThe Coastal Plain League is a collegiate, wood-bat league that features 16 teams across North Carolina, South Carolina, Georgia and Virginia. The league boasts notable MLB alumni including Justin Verlander and Brandon Guyer.\n“Most people, during the college summer season, think of the Cape Cod League. This is pretty much one level below the Cape Cod League,” Birling said. “You’re going to see a lot of prospects from NC State, from Carolina, from Duke.”\nHe linked the purchase to CBC’s existing partnerships with Duke baseball and the ACC Baseball Championship, both played at the home of the Bulls, Durham Bulls Athletic Park.\n“This is just kind of the next step in the evolution,” Birling said.\nThe Salamanders franchise, which originated in 2015, plays its home games at Ting Park in Holly Springs.\nThe 1,800-seat facility features a synthetic turf field, two locker rooms and digital scoreboard, among other amenities, and is owned and operated by the Town of Holly Springs.\n“Holly Springs has done a tremendous job just building that area,” Birling said. “That’s one of the reasons why were were interested in purchasing that team. They definitely have the best stadium in the Coastal Plain League. We think we can grow the fan base there.”\nHolly Springs Mayor Dick Sears called the deal a win-win.\n“Their marketing expertise will be most welcome, and we look forward to a long and successful relationship,” Sears said.", "url": "https://apnews.com/d7c4a14408a06b47e3d3e7a687a863c3"}