{"authors": ["Sam Craig Daily Sun Staff Writer"], "date_download": "2020-05-04 20:05:49", "date_modify": "2020-05-04 20:05:49", "date_publish": "2017-11-25 16:00:00", "description": "It’s about 7 in the morning and Betty Replogle is getting to school at Paddock Lane Elementary. She’s got a meeting at 7:45 that morning, but there are hugs to give and...", "filename": "_063df9e29d004d6db1d93c5e79f8a8d5_1588622749.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_063df9e29d004d6db1d93c5e79f8a8d5_1588622749.html", "title": "Lesson learned: Meet the people who keep Beatrice Public Schools running", "title_page": "Lesson learned: Meet the people who keep Beatrice Public Schools running", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s about 7 in the morning and Betty Replogle is getting to school at Paddock Lane Elementary.\nShe’s got a meeting at 7:45 that morning, but there are hugs to give and receive.\nReplogle, the principal at Paddock Lane, likes to greet the kids as they arrive just in time for breakfast. As she meanders through the tables, she says hello to the students and asks them what they’re reading in class.\nLife for the students and staff at Beatrice Public Schools can be difficult to observe from the outside, however. Sometimes all parents have are a few notes home and a quick “I dunno” after asking what students did in school that day. The Beatrice Daily Sun followed around a few members of BPS staff to get a taste of what school is like for the people who keep the bells ringing and the pencils sharpened.\n***\nOver at the middle school, Mike Policky is talking to his third period American History class about the upcoming National History Day.\nIt’s kind of like a history-themed science fair, where eighth graders have to create a poster board about a topic in American history based on the central theme of “Conflict.” There’s only about a month and a half left, but the kids have some questions about the presentation and subsequent test.\n“It will affect your grade,” Policky said. “It’s a 100-point test.”\nThe students will have to explain why they chose their topic, how they went about designing and developing their board, what some of the challenges were in the process and how it applies to the theme. Even more challenging, the students have to keep it all under 500 words, which Policky thinks might be a problem for a few of them.\nThere will be more time to discuss National History Day later, right now, it’s time to turn in homework.\nOne of his students left his book in his locker, along with his homework.\n“That’s a terrible place for it,” Policky said. “Get it to me next period.”\nWith homework turned in, it’s time to get down to business. The class is on chapter four of their American History textbook: the colonies.\nKing George of England put through the Royal Proclamation of 1763, which prevented colonists from settling west of the Appalachian Mountains.\n“Everybody up,” Policky said. “We’re going on a luxury liner from England to the colonies.”\nThe kids stand and walk to the back of the room where there’s a little alcove with a door leading to the next classroom.\nThey’re in England, or at least a reasonable facsimile of it. Squashed into a corner, there’s not enough land for everyone in England, so some students hop on a boat, which will shortly land in New England.\n“No, no, no, don’t sit down,” Policky said. “We’re almost in America.”\nWhen the first batch arrives, there are only a few kids in America and, even though they can’t go past the third desk, there’s plenty of room to stretch their arms. Then a few more kids come over, and a few more, until they’re too crammed in to do much of anything.\nThey can’t go past the Appalachians, said Policky, who was playing King George.\nThere’s nearly a revolt as more than a dozen kids try to stay in the aisle between two rows of three desks. But, just before the revolution can begin, the bell rings.\n“We’re going to continue this tomorrow,” Policky said. “Have a good day, everybody.”\nThe kids rush out into the hallway and Policky stands by, arms crossed over his chest.\nHe supervises his end of the hallway during passing periods, making sure everything remains orderly.\nThe sound of running footsteps come rushing toward his room. The student who forgot his book in his locker has returned with his homework.\n“Thank you,” Policky said, carrying the slightly wrinkled sheet of paper to his desk.\n***\nIt’s lunchtime at Stoddard Elementary and there’s a buzz of excitement.\nIt’s Halloween, so first and second grade students dressed in their costumes come shuffling toward the cafeteria.\nA kid who’s outside for recess comes barreling back in through the doors. There’s news from the outside.\n“It’s snowing,” he yelled. “It’s snowing on Halloween!”\nStudents who are now halfway into the cafeteria pause, angling their heads toward the window. They’re considering whether to head out to catch the first snowflakes of the season or to see what sort of spooky treats the cafeteria staff have cooked up for Halloween lunch.\nBecky Smith and Kellie Carpenter are serving the kids who are lined up, and it’s a perfectly eerie menu.\nThere’s witches fingers, eyeballs and teeth—chicken fingers, grapes and corn, respectively. There are cookies too, but they’re a shade of pink and not very scary.\n“ I think the potatoes are the tombstones,” Carpenter said, pointing to scoops of mashed potatoes.\nThey start their day at 8:30 a.m. when the first pair go home after serving breakfast. All of the food gets dispatched out of the high school and distributed to all the other schools.\nIt seems like all of the kids are lined up for a hot lunch, which is a bit unusual, Smith said.\n“It’s usually 180, 200 kids for lunch,” she said. “It depends on what we have, too. If it’s something they really like, like this, we fed 217 today.”\n***\nOver at Paddock Lane, Replogle is walking through the cafeteria, talking to a group of kindergartners.\nOne boy is having trouble with a packet of mayonnaise, so Replogle stops to open it for him.\nShe gets invitations to sit down from nearly every student. They’ll pat the bench beside them, in hopes that she’ll join them.\n“Everybody wants to eat lunch with Mrs. Replogle,” she said. “Everybody.”\nFor three weeks of the school year, she worked the kindergartners’ noon recess while the school made some changes with personnel. Until they could get someone into that position, she went out for recess every day with the kindergarten class. Now, she said, some of them think of her as the recess teacher.\nNearly her whole day is spent with the kids. Whether it’s taking the kids from the skills class to Wal-Mart to pick out groceries, or popping into classrooms around the school, once the first bell rings, she’s almost always around the kids.\n“Kids always want to read to me when they first learn how to read,” Replogle said. “They want to share reports with me. I learned an awful lot about spiders last week.”\nHer office is across from the nurse’s office where some students are popping in for their lunchtime medications.\nSome need pills, some need to get insulin shots—the kids with insulin like to chat with Replogle about their current blood count—and some just need bandages after tripping on the playground.\nDistrict Registered Nurse Shannon Kleveland and Paddock Lane Nurse Maxine Gowen are on hand to help with nearly anything that might happen in a day.\n“Kids with temperatures, kids with migraines, fever,” Gowen said. “We’ve had kids in here with broken ankles, broken arms.”\nThe more serious injuries typically require a doctor or emergency room visit, but sometimes the best cure is just some quiet time on the bed in the nursing office.\nThe day before, the nurses had a little boy come in with a pain in his side. Thinking it might be appendicitis, they called his mother and she made an appointment with the doctor. After applying an ice pack and waiting a few minutes, however, the diagnosis changed.\n“After he laid down, (he) decided he didn’t have that pain anymore,” Gowen said.\nGowen—who goes by “Nurse Max” to the kids—and Kleveland spend a lot of their time teaching kids and parents about health.\nHealthy eating, vision testing, hygiene advice and sometimes even giving supplies out if they’re needed, are all a part of their day, Kleveland said. Sometimes it’s not that easy though, Gowen said, like last Monday when they had 65 kids come through the office with various ailments.\n“I wish we had more time in the day,” Gowen said. “Sometimes our day is just not long enough.”\n“It’s rewarding,” Kleveland added. “Helping the kids, helping the families. When they come in and greet you with a smile in the morning.”\nAfter 44 years in education and 30 years with Beatrice Public Schools, Replogle says she feels the same way.\nSpending the day with kids and watching them grow and learn is a reward for a life spent helping kids become good adults, she said.\n“Time with the kids is always my most favorite thing to do,” she said. “That’s why I’m still doing this.”", "url": "https://apnews.com/063df9e29d004d6db1d93c5e79f8a8d5"}