{"authors": ["Julia Perkins"], "date_download": "2020-05-04 20:05:08", "date_modify": "2020-05-04 20:05:08", "date_publish": "2017-09-11 18:09:20", "description": "Bethel High School senior Alyssa Furtado knelt down on the blue alphabet rug in a Berry School classroom next to two first-grade boys during a recent 10-minute independent reading time — one child...", "filename": "_b5d55d8a84314ab8972e968bfc26545f_1588622708.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b5d55d8a84314ab8972e968bfc26545f_1588622708.html", "title": "Bethel students pick their path", "title_page": "Bethel students pick their path", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Bethel High School senior Alyssa Furtado knelt down on the blue alphabet rug in a Berry School classroom next to two first-grade boys during a recent 10-minute independent reading time — one child was reading a picture book by Eric Carle, the other a book on killer whales.\nWhen Furtado, a prospective teacher who spent her second morning in the classroom Thursday, asked the boys about their books, they whispered about the animals and pondered whether one of the killer whales in a picture was an adult or baby.\n“Try to finish your book,” Furtado told them. “Did you finish it?”\nBecause the boys still had a few more pages to read, she moved over to three children at a table.\nFurtado is one of about 70 students in Bethel High’s “Pathways” program, which allows students to pick a field they are interested in, take high school and college-level courses in the subject and do a relevant internship. The idea is to give students practical experience in a particular field before they go off to college or a career.\nFurtado selected the education pathway, one of five the district offers. Throughout the year as a “cadet\nteacher,” she will not only observe first-grade teacher Danielle Dispenza — who taught Furtado herself in kindergarten — but eventually write lesson plans and teach classes.\n“Teaching is a career I’m interested in going into,” Furtado said. “I thought this would be a good opportunity to see if teaching is what I want to do.”\nLast year, 15 students graduated with certificates from pathways in education and global studies, but this year the district added programs in health care, business, and career and technical readiness, which includes science, manufacturing, technology, the trades and engineering disciplines. Most participants are juniors and seniors, but freshmen and sophomores can also join.\nStudents can do an internship and must build relationships with local businesses. Those in the health care pathway may work at Danbury Hospital and train to be emergency medical technicians.\nThrough the program, students become immersed in their fields, Bethel High School Principal Chris Troetti said.\n“We want to help them to see what it is to work in this field,” he said. “What are the pitfalls? What are the things they’re going to love? For some kids, it solidifies their decision and for some kids, they realize, ‘This is not what I want to do.’”\nIt is much better for kids to figure this out in high school, rather than a few years into college, Troetti said.\n“Some students go through three years plus of college and they realize late in the game because of lack of experiences that this [major] isn’t the thing for them,” he said. “The hope is that by giving them these experiences in high school, they can make some informed decisions.”\nResearch has shown that today’s students spend more than the usual four years in college. On average, students take five years to earn their bachelor’s degrees, according to a National Student Clearinghouse Research Center report that examined students who graduated with bachelor’s degrees between July 2014 and June 2015. A quarter took six years to finish school, according to the report.\nThe pathways program could help students avoid spending thousands of dollars on an extra year or two of college, Superintendent Christine Carver said.\n“More importantly, they have a better sense of what it is they want to do in life,” she said.\nJay Murray, associate vice president for enrollment services at Western Connecticut State University, said the majority of students entering their freshmen year either do not know what they want to study or change their major later.\n“We’re asking a lot of a 17-, 18-year-old,” Murray said. “We’re putting pressure [on students] that this is going to frame the rest of your life, as opposed to saying, ‘It’s O.K. not to know.’ That’s the conversation that needs to happen more often.”\nHe said Bethel’s pathways program could be beneficial for students.\n“It’s very helpful at the collegiate level,” Murray said. “The earlier we can expose students to opportunities they didn’t think of, [the better]...Maybe the student didn’t even know that career existed and I think that’s the value of it.”\nDoing internships can also set students apart when they apply to college, especially if admissions officials are unsure whether to accept the applicant, he said.\n“The extracurricular, co-curricular pieces, the intangibles, the recommendations, the essay, really come into play for those students who we call ‘on the bubble,’ ” Murray said.\nLinda Anderson, who organizes the “cadet teachers” program, said students have told her the experience helped them tremendously in college and in the classroom. The district has offered the opportunity for over 10 years, but tied it to the education pathway last year.\nOne participant was a cadet teacher in high school, graduated from Western Connecticut State University and returned to teach at Berry High School where she now has a cadet teacher of her own.\n“It was the greatest experience for her in college,” Anderson said. “Instead of saying, ‘What happens if?’ she could say, ‘I did that in my classroom.’”\nThe education pathway strives to give students a more well-rounded learning experience, with students taking courses in psychology and public speaking, and learning how to become a certified teacher in Connecticut.\n“The whole pathway is built around college-career readiness attributes that are set forth by the Common Core State Standards,” Anderson said. “That’s really the important part of it, that we’re trying to get them ready for practical, real-work experiences, as well as continuing their future education.”\nBut not all the students in the program want to go to college. Students can learn a trade through the career and technical readiness pathway, while the education track allows teens to gain hours to become certified to work in a day care.\nSenior Tanner Trew became a cadet teacher this year, although he is leaning toward entering the Coast Guard, rather than pursuing a career in education after graduation. With four younger siblings and even more little cousins, he said the program was perfect for him.\n“I really like working with kids,” Trew said. “I just want to be a good role model for the younger kids coming in.”\nTroetti said the school hopes to add further opportunities for other students, including an arts pathway.\n“We have so many students who are really high performing in the arts, so we want to do give them that opportunity to earn the certificate there as well,” he said.", "url": "https://apnews.com/b5d55d8a84314ab8972e968bfc26545f"}