{"authors": ["Richard Seymour", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:40", "date_modify": "2020-05-04 19:51:40", "date_publish": "2017-01-17 00:00:00", "description": null, "filename": "2017_01_corbyn-populism-labour-brexit-tories-immigration_1588621900.html", "image_url": "https://images.jacobinmag.com/2017/01/17233037/jez-corbyn-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_01_corbyn-populism-labour-brexit-tories-immigration_1588621900.html", "title": "Corbyn, the Unlikely Populist", "title_page": "Corbyn, the Unlikely Populist", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn 2017, with Labour’s post-coup polling still in the pits, Team Corbyn is trying something new. They’re going to take a “populist turn,” accentuating an anti-Westminster, anti-establishment politics. To an extent, this is smart thinking, which seeks to exploit the very crisis of politics that made Jeremy Corbyn’s leadership possible. Prior to winning the leadership, Corbyn pointed out how hollow the political system in Britain had become. He said that thanks to low turnout, the Conservatives were able to govern with less than a quarter of the vote. There isn’t a vast number of people in political parties in Britain, but that’s not to say we’re living in a totally depoliticized society. Look at the 250,000 that came on the anti-austerity march last weekend . . . I think we need to build a social movement. The analysis was astute. Everywhere the establishment center breaks down, the same factors are in play. One of the worst ideas, in this context, would be to try to shore up the old “vital center.” The “center” is such because it represents the consensus of the powerful. But in a Britain which has just undergone a “lost decade” in terms of wage growth, and worse is to come, where a low-productivity economy is facing further stagnation in the Brexit future, no one wants to hear the elite’s consensus any more. Anyone trying to shore up the center would be taken down with it. Anyway, the Left will never be able to win on the center’s terms. It cannot promise to administer capitalism more effectively because it has to challenge capitalist power. It cannot promise to win the media battle, because it has to attack the consensus over which pundits, journalists, and broadcasters stand guard. If there is hope for the Left, it has to come from elsewhere.\nPolling Pressure But the “social movement” doesn’t just materialize at will. You can practice movement politics, but you can’t wish a movement into existence. And Labour is an electoralist institution, to its marrow. If Corbyn is to keep the leadership, he has to find a way to make the party electorally plausible. Labour’s electoral weaknesses are serious. The Fabian Society argues in a recent study that Labour could be left with “only 140 to 200 big city and ex-industrial constituencies” based on its current poll ratings of approximately 28 percent. At the heart of this dilemma, the Fabians claim, is Brexit. Labour has lost four times as many “Leave” voters as “Remain” ones. Labour, it says, has to regain Leave voters while holding on to its current strongly Remain base. The first-past-the-post system makes a Labour victory in 2020 “currently unthinkable.” The trade union leaderships which rallied behind Corbyn expect him to at least to demonstrate that he can improve Labour’s electoral chances. They took a big gamble in supporting him, but now Unite leader Len McCluskey has none-too-subtly warned that Corbyn will have to go if the polling doesn’t improve. In the absence of any countervailing movement, the overwhelming pressure on Corbyn (or any Labour leader) will always come from the Right. The gravitational pull of the media and the dominant institutions will ensure it. And the common sense of these institutions is that if you have a polling problem, you occupy the center where the majority are supposed to be. So Corbyn has to formulate an alternative to moving rightward. He has to find a way to add to Labour’s current base, which is the radicalized minority in British society, without compromising on his goals. The “populist turn” is intended to be this alternative.\nThe “Establishment” Left-wing populism makes a certain amount of sense in this context. A populist strategy would involve defining a “them” and “us” — a nefarious elite, and a virtuous people. In principle, that could cut across the divide over Brexit, and be attractive to many who currently won’t vote Labour. Corbyn has been reluctant to do this, though, focusing his attacks on the traditional Labour enemy, “the Tories,” as if the deepest antagonisms in British society could be mapped onto parliamentary political competition. So his New Year message, in which he attacked “the establishment” for letting down “the people,” was a step forward. “The establishment” is a distinctly British notion, almost equivalent to what Podemos calls “la casta,” the name for an alliance of politicians and big business playing by different rules from everyone else. In the United Kingdom, however, it has a more antique feel, rather like the use of “the Firm” to refer to the royal family. It describes networks of senior civil servants, judges, aristocrats, Oxbridge-educated intellectuals, media barons, top police officers, and business owners, whose domination is long entrenched. We have seen “the establishment” at work repeatedly. In the elite debacles of Iraq and the credit crunch, and in the squalid Hackgate scandal in 2011 (disclosing collusion between police and newspapers involved in phone hacking and other misdemeanors) and, from another angle, the various elite child abuse scandals. Collapsing trust in major institutions such as the banks, the press, Parliament, and the European Union, has been accelerated — but not caused — by these scandals. This is the raw material on which, with the Left in utter disarray until recently, right-wing populism has worked to toxic effect by fusing it with nationalist racism. Like Bernie Sanders, who also used populist strategies and shrugged off media disdain with a certain Brooklyn sangfroid, Corbyn has a certain amount of credibility as an “outsider” having never had, or aspired to, conventional career success. His integrity is doubted by no one, and his worst enemies concede that he has always been a good MP who goes out of his way to help his constituents. But the idea of Corbyn as a populist leader doesn’t entirely convince. And it’s not just because you don’t quite launch a populist campaign with a series of briefings and press statements saying you’re launching a populist campaign. At the moment, it resembles nothing so much as the class swot trying to be one of the cool kids. Populism depends on character. While all politicians engage in populist tactics sometimes, any politician who wants to undertake a populist strategy has to have a certain charisma. A populist leader should embody, in some way, the superior being that “the people” would like to be. He attracts narcissistic investment in his personality, because he seems to represent the best ideals of “the people.” But equally importantly, he also gives the people permission to hate. Like it or not, effective populism knowingly and deliberately mobilizes the dark side. This is what is transgressive about it. The British left has always been priggish about this, tending to conflate “the politics of hate” with those of the far right. The far right are certainly gifted at orchestrating and conducting hate toward the usual targets — immigrants, Muslims, “globalists,” and so on. But as Bernie Sanders demonstrated without conceding an inch to this sort of politics, it is possible to articulate a class hatred sincerely and effectively. One can, in the name of every casualty of capitalism, uncompromisingly revile the “billionaire class” and its political advocates, without giving ground to bigotry. Corbyn, though, is currently too nice to be a populist: hate is not his metier. If Labour really wants to go down this path, he will either have to draw out the more lupine aspect of his appearance and character, or delegate nastiness to one of his colleagues.", "url": "https://www.jacobinmag.com/2017/01/corbyn-populism-labour-brexit-tories-immigration"}