{"authors": ["Dave Boyer", "S.A. Miller The Washington Times"], "date_download": "2020-05-04 20:19:52", "date_modify": "2020-05-04 20:19:52", "date_publish": "2017-10-18 09:19:26", "description": "President Trump accused Rep. Frederica Wilson of fabricating a story that he told widow of a Green Beret killed in Niger that her husband \"knew what he signed up for.\" \"Democrat...", "filename": "_47181ed3f9e3361ea44092cf2fdf5053_1588623592.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_47181ed3f9e3361ea44092cf2fdf5053_1588623592.html", "title": "Trump tangles with Democratic congresswoman over call to Green Beret's widow", "title_page": "Trump tangles with Democratic congresswoman over call to Green Beret's widow", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Trump accused Rep. Frederica Wilson of fabricating a story that he told widow of a Green Beret killed in Niger that her husband “knew what he signed up for.”\n“Democrat Congresswoman totally fabricated what I said to the wife of a soldier who died in action (and I have proof). Sad!” the president wrote on Twitter.\nMrs. Wilson, Florida Democrat, said she was in the car with Myeshia Johnson on Tuesday when Mr. Trump called to express condolences for her loss and overhead parts of the conversation on speakerphone.\n“Yeah, he said that. To me, that is something that you can say in a conversation, but you shouldn’t say that to a grieving widow,” Mrs. Wilson told ABC affiliate WPLG-TV News in Miami. “That’s so insensitive.”\nAfter the president’s tweet, Mrs. Wilson balked at the claim that he has “proof” about his conversation with the widow.\n“I don’t know what kind of proof he could be talking about. I’m not the only person that was in the car,” she said on CNN. “I have proof, too: this man is a sick man. He’s cold-hearted, and he feels no pity or sympathy for anyone.”\nShe added that Johnson’s widow “broke down” after her call with Mr. Trump, saying the president “didn’t even know his name.”\nMrs. Wilson was accompanying Mrs. Johnson to Miami International Airport to meet the body of her husband, Sgt. La David Johnson.\nMr. Trump had already weathered criticism in the news media of waiting nearly two weeks to contact the families of Sgt. Johnson and three other special forces soldiers killed Oct. 1 in an ambush in Niger.\nThe president said Monday that he had written letters to the families and planned to call after allowing “a little time to pass.”", "url": "https://apnews.com/47181ed3f9e3361ea44092cf2fdf5053"}