{"authors": [], "date_download": "2020-05-04 20:25:09", "date_modify": "2020-05-04 20:25:09", "date_publish": "2017-05-16 07:00:00", "description": "Claire Foy is reportedly set to star in 'The Girl in the Spider's Web'. The 33-year-old actress - who is known for portraying Queen Elizabeth II in the popular drama series 'The Crown' - is...", "filename": "_4f3cfde0d8e14bcd8d470f5e8cb22ffb_1588623909.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4f3cfde0d8e14bcd8d470f5e8cb22ffb_1588623909.html", "title": "Claire Foy's in talks to star in The Girl in the Spider's Web", "title_page": "Claire Foy's in talks to star in The Girl in the Spider's Web", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Claire Foy’s in talks to star in The Girl in the Spider’s Web\nClaire Foy is reportedly set to star in ‘The Girl in the Spider’s Web’.\nThe 33-year-old actress - who is known for portraying Queen Elizabeth II in the popular drama series ‘The Crown’ - is believed to be in talks to appear in the next instalment of the ‘Girl With the Dragon Tattoo’ franchise, according to Variety.\nHowever, the blonde-haired beauty has yet to receive an offer to play the role of Lisbeth Salander, although it is rumoured she will be asked to join the production in the near future.\nAnd Sony has yet to comment and confirm the potential casting.\nIt has been reported if Foy is offered the role, and she accepts, she will be cast as the lead character as the computer hacker, which has previously been played by Noomi Rapace in the 2009 movie and Rooney Mara in the remake two years later.\nHowever, it is rumoured Foy is also in the running to be cast in Damien Chazelle’s next project ‘First Man’, alongside Ryan Gosling, and it is believed if she accepts the role in the Universal production it could conflict with her starring in ‘Girl With the Dragon Tattoo’ follow-up.\nThe production team are also in the midst of casting Mikael Blomkvist, which was previously portrayed by Daniel Craig.\nThe 39-year-old filmmaker, Fede Alvarez, is set to direct the upcoming film, and will receive assistance from Scott Rudin, Søren Stærmose, Ole Søndberg, Amy Pascal, Elizabeth Cantillon, Eli Bush, and Berna Levin who will be on hand to produce the movie.\nAlvarez is also helping to pen the script alongside Steven Knight and Jay Basu, whilst David Beaubaire will oversee the project.\n‘The Girl in the Spider’s Web’ is scheduled for release on October 19, 2018.", "url": "https://apnews.com/4f3cfde0d8e14bcd8d470f5e8cb22ffb"}