{"authors": ["Keeanga-Yamahtta Taylor", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:01", "date_modify": "2020-05-04 19:51:01", "date_publish": "2017-01-17 00:00:00", "description": null, "filename": "2017_01_trump-black-lives-racism-sexism-anti-inauguration_1588621861.html", "image_url": "https://images.jacobinmag.com/2017/01/17233322/32069273840_a2f0140d64_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_01_trump-black-lives-racism-sexism-anti-inauguration_1588621861.html", "title": "No Time for Despair", "title_page": "No Time for Despair", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Donald Trump has been inaugurated as the forty-fifth president of the United States. The shock and disbelief that greeted his election more than two months ago must now give way to defiance and organizing.\nPart of that pivot demands that we understand how we got here in the first place, but more importantly, how we move forward. Understanding what happened in the election is absolutely necessary to understanding what happens next.\nMany have commented on Trump’s victory simplistically. The best example of this is when CNN’s Van Jones characterized Trump’s election as revenge, or a “whitelash,” against black voters, who overwhelmingly voted for Obama in 2008 and 2012.\nWe can’t reduce the election outcomes to whites’ collective revenge for the presidency of Barack Obama. It is an assessment that avoids many inconvenient truths about the Democratic Party, while dramatically overstating the depth of support for Trump and his politics across the country.\nThe first problem with this narrative (aside from the fact that tens of millions of white people voted for Obama twice) is that it promotes a mistaken story that African Americans benefited from the presidency of Barack Obama, and that those supposed benefits have come at the expense of ordinary white people.\nThe genuine fear and disgust of Trump has contributed to intense revisionism and mythology when it comes to the record of Barack Obama, and while we can all recognize the power of symbolism, and even subscribe to the notion that there was value in the election of an African American to the highest office of a nation born and built on the backs of enslaved black labor, we should not let that acknowledgment cloud our ability to think clearly and tell the truth.\nObama’s presidency was not a gift to black people. It represented the painful continuity of racism, discrimination, and inequality that has always been at the center of black life in America.\nEight years later, black unemployment remains twice the rate of whites. Eight years later, 38 percent of black children continue to live below the official poverty line. Eight years later, a shocking 55 percent workers, mostly black women, make under $15 an hour.\nIt was precisely the inability of the Obama administration to improve the conditions of ordinary black people’s lives that gave rise to the Black Lives Matter movement in the first place.\nThe second problem with the “whitelash” story is that it reduces any critique of the last eight years to a racist backlash. It is similar to the argument that Hillary Clinton’s campaign failed centrally because of sexism.\nWe certainly cannot downplay the extent to which racism and sexism played a critical role in Trump’s success. We have seen how Trump’s rise has unleashed violent white supremacists and given them the confidence to organize out in the open. There were well over a thousand hate crimes reported in the month after the presidential election. But if we only understand Trump’s success in terms of racial resentment and whitelash, then we make wrong assumptions about a generalized right-wing sweep across the United States, with white people universally lining up behind Trump, waiting to receive their marching orders.\nThat perception clashes violently with markers of public opinion. Fifty-eight percent of Americans think Obamacare should be replaced with federally funded health care for all. Sixty-six percent of Americans support raising the minimum wage to at least $10, 59 percent support raising it to $12, 48 percent support raising it to $15, an idea that has been demonized by Republicans and Democrats alike.\nSixty-one percent of Americans say the rich pay too little in taxes, which is up from 52 percent a year ago. 69 percent of Americans believe that providing affordable housing is important. Sixty-three percent of Americans say money and wealth distribution is unfair. Fifty percent of whites say blacks are treated less fairly by police than whites, and 50 percent of whites think the country still has work to do for blacks to achieve equal rights with whites.\nThis is hardly the portrait of a right-wing America. So how do we square this with the election?\nWe must begin with the fact that tens of millions of Americans did not bother to vote. There are 238 million voters in the United States, and of that number, 60 million of them voted for Trump. And even among that number, 5 percent of people who voted for him said he was unfit to be president.\nOn its own, yes, that is sixty million people who voted for a vile racist and sexual predator. But in the wider context, it means that one in four eligible voters chose Trump. That is hardly representative of what white people think. And that is the other part of the story: that literally tens of millions of voters decided not to vote at all.\nThe media and other political operatives describe the decision not to vote as apathy. It is an easy description that requires little thought or analysis of the problem within electoral politics, that creates so little confidence, and so much indifference, even when it appears that so much is at stake. One need look no further than the Democratic Party to fully understand the problem.\nSince the shock of the election, the Democrats have blamed their losses on Fox News, the FBI, bad messaging, and the Russians. But there is virtually no reckoning with the political shortcomings of the party. There is no reckoning with how the party that purports to be a party of the people consistently fails to connect with the basic ideas of fairness and justice that are at the core of those statistics that I read earlier.\nBut this lack of connection is not a flaw in messaging. It is the product of a party that fully embraces the logic of neoliberalism and the political status quo.\nThis is why Hillary Clinton ran a campaign focused on Trump’s abhorrent behavior, as opposed to a positive campaign on what Democrats could do to transform the lives of ordinary people. But it was impossible for Clinton to argue that her party would deliver change and break the grip of the political order that privileges the rich and powerful, when it was her party that has been in power for the last eight years. Clinton promised to be the third term of Obama, failing to realize that for millions of voters, two terms was enough.\nEight years ago, Obama ran on the promise of hope and change. But with big expectations and big hope come even bigger disappointment when you fail to deliver. It is absolutely true that the Republicans have been obstinate, recalcitrant, and opposed to giving Obama anything. It speaks to the complete dysfunction of our political system. But it is not just the obstinacy of the GOP that has been the problem. It was also the conservative priorities of Obama’s political agenda.\nIf you embrace the market, privatization, and the norms of neoliberalism, then there is only so much change that can be expected from your administration. Obama raised everyone’s hopes, but could not deliver — not just because of the Republicans, but also because of this constrained political agenda of the Democratic Party.\nIn other words, we cannot understand the rise of Trump and Trumpism by only looking at what the Republicans have done. We must also understand it in terms of what the Democratic Party has not done. Embedded inside of every right-wing backlash is the failure of the liberal establishment to deliver a better way.\nThe lesser evil always paves the way for the greater evil.\nWhere Obama used the machinery of deportations to banish 2.5 million people from the United States, it has set the way for Trump to do so in a more emboldened way. Where the Obama administration embraced the values of choice and privatization in gutting public education, Trump will do so in an even more fantastical way, that looks to finish the job of killing public education.\nThe political conservatism of the Democrats contributes more generally to liberal paralysis when the Right does the same things, but on a much larger scale. We have to ask, why is it that the largest action planned last weekend was organized by women who initially didn’t even consider themselves activists, or didn’t want to call the march a protest, while some of the largest organizations in the country are still walking around shell-shocked and completely unprepared to challenge Trump?\nThese are the same organizations who tell us that we must support the Democratic Party, no matter what, to stop the evil, maniacal Republican Party. The Democratic establishment expects poor and working-class people to suffer in silence, as long as they keep voting Democrat. Trump will be a disaster for the working class, make no mistake about it. But the Democrats have been a disaster in slow motion, as inequality and injustices grow.\nDemocrats do nothing but tell us to wait and hope for things to be different, and for those who get tired of being lied to and decide that they don’t want to continue to vote for what they don’t want, they are vilified. This is the case when liberals blame depressed black voter turnout for the election results. But it is also true when liberals lash out at working-class white people for “voting against their interests” — as if somehow voting for the neoliberal, albeit civil and well-mannered politics of the Democratic Party are in the interest of the working class.\nWorking-class interests are never on the ballot in our elections. When our political choices are constrained within the parameters of the existing two-party system, voter discontent can go in one of three places: your party, the other party, or no party at all. But if your conclusion, that ordinary people are either backward or apathetic because of their relative disinterest in the presidential election, then you are truly missing what is happening in this country.\nThere is deep anger and disgust with the political status quo in the United States. The Occupy movement, Black Lives Matter, the heroic pipeline struggles in North Dakota, and the thirteen million people who voted for Bernie Sanders have unearthed that to the world.\nWhen systemic problems become too large to ignore, when socialists start gaining millions of votes, for example, or when black people riot and rebel in the streets, the news media is forced to provide some explanation. And in doing so, they typically give us fractured glimpses of reality. But rarely do they piece together the entire picture. Consider four separate news stories from last year.\nThe first is the continuing crisis of the opioid addiction crisis in this country. There are two million people addicted to opioids in the United States, a disproportionate number of whom are white. From 2009 to 2014, almost half a million people have died from opioid overdoses, a fourfold increase since 1999.\nA second story, briefly in the news, reported on the decline in life expectancy for white women. It is unprecedented for life expectancy to reverse in a so-called first-world country. In the United States peer countries, life expectancy is actually growing. Why is life expectancy for working-class white women in decline? Drug overdose, suicide, and alcohol abuse.\nIn Chicago, the story has been the rise in shootings and murders in the city’s working-class black neighborhoods. In 2016, there were 4,379 people shot in Chicago, and 797 people killed. The overwhelmingly majority of both were African-American.\nThe news media’s nonsensical explanations for the violence include retaliation. But that is only matched by the nonsense offered by elected officials, which includes the absence of role models and poor parenting. What is almost never offered as at least part of the answer is how Chicago has the highest black unemployment rate of the nation’s five largest cities at 25 percent, that nearly half of black men aged 20 to 24 are neither in school nor employed, that Chicago has the third-highest poverty rate of large cities in the US, and that it is the most segregated city in the country.\nFinally, there is the story of the shrinking of the so-called middle class. In the 1970s, 61 percent of Americans fell into that vague but stable category. Today, that number has fallen to 50 percent. It is driven by the growing wealth inequality that exists in this country.\nIn the last year alone, the one percent saw their income rise by seven percent, and the .1 percent saw their income rise by 9 percent. In general, the richest 20 percent of US households own 84 percent of the wealth in this country, while the bottom 40 percent own less than one percent.\nThe media would have us believe that this is a story primarily about the Rust Belt and disgruntled white workers. In fact, it is also a story about 240,000 black homeowners, who lost their houses to foreclosures in the last eight years. It is also a story about urban school closures and the decimation of employment for black educators. Thousands of black teachers have been fired in the last decade.\nThese four prominent stories reported on over the last several years are often told separately, reinforcing the perception that different groups of ordinary people in this country live in their own world and have experiences that are wholly separate from each other. But what would happen if we put these stories together, and told them as a single narrative about life in this country?\nIf we told them together, it could allow us to see that the anxieties, stresses, confusions, and frustrations about life world today are not owned by one group, but are shared by many. It would not tell us that everyone suffers the same oppression, but it would allow us to see that even if we don’t experience a particular kind of oppression, every working person in this country is going through something. Everyone is trying to figure out how to survive, and many are failing.\nIf we put these stories together, we would gain more insight into how ordinary white people have as much stake in the fight for a different kind of society as anyone else.\nWe wouldn’t so casually dismiss their suffering as privilege, because they do not suffer as much as black and brown people in this country. In fact, we might find that the privileges of white skin run very thin in a country where nineteen million white people languish in poverty.\nApparently, the wages of whiteness are not so great that they can stop millions of ordinary white people from literally drinking and drugging themselves to death, to escape the despair of living in this “greatest country on earth.”\nIf we put these separate stories into a single story, we could make better sense of why socialism is rising in popularity, why people have taken to the streets over the last six years to protest the growing and racial and economic inequality. There are 400 billionaires in this country. They are the reason why there are forty-seven million poor people. You cannot have untold, obscene wealth unless you have untold, obscene poverty. That is the law of the free market.\nAnd how does this parasitic one percent of the population hold onto their wealth when we are so many? Racism, immigrant bashing, homophobia, transphobia, sexism, nationalism — they get us to fight each other while they hoard their wealth, and they keep our stories separate from each other, so that we never understand the entire story, only our particular part of it.\nBut knowledge alone of the existence of racism, inequality, poverty, and injustice does not equip with our side with the political tools needed to fight the battles of today or fight for a socialist future. We need struggle, but we also need politics, because we must contend with a political establishment that wants to lower our expectations, to believe that this existing society is the best that we can expect from humanity.\nHillary Clinton ran a campaign of low expectations, a campaign that cynically pivoted around the notion that ordinary people shouldn’t ask for too much. For all the excitement that Bernie Sanders’ campaign generated for rightly demanding more, his commitment to remaining in the Democratic Party then threatens to neuter his political revolution. Expecting the Democratic Party to fight for the democratic redistribution of wealth and resources in this country is like expecting to squeeze orange juice out of an apple. It is impossible.\nWe must build independent organizations and political parties that are not connected to the Democratic Party, or that rise and fall with each electoral cycle. We have to build organizations that are democratic, multiracial, and militant, with a foundation in solidarity.\n“Solidarity” meaning that even if you don’t experience a particular oppression, it doesn’t matter, because you understand that as ordinary people, our fates are tied together, and that one group’s liberation is dependent upon the liberation of all the oppressed and exploited.\nAnother world is possible. Another United States is possible, but only if we organize and fight for it. In closing, I want to quote from a note that was taped to the front door of my son Ellison’s daycare center on Inauguration Day. It said simply: “Do not despair. Eyes wide open. Strength in numbers. Keep the faith. And stay strong.”", "url": "https://www.jacobinmag.com/2017/01/trump-black-lives-racism-sexism-anti-inauguration"}