{"authors": ["Joey Guerra"], "date_download": "2020-05-04 20:16:07", "date_modify": "2020-05-04 20:16:07", "date_publish": "2017-11-29 16:37:05", "description": "Kechi Okwuchi regularly reduced TV audiences to tears this past summer. The Pearland resident left people emotionally overcome by belting ballads from Ed Sheeran and Estelle on \"America's...", "filename": "_95732b3eb0504694a476a32c974f4f98_1588623367.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_95732b3eb0504694a476a32c974f4f98_1588623367.html", "title": "Pearland's Kechi Okwuchi embraces musical dreams after 'America's Got Talent'", "title_page": "Pearland's Kechi Okwuchi embraces musical dreams after 'America's Got Talent'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kechi Okwuchi regularly reduced TV audiences to tears this past summer.\nThe Pearland resident left people emotionally overcome by belting ballads from Ed Sheeran and Estelle on “America’s Got Talent,” imbuing every performance with clarity and honesty. It earned her a spot in the Season 12 finale, where she was one of 10 remaining contestants.\nOkwuchi’s harrowing backstory set the emotional tone. She was one of two survivors of the Sosoliso Airlines Flight 1145 plane crash in Nigeria that killed 107 people in 2005. Two years later Okwuchi and her family moved to Texas for treatment at Shriner’s Hospital for Children in Galveston. She’s undergone more than 100 surgeries to remedy the burn scars and effects from the crash.\nNevertheless, Okwuchi has persisted. She graduated in 2015 from the University of St. Thomas with a degree in economics and gave a speech during her commencement ceremony.\n“AGT” pushed Okwuchi’s musical aspirations to the forefront. Her first audition earned a standing ovation from judges Simon Cowell, Howie Mandell and much of the crowd. Many were in tears. Expect there to be a few misty eyes during Okuchi’s Friday performance at the Mayor’s Holiday Celebration and Tree Lighting ceremony at Hermann Square.\nQ: What prompted you to audition for “AGT?”\nA: I never would have submitted an audition or an application if a friend hadn’t done it on my behalf. She had been telling me to do this for awhile. She sent me the link, and I ignored it. She just kind of took it in her own hands and registered for me. She didn’t tell me anything about it. I got a phone call from “AGT” telling me that they had seen my application and were interested. I have her to thank for believing in me.\nQ: Were you hoping to pursue music before appearing on the show?\nA: Nope. I had a set plan, and it was very focused in academia. I’m getting my MBA in economics, and my aim was to one day work in the U.N. or work with WHO (World Health Organization), where I could help Third World economies, and maybe one day help my own country, Nigeria. I thought that was my path. I’ve always loved music. It was my secret dream from when I was really, really young to perform, have concerts and have albums. But I just really restricted myself. Subconsciously, I just thought it was something that was never going to happen. I was going to be content doing music as my hobby and singing in church. I really didn’t want to let myself dream and then be disappointed, so I just let it go.\nQ: What was preventing you from taking that leap to pursue music?\nA: Before the accident, what was holding me back was the sheer impossibility of the entire thing. First of all, I didn’t think my voice was good enough to actually release albums and have people care about how I sound. I just didn’t think it was anything special. Something really did happen after the accident that made it better and stand out a little more. But the restrictions became even bigger. I felt like it was very, very focused on the exterior, and considering the fact that the accident had scarred me so heavily, I just felt like I would never get a chance, even if I sounded like Adele. I just kind of accepted it. Enjoy your voice. Your family can enjoy your voice. And just do your thing quietly.\nQ: How do you explain your voice getting better after the accident?\nA: It’s not even a feeling. It’s just a fact. My mom was like, “You sound different. Something’s going on.” It’s just so weird. I don’t know what happened. I don’t know why. But I do know that it was not what it is now, compared to what it was before the accident. I would sing all day. It was a really wonderful escape because, at the time, the surgeries were every week. Having that karaoke machine, and just coming home and singing, it was a way for me to distract myself from what was going on. It was a big, big part of my recovery. There was even music therapy at Shriner’s Hospital where I was treated.\nQ: Who were some of the artists you listened to during that time?\nA: Even before I came to Shriner’s, when I was in South Africa, as I was getting emergency treatment, Kelly Clarkson. Specifically ,her “Breakaway” album was my mantra. That was the album for me. I know every single song on that album. After my mom would leave for the day, she would have it in the CD player by my bed, and it would just be playing on a loop. I can’t listen to that album now without remembering those times, when I was just lying there and couldn’t do anything. I loved Backstreet Boys. I loved Destiny’s Child, especially the song “Stand Up for Love.” But Kelly Clarkson’s album, it was my major escape.\nQ: It must have been a huge moment, then, to sing with her during the “AGT” finale.\nA: It’s almost unreal. I never said a word to anyone at “AGT.” No one knew any of the story. It was incredible. If I didn’t have video on YouTube, I really wouldn’t believe that happened. I think God just kind of put it all together. I told her that her music helped me a lot. She’s so great. She’s so real and down to earth. My admiration for her skyrocketed like 100 levels.\nQ: When will we get to add a Kechi album to our playlists?\nA: I am working on a single, a demo. An album takes a lot of time and development. You need to really be sure of your sound before you release an album. Before I get to that point, I want to release an original record so people can get familiar with what my actually sound is and the kind of music I actually like. I want that to happen before the year runs out, but the way things are going, it might end up at the beginning of next year.", "url": "https://apnews.com/95732b3eb0504694a476a32c974f4f98"}