{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:14:36", "date_modify": "2020-05-04 20:14:36", "date_publish": "2017-02-03 10:00:00", "description": "Friday, Feb. 3 11th annual All Angels Jazz Festival: 7-9 p.m., St. Michael and All Angels Episcopal Church. Shows off the best of Hawaii’s jazz musicians. This concert features Abe Lagrimas...", "filename": "_a3674cc04cd044ebb410c1d50da1467b_1588623276.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a3674cc04cd044ebb410c1d50da1467b_1588623276.html", "title": "Island Calendar for Friday, Feb. 3, 2017", "title_page": "Island Calendar for Friday, Feb. 3, 2017", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Friday, Feb. 3\n11th annual All Angels Jazz Festival: 7-9 p.m., St. Michael and All Angels Episcopal Church. Shows off the best of Hawaii’s jazz musicians. This concert features Abe Lagrimas Jr. with Noel Okimoto, and Hot Club of Hulaville. Tickets, info: stmichaels-kauai.org or call St. Michael’s office at 245-3796.\nSaturday, Feb. 4\nKukuiula Outrigger recruiting day: 10 a.m. to 2 p.m. Kukuiula Harbor, Lawai Road. Learn the art and culture of Hawaiian outrigger canoe paddling. Join us for paddling instruction, club information and refreshments. Be part of a fun and active community of paddlers. Info: Fran McDonald, 635-0165.\n11th annual All Angels Jazz Festival: 7-9 p.m., St. Michael and All Angels Episcopal Church. Shows off the best of Hawaii’s jazz musicians. This concert features Bruce Hamada with Matt Lemmler and Abe Lagrimas Jr., and Maggie Herron with Abe Lagrimas Jr. and Dean Taba. Tickets, info: stmichaels-kauai.org or call St. Michael’s office at 245-3796.\nFilm Gardens of Grace: Kauai: 10:30 a.m. Saturday, Kukui Grove Cinema, free.\nHospice benefit: 5 to 8 p.m. Paradise Beauty Salon and Spa in Kapaa will donate 50 percent of proceeds from haircuts and make-up lessons to Kauai’s Hospice.\nCommunity Caring Day: 9 a.m. to 1 p.m. Lawai International Center. Help wanted with nurturing the grounds and plant orchids. Lunch will be served. Bring gardening tools. Please email lm@hawaii.rr.com or call 639-4300 and let them know you’re coming.\nSunday, Feb. 5\n11th annual All Angels Jazz Festival: The theme of Sunday morning’s Jazz Mass is Duke Ellington, with Matt Lemmler and the All Star Band, the All Angels Jazz Mass Choir, and soloists Karen Dickinson and Greta Matassa. Tickets, info: stmichaels-kauai.org or call St. Michael’s office at 245-3796.\nCraft fair: 10 a.m. to 1 p.m. Lihue Convention Hall.\nTuesday, Feb. 7\nAmerican Sign Language Level 1 class: Every Tuesday and Thursday 5:30 to 7 p.m. for six weeks at Kauai Community College. Taught by Angie Molina, deaf instructor for 25 years. Registration: 245-8318.\nPlant presentation: 5:30 p.m. Kauai Community College cafeteria. David Lorence, director of science and conservation at the National Tropical Botanical Garden, will be speaking about his work collecting rare plants in Samoa.\nFeb. 8\nBlood drive: 8:30 a.m. to 2:20 p.m. Kauai High School library.\nAARP meeting: 11:30 a.m., speaker at 12:30. 4444 Rice St., Conference Room B. A representative from Kauai Veterinary Clinic will be the guest speaker. Public welcome. Info: Deana, 823-0502.\nFeb. 9\nBlood drive: 8 a.m. to 2:30 p.m. Kauai Community College, student lounge\nHow to start a small business: 5:30 to 8:30 p.m., Lihue Plantation Building, 2970 Kele St., #101. Sponsored by Hawaii Small Business Development Center Network. $20. Info: 241-3148.", "url": "https://apnews.com/a3674cc04cd044ebb410c1d50da1467b"}