{"authors": ["Don Maines"], "date_download": "2020-05-04 20:06:38", "date_modify": "2020-05-04 20:06:38", "date_publish": "2017-01-18 16:32:25", "description": "A spectacular set that spans 70 feet, weighs 4,000 pounds and revolves on a turntable is the centerpiece for action when Friendswood High School thespians perform the \"school edition\" of the epic...", "filename": "_0946a88822e54daa81169fdf7237e41e_1588622798.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0946a88822e54daa81169fdf7237e41e_1588622798.html", "title": "Friendswood High pulls out all the stops for 'Les Misérables", "title_page": "Friendswood High pulls out all the stops for 'Les Misérables", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A spectacular set that spans 70 feet, weighs 4,000 pounds and revolves on a turntable is the centerpiece for action when Friendswood High School thespians perform the “school edition” of the epic musical “Les Misérables” Jan. 27-29 and Feb. 3-5.“The set is a star of the show,” said director Kathy Powdrell. “It should be a visually stunning production.”“Les Misérables School Edition” is an abridged version of the 1987 Tony Award-winning Broadway musical, which was based on Victor Hugo’s classic 1862 novel, set against the Paris Uprising of 1832.The insurrection by university students, who had hoped that other citizens would join their rebellion against a newly minted French monarchy, was quickly quelled, but it helped paved the way for the French Revolution of 1848.Hugo’s novel pitted the fictional character of Jean Valjean, a French peasant who is sentenced to prison for stealing a loaf of bread, against Inspector Javert, the seemingly heartless French police officer who tracks Valjean to Paris after he escapes. Meanwhile, Valjean assumes a new identity and becomes a wealthy but benevolent factory owner.“This author-approved edition has been abridged to a running time of just over two hours, while carefully maintaining the integrity of one of the greatest musicals ever written,” Powdrell said.The score features music by Claude-Michel Schönberg that ranges from stirring ballads (“I Dreamed a Dream,” “On My Own”) and wistful melodies (“Castle on a Cloud”) to huge production numbers (“At the End of the Day”) and occasional comedy relief. The score is anchored by two powerful anthems (“One Day More” and “Do You Hear the People Sing?”).“I’ve been listening to ‘Les Misérables’ since I was a toddler,” said Alex Rudd, a senior, who heads the cast as Valjean. “To be cast as Valjean in my senior year musical really is a dream come true.“Max Morgan, who portrays the younger romantic lead, Marius, added, “Marius is so dynamic as a character. His entire demeanor changes based on those around him. Crafting my own interpretation of Marius has been challenging and exhilarating.“As Marius, Morgan sings a haunting lament to friends who die in battle, “Empty Chairs at Empty Tables.“Other leading players include Dante Marcuccio as Inspector Javert, Katie Sharp (Cosette), Emily Mesa (Éponine), Maddie Pertuis (Fantine), Cade Tucker (Thénardier) and Lauren Podlewski (Madame Thénardier).Powdrell designed the show’s set with fellow faculty members Amy Thornton and Cale Borne, who was in charge of set construction.Senior students Logan Newsom, Max Rittenhouse and Gabe Walker, junior Jacob Jaimes and sophomores Anderson Berndt and Sydney Chambers helped assemble the set under adult supervision that included parents Peter Clarke and Jim Kutz.Another experienced volunteer, Craig Zoch, hooked up electric motors for the drawbridges that move the show’s action to other parts of Paris.From the light control booth in the school’s Myrlene Kennedy Auditorium, the turntable onstage is operated by junior Meredith Fraga.“Les Misérables School Edition” is the 49th annual FHS musical, Powdrell said.“As a director, I have always ‘dreamed the dream’ of directing this beautiful story of Victor Hugo’s, brought to and developed for the stage initially by the highly esteemed Royal Shakespeare Company,” she said. “This is a dream cast, a dream set, dream musical direction and pit band, and the FHS musical director, Janwin Overstreet-Goode, and pit band orchestra, led by Julio Sanchez, have put together a wonderful sound.”“Les Misérables School Edition” will be performed 7 p.m. Jan. 27-28 and Feb. 3-4; 2:30 p.m. Jan. 29 and Feb. 5 at the school, 702 Greenbriar Drive, Friendswood.When: 7 p.m. Jan. 27-28 and Feb. 3-4; 2:30 p.m. Jan. 29 and Feb. 5Tickets are $10 and may be purchased by cash or check Monday through Friday from 9 a.m. to 3 p.m. at the school’s visitor’s desk beginning Jan. 23 or before each performance.For more information, call 281-482-3413.Don Maines is a freelance writer who can reached at donmaines@att.net", "url": "https://apnews.com/0946a88822e54daa81169fdf7237e41e"}