{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:20:30", "date_modify": "2020-05-04 20:20:30", "date_publish": "2017-02-14 15:00:00", "description": "In response to Mike Winters’ guest column from Feb. 1, Donald Trump is no leader. Holding a powerful position does not make one a leader. Leadership requires self-awareness, insight, drive and the...", "filename": "_9a8b3ba868304d48be070742f87a828d_1588623630.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9a8b3ba868304d48be070742f87a828d_1588623630.html", "title": "Trump is no leader", "title_page": "Trump is no leader", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In response to Mike Winters’ guest column from Feb. 1, Donald Trump is no leader. Holding a powerful position does not make one a leader. Leadership requires self-awareness, insight, drive and the ability to grasp others’ situations as well as listening thoughtfully to critics. Trump has none of these qualities. He blunders, bullies and scolds his way through negotiations, turning existing allies into new enemies. He is vengeful and vindictive, personally attacking and demeaning those who disagree with him. He lacks the discipline or interest to dive into the complex issues of the position he holds; rather he allows others to inform his opinions, without regard to their motivations or the best interests of the nation. He has surrounded himself with sycophants and those who seek to exploit his weaknesses for their own gain. Does this sound like a leader?\nLeaders, creative leaders, offer a compelling inclusive vision. Donald Trump divides us and admonishes us to be fearful. True leaders live their values in ways that are powerful and evident. Donald Trump appears to have no values other than himself and his gratification. He does have drive; it is singularly focused on self-aggrandizement and self-congratulation. And work ethic? He prefers to watch television and tweet insults to his critics than do the hard work of reading and understanding policy documents, security briefs or even the executive orders he signs daily. This is a president dangerously unprepared to fulfill the oath that he took to “preserve, protect and defend the Constitution of the United States.”\nBillie Spell\nRoseburg", "url": "https://apnews.com/9a8b3ba868304d48be070742f87a828d"}