{"authors": ["Skyler Holtkamp Sholtkamp Dailydem.Com"], "date_download": "2020-05-04 20:06:53", "date_modify": "2020-05-04 20:06:53", "date_publish": "2017-08-15 13:00:00", "description": "“If you have a dream and you stick to it. Anything is possible.” Jason P. Thurman said this to his 14-year-old son, also named Jason, in May of this year. Thurman was at a rough period in...", "filename": "_ab2d8c9a11d44dfcac30a5c0aee1f1bd_1588622813.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ab2d8c9a11d44dfcac30a5c0aee1f1bd_1588622813.html", "title": "Old drive-thru bank finds a buyer", "title_page": "Old drive-thru bank finds a buyer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "“If you have a dream and you stick to it. Anything is possible.”\nJason P. Thurman said this to his 14-year-old son, also named Jason, in May of this year. Thurman was at a rough period in his life. During this time he had just lost his job, recently divorced and on the brink of being homeless.\nBut it was important, he felt, to inform his son that he just made a big life decision. He purchased the dilapidated drive-thru bank with the hopes of turning it into a family diner.\nThe former drive-thru bank, located at 1101 Ave G, opened for business in 1961. It was owned and operated by Iowa State Bank until 1988, when the Iowa State Bank branches became Central State Bank. The drive-thru bank was operational until late 1991. It has gone through multiple hands since its closing and has been little more than a parking lot.\nBut on May 3, Thurman told his son that this had always been a dream of his.\n“I told him that when I was 13 I was really awestruck by the structure of the building. It has such an abstract build to it the way the roof sits,” Thurman recalled. “Even then it was run down, but I saw the beauty in it and I told myself then, that someday, ‘I’m gonna buy that place and make a barbecue joint out of it.’”\nAfter his long string of bad luck he figured he’d take a shot at his dream. He had just cashed out of his 401K and was left with a little bit of spending money. He was going to see to it that the old bank would become a family diner of sorts. Although it may seem like this would be an irrational decision, Thurman would disagree, arguing that no matter what people tell you, you should always follow your dream.\n“I know it wasn’t the ideal situation to jump head first into, but I felt it was the only decision that I had. I wanted to do something positive, but I also wanted leave something to my children. Teach them that’s it’s important to follow your dream,” he said.\nThurman’s son pondered on what his dad just told him. After Thurman asked him if he thought it was a stupid idea, young Jason answered that it wasn’t and that he liked the notion.\n“That’s all I needed,” Thurman said, “I teared up a little bit, but that’s the only answer I needed.”\nWork began immediately, sometimes with the help of local volunteers. But most of the time it was Thurman putting in the long hours to fix up the former bank. Although the building has maintained its aesthetic appeal, there are a multitude of problems within its concrete walls. The roof has completely given way in some areas, which left the inside succumb to the elements.\n“There’s a basement in there that had a wooden staircase, but it completely rotted away,” Thurman said. “There’s over eight inches of water in there. So I’ve been having to use a bucket and a pulley system to pull out the water and rotted wood.”\nAt times he put himself at extreme risk to complete the work. While working on the roof, he fell and cut his leg causing a deep gash that would’ve required stitches. Rather than go to the doctor, he says he wrapped his leg with a T-shirt and continued working, with the blood running down his leg. A week later he learned that he had Septicemia, a potentially life threatening blood infection. The condition left him unable to walk for a short time. After recovery, he was back to work on the bank.\nAs to what the new family diner will be called or what will be served is uncertain at this point.\n“I would like to do simple things, like a barbecue and offer regular grilled food, snack food and hot dogs for the kids,” he said.\nDue to the size of the building, outside dining and carry out will be the only catering options.\nVarious obstacles may prevent the former bank from becoming a family diner. At this point, the bank is zoned as a one-bedroom residence. It must be reclassified as a commercial property before it can become a business.\nDue to its dilapidated state, new plumbing, electrical and extensive cleaning will be required to abide to the FDA’s standards for food preparation.\nThurman is well aware of the obstacles in front of him. It almost seems like the negativity fuels his drive to succeed.\n“I love it when people tell me that I can’t do this. It makes me want to work harder,” he said. “There’s going to be no failing with this. Even if I have to spend my whole life doing this. Failure is not an option.”\nYou can check out Thurman’s Facebook group “This Old Bank,” where you can follow his progress. Donations are welcome to assist financially in the project. Details for the Go Fund Me page are located within the Facebook group.", "url": "https://apnews.com/ab2d8c9a11d44dfcac30a5c0aee1f1bd"}