{"authors": ["Jose De Jesus Ortiz St. Louis Post-Dispatch"], "date_download": "2020-05-04 20:20:49", "date_modify": "2020-05-04 20:20:49", "date_publish": "2017-08-02 09:10:00", "description": "COLUMBIA, Mo. • The text message is still on Alec Abeln’s phone almost seven months after Mizzou linebacker Eric Beisel sent it to him and most of the Tigers’ seniors and coaches. Beisel...", "filename": "_9681921047be43a8940e5ad5c899e43a_1588623649.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9681921047be43a8940e5ad5c899e43a_1588623649.html", "title": "Ortiz: Mizzou seniors have master plan for legacy", "title_page": "Ortiz: Mizzou seniors have master plan for legacy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "COLUMBIA, Mo. • The text message is still on Alec Abeln’s phone almost seven months after Mizzou linebacker Eric Beisel sent it to him and most of the Tigers’ seniors and coaches.\nBeisel fired off the text at 1:10 a.m. on Jan. 10, soon after the 2016-2017 college football season officially ended when Clemson beat Alabama in the national championship game.\nTired of missing a bowl for two consecutive seasons, Beisel outlined a list of things the Tigers needed to do to be winners again in 2017. He wrote his list on a yellow legal pad, took a picture of the paper and then texted a screenshot.\n“I wanted to let the guys know that we were going to have high expectations going into our senior season,” said Beisel, a senior from Rockwood Summit High. “Our fans deserve better. Our families deserve better. Our state of Missouri deserves better. And we’re going to give them a show this year.”\nAlthough the Tigers were picked to finish last in the SEC East by the media, Beisel and the rest of the seniors have much higher goals and expectations.\nThey’re tired of finishing last in the SEC East. This is the last chance for Beisel, Abeln and the rest of the seniors to leave their mark on the field for the Tigers. They want to leave a winning legacy.\nThey don’t want to finish their careers by missing a bowl game for three consecutive seasons. They sure as heck don’t want to be remembered as a senior class that finished last in the SEC East for three consecutive seasons after winning the SEC East as freshmen or redshirt freshmen.\n“You look at my first two years, my class’s first two years, two of the best years in Mizzou history,” said Abeln, a redshirt senior offensive lineman from St. Louis University High. “To go from that to how it’s been the last two years it’s frustrating. It’s a large part on us. I feel the burden of that every day.\n“We’ve seen where it’s been and where it can be, and we’ve seen the kind of guys and the kind of work it takes to get there, and I think we’re headed in the right direction.”\nTo be clear, Abeln should already be seen as an inspiration by his younger teammates because he has set the best example in the most important arena for student athletes.\nHe has already earned a bachelor’s degree in finance, and he’s even in line to finish a second degree in English in May. The 6-3, 305-pounder is now eager to leave a legacy of success on Memorial Stadium’s Faurot Field.\nNot one person on Mizzou’s roster or coaching staff is proud of finishing 2-6 in the SEC and 4-8 overall last year after going 1-7 in the SEC and 5-7 overall in 2015.\nBeisel has a master plan, as he calls it. The plan started before he sent that text at 1:10 a.m. on Jan. 10.\n“It was something very direct,” Abeln said. “It wasn’t big abstract things. It was, ‘We’ve got to win winter workouts first and foremost. We’ve got to win mat drills. We got to win spring ball. We got to win summer workouts. We got to win fall camp. We got to win against Missouri State. We got to win against South Carolina. For every single game in the SEC East, we got to win the (SEC) championship and then got to win a playoff game to get there.’\n“That’s our 25 goals. That’s our 25 expectations. It hasn’t been perfect so far, but we’ve been a lot better.”\nAblen informed Beisel that he agreed immediately with a simple three-word reply.\n“I’m about it,” Abeln texted back at 1:12 a.m.\nOffensive lineman Tyler Howell also replied to Beisel’s text right away.\n“Obviously we were all watching that (national championship) game,” Howell said. “After the season is over you can kind of reflect on all the things that didn’t go as planned. We can look at all that and then just know all the little things we can do to make this a really good team.\n“The coaches are going to put us in the best position, but at the end of the day we got to take ownership as players in what we want out of this to be as good as we can.”\nPart of Beisel’s master plan includes “winning fall camp,” which got underway Tuesday morning. Mizzou coach Barry Odom noted that the team looked a lot better to him in two hours Tuesday than it appeared to him in the spring.\nOdom also praised his senior leaders and commended them for taking ownership of the team. He has no doubt that this season has a little more meaning to his seniors.\n“Absolutely. We talked about it very openly,” he said. “We’ve all been disappointed in the way we’ve performed. I’m talking about last year. Those guys who have played and were here are disappointed.\n“There were things that we did not get achieved. They also understand that their clock is ticking pretty quick.”\nWith that clock ticking on their Mizzou career, the seniors have embraced Beisel’s master plan. They welcomed his text, and some still haven’t even bothered to delete it from their phones.\n“There were a lot of replies: ‘Let’s do it. We got a lot of work to do,’” Beisel said. “I’m not afraid to set high expectations, so it might have come as a shock to some. But with what we’re trying to do this year, it has to be clear. Expectations have to be set. They have to be loud and clear. Everyone needs to know what the expectation is, and I made sure that everyone knew.”", "url": "https://apnews.com/9681921047be43a8940e5ad5c899e43a"}