{"authors": ["Adam Graham", "The Detroit News"], "date_download": "2020-05-04 20:26:20", "date_modify": "2020-05-04 20:26:20", "date_publish": "2017-11-16 23:32:36", "description": "The stealth marketing campaign for Eminem's ninth album has had fans scouring social media, watching fake infomercials and generally grabbing at straws for more than a month. The guessing...", "filename": "_361247ee4fa64e0caa3c0385f421fb90_1588623980.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_361247ee4fa64e0caa3c0385f421fb90_1588623980.html", "title": "Debut day? Rumored Eminem release 'Revival' anticipated", "title_page": "Debut day? Rumored Eminem release 'Revival' anticipated", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The stealth marketing campaign for Eminem’s ninth album has had fans scouring social media, watching fake infomercials and generally grabbing at straws for more than a month.\nThe guessing game is expected to conclude with the anticipated Friday release of “Revival,” although no official word on its arrival has been announced by Eminem’s representatives.\nSince Beyoncé unveiled her self-titled album in December 2013 without so much as an advance word, she upended the marketing paradigm for megastar album releases. Since then, several others — including Kendrick Lamar, Drake and Radiohead — have released albums with little or no forewarning. Not always to positive effect, either: U2 managed to anger fans and non-fans alike by uploading the 2014 album “Songs of Innocence” to Apple users’ phones without their permission. Then Beyoncé surprised fans all over again in 2016 when she sneak-released “Lemonade” via an HBO special.\nWith Em’s “Revival” — which is led by first single “Walk on Water,” released Nov. 10 and featuring Beyoncé on the chorus — Eminem gets his chance to play the surprise game. The success or failure of the experiment depends on whether the material holds up to its top secret delivery system.\nThe set is sure to face leveled sales expectations when it makes its way into the world. In the four years since Eminem’s last album, 2013′s “The Marshall Mathers LP 2,” streaming services have taken a huge bite out of traditional album sales. Aside from Adele and Taylor Swift, Eminem is one of the last artists who can be relied on for seismic sales weeks, so industry watchers are waiting to see what kind of impact “Revival” makes on the charts. But its sales figures will depend on whether physical copies make their way to retail before its release, which is unsure as of press time.\nEminem is set to appear on “Saturday Night Live” this weekend, his seventh appearance on the NBC sketch comedy series, presumably on the heels of “Revival.” His last appearance on the show was 2013.\nThe first rumblings of a new Eminem album came from Em’s producer, D12 partner and on-stage hypeman, Denaun Porter, when he said on Instagram Live last month the new album was in the can. He later retracted his statement, saying he was trolling fans who kept asking about the album’s arrival.\nAn Oct. 10 report on music industry trade publication Hits magazine’s hitsdailydouble.com pegged a Nov. 17 date for the set, citing “very loud chatter” in the industry. Then came the phony pharmaceutical commercial for a drug called Revival — the E turned backwards, like Em’s logo — made to look like the pseudo-soothing TV spots that advertise drugs such as Xarelto and Latuda. The “Revival” ad — which first aired during “Saturday Night Live’s” Oct. 14 episode — featured an actor saying “it’s easy to lose yourself,” one of several in-references to Eminem’s lyrics. The piano loop from Eminem and Dr. Dre’s 2011 single “I Need a Doctor” plays in the background.\nThat ad pointed viewers toward a website, askaboutrevival.com, that deepened the riddle. A hotline number signaled on the site featured the same “I Need a Doctor” background music and an operator that deadpanned supposed uses of Revival (which follows the title pattern of “Relapse” and “Recovery”). Hang on the line long enough and listeners received a profane congratulations for waiting it out.\n“Walk on Water,” which lyrically finds Eminem unsure of his standing in the rap game, was teased several days before its release in social media posts from Eminem’s accounts. The single received mixed reviews; Pitchfork called it “a noncommittal gloop of grand piano and strings with no beat.” The song garnered 23 million views on YouTube in its first six days.\nEminem, who turned 45 last month, remains an elite music superstar despite — or, perhaps, because of — his retreat from the public eye. In the last decade he hasn’t mounted any large-scale tours, mostly performing in headlining spots at major festivals and appearing at stadium concerts. He last performed in Detroit at Comerica Park in 2014 with Rihanna and in 2010 with Jay-Z, and appeared as a guest artist at Joe Louis Arena with Big Sean in 2015 and Drake in 2016.\nEm made a rare non-concert public appearance at Little Caesars Arena last month at the home opener for the Detroit Pistons. Last week, he skipped a 15th anniversary screening of “8 Mile” at the Bel Air Luxury Cinema on 8 Mile in Detroit and a rap battle event tied to the movie the following night at Saint Andrew’s Hall.\nSince the release of his last studio album, Em’s recorded work includes a compilation set celebrating the 15th anniversary of his record label, Shady Records, several songs on the “Southpaw” soundtrack (which was released on Shady Records) and tracks with Royce da 5′9″, Tech N9ne, Yelawolf, the Weeknd, Skylar Grey, Big Sean and P!nk. It’s a light workload for a superstar of his ilk: by comparison, in that same time period Drake released a studio album and three mixtapes, and has appeared as a guest artist on more than three dozen songs.\nLast year, Eminem released the single “Campaign Speech,” a nearly eight-minute freestyle in which he dissed then-presidential candidate Donald Trump. Trump caught his ire once again last month during a vicious freestyle verse Em performed on the BET Hip Hop Awards; the official YouTube clip has been viewed 38 million times.\nMost recently, Eminem acted as a producer on Joseph Kahn’s battle rap comedy “Bodied,” which premiered at this year’s Toronto International Film Festival and is seeking distribution.\nAs for “Revival’s” content, it’s anyone’s guess. “Walk on Water” is produced by Rick Rubin, who also produced Em’s 2013 single “Berzerk,” and Dr. Dre and Denaun Porter are said to be producers on the set. Otherwise, guests, track listings and more have been kept under wraps.\nSeveral “Revival” marketing efforts have pointed back to “Stan,” Em’s “Marshall Mathers LP” track about an obsessive, deranged fan, which is mentioned by name in the closing moments of “Walk on Water.” “Stan” has become music industry shorthand for any fan of a particular artist, and the Em-coined definition of “Stan” made its way into the Oxford English Dictionary earlier this year.\nIn recent weeks, Em has been marketing “Stan” merchandise and a performance in London last week, tied to Eminem’s appearance on the MTV Europe Music Awards (where he debuted “Walk on Water,” with Skylar Grey standing in for Beyonce) took place at a venue that was renamed Stanley Mitchell’s Revival Pub. (The “Stan” from the song’s full name is “Stanley Mitchell.”)\nIn terms of sales, “Revival” has a high bar to climb to compete with Em’s past chart successes. In 2013, “MMLP2″ launched with 792,000 copies its first week, on par with his sales figures for 2010′s “Recovery” (741,000), 2009′s “Relapse” (608,000) and 2004′s “Encore” (710,000). Em logged his best-ever sales debut when the original “Marshall Mathers LP” sold 1.76 million copies its first week in May 2000.\nagraham@detroitnews.com\n(313) 222-2284\n@grahamorama", "url": "https://apnews.com/361247ee4fa64e0caa3c0385f421fb90"}