{"authors": ["Ryan Kuhn"], "date_download": "2020-05-04 20:14:10", "date_modify": "2020-05-04 20:14:10", "date_publish": "2017-02-04 04:51:00", "description": "Even though the Ellensburg High School boys basketball team lost to Wapato Friday night and failed to make the postseason, there was nothing but love in the locker room afterward. The...", "filename": "_0dd21a20900e482e946cadea8f14f31e_1588623250.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0dd21a20900e482e946cadea8f14f31e_1588623250.html", "title": "Ellensburg boys basketball loses to Wapato 56-51 to end its season", "title_page": "Ellensburg boys basketball loses to Wapato 56-51 to end its season", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Even though the Ellensburg High School boys basketball team lost to Wapato Friday night and failed to make the postseason, there was nothing but love in the locker room afterward.\nThe coaches each took turns to speak and walked around and thanked each player.\n“We are all heartbroken but this is about love right now,” said Ellensburg head coach Anthony Graham, after the 56-51 loss. “We went through a battle together and it’s more to focus on the journey than the ending.”\nEllensburg had to win to force a tie-breaker scenario with Grandview, but the Bulldogs just could not complete the upset to end the season.\n“These guys laid it on the line all season,” Graham said. “We just didn’t get it in the hole and missed some easy shots,”\nEllensburg started the game with intensity fueled by a lineup made up of five seniors, including forward Major Moffat.\nGraham said Moffat’s primary job was to hustle and get as many rebounds as he could because he was struggling to shoot the ball recently, but he quickly put that behind him.\nMoffat scored a 7 points in the first quarter as the Bulldogs held a 17-11 advantage.\n“I just wanted to give 100 percent,” Moffat said. “It was my first start of the year and I didn’t want to come out slow. I wanted to contribute and help the team in anyway I could.”\nThe Wolves quickly started to answer every shot Ellensburg was throwing at them as they finally took the lead with 4:26 remaining in the first half.\nEllensburg regained its composure when senior Bryce Helgeson hit a 3-pointer to increase the lead 24-20 followed by another 3-pointer by senior Xander Orejudos.\nWapato scored twice before halftime, but the Bulldogs still held onto a 31-27 lead when the teams went to their locker rooms.\n“We challenged to get out to a hot start and they did,” Graham said.\nWapato came out shooting in the second half as Rodrigo Campos hit a shot inside followed by a 3-pointer by Caleb Cordova.\nThe Bulldogs cut the lead down to one point with 4:24 left in the quarter but the Wolves answered with a 6-0 run and never let up.\nEllensburg cut its deficit down to one point when Moffat scored on a putback but the Wolves response came from its star player Hunter Jacobs.\nJacobs scored the final eight of his 27 points to seal the game and came up with a steal in the final 23 seconds to stop any type of comeback for the Bulldogs.\n“Even though our season ended today, the seniors with the exception of a couple have played together since fourth grade,” said Moffat who finished with a season-high 14 points. “To finish like that was something we wanted to do. We wanted to do it for each other.”\nEllensburg finishes its season with a 9-11 overall record and 7-11 in CWAC play.\nThe Bulldogs graduate seven seniors including Helgeson, Moffat, Orejudos, Trey Bennett, Blake Gibson, Nate Andaya and Devin Irby and will have a completely new team next year. Only juniors Ty Denner, Anders Ott and sophomore Steele Venters return.", "url": "https://apnews.com/0dd21a20900e482e946cadea8f14f31e"}