{"authors": ["Andrew Krammer"], "date_download": "2020-05-04 20:04:24", "date_modify": "2020-05-04 20:04:24", "date_publish": "2017-10-18 23:12:31", "description": "The Vikings turned the ball over twice and won against the Packers on Sunday, marking the first time theyve done both in a game this season. So entering Sundays game against the...", "filename": "_ba96e624c90b4d08af760815f2a1ce2b_1588622664.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ba96e624c90b4d08af760815f2a1ce2b_1588622664.html", "title": "Vikings know Ravens get (and give) their share of turnovers", "title_page": "Vikings know Ravens get (and give) their share of turnovers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Vikings know Ravens get (and give) their share of turnovers\nThe Vikings turned the ball over twice and won against the Packers on Sunday, marking the first time theyve done both in a game this season.\nSo entering Sundays game against the opportunistic Ravens, a defense ranked second in the NFL with 14 takeaways, the Vikings are focused on playing keep-away. Fortunately for the Vikings defense, the Ravens and quarterback Joe Flacco are generous with the football. Their 12 giveaways are the third most in the NFL.\nWe have to cut the turnovers out, Vikings tight end Kyle Rudolph said. If we dont give them the ball and play a true team game, I like our chances.\nThe Ravens have generated nine interceptions, many off tipped passes (29 pass deflections as a team), including two picks from All-Pro safety Eric Weddle. Weddle also forced a fumble last week on Bears running back Tarik Cohen. Meanwhile, Vikings running back Jerick McKinnon has put the ball on the ground in three consecutive games.\nWeddle tries to disguise a lot, Vikings coach Mike Zimmer said. He tries to give you some different looks, tries to trick you. Their whole defense is good.\nA top-10 defense has boosted the Ravens for four of the past six seasons, thanks in part to Pro Bowlers such as Weddle, outside linebacker Terrell Suggs and inside linebacker C.J. Mosley. Quarterback Case Keenum, who is expected to start again Sunday, has seen the 20 batted passes by the Ravens secondary this season and doesnt want to add to their highlight film.\nWere really going to have to know where those guys are at and make sure we protect the football, Keenum said.\nMurray looking inward\nRunning back Latavius Murray has 97 rushing yards on 41 attempts this season, leaving the veteran wanting more from his own game as he continues to split backfield duties with McKinnon. Murray has started the past two games, but McKinnon has finished with more snaps, touches and yards in each.\nMurray picked up 28 yards on 15 carries against the Packers.\nThere were some positives I took from it, Murray said. But I still think I couldve played much better and eliminate some of the negative runs I had.\nDiggs, Barr held out\nWhile quarterback Teddy Bridgewater returned to practice Wednesday, the Vikings were still without a handful of starters, including quarterback Sam Bradford.\nBradford (knee), receiver Stefon Diggs (groin) and guard Nick Easton (calf) have not practiced since they were injured, or reaggravated injuries, during the Vikings Oct. 9 victory in Chicago. Linebacker Anthony Barr did not practice after a concussion knocked him out of Sundays victory against Green Bay. Barr is also dealing with an ankle injury.\nReceiver Michael Floyd (hamstring) also was unable to practice after being injured against the Packers.\nCant overlook specialists\nRavens special teams has the Vikings attention this week. Baltimore fields two-time All-Pro kicker Justin Tucker, the leagues best kick return team and top-10 units on punt return and kick coverage. The Ravens returned a punt and a kickoff for touchdowns in their overtime loss to the Bears.\nTheyre the best special teams that weve played by far, Zimmer said. Theyve got the two best specialists in the league. They can make a field goal from any distance, just about. Its going to be a big factor in the ballgame.\nLinval anchors\nThe Vikings third-ranked run defense in the NFL (78.7 yards per game) has been a driving force to their 4-2 record. Nose tackle Linval Joseph is the first man to thank. Let defensive end Everson Griffen explain.\nHes like the anchor in the middle, Griffen said. Its like you got a big cruise ship, they set the anchor right down the middle of the ship. Thats what happens.\nAlmost mean\nKeenum has dropped back 168 times this season, and he hasnt taken a sack in his past 64 pass plays. A big reason why is the unheralded play of left tackle Riley Reiff, a Parkston, S.D., native who doesnt talk much once you flip on a microphone.\nHes just a good old country boy, Keenum said. Hes almost mean. You like having tough, mean guys on your team. Now, once you get to know him, hes a great guy.", "url": "https://apnews.com/ba96e624c90b4d08af760815f2a1ce2b"}