{"authors": ["Mary Katherine Wildeman"], "date_download": "2020-05-04 20:04:39", "date_modify": "2020-05-04 20:04:39", "date_publish": "2017-11-26 22:30:00", "description": "James Johnson calls out instruction after instruction. Like in a typical yoga class, meditative music plays, set to a backdrop of groans as Johnson ramps up the difficulty. There are the...", "filename": "_fbe28737b188471ab4af2767b3ed1a0d_1588622679.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fbe28737b188471ab4af2767b3ed1a0d_1588622679.html", "title": "MUSC program aims to tackle fitness of young people with autism and other disabilities", "title_page": "MUSC program aims to tackle fitness of young people with autism and other disabilities", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "James Johnson calls out instruction after instruction. Like in a typical yoga class, meditative music plays, set to a backdrop of groans as Johnson ramps up the difficulty.\nThere are the usual complaints when the instructor settles into a plank position, and the same sighs of relief when he orders upward or downward dog.\nBut the audience is a little different than usual. Each of the roughly two dozen participants is a teen or a young adult with a neurodevelopmental disorder. Most lie somewhere on the autism spectrum. Others have ADHD or a mild intellectual disability.\nKatrina Felty fits squarely into that group. She has high-functioning autism. Now 21, she said high school was a stressful place for her. She was taking physical education classes from home. When she enrolled in the Piece it Together program, she said it was both a physical and a social outlet.\nAt school, she said she felt people would not understand her. She has found that not to be the case at the Piece it Together program, a fitness and wellness program run jointly by the Medical University of South Carolina’s Wellness Center and its division of developmental pediatrics.\nFelty said her favorite class is shadowboxing-based. She said the fitness classes reduce her stress and help improve her balance.\n“It exhausts me, but in a good way,” Felty said. “It makes me feel hyper emotionally but tired physically. It’s a wonderful feeling.”\nThe Piece it Together program focuses on physical fitness. Especially after they graduate from high school, young adults with these kinds of disabilities tend to lead sedentary lives. Many continue to live with their parents.\nThe group ranges in age from 14 to early 20s. They meet once a week for a variety of fitness classes, including swimming, yoga and spin classes. Instructors are trained to adapt the class. Experts help the teens and young adults with nutritional skills, too.\nLisa Riddle, a mentor with Charleston’s Family Resource Center for Disabilities and Special Needs, said typical fitness classes might be daunting for people with autism. Uncomfortable bike seats, locker rooms, the smells and loud sounds of the gym — those things can be a sensory overload for people with these kinds of disabilities, experts said.\n“For a lot of kids on the spectrum, there aren’t as many opportunities to access fitness,” Riddle said.\nFelty said she could find events for people her age with autism, but she dismissed them with a shrug. Most don’t interest her.\nRiddle’s son has done the Piece it Together program in the past. He is now 19. Riddle said she can find baseball leagues or other specific sporting events for kids with autism, but there isn’t much that aims to teach them about fitness and nutrition.\nThe time after a teenager graduates from high school is tough no matter what, Riddle said. But it is particularly tough for those with autism. Kim Thomas, CEO of the S.C. Autism Society, said she hasn’t seen any other programs in the state quite like Piece it Together.\n“Once they leave school there aren’t really services out there that are appropriate for them,” Thomas said. “They’re left trying to find jobs. But what our system offers isn’t tailored to meet the needs of people with autism.”\nEven in high school, physical education classes are not always ideal for teens with neurodevelopmental disorders like autism. Many take PE classes online.\nConner McDonald, a second-year medical student, has helped with the program and recently completed research into Piece it Together participants’ coordination. McDonald said they found many of the participants have poor balance. Balance and coordination are not part of autism’s criteria, but they are still commonly associated with the diagnosis. He said the research demonstrated the Piece it Together program improved the young adults’ balance. But he also said there has not been much research into how the disorders affect the body.\n“It turns out there are some physical manifestations of it as well,” he said.", "url": "https://apnews.com/fbe28737b188471ab4af2767b3ed1a0d"}