{"authors": [], "date_download": "2020-05-04 20:27:08", "date_modify": "2020-05-04 20:27:08", "date_publish": "2017-12-20 22:21:00", "description": "A Fayetteville woman who disappeared three years ago remains missing, but her family wants answers. Meta Valentine has been missing since Oct. 29, 2014. She was a church-going woman who had...", "filename": "_0cdf3b46f0b2d244b676043ee062f308_1588624028.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0cdf3b46f0b2d244b676043ee062f308_1588624028.html", "title": "Years after Fayetteville woman's disappearance, family seeks answers", "title_page": "Years after Fayetteville woman's disappearance, family seeks answers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Fayetteville woman who disappeared three years ago remains missing, but her family wants answers.\nMeta Valentine has been missing since Oct. 29, 2014. She was a church-going woman who had a wonderful spirit, according to her son, Demario Valentine.\n“She was a loving woman,” he said. “If you needed help, she would take care of you. She loved the kids. At her church, she was always taking care of somebody’s child.”\nDemario Valentine said it was her pastor who originally realized something was wrong.\n“They noticed something was wrong because she never missed a Bible study or anything like that,” he said. “It was a Wednesday, so when they came to get her for Bible study, no one could find her.”\nSecurity video taken the night before she disappeared at the Sycamore Park apartments showed Valentine walking to her apartment, and her on again-off again boyfriend and the father of one of her three children, Reginald McDowell, running behind her towards the same building.\n“Every part of the investigation runs full circle back to Reggie McDowell,” said Sgt. Mike Ballard. “He is the person of interest in the investigation.”\nInvestigators say that is in part because of McDowell and Meta Valentine have a volatile history.\n“He was charged with kidnapping her back in the 90s,” Ballard said.\nSince her 2014 disappearance, police have lost track of McDowell.\nBallard said McDowell went to New York after the 1990s charge, and that he might still be in New York.\nMeta Valentine’s family has also not heard from McDowell since she disappeared.\n“Most people, you know, if you’re innocent, you prove you’re innocent. You stick around,” Demario Valentine said.\nInvestigators say they plan to compile the latest information in the case and present it to District Attorney Bill West.\nAnyone who has any information is the disappearance of Meta Valentine is asked to call Crime Stoppers at 910-483-8477.", "url": "https://apnews.com/0cdf3b46f0b2d244b676043ee062f308"}