{"authors": ["Sanne Godfrey"], "date_download": "2020-05-04 20:13:30", "date_modify": "2020-05-04 20:13:30", "date_publish": "2017-12-17 04:13:00", "description": "MYRTLE POINT — Douglas County wrestler swept the Myrtle Point Invitational, taking the top four spots in the competition. Roseburg led the way with 221 points and wins by Kahleb Diaz at 126,...", "filename": "_494aa8a37d0342aa945b37db0a6983f3_1588623210.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_494aa8a37d0342aa945b37db0a6983f3_1588623210.html", "title": "Prep Wrestling: Douglas County wrestlers dominate Myrtle Point invitational", "title_page": "Prep Wrestling: Douglas County wrestlers dominate Myrtle Point invitational", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MYRTLE POINT — Douglas County wrestler swept the Myrtle Point Invitational, taking the top four spots in the competition.\nRoseburg led the way with 221 points and wins by Kahleb Diaz at 126, Riley Rose at 145, Darian Thacker at 152 and Doran Gillespie at 182.\nGlide finished second behind wins from Gage Dill (113), Zach Holland (160) and Collyn Potter (220).\nCole Waldron of Douglas won the 132-pound match with a pin of Glide’s Gabe Syverson in 1:10 to help his team to a third place finish.\nOther county winners were South Umpqua’s Nakai Sinohui and Reedsport’s Devin Lichte.\nSinohui pinned Douglas’ Jacob Huse in 3:33 in the 138-pound match.\nIn the 170-pound match Lichte pinned Roseburg’s Owen Vredenburg in 51 seconds.\nReedsport finished fourth while South Umpqua had a tenth place finish and Riddle finished 11th with 16 points.\nTeam Scores\n1. Roseburg, 221; 2. Glide, 192; 3. Douglas, 100; 4. Reedsport, 85.5; 5. Coquille, 73.5; 6. Myrtle Point, 57; 7. Klamath Union, 48; 7. Rogue River, 48; 9. Bonanza, 44; 10. South Umpqua, 38; 11. Riddle, 16.\nFirst Place Matches\n113 — Gage Dill, Glide, dec. Carson Keith, Reed, 7-0. 120 — Oak Tenold, Bon., p. Riley Reddick, Glide, 1:46. 126 — Kahleb Diaz, Rose, p. Isaiah Franco, KU, 3:08. 132 — Cole Waldron, Doug, p. Gabe Syverson, Glide, 1:10. 138 — Nakai Sinohui, SU, p. Jacob Huse, Doug, 3:33. 145 — Riley Rose, Rose, p. Noah Thompson, Rose, 2:45. 152 — Darian Thacker, Rose, p. Giovanni Allison, Glide, 2:34. 160 — Zach Holland, Glide, p. Bryson Diaz, Rose, 3:09. 170 — Devin Lichte, Reed, p. Owen Vredenburg, Rose, :51. 182 — Doran Gillespie, Rose, dec. Kadin Baker, Doug, 7-2. 195 — Joey Vigue, Coq, p. Jese Brecht, Doug, :40. 220 — Collyn Potter, Glide, dec. Tyler Moore, KU, 5-2. 285 — Gabe Echaide, RR, p. Zach Vigil, Glide, 1:36.\nThird Place Matches\n113 — Casey Connot, Bon., p. Kayd Shelby, Rose, :21. 120 — Bailey Wentz, Glide, p. Jacob Bowman, MP, :50. 126 — Tyler Huerta, MP, p. Fisher Wahl, Reed, :41. 132 — Elijah Carson, Reed, p. Adam Leaton, Rose, 3:28. 138 — Devin Folk, Rose, p. Pd Matthews, MP, 2:54. 145 — Brandon Coolidge, Reed, p. Ruendy Indalecio, Coq, 3:32. 152 — Brayden Clayburn, Coq, p. Ely Mignola, Rose, 2:58. 160 — Rylie Stroisch, Rose, p. Justin Cassaro, Reed, 1:34. 170 — Rhett Syverson, Glide, dec. Caleb Barnwell, RR, 6-1. 182 — Cayden Kangiser, Glide, dec. Tyler Estes, Rose, 6-1. 195 — Rourke Martin, Rose, p. Hunter Hillard, Rose, 1:30. 220 — Cody Van Sickle, Rose, o. Gabe Tambellini, RR, 1:47. 285 — Mason Labahn, Rose, p. Cole Brecht, Doug, 1:49.", "url": "https://apnews.com/494aa8a37d0342aa945b37db0a6983f3"}