{"authors": ["Hilary Goodfriend", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:06", "date_modify": "2020-05-04 19:51:06", "date_publish": "2017-02-17 00:00:00", "description": null, "filename": "2017_02_sanctuary-movement-central-america-el-salvador-trump-deportations_1588621866.html", "image_url": "https://images.jacobinmag.com/2017/02/17233837/CISPES.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_02_sanctuary-movement-central-america-el-salvador-trump-deportations_1588621866.html", "title": "A Demand for Sanctuary", "title_page": "A Demand for Sanctuary", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe word “sanctuary” has taken center stage in recent weeks for the first time in several decades. Across the country, churches, restaurants, campuses, and cities are declaring themselves sanctuary sites in the face of escalating threats from the Trump administration against undocumented immigrants and others vulnerable to deportation. These actions harken back to the 1980s, when a religious-based Sanctuary Movement sought to shelter refugees fleeing the violence of US-backed wars against leftist insurgencies and governments in Central America. In response to the Cuban Revolution in 1959 and the subsequent victory of the Sandinista National Liberation Front (FSLN) against the US-backed Somoza dictatorship in Nicaragua in 1979, the United States scaled up its support for anti-communist regimes in the region. Under the Carter and Reagan administrations, the United States sent military advisors and hundreds of millions of dollars in weapons and military aid to the right-wing dictatorships in Guatemala and El Salvador. There, US-trained armies responded to leftist insurgencies with unspeakable campaigns of sustained violence against the civilian population in the form of massacres, death squads, torture, rape, and disappearance. In Guatemala, the decades-long civil war would eventually claim 200,000 lives, with state forces responsible for 93 percent of the violence, according to a UN report; in El Salvador, 75,000 were killed, with state forces responsible of at least 85 percent of the crimes. The Reagan administration also covertly and illegally armed and supported paramilitary “contra” forces against the Sandinista government, financing this illicit venture through clandestine arms deals with Iran. As these anti-communist proxy wars ravaged Central America, a massive grassroots response arose in the United States. This movement, sometimes referred to as the Central America solidarity movement or the Central America peace movement, encompassed a vast and diverse amalgamation of organizations and tactics fighting to halt US support for the wars, defend the revolutionary projects of Central American popular movements, and protect Central American refugees seeking a safe haven in the United States. As part of the movement, activists traveled to Sandinista Nicaragua under siege from the contras, indigenous communities facing genocidal violence in Guatemala, liberated guerilla territory in El Salvador, and Salvadoran refugee camps in Honduras to witness first-hand the collective organizing for social and economic justice so fiercely opposed by the “Free World” and to gather testimonies on the depredations of US foreign policy. In the United States, they engaged in collective acts of civil disobedience, put their lives on the line in courageous direct actions, waged national political campaigns, provided aid and services for victims of the violence, and organized mass mobilizations. As an array of forces again raise the mantel of “sanctuary,” it’s important to remember that the sanctuary movement of the 1980s was but one component of a broad-based, cross-border, anti-imperialist liberation struggle. This is the radical heritage that our organized responses to mass deportations, refugee bans, and imperialist wars must claim today.\nSanctuary Angela Sanbrano was a law student in Los Angeles in the late 1970s, when Central American refugees began flooding the city. She worked taking interviews for asylum applications and became increasingly involved in the emerging movement, eventually rising in the ranks of the Committee in Solidarity with the People of El Salvador (CISPES) to serve as the organization’s first Executive Director. Sanbrano went on to direct the Central American Resource Center (CARECEN) in Los Angeles, where she now serves as Chair of the Board of Directors. “The sanctuary movement and the solidarity movement were like sisters,” she says. “One obviously was grounded in the inter-faith sector, and the solidarity [movement] was primarily students and the Left and progressives that had been involved in the Vietnam War and the civil rights movement and the peace movement.” The sanctuary movement built on a rich US tradition of religious communities engaging in principledcivil disobedience out of a belief in a higher moral righteousness, from the Underground Railroad to the Civil Rights movement and opposition to the Vietnam War. The groundwork was laid in the 1960s, as US church-people traveled to Latin America as part of the Alliance for Progress, Kennedy’s reformist initiative to fight the perceived rise of communism in the region. There, many were exposed to and radicalized by the growing Liberation Theology movement, which brought together Marxist and Christian doctrines to advance a “preferential option for the poor” in the face of devastating inequality and increasingly violent repression. These sympathies were strengthened as atrocities against religious leaders in Central America began to draw international attention, particularly in El Salvador in 1980 with the assassination of Archbishop Oscar Romero and the rape and murder of four North American churchwomen, and again in 1989 with massacre of six Jesuit priests, their housekeeper and her daughter at the Central American University. The sanctuary movement emerged as a desperate response to the politicized inequities of US immigration law. Migrants fleeing violence and persecution were dying in the southwestern deserts, and congregants seeking to aid these refugees were horrified to learn that the US government’s response to the survivors was deportation, not provision of shelter. This was because granting asylum to refugees of the violence from US-backed anticommunist regimes would imply a recognition that those allies were indeed committing human rights abuses, thus endangering their US funding and support. As a result, asylum seekers escaping Sandinista Nicaragua were received with open arms, while the masses fleeing violence from right-wing military regimes in Guatemala and El Salvador were all but summarily denied. As they became aware of the perils that refugees would risk in their home countries, many of them dissidents fleeing for their lives, religious communities began to open their doors. The movement was formally launched in 1982, when several congregations across the country publically defied US immigration laws and declared themselves sanctuaries for refugees from Guatemala & El Salvador facing deportation. Initial leaders included James Corbett and the Tucson Ecumenical Council (TEC); subsequently, the Chicago Religious Task Force on Central America (CRTFCA) would emerge to coordinate the growing movement. But unlike the more formal solidarity and anti-intervention networks, sanctuary remained a decentralized, localized initiative. Early on, the movement was infiltrated by agents from the Immigration and Naturalization Service (INS, a predecessor to today’s Immigration and Customs Enforcement). In 1985, fourteen religious sanctuary activists were indicted on charges of conspiracy and alien smuggling in Tuscon, Arizona; eight were convicted the next year. By then, nearly 400 churches and synagogues had emerged as sanctuary sites. Scores of cities and several states would follow. In addition to providing shelter and basic services, sanctuary activists were instrumental in the legal battles to shield refugees from deportation. Following the indictments in Tucson, religious groups and churches joined Central American organizations providing immigration support services to sue the government for discriminating against Salvadoran and Guatemalan asylum seekers in the American Baptist Churches v. Thronburgh (ABC) class action law suit, which was finally settled in 1991 to allow new asylum hearings for certain applicants who had been rejected. Sanctuary activists also helped push for the 1990 Immigration Act which created Temporary Protected Status (TPS) for certain migrants, in particular those from El Salvador, as well as the 1997 Nicaraguan Adjustment and Central American Relief Act (NACARA), which allowed Salvadorans and Guatemalans included in the ABC suit to apply for a suspension of deportation and granted legal permanent residency to Nicaraguans (still, we should note, a vastly unequal resolution). Sanctuary churches would often develop sister relationships with counterparts in Central America, organizing delegations to travel to Nicaragua, El Salvador, or Guatemala to witness the violence of US-backed forces and “accompany” the social justice work led by the Liberation Theology-inspired congregations. These experiences, together with refugee testimonies, strengthened the transnational bonds between communities and consolidated opinions against the wars.\nRefugee Leadership Sanctuary was a faith-based, humanitarian initiative, but its political content was inescapable. In the face of refugee testimony of the horrors of the US-backed violence in Central America, religious communities broke US law in the name of a higher moral authority. At the same time, the testimonies served to counter the US government’s narrative of democratic Central American administrations fending off Soviet-sponsored terrorists. As part of the broader solidarity movement, refugee testimonies provided compelling evidence against the government’s claims, thus bolstering anti-intervention efforts. “I became aware of what was happening in El Salvador through the refugees,” says Angela Sanbrano. “Many of them had been captured and tortured, or their friends or relatives had been tortured or disappeared.” Sanctuary churches were often involved in coalitions with solidarity organizations. Leslie Schuld joined CISPES as a university student in Ohio and went on to serve as the organization’s National Program Director; Schuld now directs the Centro de Intercambio y Solidaridad (CIS) language school in San Salvador, where she has lived since 1993. She remembers working with a local coalition on sanctuary as part of the Dayton Central America Solidarity Committee: “It was more church-related, but solidarity was in there too. We were kind of the rabble-rousers,” she laughs. Refugee stories from the sanctuary movement served a crucial politicizing role. [The testimony] woke people up, really. [We were able to] conscientize people from those families’ testimonies about the war and why people were leaving. […] It was a platform to speak out about the plight of the refugees who were fleeing the violence that was perpetrated by US policy. The role of Central American refugees in the movement was by no means limited to that of victims and witnesses. “You can really see the influence of the refugees of Central Americans themselves, the role that they played in building both the solidarity movement and the sanctuary movement,” Angela Sanbrano emphasizes. In Los Angeles, the refugees started to do marches and they were doing pickets and they were letting people know about the war. […] I started going to the rallies. […] They would see that I was interested so they started talking to me to help them get [access to] facilities at the school so they could have meetings. I got involved by them recruiting me. In fact, the Central America solidarity movement was founded in large part by Central American exiles in the 1970s. Revolutionary Nicaraguans and Salvadorans, particularly, formed political groups and organized to denounce the escalating violence in their home countries. These activists drew US citizens to their cause, and helped facilitate connections between the emerging US movement and leftist insurgencies and social movements in Central America. As the waves of migration increased in the 1980s, refugees also formed mutual aid organizations like CARECEN and El Rescate in Los Angeles that played key roles in the legal battles to protect asylum seekers from deportation.\nSolidarity While the entire movement was involved in anti-intervention work, opposing US aid to the Salvadoran and Guatemalan regimes and to the contras in Nicaragua, the more radical wing was involved in direct solidarity with leftist social movements and armed revolutionary forces like the Sandinistas in Nicaragua and the Farabundo Martí National Liberation Front (FMLN) in El Salvador resisting reactionary US-backed armies and attempting to build just, equitable societies. These groups drew from a long legacy of US anti-imperialist international solidarity organizing, from the 1898 Anti-Imperialist League, solidarity with the original Sandinista in the 1920s, US-Chile solidarity in the wake of the 1973 US-backed coup, to the 1975 Puerto Rican Solidarity Committee. They included the Nicaragua Solidarity Network, founded in 1979 following the Sandinista’s overthrow of the Somoza dictatorship; CISPES, which was founded in 1980 at the dawn of what would be a twelve-year civil war and became the largest and most formidable of the solidarity groups; the Network in Solidarity with the People of Guatemala (NISGUA), formed in 1981; the SHARE Foundation, a faith-based, El Salvador-focused initiative, born in 1981; and Witness for Peace, also a faith-based group, established in 1983 to counter the Contra War in Nicaragua. The direct relationships that the solidarity groups maintained with their revolutionary counterparts in Central America granted these organizations a powerful political engine for their organizing. They were not just fighting against US imperial violence, but for a radical political project. Leslie Schuld explains, “CISPES from the very beginning defined itself as a solidarity organization, which was very important: it wasn’t just anti-intervention. […] We were responding to an organized movement in El Salvador, and CISPES, we were seen as players, we were seen as part of the strategy rather than just humanitarian aid fundraisers or charity.” This solidarity organizing took many forms. The Nicaragua groups organized brigades to work in the Sandinistas’ coffee harvests and provide human rights accompaniment in the face of Contra assaults. Witness for Peace brought over 10,000 people to Nicaragua over the course of the decade. SHARE, for its part, organized delegations from the US to accompany organized Salvadoran refugees in their journeys from camps in Honduras to repopulate their abandoned communities in warzones. CISPES took delegations into FMLN-held territories and hosted speaking tours for FMLN and Salvadoran social movement leaders. NISGUA brought Rigoberta Menchú and other representatives on a six-month tour across the United States to denounce the US-sponsored violence against indigenous peoples in Guatemala. These on-the-ground relationships with organized Central American movements created rapid international response networks to human rights crises. “Lives were saved,” remembers Schuld. “We would send telexes when people were captured. If there wasn’t that international attention, people would be killed. They disappeared. So we responded numerous times to human rights violations and people were released because of that pressure.” Among the notable anti-intervention initiatives of the solidarity movement was the Pledge of Resistance campaign, which was born in 1983 after the US invasion of Granada sparked fears of a forthcoming US invasion of Nicaragua. Initially a Nicaragua-focused campaign with significant support from Witness for Peace, Sojourners, and the American Friends Service Committee, the Pledge went on to expand to include opposition to broader US intervention in the region with support from secular groups like CISPES and the Nicaragua Solidarity Network. By late 1985, 80,000 people had signed the pledge to resist US-sponsored violence in Central America. These supporters mobilized in massive protests, direct actions, civil disobedience, and congressional pressure throughout the decade. The direct actions organized by the solidarity movement were militant and dramatic. In 1987, Vietnam veterans staged a blockade at the Concord Naval Weapons Station in Northern California, a principal source of US arms shipped to El Salvador and beyond. One of the veterans, Brian Willson, initiated a hunger strike on the train tracks and lost both his legs and nearly his life after a train ran him over. This tragedy prompted an even greater, sustained mobilization against the arms shipments lasting another two years. Other actions, like the 1988 mobilization to shut down the Pentagon, saw hundreds arrested. The solidarity movement’s militancy and, in many cases, unapologetic allegiances to armed revolutionary movements, earned the ire of the Reagan administration, prompting several covert FBI investigations, surveillance, and harassment.", "url": "https://jacobinmag.com/2017/02/sanctuary-movement-central-america-el-salvador-trump-deportations"}