{"authors": ["Gavin Jackson"], "date_download": "2020-05-04 20:26:34", "date_modify": "2020-05-04 20:26:34", "date_publish": "2017-01-03 01:00:00", "description": "COLUMBIA — Lawmakers approved the anti-opioid life-saving drug naloxone for sale without a prescription earlier this year, and now state medical professionals have approved dispensary...", "filename": "_ed2c170dd2d6481894bbc9ffb1df03a7_1588623994.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ed2c170dd2d6481894bbc9ffb1df03a7_1588623994.html", "title": "New guidelines ease access to opioid antidote amid increasing overdose rates", "title_page": "New guidelines ease access to opioid antidote amid increasing overdose rates", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "COLUMBIA — Lawmakers approved the anti-opioid life-saving drug naloxone for sale without a prescription earlier this year, and now state medical professionals have approved dispensary guidelines.\nThe protocol says people with a history of opioid use and abuse or who are in rehab are eligible to obtain the drug, among others who are cleared for access.\nNaloxone can reverse the effects of an overdose from opioid-based painkillers and heroin if administered in time.\nNarcan, a nasal spray version of naloxone, received U.S. Food and Drug Administration approval just last November. Prior to the approval the drug was only available as an injection.\n“The Legislature recognized that not every person at risk for an opioid-related overdose will seek the help of a prescriber and sought to further increase access to the life-saving antidote,” S.C. Board of Pharmacy Chairwoman Carole Russell said.\nOpioid-related drug overdose deaths in the state increased 12 percent last year, claiming 640 South Carolinians, according to the Centers for Disease Control and Prevention.\nRussell’s board, together with the state Board of Medical Examiners, recently approved the protocol.\nOne spray of Narcan in an overdosing victim can reverse the opioid effects in less than three minutes. Additional doses may be needed and proper medical attention is critical.\nHealth advocates have applauded the legislative moves, but an unfortunate side effect is the complacency that has come with the access to the life-saving antidote.\n“They (first responders) call them frequent fliers,” Horry County Coroner Robert Edge said about repeat overdose victims. “I guess Narcan is good on one side because it will save somebody’s life, but it will increase the usage on the other side.”\nOverdose rates remain “rampant” in the county, according to Edge, since heroin and the synthetic opioid fentanyl are cheaper and easier to find than pills.\nRecent CDC data found 63 percent of the 52,404 drug overdose deaths nationwide in 2015 involved an opioid. Death rates involving heroin and synthetic opioids, likely driven by illicitly manufactured fentanyl, increased sharply nationally and in South Carolina.\nBetween 2014 and 2015, more South Carolinians died from synthetic opioids than heroin, but heroin overdose rates climbed faster at 57 percent.\nPrescription opioid deaths were flat, year over year, but the segment remains the primary driver of overdose deaths in the state totaling 644 over the past two years. If trends continue, deaths from heroin and synthetics, together, will outpace traditional opioid prescription-related deaths in 2016.\nMethadone-related overdose deaths declined 25 percent last year in the state. They were the only rates that declined.", "url": "https://apnews.com/ed2c170dd2d6481894bbc9ffb1df03a7"}