{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:04:06", "date_modify": "2020-05-04 20:04:06", "date_publish": "2017-09-22 19:50:00", "description": "Much has already been written about the commercial and critical failure of Darren Aronofsky’s latest project “Mother!” The film received an F rating from CinemaScore, which polls snap responses...", "filename": "_eeb8199a774d45258c5e4621a8307d11_1588622646.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eeb8199a774d45258c5e4621a8307d11_1588622646.html", "title": "'Mother!' loses its message, is hard to watch", "title_page": "'Mother!' loses its message, is hard to watch", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Much has already been written about the commercial and critical failure of Darren Aronofsky’s latest project “Mother!” The film received an F rating from CinemaScore, which polls snap responses from audience members as they exit the theaters. Nevertheless, Paramount Pictures, Aronofsky and his star Jennifer Lawrence have been trying to defend this difficult experience, even as it’s been left hanging in the public square. But “Mother!” does have its fervent defenders. Some see it as a rich creation myth, while others enjoy it as a visceral display of blackly comic camp. I can see how these interpretations definitely exist within the material but not necessarily how they redeem it.\nLawrence stars as the new wife of a much older poet played by Javier Bardem. They live secluded in the country where Bardem is trying hard to break his writer’s block while Lawrence is rebuilding their home after a house destructive house fire. Their solitude is disrupted when a sick man played by Ed Harris and wife played by Michelle Pfeiffer wander into their home and make themselves comfortable. Just as things are getting awkward and their welcome becomes worn, more uninvited guests arrive and it appears that Lawrence’s character has no control over the situation. Her sanity is also put to the test as it seems like the house itself is bleeding and responding physically to the emotional stress brought upon by these menacing guests, as well as Bardem’s inability to recognize the problem at hand.\nThat’s the simplest way to describe these events as they occur, but even this bare synopsis doesn’t do justice to the script’s wild arrangement. None of the characters have names and it becomes clear after 20 minutes or so that whatever we’re seeing is not to be taken literally. The movie itself is a poem, structured in stanzas instead of acts and with symbolic imagery standing in the place of plot points. Perhaps if audiences were warned of this before going in to see what was marketed as a psychological horror film, with a poster designed to evoke Polanski’s classic “Rosemary’s Baby,” they may have been a little more forgiving of Aronofsky’s indulgent storytelling. Then again, it’s also not hard to see how and why someone would lose patience with everything going on here.\nWhen a film begs this hard to be asked what it’s actually about, the mind grasps for the nearest allegory. Is it a feminist story about the fears of domesticity? Is it about how stars are treated in the ever-present eye of the media? Is it about the complicated relationship between an artist and his inspiration? Aronofsky himself has suggested that it’s an ecological allegory about man destroying Mother Earth. “Mother!” is about all of these things and nothing at the same time. As chaos mounts and tension builds within the contained interior setting of this country home, the movie’s meaning shifts and intensifies, sometimes focusing more on Lawrence’s fragile performance and other times on the broader big-picture stuff happening around her. The more broad and otherworldly things get the less of a handle the film has on its symbolism and more unintentionally funny it becomes.\nWhile “Mother!” might go down as a “Heaven’s Gate” or “Ishtar” sized failure, there are some reasons to see it and reasons to believe that, like those films, it may find an audience later. Lawrence’s protagonist is put through almost Lars von Trier levels of humiliation and abuse and it’s difficult to follow her journey, but her commitment to the picture, which is almost entirely from her perspective, is thoroughly grounded in textured emotion. Pfeiffer’s comic timing and vampy presence also helps to alleviate some of the pictures heavy-handed self-importance. On a technical level, Aronofsky’s subjective camera work and the film’s many shocks certainly deliver, even if the end result is naval gazing, self serving and aggravating to watch.\nGrade: C-\nCassidy Robinson is a former Idaho State University student with a master’s degree in film studies from Orange County’s Chapman University. He is currently working as a media journalist in Los Angeles, California.", "url": "https://apnews.com/eeb8199a774d45258c5e4621a8307d11"}