{"authors": ["Jim Meehan"], "date_download": "2020-05-04 20:05:47", "date_modify": "2020-05-04 20:05:47", "date_publish": "2017-03-16 00:00:00", "description": "SALT LAKE CITY – Seems logical Johnathan Williams would lock down South Dakota State scoring wizard Mike Daum. Williams had a season to prepare. The Missouri transfer spent his...", "filename": "_15a3de07ef024980bd22b0f976a210bc_1588622747.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_15a3de07ef024980bd22b0f976a210bc_1588622747.html", "title": "Gonzaga’s Johnathan Williams dominates South Dakota State’s Mike Daum", "title_page": "Gonzaga’s Johnathan Williams dominates South Dakota State’s Mike Daum", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SALT LAKE CITY – Seems logical Johnathan Williams would lock down South Dakota State scoring wizard Mike Daum.\nWilliams had a season to prepare.\nThe Missouri transfer spent his NCAA-mandated season on the sidelines by lining up day after day in practice against Kyle Wiltjer, Gonzaga’s elite scoring forward with shooting range out to the parking lot who graduated after the 2016 season.\nSound familiar? Prior to the game, Gonzaga coaches mentioned Daum as being in the Wiltjer mold – a crafty finisher around the rim, a 3-point bomber capable of putting points up in bunches – but possessing a better game off the bounce.\nAll certainly true as Daum put up video-game numbers night after night this season, including a 51-point outburst and another with 42.\nUntil, that is, Daum encountered Williams, the athletic, 6-foot-9 junior forward who hounded South Dakota State’s star player into a 7-of-16 shooting performance in Gonzaga’s 66-46 first-round NCAA tournament win on Thursday.\n“My redshirt year I had to guard Kyle a lot,” Williams said. “I think that kind of prepared me for Daum. B-Mike (assistant coach Brian Michaelson) told me all he could. I took that scouting report to heart and made sure to make life hard for him.”\nDaum had his lowest scoring game in more than a month. He’d only been held under 20 points four times since Dec. 7.\n“The job J3 (Williams) did on Daum,” Gonzaga coach Mark Few marveled. “I think he probably had five (points) on J3.”\nFew called Williams “probably the key” to Gonzaga’s defense because of his ability to move his feet, switch on guards and provide rim protection. And he wasn’t just talking about Thursday’s game.\nWilliams’ first priority was staying in front of Daum, no matter what the 6-9 sophomore pulled from his arsenal of moves. Daum did hit a catch-and-shoot 3 and he used a subtle chicken-wing to create space and drop a fallaway baseline jumper.\nBut more often than not, Daum found Williams in his path. Daum’s 3-point shots were usually over Williams’ extended arm. When Daum drove into the paint he wasn’t able to finish over Williams and GU’s other bigs.\nDaum, the nation’s leader in free throws made and attempted, didn’t get to the foul line until 5:59 remained in the second half. They were his only two attempts.\n“I just tried to stay disciplined,” Williams said. “I know he uses his shot-fake a lot and if shoots a 3 just try to contest it. If he drives, try to keep my hands back because I know he’s like a 90-percent free-throw shooter.”\nFrustration seemed to set in early in the second half when Williams went for a pump-fake, but bounced right back into the air to swat Daum’s layup attempt.\n“Obviously today wasn’t his best game,” Jackrabbits coach T.J. Otzelberger said of Daum. “Certainly their length, athleticism and physicality had something to do with that.”\nCertainly did. And it was certainly one of Williams’ best games as a Zag.", "url": "https://apnews.com/15a3de07ef024980bd22b0f976a210bc"}