{"authors": ["Brett Boese"], "date_download": "2020-05-04 20:03:48", "date_modify": "2020-05-04 20:03:48", "date_publish": "2017-11-20 15:20:00", "description": "AUSTIN — Bubba Grunewald was on the phone with friends on Nov. 11 when the unthinkable happened. The Austin High School sophomore heard what's been described as a \"horrific car accident\"...", "filename": "_190b33c14dd44dc693a2d69dd66cf1ea_1588622628.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_190b33c14dd44dc693a2d69dd66cf1ea_1588622628.html", "title": "'Long road ahead' for injured teen", "title_page": "'Long road ahead' for injured teen", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "AUSTIN — Bubba Grunewald was on the phone with friends on Nov. 11 when the unthinkable happened.\nThe Austin High School sophomore heard what’s been described as a “horrific car accident” unfold through the cell phone.\nScreams.\nCrash.\nSilence.\nGrunewald’s classmates had swerved to avoid a deer in rural Freeborn County, just west of Austin, and collided with a culvert in the ditch. Grunewald, known as “Bubba,” rushed to the scene with four friends, called authorities and personally transported five of his injured friends to Mayo Clinic’s campus in Austin.\n“All of a sudden they started freaking out, and then the call just dropped,” Grunewald said of the chaotic night. “I tried to call back but it didn’t work. I kind of knew about where they were so I went to find them because they weren’t answering.”\nThe driver, 17-year-old Daniel Nelson, told authorities he’d been going 60 MPH at the time of the crash. He escaped with a swollen left eye and minor cuts, according to the Freeborn County Sheriff’s Office. He was transported to Mayo’s Austin campus via ambulance.\nThe other five were helped by Grunewald. Three of them were later transferred to Rochester for emergency care.\nTarin Marie Ingebritson credits Grunewald’s quick, calm response for saving at least two lives. That includes her son, Gavin Brady, who was unconscious when Grunewald and company arrived at the crash site.\n“I’m forever indebted to him,” Ingebritson said Sunday from Saint Marys Hospital in Rochester, where she’s spent the last week. “If it wasn’t for him, I don’t think Gavin — and at least one of the others —would have made it; they probably would have bled out.”\n‘Long road ahead’\nAll but one of the injured Austin students have been released from the hospital. Kaya Igue suffered a broken back; James Lund broke both arms and had a deep gash on his head, according to Grunewald; authorities didn’t identify them by name.\nBrady was seated in the front passenger seat and suffered the worst injuries.\nHis recovery is just getting started after he was diagnosed with a traumatic brain injury, two brain bleeds, a fractured skull and a broken leg. The road to recovery has already been fraught with detours and false starts.\nMayo Clinic discharged Brady on Wednesday, but that turned out to be overly optimistic. His time at home lasted less than two hours. Ingebritson said her son became inconsolable almost immediately.\nAfter being readmitted to Mayo’s Austin campus, he was quickly airlifted to Rochester — for the second time last week — and taken into emergency surgery to address what she called a “severe brain bleed.”\n“It was just immediate,” Ingebritson said of her son’s pain when they returned home. “He just started crying and screaming in pain.”\nOn Saturday, Mayo removed Brady’s drainage tube. While he’s resumed eating normal food, he’s still hooked up to IVs to treat an infection that’s developed near his jaw. It’s likely he’ll be released from the Saint Marys ICU later this week.\nIngebritson plans to remain in Rochester with family when her son leaves the ICU, even if it means putting her in-home daycare business on indefinite hold. She feels the close proximity to Mayo could be critical in the days and weeks to come.\n“It’s been a rough road for him,” Ingebritson said Sunday. “He’s very frustrated today — a lot of tears. He has a long road ahead.”\nPackers rally around Brady\nThe day after the crash, Austin wrestling coach Jer Osgood and his staff visited Brady in Rochester — along with others from the Austin community, including Grunewald. They’ve since started collecting gift cards to help his family pay for food and other necessities.\nOsgood says the whole wrestling community has rallied around Brady, who finished fourth in Section 1AAA last year in the 113-pound weight class. The Packers are ready and waiting to welcome him back to the team — in any capacity.\n“His family and brothers are behind him,” Osgood said. “He is, as a sophomore, an integral leader in this group and undeniably one of the toughest kids we have.\n“The wrestling community is in complete support of him, and the school district is, too.”\nOthers have also stepped up to help the injured teen.\nA GoFundMe page appeared online Thursday to support Brady’s parents, who have remained at his side throughout his hospitalization. The fundraiser’s goal is set at $10,000.\nIngebritson says well-wishers have been bombarding her phone all week. She appreciates the support, even if she hasn’t been able to answer most of the calls.\n“It helps (Gavin) know that people are praying and rooting for him,” she said. “I’ve just had an overwhelming amount of phone calls. I haven’t been able to return a lot of them … but we’re very appreciative of that support. I’ll be writing thank you letters to everyone when this is over.”", "url": "https://apnews.com/190b33c14dd44dc693a2d69dd66cf1ea"}