{"authors": ["Loren Balhorn", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "David Broder", "Marcus Barnett", "Simon Webb", "Joëlle Fontaine", "Stefanie Prezioso"], "date_download": "2020-05-04 19:58:44", "date_modify": "2020-05-04 19:58:44", "date_publish": "2017-05-08 00:00:00", "description": null, "filename": "2017_05_antifascist-movements-hitler-nazis-kpd-spd-germany-cold-war_1588622324.html", "image_url": "https://images.jacobinmag.com/2017/05/08093346/Antifa-Conference-1932.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_05_antifascist-movements-hitler-nazis-kpd-spd-germany-cold-war_1588622324.html", "title": "The Lost History of Antifa", "title_page": "The Lost History of Antifa", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe origins of the word “antifa” — shorthand for decentralized, militant street activism associated with its own aesthetic and subculture — might be murky to most readers. Even in Germany, few know much about the popular forms of antifascist resistance that coined the term. The movement’s short but inspiring political legacy proved too uncomfortable for both Cold War-era German states, and was ignored in schools and mainstream history. Today its legacy is almost entirely lost to the Left.\nOut of the Ruins By 1945, Hitler’s Third Reich lay physically destroyed and politically exhausted. Basic civil society ceased to function in many areas, as the Nazi grip on power faltered and regime supporters, particularly in the middle- and upper classes, realized that Hitler’s “final victory” was a fantasy. On the Left, many Communists and Social Democrats had either been outright murdered by the Nazis, or died in the ensuing war. The unimaginable human and material destruction wrought by Nazi rule killed millions and turned German society upside down, decimating the labor movement and murdering most of the country’s Jewish population. Millions who had supported or at least acquiesced to the regime ­— including many workers and even some former socialists — now faced a new beginning in unknown political terrain. Yet despite its failure to stop Hitler in 1933 and veritable dismantling in subsequent years, Germany’s socialist labor movement and its decidedly progressive traditions outlived Hitler in the factories of its industrial cities, and began gathering up the fragments as soon as open political activity became possible. As historian Gareth Dale describes: Of all sectors of the population, it was industrial workers in the major towns that showed the greatest immunity to Nazism. Many trade unionists and socialists were able to maintain their traditions and beliefs, at least in some form, through the Nazi era. A courageous minority, including some 150,000 Communists, took part in illegal resistance. Wider layers avoided danger but were able to keep labour movement values and memories alive amongst groups of friends, in workplaces and on housing estates. These groups, oftentimes launched from the aforementioned housing estates, were generally called “Antifaschistische Ausschüsse,” “Antifaschistische Kommittees,” or the now famous “Antifaschistische Aktion” – “Antifa” for short. They drew on the slogans and orientation of the prewar united front strategy, adopting the word “Antifa” from a last-ditch attempt to establish a cross-party alliance between Communist and Social Democratic workers in 1932. The alliance’s iconic logo, devised by Association of Revolutionary Visual Artists members Max Keilson and Max Gebhard, has been since become one of the Left’s most well-known symbols. After the war, Antifas varied in size and composition across the former Reich, now divided into four zones of occupation, and developed in interaction with the local occupying power. Emerging seemingly overnight in dozens of cities, most formed immediately after Allied forces arrived, while some such as the group in Wuppertal “liberated” themselves in street battles with Hitler loyalists before the Allies could. Pivotally, these circles were not spontaneous instances of solidarization between traumatized war survivors, but the product of Social Democratic Party (SPD) and Communist Party (KPD) veterans reactivating prewar networks. Albrecht Lein reports that the core of the Braunschweig Antifa was made up of KPD and SPD members in their forties and fifties who had avoided the front, though Catholic workers’ organizations and other forces were also involved. The Antifa groups numbered between several hundred and several thousand active members in most cities, while the openly decried lack of youth involvement can be ascribed to twelve years of Nazi education and socialization, which annihilated the once widespread proletarian-socialist attitude among most young Germans. Though the material needs of war and reconstruction incorporated women into economic life in new ways, the male dominance characteristic of German society at the time was also reflected in the Antifa movement, which consisted largely (but not entirely) of men. Antifas tended to focus on a combination of hunting down Nazi criminals and underground Nazi partisans (the so-called “Werewolves”) and practical concerns affecting the general population. Braunschweig’s Antifa, for example, printed a twelve-point program demanding, among other things, the removal of Nazis from all administrative bodies and their immediate replacement with “competent antifascists,” liquidation of Nazi assets to provide for war victims, emergency laws to prosecute local fascists, and the reestablishment of the public health-care service. Typical of an organization led by socialists and thus keenly aware of the need for print media as an organizing medium, the program’s twelfth and final point consisted bluntly of a “Daily newspaper.” Although surviving records indicate that many Antifas were dominated by the KPD, the political mood in the early months was far from the “Third Period” adventurism of the late Weimar period. Across the board, local Antifas were motivated by a desire to learn from the mistakes of 1933 and build a non-sectarian labor movement bridging divisions. This was buoyed by a widespread sense at the war’s end that the horrors of Nazism had been a result of the instability and inequality of capitalism, and that a new, egalitarian economic system was needed for the postwar order. Demands for nationalization of industry and other left-wing policies were widespread. Even the forced marriage between KPD and SPD into the Socialist Unity Party (SED) in the Soviet zone drew on this sentiment and recruited many former oppositionists in the first year. In British-occupied Hamburg, a joint KPD-SPD action committee convened in July 1945 with broad support from their respective memberships to declare: The will to merge into a powerful political party lives in the hearts of the millions of supporters of the once warring German workers’ parties as the most meaningful outcome of their shared suffering. This desire is deeply etched into all of the surviving prisoners from the concentration camps, prisons, and Gestapo institutions. The rest of the document consisted of practical demands around which to unite Hamburg’s fragmented labor movement. Antifas enjoyed varying degrees of success depending on the composition of the local movement and the amount of leeway allowed to them by occupying powers. Despite forming outside of the Allied administration and pushing forward popular de-Nazification policies against occupying forces who sought reconciliation with the old authorities, they were in no position to contest Allied hegemony and represented militant minorities at best. The southwestern industrial city of Stuttgart, for example, was fortunate enough to be involved in territorial maneuvering between the United States and France, which occupied the city preemptively. Keen to avoid civil unrest and thus give the Americans a pretext to take it back, French authorities allowed Stuttgart’s antifascists considerable leeway in dismantling the Nazi-era German Labor Front (DAF), rebuilding shop-floor organization in the factories, and organizing the population in cross-party antifascist alliances. Stuttgart is also noteworthy for the presence of the Communist Party (Opposition), or KPO. This group around former KPD leaders August Thalheimer and Heinrich Brandler had recruited a large number of the city’s mid-level KPD factory activists and functionaries following that party’s ultra-left turn in 1929. The KPO’s vocal advocacy for an anti-Nazi front of all workers’ organizations in the run-up to 1933 allowed it to consolidate a small but considerable base of experienced Communist cadre repulsed by the Stalinization of their party. Although never a mass organization and only a shadow of its former self after the war, what remained of the KPO had a decisive influence over Stuttgart’s metal workers’ union for several years and was able to play a role in the factories. These activists and others provided the city with a core of capable militants who understood, through experience, the need to unite workers on a cross-party basis around basic social demands. Like everywhere else in Germany, Stuttgart’s Antifa movement was soon neutralized and diverted back into the old divisions between SPD and KPD, but the city’s rebellious tradition and penchant for unity in action would reemerge in 1948, when widespread anger at drastic price rises triggered a citywide general strike that encompassed 79 percent of the workforce and spread to several other localities.\nOverdetermined The Antifa movement faced an almost impossible situation in 1945. The country lay in ruins in every sense imaginable, and had gone through a phase of destruction, brutality, and wanton murder unprecedented in scale. The Antifa’s predicament was by and large “overdetermined,” in the sense that historical forces beyond their control would ultimately seal their fate. These socialists and antifascists, though numbering in the tens of thousands across the country, could not have been expected to provide a plausible political alternative to the overwhelming might of the Cold War. Germany in 1945 was set to become the staging ground for the longest geopolitical confrontation in modern history, and there was no way the fragments of a shattered socialist movement could have influenced developments in any meaningful way. Nevertheless, statements and documents from the time reveal thousands of determined antifascists and socialists, keenly aware of the unprecedented nature of their historical moment and putting forward a political perspective for what remained of the country’s working class. Although their numbers were comparatively and regrettably few given the movement’s former glory, their existence refutes the notion that the prewar German left was entirely destroyed by Nazism. Hitler certainly broke the back of German socialism, but West Germany’s postwar prosperity laced with anti-Communist paranoia would finally bury what remained of the country’s radical prewar traditions. Albrecht Lein recounts how the incredibly difficult conditions facing the Antifa also necessarily restricted their political perspective. Though they attracted thousands of socialists and were soon bolstered by returning Communists and other political prisoners from the concentration camps, briefly becoming the dominant political force in cities like Braunschweig, they were unable to offer a political road out of the country’s social misery. Lein argues that the labor movement’s failure to defeat Hitler and the fact that Germany had required liberation from without drove antifascists to a largely reactive policy, vigorously pursuing former Nazi officials and purging society of collaborators, but neglecting to build a plausible vision for a “new Germany” beyond both fascism and Cold War machinations. After the Communists dissolved the National Committee for a Free Germany (NKFD) in the weeks after the war, underground Nazi resistance groups began calling themselves the “Movement for a Free Germany.” Lein argues that this circumstance was symbolic of the overall political trajectory at the time: “Other than the notable exceptions of Leipzig, Berlin and Munich, the antifascist movements described themselves as fighting organizations against fascism, and not as Committees for a Free Germany. Leaving the task of gathering social forces for ‘liberation’ and thus, implicitly, renewing Germany to the Nazis and reactionaries characterized [. . .] their defensive position.” Germans’ failure to engage in popular resistance to Hitler even in the second half of the war understandably demoralized the Left and shook its faith in the masses’ capabilities — a trait historian Martin Sabrow also ascribes to the caste of Communist functionaries operating under Soviet tutelage in the East. In the French, British, and American zones, Antifas began to recede by the late summer of 1945, marginalized by Allied bans on political organization and re-emerging divisions within the movement itself. The Social Democratic leadership under Kurt Schumacher sided with the Western occupiers and returned the party to its prewar anti-Communist line by the end of the year, decreeing that SPD membership was incompatible with participation in the Antifa movement. In Stuttgart, the Antifa and what remained of the old trade union bureaucracy fought each other for political influence from the outset. The old leadership of the ADGB, prewar Germany’s central trade union federation, sought to reestablish formalized employment relations in the occupied zones, which would at least mean a return to normalcy for Germany’s working class. This ran counter to the approach of the Antifas, however, who cultivated strong ties to leftist shop stewards and factory committees, and usually called for nationalization and worker control of industry. These demands were ultimately not realistic in a shattered economy occupied by powerful foreign armies. The prospect of stability and a degree of economic recovery under the SPD simply proved more appealing to workers forced to choose between that and the principled but harrowing struggle put forward by the Antifa. Antifas were further hindered by the decision by the Allies, particularly the United States and Britain, to cooperate with what remained of the Nazi regime below its most executive levels. Antifas seeking to imprison local Nazi leaders or purge municipal bureaucracies were often stopped by occupying authorities who preferred to integrate functionaries of the old state into new, ostensibly democratic institutions. This had less to do with any particular affinity between the Allies and ex-fascist functionaries so much as it served the practical interests of keeping German society running under exceedingly difficult conditions without ceding influence to the reemerging radical left. Outnumbered and outgunned by the occupying powers and outmaneuvered by the SPD, the Antifa’s influence in the three western zones of occupation would evaporate in less than a year. West German society stabilized, the Cold War polarized the continent, and the political forces of old Germany in alliance with Social Democracy and the emerging Western bloc consolidated their hold over the country. The KPD, for its part, initially took on waves of new members, as its prestige rose in light of the Soviet victory over Hitler and broad anticapitalist sentiment. The party soon rebuilt its industrial bases, and by 1946 controlled just as many shop floor committees in the heavily industrialized Ruhr Region as the SPD. In his classic study of the German labor movement, Die deutsche Arbeiterbewegung, German scholar Arno Klönne places its total membership in the three Western zones of occupation at three hundred thousand in 1947, and six hundred thousand in the East prior to the founding of the SED in 1946. Following a brief period of participation in postwar provisional governments, however, the Allies sidelined the KPD, and the party soon returned to its ultra-leftist line. It sealed its political irrelevance in 1951 with the passage of “Thesis 37,” a position paper on labor strategy riddled with anti–Social Democratic and anti-trade-union slurs. The motion, passed at the party conference, obligated all KPD members to obey party decisions above and against trade union directives if necessary. This move obliterated Communist support in the factories veritably overnight and relegated the party to society’s fringes. It failed to re-enter parliament in the 1953 elections and was banned by the West German government outright in 1956. Developments were markedly different in the Soviet zone, but ultimately ended in perhaps an even grimmer dead end: that of SED leader Walter Ulbricht’s thoroughly Stalinized German Democratic Republic (GDR). An old-school Communist cadre from the party’s early years, Ulbricht had survived twenty years of Stalinist purges and fascist repression to lead the “Ulbricht Group,” a team of exiled KPD functionaries who now returned from Moscow to rebuild the country under Soviet occupation. Though the Red Army generals certainly did not have a particularly democratic or egalitarian vision for East Germany in mind, they rejected cooperation with the old Nazi hierarchy for their own reasons and for a while permitted Antifas and related institutions to operate relatively freely. Eyewitness accounts from as late as 1947 report of factories in East Germany’s prewar industrial centers like Halle (traditional Communist strongholds) where KPD-led works councils exerted a decisive influence over factory life, confident enough to conduct negotiations and argue with Soviet authorities in some instances. In an interview with Jacobin to be published later this year, veteran KPO activist Theodor Bergmann tells of Heinrich Adam, prewar KPO member and mechanic at the Zeiss optics factory in Jena who joined the SED in hopes of realizing socialist unity. Heinrich was an active Antifa and trade unionist who organized protests against the Soviets’ decision to take the Zeiss factory as war reparations (he suggested building a new factory in Russia instead). Adam was kicked out of the party for his independent views in 1952, although never persecuted, and lived out his days in Jena on a modest state pension for antifascist veterans. In Dresden, a group of roughly eighty Communists, Social Democrats, and members of the left-social democratic Socialist Workers Party (SAP) formed a committee in May 1945 to surrender the city to the Red Army, citing broadcasts from the NKFD as inspiration. In cooperation with Soviet authorities, this group subsequently raided food and weapons stores from the German Labor Front and other Nazi institutions, and organized a distribution system for the city’s populace in the first postwar weeks. Reports from Soviet officials and the Ulbricht Group describe rival antifascist groups, generally tolerated by the occupation, which beyond arming residents and organizing shooting practice also arrested local Nazis and opened soup kitchens for refugees from the eastern provinces. Internal communications reveal that leading Communists thought little of the Antifa, dismissed by Ulbricht as “the antifascist sects” in a communiqué to Georgi Dimitrov in mid-1945. The Ulbricht Group’s initial goal was to incorporate as many of these antifascists into the KPD as possible, and feared that repression would repel rather than attract them. Former Ulbricht Group member Wolfgang Leonhard would later claim in his memoirs, Child of the Revolution, that Ulbricht explained to fellow Communist functionaries: “It’s quite clear – it’s got to look democratic, but we must have everything in our control.” This period ended as the German Democratic Republic began to establish itself as a Soviet-style one-party state in the late 1940s, particularly after relatively free elections in 1946 delivered disappointing returns. Former KPO members and other oppositionists permitted to join after the war were investigated for past political crimes, purged, and often imprisoned. In the workplaces, the SED sought to rationalize production and thus neutralize the instances of factory control and democratic representation that had emerged. The establishment of the Free German Trade Federation (FDGB) in 1946 marked the beginning of the SED’s attempt to establish party control over the factories. These “unions” in fact organized East German workers in line with the interests of their practical bosses, the East German state, and sought to buy their loyalty through “socialist competition” schemes, piece work, and union-sponsored vacation packages. However, the “free” unions could not afford to phase out competitive elections overnight. Antifa activists were often elected to FDGB shop floor committees in early the years, thus exercising continued influence in the workplace for a bit longer. Some were integrated into mid-level management, while others refused to betray their principles and stepped down or were removed for political reasons. The public split between the Soviet Union and Tito’s Yugoslavia in 1948 accelerated Stalinization in the Soviet occupation zone, and these limited spaces of self-organization were soon shut down entirely. Subsequently, the GDR’s antifascist tradition would be diluted, distorted, and refashioned into an ahistorical national origins myth in which the citizens of East Germany were officially proclaimed the “victors of history,” but where little space remained for the real and complicated history, not to mention ambivalent role of Stalinized Communism, behind it.", "url": "https://jacobinmag.com/2017/05/antifascist-movements-hitler-nazis-kpd-spd-germany-cold-war"}