{"authors": ["Amanda Burke", "Aburke Sentinelandenterprise.Com"], "date_download": "2020-05-04 20:14:01", "date_modify": "2020-05-04 20:14:01", "date_publish": "2017-12-10 11:53:49", "description": "LEOMINSTER -- She arrived in Leominster on Dec. 1, with her two children and the $460 dollars her family collected to send her here after hurricanes Irma and Maria destroyed her home in Puerto...", "filename": "_31e636a749d64b6196fd30a0dd061245_1588623241.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_31e636a749d64b6196fd30a0dd061245_1588623241.html", "title": "Puerto Ricans Rebuilding Lives Far from Home", "title_page": "Puerto Ricans Rebuilding Lives Far from Home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LEOMINSTER -- She arrived in Leominster on Dec. 1, with her two children and the $460 dollars her family collected to send her here after hurricanes Irma and Maria destroyed her home in Puerto Rico.\nSitting in the Spanish American Center on Friday, Queen Elizabeth Centeno said she is now staying at a friend’s home where she has started the difficult task of rebuilding her life thousands of miles away from home.\nCenteno was among the many dozens of people from Puerto Rico with connections to the Twin Cities who, after the hurricanes, went to the Spanish American Center for help starting a life in or around Leominster.\nNeddy Latimer, the Spanish American Center’s executive director, said her organization sees 10 to 12 new families who like Centeno fled the island following the storms.\nStories like Centeno’s are becoming increasingly common, said Latimer. The process of acclimating has been a struggle for Centeno and her family.\nWhen she tried this week to enroll her sons in Leominster Public Schools, school officials told her the proof-of-residency documents she had were out-of-date, Centeno said through translator and the center’s licensed social worker Mickey Guzman.\nShe also had issues with the medical records she supplied to the school department -- they were written in Spanish.\nGuzman alleged school officials failed to tell her that the medical records would have to be translated into English, and improperly rejected her proof-of-residency documents.\n“They’re not giving her total information, they’re giving her half information, and she’s not the only client receiving that. The kids have been out of school, and they should have been in school the next day because she has their vaccines and medical services up to date, which is the only reason the school can refuse a child,” said Guzman. “They’re giving her the run-around.”\nInterim Superintendent of Schools Paula Deacon did not respond to an interview request left with her office on Friday.\nAt a School Committee meeting on Monday, Deacon said Leominster Public Schools have accepted 50 children displaced from Puerto Rico after the hurricanes this year.\n“Dislocated students are on our doorstep daily,” she said, adding that the system is working with the state to see whether it will receive additional funding to support the new students.\nLourdes Manzano is another of the hundreds U.S. citizens arriving from Puerto Rico trying to start a new life.\nShe had lived on the island for decades until the storms forced her to move to Leominster last month bringing with her only what she could fit into several suitcases.\nHer son, Alexis, was already living in the Plastic City. He insisted that Manzano come stateside after the hurricanes hit. But Manzano didn’t want to, because her husband of 19 years had decided to stay.\nAlexis was determined to bring his mother to the city, so he flew to Puerto Rico to get her.\nManzano had been receiving treatment for chronic medical issues before the storms but Hurricane Maria’s howling winds crippled hospital infrastructure.\nShe described the destructive forces of the 130 mph winds that swept across unincorporated organized territory of the U.S. Her house shook as the eye of the storm passed over.\nThe wind pulled down a power line, she said, that fell on the roof. Manzano said she spent an entire night bracing her body against the door to keep it from flying open and emerged in the morning to defoliated trees and a mangle of power lines. She was shocked by the still energized lines that had fallen on a metal gate that surrounded her property.\n“It was terrible,” she said at her motel room Friday. “All of the wind and the rain, it was such a bad experience when you hear the wind ripping off your roof and you see it flying into the neighbor’s yard.”\nStill, Manzano said she had second thoughts about leaving all the way to the airport. She knew in her heart, though, that she had to leave.\n“It’s 19 years we’ve been together,” she said of her second husband. “That’s a long time that’s a long life, and all the sudden we lose everything.”\nManzano has lived at the Motel 6 in Leominster for over a month now while she searches for an apartment.\nHers is one of 243 families of hurricane survivors who as of Wednesday were staying in Massachusetts motels and hotels paid for by the Federal Emergency Management Agency, according to spokesman Daniel Llargues.\nThe federal agency has committed to house the families for up to 60 days, with the possibility of an extension, said Llargues.\nWhile the accommodations are meant to be temporary, Manzano, who worked in Puerto Rico in the hotel industry until medical problems forced her to go on disability, fears she won’t find housing before her FEMA-sponsored housing ends.\nShe has not found an affordable apartment in Leominster, where it is not uncommon that a one-bedroom apartment cost more than $900 a month.\n“It’s hard,” she said, apologizing for becoming emotional. “It was such a terrible feeling you see that house you’ve lived in for 15 years, and you know everything is going to be ruined.”\nWhile stories of transition from Puerto Rico to Massachusetts following the storms are often marked by difficulty, they are not without hope.\nShe said through a translator that she hopes to stay in the state, where she currently awaits surgery.\n“Being here, she feels really really good, her medical services have been more than she expected,” said the Spanish American Center’s Guzman, translating.\nBut her family, including her two adult children and her disabled husband, remain in Puerto Rico. That, she said, is the true source of her pain.\n“She talks to her husband everyday, they have cells phones, and every day at least she’s able to say, ’here I am, I’m OK,” explained Guzman.", "url": "https://apnews.com/31e636a749d64b6196fd30a0dd061245"}