{"authors": ["Mary Hallmhall"], "date_download": "2020-05-04 20:22:02", "date_modify": "2020-05-04 20:22:02", "date_publish": "2017-10-27 12:59:00", "description": "George Clooney takes another stab at co-writing and directing with the 1960s story \"Suburbicon,\" starring Matt Damon and Julianne Moore. The infamous Coen brothers, Joel and Ethan,...", "filename": "_6510aa9b0bdb45c29e6ce8a273a12a27_1588623722.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6510aa9b0bdb45c29e6ce8a273a12a27_1588623722.html", "title": "Dark crime thriller disappoints", "title_page": "Dark crime thriller disappoints", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "George Clooney takes another stab at co-writing and directing with the 1960s story “Suburbicon,” starring Matt Damon and Julianne Moore.\nThe infamous Coen brothers, Joel and Ethan, originally penned this script in 1986, and Clooney was set to be the star. While that changed over time, what hasn’t changed is the premise of the film. It’s based on 1957 Levittown, Pa.’s, true story of the Myers family moving into a sprawling, all-white, planned urban development, spurring racial violence against the family.\nHowever, the movie has another seemingly unrelated story-line occurring: A white family has a very dark secret involving a murder. Separately, these two stories are captivating, but together, they are perplexing at best as they never intersect. In the end, it’s a dark comedy crime thriller with graphic violence that disappoints.\nFirst, we have the Lodge family, comprised of Gardner (Damon), his wife (Moore) and son Nicky (Noah Jupe), who experience a break-in resulting in the murder of Mrs. Lodge.\nHer twin sister, Margaret, swoops in to the mom and wife role, making us question the entire situation spiraling out of control, sparking more lies and violence.\nTo what depths Gardner and Margaret will go to cover what’s actually happening is anyone’s darkest guess.\nThen we have the Meyers family, who moves in next door. The fact that they are black creates upheaval in the neighborhood, which also spirals out of control. This plot, while playing out with equal time value on the screen, is never really developed and seems to be nothing more than a diversion for what’s going on next door.\nThe film is flawed from the beginning in its lack of writing cohesion.\nOn its own, the Lodge story is dark and sinister, with exceptional performances from Moore, Damon and the young Jupe. Damon shows us he is completely in touch with his evil side of acting, a welcome change from his typical roles. Moore has the difficulty of playing two roles for a short period of time and, once again, she shines.\nBut it is newcomer Jupe that shows us a level of performance typically not seen at this young age. His role is complex and quite daunting, given the dangerous situations his character faces, but he effortlessly gives a subtle and memorable performance.\nThe pace of the film is even-keeled given the situations of violence, but it is when Roger (Oscar Isaac), the insurance fraud evaluator, comes into the story that things become more interesting and captivating. While his character is quite exaggerated, Isaac does so with finesse, making it wonderfully entertaining.\nSadly, other than the overt racial slurs and prejudicial treatment toward the Meyers, particularly Mrs. Meyers (Karimah Westbrook), we don’t really get a chance to know this family. The opening scene gives us high hopes, but the train gets derailed after this, completely forgetting where it started. We then have the Meyers’ son and Nicky, who play together, receiving jeers and threats, but their friendship doesn’t see color. As the one connection between the two stories, this subplot also loses steam.\n“Suburbicon” had such potential given the original writers, the topical relevancy of today and the talented cast, but it falls short.\nWhile this movie is a disappointment, it is a chance to see Damon expand his skills and see newcomer Jupe before he skyrockets in this industry. It’s also worth knowing the true events from 1957 and seeing these emotionally loaded and horrific incidents unfold, perhaps creating a greater sense of understanding for others.\n2 out of 4 stars", "url": "https://apnews.com/6510aa9b0bdb45c29e6ce8a273a12a27"}