{"authors": ["Alexandra Chasse"], "date_download": "2020-05-04 20:08:45", "date_modify": "2020-05-04 20:08:45", "date_publish": "2017-02-02 23:46:00", "description": "Super Bowl LI will be the third Super Bowl held in Houston. The Falcons! The Patriots! The beer! The selfies! The halftime show! The guns! Whoops, not that last one. Not yet,...", "filename": "_bf8cc296b00f4327b98960d0f2404653_1588622925.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bf8cc296b00f4327b98960d0f2404653_1588622925.html", "title": "Chasse: Guns at the Super Bowl? Not yet, but HB 560 could change that", "title_page": "Chasse: Guns at the Super Bowl? Not yet, but HB 560 could change that", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Chasse: Guns at the Super Bowl? Not yet, but HB 560 could change that\nSuper Bowl LI will be the third Super Bowl held in Houston. The Falcons! The Patriots! The beer! The selfies! The halftime show! The guns!\nWhoops, not that last one. Not yet, anyhow.\nBut thanks to the Texas gun lobby’s latest suggestion for dangerous places to allow guns, Super Bowl LI could be Houston’s last.\nUnder current Texas law, carrying handguns into sporting events is generally prohibited. But with House Bill 560, introduced for the 85th Legislature by Rep. Drew Springer, R-Muenster, handguns would be allowed in many sensitive areas where they are not allowed now, including at sporting events and bars - places where Springer likely presumes no one has ever had his or her judgment short-circuited by one draft too many.\nThere’s an obvious reason to keep guns out of bars and sports stadiums. Sound research (and common knowledge) shows that alcohol increases a person’s likelihood of violent aggressive behavior and impaired judgment - not a pretty picture when an intoxicated person is deliberating whether to shoot or how to aim.\nSupporters of this dangerous bill typically trot out the scenario where a “Good Guy with a Gun” prevents a mass shooting in a so-called gun-free zone. Yet, no reputable evidence shows that armed citizens in the bleachers, with little training and wearing a giant foam finger, will be effective at drawing a gun in self- or crowd-defense.\nSuper Bowls past and present have featured massive, properly staffed security apparatuses to ensure fan safety and to keep drunken rowdiness at bay. Plus, these are family-friendly events. With open-carry legal in Texas, what family wants to sit their kid next to a stranger openly holstering a handgun?\nIt’s no surprise that major and minor sporting events, including those at schools, another area into which HB 560 would force guns, are currently places where civilians cannot carry a handgun. No event promoter wishes to deal with the injury or death that would come when someone negligently or aggressively discharges a firearm at an event crowded with fans and their families.\nOn that note, let’s remember that organizers for that other massive event coming up at NRG Stadium, the Houston Livestock Show and Rodeo, prohibited open and concealed carry from event grounds and concerts last year. That’s right: Even the organizers of a huge cowboy event understand that keeping guns away from booze and crowds is a no-brainer.\nIt’s unacceptable that lawmakers in Austin are still trying to place points on the gun lobby’s scoreboard by introducing ever-more senseless rollbacks of common-sense protections against gun violence. It’s also reckless from a business standpoint: If HB 560 passes during the 85th Legislature, it seems likely that the NFL will think twice about holding America’s grandest sporting event in a state where alcohol and guns are allowed to mix at such an event.\nOur lawmakers need to draw a firm line and say no to the gun lobby’s insatiable “guns everywhere, for everyone, no questions asked” agenda.\nIf they need any more reason than common sense, perhaps the following will prove elucidating:\nSuper Bowl LI will mark the debut of breathalyzing, Uber-hailing chip-bags. The innovation is intended to protect fans and roadways from post-game drunken driving. To quote Roger Baran, creative director of advertising giant Goodby Silverstein & Partners: “For a football fan, there is a lot of emotion involved with a game. It’s easy to drink more than you planned.”\nRight he is.\nWith just a little common sense, our lawmakers won’t use the 85th Legislature to shoot us in the foot and jeopardize Texas cities’ future chances at hosting marquee sporting events.\nChasse, a Houston resident, is a volunteer with the Texas chapter of Moms Demand Action.", "url": "https://apnews.com/bf8cc296b00f4327b98960d0f2404653"}