{"authors": [], "date_download": "2020-05-04 20:13:31", "date_modify": "2020-05-04 20:13:31", "date_publish": "2017-04-21 09:00:00", "description": "Rowan Atkinson is planning another 'Mr Bean' movie. The 62-year-old comic thinks his friend and series co-creator, 'Love Actually' writer Richard Curtis, has come up with a \"very funny\" idea...", "filename": "_5c39081237d6451090c9e2b60355945a_1588623211.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5c39081237d6451090c9e2b60355945a_1588623211.html", "title": "Rowan Atkinson set for Mr Bean return", "title_page": "Rowan Atkinson set for Mr Bean return", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Rowan Atkinson is planning another ‘Mr Bean’ movie.\nThe 62-year-old comic thinks his friend and series co-creator, ‘Love Actually’ writer Richard Curtis, has come up with a “very funny” idea featuring his popular character - who first featured on TV 27 years ago - in his senior years.\nSpeaking to the Daily Star newspaper, he said: “It would be very funny to see where we can go with him as an old man and what kind of comedy we get out of it.\n“Playing an old person can be very funny.”\n‘Mr Bean’ aired for 13 one-off , largely silent, TV episodes between 1990 until 1995, with a clip compilation airing at the end of 1995. A previously unseen episode was broadcast in 2006, while the successful series also spawned two movie adaptations, ‘Bean: The Ultimate Disaster Movie’ in 1997 and 2007′s ‘Mr. Bean’s Holiday’. An animated show is still broadcast today and Rowan has reprised the character at the 2012 London Olympics Opening Ceremony, and two years later for a Snickers commercial.\nAlthough the ‘Blackadder’ actor has played more serious roles since the creation of Mr Bean, he has said he will never retire from the character.\nHe previously insisted: “No I don’t really have plans like that. You go with the parts that are offered that inspire you.\n“I would never finally wave goodbye to any character - I feel as though I could still play Bean. It’s just the emphasis tends to shift.”\nAnother one of Atkinson’s most famous characters, Edmund Blackadder, could also be returning after co-star Sir Tony Robinson, who played hapless sidekick Baldrick, revealed the cast have been in talks.\nHe said recently: “I do think a new series of ‘Blackadder’ is on the cards. I have spoken to virtually all the cast about this now.\n“Expectations for a new series will be high because people not only remember the original; they remember who they were when it was on. It’s a big danger.”", "url": "https://apnews.com/5c39081237d6451090c9e2b60355945a"}