{"authors": [], "date_download": "2020-05-04 20:15:19", "date_modify": "2020-05-04 20:15:19", "date_publish": "2017-05-22 18:33:38", "description": "Kelly Brook's house has been invaded by a duck. The 37-year-old star returned home on Monday afternoon to see she had a new house guest - who had wandered into her home after she left the...", "filename": "_2cab060dbda547c1a158f36bb7d4a92f_1588623319.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2cab060dbda547c1a158f36bb7d4a92f_1588623319.html", "title": "Kelly Brook's duck invasion", "title_page": "Kelly Brook's duck invasion", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kelly Brook’s house has been invaded by a duck.\nThe 37-year-old star returned home on Monday afternoon to see she had a new house guest - who had wandered into her home after she left the back door open throughout the day - and took to social media to document her duck dilemma.\nCaptioning a video of her feathered friend on the windowsill, she wrote: “After a long day I just got home and had a bath and came down to make a tea!! Shouldn’t of left the back door open (sic)”\nIn the video, Kelly appears in a red flowery dressing gown and narrates what has happened, telling viewers: “Ok, so we’ve got a situation. There’s a duck in the kitchen and I’ve got to try and get her out. Oh she’s made such a mess. Come here! Oh she’s pooing all over the place. All over my nice pots!”\nHowever, the plan to get the duck - which Kelly christened Daisy - out of the house was proving unfruitful as the ‘Taking Stock’ took to the photo sharing site a few minutes later to show the feathered creature now sitting on her sofa.\nAlongside the video, she wrote: “She won’t leave.”\nIt comes only a few weeks after Kelly shared a video of her waking up her and her boyfriend Jeremy Parisi’s pet turtle from hibernation.\nSharing a video of Jessica the turtle having a shallow bath in the sink to help her readjust, she wrote: “Jessica is Awake 25yrs old #hibernationover (sic)”\nIn the video, Kelly strokes the animal’s shell and she can be heard sweetly saying to the turtle: “Hey Jessica, morning swim. Hello, is that nice?”", "url": "https://apnews.com/2cab060dbda547c1a158f36bb7d4a92f"}