{"authors": [], "date_download": "2020-05-04 20:20:34", "date_modify": "2020-05-04 20:20:34", "date_publish": "2017-03-29 10:00:00", "description": "Katie Price has launched an online petition to make cyber bullying illegal after trolls targeted her disabled son Harvey. The 39-year-old glamour model is currently on holiday in the...", "filename": "_c197b20c96b742c0848790978fac271a_1588623634.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c197b20c96b742c0848790978fac271a_1588623634.html", "title": "Katie Price launches petition to make online trolling illegal", "title_page": "Katie Price launches petition to make online trolling illegal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Katie Price has launched an online petition to make cyber bullying illegal after trolls targeted her disabled son Harvey.\nThe 39-year-old glamour model is currently on holiday in the Maldives, but she took time out of her family vacation to post a short clip with her 14-year-old son - who suffers from Prader-Willi syndrome (PWS), which is a rare genetic condition - urging her 2.13 million followers to sign the campaign in a bid to get the government’s backing to help “punish” social media trolls.\nSpeaking in the clip, which she posted on her Twitter account on Wednesday (29.03.16), she said: “My name is Katie Price and my son has very complex needs and he gets online bullying trolls, people who abuse his size, colour, looks and disability. Not only does it fiercely upset and hurt me and my family, Harvey is very fortunate not to understand, but I do.\nAnd I will do everything in my power to make sure these trolling bullies get punished. Every day people of all ages get bullied for all different reasons and a lot of it is causing suicide. Please, please let’s stop this happening.\n“Sign my petition and let’s stick together and make a difference.\n“It’s about time these trolls and bullies get punished.”\nThe ‘Loose Women’ panellist also shared a string of memes that had been created about Harvey - who she has with her former partner Dwight Yorke - because they made her “so angry”.\nAlongside one image of Harvey with the words, “What is black and screams, Harvey Price answering an iron” emblazoned across it, which was shared on Instagram, she wrote: “THIS MAKES ME SO ANGRY! Link in my bio please sign the petition (sic).”\nThe petition has over 40,000 signatures so far, but 60,000 more are needed before Parliament will address the matter.\nA statement by Katie posted on the petition reads: “Trolling is a major problem in this day and age.\n“People of all ages and background suffer every day, including my family - especially my son Harvey. I have tried my best to expose people and even had two arrested but nothing was done and there were no repercussions or penalties for this behaviour.”\nAnd the busty blonde - who also has Jett, three, and Bunny, two, with husband Kieran Hayler and Junior, 11, and Princess, nine, with her former spouse Peter Andre - has received the backing of her celebrity pals including former ‘Celebrity Big Brother’ stars Nikki Grahame and Joel Williams.\nNikki wrote on the micro-blogging site: “Go Kate! (sic).”\nAnd Joel - who is a Tory councillor - added: “Genuine petition started by @MissKatiePrice to make online bullying a criminal offence- well done Katie (sic)”", "url": "https://apnews.com/c197b20c96b742c0848790978fac271a"}