{"authors": ["Jim Shay"], "date_download": "2020-05-04 20:23:51", "date_modify": "2020-05-04 20:23:51", "date_publish": "2017-03-28 15:10:24", "description": "A New Hampshire man was clocked going 136 mph on I-84 late Monday night, State Police say. The 21-year-old driver was first spotted near Exit 62 in Manchester and was finally stopped - 17...", "filename": "_011a5cfe26054f7ca6a568cd7d8fdde9_1588623831.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_011a5cfe26054f7ca6a568cd7d8fdde9_1588623831.html", "title": "Trooper: Man drove 136 mph on I-84 with no lights on", "title_page": "Trooper: Man drove 136 mph on I-84 with no lights on", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A New Hampshire man was clocked going 136 mph on I-84 late Monday night, State Police say.\nThe 21-year-old driver was first spotted near Exit 62 in Manchester and was finally stopped - 17 miles away - at a rest area in Willington, not far from the Massachusetts.\nAt one point while being pursued by troopers, “the operator driver turned off the vehicle lights as he continued at a high rate of speed east on I-84,” state police said.\nAmazingly, no one was killed in the high-speed. At times, troopers had to break off the chase “for the safety of other motorists.”\nThe driver, Khalid Rajab of Manchester, N.H., was taken into custody and transported to Troop C where he was charged with with reckless driving, operation of motor vehicles without license (suspended out of NH) and failure to have lights lit. He was held on $5,000 bond.\nAt 11:14 p.m., troopers from Troop H-Hartford observed a Dodge Challenger traveling at a high rate of speed on I-84 eastbound in the area of Exit 62 in Manchester. “The trooper attempted to stop the Challenger, however the operator accelerated to speeds over 125 mph. The trooper broke off the attempted traffic stop for the safety of other motorists,” state police said in a release.\nA short time later a trooper from Troop C-Tolland was in the area of Exit 66 Vernon conducting speed enforcement when he observed a vehicle traveling at a high rate of speed.\n“Using laser, the trooper clocked the vehicle’s speed at 136 mph. As the vehicle passed the cruiser the trooper observed that it was a Dodge Challenger, and as the Challeger passed the operator turned off the vehicle lights as he continued at a high rate of speed east on I-84. The trooper radioed the description of the vehicle to troopers who were positioned further east on I-84 in Tolland and Willington.\n“Upon approaching the I-84 eastbound rest area in Willington, another trooper captured the speed of the Challenger at 106 mph,” troopers said.\nAs the trooper activated his emergency lights, the Challenger quickly exited I-84 and entered the rest area, stopped and attempted to flee from the vehicle. Troopers, with assistance from K9 Rocky, were then able to quickly apprehend the operator as he attempted to flee from the vehicle on foot.", "url": "https://apnews.com/011a5cfe26054f7ca6a568cd7d8fdde9"}