{"authors": [], "date_download": "2020-05-04 20:10:55", "date_modify": "2020-05-04 20:10:55", "date_publish": "2017-07-13 07:00:00", "description": "David Ayer has reportedly been dropped as the director of the 'Scarface' remake. The 59-year-old movie-maker - whose previous credits include 'Sabotage', 'Fury', and 'Suicide Squad' - was...", "filename": "_fa35077685984e83847bc5e5a69a8810_1588623055.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fa35077685984e83847bc5e5a69a8810_1588623055.html", "title": "David Ayer 'dropped as Scarface director'", "title_page": "David Ayer 'dropped as Scarface director'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "David Ayer has reportedly been dropped as the director of the ‘Scarface’ remake.\nThe 59-year-old movie-maker - whose previous credits include ‘Sabotage’, ‘Fury’, and ‘Suicide Squad’ - was initially appointed to helm the much-anticipated reboot of the classic gangster movie, but the studio apparently considers his take on the script to be “too dark”.\n‘Scarface’ tells the story of the rise and fall of a gangster and has previously spawned two separate movies, made in 1932 and 1983.\nThe latter of the two was directed by Brian De Palma and is one of Al Pacino’s most famous on-screen roles, with the movie’s reputation and popularity increasing over time.\nBut while Diego Luna is still attached to play the central role in the remake, the movie has been plagued by issues.\nFor instance, ‘Equalizer’ and ‘Training Day’ director Antoine Fuqua was previously attached to helm the project, but he was forced to withdraw because of a scheduling conflict.\nAnd now with David being dropped as the director, the studio is forced to re-start its search for someone to oversee the project, according to The Hollywood Reporter.\nMeanwhile, David previously admitted that his much-maligned ‘Suicide Squad’ movie featured multiple “flaws” because he took so many creative risks.\nThe superhero film boasted a star-studded cast featuring the likes of Margot Robbie and Will Smith, but failed to match fans’ expectations upon its release in 2016.\nReflecting on the movie, David said: “Making a movie is a journey, not a straight line. I learned so much. People want what they want, and everyone has a personal vision of how each character should look and walk and talk. If you set out to make a mass appeal movie, it’s easy to end up with vanilla.\n“But I went for it. And I know ‘Suicide Squad’ has its flaws. Hell, the world knows it.”", "url": "https://apnews.com/fa35077685984e83847bc5e5a69a8810"}