{"authors": ["Dan La Botz", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:15", "date_modify": "2020-05-04 19:59:15", "date_publish": "2017-02-17 00:00:00", "description": null, "filename": "2017_02_trump-labor-movement-unions-trades-climate-change-racism-afl-cio_1588622355.html", "image_url": "https://images.jacobinmag.com/2017/02/17233832/trumphardhat.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_02_trump-labor-movement-unions-trades-climate-change-racism-afl-cio_1588622355.html", "title": "An Injury to All", "title_page": "An Injury to All", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nPresident Donald Trump has not only a pro-business agenda, but a shrewd labor one, too. He has put forward a program to win over some highly skilled, largely white workers while simultaneously attacking the unions that represent many more black, Latino, and women workers. It is a strategy intended to solidify his base while dividing and weakening the labor movement. Bringing organized labor together, a movement into which Trump has hammered a wedge, will not be easy and will not be accomplished simply with exhortations calling for unity. Some elements within labor — whether an international or local union, a union reform organization, or a coalition of local leaders or rank-and-file activists — has to create a clear pole that not only rejects the Trump agenda but also wants to rebuild labor as a fighting movement of working people. For such a movement to be effective, it will have to free itself — from fear, the straightjacket of labor law, and subordination to the Democratic Party. We are at a moment when a fighting union organization could kindle the imagination of millions of workers — some of the Trump as well as Hillary and Bernie supporters — and inspire a new labor movement. Such a movement, engaging in civil disobedience, in work stoppages, and generally throwing a wrench into the machine would find an immediate response in the current climate.\nThe Building Trades Rally to Trump Trump’s labor coup was his meeting with building trades leaders on his first day in office. The burly presidents gushed over the new president, who told the union officials of his plans for vast infrastructure projects: highways, bridges, and, of course, the border wall. Sean McGarvey, president of the North America’s Building Trades Unions, sounded like Trump himself as he called it “an incredible meeting,” the “best he had ever had in Washington.” “We have a common bond with the president,” said Garvey. “We come from the same industry. He understands the value of driving development, moving people to the middle class.” It’s important to recognize who exactly a leader like Garvey is referring to when he talks about moving people to the middle class. Fifty years ago the building trades were almost all white men, and today — with the exception of the Laborers International Union, which has many black and Latino members — the trades remain in most places predominantly white and male. Trump’s turn to the trades is aimed at consolidating and building his base, such as it exists, among the white working class. Yet there are some problems with this plan. The Republican Party Platform of 2016 calls for the repeal of the Bacon-Davis Act of 1931, which requires public works projects to pay the prevailing (usually union scale) local wages, a law that has been key to maintaining construction workers’ incomes. When Trump was asked about Bacon-Davis by McGarvey, he refused to commit himself. Should Bacon-Davis be overturned, the impact on building trades workers would be disastrous. Though they received no answer on this key question, the building trades union leaders came out of the meeting with Trump all smiles and full of praise for the new president. But only a few days later, Senator Jeff Flake of Arizona introduced a bill to suspend Bacon-Davis on federal highway projects. Trump effectively won over the trades without committing himself on a key question — though, as one longtime labor union activist recently wrote, the building trades’ embrace of Trump has undercut those who oppose his anti-worker policies. Teamsters General President James P. Hoffa, whose union endorsed Hillary Clinton, is also lauding Trump. Many Teamsters work in the building trades, driving the dump trucks, cement trucks, and delivering the steel beams to work sites. The Teamsters have praised Trump for what they call his “commonsense goal” of infrastructure projects. Hoffa also praised Trump for withdrawing the United States from the Trans-Pacific Partnership trade deal. He said, “With this decision, the president has taken the first step toward fixing thirty years of bad trade policies that have cost working Americans millions of good-paying jobs.” Hoffa told Fox News, “We’ve been talking about changing NAFTA forever, and no one would ever do it. It can be done, and I applaud the president for being so bold as to say we’ll just rip it up and negotiate a new one. That’s unheard of. But it really is what needs to be done.” The Teamsters also want Trump to alter the clause of the North American Free Trade Agreement (NAFTA) that permits Mexican truck drives to cross the border into the United States. Interestingly, though Hoffa and the Teamsters have praised Trump, they remain active in the Democratic Party, where they have endorsed Keith Ellison of Minnesota, candidate of the “Bernie Sanders wing” of the Democratic Party, for chairperson of the Democratic National Committee. The union’s contradictory stances on these issues are shared by many other unions.\nThe AFL-CIO, Neutralized Trump’s strategy for wooing the building trades seems to have effectively neutralized the AFL-CIO, the largest and most important labor body in the country. The federation’s head, Richard Trumka, seems hesitant to directly challenge Trump for fear of losing the support of the trades and some other affiliated unions and their members, a good many of whose members voted for Trump. Trumka, who supported Hillary Clinton and opposed Trump as a bigot, racist, sexist, and anti-union, change his tune immediately after Trump’s election. In a statement emailed to reporters, Trumka said his organization accepted the outcome of the election and offered Trump “our congratulations.” Trumka told the media that election was a referendum “on trade, on restoring manufacturing, on reviving our communities.” He added, “We will work to make many of those promises a reality. If he is willing to work with us, consistent with our values, we are ready to work with him.” Not surprisingly Trumka visited the president a few days after the election and said he had a “productive conversation.” Yet at the same time Trumka worked against Trump’s nomination of Andrew Puzder, the former fast-food CEO, to be Secretary of Labor, saying, “He has spoken out against increasing the minimum wage,” Trumka said. “He opposes President Obama’s updated overtime rule. He is dismissive of workplace discrimination issues. [Puzder] appears comfortable reinforcing harmful stereotypes about women, and I could go on.” (Puzder withdrew from the confirmation process yesterday.) Trumka’s actions raise the question of whether or not the AFL-CIO as it is currently constituted is still viable. In a scathing attack on the building trades, Ruth Needleman writes, “The problem with these trades misleaders is their narrow self-interested philosophy, … the practice of only looking out for themselves, and their willingness to throw other workers under the bus.” Perhaps it is time, she argues, for the AFL and the CIO, which merged in 1955, to divide once again, in order to free the industrial unions from the reactionary trades.\nAttacking Public Sector Unions While embracing the white workmen of the building trades, Trump has simultaneously slugged the public employees. He issued an executive order freezing hiring for the executive branch, which has 1.2 million employees. The freeze does not affect the military, which Trump has announced he will be strengthening. A hiring freeze, if it lasts any time, reduces the workforce through attrition, leading to demoralization because of inadequate staff, and then to more people quitting because of higher workloads. Government agencies become less productive, creating an excuse to contract out or privatize. Federal workers unions were quick to criticize the freeze, framing their objections in terms of service to society in order to win public support. While the freeze will also be bad for those who use the federal agencies’ services, it will also reduce a major source of permanent, full-time — though often low-paid — employment with holidays and health benefits for many workers, especially for black and female workers. Trump’s choice of Federal Judge Neil M. Gorsuch for the Supreme Court will very likely be approved by the Senate. Gorsuch’s addition to the SCOTUS bench will create a conservative majority that will take up Janus v. AFSCME and very likely end public employee unions’ ability to collect agency fees from non-union members whom they are obligated to represent. The case is very similar to the Friedrichs v. California Teachers Association case, which did not proceed because of the death of Justice Antonin Scalia. Janus, like Friedrichs, argues that public employee unions are inherently political and therefore all financial contributions serve political purposes, forcing some members to endorse and financially support positions with which they don’t agree. The result is likely to be the financial starvation of many public employee unions, forcing them to reduce staff and possibly making them less effective. While the Trump administration will be bad for all public employees, teachers will face even greater challenges. Donald Trump’s choice for Secretary of Education, Betsy DeVos, another billionaire, has been a leader in corporate education reform. As the New York Times wrote of her activities: Like the Kochs, the DeVoses are generous supporters of think tanks that evangelize for unrestrained capitalism, like Michigan’s Acton Institute, and that rail against unions and back privatizing public services, like the Mackinac Center. They have also funded national groups dedicated to cutting back the role of government, including the National Center for Policy Analysis (which has pushed for Social Security privatization and against environmental regulation) and the Institute for Justice (which challenges regulations in court and defends school vouchers). Both organizations have also received money from the Koch family. So teachers can expect an attack on public education combined with an attack on their labor union rights.\nState and Federal Right-to-Work Public- and private-sector unions will both face the challenge of “right-to-work” laws that outlaw closed shops (workplaces in which, if the majority votes for a union, all must either join the union and pay dues or pay a representation fee). Twenty-eight states now have such laws. At the state level, Republicans are dominant around the country, with control of thirty-two legislatures and thirty-three governors. In twenty-four states they control both the state house and the legislature. Wherever they have the power, they will pass right-to-work laws at the state level. On February 1, Reps. Joe Wilson of South Carolina and Steve King of Iowa, both Republicans, introduced a bill in Congress that would make right-to-work law across the country. Their bill would amend the National Labor Relations Act, the principal federal law that covers private-sector unions, as well as the Railway Labor Act that covers transportation industry unions. Whether or not Trump will support this bill — and whether doing so will drive the building trades back toward the rest of the labor movement — remains to be seen.\nSome Unions Resist While Trumka vacillated, and the building trades and Teamsters embraced Trump’s project, many other unions have gone into opposition mode, though to varying degrees. Teachers have been in the forefront of the resistance. The American Federation of Teachers (AFT) mobilized 250 locals and members in more than 200 cities the day before the inauguration as part of the Reclaim Our Schools National Day of Action against Trump’s agenda. The National Education Association, the largest union in the nation with 2.7 million members, called on its members to walk out of schools on inauguration day to protest Trump. Both the AFT and the NEA endorsed Hillary Clinton. Members of Local 10 of the International Longshore and Warehouse Union (ILWU) in Oakland, California, a union with a long radical history and a membership that is half Black, stopped working on Inauguration Day. The wildcat strike stopped the loading and unloading of cargo ships in one of the busiest West Coast ports. Surprisingly, Service Employees International Union President Mary Kay Henry, who was not invited to Trump’s love fest with some union leaders, has said that she doesn’t believe that Donald Trump represents an existential threat to her union, the country’s second largest with 1.5 million members. She said her union was “battening down the hatches” and would continue to build the Fight for $15 movement. Under the pressure of the movement, some nineteen cities and states have already raised the minimum wage substantially. For reasons that are unclear, as it seems we should be girding for battle, SEIU is reportedly cutting its budget by 30 percent over the next year. Even where the international union has come out for Trump, one can find locals that have taken a different position. For example, Teamster Joint Council 16, which represents 90,000 laborers in New York City, came out strongly against Trump’s immigration policies. And outside of unions, there have been significant protests by workers in the service sector and tech industry as well as consumers. The New York Taxi Workers Alliance, a workers center with a lager number of Muslim immigrant members, went on strike at JFK airport. When Uber failed to honor the taxi cab drivers’ strike, thousands began to delete the Uber app — not only because the company scabbed on the strike but also to protest against Uber CO Travis Kalanick, who had joined Trump’s business advisory board. When as many as 200,000 Uber users deleted the app, Kalanick immediately announced that he was leaving the Trump advisory board. Uber’s rival Lyft, meanwhile, announced that it was donating one million dollars to the American Civil Liberties Union (ACLU) to aid in fighting Trump’s immigration policies. Uber then responded by announcing a $3 million donation to support drivers affected by the “wrong and unjust” ban. At the same time, tech workers at Google in California and at Comcast Philadelphia demonstrated in opposition to Trump’s migration policy. The unorganized and “unofficial” sections of the workers movement, then, seem at times to have been more active opposing Trump than unions.\nTrump’s Strategy Isn’t Unique Trump’s strategy of embracing the most conservative unions while attacking the others is not new. President Woodrow Wilson, a Democrat, did something very similar on the even of World War I, embracing the American Federation of Labor and crushing the radical industrial Workers of the World (IWW). While Wilson’s administration issued regulations to help the AFL maintain its membership during the war, Gompers supported Wilson’s foreign policy, including two invasions of Mexico and the US entrance into World War I. The AFL prospered, while the Wilson administration tried, convicted, and imprisoned Socialist Party leaders and IWW leaders as American Legion goons broke up socialist offices and union halls. When the war was over and the Republicans returned to power, the unions’ gains under Wilson were soon lost. Most important was Attorney General Harry M. Daugherty’s crushing of the 1922 railroad shop crafts strike involving more than 400,000 workers and lasting months. The economy began to turn down in 1926 and the 1929 crash reduced the labor movement to a pathetic remnant in the early 1930s. Within a decade, it was clear that Wilson’s supposed support of the unions had done nothing much to help them. The wartime uptick in membership had been a flash in the pan. Richard Nixon also made an overture to the conservative building trades of the AFL-CIO when in 1973 he appointed Peter J. Brennan, head of the building trades to become Secretary of Labor. Brennan had apparently come to Nixon’s attention when in 1970 he helped to organize a construction worker rally in support of Nixon’s Vietnam War policy, a rally that became a riot when it attacked anti-war protestors. Nixon appointed Brennan to be Secretary of Labor to ensure that the AFL-CIO and other labor leaders continued to support him and the war, which virtually no major union leader opposed. Nixon also won the support of the Teamsters Union under President Frank Fitzsimmons. This was not so difficult, given that Attorney General Robert F. Kennedy had spent years investigating the enormously popular Teamster leader Hoffa for corruption. Many union leaders and rank and filers hated Kennedy who seemed to epitomize the wealthy politician picking on a working-class leader. Richard Nixon cleverly pardoned by Hoffa on December 23, 1971, but on the condition that he not become involved in the union politics again until March 1980. Nixon’s order thus protected President Frank Fitzsimmons from a challenge by Hoffa, and so Fitzsimmons became a Nixon golf partner and supporter. (Meanwhile, Hoffa disappeared on July 30, 1975, presumably kidnapped and murdered by those who opposed his continuing bid to retake power in the Teamsters.) The Teamsters have often been allied with the Republican Party, backing both Ronald Reagan and George HW Bush in the 1980s. The Teamster support for Reagan and Bush may have resulted in part from the role of Senator Ted Kennedy of Massachusetts, who pushed trucking deregulation through Congress in the form of the Motor Carrier Act of 1980, effectively breaking the union’s hold on the freight industry over the next couple of decades. Support for Republican presidents, however, did little to help the Teamsters union and less for its members who saw a decline in union power and wages over the last forty years.\nFDR, the Democrats, and Labor The most famous labor-political alliance in American history, of course, was the one between Democratic President Franklin D. Roosevelt and the AFL and CIO unions. With the Great Depression having created conditions that some thought could lead to revolution, and with an enormous upheaval of industrial workers, Roosevelt’s administration pushed through Congress the National Labor Relations Act (NLRA) in 1935, as well as a number of other labor laws and social programs that benefited workers. Labor in turn backed FDR and the Democratic Party through the Great Depression and throughout World War II. Thus the labor-Democrat alliance became institutionalized. The longevity and durability of the Democratic Party-AFL-CIO alliance was due principally to the prosperity of the Thirty Gold Years, during America’s military and economic dominance of the world from 1939 until 1969. Things began to unravel in the 1970s when a prolonged economic crisis began to unfold. Yet even in those Golden Years, unions at their peak in the mid-1950s represented a little more than one-third of all workers. As America declined in global power in the late twentieth century and the corporations faced increased foreign competition, the general prosperity that had laid the basis for labor’s success eroded. As I have described elsewhere, under those conditions, union economic and political power began to decline, after a period of success that had lasted just two generations. Consequently, the Democratic Party-AFL-CIO alliance began to disintegrate as many blue-collar workers migrated into the Republican Party. Even the most heralded labor-political alliance — through it brought tremendous improvements to unionized workers — did not last very long and did not benefit most of the working people of the country.", "url": "https://www.jacobinmag.com/2017/02/trump-labor-movement-unions-trades-climate-change-racism-afl-cio"}