{"authors": ["Brian T. Smith"], "date_download": "2020-05-04 20:09:13", "date_modify": "2020-05-04 20:09:13", "date_publish": "2017-04-05 03:10:00", "description": "The biggest losers in NFL free agency: your Texans. And that was before Tony Romo coldly left the quarterback life, kicked Phil Simms off the air and punched Bob McNair's team in the...", "filename": "_59376be5a581430a8ab23a7f717d235a_1588622953.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_59376be5a581430a8ab23a7f717d235a_1588622953.html", "title": "Without Tony Romo, Texans lack a plan at QB", "title_page": "Without Tony Romo, Texans lack a plan at QB", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The biggest losers in NFL free agency: your Texans.\nAnd that was before Tony Romo coldly left the quarterback life, kicked Phil Simms off the air and punched Bob McNair’s team in the gut.\nTuesday was a tough one to stomach if you’ve been waiting on a lasting starting QB ever since Bill O’Brien brought his magic guru’s touch to Houston. Unless the next great hope suddenly arrives in the upcoming draft or Tom Savage is secretly related to Tom Brady and Aaron Rodgers, the endless wait for Matt Schaub’s official replacement isn’t ending anytime soon.\nIt has been 28 days since pro football’s annual gazillion-dollar frenzy began. The Texans still haven’t signed a single player from another team, and now they’ll never even be able to make an offer to always-injured Romo, despite wanting a 36-year-old retiree so bad it hurt.\nI wrote a few weeks ago - while the Texans were sleepwalking through free agency - they obviously had to have a master plan that would ultimately stun us all, and the grand vision was clearly centered around wrapping old No. 9 in red and blue.\nHaving lived through Ryan Fitzpatrick, Ryan Mallett, Case Keenum, Brian Hoyer, T.J. Yates, Brandon Weeden, Brock Osweiler, etc., I was obviously being a little sarcastic. Because it’s clearer than ever the Texans were longing for Romo to be their true 2017 valentine, even if no one within the organization was allowed to publicly say it. The fact that two-start, zero-touchdown Savage is now set up to be the new man says it all.\nTwo seasons ago, I asked the Texans what their long-term plan at quarterback was. They still don’t have an answer.\nSavage fails to excite\nA year ago, I challenged McNair to finally invest via the draft in the most important position in pro sports. General manager Rick Smith gave Osweiler $37 million guaranteed, instead, and Savage is still the only quarterback O’Brien has drafted during his consistently up-and-down time in H-Town.\nLet me make this clear, the Texans are not “excited” about Savage.\nThey never have been.\nThey do like him. But he’s also the starter by default.\nIf they were excited, Hoyer wouldn’t have been signed. Mallett wouldn’t have been allowed to sleep through the best shot of his life. Yates wouldn’t have been re-signed. Osweiler wouldn’t have been stolen from Denver for $72 million total. And Savage wouldn’t have been intentionally placed on injured reserve for the entirety of the 2015 season, despite the fact he was healthy while Hoyer, Yates and Weeden were fighting the annual good fight for 9-7.\nHeck, even when O’Brien was forced to choose between Osweiler and Savage during last year’s playoffs, he still went back to Osweiler for a home wild-card game against a backup Oakland QB who’d never started before.\nThat does not define excited. That’s running around in circles for three long seasons, always trying to survive, then finally settling on the one guy who was quietly waiting in the background the entire time.\nIs that how true Super Bowl contenders are created?\nDo we have any tangible proof the 2017 Texans should be significantly better than last year’s?\nDoes Savage stand a chance against Tom Brady and Bill Belichick in New England in mid-January? Is he better than Andrew Luck, Marcus Mariota and Blake Bortles in the improving AFC South?\nNow remember that McNair, Smith and O’Brien are in the middle of a soap opera during a likely make-or-break season for a fourth-year coach, and Romo’s decision becomes even more damaging.\nIf the Texans were truly ready to hand the ball - and O’Brien’s fourth season - over to a QB with 92 career pass attempts, they never would have waited on Romo in the first place.\n“I think (Savage) can get the job done. But if we depend on him, and he gets hurt in the first or second game … ” McNair said recently, not exactly giving his new starter a 100-percent vote of confidence.\nRomo was risky as heck. His love for the game was clearly fading and he lost his job to a fourth-round rookie who was never supposed to play. But even with all the risk, Romo was a better short-term solution than Savage, and the Texans knew it the entire time.\nHis job by default\nIn some ways, a limited QB market tied the Texans’ hands. In more important ways, they dug this hole themselves and now have to live in it, until Savage proves he always deserved a shot or a to-be-determined rookie shines a midseason light.\nJust try to imagine Jay Cutler living with O’Brien for 15 hours a day inside NRG Stadium. Colin Kaepernick in red and blue? Just a gut feeling, but I bet McNair will pass.\nThree years after starting all this by handpicking Fitzpatrick, the Texans are worse off than they have ever been at QB under O’Brien. That sure is telling, considering all the weekly quarterback stories I’ve written since I started covering this team.\nRomo would have been fascinating. Boom or bust. Pure dynamite or a nationally televised implosion.\nFive years ago, the Texans should have pursued Peyton Manning. Tuesday, Romo said no to everyone except CBS, and the Texans lost again.\nSavage is a good guy with a strong arm and great story. If I owned a J.J. Watt jersey, I’d pull for No. 3.\nBut the Texans could have given Savage their starting QB jersey any time the last three years. It took Osweiler failing for Savage to briefly touch it. It took Romo walking away from the NFL for the job to finally belong to him.", "url": "https://apnews.com/59376be5a581430a8ab23a7f717d235a"}