{"authors": ["Travis Fain"], "date_download": "2020-05-04 20:28:52", "date_modify": "2020-05-04 20:28:52", "date_publish": "2017-10-05 01:32:00", "description": "A vocal supporter for oil and gas drilling is set for a Senate appointment to the state's Oil and Gas Commission, in a seat the commission's bylaws reserve for a \"representative of a...", "filename": "_ce1d719e378d86311ec8f46494881b82_1588624132.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ce1d719e378d86311ec8f46494881b82_1588624132.html", "title": "Fracking ally lined up for 'conservation' appointment to state panel", "title_page": "Fracking ally lined up for 'conservation' appointment to state panel", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A vocal supporter for oil and gas drilling is set for a Senate appointment to the state’s Oil and Gas Commission, in a seat the commission’s bylaws reserve for a “representative of a nongovernmental conservation interest.”\nDemocrats and environmental activists who cried foul over the move were told that Jim Womack absolutely is a conservationist. At roughly the same time, Republican leaders moved to change commission bylaws so that, in the future, this seat on a body created to regulate the oil and gas industry in North Carolina can go to a “member of a nongovernmental conservation interest,” not necessarily a representative.\nOpponents said this appeared to lower the bar on the inclusion of environmentally minded members.\n“Anybody can send a $25 check in to the Sierra Club,” complained state Rep. Chuck McGrady, R-Henderson, a former Sierra Club president and the only member of the Republican majority who took issue with the change in committee Wednesday.\nWomack, a former Lee County commissioner, was a Senate appointee to the Oil and Gas Commission’s predecessor, the Mining and Energy Commission. He is an enthusiastic supporter of hydraulic fracturing, a process that uses a high-pressure mix of chemicals and water to crack shale rock well below ground to release natural gas. He was front and center in a recent fracas over whether the new commission has been fully constituted and whether he indeed remains a member of it.\nThis appointment from the Senate should put that latter question, at least, to rest, Womack said in a telephone interview.\nThose questioning Womack’s bona fides as an environmentalist on Wednesday, or his ties to a “nongovernmental conservation interest,” were pointed toward the American Council on Science and Health, a group that describes itself as a science-based debunker of alarmist public health news.\n“It probably is the poster-child of conservationists,” said Womack, a member of the ACSH board.\nThere’s nothing about conservation on the group’s “about us” web page, which features positive comments about the group’s work from a number of conservative icons, including former President George W. Bush.\n“By increasing our understanding of complex issues, you help Americans make sound decisions about their well-being and influence public policy,” Bush is quoted as saying.\nWomack said that dispelling myths, including those about oil and gas drilling, is part and parcel of conservation.\nState law, he added, doesn’t say the Senate must appoint someone from “an activist group that believes in banning drilling.” He said he backs the further development of fossil fuels and any other energy resources that make economic sense with “the least amount of government intrusion” possible.\nSenate Democrats were polite in questioning Womack’s appointment Wednesday, saying it’s not that he isn’t qualified for the commission, but that he isn’t qualified for this particular seat, which happens to be the only one up for Senate appointment.\n“It seems to me that he is a fierce advocate for fracking,” Sen. Terry Van Duyn, D-Buncombe, said on the Senate floor.\nState Sen. Paul Newton, R-Cabarrus, rose to defend Womack’s reputation, calling him “a prudent advocate of oil and gas exploration and a conservationist.”\nHis appointment, and the others included in Senate Bill 694, then passed the Senate and headed to the House for another vote. The change to commission appointment rules is in Senate Bill 582, a multi-faceted bill slated to reach the House and Senate floors Thursday.", "url": "https://apnews.com/ce1d719e378d86311ec8f46494881b82"}