{"authors": ["Corey Robin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "An Interview With"], "date_download": "2020-05-04 19:51:21", "date_modify": "2020-05-04 19:51:21", "date_publish": "2017-11-18 00:00:00", "description": null, "filename": "2017_11_trump-corey-robin-reactionary-mind-interview_1588621881.html", "image_url": "https://images.jacobinmag.com/2017/11/18120954/EdmundBurke.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_11_trump-corey-robin-reactionary-mind-interview_1588621881.html", "title": "Donald Trump’s Reactionary Mind", "title_page": "Donald Trump’s Reactionary Mind", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "CR\nIn the 1870s, there is what economic historians call the marginal revolution. There is the notion of the subjective theory of value — that is, that value does not inhere in the object of anything, but that value is something that we as human beings put onto objects, whether those objects are commodities or labor — we ascribe value to those things.\nWhat is important about Hayek is that he picks up on this, but he makes it more aristocratic. And here, I think, he really does fulfill the vision that Burke had. What Hayek argues is that men of wealth, men of property, men of money have the capacity to determine value — not just at the market in an exchange in the way that Burke talked about, but in a much more long-term sense. They start making decisions about taste and preferences and desires. They revolutionize the things that people want.\nAnd it’s not just economic commodities. Hayek in his most far-reaching moment says that these men of wealth and money are able to revolutionize morals as well. Men of great inherited wealth subsidize abolition, and societies for the prevention of cruelty against animals, and other causes. Through money, he believes that they transform the most far-reaching morals and values we have.\nThis is really the ground zero of the theory. He believes that the most strenuous conception of morals are exhibited by how we spend our money. What Hayek says — along with Ludwig von Mises, another Austrian economist — is that talk is cheap. You can say you believe in x and y, but it is only at the moment of sacrifice that you know that you truly believe that. And the place where that sacrifice happens — the real crucible of where you have to give something up — is when you have to give up money for something. The more money you’re willing to spend, the more it shows you want and believe in that thing.\nIt’s the way sometimes people talk about the battlefield — there are no atheists in foxholes. You prove what you believe on the battlefield because you’re willing give up your life. These guys take that model of sacrifice, but locate it in the economy, in the space of money.\nThat’s the big revolution that’s at the heart of neoliberalism. Why do we measure everything according to money? It’s because money is really the best measure of what people care about. Not just what kind of toothpaste you want. Do you want to spend money on health care, education, or defense? Decisions about where you spend your money are how you truly express your deepest, most powerful beliefs.", "url": "https://www.jacobinmag.com/2017/11/trump-corey-robin-reactionary-mind-interview"}