{"authors": [], "date_download": "2020-05-04 20:21:15", "date_modify": "2020-05-04 20:21:15", "date_publish": "2017-02-24 10:00:00", "description": "Mike Peterson walked out of a Durham County courtroom Friday a convicted felon but a free man after pleading guilty to killing his wife more than 15 years ago. The 73-year-old novelist and...", "filename": "_09920856771e30cf5c991b1edab4161a_1588623675.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_09920856771e30cf5c991b1edab4161a_1588623675.html", "title": "Mike Peterson walks free as 15-year murder case ends with plea deal", "title_page": "Mike Peterson walks free as 15-year murder case ends with plea deal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mike Peterson walked out of a Durham County courtroom Friday a convicted felon but a free man after pleading guilty to killing his wife more than 15 years ago.\nThe 73-year-old novelist and one-time Durham mayoral candidate wrote what is likely the final chapter in one of the most notorious and longest-running criminal cases in the Triangle by continuing to maintain his innocence in the Dec. 9, 2001, death of Kathleen Peterson, who was found in a pool of blood at the bottom of a staircase in the couple’s Durham mansion.\nMike Peterson entered an Alford plea to a charge of voluntary manslaughter. Under an Alford plea, a defendant can maintain his or her innocence while acknowledging prosecutors have enough evidence for a conviction.\n“The bottom line here is that Mr. Peterson is not guilty. He never was guilty,” defense attorney David Rudolf said.\nCourts treat such pleas as guilty pleas, however, and Superior Court Judge Orlando Hudson sentenced Peterson to 64 to 86 months in prison and gave him credit for the 89 months he has already spent behind bars.\nAlthough Peterson argued that his wife died after falling down the stairs, he was found guilty following a three-month trial in 2003 of beating her to death and was sentenced to life in prison without parole.\nThe case became the subject of a documentary by a French film crew and remained in the public eye through Peterson’s repeated appeals, a $25 million judgment in a wrongful death lawsuit awarded to Kathleen Peterson’s daughter, Caitlin Atwater, occasional interviews from prison and alternative theories of Kathleen Peterson’s death, such as an owl attack, offered by Mike Peterson supporters.\nHe was finally granted a new trial in December 2011 when Hudson ruled that a key prosecution witness, former State Crime Lab blood analyst Duane Deaver, had lied on the stand during the original trial.\nRudolf said Deaver’s tainted testimony and questions about the medical examiner’s findings and some of the other evidence in the case suggest that law enforcement has conspired against Peterson and would do so again.\n“He does not feel, No. 1, that he got a fair trial,” Rudolf said, “based on the conduct of the law enforcement officers the first time around, and he is simply not willing to play again at what he perceives to be an unfair or crooked table.\n“He has no faith in Durham law enforcement being interested in the truth as opposed to being interested in convicting him and twisting evidence to that purpose,” he said.\nDurham County Assistant District Attorney Jim Dornfried said prosecutors agreed to the plea deal because much of the evidence used in the first trial would be inadmissable in the second. In addition to Deaver’s testimony, a court ruled that police improperly obtained computer files showing Peterson’s fascination with gay pornography and his email exchanges with a male escort, which prosecutors used in 2003 to establish a motive for Kathleen Peterson’s murder.\nAfter the hearing, Peterson said he wasn’t celebrating the end of the case.\n“I don’t see it as victory at all,” he said with a sigh.\nTaking the plea “is the most difficult thing I’ve done in my life,” he said, but he decided to do it based on something his son told him: “You’ll never win. Pick up your chips and go home.”\n“I can live with this,” he said. “It’s not fair. It’s not right. I’m innocent, and yet I’ve got this verdict there.”\nPeterson, who still wears a wedding ring, said he has tried not to be bitter over all of the years he lost battling the case. He said he lives one day at a time, firm in the belief that he did nothing wrong.\n“I didn’t hurt Kathleen. I didn’t kill her. It just didn’t happen,” he said.\nIn an interview with WRAL News, he acknowledged that many people will always believe he’s guilty of murder.\n“It’s pretty much a matter of why bother to change their minds. They’ll never change their minds,” he said. “It’s pointless for me to say, ‘No, you’re wrong.’ That’s fine. I can live with that.”\nPeterson said little during the 35-minute hearing, other than telling Hudson he understood his rights and the aspects of the plea deal he was taking. He then sat passively as Kathleen Peterson’s two sisters released years of pent-up anger in blistering victim statements.\n“It’s wrong that, after a jury sentenced him to life in prison for the murder of his wife, he gets to be a free man while Kathleen lies in her grave,” Lori Campbell said. “Closure is for a door, not for my murdered sister.”\nCandace Zamperini recounted some of the events in the lengthy case and how Peterson and defense attorney David Rudolf hurt her and her family with a “web of misdirections, lies (and) intimidation.”\nZamperini said she initially couldn’t believe her sister had been killed and that her death had to have been an accident, but reading the autopsy report and looking at the crime scene photos opened a Pandora’s box of doubt and anger.\n“All the evils of my sister’s death leaped into my eyes. The horrors of my sister’s beating were home,” she said. “Kathleen did not die slowly, but a three-hour death.”\nShe ridiculed Rudolf’s questioning of the medical examiner’s opinions as to the cause of Kathleen Peterson’s death and to his suggestion that she steered police to believing that a fireplace blowpoke was the murder weapon.\n“You went out of your way to try to scare and bully me,” she told Rudolf. “Your browbeating of me was not missed by the judge or the jury.”\nZamperini said she doesn’t care that Peterson entered an Alford plea. To her, her family and the world at large, he’s guilty.\n“Alford, schmalford. It means nothing,” she said. “Michael Peterson, you are pleading guilty to voluntary manslaughter. You will be treated as guilty for murdering my sister Kathleen, and you will be a convicted felon forever.”\nIn his interview with WRAL News, Peterson said he would love to reconcile with his wife’s family, but he doubts it will ever happen.\n“I would like to say, ‘Candace, we all loved Kathleen. We all miss Kathleen. I am so sorry that you lost a sister. I’m so sorry that you lost a mother, Caitlin. I can’t do anything about that. I didn’t do it. But, if it will make you feel better to believe that, fine, go ahead,’” he said. “If anyone can find any good in Kathleen’s death, I’m fine with that. I can’t”", "url": "https://apnews.com/09920856771e30cf5c991b1edab4161a"}