{"authors": ["Amanda Lutey"], "date_download": "2020-05-04 20:13:33", "date_modify": "2020-05-04 20:13:33", "date_publish": "2017-03-02 01:45:00", "description": "FOX LAKE —It was a short retirement. The Fox Lake City Council introduced Dean Perlick as the new city administrator Wednesday. Alderman John Mund, serving as the chair of the council...", "filename": "_5a222a1cb8b54cf0a2672eb459a0e411_1588623213.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5a222a1cb8b54cf0a2672eb459a0e411_1588623213.html", "title": "Fox Lake hires new adminstrator", "title_page": "Fox Lake hires new adminstrator", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FOX LAKE —It was a short retirement.\nThe Fox Lake City Council introduced Dean Perlick as the new city administrator Wednesday.\nAlderman John Mund, serving as the chair of the council meeting in the absence of Mayor Tom Bednarek, introduced Perlick. Perlick worked for Dodge County for 26 years, retiring as the manager of planning and economic development.\n“Today was my last day,” Perlick said.\nPerlick said he was familiar with Fox Lake, having helped the city work on its comprehensive plan and zoning ordinances.\n“Hopefully, I will be able to use this past experience to try to benefit the city,” he said. “I’m looking forward to new challenges here.”\nPerlick said he had been working with Chuck Schranz, who filled in as an interim administrator after Gary Rogers resigned from the position in December, to “learn some of the ropes” of the adminstrator’s position.\n“I would like to thank Chuck for stepping in and helping out,” said Alderman Pete Hartzheim.\nSchranz said it was the third time he has served as the interim administrator.\nIn other business, the city granted a picnic license to the SAGES Foundation for a fundraiser dinner on April 17 and waived the rental fee for the community center on that night. The city also approved waiving the connection fee for the SAGES community garden water service, located at the corner of West Crocker and Spring streets.\nAlderman Sam Jenswold abstained on both votes waiving fees, citing his wife’s involvement with SAGES.\nThe city council authorized the mayor to sign “2015 Wisconsin Act 211 Municipality Delegation of Authority,” authorizing General Engineering to act on the city’s behalf to file one and two family building permits electronically.\nThe council adopted a resolution on its water lateral replacement policy and approved raising the charge for sidewalk snow removal to $100 per hour, or any portion of an hour, with a $50 adminstrative fee per removal.\nAlderman Dennis Linke asked that a motion naming a new city street be tabled until Mund could vote on the name. The city is considering Bower, Scott or Streich as street names, and Schranz told the city council a few other name suggestions had been submitted.\nThe city approved hiring Derick Kruger as a police officer at $20 per hour, beginning March 6, with a one year probation period that begins at the end of his field training. Alderman Dan Ault asked police chief Jim Rohr about Kruger.\nRohr said Kruger is from Markesan and currently living near Theresa, and looks forward to living closer to home. He said Kruger has law enforcement experience and a strong IT background. Rohr said Fox Lake will switch to a new records management system with Dodge County in 2018.\n“I think he’ll be an asset for that transition,” Rohr said.", "url": "https://apnews.com/5a222a1cb8b54cf0a2672eb459a0e411"}