{"authors": ["Danny Shapiro"], "date_download": "2020-05-04 20:17:16", "date_modify": "2020-05-04 20:17:16", "date_publish": "2017-11-16 16:20:01", "description": "After a 1-4 start to the season, Silsbee needed a spark. The Tigers found one in the unlikely duo of Christopher Martin and Dralyn Taylor. An injury to all-district running back Adonis...", "filename": "_ab847b4fb65c41108f282b00385dc4a8_1588623436.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ab847b4fb65c41108f282b00385dc4a8_1588623436.html", "title": "Sophomore running backs lead Silsbee into playoffs", "title_page": "Sophomore running backs lead Silsbee into playoffs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "After a 1-4 start to the season, Silsbee needed a spark.\nThe Tigers found one in the unlikely duo of Christopher Martin and Dralyn Taylor.\nAn injury to all-district running back Adonis Thomas during Silsbee’s district-opening loss to Little Cypress-Mauriceville gave Martin and Taylor, sophomores who started the season playing defense, a chance to make a difference.\nThe Tigers captured the District 10-4A-I title while the converted running backs have combined for more than 1,200 yards and 17 touchdowns in the four wins.\n″(Christopher and Dralyn’s) energy is a big reason we started playing better,” said coach Randy Smith. “They’re both really good players and are still so raw. We’re lucky to have them around.”\nThe two didn’t seem likely to be instant impact players because of their inexperience.\nMartin didn’t play football his freshman year and came to tryouts this season in hopes of playing wide receiver.\nTaylor played running back for the freshman team last season but began the season on varsity as an outside linebacker, the same position Martin wound up at.\n“I thought I was going to have to wait my turn,” Martin said.\nSmith ultimately decided to move them to running back after the LC-M loss because he was impressed by their athleticism.\nThe decision paid off immediately as Martin and Taylor combined for 350 yards and a pair of touchdowns in a victory over Navasota the following week.\nTheir complementary running styles made it easy for Smith to work them into his game plans, especially with Thomas still sidelined.\nMartin, at 6-foot-1 and 195 pounds, is the stronger, bigger running back.\nTaylor is quicker and smaller at 5-foot-8 and 165 pounds.\nTheir teammates have nicknamed them “Thunder and Lightning” as an homage to the 2016 running back duo of Thomas and Calvin Tyler Jr., who is in his freshman season at Oregon State.\n“We’re just trying to do what we can to help the team,” Taylor said. “Neither of us expected to be in this situation so quickly so we’re just trying to keep it going.”\nStrong follow-up performances against Bridge City (230 yards, four TDs), Huffman-Hargrave (495 yards, 7 TDs) and Cleveland (200 yards, 3 TDs) cemented Martin and Taylor’s roles.\nThomas still takes snaps on offense but has settled into the linebacker role he occupied for most of the 2016 season.\n“If one of us isn’t playing well, the other one will,” Taylor said. “If both of us are playing well, it’s game over.”\nDShapiro@BeaumontEnterprise.comTwitter.com/DannyShapiro13", "url": "https://apnews.com/ab847b4fb65c41108f282b00385dc4a8"}