{"authors": ["Joe Horvath"], "date_download": "2020-05-04 20:09:47", "date_modify": "2020-05-04 20:09:47", "date_publish": "2017-01-26 05:00:00", "description": "Name an issue on which former President Obama, the Heritage Foundation, the Brookings Institution, the American Legislative Exchange Council (ALEC), the NAACP and the Koch brothers...", "filename": "_447f1d09aafc4ebe97dd13e0bfcc7bcd_1588622987.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_447f1d09aafc4ebe97dd13e0bfcc7bcd_1588622987.html", "title": "Joe Horvath: Licensing reform will work, and make work, for Connecticut", "title_page": "Joe Horvath: Licensing reform will work, and make work, for Connecticut", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Name an issue on which former President Obama, the Heritage Foundation, the Brookings Institution, the American Legislative Exchange Council (ALEC), the NAACP and the Koch brothers agree.\nNot too easy, is it?\nThe answer is that all these groups want to reform occupational licensing, a network of laws presumably designed for public safety. However, they often serve only as barriers between individuals and meaningful work. A desire to fix the problem is bringing together a budding left-right coalition for a rare opportunity to turn good policy into meaningful results.\nOccupational licenses, simply put, mean workers need permission from the state just to work. The crucible of paperwork, wait times, and fees have a chilling effect on employment. In a recent Yankee Institute study called “Waiting to Work,” Quinnipiac University Professor Mark Gius studied the nationwide effects licensing has on 11 occupations’ employment rates. Gius found that licensure reduced per capita employment for opticians, pharmacy technicians and teacher’s assistants, among others.\nThose are not just numbers; they are real people unable to do the work they love.\nConnecticut has unnecessarily burdensome restrictions. The Institute for Justice, a national nonprofit law firm, conducted a nationwide study titled “License to Work.” The study examined licensing laws for low- and middle-income occupations and found Connecticut was the 15th most broadly and onerously licensed state. For example, it takes seven years to become a fully licensed full-fledged glass installer in Connecticut.\nOccupational licensing reform’s most obvious benefits are economic. Licensure often shuts potential entrepreneurs out of the market. In recent research titled “Bootstraps Tangled in Red Tape,” Arizona State University’s Steven Slivinski found an interesting correlation: “the higher the rate of licensure of low-income occupations, the lower the rate of low-income entrepreneurship.” Licensing reform would help low-income people get the good jobs they want, rather than being stranded on expensive social programs.\nLess obvious, but equally important, are the criminal justice implications of occupational licensing. Former inmates have difficulty securing post-release employment, and, as former-President Obama argued, “people with a criminal record are more likely to succeed and not recidivate if they have a good job.” Slivinski, who also studied the impact of occupational licensing on recidivism in “Turning Shackles into Bootstraps,” writes:\nBetween 1997 and 2007 the states with the heaviest occupational licensing burdens saw an average increase in the three-year, new-crime recidivism rate of over 9 percent. Conversely, the states that had the lowest burdens...saw an average decline in that recidivism rate of nearly 2.5 percent.\nNot only is incarceration expensive, but if the fundamental principle of our prison system is rehabilitation and reintroduction, then affording former inmates a fairer re-entry is the next logical step in the process. Licensing can help ex-convicts take that step.\nThankfully, this state’s legislative leaders are showing interest in the issue. Senate Majority Leader Bob Duff, D-Norwalk, and Senate Republican President Pro Tempore Len Fasano, R-North Haven, are both supporters of licensing reform. Multiple bills to eliminate or streamline licensing requirements have been introduced in both houses and by members of both parties.\nIt is encouraging to see so many Connecticut officials engaged, but now interest must turn into action. There are practical ways to start peeling back unnecessary licensing requirements. Exempting veterans and their spouses, low-income people, and disabled individuals from licensing requirements would allow those most in need of good jobs to pursue them.\nMore fundamental change, though, requires a process by which licenses are under constant review to determine whether they remain necessary. The goal should always be to manage public safety concerns in the least burdensome way. If licensing is not the least obstructive solution, alternatives such as registration, certification or even simple market competition can substitute.\nSince June, Connecticut has shed more than 13,000 jobs. This state’s economy will turn around when more people can find good jobs and fewer are forced to depend on a safety net. Occupational licensing reform has bipartisan, popular support. It also happens to be good policy for people who just want to work.\nJoe Horvath is the Assistant Policy Director of the Yankee Institute for Public Policy. Learn more at yankeeinsitute.org.", "url": "https://apnews.com/447f1d09aafc4ebe97dd13e0bfcc7bcd"}