{"authors": ["Marc Bona"], "date_download": "2020-05-04 20:07:16", "date_modify": "2020-05-04 20:07:16", "date_publish": "2017-12-04 12:03:18", "description": "Holiday-mailing deadlines 2017: Dates to know (and avoid) plus tips CLEVELAND, Ohio – December is here, and that means knowing when to mail and – most importantly – when not to. There...", "filename": "_723f00a0ce004e5fabb54af3dfc2c582_1588622836.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_723f00a0ce004e5fabb54af3dfc2c582_1588622836.html", "title": "Holiday-mailing deadlines 2017: Dates to know (and avoid) plus tips", "title_page": "Holiday-mailing deadlines 2017: Dates to know (and avoid) plus tips", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Holiday-mailing deadlines 2017: Dates to know (and avoid) plus tips\nHoliday-mailing deadlines 2017: Dates to know (and avoid) plus tips\nCLEVELAND, Ohio – December is here, and that means knowing when to mail and – most importantly – when not to.\nThere are many mailing options, from the U.S. Postal Service to private companies. Like Santa and his elves, workers at USPS and other services are on tight deadlines at their busiest time of the year.\nWe checked with USPS, UPS and Amazon. Here are dates and tips to know:\nKEY DATES\nThursday, Dec. 7: U.S. Postal Service First Class International Service to Europe for Christmas delivery.\nMonday, Dec. 11: For arrival by Christmas, most of the military (APO/FPO/DPO) deadlines are on this date for Priority Mail and First Class. Here’s the full deadline schedule.\nTuesday, Dec. 12: Hanukkah starts. David Van Allen, who coordinates USPS Strategic Communications for the Northern Ohio and Ohio Valley districts, suggests mailing about five days prior for gifts to arrive in time. “Earlier is way better,” he said. (Hanukkah runs until Wednesday, Dec. 20.)\nThursday, Dec. 14: USPS retail ground-shipping deadline for arrival in time for Christmas.\nFriday, Dec. 15: Order by this date for free shipping via Amazon for Christmas delivery. Also, “Letters from Santa” must be received by the Anchorage, Alaska, postmaster by this date. USPS suggests using #LettersFromSanta on social media when your child receives the response. (See below for details.)\nSaturday, Dec. 16: Most of the military (APO/FPO/DPO) deadlines for Priority Mail Express fall on this date for Christmas delivery.\nMonday, Dec. 18 - Saturday, Dec. 24: This is the week to avoid. It’s the Postal Service’s busiest mailing, shipping and delivery week. USPS expects to handle almost 3 billion pieces of First Class Mail. (The Post Office no longer declares one specific date as “busiest mailing day of the year.” “It’s more of a busiest mailing week,” Van Allen said. “Because of online mailing and packages, it got kind of shifted.”\nMonday, Dec. 18: U.S. Postal Service’s anticipated busiest day online with more than 7 million people hitting usps.com. Also, order by this date for standard shipping via Amazon for Christmas delivery. It’s the last day to send packages via UPS 3 Day Select to ensure delivery before Christmas with arrival Friday, Dec. 22.\nTuesday, Dec. 19: Ship First Class mail – including cards - via U.S. Postal Service to arrive before Christmas.\nWednesday, Dec. 20: Ship with U.S. Postal Service Priority Mail Service in time for Christmas. Send on this date via UPS 2nd Day Air to ensure delivery before Christmas Day with arrival Friday, Dec. 22.\nThursday, Dec. 21: Ship UPS Next Day Air by this date to ensure delivery before Christmas Day, with arrival Friday, Dec. 22. (UPS says if your destination gets Saturday Delivery, you can send Next Day Air on Friday and have it arrive Saturday, Dec. 23, but it will cost more.)\nFriday, Dec. 22: Ship with U.S. Postal Service Priority Mail Express Service for delivery by Christmas. It’s also the last regular delivery day before Christmas for UPS. (A UPS rep tells us most - but not all - zip codes have Saturday delivery.)\nSunday, Dec. 24: Christmas Eve. No U.S. Postal Service deliveries or blue-box pickup.\nMonday, Dec. 25: Christmas Day. No U.S. Postal Service or UPS deliveries.\n(Here are details on USPS mailing and shipping deadlines, and here’s a way to calculate time and cost for UPS.)\nDID YOU KNOW?\n• UPS says a box loses 50 percent of its strength after just one use. If you reuse boxes, make sure they are not damaged, and cross out non-applicable addresses and notations. (USPS does not recommend reusing boxes, but as anyone who has ever eBay’d knows, it happens all the time.)\n• The U.S. Postal Service expects to deliver 850 million packages – that doesn’t count letters and cards - between Thanksgiving and New Year’s Day - more than a 10 percent increase compared to last year. USPS will handle 15 billion packages, letters and cards during the holiday season.\n• Packages weighing more than 13 ounces and bearing only stamps as postage cannot be deposited in collection boxes or given to carriers. They must be presented to a Postal Service employee at a window counter.\n• Incoming mail to Puerto Rico and Virgin Islands is available. Customers are receiving mail at Post Offices or through limited delivery. This link updates the delivery status.\n11 TIPS TO KNOW\n• When filling a box allow at least a 2-inch space around items for packing materials. UPS suggests bubble wrap, packing peanuts and air packs. (Shredded paper and crinkled butcher paper also work.)\n• A First-Class stamp costs 49 cents with a potential increase to 50 cents next year. Reminder: Forever stamps remain valid at the price you purchased them. So if you buy holiday stamps at the 49-cent rate and have leftovers, you can keep using them even after the rate increases.\n• Be legible! Print labels with clean fonts - no Edwardian Script or Snell Roundhand. Stick to clear sans-serif fonts. If writing, be clear. Include “to” and “from” on only one side of the box. And doublecheck your work: Don’t leave off apartment or suite numbers.\n• Drop in a second shipping label inside your box with sender’s and addressee’s addresses. (UPS says it’s a good idea to include the recipient’s phone number on shipping labels - inside the package and out.)\n• Never wrap a box in brown paper, UPS says. Shipping labels can be torn off, and paper tends to rip.\n• Items with batteries need to be separated in the box. Meaning: Don’t stick the batteries in the talking robot.\n• Wrap glass separately from its accompanying object. That picture of your nephew and nieces should be slipped out of the frame.\n• UPS suggests “3-inch (wide) poly tape, an adhesive-back taped with aggressive hold.”\nDo not use packing, masking, cellophane or duct tape. Tape side seams first, then across the top. And it doesn’t hurt to reinforce bottom flaps.\n• Don’t guess at zip codes. Look them up here. If you know the +4 code, use it; it increases efficiency. And as USPS says: “No zip is better than a wrong zip.”\n• If your item is breakable, write “fragile.” But avoid cute sayings, other notations and emojis.\n• If your local Post Office does not have an automated machine, call another close by to see if they offer one. Often there is no line or a much shorter one compared to the queue of people waiting to mail holiday packages.\nABOUT INFORMED DELIVERY\nEager about when those packages will arrive? A free USPS program started this year helps with tracking a package coming your way:\n• Sign up for free at informeddelivery.com.\n• Receive texts or email notifications that a package is en route and additional alerts when the package has been delivered.\n• You can authorize the carrier to leave the package in a specific place, be held at the Post Office, or be redirected.\n“It started this year,” Van Allen said. “It’s pretty cool. You sign up; it’s free. You get an image telling you what’s coming very soon, probably that day. ... You know exactly what’s going on with it at all time.”\nLETTERS FROM SANTA PROGRAM\nHere’s what to know to get a letter from Santa with a North Pole postmark:\n1. Have your child write to Santa.\n2. Put the note in an envelope addressed to: Santa Claus, North Pole.\n3. Later - when alone - open the envelope and write a personal response to the child. Insert the response letter into an envelope addressed to the child (or write the response on the back of the child’s letter).\n4. Add SANTA, NORTH POLE to the envelope.\n5. Stamp the envelope.\n6. Place the envelope into a larger envelope with appropriate postage to: North Pole Postmark, Postmaster, 4141 Postmark Dr., Anchorage, AK 99530-9998.", "url": "https://apnews.com/723f00a0ce004e5fabb54af3dfc2c582"}