{"authors": ["Megan Ryan"], "date_download": "2020-05-04 20:22:02", "date_modify": "2020-05-04 20:22:02", "date_publish": "2017-11-11 16:57:35", "description": "Senior guard Carlie Wagner said ahead of her teams first game of the 2017-18 season, the Gophers would hit the ground running. She made good on that promise, if an opening 3-pointer was any...", "filename": "_213db68442e7438b94fdeddd5b1de86a_1588623722.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_213db68442e7438b94fdeddd5b1de86a_1588623722.html", "title": "Gophers open women's basketball season with 107-73 rout of Lehigh", "title_page": "Gophers open women's basketball season with 107-73 rout of Lehigh", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Senior guard Carlie Wagner said ahead of her teams first game of the 2017-18 season, the Gophers would hit the ground running.\nShe made good on that promise, if an opening 3-pointer was any way to set the tone.\nThe Gophers made it clear from the very first whistle that they returned 83 percent of their scoring offense from last season with an 18-2 run to start the game against Lehigh.\nAnd it only rolled on from there.\nThe Gophers beat Lehigh with a decisive 107-73 score line Saturday at Williams Arena in the season opener. The Gophers are now 27-18 all time in season openers, dating to 1973-74 and have won nine-consecutive. Theyre also 40-10 at Williams Arena under coach Marlene Stollings, who is in her fourth season.\nThose returning top-three scorers and four of five starters from last season all put up points in that opening statement, with Wagner leading the way with that first 3-pointer. Junior forward Palma Kaposi, senior center Jessie Edwards and redshirt junior guard Kenisha Bell all contributed a basket while sophomore guard Gadiva Hubbard recorded seven points in that run alone.\nHubbard went on to tie for a game-high 22 points, scoring 16 in just the first half. She also scored a career-high six 3-pointers. Wagner also managed 22 points, her 84th career game scoring in double-digits. In all, seven Gophers broke into double figures: Hubbard, Wagner, Bell with 12, freshman guard/forward Destiny Pitts with 12, freshman guard Paloma Gonzalez with 12, senior center Bryanna Fernstrom with 11 and sophomore guard Jasmine Brunson with 10.\nWagner is only holdover from the Gophers squad that most recently made the NCAA tournament in 2014-15. Last years top scorer, averaging 19.1 points per game, entered the season in eighth place on the Gophers career scoring list with 1,597 points. If she were to equal her point total from last season, she would come in thir behind former stars Lindsay Whalen at 2,285 and Rachel Banham at 3,093. Wagner is also primed to finish in the top two for 3-pointers behind Banham at 304, as she entered this year with 206.\nFreshman guard Paloma Gonzalez, along with Pitts, scored her first points as a Gophers player.\nFor the third time in four years, the Gophers scored 100 points in their season opener. The team also inched pretty close to its record for most points, which is 116 back on Nov. 23, 2002, against Indiana Purdue Fort Wayne.\nLast season, the Gophers were 15-16 overall and 5-11 in the Big Ten, battling against one of the toughest schedules with a young team. But 10 players overall are back this season and looking for coach Marlene Stollings third 20-plus victory season after she started her Gophers career back in 2014-15 with two.\nThe Gophers play at Rhode Island 6 p.m. Monday. In the three seasons so far under Stollings, the Gophers have started 4-0, which is the first streak of that nature in school history.", "url": "https://apnews.com/213db68442e7438b94fdeddd5b1de86a"}