{"authors": ["Greg Bowman Gordon County Extension Agent"], "date_download": "2020-05-04 20:28:37", "date_modify": "2020-05-04 20:28:37", "date_publish": "2017-04-02 19:00:00", "description": "Today, I wanted to keep with the theme of discussing a specific vegetable for our home gardens. There is nothing more rewarding that harvesting nutritious garden items that you raised yourself....", "filename": "_0d4b4ea6e6e247d59abbb234aac144c4_1588624117.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0d4b4ea6e6e247d59abbb234aac144c4_1588624117.html", "title": "Greg Bowman discusses Home Garden Squash", "title_page": "Greg Bowman discusses Home Garden Squash", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today, I wanted to keep with the theme of discussing a specific vegetable for our home gardens. There is nothing more rewarding that harvesting nutritious garden items that you raised yourself. One particular garden vegetable that is very popular in our area is the squash. Squash is great for you since it is high in vitamins A and C and also is a high fiber vegetable. Squash can be fairly easy to grow if you just keep some simple basics in mind. I will be sharing information from a UGA publication by Bob Westerfield and Malgorzata Florkowska, UGA Horticulturists.\nThe first thing to keep in mind is that squash are divided into two types. You have the winter squash and the summer squash. I am going to center on the summer squash today. Within the summer squashes, you have the types of yellow straight neck or crooked neck, the white scallop or patty pan and zucchini. Many folks will have their favorites and plant them annually while others will be tempted to change up and plant new varieties.\nThe area you are going to plant is important. Squash can perform better in soils with a pH of 5.8 to 6.8. In our area of Georgia, we can have soils that are more acidic on the scale so a soil analysis can be beneficial. The area should drain well and be high in organic matter. According to our data, organic matter will help the plant up-take of water and nutrients. It is suggested to add compost or even aged livestock manure to help give the young plants a boost. If starting with a new gardening site, you may add 4-5 inches of organic matter and then till the organic matter 8-10 inches in the existing soil. If you use manures, make sure the manure is from a herbicide free source to reduce the change of herbicide damage.\nRight now, we are still too cool for planting squash. Our soil temperatures are still too cold and the ground is too damp. Wait till after the last danger of cold damage from frost has passed before planting. That is normally the middle of April here, but you can wait longer than that and still get a great squash crop. Ideally, we like the soil temperatures to get about 65 degrees F. When you plant, you need to plant 4-6 squash seeds in individual mounds 4-feet apart in the garden. After the plants have two leaves, thin the mound to 2-3 plants. You can use transplants if you want. Westerfield and Florkowska suggests to make sure the transplants have 2-3 mature leaves and a great root system.\nWhen squash plants are established, they have a watering requirement of 1-1.5 inches of irrigation per week. The goal is to try to get moisture in the 6-8 inches of soil depth. If you have the option, try to use soaker hoses or drip irrigation. An additional goal in irrigation is keeping the foliage of the plants dry so that is why drip irrigation and soaker hoses are helpful. Soaking the foliage with a water hose or sprinkler can be a component to having disease start on your plants. It is also suggested to reduce watering when fruit ripens to reduce fruit rot.\nYou need to fertilize your squash at planting. If you fail to take a soil test, a general recommendation is 3 tablespoons of 5-10-15 fertilizer per mound at planting. When you plants flower and small fruit forms, you need to side-dress based on a soil test. When you fertilize, water the plants to release the nutrients of the fertilizer.\nAgain, squash are fairly easy to grow, but you do have a few issues. The main problems are with insects such as squash bugs or squash vine borers. They can be very problematic in a garden. Disease can be a problem too with powdery mildew. You will notice powdery mildew on the older foliage first. Proper irrigation can help by keeping foliage dry. Plus, there are some resistant varieties are the market. Do your research in regards to squash varieties.\nMany folks will have issues with blossom-end rot which is when your soil is short of calcium. A soil test will help with liming recommendations which will help on blossom-end rot. You will see blossom-end rot as black rotting areas on the bottom of the fruit. Keeping irrigation uniform can help reduce the symptoms of blossom-end rot.\nFor more information, contact UGA Extension- Gordon County at 706-629-8685 or email gbowman@uga.edu.", "url": "https://apnews.com/0d4b4ea6e6e247d59abbb234aac144c4"}