{"authors": ["Jane Warnock", "First Friday Art Walk Coordinator"], "date_download": "2020-05-04 20:03:47", "date_modify": "2020-05-04 20:03:47", "date_publish": "2017-01-04 19:13:00", "description": "Happy New Year from Old Town Pocatello. Come experience a winter wonderland and stroll through Old Town on Friday to celebrate our art community. From 5 to 8 p.m. take in the variety of art, live...", "filename": "_21bc97516e8b49799b293d11ad1b28a8_1588622627.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_21bc97516e8b49799b293d11ad1b28a8_1588622627.html", "title": "January 2017 First Friday Art Walk in Old Town Pocatello", "title_page": "January 2017 First Friday Art Walk in Old Town Pocatello", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Happy New Year from Old Town Pocatello. Come experience a winter wonderland and stroll through Old Town on Friday to celebrate our art community. From 5 to 8 p.m. take in the variety of art, live music, and food. After Art Walk, be sure to stay for dinner. Old Town is the center for International Cuisine. Our restaurants are all locally owned and operated and you can taste the difference! Menus include Thai, Japanese, Italian, Greek and Indian, just to name a few. Try something new or enjoy your favorite dish in Old Town Pocatello.\nThe Old Town Pocatello Trolley will be providing free shuttle rides throughout the evening.\nEastside Old Town\nPocatello Co-op Natural Foods Market & Farm Table Café, 309 E. Center, will be hosting mixed media artist, Aubri Matkin.\nGallows Custom Framing & Gifts, 150 S. 4th, to welcome photographer Eric D. His work is rich with landscape and nature images. All profits from sales will be donated to the Idaho Condor Humanitarian Organization. Refreshments will be served.\nPortneuf Valley Brewing, 615 S. 1st, will be featuring artist Jacob Secrest, showing acrylic and charcoal works. Steelhead Redd swims back in to play their special blend of folk and bluegrass for y’all from 9 to 11:30 p.m. No cover.\nSecond Time Around, 701 S. 1st, will feature artist Jane Guidinger, who will be showing oil landscape paintings. They will be serving coffee and cookies to guests.\nWestside Old Town\nThe Shady Lady, 655 N. Arthur, will feature artist Ron Lewis.\nAmerican Family Insurance, 427 N. Main, Ste A, will be showing artworks by Andrew Pedersen.\nThe Pocatello Art Center, 444 N. Main, will be showcasing local artists exhibiting oil, watercolor, jewelry, porcelain, silk, photography and many other mediums. Will be open for Second Chance Saturday from 11 a.m. to 4 p.m.\nMain Steam Coffee & Desserts and All Under One Roof, 234 N. Main, will be highlighting their recent remodel.\nVain & Vintage, 149 N. Main, will be hosting handmade jewelry artist Eliza Schmidt...“Bead Creations from Nature and Dreams”. Refreshments will be provided.\nOld Town Mercantile and Antiques, 134 N. Main, to welcome artist Shanda Rasmussen from Logan Utah. Her travels and studies in Germany along with her love of the Volkswagen have inspired her modern street-art style. Shanda’s art has intrigued classic car lovers all over the world, resulting in a custom art business called Petrohead Paintings.\nGate City Fine Arts Gallery, 315 W. Center, will feature the work of local artists.\nBlack Rail Antiques & Collectibles, 312 W. Center, will show a variety of artifacts, paintings, antiques.\nDeckadencE Board Shoppe, 326 W. Center, will be hosting Aryssa Hutchins, a Boise State University graduate, who creates dynamic pieces with various mediums. Specializing in illustration, her featured work includes several character designs and psychedelic pieces on repurposed boards\nThe Pocatello Elks Lodge #674, 410 S. Main St., will be hosting an antique appraisal event. Do you have “Trash or Treasure” with antiques or family heirlooms you have on hand? Local area antique dealers will be at the Lodge to appraise your small or medium-sized antiques. These experienced dealers have over a collected 80 years of antiquing experience, and are affiliated with several antique stores in Pocatello and Idaho Falls. This event is for appraisals only. There will be no buying or selling of items. A charge of $4 will enable you to bring up to 3 items to be appraised. From the back parking lot, go down the stairs to the dining room. A new electrical chair has been installed for those needing assistance. The appraisals go from 5 to 7:30 p.m.\nPocatello Art Center, 444 N. Main, is honoring George Wise, artist and instructor, for his dedication to the arts and to the Art Center. A reception is in his honor. Many pieces of his art will be on display and for sale with his signing that night. The Portnuef Photographers will have a special event in the classroom", "url": "https://apnews.com/21bc97516e8b49799b293d11ad1b28a8"}