{"authors": ["Lily Geismer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:54", "date_modify": "2020-05-04 19:59:54", "date_publish": "2017-09-29 00:00:00", "description": null, "filename": "2016_02_geismer-democratic-party-atari-tech-silicon-valley-mondale_1588622394.html", "image_url": "https://images.jacobinmag.com/2017/09/29121310/894295f232674e599e13cdf52fcc481b2566efc91.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_02_geismer-democratic-party-atari-tech-silicon-valley-mondale_1588622394.html", "title": "Atari Democrats", "title_page": "Atari Democrats", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In late 1992, the Democratic Leadership Council (DLC) published a “blueprint for a new America” entitled Mandate for Change . Issued as the group’s former chair prepared to assume the presidency, the document was intended as a “guide to the progressive ideas and themes that energized Bill Clinton’s winning campaign” and an outline of “a new governing agenda for a new era in American politics.”\nAnimating that agenda were several core principles: “economic growth generated in free markets as the prerequisite for opportunity for all,” “equality in terms of opportunity, not results,” and a rejection of both the “liberal emphasis on redistribution in favor of pro-growth policies that generate broad prosperity” and the “Right’s notion that wealthy investors drive the economy.”\nClinton himself blurbed the book, praising the authors’ “new governing philosophy based on opportunity, responsibility, and community.” At last, the president-elect declared, the Democratic Party was moving “beyond the old Left-Right debates of the past.”\nMandate for Change also contained a narrative of political history that validated the DLC’s own efforts to remake the party. The authors depicted a Democratic coalition “pulled asunder” in the late 1960s “over issues of race, war, and cultural alienation.” It was Clinton, the authors gushed, who had rescued the party from disarray and oblivion. DLC founder Al From recycled the “Clinton-as-savior” narrative in his memoir, arguing the New Democrats’ philosophy and strategy had brought the Democrats in from “the wilderness.” Yet while the party had indeed been transformed since the late 1960s, the heroic tale of rebirth obscured a much more complex restructuring.\nThese changes should be viewed neither as the betrayal of the Democratic Party’s purpose in the late 1960s nor as a product of the DLC’s political genius. Rather, they reflect a broader shift in the balance of power within the party. Since the 1960s, suburban knowledge professionals and high-tech corporations have supplanted urban ethnics and labor unions as the party’s core constituency. This shifting base intensified structural inequality and constrained the party’s ability to deliver progressive reforms.\nWhile suburban knowledge workers make up a small portion of the electorate and an even smaller percentage of the national population, they have come to hold a disproportionate amount of political power — especially within the Democratic Party. This cohort tends to vote in high numbers, contribute to campaigns, engage in issue-based advocacy, and receive outsized media attention.\nEngineers, tech executives, scientists, lawyers, and academics in postindustrial, high-tech enclaves across the country — from the Route 128 to the Research Triangle and Silicon Valley — broadly share a political agenda that combines economic and cultural issues. They generally favor environmental protection, low taxes, freedom of choice, promotion of high-tech industry, education as a means to advancement, and expertise as a solvent for social problems. Richard Florida, who initially coined the term “creative class” to describe this constituency, characterizes their politics as “generally liberal-minded.”\nAbove all, he argues, knowledge workers are “staunchly meritocratic” and opposed to “inequality of opportunity.” While that commitment has at times driven them to favor collective remedies to social problems, at other points, it has provoked sharp antipathy toward labor unions.\nSuch opposition to one of the New Deal’s principal tenets confirms one thing: though American liberalism hasn’t disintegrated since the 1960s, it’s undergone a clear metamorphosis, reshaping its home in the Democratic Party along the way.\nThe roots of the professional class’s growth go much deeper than is immediately evident. In fact, they go back to the New Deal itself. Often depicted as the heyday of social democracy in the United States, the New Deal did consist of initiatives such as the National Labor Relations Act, the Social Security Act, and the Works Progress Administration, which brought factory workers under the Democratic tent.\nBut at the same time the New Deal solidified support from generations of industrial workers, it also initiated a set of policies and ideas that would eventually empower suburban knowledge workers by giving them substantial privileges and resources. These policies exacerbated forms of structural inequality that have defined and plagued American society ever since.\nIn the effort to create economic security and opportunity and stabilize market forces, bureaucrats under Franklin Roosevelt and Harry Truman developed a range of public policies to encourage single-family homeownership for whites outside central cities. Black and brown families received no such privileges. As historians and other scholars have carefully documented, the result — postwar suburbanization — was systemic residential segregation by race and class.\nThough a creation of state intervention, the invidious consequences of these policies were framed within a free-market discourse by the real-estate industry, popular culture, and even the government. Such obfuscation of the actual causes of continued segregation encouraged white suburbanites to understand their decisions about where to live as individual choices and rights. They were less likely to see how their own actions took advantage of state subsidies that perpetuated forms of racial and economic inequality.\nThe New Deal agenda also placed technocratic ideas at the heart of its programs. Advocates of these apparently apolitical mechanisms of governance came to populate state agencies, contributing to later shifts in the Democratic Party and in the nation’s economic and spatial dynamics. The Roosevelt administration substantially increased the funding of science-based research at universities like MIT, Harvard, and Stanford for military purposes. During the Cold War, the government further boosted this funding in the form of federal research and development grants, which swelled the size of universities and spawned numerous technological breakthroughs along the way.\nBeyond the ivory tower, the rising outlays fueled the explosion of technology and electronics companies in office parks and labs in the metropolitan rings of cities, which physically, economically, and socially reshaped areas ranging from Boston and New York to Atlanta, Los Angeles, and the Bay Area. The rise of these new businesses and labs laid the foundation for the high-tech revolution.\nThese developments also precipitated a shift in the politics of labor. Knowledge workers, not manufacturing workers, became the fastest growing occupational sector in this “post-industrial society,” as Daniel Bell famously labeled the post–World War II economic landscape. Despite the fact that over a third of all workers belonged to a union at the beginning of the 1950s, labor-saving technologies, the movement of many companies to “right-to-work” states in the South, and the suppression of labor activism initiated an ongoing drop in unionization rates across the country over the 1950s and 1960s. In addition, an increasing political divergence grew between labor leaders and rank-and-file members. This combination of factors led unions to gradually lose their influence within the Democratic Party.\nAt the same time, a new kind of liberal and Democratic politics began emerging within suburban office parks and single-family homes. White-collar knowledge professionals were employed in overwhelmingly non-unionized fields such as engineering, law, and academia that emphasized the meritocratic principles of expertise and advancement through individual skill — principles some saw as antithetical to trade unionism.\nThis rejection of the social-democratic ideal of collective bargaining did not entail a rejection of liberalism. The engineers, scientists, academics, and other professionals who moved to the kind of suburban clusters of which Boston’s Route 128 is an archetype often defied the typical postwar image of the conservative, white, middle-class suburbanite who actively opposed civil rights and integration. Residents in these affluent, highly educated communities supported, and often organized, around civil rights issues.\nThey tended, however, to advocate for causes such as fair housing, which was premised on the meritocratic ideal that anyone with means deserved the right to live where they chose. They favored policies that created “equal opportunity” and fostered “individual rights,” instead of those designed to eradicate the structural underpinnings of racial segregation and economic inequity. In fact, these liberal suburbanites often opposed construction of low-income housing in their own communities. And many refused to support metropolitan school integration, which was anathema to their abstract faith in equality of opportunity and posed a potential threat to their property values and children’s education.\nBy the late 1960s and early 1970s, the priorities of suburban knowledge workers were beginning to receive a stronger hearing from Democratic politicians — especially George McGovern. While Richard Nixon’s rout of McGovern in the 1972 presidential election often serves as a symbol of the party’s disarray following the tumult of the late 1960s, the South Dakota senator was one of the first Democrats to recognize the burgeoning clout of this constituency and the larger changes in the power balance of the party.\nThis awareness emerged, in part, from McGovern’s role overseeing reforms to the Democratic Party’s delegation selection process following the 1968 election. The McGovern–Fraser Commission established a set of guidelines designed to promote the fair representation of minority views and ensure that elected officials, party regulars, and union leaders in smoke-filled backroom dealings could no longer dominate the delegate selection process.\nSome scholars have suggested these changes contributed to the fragmentation of labor’s political voice, and ended union leaders’ role as kingmakers and power brokers in Democratic Party politics (as exemplified by AFL-CIO leader George Meany; other unions, such as the UAW, supported the reforms). These changes exacerbated tensions between Democratic politicians and segments of organized labor, with Meany’s AFL-CIO deciding not to endorse McGovern. It simultaneously gave postindustrial professionals more political sway.\nIn his bid for the presidency, McGovern engaged in concerted outreach to engineers and other science-based professionals. He backed it up with targeted policies, calling for research and development spending to concentrate on improving the environment, schools, and technology sectors (especially small start-ups) instead of on defense.\nThe appeals worked. McGovern was the first Democratic presidential candidate to do better with white-collar than blue-collar voters, winning 42 percent of knowledge professionals around the country and making considerable gains in affluent suburbs. A precursor to the New Democrats’ approach and platform, the 1972 election marked a key moment in the movement of the party’s center of gravity away from its traditional urban union base and toward professional-class suburbanites.\nIn the subsequent years, Democratic politicians increasingly refined McGovern’s strategy. Leading this pack was the cohort of Democratic politicians known as the “Watergate Babies,” which included California governor Jerry Brown, Colorado senators Gary Hart and Tim Wirth, and Massachusetts congressman Paul Tsongas and the state’s governor Michael Dukakis.\nThese politicians had all earned the support of a white suburban base through issue-oriented, reform-minded platforms, and all sought to distance themselves from the “old politics” of the New Deal. Their shared platform combined liberal stances on foreign policy, civil rights, feminism, and especially the environment, with a commitment to stimulating entrepreneurship and private-sector growth.\nIn the 1980s, with the increasing eclipse of the traditional New Deal base, many of the Watergate Babies began to place an even greater emphasis on the private sector — particularly the high-tech industry, earning them the label “Atari Democrats.”\nThe cohort expanded to include Tennessee senator Al Gore and Arizona governor Bruce Babbitt, who joined other Atari Democrats in touting the importance of public-private partnerships and developing better relationships between government and business, especially tech companies. While many of these tech-minded Democrats believed in extending opportunity, they thought market-based and privatized programs were more effective in the post-industrial economy than New Deal–style remedies. “The solutions of the thirties,” their mantra went, “will not solve the problems of the eighties.”\nThe focus on expanding the high-tech sector and keeping taxes low made the Atari Democrats popular among suburban professional voters. This approach, however, produced an economically and geographically uneven distribution of economic growth that privileged middle-class professionals and enhanced structural inequities.\nThe emphasis on creating jobs in high-tech companies and related service-sector businesses made employment overly dependent on the boom-and-bust cycles of the post-industrial economy. And though the high-tech industry did create a set of (generally non-unionized) jobs that paid well, these opportunities often demanded a high level of expertise, experience, and training.\nIn response, many critics charged that the party had abandoned the issues of class. Yet in championing the high-tech economy and individualist, suburban quality-of-life values, the Atari Democrats hadn’t jettisoned class politics. They merely advocated policies that reflected the class interests of the party’s rank-and-file base, which had shifted from autoworkers to knowledge workers.\nFew figures better personified the new orientation than Michael Dukakis. As Massachusetts governor, he made explicit overtures to the leaders of the high-tech sector, emphasizing partnership as central to fostering a healthy economic climate. His administration worked to broker deals between high-tech companies and Boston-based venture capital firms, leading to a surge of new software, data processing, and computer manufacturing corporations in the state, and helping turn around its economy.\nBy 1985, Massachusetts had the highest percentage of service-sector workers and the highest average per capita income of any state in the country. Dukakis, his supporters glowed, had created a “Massachusetts Miracle.”\nIn 1988, Dukakis rode the wave of high-tech growth to the Democratic presidential nomination, making the successful revival of the Massachusetts economy the centerpiece of his campaign. He coupled promises of stimulating high-tech growth across the country based on the Route 128 model with concern for quality-of-life issues like traffic and air pollution, sprawl, and rising drug and crime problems.\nThough he lost the election after being defamed in the infamous Willie Horton ad and derided as the “quintessential Massachusetts liberal,” his platform won him a following among white-collar professionals in the metropolitan areas of the Sunbelt, West, and Northeast. Four years later, the DLC’s golden boy, Bill Clinton, placed high-tech growth and suburban professionals at the forefront of his policy vision in his own presidential bid.\nThere they have remained there ever since. In presidential elections in particular, the emphasis on stimulating high-tech growth and expanding opportunity in order to win educated professionals persists as the linchpin of the Democratic Party’s electoral strategy. This approach, however, has further alienated lower-income voters, many of whom see no reason to turn out on Election Day. The result is an even larger income gap and class bias between nonvoters — who tend to be more supportive of unions and public spending on jobs and health insurance — and higher-income voters, who are less in favor of such positions.\nThese voting patterns, in turn, shape the strategy of the Democratic Party — ultimately amplifying the power of its affluent and educated voters. For instance, while the Obama campaign did make new voter registration a priority, it concentrated most of its attention and resources on gaining the support of upper-middle-class knowledge workers.\nIn both 2008 and 2012, in battleground areas like the suburbs of northern Virginia, Denver, and North Carolina’s Research Triangle, Obama routinely combined messages of equality of opportunity with promises of spurring high-tech employment and entrepreneurship, providing tax cuts to the middle class, and improving education.\nThroughout his presidency, he has often fused the ideals of meritocratic individualism with class-blind notions of equality of opportunity, stressing that the United States should uphold its founding ideals that promise “if you work hard and meet your responsibilities, you can get ahead, no matter where you come from, what you look like, or who you love.”\nThese statements mask the structural impediments that make such goals difficult to achieve for most poor and working-class Americans and demonstrate the distance of the Democratic Party’s message from the everyday realities of their lives. Yet such rhetoric has proven crucial to Obama’s popularity among knowledge workers in the suburbs and creative class enclaves across the country.\nIn both elections, Obama handily won areas with a high concentration of advanced degrees and secured the support of high-tech workers nationally by an overwhelming margin. He earned at astonishingly high rates the votes and campaign contributions of workers at companies like Google and Microsoft, building on the relationships forged between tech companies and the Democratic Party.\nWhile in office, Obama developed close and personal ties with many of Silicon Valley’s leading tycoons, routinely giving his ear to figures like LinkedIn’s Reid Hoffman, a well-known promoter of entrepreneurship and Internet-based networks as solutions to the country’s economic woes.\nIn her 2016 campaign bid, Hillary Clinton has strengthened these ties, surpassing candidates from both parties in individual donations from employees at the ten highest-grossing companies in Silicon Valley, including Google, Facebook, Apple, and eBay. Yet these relationships are proving increasingly tricky to navigate. Many Americans no longer see Silicon Valley as a symbol of opportunity and democracy but instead as a bastion of elitism.\nThis attitude has contributed to the success of Bernie Sanders’s bid. Sanders has placed the issue of wealth inequality at the center of the Democratic Party’s agenda for the first time in generations. Still, while Sanders’s populist platform and stump speeches express support for organized labor, it is educated professionals (or aspiring professionals) — not blue- and pink-collar workers — who have mostly turned out at his rallies and donated to his campaign. [Editor’s note: Recent evidence suggests Sanders is attracting low-income voters in greater numbers.]\nWhether Sanders’s candidacy constitutes the beginning of a lasting resurgence of economic progressivism in the party remains to be seen. But what is certain is that the class base of the Democratic Party will continue to shape its policies and commitments. As it stands, the Democratic Party is much more than a repository of liberal values. It’s a party that consistently favors its upper-middle-class base in both presidential campaign platforms and its governing agenda.\nThose committed to transformative change, then, should be skeptical of the Democrats’ ability to deliver more than tepid reforms without a substantial shift in the party’s class composition. A party without a working-class core can’t be expected to improve the prospects of the working class.", "url": "https://www.jacobinmag.com/2016/02/geismer-democratic-party-atari-tech-silicon-valley-mondale"}