{"authors": ["Chris Stanley"], "date_download": "2020-05-04 20:25:44", "date_modify": "2020-05-04 20:25:44", "date_publish": "2017-03-11 05:18:04", "description": "Statesboro had a shot to record their first series sweep of the young baseball season Friday night, but their gloves had other things in mind.Seven errors ultimately doomed the Blue Devils in a...", "filename": "_f91a55809539408dbc59a294b401f8dc_1588623944.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f91a55809539408dbc59a294b401f8dc_1588623944.html", "title": "Statesboro comeback falls short in spite of seven errors", "title_page": "Statesboro comeback falls short in spite of seven errors", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Statesboro had a shot to record their first series sweep of the young baseball season Friday night, but their gloves had other things in mind. Seven errors ultimately doomed the Blue Devils in a 9-8 defeat to Richmond Hill at Mill Creek Park. Statesboro hit the ball just as many times as Richmond Hill did, but it was the Blue Devil’s play in the field that gave Richmond Hill the upper hand. “We were just too sloppy defensively tonight to win,” said head coach Jim Simmons. “That being said I was proud of how we battled back.” Of the four pitchers Statesboro threw out, it was Dylan Ross who got the shortest end of the stick when it came to his defense falling short of the mark. Ross — who came in relief of Ty Tidick after two innings and four runs given up — saw five runs go across the plate and not a single one of them earned. That’s not to say Ross didn’t put himself in a hole early by hitting two of the first three batters he saw in the top of the third inning. But it was the third inning where the errors really started to take their toll on Ross. The fourth batter of the inning hit a hard ball right back up to Ross, who couldn’t handle the comebacker and loaded the bases with one out. Ross would walk Richmond Hill’s first run of the inning home to make it 5-2 Wildcats, then two more singles would make it 7-2 before Dyaln Irizary would throw a runner out at home to end the frame. “Ross was solid in spots tonight, overall our pitching was fine,” Simmons said. “I think Tidick knows who could have been better in spots, but overall they didn’t lose us the game.” The first three plate appearances in the next inning for Ross went as follows: strikeout, error at first base and a three-pitch single to right field. A handful of wild pitches and another error at shortstop brought in two more runs to put Statesboro down 9-2 in just three and a half innings. But Statesboro did their part in trying to fight back into the game. They responded to Richmond Hill’s fourth inning two-spot with a three-run effort, spurred by some timely hitting by Tidick and Ross. After starting the inning with a strikeout, Blake Stanford and Justin Ricketts would both reach base via walk and Davis Wiggins would load the bases on a single. That allowed Tidick to score Stanford ona single then Ross an out later to score Ricketts and Wiggins after a booted ball by Richmond Hill shortstop Rick Mitchell. “I was really happy at how we battled back tonight,” Simmons said. “It says a lot about our team that we could commit that many blunders in the field and only lose by a run.” But perhaps even worse than the seven errors was the bottom of the sixth inning, where even as those errors had held them back Statesboro had a chane to take the lead. Down 9-6, Austin Daniels would lead off the inning with a four-pitch walk to see Ross hit a deep ball to left-centerfield for a double and cut the lead to 9-7. Ross, who had advanced to third on the throw, saw the bases load up when Cam Harvey and Irizary walked following the first out of the inning. Alas, Statesboro would leave the bases loaded after Richmond Hill pitcher Tyler Harrison struck out the next two hitters to end the inning and the Statesboro threat. “I think we know there were some spots where mentally we could have been stronger,” Simmons said. “But we won the series, and that’s what we can take home this week.” Wiggins led Statesboro with a perfect 4-4 night and a walk to boot, scoring a run and driving in another in the process. Tidick would drive in two runs while Ross and Ricketts would each notch RBI as well. Statesboro (5-7) will face Effingham County in a three game series next week, starting Monday in Springfield at 6:00 p.m.", "url": "https://apnews.com/f91a55809539408dbc59a294b401f8dc"}