{"authors": ["Olivia Vanni", "Inside Track"], "date_download": "2020-05-04 20:14:04", "date_modify": "2020-05-04 20:14:04", "date_publish": "2017-08-24 05:38:12", "description": "Famed singer and Berklee alum Charlie Puth held an intimate performance in town yesterday and he had plenty to share about his good ol’ college days in Boston. As part of 103.3 AMP Radio’s...", "filename": "_40e60e95d793429da99ed0a8a10978ff_1588623244.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_40e60e95d793429da99ed0a8a10978ff_1588623244.html", "title": "Waxing poetic about ‘bougie’ Boston days", "title_page": "Waxing poetic about ‘bougie’ Boston days", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Famed singer and Berklee alum Charlie Puth held an intimate performance in town yesterday and he had plenty to share about his good ol’ college days in Boston.\nAs part of 103.3 AMP Radio’s On Location With Charlie Puth, the talented musician wooed the predominantly preteen crowd with acoustic renditions of his hits “We Don’t Talk Anymore” — sans Selena Gomez — “One Call Away” and “Attention” at the Hard Rock Cafe.\nWhat really caught our attention, though: His anecdotes from his years of living on the corner of Mass Ave. and Comm. Ave.\n“When I was feeling bougie, I’d like to go next door to where I used to live, Uni,” he told TJ Taormina, Loren Raye and Producer Matt from the station’s “The TJ Show” while onstage.\n“There’s Boloco burrito, which is a delicious option,” Puth said. “There’s B.Good, which was when I was trying to feel a little healthy. … There used to be a McDonald’s where the old Berklee is and now that’s gone. I’m glad they got rid of that McDonald’s, because they were serving apple pies from like 1992.”\nIn terms of bars, Puth recalled a lot of activity on the Boylston stretch. Although he reminisced about the flocks of folks amassing outside Whiskey’s. His old haunts were of more elevated taste.\n“Back Bay Social Club,” he said. “For me and my bougie self, it was the Mandarin Oriental, having some Japanese cuisine with some sak-ayyy.”\nNo frat basements or smell of stale beer for this guy. And unlike many imbibers in that part of town, Puth maintains he never got sloppy. Well, almost never.\n“There was only one time,” he laughed, “when I was at Shaw’s at three o’clock in the morning eating doughnuts.”", "url": "https://apnews.com/40e60e95d793429da99ed0a8a10978ff"}