{"authors": ["David Cloninger"], "date_download": "2020-05-04 20:24:24", "date_modify": "2020-05-04 20:24:24", "date_publish": "2017-09-15 17:45:00", "description": "COLUMBIA — Chris Lammons holds the sour distinction like many others at South Carolina. Four years, three losses to Kentucky, one chance left. At least he knows why the Gamecocks lost, and...", "filename": "_572d8b1e47c84d35966a616c1b89b120_1588623864.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_572d8b1e47c84d35966a616c1b89b120_1588623864.html", "title": "How can the Gamecocks stop a three-game losing streak to Kentucky? Stop the run", "title_page": "How can the Gamecocks stop a three-game losing streak to Kentucky? Stop the run", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "COLUMBIA — Chris Lammons holds the sour distinction like many others at South Carolina. Four years, three losses to Kentucky, one chance left.\nAt least he knows why the Gamecocks lost, and what he and his teammates have to do to take advantage of that last chance.\n“Just got to make tackles. Open-field tackles are going to be there,” he said. “Just got to make sure you get the guy on the ground.”\nLammons repeated himself.\n“We got to make tackles.”\nResidual effects. One more made tackle in any of the last three games against the Wildcats, there may not be this first-of-its-kind losing streak.\nBehind 38-24 with 11:45 to go in 2014, Kentucky almost exclusively ran the Wildcat formation with JoJo Kemp in the fourth quarter. Kemp carried 14 times among Kentucky’s final 19 plays, so tired his teammates had to pick him off the ground and steady him behind center, and yet USC still couldn’t stop him.\nFinal score: Kentucky 45, USC 38.\nKentucky didn’t run until it had to a year later, since it led USC, 24-7. Yet when the Gamecocks got within a score, the Wildcats turned to Stanley “Boom” Williams, who got three yards on second-and-2 late in the game, then ripped a 25-yard burst to put Kentucky in kneeling territory.\nFinal score: Kentucky 26, USC 22.\nLast season, the teams were tied at 10 at the end of the third quarter when freshman running back Benny Snell stepped up for Kentucky. He got the ball 14 times among Kentucky’s last 22 plays (quarterback Stephen Johnson rushed the others).\nFinal score: Kentucky 17, USC 10.\n“Last year, this is a team that we could not stop the run,” coach Will Muschamp said. “Last year, they bled us out in the fourth quarter and we could not run the ball effectively at all.”\nThe Wildcats will doubtless try to do it again Saturday. Why wouldn’t they, when it’s nearly the sole reason why they’ve won three straight? Plus, it’s what they’re good at — Kemp and Williams are gone but Snell and Johnson are back. Combined with Sihiem King, Kentucky is averaging 142.5 rushing yards per game and allowing a scant 58.5.\nThere are circumstances. Kentucky has played Southern Miss and Eastern Kentucky, one at home. Snell bruised his ribs against EKU last week and will play, but may not be 100 percent effective. And while Kentucky has employed the Wildcat formation, they’re not married to it.\n“We might not be a wildcat team. We might not run wildcat ever again,” offensive coordinator Eddie Gran said. “Sometimes it’s good for you in a year. Sometimes it’s not.”\nThe Gamecocks were gashed by Missouri’s zone-read runs last week, but much like the N.C. State, the opponent’s overall offensive production didn’t turn into points. USC’s offense has the capability to hurt Kentucky with the pass to open up the run, and the Wildcats’ miserable kickoff return defense has to be plenty nervous about facing goal-line stalker Deebo Samuel.\nUSC knows, though, that if it’s going to improve to 3-0, 2-0 in the SEC and snap the losing streak, it comes down to one word, one mission.\nTackle.\n“We’re playing blocks much better. I think we’re a stronger front seven than we were a year ago,” Muschamp said. “We got pushed around last year.”", "url": "https://apnews.com/572d8b1e47c84d35966a616c1b89b120"}