{"authors": ["Stephen Harris"], "date_download": "2020-05-04 20:17:30", "date_modify": "2020-05-04 20:17:30", "date_publish": "2017-02-24 06:37:00", "description": "LOS ANGELES — The Bruins prospects for success last night didn’t seem all that great, for myriad reasons. But the B’s mustered a terrific bend-don’t-break performance against the tough and...", "filename": "_951a7a723feb45efb56540f5910b5186_1588623450.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_951a7a723feb45efb56540f5910b5186_1588623450.html", "title": "Bruins knock off Kings to end California swing on high note", "title_page": "Bruins knock off Kings to end California swing on high note", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOS ANGELES — The Bruins prospects for success last night didn’t seem all that great, for myriad reasons.\nBut the B’s mustered a terrific bend-don’t-break performance against the tough and talented Kings, earning a gutsy 4-1 victory for their second win in three games in California.\nThe B’s cinched their very impressive win when Dominic Moore (No. 9) hit an empty net with 1:02 left. David Krejci (15) added a second empty-netter with 7.2 seconds to go.\nBackup goalie Anton Khudobin (27 saves) was a busy man all night and played extremely well. He also had some luck, with three Los Angeles shots ringing posts. After 40 minutes, the Kings had a 55-36 edge in total shot attempts (CORSI) — a good indicator that they had the puck a lot and plenty of shots.\nBut the B’s hung on gamely in a lopsided second period, then returned to a more aggressive, tighter defensive approach in Period 3 to lock down the win. LA managed only three shots in the third.\nBrad Marchand (No. 26) and David Pastrnak (26) scored the first two B’s goals.\nThe Kings had a significant advantage in that they’d had a day off at home Wednesday, while the Bruins — 2,500 miles from home — suffered a tough, emotional loss in Anaheim. But the play was fairly even in the opening 20 minutes, with the teams tied 1-1 at the first intermission.\nThe first scoring play began with Marchand skating a puck out of the B’s zone. As he moved up the right wing boards, he was hooked from behind by LA defenseman Jake Muzzin, incurring a delayed penalty. With the ref’s arm raised, Marchand carried to the right faceoff dot and snapped a perfect forehander past goalie Peter Budaj on the shortside — not a great goal for the veteran to allow.\nMoore was in the box at 18:12 when the Kings knotted the score. On the play, Khudobin gave up a dangerous rebound on Alex Martinez’ left point shot. LA’s Adrian Kempe collected the rebound left of the net and fed a quick cross-ice pass to rookie Kevin Gravel, who scored from the right circle for his first NHL goal.\nIt appeared the B’s reclaimed the lead with 1:03 left in the period, when Krejci, on the right side of a 2-on-1, fed a pass across and rookie winger Peter Cehlarik swept in what would have been his first NHL goal. But a coaches’ challenge revealed that Pastrnak was off-side moments earlier, so the goal came down.\nPastrnak had a power-play goal disallowed in Anaheim Wednesday because of goalie interference by Marchand. But he got one that counted at 4:43 of the second. On this one, Ryan Spooner displayed great patience as he held the puck in the right circle — finally spotting a crease and firing a pass cross-ice to Pastrnak in the left circle. He let go a one-timer … but his stick shattered as he shot. So the puck went to the net at half-speed, and that seemed to fool Budaj, who allowed it to slip between his pads, giving the B’s a 2-1 lead.\nWith a prime front row view of the style of hockey being played by the Bruins under Cassidy, goalie Tuukka Rask believes the team, aside from the problems in Anaheim, has done a pretty good job of adapting a slightly more offensive approach while maintaining a solid defensive structure.\n“Yeah, it has,” Rask said. “I was talking to somebody about this the other day. It looks like we’re playing pretty happy hockey. Guys are moving and skating and trying to create a lot of offense.\n“But they’re also keeping in mind that coming back into the defensive zone is also a priority.\n“The first three games we won (under Bruce Cassidy) we generated a lot of offense and lot of goals. As long as we can keep the feet moving and the puck moving — and also remember the defensive play — we’ll be fun to watch.”\nRask sees a trend in the NHL of teams trying to open up, to play fast and generate lots of shots.\n“This is what a lot of teams now are trying to accomplish,” he said. “You obviously want to score a lot of goals. The game is so fast and the guys are so fast, you don’t want to handcuff them. You want to let them play with their abilities and try to create offense.”\nYet Rask knows very well that offense is often less of a deciding factor in playoff hockey than solid team defense — the ability to check opponents tightly and win close, low-scoring games.\n“That’s true,” he said. “As the season winds down and points become more important, we’ll see a lot of what we saw in (the 2-1 win in) San Jose: A low-scoring game. You have to be able to play against the big and heavy teams and win the puck battles. You definitely have to be able to win those games.”", "url": "https://apnews.com/951a7a723feb45efb56540f5910b5186"}