{"authors": ["John Nickerson"], "date_download": "2020-05-04 20:26:01", "date_modify": "2020-05-04 20:26:01", "date_publish": "2017-03-11 02:56:31", "description": "STAMFORD — A jury on Friday returned what could be the state’s largest civil award in a child sexual abuse case. Elizabeth Spalter was awarded $20 million in a civil suit in which she...", "filename": "_2b66c8f87e9942979ba2a0178d5cbf2a_1588623961.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2b66c8f87e9942979ba2a0178d5cbf2a_1588623961.html", "title": "$20 million awarded in Stamford child sex abuse case", "title_page": "$20 million awarded in Stamford child sex abuse case", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STAMFORD — A jury on Friday returned what could be the state’s largest civil award in a child sexual abuse case.\nElizabeth Spalter was awarded $20 million in a civil suit in which she claimed her father sexually abused her for years at the family’s summer home in Shippan when she was a child.\nThe jury awarded Spalter $5 million in emotional distress and mental anguish, $5 million for psychological injuries, $3 million for permanency of injuries and $2 million for loss of life’s activities. She was also awarded $5 million in punitive damages, according to her attorney Eric Reinken, who tried the case with New York City attorney Michael Dowd.\nReinken said he was told the award could be the largest in state history to a survivor of child sexual abuse.\n“I felt the jury was very brave to provide justice not just for me, but in doing so, acknowledged all the victims of child sexual abuse and holds perpetrators accountable,” Spalter said.\nSpalter, a social worker now living in Vienna, Austria, testified over three days how she was abused hundreds of times by her father, Harold Spalter, a former captain in the U.S. Air Force and distinguished eye doctor at Columbia-Presbyterian Medical in New York City.\nSpalter said her father, who died in 2014 at the age of 84, assaulted her many times in the family’s summer home on Van Rensselear Avenue in Shippan between 1975 and 1986 when she was 6 to 17 years old.\nSpalter, who specialized in surgical retinal disease and was a member of Columbia’s faculty from 1962 to 2009, owned the Van Rensselaer Avenue home for 20 years before selling it in 1997. The family’s main residence was in New York.\nThe assaults led to symptoms of post traumatic stress disorder, Spalter testified.\n“I wouldn’t have had the strength and the courage to speak out without all the support of the other survivors, who also had the bravery to overcome the shame and secrecy that surrounds child sexual abuse,” Spalter said.\nSpalter, who never reported the assaults to the police, filed the lawsuit against her father’s estate, which was worth millions when he died. Spalter’s stepmother, Diane Rogers Spalter, is the executrix of the estate.\nDefense attorney Courtney George questioned Elizabeth Spalter’s credibility during her closing statements on Thursday even though the woman’s brothers testified they grew up in a “house of horror.”\nGeorge and co-counsel David Zabel did not respond to requests for comment Friday evening.", "url": "https://apnews.com/2b66c8f87e9942979ba2a0178d5cbf2a"}