{"authors": ["David Wren"], "date_download": "2020-05-04 20:31:21", "date_modify": "2020-05-04 20:31:21", "date_publish": "2017-09-13 18:15:00", "description": "Boeing Co. will boost the number of Dreamliners it makes each month to 14 beginning in 2019 based on the strength of current orders, a nearly five-year production backlog and global airlines' need...", "filename": "_efe5e34ab6154e5fa72df8935fe5cef1_1588624281.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_efe5e34ab6154e5fa72df8935fe5cef1_1588624281.html", "title": "Seeing strong demand, Boeing announces boost in 787 Dreamliner production", "title_page": "Seeing strong demand, Boeing announces boost in 787 Dreamliner production", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Boeing Co. will boost the number of Dreamliners it makes each month to 14 beginning in 2019 based on the strength of current orders, a nearly five-year production backlog and global airlines’ need for replacement wide-bodies, the aerospace giant said Wednesday.\n“This is an important step for us and another signpost of the strength of the marketplace,” Dennis Muilenburg, Boeing’s president and CEO, said during a Morgan Stanley analysts conference in Laguna, Calif.\nThe production increase will be split between Boeing’s assembly plants in North Charleston and Everett, Wash., but Muilenburg did not say how many Dreamliners each specific campus will produce. The current production rate is 12 per month split between the two sites.\nMuilenburg said the company also plans to add 100 airplanes to the total needed to erase the roughly $28.6 billion in deferred production costs the Dreamliner program amassed before it started to turn a profit in the fourth quarter of 2015. Boeing will now spread those costs over 1,400 Dreamliners, which means greater per-plane profits but a longer paydown.", "url": "https://apnews.com/efe5e34ab6154e5fa72df8935fe5cef1"}