{"authors": ["Barry Scanlon", "Bscanlon Lowellsun.Com"], "date_download": "2020-05-04 20:17:02", "date_modify": "2020-05-04 20:17:02", "date_publish": "2017-12-31 12:01:48", "description": "Hockey teams skating around Boston ice with championship hardware. A pitcher starring in the Major League Baseball playoffs. Another local pitcher just getting his professional career...", "filename": "_a31c4c10aa4a41bf9ab7443b2adeb215_1588623422.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a31c4c10aa4a41bf9ab7443b2adeb215_1588623422.html", "title": "Year's Top Local Sports Stories", "title_page": "Perfect 10: Year's Top Local Sports Stories", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Hockey teams skating around Boston ice with championship hardware.\nA pitcher starring in the Major League Baseball playoffs. Another local pitcher just getting his professional career started. Runners who refused to be defeated by knee-buckling heat. A golf champion who beat all comers before she entered seventh grade.\nYeah, 2017 was a pretty memorable year for area athletes.\nBefore we get to our Top 10 list, we would be remiss if we didn’t wish happy retirements to Phil Maia (34 years as Lowell High’s cross country/track coach), Jack Hassett (33 years as Mt. Pleasant Golf Club’s superintendent) and Leo DiRocco (28 years as Tewksbury High’s softball coach).\n10. Mr. October\nTewksbury native Scott Oberg had an up-and-down 2017 season with the Colorado Rockies.\nThe former Tewksbury High right-handed pitcher turned his season around with a terrific September, a month in which he posted an ERA of 2.25 and struck out 13 batters in 12 innings. When Colorado surprisingly made the National League playoffs, Oberg made the roster.\nThe Rockies lost the one-game playoff to Arizona, 11-8, but Oberg turned plenty of heads in his postseason debut. Taking over in the second inning with the Rockies already on the ropes, Oberg stared down from the mound and Diamondbacks slugger Paul Goldschmidt stared back. Relying mainly on a blazing fastball, Oberg struck out Goldschmidt and then fellow slugger J.D. Martinez to get the Rockies out of the inning.\n9. Gutsy streakers\nMother Nature wasn’t kind to the runners who toed the starting line of the Boston Marathon in April.\nBy they time they reached the midway point, temperatures had soared into the upper 70′s. But nothing would deter six local runners who are members of the Boston Marathon’s Quarter Century Club for completing at least 25 consecutive races.\nLeading the local charge was Carlisle’s Ronald Kmiec, 74, who completed his 44th consecutive Boston. Only three men have longer streaks. Also extending their streaks were Westford’s Gerard Ottaviano (No. 34), Westford’s Scott Graham (31) and Townsend’s Brian Crane (29). It wasn’t easy, but they all crossed the finish line on Bolyston Street.\n“At mile seven I was already going into survival mode,” Crane said.\n8. Pre-teen queen of the Cities\nA Smith winning a City golf tournament isn’t earth-shattering news. Usually it’s Phil Smith, an eight-time Lowell Men’s Tournament champion.\nOn July 15, at Nabnasset Lake CC In Westford, the Smith making news was his 12-year-old daughter Molly Smith, who captured her first Women’s City Golf Tournament title. Showing poise well beyond her years, Smith parred the second playoff hole to defeat Nab’s Sophie Flabouris and Vesper’s Jessica Hughes.\nSmith, who shot an 80 over the opening 18 holes, made sure she had a story to tell her seventh-grade classmates when they returned to school. Can she match her dad’s eight titles? Time will tell.\n7. Armed for baseball success\nAs a Westford Academy sophomore, Matt Tabor stood 5-foot-4 and weighed 130 pounds. A pro baseball career did not seem realistic. But Tabor, who transferred to Milton Academy, took off during his senior season.\nHe went 4-0 and struck out 65 batters in 35 innings.\nThe Arizona Diamondbacks took notice of the kid throwing 90-plus miles per hour. They made Tabor the first player selected with New England roots when they picked the pitcher in the third round, 82nd overall, in June’s entry draft. Tabor, now 6-2 and 170 pounds, was headed to his commitment at Elon University when the Diamondbacks signed him to a deal reportedly worth $1 million.\nThe Massachusetts Gatorade Player of the Year began his pro career with an Arizona minor league team.\n6. Oppenheim is back on the Tour\nRob Oppenheim won the Long Meadow Junior club championship way back in 1998 and lost in a City Tournament playoff a few years later. Now he’s a card-carrying PGA Tour member for the second time in three years.\nOppenheim, a 38-year-old Andover native, has lived life on golf’s bubble the past few years. He earned his PGA Tour card on the final day of the 2015 season by the amount of a putt, lost it in 2016 when a hurricane washed out his final event, and got it back this past fall when he nearly won his second Web.comTour event and easily made the top 25.\nHe played in a few events in the Tour’s wraparound 2018 season last fall and will resume his year in interest next week at the Sony Open in Hawaii. Nice work if you can get it.\n5. Big bucks for Jack Eichel\nWhen Jack Eichel skated on the ponds near his North Chelmsford home, the youngster likely never dreamed he’d make his living playoff hockey.\nBut Eichel, at the tender age of 20, became one of the National Hockey League’s highest-paid players after months of negotiations with the Buffalo Sabres. The second pick in the 2015 draft signed an NHL-maximum deal to remain with the Sabres.\nThe contract, which kicks in next season, is for eight years and $80 million. Despite playing on the NHL’s lowest-scoring team, Eichel continues to average nearly a point a game. Eichel, who won the Hobey Baker award as a Boston University freshman, is the face of Buffalo’s franchise for a long time to come.\n4. Double vision on the trails\nNo other cross-country program in Massachusetts has ever captured both the boys and girls Eastern Mass. Division 1 championships in the same year -- expect for Lowell High.\nThe Red Raiders, who accomplished the feat in 2012 and 2013, did it again in Wrentham in 2017. The Lowell boys collected 66 points to easily defeat runner-up Newton North (101). The girls earned 72 points to top runner-up Lexington (94).\nLowell residents see packs of runners hitting the streets all summer. Belvidere, the Highlands, Centralville, Pawtucketville, the Acre. It doesn’t matter the neighborhood -- Lowell runners pay the price in the summer to rule in the fall.\n3. Championship Crusaders\nIn their first season, the Lowell Catholic High School boys hockey team had to have a handful of students from next-door St. Margaret School in order to have enough players to field a team.\nFast forward nine years to a March day at the TD Garden when the Crusaders skated around the ice as Division 2 state champions after a tense 5-4 victory over Scituate. Alex Graves cemented his name in Lowell Catholic lore when he scored with 1:06 left to snap a 4-4 tie. Nathan Donaldson, who set up the game-winning goal, finished with a goal and two assists.\nLed by Tom Curran, Lowell Catholic’s coach since the program’s inception, the Crusaders recorded a 20-2-2 record.\n2. Mr. Dracut dies at the age of 97\nThere are legends and then there are legends.\nOn Feb. 2, the Merrimack Valley lost one of its finest coaches -- and people -- when Ed Murphy passed away at age 97.\nHe coached baseball and basketball at Dracut High. He also helped form the first track team in DHS history in 1960. But it was on the football gridiron that the Murphy legend was born. In 48 seasons -- yes, 48 seasons -- Murphy guided the Middies with excellence and class.\nHe led Dracut onto the field 438 times. He posted a 247-175-16 record and 104 of the wins came via shut-outs. He won a number of league titles and the Eastern Mass. Super Bowl in 1988.\n1 . The Bosses of Boston\nWith chants of “UML! UML! UML!” ringing throughout the TD Garden in Boston, the UMass Lowell hockey team held off Boston College, 4-3, to capture the Hockey East playoff championship before 12,309 fans.\nIncredibly, it was the fifth straight Hockey East championship game appearance for coach Norm Bazin’s boys and the narrow victory over BC was the third playoff title for UMass Lowell in the last five years.\n“I think the guys like playing here,” Bazin said of his program’s dominance in Boston.\nTyler Wall, who made 38 saves, then shut out Cornell, 5-0, in the NCAA Tournament. Alas, with the Frozen Four in their sights, the River Hawks fell just short when Notre Dame scored in overtime to hand them a painful 3-2 defeat.\nFollow Barry Scanlon on Twitter@BarryScanlonSun", "url": "https://apnews.com/a31c4c10aa4a41bf9ab7443b2adeb215"}