{"authors": ["Jovan Alford"], "date_download": "2020-05-04 20:23:50", "date_modify": "2020-05-04 20:23:50", "date_publish": "2017-10-19 20:54:00", "description": "Blac Chyna is suing the Kardashian-Jenner family. Rob Kardashian's ex-fiance filed a lawsuit Tuesday in Los Angeles Superior Court, claiming the famous family interfered with a potential...", "filename": "_67e3ce10e1154560bd0d7f0788a86d47_1588623830.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_67e3ce10e1154560bd0d7f0788a86d47_1588623830.html", "title": "Blac Chyna sues Kardashian family for 'slut shaming' her", "title_page": "Blac Chyna sues Kardashian family for 'slut shaming' her", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Blac Chyna is suing the Kardashian-Jenner family.\nRob Kardashian’s ex-fiance filed a lawsuit Tuesday in Los Angeles Superior Court, claiming the famous family interfered with a potential second season of her E! reality show, “Rob & Chyna” after the couple’s contentious split last year.\nChyna, whose legal name is Angela White, claims the family “defamed” her in an effort to “destroy” her career. She also claims she experienced “personal, professional and financial harm” as a result. Chyna is asking for unspecified damages.\nThe former couple began dating in January 2016 and got engaged four months later. The couple announced their pregnancy in May of that year, but by the end of 2016, their relationship was over. They reached a custody agreement in September over their only child together, 11-month-old Dream Kardashian.\nThe complaint includes a blow-by-blow of the couple’s numerous spats, some of which played out on social media and was widely covered by the entertainment press. The lawsuit mentions a feud that took place over the summer when Kardashian took to Instagram to post nude pictures of Chyna along with disparaging messages about her. This led to the suspension of his Instagram account, which the lawsuit said had about 9 million followers at the time.\n“Slut-shaming is wrong. Revenge porn is illegal,” Lisa Bloom, Blac Chyna’s attorney, said in a statement to CNN. “Proud to stand with Blac Chyna as she stands up for her rights. We are seeking accountability and justice. I am very confident we will be successful.”\nChyna is suing the Kardashian-Jenner family for defamation, interference with contractual relations and interference with prospective economic relations. Kim Kardashian, Khloe Kardashian, Kourtney Kardashian, Kris Jenner, Kendall Jenner and Kylie Jenner are all named.\nShe accuses Rob of physical abuse and distribution of private materials.\nCNN has reached out to the Kardashian-Jenner representatives for comment. –– (CNN)", "url": "https://apnews.com/67e3ce10e1154560bd0d7f0788a86d47"}