{"authors": ["Frank Garza Staff Writer"], "date_download": "2020-05-04 20:14:25", "date_modify": "2020-05-04 20:14:25", "date_publish": "2017-01-19 20:36:00", "description": "Brownsville artist Don Breeden has designed Charro Days posters for more than a decade now. It is not the painting of the poster that is difficult, but coming up with the idea in the first...", "filename": "_50ac7b2388b947bdb5ac2985493be723_1588623265.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_50ac7b2388b947bdb5ac2985493be723_1588623265.html", "title": "Charro Days unveils 80th anniversary poster", "title_page": "Charro Days unveils 80th anniversary poster", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Brownsville artist Don Breeden has designed Charro Days posters for more than a decade now.\nIt is not the painting of the poster that is difficult, but coming up with the idea in the first place.\nWhen he saw a photo taken by Miguel Roberts of the Brownsville Herald, he knew he had found his inspiration for the 80th anniversary poster.\n“We knew we wanted something special for the 80th anniversary. What kicked all of this off was the 1991 poster, the Four Horsemen, and so when I saw this photo, I said to myself: ‘There it is,’” Breeden said.\nThe poster depicts a rider rearing back on his horse amidst fireworks in the sky. In the yellow background, the Mexican flag and the U.S. flag are crossed.\nAt the poster unveiling Thursday morning, Lucy Escamilla, the president of Charro Days, Inc., said there would be so much for the community to look forward to in the coming weeks.\nFor Escamilla, no one particular event stands out as her favorite. She enjoys the festivities as a whole.\n“The camaraderie between Brownsville and Mexico, all the festivities taking place … I just love the festival,” Escamilla said.\nCharro Days, Inc. works year-round to put together Brownsville’s signature event. Many volunteer hours are poured into organizing everything, but Escamilla said it is worth it.\n“There’s just a feeling of being part of the Charro Days festivities. This event has been in Brownsville for 80 years and to be able to put it together after all that is an accomplishment,” she said.\nfgarza@brownsvilleherald.com", "url": "https://apnews.com/50ac7b2388b947bdb5ac2985493be723"}