{"authors": ["Jonah Walters", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:29", "date_modify": "2020-05-04 19:51:29", "date_publish": "2017-08-11 00:00:00", "description": null, "filename": "2017_08_trump-opioids-heroin-epidemic_1588621889.html", "image_url": "https://images.jacobinmag.com/2017/08/11145718/15910692553_58d6c7ebfe_k.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_08_trump-opioids-heroin-epidemic_1588621889.html", "title": "Ending the Opioid Crisis", "title_page": "Ending the Opioid Crisis", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe Portuguese communist José Saramago once imagined a plague sweeping through an otherwise functional society. In his novel Blindness, a mysterious contagion traverses an unnamed city in tendrils, striking citizens blind with no regard for social class or political disposition. The ailment metastasizes quickly. The first victim, blinded while he sits in traffic, explains to a throng of irritated strangers that he has “fallen into a milky sea.” An opthamologist, eager to get to the bottom of the outbreak, finds his research interrupted by a curtain that descends cruelly over his own eyes. A women awakens in a hotel room after exactly twenty-two minutes of rapturous sex, seeing nothing but mist. From there, the novel unfolds along a pretty standard dystopian trajectory — the afflicted are placed into camps, petty tyrants emerge from amongst the sequestered, and a callous government withdraws from its responsibilities, opting for authoritarianism over creativity. It’s less a meditation on illness than a sober warning about what can happen when social problems are placed outside the realm of politics, when fatalism forecloses the possibility of a positive solution. Blindness crossed my mind earlier this summer because, in the town I grew up in, there were thirty-six opioid overdoses in twenty-four hours. The next day, there were fifteen more.", "url": "https://jacobinmag.com/2017/08/trump-opioids-heroin-epidemic"}