{"authors": ["City Of Pocatello"], "date_download": "2020-05-04 21:09:00", "date_modify": "2020-05-04 21:09:00", "date_publish": "2017-05-09 16:38:00", "description": "POCATELLO - If you’ve been late planning what to do for mom this Mother’s Day, Zoo Idaho is here to help. Mother’s Day, Sunday, May 14 Zoo Idaho will offer half-price admission to moms when...", "filename": "_837a853dac164e9992e53a3cc3990175_1588626540.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_837a853dac164e9992e53a3cc3990175_1588626540.html", "title": "Zoo Idaho to host Special Mother’s Day, Endangered Species Day Events", "title_page": "Zoo Idaho to host Special Mother’s Day, Endangered Species Day Events", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "POCATELLO - If you’ve been late planning what to do for mom this Mother’s Day, Zoo Idaho is here to help.\nMother’s Day, Sunday, May 14 Zoo Idaho will offer half-price admission to moms when they are accompanied by a paying child. The zoo is home to more than 140 of Idaho and the Intermountain West’s native animals.\n“I can’t think of a better gift than a leisurely stroll with mom on the day that’s all about her,” said Rachael Shearouse, Curator of Education for Zoo Idaho.\nLater this month, Zoo Idaho along with the Idaho Department of Fish and Game, Idaho Museum of Natural History, U.S. Fish and Wildlife Service, and the Idaho State University Biology Department will join forces for an Endangered Species Day celebration.\nFriday, May 19 from 10 a.m. to 3 p.m. will feature interactive activities positioned around the zoo to help attendees learn about the different ways to help protect the endangered species in the Gem State. Zoo-goers will also be taking a look at the impact invasive species and humans have had on Idaho’s wilderness.\n“We’d like to invite schools, daycares, and youth groups to join us as we explore the unique wonders of our endangered species,” said Shearouse. “Small actions by individuals like you can add up to saving a species.”\nThe Endangered Species Day event is free with zoo admission and those looking to schedule a field trip are asked to call Rachael Shearouse at 208-234-6264 to schedule a time.\nZoo Idaho is open daily from 10 a.m. to 5 p.m. May 1 to September 4. General admission to the zoo is free for ages 0 to 2, $3.75 for ages 3 to 11, $5.75 for ages 12 to 59, and $4.50 for ages 60 and up.", "url": "https://apnews.com/837a853dac164e9992e53a3cc3990175"}