{"authors": ["Becky Kramer"], "date_download": "2020-05-04 20:13:14", "date_modify": "2020-05-04 20:13:14", "date_publish": "2017-11-12 00:00:00", "description": "Mayo Schmidt’s career with the Miami Dolphins ended when he realized he’d score more touchdowns in business than football. In 1980, Hydro One Ltd.’s future chief executive walked away from a...", "filename": "_84a29321015f4551967d75774da2ea35_1588623194.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_84a29321015f4551967d75774da2ea35_1588623194.html", "title": "Meet Mayo Schmidt, the former Miami Dolphin who leads Hydro One, the Canadian utility that’s buying Avista", "title_page": "Meet Mayo Schmidt, the former Miami Dolphin who leads Hydro One, the Canadian utility that’s buying Avista", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Meet Mayo Schmidt, the former Miami Dolphin who leads Hydro One, the Canadian utility that’s buying Avista\nMayo Schmidt’s career with the Miami Dolphins ended when he realized he’d score more touchdowns in business than football.\nIn 1980, Hydro One Ltd.’s future chief executive walked away from a three-year contract with the Dolphins to work in agribusiness. It was a weighty decision for a 22-year-old, Schmidt said, but one he’s never regretted.\nThe native Kansan later spearheaded ConAgra’s expansion into Canada and turned a struggling Saskatchewan wheat co-op into a global business valued in the billions of dollars.\nWhen the province of Ontario decided to sell off its government-owned electric transmission business in 2015, Schmidt was recruited to lead the new publicly traded company, Hydro One.\nNext week, Avista Corp.’s shareholders will vote on whether to approve Hydro One’s $5.3 billion purchase of Avista. The Nov. 21 shareholders meeting is a historic moment for the 128-year-old Spokane utility.\nScott Morris, Avista’s chairman and CEO, said the company has found the right partner in Schmidt and the Canadian utility he leads.\nWhile Schmidt is known for shaking up companies, Morris said, the Hydro One merger will help preserve Avista’s legacy in a changing utility industry.\nAs a wholly owned subsidiary of Hydro One, Avista will keep its corporate headquarters in Spokane while enjoying the advantages of being aligned with a larger utility, Morris said.\nSchmidt’s background – including his familiarity with the Northwest – was pivotal in the deal.\nHe’s “a wonderful man who shares our values,” Morris said when he introduced Schmidt to company employees in September. “He’s somebody that could absolutely work here at Avista.”\nAs North America’s utility industry consolidates, it’s no surprise that companies are looking to cross-border deals, Schmidt said. Hydro One wanted to grow, and most of the acquisition targets were in the U.S.\nDespite the 2,300 miles between Spokane and Hydro One’s headquarters in Toronto, “we share so much in common,” Schmidt said of the two utilities. “We have similar geography, talent, expertise and a strong customer focus.”\nTurnaround on the Canadian plains\nSchmidt, 60, is a dual U.S.-Canadian citizen. He spent part of his career working for General Mills in Montana, where he still owns a ranch. But his early roots are in the Midwest.\nSchmidt grew up on a family wheat and dairy operation in western Kansas. He was a wide receiver and running back at Washburn University, where he earned a business degree before his brief stint with the Miami Dolphins.\nPlaying professional football was a heady experience, Schmidt said, but pragmatism won out.\n“Even if I was successful at playing football for a number of years, I knew I’d have to go back, start over and compete with kids who were just graduating from university,” he said.\nDuring his 15 years at General Mills, Schmidt worked with farmers in six Western states, overseeing operations that loaded grain and other commodities into rail cars and transported the products to market.\nSchmidt later became president of ConAgra Grain’s Canadian operations. In 1999, a recruiting firm approached him about taking the top job at Saskatchewan Wheat Pool.\nThe farmers cooperative was a large handler of Canadian grain – purchasing wheat, oats and barley for domestic and overseas sales. But it was on the verge of bankruptcy. The cooperative had more than $1 billion in debt and was soon to be tested by several years of drought.\nSchmidt’s tenure at Saskatchewan Wheat Pool was the subject of an article in Harvard Business Review. Over a period of about 12 years, the cooperative became a publicly traded company, changed its name to Viterra and bought out competitors in Canada and Australia.\nSchmidt started the turnaround by selling off ancillary businesses owned by the cooperative, which included a chain of doughnut shops and a newspaper.\n“We had a historic company dating to 1924 that had fallen on difficult times,” Schmidt said. “The team restructured the company and the balance sheet to give it a strong financial foundation and the opportunity to grow.”\nIn 2012, Viterra was sold to Glencore, a Swiss-based commodity company, for $6.2 billion Canadian. At the time of the sale, Viterra’s workforce had quadrupled and it had operations in 14 countries.\nChosen to lead spinoff\nThe head of Toronto-Dominion Bank, whom Schmidt had worked with closely when he was head of Viterra, approached him about another turnaround opportunity.\nThe government of Ontario wanted to sell a majority interest in the transmission assets that delivered power to 1.3 million customers in rural and suburban areas of Ontario.\nHydro One was spun off as a publicly traded company in late 2015, with Schmidt as its chief executive. The company buys electricity and delivers the power to customers on its 95,000 miles of transmission and distribution lines.\nThe government of Ontario remains a minority shareholder in Hydro One, with a 49 percent ownership interest.\n“The government is a shareholder, but not an operator of the company,” Schmidt said. “They don’t get involved in daily operations.”\nSchmidt said there were parallels between Saskatchewan Wheat Pool and Hydro One. Both companies had strong positions in the marketplace, but weren’t achieving their full potential, he said.\nSince Hydro One was spun off into a publicly traded company, the executive team has been working to make the utility more responsive to customers’ needs, he said.\nFor companies to be successful, they need a “satisfied customer base that trusts the organization,” Schmidt said.\nHydro One was a supporter of Ontario’s “fair hydro plan,” which restructured electric rates for residential customers, lowering them by 25 percent. Low-income households and residents of remote communities were eligible for additional credits.\nLast year, Hydro One restored power to 1,400 families who had their electricity shut off for lack of payment, Schmidt said. The utility also supports programs that replace inefficient appliances with energy-saving models in low-income households.\nSchmidt inherited some challenges at Hydro One. The utility is the subject of a class-action lawsuit stemming from widespread problems with a billing system installed in 2013.\nAccording to the lawsuit, thousands of Hydro One customers received bills based on estimates for long periods and later received massive “catch-up” bills. Other customers had large amounts of money automatically withdrawn from their bank accounts by Hydro One without notice or explanation, the lawsuit says.\nSchmidt said the problems were resolved before he took over at Hydro One. The utility’s billing accuracy now exceeds 99 percent, he said.\nSchmidt said Avista customers will benefit from the alliance with Hydro One and the efficiencies of scale available to utilities with larger balance sheets.\n“The costs for maintaining and improving the system are extraordinary,” he said. “When we go to buy goods and services, we can negotiate better outcomes.”", "url": "https://apnews.com/84a29321015f4551967d75774da2ea35"}