{"authors": ["Brandon Foster Brandon.Foster Trib.Com"], "date_download": "2020-05-04 20:26:38", "date_modify": "2020-05-04 20:26:38", "date_publish": "2017-11-18 18:20:00", "description": "LARAMIE — Wyoming backup quarterback Nick Smith, a junior, started Saturday's game for Wyoming against Fresno State. Injured starter Josh Allen did not take the field Saturday for pre-game warmups...", "filename": "_13bd2d9325d244d0a89484dc013a4944_1588623998.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_13bd2d9325d244d0a89484dc013a4944_1588623998.html", "title": "Nick Smith starts in place of injured Josh Allen at quarterback for Wyoming", "title_page": "Nick Smith starts in place of injured Josh Allen at quarterback for Wyoming", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LARAMIE — Wyoming backup quarterback Nick Smith, a junior, started Saturday’s game for Wyoming against Fresno State. Injured starter Josh Allen did not take the field Saturday for pre-game warmups before the Cowboys’ noon game against Fresno State.\nAllen suffered a shoulder injury last week at Air Force and left the game after attempting one pass in the second half. His mother posted on Facebook that Allen had suffered an AC joint sprain. Allen did not practice on Monday, Tuesday or Wednesday. Head coach Craig Bohl said Wednesday he was hopeful Allen would return to practice Thursday, but media does not have access to Wyoming’s Thursday practices.\nAllen did come out in pads for Wyoming’s senior day introductions. He was the first player announced, though he is actually a junior. Allen has not yet formally announced whether he will leave for the NFL after the season. He has worn a baseball cap and a headset since the game began.\nSmith has completed three passes on five attempts this season, two in the second half of the Air Force game. He last started a game Nov. 7, 2015, against Colorado State, a 26-7 loss.\nAllen, the Mountain West preseason offensive player of the year, has completed 131 of 251 passes (56.2 percent) this season for 1,658 yards and 13 touchdowns. The projected first-round NFL Draft selection has started 24 straight games for Wyoming.\nThe Star-Tribune will continue updating this page as we find out more.", "url": "https://apnews.com/13bd2d9325d244d0a89484dc013a4944"}