{"authors": ["Kendal Rautzhan"], "date_download": "2020-05-04 20:24:30", "date_modify": "2020-05-04 20:24:30", "date_publish": "2017-07-19 19:02:00", "description": "In the book Angela's Ashes, author Frank McCourt wrote: \"He says, You have to study and learn so that you can make up your own mind about history and everything else but you can't make up an...", "filename": "_949325dfb618437f90b457ec6d1c49ff_1588623870.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_949325dfb618437f90b457ec6d1c49ff_1588623870.html", "title": "Reading expands the perspective of kids", "title_page": "Reading expands the perspective of kids", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In the book Angela’s Ashes, author Frank McCourt wrote: “He says, You have to study and learn so that you can make up your own mind about history and everything else but you can’t make up an empty mind. Stock your mind, stock your mind. It is your house of treasure and no one can interfere with it. If you won the Irish Sweepstakes and bought a house that needed furniture would you fill it with bits and pieces of rubbish? Your mind is your house and if you fill it with rubbish . . . it will rot in your head. You might be poor, your shoes might be broken, but your mind is a palace.” (page 208) It’s essential we help children develop as broad a perspective as possible and realize that their mind truly is their most valuable asset. Doing so will enable the child and emerging adult to make good choices, develop critical thinking, and overall enhance their life. One important avenue in achieving this is to read books that offer new ideas and perhaps challenge old ones, such as the books reviewed today. Dive in and help a child stock their mind.\nBooks to Borrow\nThe following book is available at many public libraries. “The Teddy Bear” written and illustrated by David McPhail, Henry Holt & Co., 32 pages Read aloud: age 4 and older. Read yourself: age 7 and older. When a little boy accidentally loses his beloved teddy bear, he is filled with despair. The teddy bear was heartbroken, too. Somehow he had wound up in a trash can. As the night wore on, the teddy bear worried that the boy might never find him. A man did, though, and the teddy bear made the man very happy. In time, the teddy bear grew quite fond of the man and his new life, and he felt loved. Many months later the man and the teddy bear were in the park. The man put the teddy bear down on a bench while he looked for something. As it happened, the little boy and his parents were in the same park, and suddenly the boy saw his teddy bear! But when he scooped him up and began to walk away, the man returned to the bench and cried out in anguish that his teddy bear was gone. What should the boy do now? A beautiful story about compassion, kindness, and empathy, this book is absolutely first rate.\nLibrarian’s Choice\nLibrary: Jefferson County Public Library Library Director: Mark Mellang Children’s Librarian: Kara Pettey Choices this week: “Dog Heaven” by Cynthia Rylant; “My One Hundred Adventures” by Polly Horvath; “No Talking” by Andrew Clements\nBooks to Buy\nThe following books are available at favorite bookstores. “Ugly” by Robert Hoge, illustrated by Keit Robinson, Viking, 2016, 200 pages, $16.99 hardcover Read aloud: age 8 - 12. Read yourself: age 9 - 12. Robert Hoge was born with a large tumor in the middle of his face from the top of his forehead down to the tip of where his nose should have been, and twisted, abnormally short legs. Surgeons amputated his legs, removed the tumor, and made a nose for Robert from one of his toes. It wasn’t a perfect face, but it was Robert’s. Navigating the world for Robert wasn’t easy. Children and adults were not always kind, but despite that, from a very young age Robert decided to be positive, enjoy his life to the fullest, and not let his “ugly” face hold him back from anything. A thought-provoking, candid, and often funny memoir of what it is like to grow up with a disability, this ultimately uplifting account of Robert Hoge’s life will broaden perspectives and compel readers to look beyond physical appearance. “The Best Man” by Richard Peck, Dial, 2016, 240 pages, $16.99 hardcover Read aloud: age 9 - 12. Read yourself: age 10 - 12. Archer Magill has experienced a great number of things, and now that he is in fifth grade, begins to focus on male role models. Thus far he has landed on three: his grandpa, his dad, and his uncle. Then he finds one more - Mr. McLeod, a teacher. Middle school is a time of wild changes, and as Archer comes to learn, it’s best if he tries to go with the flow. Sometimes that easier said than done. But being the best man at the wedding of two of his role models is something Archer can easily handle because he is thrilled for both of them. A wonderfully thoughtful, funny, and heartwarming novel, The Best Man is a story of family, fitting in, and love. • Nationally syndicated, Kendal Rautzhan writes and lectures on children’s literature. She can be reached at kendal@sunlink.net", "url": "https://apnews.com/949325dfb618437f90b457ec6d1c49ff"}