{"authors": ["The Detroit News"], "date_download": "2020-05-04 20:14:46", "date_modify": "2020-05-04 20:14:46", "date_publish": "2017-11-03 23:12:39", "description": "The Michigan Court of Appeals rejected a claim this week by a conservative Memphis radio host who said he was defamed by The Detroit News and columnist Bankole Thompson. A three-judge panel...", "filename": "_c96280d82f894dbaa7d3773a317673a4_1588623286.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c96280d82f894dbaa7d3773a317673a4_1588623286.html", "title": "Detroit News, columnist Thompson win free-speech ruling", "title_page": "Detroit News, columnist Thompson win free-speech ruling", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Michigan Court of Appeals rejected a claim this week by a conservative Memphis radio host who said he was defamed by The Detroit News and columnist Bankole Thompson.\nA three-judge panel of the appeals court upheld a lower court ruling that Thompson’s column was protected opinion under the First Amendment and the complaint by James Edwards could not proceed to a trial.\nThe case arose from an opinion piece published March 17, 2016, in The News’ Think section. In his column, Thompson wrote that Jewish leaders were concerned about Donald Trump’s presidential campaign, saying the Republican candidate had support from “white supremacist groups like the Ku Klux Klan and its leaders like James Edwards, David Duke and Thomas Robb, the national director of the Knights of the Ku Klux Klan in Arkansas.” The News later clarified the passage to indicate that Thompson was not asserting that Edwards had a formal leadership role in the KKK.\n“We find that defendants’ statment is protected opinion speech,” said the ruling issued Tuesday.\nThe appeals court said that “leader” is a term with many meanings. Although there’s no evidence that Edwards has a membership in the Klan, he “has espoused views consistent with those associated with the Klan and, equally as important, he has repeatedly and publicly embraced several individuals who are strongly associated with the Klan,” the court said.\nEdwards hosts the show “The Political Cesspool,” on which Duke is a frequent guest, and Edwards is frequently photographed with the former Klan leader, the court noted.\n“This case was an attempt by someone with white supremacist views to silence ... courageous people like Bankole Thompson who’ll criticize them for those views,” said News attorney Len Niehoff, of Honigman Miller Schwartz and Cohn and a professor at the University of Michigan. “We’re very gratified that the Court of Appeals issued a decision that is not just well-reasoned and strong on the law but aligns with what common sense and common decency would tell us.”\nEdwards said he was disappointed but had no immediate plans to appeal.\n“I respectfully disagree with the decision. As the judges made clear in their opinion, calling someone a member of the Ku Klux Klan when they’re not is, in fact, the textbook definition of defamation and that is exactly what I was alleged to be,” he said. “I’m not a member of the Ku Klux Klan. I’m not a leader of the Ku Klux Klan and no evidence exists to prove otherwise.”\nEdwards said he is a conservative, Christian “white advocate.”\nEdwards sued The News and Thompson, alleging the original article was defamatory and that the clarification did not resolve the injury.\nThe trial court ruled in favor of The News, saying that the word “leader” was ambiguous and that the statements in the column were opinions, not statements of fact.\nAffirming the decision, the appeals court said the reference to Edwards in the column could be interpreted as saying he was an opinion leader among Klan members and supporters.\n“In the context of an opinion piece about a crucially important topic — the 2016 presidential campaign — defendants’ use of the term ‘leader’ was ambiguous and could plausibly be understood to mean different things to different readers,” the court wrote.\n“Edwards’ own ... radio show and website are replete with references to ‘pro-White’ sentiments,” the court said. “One of his stated principles is to ‘grow the percentage of White in the world relative to other races.’”\nNiehoff called the ruling a victory for journalists and the First Amendment.\n“This decision is a testament to how important the work (journalists) do is and how important their contribution to the democratic process is,” he said. “This was a controversial election involving a controversial candidate with controversial supporters and journalists have to be able to write about those controversies and explore them fully or our democracy is in serious peril.”", "url": "https://apnews.com/c96280d82f894dbaa7d3773a317673a4"}