{"authors": ["Michal Rozworski", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Miles Kampf-Lassin", "Kevin Young", "Michael Schwartz", "Tarun Banerjee", "Joe Allen"], "date_download": "2020-05-04 19:56:33", "date_modify": "2020-05-04 19:56:33", "date_publish": "2017-11-02 00:00:00", "description": null, "filename": "2017_11_amazon-headquarters-incentives-investment-jeff-bezos_1588622193.html", "image_url": "https://images.jacobinmag.com/2017/11/02162534/2265816229_96c919b37f_o1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_11_amazon-headquarters-incentives-investment-jeff-bezos_1588622193.html", "title": "The Amazon Sweepstakes", "title_page": "The Amazon Sweepstakes", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nEver since Amazon announced its plans to build its second headquarters outside Seattle in September, cities have been falling over themselves to secure the project. Touted as the urban investment opportunity of a generation, Amazon’s “Request For Proposals” is really a shakedown in broad daylight. And while it is always painful to watch someone grovel, the pain here is merely a side effect of a bigger economic malaise. Information is slowly trickling out about the 238 bids officially submitted, each story more outrageous than the last. Chicago, for example, is reportedly offering over $2 billion in tax breaks and other incentives. That’s 40 percent of the estimated $5 billion that Amazon estimates it will cost to build its second headquarters. Not to be outdone, the state of New Jersey and the city of Newark are putting up a combined $7 billion in incentives — more than the value of the initial investment and well over $100,000 for each one of the 50,000 jobs Amazon says it will create. And then there’s Stonecrest, Georgia, which has offered to split off a piece of municipal land to create the new city of Amazon, Georgia and make Jeff Bezos mayor-for-life of this corporate fiefdom. Incentives on offer range from old-fashioned tax breaks to more fanciful measures like “tax-increment financing,” where future property taxes attributed to an increase in real estate values tied to the Amazon development would return to Amazon. These promises of future benefits are often accompanied by public displays of affection: whether New York City lighting up its icons (including the Empire State Building) “Amazon orange” or the Kansas City mayor’s office hand-reviewing one thousand Amazon products. This, however, is no one-off pageant organized at the whim of a powerful corporation, but an increasingly common feature of state and local governance. Wisconsin governor Scott Walker, who famously called collective bargaining an “expensive entitlement,” had no problem giving away $3 billion in incentives to get Foxconn, the company that tried to stop suicides at its Chinese factories by putting up nets to catch workers leaping off its buildings, to build a plant in Wisconsin. Walker, who also thinks a $7.25 per hour federal minimum wage is a bad idea, effectively handed over $500,000 to $1 million of public money to Foxconn for every job it will create in his state. A comprehensive report published this year found that between 1990 and 2015, the average value of incentives offered by states and cities to businesses has increased three-fold. Although no longer growing as rapidly, incentives still “excessively sacrifice the long-term tax base of state and local economies” for questionable benefits. Many of the Amazon bids tout the very municipal services — like reliable transit or good local schools — that may be put on the chopping block to pay for lavish tax relief promises.\nRot of All Kinds We shouldn’t be surprised that Amazon can get away with using a few billion dollars of private investment as bait for public billions in return. Investment in the US, both private and public, is in a sorry state. Taken as a proportion of overall economic activity, businesses and governments are investing a fraction of what they did in the postwar years or even a few decades ago. The business sector does not lack for means — profits margins, while down from record highs, are no longer in the doldrums. But rather than invest in new production facilities and new technology, corporations, under pressure from shareholders, are spending big on dividends and share buybacks or letting cash lay idle. Amazon is in fact one of the few major outliers to this trend, refusing to pay dividends and aggressively using profits to fund continuous expansion. While private investment has given way to shareholders gorging themselves on profits, public investment has simply given way to rot. Last year, civilian net public investment in the United States amounted to a paltry 0.5 percent of GDP. Exaggerated worries about debt and deficits and a pervasive ideology that the private sector can do everything better leave the public sector doing the minimum, barely keeping up as things fall apart.", "url": "https://www.jacobinmag.com/2017/11/amazon-headquarters-incentives-investment-jeff-bezos"}