{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:10:14", "date_modify": "2020-05-04 20:10:14", "date_publish": "2017-10-09 14:42:10", "description": "Beverly Mae Mulholland died peacefully on Saturday, Oct. 7, 2017, at Seasons Hospice House in Rochester. Beverly was the daughter of Harry and Louise Mulholland. She was born on Feb. 8,...", "filename": "_23703ed020e64b0090e5fdecf404fa48_1588623014.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_23703ed020e64b0090e5fdecf404fa48_1588623014.html", "title": "Beverly Mulholland Spittell -- Rochester", "title_page": "Beverly Mulholland Spittell -- Rochester", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Beverly Mae Mulholland died peacefully on Saturday, Oct. 7, 2017, at Seasons Hospice House in Rochester.\nBeverly was the daughter of Harry and Louise Mulholland. She was born on Feb. 8, 1926, in Dundalk, Md. She attended Baltimore County School District and graduated from Sparrows Point Maryland High School in June 1942. After high school, Beverly enrolled in Western Maryland College (now McDaniel College), from which she graduated in 1947 with a degree in English. After college graduation, Beverly was employed by Hutzler Brothers department store in the Management Leadership Training Program, where she excelled in home decorating and furnishing.\nIn January 1948, Beverly and Jack, a medical student, met on an outside ice-skating date arranged by friends, to begin their more than 70-year love affair. Beverly and Jack were married at St. George’s Church in Dundalk on June 11, 1949.\nBeverly was preceded in death by her parents; and her brother, Jack Mulholland.\nShe is survived by her husband of 68 years, Dr. John A. Spittell; their children, John A. Spittell III (Ellen) of Galesburg, Ill., David M. Spittell of Rochester, Beverly Ann Spittell-Lehman (James) of Rochester, Dr. Peter C. Spittell (Nancee) of Rochester, Martha Jane Ziegelbauer (Gary) of Green Bay, Wis., and their grandchildren, Mary Beverly Heise (Ryan) of Sturgeon Bay, Wis., John Howard Spittell of Washington, D.C., and Beverly Louise Clarke (Ryan) of San Francisco.\nBeverly cherished being a full-time mother in the home which she planned and beautifully decorated. Her lake home in northwest Wisconsin was her favorite retreat with her family.\nBeverly was a member of the Alice Mayo Society and Calvary Episcopal Church, and she was active in Girl Scouts. Beverly enjoyed collecting antiques, cooking and was an avid reader.\nA memorial service is planned for 11 a.m. Wednesday, Oct. 11, at Calvary Episcopal Church, 111 Third Ave. SW, Rochester, with the Rev. Beth Royalty officiating.\nIn lieu of flowers, Beverly’s family suggests donations to Calvary Episcopal Church, Rochester, Saint Mary’s Hospital (Poverello Fund), Rochester, Seasons Hospice in Rochester, or the donor’s choice.\nArrangements entrusted to Ranfranz and Vine Funeral Homes.", "url": "https://apnews.com/23703ed020e64b0090e5fdecf404fa48"}