{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:09:36", "date_modify": "2020-05-04 20:09:36", "date_publish": "2017-05-16 03:59:00", "description": "Faithful readers will remember Kook (of the sister duo of Neeve and Kook) from all my family gathering stories based in Esom Hill and Rockmart. Well the other day I get a call from Kook...", "filename": "_278a05814b7d4306b221e527e8c8fa88_1588622976.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_278a05814b7d4306b221e527e8c8fa88_1588622976.html", "title": "COLUMN: Tina Turner, the FCA and a disastrous performance happens in Cedartown", "title_page": "COLUMN: Tina Turner, the FCA and a disastrous performance happens in Cedartown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Faithful readers will remember Kook (of the sister duo of Neeve and Kook) from all my family gathering stories based in Esom Hill and Rockmart.\nWell the other day I get a call from Kook asking if I’d do her a big favor and be part of a lip-synch “show” she has agreed to participate in. She wanted me to dress up as Tina Turner because she wants to re-create the “We Are the World” video and is asking friends and family to dress up as all the stars in the video.\nFor those who aren’t familiar, a bunch of really famous singers were brought together in 1985 to record a single called “We Are the World” to raise tons of money for people in Africa. All these famous singers like Michael Jackson, Tina Turner, Lionel Ritchie, Stevie Wonder, Paul Simon, Kenny Rogers, Bruce Springsteen, Cindy Lauper, Bob Dylan and many, many other singers participated. They each sang a few lines of the song and everyone sang the choruses. It was a big hit and raised a lot of money.\nWell Kook says that she wants to re-create that with a bunch of us lip-synching as these famous singers. She says it’s for a good cause, FCA.\nNow I didn’t wanna admit that I had no idea what FCA stood for. I know FFA is the Future Farmers of America so I assumed FCA was like the Future Cattlemen on America or something like that. So I said I’d do it. I support cattlemen... and women.\nWell here’s what I didn’t know. Kook had agreed to help out with this event a long time ago but was reluctantly thrust into the role of a lip-syncher. She thought she’d just be helping out at the show which was to be at the Cedartown Performing Arts Center. But she was actually supposed to perform on stage.\nKook is getting treatment for cancer and between that and work, she just hasn’t had the time (or energy) to put a lot of effort into the performance.\nShe wasn’t worried about it because she was doing the best she could and was trying to round up people willing to embarrass themselves in front of everyone in Cedartown.\nThe show was on Saturday and we had never gotten together as a group to rehearse or anything. I didn’t even know who all was going to be lip-synching with me.\nSo I get to the Cedartown Performing Arts Center at around 3:30 on Saturday afternoon (the show would start at 6 p.m.) Kook’s already there with a bunch of costumes and wigs. I finally start seeing all the people who are in our little group and it’s a fun mix. I’m thinking “Ok, this isn’t so bad. This’ll be fun.”\nWell suddenly we’re back stage and a guy walks in, dressed in a costume for his performance and says to me and my group “so y’all are our competition?”\nAnd then it was revealed to me that this wasn’t a “show” like Kook had led me to believe. It was an honest to goodness COMPETITION ... with judges and everything.\nAs this new revelation washes over me I realize that the other teams backstage all have elaborate costumes and choreography and props. They’ve been practicing for MONTHS.\nAnd here we are, most of my group have never even heard the song “We Are the World” before, and we’re fixin’ to get out on stage in a few minutes with no clue what to do.\nHowever, the organizers of the event did a great job making sure all the teams knew how the show would run and gave us a time on stage to run through the performance. For our group it was obviously the very first time we had ever rehearsed. It went as well as you’d expect. Everyone was staring at the printed lyrics Kook gave them because no one knew the words. We didn’t even know where to stand.\nI was LIVID. I am a planner and a perfectionist when it comes to stuff like this. I couldn’t bear the thought of getting up in front of all those people and bumbling our way through this song when other teams had well rehearsed numbers that they were going to perform.\nSo my next thought was that since we couldn’t impress them with our knowledge of the song, we’d just make them laugh. We had ridiculous costumes. I had a short purple fringe dress on and high heels and a big ’ol wig. Kook’s son-in-law Jody was dressed as Cher and Kook herself was supposed to be Stevie Wonder although everyone kept asking her if she was Bob Marley.\nI thought that during the number I’d act really inappropriately and grind against all the men on stage in my Tina Turner costume and that would surely elicit laughs from the crowd. I’d push up my fake boobs and expose them to the crowd. I knew that would make people laugh.\nI told Kook what I was going to do and then she informs me that FCA stands for the FELLOWSHIP of CHRISTIAN ATHLETES. This entire event was Christian-based and all the money raised would help Christian athletes to go to camp. We were here to do the Lord’s work.\nI promise you I almost fell off my high heels when she said that. Now I had nothing. The only hope we had of turning this performance around was my tasteless and inappropriate behavior on the stage and now that too was being taken away. I had even shaved my legs for this performance as the great Tina Turner ... and cut myself several times in the process.\nWe were doomed.\nSo the show begins and all the other acts take their turns on the stage. They were all really funny and well rehearsed. One team of cheerleaders and basketball players performed a Britney Spears song, one well costumed team performed a Kiss hit and two girls did a really funny montage of popular songs. There were nine teams in all.\nAfter all the fun, crazy music and practiced choreography was over, it was finally our turn to do our little dog and pony show.\nWe got up there and the lights came up and the music began and I must admit that it went better than I expected. Not much better, but better.\nKook and her husband David were up there (David was Garth Brooks), their niece Mary Ella was some rapper I’ve never heard of, Jody was Cher, Jimmy Jones was Willie Nelson, Maggie Taylor was Cindy Lauper, Bennett Vest was Michael Jackson, Dori Owen was Little Red Riding Hood, Mary Hammonds was a hilarious Madea, Brian Hammons was a mulleted Billy Ray Cyrus and Kathy Thompson was Reba McEntire.\nWe obviously took some liberties with the lineup since we wanted to make it funny for the audience. We got some pity applause from the crowd during the performance and when we got off the stage, all the other teams were very supportive and kind since they felt so bad for us.\nI’d like to say that our little rag-tag group of friends somehow charmed the judges and we ended up winning the competition. But of course we didn’t. However, we did help to raise money for FCA camp and that makes the whole fiasco worth it.\nMoral of the story: Don’t trust Kook, don’t rely on fake boobs at a Christian event, never be in a rush when shaving your legs and above all ... practice, practice, practice.\nSevero Avila is features editor for the Rome News-Tribune.", "url": "https://apnews.com/278a05814b7d4306b221e527e8c8fa88"}