{"authors": [], "date_download": "2020-05-04 20:10:43", "date_modify": "2020-05-04 20:10:43", "date_publish": "2017-03-13 10:00:00", "description": "Anne Hathaway thinks 'Ocean's Eight' has become a \"statement\" because of its all-female cast. The Oscar-winning actress admitted she expects the upcoming heist movie - which also stars the...", "filename": "_c9b00c314fc54fecafead07958077156_1588623043.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c9b00c314fc54fecafead07958077156_1588623043.html", "title": "Ocean's Eight makes a statement", "title_page": "Anne Hathaway: Ocean's Eight makes a statement", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Anne Hathaway thinks ‘Ocean’s Eight’ has become a “statement” because of its all-female cast.\nThe Oscar-winning actress admitted she expects the upcoming heist movie - which also stars the likes of Sandra Bullock, Cate Blanchett, Rihanna, Awkwafina, Sarah Paulson, Helena Bonham Carter and Mindy Kaling - to attract a lot of attention because it is seen as a political move not to cast men in major roles.\nAsked if she worries the film will be seen as political or attract harassment in the way the all-female ‘Ghostbusters’ reboot did, she said: “When I’m a second or a third lead in a film -- usually the first and second leads are men -- my character doesn’t feel political.\n“But when I’m number one on the call sheet, it suddenly becomes a ‘woman’s story’ and it’s a statement.\n“That’s the moment that we’re in. In this movie there are eight women starring, so it may well attract that sort of attention.\nHowever, the 34-year-old star insists the cast won’t take any sort of criticism aimed at their gender lightly.\nShe added to Time magazine’s Motto: “But good luck to any person who tries to take on Sandra Bullock and Cate Blanchett because you’re not going to win.”\nAnne - who is a UN Goodwill Ambassador advocating for parental leave - is thankful her first experience working on a movie since having her and husband Adam Schulman’s son Jonathan 11 months ago has been very welcoming towards the youngster, as she knows that isn’t always the norm.\nBut she is hopeful change will come about thanks to her co-stars insistence on making their sets family friendly.\nShe said: “I only have one experience so far, and it’s a movie that stars eight women, four of whom are mothers -- which is definitely not the norm.\n“On ‘Ocean’s Eight’, kids were welcome on the set. [Before we started] I got an email from Sandra Bullock saying, ‘Hey, listen, we’re going to make this a really welcoming place for kids. I know you’re a brand-new mom, so don’t be afraid to bring your son. We love kids here.’\n“Change is going to come, but it’s going to take people like her with the power to make change to demand it.”", "url": "https://apnews.com/c9b00c314fc54fecafead07958077156"}