{"authors": ["Josh Mound", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:07", "date_modify": "2020-05-04 19:56:07", "date_publish": "2017-07-03 00:00:00", "description": null, "filename": "2017_07_trump-tax-cuts-health-care-democrats-redistribution_1588622167.html", "image_url": "https://images.jacobinmag.com/2017/07/03152842/09782v.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_07_trump-tax-cuts-health-care-democrats-redistribution_1588622167.html", "title": "The Democrats Are Eisenhower Republicans", "title_page": "The Democrats Are Eisenhower Republicans", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOver the past several months, often secretively and often aided by the incessant swirl of rumors about Russia, Republicans have been marching forward with their plan to deliver massive tax cuts to the rich, both through the repeal of the Affordable Care Act and a separate tax reform bill. Though Senate Republican leader Mitch McConnell has delayed a vote on the health bill until after the Fourth of July, there’s every indication that — one way or another — the GOP will push some combination of tax cuts across the goal line. After all, both the health bill and the tax bill would accomplish the GOP’s primary legislative goal: redistributing wealth and income upward. Studies by independent outlets like the Congressional Budget Office (CBO) and the Tax Policy Center have found that the health care bill would strip insurance from more than 20 million (primarily poor and elderly) people while handing tax cuts to the rich, and that the GOP’s tax proposals would slash taxes for the rich even further while inflating the deficit. But the gloomy assessments haven’t given Republicans pause. Instead, they have attacked the studies themselves. Texas senator John Cornyn called the CBO report “fake news,” and Kansas representative Roger Marshall spoke for many Republicans when he remarked, “The CBO’s crazy.” Mick Mulvaney, Trump’s budget director and a former member of the right-wing House Freedom Caucus, went a step further, arguing not just that the CBO’s study was wrong, but that the idea of nonpartisan research is bunk. “At some point, you’ve got to ask yourself, has the day of the CBO come and gone?” Mulvaney said, adding that unbiased legislative research isn’t “feasible.” He called on legislators to ignore the CBO and rely on partisan think tanks for legislative analysis. While a few conservatives pushed back against Mulvaney’s comments, even many supposedly moderate, “reformocon” critics of the Trump administration agreed with Mulvaney that the CBO should be “reformed” in order to reduce its influence and allow outside groups to take the policy reins. The attack on the CBO sent Democrats and liberal pundits into a frenzy. “OMB Director Mulvaney’s comments challenging the integrity and expertise of analysts at the nonpartisan Congressional Budget Office are irresponsible and unacceptable,” declared House Democratic whip Steny Hoyer. Noting that Republicans have long wielded deficit projections from the agency to sink Democratic spending proposals, CNN’s Dana Bash quipped, “I’m old enough to remember when Republicans loved the CBO.” But while the CBO no doubt welcomed the spirited defenses, Democrats have played into the GOP’s hands by positioning themselves as the defenders of technocratic expertise. For the last fifty years, the Right has waged a war on “objective” fiscal analysis in order to further their goal of upward redistribution. Republicans and their conservative allies invoke mainstream studies when they undermine progressive policy ideas, then discard those same analyses when they get in the way of their agenda. In contrast, Democrats have touted themselves as denizens of the “reality-based community” and “the party of fiscal responsibility,” as Bill Clinton often put it. The result is that, for decades, the parties have operated according to completely different rules on taxing and spending. When Republicans put forward unrealistic tax and budget proposals, they waive away projected deficits by improbably claiming that economic growth will cover the massive shortfall. When Democrats are in power, they treat “pay fors” and budget balancing as paramount and CBO analyses as sacrosanct. And whenever a progressive figure like Bernie Sanders steps outside the neoliberal budgetary consensus, elected Democrats and liberal pundits join conservatives to smack down their proposals as “unrealistic.” The predictable upshot of this policymaking asymmetry is that Democrats have spent the last forty years trimming their sails, inadvertently underwriting the GOP’s next tax cut. Jimmy Carter’s austerity funded Ronald Reagan’s top-heavy tax cuts. Bill Clinton’s austerity funded George W. Bush’s top-heavy tax cuts. And now, the deficit reduction Obama worked so hard to achieve in the second half of his presidency will likely help fund Donald Trump’s top-heavy tax cuts.\n“Starve the Beast” Throughout the 1950s and ’60s, members of the incipient conservative movement bristled at the GOP’s balanced-budget orthodoxy, as embodied by President Dwight Eisenhower. Republicans’ fear of inflation, they argued, drove the GOP to balance the budget at all costs, unwittingly helping Democrats grow the size of government. Some on the Right — advancing what would become known as the “starve the beast” strategy — began insisting that Republicans put all their focus on slashing taxes, rather than balancing the budget. Any deficits that resulted from tax reduction, these conservatives argued, would serve as a check on Democrats’ spending plans. “I honor the Republicans for putting what they regard as the national interest ahead of partisan considerations. But I believe that they have been shortsighted in judging the national interest,” libertarian economist Milton Friedman wrote in a Newsweek column in 1968. “True fiscal responsibility requires resisting every tax increase and promoting tax decreases at every opportunity. That is the only way to put an effective ceiling on Federal spending.” Friedman already had many right-wing Republicans on his side. He’d helped GOP presidential nominee Barry Goldwater craft his tax plan in 1964, which called for a 25 percent across-the-board slash in federal personal and corporate income taxes. Goldwater made no promises about balancing the budget, suggesting only that the fantastic growth spurred by his tax cuts would eventually swell tax receipts. This admission, as the New York Times put it, made Democrat Lyndon Johnson “look like the very model of a fiscal conservative” — which was precisely the point, from Friedman and Goldwater’s point of view. Just four years earlier, in his 1960 book Conscience of a Conservative, Goldwater had argued that “principled” conservatism meant putting “spending cuts . . . before tax cuts.” “If we reduce taxes before firm, principled decisions are made about expenditures,” Goldwater wrote, “we will court deficit spending and the inflationary effects that invariably follow.” But now, under the guidance of Friedman, Goldwater was courting deficits for a political purpose. The drop in revenue brought about by Goldwater’s sweeping tax cuts would “put steady and effective pressure on Congress to hold down spending,” Friedman wrote. Even more crucially, the distribution of Goldwater’s tax cuts heavily favored the GOP’s base. “Senator Goldwater’s proposal,” the Christian Science Monitor noted, “would have the effect of giving high-income persons and corporations a relatively bigger tax break than middle-bracket taxpayers.” The GOP nominee promised to go further in his pursuit of upper-income tax cuts, too. Anticipating the modern Republican fixation on the “flat tax,” Goldwater called the progressive income tax “confiscatory” and pledged to scrap it — “the sooner . . . the better.” Goldwater’s landslide loss to Johnson in the general election put his fiscal program on hold for some time. But the power vacuum generated by Nixon’s resignation ten years later allowed movement conservatives — including Ronald Reagan, who’d famously delivered a televised speech on Goldwater’s behalf in 1964 — to assume the leadership of the rudderless Republican Party. As part of their overhaul of the GOP, Reaganite conservatives would make the Friedman-Goldwater vision of upwardly redistributive tax cuts financed by ballooning deficits (to hamstring future Democratic spending ambitions) the GOP’s primary policy goal.\n“Two Santas” Perhaps the most influential articulation of the burgeoning Republican consensus on fiscal policy came in the form of a 1976 piece by Wall Street Journal columnist Jude Wanniski. Only two years prior, Wanniski had been at the Two Continents restaurant in Washington DC, with Gerald Ford’s chief of staff, Donald Rumsfeld, and deputy chief of staff, Dick Cheney, when economist Arthur Laffer drew a curve plotting top marginal tax rates against tax revenue. Laffer argued that past a certain threshold, taxes on the rich were self-defeating because they discouraged work and investment. At that point, he said, trimming top marginal tax rates would stoke economic growth — generating, counterintuitively, more revenue than before. It was a contention that echoed Goldwater’s campaign trail claims, and that had roots extending at least as far back as Andrew Mellon, the treasury secretary for Republican presidents Warren Harding, Calvin Coolidge, and Herbert Hoover. In 1978, Wanniski would dub it the “Laffer Curve” and make it the centerpiece of his “supply-side” manifesto, The Way the World Works. But in 1976, Wanniski was focused on the politics of taxation, not its economic effects. He called his philosophy the “Two-Santa Claus Theory.” “The Democrats, the party of income redistribution, are best suited for the role of Spending Santa Claus,” Wanniski wrote. “The Republicans, traditionally the party of income growth, should be the Santa Claus of Tax Reduction.” The problem, Wanniski held, was that the GOP had been “playing into the hands of the Democrats, who know the first rule of successful politics is Never Shoot Santa Claus.” In Wanniski’s view, Republicans erred because of their paralyzing fear of budget deficits and inflation. “The political tension in the marketplace of ideas must be between tax reduction and spending increases,” Wanniski argued, “and as long as Republicans have insisted on balanced budgets, their influence as a party has shriveled, and budgets have been imbalanced.” The conclusion was inescapable: “Republicans should concentrate on tax-rate reduction.” Cut, cut, cut — and limit Democrats’ ability to introduce new spending programs. Meanwhile, Friedman continued beating the drum for budget-busting tax cuts. He campaigned for tax limitation measures in states across the country and outlined his vision in a series of academic and popular writings. “By concentrating on the wrong thing, the deficit, instead of the right thing, total government spending, fiscal conservatives have been the unwitting hand-maidens of the big spenders,” Friedman wrote in 1978. “The typical historical process is that the spenders put through laws which increase government spending. A deficit emerges. The fiscal conservatives scratch their heads and say, ‘My God, that’s terrible; we have got to do something about that deficit.’ So they cooperate with the big spenders in getting taxes imposed. As soon as the new taxes are imposed and passed, the big spenders are off again, and then there is another burst in government spending and another deficit.” “Hence,” he explained in another column that year, “I have concluded that the only effective way to restrain government spending is by limiting government’s explicit tax revenue — just as a limited income is the only effective restraint on any individual’s or family’s spending.” Other right-wing economists offered a similar prognosis. Practitioners of “public choice theory,” including future Nobel Prize winner James Buchanan, argued that deficit-boosting tax cuts were the only way to tamp down Democrats’ harried spending. The “public choice” idea, as Bruce Bartlett has summarized, was that “a conservative government might intentionally increase the national debt through tax cuts in order to bind the hands of a subsequent liberal government.” While traditional Republicans remained skeptical, support for supply-side thinking was expanding from intellectual circles into the political arena. When California voters approved the anti-property tax Proposition 13 in 1978, supply-siders pounced. They spun what was in fact a defensive vote by moderate-income homeowners against soaring regressive state and local taxation into a dubious justification for slashing federal taxes on the rich. At the federal level, New York representative Jack Kemp joined Reagan in taking up the supply-side torch. He passed out copies of Wanniski’s “Two-Santa Claus Theory” column to friends and acquaintances and railed against traditional balanced-budget conservatives, whom he and his ilk derisively called “green eyeshades” Republicans. Faced with one of these deficit-conscious types, Kemp would, as Reagan’s budget director David Stockman recalled, let loose with “every expletive in the supply-side lexicon”: “Hooverism . . . green eyeshades . . . static thinking! It’s terrible! Flat earth economics! [Eisenhower and Nixon adviser] Herbert Stein! [Eisenhower and Nixon adviser] Arthur Burns!” In the fall of 1978, Kemp and Reagan barnstormed around the country, flanked by a panoply of other right-wing Republicans — including Stockman, Alan Greenspan, Kansas senator Bob Dole, and Wisconsin representative William Steiger — on what they called the “Tax Cut Blitz.” They piled into a Boeing 727 nicknamed the “Tax Clipper” and staged rallies across the US to push for both an across-the-board income tax cut (proposed by Kemp and Republican senator William V. Roth Jr) and a top-heavy capital gains tax cut (proposed by Steiger). As the “Tax Clipper” sailed from coast to coast, the Consumer Price Index was sitting at its highest level in over forty years — seven percent and rising. Analyzing the Kemp-Roth plan, the CBO warned that its tax cuts could be “highly inflationary” and would “sharply” increase the deficit, judgments that applied equally to Steiger’s proposed capital gains cut. But the Right had another trick up its sleeve: Milton Friedman’s “monetarism,” which held that monetary policy, not fiscal policy, should lead the way in combatting inflation. Together, “supply-side” economics and “monetarism” provided the intellectual cover for conservative Republicans to funnel money to their party’s rich supporters, all while claiming that doing so benefited all Americans without any nasty downsides, like runaway inflation. The GOP’s embrace of consequence-free profligacy flipped the script on the Democrats, just as Friedman and Wanniski had predicted. But they also received an assist from neoliberal Democrats, who were mounting their own campaign to move the party towards a politics of balanced budgets and business-friendly taxation. President Jimmy Carter — despite calling for a higher capital gains tax while running for president in 1976 — was, in many ways, the personification of this new centrist neoliberalism. And many conservative Democrats in Congress were sympathetic to lowering taxes on investment income. The combination of the Republicans’ “Tax Blitz” campaign and a concerted lobbying effort from business groups like the Chamber of Commerce, the National Association of Manufacturers, and the American Council for Capital Formation made the passage of Steiger’s bill a fait accompli. The conservatives backing the capital gains reduction weren’t shy about its distributional effects. “Who will benefit from my amendment? Taxpayers in the upper bracket would benefit,” Steiger frankly admitted. He wasn’t kidding. The final version of Steiger’s plan, which was signed into law by Carter, gave a four-person family making $20,000 — just above median income — approximately $100; a taxpayer making over $200,000 saw a tax reduction of more than $25,000. By the 1980 presidential campaign, Carter had assumed the role of “green eyeshade” fiscal scold and Reagan the role of sunny spendthrift. In late 1978, Carter had told the nation that the country was facing a “time of national austerity” that would require “difficult and unpleasant” belt-tightening. Throughout the rest of his presidency, Carter made clear that he believed his role as a president in a time of high inflation was to be “fiscally responsible in reducing the Federal deficit.” He opposed any spending increases or further tax cuts, including indexing federal income tax brackets to inflation — one of the few tax changes that would’ve disproportionally helped low- and middle-income taxpayers. Reagan, in contrast, not only pushed a version of the Kemp-Roth rate cuts during his presidential campaign, he also favored indexation. He denied that his tax cuts would cause the deficit to balloon or that additional austerity was needed to fight inflation. Instead, he promised to replace the “eerie, ghostly silence of economic stagnation, unemployment, inflation, and despair” with the “confident roar of American progress and growth and optimism.” Ironically, the only area in which Carter claimed to support more generous provisions than Reagan was in tax cuts for business. The inversion of the parties’ fiscal roles was complete.\nReagan’s Windfall Once in office, Reagan used language nearly identical to Friedman’s to justify tax cuts that would send the deficit spiraling. “Over the past decades we’ve talked of curtailing government spending so that we can then lower the tax burden. Sometimes we’ve even taken a run at doing that,” Reagan told the nation in a televised address one month after taking office. “But there were always those who told us that taxes couldn’t be cut until spending was reduced. Well, you know, we can lecture our children about extravagance until we run out of voice and breath. Or we can cure their extravagance by simply reducing their allowance.” When the CBO predicted huge deficits from Reagan’s cuts, the White House reacted just as the GOP is today. “That’s them practicing what they’ve been preaching for the last thirty years,” Reagan groused. “Their figures are phony.” The administration even attempted to oust CBO director Alice Rivlin and replace her with someone more pliable. Despite the bill’s regressive effects, a majority of Democrats in the House and the Senate voted for Reagan’s Economic Recovery Tax Act of 1981. It was the largest tax cut in post–World War II history, and it exploded the deficit. Yet it did little to spur the growth that supply-siders had promised. As studies by the CBO, the Joint Committee on Taxation, and the Joint Economic Committee all found, Reagan’s cuts made the federal tax system less progressive and worsened income inequality. Between 1980 and 1983, the bottom half saw their after-tax incomes fall while the top 1 percent enjoyed a more than 20 percent increase. In the end, Carter’s legacy was laying the fiscal groundwork for Reagan’s giveaway to the rich. The next Democratic president, Bill Clinton, would make the same mistake.\n“The Party of Fiscal Responsibility” During his 1992 presidential campaign, Clinton had vowed to enact middle-class tax cuts and an array of spending programs if elected. But in a pre-inauguration meeting, Clinton’s economic team — led by economist Alan Blinder and former Goldman Sachs banker Robert Rubin — urged the president-elect to abandon both the tax cut and his spending plans. Instead, they said, he should focus on reducing Reagan’s deficit, which Rubin claimed was the “central problem” facing the country. Clinton had run as a centrist “New Democrat,” but his spending proposals had been too ambitious for many in the neoliberal Democratic Leadership Council (DLC). The DLC’s goal, as one of its cofounders, Virginia governor Chuck Robb, put it, was to make the Democratic Party the “party of change, the party of economic opportunity and growth, the party of strength and resolve and willingness to defend basic American values and freedom, and hopefully . . . the party of fiscal responsibility.” Now, faced with his economic team’s recommendations, Clinton agreed to take up that mantle. But he also seemed to understand the political significance of the shift that was occurring. “I hope you’re all aware we’re all Eisenhower Republicans,” Clinton grumbled in another early 1993 economic meeting. “We’re Eisenhower Republicans here, and we are fighting the Reagan Republicans. We stand for lower deficits and free trade and the bond market. Isn’t that great?” Regardless of his private complaints, Clinton embraced the New Democratic message with gusto in public. In 1997, signing into law the country’s first balanced budget in decades, Clinton gushed that the bill represented the country’s “most fundamental values” and served as a response to the “practical challenges ordinary American citizens face every single day.” By the end of Clinton’s second term, any lingering uncertainty about whether Democrats were turning into “Eisenhower Republicans” had vanished. According to Clinton, the economy of the 1990s proved that the DLC’s “Third Way” philosophy worked. “[W]hat I was trying to do,” Clinton explained to the New Yorker’s Joe Klein, “was to build the Democrats as a party of fiscal responsibility. I wanted to prove that you could be socially progressive and fiscally responsible.” As Clinton told the Democratic National Committee in 1999, he saw himself as presiding over the end of an era of Democratic spending and Republican tax cuts. “We [Democrats] could no longer participate in a kind of unspoken deal with the Republicans where we would both allow these intolerable deficits to go on because we wanted to spend money and they didn’t want to raise any money,” Clinton said. “And they’d let us spend money and we’d let them avoid raising it, and the deficit would get bigger and bigger and bigger. . . . And we said, we’re going to bring the deficit down.” What Clinton and Democrats didn’t seem to realize, however, was that the Republicans hadn’t agreed to any such deficit accord. Nor did they plan to. The 2000 presidential campaign illustrated the success of the Right’s “Two Santas” strategy. Al Gore spoke in the register of “fiscal responsibility.” He pledged not only to “balance the budget every year” but also to eliminate the national debt within a decade. His opponent, George W. Bush, blamed Gore for Clinton’s broken promise to cut taxes on the middle class. Instead of vowing to continue Clinton’s budgetary restraint, Bush proposed a Reagan-esque tax cut and dismissed Gore’s predictions that it would stoke the deficit. When cornered, Bush could point to friendly analyses from conservative think tanks that, in true “supply-side” form, claimed his tax cuts would produce such rapid growth that there would be no federal debt increase. The result was a virtual replay of Reagan’s first term. Income inequality widened on the strength of Bush’s tax cuts. The incomes of the poorest 20 percent of Americans barely budged, while the richest 1 percent enjoyed after-tax income gains of more than 5 percent. And, in typical “supply-side” fashion, the tax windfall for the rich blew a hole in the budget. By this time, the idea that there was no political downside to growing the deficit had become the Republican conventional wisdom. As Vice President Dick Cheney told Treasury Secretary Paul O’Neill, “Reagan proved deficits don’t matter.” The Bush deficits had the intended effect on Democrats, too. When Barack Obama took office, the deficit was enormous and the country was entering the deepest recession since the Great Depression. Obama initially pursued a more ambitious agenda than either Carter or Clinton, but both his stimulus package and the Affordable Care Act were scaled back in an effort to avoid sticker shock. And after his health care law passed, Obama shifted into deficit-reduction mode. He appointed a “bipartisan” National Commission on Fiscal Responsibility and Reform that only heightened deficit hysteria, and he worked to strike a deficit-reducing “grand bargain” with John Boehner that would’ve slashed Social Security. Now, Obama’s fiscal probity is likely to be undone by Trump and the Republicans in Congress.", "url": "https://www.jacobinmag.com/2017/07/trump-tax-cuts-health-care-democrats-redistribution"}