{"authors": ["Mississippi State Sports Information"], "date_download": "2020-05-04 20:12:25", "date_modify": "2020-05-04 20:12:25", "date_publish": "2017-01-15 02:13:00", "description": "STARKVILLE, Miss. – Mississippi State moved to 3-1 in Southeastern Conference play for the first time since 2010 with Saturday afternoon’s 67-59 win against Texas A&M. A season-best crowd of 8,588...", "filename": "_dfba5cae06d841e6ad709b0c79f99642_1588623145.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dfba5cae06d841e6ad709b0c79f99642_1588623145.html", "title": "Bulldogs Defeat Texas A&M", "title_page": "Bulldogs Defeat Texas A&M", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STARKVILLE, Miss. – Mississippi State moved to 3-1 in Southeastern Conference play for the first time since 2010 with Saturday afternoon’s 67-59 win against Texas A&M. A season-best crowd of 8,588 and a national-televised CBS audience watched as the Bulldogs rallied from an early 10-point deficit to knock off the Aggies for a third-straight conference win for the first time since 2011. The Bulldogs also snapped a four-game losing streak in the series with the Aggies. MSU improved to 12-4 overall and 3-1 in league play, while Texas A&M fell to 9-7 and 1-4. “That was a big-time win against a really good team,” MSU coach Ben Howland said. “I am excited about how we were able to find a way after such a poor start. Texas A&M has NBA-type length. Really proud of our team. Schnider (Herard) was huge for us. He was a force inside.” Herard led the Bulldogs with a career-high 16 points. Lamar Peters added 14 points (including an 11 of 11 day at the free throw line), while Quinndary Weatherspoon had 13 and Aric Holman had 11. Peters, whose father passed away this past week, had 5 steals and 4 assists. Holman and Mario Kegler led the Bulldogs with 5 rebounds apiece. The Bulldogs went better than seven minutes without scoring to stat the contest. Peters finally helped the home team break through with three free throws with 12:25 left. The Aggies had already scored the game’s first 10 points. To turn the game back around, the Bulldogs did it on the defensive end, scoring 11-straight points and forcing four straight turnovers to take the lead. A 3-point play by Mario Kegler gave the Bulldogs an 11-10 lead. From there, the contest was nip-and-tuck throughout. The Bulldogs built a 16-12 lead on a dunk by Herard. A 9-1 run sent the Aggies back ahead 21-17. Herard scored as time expired to give the Maroon and White a 25-24 lead at halftime. Overall, the score was tied four times and the lead changed hands 17 times. “Excited about the crowd today,” Howland said. “The home court advantage was huge. There was a lot of energy in the building. They really helped us when we didn’t start well.” In the second half, neither team led by more than three points until Peters hit a 3-pointer and Xavian Stapleton hit a basket for a 48-44 lead with 9:09 left. A basket by Herard gave the Bulldogs the lead for good at 52-51 with 5:29 left. The big blow was a 3-pointer from Weatherspoon for a 57-53 lead one minute later. For the contest, the Bulldogs hit 19 of 44 shots from the field (43.2 percent), 5 of 18 shots from 3-point range (27.8 percent) and 24 of 30 shots from the foul line (80.0 percent). The Aggies hit 23 of 52 shots from the field (44.2 percent), 1 of 14 shots from 3-point range (7.1 percent) and 12 of 20 shots from the foul line (60.0 percent). Texas A&M held a 38-23 rebounding advantage. The Bulldogs had 11 assists and 13 turnovers, while the Aggies had 10 assists and 22 turnovers. Texas A&M received 16 points from Tyler Davis, 13 points from D.J. Hogg and 12 points from Robert Williams. MSU will remain home for a Tuesday night contest with Kentucky. The Bulldogs and Wildcats play at 6 p.m. on ESPN with fans encouraged to wear white to the Humphrey Coliseum.", "url": "https://apnews.com/dfba5cae06d841e6ad709b0c79f99642"}