{"authors": ["Abigail Van Buren"], "date_download": "2020-05-04 20:24:34", "date_modify": "2020-05-04 20:24:34", "date_publish": "2017-02-11 22:24:13", "description": "Dear Abby: My boss wants to do a day of community service with the staff to help others and improve relationships in the workplace. I thought it was a great idea; a lot of my co-workers were...", "filename": "_d149ce9eecd544c28dc8f3e2815d25e0_1588623874.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d149ce9eecd544c28dc8f3e2815d25e0_1588623874.html", "title": "A day of service is one too many for reluctant employees", "title_page": "A day of service is one too many for reluctant employees", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dear Abby:\nMy boss wants to do a day of community service with the staff to help others and improve relationships in the workplace. I thought it was a great idea; a lot of my co-workers were unsure and wanted more information about what specifically we would do. My boss said she would get more information and send it out to us. However, a few of my co-workers are outright opposed to the idea and think they shouldn’t be required to do it.\nA year ago when this came up, one of them said they shouldn’t have to give up their free time. I think it’s wrong to turn down a chance to help others when they are able. What should I do to make sure my boss’s intentions are understood while not being off-putting or appearing holier-than-thou?\nBleeding Heart\nDear Bleeding Heart:\nThe person who should be making her intentions clear is your boss. It should not be your responsibility. Frankly, I can see both sides of this question. Some companies do this not only to “do good,” but also to build goodwill in the community and team spirit in the office. Usually, participation is voluntary.\nDear Abby:\nMy boyfriend and I have been together for two years. He’s eight years younger than I am. We have a great relationship except for our worldviews. While I am liberal, he is very racist. When the subject comes up, our conversations can become very heated.\nI believe everyone is entitled to his/her opinion, but both of us have a hard time validating our opinions for each other. My boyfriend never directs his racist comments toward anyone in particular, but it’s hard for me not to take it that way.\nOne of my best friends is African-American, and my son is currently dating someone who is biracial. How do we agree to disagree without anyone being upset or hurt in the end?\nOpen-Minded in Indianapolis\nDear Open-Minded:\nAfter two years of togetherness, your boyfriend knows full well that one of your best friends is African-American and that your son is dating someone who is biracial. You may never be able to broaden his mindset, but the next time he makes a racist remark, if you haven’t already, tell him you don’t want to hear it because it makes you uncomfortable.\nMake sure he understands that if he says anything that could possibly hurt your friend or your son, the romance will be history.\nP.S. You must be desperate for companionship to have tolerated this for two years.\nDearAbby.comDear AbbyP.O. Box 69440Los Angeles, CA 90069Universal Press Syndicate", "url": "https://apnews.com/d149ce9eecd544c28dc8f3e2815d25e0"}