{"authors": ["Leigh Phillips", "Michal Rozworski", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic"], "date_download": "2020-05-04 19:56:29", "date_modify": "2020-05-04 19:56:29", "date_publish": "2017-08-29 00:00:00", "description": null, "filename": "2017_08_planning-the-good-anthropocene_1588622189.html", "image_url": "https://images.jacobinmag.com/2017/08/29100918/jacobin_sergiomembrillas_fullpage-wordpress.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_08_planning-the-good-anthropocene_1588622189.html", "title": "Planning the Good Anthropocene", "title_page": "Planning the Good Anthropocene", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nWhat is profitable is not always useful, and what is useful is not always profitable. Worse still, many things that undermine human flourishing or even threaten our existence remain profitable, and, without regulatory intervention, companies will continue to produce them. This — the market’s profit motive, not growth or industrial civilization — caused our climate calamity and the larger biocrisis. It would be very useful to wind down our species’s combustion of fossil fuels, responsible as it is for roughly two-thirds of greenhouse gas emissions. It would be useful, too, to increase input efficiency in agriculture, which, together with deforestation and land-use change, is responsible for most of the remaining third. We know how to do this. A vast build-out of dependable base-load electricity from nuclear and hydroelectric plants, supported by more variable renewable energy technologies such as wind and solar, could replace nearly all fossil fuels in short order, cleaning up the grid and delivering enough clean generation to electrify transport, heating, and industry. Decarbonizing agriculture is more complicated, and we still need better technology, but we understand the overall trajectory. Unfortunately, wherever these practices do not create profit, or do not create enough profit, companies will not put them in place. We hear regular reports claiming that investment in renewable energy is now outpacing investment in fossil fuels. This is good, though often the result of subsidies for market actors, themselves often derived from hiking the price of electricity rather than taxing the wealthy, thus hitting working-class communities. Even if, in relative terms, more money is going toward wind and solar than toward coal, the absolute increase in combustion from developing nations will likely push us past the 2°C limit most governments have agreed is necessary to avoid dangerous climate change. Simply put, the market is not building enough clean electricity, nor abandoning enough dirty energy, nor doing either quickly enough. The relatively simple directive to “clean up the grid and electrify everything” that resolves the fossil fuel part of the equation doesn’t work for agriculture, which will require a far more complex set of solutions. Here too, as long as a particular practice rakes in money, the market will not abandon it without regulation or public-sector replacement. Liberals and greens argue that we should include the negative impacts of fossil fuel combustion (and its agricultural corollaries — some suggest a nitrogen tax) in fuel prices. Once these externalities increase the carbon price to $200 or $300 per ton, the market — that efficient allocator of all goods and services — will resolve the problem. Leaving aside the grotesque inequalities that would result from steadily ratcheting flat taxes up when working-class and poor people spend a larger proportion of their income on fuel, carbon-tax advocates ignore that their solution to climate change — the market ­— is the very cause of the problem.\nThink Bigger How will a carbon price build a network of electric-vehicle, fast-charging stations? Tesla only builds them in cherry-picked areas where it can rely on profits. Like a private bus company or an internet provider, Elon Musk won’t provide a service where that doesn’t make money. The market leaves the public sector to fill the gap. This is no abstract argument. Norway provides free parking and charging for electric vehicles, it allows these cars to use bus lanes, and it recently decided to build a nationwide charging network. Now, electric vehicles account for over a quarter of total new sales, more than anywhere else. For comparison, barely 3 percent of cars in eco-friendly but market-enthralled California are electric. The upfront costs of some changes pose one obstacle. From a system-wide perspective, nuclear power still represents the cheapest option thanks to its mammoth energy density. It also boasts the fewest deaths per terawatt-hour and a low carbon footprint. But, like large-scale hydroelectric projects, construction costs are considerable. The Intergovernmental Panel on Climate Change notes that while nuclear energy is clean, non-intermittent, and has a tiny land footprint, “without support from governments, investments in new . . . plants are currently generally not economically attractive within liberalized markets.” Private firms refuse to begin construction without public subsidies or guarantees. This explains why the most rapid decarbonization effort so far occurred before European market liberalization took hold. The French government spent roughly a decade building its nuclear fleet, which now covers almost 40 percent of the nation’s energy needs. Similarly, we would need to build continent-spanning, load-balancing, high-voltage, smart transmission grids that can fend off variable renewable energy’s volatile swings. We need to plan this project on the basis of system reliability, i.e., need. A patchwork of private energy companies will only build what is profitable.\nThe Regulatory Limit Many greens call for a retreat from scale, a return to the small and local. But this, too, misdiagnoses the source of the problem. Replacing multinationals with a billion small businesses would not eliminate the market incentive to disrupt ecosystem services. Indeed, given small businesses’ gross diseconomies of scale, disruption would only intensify. At a minimum, we need regulation — that toe-dipping exercise in economic planning. A government policy that requires all firms that manufacture a particular commodity to use a non-polluting production process would undermine the advantages gained by high polluters. This is the social-democratic option, and it has a lot going for it. Indeed, we should remember how fruitful regulation has been since we gained a deeper understanding of our global ecological challenges. We patched our deteriorating ozone layer; we returned wolf populations and the forests they inhabit to central Europe; we relegated the infamous London fog of Dickens, Holmes, and Hitchcock to fiction, though coal particulates still choke Beijing and Shanghai. Indeed, much of the climate challenge we face comes from an underdeveloped Global South rightly seeking to catch up. But regulation only temporarily tames the beast, and it often fails. Capital easily slips its leash. So long as a market exists, capital will try to capture its regulatory masters. Everyone, from pipeline-blockading bullhorn-wielders to Paris Agreement-drafters, recognizes that this fundamental barrier stalls our attempts to curb greenhouse gas emissions: if any one jurisdiction, sector, or company undertakes the level of breakneck decarbonization needed, their goods and services will instantly be priced out of the global market. Only a global, democratically planned economy can completely starve the beast, but this proposal raises some basic questions. Can we impose global democratic planning all at once, in all countries, and across all sectors? Outside of world revolution, this seems unlikely. But we can keep that ideal as a lodestar, something to work toward over generations, steadily extending the dominion of democratic planning over the market. Further, should we fully eliminate the market? Wouldn’t that simply replace the rule of the market with the rule of the bureaucrat? Public ownership is insufficient — for both social justice and environmental optimization — and the fear of statism is rational. But democratic planning doesn’t have to entail state ownership. Unless they believe democracy has an upper limit, even classical anarchists should be able to imagine a global, stateless, but still planned, economy. We must ensure that any non-market mode of global governance adheres to genuinely democratic principles. We should certainly debate the public sector’s role and size. Could we seize logistics and planning powerhouses — the Walmarts and Amazons of the world — and repurpose them for an egalitarian, ecologically rational civilization? Could we turn these systems into a global “Cybersyn,” Salvador Allende’s dream of computational, democratic socialism? Let us discuss whether that’s possible and desirable, then figure out how to ensure that we rule the algorithms and that they don’t rule us. Climate change and the wider biocrisis reveal that multiple local, regional, or continental-wide decision-making structures are obsolete. No jurisdiction can decarbonize its economy if others do not. Even if one country figures out how to capture and store carbon, the rest of the world will still face an acidifying ocean. Similar truths hold for nitrogen and phosphorus flows, closing nutrient-input loops, biodiversity loss, and freshwater management. Moving beyond environmental questions, we could say the same about antibiotic resistance, pandemic diseases, or near-earth asteroids. Even in less existential policy areas, like manufacturing, trade, and migration, too many interlinked nodes tie our truly planetary society together. One of capitalism’s great contradictions is that it increases the real connections between people at the same it encourages us to see each other as monadic individuals. All this demonstrates the Anthropocene’s horror and its marvel. Humanity so fully commands the resources that surround us that we have transformed the planet in mere decades on a scale that leviathan biogeophysical processes took millions of years to accomplish. But such awesome capability is being wielded blindly, without intent, in the service of profit, not human need.", "url": "https://www.jacobinmag.com/2017/08/planning-the-good-anthropocene"}