{"authors": ["Ken Dixon"], "date_download": "2020-05-04 20:11:05", "date_modify": "2020-05-04 20:11:05", "date_publish": "2017-10-03 15:02:55", "description": "HARTFORD — The state’s largest teacher union has filed a lawsuit over school funding. The top Republican in the state Senate wants an official opinion from the state attorney general on the...", "filename": "_e7519242a9014e7985460f4f04991d18_1588623065.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e7519242a9014e7985460f4f04991d18_1588623065.html", "title": "Push back on Malloy’s budget orders", "title_page": "Push back on Malloy’s budget orders", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HARTFORD — The state’s largest teacher union has filed a lawsuit over school funding. The top Republican in the state Senate wants an official opinion from the state attorney general on the governor’s powers. And the lobbying group for towns and cities say they’re victims of the state’s historic budget impasse, which threatens to raise local property taxes.\nNow in its fourth month without a negotiated budget, Gov. Dannel P. Malloy’s executive order, cutting school aid to 85 towns, has resulted in a lawsuit filed in state Superior Court by the Connecticut Education Association, seeking to stop his move, which includes reducing $557 million in anticipated school funding, called Education Cost Sharing (ECS).\n“The governor’s ECS cuts are dangerous and would be devastating for students, parents, teachers, and communities across the state,” said CEA President Sheila Cohen, after the plea for an injunction was filed Monday. “They violate state statutes and the state’s constitutional obligation to provide adequate education to public school students. Now that severe cuts are being implemented, we must take action to prevent the potential downward spiral that could further push our schools into chaos.”\nSenate Republican Leader Len Fasano of North Haven announced Tuesday that he has made a second request of state Attorney General George Jepsen to rule on the legality of Malloy’s mid-August revision of his executive order, which first took effect on July 1, when the new fiscal year began without a budget.\n“Since the governor has now vetoed the legislature’s budget, it is imperative that lawmakers know whether or not his executive order is in fact legal, or if these changes violate statutory mandates which would require legislative approval,” Fasano wrote. “I believe it is extremely important that you respond to this outstanding request prior to a veto override session taking place so lawmakers have all the relevant information prior to deciding whether to allow the governor’s veto to stand, which will lead to his executive order remaining in effect.” Fasano wrote a similar request in August and Jepsen ruled that Malloy was acting within his powers.\nAlso on Tuesday, about 90 minutes before members of the state House of Representatives were to gather for a veto-override session that majority Democrats expect to fail, the Connecticut Conference of Municipalities held a news conference in Wallingford to stress the need to adopt a compromise budget that does not increase the local property-tax burden; relieves them from costly state mandates; and provides adequate aid for all communities.\n“Our local municipalities from the largest cities to the smallest towns are burdened by the local property tax,” said Portland’s First Selectwoman Susan Bransfield, who is also CCM’s president. “And any budget that is passed, any action that is taken, needs to have no impact on that burden. Many of the proposals that have been talked about would have substantial impacts on local property taxes and cause them to increase.”\nkdixon@ctpost.com Twitter: @KenDixonCT", "url": "https://apnews.com/e7519242a9014e7985460f4f04991d18"}