{"authors": ["Aaron Curtis", "Acurtis Lowellsun.Com"], "date_download": "2020-05-04 20:21:40", "date_modify": "2020-05-04 20:21:40", "date_publish": "2017-12-14 12:01:47", "description": "LOWELL -- Robin Gravlin glows when she talks about her son, Bobby Aguiar-Doyle. The Lowell resident's pride and joy is summed up in a story from a Christmas season years ago when Bobby was a...", "filename": "_e7c969c6b35b4be9a9a69b3c4261a8c0_1588623700.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e7c969c6b35b4be9a9a69b3c4261a8c0_1588623700.html", "title": "Lowell Family Paying It Forward, Like Their Late Son, Bobby", "title_page": "Lowell Family Paying It Forward, Like Their Late Son, Bobby", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- Robin Gravlin glows when she talks about her son, Bobby Aguiar-Doyle.\nThe Lowell resident’s pride and joy is summed up in a story from a Christmas season years ago when Bobby was a teen.\nGravlin and her husband had gone Christmas shopping for Bobby. When they arrived at the store, they found the Tewksbury Fire Department at the entrance collecting for the Toys for Tots program.\nDesigned to provide toys for children of parents who cannot afford them, the couple decided to buy a bicycle for the program. However, the cost of the new bike resulted in the couple leaving the store without crossing anything off Bobby’s Christmas list.\n“We went home and I said, ‘Guess what Bob? I bought a bicycle for a Toys for Tots kid,’” she said. “I jokingly said to him, ‘That was all the money we had for Christmas this year.’”\nIt was just a joke, Gravlin said, but she pointed out that Bobby’s reaction to her jab sums up who her son was.\n“He was so happy,” Gravlin said. “Just the thought that the little kid was going to have a great Christmas. He didn’t care if he got anything or not.”\nBobby was quick to help out. For example, while enrolled at St. Stanislaus School, he earned the Christian Witness Award through the Boston Archdiocese, given to those showing outstanding character and concern for others.\n“He just had a good soul,” Gravlin said.\n“He learned at an early age that you have to work hard for what you have,” she added. “I think through that lesson he learned that when you have more than what you need you should help someone else.”\nGravlin’s world came tumbling down when tragedy struck on July 13, 2015. At 20 years old, Bobby was killed in a motorcycle crash on Interstate 93 in Salem, N.H.\nWith the anguish of losing her only son came Gravlin’s desire to ensure Bobby’s kindness could still be felt even though he was gone. To make that happen, she started Bobby’s Legacy Foundation this past summer.\nThe goal of the foundation: “You don’t have to give so much to affect someone’s life,” Gravlin said.\nAs part of the foundation, every month she carries out a drive to raise items for those who need them, including backpacks, sweatshirts and blankets.\nShe also started distributing “pay it forward” cards, or as Gravlin calls them, “Bobby’s Cards.” A person who has the card buys something for someone else, and then leaves the card so the good deed can be continued.\n“The card says, ‘I hope this loving act of kindness brightens your day,‘” Gravlin read. “Spread the love and please reuse this card to surprise a stranger. Kindness inspires kindness. A simple act multiplied by millions of people can change the world. In loving memory of Robert “Bobby” M. Aguiar-Doyle.’”\nThe card caught on.\n“Initially, I thought it was just going to be close family and friends,” she said. “But between August and now, I have cards showing up in California and I have cards as far down as Florida. I want to say eight or nine states that we’re up to now and we’ve put about 1,000 cards out there.”\nBut there’s more to the story.\nBobby was a monstrous Boston Bruins fan. For his funeral, Gravlin encouraged attendees to wear Bruins jerseys. His funeral procession included cars waving the yellow-black flag of the Bruins. Bobby’s casket was engraved with hockey sticks and the Lowell High grad was buried in the jersey of his favorite player, goalie Tuukka Rask, with a hockey stick.\nRask received word and, shortly after the funeral, reached out to Gravlin, asking how he could contribute to the family. Gravlin suggested a couple of box-seat tickets to a game -- a request that was granted.\nMore recently, Gravlin received another call from Bruins officials. This time, not only is she getting a few tickets to a game -- Bruins against the Washington Capitals for tonight’s game -- but she’s going to be recognized for her charity work.\nGravlin received the team’s Community Playmakers Award, given to those “dedicated to improving the lives of others and being a force of good,” according to the Bruins website.\nA film production crew will be coming to her house to shoot a video that will allow Gravlin to explain the foundation and to talk about her son. The video will then be aired between periods during the game on the TD Garden’s video scoreboard.\n“I’m so looking forward to doing these things for others and having a chance to tell Bobby’s story,” she said.\nTo get a Bobby’s Card or to learn more about Bobby’s Legacy Foundation, visit facebook.com/bobbyslegacyfoundation .\nFollow Aaron Curtis on Twitter @aselahcurtis", "url": "https://apnews.com/e7c969c6b35b4be9a9a69b3c4261a8c0"}