{"authors": ["Jacob Onak", "Jonak Dailyunion.Com"], "date_download": "2020-05-04 20:08:30", "date_modify": "2020-05-04 20:08:30", "date_publish": "2017-02-24 14:53:00", "description": "LAKE?MILLS — At this time in the season, all coaches want to see their team do is quickly get down to business. Well, the Lakeside Lutheran High School boys’ basketball team had no problem...", "filename": "_877d872bd82543daaec6dabf22313bb3_1588622910.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_877d872bd82543daaec6dabf22313bb3_1588622910.html", "title": "Lakeside manhandles Marshall; Boys bball roundup", "title_page": "Lakeside manhandles Marshall; Boys bball roundup", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LAKE?MILLS — At this time in the season, all coaches want to see their team do is quickly get down to business.\nWell, the Lakeside Lutheran High School boys’ basketball team had no problem doing that for head coach Kirk DeNoyer at home on Thursday, as the Warriors got out to an early lead and cruised to a 73-26 win over Marshall in the regular season finale.\nMarshall was without two of their three top scorers, including Reece Leistikow, who leads the team and the Capitol South by averaging 25 points per game.\n“I know Marshall had a couple guys missing with some sickness and stuff, so that put them in a tough position, but none-the-less, I thought our guys responded and played hard and played pretty well,” DeNoyer said.\nThe Warriors (15-7) wasted no time getting to the shorthanded Cardinals, as Cameron Kuepers earned six points, Will DeNoyer hit a 3-pointer and Jack Monis added a basket to earn a 11-0 lead and force an early Marshall timeout with 13:54 to go in the half.\nOut of the timeout, Monis and Kuepers hit back-to-back baskets for a 15-0 lead, holding Marshall scoreless until Adam Wehking put in work in the paint to make it 15-2 with 11:02 left to go.\nIt was the Warriors (15-7 overall) aggressive defense at the point that really hurt Marshall (9-13), forcing turnovers for easy transition baskets.\n“I think we were real aggressive on defense, and we pushed the ball up the court the way we wanted to,” Kirk DeNoyer said.\nThe fast lead just kept growing bigger and bigger for the Warriors.\nKuepers hit his 16th point to make it 25-8 with 5:49 to go, and the Warriors would close out the first half with a 41-14 lead.\n“I thought the guys were communicating well on defense,” Kirk DeNoyer added.\nIn the second half, DeNoyer was able to use some heavy bench rotation, and get guys plenty of minutes on Senior Night and before their playoff run.\nSeniors Eli Gartner, Justin Rue and Luke Willems each added six points in the second half, and Lakeside got it to a running clock with 6:45 left in the game with a 64-24 lead.\nOther seniors Josh Higgins and Jacob Constein got plenty of minutes as well, and the seniors were able to have their night.\n“It was great to see all of our seniors get a lot of playing time and the guys that came off the bench did an outstanding job for us,” Krik DeNoyer said. “They deserve it after all the hard work they put into practice every week.”\nKuepers finished with a game-high 18 points, while Willems added 13 and Monis finished with six.\nMarshall’s Jonathan Wiltzius had a team-high eight points, while Wehking and Quinn Killerlain each added six.\nWIAA REGIONAL\nThe No. 5 Warriors will stay home for their first-round WIAA?Division 3 Regional game, as they host No. 12 St. John’s NW Military School at 7 p.m.\n“We need to shoot the ball well,” Kirk DeNoyer said. “We’ve played pretty consistent defense all year, but when we shoot the ball well, we’ve been pretty competitive with good teams.”\nLAKE?MILLS?87\nNEW?GLARUS?71\nBrady Wagner, Hayden Iverson and Alex Ranney put on a shooting clinic for the Lake Mills High School boys’ basketball team in a battle of champions on Thursday.\nWagner hit eight 3-pointers, Iverson six, while Ranney went 11-of-13 from the free throw line as the trio combined for 77 of Lake Mills 87 points as the Capitol North champs took down New Glarus, the Capitol South champs, 87-71 at home.\nWagner finished with a game-high 32 points on Senior Night and tied Iverson for the school record in 3-pointers in a game, while Ranney added 23 and Iverson hit 22 points.\nLake Mills (20-2 overall) got a 36-25 lead in the game and finished 17-of-21 from the free throw line.\nNew Glarus (18-4) was led by Jaden Kreklow’s 16 points, and as a team the Glarner Knights hit eight 3-pointers.\nWIAA?REGIONALS\nThe L-Cats will once again be a No. 1 seed in the WIAA?Division 3 Regionals and will get a first-round bye. They take on the winner of No. 8 Whitewater and No. 9 Marshall on March 3, at 7 p.m.\nCAMBRIDGE?58\nLODI?48\nJust call Cambridge the comeback kids.\nDown 32-19 at halftime, the Blue Jays fought their way back in the second half, outscoring host Lodi 39-16 and taking a 58-48 regular season finale road win.\nJacob Horton had a game-high 24 points for Cambridge (8-14) while Ryan Jansen finished with 13 and Jacob Hommen added 11.\nLodi (8-13) was led by 14 points from Jacob Kolisnki and 10 points from Logan Walzer.\nWIAA?REGIONALS\nCambridge pulled a No. 8 seed in the WIAA?Division 4 Regionals, and will host No. 9 Lancaster on Feb. 28 at 7 p.m.\nEAST?TROY?74\nWHITEWATER 59\nThe Whitewater High School boys’ team had no answer for East Troy’s Ciriacks, as the Whippets fell 74-59 in the Rock Valley Conference and regular season finale.\nThe Whippets allowed 28 points from Ciriacks, and at halftime found themselves in a 16 point hole that they couldn’t dig out of.\nLogan Rasmussen had a team-high 19 points for Whitewater (9-13 overall. 7-9 Rock Valley) while Daniel Fuller hit four of the Whippets six 3-pointers and finished with 18.\nEast Troy (13-7, 12-4) had four of their six scorers in double-digits, as A.J. Vukovich poured in 13 points, Jared Brehm finished with 12, and Michael Polakoski tallied 11.\nWIAA REGIONALS\nIn the first round of the WIAA?Division 3 Regionals, No. 8 Whitewater will host No. 9 Marshall on Tuesday at 7 p.m. The winner will head to Lake Mills for a matchup with the No. 1 L-Cats.\nWALWORTH BIG?FOOT 63\nPALMYRA-EAGLE 44\nThe Palmyra-Eagle boys’ basketball team couldn’t finish the conference and regular season on a good note, and fell 63-44 at home to Walworth Big Foot.\nThe Panthers were outscored by nine points in the first half and 10 points in the second half, allowing nine total Chief (7-15 overall, 6-10 Rock Valley South) scorers.\nLogan Eischeid had a game-high 20 points, while Beau Cary added 11.\nThe Panthers (8-14, 2-14) were held to just 16 points in the first half, and the only player in double-digits was Brady Olson, who finished with 15 points.\nWIAA?REGIONALS\nThe Panthers drew a No. 14 seed in the WIAA?Division 3 playoffs and will head to No. 3 Beloit Turner on Tuesday for a 7 p.m. first round matchup.\nALCS?74\nJOHNSON?CREEK 45\nFollowing a double-overtime loss at home to ALCS on Tuesday, the Johnson Creek boys’ basketball team couldn’t get their revenge, falling 74-45 at ALCS.\nCole Ducklow didn’t get much help from his Bluejay teammates in the Trailways South Conference game, as he hit a team-high 24 points, but no other Johnson Creek player had more than six points.\nALCS (5-18 overall, 4-13 Trailways South)?on the other hand was led by 30 points from Austin Rockwell in the regular season finale, while Michael Rhatican finished with 11 points. Will Donahoe also added nine points while Ryan Knutson chipped in with eight.\nJohnson Creek (1-22, 1-16) allowed ALCS to put up 45 second half points in the loss.\nWIAA?REGIONALS\nIn the WIAA Division 5 Regionals, the Bluejays drew a No. 16 seed and will head to No. 1 Barneveld on Tuesday at 7 p.m.", "url": "https://apnews.com/877d872bd82543daaec6dabf22313bb3"}