{"authors": ["Jacob Bacharach", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Alex N. Press", "Chad Pearson", "Lily Geismer", "Adam Gaffney"], "date_download": "2020-05-04 19:59:42", "date_modify": "2020-05-04 19:59:42", "date_publish": "2017-05-05 00:00:00", "description": null, "filename": "2017_05_affordable-care-act-repeal-democrats-singing_1588622382.html", "image_url": "https://images.jacobinmag.com/2017/05/05110818/6938405729_ffcac6eaef_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_05_affordable-care-act-repeal-democrats-singing_1588622382.html", "title": "The Democratic Party Is a Ghost", "title_page": "The Democratic Party Is a Ghost", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "I’ve said before that the Democratic Party isn’t really a political party at all, but rather something closer to a think tank — a kind of failed academic enterprise whose principal output is dubious research written in the style of a press release and the occasional bemusing and ineffectual appearance on cable news.\nAlthough they endlessly carp that dastardly Republican gerrymandering has locked them ever out of real legislative power, in point of fact it’s the institution of the Democratic Party that’s benefited. The GOP gave birth to a feisty swamp monster of Tea Party activism. Convince yourself all you want that this was the result of Koch Bros astroturfing; in reality, it’s the Republican Party that’s been roiled by primary challenges to established teat-suckers; it’s the Republican Party that’s tossed out its goldfish-mouthed leadership in favor of a class of politicians really committed to exercising power.\nThe Democratic leadership looks hardly different than it has for my entire adult life, a grim and aging collection of Clinton apparatchiks totally secure in their sinecures — all the more so because the only time the party ever does use what power it has, it’s to quash any discontent from its base or its leftward flank. It would be tempting to call it a zombie, but a zombie is living dead; a zombie is compelled by a lustful, powerful hunger. A zombie is all appetite — it is more than alive. The GOP is a zombie. The Democratic Party is a ghost — diaphanous, spooky, and utterly unable to interact with the actual world. At best, it can rattle the pots, or leave a little trail of slime.\nThe ACA, which may or may not die in the Senate, only ever made sense as an intermediate step toward a universal provision of health care. It was a big, ugly, ungainly, cobbled-together thing that, for all the partisan paeans to its wonderfulness and indispensability, never really worked very well.\nThe part that did work was Medicaid expansion. In other words, the part that worked was the single-payer program that the Democrats so ardently refused — continue to refuse — to endorse. Supposedly the party of incremental progress, they seem to view each increment as the final end state of civilization and history. America Is Already Great, and all that. In order to sell progress as incremental, a series of steps in a journey of miles, there must be some destination in mind, a vision of a truly better society, an ideal. But the Democrats don’t have ideals; they just need you to be scared of Republicans.\nWell, fair enough. Republicans are scary, though given the alacrity with which the Democrats rushed to praise Donald Trump for blowing up another little piece of Syria, you have to imagine that this relative terror is a matter of proximity, that the farther you get from the border, the more it appears that the American government moves with an awful unanimity of terrible, singular purpose.\nAnyway, the thing about the health care debate, such as it is, is that while every Democrat voted “no,” no one bothered to articulate a compelling alternate vision. Republicans want to kill you! Yes, yes — look, life is a conspiracy against itself; we’re all gonna die. You become inured to this sort of thing after a while.\nWhat we want to hear is not that the seas are rising (the Republicans!) and we’re gonna die alone (the Republicans!) and tumorous on the street because our chemo costs $50,000 every half hour and a hangnail is a preexisting condition (the Republicans!). What we want to hear is that there can be a better world, that through collective endeavor we can as a people feed our poor, care for our sick, and find at least some better balance between our rapacity and the health of our planet. Instead we get negation; we get Trump is a meanie and Paul Ryan wants to eat your kids, which does not get the 40 percent of people whose boss is a meanie and who can’t pay their deductibles to the polls.\nThe specter of Democrats literally singing in the halls of Congress because they imagine that more than a year from now they’ll reap some reward from the GOP’s pettiness and failure to construct any real alternative system is just despicable. Who are these people? Even if the bill dies in the Senate, even if they take the House in 2018 . . . Liberals accuse the GOP of forgetting about people, of sacrificing public good to the cruel idols of their idées fixes, but it’s the ostensibly liberal party that is actually abstracted from the human mass; it’s Nancy Pelosi for whom this whole thing is just a career.\nThe Republican Party steers the ship of state toward an iceberg, and from below decks, Steny Hoyer gleefully cackles that this sure is gonna reflect badly on the captain. Grab your life vests people, though they may not save you, because the water’s real cold.", "url": "https://www.jacobinmag.com/2017/05/affordable-care-act-repeal-democrats-singing"}