{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:16:56", "date_modify": "2020-05-04 20:16:56", "date_publish": "2017-11-10 05:00:00", "description": "Gregory P. Coleman, a championship swimmer and lyricist, died on Sunday, Oct. 29, 2017, after a long illness. He was 62. He was born on Jan 13, 1955 to the late Carrie B. Stone and Buster L....", "filename": "_b8a2129e1eaf4e05be7fc91d35122924_1588623416.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b8a2129e1eaf4e05be7fc91d35122924_1588623416.html", "title": "Gregory P. Coleman, 62, championship swimmer", "title_page": "Gregory P. Coleman, 62, championship swimmer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Gregory P. Coleman, a championship swimmer and lyricist, died on Sunday, Oct. 29, 2017, after a long illness. He was 62.\nHe was born on Jan 13, 1955 to the late Carrie B. Stone and Buster L. Mitchell in Philadelphia. As a youngster, he loved the outdoors and playing outside in his North Philadelphia neighborhood. Affectionately known as “Reds,” Coleman was educated in the Philadelphia public school system and graduated from Simon Gratz High School.\nColeman was an excellent swimmer and as a teen, began swimming at the pool at Amos Recreation Center at 16th & Berks Streets. He excelled in the sport under the tutelage of Coach Dan Corbitt and began to compete as a member of the center’s swim team. Coleman won many trophies for his athletic talent and transferred that gift to working as a lifeguard for the Department of Recreation during the summer for 20 years. He also played basketball at Gratz and excelled at that sport as well.\nA sociable young man, Coleman loved to dress in the latest styles to impress the young ladies. He joined the “Congressional Soul Gents,” one of the numerous teen social clubs that hosted waistline parties and socials at that time in Philadelphia.\nColeman continued his education at Bethune-Cookman College and Lincoln University where he studied religion. He worked as a sales representative for the Afro-American Press, selling educational and multi-cultural literature to universities, colleges and libraries.\nColeman had a long, loving relationship with Pamela Gambrell. This union produced three children, Carrayah, Gabriel and Carrynn. He was raised to respect and obey his elders and tried to install those virtues in his children.\n“His children were the joy of his life and he never stopped talking about them,” said his sister, Erin.\n“Greg wanted nothing but the best for his children and would sometimes cry if he could not do everything for them.”\nColeman was a creative soul who loved music and was proud to be a lyricist. His musical talent as a writer was demonstrated on CD’s like “Exit 45,” published in 2002 on RTRW Records LLC. He was proud to be co-writer on “Try Me” and “A Little Help,” featuring vocalist Diane Johnson.\nColeman loved people, helping others and making people laugh with his smile.\n“If he cornered you, he would tell you of his dreams to meet famous entertainers, get his songs published, and take care of children and family who he revered,” recalled family members.\nColeman was baptized at an early age at the Met while attending services with his late Aunt Bernetta Harrell. He attended many churches throughout the years until he found his church home at Bethel Baptist Church. He enjoyed helping his church, and Pastor Bruce Oxford and the congregation embraced him with open arms. They reached out to Coleman when he began to get ill and visited him, conducting church services at the nursing home during his time of need.\nHe was predeceased by his parents and siblings, Joanne, Narvel, Bobby, Johnny, Roosevelt, Irving and Shermon Mitchell.\nIn addition to his children and sister, he is survived by: his siblings, Patsy Jones, Ballard, Curtis, Ruby Oakley, Tyra Cobb, Marcus Roberts; friends, Gracien Coleman, Joe Gore, John Cromwell and other relatives and friends.\nPrivate services will be held on Saturday.\nG. Frank Page Jr. Funeral Home handled the arrangements.", "url": "https://apnews.com/b8a2129e1eaf4e05be7fc91d35122924"}