{"authors": ["Alex N. Press", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Ella Mahony", "Miya Tokumitsu", "Nicole Aschoff", "Kevin Young", "Diana C. Sierra Becerra"], "date_download": "2020-05-04 20:00:11", "date_modify": "2020-05-04 20:00:11", "date_publish": "2017-10-06 00:00:00", "description": null, "filename": "2017_10_harvey-weinstein-sexual-harassment-women-union_1588622411.html", "image_url": "https://images.jacobinmag.com/2017/10/06143343/GettyImages-645658150.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_10_harvey-weinstein-sexual-harassment-women-union_1588622411.html", "title": "The Union Option", "title_page": "The Union Option", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Sexual harassment is in the news again. Yesterday, the New York Times published an investigation revealing “previously undisclosed allegations against Mr. [Harvey] Weinstein stretching over nearly three decades.” Weinstein, an Oscar-winning movie producer and one of the most powerful people in Hollywood, used his position in the entertainment industry to abuse women, overwhelmingly young women new to the movie business.\nThe story details abusive behavior — such as Weinstein “badgering” women into giving him naked massages or asking if they would watch him shower — that reveals a man who gets off not so much on sex as on dominating women who he suspects are powerless to fight back. That he got away with it for decades, and is only being outed now, as his power is fading — slowly, to be sure — suggests he was right.\nBut there’s another thread that comes through, one of women helping other women protect themselves in a situation where the power differential between Weinstein and themselves is staggering. We read of Lauren O’Connor writing a memo denouncing her boss’s conduct. We see Ashley Judd tell the Times reporters, “Women have been talking about Harvey amongst ourselves for a long time, and it’s simply beyond time to have the conversation publicly.” We are informed that “one woman advised a peer to wear a parka when summoned for duty as a layer of protection against unwelcome advances.” And we get anonymous quotes, from women employed or formerly employed by Weinstein, confirming the allegations.\nIn an era when so many of us know how widespread workplace sexual harassment is, it’s important to take in the details of a rare case of a harasser being publicly accused. This is the exception to the rule, which is that powerful men like Weinstein get to harass and assault women until they die, no matter how many people in their industries know about it.\nBut having digested these details, we — or at least those of us concerned with fighting these injustices — arrive at a question: What do we do about it? We live in an era where “feminism . . . is cool,” at least according to those liberal feminists whose politics fit comfortably with feminism-as-brand, and yet sexual harassment, in the workplace and outside of it, continues unabated.\nAfter the publication of the Times article, lots of women took to Twitter to tell their stories of workplace sexual harassment. But the proud feminist tradition of consciousness-raising — this time in a distinctly 2017 form, tweeting — cannot stop workplace sexual harassment. It’s a way to make those few of us unfortunate enough to use Twitter feel less alone, and to educate our male counterparts about the thorny persistence of harassment in our supposed feminist age. But when it comes to stopping that harassment, its effect is negligible at best.\nSo, again, what can we do to reduce workplace sexual harassment?\nTo answer that, let me start with a few snapshots of my own.\nAge seventeen: during my first shift as a waitress, a customer leaves me his number instead of a tip — I am an embarrassed kid, so I don’t tell anyone.\nAge twenty: I ask a professor for a recommendation to graduate school. He responds by asking me if I have a boyfriend. I do not reply, to that email, or ever again. I do not get into a PhD program that year.\nAge twenty-one: during my first shift as a hostess at a restaurant, one of the bartenders propositions me, multiple times. When I finally seek advice from our manager, he responds, “Well, you were hired to be looked at.” I walk out mid-dinner rush that same day, and never go back.\nAge twenty-two: I am a new PhD student. One of the other students informs me to avoid X, a male professor. “He touches the female students he works with, like, a lot.” I change what I plan to focus on in the program, so as to avoid working with him.\nWhat do these stories have in common? Beyond the obvious — they’re all cases of workplace sexual harassment — in each case, I acted alone, and the action I took worsened my life. I walked away from jobs, never to return even for the paycheck I was owed. I reneged on substantial intellectual goals to avoid harassers. I suffered, doubly.\nI don’t share these stories for the purpose of consciousness-raising, although if reading them makes you feel less alone, or conveys to you how often harassment happens, good. I share them to show how much we stand to lose by trying to resolve sexual harassment on our own.\nRather than trying to fight back against a harasser on her own, the safest bet for a woman is to find a vehicle to fight the issue collectively. Not only can this strengthen the power on her side — if she can only do so much on her own, her power multiplies with each colleague who stands beside her — but it protects her. Speaking out about harassment is risky when your job is on the line, but if you speak as a “we,” there is no “I” who can be identified. Sure, if the harasser only harassed me, he will know I am the one who told people. But even then, if my coworkers commit to backing me up, and taking action if I face repercussions for speaking up, it becomes much harder for that harasser to win. He can fire me — or get me fired if he isn’t the boss — but he can’t fire all of us.\nThe above scenario is a type of collective action, one that is closer to the informal side of the spectrum that runs from informal to formal action: workers confront a harasser, threatening to take action, be it direct action or legal action, if the harassment doesn’t end. It’s a step beyond the actions we read about in the Times story, of individual women warning other women of Weinstein’s actions, though those women are taking informal collective action too. It’s an important step, and I have seen it stop harassment. Workers threatening to walk off the job if one of the bosses doesn’t act on information about sexual harassment can force that boss to act, if solely to keep the shop running smoothly.\nThe further workers go along the spectrum of action, predicated on their own collective strength and agency in resolving a problem as pernicious as harassment, the more effective they will be. The exercise of power, after all, builds power. When it comes to the workplace, these steps are called: unionizing.", "url": "https://www.jacobinmag.com/2017/10/harvey-weinstein-sexual-harassment-women-union"}