{"authors": [], "date_download": "2020-05-04 20:22:20", "date_modify": "2020-05-04 20:22:20", "date_publish": "2017-12-16 21:00:00", "description": "John Stamos has paid tribute to his late father after discovering he is to become a dad himself for the first time. The 54-year-old actor recently revealed he is expecting his first child...", "filename": "_62e87c26de52432d9997104bc8a3c4f7_1588623740.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_62e87c26de52432d9997104bc8a3c4f7_1588623740.html", "title": "John Stamos pays tribute to late father", "title_page": "John Stamos pays tribute to late father", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "John Stamos has paid tribute to his late father after discovering he is to become a dad himself for the first time.\nThe 54-year-old actor recently revealed he is expecting his first child with his fiancee Caitlin McHugh, and in the wake of the news he has taken to Instagram to post a glowing tribute to his own father, who passed away in 2001.\nPosting a picture of himself as a baby standing on his father’s hand as he holds him in the air, John wrote: “I will certainly fall short of the father my pop was, but - I’m going to give it my all! #Balance #BillStamos #Hero (sic)”\nIt comes after John - who also tragically lost his mother in 2014 - recently said he hopes his parents will be looking down on him to watch him enter parenthood himself.\nHe said: “It kills me that my parents aren’t here to be part of this, but I know it probably wouldn’t be happening if they weren’t up there. You know how you put your father on a pedestal, and he’s a superhero, and then as you grow older, you go, ‘Ah, he’s just a man’? I never got to that point. Till the day he died, he was bigger than life to me.”\nThe ‘Fuller House’ star admitted he has “always wanted” to be a dad, but at 54, he was worried he had left it too late.\nHe said: “I always wanted to be a dad. Clearly I had to do some work on myself first. I have a youthful thing. People say, ‘Oh, you look young.’ You start believing you’re gonna live to be 150. And then you wake up and go, ‘No, man, this is it. This is not a rehearsal.’ ... People would say, ‘You should have a child.’ I was like, ‘That ship has sailed.’”", "url": "https://apnews.com/62e87c26de52432d9997104bc8a3c4f7"}