{"authors": ["Eli Francovich"], "date_download": "2020-05-04 20:26:48", "date_modify": "2020-05-04 20:26:48", "date_publish": "2017-01-17 00:00:00", "description": "Voters in Coeur d’Alene will be asked to approve a $35.5 million bond measure and a $32 million operating levy in March. Due to increasing property values, tax rates would not increase if...", "filename": "_9e1537abb6ed4ee09339591b9210e9eb_1588624008.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9e1537abb6ed4ee09339591b9210e9eb_1588624008.html", "title": "Coeur d’Alene schools to ask voters for $68 million in a construction bond and operating levy", "title_page": "Coeur d’Alene schools to ask voters for $68 million in a construction bond and operating levy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Coeur d’Alene schools to ask voters for $68 million in a construction bond and operating levy\nVoters in Coeur d’Alene will be asked to approve a $35.5 million bond measure and a $32 million operating levy in March.\nDue to increasing property values, tax rates would not increase if both the bond and levy are approved. The rate is currently $2.31 per $1,000 of assessed property value.\nThe Coeur d’Alene school board voted 4-1 in favor of the bond last week; the board approved the operating levy in December.\n“The No. 1 need has to do with growth,” said district Superintendent Matthew Handelman. “Our district has been growing.”\nIn the last five years, enrollment has grown by about 500 students, said Casey Morrisroe, chair of the board of trustees.\n“The longer we wait the more overcrowded we are going to get,” he said. “And the farther behind we will get.”\nIf approved by voters, the bond money will be used to build a new elementary school in the northwest part of the district, he said. Additionally, it would pay for upgrades to both high schools, renovating Lakes Magnet Middle School, expanding Dalton Elementary School and installing a wood floor in the Hayden Meadows Elementary School gym. Currently, Hayden Elementary has a carpeted gym floor.\nBoth Lake City and Coeur d’Alene high schools were built for around 1,200 students. They each have more than 1,500 currently. Districtwide there are 37 portable classrooms, 22 of which are being used by elementary schools.\nAlthough there is some risk to running both a bond and a levy together, Handelman said there is “a great advantage to running parallel campaigns.”\nMore than 20 percent of the district’s operating funds come from levy monies, Handelman said. He added that a levy that’s called “supplemental” has “become absolutely essential to our day-to-day operations.”\nAnother reason to run the bond and levy concurrently is because under Idaho law, levies can only run for two years. If the district had waited to run the bond next year, that would have meant “running a $30 million election three years in a row,” said Morrisroe.\n“I’m nervous, too, about running these,” he said. “These are big dollar amounts and they are critical to our operation, I think both of them are.”\nThe bond needs 66 percent approval to pass.\nVoters approved a $15 million-a-year school levy in March 2015. They passed a $32.7 million bond in 2012.", "url": "https://apnews.com/9e1537abb6ed4ee09339591b9210e9eb"}