{"authors": ["Kip Hill"], "date_download": "2020-05-04 20:27:45", "date_modify": "2020-05-04 20:27:45", "date_publish": "2017-01-05 00:00:00", "description": "Spokane will fight to keep the zombies, and film crews, interested in filming in Washington. Citing the success of “Z Nation,” the Syfy series headquartered in the Lilac City, the City...", "filename": "_7e27af0cd23c46fdb84ebd4033419f4f_1588624065.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7e27af0cd23c46fdb84ebd4033419f4f_1588624065.html", "title": "State incentives for film production, used by Spokane-based ‘Z Nation,’ are set to expire", "title_page": "State incentives for film production, used by Spokane-based ‘Z Nation,’ are set to expire", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Spokane will fight to keep the zombies, and film crews, interested in filming in Washington.\nCiting the success of “Z Nation,” the Syfy series headquartered in the Lilac City, the City Council will vote this month to support re-upping and expanding the program. The resolution, sponsored by City Council President Ben Stuckart, would add to the support already shown by Greater Spokane Inc., the area’s chamber of commerce.\n“Everybody would probably agree, we wish we could have a level playing field and wouldn’t have to have a film tax incentive program,” Stuckart said. “But you’ve also got to compete.”\n“Z Nation” is a major beneficiary of the decade-old incentive package that’s funded through tax breaks in return for cash contributions to the program.\nThe Motion Picture Competitiveness Program was created by the Washington state Legislature in 2006 as a way to attract crews filming movies, TV shows and commercials to the state to employ local labor and buy local goods. Lawmakers have already extended the program once, after the fund faced a previous sunset date in June 2011.\nThe program provides up to $3.5 million annually to qualifying projects shot in Washington. It’s funded by cash contributions from hotels, banks and other businesses in return for a tax credit against the companies’ business and occupation taxes. Most of the $3.5 million available annually is being funneled to the Spokane production.\n“Our immediate goal is to get it funded,” said Amy Lillard, the executive director of the nonprofit Washington Filmworks, which oversees distribution of the fund’s cash. “Would we like an opportunity to expand the program? Absolutely. But do we recognize that the program keeps people here, and not moving to L.A.? Yes.”\nAccording to a 2015 study by the Joint Legislative Audit & Review Committee, which employs nonpartisan researchers to evaluate state policies, 37 states have some type of incentive program for the film industry. Washington’s annual cap of $3.5 million ranks near the bottom of available funding. The amount is far less than New York and California, which offer hundreds of millions of dollars annually in credits to film production crews, but also well below Oregon’s $10 million limit.\nLillard said that disparity has led to many projects choosing to film in Portland and surrounding areas, rather than employing Washington state talent.\n“They have three ongoing, episodic series at any time,” Lillard said. “They have similar locations, they have a similar crew base. They’re a similar industry as ours. I’d like to have that opportunity to have three episodic series at any given time.”\nEfforts to grow the program have stalled in the state Legislature over the past year, despite bipartisan support. A year ago, Democratic Rep. Marcus Riccelli and Republican Sen. Michael Baumgartner penned a joint op-ed calling for renewal and expansion of the credit. A bill that would have done just that, calling for a stairstep increase to the project’s funding to match Oregon’s $10 million cap by 2020, died in committee during the 2016 legislative session.\nRiccelli said he hopes to introduce a bill soon that would extend the program through 2022 at current funding levels, though he acknowledges trying to get lawmakers to forgo potential tax revenue in a year when school funding promises to dominate discussion could be difficult.\n“We’re going through a tough budget year,” Riccelli said. “There are a lot of competing interests for dollars. I didn’t want to risk playing any politics with trying to get huge additional sums of money. I just wanted to provide consistency.”\nLillard said the program, whose funds were mostly expended in support of “Z Nation” in 2016, has seen an increased demand over the past several years. A couple of years ago, program funds weren’t doled out until March or April, she said. But last year, the well ran dry in January, and there’s already a larger demand for cash this year than what’s available in the fund, she said.\nFilmworks staff receive itemized receipts and other documents to prove production companies employed local workers and bought local goods before receiving compensation. Juan Mas, a local filmmaker who’s received credits for “Z Nation” and a number of other Hollywood projects, including the 2011 Nicolas Cage action flick “Drive Angry,” said Washington’s program has more oversight than other places he’s worked, including North Carolina and Louisiana.\n“Not a dollar goes out of the fund until they’ve completely been audited and every itemized column has been checked,” Mas said. “Lawmakers, they see it as an expenditure, they don’t see it as an investment sometimes.”\nSupporters say the benefits of the incentive are seen not only in employment, but also in economic returns to the region and in training of local talent who can find gainful employment without leaving for the coasts.\n“Z Nation,” which was renewed for a fourth season by Syfy in November, has generated $55 million worth of economic activity in the state, said Julie Daman, director of operations and finance for Washington Filmworks.\nDespite bipartisan support, the program audit in 2015 showed some warning signs. The audit committee reported that the state was only recouping six cents of new tax revenue for every dollar of credit they extended to businesses, resulting in a net subsidy each year of roughly $3.3 million to the industry. In addition, the audit found 90 percent of the work performed under the program was completed by workers making below the Washington average hourly wage.\nLillard said those numbers are more favorable for “Z Nation,” with average hourly crew wages reported at $35.05 for the production in Spokane. That work is seasonal. Riccelli also pushed back against the 6 percent return rate on investment, saying he didn’t believe it took into account all the taxes collected at various points for Washington goods and services. The support group Keep Washington in Film estimates $10 of economic benefit results from every tax dollar spent on the program, but they don’t specify how those benefits are quantified.\nBoth Lillard and Riccelli said after a decade, the program has produced a stable, episodic series, which was its goal in the first place.\n“Who would have thought, when we launched this program 10 years ago, literally, that we’d be the home of a Syfy series? It’s such a good story,” Lillard said.", "url": "https://apnews.com/7e27af0cd23c46fdb84ebd4033419f4f"}