{"authors": ["Steven Litt", "The Plain Dealer"], "date_download": "2020-05-04 20:28:44", "date_modify": "2020-05-04 20:28:44", "date_publish": "2017-12-17 11:02:05", "description": "Cleveland Museum of Art acquires \"Name Announcer,\" its first performance art piece (photos) CLEVELAND, Ohio – Don't be surprised this spring if a performer in a tuxedo at the Cleveland...", "filename": "_bc467bcaa3504992830603585848230b_1588624124.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bc467bcaa3504992830603585848230b_1588624124.html", "title": "Cleveland Museum of Art acquires \"Name Announcer,\" its first performance art piece (photos)", "title_page": "Cleveland Museum of Art acquires \"Name Announcer,\" its first performance art piece (photos)", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cleveland Museum of Art acquires “Name Announcer,” its first performance art piece (photos)\nCLEVELAND, Ohio – Don’t be surprised this spring if a performer in a tuxedo at the Cleveland Museum of Art politely asks for your name as you enter a gallery and then announces your arrival to everyone within earshot as if you were royalty.\nThe newest round of acquisitions at the museum includes the right to enact “Name Announcer,” a major work by the important contemporary French performance artist Pierre Huyghe.\nConsidered a leading example in the “Relational Aesthetic” genre and the first work of its kind to enter the museum’s collection, “Name Announcer” was performed at the Huyghe retrospective exhibition organized by the Centre Pompidou, which then traveled to the Museum Ludwig, Cologne, and the Los Angeles County Museum of Art in 2014–15, the museum said in a news release.\nThe work relates to two other works in the museum’s collection of contemporary art including Sol LeWitt’s “Wall Drawing #4” (1969), and Anicka Yi’s “Washing Away of Wrongs” (2014), according to the museum.\nLike “Name Announcer,” “Wall Drawing #4″ can be realized when the museum follows a set of instructions, which it purchased along with the right to re-create the piece. Yi, a contemporary New York-based artist, considers Huyghe an important influence, the museum said.\nThe museum said it expects to have “Name Announcer” performed in its contemporary galleries this spring in conjunction with the upcoming show, “Recent Acquisitions, 2014–2017,” in its Julia and Larry Pollock Focus Gallery.\nOther items in the latest round of acquisitions approved earlier this month by trustees include an oil painting on copper by 17th-century German painter Johann König, and artworks from the collection of the late Frances P. “Franny” Taft, a revered art history professor who taught for 62 years at the Cleveland Institute of Art.\nAlso joining the collection were 23 photographs by Andrea Modica and Jeffrey Whetstone originally commissioned by the George Gund Foundation for its annual report.\nThe foundation made the donations in honor of its former director, David Bergholz, who initiated the practice of commissioning contemporary photographers to illustrate the annual report.\nTaft, who died in May at age 95, bequeathed to the museum a necklace and brooch by the important 20th-century American goldsmith John Paul Miller, and a pair of candlesticks made by Miller and his mentor, Cleveland silversmith Frederick Miller.\nAlso included in the gift is “Bend at Storm King,” a 1950 landscape by Cleveland School painter Carl Gaertner.\nThe König is a small, vividly colorful depiction of “The Resurrection of Christ,” painted in 1622.\nThe museum described the painting as merging the Mannerist aesthetic, with powerfully muscled bodies in twisted poses, and a bright, acidic palette with a dynamic, action-packed composition characteristic of Baroque style.\nThe work will be among those scheduled for exhibition in the “Recent Acquisitions” show this spring.", "url": "https://apnews.com/bc467bcaa3504992830603585848230b"}