{"authors": [], "date_download": "2020-05-04 20:05:46", "date_modify": "2020-05-04 20:05:46", "date_publish": "2017-11-24 05:11:59", "description": "An examination of social context, elitism, cultural bubbles and more, \"The Square\" is — to put it precisely — absolutely bonkers. But purposefully bonkers. It's not just that a monkey...", "filename": "_37a10edf1f294b3bb176a82f4402b232_1588622746.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_37a10edf1f294b3bb176a82f4402b232_1588622746.html", "title": "'Square' a bizarre mix of oblivious, outrageous", "title_page": "Review: 'Square' a bizarre mix of oblivious, outrageous", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "An examination of social context, elitism, cultural bubbles and more, “The Square” is — to put it precisely — absolutely bonkers. But purposefully bonkers.\nIt’s not just that a monkey casually saunters through someone’s apartment or that a small child terrorizes adults, or that a piece of supposed performance art explodes into violence. All that stuff is indeed bonkers, but so are the more placid moments, the times that aren’t supposed to feel strange but still do. Even the normal is abnormal in this film, somewhat majestically so.\nTake, for example, the closest thing the film has to a straight storyline. Our protagonist is one Christian (Claes Bang), a Tesla-driving, urbane, good-looking and powerful curator at a modern art museum in Stockholm. Early on he and a stranger protect a woman who is apparently being attacked by a madman. Christian is pleased with himself afterward — until he realizes he’s had his pockets picked clean and the entire incident was a ruse.\nUsing GPS, Christian and a co-worker trace his phone to a low-end apartment building, but have no way of knowing which specific apartment holds the thieves. So he writes a threatening letter demanding the return of his wallet and phone and puts it in every mailbox in the building, essentially accusing everyone in the building.\nThis does indeed prompt the return of his belongings, but it also sets off an unlikely feud with an immigrant boy and distracts Christian at work where he gives approval to a project that will prove both obnoxious and disastrous. But Christian lives such a life of privilege that he never imagines the damages that will unfold.\nMeanwhile, Christian lives a normal life. He is a part-time parent who wrangles two daughters. He is a single man who beds an American journalist (Elisabeth Moss, don’t fight it, she’s everywhere) only to end up in one bizarre confrontation with her followed by another. It’s normal life in the Twilight Zone.\nWriter-director Ruben Ostlund, who made a major splash with “Force Majeure,” is a master of striking contrasts. He plays class warfare, juxtaposing the rich and the homeless/helpless, but he also throws a man with Tourette syndrome into a fine arts lecture and then lets primitivism run rampant over a gathering of snobs. He’s out to startle and discomfit while still having fun, and he succeeds.\nChristian isn’t a bad person, he’s just too often oblivious, which works to his detriment. It’s hardly an uncommon condition.\nTom Long is a longtime culture critic.\n“The Square”\nGRADE: A\nRated R for language, some strong sexual content, and brief violence\nRunning time: 142 minutes", "url": "https://apnews.com/37a10edf1f294b3bb176a82f4402b232"}