{"authors": ["Marty Myers", "Staff Writer"], "date_download": "2020-05-04 20:06:40", "date_modify": "2020-05-04 20:06:40", "date_publish": "2017-11-23 00:00:00", "description": "Cullen Myers, MID Scranton Prep, Senior Repeat selection as Player of the Year. Division II MVP and all-state selection. Not only talented at putting the ball in the net, but terrific passer who...", "filename": "_fcea55a10c4447b18469ed5a636202af_1588622800.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fcea55a10c4447b18469ed5a636202af_1588622800.html", "title": "HS SOCCER: Boys All-Region Capsules", "title_page": "HS SOCCER: Boys All-Region Capsules", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cullen Myers, MID Scranton Prep, Senior Repeat selection as Player of the Year. Division II MVP and all-state selection. Not only talented at putting the ball in the net, but terrific passer who led Prep to second straight District 2 title. Scored 28 goals and had 18 assists this year. Had 84 career goals and 60 assists. Matt Cesarini, MID Valley View, Senior Division II MVP and all-state selection. Selfless, explosive player who was spark plug of most everything offensively. Scored 14 goals and set up 12 others. Eric Barczyk, MID Wallenpaupack, Senior Moved into district and named captain within two weeks of start of practice. Directed attack and scored 11 goals to go with 5 assists. Alec Buttner, FWD Scranton Prep, Junior A great scorer with special quickness who can finish with either foot. Helped lead Prep to District 2 championship by scoring 29 goals and adding six assists. Ethan Cortes, FWD Lakeland, Senior Scored 32 goals, tying own school record, and had six assists. Netted eight hat tricks, including one in six straight games. Finished with 84 career goals. Nick Pellew, FWD Mountain View, Senior Finished season with 32 goals and eight assists. Led squad to District 2 Class 1A title and first-round state playoff win with hat trick. Scored 65 career goals. Axel Mejia, FWD Blue Ridge, Senior Dynamic attacker who could score (24 goals) as well as set up his teammates (25 assists). Finished career with 96 goals and 62 assists. Mark Rinaldi, DEF Dunmore, Senior Division III MVP and all-state selection. Scored five goals and had two assists. Leadership key to defense that allowed only 15 goals in 12 league games. Liam Neary, DEF Abington Heights, Senior Exceptionally gifted decision-maker and highly accurate passer. Generated turnovers that led to goal differential of plus-32 when he was on field. Santo Insalaco, DEF Scranton Prep, Senior Unanimous first-team all-star pick. Leader on Cavaliers’ back line. Commanded center of field. Team yielded 9 goals in 19 games with him on field. Jackson Danzig, GK Abington Heights, Senior Posted 10 shutouts, allowed just four goals in 12 league games. Great communicator who reads game well. Anything played in the air was his.", "url": "https://apnews.com/fcea55a10c4447b18469ed5a636202af"}