{"authors": ["Kevin Fishbain", "Kfishbain Profootballweekly.Com"], "date_download": "2020-05-04 20:18:43", "date_modify": "2020-05-04 20:18:43", "date_publish": "2017-01-23 03:46:00", "description": "All 32 NFL teams descend on Mobile, Ala. this week for the 2017 Senior Bowl. Coaching staffs, GMs and scouts will watch the top senior draft prospects practice Tuesday, Wednesday and Thursday...", "filename": "_a9af76a6853e474a855f8b0fa8bbd659_1588623523.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a9af76a6853e474a855f8b0fa8bbd659_1588623523.html", "title": "Top prospects to watch this week in Mobile", "title_page": "Pro Football Weekly's Senior Bowl Primer: Top prospects to watch this week in Mobile", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "All 32 NFL teams descend on Mobile, Ala. this week for the 2017 Senior Bowl. Coaching staffs, GMs and scouts will watch the top senior draft prospects practice Tuesday, Wednesday and Thursday leading up to Saturday’s game.\nPro Football Weekly will be covering the practices and we will have daily notebooks with observations of players who stand out.\nBe sure to ‘like’ us on Facebook , where we will have Facebook Live videos answering questions about the top prospects.\nHere are the storylines heading into the week:\nThe quarterbacks — The top three quarterbacks won’t be in Mobile (DeShone Kizer, Deshaun Watson and Mitch Trubisky), but Carson Wentz, Dak Prescott, Russell Wilson and Kirk Cousins have participated in the Senior Bowl in recent years, so NFL teams will be hoping to uncover another mid-round starter at the position.\nOf the QBs in Mobile, Pittsburgh’s Nate Peterman is our top-ranked thrower, per Greg Gabriel. He will be on the North team along with Iowa’s C.J. Beathard and Colorado’s Sefo Liufau.\nTennessee’s Joshua Dobbs leads the group of quarterbacks on the South team, along with the intriguing Davis Webb out of Cal, who stands at 6-foot-5. Tiffin’s Antonio Pipkin will get a chance to prove he can play well against BCS talent like Wentz did last year.\nThe cornerbacks — Considered one of the deepest positions in the draft, the top corner propspects (Marlon Humphrey, Marshon Lattimore, Teez Tabor) won’t be featured at the Senior Bowl, but there should be some second- and third-round cover men who can use one-on-one drills with receivers in practice to gain some attention.\nIowa’s Desmond King, Miami (Fla.)’s Corn Elder, Michigan’s Jourdan Lewis, LSU’s Tre’Davious White, Tennessee’s Cameron Sutton, West Virginia’s Rasul Douglas, Colorado’s Chidobe Awuzie and Florida State’s Marquez White headline maybe the best position we’ll see in Mobile.\nBest of the rest — Here are other players we’ll be watching closely based on PFW’s early draft rankings on offense: Eastern Washington WR Cooper Kupp, Texas A&M WR Josh Reynolds, Alabama TE O.J. Howard, Ole Miss TE Evan Engram, Troy OT Antonio Garcia, Indiana OG Dan Feeney, Temple OL Dion Dawkins.\nDefense: UCLA EDGE Tak McKinley, Alabama EDGE Ryan Anderson, Iowa DT Jaleel Johnson, Clemson DT Carlos Watkins, Florida LB Jarrad Davis, Texas A&M S Justin Evans, Louisville S Josh Harvey-Clemons.\nThe coaching staffs — Hue Jackson and the Browns (South team) and John Fox and the Bears (North) will be coaching the seniors during the week. It offers their staffs an advantage, giving coaches an extra look into how the prospects play in practice and prepare in the film room throughout the week. Both teams need help at quarterback, while the Bears will certainly be keeping a close eye on the defensive backs, with Cleveland, who holds the top pick, needing talent on the offensive side of the ball.\nVisit ProFootballWeekly.com | View Latest E-Edition", "url": "https://apnews.com/a9af76a6853e474a855f8b0fa8bbd659"}