{"authors": ["Dennis Fujimoto - The Garden Island"], "date_download": "2020-05-04 20:10:19", "date_modify": "2020-05-04 20:10:19", "date_publish": "2017-03-31 10:45:00", "description": "KAPAA — Neill Sams of Orchid Alley in Kapaa said the orchid industry is always looking for more creative and different ways to present orchids. Sams is a regular contributor to the Garden...", "filename": "_9f5d65982bdb43e2af6fd886561d801f_1588623019.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9f5d65982bdb43e2af6fd886561d801f_1588623019.html", "title": "Beautiful, exotic", "title_page": "Beautiful, exotic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "KAPAA — Neill Sams of Orchid Alley in Kapaa said the orchid industry is always looking for more creative and different ways to present orchids.\nSams is a regular contributor to the Garden Island Orchid Society’s annual Spring Fantasy Orchid Show and Sale on April 7 and 8 at the Hanapepe United Church of Christ social hall.\n“Beautiful and exotic orchids are the focus at this year’s annual show,” said Ada Koene of the GIOS. “People are encouraged to bring their cameras to the free orchid show where they are able to see award-winning specimen and shop for orchid plants and orchid-themed crafts.”\nSams said among his newer items he will be putting out at the Spring Fantasy are the new phaelenopsis hybrids from Holland and Taiwan. These varieties will be coupled with his multiple stem varieties and his newly-developed staking displays and gift baskets.\n“This cold spell did wonders for the orchids,” said Sams, who orients his growing to phaelenopsis and vanda orchids. “The timing was perfect, and plants are spiking all over the place. In a few weeks, they’ll be ready for show and at this rate, phaelenopsis should last through Mother’s Day.”\nAmong the Dutch hybrids are plants developed through the Magic Art technique which have been very popular with customers at Orchid Alley.\n“Fely (Sams) said they’ve been selling very well, and selling to the point where we don’t have any of the more mature plants which customers are willing to pay extra for,” Neill said. “The Dutch hybrids also include multi-stem plants, something that is new among phalaenopsis. We also have a new variety — so new, they don’t have a name for it, yet — that we call ‘Neon’ because it has so many subtle shades, some of which are iridescent.”\nSams said they will also include new Taiwan hybrids which tend toward peach, orange, and yellow colors.\n“Generally, the Taiwan growers love big — the bigger and bolder, the better,” he said. “The Dutch like compact and multi-stems. One day, maybe I’ll combine them and see what comes out.”\nHe said he’ll also include plants utilizing staking techniques, including those featuring multi-stems.\n“Staking takes orchid presentation to another degree,” Sams said. “They are more compact, present a different view of the blooms, and generally, are easier to ship. But you need to select specimens for staking early so they can be trained. You can take the more mature stems, but the flower develop upside down.”\nSams said he is happy with his contributions to the Spring Fantasy Orchid Show.\n“We have a lot more in our greenhouse,” Sams said. “If the shop looks good, it’s even better at the greenhouse. With the weather going now, the phalaenopsis and Lady’s Slippers are going off. Hopefully, we’ll get some vanda kicking in as well.”\nHours on April 7 are noon to 7 p.m., and on April 8, doors are open 9 a.m. until 4 p.m.", "url": "https://apnews.com/9f5d65982bdb43e2af6fd886561d801f"}