{"authors": ["Jason Wilde For The State Journal"], "date_download": "2020-05-04 20:15:30", "date_modify": "2020-05-04 20:15:30", "date_publish": "2017-08-14 09:30:00", "description": "GREEN BAY — Brett Goode stood in front of his old locker Sunday — the same one he’d inherited from another Brett, quarterback Brett Favre, upon arriving in 2008 — and waited for his familiar white...", "filename": "_b6f5b9cbefd34ccb9e76e9fed24ff2a5_1588623330.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b6f5b9cbefd34ccb9e76e9fed24ff2a5_1588623330.html", "title": "Packers: Brett Goode feels good to be back home", "title_page": "Packers: Brett Goode feels good to be back home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GREEN BAY — Brett Goode stood in front of his old locker Sunday — the same one he’d inherited from another Brett, quarterback Brett Favre, upon arriving in 2008 — and waited for his familiar white No. 61 jersey to be re-hung inside, once the equipment guys finished their post-practice load of laundry. The belongings of one of his best friends, kicker Mason Crosby, hung in the locker two stalls down. In some ways, it felt to Goode like he’d never left.\n“Because of Mason being here and all the other guys that I’ve been here with forever and obviously the coaches … ,” the Green Bay Packers veteran long-snapper said. “It’s like home.”\nExcept temporarily, Goode is technically homeless. Unlike the rest of the veterans who have moved out of the St. Norbert College dorms and into their regular-season homes, Goode — despite having spent the previous nine seasons as the Packers’ long-snapper — never bought a place in the greater Green Bay metroplex.\n“I never owned a house. After I got cut twice by Jacksonville, I wasn’t ever buying,” Goode said following his first practice back with the team, having officially re-signed on Saturday. “I always rented. Rented an apartment, a duplex, a condo and a house over the years.\n“Had I known I was going to be here for those nine years, yeah, it probably would have been smarter to buy a house. But you never know. That’s just the approach I take.”\nAfter several hiccups in the place-kicking operation on Family Night on Aug. 5, Goode will now compete with undrafted rookie free agent Derek Hart, who’d been the only long-snapper in camp.\nBoth Goode and Hart snapped to undrafted rookie free agent punter Justin Vogel, Crosby’s current holder, during Sunday’s practice, which was closed to the public and media because the session was focused on the Sept. 10 regular-season opener against the Seattle Seahawks.\n“It can go one of two ways. Either you bow down, or you stand up and improve and bring the best out of yourself and keep going,” said Hart, whose snaps were solid during Thursday night’s preseason opener, in which Crosby made a 39-yard field goal and three extra points during the Packers’ 24-9 win over Philadelphia.“Competition brings the best out of people, I think. (Goode) did it here for nine, 10 years, so I think any little thing I can pick up from him will be good, too, along the way. We’re just going to keep truckin’ and see what happens.”\nGoode has been there himself. He took over as the Packers’ long-snapper in 2008, beating out two other candidates during a tryout after veteran Rob Davis retired after 11 years on the job and the expected replacement, J.J. Jansen, was injured in camp.\nAfter that, and until a torn ACL ended his 2015 season in December, Goode handled every special teams snap for the Packers. But the team held off on bringing him back last year until just before the start of the regular season, waiting to make sure his knee was fully healed.\nIt was, and Goode was the snapper all season, during which Crosby made 26 of 30 regular-season field goals and sent the Packers to the NFC Championship Game with a 51-yard game-winning field goal against Dallas, the longest walk-off field goal in NFL postseason history.\nThis offseason, the Packers decided to go younger with Hart, but Goode said the Packers had indicated that they might call at the end of camp as they had last year. When Hart struggled and other teams in the league expressed an interest in Goode, the timeline changed.\n“I knew I was going to get a call at some point,” said the 32-year-old Goode, who worked out for the New York Jets last Monday. “I didn’t know from who.”\nGoode’s return capped an eventful week for him and his wife, Monica, who gave birth to the couple’s second child, daughter Blakely, on Monday.. Shortly after the baby arrived, Goode left his native Arkansas and was on a flight to New York for his workout with the Jets, and soon after he got back, the Packers called. Goode said several other teams had called his agent, Kevin Gold, as well.\n“Like, the baby was born and I left,” Goode said. “My wife is a good wife.”\nGoode said he had been snapping twice a week and working out like he has every offseason, just to make sure he was on top of his game if an opportunity arose. The rest of the time, he played golf and hung out with Monica and 2-year-old son Jackson.\n“My wife told me weren’t both meant to be stay-at-home parents. So I got out of the house and pretended like (working out) was just a regular job,” Goode said. “It was the same thing as last year. I tried to stay ready and whatever happens, happens.”\nRodgers on mend\nTight end Richard Rodgers, who fractured the tip of his right ring finger in practice Tuesday and missed the preseason openeragainst the Eagles on Thursday night, was able to practice Sunday wearing a protective splint covering the finger. Because it was only the tip of his finger, Rodgers was able to avoid wearing the kind of bulky club cast others have had to wear to protect broken fingers. Rodgers said the finger did not dislocate and will be able to heal on its own while he plays.\n“I can still catch and play so it’s not that much of a setback,” Rodgers said.\nPackers coach Mike McCarthy said last week that Rodgers was having the best camp of his four-year career, and Rodgers was injured during a terrific play on which he and safety Morgan Burnett battled for a pass in the end zone, the ball deflected off Rodgers’ finger and Burnett’s pads, and Rodgers caught the carom for a touchdown.Asked if the splint might hamper his blocking, Rodgers replied, “I’ll just have to see when I get out there and play because going against your teammates is obviously not like a game. But for the most part I was pretty good blocking today.”\nJenkins added\nThe Packers claimed defensive Shaneil Jenkins off waivers from the Seahawks and placed tight end Beau Sandland (knee) on injured reserve.\nJenkins entered the league from Shepherd (W.Va.) University as an undrafted rookie free agent with the Broncos last year and spent the final month of the season and the offseason with Seattle.\nHaving released veteran Letroy Guion last week and with third-round pick Montravius Adams sidelined after foot surgery, the team needed to add depth on the line.\nRave reviews: Bears rookie QB Trubisky had fine debut. C5\n“I knew I was going to get a call at some point. I didn’t know from who.” Brett Goode,on returning to the Packers", "url": "https://apnews.com/b6f5b9cbefd34ccb9e76e9fed24ff2a5"}