{"authors": ["Detroit News Wire Services"], "date_download": "2020-05-04 20:07:54", "date_modify": "2020-05-04 20:07:54", "date_publish": "2017-12-13 07:20:23", "description": "Scott Frost led the Central Florida football team through practice Tuesday morning and will coach in the Peach Bowl as planned despite taking the Nebraska job and recruiting against the...", "filename": "_38d3e113d91a4de189aef96926e22158_1588622874.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_38d3e113d91a4de189aef96926e22158_1588622874.html", "title": "Frost will coach Peach Bowl", "title_page": "Tuesday's football: Frost will coach Peach Bowl", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Scott Frost led the Central Florida football team through practice Tuesday morning and will coach in the Peach Bowl as planned despite taking the Nebraska job and recruiting against the Knights.\nFrost joined UCF athletics director Danny White and Peach Bowl CEO and president Gary Stokan for a news conference during which the Knights officially accepted their bowl invitation.\nFrost was a surprise guest, fielding questions instead of UCF interim coach Troy Walters after leading the players through their first workout since winning the American Athletic Conference championship.\nFrost acknowledged it was an unusual situation and a few things had to be worked out with UCF’s administration.\n“These aren’t ideal circumstances, but we’re all dialed in and committed,” he said. ” ... We’re going to be as committed or more committed than if nothing changed.”\nHe praised White and the administration for working with him on logistics so that the coaching staff could put the No. 12 Knights in the best position to defeat No. 7 Auburn Jan. 1.\n“It’s an honor to be invited to this game,” Frost said.\nFrost said he didn’t plan to discuss his obligations at Nebraska with UCF players and insisted the entire 2017 Knights coaching staff, which followed him to Lincoln and was back in Orlando this week for bowl prep, is focused 100 percent helping the Knights win the bowl.\nFrost recalled telling the players Tuesday, ” ‘It was good to see you again guys and get back to work.’ ... That was our message today. We need 100 percent commitment from the staff and the players.”\nDespite outside distractions and sharing space with new UCF coach Josh Heupel’s staff, Frost said the Knights are following an ideal bowl preparation schedule and got a much-needed break last week after playing 12 consecutive games without a bye due to Hurricane Irma.\n“It felt like coming home to these guys,” Frost said. “The energy on the field was awesome. So the guys were excited about playing.”\nExtra points\nWisconsin linebacker Jack Cichy has decided to enter the NFL draft, foregoing a chance to ask the NCAA for a sixth year of eligibility because of a right knee injury.\nCichy announced his decision in a story posted Tuesday on The Players Tribune website. He was announced as one of the team’s departing seniors before the sixth-ranked Badgers’ regular-season home finale on Nov. 18 against Michigan.\nArguably Wisconsin’s best player, Cichy was on preseason watch lists for postseason awards when he got hurt during a special teams drill in training camp. He was set to anchor a deep linebacker corps on one of the country’s top defenses.\nWisconsin (12-1) persevered and led the country in total defense (253.2 yards), allowing just 13.2 points per game. The Badgers will face Miami in the Orange Bowl on Dec. 30.\nCichy’s 2016 season ended after seven games because of a pectoral injury.\nHe took a redshirt season during his second season at Wisconsin in 2014.\n... Arizona State defensive coordinator Phil Bennett will not be on new Sun Devils coach Herm Edwards’ staff.\nBennett said after practice he was leaving the program for personal and health reasons.\nEdwards said in a statement he wanted Bennett to remain on the staff, but appreciates that he chose not to because of family reasons.\n... The original 1994 Heisman Trophy that was awarded to the late Rashaan Salaam is going up for online auction.\nSCP Auctions announced it will start taking bids on Jan. 8 and close them on Jan. 20. The website is scpauctions.com. SCP said a portion of the proceeds from the sale will be donated to CTE research.\nThe company said it expects the trophy to sell for more than $300,000.\nSalaam, a San Diego native who starred in 8-man high school football at La Jolla Country Day, committed suicide last December in Boulder, Colo.\nHe was 42.", "url": "https://apnews.com/38d3e113d91a4de189aef96926e22158"}