{"authors": ["Rick Kelley Staff Writer"], "date_download": "2020-05-04 20:09:40", "date_modify": "2020-05-04 20:09:40", "date_publish": "2017-09-15 03:43:00", "description": "HARLINGEN — Today is deadline day for applications for nine drawn hunts, including several youth hunting categories. Texas Parks and Wildlife Department officials say applicants, after...", "filename": "_d6318efdbd4f4baf8ad01e1cc2132787_1588622980.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d6318efdbd4f4baf8ad01e1cc2132787_1588622980.html", "title": "Today is deadline for some drawn hunts", "title_page": "Today is deadline for some drawn hunts", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today is deadline for some drawn hunts\nHARLINGEN — Today is deadline day for applications for nine drawn hunts, including several youth hunting categories.\nTexas Parks and Wildlife Department officials say applicants, after registering on the TPWD website, can browse hunts by category or location online.\nUsing a Customer ID, applicants have until 11:59 p.m. Central Daylight Time to select hunts and enter their name.\nTPWD’s website, https://tpwd.texas.gov/, serves as the portal for applying for hunts. Application fees range from free to $3 to $10, depending on the hunt.\nAfter applying, hunters can use the TWPD website to check on their drawing status.\nIf you are drawn for a hunt, an $80 or $130 permit fee is required for most hunts, although some hunts have no permit fees.\nDue to lingering effects from Hurricane Harvey at wildlife management areas and state parks along the Gulf Coast, TPWD is canceling or postponing some scheduled hunting activities.\nHere they are:\nJustin Hurst WMA\nClosed until Sept. 16.\nGuadalupe Delta WMA\nMission Lake Unit drawn alligator hunts and Annual Public Hunting (APH) early teal hunts have been canceled.\nGuadalupe River Unit APH early teal hunts have been canceled until the county road into the area re-opens.\nHynes Bay Unit will be open for the APH early teal hunts.\nMad Island WMA\nClosed for early teal hunts; drawn alligator hunts will be conducted as scheduled.\nSea Rim State Park\nAPH early teal hunt has been canceled.\nLower Neches WMA\nNelda Stark and Old River units will be open for APH early teal hunts as long as the county road providing access is open.\nJ.D. Murphree WMA\nBig Hill and Salt Bayou units have canceled all drawn alligator hunts and APH early teal hunts.\nJames Daughtrey WMA\nDrawn alligator hunts will be conducted as scheduled.\nAngelina Neches/Dam B WMA\nDrawn alligator hunts will be conducted as scheduled.\nIn addition to state-managed public hunting lands impacted by the storm, U.S. Fish and Wildlife Service officials have announced that the Aransas National Wildlife Refuge is also closed to public access and the refuge drawn archery deer hunt scheduled for Sept. 30 has been canceled.\nrkelley@valleystar.com", "url": "https://apnews.com/d6318efdbd4f4baf8ad01e1cc2132787"}