{"authors": [], "date_download": "2020-05-04 20:13:12", "date_modify": "2020-05-04 20:13:12", "date_publish": "2017-08-23 12:00:00", "description": "Brittany Snow was allowed to \"improv\" while filming 'Pitch Perfect 3'. The 31-year-old actress thought it would be \"hard\" to make a third film in the series, so she was delighted that...", "filename": "_bc56309aeabf49f1b67dcc0aa297a87e_1588623192.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bc56309aeabf49f1b67dcc0aa297a87e_1588623192.html", "title": "Brittany Snow was allowed to improv on Pitch Perfect 3", "title_page": "Brittany Snow was allowed to improv on Pitch Perfect 3", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Brittany Snow was allowed to “improv” while filming ‘Pitch Perfect 3’.\nThe 31-year-old actress thought it would be “hard” to make a third film in the series, so she was delighted that producers and found a way, and after so long working on the musical movies, new director Trish Sie allowed her cast to just “be” their characters.\nBrittany - who plays Chloe - said: “It seemed like it was going to be hard to bring all those girls back together because they’ve all left college and grown up now but they’ve managed to do it, they go on a tour.\n“I haven’t seen it yet but I’ve heard it’s really great and Trish Sie, our current director, really let a lot of us improv and be our characters.”\nBefore the release of ‘Pitch Perfect 3’ later this year, the actress can be seen in the new action-thriller ‘Bushwick’ by Cary Murnion and Jonathan Milott alongside ‘Guardians of the Galaxy’ star Dave Bautista, but she was initially “hesitant” to take part in the film.\nShe told the Metro newspaper: “At first I was really hesitant to even do the movie - I thought it had a B movie premise.\n“But then I talked to the directors and they explained they wanted a single-take action video game feel and they wanted to take a stab at what was going on in the current climate.\n“What appealed to me was the idea that I only had one or two takes to do a 20-minute scene and it was almost like rehearsing and doing a play.\n“I’d never done a movie like that before.”\n‘Bushwick’ follows Lucy (Snow) who arrives in the Bushwick neighbourhood, in Brooklyn, and militia forces have entered New York to claim it as an East Coast base of operations.\nTaking shelter in the basement of Stupe (Bautista), the two have to find a way to get Lucy to reach her destination through the dangerous streets.\nThe actress admitted she needed to work on her character and give her a backstory because she couldn’t play a girl who is “clueless”.\nShe said: “When we got the script, my character Lucy was very much a damsel in distress. She was asking ‘what is going on?’ probably about, no joke, 30 or 40 times.\n“As a 29-year-old woman at the time, I said, I can’t feasibly do this, play a girl who is this out of the loop and this clueless.\n“She has to have some sort of arc and backstory so we tried to incorporate that as much as we could and make her a fighter.”", "url": "https://apnews.com/bc56309aeabf49f1b67dcc0aa297a87e"}