{"authors": ["John Bear Staff Writer"], "date_download": "2020-05-04 20:26:48", "date_modify": "2020-05-04 20:26:48", "date_publish": "2017-12-30 01:37:48", "description": "A Boulder man with at least eight prior alcohol-related driving convictions was arrested again on Thursday evening after Longmont police say he struck a fence, a shed and a house on the north side...", "filename": "_9c5c22bc7f944307b7de3da868c33188_1588624008.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9c5c22bc7f944307b7de3da868c33188_1588624008.html", "title": "Boulder Man with 8 Alcohol-related Convictions Arrested in Longmont on Suspicion of DUI", "title_page": "Boulder Man with 8 Alcohol-related Convictions Arrested in Longmont on Suspicion of DUI", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Boulder man with at least eight prior alcohol-related driving convictions was arrested again on Thursday evening after Longmont police say he struck a fence, a shed and a house on the north side of the city.\nA good Samaritan is credited with helping police catch the suspect, who they say attempted to run from the scene.\nJoshua James Richardson, 47, faces DUI after three or more convictions, a felony charge, along with traffic charges for reckless driving, leaving the scene of an accident, failure to notify police, driving under restraint and no proof of insurance, according to an arrest report.\nRichardson has at least five prior DUI convictions and three for driving while ability impaired. He also has convictions for tampering with an interlock device, careless driving, assault, obstruction, cruelty to animals, false reporting and numerous traffic offenses, according to online court records.\nThursday’s incident marks at least the 43nd time Richardson has been arrested or ticketed since 1988, and the arrest report categorizes him as a habitual traffic offender.\nLongmont police Sgt. Paul Campbell said that Richardson ran his vehicle off the roadway near Colo. 66 and Erfert Street at about 5:22 p.m. and in the process struck a fence, a storage shed and a home on Mumford Place before exiting the vehicle and leaving the scene.\nWhen police caught up with Richardson about 100 to 150 yards away from the crash, he denied being behind the wheel and said that a man he identified as “Pete” was the driver. Richardson told police he met “Pete” at one of his jobs, but he couldn’t remember which one, according to the arrest report.\nPolice later found the key to the vehicle stashed in one of Richardson’s shoes. He refused to take a blood test at Longs Peak Hospital and was later taken to Boulder County Jail, where he remained on a $2,000 cash-only bond on Friday.\nCampbell said that police had already received a telephone report on a vehicle that was later determined to be the same vehicle associated with the crash.\n“Someone on the road saw this vehicle and was concerned enough to call and say they believed the car was operated by someone under the influence,” Campbell said.\nHe added that it is fortunate that Richardson was unable to get his vehicle back on the roadway, because although no one was injured in the crash, something far worse could have happened had he continued driving.\n“You don’t want to think about what could have happened,” Campbell said.\nHe added that police had a “great citizen witness” who saw Richardson exit the driver’s side of the vehicle and run away from the crash. He said that the witness kept an eye on Richardson until police arrived.\n“That was fantastic,” Campbell said. “It helps when that happens. ... We appreciate it.”\nJohn Bear: 303-473-1355, bearj@dailycamera.com or twitter.com/johnbearwithme", "url": "https://apnews.com/9c5c22bc7f944307b7de3da868c33188"}