{"authors": [], "date_download": "2020-05-04 20:09:48", "date_modify": "2020-05-04 20:09:48", "date_publish": "2017-12-20 16:11:32", "description": "Lansing — Michigan must refund public school employees a combined $550 million that was taken out of their paychecks to fund retiree health care costs between 2010 and 2012, the state Supreme...", "filename": "_bb5a52e2c2834482bfeaaede2c3aae6a_1588622988.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bb5a52e2c2834482bfeaaede2c3aae6a_1588622988.html", "title": "Mich. Supreme Court: $550M refund for teachers", "title_page": "Mich. Supreme Court: $550M refund for teachers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lansing — Michigan must refund public school employees a combined $550 million that was taken out of their paychecks to fund retiree health care costs between 2010 and 2012, the state Supreme Court ruled Wednesday in a decision hailed by unions as a “major victory” for educators.\nIn a unanimous 6-0 order, justices upheld a Court of Appeals ruling that a 2010 Michigan law violated contract clauses of the state and federal constitutions by involuntarily reducing teacher and other school employees’ pay by 3 percent to pay for retiree health care.\nBecause the law was unconstitutional, funds collected from more than 200,000 school employees before a replacement law took effect in 2012 “must be refunded to the plaintiffs in accordance with the Court of Appeals judgment,” justices ruled.\nThe state is expected to process refunds through individual school districts, which will be responsible for distributing money to their employees, said Kurt Weiss, a spokesman for the Michigan Office of Retirement Services. The pending refunds will include interest, he said, meaning the state will distribute roughly $554 million to districts.\n“I cannot imagine a better pre-holiday gift to Michigan’s school employees than getting their hard-earned money returned to them,” Michigan Education Association President Paula Herbart said in a statement, praising the work her union and the state chapter of the American Federation of Teachers did on behalf of their members.\n“This reinforces why being a member of a union matters – working collectively, we won this case that no individual could have fought for themselves,” she said.\nJustice Beth Clement, appointed to the bench by Republican Gov. Rick Snyder in November, did not participate in the ruling. Unions that sued the state on behalf of teachers had asked her to sit out the case because she served as Snyder’s chief legal counsel when he decided to appeal the case to the Supreme Court.\nSnyder said Wednesday he was “pleased that taxpayers will have resolution” to a long-running dispute over the 2010 law signed by his predecessor, former Gov. Jennifer Granholm, a Democrat. The law was in effect from July 2010 until September 2012, when Snyder signed a replacement version upheld by the Supreme Court that year.\n“The funding has been held in escrow, so Michigan will continue to have a balanced budget,” the governor said in a statement. “We will not need to raise new revenue or remove funding from other priorities to refund the money that was collected for retirement health care.”\nIt’s not immediately clear how quickly the state will distribute refunds. The Office of Retirement Services is working to implement the Supreme Court ruling and return contributions to the school districts where they were initially withheld from, Weiss said.\nThe state will provide additional information to school districts and employees “regarding the timing and amounts for forthcoming refunds as soon as it becomes available,” Weiss said.\nSnyder appealed the case to the Michigan Supreme Court last year without the help of Attorney General Bill Schuette, whose office had defended the state before the Court of Appeals but declined further involvement. Instead, Snyder hired outside attorneys to represent him as special assistant attorneys general.\nAFT Michigan president David Hecker said Wednesday he hopes Snyder and Schuette now work with the unions to ensure school employees get their refunds in a timely fashion.\n“Michigan’s school employees have waited eight long years to get their hard-earned money returned to them – no further delay is necessary,” Hecker said in a statement.\nThe Supreme Court ruling and pending refunds cap a nearly eight-year battle over the paycheck deduction law, signed by Granholm amid a budget shortfall after approval by a Democratic-controlled House and Republican-dominated Senate.\nA Republican-controlled Legislature amended the law in 2012 to stave off a continued legal challenge, but the teacher unions continued to fight in the courts for a refund of money deducted from employee checks over the two-year period.\nThe Snyder administration held $549,871,147 collected from school employees in escrow while the legal battle played out. The funds earned $4,189,341 in interest over that period, according to Weiss, leaving the state with $554,060,489 to refund.\njoosting@detroitnews.com", "url": "https://apnews.com/bb5a52e2c2834482bfeaaede2c3aae6a"}