{"authors": ["Tom Meersman"], "date_download": "2020-05-04 20:27:47", "date_modify": "2020-05-04 20:27:47", "date_publish": "2017-11-18 14:24:07", "description": "Organic dairy farmer Kevin Stuedemann knows how it feels to be on the verge of calling it quits. After several producers in his area went out of business, Stuedemanns milk buyer ended its...", "filename": "_9fdbd8bc59954263a165667dbd0bd51b_1588624067.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9fdbd8bc59954263a165667dbd0bd51b_1588624067.html", "title": "Mental health issues cropping up as financial stress continues on farms", "title_page": "Mental health issues cropping up as financial stress continues on farms", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Organic dairy farmer Kevin Stuedemann knows how it feels to be on the verge of calling it quits.\nAfter several producers in his area went out of business, Stuedemanns milk buyer ended its contract with him on 30 days notice because there were no longer enough organic dairies nearby to justify sending a truck. With 70 cows producing milk, no customers and zero income, Stuedemann searched frantically for a new buyer and took an off-farm job to make ends meet.\nIt was a terrible time, said Stuedemann, 54, who farms about 60 miles southwest of Minneapolis near Belle Plaine. There was a lot of anxiety, and you wonder why this is happening to me. I had two months of throwing away milk, and I couldnt continue to do that.\nMinnesotas farmers are worn down, both financially and emotionally, after nearly half a decade of soft prices that have upended the economics of one of the most important segments of the states economy. Many have done their best to cut costs, rebalance debt and stretch out loan payments, but they have also burned through savings and are running on empty.\nA recent state survey of bankers, veterinarians and others who work with farmers found that 80 percent had observed an increase in financial worries, more than half noticed higher anxiety levels and more than a third saw higher levels of burnout and depression.\n.embed iframe{height:470px;} @media only screen and (min-width: 200px) and (max-width: 767px){.embed iframe {height:590px;}}\nThere is no indication that things will get better soon, with commodity prices remaining below what it would take for most farmers to cover their costs. Soybean prices are a third lower than they were in 2013, and corn prices are down by nearly half.\nWere seeing some producers that are looking at their fourth or fifth year of losses, and that just takes a significant toll, said Matt Ginder, chief core markets officer for Compeer Financial, a credit cooperative that works with farmers.\nFarmers are no strangers to stress. They cope with unpredictable weather, physically demanding work, soaring health insurance costs and other pressures. But four consecutive years of stagnant prices and barely making a profit or losing money is difficult to endure.\nStress from economic hardship has caused at least two farmer suicides this year and an unknown number of attempts. The Minnesota Department of Agriculture launched a free and confidential helpline last month for farmers and others who need support. Officials are also preparing a mental health training program for sheriffs deputies, extension agents and others to watch for warning signs when they deal with producers and their families.\nTed Matthews, a psychologist and mental health coordinator for the Minnesota Department of Agriculture, said below-cost crop prices have pushed producers anxiety levels off the charts, and he regularly counsels farmers who feel angry, depressed or hopeless.\nIts definitely getting worse, said Matthews, who has worked under contract with the state since 1993. It takes time for peoples stress levels to get to the point of [thinking about] suicide, but were getting closer and closer to that point, and when people lose all hope, those types of things happen.\n.embed iframe{height:470px;} @media only screen and (min-width: 200px) and (max-width: 767px){.embed iframe {height:590px;}}\nMatthews said that losing a job is a lot different for a farmer than for people who work in cities.\nA lot of farmers have never done anything else, and they truly dont believe that theres life outside farming, he said. Dairy farmers work seven days a week and if they lose the dairy, they lose themselves. They lose who they are.\nFarmers he has counseled need at least two years to adjust emotionally if they lose their farms, Matthews said. Many are hard workers with budgetary and mechanical skills, he said, and eventually succeed in finding new occupations.\nAlso complicating matters is family legacy, said Adam Birr, executive director of the Minnesota Corn Growers Association. One of the first things a farmer will tell you about their operation is how many generations its been in his family, he said.\nBirr said he hopes that farmers help others realize they are not alone in facing the challenges. Theres a stigma around reaching out for help because farmers are independent, problem solvers, with a get-er-done mentality, he said.\nMeg Moynihan, a senior adviser at the Minnesota Department of Agriculture who is married to Stuedemann, said farmers and other rural Minnesotans are great about talking about conservation issues, animal production and how to grow crops effectively, but they traditionally havent paid much attention to the human toll of the work.\nThis helpline is maybe making up for that a little bit, she said.\nFor Stuedemann, things seem to have turned around.\nAfter two months of dumping milk and several more months of selling his organic milk for less than half its worth at conventional prices, he was able to sign on last December and sell to Organic Valley, the Wisconsin-based cooperative.\nStuedemann said he was able to pull through the tough times largely because he owns his 170-acre farm, carries little debt and had previous job experience as a professional mover that allowed him to pivot to a different source of income on short notice.\nBut some of his neighbors are not so fortunate, he said. When you see your peers or your family that went to the city and were successful and youre trying to make a living and cant, I mean depression is a very real thing out here, he said.\nGinder, of Compeer Financial, said projections show little rebound in grain prices in the next few years, and some farmers could be forced to make tough decisions on retiring or selling some assets.\nExtension educator Dave Bau has been meeting for nearly 20 years with crop producers in southern Minnesota and discussing their farm financials that are part of a state database, and he said hes never seen farmers more melancholy and disheartened.\nThey just havent been able to sell crops for a price thatll cover their expenses, he said.\nWhile every farm situation is different and some producers are surviving, Bau said, most are struggling. Even figuring in payments from federal farm programs, he said, corn producers who rent land in southern Minnesota lost an average of $69 per acre for each of the past four years, and soybean growers made about $30 per acre. The greatest losses were in 2015, he said, and 2017 could be worse.\nBob Worth, a 65-year-old soybean farmer in Lincoln County in southwest Minnesota, said that even for producers like him with plenty of equity, the past four years have been difficult financially. Its hurting me big-time, but its not the case where Im in dire straits, he said.\nThe stress of farming is really high, and the profitability is really low, Worth said.\nFaculty at farm business management programs offered in eight colleges across Minnesota are also aware of the distress, said Keith Olander, director of AgCentric at Central Lakes College in Staples.\nFrom what were hearing on the outside, the obvious stories, you can rest assured that theres two to three stories were not hearing about where the stress levels are very high, he said. That affects the whole family marriages, children, even some community situations.\nThats why farmers and their spouses need to reach out for help if theyre depressed or dont know what to do, said Worth, who said hes known two farmers who died by suicide this year because of financial problems. I dont want anything to happen to any more farmers, he said. I dont want to have another funeral or something to go to.\nTom Meersman 612-673-7388", "url": "https://apnews.com/9fdbd8bc59954263a165667dbd0bd51b"}