{"authors": ["Theo Lawson"], "date_download": "2020-05-04 20:25:07", "date_modify": "2020-05-04 20:25:07", "date_publish": "2017-12-15 00:00:00", "description": "PULLMAN – If Robert Franks ever wishes to re-enact his freshman season at Washington State, the third-year forward might try practicing in a 25-pound weight vest. Through a two-hour workout,...", "filename": "_ef439c4a099e4168bbe6509817f55962_1588623907.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ef439c4a099e4168bbe6509817f55962_1588623907.html", "title": "Return of the Deadeye: Slimmed-down Robert Franks shapes up as key Washington State player", "title_page": "Return of the Deadeye: Slimmed-down Robert Franks shapes up as key Washington State player", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PULLMAN – If Robert Franks ever wishes to re-enact his freshman season at Washington State, the third-year forward might try practicing in a 25-pound weight vest.\nThrough a two-hour workout, Franks would probably see his stamina go first. Then his legs. And finally his confidence.\nFor old times’ sake, it could be a good reminder of what Franks has gained in his three years on the Palouse – and also everything he’s lost.\n“I’ve seen a lot of things happen with my weight loss,” Franks said recently.\nAnd not all of it is quantifiable in a box score.\n“He’s just gotten really confident now,” Cougars coach Ernie Kent said. “That has to do with feeling good about himself, feeling good about his body, feeling good about being in his junior year and having that confidence.”\nInflated numbers on the stat sheet have just been a fortunate byproduct. Fortunate for Franks, but especially fortunate for WSU (6-3), which lost four starters and more than 45 points per game from last year’s squad.\nNearly two months ago at Pac-12 Basketball Media Day in San Francisco, Franks unfolded his trimmer, more chiseled frame into a chair in front of a group of reporters, then reeled off the goals he’d set for his junior season. Near the top of the list was being named the most improved player in the conference.\nAt this rate, it would be tough to deny Franks of that distinction. After averaging 2.2 points per game as a true freshman and 6.4 as a sophomore, Franks has blossomed into a 19.2 points-per-game scorer who’s also seen his minutes double each year – from 8.3 as a seldom-used freshman, to 16.6 as a reliable sophomore sub, to 32.4 as a full-time junior starter.\nThe sixth-leading scorer in the Pac-12 ranks No. 12 in rebounding at 7.0 per game and he’s shooting a clean free throw (83.3), good enough for 12th in the league.\nDropping 25 pounds from his 6-foot-7 frame has also made a big difference for Franks’ 3-point shot. He’s become one of the conference’s most accurate perimeter shooters and he’s hovered around 50 percent from beyond the arc most of the season. Through nine games, Franks has connected on 25-of-52 shots (48.2 percent) and as of Thursday night, he held the highest percentage among Pac-12 players who’ve attempted at least 50 3’s.\n“I believe I was able to shoot like this before, but now being more conditioned, having more legs in games to get the ball up, it’s definitely helped,” said Franks, whose initiative to slim down began not long after he arrived in Pullman – three years and 25 pounds ago.\nKent suggested he trim between 15-20 pounds as a freshman. Franks successfully wrapped up his rookie season around 235-240.\n“At that point I felt like I can get to 225 to reach my biggest peak of how I play,” Franks said.\nSo he aggressively charged toward that goal last year and made the final strides the summer between his sophomore and junior seasons. It was a multi-faceted effort that started with Franks taking precautionary dietary measures he hadn’t in the past. Franks didn’t subscribe to a specific meal plan, but he abandoned the junk food and fast food that had negated his progress in the weight room.\nOver the summer, he linked up with Paul Cannon, his former JV basketball coach at Evergreen High in Vancouver, Washington, who took a special interest in Franks’ transformation.\nMost days, Franks wore his lower body ragged with track work, treadmill work and incline sprints. Then he’d pop over to the local gym to hoist hundreds of shots on a “shooting gun” – a basketball contraption that rests under the hoop and spits the ball back out to the shooter, allowing a player to spend hours in the gym without the aid of a rebounder.\n“When I went back home, I probably shot around 300-400 shots a day while running hills and conditioning,” Franks said. “Just so I could get my legs fatigued and heavy while shooting 3’s, shooting mid-range.”\nAnd to clarify, that’s 300-400 makes per day – not attempts.\nFranks knew he’d need practice shooting under heavy duress, given that Kent’s offense places a premium on pace and tempo. And he understood his usage would be at his career high this season. Only guards Viont’e Daniels (33.9 minutes) and Malachi Flynn (32.8) are logging more time on the floor.\nFranks has hit double digits in eight of nine games this season and is three games removed from a career-high 32-point explosion in a loss to UC Davis. He scored 25 twice – versus Texas Southern and Idaho State – and has buried five triples in three separate games.\nThe junior keyed a 6-0 start to the season for the Cougars, who beat three high-profile mid-majors to win the Wooden Legacy, but WSU has lost its last three games and it’s no longer a secret that Franks has become the team’s new headliner.\n“He has had two teams that have put a player on him and sat on him, that limits his touches, that limits his rhythm a little bit,” Kent said.\nLearning how to post the same numbers despite the new attention figures to be the next challenge Franks has to tackle.\n“It’s like a little puzzle you’ve got to try to figure out,” he said. “Score and get your teammates involved still and at the end of the day, win the game.”\nFranks said he’s comfortable playing at his current weight – 226 – and gives Kent credit for helping him shed the remaining pounds.\nThe WSU coach also made a pledge to lose weight during the offseason and suggested a friendly who-could-lose-more wager with his top scorer. Kent’s down to 222 pounds – 15-20 from where he started.\n“He was bringing his weight down pretty good, so we kind of (said), OK let’s have a competition here,” Kent said. “But he eats a lot more than me, a lot more protein, so I think I’m going to win the bet.”\nEither way, it’s a good outcome for the fourth-year coach.\n“He’s done a really good job to his credit,” Kent said of Franks.", "url": "https://apnews.com/ef439c4a099e4168bbe6509817f55962"}