{"authors": ["Prianka Srinivasan", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:49", "date_modify": "2020-05-04 19:53:49", "date_publish": "2017-12-05 00:00:00", "description": null, "filename": "2017_12_appalachia-friends-of-coal-mining-industry-jobs-environmental-just-transition_1588622029.html", "image_url": "https://images.jacobinmag.com/2017/12/05115749/plant.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_12_appalachia-friends-of-coal-mining-industry-jobs-environmental-just-transition_1588622029.html", "title": "Appalachia’s Fickle Friend", "title_page": "Appalachia’s Fickle Friend", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIt’s a spring morning at Marmet Elementary school in West Virginia. The sun strikes the front sign — “Kindness, Respect, and Accountability” — as Helen Southall’s second-grade file into the classroom. Each student is wearing a fluorescent yellow t-shirt emblazoned with a picture of a tree, its flowering branches stamped with the names of various products — lipstick, plastic, medicine, soda water, varnish — all growing from a thick trunk labelled “Coal.” At the bottom of the t-shirt is printed “West Virginia’s Coal Tree.” Today, the students are in for a treat. Southall distributes two dozen chocolate cupcakes among them, each topped with a slick layer of green frosting. She instructs the children to pierce their cupcakes with a long, transparent straw, drawing it back up again to slowly extract the marbled layers of yellow and brown sponge and green frosting. This is “Cupcake Core Drilling,” Southall explains, part of the nine-week Coal in the Classroom program designed to “educate children about the history and importance of coal.” The cupcake sponge represents mineral-rich rock, the frosting the topsoil and vegetation above ground, and the straw a coring drill used to extract and analyze coal deposits. After they have punctured the cupcake with their straws, and sliced it open to examine the jumble of tunnels created within, the students bite into their mock coal rig, brown crumbs and green icing smeared across their faces. This is certainly the tastiest part of their coal education — other lessons include talks from coal miners, a visit to the local coal museum, and written activities that highlight the advantages of coal as a source of clean and profitable energy. Southall has a knack for weaving Coal in the Classroom materials into other curricula — for instance, her students learn math skills by pretending to run a coal company, or a science class is taught by analyzing the different types of coal rock. Marmet Elementary school is the first public school in the country to participate in Coal in the Classroom, a program funded and propagated by the women’s-only chapter of a group called Friends of Coal. Friends of Coal was established more than a decade ago by the West Virginia Coal Association, a century-old industrial lobby group that aims to protect coal’s business interests across the United States. Its 250-strong member base includes the industry’s major global players: Arch Coal, Caterpillar and Murray Energy, with a long list of smaller, more regional companies. Coal in the Classroom is just one of the various strategies used by Friends of Coal to keep Appalachia’s coal identity alive. Each year, Friends of Coal distributes a $48,000 Mining Scholarship to University of Kentucky engineering students. Friends of Coal banners line football fields and basketball stadiums, and are often official sponsors of local sports games. Its merchandise — the countless t-shirts, license plates, stickers, notebooks, makeup mirrors and lip balms — are often given away for free via thick yellow packages sent in the post, and has helped make Friends of Coal a household name in Appalachia. By most counts, these strategies are working — and ensure that despite its economic decline, the coal industry maintains a strong grip over the region. West Virginia state lawmakers repeatedly block efforts to introduce climate change education into classrooms, while Friends of Coal’s program continues to expand. During his rally in Charleston in March, President Trump wore a Friends of Coal hardhat as he vowed to “put miners back to work” — a claim he repeated during his withdrawal from the Paris Accord. Politicians as far away as Australia have even caught wind of the campaign, and attempted to launch a local Friends of Coal chapter. Through the Friends of Coal campaign, the corporate coal lobby has managed the impossible: to reinvent the coal industry as an ally and compatriot of Appalachia’s working class. But when Southall stands in front of her students to talk to them about the importance of coal, she rarely thinks of these larger political events. “I never bring politics into the classroom,” she says, and the negative side-effects of coal are not a “major focus” of her teaching. For Southall, her involvement with Friends of Coal is more a labor of love — with her husband, she meticulously bakes the cupcakes and cookies that become props for coal rigs in Coal in the Classroom. And though Southall agrees Friends of Coal might support large mining corporations which do not always have Appalachian interests at heart — her brother became a paraplegic and her fiancé was killed in two separate mining accidents — she insists that locally the group works to protect the culture, families, and future of Appalachian citizens. Southall is not alone. Throughout central Appalachia, residents at once seemingly smarted by the coal industry — through ill health, unstable employment, or desecrated land — also call themselves ardent friends of coal. Through the Friends of Coal campaign, the corporate coal lobby has managed the impossible: to reinvent the coal industry as an ally and compatriot of Appalachia’s working class. And, as the coal lobby’s presence deepens in the region, its residents’ futures become ever more tied to “King Coal.”\nThe Trade-Off Sara Estep, a young mother from Letcher County, Kentucky, was in high school when she first started noticing Friends of Coal signs pop up in her community. She initially dismissed these unusual pro-coal slogans as mere propaganda, laughing them off as some petty gimmick. And then, in just the space of a few months, Friends of Coal churned into a massive movement. Her neighbors would hold large rallies in nearby cities, yelling: “Save coal mining! Stop Obama’s war on coal!” This rhetoric soon caught fire, and Estep watched her local politicians recite common Friends of Coal talking points, vowing to stop the Obama administration’s attacks on coal and revive the industry from the ashes. But it was only recently that Estep understood how this growing loyalty to the coal industry could damage her community. One summer’s day in 2013, Sara Estep woke to a putrid stench wafting into her room from outside. She followed the smell outside, where the usually quiet creek that cut through her backyard was now spewing black liquid. The water gushed from a silt pond of an old coal mine at the mouth of her holler, which had recently become the site of a natural gas well. The gas drilling had pushed up the polluted wastewater from the inactive mine, flooding the creek behind Estep’s house. “It was just like somebody coming and dumping a dumpster full of shit in your backyard,” Estep recalls. “And I was livid.” Estep immediately collected water samples and attempted to rally her neighbors to act. The creek ran through a long block of houses, and Estep thought that by distributing information about the dangers of black water to her community, she could encourage an investigation into the mining company. One by one, Estep knocked on doors, and discussed the contaminated water samples. Her neighbors clucked in sympathy, nodding their heads to Estep’s indignation at how the abandoned mining site was now wreaking havoc on their water ways. And then, just days later, Estep was shocked to find her neighbors’ children playing in the creek, the grey water swirling around their legs as parents looked on. Estep was right to be concerned. Appalachians’ elevated cancer mortality rates — up to 36 percent higher than those living elsewhere — are often associated with higher levels of arsenic contamination in their water supplies, likely caused by nearby mining sites. Estep, who now works for the community justice organization Kentuckians for the Commonwealth, describes this growing complacency toward mining’s ills as a “flip”: a recent phenomenon where locals have switched their allegiances from communities and the environment to pro-industrial groups like Friends of Coal. According to Estep, much of this coincided with the “war on coal” propaganda she first noticed as a high-school student. She believes groups like Friends of Coal prey on the inherent vulnerability many locals face when confronted by the coal industry. “A lot of people know coal is destructive,” Estep says. But due to the long legacy of mining in Appalachia, Estep thinks exploitation and environmental damage have become an accepted trade-off for secure employment with big coal companies. “But it’s all we’ve ever known,” she continues. “It’s all we’ve ever had.”\nBoom and Bust Coal mining first arrived to the mountains surrounding Estep’s home in the early twentieth century, promising riches to isolated communities of poor white farmers and loggers. These initial prospectors were riding the boom of America’s industrial revolution, looking to capitalize on the high demand for steel and energy. Over the next seven decades, mining companies descended onto Appalachia like flies, carving out the landscape until the mountains looked like freshly cored apples. The spoils of this mining rarely went to local landowners, thanks mainly to a tool called the “broad form deed” that legally separated land rights from mineral rights. This meant that companies could approach Appalachian farmers asking to simply buy the minerals underneath their soil — not the arable land above — often at incredibly low prices. Once enacted, the profits from coal mining went entirely to the coal company, and local “surface owners” were left penniless, with their land now hollowed out and useless. By the late 1960s, the ongoing fight for Appalachian justice in the face of marauding coal companies — some residents would literally lie in front of bulldozers to prevent mining on their land — led to sweeping federal regulation of the coal industry in the Surface Mining Control and Reclamation Act of 1977. The courts killed the broad form deed, and pumped money and resources into the region as part of president Lyndon B. Johnson’s War on Poverty program. Mining communities were destined to become more wealthy, sustainable, and economically diverse. But before these federal programs and regulations could truly take hold, the business of mining shifted dramatically. Technological innovations in the early 1990s meant that coal companies could mine coal using a fraction of the labor force, thereby killing the once dominant mining unions, and getting rid of smaller mom-and-pop style mining operations that could not afford the new, sophisticated machinery. Around the same time, the industry introduced a new form of mining called mountaintop removal, where mountain tops would be blasted off instead of tunneled through to access underground coal seams. Though mountaintop removal was a speedier and much more cost-effective mining method, the visible scars it left behind incensed local residents. As a result, support for the coal industry waned, and dozens of grassroots environmental and economic justice groups critical of the coal industry bloomed in their wake. American coal was in desperate need of a facelift. This came to head in 2002 when a string of deaths caused by overweight coal trucks — some were more than double their legal weight limit — allegedly forced the West Virginia Coal Association, led by its president Bill Raney, to address the industry’s public image. The deaths shone an uncomfortable light on the business interests of coal, and was set to be a public relations disaster. Instead of retreating to their usual lobbying tactics, targeting politicians and legislators that controlled the coal industry, Raney and his team aimed lower, assembling a grassroots marketing campaign to sell to local businesses, TV stations, and West Virginia residents themselves. They called this campaign “Friends of Coal.” And friends of coal they became.\n“There’s Nothing. Except Coal.” Elis Maggard is a big fan of coal. He supports it as if it were his local sports team. Every morning, after he descends the stairs of his apartment to his grocery store below, he straightens the large placard on his counter to make sure its words are prominent: “Coal Keeps the lights on. Don’t let the War on Coal Turn Them Off” it says. Behind the counter, Maggard has assembled a small shrine of mining memorabilia — an old hard hat, miners’ aid boxes and preserved lumps of coal neatly arranged on a shelf next to boxes of cigarettes and cereal. His business card is stamped with a crisp Friends of Coal logo on the top corner. Maggard’s tiny store, which his family has owned and operated for over a century, sits on a vacant stretch off Highway 1148 in Kentucky. It’s a quaint mom-and-pop enterprise that sticks out among the region’s pervasive Walmarts and Family Dollar stores. Maggard was no easy convert to the Friends of Coal movement. His neighbor down the road has terrible water because of the mines — though Maggard’s water is fine, “thank god” he says. He also remembers how frequent mining blasts would shake and crack at his walls. A surveyor once came from out of state to document the damage and declared it permanent, though Maggard was unable to receive compensation since no one was hurt. Maggard used to have two hundred miners in his store every day. Now, he can’t even afford to fully stock his shelves. It’s the Obama-era environmental regulations and “wind-up-doll” politicians that have torn apart the coal industry and fractured the local economy, Maggard believes. The only thing that can save him is coal mining, and the foolhardy politicians intent to keep the industry alive. “It’s there. It’s not like it’s gone,” he insists. “Coal is there. And why not use it?” Maggard’s store sits on the border of Lynch, once the biggest coal-mining town in the world and a model for how unrestrained industry could nourish America’s rural communities. Today, these riches are no longer. A rusting twenty-foot-tall coal tipple looms over Lynch’s main street like a totem from a bygone past. Overgrown vines peel away at an old water tank, and a derelict building stares vacantly at the abandoned railroad that once connected the town to the rest of the country. The population of Lynch has shrunk by a quarter as laid off coal miners head west in search of employment. Many business owners here, like Maggard, see it as their duty to honor the legacy of coal mining, both in homespun ways, or by selling the official Friends of Coal sponsored merchandise. A gift store sells locally designed t-shirts with slogans like “Coal: It’s Our Life” alongside puffy stress balls in the shape of coal lumps courtesy of Friends of Coal. A Christian missionary runs the only café in town, and sells meter-tall wooden cut-outs of coal miners yelling “Coal Keeps the Lights On” next to a sign with the acrostic “Christ Offers Forgiveness For Everyone Everywhere.” Across the road is Portal 31, an abandoned coal mine the local community has turned into an interactive exhibition to memorialize the community’s coal history. Cody Hall slowly pulls his trolley along the rails into the mouth of Portal 31, carefully steering his way across the curved entrance. The sky darkens overhead, and fat drops of rain let loose. Hall swings his miner’s hat on — the same hardhat that his grandfather used to wear when he was in the mines — and turns to face his passengers. “Please keep your arms inside at all times: remember, safety first,” says Hall. “My name is Cody Hall. I’ll be your guide for the day.” Cody Hall never thought he would be working at Portal 31 after he lost his job at Harlan-Cumberland Coal company. He knew the coal industry was fickle — after all it was 2013, and coal was well in the throes of its steep decline. He used to tease his fellow coal miners who would spend big without thinking about their long-term savings, telling them: “You don’t know how long this job is gonna last, and you have a house payment, two car payments. You’re gonna be screwed!” Then on a crisp spring morning, just three weeks after buying a new car, twenty-five-year-old Hall saw his name printed with about thirty others on a list taped to the locker room wall. He had just been laid off. “I was one of those idiots,” Hall realized. Back at Portal 31, Hall pulls his trolley into gear, and begins the rickety ride into the cool darkness of the tunnel. His yellow headlight casts eerie shadows over the mine walls, and he slings his legs over the side, maneuvering the trolley easily with one hand. His passengers watch jittery animatronic men pretend to pick at the mine walls, re-enacting the work of coal miners from a long-forgotten decade. Meanwhile, a pre-recorded voice in a thick southern drawl echoes through the speakers overhead, reciting the great victories of America’s coalfields. “A lot of miners came to Lynch from Italy, and over thirty-two other countries. They came here looking for a better life.” Before becoming a coal miner, Hall had planned to be a pharmacist, and spent several years in Louisville earning his degree. But, as a self-confessed “party boy,” Hall neglected his education, and returned to Lynch looking for a job in the mines. At first, it was a means to an end — a way for him to earn money and get his life back on track before finding a more stable career. “I’ll just do it for a little while and then go back to college,” he thought. But soon, Hall became enamored with the job. Just wearing the coal miners’ uniform around the town commanded attention and envious looks from his neighbors. More than that, though, what kept him underground was the brotherhood Hall felt in the mines amongst the impressive machinery and tools. He would miss the job, the people, and, more than anything, the five-figure salary. Hall spent years looking for another job before he landed at Portal 31. He considered moving out of Appalachia, but just a week after he was laid off, Hall’s mother suffered a stroke and he became her primary caretaker as she recovered over the next three years. Hall knows he can’t sustain a life from the $8 an hour he earns at Portal 31. He needs to find a job in a real mine to earn a good income. “There’s nothing here,” he says. “There’s nothing. Except coal.” It’s difficult to identify where Friends of Coal’s corporate marketing ends, and the sincere desires of a town desperate for employment and community spirit begin. Hall steadies the trolley into the final cavern of Portal 31, where a panoramic light and sound display awaits to stun and impress visitors after the dark ride through the tunnels. It doesn’t have quite the same effect on Hall. He’s done this tour so many times, he can almost recite all the words heard through the overhead speaker. Once the tour is over, Hall watches the tourists scuttle from the ran into the gift shop next door to buy the coal regalia up for sale. A car drives past with a Friends of Coal sticker displayed proudly on its rear window. Hall may not be a card-carrying member of Friends of Coal, but he shares the desire to protect the mining interests of his community. According to Hall, it’s only a matter of time before the “war on coal” gears up again, no matter what certain politicians promise during the election cycle. “The ‘green’ vote is a lot bigger than the coal vote,” he says. “So who are you gonna pander to?”\nCorporate Ventriloquism? In 2014, a group of American researchers writing in the book Voice and Environmental Communication labelled Friends of Coal a form of “corporate ventriloquism,” a way for the coal industry to usurp the voices of coal town residents and create “the impression of broadly based support for coal.” But, in places like Lynch and Portal 31, ardent support for coal is more than just an impression. It’s a reality. Under the Friends of Coal brand, communities organize breast cancer fundraisers and charity drives for the local church. One section of the Coal in Classroom program takes children to the local retirement home to sing and speak to its residents. Often, it’s difficult to identify where Friends of Coal’s corporate marketing ends, and the sincere desires of a town desperate for employment and community spirit begin. In this tangle of industrial and communitarian loyalties, the ideals of a social justice movement can seem like an anathema to an Appalachian identity. And, yet, there is a small constellation of environmental and social groups that call these mountains home and openly criticize Friends of Coal’s agenda. Their calls for investment in renewable energies, support for local businesses, and a transition away from the region’s beleaguered coal industry tend to put them at odds with their more traditionalist pro-coal neighbors.", "url": "https://www.jacobinmag.com/2017/12/appalachia-friends-of-coal-mining-industry-jobs-environmental-just-transition"}