{"authors": ["Corey Robin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:25", "date_modify": "2020-05-04 19:59:25", "date_publish": "2017-07-23 00:00:00", "description": null, "filename": "2017_07_robin-millennials-earthquake-financial-crisis_1588622365.html", "image_url": "https://images.jacobinmag.com/2017/07/23120208/35017380903_3d5b75ba8f_k-e1500825787861.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_07_robin-millennials-earthquake-financial-crisis_1588622365.html", "title": "The Millennials are the American Earthquake", "title_page": "The Millennials are the American Earthquake", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "This is a super-fascinating article for multiple reasons.\nFirst, it turns out millennials are even more like the 1930s generation than we realized. Not just in their politics, as Andrew Hartman recently argued, but also in their economic practices. Having come of age during an epic financial crisis, they’re now staying away from the stock market, and putting their money in savings accounts — the equivalent, during the Depression, of stuffing your dollar bills in a mattress for fear of there being a run on the banks.\nThese little gestures signal deep cultural shifts that are ultimately really important for politics. My generation was raised to think that the stock market was our savior. Fuck pensions and Social Security! You can’t trust the state or the long-term future. You can get much better returns from the whiz kids on Wall Street. That millennials are rejecting that kind of message seems hugely significant to me.\nI’ve been saying for years that I would love to see a contemporary version of Edmund Wilson do what he did during the Depression: go and report on the everyday life of the 2008 financial crisis and its aftermath, seeing how the mood and manner of this generation has been fundamentally altered and reshaped by that experience. It may not be quite The American Earthquake — yet — but there certainly are tremors (what Wilson called, in the book’s first iteration, “the American jitters.”)\nSecond, that the Post thinks millennials earning $40,000 dollars a year have tons of extra disposable income to sock away for their futures seems risible. Given rents and job precarity and student loans that have to be paid off, it seems totally rational to me that a young person in today’s economy would want to be assured that they’ll have money for food and rent come next month. Better to keep it in the bank than tie it up in a long-term index fund or whatever. Having the money near at hand seems perfectly understandable.\nThird, the freakout from the Post and the investor class over this is delicious. Wall Street has ever been the antenna of the nation. It registers — inadvertently, unconsciously — movements and shifts that aren’t always apparent to the eye. Not just economic movements but also cultural and political ones. As Jevons said:\nJust as we measure gravity by its effects in the motion of a pendulum, so we may estimate the equality or inequality of feelings by the decisions of the human mind. The will is our pendulum, and its oscillations are minutely registered in the price lists of the markets.\nWhat the market is telling us is: the motion of the pendulum is moving in a different direction; the will of this new generation is not like that of its recent predecessors.\nUpdate:\nJust a few minutes out, and I’m already seeing tons of responses to this on Twitter and Facebook. Young people telling their personal stories — with precision, concreteness, detail — of their struggles in this economy. I find it all unbelievably poignant.\nIt just makes me all the more enraged at the Clintonite blather you hear on social media. And not just the Clintonites; it’s also the Left. What, in the end, do we on the Left have to offer people today? Medicare for All and free college. Don’t get me wrong; these would be great, and I’ve been fighting for them, too. But they don’t touch the fundamentals of the economy. I don’t mean that in a Marxist sense.\nJust think of everyone from the New Dealers to Bill Clinton: all of them had a theory of the economy and how it might improve people’s lives and standing. Clinton’s was bullshit, but he was the last one to even think he had to offer a comprehensive account to people. Perhaps that was due to the hangover from the Cold War, which is now over. Without the challenge of Communism, we don’t think we need to give people something like a vision of the economy.\nSo we let this generation die. We bury them, without having even the decency to perform an autopsy or deliver a eulogy.", "url": "https://www.jacobinmag.com/2017/07/robin-millennials-earthquake-financial-crisis"}