{"authors": ["Jeff Himler"], "date_download": "2020-05-04 20:08:16", "date_modify": "2020-05-04 20:08:16", "date_publish": "2017-11-30 17:51:20", "description": "More students in Westmoreland County elementary schools are demonstrating proficiency in language arts, as measured by standardized state tests, than in math. They're joined by students at...", "filename": "_e2b64605c85e4084bb50bc81bcadf26e_1588622896.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e2b64605c85e4084bb50bc81bcadf26e_1588622896.html", "title": "Math test scores continue to lag in schools across Westmoreland County, Pennsylvania", "title_page": "Math test scores continue to lag in schools across Westmoreland County, Pennsylvania", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "More students in Westmoreland County elementary schools are demonstrating proficiency in language arts, as measured by standardized state tests, than in math.\nThey’re joined by students at many other school districts in the Keystone State, as trailing math scores on the annual Pennsylvania System of School Assessment test are a statewide trend. Between 60 percent and 65 percent of Pennsylvania students in grades 3-6 were deemed proficient or advanced in language arts, while only 40 percent to 55 percent were proficient in math, based on the most recent PSSA test scores.\n“There isn’t a clear indication yet as to why that is,” Mary Catherine Reljac, assistant superintendent at Franklin Regional School District, said of the lagging math scores. “Every school district is trying to figure that out.”\nArea educators have noted that assessment test questions in both subject areas increased in rigor after Pennsylvania adopted new, more demanding Common Core academic standards in 2014. But the increase in complexity was most dramatic for the math questions.\n“Some of the concepts that were in sixth grade are now in fourth grade,” Reljac said.\nShe acknowledged that, overall, PSSA math scores have been lower compared with language arts scores in the few years since the core standards were adopted.\n“There are so many factors involved when you shift the blueprint of a test,” Reljac said. “It takes time for curriculum development to get caught up.”\nFranklin Regional’s elementary school produced some of the best math scores in the county last spring — with advanced and proficient percentages in grades 3-5 ranging from 65 percent to nearly 85 percent.\nFranklin Regional views the state standards as “the floor, not the ceiling” of what district students should achieve, Reljac said. Elementary instructors make sure students can apply math concepts to real-world problems.\nReflective of some questions in state test samples posted online, students tackle problems with multiple steps. First-graders determine how to distribute crayons in a classroom using various groupings of the coloring sticks, Reljac said.\nStudents also learn different methods of figuring a percentage — in one’s head when considering discounts at a retail store, but with a calculator when faced with a chemistry problem.\n“They can choose the ways that make sense to them,” Reljac said.\nAt Greater Latrobe School District, the latest math proficiency rates at three elementary schools range between 58 percent and 69 percent. Test results have not revealed any specific math topic, such as fractions or geometry, that is especially difficult for students, said Mike Porembka, the district’s director of teaching and learning.\n“There’s not any one thing we can pinpoint,” he said. “It’s a matter of improving instruction everywhere.\n“With every benchmark test, every weekly test, every chapter test — whether it’s at the beginning, end or middle of the year — we’re analyzing that data and using it to drive the instruction in the classroom.”\nHe said open-ended questions on the PSSA math test are particularly challenging for students, requiring them to explain at length in writing the methodology they used to arrive at an answer.\nSome have expressed skepticism about the Common Core standards.\nUnity resident Brad Kesner, whose daughter is a Greater Latrobe first-grader, said he was told at a parent-teacher conference that it may take some time for parents to catch on to their children’s advanced math instruction.\n“It’s hard for us because they’re trying to teach them right off the bat,” he said. “The teacher said we would be brought in eventually, but our kids are going to have to show us how to help them with math.”\nPenn-Trafford elementary schools did well on the state math tests last spring, with advanced and proficient ratings ranging from 66 percent to 82 percent.\nPenn-Trafford Assistant Superintendent Scott Inglese noted that the PSSA math exam gets far more rigorous in fifth grade compared with third grade. He said teachers constantly evaluate data to determine weak spots and adjust teaching and curriculum to address areas where students are struggling.\n“It’s a huge jigsaw puzzle in how you put all the pieces together and address the issue,” he said. He pointed out that keeping up with the demands of testing can be a challenge because the curriculum or types of questions on the test may change.\nTest results for Jeannette City School District show a proficiency level of 44 percent for grades 3 and 4, 10 percent for grade 5 and 38 percent for grade 6.\nWith the district’s relatively small enrollment, one student scoring poorly has a magnified impact on the school’s overall rating, Acting Superintendent Matthew Jones said.\n“Language arts has always been our strong suit, where we’ve far exceeded our math scores,” Jones said. “We’ve been focused on trying to increase our math scores.”\nWhen the district shifted students in grades 7 and 8 from the elementary building to the secondary building, it increased the time available for math instruction. Jones said Jeannette now schedules a double period for math, which has expanded from 84 minutes to 90 minutes and provides students who need extra help better access to support teachers.\n“It’s not a huge increase, but we’ll take every minute we can get,” he said.\nSome have complained that teachers spend too much time preparing students for taking the PSSA exams and administering benchmark exams to assess progress rather than providing actual math instruction.\nCiting a similar concern, state officials have reduced the size of the math PSSA that students will take in the spring. The test still will have three open-ended questions, but multiple choice items will be cut from 60 to 40.\nWhile much attention is given to PSSA scores, administrators in several districts pointed out they are not the only way to measure student success.\n“It is only one moment in time,” Reljac said of the test. “It’s an important piece of what we do, but it’s not the only one. Students are so much more than one number.”\nStaff writer Jamie Martines contributed. Jeff Himler is a Tribune-Review staff writer. Reach him at 724-836-6622, jhimler@tribweb.com or via Twitter @jhimler_news.", "url": "https://apnews.com/e2b64605c85e4084bb50bc81bcadf26e"}