{"authors": ["Joe Allen", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 20:00:13", "date_modify": "2020-05-04 20:00:13", "date_publish": "2017-06-22 00:00:00", "description": null, "filename": "2017_06_ups-shooting-workplace-violence-neoliberalism-teamsters_1588622413.html", "image_url": "https://images.jacobinmag.com/2017/06/22110934/ups.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_06_ups-shooting-workplace-violence-neoliberalism-teamsters_1588622413.html", "title": "Going Brown", "title_page": "Going Brown", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOn June 14, Jimmy Lam, a UPS package car driver in San Francisco, walked into work and shot and killed three coworkers, then himself. This is the second mass shooting in less than three years at UPS. Joe Tesney, a driver for the company for twenty-one years, shot and killed two supervisors and himself in Inglenook, Alabama, on September 23, 2014. Lam’s life was plagued by many problems — he had child visitation conflicts with the mother of his child and a previous arrest for a DUI. But most importantly, it was his workplace that made his life unbearable. He was an eighteen-year veteran of the company and recently filed a grievance for excessive forced overtime. The manager that Lam filed the grievance against was apparently not present at the daily drivers’ meeting, known as the “pre-work communications meeting” or PCM, on the day that he exploded. The massacre took place at the San Francisco UPS hub located in the Potrero Hill neighborhood. One of Lam’s fellow UPS drivers told the Potrero Hill news site Hoodline that Lam was “kind of a quiet dude, but a hard worker who was always angry about doing his overtime.” “Sometimes you do get overwhelmed,” Brandi Porter, another driver and sixteen-year company veteran, also told Hoodline. “They say UPS drivers and police officers have the highest rate of divorce, and I say that’s because of the overtime.” More ominously, she added: “You’ll never know what goes on in the mind of a UPS truck driver.” Many will suffer with the aftereffects of Lam’s rage killings for the rest of their lives. While there is still much to learn about what happened in San Francisco, there is one thing we know for sure: UPS will not change any of its policies —impossible productivity demands, excessive overtime, the constant micro-management and institutional harassment of drivers — that likely sparked the killings.\nFacts of Life The threat of workplace violence is never very far away at UPS. Over thirty years ago, an older part-time worker — I’ll call him “Bill” — took the opportunity to teach me the facts of life at UPS. I had only been working there a few weeks at its Watertown hub, just outside of Boston. We worked the invitingly titled “twilight shift” five nights a week. I guess he sensed that I was going to last, and he wanted me to know what it was really like to work at UPS over the long term. Bill told me of the time that a new “sup” (pronounced “soup,” short for “supervisor”) had decided to dress him down in front of all of his co-workers. Bill was an experienced worker and older than the new sup. The new supervisor wanted everyone to know who the boss was. Bill was deeply humiliated and enraged but said nothing while at work. He punched out at the end of his shift and went to his car. Bill took a baseball bat out of the trunk and placed it in the front seat with him and waited for his supervisor to come out of building. Part-time supervisors usually left work an hour or so after the hourlies. During that time, doubts began to cross Bill’s mind about what he was about to do. “What will happen to my wife, my kids, if I kill this guy?” It was only later that I realized that he didn’t make any reference to himself. He didn’t say, “What would happen to me?” By the time the supervisor walked through the guard shack, the spell had been broken. The sup disappeared into the night, and Bill drove home to his wife and kids. Bill looked at me with a cool seriousness and said, “He’ll never know how close he came to . . .” and his voice trailed off. Bill was a good person. He worked a full-time job during the day and worked at night at UPS largely for the medical benefits. But he was living through a great downward spiral of working conditions at UPS in the mid-1980s when the workplace was becoming more difficult and dangerous to work in. The new two-tier wage structure meant that older, higher-paid part timers like Bill had a target on their backs. The company harassed workers like Bill constantly, looking to fire them, while he and others were struggling with a greatly weakened union on the shop floor. My conversation with Bill comes back to me frequently when I’m writing about UPS, the largest private-sector, unionized employer in the United States, and trendsetter in the global logistics industry. “Big Brown” has a ubiquitous presence in American life, where its chocolate brown delivery trucks dot the urban and suburban landscapes. UPS moves about two percent of the global economy and six percent of the US GDP every day. Behind those massive numbers lie untold numbers of frustrated workers like Bill and Jimmy Lam.\nMethods Madness UPS has always been a physically and mentally demanding place to work. But this situation has worsened lately. This is not a secret. Twelve days before Lam’s rampage, I posted on the “Vote No on UPS Contract” Facebook page, one of the more popular UPS worker pages: Reports from across the country are that working conditions are worse than ever especially inside the hubs. I hope that there won’t be a repeat of the Tesney case but UPS doesn’t appear to have learned a thing and seems determined to push its people beyond human endurance. I’m not clairvoyant nor do I have any special inside information on the state of work conditions at UPS. I simply listen to my friends who work at UPS in the Chicago area and around the country. This deteriorating situation is fully known to the hundreds of Teamster officials, staffers, and union stewards across the country that represent over 250,000 UPS workers. The Teamsters should be the bulwark against UPS’s rapacious management; instead, with the exception of a few local unions, the union is nowhere to be found inside the big logistics hubs, despite UPS being the largest concentration of workers in the union. One friend, who is a driver in New York, wrote to me this past spring: They are disciplining members for petty shit. Last week a driver with 31 years n was given a letter for backing up 10 times!! I was given a warning letter for allegedly stop completing [recording a delivery into a handheld computer called a DIAD] a stop “while the package car was running.” Drivers are getting warning letters for not taking clerk work off their trucks. Management are starting a paper trail against us so they can have another “violation” and use progressive discipline by calling all of these violations “not following methods.” One week it is clerk work . . . letter. Then it’s stop completing while idling . . . now it’s a one day suspension . . . then a 3 day for another so-called methods violation\n. . .then its discharge . . . on to the grievance panel. Later he wrote to me, “Our [union] stewards are being walked out of the building every day” by management. It is common for drivers to work off the clock to load their trucks, work through their lunch hours, and break times. One result of this is a high rate of injuries among drivers. Not only does such a situation question the credibility of the union as an institution, it allows the hellish working conditions to flower and eat away at the camaraderie and solidarity among UPS drivers, especially. The New Yorker magazine in 1947 did a rare profile of the press-shy James E. Casey, UPS’s founder and longtime company head. It reported that UPS had more rules than a “Tibetan monastery.” The same is true today. The 2009 edition of “The UPS Industrial Engineering Standard Practice Manual: Service Provider Delivery and Pickup Methods” has seventy-six pages of “methods” for a package car driver to follow every second of every minute of every hour a driver is on the clock. This is an impossible task and has led to serious physical and mental health problems for drivers over the years. Twenty-five years ago, the Great Lakes Center for Occupational and Environmental Safety and Health, affiliated with the University of Illinois, conducted a nationwide study involving 317 package car drivers at an “unnamed delivery company” that was obviously UPS. Among the sources of stress for drivers it reported: The drivers complained of a punitive attitude from front-line supervisors, daily supervisory pressure to work more hours and through lunch, stressful supervisory pressure in the trucks on their routes, and pressure on replacement drivers to outperform those on sick leave or vacation. They reported conflicting expectations emanating from differing supervisors and a disciplinary system in which they were ‘judged guilty, and sentenced before trial.’ Finally the drivers reported a stressful social environment at work fostered by a perceived lack of social support from supervisory personnel. It concluded: “This study suggests that job stress is a psychological health hazard for these drivers.” Twenty-five years later, the same is still true.\nBleed Brown UPS has a longstanding reputation for its military, even cult-like management style. One former chairman of UPS boasted to Newsweek that its corporate culture was “half Marine Corps and half Quaker meeting.” But there were two important turning points in the last four decades that created this workplace hell. In his book Going Postal: Rage, Murder, and Rebellion From Reagan’s Workplaces to Clinton’s Columbine and Beyond, Mark Ames documents the mass revenge killings that began at the United States Postal Service (USPS) in the 1980s and spread though the American workplace. Why did these mass killings start at the post office? Ames argued: One reason the whole rage murder phenomenon may have started with the post office is that the eight-hundred-thousand-employees-strong service, the nation’s second-largest employer, was the earliest and largest agencies in the post-New Deal era to be subjected to what was essentially a semi-deregulation and semi-privatization plan, in what the neoconservative American Enterprise Institute calls “the most extensive reorganization of a federal agency.” President Richard Nixon signed the Postal Reorganization Act of 1970 into law following the historic wildcat strike of postal workers. The post office was demoted from being a cabinet-level department and turned into a corporate-like independent agency. Collective bargaining rights of postal workers were expanded — how couldn’t it be after such a massive, disruptive strike? — but the right to strike was banned. A productivity push began and the internal culture became extremely authoritarian. The second turning point for Ames was the anti-working-class politics of President Ronald Reagan and the 1981 firing of striking air traffic controllers. In the frenzy of union busting, deregulation, the push for greater productivity along with drastic wage and benefit cuts that followed Reagan’s destruction of PATCO turned the American workplace into a living hell. The productivity push that began at the post office was matched and then exceeded by UPS in its brutal treatment of its workers. It led the way in the destruction of full-time jobs into part-time and multiple-tier wage structures that became the new normal for so many American workers. UPS embraced neoliberal policies with gusto and became a trendsetter in corporate America. But, UPS always made its own mark with its peculiar workplace authoritarianism. Former UPS manager-turned-company-historian Greg Niemann boasted, “UPSers turn out better than machines.” The process by which this is done is a kind of boot camp, indoctrinating employees with UPS’s unique corporate culture and expectations . . . By the time employees have moved mountains of cardboard-clad merchandise, they have either caught the UPS commitment or they haven’t. If they have, that seed of UPS perseverance will spread through their systems until they “bleed brown blood.” UPS took this model of an authoritarian workplace where it set up shop around the workplace. Niemann quoted Gale Davis, a member of the initial UPS start-up team in West Germany in the mid-1970s, on the initial conflict between UPS and German workers: “Most Germans felt that a better way to handle excessive work loads was to hire more and more people.” Like most Europeans, the German population didn’t even consider the concept of “living to work”; they only worked to live and strived to work as little as possible. You can imagine how this lassitude and lack of commitment struck UPS mangers who lived and breathed “brown.” After a decade of rage killings at the post office that began in Edmonton, Oklahoma, and spread throughout the country, even the self-proclaimed “capitalist tool” Fortune magazine admitted in 1993, “Homicides committed by disgruntled employees and former employees at the workplace are on the rise. That kind of killing was virtually nonexistent before 1980.”", "url": "https://www.jacobinmag.com/2017/06/ups-shooting-workplace-violence-neoliberalism-teamsters"}