{"authors": ["Jason Turner Sports Writer"], "date_download": "2020-05-04 20:19:46", "date_modify": "2020-05-04 20:19:46", "date_publish": "2017-11-26 07:02:00", "description": "USAFA — Missed opportunities, dropped passes, a couple of critical mistakes and their inability to get off the field defensively ultimately led to the Aggies' demise on a chilly Saturday night in...", "filename": "_60f0b17a245d4d68b78bf0b276f8602b_1588623586.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_60f0b17a245d4d68b78bf0b276f8602b_1588623586.html", "title": "Missed chances costly for USU in loss to Air Force", "title_page": "Missed chances costly for USU in loss to Air Force", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "USAFA — Missed opportunities, dropped passes, a couple of critical mistakes and their inability to get off the field defensively ultimately led to the Aggies’ demise on a chilly Saturday night in front of 17,252 fans at Falcon Stadium.\nAir Force’s third-string quarterback Isaiah Sanders — the first and second-string signal callers were injured — had a monster game as he scored a trio of rushing touchdowns, the final with 1:38 left in the fourth quarter to propel the Falcons to a come-from-behind 38-35 Senior Night victory over the Aggies in a Mountain West football tilt. AFA overcame a pair of 11-point deficits en route to snapping USU’s three-game road winning streak.\n“It hurts a lot, knowing how much we prepared for the game and how much we fought in this game,” USU quarterback Jordan Love said. “And so just not being able to get it done at the end, it hurts a lot.”\nThe Aggies (6-6, 4-4 MW) did have a chance to at least send the game into overtime as Love connected with wide receiver Braelon Roberts for a 38-yard reception into Air Force territory. However, four straight incompletions — two passes that were dropped — spelled doom for the visitors.\nFor the second straight year, USU outgained AFA by close to 100 yards — 521 to 440 in this case — only to lose a nailbiter. Sanders was the biggest reason the Falcons prevailed as he gashed the Aggies to the tune of 196 yards rushing on 44 attempts, a AFA school record.\n“We didn’t stop the run and if you don’t stop the run you’re going to bleed and bleed and bleed until you don’t have any blood left, and that’s the bottom line,” USU head coach Matt Wells said. “We hurt ourselves on offense with dropped balls. I thought we played well on offense, but we didn’t score enough.”\nLove played well for the most part as he completed 17 of 30 passes for 284 yards and a pair of fourth-quarter touchdown tosses to wide receiver Ron’quavion Tarver. The Falcons had no answers for the 6-foot-4 Tarver, who allowed the Aggies to regain the lead twice on TD catches of 24 and 22 yards on fade patterns.\nHowever, Love was stripped of the pigskin in the fourth quarter in the end zone, and Air Force’s Santo Coppola fell on the ball in for a 31-28 Falcon lead. A 72-yard punt by the hosts set the stage for that defensive TD. USU’s Zach Van Leeuwen was unable to field the punt that initially bounced at the USU 20-yard end, and the ball rolled all the way to the 2.\n“I wish he would have caught the ball (on that punt),” Wells said.\nUSU quickly bounced back from that disastrous sequence with Tarver’s second TD, but AFA promptly proceeded to cap off a 13-play, 75-yard march with Thomas’ game-winning 11-yard scoring scamper.\nTarver ended up with four receptions for 86 yards, while Roberts snared three catches for 64 yards.\nAir Force (5-7, 4-4) enjoyed a whopping 37:51 to 22:09 edge in time of possession, and that made a huge difference. The Falcons ran 94 plays to the Aggies’ 59.\nEarlier this week Wells announced USU slot receiver Aaren Vaughns would be placed on scholarship, starting next semester. The junior celebrated by taking a reverse on the game’s opening possession, narrowly beating an Air Force defender to the edge and then putting on the afterburners in route to a career-long 71-yard scamper to paydirt. It was USU’s longest rushing play this season.\nVaughn’s season-long team rush would be short-lived, though. Twenty seconds after the Falcons kicked a field goal to pare their deficit to 7-3, Aggie tailback Gerold Bright exploded up the middle untouched for a 75-yard scoring run with 7:47 remaining in the first quarter. USU’s offensive line absolutely gashed AFA’s defensive front on that play.\nAir Force pulled to within 14-10 on a 2-yard TD run by Tim McVey late in the first quarter, but USU answered with LaJuan Hunt’s eighth rushing touchdown in the last five games — this time from 11 yards out with 5:56 remaining in the opening half.\nDJ Nelson helped make Hunt’s 10th scoring run of the year possible on a huge 20-yard screen pass on third-and-11 two plays prior to the TD.\nThe Aggies marched into Air Force on three other occasions in the second quarter, but failed to capitalize on any of those possessions. On one of those drives, a 39-yard dime of a TD pass from Jordan Love to Roberts was negated by a holding penalty.\nIt proved extremely costly as the Falcons marched 91 yards in the final 2:43 of the half. Sanders powered his way into the end zone from 2 yards out with four seconds remaining in the half to trim the hosts’ deficit to 21-17.\nBright finished with 102 rushing yards — his first time over the century mark. USU finished with 237 yards on the ground, but 168 of them were in the first quarter.\nRedshirt freshman David Woodward made his first career start and recorded a career- and game-best 13 tackles. Fellow linebacker Suli Tamaivena added 11 tackles and now has more than 100 stops on the season. Logan product Derek Larsen had a sack, and redshirt freshman cornerback Ja’Marcus intercepted his first pass for the Aggies, who will now play the waiting game for a possible bowl bid.\nAggie notes: USU’s captains for the regular season finale were junior center Quin Ficklin, junior quarterback DJ Nelson, senior tailback LaJuan Hunt and sophomore nose guard Christopher ’Unga. ... The Aggies have had 25 first-time starters during the 2017 campaign, which ranks as the fourth-most nationally. ... USU has put together 18 scoring drives on four plays or fewer this season. ... The Aggies had two 70-plus-yard TD runs in a game for the first time ever according to available records.", "url": "https://apnews.com/60f0b17a245d4d68b78bf0b276f8602b"}