{"authors": ["Various Authors", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:07", "date_modify": "2020-05-04 19:58:07", "date_publish": "2017-02-17 00:00:00", "description": null, "filename": "2017_02_eurozone-eu-debt-syriza-greece_1588622287.html", "image_url": "https://images.jacobinmag.com/2017/02/17233906/euros.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_02_eurozone-eu-debt-syriza-greece_1588622287.html", "title": "Ten Proposals to Beat the European Union", "title_page": "Ten Proposals to Beat the European Union", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Two years after Syriza’s election, despite all that has transpired, the Left lacks a clear vision of the European Union.\nThe aim of the following text, initiated by Eric Toussaint of the Committee for the Abolition of Illegitimate Debt, aims to provide just that. It was signed by figures, including members of parliament, from more than fifteen European countries, representing a wide range of forces of the radical and anticapitalist left: Podemos and United Left in Spain, the Portuguese Left Bloc, Germany’s Die Linke, the New Anticapitalist Party (NPA) and Ensemble! in France, Popular Unity and Antarsya in Greece, the radical Danish left and activists from countries such as Cyprus, Slovenia, Bosnia-Herzegovina and Hungary. What unites them is a desire to continue discussions about a “plan B” for Europe.\nThe following analyzes the balance of power in the European Union and presents a series of radical proposals against policies of austerity and neoliberalism, as well as for positive alternative to the existing form of European integration.\nThe proposals are the outcome of more than seven years of analysis — not just stemming from the Greek experience, but also those in Spain, Ireland, and Cyprus. Recent events have shown the need for a left-wing government to have the courage to disobey the injunctions of European authorities and break decisively with the European Union framework.\nBut this must be accompanied by a popular mobilization triggered by the initiatives of that government and by a series of robust measures to be immediately implemented: a debt audit with citizen participation, control of capital flows, socialized financial and energy sectors, and a radical tax reform. And of course, the inevitable debate on the eurozone needs to be publicly conducted, with exit as an option that needs to be argued for and democratically won.\nAnalysis of European policies in recent years invariably leads to this conclusion: there is no alternative strategy to breaking with austerity and neoliberalism in Europe.\nSince May 2010, the question of national debt has become a central concern for Greece and for the rest of the eurozone. The first program of €110 billion, imposed by the troika — comprised of the European Central Bank (ECB), the European Commission, and the International Monetary Fund (IMF) — for the purpose of elaborating and executing this program, provoked a brutal increase in Greek public debt. This was also the case in various forms in Ireland (2010), Portugal (2011), Cyprus (2013), and Spain.\nThis program had the following fundamental objectives:\nBail out the private banks with public funds so that they may avoid the damaging consequences of their own private credit bubble, averting a new major international financial crisis.\nGive to the new public creditors, who replaced the private creditors, enormous coercive powers over the governments and institutions of the peripheral countries in order to impose policies of radical austerity, deregulation (eroding large numbers of labor and welfare benefits), privatizations, and stricter authoritarian controls (see the last point)\nPreserve the eurozone perimeter (in other words, keep Greece and the other peripheral countries within the eurozone), which is a powerful instrument in the hands of the multinational corporations and the major economies of the zone.\nBring neoliberal policies to bear more heavily on Greece, in particular, but also on the other eurozone peripheral countries as an example for all the European populations.\nReinforce a Europe-wide (as much for the European Union generally as for each member state) authoritarian form of governance, without resorting to new experiments resembling fascist or Nazi regimes or that of Franco, Salazar, or the Greek colonels (1967-1974). This aspect is insufficiently taken into account because the accent is placed on the economic and social repercussions. The authoritarian tendency within the European Union and the eurozone is a key issue and goal of the European Commission and the big corporations. This touches on executive powers, expeditious voting procedures, limiting or violating many rights, disregarding electors’ choices and, among more, increased repression of dissent.\nThere are lessons to be learned from the failure of the policies adopted by the government of Alexis Tsipras in 2015 to break the bonds of austerity. It is also necessary to realize the limits of the socialist minority government of Antonio Costa in Portugal.\nAlternative policies in the people’s interest must at the same time address austerity, public debt, private banks, the eurozone, and oppose authoritarian tendencies. The experiences in the eurozone over the 2010-16 period clearly show that it is impossible to break with austerity unless responses to at the least the abovementioned problems are put forward. Of course, the climatic and ecological crises must also be addressed. So must we confront the humanitarian crisis caused by Europe’s fortified-borders policy, the Middle East crisis, and the rise of racism and the far right, responsible for the death of so many immigration and asylum seekers in the Mediterranean.\nSince the election of Trump, and also since the appearance of the radical movements that gathered around the Bernie Sanders candidacy, now called into the front line of opposition against Trump and his program, the European radical left, trade unions, feminists, and ecologists must create links with the forces of resistance in the United States.\nA large part of the radical left forces who have sitting members of parliament had and still have a mistaken idea of what EU integration and the eurozone is. To put it simply, they seem to see more advantages than disadvantages in the European Union. They consider that the European Union, as much as the eurozone, is compatible with a return of social-democratic policies, somewhat less injustice, and a Keynesian-style relaunching of the economy.\nConsidering the experiences of 2015, it is fundamental that those who have no illusions about the European Union or the eurozone, and are proposing authentic ecological and socialist perspectives in rupture with the European Union, as it exists, be reinforced. It is clear that neither the European Union nor the eurozone can be reformed. It was demonstrated that it is impossible, on the basis of the legitimacy of universal suffrage and democratic debate, to persuade the European Commission, the IMF, the ECB, and the conservative governments in power over most of Europe to agree to measures that are respectful of the rights of the Greek people, or of any other population.\nThe July 5 referendum, which the European institutions fought tooth and nail by means of blackmail and coercion (such as forcing the Greek banks to close for five days preceding the referendum), did not bring them to make any concessions. On the contrary, totally ignoring all democratic principles, their demands became considerably more oppressive.\nCertainly, there are many measures that could and should be taken at the European level to stimulate the economy, reduce social injustice, make the debt sustainable, and invigorate democracy. In February 2015, Yanis Varoufakis, while serving as Greek minister of the economy, presented proposals in this sense, suggesting that Greek debt be exchanged for two new kinds of bonds — either growth indexed obligations or “perpetual” obligations — which would never be reimbursed but would be paid out, interest only, perpetually. These proposals, although moderate and perfectly achievable, had no chance at all of being accepted by the European authorities.\nThis is the case with many proposals aiming to ease Greece’s and numerous other countries’ debt (joint debt recognition, euro-denominated mutual bonds, etc.). Technically these proposals are all viable but, in the present political context and balance of power in the European Union, the will to put them into practice is lacking. A progressive government cannot hope to be heard, respected and, even less, assisted by the European Commission, the ECB, and the European Stability Mechanism.\nThe ECB can paralyze a eurozone country’s banking system by cutting off its banks’ access to liquidities. The ECB’s arbitrary power and the banking union reinforce the coercive powers the European institutions can use to counter any experience of progressive policy in Europe.\nThe treaties have become extremely restrictive on matters of debt and deficit. The European authorities, in control of policies, could easily decide to derogate to these regulations by taking into consideration the state of crisis (actually they do this for “friendly” governments), but they clearly had no intention of doing so.\nOn the contrary, all the negotiating parties fiercely fought the Greek government even though it gave proof of great moderation (to say the least). The mainstream media and numerous European leaders treated Alexis Tsipras and Yanis Varoufakis as rebels, or even as radical anti-Europeans. Between January and July 2015, the troika launched a fight against the Greek government, in order show to the peoples of Europe that there is no alternative to neoliberal capitalism.\nThe capitulation of the first Tsipras government was not enough to satisfy the IMF or the European leaders. Pressure continued to be laid on the second Tsipras government to apply ever more neoliberal policies, especially attacking public property, the welfare and retirement systems, and assisting big capital through the introduction of further judicial and legal frameworks favoring privatization and fundamental structural regression. All these new measures lead to increased injustice and precariousness.\nIf the creditors agree to a new restructuring of the debt, it will be under the condition that the same kind of policies be continued. In this case, a reduction of the debt will not at all be a victory or even a consolation. It will be no more than a measure to ensure continual reimbursements while seeking to dampen any arising social struggles.\nThis is the first lesson: unless they take strong sovereign and unilateral measures of self-defense, the people and the governments they bring to office to break with austerity programs cannot put an end to the human rights violations perpetrated by the creditors and the big corporations.\nSome would argue that should a leftist government come to power in Madrid, it could use the weight of the Spanish economy (the fourth in the eurozone in terms of GDP) to negotiate concessions that Tsipras was unable to obtain. But what would be those concessions? Relaunch production and employment through heavy public spending and deficits? The ECB and Berlin along with at least five or six other capitals would oppose such policies! Taking strong measures against the banks? The ECB, with the support of the European Commission, would reject such policies.\nWhat is also certain is that if the radical left entered the government of a country like Cyprus, Ireland, Portugal, Slovenia, or one of the three Baltic states, they would not have the weight, facing an unyielding European Commission or ECB board, to convince these institutions to let them renounce austerity, stop privatizations, develop public services, and drastically reduce the debt. These countries will have to resist and take unilateral measures in the interest of their populations. Could several progressive governments of eurozone countries form a common front for renegotiations? It would certainly be very welcome if this could happen, but the possibility is remote, if only for reasons of electoral agenda.\nShould Jean-Luc Mélenchon win the upcoming presidential election in France, and his coalition win the following general election, could a French left-wing government achieve a reform of the euro? Mélenchon and the staff of his campaign believe so. It is reasonable to have doubts about this possibility. Let’s suppose that Mélenchon does win and forms a government intending to introduce social policies and to reform the euro. What would be the options?\nIt is quite likely that a French government could afford to disobey the current treaties, but it could not achieve a far-reaching reform of the entire eurozone. To do this would take simultaneous progressive electoral victories in the major countries as well as in peripheral countries. That said, it is clear that a government of a defiant France, and its allies, taking measures in favor of the French population and the peoples of the world (for instance, by abolishing Greece’s and developing countries’ debts towards France) could have a positive effect throughout Europe.\nHaving said that, the way out of the crisis is not of a nationalist nature. As much as in the past it is necessary to adopt an internationalist strategy and aim for a European integration that brings together the peoples opposed to the present form of integration, totally dominated by the interests of big capital.\nThe weak links in the inter-European chain of domination are to be found in the peripheral countries. If Syriza had adopted a correct strategy in 2015 it could well have been a turning point. It didn’t happen.\nOther weak links where the radical left may gain power in the not-so-distant future are Portugal and Spain, and perhaps Cyprus, Ireland, and Slovenia. A progressive move ahead would depend on the capacity of the radical left to learn the lessons of 2015 and thus make anticapitalist and democratic proposals that will trigger popular support. Without doubt, the force of popular mobilization will be a decisive factor. If the pressure for real uncompromising change does not invade the streets, the neighborhoods, and the workplaces, the future will be very dark.\nTo avoid what we saw in Greece in 2015, here are ten proposals for social mobilization and actions to be taken immediately and simultaneously by any government that is truly operating in the interests of the people.", "url": "https://jacobinmag.com/2017/02/eurozone-eu-debt-syriza-greece"}