{"authors": ["Dave Askins Dave.Askins Capjournal.Com"], "date_download": "2020-05-04 20:10:47", "date_modify": "2020-05-04 20:10:47", "date_publish": "2017-12-08 07:24:00", "description": "Up to $10,000 in grants will be awarded to Fort Pierre businesses early next year by the Fort Pierre Development Corporation, according to a news release. Applications for the \"Fix Up, Clean...", "filename": "_c03897abd9c643a4af5adc6e1adda47e_1588623047.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c03897abd9c643a4af5adc6e1adda47e_1588623047.html", "title": "Fort Pierre Dev. Corp. invites applications for $10,000", "title_page": "Fort Pierre Dev. Corp. invites applications for $10,000", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Up to $10,000 in grants will be awarded to Fort Pierre businesses early next year by the Fort Pierre Development Corporation, according to a news release.\nApplications for the “Fix Up, Clean Up, Paint Up” grants are now being accepted by the FPDC. The deadline for submission is Feb. 1.\nGeography will factor into the prioritization of potential projects – preference will be given to proposals on main thoroughfares like Deadwood, Main and US-83.\nBut the type of project will also be considered. According to the release, “western front” motifs and historic projects will be a priority.\nAn example of a “western front” project that was supported previously by such FPDC grants is the front of the Duffy Community and Youth Involved Center, FPDC Executive Director Dave Bonde told the Capital Journal.\nThe community center project was done earlier this year, with help from Brosz Engineering.\nLoren Schaefer, an architect with Brosz, gave the Capital Journal some technical descriptions of “western” architectural features, along with a light-hearted summary, “It’s like my daughter’s dress code, you know it when you see it.”\nThere’s not one definition that fits everything, Schaefer said, but the first thing that he thinks of is the materials. In the late 1800s and early 1900s in this part of the country, people used whatever was readily available to achieve a practical purpose. That helps account for the commonness of board-and-batten siding – they put up pieces of wood and just covered the gap between them with another piece of wood, Schaefer said.\nWeathered, unpainted wood, which is typical of the western style, resulted from the relative rarity of paint, Schaefer said. A porch-like structure over a wooden sidewalk was just a way to “get things off the mud with what they had,” he said.\nThose are all elements that Brosz tried to capture with the community center project, Schaefer said, emulating the architectural features that are found right across Main Avenue from the center, in the building where Bow Wow Meow Pet Clinic and Bad River Mercantile are located.\nBut the brick building next door, just to the east is also an example of western architecture, Schaefer said. He was referring to the Stockgrowers Bank, built in 1903.\nImprovements to the Bow Wow Meow frontage was another project previously funded through the FPDC’s “Fix Up” grants, Bonde told the Capital Journal. Since 2014 FPDC has helped fund projects for Diamond D Western Wear & Saddle Shop, Chuck Wagon, Chateau Lounge, Chase Auto & RV, Bad River Furniture, Magpie’s Gathering Place, Dakota Emporium Trading Post, and Total Beauty, among others.\nGrants have historically been for up to $2,000 per application, Bonde said. This year the same limit will apply for $6,000 of the $10,000 pot. But the remaining $4,000 is set aside for a more significant project with a broader community impact.\nBonde explained that the funds for the “Fix Up” grants come from interest earned off the FPDC’s revolving loan fund. The FPDC is a membership organization, drawing from businesses, nonprofits, governmental entities, and individuals – and members are eligible for loans.\nBonde said the interest rate charged for the FPDC loans is 4 percent, and generates about $1,400 a year. Currently, the FPDC has two outstanding loans, Bonde said.", "url": "https://apnews.com/c03897abd9c643a4af5adc6e1adda47e"}