{"authors": ["Paul Wilcoxen Sports Editor"], "date_download": "2020-05-04 20:24:27", "date_modify": "2020-05-04 20:24:27", "date_publish": "2017-12-12 22:16:11", "description": "MOUNT CARMEL — Girls soccer at Mount Carmel High School will be a reality this spring after the Wabash Community Unit District 348 school board voted to add the sport beginning in 2018. The...", "filename": "_274065f151ec4e81896f5972b1c35251_1588623867.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_274065f151ec4e81896f5972b1c35251_1588623867.html", "title": "District 349 board votes to add girls soccer", "title_page": "District 349 board votes to add girls soccer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MOUNT CARMEL — Girls soccer at Mount Carmel High School will be a reality this spring after the Wabash Community Unit District 348 school board voted to add the sport beginning in 2018.\nThe vote was unanimous at 7-0 with minimal discussion after high school principal Jake Newkirk and Aces’ boys’ soccer coach Ed Berberich made a brief presentation to the board, addressing some questions the board had from the last school board meeting.\nFunding for the program was one issue the board inquired about. The team will be fully self-sustaining. The school corporation will have no cost to operate the team as principal Newkirk stated that money would be raised to keep the team active.\nA meeting was held recently by coach Berberich to see how many girls would be interested in soccer. A total of 31 attended the meeting. After that, further discussions were held between Berberich and the potential players, and Newkirk told the board that the number of participants is still in the upper-20s with no cuts planned.\n“We have enough players so there would potentially be a varsity and junior varsity team,” Newkirk told the board.\nNewkirk also endorsed Berberich as the girls’ head coach but the board took no official action on the matter. Berberich splits pay as boys’ coach with an assistant. If hired by the board as the girls’ coach, Berberich would do so without pay.\n“As far as coaching, we have adults that are competent and ready to do it,” said Newkirk.\nBerberick added that referees would be paid through money raised. Also, to help in the cost for the soccer association, Berberick added that two referees can be used — although, he pointed out, three are preferred for varsity games.\n“In terms of saving some money, we might play some games with two referees,” said Berberick.\nThe field is maintained by the Mount Carmel Soccer Association so no additional cost to the school will be necessary for field upkeep. The girls will not need uniforms at this time and will use the boys’.\n“They’re all in really good shape,” said Berberick. “We just bought those two years ago. Down the road, we might look at something else if we get a team started and keep it going.”\nThe boys’ team did not use a bus all year and plans for the same are expected for the girls.\n“The plan is to use volunteer drivers and raise money if we do need to take a bus to any games to cover the cost of that,” said Berberick.\nBerberick told the board that the team is looking at nine games for the 2018 season. That would include one home game, seven away games plus at least one tournament game.\nA tentative schedule calls for a home-and-home series with Olney, plus games at Harrisburg and Centralia along with competing in a tournament in Centralia.\n“It’s pretty lopsided in terms of home and away games, like I mentioned, because we’re trying to get on everyone’s schedule,” said Berberick. “Everyone wanted a home game when I called them. In the future, we’ll look at a more equitable split there.”\nOther teams, Berberick stated, the school could add as opponents are within 90 minutes to 2 hours away. He also noted that several other teams have girls soccer but currently have no openings on their 2018 schedule.", "url": "https://apnews.com/274065f151ec4e81896f5972b1c35251"}