{"authors": [], "date_download": "2020-05-04 20:12:04", "date_modify": "2020-05-04 20:12:04", "date_publish": "2017-10-28 08:00:00", "description": "Iris Law is reportedly dating Kelvin Bueno. The 17-year-old model - who is the daughter of actor Jude Law and his ex-wife Sadie Frost - is rumoured to be in a relationship with the...", "filename": "_91d2b3541ab04cee9df33806853944dc_1588623124.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_91d2b3541ab04cee9df33806853944dc_1588623124.html", "title": "Iris Law is reportedly dating Kelvin Bueno", "title_page": "Iris Law is reportedly dating Kelvin Bueno", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Iris Law is reportedly dating Kelvin Bueno.\nThe 17-year-old model - who is the daughter of actor Jude Law and his ex-wife Sadie Frost - is rumoured to be in a relationship with the 19-year-old, who is also a model, The Mail Online has reported.\nThe dark-haired hunk is also believed to have grown up in Sao Paulo, in Brazil, until he moved to the UK, and he not only represents the British fashion house Burberry, but is also a graffiti artist and a musician.\nAnd it is believed Kelvin penned a song named ’22 Reasons’ to celebrate his girlfriend’s birthday on October 25, which sees him gush about the brunette beauty.\nThe lyrics in the track include: “It’s the way you walk and talk, I think I’ve found my love.\n“It’s the way you call my name, there isn’t another way to say I’ve found my love today, and I ain’t letting go.”\nAnd the catwalk star recently took to social media to gush about Iris on her special day.\nAlongside a photograph of Iris - who graced her first beauty campaign for Burberry earlier this year - in a pink ensemble, which was posted on his Instagram account, Kelvin wrote: “Happy Birthday My Princess (sic).”\nAlthough the pair are believed to have been courting for the past few months, they have remained tight lipped about their romance as Iris has not shared many images of her with Kelvin on her social media sites.\nHowever, Kelvin appears to be more open about his love life and has posted a variety of images of him with Iris, as well as the star on her own, and a photograph of Kelvin accompanied by Iris’ 44-year-old father during a recent trip away to Greece, on his photo-sharing site.", "url": "https://apnews.com/91d2b3541ab04cee9df33806853944dc"}