{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:05:12", "date_modify": "2020-05-04 20:05:12", "date_publish": "2017-01-04 16:49:00", "description": "WHITEWATER — Donald William Hale, 92, of Whitewater, passed away on Saturday, Dec. 31, 2016, at Agrace Hospice Care in Janesville, surrounded by his family. Don was born on June 20, 1924, in...", "filename": "_59d8148f510748d3ba76c5c1734a2fa1_1588622712.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_59d8148f510748d3ba76c5c1734a2fa1_1588622712.html", "title": "Donald William Hale, 92, Whitewater", "title_page": "Donald William Hale, 92, Whitewater", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WHITEWATER — Donald William Hale, 92, of Whitewater, passed away on Saturday, Dec. 31, 2016, at Agrace Hospice Care in Janesville, surrounded by his family.\nDon was born on June 20, 1924, in Lima Center, to Jack and Mary (McCord) Hale.\nHe graduated from Whitewater City High School in 1942 and attended Carroll College that fall.\nIn December of 1942 he enlisted in the U.S. Navy aviation program and was called up in June of 1943. Don was commissioned as pilot in 1944 and served three years, 11 months in World War II. He flew Warbird marine patrol bombers, primarily the PBM-5 Martin Mariner which only could take off or land in water, in the South Pacific during WWII. In 1947, Don resigned for the Navy Air Corps.\nOn Sept. 1, 1951, Don married Janette Wiley Hale. Following her death in 1992, he married Barbara Harris in 1993.\nIn 1949, Don went to work for the Whitewater Lumber Company and took over the business shortly thereafter. The business later became Home Lumber Company.\nDon was an integral part of Whitewater and involved in many organizations. He was a longtime member and past Commander of American Legion Post 173, member of the Veterans of Foreign Wars, 40 et 8, and past president and member of the Whitewater Lions Club.\nHe served on the Whitewater Commercial Bank Board for many years, was one of the original founders of the Whitewater Community Foundation, served on the Walworth County Draft Board and was a trustee at the Congregational United Church of Christ in Whitewater.\nHe helped deliver meals on wheels to those in need until he was 85 years old.\nDon loved working with wood. A skilled craftsman, he could build or fix nearly anything, and did that for many customers for many years.\nHe also grew and maintained huge “mega gardens” at multiple family locations, and shared the abundance of the harvest with others.\nDon was a hard-working man of great stamina, believed in and modeled doing your best every day, and living each day to its fullest — loving life! He will be remembered fondly as strong, loving, giving and kind beyond measure. He had a positive attitude and joyous spirit. His daily mottos were “It’s a good life” and “Keep moving.”\nHe went on an Honor Flight trip in 2010. His last flight in a Piper Cub was at the Palmyra Fly-In in 2013, and in July of 2015 he had a remarkable patrol bomber flight in a PB4Y-2 from Madison to Oshkosh.\nDon is survived by his children, Geoffrey (Jacqueline) Hale, William “Jackson” Hale, Nancy Hale Strand and Mareta Hale, all of Whitewater; grandchildren, Christopher (Olivia) Hale, Michael Hale (Jen Montgomery), MacKenzie Hale, Brett (Beth) Strand and Brandon (Erika) Strand; great-grandchildren, Maci Mae Hale, Kate Piper Strand and Avery Lee Strand; sister, Betty Lawrence of Whitewater; and wife, Barbara of Wyoming.\nHe also was preceded in death by his parents; and brother, J.P. Hale.\nFuneral services will be held on Saturday, Jan. 7, at 11 a.m. at the Congregational United Church of Christ, 133 S. Franklin St., Whitewater, with burial to follow at Hillside Cemetery in Whitewater.\nA visitation will be held on Friday, Jan. 6, at the church, from 4 to 7 p.m. and again on Saturday from 9:30 a.m. until the time of the service.\nIn lieu of flowers, persons might wish to consider memorials be made to the following organizations: Lima Center Church, Whitewater Food Pantry, Washington Elementary mural project, Badger Honor Flight or the Alzheimer’s Association.\nThe Nitardy Funeral Home in Whitewater is assisting the family.\nwww.nitardyfuneralhome.com", "url": "https://apnews.com/59d8148f510748d3ba76c5c1734a2fa1"}