{"authors": ["Craig Sauer Special To The Daily Register"], "date_download": "2020-05-04 20:08:31", "date_modify": "2020-05-04 20:08:31", "date_publish": "2017-03-16 17:21:00", "description": "Rick Dodd will mark his first year as Portage Mayor in April. How does he think he’s doing, now that he is nearing the completion of one-third of his elected term? “I don’t really like...", "filename": "_16e2507974c74b75859ebc7fa5264d13_1588622911.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_16e2507974c74b75859ebc7fa5264d13_1588622911.html", "title": "Dodd reflects on first year as Portage mayor", "title_page": "Dodd reflects on first year as Portage mayor", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Rick Dodd will mark his first year as Portage Mayor in April.\nHow does he think he’s doing, now that he is nearing the completion of one-third of his elected term?\n“I don’t really like to evaluate my own performance because anyone that evaluates their own performance is going to say it is the best it ever was, that I did everything right,” Dodd said from his second floor office in the Municipal Building.\nWhile Dodd may not like to grade himself, he has sought feedback from staff and others in the community. And he keeps his ears open when he is roaming around town.\n“I get a lot of (comments from) people on the street,” said Dodd, who retired at the end of 2016 from GE Healthcare in Madison where he worked as a senior standards engineer.\n“It is difficult to measure success on goals. It is hard to run a survey for the community at large, but if I get people that run into me and say ‘I like what you are doing,’ to me that says that we are going the right way and doing the right thing.”\nAnd if people complain, then maybe the city needs to rethink the direction, Dodd said. For the most part, Dodd said, he’s getting more positive comments than negative ones.\nLooking back\nAlthough a veteran of city hall, having served on the Common Council for many years, Dodd said “it was a learning curve for me for quite a few months” to understand what was going on and how the city administration structure was working.\n“The biggest thing that has helped me, is that I did retire at the end of the last year, so I have more time to attend meetings and listen to constituents than I had in the past,” Dodd said.\nDodd said much of his work in his first year revolved around developing a shared vision and mission for the city’s future, encouraging staff and Council members, and improving communication internally and externally.\n“We set up avenues for communication with people,” Dodd said, specifically calling attention to his quarterly listening sessions in the community.\nLooking forward\nWhat’s in store for year two in the top job for Dodd?\nThis week, Dodd presented the Human Resources Committee with his nine goals for 2017. The nine goals are:\n1. Implement a plan in residential historic districts to prevent subdividing historic/older homes.\n2. Begin/complete boundary and zoning agreement with the town of Fort Winnebago. Then use a model for the other adjacent townships.\n3. Continue cooperatively working with schools and Columbia County.\n4. Create an economic development committee (or welcoming committee for new development).\n5. Increase communication with citizens.\n6. Increase communication with staff and the Common Council.\n7. Continue to support coaching staff and development.\n8. Continue roll out of vision and mission statements and build them into committees, commissions and ancillary city groups.\n9. Continue Council training and team building.\n“A lot of it is a continuation of stuff that I had last year as goals--things that I ran on that I wanted to improve. Communications was the big one. I think we have improved a little bit, but we are still not where I would like to be,” Dodd said.", "url": "https://apnews.com/16e2507974c74b75859ebc7fa5264d13"}