{"authors": ["Laura Leslie"], "date_download": "2020-05-04 20:05:48", "date_modify": "2020-05-04 20:05:48", "date_publish": "2017-04-11 16:36:00", "description": "A proposal to crack down on local governments over immigration led to raised tempers and voices Tuesday in the Senate Judiciary Committee before being approved on a party-line vote. Senate...", "filename": "_36e4f1f1c14edf55ee4d48ce35eb4028_1588622748.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_36e4f1f1c14edf55ee4d48ce35eb4028_1588622748.html", "title": "Tempers flare over immigration crackdown bill", "title_page": "Tempers flare over immigration crackdown bill", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A proposal to crack down on local governments over immigration led to raised tempers and voices Tuesday in the Senate Judiciary Committee before being approved on a party-line vote.\nSenate Bill 145 would withhold state funding from cities or counties that adopt a so-called “sanctuary” policy or ordinance regarding undocumented immigrants in any respect. It would open up an anonymous complaint process for any citizen with a “good faith” belief that a local government is not following immigration laws. The Attorney General’s Office would then be required to follow up and investigate within 45 days.\nAny local government with a sanctuary policy could be sued by anyone who was injured by the actions of an undocumented immigrant.\nThe measure would also ban University of North Carolina campuses from implementing any policy limiting federal immigration law enforcement, stopping law enforcement officers from gathering information about a person’s immigration status or prohibiting that information from being passed on to federal agents. Violation of the law would lead to constraints on the school’s spending authority.\nIt would also repeal a current law that allows law enforcement officers to recognize otherwise banned forms of identification, such as consular or community IDs, for the purposes of their work.\nSupporters of the bill said it would be limited strictly to local governments, not private businesses or nonprofit organizations. But critics questioned whether that distinction could really be drawn.\nSen. Paul Lowe, D-Forsyth, said his church provides food and other humanitarian assistance to the community.\n“The folks that need help and that are coming for help, we know they’re illegal,” Lowe said. “We know they’re here because they have nowhere else to go and they’re just trying to get some basic help. You don’t advertise it, but you just know.”\nSen. Terry Van Duyn, D- Buncombe, asked whether someone could call the police and tell them to put up a checkpoint outside Lowe’s church and then call to file a complaint if the police didn’t do that.\n“I think this would lead to thousands of frivolous investigations and a significant drain on the state’s resources, as well as towns losing funding that they desperately need,” warned Sen. Floyd McKissick, D-Durham.\nSen. Angela Bryant, D-Nash, questioned whether banning police from recognizing community IDs might force them to release someone suspected of committing a crime. Sen. Jeff Jackson, D-Mecklenburg, asked whether an inadvertent error by a city employee might cost an entire city a year of funding.\nThe questions irritated Republican leaders on the committee.\n“We’re sitting here debating whether to obey the law or not. That just amazes me. In a judiciary committee of this state, does that make any sense that we would be debating that?” asked a clearly frustrated Sen. Harry Brown, R-Onslow.\n“We’re as welcoming as we can be. We’re just saying just obey the law,” Brown said. “It puts people on notice that we have laws. Just abide the law that’s in place.”\nSen. Jerry Tillman, R-Randolph, echoed Brown’s frustration, accusing Democrats on the committee of “nitpicking” the measure.\n“What we’re trying to do is say we’re not going to welcome you if you’re illegal,” Tillman said. “If you don’t like it, vote no.”\nAn angry Lowe actually walked away from the committee table but returned moments later to respond to Tillman.\n“I resent anybody saying I’m nitpicking,” Lowe said. “I am concerned because this is a real issue. Someone could call the police department and say the Shiloh Baptist Church is harboring illegals, and that’s a real issue for a lot of churches.”\nThe panel heard testimony from Rev. David Fraccaro, founder of Greensboro’s Faith In Action, a community ID program that’s been used as a template for such programs in other cities, most recently Cincinnati.\nFraccaro told the committee that local law enforcement completely supports his program as a way to build understanding and trust with the immigrant community. He said they had one case of a fraudulent ID out of 10,000 people, and they caught it.\n“There is no legal pathway for the majority of undocumented people in our country,” Fraccaro said. “Please, please, please get the facts on this.”\nThe panel also heard testimony from Sarah Gillooly, policy director of the state chapter of the American Civil Liberties Union, that the section requiring UNC to allow information to be sent to immigration agents would very likely violate the federal Family Educational Rights and Privacy Act, known as FERPA, which forbids universities or schools from disclosing student information without the student’s consent or a warrant.\n“We may force the university system into a situation where they have to choose between violating state laws and federal law,” Gillooly explained.\nThe bill will likely be heard in the Senate Finance Committee next week.", "url": "https://apnews.com/36e4f1f1c14edf55ee4d48ce35eb4028"}