{"authors": ["Anne Murphy", "Life Postbulletin.Com"], "date_download": "2020-05-04 20:09:52", "date_modify": "2020-05-04 20:09:52", "date_publish": "2017-12-22 16:08:00", "description": "It was exciting to be part of the recent Style Fashion Show, said local designer Sophie Heublein. \"To get to meet new people who are just as passionate about creating beautiful garments is...", "filename": "_17113a1cb2e74cf1b04ff6c1df5e7705_1588622992.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_17113a1cb2e74cf1b04ff6c1df5e7705_1588622992.html", "title": "Your Style: Sophie Heublein", "title_page": "Your Style: Sophie Heublein", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It was exciting to be part of the recent Style Fashion Show, said local designer Sophie Heublein.\n“To get to meet new people who are just as passionate about creating beautiful garments is exciting as well,” she said. “I hope to open up my own custom design business right here in Rochester very soon.”\nHeublein, who studied apparel design and development at the University of Wisconsin Stout, grew up in nearby Douglas, and said she appreciates the opportunity to start a business close to home.\n“The new energy in Rochester is really inspiring,” she said. “I think people are starting to lean toward custom design because they like to have something that no one else has, and that’s really exciting to me as a up-and-coming designer. I want to bring in my own creativity to add to the sophistication and elevate the style and fashion of the Rochester scene.”\nHow do you describe your style?\nLayered, edgy and classic. If it started a conversation, I have achieved my goal.\nOrigins?\nMy mother is French, and traveling to visit her family, I was immersed in the refined French minimalist fashion. On the other hand, growing up in the Midwest with my brother in Douglas, motorcycle clothing and flannel are no strangers.\nSources of inspiration from the fashion world?\nI love seeing what is coming out on the runway. Some of my favorite designers include Chanel, Karl Lagerfeld, Alexander McQueen, Tom Ford, Christian Dior, Vivienne Westwood, Jean-Paul Gaultier, Rei Kawakubo.\nDo your designs relate to your style? And how are they different?\nI think they are a lot less edgy and more refined, chic and upscale. I design for a woman who enjoys wearing luxurious fabrics, looks well put together without taking the time.\nHow do your designs relate to what your vision of fashion?\nThe clothes I design are luxurious and functional. They are comfortable and for women on the go.\nWhat do you hope you communicate through your style?\nA conversation, confidence, body positivity.\nThe most essential components in your wardrobe?\nShoes, jackets, blazers and button-down shirts are my statement-makers.\nWhat should every well-dressed woman have in her wardrobe?\nA blazer, interesting shoes, lipstick, perfume and a pair of sunglasses.\nFavorite and not-so colors to wear?\nBlack, blue, darker tones of grey. I always gravitate toward darker colors, but I do like having a pop of red or green. Colors I stay away from would be nudes, yellows and peach.\nFavorite colors and fabrics for your designs?\nMy recent collection was based on colors of navy, various tones of grey and white. I also produced some of my own fabric as well. I love working with wool, cotton and silk. Natural fibers are the best. Ginny’s Fine Fabrics has an awesome selection and really made my collection come alive.\nAnything especially Minnesotan about your style and designs?\nSometimes, I think it is hard to be stylish in the winter months because we have to choose function over fashion, but I love a good flannel, and Sorel boots are stylish and functional. I think most all of my designs gravitate toward fall and winter season because I like working warmer fabrics, but could really be wearable for any state.", "url": "https://apnews.com/17113a1cb2e74cf1b04ff6c1df5e7705"}