{"authors": ["Alex N. Press", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Morgan Spector", "Branko Marcetic", "Corey Robin", "Meghan Brophy", "Lois Weiner"], "date_download": "2020-05-04 20:00:14", "date_modify": "2020-05-04 20:00:14", "date_publish": "2017-12-06 00:00:00", "description": null, "filename": "2017_12_harvey-weinstein-sexual-harassment-feminism-unions_1588622414.html", "image_url": "https://images.jacobinmag.com/2017/12/06153134/GettyImages-612952928.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_12_harvey-weinstein-sexual-harassment-feminism-unions_1588622414.html", "title": "Sexual Harassment Is Everybody’s Problem", "title_page": "Sexual Harassment Is Everybody’s Problem", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Inevitably in an organization of tens of thousands of people, the question isn’t whether sexual abuse will happen but when, and creating policies in advance is central to building a sustainable organization. We created this process because without one already in place, we’ve seen how this issue can destroy a movement or an organization.\nMany of us are grappling with what that looks like. I’m a member of Democratic Socialists of America (DSA), and we recently passed a detailed, transparent grievance procedure , which directs those experiencing sexual abuse to report the behavior to a grievance officer in their local chapter or to file the grievance at the national level. From there, we have an independent party with expertise in mediation on hand to investigate on behalf of the involved parties, ensuring that internal organizational politics doesn’t bias the investigation in one direction or the other.\nI recently asked a friend how we on the Left, in our limited capacity, can use this moment — and referring to it as a moment, not a movement, is a useful way to describe what we’re experiencing today — in a way that will have long-lasting effects. And one answer is that we can use it to democratize and build our movements and spaces, especially workplaces but also anywhere that we exist: among our colleagues, our families, our friends, our communities, and our organizations.\nI am not alone in having experienced the immense pressure brought to bear on anyone speaking out about sexual violence in an organizing space. At worst, you become subject to reminders of the damage you can do to the movement by accusing a prominent man (it’s not always a man, but it usually is) of sexual violence. “The Right will use this information against us,” you might be reminded, or, “We can’t win without him” — the implication being that if you insist on bringing up a leader’s misconduct, “we” can’t win with you.\nAnd sexual abuse isn’t just an obstacle to working-class unity: it also remains a presence on the Left and in our movements. As I’ve written elsewhere :\nIf the racism of white workers was debilitating for the American labor movement, the same could be said for sexism within the working class. From the earliest years of labor organizing, sexism, and unions’ periodic complicity in preventing full equality in the workplace for women and people of color, male and female alike, hamstrung the development of working-class power. Neither of these bigotries has been resolved: racism remains a problem among white workers of all genders, and as we can see from the overwhelming evidence of pervasive sexual harassment, sexism continues to infuse the workplace.\nThus, from a socialist perspective as well as from a feminist one, no general issue is more important than sexual harassment. To challenge it, to make it unacceptable, is to attack one of the major barriers to unity among people who have the possibility of bringing about radical social change.\nThe attitudes that produce sexual harassment also maintain a powerful bonding among men which not only weakens any existing class consciousness, but is one of the major obstacles to its development.\nIn an article on sexual harassment by Linda Gordon — originally published in a special issue of Radical America from 1981 and recently republished in Viewpoint Magazine — Gordon explains why sexual abuse matters as an obstacle to working-class solidarity and unity, and as an obstacle to unity on the Left:\nA Mobilizing Issue\nSo, if we agree that sexual abuse can damage a movement, the flip side is that it can also be an incredibly powerful mobilizing issue, one that drives workers to get involved in organizing campaigns.\nGordon touches on this in her talk by bringing up the Lowell textile mill union campaigns, some of the earliest, most militant labor organizing in the country’s history. The workers in Lowell were women, and sexual harassment in the workplace was one of the key issues driving their discontent.\nJudith Levine recounts a similar history for the Boston Review. As she writes of workers at Hoyles’ Derdale Mill in Todmorden, England,\nUnable to stop the harassment by banding together, thirty-one women took their complaints to their union in 1912 and 1913; their testimony stimulated others who had left the mill years earlier to come forward. The grievances inspired W. J. Tout, the male secretary of the Weavers’ and Winders’ Association, to investigate further and enlist the support of press and clergy. It is unclear how successful this campaign was. But Tout’s comment, after dozens of reports, could have been made yesterday: “One thing that has surprised me,” he said, “is the number of people who knew or had heard about these things.”\nThat was a hundred years ago; the same dynamic exists today.\nBut while we may still be battling a centuries-old problem, there are a number of contemporary examples of how workers have used the persistence of sexual harassment as a catalyst for organizing.\nTake Chicago hotel and casino workers, many of whom are represented by UNITE HERE. Two months ago, the Chicago city council passed an ordinance mandating that all hotel housekeepers and anyone who works alone in a guest’s room should have a panic button.\nLast year, UNITE HERE Local 1 surveyed nearly 500 members who work in Chicago hotels and casinos about workplace sexual harassment. The results were staggering: for example, 58 percent of hotel and 77 percent of casino workers had been harassed by a guest, and 49 percent in hotels had experienced a guest answering their knock naked.\nWhile the traditional bread-and-butter issues of, say, wage theft, are huge issues for their membership, this survey confirmed that sexual harassment and sexual assault are critical problems for their membership. What UNITE HERE did after receiving these survey results can be a model of how unions should approach this subject: they and their coalition partners lobbied and pressured the city council level to pass an ordinance mandating the provision of panic buttons to all workers whose duties require them to be alone in a room with a guest. And that means, all workers, not just those represented by UNITE HERE.\nIn other words, it’s the type of action radical unions used to pursue: one that benefits the working class as a whole, not just a union’s membership. And, of course, the effect of this is that non-union workers will see the benefits of a union, will benefit from those efforts themselves, and will be more likely to consider unionizing their own workplace, which combats the view of a union as a special interest group that works solely for its own members, rather than a class-wide institution that all working people should support.\nThe hotels themselves have to pay for the implementation of this ordinance, and it will cost them a few million dollars. Jorge Ramirez, the president of the Chicago Federation of Labor, commenting on the ordinance for the Huffington Post, said he thought the current society-wide conversation about sexual harassment may have been a contributing factor to why the hotel lobby didn’t actively fight this measure. With so many of the headline-generating assaults, like those alleged against Harvey Weinstein, taking place in hotel rooms, it makes sense that the hotel lobby would avoid the PR disaster that could accompany their fighting the ordinance.\nIt’s a rare victory, which activists in other cities are now trying to replicate, and it’s one we should learn from as we consider how to make use of this moment to make lasting structural changes in our workplaces.\nUnfortunately, when sexual abuse and workplace organizing intersect, it’s not always because the former is spurring the latter. For example, SEIU is now in turmoil after Scott Courtney, the architect of Fight for $15, and in many ways the architect of SEIU’s current politics, was accused of abusing his power over women in the union. Since his resignation, a number of men linked to him in the union, some of whom were key Fight for $15 organizers, have also either resigned or been fired for similar allegations of abuse of female subordinates.\nThe allegations have sparked an important conversation in the labor movement and the progressive world around it. They not only speak to sexual abuse as an ethical issue for the labor movement; they also highlight the strategic issues of letting such abuse fester. The Fight for $15 represents members in low-wage workplaces that are predominantly female, and largely immigrant. If you have abusive men leading those campaigns, they’re not likely to see sexual harassment as an organizing issue.\nWe know sexual harassment is a huge issue in the fast-food industry. A 2016 survey shows that 40 percent of fast-food workers are sexually harassed, and 42 percent of those who experienced harassment felt forced to accept it to keep their jobs. Of those who did report harassment, more than one in five said they were retaliated against for doing so. If you’re trying to build a union in a low-wage workplace, like a fast-food company, and you don’t see workplace sexual abuse as a possible issue to organize around, you’re going to miss huge opportunities.\nThis is intertwined with the question of how we democratize unions, so that people can speak up and be critical of union leadership about issues including, but certainly not limited to, sexual harassment. That’s an important way to frame these conversation if we’re having them within unionized workplaces or the labor movement broadly: the issues of democracy and combating sexual abuse are inseparable.\nAnd thanks to the energy of this moment, examples of democratic policies that offer avenues for addressing sexual abuse when it occurs, and preempting it where it hasn’t yet, are now being debated in public.\nOne such example comes from Ana Avendaño, vice president of labor engagement at United Way and Linda Seabrook, general counsel at Futures Without Violence. In an article for On Labor, Avendaño and Seabrook lay out “ten things unions can do right now to address sexual harassment in the workplace.” While some of their advice is standard — “Make sure that the union’s constitution and collectively bargained agreements contain guarantees against sexual harassment and retaliation.” — some is more creative, taking the best practices developed in specific unions and urging the rest of the labor movement to adopt similar mechanisms.\nFor instance, the authors recommend that unions “create channels for members, union staff and others to report harassment quickly, before it escalates, without having to resort to formal mechanisms.” This is critical, since many workers avoid formal reporting for a variety of reasons. They cite procedures adopted by Avendaño’s own organization as a possible model, advocating for an “expedited process” for women to report harassment so that it can be addressed immediately and without a legal battle.\nAnother model is the work being done by the Coalition of Immokalee Workers, a worker-run organization based in Florida. Their insistence on implementing real penalties for sexual harassment in their Fair Food Program has been a success. Since its adoption, the coalition says it has “gotten twenty-three supervisors disciplined for harassment and nine fired,” as Sarah Leonard reports in the New York Times.\nWorkers in SAG-AFTRA, the actors’ union, have used the Weinstein stories to spur internal reform within their union, too. Mia Kirshner, who was propositioned by Weinstein as a young actress, was one of the first SAG members to write publicly about how the union could have better assisted her and women like her. In place of SAG’s current policy, in which a member complaint leads to an in-house investigation by the production company or studio in question, she argues complaints “should trigger an independent third-party investigation” to prevent a company from covering for the bad behavior of its own higher-ups.\nMorgan Spector, a SAG-AFTRA member, suggested the union should shut down production on a set if a producer is found to be a perpetrator, sending members the routine “Do Not Work” notices it already uses against producers “who have failed to agree to union contracts or violated contractual obligations,” a reform that makes use of capacities the union already has. SAG-AFTRA president Gabrielle Carteris has acknowledged the need for internal reform, as many of Weinstein’s assaults took place “prior to coming into our contract world.”\nAfter the past few months, it’s no longer possible for those in power to deny the pervasiveness of sexual abuse. By looking to those who have implemented mechanisms for lodging allegations, and enforcing consequences for those who violate others’ rights, whether in the workplace or elsewhere, we can institutionalize this conversation. That can prevent this moment from ending up as a whole lot of talk that fails to improve people’s lives.", "url": "https://www.jacobinmag.com/2017/12/harvey-weinstein-sexual-harassment-feminism-unions"}