{"authors": ["Branko Marcetic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:55:59", "date_modify": "2020-05-04 19:55:59", "date_publish": "2017-07-24 00:00:00", "description": null, "filename": "2017_07_emmanuel-macron-france-unions-workers-economics-le-pen_1588622159.html", "image_url": "https://images.jacobinmag.com/2017/07/24112017/em.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_07_emmanuel-macron-france-unions-workers-economics-le-pen_1588622159.html", "title": "Emmanuel Macron Is Not Your Friend", "title_page": "Emmanuel Macron Is Not Your Friend", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIf you live in a certain section of reality, the world right now is witnessing a resurgence of liberalism and tolerance thanks to a select troupe of American and European leaders. Hillary Clinton is leading “the resistance,” while Canadian prime minister Justin Trudeau and German chancellor Angela Merkel are on the front line fighting against encroaching right-wing barbarism. (Never mind, of course, that Merkel is a conservative who opposes gay marriage and has spent years bludgeoning Greece into poverty, and that Trudeau combines the energy policy of Donald Trump with the arms sale policy of Donald Trump.) The latest recruit to this line-up of supposedly woke real-world Superfriends is French leader Emmanuel Macron, who in May beat Marine Le Pen, leader of the far-right (though, she will insist, no longer antisemitic) National Front, in the presidential election. Since then, Macron has been the object of liberal admiration the world over, with pundits and observers swooning at his courage for standing up to Trump and Vladimir Putin, as well rejecting Le Pen–style xenophobia. Like Trudeau and Obama, Macron is young, handsome, and charismatic. And, as with Clinton (and particularly Trudeau), he has embraced symbolic shows of social liberalism while explicitly positioning himself as a roadblock against the far right. All of this has helped obscure the more disconcerting elements of his beliefs, particularly his staunch support for economic reforms that would shift France toward a more free-market model. In this sense, we can think of Macron as an updated, French version of Bill Clinton and Tony Blair, with a dollop of the newer generation of triangulators. He’s consciously cast himself as the outsider who will break from politics as usual in defense of decency and democracy — and he’s done it all in the service of implementing a right-wing economic agenda.\nThe Insider “France is blocked by the self-serving tendencies of its elite,” Macron said at a rally in April. “And I’ll tell you a little secret: I know it, I was part of it.” Macron is half-right: he was in fact part of the elite, but it’s difficult to argue that he ever left. In 2004, Macron graduated from the Ecole nationale d’administration (ENA), an elite graduate college for civil servants. The United States has the Ivy League. The UK has Oxbridge and Eton. But none hold a candle to ENA, which has now produced four French presidents and eight of its last sixteen prime ministers — not to mention many of its civil servants and lower-ranking ministers (many of Macron’s own ministers are ENA graduates). In 2012, four of the presidential hopefuls were former graduates. After graduating, Macron naturally went into government service, becoming a financial inspector for the French economy ministry, an elite position reserved for the top graduates. In 2007, Nicolas Sarkozy’s government tapped him to work on the Attali Commission, an economic reform panel whose final report he helped draft. In the incestuous worlds of government and big business, the connections Macron made in government proved useful as he launched a career in the private sector. A philosophy graduate with no experience in finance, Macron nonetheless landed a job with Rothschild, one of France’s top banks. According to the Financial Times, it was a fellow financial inspector Alain Minc who got him an interview. Macron’s government contacts made up for his lack of initial financial knowledge, sending him hurtling up the ranks. As the Wall Street Journal reported, he was recommended as a “danseur mondain,” or high-society dancer, “a very singular person with lots of contacts,” according to one staff member, who could use his connections to get business for the firm. The deal that made Macron his fortune — Nestlé’s $12 billion acquisition of a Pfizer division in 2012 — was facilitated by the fact that Nestlé’s chairman had served on the Attali Commission. While still at Rothschild, Macron worked on Francois Hollande’s successful 2012 presidential campaign, for which he was rewarded a post as Hollande’s deputy chief of staff. Two years later, he was appointed economy minister, during which time he made sure to secure constant publicity for himself (something Hollande would tease him about behind closed doors). Then in 2016, sensing an opportunity, he launched a new political formation called En Marche, a transparent effort to lay the groundwork for a presidential campaign. Hollande and his inner circle viewed it as a slap in the face, but it was an entirely predictable move for people who knew Macron. “He always wanted to be in politics, be elected,” said Gaspard Gantzer, a Hollande staffer who had attended ENA with Macron. “He talked about it all the time.” When one ENA classmate asked him where he saw himself in thirty years, he replied, “president of the Republic.” Macron’s adult life has seen him graduate from what is in essence a factory for politicians, serve eight years in government with some short, additional stints in the middle, work four years for a well-connected, multinational bank in which he regularly leveraged his government contacts — all before becoming president. If the establishment has tried to “kill” him, it’s tried to do so with kindness.\n“At the Same Time” During the campaign Macron privately made no secret of the fact that he wanted to be “the French Obama.” And in public, it showed. Macron ran an Obama-like campaign that exuded positivity, hope, optimism, and togetherness, and presented itself as existing in some kind of political Phantom Zone outside of earthly ideology. “I want to win a positive vote,” he told Time magazine. “My point is to convince the French people that a positive project and a progressive view is more adapted to our challenges.” His opponents complained that he was monopolizing the covers of glossy magazines without putting forward anything of substance. He criticized Le Pen for her hateful rhetoric, proudly set himself apart from Trump (“I don’t want to build a wall . . . Can you remember the Maginot line?” he joked), and studiously avoided providing policy specifics. (When asked what his solution to the refugee crisis was, he replied, “I want to pursue an asylum policy that is both more humane and more efficient,” without giving any details.) He claimed his movement was neither “of the right nor the left,” and was so wishy-washy, he earned a reputation for incessantly using the phrase “at the same time.” For his acolytes, however, this wasn’t proof of his vacuousness but rather his intellectural heft. Indeed, the other notable feature of brand Macron is that he’s as a kind of French Jimmy Neutron, a boy genius whose towering intellect is unfathomable to mere mortals. His recitation of “both sides” of the argument was not a calculated way to avoid taking a firm stance on anything, Le Monde maintained, but a reflection of his “preference for complex thinking.” “Emmanuel Macron was never a kid like the others,” explained journalist Anne Fulda, who penned the biography, Emmanuel Macron: A Perfect Young Man. Explaining how she fell in love with him, his wife says she was “completely subjugated by the intelligence of this young man” whose “mind is so full and perfect” and whose “capacities are completely beyond any normal human being’s.” She privately told a friend that she felt like she was “working with Mozart.” In his book, Macron described how from the age of five, he would spend hours learning history, geography, and grammar from his grandmother; one of his former professors claimed Macron “had an exceedingly high level of intelligence well above the norm, with the capacity to absorb and interpret complex, contradictory concepts and to integrate them with his own ideas.” This tic has carried over into his presidency: Macron skipped the four decade-long custom of holding a Bastille Day press conference because his “complex thought process lends itself badly” to such a format. Some of those complex thoughts? That anti-Zionism “is a reinvention of antisemitism” and that problems in Africa are “civilizational.”", "url": "https://jacobinmag.com/2017/07/emmanuel-macron-france-unions-workers-economics-le-pen"}