{"authors": ["Dave Campbell"], "date_download": "2020-05-04 20:31:21", "date_modify": "2020-05-04 20:31:21", "date_publish": "2017-12-29 01:17:04", "description": "Minneapolis — A photographer who has covered the Minnesota Twins accused Miguel Sano of assault, posting on Twitter that the All-Star third baseman forcibly attempted to kiss her following an...", "filename": "_409957a3811343498a46ecdffedeb2aa_1588624281.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_409957a3811343498a46ecdffedeb2aa_1588624281.html", "title": "Photographer accuses Twins' Sano of sexual assault", "title_page": "Photographer accuses Twins' Sano of sexual assault", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Minneapolis — A photographer who has covered the Minnesota Twins accused Miguel Sano of assault, posting on Twitter that the All-Star third baseman forcibly attempted to kiss her following an autograph session at a mall in 2015.\nBetsy Bissen tweeted Thursday that she screamed and resisted Sano until he gave up “after a solid 10 minutes of fighting.” Bissen, who has worked for publications including the popular fan blog Twins Daily , said in her tweet that she long feared that telling her story would cost her access to photograph Twins games.\nSano said he “unequivocally” denies the allegation.\n“It never happened. I have the utmost respect for women, especially those working in professional sports, and I deeply sympathize with anyone who has experienced sexual harassment. There is no place for it in our society,” Sano said in a statement issued by his agent, Kyle Thousand.\nMajor League Baseball has begun an investigation, said MLB spokesman Pat Courtney. The Twins said they learned of the allegation only Thursday. Their statement said the team and MLB “take these allegations very seriously” but had no further comment.\nIn 2015, MLB and its players union unveiled a new policy covering domestic violence, sexual assault and child abuse . Commissioner Rob Manfred has the power to levy discipline, with no minimum or maximum penalty, following an investigation.\nBissen didn’t respond to an interview request from The Associated Press. She told her story on her Twitter account, writing that Sano was participating in an autograph signing at a store while she worked as a volunteer and photographed him interacting with fans during the event.\nBissen said Sano remarked that he had noticed her during games. She said he tried to flirt with her and, after the signing, grabbed her wrist and “made me go with” a small group that included Sano’s previous agent, Rob Plummer, to another store. She said she complied only to avoid causing a scene.\nAs the group left the mall about a half hour later, Bissen wrote, Sano said he needed to use the restroom. She pointed him to the door, and she said Sano “took that as a signal that I wanted him to grab me and try to take me back through that door.” She said she pulled back as he held on.\n“It hurt, how badly he was grasping at my wrist, but he wouldn’t let go. I wasn’t going to give up my fight though. He then leaned down and tried to kiss me, more than once. Every time he did, I said no and kept pulling back,” Bissen wrote.\nPlummer, who was fired by Sano two years ago, told ESPN that he didn’t witness the alleged assault.\n“I was outside next to the car, waiting for him to come out on the other side of the loading bay dock, so I don’t know what happened inside,” Plummer told the network.\nBissen, who shared her tweet with the #metoo hashtag, said in a follow-up post that she wanted to “feel free of this burden I’ve carried with me since 2015.”\nSano is listed by the Twins at 6-foot-4 and 260 pounds, though he’s often played at a weight much heavier than that. Sano made the American League All-Star team in 2017, his third major league season. He batted .264 with 28 homers and 77 RBIs, despite missing the last six weeks of the season.\n“Every time I have to hear about how great people think Miguel Sano is, I’m reminded of how awful he actually is and how he hurt me,” Bissen wrote.\nTwins pitcher Trevor May tweeted “I’m sorry, Betsy,” in reply to Bissen’s post. Former Twins third baseman Trevor Plouffe also chimed in on Twitter with sympathy: “I’m so sorry about this. I understand why you didn’t, but I wish you would have come to me.”", "url": "https://apnews.com/409957a3811343498a46ecdffedeb2aa"}