{"authors": ["Doug Henwood", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Josh Mound", "Ethan Linck", "Veronika Duma", "Hanna Lichtenberger", "R. H. Lossin"], "date_download": "2020-05-04 19:56:45", "date_modify": "2020-05-04 19:56:45", "date_publish": "2017-09-04 00:00:00", "description": null, "filename": "2017_09_infrastructure-crumbing-public-sector-spending_1588622205.html", "image_url": "https://images.jacobinmag.com/2017/09/04225005/6717401957_47a57b5a34_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_09_infrastructure-crumbing-public-sector-spending_1588622205.html", "title": "Why the United States Is Falling Apart", "title_page": "Why the United States Is Falling Apart", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "If I were a debased purveyor of clickbait, I’d call this “Everything that’s wrong with America in two charts.” But I’m not, so I won’t. But still . . .\nHurricane Harvey is only the latest reminder that the US infrastructure is falling apart — a situation that become more urgent as the climate crisis bites harder. Here’s a data series that goes a long way to explaining why. In simple English, the public sector is barely investing enough to keep up with normal decay, let alone doing anything to improve things.\nThe series is net civilian public investment from the national income accounts. (The source is table 5.2.5, here.) “Net” means after depreciation, aka wear and tear. Public investment means expenditures on long-lived assets like schools and roads. Prisons are in there too. If we took those out, the numbers would be slightly lower — though not profoundly so, because most of the costs of maintaining the carceral state come from day-to-day operations — 96%, according to this estimate — not from building new prisons.\nOf course, it’s hard to put exact dollar values on the decay of physical assets over time. Economic stats are always highly imperfect, even if they seem precise, carried out to several figures beyond the decimal point. But they’re the best we’ve got — and these are the numbers that American capitalism produces to understand itself, even if they don’t bother to pay much attention to what the numbers are saying.\nHere are the graphs — the first, net public (meaning by federal, state, and local government) as a percent of GDP since 1950. I started the graph in 1950, even though the figures begin in 1929, because the extreme values of the Great Depression and World War II years would distort the scale dramatically. The second presents the averages by decade. As the graphs show, net public investment is in a long downtrend and is now at near-record-low levels. The only years with lower levels were 1942–45, when the civilian economy was starved to fund the war effort.\nNet civilian investment was 0.5% of GDP in 2016; preliminary numbers for 2017 suggest it hasn’t budged. It declined during the Great Recession and its aftermath, and is now less than half 2007’s 1.2%. The contrast with the Great Depression is stark. Net civilian public investment rose from 1.9% of GDP in 1929, the year of the crash, to 3.2% ten years later. For the full decade of the 1930s, it averaged 2.6% — the same as the 1960s, a time of dramatic expansion in the public sector. Since then, it’s been mostly downhill.\nTo get back to that 2.6% average would mean an increase of $400 billion a year in public investment. (For details on the shortfall, and where the spending needs to be directed, see the American Society of Civil Engineers’ annual report on the topic.)\nThere’s no doubt the US could afford that. But our political system is completely incapable of formulating the problem. (Trump’s infrastructure plan is a ludicrous patchwork of tax breaks and privatizations.) And it’s only going to get worse, as the rot deepens and the climate challenges mount.", "url": "https://www.jacobinmag.com/2017/09/infrastructure-crumbing-public-sector-spending"}