{"authors": ["Genelle Pugmire"], "date_download": "2020-05-04 20:21:57", "date_modify": "2020-05-04 20:21:57", "date_publish": "2017-12-30 02:00:00", "description": "On the northwest corner of Center Street and 300 West in Provo residents will be able to find Peace on Earth; a new specialty coffee shop and gathering place. It is part of the Liberty Center...", "filename": "_3a37de39f6b44ff3a03db63c0be344d4_1588623717.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3a37de39f6b44ff3a03db63c0be344d4_1588623717.html", "title": "New Provo coffee shop to offer brews from beans to beer", "title_page": "New Provo coffee shop to offer brews from beans to beer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "New Provo coffee shop to offer brews from beans to beer\nOn the northwest corner of Center Street and 300 West in Provo residents will be able to find Peace on Earth; a new specialty coffee shop and gathering place. It is part of the Liberty Center mixed-use properties.\nThe unique name is inspired by lyrics in the popular counter-culture song from the late 1960s, “One Tin Soldier” featured in the movie “Billy Jack.”\nTroy Gifford, who has been a part of the Provo business dining and entertainment scene for the past 17 years (The Madison and Atchafalaya), has turned the restauranteering reins over to his three daughters, Shayna, Lynsie and Madyson Gifford.\nThe Giffords are providing a place for all residents to gather. They will offer vegetarian and vegan food as well as sandwiches for meat lovers too. The Peace on Earth coffee shop will offer a variety of coffees, teas, hot chocolate, Italian sodas and juices.\nHowever, unlike other Provo shops is will also offer specialty coffees and teas with alcohol.\n“We’ll be serving Bailey’s Irish Cream Coffee for instance,” Troy Gifford said. “We will have nitro brews, Kombucha drinks and expresso beer.”\nLike a step out of Tuscany, patrons can order a charcuterie board with cheeses, crackers, sliced meats, grapes and a glass of wine and enjoy the ambiance and soft music offered.\nThe shop had its first visitors Friday during a quiet ribbon cutting that included Gifford family friend Congressman John Curtis, Interim Mayor Michelle Kaufusi, friends and a few city representatives.\nThe shop will open for business in mid-January. It will feature a USB bar, small secluded gathering places and a stage. For those who like a bit of karaoke, Peace on Earth will offer an open mic night.\n“I’m always pleased when I see interest in downtown Provo,” Curtis said. “Troy has been part of the downtown scene longer than most people.”\nKaufusi said she is excited to see Peace on Earth open.\n“I’m thrilled to have another business open,” Kaufusi said. “I invite everyone to come out and experience it.”\nThe shop will also feature pastries, cookies and breakfast bagels, sandwiches, oatmeal, granola and yogurt.\nIf you want to take home some coffee beans, Peace on Earth will offer a house blend and other coffee blends they will be glad to grind.\n“The biggest thing I want people to feel is welcome,” Shayna Gifford said. “On our coffee cups we have printed the bible verse from John 14:27 that begins ... Peace I leave with you.”\n“We have been taught about loving and giving. It’s exactly what we want to bring to Provo,” Shayna Gifford said.", "url": "https://apnews.com/3a37de39f6b44ff3a03db63c0be344d4"}