{"authors": ["Courier Sports Staff"], "date_download": "2020-05-04 20:25:18", "date_modify": "2020-05-04 20:25:18", "date_publish": "2017-09-13 19:00:00", "description": "Switzerland County's Leah Anders won the girls race and Southwestern's Bradley Winston was fifth in the boys race at the Big Blue Cross Country Invitational held Tuesday at Muscatatuck State Park....", "filename": "_1952863da86748569c2f2cc777107498_1588623918.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1952863da86748569c2f2cc777107498_1588623918.html", "title": "Pacers’ Anders runs to win at Big Blue Invitational", "title_page": "Pacers’ Anders runs to win at Big Blue Invitational", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Switzerland County’s Leah Anders won the girls race and Southwestern’s Bradley Winston was fifth in the boys race at the Big Blue Cross Country Invitational held Tuesday at Muscatatuck State Park. Southwestern placed third as a team in the boys race with 77 points. Host Jennings County won the boys event with 20 points while Madison placed eighth at 180 and Switzerland County was ninth with a 264. Batesville won the girls team race with a 32 while Madison finished third with a 91, Switzerland County was fifth with a 137 and Southwestern sixth with a 158. Winston’s fifth place finish in 16:33 was 45 seconds behind race winner Dalton Craig of Jennings County with a 15:48 as the Panthers took the top fourth spots in the event with Alex Hendrix running second in 16:17, Carter Leak third in 16:26 and Franklin Sanders fourth in 16:27. The Rebels’ Ethan Goebel ran eighth in 16:58, Trevor Smith was 14th in 17:27, Billy Eccles was 32nd in 19:08 and Caleb Geary rounded out Southwestern’s scoring in 36th place 19:15. Lane Coles finished 50th in 20:20 and Mitchell Adcock was 65th in 20:58. “We had a lot of personal bests tonight which is really impressive coming off the race at Jac-Cen-Del when everyone ran so well,” said Southwestern coach Zac Nussbaum. “I think our kids are starting to really see the benefits of their hard work and hopefully this only motivates them to dedicate themselves even more.” Madison’s Jacob Howell led the Cubs in 29th place with a time of 18:52. Camden Spears was 39th in 19:17, Minglu Zhao 42nd in 19:43, Skylar Lee 56th in 20:20 and Zach Forner 68th in 21:16. Andrew Beaumont ran 77th in 22:46. Switzerland County’s Garrett Demaree ran 54th in 20:17 and Patrick Stow had a season best time of 22:02 for 72nd. Bailey Bennett had a personal best 22:03 for 73rd and Nathan Scudder ran 80th in 22:51 while Coby Manbeck was 81st in 22:54. “We are all pleased with our performances this year and will continue to work hard the rest of the season,” said Switzerland coach Kristopher Sandlin. “It was exciting for our guys to have a full team and we will only get better from here on out.” Shawe had two runners competing as individuals including Leon Kinne, who finished 12th with a personal best time 17:24 and Bryan Avalos in 25th in 18:16. Anders’ win in the girls race was a personal best time for the junior and the second fastest time in Lady Pacers’ program history with a time of 19:27. Kierstan Oeffinger was 28th with a personal best 23:13 that was the 13th fastest time in school history. Allison Detmer ran 43rd in 24:25 for the Pacers while Aleiah Thomas was 45th in 24:29, Bri Vinup ran a personal best 24:30 to finish 47th and Zoe Cole ran a 24:42 and Mikailah Peterson a 28:54 to place 51st and 71st, respectively. “Our girls team had a good two-through-six pack and will look to move that forward as the season progresses. We are having fun and running fast,” Sandlin said. Chloe Ferris posted Madison’s best time in the girls 5K for a ninth place finish in 21:15. Brett Cahall was 10th in 21:26, Clare Wilber was 15th in 21:57, Kelsey Bilz was 32nd in 23:20 and Alysa Goins rounded out the scoring in 33rd with a time of 23:24. Vivanne Netto was 48th in 24:31 and Lexie Nay was 57th in 25:23. “Our front pack really did a nice job running close together this evening which makes us a more dangerous team overall,” said Madison girls coach Josh Wilber. “Our back pack is making some strides to get up there but we have to close the gap quite a bit if we are going to challenge Jennings County or other top tier teams. “Brett Cahall and Clare Wilber had great races while Lexie Nay did a wonderful job cutting her time a lot for the season. This is what it takes to continue improving as an overall team,” Wilber added. Caty Battjes led the way for Southwestern with a time of 22:26 to finished 18th. Ashton Goode was 30th in 23:15, Taylor Cole was 31st in 23:18, Maddy Jacobs was 46th in 24:29 and Juli Lezama was 63rd in 26:22 to cap the scoring. Belle Crawford ran 70th in 28:39 and Casey Hilt ran 72nd in 29:08. Lauren Lundergan posted a personal best tome for Shawe to finish 18th with a time of 22:38 while Ryan Storm was 56th in 21:38. All four local teams compete Saturday at the South Dearborn Invitational in Aurora.", "url": "https://apnews.com/1952863da86748569c2f2cc777107498"}