{"authors": ["Christina Cleveland"], "date_download": "2020-05-04 20:11:40", "date_modify": "2020-05-04 20:11:40", "date_publish": "2017-03-28 02:30:00", "description": "Enhanced parks, more student housing opportunities, improved infrastructure and development near the west side of the city of Aiken are among the ideas USC Aiken students are offering up for Aiken...", "filename": "_47904c8605f64a7db57e211708bf60f8_1588623100.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_47904c8605f64a7db57e211708bf60f8_1588623100.html", "title": "USC Aiken students voice ideas for Aiken County", "title_page": "USC Aiken students voice ideas for Aiken County", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Enhanced parks, more student housing opportunities, improved infrastructure and development near the west side of the city of Aiken are among the ideas USC Aiken students are offering up for Aiken County.\nLeaders from the Aiken County Legislative Delegation, Aiken County, City of Aiken and the Aiken County School Board met with a group of mostly students at the university Monday night as a part of Aiken County’s Community Relations Council’s public hearing sessions.\nThe sessions are conducted in a town hall format. Officials want to hear more from for residents about what the County is doing right and how it can improve, County Councilwoman Camille Furgiuele has said.\nFor one USCA senior, that means more and better development near the university.\n“That area of Richland in between downtown and that area in and around USC Aiken is pretty ugly,” Will Wright said. “I’d like to see more development around there and better development.”\nAsked what he would like to see, Wright said more attractions for the college-aged demographic along with more businesses, retail and housing. Junior Tim Behling also said he would like to see new businesses, including small and large retailers.\nBut one student said the support has to be there for businesses to thrive. One way she suggested accomplishing that included expanding the students dining dollars to work somewhere else besides campus.\nStudents also voiced they’d like to see infrastructure improvements at Whiskey Road and one student also advocated for additional bike lanes and crosswalks in the areas near S.C. Highway 118 and Aiken Regional Medical Centers nearby the university.\nThere were also calls for more public transportation to take students into downtown.\nAiken County Administrator Clay Killian asked the group if the public transit was figured out, if downtown student housing also would be something they would like.\nMany in the auditorium nodded.\nBut discussion included more than beefing up public services while the students are enrolled at the university. Students also shared what would make them stay in Aiken County.\nThe topic has been recently revisited by community leaders who have previously mentioned the need to diversify the area’s demographic, which they say is aging.\nJunior Garrett Dragano said one thing that would keep him in the County would be developing Aiken County public schools, noting that will be important when he decides to start a family.\nAiken County Public Schools Superintendent Dr. Sean Alford told the students school officials are “excited” to talk to young residents about staying in the community, because “there are great opportunities, not only for yourselves but also for a future family, as well.”\n“There are so many employment opportunities in this area not just health, science – technology, industrial manufacturing,” Alford said. “Aiken County is probably one of the most resource-rich counties, particularly as it relates to future job opportunities, so there’s such a bright future for any of you all and anybody else who wants to live in this area … and we’re trying to capitalize on that in the school district.”\nCurrently, Alford said the school district is gearing up to connect students to the workforce. That’s something he says public education – not just in Aiken – probably hasn’t always done that well.\nResponding to Dragano’s calls for exposing more high schools and middle schools to career opportunities, Alford agreed schools should do more. He said career counselors have been moved into middle schools in the past year for that very reason.\n“This is the first year we’ve actually had career counselors in middle schools,” he said. “We’ve got to expose young folks to that as early as possible.”\nAlford said this past week was also a “wonderful example” of that. Technology specialists, chemical, nuclear and mechanical engineers all held a mini conference with about 60 students at North Augusta High School.\nHe said this helped them spend one-on-one time with professionals and provided them better insight into what their ideal career paths could be. This will be offered at other schools, as well, Alford added.\nAlong with listening to the group, Beverly Clyburn, who serves as on the Community Relations Council, also shared with students her own decision to stay in Aiken.\nClyburn is from the Lowcountry and moved to Aiken after college. She said she’s been in the community more than 50 years and has never left. Now she is also advising her children to also stay.\nBut ultimately, she told the students the decision will be up to them.\n“You have to follow the job market but you also need to understand, you can go to Chicago and have all the bars and places to have entertainment that you want. I mean, you can go to a rock ’n’ roll show anytime you want to, but is it affordable?” Clyburn said. “Does it give you a chance to save and build a family? You have to look at more than just having fun when you get out of college.”\n“Sometimes you go places you find your niche, you do what you want to do and you love it,” she said. “Maybe Aiken is not for young people today, but it was OK for me when I came here.”\nCommunity relations council member Colen Lindell said he liked that students also took away more knowledge about what is growing in the County. Lindell lives in the Midland Valley area, which he said is experiencing an economic boom.\nHe also mentioned opportunities with Cyber Command and the Savannah River Site, as well as North Augusta’s Project Jackson, a mixed-use development that includes a minor league baseball stadium.\n“The future is bright for Aiken County, and I think that the students learned that at this meeting,” Lindell said.\nInformation gathered at the meetings will go back to County Council.", "url": "https://apnews.com/47904c8605f64a7db57e211708bf60f8"}