{"authors": ["The Editorial Board"], "date_download": "2020-05-04 20:23:06", "date_modify": "2020-05-04 20:23:06", "date_publish": "2017-12-07 00:00:00", "description": "Board members of the State Employees Retirement System who voted to restore corrupt former state Sen. Bob Mellow’s ludicrously lucrative state pension obviously have betrayed the public trust....", "filename": "_009904974840412390c6e1db31bc98ba_1588623786.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_009904974840412390c6e1db31bc98ba_1588623786.html", "title": "Mellow’s Pension Decision Sets A Terrible Precedent", "title_page": "Mellow’s Pension Decision Sets A Terrible Precedent", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Board members of the State Employees Retirement System who voted to restore corrupt former state Sen. Bob Mellow’s ludicrously lucrative state pension obviously have betrayed the public trust. They have set a terrible precedent and have eliminated the loss of pension benefits as a deterrent against crimes like Mellow’s. The decision reveals the need for significant reforms and advises prosecutors that they must include pension forfeiture in plea deals with corrupt Pennsylvania politicians. Mellow, a Lackawanna County Democrat who spent 40 years in the Senate, pleaded guilty in 2012 to a federal charge related to his use of publicly paid staffers for political purposes, and for filing a false federal tax return in 2008. He served 16 months in federal prison. The retirement system twice rejected Mellow’s efforts to retain his pension but the board, in a 6-5 vote announced Tuesday, restored it. Pension itself preposterous Problems with Mellow’s pension begin with its size. According to the Associated Press, it is worth $245,000 a year, more than $20,000 a month. Mellow, of course, was a member of the legislative leadership in 2001 when lawmakers unconscionably increased the size of their own pensions by 50 percent. As such, he is among the architects of the current state pension disaster. The two big pension plans are underfunded by about $70 billion, and the cost of back-filling that hole has hamstrung the state government and every school district in the state. That a supposed public servant can leave office under any circumstance with a $245,000 annual pension defines a corrupt government. That a convicted felon can walk away with such a massive publicly funded pension puts an exclamation point on it. Senators should recuse themselves Two of the six votes to restore Mellow’s pension came from two of Mellow’s former colleagues who are members of the board — Democrat Vincent Hughes of Philadelphia and Republican Charlres McIlheny of Bucks County. A third was a representative, Republican Robert Godshall of Montgomery County. It’s one thing for legislators to sit on the board for determining policy but it’s quite another for them to vote on the pension status of a convicted former colleague. The board’s rules should require lawmakers to recuse themselves from such votes, not only because it calls into question their personal relationships, but because their decisions set precedents for other potential appellants now in the Legislature. Uniquely corrupt As if to emphasize how the machinery of state government often serves the politicians at the wheel, state pension rule make a needless distinction between state and federal laws. Even though Mellow was charged for employing his state-paid staff for personal political gain and filing a fraudulent tax return, the board found that the federal charge does not have an exact equivalent under state law. The majority then used that point to award Mellow the pension. Therein lies the poor precedent that could enable future federal felons to collect massive state pensions. That’s ridiculous. It means that filing a fraudulent federal tax return isn’t as serious as filing a fraudulent state tax return. The pension system should alter the rule to make a federal corruption conviction sufficient for state pension forfeiture. Prosecutors should heed decision Because Mellow copped a plea, there was no indictment describing in detail the full scope of the allegations. The federal prosecutors’ presentment was limited to the crimes to which Mellow agreed to plead guilty. This pension ruling should prompt prosecutors to favor indictments or even full trials when dealing with Pennsylvania politicians accused of corruption, thus creating a better record to dissuade the pension board from forgiving and forgetting corrupt acts by public officials. And being aware of the pension board’s loose stewardship of publicly funded pensions, prosecutors should include pension forfeiture as a condition of plea agreements with state officials admitting to corruption.", "url": "https://apnews.com/009904974840412390c6e1db31bc98ba"}