{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:11:31", "date_modify": "2020-05-04 20:11:31", "date_publish": "2017-08-16 13:00:00", "description": "I was born and raised in Fort Madison and now reside in Mobile, Alabama. I still have many relatives in the area and come home to visit several times a year. Recently, I had the opportunity...", "filename": "_f30fcccf9514461cb0a8c9acf89b3887_1588623091.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f30fcccf9514461cb0a8c9acf89b3887_1588623091.html", "title": "Remember, they depend on us", "title_page": "Remember, they depend on us", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "I was born and raised in Fort Madison and now reside in Mobile, Alabama. I still have many relatives in the area and come home to visit several times a year.\nRecently, I had the opportunity for a visit home. Wouldn’t you know it, it was during a Southeast Iowa heat wave. Heat warnings were on the news about being outside.\nAs I drove around town on one of those high heat index days, I could not help but notice several people walking their dogs in the heat of the day – and on hot sidewalks and pavement.\nWe are entrusted to care for our pets. Pet paws are soft and sensitive to heat. Just as we would be with out own bare feet. And yet the pet owners were oblivious as they walked their animals while they themselves were wearing shoes.\nMy letter is not meant to chastise anyone, but rather, to create awareness among all pet owners to properly care for their animals. They don’t have voices to tell us, and so they depend on us to make responsible choices in their care.\nSo please, if you are a pet owner who has to walk your pet during the heat of the day, walk them in the grass or treat them to some time in the park. I know they will be glad you did – and you will be too as you receive the unconditional love our four-legged family members give us. Be responsible in your care for these family members.\nThank you, Fort Madison, for being the caring community I know you to be.\nDavid Bower\nMobile, Alabama", "url": "https://apnews.com/f30fcccf9514461cb0a8c9acf89b3887"}