{"authors": [], "date_download": "2020-05-04 20:04:16", "date_modify": "2020-05-04 20:04:16", "date_publish": "2017-07-23 22:27:00", "description": "Several families gathered Sunday in Raleigh to celebrate the upcoming 27th anniversary of the passage of the Americans with Disabilities Act- a piece of legislation that prohibits discrimination...", "filename": "_8e0b88f8f8633daf1192d73c821ca8b4_1588622656.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8e0b88f8f8633daf1192d73c821ca8b4_1588622656.html", "title": "Families mark anniversary of Americans with Disabilities Act at inclusive Raleigh park", "title_page": "Families mark anniversary of Americans with Disabilities Act at inclusive Raleigh park", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Several families gathered Sunday in Raleigh to celebrate the upcoming 27th anniversary of the passage of the Americans with Disabilities Act- a piece of legislation that prohibits discrimination against people with disabilities.\nSassafras All Children’s Playground at Laurel Hills Park is a bit unique, with its rubberized surfaces, specially designed swings and zip line.\nThe playground, which was remodeled and reopened about eight months ago, was designed to be a place for kids of all abilities to come together and play.\n“If you have a wheelchair, you can go all over the place here and get on a swing. You can use the slide. There’s not a barrier to kids being together here,” said Chris Egan with the North Carolina Council on Developmental Disabilities.\nFor that reason, the playground was the perfect place to celebrate the anniversary of the Americans with Disabilities Act. Lori Palen was one of the parents who came with her family to celebrate the milestone.\n“It formalized protections that he gets and we get as a family and ensures that we get to participate fully in life,” Palen said.\nPalen’s five-year-old son, Tommy, was born with a rare genetic disorder called Rubinstein Taybi syndrome. Tommy may face more challenges than many kids his age, but he doesn’t let that slow him down one bit.\n“He’s super social. He’s never met a stranger. He’s been crawling around to everyone here and wanting to be picked up,” Palen said.\nDorothy Parker brought all three of her boys to the park Sunday. Her son, Theodore, has autism and cerebral palsy and, the first time they visited Sassafras Playground, she was thoroughly impressed. Theodore was especially fond of the park’s zip line.\n“The last few times that he did it, he started to crack a little smile and the last time he was flying,” Parker said.\nThe gathering was a time to celebrate but also to remember and reflect.\nEgan said although a lot has been done, there is still much work left to do.\n“We’ve come a long way, let’s celebrate that. We also have a long way to go. Let’s keep at it,” Egan said.\nThe exact anniversary of the passage of the Americanss with Disabilities Act is July 26.", "url": "https://apnews.com/8e0b88f8f8633daf1192d73c821ca8b4"}