{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:18:11", "date_modify": "2020-05-04 20:18:11", "date_publish": "2017-04-08 00:30:00", "description": "Community-based drug prevention programs across the nation will be promoting Alcohol Awareness this month to increase public understanding of alcohol abuse and alcoholism. While some parents and...", "filename": "_59ef12c35d194e92a608e73827e50713_1588623491.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_59ef12c35d194e92a608e73827e50713_1588623491.html", "title": "Alcohol use puts Montana youth at risk", "title_page": "Alcohol use puts Montana youth at risk", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Community-based drug prevention programs across the nation will be promoting Alcohol Awareness this month to increase public understanding of alcohol abuse and alcoholism. While some parents and guardians may feel relieved that their teen is “only” drinking, it is important to remember that alcohol is a powerful, mood-altering drug.\nAlcohol and drug use by young people is extremely dangerous — both to themselves and to society — and is directly associated with traffic fatalities, violence, suicide, educational failure, alcohol overdose, unsafe sex and other behavioral problems. Research shows that brain development continues well into a person’s 20′s. Alcohol can affect this development, causing youth to make irresponsible decisions, encounter memory lapses, or process and send neural impulses more slowly. Underage drinking is a complex problem, requiring cooperation at all levels of society.\nFour basic approaches have proven to be effective in prevention of the problem:\nChanging cultural misconceptions and behaviors about alcohol use through educationCurtailing the availability of alcohol to young people under age 21Consistent enforcement of existing laws and regulations regarding alcohol purchaseExpanded access to treatment and recovery support services for adolescents and their families\nAlcohol use is very risky business for young people. The longer children delay alcohol use, the less likely they are to develop any problems associated with it.\nRick Gale\nElks Drug Awareness Program\nBozeman", "url": "https://apnews.com/59ef12c35d194e92a608e73827e50713"}