{"authors": ["Sandra Gonzalez"], "date_download": "2020-05-04 20:26:27", "date_modify": "2020-05-04 20:26:27", "date_publish": "2017-07-18 04:00:00", "description": "A galaxy far, far away, a TV legend front and center in an adaptation with a modern twist, and an adorable lion cub were the stars of the live-action presentation at Disney's D23 event, at which...", "filename": "_7d6762cd3fbf41f5af95936c6b212039_1588623987.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7d6762cd3fbf41f5af95936c6b212039_1588623987.html", "title": "Disney unveils footage of 'Star Wars,' 'A Wrinkle in Time,' 'Lion King'", "title_page": "Disney unveils footage of 'Star Wars,' 'A Wrinkle in Time,' 'Lion King'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A galaxy far, far away, a TV legend front and center in an adaptation with a modern twist, and an adorable lion cub were the stars of the live-action presentation at Disney’s D23 event, at which the studio unveiled multiple highly anticipated sneak peeks on Saturday.\nAmong the most anticipated first looks was that for “Star Wars: The Last Jedi.”\nDirector Rian Johnson was joined by cast members Mark Hamill, Daisy Ridley, John Boyega, Gwendoline Christie, Kelly Marie Tran, Laura Dern and Benicio Del Toro to show a new behind-the-scenes featurette with looks at the upcoming film.\nThose hoping for a full “Star Wars” trailer were let down, but Disney did have the first extended look at “A Wrinkle in Time.”\nDirector Ava DuVernay, young star and newcomer Storm Reid, Reese Witherspoon, Mindy Kaling, Chris Pine and Oprah Winfrey all took the stage to introduce the new trailer for what DuVernay called “a family story wrapped in an epic adventure.”\nKaling emphasized, however, that the film, based on the 1962 novel, is filled with modern flare.\nThe quotations spoken by her character, Mrs. Who, for example, were updated to be more “inclusive.” Mrs. Who quotes Jay-Z, among others, Kaling said.\nJon Favreau, director of “The Lion King,” brought with him a piece of footage that elicited the most nostalgic feelings among the audience.\nThe footage show from the live-action “The Lion King” was a shot-by-shot remake of the opening scene from the animated film, complete with “The Circle of Life” blaring in the background and a first look at CGI Simba.\nWalt Disney Studios chairman Alan Horn told the crowd the live-action version would be “respectful and faithful to the lion king you already know and love.”\nA full trailer for “Mary Poppins Returns” was not ready for D23, but star Emily Blunt and director Rob Marshall presented a rough cut of scenes accompanied by a Disney orchestra.\nIn the footage, which was not made available to the public, there were sneak peeks of the characters played by Meryl Streep, Lin-Manuel Miranda, Dick Van Dyke, and Angela Lansbury.\n“I needed to try to pay homage to Julie Andrews but carve out a new space for myself,” Blunt said of taking the role.\nThe film will be released Christmas 2018.\nOn the news front, Disney confirmed the development of a live-action “Mulan” film, a project with Dwayne Johnson called “Jungle Cruise,” and the start of production for “Dumbo,” from director Tim Burton, coming in 2019.\nThe studio showed off a replica of the Dumbo that will be featured in the live-action film, a blue-eyed elephant measuring 3.5 feet tall and 5.5 feet wide, that earned swooning from the audience.\nDisney also announced the cast of “Aladdin,” following reports last week that they were having trouble finding a star for the film.\nMena Massoud, (“Jack Ryan”) will play the title role, Naomi Scott (“Power Rangers”) will play Jasmine and Will Smith will take on the role of Genie.\nThe panel followed what was a slower news event on Friday.\nAt its animation presentation, Disney announced a couple of untitled projects, including a movie set in a suburban fantasy world about two teenage brothers hoping to spend one magical day with their late father.\nThe studio has several major features in the pipeline, previewing “Frozen 2,” “Incredibles 2″ and “Toy Story 4.” A 21-minute featurette based on “Frozen,” “Olaf’s Frozen Adventure,” will also precede its next animated movie, “Coco,” which premieres this fall. — (CNN)", "url": "https://apnews.com/7d6762cd3fbf41f5af95936c6b212039"}