{"authors": ["Denise Allabaugh"], "date_download": "2020-05-04 20:14:40", "date_modify": "2020-05-04 20:14:40", "date_publish": "2017-12-20 00:00:00", "description": "PITTSTON TWP. — Cintas Corp., one of the first tenants in CenterPoint Commerce and Trade Park, has expanded and plans to hire 65 more employees. An opening ceremony was held Tuesday at...", "filename": "_cb5ba57dfa0a4adfa0fb14401e30b282_1588623280.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cb5ba57dfa0a4adfa0fb14401e30b282_1588623280.html", "title": "Cintas Firm Expanding", "title_page": "Cintas Firm Expanding", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PITTSTON TWP. — Cintas Corp., one of the first tenants in CenterPoint Commerce and Trade Park, has expanded and plans to hire 65 more employees.\nAn opening ceremony was held Tuesday at Cintas Fire National Accounts Receivable Center at 339 Enterprise Way in CenterPoint Commerce and Trade Park West.\nCintas has another location at 114 Centerpoint Blvd. in CenterPoint Commerce and Trade Park East, but an additional center was needed due to the growth of its fire division, said Maria Scagliotti, director of the Cintas National Accounts Fire Center.\n“We outgrew that space and moved into this building,” Scagliotti said. “We’re growing at such a rapid rate.”\nIn seven years, Scagliotti said Cintas has grown from 10 employees to 50, including five supervisors.\nAdding 65 more employees will more than double the size of the center. The goal is to have more than 100 employees in the building on Enterprise Way in the next five years, she said.\nCintas’ fire division offers fire protection services such as installing sprinkler systems and inspecting alarms and fire extinguishers.\nIts National Accounts Receivable Center is responsible for contacting customers to obtain payments for services rendered.\n“We have locations across the country and we collect here nationally for the entire country,” Scagliotti said.\nJobs will be open for accounts receivable representatives and interested applicants can apply online at www.cintas.com. Scagliotti would not say what the starting salary is for the positions.\n“They are entry-level positions with the opportunity to advance,” she said. “With that growth will come more leadership positions and management positions.”\nMichelle Mikitsh, executive vice president at the Greater Pittston Chamber of Commerce, said the chamber has been working on workforce development and the creation of more jobs at Cintas is “fantastic.”\n“We’re excited that there are companies like Cintas presenting more and more opportunities,” Mikitish said.\nContact the writer:\ndallabaugh@citizensvoice.com;\n570-821-2115;\n@CVAllabaugh on Twitter", "url": "https://apnews.com/cb5ba57dfa0a4adfa0fb14401e30b282"}