{"authors": ["Donald Hunt"], "date_download": "2020-05-04 20:21:36", "date_modify": "2020-05-04 20:21:36", "date_publish": "2017-12-02 05:00:00", "description": "Tribune Staff Writer D.J. Moore picks up postseason honors D.J. Moore had an outstanding season for the University of Maryland as the team’s brilliant wide receiver. Moore, a former...", "filename": "_c7d65c80b7b641e1916312ae3cdcfc4f_1588623696.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c7d65c80b7b641e1916312ae3cdcfc4f_1588623696.html", "title": "Sports Notes: D.J. Moore picks up postseason honors", "title_page": "Sports Notes: D.J. Moore picks up postseason honors", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tribune Staff Writer\nD.J. Moore picks up postseason honors\nD.J. Moore had an outstanding season for the University of Maryland as the team’s brilliant wide receiver. Moore, a former Imhotep Charter standout, picked up two postseason honors. The 5-foot-11, 215-pound junior was named first-team All-Big Ten.\nHe led the conference in receptions with 80 and receiving yards with 1,033. Moore had eight touchdown receptions. He averaged 12.9 yards a catch.\nThe former Public League standout was also selected as the Richter-Howard Receiver of the Year recently announced by the Big Ten. Moore is just one of three wide receivers in the nation with 80 catches, 1,000 receiving yards and eight TDs.\nFive Temple players on all-conference list\nTemple University’s football team received plenty of recognition from the American Athletic Conference. The Owls had four players receive team honors and one garnering honorable mention.\nJunior safety Delvon Randall was named to the first-team All-AAC. Redshirt senior offensive lineman Brian Carter and senior defensive ends Sharif Finch and Jacob Martin were chosen on the second team. Senior safety Sean Chandler was named honorable mention.\nPhillies name Allen, Morandini ambassadors\nFormer Phillies standouts Dick Allen and Mickey Morandini were named club ambassadors. Allen has been a part of the Phillies front office since 1994 as a fan development and community representative. He makes several public appearances on behalf of the organization and has been involved in community outreach efforts. Allen, a member of the club’s Wall of Fame, hit .290 with 204 doubles, 204 home runs, 655 RBI, 517 walks, a .371 on-base percentage and a .902 OPS in 1,070 games as a Phillie. Allen played in seven all-star games, including three as a Phillie and ranks second in club history with a .530 slugging percentage and 10th in home runs.\nMorandini spent the last two seasons as the team’s first base coach and baserunning instructor. He was also a minor league coach and manager for the Phillies for five years. He played second base for the Phillies and was a member of the 1993 National League championship team. He played in the 1995 All-Star Game. He played nine seasons with the Phillies.\nIn 2014, the Phillies started the club ambassador program with Gary Matthews and Chris Wheeler. Matthews played in 395 games with the Phillies and hit .279 with 38 home runs and 200 RBI. He will continue in his role in 2018. Wheeler has opted for a reduced role with the organization, primarily helping the Phillies in spring training in Clearwater, Fla.\n“Whether they are appearing at community events, interacting with fans at the ballpark, or speaking to young athletes, the role of our ambassadors is to maintain the Phillies’ ongoing efforts to connect with our fan base on an intimate level,” said David Buck, Phillies executive vice president in a statement. “Dick, Mickey and Gary are well-suited to serve in these roles. We anticipate adding additional ambassadors over the next several years, giving us an opportunity to connect with a different generation of fans.”", "url": "https://apnews.com/c7d65c80b7b641e1916312ae3cdcfc4f"}