{"authors": ["Joe Allen", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman"], "date_download": "2020-05-04 20:00:19", "date_modify": "2020-05-04 20:00:19", "date_publish": "2017-08-07 00:00:00", "description": null, "filename": "2017_08_uaw-mississippi-nissan-union-labor-election-autoworkers_1588622419.html", "image_url": "https://images.jacobinmag.com/2017/08/07173827/uaw.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_08_uaw-mississippi-nissan-union-labor-election-autoworkers_1588622419.html", "title": "A Crushing Blow", "title_page": "A Crushing Blow", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The United Auto Workers (UAW) have staggered from one defeat to the next for many years. Three years ago, the union got a punch in the gut when it was defeated in a recognition vote at Volkswagen (VW) in Tennessee. Friday’s defeat at Nissan was nothing less than a knockout punch ending for the foreseeable future of any efforts by the UAW to organize the large, predominately foreign-owned auto assembly plants in the South.\nNews of the defeat trickled in on Friday night through friends who were present at the vote in Canton, Mississippi, where Nissan’s sprawling, nearly-mile-long assembly plant is located. More than 60 percent of Nissan’s approximately 3,500 eligible workers voted over a two-day period against the union. Most of us hoped to wake up on Saturday morning to better news, but Nissan — one of the world’s top automakers — beat the UAW hands down. It wasn’t even close.\n“It was certainly disappointing news,” Scott Houldieson, the vice-president of UAW Local 551, told me over the phone during his lunch break on Sunday. Houldieson is a twenty-eight-year veteran of Ford’s Torrence Ave. assembly plant on Chicago’s far South Side. “A lot us are disappointed. We had high hopes.”\nSome saw it coming. A former UAW organizer who requested anonymity told me this would be the outcome two weeks ago when I asked him about the approaching election. “They’re going to lose two to one,” he told me. He was pretty much on target.\nThe Nissan defeat won’t be an isolated southern affair for the UAW: it will blow back to the union’s heartland in the Midwest. “We’ve been told for years by Solidarity House, the UAW’s headquarters in Detroit, that we can’t make significant contract gains because our density [the percentage of union workers in a specific industry] was too low to fight the ‘Big Three,’” said Houldieson. “With the defeat at Nissan, we are backsliding.”\nThe warning signs for losing the Nissan vote were all there for us to see. Three years ago at VW in Chattanooga, Tennessee, the UAW lost a vote even though VW was encouraging its workers to vote for the UAW. The German automaker has had a long cooperative relationship with the German trade unions where “works councils” — joint management-worker in-plant committees — are present in many workplaces. Under US law, many legal experts would consider such “councils” to be illegal company unions.\nIt was Tennessee’s aggressive Republican political establishment that intervened in the VW union election with a no-holds-barred campaign to defeat the UAW. Surprisingly, they got some help from then-UAW president Bob King. As Micah Uetricht reported in February 2014:\nAs powerful right-wing forces flush with cash mounted open opposition, the union refused support from local activists. The UAW did little to counter right-wing threats and scare tactics, and refused to expand the effort into a broader grassroots campaign in support of the union … Many already-unionized Tennessee workers approached the UAW about coordinating a grassroots community response to the vicious anti-union campaign, but were rebuffed.\nIt takes quite an arrogant union leadership to refuse the help of friends and lose an election when it doesn’t even have a management opponent.\nThe UAW did do some things differently with the Nissan campaign, at least outside the plant. The union made a big effort to develop a relationship with religious and community organizations. It crafted its campaign as part of Mississippi’s long and storied black freedom struggle with the slogan “Workers’ Rights=Civil Rights.” Scott Houldieson thought this was a “hopeful sign.”\nA “March on Mississippi” in support of the Nissan campaign drew more than six thousand Nissan workers, their families, local supporters, and fellow UAW members from across the country — including twenty Ford workers from Houldieson’s plant — to Canton to hear former presidential candidate Senator Bernie Sanders and actor Danny Glover speak in support of the UAW. It was an impressive turnout for a small southern city.\nUnfortunately — unlike at VW — the UAW had an aggressive in-plant management determined to keep it out. Only three of Nissan’s forty-five assembly plants around the globe are non-union. The company ran a well-oiled campaign, including captive audience meetings and aggressive one-on-one meetings with employees. These tactics are all perfectly legal under US labor law and have been employed by management for decades. While the UAW filed numerous labor charges against the company, it failed to win the argument on the shop floor.\nReaching for an explanation of their defeat, UAW president Dennis Williams released a statement that read, “Perhaps recognizing they couldn’t keep their workers from joining our union based on the facts, Nissan and its anti-worker allies ran a vicious campaign against its own work force that was comprised of intense scare tactics, misinformation, and intimidation.”\nHouldieson scoffed at Williams’ excuses and provided another explanation. “The UAW was born when ‘scare tactics and intimidation’ meant goon squads beating union activists, company spies infesting plants and workers being fired at any sign of supporting the union,” he said. “We made our biggest gains for our membership and the whole working class when we were fighting — and we haven’t fought for a long time.”\nCould another organizing strategy have won? The former UAW organizer told me:\nMy personal opinion is that the election route was a flawed strategy. An election is the bosses’ game, and a large number of the workers were excluded from the process because they were considered temps. There was never any consideration paid to possibly looking for weak links in the supply chain, organizing there, striking for recognition and trying to leverage Nissan that way. Nissan is really vulnerable to that kind of thing because they rely on Just-In-Time suppliers, and workers at the suppliers are poorly paid and treated worse that the permanent Original Equipment Manufacturer or OEM workers,” that person continued. “Not organizing get temps was dumb too. Sure, they can’t really participate in an NLRB election, but they are important to the production process, tend to be treated and paid a lot worse, and can shut down a line or a department if they are organized. The UAW strategy never considered organizing for strikes anywhere in the supply chain which is sad. The UAW was formed by militant minorities engaging in sit down strikes, yet that strategy wasn’t on the table. Clearly, they forgot all of that history when the put this campaign together.\nThe UAW has become a prisoner of its modern history. It has a very long track record of making concessions on wages, benefits, and working conditions to the “Big Three” automakers, along with the new albatross around its neck — the loss of a string of recognition elections.\nHopefully, some of the Nissan organizers will break ranks and tell us the inside story about how this avoidable defeat took place. I’m sure that many on the UAW’s national organizing staff and key organizers on the ground knew the outcome ahead of time but dared not to speak out earlier because they feared retaliation. There is much to learn. We need a UAW Jane McAlevey to come forward.\nWhen the story is finally told, it will likely be one of incompetence, bureaucratic sloth, and undemocratic rule at work in the UAW’s defeat. But to get to the bottom of this loss, we will ultimately need to interrogate history. The failure at Nissan is an end product of several longstanding negative historical turning points in the US labor movement including the anti-communist purge of the labor movement in the late 1940s, the failure of the underfunded “Operation Dixie,” and the dominance of business unionism.\nWe, however, are not prisoners of our history. There is a new socialist movement in this country — as well as a crying need for an industrial strategy. It’s long past time to turn this around. The historic UPS strike of 1997 showed us the way forward. We need to make a change starting now.", "url": "https://www.jacobinmag.com/2017/08/uaw-mississippi-nissan-union-labor-election-autoworkers"}