{"authors": ["Emilie Munson"], "date_download": "2020-05-04 20:13:22", "date_modify": "2020-05-04 20:13:22", "date_publish": "2017-02-23 23:19:24", "description": "GREENWICH — Elementary school start times will remain the same next year, despite changing start times for Greenwich’s public middle schools and the high school, the district announced...", "filename": "_fba1e1ee2308489d8399ecca3bf8ef33_1588623202.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fba1e1ee2308489d8399ecca3bf8ef33_1588623202.html", "title": "Greenwich elementary school start times to remain as is", "title_page": "Greenwich elementary school start times to remain as is", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GREENWICH — Elementary school start times will remain the same next year, despite changing start times for Greenwich’s public middle schools and the high school, the district announced Thursday.\n“The message we had gotten from the community was that they liked when their schools were starting and they did not want them to change, so we were pleased that we are able to do that,” said Gaetane Francis, Board of Education vice chair and chair of the School Start Time Ad Hoc Committee.\nIn September, a school board proposal called for at least two schools’ bell times to change, with the remaining nine schools maintaining their 8:15 a.m. or 8:45 a.m. start times.\nThe district has suspected for a few months that it could avoid changing any start times for elementary schools, but needed to finalize school bus routes to be sure, Francis said.\nBeginning in September 2017, Greenwich High Schools will begin classes at 8:30 a.m., one hour later than the current school year. All Greenwich public middle schools will begin at 8 a.m., 15 minutes later than the current school year.\nThe Board of Education endorsed the switch to later school start times in June 2016.\nProponents for the change pointed to studies showing a later start time allows children to get more sleep, and that healthier kids are better positioned to learn and develop.\nOpponents said not enough information was known about the impact of starting and ending school on the community, pointing to athletic programs and that a later dismissal would change teacher schedules.\nThe board ultimately voted to make the change, citing student health as the main reason.\n“I’ve said for a long time that I don’t like the idea of school starting before 8 o’clock,” said Francis in June. “I think that’s too early for all students.”\nThe School Start Time Committee will continue to review after-school athletics, after-school child care, impact on teacher commutes and lunch schedules.\n“We are really thinking through those one by one,” she said, but added, “The bulk of what has to be done has been decided.”\n“There aren’t any big outstanding issues that are problematic,” she said. “We are all set to go.”\nThe district will continue to release monthly updates on its preparations for new school start times throughout the spring.\nemunson@greenwichtime.com; Twitter: @emiliemunson", "url": "https://apnews.com/fba1e1ee2308489d8399ecca3bf8ef33"}