{"authors": ["Jason Galloway", "Wisconsin State Journal"], "date_download": "2020-05-04 20:27:25", "date_modify": "2020-05-04 20:27:25", "date_publish": "2017-12-14 10:15:00", "description": "Three University of Wisconsin players earned All-American honors from the American Football Coaches Association on Wednesday. Right tackle David Edwards picked up a first-team All-American...", "filename": "_484ce1de0ebe4664ba9412fc8fbf857b_1588624045.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_484ce1de0ebe4664ba9412fc8fbf857b_1588624045.html", "title": "Badgers football: Three Wisconsin players earn All-American honors from American Football Coaches Association", "title_page": "Badgers football: Three Wisconsin players earn All-American honors from American Football Coaches Association", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Three University of Wisconsin players earned All-American honors from the American Football Coaches Association on Wednesday.\nRight tackle David Edwards picked up a first-team All-American honor after starting all 13 games and helping pave the way for running back Jonathan Taylor’s Heisman candidacy.\nInside linebacker T.J. Edwards and tight end Troy Fumagalli were both selected to the second team.\nEdwards recorded 75 tackles, 11 for a loss, two sacks, four interceptions and one touchdown this season. Fumagalli caught 43 passes for 516 yards and four scores while also using his blocking ability to help in the run game.\nTaylor, Fumagalli, T.J. Edwards and David Edwards were named All-Americans by four of the five outlets recognized by the NCAA -- the AFCA, the Football Writers of Association of America, the Associated Press, Sporting News and the Walter Camp Foundation.\nSix Badgers players -- the four listed above along with left tackle Michael Deiter and right guard Beau Benzschawel -- made at least one of the five All-American teams, the most ever for UW in a single season.\nHere’s a list of All-American honors for the Badgers this year:\nAFCA\nDavid Edwards (first team)\nTroy Fumagalli (second team)\nT.J. Edwards (second team)\nSPORTING NEWS\nT.J. Edwards (second team)\nMichael Deiter (second team)\nJonathan Taylor (second team)\nFWAA\nJonathan Taylor (second team)\nTroy Fumagalli (second team)\nDavid Edwards (second team)\nAP\nT.J. Edwards (first team)\nJonathan Taylor (second team)\nTroy Fumagalli (second team)\nDavid Edwards (third team)\nBeau Benzschawel (third team)\nWALTER CAMP\nJonathan Taylor (second team)\nT.J. Edwards (second team)\nTroy Fumagalli (second team)\nDavid Edwards (second team)", "url": "https://apnews.com/484ce1de0ebe4664ba9412fc8fbf857b"}