{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:19:43", "date_modify": "2020-05-04 20:19:43", "date_publish": "2017-10-10 08:00:00", "description": "Kevin Sean Burke January 18, 1954 - October 6, 2017 Kevin S. Burke, 63, passed away suddenly the evening of October 6, 2017. Kevin was born and raised in Pocatello, ID, to Vernon and Mary (McCune)...", "filename": "_9aabe2d1f7404ac7a73c150d71a7becd_1588623583.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9aabe2d1f7404ac7a73c150d71a7becd_1588623583.html", "title": "Burke, Kevin Sean", "title_page": "Burke, Kevin Sean", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kevin Sean Burke January 18, 1954 - October 6, 2017 Kevin S. Burke, 63, passed away suddenly the evening of October 6, 2017. Kevin was born and raised in Pocatello, ID, to Vernon and Mary (McCune) Burke, both now deceased. He entered the navy at a young age, eventually serving more than 20 years and retiring as Chief Petty Officer. During his service he specialized in nuclear propulsion systems and saw duty on the USS Enterprise, at the US Nuclear Submarine Base in Dunoon, Scotland, and as an instructor at the Nuclear Propulsion Training Unit, Ballston Spa, NY. Retiring from military service in 1992, he also completed his Bachelor of Arts degree in History from The State University of New York in 1992. Upon his return to Pocatello, Kevin became an active member of First Congregational United Church of Christ. There he helped found a Transitional Housing ministry and served in many board positions. He also became a certified Licensed Minister in the United Church of Christ. It was there he met the Rev. Carla Gilbert. Brought together by their love of books, theology, social justice, and service to others, they married in 1998 and moved to Odgen, Utah, where Kevin helped manage the power plant of the Hill Air Force base and Carla pastored the Ogden UCC. The couple retired to Berea in 2006. Kevin’s faith was strong and he was an active member of Union Church where his quiet, loving service, was the bastion of so many projects. He was serving as the chair of the Community Life and Growth board at the time of his death, as well as playing in the Union Church Handbell Ensemble. He loved his Celtic heritage and reveled in the religious wisdom of mystics from the isles and beyond. Kevin was a beloved volunteer for countless organizations including Union Church, Habitat for Humanity, Friends of the Library, The Berea Arts Council, the Berea College Community Friendship Program for international students, and White House Clinic. He was most recently employed as a much beloved driver for Kentucky River Foothills Express. Whether driving the Berea trolley or taking his beloved senior patients to appointments, Kevin’s hospitality and infectious joy were legendary. Kevin is survived a number of family and by a cloud of friends who were his beloved beyond blood: In Berea, his wife of 19 years, the Rev. Carla Gilbert and his stepson and daughter-in-law, the Rev. Kent Gilbert and the Rev. Diana Hultgren; In Denver, his stepson Craig (Lisa) Gilbert and two grandsons, Jonas and Felix Gilbert. Daughter Melissa Burke of Ashburn, Virginia. Of his Idaho family Kevin leaves behind siblings: Vern (Sandy) Burke , Cathleen Burke, MaryEllen Burke, Monica Burke, Patricia Burke (Ross Gutterud), Kathy, lovingly referred as Snooky or purse girl (Doug) Newcomb. Friend and baseball buddy Mike Rowe of Pocatello. There are also many nieces, nephews and friends from all over the globe who are all beloved and remembered here for their love of Kevin. Visitation will be Friday November 3, 5:30 to 8pm, at Union Church (200 Prospect St.) Berea. and the Memorial Service is Saturday November 4, at 11:00 am. In lieu of flowers, the family request that contributions be made to Union Church (CPO 2105, Berea, KY 40404) or .", "url": "https://apnews.com/9aabe2d1f7404ac7a73c150d71a7becd"}