{"authors": ["Jim Allen"], "date_download": "2020-05-04 20:25:43", "date_modify": "2020-05-04 20:25:43", "date_publish": "2017-02-08 00:00:00", "description": "Literally and figuratively, the Eastern Washington players have come back to earth. In North Dakota. In the dead of winter. Five days ago the Eagles posted a record-setting win that...", "filename": "_1dc3b87b90964766970e238453f26a29_1588623943.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1dc3b87b90964766970e238453f26a29_1588623943.html", "title": "High-flying Eastern Washington faces tough road trip", "title_page": "High-flying Eastern Washington faces tough road trip", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Literally and figuratively, the Eastern Washington players have come back to earth.\nIn North Dakota. In the dead of winter.\nFive days ago the Eagles posted a record-setting win that also propelled forward Jacob Wiley to national prominence.\n“It was head-shaking,” coach Jim Hayford said after browsing the records set during the Eagles’ 130-124 triple-overtime victory over Portland State. “Just amazing.”\nEven more amazing: Wiley was named the national player of the week after scoring 83 points and pulling down 29 rebounds in a home of sweep of Sacramento State and PSU.\nNow for the hard part: Getting refocused for one of the tougher road trips in the Big Sky Conference, 3,000 air miles from Spokane to Grand Forks to Greeley, Colorado and back home.\nHopefully with two more wins.\nIt won’t be easy, especially on Thursday, when Eastern and North Dakota will square off in Grand Forks to break their second-place tie. Both teams are 8-3 in the conference, two games behind Weber State in the loss column.\nThe top five teams in the final standings will get first-round byes in the conference tournament, which begins March 7 in Reno, Nevada.\nEastern has never won in Grand Forks in four tries, and the Eagles are 3-7 all-time in Greeley. Eastern was swept on this road trip a year ago – losing 79-71 to UND and 96-90 to UNC – but rebounded for home victories over both teams, 95-85 and 97-80, respectively.\nThe Fighting Hawks are led by guard Quinton Hooker, the preseason Big Sky MVP. Hooker is averaging 19.6 points and 3.7 assists.\nEastern leads the Big Sky in shooting accuracy at 51.1 percent.", "url": "https://apnews.com/1dc3b87b90964766970e238453f26a29"}