{"authors": ["Scott Herpst"], "date_download": "2020-05-04 20:24:30", "date_modify": "2020-05-04 20:24:30", "date_publish": "2017-02-10 03:17:00", "description": "Teams from Area 6 occupy five of the top 14 places in the Class AAAA state wrestling tournament after the completion of Day 1 at the Macon Coliseum. Gilmer (60.5 points) is in third place...", "filename": "_2f807c0a22a14622b0d04590dc764034_1588623870.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2f807c0a22a14622b0d04590dc764034_1588623870.html", "title": "WRESTLING: Area grapplers advance to championship semifinals in Macon", "title_page": "WRESTLING: Area grapplers advance to championship semifinals in Macon", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Teams from Area 6 occupy five of the top 14 places in the Class AAAA state wrestling tournament after the completion of Day 1 at the Macon Coliseum.\nGilmer (60.5 points) is in third place behind Jefferson (76.5) and West Laurens (70) after Thursday’s action. Northwest Whitfield (46) is fourth, while Marist (42) rounds out the top five.\nHeritage (41.5) is sixth, Ridgeland (35.5) is eighth and LaFayette (24.5) checks in at No. 14 in the team standings.\nRidgeland has three wrestlers in the championship semifinals. Jacob Mariakis, who scored a technical fall in the first round, needed just 25 seconds to pin Fernando Guijon of Southeast Whitfield in the 138-pound quarterfinals.\nHe is joined in the semifinals by Ryan McGill (170), who got an opening pin before a 7-5 win over Jamarey Hull of Northwest Whitfield. Defending state champion Chris Henderson (220) scored a pin and a 9-5 win over DeShaun Baker of Druid Hills to advance.\nHenderson’s semifinal opponent will be Lazavier Moore of Upson-Lee, whom Henderson beat in the state finals a year ago.\nChris Prescott (126) was pinned by Evan Stokes of West Laurens in the quarterfinals, while Jordan Hughley (132) was pinned by Daniel Jernigan of Heritage. Dylan Swanson, who lost his first match of the day at 152, won in the consolation bracket.\nAlong with Jernigan, the Generals have two more in the semis.\nTwo-time state champion Chuckie Thurman advanced with two pins on Thursday, while Jeffery Curtis (220) got a pin in the first round before beating LaFayette’s Cody Deal, 8-0.\nRyan Craft (106) lost to Gilmer’s Dan Puac, 15-3 in the second round. Blake Bryant (113) lost to Central-Carroll’s C.J. Shadinger (10-4) and Zaine Burton (195) suffered a 7-3 loss to Northwest Whitfield’s Jordan Lewis in their quarterfinal bouts. Those three wrestlers are still alive in the consolation brackets.\nThe other two Rambler grapplers moved on to the semifinals with two wins on Thursday. Tyler Beard (160) scored two pins to advance, while Cole Ingram (170) won a technical fall and a 13-4 major decision.\nWrestling for Class AAAA will start at 12 p.m. on Friday with the semifinals set for 4 p.m. The finals in all classifications will be held at 3 p.m. on Saturday.", "url": "https://apnews.com/2f807c0a22a14622b0d04590dc764034"}