{"authors": ["Cnn Editorial Research"], "date_download": "2020-05-04 16:15:08", "date_modify": "2020-05-04 16:15:08", "date_publish": "2017-01-18 23:47:58", "description": "Here's a look at the life of Joaquín Guzmán, otherwise known as \"El Chapo,\" a Mexican drug trafficker who has repeatedly broken out of prison.", "filename": "2017_01_18_world_joaqun-el-chapo-guzmn-fast-facts_index_1588608908.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/181129164659-el-chapo-trial-1116-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2017_01_18_world_joaqun-el-chapo-guzmn-fast-facts_index_1588608908.html", "title": "El Chapo Fast Facts", "title_page": "El Chapo Fast Facts - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Here's a look at the life of Joaquín Guzmán, otherwise known as \"El Chapo,\" a Mexican drug lord who has repeatedly broken out of prison. He was recaptured in January 2016 and later extradited to the United States to stand trial on federal charges.\nPersonal\nBirth place: La Tuna, Badiraguato, Sinaloa, Mexico\nBirth name: Joaquín Archivaldo Guzmán Loera\nFather: Emilio Guzmán Bustillos, subsistence farmer\nMother: María Consuelo Loera Pérez\nMarriages: Believed to have been married at least three times, the most recent being Emma Coronel Aispuro (2007-present)\nChildren: Is purported to have fathered between 12 and 13 children\nOther Facts\nThe nickname, \"El Chapo,\" means \"Shorty.\" Guzmán stands 5'6\" tall.\nFormer leader of the Sinaloa Cartel, which the US Justice Department describes as \"one of the world's most prolific, violent and powerful drug cartels,\" moving billions upon billions of dollars in marijuana, cocaine, heroin and methamphetamine.\nWas able to continue running the Sinaloa Cartel in prison through bribes.\nThe Sinaloa Cartel controls roughly 40% to 60% of Mexico's drug trade, with earnings at around $3 billion annually.\nClaimed in 2014 that he has killed 2,000-3,000 people.\nIs said to be semi-illiterate, receiving no formal education beyond third grade.\nIs known for using intricate tunnel systems for both evading authorities and moving the massive quantities of drugs that made the Sinaloa Cartel so powerful.\nHis cartel has produced, smuggled and distributed marijuana, heroin, cocaine, methamphetamine and other types of drugs.\nHas appeared on both Forbes' World's Billionaires list and Most Powerful People list.\nAccording to the US Treasury Department, he was considered the most \"powerful drug trafficker in the world.\"\nGuzmán is perceived by some as a hero, with many narcocorridos, \"drug ballads,\" that glorify kingpins, written in his honor.\nThere have been charges brought against Guzmán in 10 legal cases in Mexico, as well as federal charges in Arizona, California, Texas, Illinois, New York, Florida and New Hampshire. He was convicted on 10 counts related to federal drug offenses in February 2019 after a trial in Brooklyn, New York.\nTimeline\n1960s - Begins planting marijuana with his cousins.\n1970s - Begins running drugs to major Mexican cities and the US border and working with major drug traffickers such as Miguel Angel Felix Gallardo, leader of the Guadalajara Cartel.\n1980s - Member of the Guadalajara Cartel. After the arrest of Felix Gallardo, the cartel splits into factions. Guzmán becomes leader of the Sinaloa Cartel Pacific coast faction.\nFebruary 1992 - Police find the bodies of six of Guzmán's top lieutenants dumped along Tijuana highways; the six men had been tortured and shot.\nNovember 1992 - Six people are gunned down at a discotheque in Puerto Vallarta by gunmen working for Guzmán, whose targets are traffickers in the Tijuana Cartel.\nMay 1993 - Gunmen with the Tijuana Cartel attempt to assassinate Guzmán in retribution, firing upon a vehicle at an airport. Guzmán escapes unharmed, but Cardinal Archbishop of Guadalajara Juan Jesús Posadas Ocampa is killed accidentally, along with six others.\nJune 9, 1993 - Wanted on charges of drug trafficking, murder and kidnapping, he is arrested in Guatemala and extradited to Mexico. Guzmán is subsequently sentenced to a minimum of 20 years in a maximum security prison.\nEarly 2000s - Violence across Mexico escalates as El Chapo's Sinaloa Cartel attempts to encroach upon Tijuana and Gulf Cartel territory.\nJanuary 19, 2001 - Escapes the maximum-security Puente Grande prison in Jalisco, Mexico, in a laundry cart. The planned escape requires bribes and cooperation allegedly costing him $2.5 million, according to Malcolm Beith's book, \"The Last Narco.\"\n2004 - The US government announces a $5 million reward for information leading to Guzmán's arrest and conviction.\nMay 2008 - Guzmán's son, Edgar, is murdered in a parking lot shootout near Culican, Mexico.\n2009 - First appears on Forbes' billionaires list.\n2009 - Guzmán and other cartel leaders are indicted on charges of conspiring to import more than 264,000 pounds of cocaine into the United States between 1990 and 2005.\nAugust 2011 - Guzmán's wife, Emma Coronel Aispuro, who has dual US-Mexican citizenship, gives birth to twin girls in a hospital outside of Los Angeles.\n2012 - The US Treasury Department uses the Foreign Narcotics Kingpin Designation Act to freeze the The US Treasury Department uses the Foreign Narcotics Kingpin Designation Act to freeze the US assets of his relatives\nFebruary 22, 2014 - Guzmán is apprehended at a beach resort in Mazatlán, Mexico.\nJuly 11, 2015 - Escapes the maximum-security Altiplano Federal Prison near Toluca, Mexico, by crawling through an opening in the shower area of his cell block leading to a nearly mile-long tunnel.\nOctober 2015 - While on the run, he meets with movie star Sean Penn and Mexican actress Kate del Castillo. Penn's interview with Guzmán subsequently runs in While on the run, he meets with movie star Sean Penn and Mexican actress Kate del Castillo. Penn's interview with Guzmán subsequently runs in Rolling Stone magazine. \"I supply more heroin, methamphetamine, cocaine and marijuana than anybody else in the world,\" Guzmán is quoted in the interview. \"I have a fleet of submarines, airplanes, trucks and boats.\"\nJanuary 8, 2016 - Guzmán Guzmán is recaptured by Mexican authorities in Los Mochis, Sinaloa, after a raid leads to a shootout in which five people connected to Guzmán are killed.\nMay 9, 2016 - A judge in Mexico approves the United States' request to extradite Guzmán, who faces charges in seven states. Once extradited, he will be sent to Brooklyn, New York, to stand trial on federal charges.\nJanuary 20, 2017 - Enters a plea of not guilty at his arraignment in US District Court for the Eastern District of New York.\nNovember 13, 2018 - in a New York federal district court amid unprecedented security measures, including armed escorts for the anonymous and partly sequestered jurors, as well as heavily armed federal marshals and officers with bomb-sniffing dogs standing guard outside the courthouse. Guzmán's long-awaited criminal trial begins in a New York federal district court amid unprecedented security measures, including armed escorts for the anonymous and partly sequestered jurors, as well as heavily armed federal marshals and officers with bomb-sniffing dogs standing guard outside the courthouse.\nFebruary 12, 2019 - Guzmán is convicted of 10 counts, including engaging in a continuing criminal enterprise, conspiracy to launder narcotics proceeds, international distribution of cocaine, heroin, marijuana and other drugs, and use of firearms. He faces a mandatory life sentence without the possibility of parole for leading a continuing criminal enterprise, and a sentence of up to life imprisonment on the remaining drug counts. His attorneys say they plan to file an appeal on a number of issues.\nFebruary 21, 2019 - The US Justice Department announces Joaquin Guzmán Lopez and Ovidio Guzmán Lopez, two sons of \"El Chap,\" The US Justice Department announces Joaquin Guzmán Lopez and Ovidio Guzmán Lopez, two sons of \"El Chap,\" are charged with conspiracy to distribute drugs to be imported into the US.\nJuly 17, 2019 - Guzmán is sentenced to life in prison plus 30 years. He is also ordered to pay $12.6 billion in forfeiture. Restitution will be determined later.", "url": "https://www.cnn.com/2017/01/18/world/joaqun-el-chapo-guzmn-fast-facts/index.html"}