{"authors": ["Brandon Garside", "Standard-Examiner Staff"], "date_download": "2020-05-04 20:09:40", "date_modify": "2020-05-04 20:09:40", "date_publish": "2017-11-25 03:08:18", "description": "OGDEN — Weber State’s game against Western Illinois on Saturday afternoon marks the second-consecutive trip to the FCS Playoffs for the Wildcats, but the team is hoping for a much different...", "filename": "_6c43898eb3334a7c9192f70f3023e557_1588622980.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6c43898eb3334a7c9192f70f3023e557_1588622980.html", "title": "Jay Hill: Weber State-Western Illinois matchup ‘like we’re playing ourselves’", "title_page": "Jay Hill: Weber State-Western Illinois matchup ‘like we’re playing ourselves’", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "OGDEN — Weber State’s game against Western Illinois on Saturday afternoon marks the second-consecutive trip to the FCS Playoffs for the Wildcats, but the team is hoping for a much different outcome than from a year ago.\n“Last year I feel like we were just grateful to be there, but now we’re going for a national title run,” WSU senior cornerback Taron Johnson said.\nThe Wildcats’ (9-2, 7-1 Big Sky) first-ever home playoff game comes against one of the best road teams in all FCS.\nThe Leathernecks (8-3, 5-3 Missouri Valley) are 6-1 on the road this year, including wins over FBS team Coastal Carolina, FCS playoff team Northern Arizona, and fellow Missouri Valley member and playoff team Northern Iowa.\nBEHIND THE SCENES: How Weber State was selected to host an FCS Playoff game TARON JOHNSON: Senior culminates career as NFL prospect on a playoff team\nPutting aside the purple uniforms and a ‘W’ on their helmets, Weber State head coach Jay Hill feels like his team was looking in a mirror when scouting the Leathernecks.\n“Quite frankly, these guys are a lot like us,” Hill said. “They play really good defense, their offense is very similar to ours. They’re good on special teams, they don’t turn the ball over very much. This is a game like we’re playing ourselves. This is two dang good teams going at it.”\nWestern Illinois junior quarterback Sean McGuire is efficient. He completes 65.2 percent of his passes and averages 240.9 passing yards per game. His primary target is senior wide receiver Jaelon Acklin, who leads the Missouri Valley in receiving yards per game with 113.9.\nThere is no compromise in quantity or quality for Acklin. He records 6.7 catches per game and averages a staggering 16.9 yards per catch.\n“He’s made catches all over the field,” Hill said. “He’s a very talented guy and the rest of the receiving corps is good. The running backs are good out of the backfield. Their offense is a little different than what we’ve seen this year, but I like the matchup. We’ll see how that unfolds, but I like the matchup.”\nSenior linebacker Brett Taylor leads the Leathernecks’ defensive effort. Taylor tops the Missouri Valley in tackles per game at 13.6. The next closest player in the conference averages 9.9 tackles per game.\nWestern Illinois also has a conference-best 18 interceptions on the year, with junior corner Justin Fitzpatrick grabbing five picks this season.\n“They’re a darn good team on both sides of the ball,” Hill said. “They’re well coached. They take care of the football. We’re going to have to match that. What they do well, we’re going to have to match that and exceed it.\n“I like the matchup. They probably like the matchup as well. This is going to be one dang good football game.”\nKickoff is slated for 2 p.m. at Stewart Stadium. The game will stream on ESPN3/WatchESPN with a radio broadcast on 1430 AM KLO with Steve Klauke and Bo Bolen on the call.\nContact sports reporter Brandon Garside at bgarside@standard.net, on Twitter @BrandonGarisde and on Facebook.com/BrandonGarsideSE.", "url": "https://apnews.com/6c43898eb3334a7c9192f70f3023e557"}