{"authors": ["Aaron Nelsen"], "date_download": "2020-05-04 21:07:05", "date_modify": "2020-05-04 21:07:05", "date_publish": "2017-12-08 02:27:38", "description": "EDINBURG - A former priest accused of killing a Rio Grande Valley beauty queen in 1960 was found guilty of murder with malice aforethought Thursday after a jury deliberated for about six...", "filename": "_bf160f4e0b1c4df59029be56e63c1b9d_1588626425.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bf160f4e0b1c4df59029be56e63c1b9d_1588626425.html", "title": "Former priest found guilty of murder in case that haunted South Texas for decades", "title_page": "Former priest found guilty of murder in case that haunted South Texas for decades", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Former priest found guilty of murder in case that haunted South Texas for decades\nEDINBURG - A former priest accused of killing a Rio Grande Valley beauty queen in 1960 was found guilty of murder with malice aforethought Thursday after a jury deliberated for about six hours.\nJohn Feit, now 85, sat stone-faced and showed no emotion as he was convicted of killing Irene Garza, a 25-year school teacher, when he was 27 and serving as a fill-in priest in the Valley. Family members of the victim hugged each other after the verdict was read.\nGarza was last seen going to Sacred Heart Catholic Church in McAllen where Feit heard her confession. Her body was found five days later in a canal. Autopsy results showed she had been raped while unconscious and died of asphyxiation, likely from suffocation.\nGarza’s grisly killing during Holy Week 1960 haunted South Texas for decades and was the subject of a 48 Hours television special.\nFeit’s conviction brings an end to one of the oldest cases in the Hidalgo County judicial system, but leaves unresolved allegations of a deal cut between the district attorney and church leaders to stop the investigation into Feit and avoid a scandal.\nThe trial had been expected to take up to two weeks, but ended Wednesday after five days of testimony.\n“This is a case about betrayal, murder and a cover-up,” said Assistant District Attorney Michael Garza, lead prosecutor, in closing arguments Thursday. “(Feit) was a wolf in priest’s clothing.”\nGarza, no relation to the victim, described Feit as a predator set loose on the young, devout women of McAllen, then a small agricultural community where no one doubted the moral authority of the Catholic Church.\nIn his closing, Feit’s attorney O. Rene Flores was critical of the lack of physical evidence linking Feit to the crime, and pointed out conflicting eye witness testimony that placed Garza at the church after the attack is thought to have occurred.\nMuch of the evidence appeared circumstantial, and Flores questioned witnesses who waited decades to come forward with testimony, including Father Joseph O’Brian, an assistant pastor who told a Dallas Morning News reporter in 2004 that he elicited a confession from Feit.\nResponding to the lack of physical evidence, Garza noted that even O’Brien, now deceased, was complicit, helping dispose of items found at the rectory belonging to the victim, Garza said in his closing.\n“How can you test what you can’t collect?” Garza questioned. “The cover up continues.”\nThe elderly Feit added to the courtroom drama Wednesday when he briefly considered taking the stand to address “several things that have been said about me that I feel like I need to correct.” He decided not to testify on the advice of his attorneys, he said.\nGarza was a second-grade teacher who had been Miss All South Texas Sweetheart in 1958 and a former prom and homecoming queen at what then was Pan American College.\nThe cold case lay dormant for decades until Dale Tacheny, a former monk at the monastery, contacted San Antonio police, claiming that years before Feit had confessed to putting Garza in a bathtub at the pastoral house. As he left the room Feit heard her say, “I cannot breathe,” Tacheny testified.\nHe felt no remorse for what he had done, Tacheny said, only that he was haunted by the sound of Garza’s heels.\nO’Brian’s testimony came later.\nanelsen@express-news.net | Twitter: @amnelsen", "url": "https://apnews.com/bf160f4e0b1c4df59029be56e63c1b9d"}