{"authors": ["Euan Mckirdy", "Flora Charner"], "date_download": "2020-05-04 20:24:23", "date_modify": "2020-05-04 20:24:23", "date_publish": "2017-08-01 08:33:47", "description": "Leading Venezuelan opposition figures Leopoldo Lopez and Antonio Ledezma have been taken from their homes, according to tweets from their families. \"They just took Leopoldo from the house....", "filename": "_4770b6bb1fee4a90bdd8fd7d42d7002d_1588623863.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4770b6bb1fee4a90bdd8fd7d42d7002d_1588623863.html", "title": "Venezuela opposition figures taken from homes", "title_page": "Venezuela opposition figures taken from homes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Leading Venezuelan opposition figures Leopoldo Lopez and Antonio Ledezma have been taken from their homes, according to tweets from their families.\n“They just took Leopoldo from the house. We do not know where he is or where he is being taken. Maduro is responsible if something happens to him,” Lopez’s wife Lilian Tintori tweeted early Tuesday morning, referring to Venezuelan President Nicolas Maduro, who has cracked down on opposition leaders as tensions are once again ratcheted in the Latin American nation.\nLopez, who was released from military prison to house arrest in July, was taken from his home shortly after midnight, his wife said on social media. Tintori also posted video that she says shows her husband being taken away.\nIt’s not confirmed who took him or where he was taken, but the video posted by Tintori shows Lopez being driven away in a car marked “SEBIN,” an abbreviation for the Venezuelan intelligence service.\nTwo weeks ago he called for Venezuelans to keep up protests in a 15-minute video posted online . At the time he called Maduro and his supporters a “very clear threat,” saying their goal is to undermine democracy and achieve the “absolute submission of the Venezuelan people.”\nLedezma, the former mayor of Caracas and a prominent opposition figure, was also taken from his home by SEBIN, according to tweets from his wife and children.\nHis daughter, Oriette Ledezma, denounced the move, saying in a video statement: “He was taken from his home today, early this morning. He was in pajamas. We don’t know where he was taken. A group of men came with their faces concealed and in camouflage and they took him. They have kidnapped him once again. We hold the regime responsible for his life and physical integrity.”\nCNN has reached out to the Ministry of Communications for comment.\nVocal opponents\nLopez’ detention, which began in early 2014 over accusations of inciting anti-government protests, had been a rallying cry for anti-regime demonstrators. He’s been under house arrest since early July.\nLopez has long been a vocal opponent of the socialists in power and was banned in 2008 from running for office on accusations of corruption.\nHe described the banning as political retribution. An international human rights court cleared him in 2011, but the Venezuelan Supreme Court upheld the ban.\nIn February 2014, at least three people were killed during an anti-government protest in the capital, and authorities blamed him for the violence. He turned himself in, and was sentenced in 2015 to nearly 14 years in prison.\nThe two men’s removal from their homes come after a controversial election Sunday establishing a new legislative body made up entirely of Maduro supporters.\nFundamental shift\nIn that vote, Maduro declared a victory in a vote that much of the world -- and many of his own citizens -- have called a sham and an assault on democracy.\nThe election could replace the current legislative body, the National Assembly, with a new, 545-member Constituent Assembly, made up entirely of his supporters.\nVenezuela’s attorney general lambasted the election.\n“This is the end of freedom of expression, and this freedom has been battered for some time now,” Attorney General Luisa Ortega said Monday.\nThe new, pro-Maduro assembly will have the power to rewrite Venezuela’s constitution.\n“We have a Constituent Assembly. I said, come hell or high water -- and hell and high water came -- and the Constituent Assembly arrived from the hand of the people, from its conscience,” Maduro said following the vote.\nThe voting followed weeks of violent street protests in which many people have been killed or injured.\nOn Sunday the death toll rose sharply with at least ten people -- including two teenagers -- killed at protests. A National Guard officer was also reported dead by the attorney general’s office. So far, 125 people have been killed in the ongoing unrest since early April.\nSanctions\nThe US Treasury Department slapped sanctions on Maduro following the vote, sending a clear signal of President Donald Trump’s administration’s opposition to his regime.\n“Yesterday’s illegitimate elections confirm that Maduro is a dictator who disregards the will of the Venezuelan people,” said Treasury Secretary Steven Mnuchin in a statement announcing the latest sanctions on the Latin American country.\nBeginning on Monday, all of the Venezuelan’s president’s assets that are subject to US jurisdiction will be frozen. All US citizens are also barred from dealing with him, according to the Treasury.\nCNN’s Flora Charner reported from Caracas, Euan McKirdy wrote from Hong Kong. CNN’s Sarah Faidell, Daniel Silva Fernandez, Julia Jones, Marilia Brocchetto, Natalie Gallón and Holly Yan, and CNN Money’s Donna Borak and Patrick Gillespie, contributed to this report.", "url": "https://apnews.com/4770b6bb1fee4a90bdd8fd7d42d7002d"}