{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:07:06", "date_modify": "2020-05-04 20:07:06", "date_publish": "2017-12-09 08:11:01", "description": "A Nov. 30 article by The Herald-Dispatch sports columnist Chuck Landon regarding attendance at Marshall University football games kicked off a wave of responses from readers. Landon reported that...", "filename": "_7791cb1551f945429836039337b95161_1588622826.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7791cb1551f945429836039337b95161_1588622826.html", "title": "Mix of reasons for MU football attendance drop", "title_page": "Mix of reasons for MU football attendance drop", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Nov. 30 article by The Herald-Dispatch sports columnist Chuck Landon regarding attendance at Marshall University football games kicked off a wave of responses from readers. Landon reported that attendance at this year’s Marshall home games was the worst in 21 years. Readers offered various reasons for the decline. Here are some of the responses:\n“I pay high prices for tickets all the time, but I feel like Marshall is too high,” wrote Clay Wilks.“If they have that many seats, let parents buy a ticket and bring a kid for free. I don’t know the stats, but seems like Marshall fans are attending the basketball games more than in the past.\n“The prices are very low when compared to other D1 schools,” said Guidon Grundlehner.“NCAA sports care only about money. Get used to it.”\n“I also think much more could be done at freshman orientation to unite students for game days,” commented Teresa Miller Adkins.“Bring back the thunderclap and have support by band. It often seems band director and mic announcer are at odds or at least on different pages. I think unmet expectation are the biggest reason for low attendance.”\n“Huntington needs to improve its image,” wrote Connie Scragg Cook.“It’s on the slippery slope of becoming an economically depressed city that is riddled in crime and poverty.”\n“My daughter is in the band and I have to admit it is quite expensive to go to a game for our family,” said Laura Leigh.“So unfortunately we don’t get to attend them all. And we would LOVE TO.”\n“Get back in the MAC,” commented Anthony Courts.“This a good conference, teams strong, driving distance and most all get bowls if eligible. This is where Marshall will find success!!”\n“Need to fire the head coach, the offensive coordinator and anyone else that thinks this program is OK,” wrote Mark Canterbury.\n“College football attendance has declined for seven consecutive years,” noted Ancil Ramey.“So, by comparison, Marshall football attendance has been relatively good over the same period. ... Saying’something has to change’ at Marshall ignores the realities of a new marketplace impacting all colleges and universities.\n“The reason attendance has declined can be laid firmly at the seat of the Big Green,” commented Doug Triplett.“Things began going downhill attendance-wise three years ago when the Big Green stole everyone’s seat. ... They broke up fans that had been together for years. They charged outrageous fees of $25,000 over five years to keep your original seat. Why would anyone want to go to the games when Marshall has made it clear that they don’t care about the fans?”\n“Make no mistake ... the number 1 reason, is Doc Holiday and his uninspiring, unimaginative style of football and his goofy, secretive personality,” said Wayne Voris\n“Like many others, we didn’t renew our tickets for the 2017 season after being season ticket-holders for over a decade,” said Gary Phillips.“There were a number of reasons for that. The price of our tickets has become unrealistic when I look at the product being put on the field. Honestly, the game day experience has never been quite the same since the ‘reseating’ debacle took place several years ago. Friends that we had gotten to know for years were either displaced or couldn’t afford to renew.”\n“Very simply, who wants to pay $2,600 for 4 chairbacks to watch an unexplosive offense struggle just to get first downs?” wrote J.B. Bown.“Do you know why basketball attendance is up? Hell it’s fun to watch fast-paced run and gun.”\n“Jeez, people. Lay off Doc!” said Michael Kyle.“Nearly .600 winning percentage, 4-0 in bowls. Most teams with Marshall’s resources are lucky to have a winning season one year out of five. Who better is coming to Huntington? We’re not ... Notre Dame!”", "url": "https://apnews.com/7791cb1551f945429836039337b95161"}