{"authors": ["Guest Columnist Cleveland.Com"], "date_download": "2020-05-04 20:09:29", "date_modify": "2020-05-04 20:09:29", "date_publish": "2017-11-12 17:30:00", "description": "Winter is one of best times for stargazing: Morgan Paskert Guest columnist Morgan Paskert is on staff at the Lake Erie Nature & Science Center. Winter is known for its cold...", "filename": "_e7e2d6c96520408587f72abe5811a3b8_1588622969.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e7e2d6c96520408587f72abe5811a3b8_1588622969.html", "title": "Winter is one of best times for stargazing: Morgan Paskert", "title_page": "Winter is one of best times for stargazing: Morgan Paskert", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Winter is one of best times for stargazing: Morgan Paskert\nGuest columnist Morgan Paskert is on staff at the Lake Erie Nature & Science Center.\nWinter is known for its cold temperatures and snowy skies, but did you know winter happens to be one of the best times of the year to go stargazing? When winter skies are clear, they are crystal clear and hold some of the brightest stars in the night sky.\nThe winter solstice on Dec. 21 will mark the shortest period of daylight and the longest night of the year, as the sun will set at 5:01 p.m. Katy Downing, Planetarium Specialist at Lake Erie Nature & Science Center, shares her favorite constellations to spot this winter.\nOrion the Hunter\nOrion the Hunter, one of the most popular constellations, happens to be one of the easiest to find in the winter night sky. Look south in search of three stars crossing diagonally through a large rectangle. The three stars create Orion’s Belt, while the four stars of the rectangle represent Orion’s shoulders and knees. On a clear night, grab your binoculars and look for the Orion Nebula (a formation of gases and dust) within the constellation.\nFun fact: The Orion Nebula is the middle “star” in Orion’s sword, which hangs off of Orion’s Belt.\nCanis Major, the Great Dog\nFollow the diagonal stars of Orion’s Belt southward and it will point you to one of the winter sky’s most prominent constellations, Canis Major. In Greek mythology, it is said that Canis Major, along with Canis Minor, are Orion’s hunting dogs. Canis Major is known for its many bright stars, including Sirius, the brightest star in the night sky. To find Sirius, use the diagonal stars of Orion’s Belt as a guide. The three stars point downward toward Sirius to the left. Sirius will shine bright like a tag on a dog’s collar.\nFun fact: If Sirius were placed next to the Earth’s sun, Sirius would outshine it 20 times over.\nTaurus the Bull\nLocated west of Orion, Taurus the Bull appears to face off with the Hunter in the winter night sky. The bull resembles the letter “V” and passes through the sky from November to March, but is at its most visible in January. The orange giant star Aldebaran, the brightest star in the constellation and the 14th brightest star in the night sky, represents the eye of the bull.\nFun Fact: Aldebaran is located about 65 light years away from the Sun.\nToo cold to go outside and stargaze this winter? Try the “gaze-and-dash” method by looking up before you hop into your car or walk inside your house. Even for just a moment, the bright winter stars are sure to amaze you.\nLake Erie Nature & Science Center provides free admission seven days a week to its indoor and outdoor exhibits, offers nature-based educational programming for all ages, operates one of two public access planetariums in Cuyahoga County as well as a wildlife rehabilitation program at no charge to the public.\nSave the date for the center’s educational family programs this winter including Holiday Night Tree Tradition (Dec. 1), SkyQuest (Dec. 13), Winter Solstice Celebration (Dec. 21) and extended daily programming throughout the holiday season. Register in advance at www.lensc.org.\nHave something to say about this topic? Use the comments to share your thoughts, and stay informed when readers reply to your comments by using the Notification Settings (in blue) just below.\nReaders are invited to submit Opinion page essays on topics of regional or general interest. Send your 500-word essay for consideration to Linda Kinsey at lkinsey@cleveland.com. Essays must also include a brief bio and headshot of the writer. Essays rebutting today’s topics are also welcome.", "url": "https://apnews.com/e7e2d6c96520408587f72abe5811a3b8"}