{"authors": ["John Cooper", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Steven Parfitt", "Alex Nunns", "Branko Marcetic", "Bhaskar Sunkara", "Max Shanly"], "date_download": "2020-05-04 19:56:06", "date_modify": "2020-05-04 19:56:06", "date_publish": "2017-11-14 00:00:00", "description": null, "filename": "2017_11_labour-party-jeremy-corbyn-blair-unions_1588622166.html", "image_url": "https://images.jacobinmag.com/2017/11/14115750/MSC_2014_Blair_Mueller_MSC2014.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_11_labour-party-jeremy-corbyn-blair-unions_1588622166.html", "title": "Where Next for the Labour Right?", "title_page": "Where Next for the Labour Right?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nLabour’s better-than-expected performance in the June general election has led to an outbreak of soul-searching in the Conservative Party: how can they broaden their appeal? What does modern Conservatism stand for? Where is Britain going? But, while the Tories are engaged in reflection, there is little evidence to suggest that similarly pertinent questions are being asked by Labour’s self-identified “moderates.” Few parliamentary figures embody the limitations of the moderates more than Chris Leslie. A shadow chancellor under Harriet Harman and interim party leader following Ed Miliband’s resignation in May 2015, Leslie is the quintessential apparatchik-careerist. Beginning his working life as Gordon Brown’s photocopier, Leslie was elected as the MP for Shipley in Yorkshire at the young age of twenty-four, becoming a junior minister five years later. His seat fell to the Tories in 2005, which led him to a stint working for the New Local Government Network — a Blairite think tank — before being imposed as the Prospective Parliamentary Candidate (PPC) for the safe seat of Nottingham East in 2010. As Jeremy Corbyn’s socialist politics gained ground, Leslie discovered a new political relevance providing quotes to the media. In a string of articles he branded the new leadership “implausible,” the new membership “starry-eyed hard left,” and the new anti-austerity political direction harmful to the working class. While Labour activists and MPs were euphoric over their unexpected gains in the June election, Leslie argued that the party had missed an “open goal” by not winning, even going so far as to call for Corbyn’s resignation — for which he was branded a “sad, lonely, bitter man” by left-wing MP Clive Lewis. Following the election, Leslie’s first major political intervention was at a fringe meeting of the Labour Party conference in Brighton. At the event, hosted by Labour First — an internal faction hostile to Corbyn — he stated that “Marxism has no place in the modern Labour Party,” a claim later tweeted to much amusement and derision. Leslie’s opportunist belligerence towards the leadership may glean column inches, but it does not paper over the ideological and institutional frailty of Labour’s right wing. Two years devoted to opposing policy and internal reforms which were popular among the membership could be rationalized by the inevitable electoral failure of Corbynism. But, faced with Corbyn’s success, it leaves little in its wake. Today, the Labour right is adrift. The scale of its predicament cannot be explained merely by the political blundering or subjective shortsightedness of individuals, but instead requires a deeper investigation into its history.\nWhat Was the Labour Right? Labour’s traditional right wing was a product of British trade unionism — specifically, the mediation between the party and the unions. Proudly and uniquely “labourist,” their analysis and strategy sought to structure a near-homogenous relationship between the political and industrial spheres. Crucial to this was the organization of electoral politics as a means to assert trade union influence in a Labour-administrated state. This manifested itself most clearly in party structures and policymaking. For decades, unions such as the Iron and Steel Trades Confederation (ISTC), the General and Municipal Workers’ Union (GMWU) and the Electrical, Electronic, Telecommunications and Plumbing Union (EETPU) could be relied upon not only to deliver votes at conference, but to act as a counterbalance to more militant voices within Labour’s membership and defend a backtracking party leadership. Writing in a 1973 Ruskin House publication, Bill Simpson, General Secretary of the Foundry Section of the Amalgamated Union of Engineering Workers and Party Chair, argued that trade union moderates were “an alliance of the cautious, the constitutionalists, the follow-my-leader, and the modern social democrat.” The first were molded by memories of the failed 1926 general strike and “a matter of fact conviction” that organized labor, rather than revolution, was the most important safeguard against capital. The second held a “hallowed respect of decisions and of those elected to lead.” They were, in essence, “disciplinarians who have little time for those who offend the code of the movement.” The final category were those who — contrary to the arguments of Ralph Miliband — believed that parliamentary socialism could be achieved. While they respected Marx (alongside Bernstein, Cole, Galbraith, and Keynes) they did “not accept his predictions.” Caution, moderation and corporatism found sympathy among many leading trade unionists in the twentieth century. As Trades Union Congress (TUC) General Secretary, Walter Citrine sat on no less than thirty public bodies and in 1946 suggested “we have passed from the era of propaganda to one of responsibility”. Ernest Bevin, General Secretary of the Transport and General Workers Union (T&G) went further, arguing that “the trade union movement has become an integral part of the state” underpinned by high industrial density and a new appreciation for the power of government to intervene in and shape the economy. For many on the Left, laborism became identified not with controlling sites of power, but sustaining them for the benefit of the labor aristocracy alone. Willie Thompson, a member of both the Communist Party and Marxism Today’s editorial board, argued that the Right’s position “embodied a fierce contradiction” and a struggle to “reconcile its reforming traditions with its deep veneration for the ancient authoritarian ones of the British state and culture.” “Manipulation not overthrow” of society’s structures was the laborist mantra, creating an ideological adherence to the market economy and “amicable relations with employers so far as possible.” On the political side, the laborist influence on the Labour Party is clear and manifest among the many right-wing trade unionists who moved into office. Chief among these is the aforementioned Ernest Bevin who, having used the 1935 Labour conference to “hammer” pacifist leader George Lansbury, would throw his support behind Clement Attlee to thwart Herbert Morrison’s ambitions. He subsequently served as minister for Labour and foreign secretary, playing a key role in the creation of NATO and Britain’s independent nuclear deterrent. There is a strong case to be made that were it not for death, alcoholism, and disability respectively, John Smith, George Brown, and Jack Ashley — leading figures on Labour’s trade union-oriented right — could well have become prime minister. Though perhaps most influential under Attlee and Gaitskell, the trade union right is best remembered in the popular imagination for its battles against Bennism in the eighties. As early as 1981, the right wing had taken a majority on Labour’s national executive committee (NEC) due to the organizational nous of figures such as John Golding, the postal union official and MP. In taking power, they were able to — in Golding’s words — offer the Left enough rope to draw up a disastrous manifesto for the 1983 general election while avoiding any blame for its political content. In the 1970s and ‘80s such skullduggery became a key feature of the Right’s modus operandi, with few demonstrating a zeal for the dark arts more than seasoned fixer John Spellar. According to Francis Beckett, Spellar “learned at the feet of veteran anti-communist Frank Chapple” and became a pivotal figure in the horse trading that typified TUC and Labour Party conferences. Known as “the scourge of the Left” Spellar maintained an office in EETPU and later Amalgamated Engineering and Electrical Union (AEEU) headquarters even after he had become an MP. With a foot in both camps, Spellar has been involved in a dizzying number of factions within the party, such as Labour First, Social Democratic Alliance, Campaign for Labour Victory, and Labour Solidarity, as well as wider movement organizations like the Mainstream Group, Members First, and the St Ermin’s Group. The Warley MP’s bombastic, hardline approach to the Left was not only highly divisive — the Bakers’ Union’s Terry O’Neil branded him “very much to the right of Senator McCarthy” — but marked him as perhaps the last heir to a waning tradition. While an administrative model of trade unionism could yield success in a corporatist economy, its influence in an increasingly open market was far smaller. Likewise, the practice of backroom fixing, so beloved of Spellar and Golding, is simply not possible in an era of enhanced transparency.\nThe Right’s Demise In 1986, upwards of 2.5 million conference votes could regularly be delivered to the party’s right while the soft left — which by this time had long since broken with the Bennites — was also well represented by the T&G’s 1.3 million votes and National Union of Public Employees (NUPE)’s 600,000 votes. The Left, however, was marginalized. Indeed, in 1988 the unions delivered 99 percent of their votes, over 5.5 million in total, to Neil Kinnock following a leadership challenge by Tony Benn. By comparison, today Usdaw and Community are the only Labour affiliates that could be described as on the party’s right. Meanwhile, Aslef, BFAWU, CWU, FBU, TSSA, and Unite are all on the Left, albeit with degrees of variance. In part this comes down to changes in the industrial and political landscapes. Since 1979, trade union membership has more than halved and moderate unions have been forced to amalgamate, diluting their unique character and culture. Likewise, the end of the Cold War significantly weakened anti-communist trade unionism. Throughout the postwar period, the Communist Party of Great Britain played a key role in British unions. Its conflicts with broad left and moderate groupings had an impact across the movement. With the fall of the Berlin Wall, such sharp political divisions have gradually diminished. So, too, has the folk memory of the general strike, increasingly replaced by a more strident and openly socialist approach to trade unionism. But perhaps the most important factor in undermining the trade union right was the party management and industrial policies pursued by Tony Blair. Under Blair’s leadership a new right was born and actively sought to limit its association with old Labour, not least the trade union movement. It produced a generation of sharp-suited special advisors for whom trading favors with union officers was an alien concept. Labour was the party of “Cool Britannia” and trade unions were decidedly off-brand. The suspicion was mutual. Blair’s decision to replace Clause IV caused concern among activists, as did his ambiguous suggestion that New Labour would “be respectful of the unions’ part in our past (but) have relations with them that are relevant for today.” Indeed, the modernizers went as far as “proposing that conference might be reformed to exclude trade unions altogether.” Historically loyal to the party leader, general secretaries such as the GMB’s John Edmonds became vocal critics of Labour’s direction, particularly with regard to PFI, public sector reform, and privatization. While Alan Tuffin and Toby Young — of the Union of Communication Workers and National Communications Union, respectively — were voices of moderation in the 1980s and early 1990s, the amalgamated Communication Workers Union has subsequently swung decisively to the left. Current general secretary Dave Ward, elected to his union’s executive in 2000, is one of Jeremy Corbyn’s leading supporters and cut his industrial teeth in disputes not only with the Tories, but also with the Blair government. On Blair’s watch Royal Mail was fattened for privatization with competition encouraged and pay and conditions undermined. In 2007 Ward went as far as resigning from Labour’s NEC, citing “a growing conflict of interests between my role in representing and defending the views of CWU members.” While New Labour traded on the idea of a “progressive workplace consensus,” in reality, little effort was made to incorporate the demands of either trade union officials or the rank-and-file membership. As concern for organized labor diminished, the party’s politics swung decisively towards market liberalism, leaving its social-democratic corporatism behind. The clearest embodiment of the Right’s decline was Derek Simpson’s defeat of “Tony Blair’s favorite trade unionist” Ken Jackson, in the 2002 Amicus general secretary election. A former communist, Simpson argued that the partnership model encouraged by his predecessor was “smoke and mirrors” and that opposition to the Blair project was required not only from Amicus members, but across the labor movement. His victory helped facilitate Amicus’s merger with the left-wing GPMU, weakening the union’s remaining right-wingers. More importantly, it set the tone for the union’s 2007 amalgamation with the T&G to create Unite: Britain’s most politically influential union, and the only one with an influence in every area of the economy. In the subsequence decade, Unite has played perhaps the most central role in moving Labour to the left, a process facilitated in large part by United Left (UL), the largest rank-and-file body in the union movement. Established in the wake of Unite’s foundation, UL members currently hold 54 percent of the seats on the union’s executive. Its only viable opposition comes from the industrially focused and political independent Unite Now and Unite Alliance groupings. In turn, it has a strong influence on the union’s internal culture, policy, and relationship with Labour. With some regional exceptions, right-wing opposition — traditional or otherwise — in Unite is thin on the ground. This is a remarkable turnaround, given the recent history of its successors, and is a lesson of contemporary relevance. Indeed, when Gerard Coyne, assisted by John Spellar, attempted to win leadership of the union this year he did so without an organized, member-led campaign. His failure demonstrated the degree to which right-wing trade unionism has waned as a force.", "url": "https://www.jacobinmag.com/2017/11/labour-party-jeremy-corbyn-blair-unions"}