{"authors": ["Jeff Hunt Jhunt Dailydem.Com"], "date_download": "2020-05-04 21:06:19", "date_modify": "2020-05-04 21:06:19", "date_publish": "2017-08-14 13:00:00", "description": "The numbers are in and it appears as though fewer people are using the Fort Madison Municipal Swimming Pool than usual. According to Management Analyst John Luna, there has been a downward...", "filename": "_b1a92b82a97b4483855c1386418416e5_1588626379.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b1a92b82a97b4483855c1386418416e5_1588626379.html", "title": "Luna: Pool usage is down", "title_page": "Luna: Pool usage is down", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The numbers are in and it appears as though fewer people are using the Fort Madison Municipal Swimming Pool than usual.\nAccording to Management Analyst John Luna, there has been a downward trend in the past several years.\n“We are down by about 800 users,” Luna said. “A lot of it can be attributed to the cool weather we have had. People don’t show up at the pool when it’s cold.”\nIn 2016, the pool had 6,936 users. This year, that number fell to 6,125. Luna said numbers were higher in 2015, but due to a computer virus he could not tell by how much.\nAccording to Luna, this is not just happening at Fort Madison and not for just the past two years.\n“A lot of pools are experiencing this,” Luna said. “Honestly, I don’t know where the kids are going or what they are doing.”\nLuna said a lot of families have their own pools now.\n“You wouldn’t believe the number of people who are getting permits for fences to put around their pools, whether it be below ground or above ground pools.”\nLuna next summer could be a different story for the municipal pool.\n“It could be a hot summer and that would bring a lot of people here,” Luna said. “You just can’t predict it.”\nEarlier in the year there was talk between city officials and representatives from the Fort Madison YMCA about turning over management of the municipal pool to the YMCA since the YMCA’s specialty is recreation. However, before the season began, the YMCA board decided to hold off for a year so as to not rush things and see if it would be financially feasible.", "url": "https://apnews.com/b1a92b82a97b4483855c1386418416e5"}