{"authors": [], "date_download": "2020-05-04 20:06:08", "date_modify": "2020-05-04 20:06:08", "date_publish": "2017-06-01 09:00:00", "description": "Charlie Puth has recorded a song for Liam Payne's solo album. The 'Attention' hitmaker has revealed he and the One Direction heartthrob have been in the studio together and that when they...", "filename": "_03058bd7db2c4f69b52e29b644dd04a5_1588622768.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_03058bd7db2c4f69b52e29b644dd04a5_1588622768.html", "title": "Charlie Puth records song for Liam Payne's album", "title_page": "Charlie Puth records song for Liam Payne's album", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Charlie Puth has recorded a song for Liam Payne’s solo album.\nThe ‘Attention’ hitmaker has revealed he and the One Direction heartthrob have been in the studio together and that when they aren’t together, the 23-year-old hunk has a habit of video calling him when he’s driving.\nThe 25-year-old singer spilled to the Daily Star newspaper: “He has a bad habit of FaceTiming me when I drive.”\nSo far, Liam has dropped his debut solo single ‘Strip That Down’, which features Quavo from hip-hop outfit Migos and Ed Sheeran.\nMeanwhile, Liam recently confessed he didn’t plan on having a solo career.\nHe just wanted to “go into songwriting” when the boy band announced their hiatus in 2015, but quickly realised he would be “ridiculously stupid” to miss out on the chance to make music on his own terms.\nHe said: “To be honest with you, I wasn’t going to do a solo venture. I was just going to go into songwriting and carry on and do that. But then I was like, ‘You’ve been trying to do this since you were 14 years old. You would be ridiculously stupid to turn down the option to have a deal.’ Coming out of the band, we had some pretty good opportunities around us. I had to do something.”\nDespite not wanting to go solo at first, Liam is pleased with the result of his first single, which he dubbed as “edgy” and “different” to anything he would have done during his time with the ‘History’ hitmakers.\nHe said previously: “If you’ve listened to a demo too many times, one thing can change your whole perception of a song. I left it alone for a while, and then when it finally got around to this place where it is right now, I was like ... right, then. I believed!\n“It was such an edgy, different song for me to do, with [that One Direction lyric] in it as well, and the way that was written. It was quite an experience.”", "url": "https://apnews.com/03058bd7db2c4f69b52e29b644dd04a5"}