{"authors": ["Joe Allen", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Bryan D. Palmer"], "date_download": "2020-05-04 20:00:17", "date_modify": "2020-05-04 20:00:17", "date_publish": "2017-05-25 00:00:00", "description": null, "filename": "2017_05_jerry-zero-teamsters-hoffa-mob-reform_1588622417.html", "image_url": "https://images.jacobinmag.com/2017/05/25102835/zero.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_05_jerry-zero-teamsters-hoffa-mob-reform_1588622417.html", "title": "He Fought for the Union", "title_page": "He Fought for the Union", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nI recently learned that Jerry Zero, the former secretary-treasurer of Teamsters Local 705, of which I was a member, died on April 4. His death was announced at the regular local membership meeting on April 23 in Chicago. Jerry was seventy-three three years old and had been in ill health for a long time. He was diagnosed with diabetes in the early 2000s. His wife Linda preceded him in death. Jerry spent most of his time in retirement in Montana. A few years ago, I got back in touch with Jerry while writing my book The Package King: A Rank and File History of United Parcel Service . Jerry helped me with some of background events of the 1997 United Parcel Service (UPS) strike in Chicago — things that only he and a handful of others would have known about. His death reminded me of the good times that I had as a member of Teamsters 705 and Jerry’s importance in the era when union reform forces had an impact on the Teamsters — but also the disappointment and anger I felt when he switched to supporting James P. Hoffa Jr after decades as a reformer.\n“Destroy Those Guys” Jerry, along with a handful of former leaders of Local 705 like John McCormick, was part of a generation of Teamster activists in Chicago who challenged the mobbed-up old-guard leadership when that could get you killed or seriously injured. Before Ron Carey — the Teamsters’ first rank-and-file-elected reform leader, placed Teamsters 705 in trusteeship in 1993, the local was run by such notorious figures as Louis Peick. Veteran Chicago labor reporter David Moberg wrote a profile of Jerry Zero and John McCormick nearly two decades ago that captured the era vividly: Louis Peick, then the local’s top man, was a politically connected powerhouse in the international union who ran his domain with a steel fist. Union agents and off-duty cops broke up meetings that McCormick and other reformers called, and sometimes beat up dissidents, vandalized their cars, even threatened their families. At regular union meetings, independent-minded members who tried to speak out were at times confronted by bullies brandishing chains or beaten up. Peick died in 1986, but his successor Dan Ligurotis was even worse, if you can imagine that. In 1991, Ligurotis famously shot and killed his son in the basement of Teamster City, the headquarters of many Teamster locals in Chicago. However, it was Ligurotis’s insatiable greed and his appointment of business agents who had been convicted of extortion and arson that led to the trusteeship of the Local 705. Jerry had supported Ron Carey’s insurgent reform campaign for Teamsters general president in 1991. Carey’s election was a bombshell that shook the labor establishment and upended the cozy relationship between the old guard and major Teamsters employers, especially United Parcel Service — then as now, the largest employer of Teamsters in Local 705. The Chicago Teamsters remained a bastion of the old guard after Carey’s election until the trusteeship in 1993. Carey initially appointed his former campaign manager Eddie Burke as a trustee for Local 705, with Jerry and McCormick. Burke, however, was unprepared to deal with the complexities of such a large local union, with over fifteen thousand members and hundreds of local contracts. A year later, in July 1994, Carey appointed Jerry as trustee in Local 705. Jerry and McCormick moved quickly to rid the local of old-guard luxuries. Moberg listed their first steps, including: Selling off the local’s eight Lincoln Town Cars, cutting salaries (Zero’s was cut from $115,000 to $85,000, and all officers’ future pay hikes were tied to members’ contractual increases), eliminating deadwood staff positions (one high-paid business agent had only one member to keep track of), dropping lavish parties (the Christmas blowout for staff and employers — no rank-and-file members had been invited — had cost more than $30,000 in 1992), and cutting outside legal fees by half. These decisions mirrored many of the same policies that Carey implemented at Teamsters headquarters in Washington, DC. Jerry’s biggest impact was inside the big workplaces, especially UPS. According to Moberg, “[Zero] and other leaders also tripled the number of union stewards and, for the first time at UPS, appointed stewards for the part-time workers; they also appointed many more women and minorities in all leadership positions.” They, however, faced a determined opposition from the old guard, led by former Ligurotis business agent Dane Passo. Passo declared war on the trusteeship, according to Bob Bruno, author of Reforming the Chicago Teamsters: The Story of Local 705 , who extensively interviewed him. Passo told Bruno that from the moment Burke arrived at Local 705, he was consumed with one goal: “Destroy these guys, no matter what it takes.” Passo eventually was banned from union meetings.\nA New Teamsters In 1995, the trusteeship came to an end after a local union election where four slates contested for office. Zero and McCormick’s “Reform Pride Movement” slate won the election, but later lost elections in the local for delegates to the 1996 Teamster convention. A slate led by Dane Passo won and ensured that a slight majority of the convention delegates supported Carey’s opponent James P. Hoffa. Hoffa, the son of the infamous Teamster leader Jimmy Hoffa, was derided by his opponents as “Hoffa Junior.” His slate was made up of a rogue’s gallery of the most backward officials in the union. Hoffa ran a vicious campaign against Carey. But Carey won reelection by a small margin — just 2 percent of the vote — in no small part because of the votes from Local 705. Unlike Chicago Teamsters leaders of the past, Jerry sat on the national UPS negotiating committee and pledged to strike in support of the union’s demands. Carey called a national strike against UPS in August 1997 that ended with biggest labor victory in a generation.\nChicago was at the center of the strike with strikers shutting down many of the city’s iconic buildings. Despite pressure from then-Mayor Richard M. Daley, Jerry kept up the picket lines at the popular McCormick Place Convention Center. Jerry called a total of three strikes against UPS — more than any other local leader in the Teamsters. He won six hundred full-time jobs for UPS part-time workers during the 1997 strike. He negotiated another five hundred full-time jobs during the 2002 UPS contract negotiations. In both contracts, he won the largest number of full-time jobs negotiated by any of the leaders of Local 705 since then. He also reconnected the Teamsters with the broader labor movement in Chicago. This was no small feat given the insular, violent, and corrupt legacy of the Chicago Teamsters. Local 705, for example, became an active supporter of Jobs with Justice. While Hoffa Junior was supporting Bush’s drive towards war with Iraq, Jerry hosted the founding the convention of US Labor Against the War. Because of Jerry, the Teamsters no longer seemed like a forbidden kingdom to be avoided at all cost.", "url": "https://www.jacobinmag.com/2017/05/jerry-zero-teamsters-hoffa-mob-reform"}