{"authors": ["Roy N. Kent"], "date_download": "2020-05-04 20:22:36", "date_modify": "2020-05-04 20:22:36", "date_publish": "2017-02-22 13:51:00", "description": "As high school seniors in Wurzburg, Germany, we took a field trip to the border of two Germanys. Prior to going to the wall, we were told to not make any sudden movements as East German...", "filename": "_0f0ff916fbb34d5898aecaea2c14e5c6_1588623756.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0f0ff916fbb34d5898aecaea2c14e5c6_1588623756.html", "title": "Walls don't stop people from seeking better lives", "title_page": "ROY KENT: Walls don't stop people from seeking better lives", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As high school seniors in Wurzburg, Germany, we took a field trip to the border of two Germanys.\nPrior to going to the wall, we were told to not make any sudden movements as East German guards had itchy trigger fingers. We were high school seniors. We moved. We were not shot.\nThat border wall - more of a very tall fence with guard towers every so often - was meant to keep people in the country. The East German government kept its populace from getting to the west. Eventually, that wall came down and Germany was reunited as one country.\nPrior to the fall of the border, people risked everything to move from east to west. Many died. It was the price to pay for a better life.\nNow the United States is looking at building a wall separating the country from Mexico. There is a push to keep illegal immigration into the U.S. from the neighboring country. The wall - more of a very long fence in most places - separating the U.S. and Mexico will not work.\nThere is already extensive fencing along the border, especially in major cities, that is reinforced with armed agents. It doesn’t work.\nIn El Paso, the reinforced fence is known locally as the “Tortilla Curtain.” It may have had a basis as an old “Iron Curtain” reference from the Cold War but, at least in El Paso, is was a big joke. It had more holes in it than a moth-eaten sweater.\nIn San Diego, Calif., there is a heavily guarded border. Tunnels are routinely found linking Tijuana to the California city to the north.\nThe point is, people who want to get in to the United States will find a way. (There are a couple bodies of water - namely the Pacific Ocean and the Gulf of Mexico - that have a lot of area where people could seek alternate routes in the U.S. from Mexico.)\nPeople do and will always find ways over, under, through and around a wall.\nThe best way to keep illegal immigrants from making their way into the United States is to make life better for them at home.\nThe Secure Fence Act of 2006 sought to build 700 miles of barriers between the U.S. and Mexico. There were more vehicle barriers, checkpoints and lighting installed as well. Congress approved spending $1.2 billion to pay for the fence.\nAgain, this didn’t work.\nEven then-Gov. Rick Perry opposed the fence by saying the border should be opened more. He called for technology to support legal and safe migration.\nThe entire U.S.-Mexico border is roughly 2,000 miles. Building a wall does not make economic sense. There are options other than building a wall, especially is remote areas of the border where there is virtually nothing other than wilderness. Check out a map of Texas and look up Langtry. Look what is on the Mexican side of the border. Neither side is very hospitable to immigrants. It does not need a reinforced border wall.\nIn Houston, illegal immigration is a minor problem. It does exist. And if you believe all illegal immigrants in the area are from Mexico, you would be surprised. Illegal immigrants come from all over the world. Most are looking for a better life.\nWhat will help alleviate the whole problem is education and lessons in good economics. If their lives are made better on their side of the border, our side won’t look as inviting.", "url": "https://apnews.com/0f0ff916fbb34d5898aecaea2c14e5c6"}