{"authors": ["Michael Lev Arizona Daily Star"], "date_download": "2020-05-04 20:08:59", "date_modify": "2020-05-04 20:08:59", "date_publish": "2017-10-19 20:41:00", "description": "Arizona’s injury report for the Cal game includes some possible good news for the Wildcats. Defensive tackle Luca Bruno is listed as probable for Saturday’s game in Berkeley (5 p.m., Pac-12...", "filename": "_602790fbc99c4d1da73af58563d04e52_1588622939.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_602790fbc99c4d1da73af58563d04e52_1588622939.html", "title": "Arizona Wildcats DT Luca Bruno (concussion) probable to play at Cal", "title_page": "Arizona Wildcats DT Luca Bruno (concussion) probable to play at Cal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Arizona’s injury report for the Cal game includes some possible good news for the Wildcats.\nDefensive tackle Luca Bruno is listed as probable for Saturday’s game in Berkeley (5 p.m., Pac-12 Networks). Bruno sat out last week against UCLA because of a concussion.\nIf Bruno can play, that would help Arizona offset the absence of fellow DT Parker Zellers. Zellers must sit out the first half against Cal after being ejected for targeting in the second half of the UCLA game.\nFreshman safety Scottie Young Jr. is listed as doubtful because of a knee injury. The expectation is that fellow freshman Troy Young (no relation) will move into the starting lineup at the “Bandit” position, where he has been backing up Demetrius Flannigan-Fowles. Flannigan-Fowles would slide to free safety in that scenario.\nSenior Kwesi Mashack played well in place of Scottie Young last week and gives Arizona another option. Young, who hurt his knee in the first half against the Bruins, ranks third on the team in tackles (32) and tied for second in stops for losses (3.0).\nFreshman defensive end/linebacker Jalen Harris remains out indefinitely because of a shoulder injury. It’s possible he could apply for a medical redshirt if he misses the remainder of the season.\nPromising news and expected news in Arizona’s injury report for the Cal game: pic.twitter.com/XIGbBts9HO — Michael Lev (@MichaelJLev) October 19, 2017", "url": "https://apnews.com/602790fbc99c4d1da73af58563d04e52"}