{"authors": ["Mike Scherting"], "date_download": "2020-05-04 20:23:12", "date_modify": "2020-05-04 20:23:12", "date_publish": "2017-02-02 00:00:00", "description": "Emma Dudley began planning her funeral the summer following her freshman year at Colstrip High School. A series of serious medical mysteries in the form of stroke-like symptoms, paralysis...", "filename": "_273d1ab436f2471cbc614f3538f8febb_1588623792.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_273d1ab436f2471cbc614f3538f8febb_1588623792.html", "title": "Colstrip's Emma Dudley back on track despite living with mysterious, incurable disorder", "title_page": "Colstrip's Emma Dudley back on track despite living with mysterious, incurable disorder", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Emma Dudley began planning her funeral the summer following her freshman year at Colstrip High School.\nA series of serious medical mysteries in the form of stroke-like symptoms, paralysis that required her to be in a wheelchair for an extended period, and blackouts over the previous months had left the 16-year-old and her family feeling helpless and clueless.\nDudley had been checked out several times by specialists in Billings and at Mayo Clinic in Rochester, Minn. Another blackout instance, one lasting nearly two hours, well beyond her usual two- or three-minute variety, had led the family to try another specialist in Billings.\nOnce again, no answers were found, and on this trip Emma got the sense the doctor wasn’t totally believing her story.\nDudley prides herself in always looking at the positive, in seeing the sunny side of everything. But this was the final straw. She was tired of the blackouts, tired of all the tests, and tired of the mystery that was disrupting her and her family’s lives. And now, to top it off, Emma felt like she wasn’t being taken seriously.\n“After that, I was just over it,” she said. “I’m like, ‘I’m just going to die.’ I was super, super frustrated. It just kind of felt that no one believed me and that it was always going to be like that. That’s just finally when it hit my emotional side, like I wasn’t being positive about it. I was like, this is done for.”\nThat’s when Dudley began preparations for what she thought to be inevitable.\nShe chose her funeral music. She decided who was going to carry her casket. And she wrote good-bye letters to friends and family.\nOne day, her mother, Cherish, walked into her eldest daughter’s room. Emma was busily organizing the letters she had written.\n“What are those?” Cherish inquired.\n“When I die,” Emma answered, “these need to be handed out.”\nThat was it for Cherish.\n“We have to do something,” she told her husband, Craig. “We have to have a definitive answer. Even if we don’t know how to fix it, we have to know what it is.”\nx x x\nEven if Emma doesn’t remember the exact date, Cherish does: Jan. 27, 2014.\nEmma was watching a movie in freshman biology class. Unbeknownst to her, she had begun drooling and the left side of her face was drooping. Teacher Bernie Smith was the first to notice, and it was feared Emma might be experiencing a stroke. She was taken to Forsyth for observation, and though by then her left arm wasn’t working, tests revealed nothing. She was sent home to Colstrip.\nBy the next day the entire left side of Emma’s body shut down, so the family took her to Billings.\nAt one point, she says, a doctor started pinching her left toes with his fingers. Then he proceeded to prick her foot with a needle. She couldn’t feel a thing.\n“My dad, he started to get flustered and angry and I’m like, what the heck is going on,” Emma said. “I look down at my foot and there’s just blood everywhere.”\nSpecialists were stumped. Emma heard for the first time suggestions that she might be faking it.\nThus began nearly a year-long quest for answers.\nx x x\nThe Mayo Clinic defines conversion disorder as a “functional neurological symptom disorder in which you show psychological stress in physical ways.”\nEmma’s symptoms revealed themselves in many ways. Her episodes evolved from the stroke-like symptoms to her passing out. For a while, Cherish says, she was at Colstrip High School at least once daily, sitting with Emma until she woke up and could go back to class.\nMost of those times she would be out for short instances; sometimes, though, the minutes grew to hours. The longest she was out was 13 hours, Emma says. And there were times when Emma came to she would revert to being a 5-year-old girl and stay that way until she passed out again and returned as her usual self.\nLife continued on this way until the winter of Emma’s sophomore year. A neurologist in Billings, in conjunction with Mayo Clinic, determined Emma was suffering from conversion disorder. Mayo Clinic has a rehabilitation program, but when Emma was accepted into it, she wasn’t sure what to do. She loves basketball and didn’t want to leave her teammates.\nCoach Roxie Wilson looked at her guard, who was now down to under 90 pounds, and said, “You need to go.”\nx x x\nCherish describes Emma as a goal-oriented, Type A personality who likes to control her environment. She’s eager to please and has a hard time telling people ‘no.’\nEmma had a 4.0 grade-point average before the conversion disorder appeared and she remains a National Honor Society member. She is the student council secretary, active in 4-H and interns as an accounting assistant at the Colstrip power plant. She also helps administer the Team Sydney Facebook page to post updates and messages of hope for classmate Sydney Hedges, who was diagnosed with brain cancer in 2011.\nTo become a better dribbler, she bounces a basketball on a rail on the Tongue River Railroad line behind her house. She set a personal record in December, she says, dribbling for a mile before the ball went bounding away.\n“She really couldn’t be more set up to have something like this,” Cherish says of Emma’s disorder. “I don’t think she has any more in her life to be anxious about, her anxiety just comes out in this way.\n“Everybody has a thing. It’s just that her thing is very visible. I mean, there are kids who deal with severe anxiety every day, but you don’t see it.”\nBoth mother and daughter point out that Emma’s anxieties aren’t severe. She has been on Colstrip’s varsity volleyball and basketball teams since she was a freshman, and her episodes never coincide with a ‘big game.’\nThose involved with Emma say she’s well-liked and she has friends of all sorts.\nEmma herself says she’s not bothered by the heavy things in life. But a messy locker, where papers might be out of place? That was different.\n“Things that are not normally stressful for people would stress me to extreme levels,” she said. “And then things that would stress people to extreme levels, I’m like, ‘meh.’\n“I’d get stressed out by little, little things. Like if things weren’t perfectly organized, I’d freak out. Just things getting out of place, I just wouldn’t be able to practically function. That’s when they figured out that my body would deal with that by just shutting certain things off. And then it was stressing even more, so it just shut off all the way, so I would pass out.”\nx x x\nThrough the Mayo Clinic’s program, which includes deep breathing for at least 10 minutes every morning and every night, Emma has learned to live with her disorder and mostly manage it. She isn’t ‘cured’ and never will be.\nShe still has episodes. If she feels one coming on at school, she will leave class and go to the school’s library, for example. She will turn on her phone’s playlist of soothing sounds and remain there until she is safe.\nEmma says she passes out about once every three months now. Sometimes she can wake herself up.\n“My room is bad now, it’s just totally destroyed, and you know what, it’s totally OK,” Emma says with a laugh.\nIt wasn’t easy to get to this point. Imagine the trust parents must have in their child’s ability to make good choices in friends, knowing that at some point those friends must be counted on when your child is at her most vulnerable.\n“We’ve been very blessed with the friends that she has, some very responsible and kind friends,” Cherish says, adding the Colstrip school system and community into that group. “That’s been a huge help, especially for her mother.”\nOf course, Cherish says, doctors advised Emma to give up sports and other extracurricular activities. But that wasn’t an option.\n“When Emma decides on something, she really does decide,” Cherish says. “From a parent perspective, strong-willed kids are very difficult. … But on the same note those are the things that have enabled her to make the decision that she is going to stick to this. You either commit to the plan to get better, or you don’t.\n“You hold your breath a little bit and you pray a lot. That has been her biggest asset is that she’s willing to do the hard things.”\nEmma has refused to withdraw and both she and her mother feel she is a better person because of her disorder. A senior on Colstrip’s unbeaten and No. 2-ranked basketball team, Emma wants to play college basketball and go into nursing. She says she isn’t freaked out about the inevitably of leaving home and venturing out on her own, where people initially won’t be fully aware of her condition.\nBecause she lives life outside the norm, Emma feels she’s now better-suited to have empathy for others.\n“I can help a lot of people just by being there. I understand what it’s like to go through hard times. Through it all, to everyone around me, I was very upbeat,” Emma says. “I never really let people see that frustration, that anger that I had toward this. I was like, ‘You know what? This is going to work out in the end.’ That’s the part other people remember.\n“Now, to this day, middle-schoolers are texting me, ‘I need help with this, can you help me with this hard time?’ I think this has really benefited me to help others.”", "url": "https://apnews.com/273d1ab436f2471cbc614f3538f8febb"}