{"authors": ["Matt Hudson"], "date_download": "2020-05-04 20:20:50", "date_modify": "2020-05-04 20:20:50", "date_publish": "2017-03-23 00:15:00", "description": "Testimony Wednesday in a legislative committee focused on whether funding for the Laurel water intake project should come from the governor's disaster fund. The House Appropriations...", "filename": "_369f3406c1034d3e91dc880dad3c9da7_1588623650.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_369f3406c1034d3e91dc880dad3c9da7_1588623650.html", "title": "'We just can't deny the fact that it's a disaster'", "title_page": "Bill sponsor on Laurel water intake: 'We just can't deny the fact that it's a disaster'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Testimony Wednesday in a legislative committee focused on whether funding for the Laurel water intake project should come from the governor’s disaster fund.\nThe House Appropriations Committee of the Montana Legislature held its first hearing for HB586, a bill that would appropriate at least $2.5 million toward the intake project. Its main sponsor is Rep. Dennis Lenz, a Republican representing the Laurel area.\nThe intake serves Laurel residents and the Cenex Harvest States refinery with water. After a 2011 flood shifted the riverbed at Laurel, low water levels affected the current intake’s ability to draw from the Yellowstone.\n“It was a major movement of that river,” Lenz said at the hearing. “And we just can’t deny the fact that it’s a disaster.”\nThe bill would let Laurel recover its own funds that have been spent or committed to the project in lieu of disaster aid from Gov. Steve Bullock’s office, which has declined to use that fund for the intake. That left the town to pick up the tab.\nConstruction of the new intake, which will draw water from three miles upstream and pipe it to town, started last fall . The city exhausted its own reserve fund and took a low-interest loan from the state to cover the cost share.\nLaurel Chief Administrative Officer Heidi Jensen said Wednesday that the town had previously raised water rates for other water system projects, but those were pushed back after the flood affected the intake. The city is nearly tapped out.\n“Our bonding capacity has been met, which limits the city’s ability to plan for any other projects,” Jensen said.\nMoney in the bill would come from the disaster fund in order to match $7.5 million in emergency assistance from the Federal Emergency Management Agency. That federal money requires a local match of the remaining 25 percent to come from a local government jurisdiction — usually the state.\nSince the project plans were finalized in late 2014, Bullock’s office has declined to release money from the disaster fund to pay the 25 percent match, creating a dispute between Laurel officials and the governor’s office.\nOn Wednesday, committee members questioned Andrew Huff, Bullock’s legal counsel, who spoke in opposition to the bill.\n“The governor’s office has always felt that this is more in the nature of a water infrastructure project than a disaster,” Huff said. “So that has been a main factor.”\nHuff argued that laws require that the FEMA emergency funds be matched but don’t specify which government agency pays.\nHe also disagreed with Jensen about whether the state notified Laurel officials prior to finalizing project plans that money wouldn’t be provided from the disaster fund. Huff conceded that no documentation was available and only phone calls were made to explain the state’s position.\nSome committee members wondered why the state wouldn’t deem the intake an emergency job when FEMA approved funds for that reason. Then-Gov. Brian Schweitzer declared a disaster situation following the 2011 flood and the office released state aid for other projects.\n“It seems that the state has worked along for quite some time thinking it was an emergency,” said Rep. Carl Glimm, R-Kila. “It kind of just seems like they don’t want to spend out of their kiddie pool because it was outdated previously.”\nRep. Nancy Ballance, R-Hamilton, who chairs the Appropriations Committee, spoke in favor of the bill, as did Republican Rep. Vince Ricci of Laurel. Montana League of Cities and Towns Executive Director Tim Burton also backed the measure.\nWhile Lenz’s bill currently calls for $2.5 million, he said it could be amended to $3 million to cover the full portion committed by Laurel. That includes $1.3 million of its case reserves and the $1.7 million state revolving loan.\nThe bill would also reduce the amount of money in the governor’s $16 million disaster fund by about $2.5 million for the biennium.\nThe intake that’s set to be replaced was constructed in 2003 along the Highway 212 bridge. Jensen said the city is still paying on that $3 million project.", "url": "https://apnews.com/369f3406c1034d3e91dc880dad3c9da7"}