{"authors": ["Nick Underhill", "Nunderhill Theadvocate.Com"], "date_download": "2020-05-04 20:10:52", "date_modify": "2020-05-04 20:10:52", "date_publish": "2017-12-29 21:34:00", "description": "David Onyemata’s growth was expected. Last year was the first time he had ever played football with American rules. So, the question wasn’t if he was going to get better. It was a question...", "filename": "_88e9a7c12ac84b9f8f23c3706f75c90b_1588623052.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_88e9a7c12ac84b9f8f23c3706f75c90b_1588623052.html", "title": "Saints notes: David Onyemata is making strides during his second season", "title_page": "Saints notes: David Onyemata is making strides during his second season", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "David Onyemata’s growth was expected.\nLast year was the first time he had ever played football with American rules. So, the question wasn’t if he was going to get better. It was a question of how much he was going to improve.\n“His second year playing 11-man football, clearly there’s going to be jumps,” defensive end Cam Jordan said. “He’s been making strides. The last couple games he’s really turned on his pass-rushing prowess that I don’t know if I was aware of. I knew he had the potential to do it, but he’s clearly trying to go beyond his expectations.”\nOnyemata has started to show more of what he’s capable of doing this season. He was more of a curiosity and the representation of potential last season, but the second-year player has racked up 20 pressures this season to go with two sacks. And as Jordan said, a lot of that has come recently, as Onyemata has six pressures over the last three weeks.\nIt feels a lot different for Onyemata this season. The biggest difference for him is feeling comfortable with what he’s doing. He also says that understanding what he’s doing and picking up on some of the finer intricacies of the game has made a big difference this season.\n“Understanding the game from the point of view, you get security from the pass and the run,” Onyemata said. “Trying to tell presnap reads and things like that have improved greatly for me.”\nOnyemata says that the process for him is to keep building on what he’s doing and making corrections. He also gives credit to defensive line coach Ryan Nielsen for helping him through the process and getting deep into the details, like how to move his feet on certain plays.\nAll of it has come together to put Onyemata ahead of the curve from last season, which has been important given some of the injuries the team has endured in the front seven this season.\nCHASING RECORDS\nDrew Brees has a chance to set the NFL record for single-season completion percentage, but it doesn’t sound like the Saints quarterback has spent much time thinking about the potential achievement.\n“I guess I have guys that run good routes and catch the ball, and we have a good scheme, we have guys that block,” Brees said. “There’s so much that goes into that. It’s just not just one thing or another. I was always told that completions are good, completions are positive plays, and as Marty Schottenheimer used to say, ‘You’ll never go broke taking a profit.’”\nBrees enters Sunday’s game with a 71.9 completion percentage, putting him ahead of the 71.6 set by Sam Bradford in 2016. Brees previously set the mark in 2011 (71.2 percent) and in 2009 (70.6).\nA LITTLE HELP\nThe Saints have brought in a familiar face by hiring Darryl Tapp as a coaching intern.\nTapp previously played for the Saints as a defensive end. He spent four games with the Tampa Bay Buccaneers earlier this season.\nCoach Sean Payton said Tapp is trying to figure out what he wants to do after his playing career is over and values having his leadership around.\n“I think he’s been good, he’s been a good leader of this team even if he’s in a different role now,’ Payton said.\nINJURY ISSUES\nThe Saints ruled out offensive tackle Terron Armstead for Sunday’s regular-season finale against the Tampa Bay Buccaneers.\nThe offensive tackle suffered a thigh injury during last week’s win over the Atlanta Falcons.\nNew Orleans has also ruled out pass rusher Trey Hendrickson (ankle) and tight end Michael Hoomanawanui (concussion).\nTampa Bay has not ruled anyone out but listed defensive end Robert Ayers (shoulder) and linebacker Devante Bond (ankle) as doubtful.\nMORE AWARDS\nMarshon Lattimore has won another weekly honor.\nThe Saints rookie cornerback has been named the Pepsi Rookie of the Week for his performance against the Atlanta Falcons on Sunday. The highlight of his performance came when he intercepted a pass with his backside during the second quarter.\nLattimore also won the award in Weeks 6, 8 and 15. His teammate, running back Alvin Kamara, has won the award six times this season.", "url": "https://apnews.com/88e9a7c12ac84b9f8f23c3706f75c90b"}