{"authors": ["Allison Tibaldi"], "date_download": "2020-05-04 21:06:33", "date_modify": "2020-05-04 21:06:33", "date_publish": "2017-09-22 04:00:00", "description": "Wine lovers flock to Tuscany's Val d'Orcia to sample Italy's Brunello wine made from plump Sangiovese grapes, but sipping is not the only way to savor these prized wine grapes. In a...", "filename": "_7fa88a5dc5bc490881bd477ef381d5eb_1588626393.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7fa88a5dc5bc490881bd477ef381d5eb_1588626393.html", "title": "10 spa treatments spiked with booze", "title_page": "10 spa treatments spiked with booze", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Wine lovers flock to Tuscany’s Val d’Orcia to sample Italy’s Brunello wine made from plump Sangiovese grapes, but sipping is not the only way to savor these prized wine grapes.\nIn a hedonistic ritual Bacchus would approve of, guests at the Adler Thermae Spa Hotel may book a vinotherapy treatment and bathe in the local wine — literally — after having been massaged with a grape-infused oil.\nNot too long ago, a spa treatment might end with a post-massage glass of wine or a cocktail.\nWine, beer and spirits aren’t just for drinking anymore. Spas are turning them into restorative elixirs, spiking a variety of relaxing treatments.\nIt’s always 5 o’clock at the following spas, where intoxication comes without the hangover.\nRockhouse Hotel, Negril, Jamaica\nThe aroma of simmering curried goat and sizzling jerk chicken permeates the air, while reggae music and waves hitting the cliffs provide the soundtrack.\nBob Marley and the Rolling Stones once rested their heads on this Negril boutique hotel’s perfect pillows, and the original rock ‘n’ roll meets reggae vibe lingers.\nJamaica is known for its quality rum production, so it’s the perfect location to indulge in a rum-enhanced spa treatment. Rockhouse’s Jamaica Mocha/Rum Wrap smothers the body in a generous jigger of rum mixed with honey, mango, hemp, cocoa and shea butter. These emollients are swirled together with patchouli, orange and cinnamon before being slathered and wrapped on the body for 45 minutes of deep moisturizing.\nXHale Salon-Spa, Galt House Hotel, Louisville, Ky.\nThe distinct scent of oak barrels charring acts like a compass, guiding bourbon lovers to Kentucky. After all, 95% of all bourbon produced is distilled in the Bluegrass State.\nAmerica’s only native spirit is respected for its potency. At XHale Spa in Louisville, the Bourbon Bubbler Body Scrub satiates without the slightest risk of overindulging. Brown sugar and Kentucky whiskey combine to create a rich, gingersnap-scented product. The treatment exfoliates from head to toe, leaving the skin drunk with moisture.\nFor an additional shot of pampering, the foot scrub uses brown sugar and bourbon to exfoliate and hydrate, leaving toes twinkling.\nLansdowne Resort and Spa, Leesburg, Va.\nVirginia may not immediately come to mind as a wine-producing hot spot, but its history is intertwined with the vine.\nIn Jamestown, each settler was required to tend to 10 vines. Native son Thomas Jefferson was a passionate oenophile who honed his keen palate during stints in France. He was on a lifelong quest to cultivate quality grapes at his beloved Monticello.\nToday, this state is awash with vineyards producing palatable fluids that would make Jefferson proud.\nSpa Minérale at Lansdowne Resort incorporates Virginia wine into its signature facial, massage and nail treatments. The therapy treatments blend wine lees from nearby vineyards into lotions and oils. Wine lees are deposits of residual yeast left at the bottom of the wine vat after fermentation.\nConsider the Lansdowne Signature Wine Massage, a gentle Swedish-style massage that uses oils infused with wine grapes and wine lees. The treatment includes a sampling of some of Virginia’s notable wines.\nThe Cabernet Cacao Pedicure exfoliates the feet with caffeine rich cocoa beans followed by a soak in a bath of antioxidant-rich crushed cabernet grapes.\nHotel Adler Thermae Spa and Resort, Val d’Orcia, Tuscany, Italy\nThe scent of rosemary and lavender perfume the air. Panoramic views of sunbaked wheat fields, undulating cypress trees and a carpet of towering sunflowers are punctuated by medieval castles. As far as the eye can see, there are vineyards.\nThe Adler is an ambrosial playground of thermal springs, zen-like saunas and steam baths hidden in grottos. Italians know how to relax and drink wine better than anyone. For a true sense of place, what could be more fitting than a wine-infused spa treatment? The Adler’s decadent Aetos Ritual is designed for couples. A detoxifying peel is followed by a soothing side-by-side massage using grape seed oil. Next comes a regenerating bath in a mix of the hotel’s thermal water and local red wine, recharging the skin with a boost of earthy vitality. The treatment concludes with a glass of wine from the property’s vineyards and a nibble of wine-enhanced pecorino cheese.\nThe hotel also offers a range of guided wine tasting experiences, including a tour of the estate’s private cellar. Borrow an electric bike and pedal off to explore the surrounding vineyards.\nLuxury Bahia Principe Fantasia, Punta Cana, Dominican Republic\nAll over the Dominican Republic, locals get an après-beach boost sipping Mama Juana. This popular alcoholic beverage is a modernized version of the herbal tea that the indigenous Taíno people once drank to increase fertility.\nSteep rum and red wine, add tree bark, a variety of herbs and a touch of honey and you’ve got Mama Juana. The alcohol is believed to help extract the curative properties of the herbs. It is still thought to be an aphrodisiac, earning it the moniker Dominican Viagra.\nAt the Luxury Bahia Principe Fantasia’s Bahia Spa on Punta Cana’s bustling Bávaro Beach, the Mama Juana massage is the tonic of choice. The massage therapist caresses every inch of the body with oil infused with Mama Juana. After the massage, a shot glass of deep red Mama Juana is offered, the perfect liquid conclusion.\nFour Seasons Hotel Washington\nThe pop of the cork and the clink of crystal flutes are sounds that punctuate life’s important moments. Champagne’s delicate bubbles are the go-to drink for special occasions from weddings to graduations.\nThis status symbol beverage contains antioxidants and polyphenols that claim to fight signs of aging and reduce skin inflammation, so using it in a spa treatment was bound to happen.\nAt the Four Seasons Hotel in Washington, beltway insiders book the Cherry Blossom Champagne Body Treatment when they crave luxurious relaxation.\nA detoxifying dry brushing technique is followed by a leisurely soak in the tub to cleanse and soothe the skin. Next comes a body polish of champagne blended with sea salt followed by a body wrap and moisturizing application of champagne body butter, leaving the body buffed and puffed in all the right ways.\nThe Grand Mayan, Vidanta Los Cabos, Mexico\nThe citrus sting of freshly squeezed lime and touch of salt on the rim of the margarita glass prepares the palate for tequila’s burn. Made from the blue agave plant that grows near Guadalajara, tequila is popular in much of the world, but it’s indigenous and iconic to Mexico.\nAt Vidanta in Los Cabos, guests can indulge in the spa’s festive tequila massage. This 80-minute treatment takes an innovative approach to exfoliation by using a sea salt infusion loaded with tequila oil. Tequila oil is rich in linoleum acids, to soften and nourish the skin.\nAfter the exfoliation, guests will experience deep relaxation from a combination of Swedish, lymphatic and deep tissue massage techniques. For the finale, an application of oil enriched with tequila will soften and nourish the skin.\nLes Sources de Caudalie, Bordeaux, France\nExquisitely manicured vineyards next to stately châteaux paint a portrait of exceptional beauty that is characteristic of Southwest France.\nNestled among the vineyards of Château Smith Haut Lafitte and completely in tune with nature is the refined Les Sources de Caudalie. It provides guests with a regal vacation among the vines.\nThe hotel was founded on the libertine principle of the French Paradox, which refers to studies that show that the French diet and lifestyle are conducive to good health. The property embraces this Francophile philosophy unabashedly.\nThe spa pioneered wellness treatments using fresh wine grapes decades ago. Choose from an extensive menu of wine barrel baths, wraps and facials. The Pulp Friction Massage utilizes grapes from their own vineyards blended with essential oils, thoroughly moisturizing the skin.\nAugustine, a Luxury Collection Hotel, Prague, Czech Republic\nWhether it’s the zing of hops in an IPA or the fruity taste of a spontaneously fermented lambic, beer is popular throughout much of the world. Hops and barley are nutrient-rich and spas are exploiting their potential.\nIn Prague, the Augustine hotel is housed in seven historic buildings, the largest of which is a 13th century monastery. Set against a varied architecture of Baroque, Renaissance and Gothic styles, the hotel’s elegant interiors reflect the building’s monastic history.\nThe property’s intimate spa has created the St. Thomas Beer Body Ritual using a recipe from the Augustinian Order of Monks.\nThe ritual begins in the hammam (a steam room) with an exfoliation using finely ground organic beer hops, St. Thomas dark beer and salt, to promote detoxification and hydration. The treatment finishes with a full-body massage.\nKenwood Inn and Spa, Sonoma, Calif.\nSonoma County’s lofty redwood trees, rugged Pacific coastline and more than 425 wineries earn it a spot as one of America’s legendary wine regions. Wineries here run the gamut from international giants to small, family-run estates.\nThe Kenwood Inn is a serene retreat surrounded by vineyards, orchards and shady oak trees. It offers 29 rooms and discrete hospitality to overnight visitors.\nIts spa proves that California wine is not just for drinking. Treatments include a soak in a tub of pinot noir, sipping a glass of wine as the stress melts away.\nThe Honey Wine Wrap uses wine grapes to give skin an emollient lift, while the Crushed Cabernet Scrub invigorates with crushed wine grapes and concludes with a massage. — (CNN)", "url": "https://apnews.com/7fa88a5dc5bc490881bd477ef381d5eb"}