{"authors": ["Elizabeth Zavala"], "date_download": "2020-05-04 20:13:19", "date_modify": "2020-05-04 20:13:19", "date_publish": "2017-03-03 00:28:17", "description": "Jurors watched a profanity-laden interview Thursday between a Texas Rangers investigator and a then-San Antonio police officer now on trial, accused of tricking women into having sex with him and...", "filename": "_45c2c398350d4b02bced53227fc04611_1588623199.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_45c2c398350d4b02bced53227fc04611_1588623199.html", "title": "Trial video: Texas Ranger investigating sex case pushed hard at SAPD cop", "title_page": "Trial video: Texas Ranger investigating sex case pushed hard at SAPD cop", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jurors watched a profanity-laden interview Thursday between a Texas Rangers investigator and a then-San Antonio police officer now on trial, accused of tricking women into having sex with him and another officer by promising money and legal favors.\nThe interview was civil at the start, but it escalated, with Texas Ranger Keith Pauska and Officer Alejandro Chapa raising their voices at each other and using profanity when the investigator challenged Chapa, saying his story kept changing and wasn’t adding up.\nChapa, 29, and another former officer, Emmanuel Galindo, 31, are charged with multiple counts of sexual assault, compelling prostitution and official oppression in a trial that featured three women describing how and why they accepted a job training for a sting operation targeting criminals that quickly led to sex with the officers.\nThey and other witnesses testified that they were given a cellphone number to text for their interest in participating in the “program” and were briefed by Galindo on a training system for seductive role-playing, with the promised payment based on an escalating scale of sexual involvement.\nThe women who participated said they were pressured after heavy drinking to have sex with either Galindo or Chapa in a series of encounters, but were never paid. Galindo and Chapa resigned after their arrest on Sept. 24, 2015.\nBoth the state and defense rested their cases Thursday afternoon. Closing arguments are expected to begin at 8:15 Friday morning in the 187th state District Court.\nIn a three-hour interview recorded on June 26, 2015, played for the jury as evidence, Chapa told Pauska numerous times that he would never be part of anything that would involve assaulting women.\nChapa explained he had “met a guy” on Prue Road near the police substation where he worked, who showed him a badge, asked Chapa if he was interested in doing undercover work, gave him a cellphone number to text and asked if he could find “girls” who could work with him and act as distractions in the operation.\n“Are you being truthful with me?” Pauska repeatedly asked as the conversation grew heated. Chapa replied in the affirmative, with an expletive.\nPauska told Chapa that the phone number was traced to a Google Voice account, an application that provides a free phone number for calls, text messages and voice mail. He asked, “What if that number comes back to you?”\nChapa replied, “I’d be (in trouble),” using an expletive.\nPauska testified later Thursday that the Google Voice number was traced back to Galindo, Chapa’s co-defendant.\nMatthew Markovich, a digital investigative analyst, testified Thursday that he collected deleted messages from cellphones seized from Galindo’s residence. The text exchanges, between both co-defendants and at least two of the alleged victims, were entered into evidence.\nJurors also saw images collected from a computer seized from Galindo’s home which showed a “confidential undercover” form with the words “Police Department” on top; a questionnaire that included inquiries on bra size, bathing suit size, body type and eye color; and a “confidentiality agreement,” also with the words “Police Department” at the top.\nWomen earlier in the week who testified they believed they were joining a police undercover program had described signing similar forms.\nIf convicted, Chapa and Galindo face up to 20 years in prison on each count of sexual assault and compelling prostitution, both second-degree felonies. Official oppression is a Class A misdemeanor, punishable by a year in jail.\nezavala@express-news.net\nTwitter: @elizabeth2863", "url": "https://apnews.com/45c2c398350d4b02bced53227fc04611"}