{"authors": ["John Goodspeed"], "date_download": "2020-05-04 20:08:20", "date_modify": "2020-05-04 20:08:20", "date_publish": "2017-02-23 22:56:41", "description": "Through SundayTexas Parks & Wildlife Department: Volunteers needed for 17th annual Texas Abandoned Crab Trap Removal Program. Eight drop-off locations along the coast. Call Zack Thomas,...", "filename": "_49c962edd63741f7a4bb5328d01f5f52_1588622900.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_49c962edd63741f7a4bb5328d01f5f52_1588622900.html", "title": "Outdoors: Calendar, Feb. 24", "title_page": "Outdoors: Calendar, Feb. 24", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Through SundayTexas Parks & Wildlife Department: Volunteers needed for 17th annual Texas Abandoned Crab Trap Removal Program. Eight drop-off locations along the coast. Call Zack Thomas, 512-389-8448, or email crabtrap@tpwd.texas.gov.Through TuesdayPort Aransas Chamber of Commerce: Whooping Crane Festival, with tours on land and sea to view the endangered species and other migratory birds up close. Workshops and presentations from world-renowned speakers. Free trade show for optics, paintings and photography. Click on whoopingcranefestival.org.SaturdayBilly Sandifer Big Shell Cleanup: 22nd annual event at Padre Island National Seashore for volunteers to rid beach of marine debris. Meet at Malaquite Pavilion at 7:30 a.m. Entrance fee waived. Free lunch. Click on friendsofpadre.com.Mitchell Lake Audubon Center: Birding by Ear, instruction on identification through calls by Master Naturalists Tom and Patsy Inglet, 8 a.m.-noon, 10750 Pleasanton Road. Admission fees apply. RSVP at 210-628-1639 or click on mitchelllake.audubon.org/events.White Smoke Brigade: Monthly match of the muzzleloading firearms organization, 9 a.m., Pantermuehl Ranch on west side of FM 306 just south of Purgatory Road. Nonmembers welcome. Call Joe Wolf for information and directions, 830-935-3121, or wolfbear@gvtc.com.Mitchell Lake Audubon Center: Beginner Bird Walk, a family-friendly walking tour for beginners to learn about identification and using binoculars, 8-10 a.m., 10750 Pleasanton Road. Admission fees apply. Call 210-628-1639 or click on mitchelllake.audubon.org.SundayMitchell Lake Audubon Center: Doggy Day, a special day to bring dogs to the center and go on trails,8 a.m.-4 p.m., 10750 Pleasanton Road. Admission fees waived. RSVP at 210-628-1639 or click on mitchelllake.audubon.org/events.TuesdayTexas Outdoors Woman Network of San Antonio: Monthly meeting with a special presentation, 6 p.m., Lion & Rose, 842 N.W. Loop 410. Nonmembers welcome. For more information, click on townsa.org.New Braunfels Fly Fishers: Monthly meeting with guest speaker, 7 p.m., McKenna Event Center, 801 W. San Antonio St., New Braunfels. Nonmembers welcome. Call Jay Rogers, 830-837-3022. or click on newbraunfelsflyfishers.org.WednesdayTexas Big Game Awards: Deadline for entry of white-tailed deer, mule deer, javelin, desert bighorn sheep or pronghorn antelope. Call 210-236-9761 or click on texasbiggameawards.org.ThursdayAlamo Chapter of the National Wild Turkey Federation: 20th annual Hunting Heritage Banquet, Alzafar Shrine Temple. 6 p.m. Raffles and live and silent auctions. Free kids raffle. Gold table for eight, $1,450; silver table for eight, $950; couple, $150; single, $85; ages 17 and younger, $30. Contact Jason Lassere, 210-381-6511 or alamonwtf@gmail.com, or Betty Warren, 210-838-7585, or click on alamochapternwtf.org.San Antonio Audubon Society: Rufus Stephens of the Texas Parks & Wildlife Department and Jan Wrede, former director of education and citizen science at the Cibolo Nature Center, will talk about their book “Attracting Birds in the Texas Hill Country” at the monthly meeting,7 p.m., The First Tee, 915 E. Mulberry Ave. Nonmembers welcome. Call 210-308-6788 or visit saaudubon.orgHave an item for the calendar?Email John Goodspeed at john@johngoodspeed.com", "url": "https://apnews.com/49c962edd63741f7a4bb5328d01f5f52"}