{"authors": ["Matt Charboneau", "The Detroit News"], "date_download": "2020-05-04 20:09:54", "date_modify": "2020-05-04 20:09:54", "date_publish": "2017-12-29 05:36:43", "description": "San Diego — Michigan State's remarkable turnaround was complete when it won nine regular-season games and finished second in the Big Ten East. On Thursday night at the Holiday Bowl, the...", "filename": "_3fa858b453a4403985803b5645f0d081_1588622994.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3fa858b453a4403985803b5645f0d081_1588622994.html", "title": "MSU caps turnaround with dominant Holiday Bowl win", "title_page": "MSU caps turnaround with dominant Holiday Bowl win", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "San Diego — Michigan State’s remarkable turnaround was complete when it won nine regular-season games and finished second in the Big Ten East.\nOn Thursday night at the Holiday Bowl, the program’s impressive revival was validated with a dominating performance in a 42-17 victory over Washington State in front of 47,092 at SDCCU Stadium.\nThe 18th-ranked Spartans (10-3) completed the largest turnaround in program history, winning seven more games than it did in 2016 and finishing off the fourth double-digit victory season in the last six.\nIt did so by scoring 35 straight points after falling behind 3-0 in the first quarter behind the arm and the legs of sophomore quarterback Brian Lewerke. After missing on his first four throws, Lewerke finished 13-for-21 for 213 yards and three touchdowns while running 14 times for 73 yards for the Spartans, who were ranked No. 16 in the final College Football Playoff poll.\nJunior Felton Davis had four catches for 118 yards and a touchdown while freshman Cody White had four grabs for 41 yards and two scores. LJ Scott added two touchdowns and ran for 110 yards rushing while fifth-year senior quarterback Damion Terry scored on a 5-yard run in the third quarter while filling in for Lewerke, who sat two plays after a big hit near the end zone.\nLewerke, who left the game for good early in the fourth quarter, finished with 3,352 total yards this season, the second-best mark in Michigan State history, trailing only the 3,415 yards gained by Drew Stanton in 2005.\nNo. 21 Washington State (9-4) played without quarterback Luke Falk, who injured his left hand. It was an injury coach Mike Leach brushed off the day before, but sophomore Tyler Hilinski got the call. He was 39-for-50 for 272 yards, two touchdowns and an interception, but he couldn’t get the offense moving early as Michigan State forced four three-and-outs in the first half.\nThe Cougars did manage strike first when Erik Powell connected on a 45-yard field goal with 5:45 to play in the first quarter. Hilinski was 8-for-10 on the drive that lasted 14 plays and went 64 yards.\nBut Michigan State’s offense started to find some rhythm near the end of the first quarter as the Spartans overcame two penalties to march down the field and take a 7-3 lead with 7:34 left in the second quarter on a 15-yard pass from Lewerke to White. The drive last 16 plays and went 81 yards while taking 9:24 off the clock as Lewerke started to get comfortable in the pocket. It was the longest drive by time for Michigan State in a bowl game and matched the most number of plays.\nThe Spartans defense got the ball right back with a three-and-out and the offense took advantage, striking quickly on their next drive with a 49-yard pass from Lewerke to Davis for a touchdown and a 14-3 lead with 4:34 left in the second quarter. Michigan State kept pouring it on late in the first half as Lewerke hit Davis for 27 yards on first down and later Scott took a screen pass to the Washington State 3. Scott scored on the next play to put the Spartans ahead, 21-3, with 29 seconds to play in the half.\nThe 21 points matched the most in a quarter during a bowl game for the Spartans, tying the 21 they scored against Baylor in the 2014 Cotton Bowl.\nMichigan State carried the momentum into the second half, turning the first drive of the half into another touchdown as it marched 67 yards on 10 plays to extend its lead to 28-3 with 10:28 left in the third quarter on a 10-yard pass from Lewerke to White, his second of the game.\nThe defense made the next big play as senior linebacker Chris Frey jumped on a botched handoff to give the Spartans the ball at the Cougars’ 27. Michigan State took advantage as Terry scored on a 5-yard run to put the Spartans ahead, 35-3, with 5:08 to play in the third quarter.\nWashington State finally halted Michigan State’s surge with a 14-yard touchdown pass from Hilinski to Tay Martin with 2:06 left in the third quarter to cut the Spartans’ lead to 35-10. After a Terry interception, Hilinski and Martin connected again, this time on a 15-yard touchdown pass to cut the deficit to 35-17 with 8:26 to play.\nScott capped the scoring with a 28-yard touchdown run with 6:14 left in the game.\nmcharboneau@detroitnews.com\ntwitter.com/mattcharboneau", "url": "https://apnews.com/3fa858b453a4403985803b5645f0d081"}