{"authors": ["Corey Robin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Jacob Bacharach", "Branko Marcetic", "Paul Heideman"], "date_download": "2020-05-04 19:59:26", "date_modify": "2020-05-04 19:59:26", "date_publish": "2017-07-24 00:00:00", "description": null, "filename": "2017_07_democrats-chuck-schumer-nytimes-democratic-party-labor-economics_1588622366.html", "image_url": "https://images.jacobinmag.com/2017/07/24151050/schumer.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_07_democrats-chuck-schumer-nytimes-democratic-party-labor-economics_1588622366.html", "title": "A Party That Wants to Die but Can’t Pull the Plug", "title_page": "A Party That Wants to Die but Can’t Pull the Plug", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Yesterday, I noted my exasperation, in the face of the economic desperation of the younger generation, with the Clintonites in the Democratic Party. Young men and women are drowning in massive debt, high rent, low pay, and precarious jobs, and what do the Democrats have to offer them?\nIn today’s Times, Chuck Schumer, the highest elected official in the Democratic Party, gave an answer:\nRight now millions of unemployed or underemployed people, particularly those without a college degree, could be brought back into the labor force or retrained to secure full-time, higher-paying work. We propose giving employers, particularly small businesses, a large tax credit to train workers for unfilled jobs. This will have particular resonance in smaller cities and rural areas, which have experienced an exodus of young people who aren’t trained for the jobs in those areas.\nTax credits to employers to train unskilled workers.\nDo you know hold old and ancient and bullshit this idea is? Here’s how old and ancient and bullshit this idea is. When, more than a decade ago, the University of Oregon political scientist Gordon Lafer came out with his landmark study The Job Training Charade, demonstrating how poorly these job training programs had performed over the years, he reached back, on the cover of the book, to a 1982 bill that essentially promised to do what Schumer is now proposing to do.\nThere’s one difference. Where the 1982 bill focused on government programs and partnerships, Schumer’s bill seems to focus exclusively on tax giveaways to employers, already awash in cash.\nWhy did Lafer feature that bill on his cover? Because despite decades of data and research showing how bad these programs were, they held an unusual attraction to Republican and Democratic legislators alike. Cosponsors of that 1982 bill ranged from right-wingers like Paula Hawkins and Thad Cochran (remember them?) and Orrin Hatch to liberals like Teddy Kennedy. Job training, Lafer showed in exhaustive detail, has come to be the neoliberal salve for our free-market age. When you can’t do anything else for workers, train them. For jobs that aren’t there or wages that suck.\nIt’s true that Schumer offers other proposals, including a $15 minimum wage, but for anyone with a memory, the devotion of one sentence, much less a paragraph, of precious column space to this synecdoche of the bipartisan political economy of the last four decades—well, it’s enough to make you think this is a party that wants to die but can’t pull the plug.", "url": "https://www.jacobinmag.com/2017/07/democrats-chuck-schumer-nytimes-democratic-party-labor-economics"}