{"authors": [], "date_download": "2020-05-04 20:08:25", "date_modify": "2020-05-04 20:08:25", "date_publish": "2017-05-31 16:00:00", "description": "Jamie Foxx and Issa Rae will be presenting at the BET Awards. The 'Ray' actor and the 32-year-old actress-and-writer will join talk show host Trevor Noah, 'All Eyez on Me' star Demetrius...", "filename": "_b977207e52b4488c90dddb811df1b7c0_1588622905.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b977207e52b4488c90dddb811df1b7c0_1588622905.html", "title": "Jamie Foxx and Issa Rae to present at BET Awards", "title_page": "Jamie Foxx and Issa Rae to present at BET Awards", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jamie Foxx and Issa Rae will be presenting at the BET Awards.\nThe ‘Ray’ actor and the 32-year-old actress-and-writer will join talk show host Trevor Noah, ‘All Eyez on Me’ star Demetrius Shipp Jr , and the cast of ‘Girls Trip’, Queen Latifah, Jada Pinkett Smith, Regina Hall and Tiffany Haddish, in handing out prizes at the Microsoft Theater in Los Angeles on June 25.\nThe news comes after it was recently announced Leslie Jones will present the annual ceremony.\nThe 49-year-old actress embarked on a career as a stand up comedian in 1987, which saw her entertain crowds on a show on the channel, and the funny woman believes her career has now come “full circle”.\nThe ‘Ghostbusters’ star said: “BET was the first place I ever did comedy on TV, so it’s a full-circle moment of coming home where I started.”\nLeslie has hinted she is proud of her achievements and that she can boast about her successes when she returns home to her family and friends.\nShe explained: “I went out in the world and did what I needed to do and now I can come home to my people and say, ‘Yo! Look what I did!’”\nAnd Leslie plans to make her audience “downright laugh” when she takes to the stage because she is “tired” of people being sad and angry, although she doesn’t think it will be possible to avoid commenting on “certain” subjects.\nShe added: “It’s really just about pulling the elephants out of the room and, actually, I’ll make the elephant in the room laugh about it.\n“So my goal for this show is to have a big ’ol nice barbecue, family reunion feel. I just want everyone cracking up. I want everyone leaving that event going, ‘Wait, did they even give awards out? I was too busy laughing.’ ”\n‘Lemonade’ hitmaker Beyonce has been nominated for seven awards, with Bruno Mars following with five.\nBeyonce’s sister Solange has been nominated for four awards and will go head to head against her sister for the Best Female R&B/Pop Artist.\nChance the Rapper and Migos also have four nominations each.", "url": "https://apnews.com/b977207e52b4488c90dddb811df1b7c0"}