{"authors": ["Chris Maisano", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:40", "date_modify": "2020-05-04 19:52:40", "date_publish": "2017-11-20 00:00:00", "description": null, "filename": "2016_01_democratic-socialism-government-bernie-sanders-primary-president_1588621960.html", "image_url": "https://images.jacobinmag.com/2017/11/20133506/7152650581_14ce271136_k.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2016_01_democratic-socialism-government-bernie-sanders-primary-president_1588621960.html", "title": "Isn’t America Already Kind of Socialist?", "title_page": "Isn’t America Already Kind of Socialist?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "If you spend much time on social media, you’ve probably seen the memes purporting to show just how socialist the United States already is by listing a bunch of government programs, services, and agencies. There are many variations on the theme, but my favorite one lists no less than fifty-five ostensibly socialist programs whose only commonality is that Uncle Sam carries them all out.\nSome directly serve social needs and involve some measure of income redistribution (public libraries, welfare, the WIC program, Social Security, food stamps). Some seem thrown in for no good reason at all (Amber Alerts? The White House?). Others are basic operational activities that any modern government, regardless of its ideological orientation, would carry out (the census, fire departments, garbage and snow removal, sewers, street lighting). And still others involve the vast apparatus of coercion and force (police departments, the FBI, the CIA, the military, courts, prisons, and jails).\nFor all of Bernie Sanders’s virtues, his campaign for president has only thickened the fog of ideological confusion. At one campaign stop last year, he endorsed the thinking behind the most simplistic of these memes: “When you go to your public library, when you call your fire department or the police department, what do you think you’re calling? These are socialist institutions.” By that logic any sort of collective project funded by tax dollars and accomplished through government action is socialism.\nIt’s not difficult to see the problem with this line of thinking. In a country as deeply and reflexively anti-statist as the United States, the identification of socialism with government is perhaps the worst possible rhetorical strategy the Left could adopt. “Like the DMV? Then You’ll Love Socialism!” isn’t a slogan that will win many converts. More importantly, conflating all government action with socialism forces us to defend many of the most objectionable forms of state activity, including those that we would want to abolish in a free and just society.\nIt’s one thing to identify public libraries with socialism. They operate according to democratic principles of access and distribution, providing services to all regardless of one’s ability to pay. They would be one of the most important institutions in any socialist society worthy of the name. But it’s quite another to include the police. If the forces responsible for killing Sandra Bland, Eric Garner, and Rekia Boyd exemplify socialism in action, then no person who wants freedom and justice should be a socialist.\nThe idea that any government activity is synonymous with socialism has major political and strategic implications. After all, if our country was already at least partly socialist, then all we would have to do is keep gradually expanding government. We wouldn’t have to change the purpose of any existing programs, nor would we have to reform the administrative structures of government agencies.\nAnd because all of those purportedly socialist programs have been won without fundamentally challenging private property, there would be no need for a decisive confrontation with the owners of capital and their political allies. All we would have to do is elect sympathetic politicians to office and let them legislate their way to even more socialism.\nAcademics who study politics for a living often fall into this trap. By simply looking at the size of government in terms of overall spending, many argue that the US is becoming increasingly socialist whether it wants to or not. In their view major social reforms will happen willy-nilly, with a passive populace coming to support successful programs only after they have been legislated by politicians and implemented by bureaucrats.\nGovernment spending on social programs and other activities may well increase in the coming decades because of the aging population, the climate crisis, and other developments. But the sheer volume of spending tells us little about the political valence of government action. Key questions about that state activity always need to be asked: does it reinforce or undermine the power of those who own capital? Does it increase our subordination to market discipline or offer us more freedom from its demands?\nThere have been a number of large-scale government initiatives since the 1980s, even during periods of Republican political dominance. But many of the biggest programs over the last few decades do nothing to strengthen the power of workers.\nThe Earned Income Tax Credit (EITC) has brought much-needed relief to the working poor, but it also serves as an indirect subsidy for low-wage employers. Medicare Part D offers some subsidies to low-income seniors, but it’s widely recognized as a costly giveaway to the prescription drug industry.\nObamacare has increased health insurance coverage, partially through the (contested) expansion of Medicaid. But the individual mandate only serves to deepen marketization, adding millions of Americans to the private, for-profit insurance system. The 2009 stimulus plan likely saved the country from another Great Depression, but it was inadequate to the scale of the crisis and weighted in favor of tax cuts for businesses who simply pocketed the cash instead of hiring new workers. The list goes on.\nWhy does this happen? For one thing, the rich and powerful invest heavily in political activity to promote their interests and block progressive reforms. By the end of last year, the contributions of just 158 families and the companies they own (a staggering $176 million) made up about half the total funding in the 2016 presidential race. Through their political spending and the influence it buys, they have been able to shape tax and other policies for their own benefit, an advantage reinforced by favorable judicial decisions (e.g. Citizens United) and lobbying activities.\nAccording to a widely noted 2014 study by two political scientists, the political dominance of the wealthy is now so pronounced that average citizens exercise “near zero” influence over government policymaking.\nThe middle and upper classes also hold the most important posts in government, elected and appointed alike. They share a common set of ideas and values predicated on protecting the status quo and repressing any major challenge to that system, particularly those that come from the working class and the Left.\nThese direct forms of influence are not the only way that powerful interests shape government action. After all, governments are dependent on some minimally robust level of economic activity to fund themselves. The tax revenues or debt financing governments rely on are directly related to the state of the capitalist economy and its rates of growth and profitability. If the level of economic activity declines — perhaps , because capitalists are unhappy about new legislation that benefits workers — the state will find it increasingly difficult to fund its activities. This in turn leads to a decline in its legitimacy and its level of popular support.\nBecause economic activity is significantly determined by the investment decisions of private capitalists, these forces can essentially veto government policies that they think are against their interests. Often, if capitalists aren’t induced to make investments through business subsidies and other incentives, they simply will refuse to invest.\nConsequently, there is a strong tendency for politicians and bureaucrats to align their policy decisions with the interests of capitalists in the private sector. Preserving “business confidence” is a major constraint on the formation of policy, and is one of the main reasons why government action is so often favorable to capitalist interests. It’s also how they’re able to conflate their own interests with a larger “public” or “national” interest — under a capitalist system, there’s some truth to their claim.\nIn the absence of popular organization and militancy, government action will do little to shift the balance of power away from capital and toward labor, or to undermine market discipline instead of deepening it. So long as the fundamental structures of the economy remain unchanged, state action will disproportionately benefit capitalist interests at the expense of everything else.\nThis is not to say that progressive reforms can never be won under capitalism, or that the government is completely immune to public pressure. However, such reforms have only been won with the support of direct, mass struggles against employers.\nSimply electing politicians to office or watching the government expand by its own momentum has never been, and never will be, enough. Economic power is political power, and under capitalism the owners of capital will always have the capacity to undermine popular democracy — no matter who’s in Congress or the White House.\nWinning government power and using it to break the dominance of the capitalist class is a necessary condition for beginning the transition to socialism. A government run by a socialist party (or a coalition of left and working-class parties) would move to bring the economy’s key industries and enterprises under some form of social control. But that alone wouldn’t be sufficient. The bitter experiences of the twentieth century have taught us that socialism won’t further the cause of human freedom if the political and administrative structures of government aren’t thoroughly democratized.\nHere is where continued popular mobilization outside (and, if necessary, against) formal political structures becomes absolutely crucial. In order to withstand the inevitable backlash from capitalist and conservative forces, a socialist transition would need to draw on mass popular support and direct participation in the affairs of government.\nThis would entail not only creating directly democratic bodies that supplant or complement representative institutions like Congress, but dramatically overhauling state agencies and administrative structures. Such an expansion of popular power would be needed to both push out personnel committed to the old regime and to transform the often alienating and repressive bureaucracies that currently administer public services.\nPublic schools, welfare departments, planning agencies, courts, and all other government agencies would invite workers and recipients to participate in the design and implementation of those services. Public-sector unions could play a key role in this endeavor, organizing both the providers and users of public services to radically transform the administrative structures of government.\nOnly under these conditions would government activity be synonymous with democratic socialism. Instead of posing an abstract concept of “government” against the forces of capital, we should begin the hard work of conceiving and building new institutions that can make government of the people, by the people, and for the people a reality.", "url": "https://www.jacobinmag.com/2016/01/democratic-socialism-government-bernie-sanders-primary-president"}