{"authors": ["Jake Prinsen", "News Republic"], "date_download": "2020-05-04 20:05:18", "date_modify": "2020-05-04 20:05:18", "date_publish": "2017-06-01 22:00:00", "description": "Aldo Leopold Foundation leaders say a $100,000 grant will help the local nonprofit train and inspire a new generation of conservationists. The conservation organization announced Tuesday it...", "filename": "_822505e2b37a4ea189b1424fac50df62_1588622718.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_822505e2b37a4ea189b1424fac50df62_1588622718.html", "title": "$100K grant expands educational programs at Aldo Leopold Foundation", "title_page": "$100K grant expands educational programs at Aldo Leopold Foundation", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Aldo Leopold Foundation leaders say a $100,000 grant will help the local nonprofit train and inspire a new generation of conservationists.\nThe conservation organization announced Tuesday it was offered a $100,000 challenge grant from the Madison Community Foundation. Aldo Leopold Foundation communications coordinator Cassie Mordini said the funds will help create an endowment that will provide sustainable funding for the organization’s Future Leaders Program.\n“That should hopefully make this a financially sustainable program going forward,” she said.\nSimilar to an internship, the Aldo Leopold Foundation’s Future Leaders Program invites conservationists from across the country to participate in a variety of fellowships at the organization’s headquarters north of Baraboo. The program offers six to 12-week courses for college students and nine-month courses for college graduates. During the courses, fellows learn practical skills in ecological restoration and management, or education and outreach.\nAldo Leopold Foundation Executive Director Buddy Huffaker said the program teaches technical skills needed for conservation field work, in addition to the science and theories behind land management.\n“Some students learn all about how to take care of the land, but they don’t know how to run a chainsaw, or drive a tractor, or do a prescribed burn,” he said. “We teach those technical skills that will separate them from other candidates out there in the job market.”\nSince 1996, 50 fellows have completed the program, and more than 90 percent have landed conservation-related careers. Huffaker said seven current Aldo Leopold Foundation staff members, including himself, were introduced to the organization through the program.\n“Though we’re bringing people in to launch their careers, sometimes their careers stay right here in Baraboo,” he said. “And people who leave become ambassadors for the Baraboo area.”\nThe Aldo Leopold Foundation currently is embarking on a $5 million campaign to expand its educational programs. Leaders say the revamped courses will help the organization meet a growing demand for capable and diverse conservation leaders. The expansion will provide more fellowship opportunities, a new learning facility to house fellows and future support for the program.\nOnce renovations are complete, Mordini said the organization plans to train 50 fellows through its Future Leaders Program within five years.\nTo date, the Aldo Leopold Foundation has raised more than $3.6 million for the effort. The Madison Community Foundation’s $100,000 challenge grant will be awarded after the Aldo Leopold Foundation raises the next $300,000 toward the remaining $1.4 million.\nHuffaker said the grant provides incentive to raise more money by challenging the Aldo Leopold Foundation to raise an additional $300,000 before it receives the additional funds. Huffaker added that the organization hopes to raise the money before the end of the year.\n“They’ve committed to giving us $100,000, but not until we raise $300,000,” he said. “It’s a way that foundations have found spurs donations and new donors to help support an effort.”\nMadison Community Foundation community impact vice president Tom Linfield said in a press release that the Madison organization is proud to support the Aldo Leopold Foundation, and added that the money will help ensure that future generations are taught Leopold’s vision.\n“We believe in the long-term strength and viability of stellar nonprofits, and Aldo Leopold’s endowment campaign will ensure that generations of learners are exposed to the Aldo Leopold land ethic and that capitalize on our region’s reputation as a conservation leader and destination,” he said.", "url": "https://apnews.com/822505e2b37a4ea189b1424fac50df62"}