{"authors": ["Hunter Atkins"], "date_download": "2020-05-04 20:08:33", "date_modify": "2020-05-04 20:08:33", "date_publish": "2017-04-14 01:36:17", "description": "The excuses for Jackson Ryan always are there if he wants to deflect blame for a failed relief appearance or reason why at 17 he splits time between the jayvee and varsity teams at Second Baptist...", "filename": "_02495402628a4533ab6b5c94f8c2844c_1588622913.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_02495402628a4533ab6b5c94f8c2844c_1588622913.html", "title": "Against the odds, Jackson Ryan continues family tradition one pitch at a time", "title_page": "Against the odds, Jackson Ryan continues family tradition one pitch at a time", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Against the odds, Jackson Ryan continues family tradition one pitch at a time\nThe excuses for Jackson Ryan always are there if he wants to deflect blame for a failed relief appearance or reason why at 17 he splits time between the jayvee and varsity teams at Second Baptist High School.\nAnyone can see how he could be disadvantaged on the mound. His posture folds over. His follow-through pulls up short. He does not wear his mitt conventionally but instead drapes it over his non-throwing hand, which is wrapped in Velcro. He throws and fields with his left hand.\nHaving excelled through savvy and determination, Jackson modestly brings up his cerebral palsy only to explain how far he can go. He never suggests it limits his ability.\n“I try to tell others you can do it,” he said.\nHe echoes the encouragement that his family always has offered him. As the grandson of Hall of Fame flamethrower Nolan Ryan and Astros president of business operations Reid Ryan, who pitched at TCU, Jackson said keeping tradition felt natural.\n“I’ve grown up in the game and loved it,” he said.\nIn seven appearances this season, Jackson has pitched 52/3 innings, with six strikeouts, a 4.94 ERA and a 1.77 WHIP.\n“Once you get to high school, you’ve got to earn it,” Reid said of his son’s accountability.\nBefore athletics emerged in Jackson’s life, being born hemiplegic jeopardized his future.\n“Nothing prepares you for when you’re in the hospital and the doctor says, ‘There’s something wrong,’?” Reid said.\nReid, 45, and his wife, Nicole, who played basketball at TCU, were told their first child might never talk or walk.\nReid had dreamed of coaching his son in baseball and attending his wedding someday.\n“All these thoughts that new parents have, it strikes you that maybe this isn’t the path that we’re going to be on. It’s a shock.”\nBaseball doubts\nCerebral palsy varies in how it affects people. For Jackson, a traumatic brain injury in utero left the right side of his body partially paralyzed. He bore 90 percent of his weight on his left leg. He could handle gross motor skills, like running, but his rigid right extremities lacked fine motor skills.\nReid fretted over his son’s basic living tasks and childhood pleasures. Tying sneakers, knotting a tie, cutting meat and riding a bicycle seemed daunting. Baseball seemed doubtful.\nThen, while overseeing the Class AA Corpus Christi Hooks in the early 2000s, Reid took Jackson to a game, where they met Jack Todd.\n“Does your son have cerebral palsy?” Todd asked immediately.\nThe tactless introduction “almost ticked me off,” Reid said.\nTodd recognized Jackson’s considerable gait. Todd’s son, Jake, also is hemiplegic from cerebral palsy.\nTodd and Reid chatted the entire game. Reid and Nicole followed up with a visit to Todd’s home in Plano for more advice.\n“All of these other things that ‘normal’ families don’t have to worry about,” said Todd, an executive at a manufacturing company and former naval officer for 20 years.\nJake, who is 26, showed athleticism early on. Todd molded Jake’s pitching motion and had a cobbler design a strap to secure the mitt over Jake’s non-throwing hand. Jake went on to pitch at a community college in Dallas County.\n“When I heard what his son was doing, it gave me a lot of encouragement for Jackson to do whatever he wants to do,” Reid said.\nJackson learned the game in his backyard with his father and grandfather, an executive adviser with the Astros.\nAs a kid, he capably bunted, drew walks, attempted to bat one-handed and fielded at first base. It took longer to coordinate his glove switch - using the same hand to field, retrieve and then throw the ball - swiftly enough to keep up with the speed of a game.\nHe took his hacks when outfielders played glaringly shallow and chased down dribblers when opposing coaches signaled for bunts.\nBy age 10, Jackson refined his techniques to compete and committed to developing southpaw pitching mechanics. He started off by keeping his mitt on the mound dirt, but coaches feared that left him vulnerable to dangerous comebackers.\nA fellow Little League father, who worked in medical supplies, thought of lining Velcro across the webbing of a mitt and wrapping more around Jackson’s hand.\nThick straps of black Velcro extend from Jackson’s right forearm and curl around his clenched right fist, making for an ideal nodule on which to hang the glove.\nSecond Baptist games routinely feature teenagers throwing more than 80 mph. Jackson’s inflexibility prevents him from extending his arms and forming a kinetic whip that would generate elite velocity. Without much potency in his pitches, he has to induce soft contact with accurate fastballs and curveballs low in the zone.\n“Just for Jake and Jackson to walk down the street, they burn about 150 percent of the energy that you and I burn,” Todd said. “There is an effort for them to do just about anything. They have to work harder. They have to use a lot of mental energy, which I think makes them stronger mentally.”\nShowing poise\nJackson showed more poise than prowess in an outing that spiraled into a mercy loss to Episcopal. He came on in relief in the top of the first inning, with Second Baptist down 6-0 and one out. He surrendered an opposite-field triple on a curveball. He walked and plunked the next batters. Then he walked in a run.\n“That he’s playing is impressive,” said Jimmy Disch, a professor of analytics at Rice University, who attended the game. “You have the Special Olympics and stuff like that, but here he’s getting to compete with his classmates.”\nJackson allowed three runs and was removed from the game. He ambled to the dugout and then sat quietly.\nHis mess set up a grand slam by a player who had hit another grand slam earlier in the inning. Episcopal won 24-0.\nIt was the first time Reid had seen Jackson pitch on varsity. He strained during the inning more than his son.\nDressed in a Second Baptist polo, jeans and gray Lacoste boating shoes, Reid was self-sequestered in a paved space between two bleachers, where his antsy energy could go less noticed and he would not have to chat.\nAt first, he leaned over a trash bin so he could place down an enormous iced tea. Then, the worse Jackson pitched, the more Reid paced back and forth and slurped on his drink.\n“Hey Reid, you’re gonna run outta ice tea there,” a parent called out from the stands. Reid smiled back and offered a passable chuckle.\nHe examined his son’s mechanics for a flaw that might explain the wayward pitches. He thought Jackson was “drifting,” that his front leg was moving forward a bit too soon.\n“The thing I always try to teach him is: You gotta try to get better every outing,” Reid said. “What did you learn? What are the adjustments you make the next time you go out?”\nIn the span of less than an inning, Reid circled like a nervous father, instructed like a former college pitcher, and sounded like an admirer.\n“He’s a competitor, and he doesn’t want to be any different from anyone else,” Reid said. “He doesn’t want anything given to him. No special treatment.\n“And that’s what I respect about him, too.”", "url": "https://apnews.com/02495402628a4533ab6b5c94f8c2844c"}