{"authors": ["Irene North"], "date_download": "2020-05-04 20:20:17", "date_modify": "2020-05-04 20:20:17", "date_publish": "2017-10-11 00:30:00", "description": "GERING — Halloween music from the 1920s echoes through the rotating exhibit hall at the Legacy of the Plains Museum. Visitors who stop in can learn about the history of Halloween through several...", "filename": "_689cc557c637443e89ffcad330329291_1588623617.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_689cc557c637443e89ffcad330329291_1588623617.html", "title": "Museum inspired by the 1920s in Halloween display", "title_page": "Museum inspired by the 1920s in Halloween display", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GERING — Halloween music from the 1920s echoes through the rotating exhibit hall at the Legacy of the Plains Museum. Visitors who stop in can learn about the history of Halloween through several exhibits and interactive designs.\nDirector Amanda Gibbs and Curator Olivia Garl have redone the rotating exhibit room to look like an exhibition hall from the 1920s. Taking examples from Dennison’s Party Magazine from the time, the room used several ideas throughout the booklet to create the historical layout of the room.\n“It’s meant to be more of an experience than an exhibit,” Gibbs said. “It’s a mix of artifacts and experience to create how Halloween was celebrated in the 1920s.”\nDennison’s Party Magazine is filled with ideas for costumes and how to make them, how to create invitations, how to play Halloween Bridge and scary stories to tell.\n“The costumes were usually made of mat stock or two-fold crepe paper,” she said. “Usually, you pasted them or sewed them onto muslin.”\nMat stock is a thicker, cardboard, similar to the mat board used in framing pictures. Crepe paper is thin, crinkled paper used for decorating. Muslin is a cotton fabric commonly used in making garments.\nAlso included in the magazine was an article about how to host a prison-themed party.\n“You didn’t have to worry about being politically correct then,” she said.\nAs Gibbs and Garl decorated the room, they noticed how much time is involved in hanging decorations and hanging crepe paper streamers. The pair were thankful they only had to decorate one room and not an entire dance hall, which was typical at the time.\nGibbs said she understood why, today, we typically have music, games and light decorations.\n“People really went all out for their parties in the ’20s,” she said.\nHalloween was at the right time for many. It was right after harvest and was a good time to have a party. The parties also allowed women to have some kind of control in their lives. It was a chance to interact with people they might not interact with on a normal basis, Gibbs said.\nVisitors are encouraged to count the bats in the room and take their number to the front desk. If they get them all, they’ll win a prize. They can also get creative and make a mask. When they are done, there’s an area where they can take selfies with their masks.\nAt a pumpkin interactive display, visitors are encouraged to randomly pick a pumpkin. The number on its bottom reveals your fortune listed on the nearby wall. The snap-apple shows how apples were hung on a string. A man and a woman tried to bite the apple. Whoever bites it first was said to be the first to get married. Today, the first person gets a prize.\nBobbing for apples was also a male only affair. Girls would write their name on the apple while the boy would try to get the fruit using only their teeth.\n“The girls would hope their crush got the apple with their name on it,” Gibbs said. “If the boy missed, it meant his true love wasn’t at the party.”\nRecipes from the magazine have been copied and laid around a table decorated with period silverware, Halloween decorations and witches’ hats.\nGibbs is a huge fan of the holiday and one of her favorite stories to tell is how events in the U.S. influenced Halloween. The day was originally for young adults, love and matchmaking instead of scaring each other.\n“There was some scary stuff, but not like what we think of today,” she said. “And haunted houses weren’t even a thing.”\nThe crash of the stock market in 1929 was also a factor influencing Halloween, including Mischief Night.\n“Two days before Halloween, the stock market crashed,” she said. “There’s all these people laid off so they put on masks and started vandalizing and looting.”\nMischief Night today is much tamer than it was just after the crash. It was not uncommon to vandalize a house or break in and steal things.\n“Tipping over outhouses was common,” Gibbs said. “Especially when someone was in it.”\nThat behavior wasn’t as predominate in the Panhandle. Neither was the crash. The Star-Herald buried it on page six. No one thought much about it at the time.\nBy World War II, Mischief Night subsided because most of the men were at war and children knew if they pulled pranks, they were the ones who would have to clean everything up. Popular items used on Mischief Night, such as soap, were also rationed.\nPresident Franklin D. Roosevelt encouraged people to have more Halloween parties. After the war, trick-or-treating picked up. The media promoted the event and costumes became more diverse. In “It’s the Great Pumpkin, Charlie Brown,” the children exclaimed what they received trick-or-treating.\n“I got five pieces of candy,” Lucy said.\n“I got a chocolate bar,” Violet said.\n“I got a quarter,” Patty said.\n“I got a rock,” Charlie Brown said.\n“Those were really things kids got then,” Gibbs said. “I feel bad for any kid that got a rock.”\nDisney eventually opened a haunted mansion ride, starting a trend. The Jaycees made the first haunted houses, which continue to grow in popularity. Political costumes appeared in the 1960s.\nEveryone is welcome to come see the exhibit. Gibbs warns, however, do not feed the skeletons.\nThe exhibit is open until Nov. 2. The Legacy of the Plains Museum will also be hosting a trick-or-treat on Oct. 31. From 3-5 p.m., and youth ages 0-16 that comes in dressed up will receive candy.", "url": "https://apnews.com/689cc557c637443e89ffcad330329291"}