{"authors": ["Jim Camden"], "date_download": "2020-05-04 20:15:47", "date_modify": "2020-05-04 20:15:47", "date_publish": "2017-01-01 00:00:00", "description": "Happy New Year. But before we stick a fork in the overstuffed and overdone turkey that was 2016, it’s traditional to give out awards for the political year past. The envelopes,...", "filename": "_a0671fd8b77440db8592c9368df199aa_1588623347.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a0671fd8b77440db8592c9368df199aa_1588623347.html", "title": "Spin Control: Looking back at the year in politics", "title_page": "Spin Control: Looking back at the year in politics", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Happy New Year. But before we stick a fork in the overstuffed and overdone turkey that was 2016, it’s traditional to give out awards for the political year past.\nThe envelopes, please.\nThe Emily Latella Trophy, named after the Gilda Radner character whose catchphrase was “Never mind!”: to unnamed members of the Trump transition team, who spent several days leaking to members of the national media – anonymously, of course – that the next interior secretary would be Rep. Cathy McMorris Rodgers, before anonymously leaking it was going to be Rep. Ryan Zinke of Montana.\nSilver Starter Pistol Awards, for jumping the gun: Three half-cocked versions go to three local politicians who jumped into a race for a congressional seat held by a fellow Republican that wasn’t actually open: Sheriff Ozzie Knezovich, state Sen. Mike Baumgartner, state Rep. Matt Shea. A fully fired version goes to Spokane City Council President Ben Stuckart, who also announced a campaign against Cathy McMorris Rodgers when she was mentioned as a possible interior secretary in the new administration, then decided to stay in for a race against her in 2018 when it was clear that Team Trump was just messing with everyone.\nThe I’m No Hammurabi Citation, named for one of the first people to set down laws, to a candidate or elected official who clearly didn’t read one before speaking: to Tina Podlodowski, Democratic candidate for Washington secretary of state, who said her GOP rival, incumbent Kim Wyman, should cancel the presidential primary less than a month before it took place. Although Wyman’s office runs elections in Washington, it has no power to cancel an election that was budgeted by the Legislature and required by statute.\nThe Cloudy Crystal Ball, for the worst prediction of the campaign season: to state Republican Chairwoman Susan Hutchison, for predicting Donald Trump would win Snohomish County on his way to winning Washington. He didn’t, and he didn’t. Sure, she was just repeating something her nominee said, but he doesn’t know state politics, and she does.\nThe Bronzed Old Chestnut Medallion, for a bad idea that keeps coming back: to the proposed legislation to split Washington into two states, a half-baked proposal with at least 100 years of history being introduced and an equal amount of time of not happening. Giant suckers to be presented at the awards ceremony for television news accounts that treated this like a serious idea that has a chance of creating a 51st state.\nThe Benedick and Beatrice Loving Cup, named for the characters in “Much Ado About Nothing”: to the Hamilton electors movement that tried to get members of the Electoral College to vote for someone other than Trump and throw the presidential election into the House of Representatives. They even went to federal court trying to avoid the penalty in Washington law for doing that. Unfortunately for the “movement,” the three electors in Washington who voted for Colin Powell took votes from Hillary Clinton. In Texas, Trump lost a vote to John Kasich and one to Ron Paul, but those are secret ballots, so it’s unclear if they were actual Hamilton electors. The biggest impact of the protest movement will be to add asterisks to the 2016 Electoral College tabulation … and possibly a fine for Washington electors who broke their pledge to support their party’s nominee.\nThe Golden Buggy Whip, for the most anachronistic element of the campaign season: to the Washington precinct caucus system. Both parties held them, with Republicans using them to start a process that selected national delegates before the presidential primary was held, so Ted Cruz delegates wound up pledged to Trump. The Democrats ignored the primary results, which favored Clinton, so many of their delegates supported Sanders, who won the caucuses. Best news from state Democrats is they could stagger into the 20th century and use the primary in 2020.\nA supersized Smiley Face Certificate, for the most optimistic interpretation of bad results: to the Bill Bryant for Governor campaign and its creative math in interpreting the results of the state primary. Although Bryant trailed incumbent Jay Inslee by some 10 percentage points in the primary, the campaign said that should be seen as down to only about 4 points by adding in the votes of the other Republican Bill Hirt, because after all, they have the same first name. And keeping an incumbent under 50 percent historically signaled trouble for said incumbent, they opined. A check of elections going back 60 years says there’s no such pattern; the more likely indicator of success in the general is coming out on top in the primary. Which happened in 2016.\nA letter from the Department of Redundancy Department: to the Spokane City Council’s resolution changing Columbus Day to Indigenous Peoples Day, when the Legislature has already declared the day after Thanksgiving Native American Heritage Day. Not that the folks who had their land stolen, their culture smashed, language all but wiped out and their numbers decimated don’t deserve plenty of respect and recognition. But can’t anyone think of a day to honor them that isn’t tied to the heritage of white folks who were responsible for all that?\nSpin Control, a weekly column by political reporter Jim Camden, also appears online with daily items and reader comments at www.spokesman. com/blogs/spincontrol.", "url": "https://apnews.com/a0671fd8b77440db8592c9368df199aa"}