{"authors": ["Jennifer Turiano"], "date_download": "2020-05-04 20:18:27", "date_modify": "2020-05-04 20:18:27", "date_publish": "2017-07-28 20:29:01", "description": "J: How old are you? L: 78. J: And where are you from?", "filename": "_c52a652ac5d046378272931b13d1f6a9_1588623507.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c52a652ac5d046378272931b13d1f6a9_1588623507.html", "title": "Words from the Wise: Lucila Huerta has found good medical care and friends in Greenwich", "title_page": "Words from the Wise: Lucila Huerta has found good medical care and friends in Greenwich", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "J: How old are you?\nL: 78.\nJ: And where are you from?\nL: Peru. From a place, it’s a department, called Ancash. Here you say state, we say department. We lived in a city where you could look out and see all of the mountains, the Cordillera Blanca.\nJ: When did you come to the U.S.?\nL: I came here 15 years ago.\nJ: Did you come to Greenwich?\nL: No, I went with the intention of going to Boston, but I had some nieces and nephews studying here in Norwalk so I went to see them ... Then went to Boston. I have an aunt in Boston — then I went to a hospital, Wellesley, so they could look at my hip because I had the idea that they could operate on my hip. They did X-rays and when they showed me — it was like a horror film. My hip was terrible. I had fallen when I was 8 years old, and then my hip stayed fractured and dislocated. It’s possible the X-ray in Lima wasn’t clear or something, or that my parents didn’t have the money to do the operation. I yelled so much at the hospital that I didn’t want to go back, it hurt so much, and (my parents) said, “She doesn’t want to go back.” So I stayed like this, but I could walk. I just didn’t walk much so it didn’t hurt. When I became an adult, I went myself to Lima and for another X-ray, and the doctor couldn’t find the X-ray, and I had to do another appointment (there). In this time, to go to Lima, you had to take all day. I had to ask for three days off from my job: one day to go there, one day for the hospital, and one day to return. It was very difficult. I remember going six times and I grew tired, so I didn’t go anymore. But when I went to Wellesley it seemed even more distant from me than ever. The doctor, he spoke to me with compassion. He said, “I can do the surgery for you with no cost, but you have to pay for the hospitalization.” It was $100,000. It was a quantity I could not imagine. I told my aunt we should go. So I returned to see my (family) in Norwalk and said I would save the money by working. I was working as a housekeeper, but my hip began to hurt. It wasn’t for me.\nJ: Because you move so much?\nL: Yes, and with all the movement, you need your hips ... for everything. But I was just working. I went to work for an Argentinian family, and they were very kind and respectful to me. They loved me very much, but they had to leave after nine months because they went to Argentina, so I kept trying to save money. Then my nieces and nephews went to Trumbull, and it was too far ... so I was looking on the computer for a place to stay, but they were all apartments and I couldn’t find anything here, Bridgeport, Norwalk, anywhere, because I was working little. I continued to work and then one day I became deaf. I couldn’t hear, and my friend said, “Let’s go to the hospital now!” So we went to the hospital down the Post Road in Norwalk because I thought it would be less expensive. I told them about my hip. They did blood tests and everything; they said that I had high blood pressure and gave me some pills and I began to hear again.\nJ: Because it lowered the blood pressure.\nL: Yes, but then they said I should go to Greenwich because they didn’t have a specialist for bones in Norwalk. I didn’t want to go to Greenwich because I thought it would be too expensive. I said, “Take me to Bridgeport.” I wouldn’t be able to pay in Greenwich, but they said no. It resulted in me being asked everything, everything — all the dates of everything (that had happened to me, and the hospital) said they would do the operation for free, and they operated on me. The money I had been saving, I use that money now to live. I am healing, I do physical therapy.\nJ: Everything is paid?\nL: Yes, they paid for it all. I didn’t have insurance — When I came here to the U.S., I realized that the best people I have ever met (in this country) were those in Greenwich. And the people at St. Catherine’s Church of Siena, they have helped me too. They gave me strength and I went to a friend’s house, near the Hyatt, and my friends from the church helped me there. I am so grateful for all of this. For me it has been something that I could have never hoped for. The Holy Spirit has blessed me, and in many ways (I have been blessed) like this. How did I get to Greenwich? I couldn’t have imagined looking for a place to live here. But I can pay for what I need with what I have saved.\nJ: Now where do you live?\nL: Alone, in Riverside. I’ve been there five years. It’s almost exactly by Exit 5, by McDonald’s and the shopping plaza. Wescott Street is the name of the street.\nJ: This story is ... a story of hope, and after all this time waiting and waiting.\nL: I was going to leave last April because I had nothing to do, and I was going to give up. It costs so much money to live here in the U.S. I was desperate and I said I would just leave. To be here is to work and if I could only work little, where would this money come from? But I am now healing. In September, I have my follow-up meeting with my doctor to check up on prescriptions and everything.\nJ: This September.\nL: Yes, to see how I’ve progressed.\nJ: When did you have the surgery?\nL: Feb. 6. And it was perfect. The whole world asks me who operated on me because I am walking so well. This makes me happy. If someone asks about problems with knee or hip, they ask me who operated on me. His name is Dr. Hughes, Peter Hughes.\nThis interview has been translated from Spanish, and the Spanish version will be made available at www.greenwichtime.com\nEsta entrevista está traducida del español original al inglés para el periódico. La versión original, en el español se puede encontrar en el sitio web www.greenwichtime.com\nE: JTuriano@greenwichtime.com; T: @jturianoGT; IG: greenwichgreen", "url": "https://apnews.com/c52a652ac5d046378272931b13d1f6a9"}