{"authors": ["Matt Bruenig", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Shant Mesrobian", "Adam Gaffney", "Colin Gordon", "Robbie Nelson"], "date_download": "2020-05-04 19:59:21", "date_modify": "2020-05-04 19:59:21", "date_publish": "2017-12-27 00:00:00", "description": null, "filename": "2017_12_republican-tax-bill-obamacare-mandate-single-payer_1588622361.html", "image_url": "https://images.jacobinmag.com/2017/12/27114456/11881786714_537c702935_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_12_republican-tax-bill-obamacare-mandate-single-payer_1588622361.html", "title": "Medicare for All Is the Answer", "title_page": "Medicare for All Is the Answer", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The Republicans finally passed their tax reform bill earlier this month (bill text, JCT budget effects, JCT distributional effects). Overall the bill reduces revenue, on net, by around $1.5 trillion over the next ten years, or about 0.6 percent of projected GDP over that period. In distributional terms, the rich benefit far more than the poor and middle class. Indeed, by the end of the tax plan, those making below $75,000 per year will actually be paying higher taxes.\nIn addition to a rich-heavy tax cut, the plan repeals Obamacare’s individual mandate. The mandate required individuals to buy health insurance or else pay a fine to the IRS every year. The CBO estimates that eliminating the mandate in this manner will result in 13 million fewer people having health insurance by 2025, bringing the total uninsured in that year to 41 million. When Barack Obama was elected president in 2008, 46 million Americans were uninsured.\nThe CBO also estimates that premiums on the exchanges will be about 10 percent higher each year than they would have been had the individual mandate been retained. This is because those dropping out of insurance will be healthier on average than those staying in, which will drive up the per-person cost to provide care for those remaining in the insurance pools.\nWhat this all means is that Obamacare failed the survival test. As soon as the opposition party got into government, they were able to relatively easily set it down a path towards collapse. Obamacare’s bad design is one of the reasons they were able to do this. Rather than levying taxes and providing health insurance directly, Obamacare relied on a Rube Goldberg–type design where private insurers were forced to provide plans to everyone at the same price, individuals were forced to buy it from them, and then the government came in with subsidies to smooth it all out. It turns out fining people for not buying into private insurance is unpopular and this unpopularity made it possible for the GOP to get rid of the fine, which will have the effect of destabilizing the rest of the scheme.\nSince the mandate remains unpopular, it is hard to imagine the next Democratic push being centered around merely restoring the mandate in 2021 (at the earliest). This would be an especially confusing move since, even with the mandate, the CBO estimates that 28 million people will lack health insurance in 2025. “We’re going to force you to send money to private insurers so that we can get the number of uninsured down to 30 million!” is not an inspiring message, to say the least. Also, if you have the votes in Congress to reinstall the mandate, then you should also have the votes to do something much better than that.\nA more obvious way forward is to follow the lead of the grassroots left and the political views of the vast majority of Democratic voters by pushing for a single-payer system that covers everyone. Unlike Obamacare, once implemented, a single-payer system would be virtually impossible to get rid of or to fundamentally undermine.\nWhen Republicans swept into power, they might try to nibble around the edges of such a system with various privatization schemes, just as conservative parties in other countries do. But, after universal coverage is achieved and the private insurance sector is decimated, Republicans would be neither willing nor able to turn the clock back.", "url": "https://www.jacobinmag.com/2017/12/republican-tax-bill-obamacare-mandate-single-payer"}