{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:16:57", "date_modify": "2020-05-04 20:16:57", "date_publish": "2017-11-11 06:00:00", "description": "Just like JeffRe: “Records counter Trump, Sessions on Russia contact; Adviser allegedly told both men of his connections,” Nation & World, Nov. 3:The bad news for Attorney General Jeff Sessions,...", "filename": "_4e8608ef6fb54e0b84cec537cd9fb52a_1588623417.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4e8608ef6fb54e0b84cec537cd9fb52a_1588623417.html", "title": "Your Turn: November 12", "title_page": "Your Turn: November 12", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Just like JeffRe: “Records counter Trump, Sessions on Russia contact; Adviser allegedly told both men of his connections,” Nation & World, Nov. 3:The bad news for Attorney General Jeff Sessions, who lied about meeting Russian officials as a member of Donald Trump’s presidential election campaign, is that he might find himself in the next round of indictments spawned by the investigation of special counsel Robert Mueller.The good news for the nation’s top law enforcement officer? He’ll be entitled to a trial by a jury of his peers. So expect his defense team to insist on a panel comprised of aging Southerners, all with the middle name Beauregard.Carl OlsonAll walled inPresident Donald Trump’s bullying demeanor has hit a wall, one bigger than that thousand-mile stretch promised his base.Deflecting and denying won’t impede the parapet pressing against him. Even the president’s usual bank of lawyers has not affected the stone-faced Robert Mueller’s unraveling of Russian influence on a presidential election.Nor will a four-star general in the Oval Office halt Mueller’s posse if the trail of treason leads to the same place as former President Harry S. Truman’s famous “buck.”Trump should have surrounded himself with Mexicans rather than generals; they have proven themselves very adept at circumventing walls.Mary Alice Altorfer, New BraunfelsNFL buffoonsDoesn’t it seem odd that professional athletes who make salaries of six or even seven figures show utter contempt for the country and its freedoms that made such (obscene) salaries possible, while thousands of persons of far humbler circumstance show respect for our flag and country?While it is true that these smugly self-righteous athletes (with their bloated salaries and “celebrity status”) are perfectly within their constitutionally protected rights to spit on the country that has made their wealth and status possible, the rest of us are equally within our constitutionally protected rights to decline to purchase season tickets or buy the products endorsed by these buffoons.G.L. LambornCalling CondoleezzaWhen Condoleezza Rice was secretary of state, she was asked, “What would be your dream job?”She answered, “NFL commissioner.”Now is the time!Matt Diana, BoernePop’s moral standI am so proud to be from a city that has a basketball team like the Spurs and a coach like Gregg Popovich. A man who could easily rest in his white privilege. Instead, he takes a brave and moral stand.When I read the negative comments about coach Popovich, two quotes from Martin Luther King Jr. come to mind:“For evil to succeed, all it needs is for good men to do nothing.”“We who engage in nonviolent direct action are not the creators of tension. We merely bring to the surface the hidden tension that is already alive.”Thank you, Pop!Go Spurs!Terri GorlerWhite privilege livesRe: “Pop’s ivory tower,” Your Turn, Oct. 5:The letter criticizing coach Gregg Popovich questioned whether white privilege exists.The letter writer seemed to think that since some black NFL players are millionaires while the writer struggles to pay bills that it somehow negates the concept that, other things being equal, whites in America are born with a leg up and that we journey through life with certain advantages that are often denied to people of color and other minority groups.Yet the recent horrendous event in Nevada provides another striking example of white privilege — in that even though the killer, like so many other times, turned out to be a white man, whites don’t have to fear any societal retribution or guilt by association. Innocent white people will not be held accountable or blamed for the terrible crime of this one man. Would that be the case if the crime had been committed by a Muslim or a black man?White privilege is too often taken for granted by people who have benefited from it their entire lives, yet it remains one of the most powerful entrenched forces in our society.Beverly Ann HebertYesterday’s goneWould it not be great to have the role models of yesterday to lead the Dallas Cowboys and the San Antonio Spurs.Where are the Roger Staubachs (Cowboys) and David Robinsons (Spurs) today when we need them?John DallmannCoach does it againRe: “More of the same; Shorthanded Spurs still can’t match Warriors,” Sports, Nov. 3:Coach Gregg Popovich has done it again. He came up with a flimsy reason to get himself thrown out of the game because he became fed up with seeing his own failure once again. Seems to me like a cowardly way to get off the court. During this basketball season, watch to see how many times he does that.Maybe Coach Popovich needs to take the reflection test to help him develop more controlled actions and/or reactions.Mike PattersonStill not old enoughRe: “City Council should rethink the Tobacco21 push,” Paul DiGiovanni, Oct. 30:The argument that 18- to 20-year-olds can do certain things and, thus, should be allowed to purchase tobacco products is spurious. There are a number of other things this age group cannot do. Just read state and federal laws about foster care, police training, holding elected office, etc.Besides, if 18- to 20-year-olds want to smoke, there are e-cigarettes. They do not contain chemicals that cause heart, lung and other diseases.Charlene Kaiser, Pipe Creek", "url": "https://apnews.com/4e8608ef6fb54e0b84cec537cd9fb52a"}