{"authors": ["James Towney Today S News Herald"], "date_download": "2020-05-04 20:26:33", "date_modify": "2020-05-04 20:26:33", "date_publish": "2017-12-12 06:34:00", "description": "This past week proved to be a big one for the Lake Havasu High School Athletic Department. Three teams from three different sports all competed in tournaments and dominated their...", "filename": "_be18eb2273b44bd4969a99954400641b_1588623993.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be18eb2273b44bd4969a99954400641b_1588623993.html", "title": "Big weekend for Knights", "title_page": "Big weekend for Knights", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This past week proved to be a big one for the Lake Havasu High School Athletic Department. Three teams from three different sports all competed in tournaments and dominated their competition.\nWrestling\nThe Lake Havasu wrestling team traveled to Wickenburg to compete in the Wickenburg Invitational meet.\nThere, nine out of the 11 wrestlers the Knights brought with them medaled in individual wrestling. Lake Havasu also went 6-0 in team duals, capturing first place.\nThe success the Knights have been having as of late can be attributed to new coaches, more discipline and further experience on the mat after some wrestlers attended wrestling summer camps this past summer.\nAnd it is safe to say the winning results are adding to the confidence of the team.\nHere are the wrestlers that placed in their specific weight class.\nKeyler Green placed second in the 106 pound division. Earle Parra placed first in the 120 pound division. Trenton Beyers placed second in the 126 pound division. Cory Pellerin took second in the 136 pound division. Austin Marsh place third in his division of 145 pounds. Devin Ray placed second in the 152 pound division. Robert Samsoe took first place in the 160 pound division. Jared Thomas took fourth in the 170 pound division and Kaden Ada place second in the division of 220 pounds.\nBoys Soccer\nAfter winning its first two games at the Mohave County Soccer Tournament, the Lake Havasu boys soccer team found themselves in the semifinals on Saturday where they would eventually take home the championship trophy.\nThe Knights first opponent of the day was Mohave who tied them 1-1 back on Nov. 28.\nThe two teams tied again at 1-1 with Lake Havasu’s lone goal coming from Jonathan Perez. It was in penalty kicks where Lake Havasu broke through to earn the win.\nThe Knights were able to find the back of the net on three penalty kicks opposed to the Thunderbirds two putting the final score at 4-3 and Lake Havasu onto the next round.\nLake Havasu faced Lee Williams in the championship round and routed the Volunteers in a 5-0 win to take home the trophy.\nFour different Knights scored in the championship round.\nBryson Chalfant led his team with two goals. Perez, Michael Reinartz and Angello Portocarrero each scored one goal apiece.\nLake Havasu will take on Yuma Catholic in a non-conference game today at 6 p.m.\nBoys Basketball\nThe Lake Havasu boys’ basketball team played a total of six games this weekend. After winning two on Friday, the Knights finished round robin play on Saturday to enter the championship bracket as the number two seed.\nLake Havasu won five of those six games with its one loss coming in the championship round to Lee Williams at 55-46.\nIn this game the Knights were outscored in every quarter but the fourth. Noah Boyd led his team offensively in the final game of the weekend with 13 points scored including three 3-pointers. Ryan Hopp and Abraham Rodriguez followed with nine points scored each, with Rodriguez hitting three 3 pointers.\nBut the story of the weekend for Lake Havasu athletics came in the game before the championship.\nIn the Knights 85-50 win over Mohave Accelerated Academy, Rodriguez broke a Division 5A basketball state record by scoring 13 3-pointers. After it was all said and done, Rodriguez racked up 41 points to lead his team into the championship round.\nLake Havasu plays Kingman Academy today in a non-conference match up at 5:30 p.m.", "url": "https://apnews.com/be18eb2273b44bd4969a99954400641b"}