{"authors": [], "date_download": "2020-05-04 20:10:42", "date_modify": "2020-05-04 20:10:42", "date_publish": "2017-10-10 19:34:00", "description": "To the dismay of some Chapel Hill residents, the Chapel Hill Historic District Commission voted Tuesday to allow best-selling author John Grisham to remove four century-old...", "filename": "_dbab7aacecd29c6a1ca1fffda5079c38_1588623042.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dbab7aacecd29c6a1ca1fffda5079c38_1588623042.html", "title": "The Appeal: Author Grisham gets OK to remove Chapel Hill cottages", "title_page": "The Appeal: Author Grisham gets OK to remove Chapel Hill cottages", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "To the dismay of some Chapel Hill residents, the Chapel Hill Historic District Commission voted Tuesday to allow best-selling author John Grisham to remove four century-old cottages.\nGrisham, who wrote such legal thrillers as “The Firm,” “The Pelican Brief” and “The Appeal,” asked the commission for approval to demolish or move the cottages at the back of his home, at 704 E. Franklin St., to provide more parking for guests and landscaping where his property backs up to Battle Park.\nThe four one-bedroom cottages off Park Place were built in 1920 from Sears & Roebuck kits and for a long time provided housing for University of North Carolina at Chapel Hill faculty members, according to an application JSA Architects provided to the Chapel Hill Historic District Commission to remove the structures.\n“They add charm and mystery into the landscape bordering Battle Park,” said Michele Natale, who used to rent one of the cottages as a second residence. “We have very few properties of this type. So, losing four of them that also serve as affordable standalone housing within the heart of town and campus is also of significance.”\nGrisham bought the East Franklin Street home within the past couple of years, and he purchased the four lots the cottages sit on this summer, Historic District Commission Chairman Bob Epting said.\nJim Spencer of Carrboro-based JSA Architects told commission members last month that Grisham and his wife don’t want tenants parking on their property, and they would like easier access to Battle Park.\n“Our goal really is to find a good home for these (cottages),” Spencer said at the Sept. 12 commission meeting. “We’d certainly love to have them not just be demolished.”\nThe commission agreed Tuesday and ordered Grishams to wait a year for any demolition. During that period, they must try to find someplace in town where they could move the cottages.\nAlthough commissioners expressed a desire to keep the cottages where they are, state law prevented them from denying the demolition order, although they are allowed to attach stipulations to it.\n“We have looked at a number of alternate sites for the structures, and I think that we will be able to find something that will work, assuming they are able to hold up when we move them,” Spencer said Tuesday.\nThe cottages “are in relatively poor condition overall,” with foundation and flooring issues, according to the application.\nNatale called the cottages “part of the landscape” of Chapel Hill that needs to be retained.\n“I would hope that an owner such as himself, who is a writer, would be able to understand that older structures, when they exist, allow people to enter imaginatively into another time and place,” she said. “If we lose these, we’ll be losing some part of that kind of history.”\nSpencer said he hopes to return to the commission in two months with a plan on where to move the cottages.", "url": "https://apnews.com/dbab7aacecd29c6a1ca1fffda5079c38"}