{"authors": ["Sarah Mclellan"], "date_download": "2020-05-04 20:18:08", "date_modify": "2020-05-04 20:18:08", "date_publish": "2017-12-12 19:58:26", "description": "When NHL free agency opened last summer, defenseman Ryan Murphy had a couple of offers for his services, but choosing to sign with the Wild was an easy decision. I looked up their lineup on...", "filename": "_cca6d745cfc44b6fb1c840394b7aa887_1588623488.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cca6d745cfc44b6fb1c840394b7aa887_1588623488.html", "title": "Ryan Murphy proving he can provide depth on the blue line", "title_page": "Ryan Murphy proving he can provide depth on the blue line", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When NHL free agency opened last summer, defenseman Ryan Murphy had a couple of offers for his services, but choosing to sign with the Wild was an easy decision.\nI looked up their lineup on the D corps and as much as theres a lot of good D down in Iowa, I figured I had a good chance of excelling down there in Iowa and hopefully be the first call-up, Murphy said.\nThe 24-year-olds forecast was spot on; not only was Murphy steady in his debut with the Wilds American Hockey League affiliate, but he also was the first one ushered up to the NHL when the Wilds depth took a hit.\nAnd ever since his promotion, Murphy hasnt left the lineup capitalizing on the chance to pick up regular minutes with Jared Spurgeon on the mend.\nIts tough when youre playing down in Iowa. You have a bad game, youre doubting yourself and wondering if youre ever going to get that call, Murphy said. If you have a good game, youre waiting for that call-up to happen.\nSo its definitely a roller-coaster ride waiting to get called up. But nonetheless, when you get your chance, you gotta seize the opportunity and make it hard for them to send you back down.\nMurphy made his seventh consecutive appearance Tuesday against the Flames, the team that bought Murphy out last summer following a trade from the Hurricanes to make him a free agent.\nAt the time, coach Bruce Boudreau didnt know if Murphy signing a one-year, two-way contract was a depth addition or a purely minor league acquisition. It turned out to be the former, with Murphy a first-round pick by the Hurricanes in 2011 slotting into the top six after Spurgeon went down Nov. 27 with a groin strain.\nHes gotten better every game for us, Boudreau said.\nThrough his first six games with the Wild, Murphy has averaged nearly 18 minutes of ice time per game, filled out a second pairing with Jonas Brodin and assumed a role on the power play an assignment that led to his first goal in 69 NHL games Sunday in the Wilds 4-3 overtime win over the Sharks.\nI feel good about my game, Murphy said, and hopefully I continue to make strides every day.\nInjury update\nSpurgeon could rejoin the Wild at practice Wednesday.\nIm hoping hes an option this week at some point, Boudreau said. But Im not the doctor.\nWinger Zach Parises return to practice isnt as imminent, although he continues to recover after undergoing back surgery that relieved pressure on a nerve causing leg pain and weakness and is now working with pucks.\nHe feels great talking to him [Tuesday], Boudreau said. Theres no pain. So I dont know when his due date is to play, but Im sure its sooner than later.\nMix and match\nHaving an extra forward and defenseman on the roster amplifies the pressure on the players to perform, and it also allows Boudreau to tinker with his lineup flexibility he continued to utilize, as he once again switched up the Wilds look against the Flames.\nWinger Tyler Ennis was the odd man out up front, with defenseman Mike Reilly idle again after sitting out Sunday.\nWeve done a little bit of a rotation, Boudreau said. I assume the rotation is going to stop fairly soon, but right now guys are playing good and then they get out of the lineup and then they get back in and theyre playing good.\nBoudreau kept Daniel Winnik at center and Joel Eriksson Ek on the wing.\nThe coach likes Eriksson Ek up the middle but said he may end up as a winger because of his forechecking ability. As for Winnik, his recent switch from wing to center has looked seamless.", "url": "https://apnews.com/cca6d745cfc44b6fb1c840394b7aa887"}