{"authors": ["Daniel Kato", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:08", "date_modify": "2020-05-04 19:52:08", "date_publish": "2017-01-17 00:00:00", "description": null, "filename": "2017_01__1588621928.html", "image_url": "https://images.jacobinmag.com/2017/01/17233424/imperial-trump.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_01__1588621928.html", "title": "The Imperial Presidency 3.0", "title_page": "The Imperial Presidency 3.0", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Barely a week into his presidency, Donald Trump had already signed dozens of executive orders, each more cringeworthy than the last. His power grab partly comes from his leadership style. But we must also put his actions in the context of the longstanding history of the imperial presidency.\nTrump’s presidency epitomizes a problem that has been years in the making. Richard Nixon started it, George W. Bush resurrected it, Barack Obama normalized it, and now Donald Trump is seizing and extending it.\nArthur Schlesinger Jr first coined the term “imperial presidency” in 1973 in response to Nixon’s executive overreach. Between his secret war against Laos and his now infamous statement about presidential impunity — “when the president does it, that means it is not illegal” — Schlesinger worried that the role of commander-in-chief had gotten out of control and needed new restraint.\nIn 1998, he backtracked, citing Kenneth Starr’s assaults on the executive office, but Bush’s “war on terror” forced him to revisit the concept. According to Schlesinger, Bush did not simply bring back the imperial presidency — he ratcheted it up.\nSchlesinger cited three key areas where Bush added to what Nixon established. First, the Bush administration engaged in speculative wars. According to Schlesinger, its emphasis on preemption dictated a degree of speculation:\nThe essence of [Bush’s] strategy is military: to strike a potential enemy, unilaterally if necessary, before he has a chance to strike us . . . Preventive war refers to potential, future, therefore speculative threats.\nSecondly, he noted how intelligence had become a political tool. “Instead of using intelligence as evidence on which to base a decision about policy . . . we used intelligence as the basis on which to justify a policy on which we had already settled.”\nFinally, the fear of false positives affected all decisions. False negatives refer to instances where over-extensive security measures round up innocent people in times of crisis. False positives represent the opposite: actual threats are released when security measures don’t go far enough. The Bush administration believed it was safer, and therefore better, to enforce policies that created more false negatives than false positives.\nEven though Bush ended his two terms in ignominy, his administration never descended into the kinds of scandals that Nixon faced, nor did the succeeding administration scrutinize it. Obama did not launch any criminal investigations, Congress did not respond like it did after Nixon’s resignation with something like the War Powers Act, and the judiciary gradually stopped evaluating cases that pertained to the war on terror and executive overreach. Obama didn’t repudiate Bush’s tactics as much as provide a liberal gloss for them.\nConor Friedersdorf has noted this continuity:\nObama inherited a newly powerful executive branch, just as Cheney had hoped. And rather than dismantle it, Obama spent two terms lending the imprimatur of centrist, establishment bipartisanship to Cheney’s vision.\nEven though the Obama administration did not exactly replicate the previous leadership’s policies, the Democrat nevertheless made the imperial presidency feel normal.\nBack in 1944, Supreme Court Justice Robert Jackson worried about this danger. In his opinion on Japanese-American internment, Jackson argued that if you do not repudiate acts of executive overreach, then it just “lies about like a loaded weapon, ready for the hand of any authority that can bring forward a plausible claim of an urgent need.”\nNow we come to President Trump. He has wasted no time asserting his authority. His methods conjure up the imperial presidency but in a manner that extends its absurdist logic to the extreme.\nFirst, just as Dick Cheney refused to provide details about the Energy Task Force he chaired, Trump ordered the Environmental Protection Agency to institute a media blackout. Both place activities that seem to warrant transparency and have no bearing on national security behind a wall of secrecy. Trump has taken this further, as it includes all of an entire agency’s activities.\nSecondly, the Trump administration’s emphasis on “alternative facts” resembles the circumstantial evidence that the Bush administration proffered to lead us into war. Kellyanne Conway’s and Sean Spicer’s alternative facts are even less grounded in reality than the intelligence findings Colin Powell presented to the United Nations. But both started when the administration decided to use information to justify a particular course of action, rather than determining a course of action after studying the available evidence.\nFinally, Trump’s reasoning behind banning Muslim immigrants resembles Bush’s argument that we had to invade Iraq because Saddam Hussein supported the September 11 attacks. Both decisions are based on groundless speculation but are primarily justified by raising the possibility of false positives.\nIf Nixon was the original imperial president and Trump is version 3.0, we can see how each version becomes more dangerous than the previous one in that it takes past practices even further.\nTrump has already extended the imperial presidency’s speculative nature to the point that lies and groundless suspicions warrant action.\nIntelligence has become a matter of personal opinion. Trump says he’s the CIA’s biggest fan, but he doesn’t seem to need them anymore.\nPolicy decisions, like his immigration order, come more from racist intuition than empirical data.\nSchlesinger warned that Bush made war a matter of presidential choice. Trump is going to make policies that were once decided by discussion and data a matter of gut instinct — his gut instinct. In this, Trump’s presidency does not represent an aberration, but a culmination. It carries a compulsion toward presidential power to reckless extremes. It won’t be enough to vote Trump out; we must end the imperial presidency.", "url": "https://www.jacobinmag.com/2017/01/trump-imperial-presidency-executive-orders-muslim-ban/"}