{"authors": ["Chris Maisano", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:52:28", "date_modify": "2020-05-04 19:52:28", "date_publish": "2017-07-10 00:00:00", "description": null, "filename": "2017_07_new-york-fiscal-crisis-debt-municipal-politics-elections-socialists_1588621948.html", "image_url": "https://images.jacobinmag.com/2017/07/10162045/nyc.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_07_new-york-fiscal-crisis-debt-municipal-politics-elections-socialists_1588621948.html", "title": "The Fall of Working-Class New York", "title_page": "The Fall of Working-Class New York", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIt’s impossible to read Fear City: New York’s Fiscal Crisis and the Rise of Austerity Politics, the excellent new book on the 1970s New York City fiscal crisis by Kim Phillips-Fein, without recalling the lamentations of longtime Democratic strategist James Carville: “I used to think that if there was reincarnation, I wanted to come back as the president or the pope or as a .400 baseball hitter. But now I would like to come back as the bond market. You can intimidate everybody.” The New York City fiscal crisis was a turning point not just for the city, but the subsequent development of global capitalism. It sounded the death knell for the golden age of postwar liberalism, and heralded the emergence of finance as the leading edge of capital’s dynamism and power. With the city’s balance sheet in shambles, the banks that funded much of New York’s sprawling municipal budget used their financial leverage to foster a major political crisis — and Wall Street’s leading figures wasted little time in taking advantage of it. The fiscal crisis served as the battering ram for a ruling-class agenda that sought to disempower local elected officials, bring public-sector unions to heel, and justify a brutal austerity program that became the template not just for domestic Reaganism, but for neoliberal “structural adjustment” measures in Latin America and around the world. As the saying goes, in a crisis, assets return to their rightful owners. The same could be said for political power. These are the moments when economic elites, who typically let politicians and state managers tend their own field during normal times, have an opportunity to step forward to assert the fundamental power of capital in the political arena. The central lesson of New York’s fiscal crisis is that being in office does not necessarily amount to being in power — especially at the municipal level. With a new generation setting off on the electoral road to socialism, the story that Phillips-Fein tells couldn’t be timelier.\nThe Fall of Working-Class New York New York’s postwar golden age was indelibly linked to its working class, and the central position it occupied in the city’s politics and culture. As Joshua Freeman vividly illustrates in Working-Class New York, Gotham’s welfare state drew its strength from a dense network of collective working-class institutions: ethnic organizations, Democratic Party clubs, socialist and communist parties, neighborhood associations, and above all, the labor unions that organized roughly a third of the local workforce in this period. The city’s private sector blue-collar workers succeeded in organizing on a mass scale in the 1930s and 1940s. They were joined in the 1950s and 1960s by municipal workers of all stripes, who won the legal right to organize and bargain under the so-called “Little Wagner Act” of 1958. This was a largely unprecedented step at the time — public employees were deliberately excluded from the National Labor Relations Act of 1935, and as late as 1960 only 2 percent of state and local workers had the legal right to bargain collectively. By the 1960s, the scope of New York’s welfare state far surpassed that of any other American city. In addition to the City University of New York, which was tuition-free since its foundation in the mid-nineteenth century, the city boasted an incredible array of public institutions that disproportionately benefited the working class and the poor: a huge public housing system, cheap and extensive subway service, hospitals and health clinics, schools and libraries, world-class museums and parks, welfare centers and anti-poverty programs. The unions were, in many cases, strong and ambitious enough on their own to provide extensive services directly to members and their families. The labor-backed United Housing Foundation, for example, sponsored co-operative housing developments around the city, including the massive Co-Op City development in the Bronx that continues to house tens of thousands of residents. The size and strength of New York’s working class meant that the municipal welfare state was anchored in a strong base of popular support. As Phillips-Fein perceptively notes, the relatively small scale and geographical dispersion of the city’s industrial employers — many of whom also came to rely on the benefits of the welfare state — made it relatively difficult for them to organize against it. Its growth also provided the institutional base for a vast public-sector labor movement that had an interest in fighting cuts and pushing for further expansion. In the postwar years, the city’s municipal unions made enormous gains in size and strength, and were willing to regularly challenge city officials with illegal strikes. Everyone got in on the act: teachers, social workers, transit workers, hospital workers, garbage men, sewage treatment workers, postal workers, drawbridge operators. The Big Apple earned the nickname “Strike City,” and its unions led the wave of organization that swept through the public sector during this period. By the late 1960s, however, the unique confluence of economic and political factors that made New York’s experiment in municipal social democracy possible began to unravel. The postwar boom gave way to a period of slower growth, declining profits, and higher unemployment. Manufacturers, shipping companies, and corporate offices alike decamped to more favorable business environments in New Jersey, Connecticut, or further afield, taking their jobs and tax revenues with them. Federal housing policy and new highway construction encouraged working- and middle-class New Yorkers to leave the city behind for subsidized mortgages in racially homogenous suburbs. Many of the whites who stayed, either by choice or necessity, grew increasingly resentful of paying taxes to fund programs that disproportionately benefited African-Americans and Puerto Ricans. Real estate and financial elites lobbied hard for tax cuts to reduce welfare expenditures, and to redirect municipal spending away from social services and toward business incentives. During the boom years, they tolerated the ever-expanding municipal budget, and could even make money from it in the bond market. But they were constantly looking for ways to push the muck and sweat of industry — along with the often unruly workers that came with it — out of the city. For their part, federal and state governments were not especially keen to rescue the city from the difficulties wrought by its economic transformation. With Nixon in the White House, federal support for municipal services was cut, and much of the rest was disbursed to the states in the form of block grants. New York state law put the city on the hook for an unusually large proportion of Medicaid and welfare spending, which increased sharply along with the growing demand for social services. State constitutional restrictions on local taxation and debt financing, however, meant that the city could not easily raise taxes or borrow money on its own to deal with the situation. These conflicts were crystallized in the municipal budget, which was in the red and getting redder every year. As Phillips-Fein tells it, city officials were faced with three choices for dealing with the budget gap: increase revenues by wringing more aid out of Albany and Washington; cut costs through austerity and hard bargaining with the municipal unions; or buy time and avoid political conflicts by borrowing money. Understandably, they chose to borrow, and the city’s debt burden exploded. By the end of John Lindsay’s term in 1973, New York’s debts reached $10 billion, about $50 billion in today’s dollars. When Abe Beame, the son of an immigrant socialist factory worker, became mayor in 1974, New York was staring down the barrel of fiscal catastrophe.\nThe Businessmen’s Backlash City officials from Wagner to Lindsay to Beame could rightfully be criticized for borrowing irresponsibly. But it takes two to tango, and the New York’s lenders were guilty of lending irresponsibly too. Shared moral responsibility for the crisis, however, did not mean that creditors and debtors faced each other on an equal footing. A round of financial deregulation allowed many of the New York’s biggest lenders to seek new investments at home and abroad, reducing the attractiveness of the relatively boring municipal bond market. But the power imbalance between the city and the banks was not simply conjunctural — it was structural. As Doug Henwood points out in his book Wall Street, “the bankers have the advantage in a debt crisis; they hold the key to the release of the next post-crisis round of finance. Anyone who wants to borrow again, and that includes nearly everyone, must go along.” By the fall of 1974, the banks forced city officials into an austerity program against their will. As a City College graduate, Beame was himself a product of the city’s welfare state and genuinely did not want to cut programs or impose layoffs. But during the winter of 1974–75 the city began to lay off workers, and even though many were subsequently hired back, the signal was clear; the crisis would be resolved at the expense of New York’s working class, whether their elected officials liked it or not. In the summer of 1975, the state established a new agency called the Municipal Assistance Corporation (MAC) to oversee the city’s financing. Led by Felix Rohatyn, the investment banker and liberal Democrat, MAC’s board was dominated by a group of businessmen whose first priority was to pay back investors and cut municipal spending. As Phillips-Fein observes, while MAC was technically a vehicle for marketing the city’s bonds, “its real purpose was political. It had to force the city and its unionized workers to accept a staggering array of budget cuts.” New Yorkers protested the cuts, and some of them even won. Phillips-Fein devotes inspiring chapters to the successful campaigns to save Hostos Community College in the Bronx and what became known as the People’s Firehouse in Brooklyn. But despite protests in the streets and fulmination from City Hall, business got its way. Unelected, business-controlled bodies like MAC and the Emergency Financial Control Board (EFCB) succeeded in pressuring the city to lay off tens of thousands of workers, close public hospitals, raise subway fares, and begin charging tuition at CUNY. By the early 1980s, the municipal budget was back in balance, the city could borrow in capital markets, and the stage was set for New York’s transformation into the gilded playground it is today. In the popular mind and in much of the academic historiography, the death of postwar liberalism is primarily attributed to a backlash of racist working and lower-middle-class whites. This is an important part of the story, and outbursts of racial animus in neighborhoods like Bensonhurst or Forest Hills should not be minimized or overlooked. But the backlash against New York’s postwar order was led from boardrooms high above Manhattan — not the white ethnic strongholds of the outer boroughs.\nA Helpless Giant Among many progressive activists today, cities are in vogue. Those activists see the municipal level as the best arena for building power and instituting reforms in a hostile political environment. Since unions, leftists, immigrants, and people of color tend to be clustered in urban areas this orientation makes a certain amount of strategic sense. But cities, even the biggest and most powerful ones like New York, are extremely vulnerable to whipsawing by private capitalist interests. What’s more, in legal-institutional terms, cities are ultimately the creature of state government. As such, they often lack home rule over many of the most important sources of funding and policymaking authority. In the hour of its greatest need, Albany and Washington left the city to the tender mercies of Wall Street, and state-sponsored agencies like MAC and the EFCB put business interests in direct control of the city’s affairs. In an alarmingly short period of time, the Big Apple was reduced to a helpless giant, incapable of stopping the painful austerity program that its elected officials wanted to avoid. Progressive forces have recently won some important local-level victories, including minimum-wage increases and fracking bans. But a growing number of conservative state governments have repealed or pre-empted local laws on a wide range of issues: minimum wages, paid leave, fracking, LGBTQ rights, municipal broadband networks, sanctuary city status, and plastic bag bans. In heavily Democratic New York, legislation dating from the fiscal crisis and earlier severely constrains the city’s ability to set tax policy, issue debt, or regulate rents on its own. It needs the state’s authorization to do any of these things, and if City Hall and Albany are not on good terms then the potential scope of local activity is quite small. If the city ultimately fails to maintain its commitment to fiscal orthodoxy, the now-permanent Financial Control Board would be empowered to once again take control over the city’s affairs. The federal government adds yet another layer of complexity to this web of relationships. It plays a key role in funding important municipal services, which in New York includes the public housing and hospital systems. During New York’s fiscal troubles, President Ford’s initial refusal to provide federal aid — described by the infamous “FORD TO CITY: DROP DEAD” headline in the New York Daily News — helped to foster the crisis atmosphere that led to the creation of the bankers’ regime. Many of his closest advisors, including Treasury Secretary and former municipal bond trader William Simon, saw the crisis as an opportunity to put an end to New York’s postwar order. This was their chance to excise what they saw as the cancer of big-city welfare liberalism, and they took it. They successfully pressured Albany into imposing a raft of tax increases on the city as a precondition of federal aid, and when the loans were extended to the city they came on very harsh terms. The structural weakness of American cities presents socialists taking the electoral road with a predicament. This is the level that offers the best opportunities to win elections right now, but also the least amount of room to make systemic changes through government office.", "url": "https://www.jacobinmag.com/2017/07/new-york-fiscal-crisis-debt-municipal-politics-elections-socialists"}