{"authors": ["Kristi Nix"], "date_download": "2020-05-04 20:07:05", "date_modify": "2020-05-04 20:07:05", "date_publish": "2017-03-01 21:26:26", "description": "Pearland entrepreneur Douglas McReaken says he always knew the combination of beer, barbecue and live music was a formula for success. But, it wasn't until he noticed the buzz created by a...", "filename": "_71cfe20aba32495db0dab3cd18b3e6c2_1588622825.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_71cfe20aba32495db0dab3cd18b3e6c2_1588622825.html", "title": "Country singer, entrepreneur open barbecue restaurant in Alvin", "title_page": "Country singer, entrepreneur open barbecue restaurant in Alvin", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pearland entrepreneur Douglas McReaken says he always knew the combination of beer, barbecue and live music was a formula for success.\nBut, it wasn’t until he noticed the buzz created by a political fundraiser held at his Smithville ranch that the idea to open his own restaurant began to take shape.\nThe event was organized by McReaken’s Pearland-based business, Media Riders, to honor Governor Greg Abbott and included about 300 people. Country music performers Wade Bowen, Jack Ingram, Randy Rogers, Cory Morrow and Willy Braun of Reckless Kelly played at the event.\nMcReaken brought in his competitive cook-off team “Wasted Days,” headed up by award-winning pit boss Brian Keen.\nIt turned out that the star of the show was the barbecue.\n“For the next week, the only calls I got were about the food, which was unusual because no one ever calls about the food generally at a political fundraiser. They talk about meeting the governor or making an important connection,” McReaken said.\nFor Bowen, now an award-winning singer/songwriter, the event brought back fond memories of his first live show playing in the now-defunct Stubb’s B-B-Q in Lubbock with former West 84 band mate and keyboardist McReaken. The experience also rekindled dreams of having his own restaurant and live music venue.\n“Since I started playing music I’ve dreamed of having a place of my own that served high quality barbecue and good cold beer. Nothing finer,” Bowen said.\nIn February, McReaken and Bowen turned business-partners and opened The Caboose BBQ in Alvin. “I started counting and there are four to six taquerias in Alvin, six chicken joints and only one barbecue joint in town. So, I really felt the market was under-served for competitive barbecue-style cooking,” McReaken said. The patio-style restaurant serves lunch and dinner Tuesday through Sunday and features live music on Thursday, Friday and Saturday evenings.\nKeen was hired as the restaurant’s full-time pit boss.\n“We put everything in these big industrial cookers we have at 4 o’clock in the afternoon and we take them off at 3 a.m. so they are slow cooked for about 14 hours. And then we serve in the dining room until we sell out. Some days that’s been 1 p.m. and some days it’s 3:30 p.m.,” McReaken said. “We donate food to the fire department and our first responders on the days we don’t sell out. We never re-serve food the next day. It’s always new briskets, new stuffed pork tenderloins with cream cheese, jalapenos and pineapple inside, new ribs and new sausage. And, every day all our sides are made from scratch. We also have this wonderful praline bread pudding with a rum sauce on top that’s very popular.”\nIn the weeks leading up to the restaurants opening, McReaken said he received help and advice from Jessica Timmons, general manager of the Redneck Country Club in Stafford and Adrian Hembree, owner of Grazia Italian Kitchen in Pearland.\n“I was so honored by the support and kindness we received from other businesses in Stafford and in Pearland,” he said. “Here in Pearland, the folks at Grazia were truly awesome. Adrian Hembree, Chef Steve and (general manager) Larry Bales, who served as our mixologist, were extremely supportive. I really appreciated their help.”\nThe Caboose BBQ is located at 113 E. Sealy St. and is open from 11 a.m. to 10 p.m. Tuesday through Sunday. For more information, visit www.thecaboosebbq.com\nOf the seven companies", "url": "https://apnews.com/71cfe20aba32495db0dab3cd18b3e6c2"}