{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:11:24", "date_modify": "2020-05-04 20:11:24", "date_publish": "2017-10-28 05:00:00", "description": "Sarah Johnson and Bradley Martin are excited to announce their marriage that took place on October 21, 2017 at Holy Spirit Catholic Church in Rochester. Sarah Johnson, daughter of Chuck and...", "filename": "_be31c90eddbd428c8ff606c5060be6ed_1588623084.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be31c90eddbd428c8ff606c5060be6ed_1588623084.html", "title": "Sarah Johnson and Bradley Martin", "title_page": "Sarah Johnson and Bradley Martin", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sarah Johnson and Bradley Martin are excited to announce their marriage that took place on October 21, 2017 at Holy Spirit Catholic Church in Rochester. Sarah Johnson, daughter of Chuck and Cathleen Johnson graduated Minnesota State – Mankato with a degree in history. She is now employed with the Minnesota Historical Society. Bradley Martin, son of Bob and Laura Martin is a graduate of Iowa State University with a degree in Industrial & Manufacturing Engineering. He is a manufacturing engineer at Winnebago Industries in Forest City, Iowa. “I like your ear cuff,” were the first words Bradley spoke to Sarah. Little did he know what those 5 little words would lead to! Since those words, Brad and Sarah have shared countless moments of love, laughter, and growth. To propose, an elaborate ploy landed us at a fictional “couples retreat” in Wisconsin. A quiet amphitheater was set up with a wooden stand on stage, our song playing softly in the background. Each level on that stand held mason jars lit by a candle and filled with notes for Sarah. Brad proposed in front of that “Wonderwall”, Sarah tearfully accepted, and they read each love note together. Sometimes when it’s all too much to take in at once we keep this mantra in mind: Just love me today and love me tomorrow, eventually that will turn to forever. Here’s to today, tomorrow, and forever! SHMILY We would like to thank everybody that’s positively impacted our relationship these past few years. Without faith, family, and friends to support us first as individuals then as a couple, becoming a cohesive unit would be near impossible. Our heartfelt thanks to you all. God bless. -Sarah and Bradley", "url": "https://apnews.com/be31c90eddbd428c8ff606c5060be6ed"}