{"authors": ["Loren Else", "News Postbulletin.Com"], "date_download": "2020-05-04 20:08:38", "date_modify": "2020-05-04 20:08:38", "date_publish": "2017-04-06 07:25:28", "description": "1992 – 25 years ago • The third annual Post-Bulletin All-City boys basketball team was named. Players named were Mark Swenson, Brett Curtis and Mark Lovelace of Rochester John Marshall and...", "filename": "_9bfd3e3973a84ebf9947199603f3cbef_1588622918.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9bfd3e3973a84ebf9947199603f3cbef_1588622918.html", "title": "Day in History: U.S. declares war against Germany", "title_page": "Day in History: U.S. declares war against Germany", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "1992 – 25 years ago\n• The third annual Post-Bulletin All-City boys basketball team was named. Players named were Mark Swenson, Brett Curtis and Mark Lovelace of Rochester John Marshall and George Restovich and Brian Mensink of Rochester Mayo.\n1967 – 50 years ago\n• Six Minnesota counties along the Mississippi and St. Croix rivers have been declared in a state of emergency because of the flood threat. Counties include Washington, Dakota, Goodhue, Wabasha, Winona and Houston. A $350,000-$400,000 dike is being built in Winona to protect against an expected flood crest of about 18 feet.\n1942 – 75 years ago\n• For the first time in Rochester, the complete American Legion funeral ritual, with 26 members of the William T. McCoy post in uniform was conducted for Mr. Charles Van, veteran of two wars, who died this week.\n• Miss Ruth Schroeder, daughter of Mr. and Mrs. H. G. Schroeder, became the third honor student in that family when she was named valedictorian of the Elgin High School class of 1942.\n1917 – 100 years ago\n• War against Germany has been declared. The congressional act of war has been signed by President Wilson. The United States Navy has been ordered to mobilize.\n• A new sign was installed over the front of the Hanson Hardware Co. store. The sign is one of the largest in the city.\nFrom news services\nTen years ago: British sailors and marines back home after being freed by Iran said they were blindfolded, isolated in cold stone cells and tricked into fearing execution while being coerced into falsely saying they had entered Iranian waters. A suicide bomber smashed a truck loaded with TNT and toxic chlorine gas into a police checkpoint in Ramadi, Iraq, killing 27 people.\nFive years ago: Five black people were shot, three fatally, in Tulsa, Oklahoma; Jake England and Alvin Watts, who admitted targeting the victims because of race, pleaded guilty to murder, and were sentenced to life in prison without parole. A Navy F18 Hornet jet whose pilots were forced to eject crashed in a spectacular fireball into a big apartment complex in Virginia Beach, Virginia; miraculously, no one died. Fang Lizhi, 76, who was one of China’s best-known dissidents, died in Tucson, Arizona. Painter Thomas Kinkade, 54, died in Monte Sereno, California.\nOne year ago: A federal judge in Charleston, West Virginia, sentenced former coal executive Don Blankenship to a year in prison for his role in the 2010 Upper Big Branch Mine explosion that killed 29 men in America’s deadliest mining disaster in four decades; Blankenship maintained that he had committed no crime. Country giant Merle Haggard died in Palo Cedro, California, on his 79th birthday.\nToday’s birthdays: Nobel Prize-winning scientist James D. Watson is 89. Composer-conductor Andre Previn is 88. Actor Billy Dee Williams is 80. Actor Roy Thinnes is 79. Movie director Barry Levinson is 75. Actor John Ratzenberger is 70. Actress Patrika Darbo is 69. Baseball Hall of Famer Bert Blyleven is 66. Actress Marilu Henner is 65. Olympic bronze medal figure skater Janet Lynn is 64. Actor Michael Rooker is 62. Former U.S. Rep. Michele Bachmann, R-Minn., is 61. Rock musician Warren Haynes is 57. Rock singer-musician Frank Black is 52. Actress Ari Meyers is 48. Actor Paul Rudd is 48. Actor-producer Jason Hervey is 45. Rock musician Markku Lappalainen (mar-KOO’ lap-uh-LAN’-en) is 44. Actor Zach Braff is 42. Actor Joel Garland is 42. Actress Candace Cameron Bure is 41. Actor Teddy Sears is 40. Jazz and rhythm-and-blues musician Robert Glasper is 39. Actress Eliza Coupe is 36. Folk singer-musician Kenneth Pattengale (Milk Carton Kids) is 35. Actor Bret Harrison is 35. Actor Charlie McDermott is 27.", "url": "https://apnews.com/9bfd3e3973a84ebf9947199603f3cbef"}