{"authors": ["Paul Hammel Bh News Service"], "date_download": "2020-05-04 20:25:16", "date_modify": "2020-05-04 20:25:16", "date_publish": "2017-11-18 09:00:00", "description": "Commission says it can only consider evidence presented during meetings LINCOLN — Thursday’s oil spill in South Dakota from the Keystone pipeline is not expected to influence Monday’s...", "filename": "_731b72e1821e4c72ad30298e9be0db64_1588623916.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_731b72e1821e4c72ad30298e9be0db64_1588623916.html", "title": "Oil spill won’t influence the decision on Keystone XL", "title_page": "Oil spill won’t influence the decision on Keystone XL", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Commission says it can only consider evidence presented during meetings\nLINCOLN — Thursday’s oil spill in South Dakota from the Keystone pipeline is not expected to influence Monday’s decision by a Nebraska agency on a companion pipeline here.\nThe five members of the Nebraska Public Service Commission will vote Monday whether to approve or deny a route for the Keystone XL project across Nebraska.\nDeb Collins, a commission spokeswoman, said Friday that the decision must be based solely on evidence presented to the PSC during public meetings held across the state and a four-day, formal public hearing in August.\nThat, she said, is according to the Major Oil Pipeline Siting Act, which was passed by the Nebraska Legislature in 2011.\nUnder the act, commissioners are precluded from considering pipeline safety or the possibility of leaks in their rulings. Federal law, lawmakers argued in 2011, pre-empts states from regulating pipeline safety.\nOpponents of the pipeline, meanwhile, have maintained that the commission must consider the potential for spills and damage to natural resources as part of its responsibility in determining if the Keystone XL route is in the public interest of the state.\nAlso on Friday, a South Dakota official said there was roughly a five-hour lag between the discovery of the leak by Trans-\nCanada and notification of state environmental officials.\nBrian Walsh of the South Dakota Department of Environment and Natural Resources said the state will look into the notification gap.\nA TransCanada official said Thursday that the gap of time was only one hour.\nThe company, which operates the 30-inch Keystone pipeline and would build the 36-inch Keystone XL, also reported Friday that 75 workers were making progress in cleaning up the South Dakota spill. Equipment on site, the company said, includes track hoes, earth movers, vacuum trucks and high-powered lighting to allow around-the-clock operations.\n“TransCanada has taken this incident very seriously and is working with federal and state regulatory agencies,” spokesman Terry Cunha said.\nHe said company specialists say that the spill, located in a farming area, is “being controlled” and that there is no threat to public safety.", "url": "https://apnews.com/731b72e1821e4c72ad30298e9be0db64"}