{"authors": ["Michael Smith Tulsa World"], "date_download": "2020-05-04 20:20:31", "date_modify": "2020-05-04 20:20:31", "date_publish": "2017-11-10 06:00:00", "description": "A new film version of “Murder on the Orient Express” is less “whodunit” than “whydunit.” In a world of movie remakes, little investigation is needed in this case: There is a film based on...", "filename": "_73c17423c30d46f4be55f1a26f8aba72_1588623631.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_73c17423c30d46f4be55f1a26f8aba72_1588623631.html", "title": "'Murder on the Orient Express' remake lacks humor, ingenuity", "title_page": "Movie review: 'Murder on the Orient Express' remake lacks humor, ingenuity", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A new film version of “Murder on the Orient Express” is less “whodunit” than “whydunit.”\nIn a world of movie remakes, little investigation is needed in this case: There is a film based on Agatha Christie’s classic mystery that is pretty much perfect, so there was no need to return to this material if it was to be done so poorly.\nThe 1974 film was nominated for a best-picture Oscar, starred Albert Finney in an unforgettable performance as Christie’s Belgian detective Hercule Poirot and featured one of my favorite movie endings ever.\nIt was this final “Aha!” element that stumped me as to why a remake would be considered, and after having seen this version, it’s impossible to recommend it to anyone who’s read the book or seen the original film.\nThere’s nothing new here and nothing ingenious in the minor edits with regard to the detective, the suspects or the ending.\nThe detective\nThere’s nothing inventive here outside of the mustache choice, with Kenneth Branagh’s Poirot wearing what appears to be a regulation-size mustache pasted on top of a wide-load mustache in a bit of silly facial-hair maintenance.\nWord from the set is that it was referred to as “The Badger.” It is its own character.\nBranagh is pulling double-duty as director and star, but that shouldn’t be an excuse for how low-energy his character is or how the entire film follows his lead in this regard.\nHe’s competing for modern-audience approval with not only Finney on film but also Peter Ustinov’s multiple movies, and then there’s David Suchet’s beloved TV version of more than 20 years, and Branagh is the weakest of these.\nHis Poirot is professional and competent but not colorful.\nThe film does little to show us why he’s the smartest guy in the room, other than him issuing mini-solution proclamations for which we have no idea where he obtained the information.\nThe humor is lacking, and so is the character’s irritating egotism, outside of his early proclamation to the Orient Express passengers: “My name is Hercule Poirot, and I am probably the greatest detective in the world.”\nThat element disappears, especially in the detective’s “Aha!” reveals, which Finney turned into dynamic theater and Branagh delivers with all the gusto of a genial grandfather reading stories to little ones beside the fireplace.\nThe suspects\nThere is again an all-star cast as Poirot goes from one case, in early European travelogue framing, that finds him boarding the luxurious Orient Express for three days of care-free travel and relaxation.\nOf course, that doesn’t happen as he literally bumps into multiple people aboard, including a gangster trying to hide his identity (Johnny Depp in a crude, pale imitation of Richard Widmark’s calculating performance).\nIt’s a cameo as the gangster is killed on the first night, with the crime happening at the same time as a freak avalanche of snow that stops the train dead on the tracks.\nThis gives the weary Poirot time to interrogate passengers, one by one, and determine a motive for who murdered this murderer, who was responsible for a crime that recalls one of America’s most notorious 1930s cases.\nAlong for the ride are a cranky princess from Russia (Judi Dench); a zealot missionary from Spain (Penelope Cruz); a professor with pro-Nazi beliefs (Willem Dafoe); a widow/cougar on the prowl (Michelle Pfeiffer); a man and a woman who appear to be an interracial couple (Daisy Ridley and Leslie Odom Jr.); and the gangster’s assistant (Josh Gad).\nThese performances are all so small, with so little to do, that not one of them feels like authentic, developed characters that the book delivers.\nThe ending\nThe fumbling of the inevitable final act seals the deal in a way that no change, like the interracial pairing, or adding more guns to the equation, or setting up this film as the first of sequels to come, can correct.\n“Murder on the Orient Express” may have killed off any chance for a franchise of Christie’s wonderful stories on film.", "url": "https://apnews.com/73c17423c30d46f4be55f1a26f8aba72"}