{"authors": ["Kelly Schafler"], "date_download": "2020-05-04 20:05:27", "date_modify": "2020-05-04 20:05:27", "date_publish": "2017-04-12 23:44:47", "description": "For the first time, Magnolia High School's UIL Academic team won the Region 3-5A Championship, catapulting 13 students and the One-Act Play Company into the state competition in Austin, hosted by...", "filename": "_3b4960093398483798a607810d9a5fd5_1588622727.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3b4960093398483798a607810d9a5fd5_1588622727.html", "title": "Magnolia High School UIL Academic Team goes to state for first time", "title_page": "Magnolia High School UIL Academic Team goes to state for first time", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "For the first time, Magnolia High School’s UIL Academic team won the Region 3-5A Championship, catapulting 13 students and the One-Act Play Company into the state competition in Austin, hosted by The University of Texas.\nMHS UIL Academic Coordinator Susan Mathews said the advancing students emerged from a pool of roughly 200 others who showed interest in the fall. Students are selected by a variety of qualifications, including teacher recommendations and indicated interest.\n“Just like in sports, we have district, region and state winners,” Mathews said. “In the common area (of MHS), we probably have 40 UIL banners that hang from the last eight to 10 years. The school has supported the program intensely; the team gets more popular and we have more students participate every year.” During the March 25 district competition, MHS’s teams consisted of 77 competitors in 21 academic events. About four students compete per academic event at the district level. Thirty-three positions qualified for the region meet.\nThe school has historically done well at the UIL district level, with the academic team progressing to region seven times in the last 10 years and One-Act Play winning district for their ninth consecutive year.\nOver the weekend, MHS served as the host location for the Region 3-5A Academic meet, where Magnolia students battled approximately 60 schools from the region for a chance to advance to state. Mathews said MHS has been the runner-up school at the regional meet three times (2009, 2015 and 2016) but had never won until this year.\nOn their home turf, 13 academic students and the One-Act Play Company won within their events, sending them to the state meet.\nMHS One-Act Play Company competes at The University of Texas in Austin Thursday and Friday with their play “Moliere.”\nAcademic teams compete for the state title at The University of Texas April 21-22; divisions include Accounting, Computer Science, Feature Writing, Science and Ready Writing.\nOne UIL speech participant will compete in the Informative Speaking and Lincoln Douglas Debate events at The University of Texas May 22-23. The state 5A champions will be announced following the speech competition in late May, after the schools’ total scores are tallied.\n“It’s very exciting to see students work so hard and for them to be successful,” Mathews said. “We’ve told them … this is just like any other state-level event. We have two weeks to prepare. The ball is in their court, so they need to work hard and practice.”\nStudents advancing to state\nAccounting Team: Jacob Sass, Caleb Wall, Emily Hubble and Andrew Nunn;\nComputer Science Team: Sunny Tran, Trent Harris, Jordan Griffin and Ben Johnson\nScience Team: Gabriel Frohaug and Terrell Ford\nFeature Writing: Sarah Venables\nLincoln Douglas Debate and Informative Speaking: Ethan Eyre\nReady Writing: Lucille Stinn\nOne-Act Play Company Award Winners\nBest Actor: Jacob Edwards\nAll-Star Cast: Will Carroll and Ciara Peterson\nHonorable Mention Cast: Lauren Eddings\nTop Technician: Sidni Broadus", "url": "https://apnews.com/3b4960093398483798a607810d9a5fd5"}