{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Branko Marcetic", "Kate Aronoff", "Matt Bruenig", "Vivek Chibber"], "date_download": "2020-05-04 19:55:31", "date_modify": "2020-05-04 19:55:31", "date_publish": "2017-12-06 00:00:00", "description": null, "filename": "2017_12_gop-tax-plan-bernie-sanders_1588622131.html", "image_url": "https://images.jacobinmag.com/2017/12/06103203/GettyImages-874203406.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_12_gop-tax-plan-bernie-sanders_1588622131.html", "title": "We Didn’t Start the Fire", "title_page": "We Didn’t Start the Fire", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Bernie Sanders’s speech in Dayton, Ohio last week was pivotal. “This is class warfare,” he said of the Senate tax bill’s passage, “and we’re going to stand up and fight.” With this simple sentence, broadcast around the country, Bernie became the first national politician to use the term “class war” properly in decades.\nI say properly because, while the term has mostly been expunged from our political discourse, it does occasionally make an appearance. Mainstream Democrats won’t utter it — the closest they come is Barack Obama calling himself a “warrior for the middle class.” But Republicans do talk about class war. They either use the term derisively, accusing Democrats of “class war demagoguery” when they attempt to halt tax cuts for the wealthy, or sadistically, such as when Paul Ryan said “we should not shy away from class warfare,” by which he meant politicking on behalf of oligarchs.\nThere’s something depressing about being accused of “class war demagoguery” while failing to muster any such thing. If you’re going to do the time, you might as well do the crime. Bernie has at long last come right out and said it: There is a class war on right now, and the only question is whether the working class will ride into battle or passively observe the plunder.\nIn the socialist conception of class conflict, it’s a permanent and immanent feature of capitalism. Rather than something that working-class or ruling-class people elect to engage in at any given time, it’s fundamental to a system based on private property and private ownership of the means of production. You don’t start a class war; as Bernie said, you fight back in one.\nThe British socialist intellectual Ralph Miliband contrasted this view with the liberal one, which sees class conflict as aberrational — a series of “problems” to be “solved,” requiring political finesse and “management” in order to restore harmony between classes. By contrast, in the Marxist view, Miliband wrote:\nConflict is inherent in the class system, incapable of solution within that system. Eruptions, outbursts, revolts, revolutions are only the most visible manifestations of a permanent alienation and conflict . . . Contending classes are locked in a situation of domination and subjection from which there is no escape except through the total transformation of the mode of production.\nTranslation: class conflict is a basic feature of capitalism, and is always raging so long as capitalism rules the day.\nSince the beginning of the neoliberal program to undermine the American left and the labor movement in the 1970s, the most visible manifestations of class war have taken the form of an assault by the rich on the poor — massive top-bracket tax giveaways, cuts to welfare and social services, suppression of unions, and endless privatization. But other manifestations are possible, too. If we had a party that explicitly recognized that the class war is already on and dedicated itself to fighting in it on behalf of working-class people — like the British Labour Party under Jeremy Corbyn — we might see a greater diversity of class-war measures.\nBernie Sanders can’t and won’t lead us into combat alone. The American left needs to become comfortable with the language of class warfare. We should abandon the liberal view of class conflict as a series of isolated policy dilemmas, each requiring a bipartisan compromise or a technocratic fix. Instead, we should insist that all time in capitalism is wartime — and start mounting counteroffensives accordingly.", "url": "https://www.jacobinmag.com/2017/12/gop-tax-plan-bernie-sanders"}