{"authors": ["Dave Matter St. Louis Post-Dispatch"], "date_download": "2020-05-04 20:21:23", "date_modify": "2020-05-04 20:21:23", "date_publish": "2017-12-20 06:40:00", "description": "COLUMBIA, MO. • In between preparing for a bowl game and rebuilding his coaching staff, Missouri’s Barry Odom has found time to put the finishing touches on the first portion of his 2018...", "filename": "_13081d1c22304ee8aabee77dca18853c_1588623683.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_13081d1c22304ee8aabee77dca18853c_1588623683.html", "title": "Tigers expect big haul for early signing period", "title_page": "Tigers expect big haul for early signing period", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "COLUMBIA, MO. • In between preparing for a bowl game and rebuilding his coaching staff, Missouri’s Barry Odom has found time to put the finishing touches on the first portion of his 2018 recruiting class, a group that starts to become official Wednesday, the first day of college football’s new early signing period.\nHigh school seniors are now allowed to sign national letters of intent with college programs during a 72-hour period through Friday. Recruits who don’t sign this week can sign during the traditional national signing day, set for Feb. 7.\nMissouri expects to sign the bulk of the players who have verbally committed to play for the Tigers, perhaps as many as 20 of the 21 targets.\n“For us it looks really favorable for Wednesday, but I’d like a few more hours in each day because you run out of them,” Odom said. “The thing that our recruiting department has done and our assistant coaches really worked to develop close, true relationships. We feel really solid with the number that we’re going to get.”\nLike some of his more vocal peers around the country, Odom has mixed feelings about the early signing date. For one, he’s concerned about the recruits who are still playing high school football games late into the fall while college teams are trying to bring them to campus for official visits.\nSimi Bakare, a running back from Round Rock, Texas, played in a state playoff game Saturday, then rushed to Columbia for his official visit. Bakare, once committed to Tulane, gave the Tigers a verbal pledge during his visit. Odom, once a head high school coach in Columbia, doesn’t like the condensed schedule for recruits.\n“We’ll sit down again at the AFCA meetings with the NCAA and hopefully through one cycle through this have a better feel for how everyone feels — everybody,” Odom said. “At the end of the day you want to do what’s best for the kids, your students, your prospects. But also you have to take into consideration the high school coach and how that affects your current team. When I’m not here and out recruiting, I’m away from my guys. That’s a whole other way to look at it.”\n• MIZZOU TALK: Sound off about the 2017 season\n• EYE ON THE TIGERS: Dave Matter’s Mizzou blog\n• SCHEDULE/RESULTS: 2017 Mizzou football\n• STANDINGS: SEC football\n• PODCAST: Dave Matter in ‘Eye On The Tigers’\nBakare, a three-star running back, rushed for 1,759 yards and 29 touchdowns at Cedar Ridge High School. He’s MU’s seventh target to announce his commitment since the start of the month. Jatorian Hansford, an outside linebacker from Forsyth, Ga., confirmed Tuesday that Mizzou projects him as a defensive end, though he hadn’t decided if he’ll sign this week or in February.\nVincent Gray, a defensive back from Rochester, Mich., who committed to MU in July, announced on Monday that he’s received an offer from Michigan, his home-state school. As of Tuesday it was uncertain if Gray will still sign with the Tigers. He didn’t return a message to confirm his status.\nUnlike past seasons under the old model, college coaches will have fewer targets to chase down in January. Instead, Mizzou assistant Andy Hill said he expects college coaches to devote more time to evaluating sophomores and juniors in January.\nAs for the unsigned senior prospects they could get bombarded by college coaches scrambling to finish their classes.\n“I’ll be curious to see what happens with the guys who are left over,” Hill said. “It’ll be like sharks in the water.”\nTIGERS ARE SET TO ADD\nFOUR IN-STATE TARGETS\nAmong the 20 or so players Missouri expects to sign this week, four are in-state products, two each from the St. Louis and Kansas City areas. Both St. Louis recruits signed with the Tigers in previous years but needed a junior college detour: wide receiver Harry Ballard III from McCluer North and defensive tackle Antar Thompson from Maplewood-Richmond Heights. From the west side of the state, the Tigers expect to sign defensive end Daniel Parker Jr. from Blue Springs and receiver Dominic Gicinto from Raytown.", "url": "https://apnews.com/13081d1c22304ee8aabee77dca18853c"}