{"authors": ["Kevin Solari Ksolari Shawmedia.Com"], "date_download": "2020-05-04 20:05:36", "date_modify": "2020-05-04 20:05:36", "date_publish": "2017-11-01 03:50:00", "description": "SYCAMORE – Illinois Community Credit Union is holding an open house Thursday to celebrate moving to its new facility. After a year of construction, its new headquarters opens on the site of...", "filename": "_3d7057c7ba224205a7d0ba29d6073483_1588622736.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3d7057c7ba224205a7d0ba29d6073483_1588622736.html", "title": "Illinois Community Credit Union opens new Sycamore facility", "title_page": "Illinois Community Credit Union opens new Sycamore facility", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SYCAMORE – Illinois Community Credit Union is holding an open house Thursday to celebrate moving to its new facility.\nAfter a year of construction, its new headquarters opens on the site of the old one at 508 W. State St.\nThe old building, where the credit union had operated since the 1970s, was an old service station, CEO Thor Dolan said. During the spring thaw, he said employees could smell gas fumes from the soil. The new building has an improved feel.\n“The new building has the niceties a traditional banking branch would have,” Dolan said.\nOne of the biggest additions is the multilane drive-thru. It was also one of the last things to go in during the construction.\nAnother change is that tellers now work in pods, rather than at a counter.\n“We want to build that relationship feeling with our members,” Dolan said.\nThe pod means tellers work side-by-side with members when conducting business, instead of across from one another with the counter in the way.\nThe new building project was conducted under the guidance of the board of directors and a building committee of the board, Dolan said.\n“It reflects the desire of our membership,” he said.\nIt was built on the same site as the old building, and employees could see one building go up and then, after moving to the new location, the old one come down.\n“It was awkward at times,” said Lisa Hendrickson, director of marketing at ICCU.\nBut it was worth the change to stay in that location.\n“It’s a nice presence to be the entry to Sycamore from the west,” Dolan said. “This is our home base. This is where we started. ... It was important to maintain a presence in Sycamore.”\nThe open house will begin with a ribbon-cutting ceremony at 4:30 p.m. It will be followed by food and refreshments. Northern Illinois University mascot Viktor E. Huskie will be present along with ICCU’s canine mascot, Kash.\n“Anybody can come out,” Dolan said. “This is the community’s credit union.”", "url": "https://apnews.com/3d7057c7ba224205a7d0ba29d6073483"}