{"authors": ["Branko Marcetic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Leigh Phillips", "Sam Lewis", "Mímir Kristjánsson"], "date_download": "2020-05-04 19:55:15", "date_modify": "2020-05-04 19:55:15", "date_publish": "2017-08-10 00:00:00", "description": null, "filename": "2017_08_kamala-harris-trump-obama-california-attorney-general_1588622115.html", "image_url": "https://images.jacobinmag.com/2017/08/10012252/kamala-harris.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_08_kamala-harris-trump-obama-california-attorney-general_1588622115.html", "title": "The Two Faces of Kamala Harris", "title_page": "The Two Faces of Kamala Harris", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe first seven months of the Trump administration has seen an ever-changing coterie of high-profile Democrats probing the possibility of launching a 2020 run to take back the White House, from Joe Biden and Corey Booker, to Kirsten Gillibrand and Deval Patrick, and maybe even Hillary Clinton for a third time. The latest name to join this carousel of political ambition is recently elected California Senator Kamala Harris. Her rise to the top of the 2020 shortlist has been long in the making, with Democratic bigwigs recognizing her potential star power as early as 2008, when she campaigned for Obama. Harris’s rise has produced a fiery debate among liberals and the Left. Leftists and progressives have come out in strong opposition to Harris’s candidacy, with some declaring #NeverKamala and some high-profile Bernie Sanders supporters, such as National Nurses United executive director RoseAnn DeMoro, making clear their lack of enthusiasm for her candidacy. For some prominent liberals, this pushback is simply the product of virulent racism and sexism among an imagined (and non-existent) all-white, all-male, Sanders-supporting base. While most Harris-supporting liberals wouldn’t go this far, there is deep suspicion among some Democrats that opposition to Harris is motivated by similarly less-than-noble motives — namely, that it’s part of a project of poisoning the well for any potential challengers of a Bernie Sanders or Sanders-like candidacy in 2020. In truth, there is much about Harris’s long record as a public prosecutor in California — the vast bulk of her career — that is up for legitimate criticism by any prospective 2020 Democratic voters. Throughout her career, Harris has been called the “female Obama.” In reference to her race, this is lazy and arguably even racist. But the comparison is apt with reference to her politics. Harris has emulated the Obama approach, delivering a combination of some notable progressive victories and pleasant rhetoric and a steadfast avoidance of structural change — paired, in some cases, with far-from-progressive policies.\nNot-So-Civil Liberties Given Harris’s stance on crime, it’s perhaps unsurprising that she was not always the most ardent civil liberties defender. It’s true that Harris ordered California parole officers not to enforce blanket residency restrictions on sex offenders. This order ended the unjust application of a law that in many cases made it impossible for someone convicted of a sex offense to live anywhere, and increased the homeless sex offender population by twenty-four times in three years. (In addition to the barbarity of making anyone homeless, sex offenders’ risk of reoffending rises dramatically with homelessness, arguably, and ironically, making the public less safe.) But she had only done so after the state Supreme Court ruled the restrictions to be unconstitutional, and only after she had appealed the same decision by a lower court. Harris supported Jessica’s Law, the ballot measure that instituted these rules, back in 2006. Similar to her stance on the three-strikes law, her 2010 Republican opponent ran to her left on this issue. Around the same time, Harris sponsored legislation that would have banned sex offenders from using social media sites like Facebook. The bill received much criticism, not only due to concerns for privacy and civil liberties, but also because it was ineffective — most sex crimes against children are committed by people they know, and most adults who solicited sex from kids online weren’t registered sex offenders. But as many pointed out, Harris was sponsoring the bill the same year she was running to be attorney general. Harris was also a big booster of familial DNA searches, a controversial technique whereby investigators compare a DNA sample to other samples in a DNA database to find possible relatives, then use additional genetic testing and analysis to confirm the match, all in order to solve crimes. Due to privacy concerns, the technique hasn’t been adopted in Canada, and was outlawed in both Maryland and DC. Among the concerns are the not-infrequent cases of human error in DNA evidence, the fact that familial testing would disproportionately impact communities of color, the potential revelation of family secrets, and the already existing instances of mistakes being made with the technique. California was the first state to adopt the technique in 2009 under Jerry Brown, but Harris eagerly kept it going. In 2011, she announced new funding to double the amount of familial searches, telling the LA Times “California is on the cutting edge of this in many ways,” and that “I think we are going to be a model for the country. I really do.” In fact, California’s use of familial DNA testing is particularly invasive, as the state allows the collection and preservation of DNA samples from anyone who is arrested, even if they’re not charged with a crime. The ACLU originally sued to block California’s DNA collection when an Oakland woman had been arrested during a San Francisco protest against the Iraq War and forced to give a DNA sample despite not being charged with any crime. Harris was likewise a firm proponent of civil asset forfeiture, sponsoring a bill to allow prosecutors to seize profits before charges were even filed. Years before that, she opposed AB 639, a bill that aimed to reform asset forfeiture. The bill easily cleared the state assembly, but was soon scuttled by a united wall of opposition from law enforcement, with whom Harris was united. There was also the case of the Sikh man who was barred from working as a prison guard because of his religiously mandated beard. Harris argued that his beard prevented him from being properly fitted with a gas mask, thus disqualifying him from the job, despite California’s corrections and rehabilitation department’s regulations allowing guards to have beards for certain medical reasons. A number of civil rights and legal organizations — including the ACLU of Northern California, the Asian American Bar Association, and the Council on American Islamic Relations — wrote Harris a letter pointing out this inconsistency. She argued that the medical exemption only applied to guards who passed the mask fitting before the policy took effect, although the man’s attorney said this was untrue. Any future Democratic president is going to inherit the now nearly sixteen-year-old “war on terror,” which has already hollowed out many civil liberties protections for the sake of security and has the potential to do much more. Harris’s record on the matter as a prosecutor thus deserves careful consideration.\nSettling for Less Arguably the most significant accomplishment on Harris’s record is her treatment of banks that were involved in widespread foreclosure fraud. It is clear this will be one of the key selling points to any future Harris 2020 run, so it deserves special attention. She touted her 2011 mortgage settlement deal in her 2012 DNC speech, and at the 2016 California Democrats Convention, she was introduced as someone who was “very tough on the banks when they try to foreclose on working families.” Harris’s actions on the issue in many ways serve as a microcosm of her broader political agenda. The foreclosure deal, while an impressive and landmark settlement, was also a half-measure that delivered far less to the public than it seems at first glance, ultimately failing to properly take the banks to task for their criminality. Obviously, credit where credit is due: in September 2011, Harris pulled California out of nationwide mortgage settlement talks with the five biggest mortgage servicers, a gutsy move that won her praise from homeowner groups and involved defying Obama, her close ally. Harris did this after meeting personally with the banks’ representatives, who were offering California what she called “crumbs on the table” and reportedly asking to be let off the hook from legal action over any misconduct they had committed. Harris thought she could get Californians a better deal. She told the banks, “I am going to investigate everything.” At the same time, Harris’s decision to pull out has to be understood in the context of the widespread activism that pressured her to do so. At the time, Harris was under pressure from union leaders, other politicians, and housing rights activists. As one member of the progressive coalition of groups put it, “It wasn’t like she was some hard-charging AG that wanted to take on the banks” — rather, “it took a lot of work to get her where we needed her to be.” Harris withdrew the day after these groups sent her a letter, signed on by Lt. Governor Gavin Newsom, a potential future rival, calling the deal “deeply flawed” and “outrageous.” The deal Harris got for California was ultimately much better. It provided $18.4 billion in debt relief and $2 billion in other financial assistance, as well as incentives for relief to center on the hardest hit counties. This is particularly impressive when one considers the banks had originally only offered California, the state hardest hit by the housing crisis and fraud, $2-4 billion. Nonetheless, the settlement was woefully inadequate. For one, while the $20 billion total sounds good, it was a fraction of what the banks would have had to pay to compensate for all of their malfeasance. For instance, investors had won $8.5 billion in a settlement with Bank of America over mortgage securities backed by faulty loans. Secondly, the banks themselves paid very little — only around $5 billion, with most of the settlement involving the banks modifying loans owned by others, such as pension funds, who had nothing to do with the misconduct that necessitated the deal. In terms of direct financial relief, underwater homeowners — weighed down by average debt of close to $65,000 each — received around $1,500 to $2,000 each. One called it “a slap in the face for a lot of us.” Moreover, more than half of the $9.2 billion in principal loan forgiveness in the state went to second mortgages, and many of those were already delinquent. While it did benefit homeowners, it also meant, as one economist told the LA Times, that in practice the banks “were writing off loans that were essentially dead.” A year later, only one-fifth of the aid went to first-mortgage principal forgiveness. And even at the end of this, just 84,102 California families had any mortgage debt forgiven — far short of the 250,000 originally predicted. On top of this, under the deal, loans owned by Fannie Mae and Freddie Mac didn’t qualify for the debt relief. Given they were the country’s biggest mortgage holders, this meant even fewer homeowners stood to benefit from the deal. Harris explained that while the deal was imperfect, she was forced to make do as the clock was ticking. “Every day there are homeowners in California who will either receive relief so they can stay in their home, or will be in the foreclosure process and potentially lose their home,” she said. “And that always weighed heavily on my mind.” Rob McKenna, one of the lead negotiators on the settlement said that “at some point you have to decide that it’s more important to get relief to consumers sooner than to get more through the court.” Similarly, journalist David Dayen believed Harris had “played a bad hand relatively well,” and that prosecuting would have taken more time and a bigger coalition of prosecutors than she had at the time. Still, there were numerous critics. Writing in the LA Times, Michael Hiltzik savaged the deal and what he called the “rosy self-congratulation” that followed it, particularly the new foreclosure standards it imposed, which he called a “big whoop.” “The provisions mostly require mortgage lenders and servicers to comply with what I would have thought was already the law, which prohibits, you know, criminal fraud,” he wrote. “This settlement is yet another raw demonstration of who wields power in America,” wrote Susan Webber. “It adds insult to injury to see some try to depict it as a win for long suffering, still abused homeowners.” “There’s virtually no benefit to borrowers, and yet you give the banks credit for short sales and getting second liens wiped out — something they were going to have to do anyway,” complained Bruce Marks, founder of housing counseling group Neighborhood Assistance Corp. of America. More importantly, ordinary homeowners who had been shafted by the banks remained angry. During Harris’s Senate campaign, her opponent was flanked by members of Occupy Fights Foreclosures, an outgrowth of Occupy LA, as she criticized Harris (however disingenuously) for not prosecuting a single top bank executive. The group had earlier written Harris a letter calling for her to implement a moratorium on foreclosures until she finished investigating fraud. Frustrated homeowners complained of being denied meetings with Harris over the span of years, and protested at the 2015 California Democrats State Convention. There was no better symbol of Harris’s inability to hold the people behind the foreclosure fraud to account than her Mortgage Fraud Strike Force. Opened to much fanfare in 2011 and employing twenty-five Department of Justice lawyers and investigators with a budget of more than $2 million to go after foreclosure fraud, the strike force managed to prosecute just ten cases in three years, an East Bay Express investigation in 2014 found. The paper found that not only had the strike force prosecuted less foreclosure fraud cases than many other states, but it had filed fewer lawsuits than attorneys general in smaller states with fewer victims, and even fewer than some county district attorneys. Yet California led the country in terms of such scam operations, with many thousands of complaints since 2010. One housing rights activist who had lost his home in a fraud called the strike force a “public relations effort.” Harris has repeatedly said she was limited in what she could do. When a man at the 2016 California Democratic Party convention asked her, “How many bankers went to jail?” she said they did the best with what evidence there was. “I too, like most Americans, am frustrated. Clearly crimes occurred and people should go to jail,” she told the LA Times last year. “But we went where the evidence took us.” This demonstrably wasn’t always the case, however. Earlier this year, the Intercept obtained a 2013 memo to Harris from prosecutors in the attorney general’s office saying they had “uncovered evidence suggestive of widespread misconduct” at OneWest Best, and urging Harris to “conduct a full investigation of a national bank’s misconduct and provide a public accounting of what happened.” Yet Harris never did. (Coincidentally, Harris was the only Democratic Senate candidate in 2016 to get a donation from Steven Mnuchin, OneWest’s former CEO). One has to wonder whether there are other, similar memos out there, and how many.", "url": "https://www.jacobinmag.com/2017/08/kamala-harris-trump-obama-california-attorney-general"}