{"authors": ["Adam Gold"], "date_download": "2020-05-04 20:19:22", "date_modify": "2020-05-04 20:19:22", "date_publish": "2017-01-29 05:30:00", "description": "It's time. It's time for Peter Karmanos, owner of the Carolina Hurricanes, whose name is on the Stanley Cup, whose done so much for the sport that he's in the Hall of Fame, it's time for him to...", "filename": "_4adf08d198994becd6e9e626dc681775_1588623562.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4adf08d198994becd6e9e626dc681775_1588623562.html", "title": "Karmanos willing to sell Hurricanes, but doesn't have to", "title_page": "Karmanos willing to sell Hurricanes, but doesn't have to", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s time. It’s time for Peter Karmanos, owner of the Carolina Hurricanes, whose name is on the Stanley Cup, whose done so much for the sport that he’s in the Hall of Fame, it’s time for him to sell the franchise. This isn’t about whether or not Karmanos needs to sell, but whether the franchise needs to be sold.\nWe’ve arrived at the NHL’s All Star break. While some are looking forward to the game, and specifically to seeing Carolina’s Justin Faulk represent the Metropolitan Division, others are enjoying a bit of a respite before the season resumes in what will be a frantic sprint to the finish line in early April.\nWell, so much for the quiet.\nPierre LeBrun, stellar hockey reporter for ESPN/TSN spoke with Hurricanes owner Peter Karmanos. According to LeBrun’s twitter feed, Karmanos would be willing to sell the franchise in its entirety, depending upon the offer.\nWell, that makes sense. Most everything has a price.\nLeBrun followed that up with the idea that Karmanos is still open to maintaining a percentage of the club, but that he’s more willing to sell it all as time goes by.\nIs this news? Well, yes and no.\nThis certainly is not anything new. The Hurricanes owner told me in August that while the team was FOR sale, it certainly wasn’t ON sale. “I’m 73 years old”, Karmanos said in this season’s first episode of the Canes Corner Podcast. “I’ve got four little kids at home. I’d like to find someone who wants to be a partner for a few years and then transition the team over to them.”\nIn November of 2016, Forbes Magazine calculated the Hurricanes to be worth $230 million. While that number represents the least valued of the 30 NHL franchises there’s not a significant difference between the Canes and the Columbus Blue Jackets, who are 27th in the league according to Forbes, at a valuation of $245 million.\nWhen asked about the Forbes list, Karmanos questioned the validity of that calculation. “Two years ago they said the Islanders were worth $240 million”, Karmanos laughed, “yet, they sold for somewhere between $490-$520 million.” While the actual sale price was listed at $485 million, Peter’s larger point is not necessarily wrong and he feels there’s no reason why he can’t also find greater value on the market.\n“The Hurricanes are worth at least as much as the Islanders”, said Karmanos, who insisted at that time that he did not have to sell. “I’m not backing off that — I don’t have to back off that. And, if we win, then that value will increase accordingly.”\nKarmanos would obviously sell the team tomorrow, providing his lofty price was met, a notion backed up by team president Don Waddell who addressed the issue in November when unsubstantiated rumors surfaced of a potential sale and relocation of the franchise to Quebec City. “If someone came along and wanted to buy it, I’m sure we’d talk”, Waddell said. “But, we’re not out there actively trying to find investors.”\nHowever, since those remarks, the Hurricanes lost two minority investors, returning $6 million as part of a deal which would allow them to withdraw their partnership with interest after five years. On top of that, Karmanos was sued for $105 million by his three adult children (from his first marriage) over failed repayments to a stock partnership that was originally set up to transfer assets in a “tax-advantageous manner.”\nHis three sons, Peter III, Nick and Jason, who was the team’s assistant general manager until he was fired in 2013, claim that their father used the family stock partnership as collateral to help support the Hurricanes. And, when payments totaling $4.3 million were not made to reimburse the partnership, they claim that the entire value of what was a $101 million promissory note is now due because of the default.\nWhile the lawsuit has been settled in mediation, it is not known if the financial impact on Karmanos will ultimately trickle down to the Hurricanes and force him closer to actively seeking a buyer. Currently, the Hurricanes are last in the NHL in attendance at just under 12,000 people per game and the sparse crowds and the incredibly low team payroll — which operates at the salary floor as opposed to the salary cap — have helped to fuel rumors of ownership positioning for a sale and a team ripe for relocation.\nOf course, those rumors have almost exclusively been the doing of a single radio station in Montreal. The Province of Quebec has been openly pining for a second league franchise to play in a a newly constructed arena in Quebec City. Speaking during the All Star festivities in Los Angeles, Commissioner Gary Bettman reiterated what he’s said several times over the last 12 months. “The Carolina Hurricanes are not moving.”\nIt’s no secret, however, that things are not exactly on easy street off Edwards Mill Road. “Yes, we’ve lost a lot of cash in the last few years — and deservedly so”, Karmanos said. “But, franchise value, because of all the other things that are going on in the NHL, including a $500 million expansion fee for Las Vegas, has increased at least twice as much as the cash that we’ve lost.”\nI don’t know about you, but I’m dizzy.\nBottom line is this:\nThere is almost nothing different today from where the state of the team stood in August. The only changes were the departure of two minor investors and a family fight over what amounts to inheritance that has yet to demonstrate any financial damage to the Hurricanes. Could that be enough to force a change of heart from ownership? Maybe. But again, Karmanos insisted that he would be willing to sell the team only providing his price was met. Whether that price is inflated or not is only up to any potential buyers.\nTime will determine the outcome. The Hurricanes have been absent from post season play since the spring of 2009. Two years ago they were told to be patient, as if an early end to the season for the sixth straight year wasn’t already enough. They currently sit seventh in the wild card standings, seven points behind the Philadelphia Flyers, coincidentally, Tuesday night’s opponent as Carolina resumes play following the All Star extravaganza. And, the fan base is growing more and more apathetic as the memories of playoff hockey slip further into the distance.\nPeter Karmanos has his name etched on the Stanley Cup. No one can ever take that away from him. He was just inducted into the Hockey Hall of Fame in the “Builder” category for his work and dedication to “grass roots” hockey. However, the question isn’t whether or not he needs to sell the franchise, but whether this franchise needs a new owner.", "url": "https://apnews.com/4adf08d198994becd6e9e626dc681775"}