{"authors": ["Troy L. Smith"], "date_download": "2020-05-04 20:13:40", "date_modify": "2020-05-04 20:13:40", "date_publish": "2017-11-01 11:07:09", "description": "Jeremy Piven latest Hollywood star accused of sexual misconduct CLEVELAND, Ohio – Actor Jeremy Piven has issued a statement denying recent allegations of sexual misconduct brought against...", "filename": "_aa858584fa5347bc864f12513fd031d6_1588623220.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aa858584fa5347bc864f12513fd031d6_1588623220.html", "title": "Jeremy Piven latest Hollywood star accused of sexual misconduct", "title_page": "Jeremy Piven latest Hollywood star accused of sexual misconduct", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jeremy Piven latest Hollywood star accused of sexual misconduct\nCLEVELAND, Ohio – Actor Jeremy Piven has issued a statement denying recent allegations of sexual misconduct brought against the “Wisdom of the Crowd” star.\n“I unequivocally deny the appalling allegations being peddled about me,” the former “Entourage” star told Entertainment Weekly. “It did not happen. It takes a great deal of courage for victims to come forward with their histories, and my hope is that the allegations about me that didn’t happen, do not detract from stories that should be heard.”\nActress and former reality star Ariane Bellamar accused Piven of sexual misconduct on Twitter. Bellamar also insisted there is proof in the form of “abusive, explicit texts” sent to her from Piven.\nHey @jeremypiven! ’Member when you cornered me in your trailer on the #Entourage set? ’Member grabbing my boobies on the ?? without asking??— Ariane Bellamar (@ArianeBellamar) October 30, 2017\n‘Member when I tried to leave; you grabbed me by the ass, looked at yourself in the mirror, & said what a ‘beautiful couple’ we made? #MeToo https://t.co/liD7irs0o0— Ariane Bellamar (@ArianeBellamar) October 30, 2017\nJeremy Piven, on two occasions, cornered me & forcefully fondled my breasts & bum. Once at the mansion & once on set. #MeToo @AriMelber @CNN https://t.co/liD7irs0o0— Ariane Bellamar (@ArianeBellamar) October 30, 2017\nBoth HBO, the network that produced “Entourage,” and CBS, home of “Wisdom of the Crowd,” issued statements on the matter.\n“Today, via the press reports, is the first we are hearing about Ariane Bellamar’s allegations concerning Jeremy Piven,” HBO said in its statement. “Everyone at HBO and our productions is aware that zero tolerance for sexual harassment is our policy. Anyone experiencing an unsafe working environment has several avenues for making complaints that we take very seriously.”\n“We are aware of the media reports and are looking into the matter,” CBS said.\nSo interesting that @CBS stated today that they are investigating the @jeremypiven issue, yet neither myself or my reps have been contacted.— Ariane Bellamar (@ArianeBellamar) November 1, 2017", "url": "https://apnews.com/aa858584fa5347bc864f12513fd031d6"}