{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:09:35", "date_modify": "2020-05-04 20:09:35", "date_publish": "2017-11-05 04:01:01", "description": "If you've got a few celebrations coming up this holiday season, but don't feel like pulling out that little black dress one more time, then it may be time to refresh your wardrobe. But you don't...", "filename": "_09a0556225b24064b744bfed9a9d9170_1588622975.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_09a0556225b24064b744bfed9a9d9170_1588622975.html", "title": "Sharon Mosley: Party pick-me-ups take your LBD from lackluster to lit", "title_page": "Sharon Mosley: Party pick-me-ups take your LBD from lackluster to lit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "If you’ve got a few celebrations coming up this holiday season, but don’t feel like pulling out that little black dress one more time, then it may be time to refresh your wardrobe. But you don’t have to spend a fortune to get the party started ... here are some inexpensive ways to add some instant pizzazz this holiday season with just one or two accessories. Even your “old” LBD will feel like new.\n>> Start with shoes. Dorothy knew the power of those sparkling red slippers. And it’s true. One new pair of glamorous heels (or flats) can instantly transform an outfit, no matter how many times you’ve worn it. The party shoes this year are ready to click their way into your closet. Pick from crystal-embellished strappy heels, glittering cage sandals, gold lace-ups or sequin stilettos. These statement evening shoes make getting dressed day or night extra special.\n>> Reboot with boots. If you want your toes to do more than twinkle, then a new pair of boots may be just the kickstart your wardrobe needs. One of the best reboots this year is the thigh-high boot. In soft suede, laced-up the back, these boots are a sexy way to update short skirts or dresses. Velvety embroidered ankle boots are another way to amp up your holiday looks with festive flair. And if you really want to shine? Try a slick pair of silver or white pointy toe patent boots.\n>> Wrap up in faux fur. Yes, it’s a big fashion trend this year, but let’s face it, faux fur is here to stay. And you don’t have to spend a fortune to add some plush pleasure to your wardrobe. Check out the stoles, scarves and wraps that will instantly give anything you wear a luxurious touch. There are also plenty of chic fur muffs and cuffs that will dress up even the most basic of sweaters. Think oversized this time around, and think pink for the holidays.\n>> Bring on the bling. If there’s ever a moment to shine, the holidays are the perfect excuse to step out in the spotlight with major jewelry. Bigger is better. Those tiny diamond stud earrings may be OK for every day, but when cocktails are calling, so are the bigger baubles. Whether it’s chandelier earrings, pendant necklaces, multi-strand chokers or studded jeweled cuff bracelets, these glittering accessories are meant to be seen.\n>> It’s in the bag. Handbags, even when we party hardy, are always essential. Evening handbags can often be all the jewelry you need. Elegant clutches encrusted with pearls or studded with crystals are always a fun way to stash your essentials. From studded wristlets to velvety pouchettes and small suede shoulder bags, there’s a cocktail purse for every special occasion. Choose one that will complement all your holiday outfits, and give you plenty of festive style for years to come.\n>> Love those gloves. If you’re bored to death with that little black shift dress you’ve worn for the past few years, then slip into an elegant pair of long, opera-style suede gloves and see how they make you feel. Evening gloves are often a forgotten accessory, but they are one of the most glamorous options for holiday soirees. The fall/winter designer collections were filled with gloves embellished with beautiful details like floral appliques and embroidery. Cuffs get special treatment too, trimmed with crystal pave, pearls and fur. And when you want to show off that bigger than life cocktail ring, go for a pair of fishnet fingerless gloves and channel your inner Madonna all night long.\nTo find out more about Sharon Mosley, and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate Web page at www.creators.com.", "url": "https://apnews.com/09a0556225b24064b744bfed9a9d9170"}