{"authors": ["Rebecca Kolins Givan", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:55:58", "date_modify": "2020-05-04 19:55:58", "date_publish": "2017-02-17 00:00:00", "description": null, "filename": "2017_03_health-care-privatization-nhs-private-finance-intiative-blair-new-labour-unison_1588622158.html", "image_url": "https://images.jacobinmag.com/2017/02/17234043/unison-protest.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_03_health-care-privatization-nhs-private-finance-intiative-blair-new-labour-unison_1588622158.html", "title": "After Privatization", "title_page": "After Privatization", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe road to privatization is rarely straight. While we often think about the public employer/private employer dichotomy as “public good, private bad,” when it comes to unions, the reality is much more complicated. While public-sector workers typically have an easier time organizing than those in the private sector, employers in both sectors have no incentive to improve pay or working conditions without pressure from workers. Even in the United Kingdom, where public employment contracts are often negotiated nationally and unionized private companies often use national framework agreements, without workplace power, employers are left to reduce pay and conditions as they wish. As support services in health care have been privatized in Britain, support workers in public hospitals have become increasingly likely to work for private employers. Yet despite this process, some workers have built workplace power and revitalized their union locals, forcing private employers to raise working standards. Case studies of such union revitalization under privatized health care show the amount of power frontline staff have to push back. With union power heavily diminished at the national level, fighting on the shop floor is often the only way to stave off deteriorating pay and job quality. A policy may be passed by a legislative body, but the actual implementation is still subject to implementation at the workplace level, where unions can shape their implementation. In the United Kingdom when a new form of hospital financing and operation was introduced, initially by the Conservative government of the early 1990s, unions representing frontline staff fought off the most damaging aspects of the new initiative, ultimately forcing a change in national policy. After experiencing the change in policy, workers pushed for changes, which were eventually implemented nationwide. This positive feedback loop shows that strong workplace unions can influence national policy. The passage of policies benefiting corporations and harming workers isn’t the end of the line. Workers can shape how those policies are implemented by building power from the workplace.\nThe Private Finance Initiative Since the mid-1980s, public services in the United Kingdom have undergone a process of marketization. This has included various kinds of internal competition and outsourcing as well as wholesale privatization (for example, of the public utilities). The most widespread form of marketization has been the Private Finance Initiative (PFI), introduced in the mid-1990s. This program created a hybrid form of financing for public-private facilities and adopted this financing for hospitals, schools, and prisons. The initiative was enacted through legislation during the Conservative governments of the 1990s, but its use accelerated rapidly when Tony Blair’s New Labour government came to power in 1997. Under the PFI, facilities like hospitals, schools, and prisons are built by private contractors with private money, which provide up-front financing for a long-term loan to the government. The facilities are then operated in partnership with the public sector. When this arrangement is used for public services, a private-sector consortium is contracted to finance, build, and operate a hospital or community services, and the client makes an agreed annual payment for the duration of the contract (typically thirty years, but sometimes much longer). The consortium creates arrangements between a financial institution to secure financing, a construction company to build the facility, and a facilities management company to maintain the building and provide support services over the course of the contract. When a PFI is applied to a hospital in the United Kingdom, the National Health Service (NHS) hospital makes an annual payment to the company for the duration of the contract, and this represents the first obligation on a trust’s revenue. Even if the hospital faces layoffs and reductions in bed numbers, the investors are paid first. Despite its high public profile, there was initially little political interest in the workforce consequences of the introduction of PFIs, with many parliamentary inquiries neglecting workforce issues. Instead, politicians focused on whether these initiatives could provide increased health service capacity at a reasonable cost. To show the effects of this marketization measure, I collected data during a multiyear study of the consequences of the PFI on workers, conducted jointly with Stephen Bach, under the assumption that it is not possible to understand the effects of a policy change without talking to workers who are living with it. The hospital in this case, for which I use the pseudonym Greenbelt, was viewed as a flagship hospital project by policymakers, investors, and some union representatives. Unlike some PFI hospitals that had serious operational problems from the beginning, this one was widely perceived to be a success story, representing a smooth transition to public-private hospital financing and referenced frequently in discussions of the value of the PFI. Greenbelt was built on the outskirts of a small city to replace a decrepit, long-outdated building in town. It was opened early in the new millennium with nearly a thousand beds. The capital value was more than £150 million, and the PFI consortium included a number of construction and finance companies. The support services company, a major international player in the outsourced support services market, which I refer to here as Facilitiesco, had a 5 percent equity stake in the PFI consortium. The hospital buildings were owned by this private-sector consortium, and the hospital effectively paid rent for the building and for support services provided by Facilitiesco on behalf of the consortium. Greenbelt employed more than five thousand staff. Since the mid-1990s support services had been contracted out, so outsourcing support services under the PFI was not a major shift. Facilitiesco had not held any of the existing three-to-five-year support service contracts in the trust. These contracts changed workers’ terms and conditions of employment and led to high staff turnover, which led to falling trade union membership. Support staff working side-by-side were likely to be employed on completely different contracts, with different terms, conditions, and wages. Some worked for contractors which were part of the investment consortium, others for temp agencies or subcontractors. This was a challenge for the unions. They shifted from representing workers under a single, national public employer with consistent pay and conditions and relatively low turnover to trying to represent very low-wage workers under a fragmented set of private employers and consortia. In hospitals that had strong local union branches, the unions tried to appoint separate representatives (known as stewards or conveners) to the direct public hospital employees and the privatized facilities staff. At Greenbelt, the Facilitiesco union representative, who had previously represented workers directly employed by Greenbelt, highlighted the difficulties for the workforce and their union, UNISON: The [managing director of the subcontractor] came along, we invited him along for a day — we had lovely chats and everything else. Right at the crucial time of “Look, will you be willing to sit down with us and get a recognition agreement where we can work together?” he leaned across the table and went “I wouldn’t have my mother-in-law tell me how to run my business. I certainly wouldn’t have you.” Rank-and-file union representatives had negative experiences with previous contractors and contracting out, and this was important in evaluating the experience of Facilitiesco. Union activists were skeptical about the outsourced companies and whether they would be willing to work with the union at all. Initially, the private companies were not required to recognize the union or negotiate with it, so unions were dependent on maintaining a strong-enough membership to force the company to the bargaining table. The main stakeholders we interviewed identified the importance of collaborative relations and direct communication between key parties. This enabled the Facilitiesco managers to work directly with Greenbelt managers without involving all the players in the PFI consortium. All members of the PFI consortium suggested that they were very selective about the contracts they bid for and that a key criterion was the attitude of the client (here, the hospital). Perceptions of the client’s “attitude,” of course, are strongly determined by workers’ past experiences of these companies. Initially the PFI was a relatively unknown form of investment, so investors needed reassurance about the returns they could expect; an unsupportive client — e.g. one with a confrontational workforce — would increase the perceived risks. As a director of the investment company explained, “We like doing projects where the client is receptive to what we are providing; the ideal project is supportive client, supportive government, all parties are going into it to make it a success, and make it flexible and efficient. Unfortunately in life that is not always the case.” Facilitiesco managers expressed similar sentiments about the importance of a supportive client and how this affected their approach to employment relations. Facilitiesco stated that the Labour government’s emphasis on partnership working had altered the climate in which outsourcing occurred and that they strongly preferred to gain union support before submitting a bid. While private contractors and investors were primarily concerned with making money, investment opportunities were so numerous that there was no incentive to bid on a project where relationships between workers, public employers, and contractors were extremely contentious — providing an important leverage point for workers. Facilitiesco was willing to recognize trade unions at the local level on a contract-by-contract basis, although they were not willing to sign a national recognition agreement. This put the onus on local unions to show sufficient strength to force local recognition. This approach actually encouraged strong local union organization (which was presumably not the intention of Facilitiesco). Although the company was opposed to national bargaining, this did not preclude national-level dialogue with trade unions. Facilitiesco’s main focus was on ensuring that their track record was sufficient to gain workforce and local trade union support at the bid stage. As a manager explained, “The worst case is that if you don’t get a tick [check] in the box from the local trade unions, all things being equal, you’re not going to get the contract.” The investment consortia knew that union opposition could sink a bid and wanted to be known as higher-road employers. Many PFI companies initially granted unions recognition for bargaining over all issues except pay and benefits. Although the employer was willing to discuss certain issues with the union, pay negotiation was off the table. This allowed the contractors to claim that they were willing to work in partnership with, and negotiate with, unions while protecting their profits, usually at the expense of the wages of frontline staff.\nThe Consequences of the PFI in Greenbelt Greenbelt opened on schedule with the support services workforce migrating to Facilitiesco gradually as contracts came up for renewal. Facilitiesco employed approximately six hundred staff at Greenbelt for cleaning, portering, catering, parking management, maintenance, and grounds work. Of these, cleaning staff made up the largest group — about two hundred and fifty employees. Facilitiesco, however, had to manage a multi-tier workforce because staff had transferred from a number of different contractors; even within individual employers there was not absolute consistency. As the Facilitiesco manager emphasized: The problems it causes — you know, two cleaners working alongside, they talk about how much they’re getting: “Why do you get that much, I don’t get that much” — mayhem! Unmanageable, unnecessary things getting in the way of productivity. To resolve this challenge, to address potential equal pay concerns, and to respect strong workforce traditions of unionization, Facilitiesco management agreed to recognize the main unions — Amicus, GMB, the Union of Construction, Allied Trades and Technicians (UCATT), and UNISON — and to provide full-time union release to one of their employees, who had been a long-serving senior UNISON representative. There were glaring gender inequities where jobs with similar skill levels were completely divided by gender: for example, the male employees in maintenance and parking were paid significantly more than the female employees in food service or cleaning. The disciplinary and grievance procedures of the former contractors also varied, and this reinforced the complexity of managing the workforce. As a union representative reported, It was awful, Fred Bloggs had a disciplinary then you had to go through which disciplinary procedure you used for him because was he an ex-Mediguard or ex-initial or ex-RCO person? For our job as union people it was easier to simplify things, as it was for the company as well. The strategy of the union at Greenbelt reflected the emphasis on a twin-track approach in which it engaged positively with the trust in identifying a preferred contractor and assisted Facilitiesco in harmonizing terms and conditions. But the union also threatened to strike on several occasions and was not afraid to speak out against either Greenbelt or its contractors. Workers’ ability to threaten industrial action was dependent on high union membership. The Facilitiesco union representative recruited actively and increased the membership to four hundred out of a total of six hundred staff. Of this total, fewer than a quarter were originally NHS employees, and the remainder were recruited after the service had been outsourced. Staff saw Facilitiesco management in a more positive light than previous contractors because the managers were willing to adopt hospital policies and had a relatively positive attitude to training and development. Facilitiesco was undoubtedly a better employer than some of the earlier contractors and employees were well aware that their plight could be much worse. Nonetheless, many of the lowest paid staff were paid at minimum-wage levels (£4.85 in 2004–5). This became a major issue in 2005 when UNISON asked for an extension of NHS work terms to all employees working on NHS contracts or as part of PFI arrangements at twenty-four private contractors. A substantial gap emerged between NHS and contractor rates. Against a backdrop of national-level discussions, Facilitiesco made several offers in the range of £5.00 to £5.20 per hour, but it wasn’t enough for workers. In March 2005, UNISON members working for Facilitiesco at Greenbelt took a strike vote; 74 percent of voting workers (31 percent of the total workforce) voted for industrial action that would affect all support services. During this period there was intensive lobbying by UNISON nationally and locally to encourage Facilitiesco to raise their wage offer. Pressure from the union was directed mainly at Greenbelt management, which wanted to avoid the political embarrassment of industrial action close to a national general election. Because the Labour government had staked significant political capital on improving and upgrading the NHS and its facilities, a strike could have had national political implications. As a trade union national officer explained, the branch chair’s role was to talk to the trust as well — “You don’t want a strike do you?” If you are chief executive of a brand spanking new hospital . . . you don’t want to be seen to be messing it up. [The branch chair] put pressure on the board of the trust, who put pressure on the consortium, who put pressure on Facilitiesco. The hospital board expressed its sympathy for Facilitiesco staff and suggested that all staff deserved “fair pay” but stopped short of endorsing the claim for parity with NHS employees. The dispute was resolved and industrial action averted after discussions mediated by the Advisory, Conciliation, and Arbitration Service (ACAS), the national government arbitration service. In the case of Greenbelt, policy trickled up as a result of feedback from active and vocal frontline workers. The union-led response to the bumpy implementation of the PFI led to a change in national policy, specifically new protections for employees whose work was privatized. This would not have been possible without mobilization and recruitment at the workplace, which was a priority for the UNISON representative as he tried to improve pay and conditions for his members. The discussions at ACAS formed the basis for national-level agreements between the trade unions, employers, and government that committed private contractors to migrate staff to NHS pay rates over time. Frontline staff used their workplace leverage to achieve better pay and conditions. Although it was too late for the unions to fight the PFI itself, they could ameliorate its impact. This frontline fight used traditional union strategies, focusing on negotiation backed with the threat of a strike. The strategy relied on increasing union membership in what is essentially the UK equivalent of a right-to-work context. As a result of this dispute and the wider national-level agreement that followed, trade unions managed to attain substantial increases in terms and conditions of employment and to blunt the most detrimental consequences of marketization.\nExtending Public Sector Standards in Greenbelt The requirement to extend NHS pay to the Facilitiesco workforce demonstrated that government measures could extend public-sector norms to the private sector. Union representatives at Greenbelt felt confident that, due to their ongoing pressure, Facilitiesco staff were working in conditions similar to those that they had experienced when they were direct NHS employees. In this sense, they were winning the pay and conditions battle, even while losing the privatization war. For example, Facilitiesco employees were able to access a variety of training programs. Cleaning staff were encouraged to undertake vocational credentialing courses offered by the British Institute of Cleaning Science. The Facilitiesco manager commented that “staff feel more motivated due to the national recognition that this award provides.” These new opportunities allowed workers to attain some dignity, and move away from feeling undervalued and disposable. Many of the benefits for Facilitiesco staff were underpinned by the managerial and contractual inflexibility of the PFI contract. Because the detailed PFI contract spelled out the specific staffing requirements, Facilitiesco was bound to keep to its long-term commitment, regardless of the fluctuations of the market (or even changes in hospital needs). Because the trust was committed to payments to the consortium for thirty-five years irrespective of its changing needs, this provided more job security to the Facilitiesco staff than to the trust-based staff in an uncertain public expenditure context. The UNISON representative explained that: [Greenbelt has] started laying people off, several hundred they are looking at, and [Facilitiesco] have said we don’t need to lay anyone off at all . . . so yes, people working with [Facilitiesco] have definitely got more job security than people working in the trust have. An indication that NHS employment was no longer necessarily seen as more desirable than Facilitiesco employment was that in 2006 when the contract was up for renewal, unionized Facilitiesco staff expressed no interest in participating in an in-house (public sector) bid that if successful would have seen them transferred to NHS employment. This may have indicated a lack of ideological commitment to public employment, a general satisfaction with the new status quo, or both. The risk, then, of a workplace-based strategy is that workers move away from larger ideological commitments in defense of the public sector. In this case they were not motivated by UNISON’s stated opposition to privatization, but rather to improving their daily work lives.", "url": "https://www.jacobinmag.com/2017/03/health-care-privatization-nhs-private-finance-intiative-blair-new-labour-unison"}