{"authors": ["Matthew Stolle", "Mstolle Postbulletin.Com"], "date_download": "2020-05-04 20:21:00", "date_modify": "2020-05-04 20:21:00", "date_publish": "2017-02-03 15:13:00", "description": "Since suspending travel into the U.S. from seven Muslim-majority countries, President Trump's action has met with a tsunami of rage: Lawsuits, legal rebukes and demonstrations across the country...", "filename": "_0bfacb35696e463ebf02e95c019a0bb3_1588623660.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0bfacb35696e463ebf02e95c019a0bb3_1588623660.html", "title": "Republicans defend travel ban", "title_page": "Republicans defend travel ban", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Since suspending travel into the U.S. from seven Muslim-majority countries, President Trump’s action has met with a tsunami of rage: Lawsuits, legal rebukes and demonstrations across the country from those who see it as a betrayal of the country’s values.\nYet, those who support the move, including Republicans and others in and around Olmsted County, see the order as a prudent measure. And they feel the outrage that has greeted it as being fueled by politics, a misunderstanding of the order’s purpose and a deep loathing for the new president.\nAnd they vehemently disagree with the characterization that the act is a Muslim ban.\nAaron Miller\n“I think there’s a lot of opposition to this mainly because, A, Trump did it, and there’s a opposition to his administration. And B, a lot of people honestly believe that it has to do with Muslim versus geographical,” said Aaron Miller, chairman of the Republican Party of Olmsted County.\nA 29-year Army veteran and retired command sergeant major, Miller has been deployed to regions all over the world and experienced firsthand several of countries listed under the ban. And what distinguishes them is that they are either failed states with little to no functioning government or hostile to U.S. interests.\nPresident Trump’s executive order bans travel to the United States for 90 days from seven predominantly Muslim countries — Iran, Iraq, Libya, Somalia, Sudan, Syria, and Yemen — and suspending refugee resettlement for 120 days. Syrian refugee resettlement is suspended indefinitely.\nCritics are fear mongering, Miller say, when they fail to point out that the measure is a “temporary pause,” aimed at allowing the Department of Homeland Security to review and develop more effective vetting procedures.\nPolls show more Americans support the travel ban than oppose it. A Reuters poll taken Jan. 30 and 31 found that 49 percent of Americans said they either “strongly” or “somewhat strongly” agreed with Trump’s order, while 41 percent “strongly” or “somewhat strongly” disagreed.”\nStill the move has been met with fierce resistance from critics who say it could have a chilling effect on everything from business and tourism to research. In Rochester, more than 1,000 people packed the Peace Plaza to protest the ban.\nRochester could be more affected than most communities by the ban. The Brookings Institute ranked communities that could be most significantly affected by the Trump immigration order. Rochester ranked No. 5 as a metropolitan area with the highest percentage of residents from the banned countries.\n“A few of these places are home to significant educational and medical institutions (e.g., the Mayo Clinic in Rochester, James Madison University in Harrisonburg, the University of Iowa in Iowa City, and the University of Michigan in Ann Arbor) that have attracted highly qualified faculty and students from those countries,” the Brookings Institute article said.\nMohamoud Hamud, a Mayo Clinic counselor for Muslim patients, said the vast majority of refugees who come to the U.S. are fleeing violence.\n“We came for peace, and we are appreciating the United States,” he said.\nHamud believes the ban will be counterproductive and make the U.S. less safe, because it sends the message that people from the affected countries are “not wanted here.”\n“It will be good PR for ISIS,” Hamud said. “It’s a good recruitment for these groups. It doesn’t help the situation.”\nBill Kuisle\nBill Kuisle, a former state representative and farmer, said it’s appropriate to call a timeout on travel from these countries, given the mood in the country and uncertainty about what’s happened there.\n“People have a deep concern about their safety,” Kuisle said. “They want people to come here and become part of their communities, but they see what’s going on in other countries and it scares the bejeezus out of them.”\nMiller adds that it’s hard to find fault with a president who is following through on one of his campaign pledges.\n“Trump said he was going to do it,” Miller said. “I think it’s actually refreshing that we’ve got somebody in office that in the first 10 days are, oh, my gosh, actually doing what they campaigned on.”", "url": "https://apnews.com/0bfacb35696e463ebf02e95c019a0bb3"}