{"authors": ["Peter Frase", "Mike Davis", "Liza Featherstone", "Seth Ackerman", "Shawn Gude", "Chris Maisano"], "date_download": "2020-05-04 19:53:22", "date_modify": "2020-05-04 19:53:22", "date_publish": "2017-07-19 00:00:00", "description": null, "filename": "2017_07_socialism-liberalism-left-frase_1588622002.html", "image_url": "https://images.jacobinmag.com/2017/07/19005749/1-2D9SB92Xp1D_VrwIiqXcZg.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_07_socialism-liberalism-left-frase_1588622002.html", "title": "What It Means to Be on the Left", "title_page": "What It Means to Be on the Left", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Elizabeth Bruenig has written about the distinction between “liberals” and “the left.” She proposes that everyone in the broad tent of what she calls “non-Republicanism” is actually a liberal, in the following sense:\nThe second sense in which almost every non-Republican is a liberal is that they all agree with the tenets of liberalism as a philosophy: that is, the worldview that champions radical, rational free inquiry; egalitarianism; individualism; subjective rights; and freedom as primary political ends. (Republicans are, for the most part, liberals in this sense too; libertarians even more so.)\nThis is an easy statement for me to agree with — but I also think it brushes past some political distinctions that are important.\nAm I a partisan of “radical, rational free inquiry”? I suppose I am, in that, like Marx, I endorse a “ruthless criticism of the existing order,” one which “will shrink neither from its own discoveries, nor from conflict with the powers that be.”\nDo I believe in “egalitarianism”? Naturally — one of the basic structural features of my book is the distinction between a hierarchical society, like our own, and one where everyone shares in both the benefits and the sacrifices that are possible or necessary given our level of technological development and ecological constraint.\nIndividualism? Also uncontroversial, although it’s not entirely clear what the term is supposed to mean. I side with Oscar Wilde, who said that “with the abolition of private property, then, we shall have true, beautiful, healthy Individualism.” That instead of the false freedom of those condemned to work for others for a paycheck — free in Marx’s “double sense” of being free to sell our labor power and free of anything else to sell — we can have what Philippe Van Parijs calls “real freedom,” the freedom that comes from having the time and the resources to pursue self-actualization.\nAs for “subjective rights,” I’m not completely sure what that’s supposed to mean. Rights that are politically stipulated and democratically assigned, I guess, rather than arising from some divine concept of natural law? In that case, again, I’m on board, and I think the “social rights” arguments of people like T. H. Marshall can be usefully synthesized with the politics of opposing oppression and exploitation.\nAnd then, of course, there is freedom. A word lodged deeply in the liberal tradition, and in the American tradition. And one, I think, that should be at the center of socialist politics as well. But freedom from what, and freedom to do what?\nHere is Bruenig’s gloss on the meaning of socialism: “the economic aspects of liberalism (free or freeish market capitalism) create material conditions that actually make people less free.”\nI like this, yet again I find it vague. In describing my own political trajectory, I often talk about my parents’ liberal politics, and my own journey of discovery, through which I concluded that their liberal ideals couldn’t be achieved by liberal means, but required something more radical, and more Marxist.\nBut what would it mean to escape “the economic aspects of liberalism”? Would it mean merely high wages; universal health care and education; a right to housing; strong labor unions?\nTo be clear, I am in favor of all of those things.\nBut we’ve seen this movie before. It’s the high tide of the welfare state, which is nowadays sometimes held up as an idyllic model of class peace and human contentment: everyone has a good job, and good benefits, and a comfortable retirement. (Although of course, this Eden never existed for much of the working class.) Who could want more?\nThe historical reality of welfare capitalism’s postwar high tide, though, is that everyone wanted more. Capitalists, as they always do, wanted more profits, and they felt the squeeze from powerful unions and social-democratic parties that were impinging on this prerogative.\nMore than that, they faced the problem of a working class that was becoming too politically powerful. This is what Michal Kalecki called the “political aspects of full employment,” the danger that a sufficiently empowered working class might call into question the basic structure of an economy based on concentrated property rights and capital accumulation.\nSometimes socialists will emphasize economic democracy as the core of our politics. Because as the Democratic Socialists of America’s statement of political principles puts it, “In the workplace, capitalism eschews democracy.” According to this line of argument, socialism means taking the liberal ideal of democracy into places where most people experience no democratic control at all, most especially the workplace.\nBut when you talk about introducing democracy, you’re talking about giving people control over their lives that they didn’t have before. And once you do that, you open up the possibility of much more radical and disruptive kinds of change.\nFor it is not just capitalists who always want more, but workers too. A good job is better than a bad job, is better than no job. Higher wages are better than low. But a strong working class isn’t inclined to sit back and be content with its lot — it’s inclined to demand more.\nOr less, when it comes to the drudgery of most jobs. After all, how many people dream of punching clocks and cashing paychecks at the behest of a boss, no matter what the size of the check or the security of the job?\nThe song “Take This Job and Shove It” appeared in the aftermath of a period when many workers could make good on that threat, and did. In the peak year, 1969, there had been 766 unauthorized wildcat strikes in the United States, but by 1975 there were only 238.\nAll of this goes to the point that even if we could get back the postwar welfare state, that simply isn’t a permanently viable end point, and we need a politics that acknowledges that fact and prepares for it. And that has to be connected to some larger vision of what lies beyond the immediate demands of social democracy. That’s what I’d call socialism, or even communism, which for me is the ultimate horizon.\nThe socialist project, for me, is about something more than just immediate demands for more jobs, or higher wages, or universal social programs, or shorter hours. It’s about those things. But it’s also about transcending, and abolishing, much of what we think defines our identities and our way of life.\nIt is about the abolition of class as such. This means the abolition of capitalist wage labor, and therefore the abolition of “the working class” as an identity and a social phenomenon. Which isn’t the same as the abolition of work in its other senses, as socially necessary or personally fulfilling labor.\nIt is about the abolition of “race,” that biologically fictitious, and yet socially overpowering idea. A task that is inseparable from the abolition of class, however much contemporary liberals might like to distract us from that reality.\nAs David Roediger details in his recent essay collection on Class, Race, and Marxism , much of the forgotten history of terms like “white privilege” originated with communists, who wrestled with the problem of racism not to avoid class politics but to facilitate it. People like Claudia Jones, or Theodore Allen, whose masterwork, The Invention of the White Race , was, as Roediger observes, borne of “a half century of radical organizing, much of it specifically in industry.”\nAnd so too, no socialism worth the name can shrink from questioning patriarchy, gender, heterosexuality, the nuclear family. Marx and Engels themselves had some presentiment of this, some understanding that the control of the means of reproduction and the means of production were intimately and dialectically linked at The Origin of the Family, Private Property and the State.\nBut they could follow their own logic only so far, and so it fell to the likes of Shulamith Firestone to suggest radical alternatives to our current ways of organizing the bearing and raising of children. It took communists the likes of Leslie Feinberg and Sylvia Federici to complicate our simplistic assumptions about the existence of binary “gender.” And the more we win reforms that allow people to define their sexualities and gender identities, to give women control of their bodies, to lessen their economic dependence on men, the more this kind of radical questioning will spill into the open.\nSo that’s what it means to me to be on “the left.” To imagine and anticipate and fight for a world without bosses, and beyond class, race, and gender as we understand them today. That, to me, is what it means to fight for individualism, and for freedom.\nThat’s one reason that I make a point of arguing for a politics that fights for beneficial reforms — single-payer health care, living wages, all the rest — but that doesn’t stop there. A politics that fights for the “non-reformist” reform: a demand that is not meant to lead to a permanent state of humane capitalism, but that is intentionally destabilizing and disruptive.\nThe other reason is that, for all the economic and political reasons noted above, we can’t just get to a nicer version of capitalism and then stop there. We can only build social democracy in order to break it.\nIs that what every liberal, or even every leftist, believes? From my experience, I don’t think so. That’s not meant to be a defense of sectarianism or dogmatism; I believe in building a broad united front with everyone who wants to make our society more humane, and more equal. But I have my sights on something beyond that.\nBecause if we do all agree that the project of the Left is predicated on a vision of freedom and individualism, then we also have to regard that vision as a radically uncertain one. We can only look a short way into the future — to a point where the working class has had its shackles loosened a bit, as happened in the best moments of twentieth-century social democracy.\nAt that moment we again reach the point where a social-democratic class compromise becomes untenable, and the system must either fall back into a reactionary form of capitalist retrenchment, or forward into something else entirely. What our future selves do in those circumstances, and what kinds of people we become, is unknowable and unpredictable — and for our politics to be genuinely democratic, it could not be any other way.", "url": "https://www.jacobinmag.com/2017/07/socialism-liberalism-left-frase"}