{"authors": ["Kate Aronoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Marshall Steinbaum", "Michael A. Mccarthy", "Nick Tabor"], "date_download": "2020-05-04 19:55:48", "date_modify": "2020-05-04 19:55:48", "date_publish": "2017-12-03 00:00:00", "description": null, "filename": "2017_12_republican-tax-plan-democrats-national-debt_1588622148.html", "image_url": "https://images.jacobinmag.com/2017/12/03110739/GettyImages-881188098.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_12_republican-tax-plan-democrats-national-debt_1588622148.html", "title": "How Not to Debate the Tax Plan", "title_page": "How Not to Debate the Tax Plan", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The tax bill that just passed in the Senate was the brainchild of the Republican leadership. For decades the party has been pushing a plan to redistribute society’s resources into as few hands as possible. Senate Democrats — and the constituents who pressured them at home and on Capitol Hill — pulled off an impressive feat getting even their most conservative colleagues to fall in line with the party’s unanimous vote against a tax bill certain to reshape the economy to suit the 1 percent even better than it already does.\nBut party leaders shouldn’t get off scot-free. It’s hard to say what congressional Democrats themselves could have done differently regarding this tax plan. Sweeping tax reform has been a longstanding priority for the modern GOP. With their egos bruised after several failed policy pushes on issues like health care and immigration, congressional Republicans came in to the tax battle hellbent on getting something passed — ideally with as many Easter eggs for the party’s wealthy donors as possible.\nDemocrats’ failings in this fight were more cringeworthy than defeat-inducing. Senate Democrats’ social media arm put out memes and videos of Ronald Reagan passing tax reform in the mid-eighties as an apparent appeal to bipartisanism. Speaking against the bill, House minority leader Nancy Pelosi described the tax plan with the crying-face emoji in an apparent appeal to millennials.\nBad content wasn’t what lost the tax fight, but it certainly doesn’t inspire confidence that the supposed opposition party can mount a forward-facing vision of the future, especially in light of the myriad challenges likely to come down the pipeline: attempts to end net neutrality, liquidate organized labor, and cripple the Environmental Protection Agency’s ability to regulate carbon (to name just a few).\nYou have to look a bit farther back to understand Democrats’ role in the tax bill’s passage, to the party’s wholesale embrace of Republicans’ right-wing dogmas about the economy. Chief among them? Deficit hawkishness.\nBill Clinton came out of the gate swinging against government spending in 1993 with his Deficit Reduction Act, following it up with the Balanced Budget Act of 1997. An archived summation of the Clinton White House’s accomplishments notes how he put America’s “fiscal house in order,” and carried out the lowest level of government spending since 1966.\nAs recently as the 2012 election cycle, former Clinton staffers fought with then-candidate and Clinton-era House speaker Newt Gingrich over who could more accurately claim to have curbed spending in the nineties. “It takes two,” one Gingrich spokesman said during the tuft. “A bill is just a bill, but working with Newt, bills became welfare reform, tax cuts, and balanced budgets.”\nWhat about Republicans? For as long as they’ve squawked about the moral ills of deficit spending, they’ve carried out massive deficit spending. Ronald Reagan himself — remembered as the GOP poster boy for small government fiscal responsibility — doubled the budget for the Department of Education after promising to abolish it outright, oversaw a $90 billion increase in Social Security spending, and presided over a $280 billion increase in federal entitlement programs.\nThe economic policies drew heat from the free-market Cato Institute as early as 1982. By 1988, the libertarian Von Mises Institute was chiding the Gipper for having “abandoned the free-market position and acquiesced in further crippling of the economy and our liberties.”\nWhile the Koch brothers and other wealthy donors have certainly helped bring modern conservatism closer to Cato-style small government dogmatism in recent years, what was true then remains true now: Republicans only care about the deficit when they can weaponize it against the poor and their opponents’ political priorities.\nRepublicans’ dirty secret is that they love big government. A peacetime president, Ronald Reagan ran up the third largest deficit of any US chief executive after Franklin D. Roosevelt and Barack Obama. The former undertook massive spending with the New Deal and World War II, and the latter carried on several concurrent and massively expensive wars abroad. Fourth and fifth on the list are George H. W. Bush and Gerald Ford. In an era where small deficits and small government are considered a kind of religion for Republicans, the party regularly pushes for massive defense expenditures and — of course — deficit-inducing tax breaks for corporations and the wealthy.\nToday, Democrats have continued preaching deficit hawkishness even as Republicans have all but given up the pretense of having believed in it — most egregiously, in the most recent tax fight. An analysis from the nonpartisan Joint Committee on Taxation found that the tax bill will add around $1.4 trillion to the federal deficit over the next ten years. Yet as GOP top brass dismissed concerns about their tax bill’s impact on the national debt, even progressive Democrats framed much of their outrage at the bill in terms of its budgetary impacts.\nTed Lieu — in the House — said the Senate bill would “explode the federal deficit.” Visiting Rhode Island recently, Pelosi commented that, under the GOP tax plan, “future generations will pay more because the deficit will explode.” After the vote came down early Saturday morning, Senate minority leader Chuck Schumer seemed less concerned that millions would be booted off their insurance than with the fact that Democrats weren’t able to reach an agreement on how best to carry out Republicans’ massive overhaul of the American economy.\n“Tonight,” he tweeted, “I feel mostly regret at what could have been. Tax reform is an issue that is ripe for bipartisan compromise. There is a sincere desire on this side of the aisle to work with the GOP, particularly on tax reform, but we have been rebuffed, time and time again.”\nCompare this to Republicans’ approach. The standard line — from the White House and congressional GOP alike — was that the economic growth tax cuts on the wealthy would bring about would somehow balance out any deficit spending, mostly by referring back to a skeleton crew of 137 economists to back up their claims, several of whom are either in-house economists for major banks and corporations, not economists at all or — possibly — dead. Responding to estimates from the joint committee, Senator John Cornyn replied simply that “we think they lowballed it.”\nBut Democrats were under no obligation to continue aping wrongheaded Republican talking points about federal budgets. Monstrous as it is, the passage of the tax bill does present an opportunity for them to finally do away with the bizarre neoliberal orthodoxy they’ve swallowed about how and when governments should spend money.\nIt’s not that deficits don’t matter. The important thing isn’t that money is spent, but how and where it gets spent. Historically, deficit spending has been intended to place the economy as a whole on a stronger footing by putting more money in people’s pockets that they’ll then spend. Usually that’s accomplished either by putting people back to work directly when unemployment is high, as in the Great Depression, or writing checks, as in the post–financial crisis stimulus.\nThe problem with the deficit spending of the kind Republicans have just rammed through is that the people on the receiving end are likely to spend their money in ways that mainly just make the rich richer. The very wealthy — who would see a $5.8 billion reduction in their taxes over ten years — already have more than enough money to spend on consumer goods like cars and vacations. Give them more money and they’ll invest it in things like stocks and real estate — not exactly fountains of job creation.\n“They’re already consuming everything they could possibly want to consume,” former Senate Budget Committee chief economist Stephanie Kelton told MarketWatch of the people who will overwhelmingly benefit from the tax bill. “Allowing them to have more disposable income isn’t going to add new spending to the economy, creating more jobs for the rest of us. I don’t expect much of an increase in growth or employment.”\n“The US is almost always in deficit,” she added. “I think though that [the tax bill] opens the door to a new kind of conversation about deficit spending, one that would allow politicians on both sides to debate the best use of the deficit to achieve the broad goals of shared prosperity, more growth, better jobs, higher wages, and a more prosperous economy.”\nWith the mask of Republican deficit hawkishness now pulled all the way off, why should Democrats keep up the charade? A forward-facing spending plan could galvanize voters around a vision for the future instead of a protest vote against Trump and the Republicans. It could also help deal with everything from crumbling infrastructure to deepening inequality to climate change, putting Americans to work in the kinds of well-paid jobs that both get the economy moving and give workers more bargaining power.", "url": "https://www.jacobinmag.com/2017/12/republican-tax-plan-democrats-national-debt"}