{"authors": ["Judy Newman", "Wisconsin State Journal"], "date_download": "2020-05-04 20:06:15", "date_modify": "2020-05-04 20:06:15", "date_publish": "2017-11-17 02:00:00", "description": "A Madison company that helps sports teams reserve time at playing fields and an Oshkosh startup that gives parents the power to limit their children’s social media access won the judges’ favor at...", "filename": "_839f73fca4224940849309fe63b91418_1588622775.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_839f73fca4224940849309fe63b91418_1588622775.html", "title": "Startups GymDandy and Pyxsee win the Elevator Pitch Olympics", "title_page": "Startups GymDandy and Pyxsee win the Elevator Pitch Olympics", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Madison company that helps sports teams reserve time at playing fields and an Oshkosh startup that gives parents the power to limit their children’s social media access won the judges’ favor at the Elevator Pitch Olympics in Madison on Thursday.\nGymDandy and Pyxsee tied for top honors from the judges, and GymDandy also won the People’s Choice award from the audience.\nThe Elevator Pitch Olympics is traditionally one of the highlights of the Wisconsin Early Stage Symposium. Leaders of young companies each have 90 seconds — or about as long as an elevator ride — to explain what their companies do and then get feedback and numeric scores from a panel of judges, who are usually investors and mentors.\nThis year, 17 startups made their pitches. They ranged from Lifebook Builder, a digital record of a child’s growth and development, to NovoMoto, a company bringing solar energy to homes in the Democratic Republic of Congo, to StakeHaul, an online social wagering platform.\nGymDandy co-founder and CEO Nicholas Kartos told the judges there are more than 75 million team sport athletes in the U.S., from four-year-old soccer players like his son to “old guys like me trying to play pickup basketball games.” He said they spend more than $10 billion a year to rent spaces such as skating rinks, soccer fields and volleyball courts.\nKartos said youth and adult teams can save time trying to find available space to book a practice or a game while venues like parks, churches and schools can bring in more revenue using GymDandy’s online reservation tools.\n“Our goal is to make it easier for everyone to get out and play sports,” Kartos said, in an interview after the competition. As rental prices increase, “if we can make it easier to rent space, some of those costs can come down.”\nFounded in 2015, GymDandy was chosen to participate in the Stadia Sports Business Accelerator in St. Louis last year. The company has six full-time employees.\nPyxsee went live in April and already has 10,000 active users, founder, CEO and sole employee Dayne Rusch told the judges. He said kids today spend, on average, more than two-and-a-half hours a day on social media. That translates to more than six years over a lifetime — “more time than they spend eating, drinking and socializing face-to-face, combined,” he said.\nPyxsee has an app that parents can use to limit their children’s time on social media and their access to specific social media outlets — or that adults can engage to track their own involvement.\nMichael Thorson, co-founder of Inventure Capital in Madison and one of the four judges, said Rusch gave a great pitch. “Your statistics were so eye-opening,” he said.\nAnother judge, Dan Rashke, president and CEO of TASC, Madison, said he would have liked to hear if the app is changing behaviors.\nRusch, 22, is a senior at UW-Oshkosh — prime time for social media users.\nIn an interview later, he was asked what made him develop the app. “I just saw so many kids get lost in their phones, in the virtual world, instead of ... interacting with actual human beings,” Rusch said.\nThe Early Stage Symposium, a two-and-a-half day event produced by the Wisconsin Technology Council, wrapped up Thursday at Monona Terrace. About 600 people attended the conference, which was aimed at connecting entrepreneurs and investors.", "url": "https://apnews.com/839f73fca4224940849309fe63b91418"}