{"authors": ["Clara Hendrickson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:45", "date_modify": "2020-05-04 19:58:45", "date_publish": "2017-01-17 00:00:00", "description": null, "filename": "2017_01_denmark-nordic-welfare-universal-social-democracy-workers-solidarity-race_1588622325.html", "image_url": "https://images.jacobinmag.com/2017/01/17233002/15-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_01_denmark-nordic-welfare-universal-social-democracy-workers-solidarity-race_1588622325.html", "title": "We Could Be Denmark", "title_page": "We Could Be Denmark", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Though those states have their limits, it’s easy to see why many Bernie supporters look to them to as models for achieving broad economic prosperity and equality. The Trump years mean that it’s more important than ever to grapple with how to build a new class coalition while rejecting the white nationalism attached to Trump’s campaign. We can do this by looking to the history of the Nordic welfare states to understand how they were constructed. Though eroded by rounds of austerity and increasingly embattled by right populism, they remain one of the best examples we have of class organizing that yields lasting results.\nThis, of course, isn’t the first time Sanders has faced this controversy. During the primaries, Hillary Clinton rhetorically asked, “If we broke up the big banks tomorrow, would that end racism? Would that end sexism?” And in the October 2015 debate, when Sanders proclaimed that “we should look to countries like Denmark, like Sweden and Norway and learn from what they have accomplished for their working people,” she reminded Americans that “we are not Denmark.” Implicit in her comment was the long-standing myth that the Nordic states can provide such a robust welfare state only because of their racial and ethnic homogeneity.\nSome attribute Hillary Clinton’s surprise loss to the breakdown of the party’s strategy, built on marrying neoliberal economics with the politics of social inclusion. Bernie Sanders has loudly reaffirmed his commitment to making class politics the Democrats’ defining feature in hopes of turning Trump voters attracted to a message of economic populism, as well as the many more Americans who did not vote at all, into a new political movement. In response, Sanders has had to contend with accusations that he’s endorsing Trump’s white nationalism and that his criticism of certain forms of identity politics amounts to white supremacy .\nWith the close of the 2016 election — what John Oliver called “Oh, I Get It: We All Died, and This Is Hell, and Satan Has Cursed Us to Live Out This Nightmare for All Eternity 2016” — the obsession with the GOP’s identity crisis faded, and observers turned their intellectual energy to dissecting the Democratic Party’s failure.\nUniversal Welfare ≠ Homogeneity\nTo explain why the United States only has a means-tested, stigmatizing welfare system, commentators have pointed to distinct cultural features — our racial diversity, our deep-rooted libertarianism, and more. The Sanders campaign, however, successfully exposed a fundamental paradox in American thinking: We believe American citizens have a unique opportunity to pull themselves up by their bootstraps, but the facts tell a different story.\nThe social mobility American citizens encounter today is at historically low levels and fails to support the notion that by maintaining a social system that tolerates high levels of inequality, Americans will be encouraged to work their way up the income ladder. A 2008 Brookings and Economic Mobility Project study found that, when compared to other rich industrialized countries, US families’ economic mobility across generations is exceptionally low. In the United States, one finds a greater association between the earnings of fathers and their sons than in peer countries, including Canada, Norway, Finland, and Denmark.\nAmerica’s lower social mobility proves most detrimental for those at the bottom:\nMen born into the poorest fifth of families in the United States in 1958 had a higher likelihood of ending up in the bottom fifth of the earnings distribution than did males similarly positioned in five Northern European countries — 42 percent in the United States, compared to 25 to 30 percent in other countries. Furthermore, in the United States, only 8 percent make the “rags-to-riches” climb from bottom to top rung in one generation, while 11 to 14 percent do so in other countries.\nNot only is it more difficult for those starting at the bottom rung of the economic ladder in the United States to move upwards, but this group also had lower wage growth between 1986 and 1991 when compared to their European counterparts. More recently, Stanford economist Raj Chetty and others found that, in 2014, barely half of Americans in their thirties made more than their parents did at a similar age. In 1970, 92 percent of Americans outperformed their parents.\nDespite these findings, Swedish-Iranian author Nima Sanandaji, a proponent of rolling back the Nordic welfare state, argues that “the American Dream of income mobility is more vivid in capitalist America than in the Nordic welfare state systems.” He accounts for the United States’s exceptionally low levels of social mobility by arguing that “the stronger link between the outcome of parents and their children in the United States is because the country is considerably more diverse.”\nContending that America’s social mobility ratings derive from the earnings differences between racial and ethnic groups rather than the absence of opportunities to get ahead, Sanandaji thinks it would make more sense to compare Nordic social mobility with that found in ethnically homogenous areas of the United States, like Utah.\nUnfortunately, he doesn’t adequately explain why using race and ethnicity to compare relative social mobility offers a more accurate measure than using social class. Instead, he assumes that homogeneity is the bedrock of Nordic prosperity.\nMany agree with Sanandaji, assuming that diversity inherently runs counter to high levels of social spending. This translates into the widely employed political rhetoric of trade-offs between maintaining the solidarity underlying generous welfare spending and accommodating immigrants, indigenous communities, and diverse racial and ethnic populations.\nThis view is shared across the political spectrum. At a recent conference hosted by the National Policy Institute, Nathan Damigo claimed that most members of the “alt-right” embrace socialism but believe racial homogeneity to be a prerequisite:\nPeople actually become less interested in socialism because they feel like their hard-earned money is going to people who are different from them . . . and that actually makes socialism more difficult. . . . The more racially homogenous a society is, the more it’s going to function.\nSimilarly, the Danish People’s Party ran their 2015 election campaign on “maintaining the Denmark you know,” winning support by criticizing the government for spending money on migrants rather than programs for Danes.\nTwo concerns often appear in this argument — that heterogeneity erodes welfare spending and that recognizing ethnic groups by creating policies to promote multiculturalism makes it increasingly difficult to uphold redistributive policies.\nPolitical philosopher Will Kymlicka and political scientist Keith Banting, however, find no relationship between immigration and social spending. Additionally, ethnic and racial heterogeneity, even when supported by government policies, does not translate to decreased public support for generous social spending. The adoption of multicultural policies such as exemptions from dress codes, affirmative action, and language rights for national minorities do not weaken social spending or solidarity. They conclude, “we have found no support for the claim that there is an inherent or systematic trade-off between policies of ethnocultural recognition and economic redistribution.” Their work proves that ethnic and cultural homogeneity was never the secret to Nordic success.\nInstead, working-class movements built political coalitions that institutionalized a system where citizens view generous social policies as a means to solidarity and economic efficiency. Social-democratic welfare states, unlike many other welfare states, decommodify social rights not only for the very poor, but for all citizens. In this model, “All benefit; all are dependent; and all will presumably feel obliged to pay.”\nNordic workers created their impressive system by uniting disparate groups of workers trying to improve their lives. Class struggle — not cultural values — helped build the model of solidarity and universalism that still largely defines those welfare states today.\nThere is no reason to believe that a similar dynamic could not occur in a nation with the size and diversity of the United States.", "url": "https://www.jacobinmag.com/2017/01/denmark-nordic-welfare-universal-social-democracy-workers-solidarity-race"}