{"authors": ["Elizabeth S. Anderson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Joseph M. Schwartz", "Sean Monahan", "Alex Gourevitch", "Robin Blackburn", "An Interview With"], "date_download": "2020-05-04 19:51:08", "date_modify": "2020-05-04 19:51:08", "date_publish": "2017-06-28 00:00:00", "description": null, "filename": "2017_06_private-government-interview-elizabeth-anderson_1588621868.html", "image_url": "https://images.jacobinmag.com/2017/06/28175813/26117542931_57a2757a6d_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_06_private-government-interview-elizabeth-anderson_1588621868.html", "title": "Where Despots Rule", "title_page": "Where Despots Rule", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "EA\nFirst, let’s be clear that there is no contradiction between entering a relationship by means of a contractual agreement and the form of that contract being one that establishes a relation of domination and subordination between the parties.\nFor centuries, marriage contracts worked like that. The man and the woman signed the marriage contract by mutual consent, but the contract specified that the man would have near-total authority over his wife. Until the late nineteenth century, upon marriage the woman lost her rights to own property and sign contracts in her own name, to work outside the home without her husband’s permission, even to leave her husband’s home without his permission. Until the late twentieth century, he was legally entitled to rape her.\nThe law of marriage, defined by the state, set these as the default terms of the marriage contract, and set up the husband as the dictator over his wife. It was possible for the two parties to sign a prenuptial agreement that altered these default terms. But such agreements were rare, because the husband hardly ever had an interest in reducing his power over his wife. When the state has dealt men all the cards, why would they agree to give any of them to their wives?\nThe case of the employer-employee relation is similar. The state has determined the default terms of the employment relation through employment law. These establish a regime of “employment at will“: the employer can fire the employee for any or no reason, with very few exceptions, mostly having to do with discrimination. This grants bosses almost complete authority over workers, not only on the job but off duty as well.\nSince the state has already put its thumbs very heavily on the scales in favor of employers, it is absurd to suppose that the employment contract is a product of negotiation between equals. Very few employees get a chance to negotiate at all.\nWhile it is technically possible for the worker to negotiate better terms, in practice employers reject negotiation over the scope of employer authority out of hand, except for employees at the very top of the worker hierarchy and those represented by labor unions. Since they, like nineteenth-century husbands, have been dealt all the authority cards by default, why would they negotiate to give any of them to their employees?", "url": "https://www.jacobinmag.com/2017/06/private-government-interview-elizabeth-anderson"}