{"authors": ["Mary Cloud Taylor Daily Inter Lake"], "date_download": "2020-05-04 20:19:06", "date_modify": "2020-05-04 20:19:06", "date_publish": "2017-04-29 05:00:01", "description": "A Columbia Falls man admitted on April 20 to allegations that he assaulted a woman with a club. Randy Gary Young, 51, pleaded guilty to the amended charge of felony criminal endangerment in...", "filename": "_c4f98da6975b4ae8bb7fa4286bd57edf_1588623546.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c4f98da6975b4ae8bb7fa4286bd57edf_1588623546.html", "title": "Man admits to assaulting a woman with club", "title_page": "Man admits to assaulting a woman with club", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Columbia Falls man admitted on April 20 to allegations that he assaulted a woman with a club.\nRandy Gary Young, 51, pleaded guilty to the amended charge of felony criminal endangerment in Flathead District Court in accordance with a plea deal with the state. Young was originally charged with assault with a weapon, his second offense of partner/family assault and criminal destruction or tampering with a communication device.\nAccording to court documents, Columbia Falls Police officers responded to reports of a physical disturbance in December 2016.\nUpon arrival, officers reported finding the alleged victim had fled to the reporting person’s residence to use a phone to call 911 after her alleged attacker, identified as Young, took her cellphone to prevent law enforcement from being notified.\nThe alleged victim told officers Young had attacked her after he had gotten drunk and angry with her. She stated he pinned her to the bed and began repeatedly hitting her.\nAccording to her statement, the woman was able to retrieve a club and strike Young in an attempt to get away. Young then allegedly grabbed the club and held it next to her face as he held her down, stating he was going to kill her.\nJudge Robert Allison sentenced Young to three years in Montana State Prison and ordered him to pay restitution to his victim in the amount of $2,600.\nReporter Mary Cloud Taylor can be reached at 758-4459 or mtaylor@dailyinterlake.com.", "url": "https://apnews.com/c4f98da6975b4ae8bb7fa4286bd57edf"}