{"authors": ["Tom Eggers"], "date_download": "2020-05-04 20:08:02", "date_modify": "2020-05-04 20:08:02", "date_publish": "2017-02-23 17:00:00", "description": "The Indians can write the final chapter of their storybook wrestling season this weekend in Portland. With a school-record 27 wrestlers competing in the Class 6A tournament, it's a foregone...", "filename": "_efb939a226944159911f2da7cb4065c2_1588622882.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_efb939a226944159911f2da7cb4065c2_1588622882.html", "title": "Roseburg favored to win fourth consecutive 6A wrestling title", "title_page": "Roseburg favored to win fourth consecutive 6A wrestling title", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Indians can write the final chapter of their storybook wrestling season this weekend in Portland.\nWith a school-record 27 wrestlers competing in the Class 6A tournament, it’s a foregone conclusion No. 1-ranked Roseburg will come away with its fourth consecutive team title and ninth championship in 11 seasons Saturday night at Veterans Memorial Coliseum.\n“Our ultimate goal is to do our best and perform well,” said Roseburg coach Steve Lander. “We feel great, the boys have been wrestling really well in the last month. I like our chances if we show up and wrestle like we have been.”\nLander said the OSAA (Oregon School Activities Association) told him they don’t remember any school taking that many kids to the state tournament.\nSprague of Salem advanced 18 wrestlers to the tournament.\nThe Indians qualified 14 seniors, five juniors, two sophomores and six freshmen for the tourney, which begins at 8:30 a.m. Friday with first-round matches. The championship finals are scheduled to start at 6:30 p.m. Saturday.\n“We’re excited for them. I’m happy they’re being rewarded for all the hard work they’ve done, especially the kids who haven’t gone (to state) before,” Lander said. “We want everybody to win a match.”\nRoseburg received six No. 1 seeds: Junior Hunter Sparks (41-5) at 113 pounds, senior Bennett Mesa (42-6) at 132, senior Layne Van Anrooy (44-0) at 160, senior Austin Harris (42-5) at 182, senior Cameron Campbell (29-11) at 195 and senior Haydn Maley (41-3) at 220.\nVan Anrooy (a Michigan signee) and Maley (Stanford) are each looking to become Roseburg’s first four-time state wrestling champions, while Mesa is shooting for his third crown. Harris is a three-time state placer.\n“There’s been 30 four-time (wrestling) champs in the history of Oregon, and I don’t think one school had two in the same season,” Lander said. “Those boys (Maley and Van Anrooy) are just amazing. Haydn did an outstanding job as a freshman (at 170) against upperclassmen, and for him to win it last year (at 195) with an injury for most of the season is an amazing story in itself.\n“Layne has just been a monster all four years. That’s an incredible tenacity he wrestles with and he’s amazing in every facet of wrestling. I think he’s the best to ever wrestle at Roseburg.”\nJunior Garrett Russell is a No. 2 seed at 152. The other seeds are freshman Tristin David (No. 3 at 106), senior Parker Adair (No. 3 at 285), sophomore Austin David (No. 4 at 138), junior Brandon Jeffers (No. 7 at 170) and senior Matthew McDowell (No. 8 at 170).\nJeffers was a state runner-up last year as a sophomore. McDowell finished fourth.\nThe rest of the Tribe’s state lineup includes freshman Cameron Cross (106), freshman Archer Bergeron (113), junior Thomas Spence (120), senior Noah Stumbo (120), senior Bailey Humbert (126), senior Damien Wells (126), senior Isaiah Hernandez (132), freshman Colin Rietmann (138), senior Shane Sabins (145), sophomore Ethan Stoner (145), senior Keegan Boggs (152), freshman Doran Gillespie (160), junior Terrell Jacks (182), freshman Rourke Martin (195) and senior Max Labahn (220).\nSabins finished fourth at state the past two seasons. Stumbo, Wells, Hernandez, Boggs and Labahn are each competing in their first state tournament.\nLander said last weekend was fun, winning the Special District 6 tournament at home with 552 points and crowning 10 individual champions. But it’s a new week and a new challenge.\n“The first trick is to re-focus after district,” he said. “Enjoy the compliments, then you need to get your attention back on the next one.”", "url": "https://apnews.com/efb939a226944159911f2da7cb4065c2"}