{"authors": ["Guy N. Limbeck"], "date_download": "2020-05-04 20:14:58", "date_modify": "2020-05-04 20:14:58", "date_publish": "2017-11-14 14:57:15", "description": "Rochester's Ricky Ties continues to make strides in hopes of achieving his goal of qualifying for the 2020 Paralympics in Tokyo. The Paralympics are for athletes with disabilities. Ties, who...", "filename": "_d51fd7086b8b4a54b3a95fc7c7e22484_1588623298.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d51fd7086b8b4a54b3a95fc7c7e22484_1588623298.html", "title": "Sports Notebook: Ties takes aim at 2020 Paralympics", "title_page": "Sports Notebook: Ties takes aim at 2020 Paralympics", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Rochester’s Ricky Ties continues to make strides in hopes of achieving his goal of qualifying for the 2020 Paralympics in Tokyo.\nThe Paralympics are for athletes with disabilities. Ties, who is visually impaired, has already excelled on the world stage in para judo this year.\nTies is a 2001 Mayo High grad who wrestled in high school and took up para judo three years ago. He was born with a vision problem and is in the middle of three visual impaired classes in para judo.\n“I have some vision,” Ties said. “Even when I was at Mayo I had it, but it has gotten worse since high school.”\nThe 35-year-old Ties fights at the 220-pound division (100 kilos) in judo. He has placed at three major tournaments this year.\nHis latest national event saw him earn a bronze medal at the Para World Cup in October in the country of Uzbekistan, which is located in Central Asian.\n“That was the biggest tournament of the year,” Ties said. “It’s been a good run.”\nIt certainly has been a banner year for Ties. He won a silver medal at the Para Pan Am Championships in Brazil at the end of August. He then captured the gold in September in Kazakhstan, which shares a border with Russia.\nTies spends about five months of the year training at the Paralympics training center in Colorado Springs, Colo. He often takes on fighters who are not visually impaired to help sharpen his skills. Despite his busy schedule, he is also an assistant coach for the Rochester Community and Technical College wrestling team. Ties also wrestled at RCTC when he was in college.\nHe will have to take a break from his coaching duties as he is embarking on a two-week journey to Tokyo to compete in the Japan Classic. That event begins on Nov. 27 and is also the site of the 2020 Paralympics.\n“My goal is to be at the 2020 Paralympics in Tokyo,” he said.\nThere are 10 weight classes in para judo. Ties, who competes in the second-highest weight division, would have to be No. 1 in his weight class to earn a Paralympics berth as the U.S. Qualifying is not based on a single tournament, but will be decided on a total point system in five tournaments over an 18-month span beginning next September.\n“You have to be consistent and hopefully stay healthy,” Ties said. “A lot can happen. It’s tough to keep your body ready.”\nTies said his age is a bit on the high end of the high-level fighters in para judo. And with the 2020 Paralympics nearly three years ago, he will be 38 by then.\nHe hones his skills by training not just at Colorado Springs and Rochester, but also in Florida and California. He also does traveling for fundraisers. And then of course there are tournaments like the upcoming one in Japan, which will feature fighters from up to 25 different countries.\n“It’s a good tournament, but only for the training,” Ties said.\nFollowing the event in Japan, he has a break from tournaments until February when he has a tourney in Germany.\n“I feel really fortunate to be able to travel the world and training with some great athletes,” Ties said.", "url": "https://apnews.com/d51fd7086b8b4a54b3a95fc7c7e22484"}