{"authors": ["Freddie Deboer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:41", "date_modify": "2020-05-04 19:54:41", "date_publish": "2017-05-22 00:00:00", "description": null, "filename": "2017_05_yale-university-connecticut-state-budget-cuts_1588622081.html", "image_url": "https://images.jacobinmag.com/2017/05/22163037/6015355392_9271c5a193_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_05_yale-university-connecticut-state-budget-cuts_1588622081.html", "title": "Inequality University", "title_page": "Inequality University", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Today, Yale University’s 316th commencement is taking place. Beaming young people and their proud parents have flocked to the immaculate New Haven campus, eager to start their climb further up the ladder of American success. They know, as they surely knew the day they arrived, that their passage through such an august institution prepares them for a life of financial security and high social standing. They know, in other words, that as much as any young people, they are positioned to advance to the rarefied world of elite America.\nMeanwhile, elsewhere in Connecticut, twelve community colleges and four public universities — including one found in the very same city — are starved to death by austerity and neoliberalism, as the Democratic governor and a Democratic state legislature in a rich blue state enact brutal cuts to education, social services, and mental health care, while fighting to cut taxes on corporations. The cuts to the Connecticut State University system are particularly devastating. They risk killing majors, shuttering departments, and destroying tenure. Programs that help shepherd a student body that comes disproportionately from non-traditional backgrounds, and thus needs help the most, are under threat. Classes may be cut from course schedules, making it even harder for working students and students who are parents to fit school into their schedules. In every way, a university system that already struggles to serve its students and its state thanks to resource constraints will be hurt even more.\nThese cuts are personal, for me, as I am a graduate of Central Connecticut State University in the CSU system. I will risk self-aggrandizement in saying that I am an example of the kind of success story that is routinely produced by the CSU system and systems like it. In my early twenties I was lost — orphaned, broke, alcoholic, struggling from then-undiagnosed mental illness, and completely without direction or a sense of purpose. But I took classes at the local community college for a year, then transferred to Central, where I met warm, engaging, committed educators who shepherded me through my education and showed me that I had skills and knowledge that had value — that my life had value. Today, I have a PhD, live in New York City, work at a wonderful public college myself, and have been published by some of the most prominent newspapers and magazines in the world. I owe all of that, without exception, to my time in the CSU system. It was there that I put my life back together, thanks to the dedication of the professionals who worked there and the relatively low tuition costs that enabled me to attend. I say with no exaggeration: the Connecticut State University system saved my life. And now, for shortfalls of less than $100 million a year, that system risks being permanently crippled.\nTo make all of this worse, down I-91 from my old university, Yale sits on a mountain of money, and yet receives more and more from public funds. The degree to which our government subsidizes the immensely wealthy Ivy League schools defies belief. A report from Open the Books, an organization that works for transparency in government spending, estimates that the federal and state governments spent over $40 billion on the Ivy League schools in tax exemptions, contracts, grants, and direct gifts from 2010 to 2015. The eight Ivy League universities — small, elite institutions from one region of the country that serve a tiny fraction of our college students and who could scarcely need government support less — receive more money annually from the federal government, on average, than sixteen states. Four in ten students from the top 0.1 percent of families by income attend the Ivy League or similarly elite institutions; in 2012, 70 percent of Yale’s incoming freshmen came from families making more than $120,000; the median family income for Harvard students is triple the national average. The overwhelming majority of these students go on to lives of economic security, and many to the upper echelons of our economy.\nYet we continue to pour in government money to these rich institutions, and their wealthy alumni pour in hundreds of millions of dollars to their endowments untaxed, often invoking the spirit of giving and the need for equal opportunity while they do so. Meanwhile, we know empirically that systems like the CSU system, or the City University of New York system (where I now work), or the California State University system — America’s Great Working Class Colleges — do a far better job of creating social mobility than their elite counterparts. Yet each of these systems struggles under brutal cuts to their funding even though our country has never been richer.\nWhat political philosophy, exactly, could possibly justify this condition? What ideology would conclude that this is a good use of resources, either public or philanthropic?\nAnd yet the condition endures, even accelerates, year after year. No one seems to ask why those institutions who are objectively fabulously wealthy should receive such outlandish public subsidy, nor does anyone provide an answer as to why so many of our wealthiest continue to cut large checks for these institutions while our working-class colleges, who need the money so desperately, starve. I am absolutely committed to the idea that higher education should be funded with public moneys, but I am also perplexed at the tendency of charitable donations to go where they are needed least of all. Where is Bill Gates to subsidize our working-class colleges? Where is Mark Zuckerberg? Why does the philanthropic impulse, when it comes to higher education, always result in the rich getting richer? Connecticut is home to a small army of hedge fund managers and other incredibly wealthy types. I would love it if we could take their money by force for the good of all of society. But barring that, why don’t they use Connecticut’s starving public system for tax avoidance, rather than elite universities that are already filthy rich? Unless the entire point of such gifts is not to create equality of opportunity but to destroy it, to ensure that only those who start out at the top get to end up there. Our elite universities do many good things, but there is no question that they perpetuate and deepen inequality. That is in fact their most basic function: the replication of the ruling class.\nI have no doubt that Yale’s class of 2017 is full of smart, talented, and passionate young people. I wish them the best. I also have no doubt that those among them who may not be talented or hardworking will be wholly inoculated from that condition thanks to the accidents of birth and privilege that helped them reach their rarefied station in the first place. As a socialist, I am not interested in making them more susceptible to material hardship and the vagaries of chance, but rather of giving everyone that same level of protection — and that means raiding the coffers of their school, their parents, and their future employers for the betterment of all. I also don’t doubt that, on balance, graduates of the Connecticut State system will succeed as well. College graduates writ large enjoy a substantial premium in income and unemployment rates over those without degrees, after all. But how hard will they have to struggle, as their instructors are stretched thinner and thinner by these brutal cuts? How many of them will sink deeper into debt as they are forced to take additional semesters of classes to complete their degrees? How many of them will drop out, thanks to these cuts, and suffer under the burden of student loan debt with no degree to help them secure a better life? How many people who could have been saved, as I was saved, now won’t be because of these cuts?\nToday’s Yale commencement ceremony, of course, will be stocked with liberals, decent progressive folk who will tell you they believe in equality and social justice. The parents will mostly be liberal Democrats. The student ranks will be filled, no doubt, by genuine radicals, and the faculty with Marxists and socialists. They do good deeds at these places, such as how Yale’s community recently forced the school to change the name of Calhoun College, thanks to John C. Calhoun’s history as a slave owner. I celebrate the activist zeal of all involved in such actions. Yet what Yale’s community can’t do — and perhaps wouldn’t, if it could — is to dismantle its place in the engine of American inequality. For all of the decent people involved in that institution, there is no chance that it will ever voluntarily abandon its role as an incubator of the ruling class. To do so would be unthinkable. That’s the reality of higher education: ostensible leftists preside over the ever-accelerating accumulation of power, money, and privilege. A better way is possible, but it cannot be achieved from within campus.\nUntil we reach that better world, we’ll be left with these ugly divides. In a sea of political ugliness it’s hard for me to imagine a starker statement of America’s grand failures than this, a starving public university system that serves the poor and the brown and the needy, while next door a school for the 1 percent sits on $25 billion dollars, untaxed. CSU students, like Yale students, will walk on campus lawns with caps and gowns, eager to begin their new lives. Like Yale students, CSU students will seek a better life. But how many of them will be stuck here in this other America, inequality America, austerity America, while those who’ve already been given so much are given even more?", "url": "https://www.jacobinmag.com/2017/05/yale-university-connecticut-state-budget-cuts"}