{"authors": ["Dennis Fujimoto - The Garden Island"], "date_download": "2020-05-04 20:07:52", "date_modify": "2020-05-04 20:07:52", "date_publish": "2017-06-28 11:15:00", "description": "Congratulations to Mayor Bernard Carvalho Jr., Bev Brody, and the countless number of people involved in hosting another successful Mayor-a-thon Saturday! Chuck Brady said the Mark’s Place and...", "filename": "_f63d8787234b40ec87024fe34ba07182_1588622872.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f63d8787234b40ec87024fe34ba07182_1588622872.html", "title": "Happy Camper for Wednesday, June 28, 2017", "title_page": "Happy Camper for Wednesday, June 28, 2017", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Congratulations to Mayor Bernard Carvalho Jr., Bev Brody, and the countless number of people involved in hosting another successful Mayor-a-thon Saturday! Chuck Brady said the Mark’s Place and Contemporary Flavors Catering healthy breakfast (no wonder Kenny Ishii of Ono Family Restaurant was there) was one of the best he’s had, and Tommy Noyes and Dr. Randy Blake (they said the Kawaihau spur should be done very shortly, courtesy of the “red caps”) did a wonderful job keeping all those bikes in shape for Ke Ala Hele Makalae.\nPat Finberg was one of the participants and said the 16th annual Heiva I Kauai 2017 will take place Aug. 5 and 6 at Kapaa Beach Park (which means applications for this year’s event solo dancers, groups and arts and craft vendors are being accepted until July 21). Visit heiwaikauai.com for applications.\nAmy Chun and Laurie Ho were able to get a load of longan (Amy said once people tasted it, they were grabbing it by the handfuls…Wilma Chandler made sure the Samuel Mahelona Memorial Hospital residents had their share, too!) and still made it to the Kauai Community Market where Sandi Kato-Klutke was being generous with the Moloaa Bay Coffee and Chocolate ’ohana. And kudos to Tricia Yamashita on being named the coordinator for this year’s Kauai County Farm Bureau Fair!", "url": "https://apnews.com/f63d8787234b40ec87024fe34ba07182"}