{"authors": ["Joe Allen", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman"], "date_download": "2020-05-04 20:00:05", "date_modify": "2020-05-04 20:00:05", "date_publish": "2017-10-31 00:00:00", "description": null, "filename": "2017_10_ron-carey-teamsters-union-labor-tdu_1588622405.html", "image_url": "https://images.jacobinmag.com/2017/10/31102218/carey.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_10_ron-carey-teamsters-union-labor-tdu_1588622405.html", "title": "The Persecution and Vindication of Ron Carey", "title_page": "The Persecution and Vindication of Ron Carey", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\n“I am convinced that if this Subcommittee had not acted, Ron Carey would still be president of the Teamsters.” — Pete Hoekstra (R-MI), March 2000. The Teamsters, led by the reformer president Ron Carey, won an historic victory for the US labor movement in the summer of 1997 when they defeated United Parcel Service (UPS) in a two-week strike that captivated the country. Carey hailed the agreement that resulted from the strike as an “historic turning point for working people in this country. American workers have shown they can stand up to corporate greed.” Referring to the mindset accompanying the breaking of the 1981 air traffic controllers’ strike, historian Nelson Lichtenstein wrote at the time that the UPS strike broke “the PATCO syndrome, a sixteen-year period in which a strike was synonymous with defeat and demoralization.” For many of us, the strike represented the potential for something even bigger — something like the explosion of the CIO during the Great Depression, when the US labor movement could, once again, launch big fights and win big victories. Yet within weeks of the victorious strike, Congressional Republicans and President Bill Clinton’s Department of Justice launched a wide-ranging political attack on Ron Carey and the Teamsters. Carey was eventually expelled from the Teamsters, and the notable victories against UPS were placed on hold. The optimism of the August strike days was over as quickly as they as they arrived. How did such as reversal of fortunes take place so quickly, and what does it mean for rebuilding unions today?\n“You’re Dead, Carey” Enraged by its defeat in the 1997 strike, UPS made inflicting a heavy blow on Ron Carey and the Teamsters a top priority. According to Carey, as recounted in Deppa Kumar’s Outside the Box, UPS chief negotiator David Murray made this very clear to him: One of the negotiators for UPS said, in the presence of then-Secretary of Labor Alexis Herman, “Okay Carey, we agree on the union’s outstanding issues,” and he proceeded to leave the conference room. As he was leaving, he leaned over the conference table and said to me, “You’re dead, Carey, and you will pay for this, you s.o.b.” I looked at Ms. Herman, and asked, “Did you hear that?” She responded, “I heard nothing.” Their opportunity for revenge presented itself two days after the end of the strike when Barbara Zack Quindel, the Teamster election officer, voided the results of the 1996 election where Carey narrowly but clearly triumphed over James P. Hoffa. Quindel, a liberal labor lawyer based in Milwaukee, had been under enormous pressure all spring and summer to rule on the validity of the 1996 election after three people connected with Carey’s 1996 re-election campaign, including Carey’s campaign manager Jere Nash (a former consultant to the Clinton-Gore campaign), were indicted for campaign fundraising violations. A rerun election was to be held by the end of the year pending federal court approval. In her ruling, according to the New York Times, “Ms. Quindel did not find Mr. Carey to have been personally involved in violations.” Despite Nash’s claims that Carey was aware of his and his coconspirators Martin Davis and Michael Ansara’s activities, Quindel cleared Carey to run for re-election, and it was to be a rematch with Hoffa. What were these fundraising violations? Veteran labor journalist Steve Early explained: He [Martin Davis] devised various ways of leveraging and transforming union expenditures into Carey campaign revenue through “contribution swaps.” His partners in this enterprise — unwitting or otherwise — included institutions and individuals ineligible to donate money to Carey because they were union vendors, employers or relatives of either. The contribution swaps included deals with such longstanding liberal lobbying groups as Citizen Action, major figures in the AFL-CIO like former Mineworkers leader Richard Trumka, and liberal Democratic donors like Barbara Arnold. The Teamster contributions came to around $850,000 to various liberal lobbying groups, in return for nearly $220,000 in illegal contributions to the Carey re-election campaign. Carey denied any knowledge of their illegal activities and proclaimed his innocence. What were the “Gang of Three”— Nash, Davis, and Ansara — up to? As recounted in In These Times, They conspired to finance a costly “air war” on Carey’s behalf that was viewed as a safe political substitute for fighting it out on the ground. Their crowning achievement was a panic mailing of 1.7 million fliers sent out during a one-week period so late in the campaign that many Teamsters didn’t get them until after they’d already voted while others received as many as five different Carey leaflets on the same day. This costly air war had little to no effect on the vote. It was a gigantic waste of time and money. The blatantly illegal nature of these “campaign swaps” breached a wall in the Carey administration that tarnished his personal reputation for honesty and integrity, and allowed his enemies and the longstanding enemies of the Teamster reform movement to pour through.\nOld Guard Emboldened Quindel’s ruling immediately emboldened the Hoffa forces that had been marginalized by the media focus on Ron Carey during the recent UPS strike. Shortly after the ruling, Hoffa appeared on three Sunday news programs, including the right-wing, anti-union “Fox News Sunday,” where he said: Carey should step aside — be removed and disqualified from the race because this is a burgeoning scandal and right now he is an illegitimate person in the position of president. He has not been elected by the members. The election has been thrown out. His term is over. Carey responded to Hoffa on “Meet the Press” where he declared that Hoffa is “a real pro in terms of smear and distortion.” Carey responded to the charges of illegal activities by his campaign aides, “You have people you trust and in every organization you have those that step over the line.” Carey returned the disputed donations and ordered staff to cooperate with federal investigators. The Hoffa forces were not strong enough, however, to oust Carey by themselves. One Hoffa supporter, Danny Moussette of Chicago’s Teamster Local 714, sourly commented, “It seems rather convenient that she [Quindel] did it while Carey is on this wave of popularity.” Many reform activists actually looked forward to the rerun election as an opportunity to “drive a stake into the heart of the old guard.” Carey’s personal popularity was at an all-time high after the UPS strike, emerging as a nationally recognized spokesperson for a revitalized labor movement. Dan Clawson, a professor of labor relations at the University of Massachusetts, told the New York Times, “If this decision had been made two months before the UPS strike, it would have been extremely serious for him. But it’s a different thing after the strike.” Hoffa’s name recognition, with its appeal to a nostalgic era of Teamster power, had been his only personal asset during the 1996 election, but this couldn’t compete with a real live leader of a revitalized union. Carey was expected to easily triumph in the rerun election. The Hoffa forces, however, sought and received crucial help from UPS’s Republican allies in congress to oust Carey. Quindel’s ruling inflamed UPS because she revealed that she postponed her decision until the UPS strike was over; the company was livid and attacked her. In their logic, she chose sides “in a momentous labor-management dispute,” as the company put it in a sharply worded letter to Judge David Edelstein. UPS spokeswoman Gina Ellrich said that the company was not seeking any specific action from the court, “We want to be on the record. We believe the delay contributed to the length of the Teamsters strike.” Quindel responded directly to UPS: UPS seems to misunderstand. The election officer’s duty as a court officer is to run the election process for the benefit of the members. The members of the union can’t have faith in the consent decree if they see it as interfering with their economic livelihood. The letter may have had no legal significance, but it acted as a clarion call to anti-Carey political forces in and outside of the Teamsters. A “Get Carey” network existed since the early days of his administration. Its most recognized public voice was the Wall Street Journal, but also included other media outlets, continuously pumping out lies and distortions. The Independent Review Board (IRB) investigated Carey in the early days of his administration and declared in July 1994: An investigation by the Independent Review Board into a variety of allegations made against General President Ronald Carey of wrongful association with organized crime members and associates, of improper receipt of payments from employers, and other miscellaneous allegations. For reasons detailed below, the evidence uncovered in this investigation does not support recommending a charge based on any allegation against Carey. The IRB’s report declared at least sixteen times, “There is no evidence to support this allegation.” Frustrated to the point of despair, the Get Carey campaign was given a new lease on life because of the real crimes committed by non-Teamsters on Carey’s campaign staff. The IRB also opened its own investigation into Jere Nash’s allegations on August 28, 1997.\nFrom Hero to the Hunted Meanwhile, as his enemies plotted against him, Carey launched his second bid for re-election as Teamster president outside the 43rd Street UPS hub in Manhattan on September 11, 1997. He told the three hundred assembled drivers that UPS had retaliated against Teamsters across the country for frivolous violations of company rules, including not having their shoes shined. “If the retaliation continues, we’ll be back out on the streets.” Later that morning, potentially devastating news arrived that Barbara Zack Quindel had changed her mind, according to the Boston Globe, and was “now reconsidering whether Carey should get another crack at the job.” Carey’s re-election campaign was thrown into disarray. “Since issuing the decision, certain information has been presented to me by a party to the appeal,” Quindel wrote to Kenneth Conboy, a former federal judge who handled the election appeals under the consent decree. This alleged new information included notes written by Carey’s personal scheduler, Coleen Dougher. “The notes were sent to Quindel last week by a lawyer for the Hoffa campaign who contends that a Hoffa supporter received them anonymously.” Just as the opportunity to drive a stake into the heart of the old guard appeared, it vanished. The next two months were one of most stressful times in the lives of Carey and Teamster reformers. It was open season on Carey. “I believe he will be removed or disqualified or indicted,” crowed Richard Leebove, Hoffa’s communications director and a former follower of neofascist cult leader Lyndon LaRouche. On September 19, Nash, Davis, and Ansara pled guilty in federal court. Four days later Barbara Zack Quindel resigned as the federal court’s election officer because of “the appearance of a conflict of interest.” What was the conflict? It came to light that William Hamilton, the Teamsters political director based in Washington, D.C., had arranged for a $5,000 campaign contribution to the New Party, a small liberal and labor supported party in Wisconsin, of which Quindel’s husband was a leader. Judge David Edelstein then assigned Kenneth Conboy, Teamsters election-appeals master and a former federal judge appointed by Ronald Reagan, “for the sole purpose of investigating and deciding the issue of the disqualification of Ronald Carey from the rerun election.” In less than a month the political atmosphere around Ron Carey had been radically transformed, with Carey transformed from the hero to the hunted. Even before the UPS strike the pressure from federal prosecutors made “it very hard to get any real work done,” according to William Hamilton. He resigned in late July 1997, and called the federal investigation into the 1996 Teamster election a “circus.” Hamilton was, for Steve Early, one of the “Beltway insiders preoccupied with Democratic Party deal-making, White House invitations and congressional ‘access.’” Hamilton was revealed later to be the fourth man in the Nash-Davis-Ansara network, and while it is hard to feel any sympathy for Hamilton in retrospect, much of what he said about the suffocating pressure from federal prosecutor Mary Jo White was undoubtedly true. Hamilton described, in his resignation letter, the “turmoil created by the prolonged investigation by the US Attorney in New York, the delay in certification of the union election results and the calculated external distribution of documents held by Federal investigators.” He complained that “documents voluntarily handed over” to federal investigators somehow found their way into “the hands of Hoffa operatives who then spin them to the press.” The later accusations were later confirmed by the Wall Street Journal, which revealed that Richard Leebove had turned to a veteran Chicago Teamsters organizer, Danny Moussette, who had many contacts at [Teamster] headquarters. One of Mr. Moussette’s first calls was to Gregory C. Mullenholz Sr., a midlevel administrator whose father had worked for the union under Mr. Hoffa’s father. There were over three hundred full-time employees in Washington, many of them employed for years under the old guard. “Greg didn’t take much persuasion,” Moussette told the Journal. Mullenholz was an important Hoffa mole because he was in charge of issuing checks for the Teamsters’ political-action committee. “Carey needed to clean house in D.C. but he didn’t because again not enough qualified help,” recalled Dave Eckstein, the former field-services director. The Wall Street Journal reported: Mr. Moussette says he soon was receiving notes and copies of documents from Mr. Mullenholz and others he won’t name, usually in unmarked envelopes. Mr. Moussette says his sources also sent him “a bunch of computer disks” containing, among other things, copies of memos from William W. Hamilton Jr., head of the Teamsters’ government-affairs department. He later also received personal notes of Mr. Carey’s scheduling secretary. Everything was passed on to Mr. Leebove. Leebove then passed all of this material on to sympathetic journalists and Republican congressional staffers. Many of these very same moles would testify before Congress as hostile witnesses against the Carey administration. The circus moved from New York grand jury rooms to congressional hearings in Washington when Michigan Republican Rep. Pete Hoekstra Michigan announced that his oversight subcommittee would conduct hearings into the Teamsters. Hoekstra was not part of the decades-old Republican Party-Teamster political alliance. He hailed from Holland, Michigan, part of Michigan’s second congressional district, a solidly Republican area. He came to Congress within a year of Carey and his reformers coming into office. Hoekstra cultivated connections to freight companies including UPS, and the Detroit old-guard Teamsters led by Larry Brennan, James P. Hoffa’s mentor, and others who had an interest in stymieing Teamster reform.\nHoekstra’s Witch Hunt In January 1994, soon after the Republican landslide election, the new Speaker of the House Newt Gingrich appointed Hoekstra the chairman of the House Committee on Education and Workforce, with its powerful subcommittee on Oversight and Investigations. His new chairmanship gave him the power and position to launch various legislative initiatives against the labor movement and Ron Carey’s Teamsters. Hoekstra, for example, wanted to alter the basic labor laws that governed working conditions in the country. Tom Leedham, Carey’s warehouse director, remembered Hoekstra as “a congressman who tried to eliminate the forty-hour workweek, and gut overtime and job safety laws.” The Teamsters responded and launched a corporate campaign directed at the car-haul industry. Hoekstra appeared on “The Washington Review,” a TV news series sponsored by the American Trucking Association. He threatened, “We’ll have a whole series of hearings to get to the bottom of this Corporate Campaign issue.” Hoekstra appeared soon, according to Carey, at a “news conference with the American Trucking Association, [and] with the US Chamber of Commerce to outlaw strategies [corporate campaigns] by the Teamsters.” Not to let the smallest issue slip by that could favor unions, “Representative Peter Hoekstra has proposed,” according to the New York Times, “a bill that would protect companies [retail department stores and malls] who grant access to charities from union claims of discrimination.” With such a track record, it was not difficult to see Hoekstra’s political agenda when he scheduled hearings into the Teamsters 1996 election after Quindel overturned Carey’s victory. This was the political opportunity of a lifetime, and he seized it. He promised the hearings would show that the Teamsters under Carey had been taken over by a “pattern of coercion that exists from top to bottom.” The hearings did far greater damage to his public image than he could have possibly imagined. Hoekstra’s hearings created a political atmosphere that helped lead to Carey being disqualified from the rerun election. Pete Hoekstra opened the first day of hearings on October 14, 1997. Dane Passo, a member of Teamsters Local 705 in Chicago, led a parade of witnesses who testified under oath to have been victims of political persecution, discrimination, and violence reminiscent of the mafia-controlled Teamsters. Carey appeared, according to the testimony, to be in the mold of past general presidents and didn’t deserve the reputation of a reformer; reform-minded Teamsters came off as instituting a reign of violence and terror in cities like Chicago. Passo was the leading figure of the anti-Carey forces in Chicago’s Local 705, previously serving as a steward, organizer, and business agent under Dan Ligurotis, the mob-connected former secretary-treasurer of Local 705. Ligurotis gained notoriety for shooting his son to death in the basement of Teamster City, the office complex where many Teamster local union offices and the Chicago-area Joint Council 25 are located. As a loyal Ligurotis supporter, Passo supported his bid for international union office in 1991. Ligurotis, however, was removed from office on corruption charges, and a trusteeship was imposed on Local 705 in 1993. Carey appointed his former campaign manager Eddie Burke as trustee along with longtime Local 705 reformers Jerry Zero and John McCormick as assistant trustees in an attempt to clean up the notoriously corrupt and violent local union. Passo declared war on the trusteeship, according to Bob Bruno, a professor of labor and industrial relations at the University of Illinois, and author of Reforming the Chicago Teamsters: The Story of Local 705, who later interviewed him extensively for his book. He told Bruno that from the moment Burke arrived at Teamster City, he was consumed with one goal: “to destroy these guys, no matter what it takes.” He meant it. At the first general membership meeting called to explain the trusteeship, Passo went into action. “We threw pop cans, coffee, fruit and stuff at Burke and raised so much hell that he had to adjourn the meeting,” he boasted to Bruno. Referring to the Teamsters for a Democratic Union (TDU) reformers who supported Carey, he said, “I spoke out big time against the trusteeship and accused Zero and the rest of being TDU pieces of shit.” Not satisfied with his disruptive activities alone, Passo organized a slate of Hoffa supporters to challenge Zero and McCormick for office in the first local elections to be held after the trusteeship in 1995. Passo organized the Real Teamster Slate (RTS) made up of formers staffers and stewards, like him, from the Ligurotis era, along with some new faces. Zero and many others in the local union thought Passo would likely win the election. However, Passo couldn’t resist the disruptive actions at union meetings that made him a name throughout the local union, and he found himself suspended from membership during a crucial moment in the campaign. His suspension was upheld by Ron Carey. The RTS lost the election, according to Zero, because of Passo’s “knucklehead behavior.” Soon afterward, Passo supporters pulled off a surprise victory in the Local 705 delegate race for the upcoming 1996 convention when they won all eighteen delegates. It was during the election campaign for convention delegates that Passo provoked a physical confrontation with Jerry Zero that later resulted in Zero’s suspension from union office for one year. This triumph seriously weakened the Carey forces at the 1996 convention, where the Hoffa forces repeatedly disrupted the convention. The following year while testifying before the Hoekstra committee, the “United Slate” led by Passo ran a vigorous, well-funded campaign for local union office. After the votes were tallied in December, Passo came within 250 votes of defeating Zero for secretary-treasurer. This is hardly a picture of a besieged, terrorized opposition; quite the opposite. James P. Hoffa, after he was elected general president of the Teamsters, rewarded Passo for his years of service by appointing him “special assistant” to the general president that gave him virtually free reign over the union. Within a few years, Dane Passo and former Hoffa running mate Bill Hogan were both barred for life from the union by the IRB, for their role in a scheme to drive down wages and benefits for Las Vegas Teamsters to benefit a company that one of Hogan’s family members had a stake in. For many hours Passo along with Washington-based Teamster organizers Barbara Dusina, Vince Hickman, Bob Kreuzer, and Texas Teamster Wesley Coleman, regaled Hoekstra and other committee members with stories of being “pressured to give more than $1,000 each last year to the Carey campaign or face possible loss of their jobs.” Wesley Colemen, a former TDU member, claimed “he saw a half-dozen staff organizers doing campaign work for Mr. Carey during their regular work hours.” On top of this, the committee then heard four and a half hours of testimony from Bob Mullenholz, a former supervisor in the Teamsters political-action committee in Washington. Disappointingly for Hoekstra, Mullenholz, couldn’t provide “any solid proof” that Carey knew or had cooperated the Nash-Davis-Ansara-Hamilton illegal fundraising schemes. However, Mullenholz revealed, in what should have been the bombshell revelation of the day, that he had been secretly sending internal Teamster documents to Robert Baptiste, a prominent lawyer for the Teamsters and, at the time, for James P. Hoffa. The media chose not to look deeper into the story until the Wall Street Journal ran their article about Hoffa’s “moles” in late December.\n“A Circus for Anti-Labor Republicans” Nancy Coleman, a Teamsters spokesperson, called the Hoekstra hearings “a circus for anti-labor Republicans.” Ken Paff, TDU national organizer, called on the House Committee on Standards of Official Conduct to investigate possible misconduct by Hoekstra. “It appears that Congressman Hoekstra is using his office, and taxpayer money, to further the campaign of James Hoffa Junior.” Paff further charged, “These so-called hearings have no legitimate purpose, and are designed to showcase one candidate in the Teamster election, in hopes of gaining millions of Teamster dollars for the Republicans.” The accusations leveled in the hearings may have been baseless, but they provided good copy for the press. The headline “Teamsters’ reform image tested” with a large photo of Dane Passo and other Carey accusers was prominently featured in the Chicago Tribune, while the New York Times ran “Teamsters’ Union Staff Members Cite Pressure For Donations.” The Hoekstra hearings also provided the Wall Street Journal the opportunity for a little red-baiting: One watches the proceedings and comes away with the impression of a US labor movement and its leadership simply drifting leftward and away from the mainstream of the country’s life, even as its own members settle in the center. The New Party is the brainchild of Joel Rogers, a University of Wisconsin professor who now serves as national party chair. A believer that “property rights are unequally distributed under capitalism,” he has joined with unions to promote super-minimum wage initiatives in various cities. The New Party’s national organizer was a longtime activist in the radical Teamsters for a Democratic Union, and many party members are active Teamster supporters of Mr. Carey. Speaking before the National Press Club on October 20, 1997, while he waited for Conboy’s decision on his candidacy, Ron Carey pointed to the financial backing of members of Hoekstra’s oversight subcommittee: UPS gave campaign contributions to House Speaker Newt Gingrich, Representative Pete Hoekstra of Michigan, and, at least four other Republican on the Hoekstra House subcommittee. Republican members of that subcommittee received more than a quarter of a million dollars in campaign contributions from corporate special interests. Their contributors included UPS, FedEx, the American Trucking Association, Northwest Airlines, Americans for Free International Trade.\n“Gunning For Me” Meanwhile UPS kept up its campaign against Carey inside the hubs. Soon after striking Teamsters returned to work, UPS managers across the country posted anti-Carey material on bulletin boards, claiming somehow that it wasn’t interference in the election. Don Black, a UPS spokesperson, sanctimoniously declared, “We don’t take sides in union elections, never have, never will.” Such a statement was hard to take seriously. Judge Kenneth Conboy directed UPS in early November to stop meddling in upcoming Teamster elections. “The largest Teamster employer was caught campaigning for Hoffa,” according to TDU national organizer Ken Paff. “They admitted they distributed it nationwide with a directive . . . to share it with all employees, to 200,000 Teamsters.” UPS intervention into the Teamsters election paled in comparison to Conboy’s. He completed his investigation into Ron Carey’s candidacy and announced on November 17, 1997 the feared ruling disqualifiing Carey from being a candidate in the upcoming rerun election. Carey appeared before reporters in Washington and declared his innocence, denouncing what he called “an unbelievable wrong decision. . . . I have done nothing wrong, and I will fight this decision until it is overturned.” Conboy discovered what he called “significant electoral misconduct.” Carey had to be disqualified: “Failure to disqualify in this case would constitute a damaging precedent that would undermine the deterrent effect of the election rules.” The late radical journalist Alexander Cockburn declared that, “Labor’s foes everywhere surely see this as a happy hour.” Cockburn went on to challenge Conboy’s reasoning: The prime imperative of election rules is that the will of the electorate prevails, and Conboy lost track of this central point. Who can doubt that, in the wake of the successful strike against United Parcel Service, Carey would have swept to victory over Hoffa? Just who is being protected by the rules invoked by Conboy? Teamster members? Or are they protecting the trucking companies from Teamster power? The New York Times editorial board supported Conboy’s ruling, “A Federal election monitor made the right decision yesterday in disqualifying the teamsters’ president, Ron Carey, from a court-ordered rerun of the union’s 1996 elections.” The right decision? For whom? One week after Conboy’s ruling, Carey took a leave of absence from the presidency of the Teamsters and his New York Local 804, and appealed the decision in the federal courts. Ron Carey gave his last public speech at the 1997 TDU Convention in Cleveland, the same venue he used to launch his first national campaign for the Teamster presidency in 1989. When Carey walked into the ballroom filled with over six hundred people, the room exploded in cheers chanting “Carey, Carey,” and then “fight, fight.” He was given a standing ovation and was visibly moved by the reception, coming after months of abuse and character assassination. Carey tried his best to put a brave face on a very difficult situation. “There will be a strong reform slate in the next election,” he told the crowd. “Whether it’s me at the top of it or if it’s someone else, the reform slate will win.” He spoke about Conboy’s decision to disqualify him. “I want to look around this room and look in everyone’s eyes and to tell you that that decision was dead wrong,” he said. But six weeks later, Carey lost his appeal on his disqualification. Meanwhile the IRB’s investigation of Carey ground on with no end in sight. Six months later, taking advantage of Carey’s downfall, UPS declared on July 16, 1998 “null and void” the jobs provision of the first year of the new contract to create 2,000 full-time jobs — despite making nearly $1 billion in profits. One week later the IRB announced another dreaded ruling: Carey was banned for life from the Teamsters. It was one of the lowest points for the US labor movement in modern history. But not everyone saw it that way. One year following the swearing in of James P. Hoffa as Teamster general president, Rep. Hoekstra held hearings to review the past several years of work by his subcommittee and boasted, “I am convinced that if this subcommittee had not acted, Ron Carey would still be president of the Teamsters.” He said this with Hoffa and Teamster General Counsel Patrick J. Szymanski in attendance. Three years later, the federal government, feeling that they had not humiliated Carey enough, charged him with perjury related to criminal activities of his former campaign manager Jere Nash and his coconspirators. But to the shock of prosecutors and Hoffa supporters alike, the federal jury found Carey innocent of all charges in early October 2001. Yet despite being vindicated by a federal court, he remained barred from the Teamsters. Taking to the pages of Verdict magazine in January 2003, Ron Carey tried to make sense of what happened to him and the Teamsters: Five years ago, the labor movement was resurgent. The success of the UPS strike made it seem as though the tide had turned, that workers were no longer on the defensive, that labor was no longer dominated by business unionism. What happened in the intervening years? First, I am sad to say, that the corporate establishment and power brokers were out ‘gunning for me,’ and the failure of my campaign manager and consultants gave them the opening they needed. Our reform administration played an important part in the revitalization of the labor movement, and my removal from office no doubt weakened that resurgence. For UPS, the election of James P. Hoffa to general presidency of the Teamsters in 1998 and his three successive terms in office proved to be a boon far beyond their wildest expectations. John Schultz, a reporter for Traffic World, one of the freight industry’s leading publications, wrote, in a notorious May 2000 article “In Love with Hoffa”: United Parcel Service, the nation’s largest transportation company, feels that it has taken part in one of the great trades of all time in labor: James P. “Jimmy” Hoffa for Ron Carey as president of the Teamsters union.", "url": "https://www.jacobinmag.com/2017/10/ron-carey-teamsters-union-labor-tdu"}