{"authors": ["Isu Sports Information"], "date_download": "2020-05-04 20:12:22", "date_modify": "2020-05-04 20:12:22", "date_publish": "2017-10-09 22:34:00", "description": "The Idaho State men's tennis team concluded its second fall tournament of the season this weekend at the Dar Walters Boise State Fall Classic at Boise State. Peter Trhac, Francis Filipovich...", "filename": "_c12633dba7444b6192a0124e7ffffd0a_1588623142.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c12633dba7444b6192a0124e7ffffd0a_1588623142.html", "title": "Hornby, Felix, Trhac advance to Boise tournament quarterfinals", "title_page": "ISU men's tennis: Hornby, Felix, Trhac advance to Boise tournament quarterfinals", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Idaho State men’s tennis team concluded its second fall tournament of the season this weekend at the Dar Walters Boise State Fall Classic at Boise State.\nPeter Trhac, Francis Filipovich and Keegan Sullivan all picked up singles wins for the Bengals. Thrac defeated Eastern Washington’s victor Pereira 6-3, 6-2 in the round of 128 but fell to Gonzaga’s Samuel Feit 3-6, 7-5, 7-6(10-4) in the round of 64. Filipovich defeated EWU’s Martin Bats 6-3, 7-5 in the round of 128 before falling to GU’s Ruadhan O’Sullivan 6-4, 6-1 in the round of 64. After a bye in the round og 128, Sullivan bested Gonzaga’s Simon Homedes 6-2, 6-3 in the round of 64 but fell to eventual runner-up Victor Casadevall of Montana 6-2, 6-1 in the round of 32.\nAdam Hornby advanced to the quarterfinals of the back draw of the men’s singles after falling in the round of 64 to Portland’s Drew Davison 7-5, 6-2. Hornby bested Portland State’s Sam Larson 6-4, 6-1 and defeated Ben Kirsh 6-3, 6-4 before falling to Arizona Christian’s Bradley Gleason 6-2, 6-3 in the consolation quarterfinal match.\nIn doubles play, David Felix teamed up with Trhac to advance to the quarterfinal match. The pair defeated Eastern Washington’s Victor Pereira and Flavian Raveau 8-3 in the round of 64 followed by an 8-5 win over Portland’s Jamie Fisher and Tom Hann in the round of 32. They then bested Montana’s Casadevall and Max Korkh 8-1 to advance to the quarterfinal match where they fell to Oregon’s Ty Gentry and Simon Stevens 8-5.\nThe Bengals return to play Oct. 18-21 for the Region VII Championships.", "url": "https://apnews.com/c12633dba7444b6192a0124e7ffffd0a"}