{"authors": ["Richard Seymour", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:37", "date_modify": "2020-05-04 19:51:37", "date_publish": "2017-01-17 00:00:00", "description": null, "filename": "2017_01_jeff-sessions-david-horowitz-trump-frontpage-zionism-racism_1588621897.html", "image_url": "https://images.jacobinmag.com/2017/01/17233056/horowitz-1.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2017_01_jeff-sessions-david-horowitz-trump-frontpage-zionism-racism_1588621897.html", "title": "A Most Brilliant Individual", "title_page": "A Most Brilliant Individual", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe likely incoming attorney general, Senator Jeff Sessions, is a fan of David Horowitz: a “most brilliant individual” in his estimate. Sessions, who is reported to have claimed that the NAACP and ACLU were Communist-inspired — an ancient myth whose origins lie in the segregationist Massive Resistance campaign — would have every reason to sympathize with the red-baiting of Horowitz and his “Freedom Center.” What Sessions particularly admired about Horowitz is his defection from “the unprincipled totalitarian radical left to a more traditional America person.” Thank God someone finally saw the principle in David Horowitz.\nSecond Thoughts David Horowitz stands in an ancient and venerated tradition, that of Gustave Hervé, John Spargo, Irving Kristol, and Benito Mussolini — the apostate socialist turned raving nationalist, militarist reactionary. The twentieth century saw three big waves of left-right defection: the abandonment of socialism to nationalist frenzy at the start of World War I; the early Cold War, in which thirties radicals veered sharply to the center; and the second half of the seventies in which former ’68ers turned neocon or reheated a version of Cold War “antitotalitarianism.” In each case, the issues of the nation, race, and war figured prominently for the defectors. For David Horowitz, race was the critical axis of his leftism and his apostasy. Horowitz grew up in a Communist family in Queens, New York in the 1940s and ‘50s, and witnessed the paralysis and demoralization that struck Communist activists when Khrushchev’s revelations of Stalin-era crimes were reported. As a teen, he was a worthy, dull red acolyte, fantasizing that “capitalistic expressions” such as popular music would be banned following the Revolution, so that people could listen to real music like Beethoven. Alexander Cockburn, recalling Horowitz at the 1987 “Second Thoughts” conference, where various ex-radicals repented, noted his mourning for those deprivations: “He had never been allowed to go to Doris Day and Rock Hudson movies, but rather was forced to sit through uplifting Soviet features. If only he’d been allowed to watch Pillow Talk . . .” Horowitz enrolled in an English literature masters program at Berkeley in the early sixties just as civil rights activism was rekindling radical politics and fusing with dissent at America’s involvement in Vietnam. Decolonization movements were winning victory after victory and driving an interest in anti-imperialism as the key axis of revolutionary change. Horowitz’s record of radical writing and scholarship in this period is prolific. Indeed, one thing that has never changed about him is his extraordinary productivity. As befitted the era, he focused on imperialism, the Cold War, and the big business coalitions behind counterrevolutionary politics. He was one of the first Cold War revisionists (arguing that the Cold War was a product largely of US corporate interests rather than Soviet aggression), wrote on the emerging radical tendency in sociology, and composed a lengthy biographical study of Isaac Deutscher whom he befriended in London. Meanwhile, he began to edit the New Left magazine, Ramparts, just as global insurrection was kicking off in 1968. Central to Horowitz’s perspective was the black freedom struggle. In the early seventies, he became close friends with Huey Newton, and was drawn into the orbit of the Black Panther Party. He had initially sought Newton out to challenge the Panthers for what he thought was their simplistic politics, but Newton charmed him and persuaded him that he agreed and that the organization had to change. But by this point, the Panthers were already in decline, under the weight of state repression, COINTELPRO harassment, and assassination. The group was constantly being embroiled in rivalries and violence. To Horowitz’s horror, Betty Van Patter, a young woman he had introduced to the party to work as a bookkeeper, disappeared. Her body turned up, beaten, her skull broken. Horowitz had no doubt that the Black Panther leadership was involved in the murder. The shock and disillusionment was severe, and began to affect his entire political outlook. He bitterly reproached himself for having been so gullible. “Unhappiness,” he said, “settled over my life like an arctic snow . . . I seemed to gravitate toward the center of my own disorder, taking morbid pleasure in becoming my own prosecutor, testing to see how darkly I could depict myself and what I had done.” As he tormented himself, with all the usual boring, damaged, oppressive repetitiveness of the superego, he was changing his entire outlook.\nThe Punishment In a 1974 essay, “The Passion of the Jews,” Horowitz bitterly criticized fellow Jewish intellectuals who he said abandoned the black freedom struggle, partly in response to the criticisms of Israel after the 1967 war among radical leftists and black militants. Blacks, Horowitz argued, were “the Jews of America, the obsessional victim of the white majority in much the same way that Jews have been the obsessional victims of Christian majorities in Europe.” But soon after he wrote these words, he was quietly beginning to execute a volte face. He began to re-evaluate the significance of Israel, and to believe that the world was divided into ethnic interests which transcended class. Daniel Oppenheimer, summarizing Horowitz’s views in this era, writes: Black vs White. Arab vs Jew. Black vs. Jew. These were realities . . . only a fool would deny them . . . The blacks had seen things for what they were. Other Jews had. He now resolved to do the same. In the late 1970s, ex-radicals and former liberals were being pulled to the right. Amid the long Republican reign beginning in 1980, many intellectuals felt confident enough to openly recant their former sympathies. But it wasn’t until 1984, during Reagan’s re-election campaign, that Horowitz cast his first vote for a Republican. “I did so,” he said, “because he was opposing the efforts of the Sandinista Marxists to turn Nicaragua into a socialist gulag like Cuba. I had supported Fidel; I wasn’t going to make the same mistake twice.” It had taken him almost a decade of guilt, demoralization, and reconsideration for him to finally make a decision to wage open war against his former affiliations. No more the anti-imperialist revolutionary, when he finally emerged from the closet in 1985, clean-shaven and sporting a right-wing outlook, he told readers of the Washington Post magazine that he was saying goodbye “to the self-aggrandizing romance with corrupt Third Worldism; to the casual indulgence of Soviet totalitarianism; to the hypocritical and self-dramatizing anti-Americanism which is the New Left’s bequest to mainstream politics.” He identified himself henceforth as a supporter of the Contras, and — perhaps not expecting the ferocity of his later antipathy to “jihad” and “radical Islam” — of the “freedom fighters” supported by Reagan in Afghanistan. If he had given up the idea of a black freedom struggle, race was still central to Horowitz’s new thinking. As Mother Jones noted in a sympathetic biographical piece, “Horowitz’s current right-wing views seem particularly fervent when he talks about American blacks.” Horowitz confessed that “I do have a certain bitterness towards blacks because my parents taught Negro history in the ‘40s and I and my friends, all Jews, dedicated our lives, the main aspect of our political lives . . . for black people in this country. And when fucking Jesse Jackson gets out there with this black Klu Kluxer Farrakhan, praising Hitler and attacking Jews, not one fucking black leader came out and condemned it.” He said of “the lot of black people in Africa” that “the worst thing that’s happened to them, or a great tragedy, was decolonization. They were better off as colonies.” The most important thing for Horowitz was that no one else should be played in the way that he had. He had been a sucker, he was guilty as hell, and he would make amends. He yearned to demonstrate to those on the Left “the destructive consequences of the ideas and causes they promoted,” and to the conservative Right “the malignancy of the forces that were mobilized against them.” He had to expiate his sin, and to punish his erstwhile comrades as sadistically and joyfully as he had punished himself, writing sensationally over and over again about the crimes of the New Left and its splinters.", "url": "https://www.jacobinmag.com/2017/01/jeff-sessions-david-horowitz-trump-frontpage-zionism-racism"}