{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:07:55", "date_modify": "2020-05-04 20:07:55", "date_publish": "2017-02-13 07:15:00", "description": "The University of Georgia Extension Service and Small Business Development Center are planning a major agri-business seminar, co-sponsored by the Coosa Valley Credit Union, to assist entrepreneurs...", "filename": "_3c5b7d33d87c41a1add0814ec1668b9f_1588622875.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3c5b7d33d87c41a1add0814ec1668b9f_1588622875.html", "title": "Too much to mow? Extension program coming in April to help with that", "title_page": "Too much to mow? Extension program coming in April to help with that", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Too much to mow? Extension program coming in April to help with that\nThe University of Georgia Extension Service and Small Business Development Center are planning a major agri-business seminar, co-sponsored by the Coosa Valley Credit Union, to assist entrepreneurs interested in starting their own agriculturally based enterprise.\nCalled “Too Much to Mow, What to Grow” the seminar is scheduled for April 21 at the Bartow County Library, 429 W. Main St. in Cartersville.\nExtension offices in Bartow, Gordon, Floyd, Polk, Murray, Paulding and Whitfield counties are participating in the program.\nTopics that will be covered include gardening and horticulture, backyard poultry, livestock for small farms, how to best utilize property for agricultural purposes and organic production techniques.\nThe business side of the program will focus on how to develop a business model, how get a business loan in agriculture, where to sell products, marketing and legalities and tax information.\nThe seminar will run from 9 a.m. to 2 p.m. April 21 and the cost is $49.\nPeople can register online at www.georgiasbdc.org/rome or by calling 706-622-2006.\nChieftains seed swap set for Saturday, Feb. 18\nThe Chieftains Museum will host the fourth annual Floyd County Seed Swap in conjunction with a Family Free Day at the museum on Saturday, Feb. 18.\nThe seed swap is co-sponsored with the Berry College Environmental Studies Program, Keep Rome Floyd Beautiful, Action Ministries Rome, the Rome Federated Garden Club and Rome Master Gardeners.\nThe event is held annually to encourage the production and protection of heirloom seeds and plant varieties that are at risk of being lost. Seed saving was particularly important to Cherokees like Major Ridge in order to sustain his family through the winter months and provide crops for the spring and summer.\nDr. Brian Campbell, director of the Berry Environmental Studies program, will lead off the event at 11 a.m. with a presentation on how to properly save seeds.\nChieftains is also offering free admission for the entire day with information about Cherokee plants and agricultural practices.\nAdditional information is available by calling 706-291-9494 or going online at www.chieftainsmuseum.org.\nDDA doling out historic plaques downtown\nThe Downtown Development Authority is in the process of putting up historic markers at 18 properties in the downtown district.\nThe markers cost $200 apiece, with $100 funded by a grant from the Rome Area Heritage Foundation and $100 coming from the property owner.\nPlaques are being installed at The Griffin, 215-217 Broad St.; Johnny’s Pizza, 233 Broad St.; the Clonts building at 231 Broad St.; Top Hat Formal Wear, 245 Broad St.; Illusions, 204 Broad St.; Whistlebritches, 206 Broad St.; Seasons, 208 Broad St.; Elysium, 226 Broad St.; Harvest Moon, 234 Broad St.; the Manning building 326 Broad St.; the Parker building, 400 Broad St.; Schroeder’s, 406 Broad St.; Snazzy Rags, 419 Broad St.; River Dog Outpost, 1 Broad St.; C&S Trophies, 3-5-7 Broad St.; Pullen’s Ordinary Bicycles, 101-105 Broad St. and Tedesco Law office, 34 East Second Ave.\nEach of the plaques will explain what used to be in each building and the approximate time the business was constructed.", "url": "https://apnews.com/3c5b7d33d87c41a1add0814ec1668b9f"}