{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:12:42", "date_modify": "2020-05-04 20:12:42", "date_publish": "2017-02-23 21:01:19", "description": "For the latest events and activities happening in Greenwich, turn to For the record. To have your event included, submit a description, date, time, price and contact information. Photos are...", "filename": "_b01583c6beb4443ca0229329ec463531_1588623162.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b01583c6beb4443ca0229329ec463531_1588623162.html", "title": "Things to do in and around Greenwich", "title_page": "Things to do in and around Greenwich", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "For the latest events and activities happening in Greenwich, turn to For the record. To have your event included, submit a description, date, time, price and contact information. Photos are welcome. Drop us an email about your latest goings-on at gtcitydesk@scni.com or call 1-800-733-2767.\nIncome tax help\nFree income-tax preparation assistance is available from 9 a.m. to 2:30 p.m. Tuesdays, Wednesday and Thursdays at Town Hall in the third-floor Hayton Room through April 18, and Saturdays at the Greenwich Main Library from 9 a.m. to 2:30 p.m. No appointments are required at the Greenwich Library but for the Town Hall, taxpayers are encouraged to make appointments by emailing greenwichtaxaid@gmail.com or stopping in the Hayton Room in Town Hall during our hours of operation. Those with appointments will be taken first, in the order of arrival. Bring photo ID, Social Security cards for themselves, their spouses and any dependents, birth dates and a blank check for their bank account for direct deposit in case a refund is due. Also wage and earning statements from employers -- W-2’s, 1099-R’s and 1099-Misc; all health insurance statements and Affordable Health Care statements -- Form 1095-A; interest and dividend statements from banks -- Form 1099’s; and a copy of their federal and state tax returns from last year. Both people must sign the return if they’re a couple filing jointly.\nMusic and film\nGreenwich Library, 101 W. Putnam, Ave., is celebrating Black History Month with the 2016 drama “Race” at 8 p.m. Friday in the Cole Auditorium, a drama based on black athlete Jesse Owen’s story. Free and open to the public. Doors open at 7:40 p.m. For more information, call 203-622-7910.\nArt Display\nDuring February at M and T Bank, 100 East Putnam Ave.,Cos Cob, the paintings of Art Society of Old Greenwich artist Dr. Ann Abenavoli will be on display during banking hours. Abenavoli specialized in diagnostic radiology prior to retirement and paints in watercolor and acrylics. She has displayed her art in Connecticut and Westchester County, N.Y.\nCome see “Young Victoria”\n“Young Victoria” will be the featured film of the Perrot Library’s Saturday Afternoon movie, set for 2 p.m. Saturday at the library on Sound Beach Avenue in Old Greenwich. The 2009 movie, directed by Julian Fellowes and starring Emily Blunt, Rupert Friend and Paul Bettany, is free and includes English tea and refreshments. For more information, call 203-637-3870 or visit www.perrotlibrary.org.\nWine-pairing\nThe St. Lawrence Club, 86 Valley Road, Cos Cob, is holding a South Pacific Wine-Pairing Dinner beginning at 6 p.m. Saturday with appetizers at 6:30 p.m., dinner at 7 p.m. and dessert. Tickets $75 per person, reservations must be received by Feb. 17. RSVP and tickets: www.stlawrencesociety.com/events or call 203-618-9036.\nOur Last Stand\nThe First Presbyterian Church of Greenwich will present a screening and panel discussion of the award-winning documentary, “Our Last Stand,” at 5:30 p.m. Saturday in the Cole Auditorium of Greenwich Library, 101 West Putnam Ave. Admission is free. A cocktail reception will follow at 7:30 p.m. at the First Presbyterian Church of Greenwich, 1 West Putnam Ave., Greenwich. RSVP to hagar@greenwichmedia.com.\nTrivia Challenge\nThe Greenwich Alliance for Education will host its Second Annual Trivia Challenge at 6:30 p.m. Saturday at First Presbyterian Church, 1 West Putnam Ave., Greenwich. Tickets are $125 a person. Register at www.greenwichalliance.org/events/trivia-challenge/.\nBoating safety class\nThe next certified, U.S. Coast Guard Auxiliary boating safety class is set for Saturday at the Greenwich Water Club, 49 River Road, Cos Cob. The course covers requirements for safe boating, including Emily’s Law, choices of boats, safety equipment, Connecticut boating laws, boat handling, radio communications and personal watercraft operation. Preregistration required by Feb. 22. $75 fee includes textbook and class materials. Sign-in begins at 7:45 a.m. and lectures start at 8 a.m. Class should finish by 5 p.m. Need the Connecticut Conservation ID number. Contact Leandra at 203-661-4033, Ext 200, or email Flotilla78@yahoo.com to register.\nSwim-A-Thon\nThe 12th Annual Boys and Girls Club Swim-A-Thon fundraiser will be from 8 a.m. to noon Saturday at the club, 4 Horseneck Lane, with proceeds benefitting the club’s aquatic programs. Advance registration is required. For a $50 membership to the Boys and Girls Club of Greenwich, youth can join the swim team and participate in special clinics including swimming lessons, snorkeling, water polo and water safety instruction. To participate or sponsor a swimmer, visit http://bgcg.org/2017swimathon or call 203-869-3224.\nGreenwich Symphony\nCanadian violinist Christina Bouey will perform Sibelius’ ‘Violin Concerto’ with the Greenwich Symphony at 8 p.m. Saturday and 4 p.m. Sunday at the Performing Arts Center at Greenwich High School, 10 Hillside Road. Adult tickets are $35, student tickets $20. Tickets available by phone at 203-869-2664 or on-line at greenwichsym.org.\nCos Cob Archers open shoot?\nCos ?Cob ?Archers will hold an open-to-the-public field target/3D shoot at 205 Bible St. Sunday . Registration takes place from 8 a.m. to 11 a.m. Registration by 11 a.m. required to shoot. Shooting ends at 1 p.m. $5 for those under 16 accompanied by a paying adult, $20 for adults, $10 for non-shooting adults; $50 maximum per family. Free for members. $10 for guests of members. Lunch is included. Guest bows/arrows for all ages are included in fee. To attend, email Joe Santora at jsantora47@yahoo.com. For further information, please visit www.coscobarchers.com.\nJapanese art\nA historical exhibition exploring the influence of Japanese art and culture on the United States will run through Sunday at the Greenwich Historical Society, 39 Strickland Road, Cos Cob. The exhibit, “An An Eye to the East: The Inspiration of Japan,” will be open from noon to 4 p.m. Wednesday through Sunday. Regular admission, $10 for adults, $8 for seniors, and free for members.\nCuriousity concert features clarinetist\nThe Anat Cohen Quarter will be the next featured offering of the Ashforth Children’s Concert Series and Curiosity Concerts, set for 1 p.m. Sunday at Greenwich Library, 101 W. Putnam Ave. Free but reservations required at www.curiosityconcerts.org. Cohen, a critically acclaimed clarinetist, has been voted “Clarinetist of the Year” eight years in a row by the Jazz Journalists Association. Concert suitable for all ages.\nJazz live\nThe next Sunday Afternoons Live music series will feature a jazz concert at 4 p.m. Sunday at First Congregational Church, 108 Sound Beach Ave., Old Greenwich. Jazz saxophonists Peter and Will Anderson focus on new renditions of classic songs, most recently performing live on a 2016 episode of “Prairie Home Companion.” Tickets are $20 per person available at the door. School-age youth are free. For more information, call Craig Symons at 203-637-1791, email craigs@fccog.org or visit www.fccog.org.\nYacht Club Open House\nThe Old Greenwich Yacht Club on Greenwich Point will host its annual opening houses from 2 to 4 p.m. between Sunday and April 2 including live music and refreshments by the fire. On Feb. 26, local ensemble The Crash Boat Divers will play classic acoustic covers of Jimmy Buffett, Van Morrison, David Bowie and others. For more information, contact Membership Director Michael Sullivan at membership@ogyc.org, or visit www.ogyc.org.\nSigns of abuse to be discussed\nThe YWCA of Greenwich and the One Love Foundation will hold a screening of “Escalation” at 6:30 p.m. Tuesday followed by a question and answer session. The film demonstrates the potential warning signs of relationship abuse and the role the people around the victim can play in helping spot the more nuanced evidence. Free and open to the public. Space is limited. Reservations available at rsvp@ywcagreenwich.org. For questions, contact Meredith Gold, director of Domestic Abuse Services, YWCA Greenwich, at 203-869-6501, Ext 176.\nAshes to Palm event\nThe First United Methodist Church will offer Ashes to Palms, an event offering story-telling, crafts and other seasonal preparations for Lent from 4 to 6 p.m. Tuesday at the church, 59 East Putnam Ave., Greenwich. Program is free and designed for kids, but pre-registration is required. Visit www.fumcgreenwich.com or call 203-629-9584 for more information.\nPancake Supper\nFirst United Methodist Church, 59 E. Putnam Ave., is holding a Mardi Gras Pancake Supper from 6 to 8 p.m. Tuesday to help support the church’s mission and ministry. Suggested fee $5. Kids younger than 10 eat free. Visit www.fumcgreenwich.com or call 203-629-9584 for more information.\nHeart and Stroke Fair\nA free Heart Health and Stroke Fair will take place from 8 to 11 a.m. Tuesday at Greenwich Hospital’s Noble Conference Center, 5 Perryridge Road, Greenwich. Free and open to the public.\nFund-raising 5K\nA 5K walk and run to support the Vanishing White Matter Disease Families Foundation will be held beginning at 4:30 p.m. Tuesday at the main concession stand at Greenwich Point as part of Rare Disease Day. Sam Buck, a first-grader at Glenville School, suffers from Vanishing White Matter Disease, a rare terminal brain disease. Registration for the event is $25 at http://vwmff.org/rare-disease-day-virtual-5k/. Runners can complete their 5K run or walk from anywhere.\nIntelligence and security\nMichael Baker, president and co-founder of Diligence LLC, a private intelligence and security firm, will be guest lecturer at the March 1 meeting of Greenwich Retired Men’s Association at First Presbyterian Church, Lafayette Place. Social hour begins at 10:40 a.m. with program starting at 11 a.m. Open to the public.\nPhotos of James Brown\n“James Brown on My Mind,” a photography exhibit with work by Emilio Grossi, will be on display at Les Beaux Arts Gallery, Round Hill Community Church, 395 Round Hill Road through March 2. The series dates from the 1960s and focuses on Brown’s concert at the Apollo Theater in Harlem. Gallery hours are 11:30 a.m. to 12:30 p.m. Sundays, from 9 a.m. to 3 p.m. weekdays and closed Saturdays and Feb. 20. Gallery is free. For information, call 203-869-1091 or visit roundhillcommunitychurch.org.\nBenefit luncheon\nThe Bruce Museum’s Art of Design benefit luncheon will be held from 11 a.m. to 2 p.m. March 2 featuring a panel discussion including designers Veronica Miele Beard and Veronica Swanson Beard, co-founders of Veronica Beard clothing. Discussion moderated by Lesley Jane Seymour. Advance registration is required. For tickets and information, visit ArtofDesign2017.eventbrite.com online or contact Lindsay Saltz at lsattz@brucemuseum.org.\nUndies Project\nFor a second year, local businesses will collect new and lightly used bras until March 3 at local businesses. Collection points will be at Aux Délices in Greenwich and Riverside; Equinox; Inside the Armoire; YWCA of Greenwich; Kaia Yoga, in Greenwich and Old Greenwich; and The Edge Fitness in Old Greenwich. For further information, visit www.theundiesproject.org.\n3-artist show opens\nSamuel Owen Gallery, 382 Greenwich Ave., will hold an opening of its newest show from 6 to 8 p.m. March 3. The show features the works of Gian Garofalo, James McNabb and Laurence Vallieres. The work of Garofalo has been on display at the gallery; this new show adds the works of McNabb and Vallieres. Open to the public.\nRemember the Clam Box\nThe St. Lawrence Club, 86 Valley Road, Cos Cob, his continuing its Nostalgia Dinner Series with “Remember the Clam Box” at 6:30 p.m. March 3. Clam chowder, fried clams, fish and chips, coleslaw and dessert. Cost $35 for adults, $15 for children. RSVP www.stlawrencesociety.com/events or call 203-618-9036. Open to the public.\nHibernians dinner March 4\nGreenwich Hibernians will host its annual St. Patrick’s Dinner Dance to be held on the night of March 4 at the Redmens Hall, 17 East Elm St., Greenwich. Tickets are $40. For tickets or additional details, contact Haydn O’Shea at passage317@aol.com or at 203-661-2963.\nRabbi to speak on Afghanistan\nBruce Freyer, a retired rabbi of Congregation Emanu-El of Westchester, will be a guest speaker at First Congregational Church on March 5 with “A Rabbi’s 50-Year Affair with Afghanistan.” The talk is open to the public and will begin at 11:20 a.m. at the church, 108 Sound Beach Ave., Greenwich. Refreshments will be served.\nAviation herstory\nIn honor of women’s history month, the Greenwich Historical Society and Greenwich Point Conservancy will present Barbara Hiscock Spaeth speaking of her aunt, Bertha Potter Boeing and the role she played in American commercial aviation, from 4:30 to 5:30 p.m. March 5 at Innis Arden Cottage, Greenwich Point, Tod’s Driftway, Old Greenwich. Doors open at 4 p.m. Free but reservations required. RSVP to 203-869-6899, Ext. 10, or shealy@greenwichhistory.org. Light refreshments will be served.\nLong Island Sound water quality\nFive representatives from environmental organizations and local government will discuss water quality in Long Island Sound with “Testing the Waters,” part of the Fred Elser First Sunday Science series and set for 2 p.m. March 5 at the Seaside Center at Innis Arden Cottage/Bruce Museum in Greenwich Point, Old Greenwich. Panelists include Denise Savageau, director of Greenwich Conservation; Mike Long, director of Greenwich Health Department’s division of Environmental Services; Curt Johnson, director of Save the Sound; Sarah Crosby, director of Earthplace’s Harbor Watch; and Roger Bowgen, Greenwich Shellfish Commissioner. The First Sunday Science program also includes water activities for all ages in the Bruce Museum Seaside Center from 1:30 to 4 p.m. The event is free and open to the public. No registration is required. For information, contact Cynthia Ehlinger at 203-413-6756 or cynthiae@brucemuseum.org.\nNew World discovers Asia\nThe Greenwich Decorative Arts Society presents “Made in Americas: The New World Discovers Asia,” a lecture by Dennis Carr, at 1:15 p.m. March 6 at the Bruce Museum, 1 Museum Drive. Carr is the Carolyn and Peter Lynch Curator of American Decorative Arts and Sculpture Art of the Americas of the Museum of Fine Arts in Boston. Admission for non-members of the Greenwich Decorative Arts Society is $25. Space is limited. Reservations required for members and guests by Feb. 27. For reservations and information, visit greenwichdecorativearts@gmail.com or call 203-322-2967.\nBook discussion group\nGreenwich Pen Women and the Perrot Memorial Library will launch a book discussion group beginning 7 p.m. March 6 in the meeting room of the library, 90 Sound Beach Avenue. First book is “Vinegar Girl” by Anne Tyler, looking at the theme of Shakespeare in contemporary fiction. “Vinegar Girl” is a modern retelling of “Taming of the Shrew.” Free and open to the public. Limited to 20 attendees. Register at the Adult Circulation Desk or call 203-637-1066, Ext. 15. Snow date March 13.\nWomen of Vision Benefit Lunch\nDr. Vinh Chung, a former refugee and Harvard University-educated physician, will be the keynote speaker at a fundraiser luncheon to benefit Women of Vision from 11 a.m. to 2 p.m. March 6 at the Hyatt Regency Greenwich, 1800 East Putnam Ave., Greenwich. Tickets available at womenofvisionfc.org. Tickets start at $175 with tickets packages including dinner receptions with Chung on March 5. Women of Vision is an affiliated ministory of World Vision that seeks to educate and equip women to assist oppressed women and children worldwide.\nDesktop savvy\nThe TechLounge at Greenwich Senior Center will offer computer skills instruction each Tuesday from 1 to 3 p.m. between March 7 and June 13 at the center, 299 Greenwich Ave., Greenwich. Topics include Microsoft Windows 10, iPhone and iPads, Samsung Galaxy smartphones, using Google, genealogy searches and social media. In addition, every Friday from 9:30 a.m. to noon, the TechLounge offers a free questions session on technology. To enroll in a class, email TechLounge21@gmail.com or call 203-862-6700.\nAging and Exercise\nDr. Mark Kowalsky and Robert Spatz, a physical therapist from Orthopaedic and Neurosurgery Specialists, will present a free lecture on “Aging and Exercise: The Fountain of Youth,” at 6 p.m. March 8. in the Noble Auditorium of Greenwich Hospital, 5 Perryridge Road. Registration is requested by calling 203-863-4277 or by going online to the events calendar page at greenwichhospital.org.\nRTM opening\nAn election to fill a vacancy on the Representative Town Meeting of Greenwich District 5’s delegation will be at 8 p.m. March 9 at the Riverside School Media Center, 90 Hendrie Ave., Greenwich. Contact District Chairwoman Lucy Krasnor at 203-632-2277 between 7 and 9 p.m. or email lucy@strategymortgage.com.\nSt. Lawrence Club\nThe St. Lawrence Club, 86 Valley Road, Cos Cob, will have a live music night beginning at 8:30 p.m. March 10 at “The Pub in the Club” featuring Mark Zelenz and Steve Hanson. No cover charge. Open to the public.\nTemple Sholom Comedy Night\nTemple Sholom of Greenwich will host an “adult night out,” March 11 with comedian Josh Gondelman, award-winning writer for HBO’s “Last Week Tonight.” Tickets are $25 each and can be reserved www.templesholom.com/comedy-night-reservation or contacting Gina Pernicano, 203-542-7169, gina.pernicano@templesholom.com.\nInside choral music\nGreenwich Choral Society will hold a free lecture and demonstration on the art of choral singing and musical style at 6 p.m. March 11 at Greenwich Library’s Cole Auditorium. The lecture will feature Maestro Paul Mueller and a group of Choral Society singers.\nChamber Players season offerings\nThe Chamber Players of the Greenwich Symphony for its 45th season will feature “Snake Charmers,” focusing on works for oboe by Holst, Cimarosa and Bellini on March 12 and 13. The finale includes Beethoven’s string quartet No. 12 in E-flat major, Op. 127. The April concerts, on April 23 and 24, will celebrate “Old World and New World” with works for piano and strings by Mozart, Copeland and Zarebski. All Sunday concerts are at 4 p.m. at Round Hill Community Church and Monday concerts are held at 7:30 p.m. at the Bruce Museum. Each includes a wine and cheese reception. Season tickets are $90 for adults and $15 for students. Single concert tickets are $30 for adults and $5 for students. For more information, call 203-637-4725.\nIslamic ceramics\nThe Connecticut Ceramics Study Circle will hold an illustrated lecture, “Between East and West: Ceramics of the Islamic World Between China and Europe” featuring Walter B. Denny at 1 p.m. March 13 at the Bruce Museum, 1 Museum Place. Denny is an art history professor with the University of Massachusetts in Amherst. Refreshments following the lecture. Cost for non-members of the Study Circle is $25. For more information, visit www.ctcsc.org.\nSt. Patrick’s Party\nGreenwich Senior Center’s St. Patrick’s Day Party will be from 11 a.m. to 2 p.m. March 17 at the Eastern Greenwich Civic Center, 90 Harding Road. Tickets are $14 a person and include traditional Irish food and live entertainment featuring Mike Rinaldi. Contact Suzanne Testani at 203-862-6721 for more information.\nSt. Patrick’s Day parade\nThe Greenwich Hibernians’ St. Patrick’s Day Parade will be at 2 p.m. March 19 starting at Greenwich Town Hall, 101 Field Point Road. Parade route will follow Field Point Road to the Post Road and down Greenwich Avenue.\nFocus on French Cinema\nAlliance Francaise of Greenwich will host the 13th annual Focus on French Cinema in Connecticut and Manhattan from March 27 to April 2. The line-up will include more than 20 U.S. premieres of French-language films. French director, actor, cinematographer and producer Claude Lelouch will be the festival’s honoree. Alliance Francaise of Greenwich 2017 will also pay tribute to the Cinema of Québec. For more information on Focus on French Cinema, visit www.focusonfrenchcinema.com\nAstronomy lectures\nThe Astronomical Society of Greenwich has announced its upcoming lectures at the Bruce Museum, 1 Museum Drive. On March 26, Jason Kendall of William Paterson University will speak on “The Big Bang: How we Know the Universe is 13.7 billion years old.” On April 30, Sarbani Basu of Yale University will speak on “Listening to the Stars.” For more information, visit www.astrogreenwich.org, call 203-413-6762 or email greenwichstars@gmail.com or anneburns@brucemuseum.org.\nCarlson to MC Gala for Lyme Awareness\nJournalist Gretchen Carlson will be the emcee for the Greenwich Gala for Lyme Disease Awareness, set for 6:30 p.m. to midnight April 1 at the Hyatt Regency in Old Greenwich. The fund-raising event features a cocktail reception, dinner, dancing and silent and live auctions. For information or to purchase tables or tickets, visit GLA.org/ctgala or call 203-969-1333. Honorees will include Dr. Harriet Kotsoris and singer-songwrite Marina Morgan. Event chairs are Robyn Carpenter, Heather Glass, Amy Tambini and Tara Vessels. Sponsors include Fairfield County Look, Franklin Square Investments, Greenwich Hospital, Luxe Interiors +Design, WIMCO Villas and Withersworldwide.\nCasino night\nThe St. Lawrence Club, 86 Valley Road, Cos Cob, is holding a casino night on April 1. Open bar from 6 to 7 p.m., past and carving stations. $75 per person. Open to the public. Register by March 1 for $10 discount. Registration at www.stlawrencesociety.com/events or call 203-618-9036 for information.\nEarly bird registration\nReduced-price registration for the two- and one-week summer sessions of the Greenwich Historical Society History and Art Camp is open between now and April 1. Camp hours for the June and July sessions will be 9:30 a.m. to 2:30 p.m. Monday to Friday. Sessions for fourth- to seventh-graders will be from July 10 to 21 and July 24 to Aug. 4 for second- to fourth-graders. Tuition for early bird sessions is $550 for two weeks and $350 for one week. For more information or to register, visit www.greenwichhistory.org/camp.\nSeeking storytellers\nThe Greenwich Historical Society is seeking storytellers for its April 28 Story Barn, “Imagine That!” which stems from its current exhibition “Jim and Jane Henson: Creative Work, Creative Play.” The event will start at 7 p.m. and feature local storytellers in a cabaret environment. Anyone over age 21 is invited to participate but must sign up and pitch the story in advance. Contact Anna Greco at agreco@ greenwichhistory.org or call 203-869-6899, Ext. 31. One-on-one coaching is offered for those who would like guidance or would like to polish their presentation before the event.\nBruce exhibits Sisley paintings\nThe Bruce Museum will present “Alfred Sisley (1839-1899): Impressionist Master,” through May 2 at the museum at 1 Museum Drive, Greenwich. For more information, call 203-869-0376 or visit brucemuseum.org.\nAbilis fund-raiser set for May\nAbilis is holding its 65th annual gala, “Spring for Abilis,” at 7 p.m. May 6 at Tamarack Country Club, 55 Locust Road, Greenwich. Champagne reception, silent and live auctions, cocktails, dinner and dancing. Gala co-chairs are Margot Michalski, Adriana Ospina and Martha Perry. Tickets start at $350. For more information, visit http://www.501auctions.com/spring4abilis.\nNYC photos exhibit opens at Bruce\n“Street Smart: Photographs of New York City, 1945-1980,” will be on display at the Bruce Museum, 1 Museum Place through June 4. The show features 30 black and white works drawn from the museum’s permanent collection. The exhibit is presented with support from the Charles M. and Deborah G. Royce Exhibition Fund and the Connecticut Office of the Arts. The museum is open from 10 a.m. to 5 p.m. Tuesday through Sunday. For more information, call the Bruce Museum at 203-869-0376 or visit www.brucemuseum.org.\nBruce’s collection\nThe Bruce Museum’s new exhibit, “Canvas and Cast: Highlights from the Bruce Museum’s Art Collection,” will be on display through June 11. The show will include 35 paintings and seven sculptures from the Bruce’s growing collection. Gallery hours at the museum at 1 Museum Drive are 10 a.m. to 5 p.m. Tuesday through Sunday.\nLast Days of Pangea\nAn exhibit on the ancient past, “Last Days of Pangea: In the Footsteps of Dinosaurs,” at the Bruce Museum, 1 Museum Drive, Greenwich, will remain on view through July 16. The show features fossil discoveries from the Connecticut Valley and other places in New England. The museum is open 10 a.m. to 5 p.m. Sunday to Tuesday. For more information, visit www.brucemuseum.org.", "url": "https://apnews.com/b01583c6beb4443ca0229329ec463531"}