{"authors": ["Michael Norman"], "date_download": "2020-05-04 20:14:19", "date_modify": "2020-05-04 20:14:19", "date_publish": "2017-12-19 20:46:31", "description": "The trailer for female-led 'Ocean's 8' drops at just the right time The trailer for \"Ocean's 8\" came out Tuesday, more than a year after the public learned about the all-female installment...", "filename": "_83a29b033052499aaa081d22d20ae01a_1588623259.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_83a29b033052499aaa081d22d20ae01a_1588623259.html", "title": "The trailer for female-led 'Ocean's 8' drops at just the right time", "title_page": "The trailer for female-led 'Ocean's 8' drops at just the right time", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The trailer for female-led ‘Ocean’s 8’ drops at just the right time\nThe trailer for female-led ‘Ocean’s 8’ drops at just the right time\nThe trailer for “Ocean’s 8” came out Tuesday, more than a year after the public learned about the all-female installment of the “Ocean’s” heist movie franchise.\nStarring Sandra Bullock as Debbie Ocean, the movie follows eight women from all walks of life who attempt to pull off a job at the Met Gala, where they apparently want to steal the very-expensive jewelry worn by Anne Hathaway’s character.\nAt one point, Mindy Kaling’s character sees footage of a Met Gala and exclaims: “Taylor Swift?! Can’t we just go to this - do we have to steal stuff?” Her partners resoundingly respond: “Yes.”\nCate Blanchett, Sarah Paulson, Awkwafina, Rihanna and Helena Bonham Carter round out the powerhouse cast, which has several Oscar, Golden Globe, Emmy and Grammy wins among them.\nBullock’s character, Debbie, is a sister to Danny Ocean (George Clooney), who has “been incarcerated for about five years and you find out why during the course of the film,” the actress told Entertainment Weekly. Toward the end of the trailer, you see Debbie sitting next to a gravestone bearing her brother’s name.\nWhile “Ocean’s 8” won’t be released until June 8, 2018, the trailer has already generated plenty of excitement on social media. Its release is especially well-timed in today’s climate, in which women are increasingly speaking out and being heard about the sexism they’ve experienced in their personal lives and in the workplace.\nAlso, 2017 saw female-led major studio releases go on to be huge successes. “Wonder Woman,” which also had a woman in the director’s chair, is currently 2017′s second highest-grossing movie. And “Girls Trip” is the year’s biggest live-action comedy hit. Both movies also earned high marks from audiences and critics alike.\n“We don’t want it to be just for women,” Bullock told EW. “This is not a man-hating. We love the men. There’s men in this movie. We love them. But this one heist needs women.”\nStill, the trailer’s YouTube comments section is starting to fill up with the same kind of negativity aimed at 2016′s “Ghostbusters.” Not long after the trailer went online for that comedy, which starred Melissa McCarthy, Kristen Wiig, Kate McKinnon and Leslie Jones, it had received nearly double the number of dislikes than likes on YouTube. The comments’ section clearly showed that the fact the remake starred women was the reason for many of those “thumbs down” clicks.\n“They did put them through hell. And I’m still trying to figure out why,” Bullock told EW about the “Ghostbusters” backlash. “Forget what the final product was! There were four or five of the most talented comediennes in that film. Everyone should’ve just taken a breath and said, ‘Let’s see what happens.’ It doesn’t take just five people to make a movie. It’s pretty much like around 300. So I keep reminding everybody, if you hate my film remember there’s another 299 people all around me.”\nThe Clooney-led “Ocean’s Eleven” was actually a remake of a 1960 Rat Pack movie. Steven Soderbergh directed the 2001 version, along with the 2004 and 2007 sequels.\nBullock also produced “Ocean’s 8,” which, she says, is not an all-female remake of a previous movie.\n“We’re not a reboot,” she told EW. “It’s not even a passing of the torch. It’s a parallel story of another family member that was raised in the same family Danny Ocean was and what happens when Debbie steps out of jail with all of these amazing, powerful women.”\nElahe Izadi, The Washington Post", "url": "https://apnews.com/83a29b033052499aaa081d22d20ae01a"}