{"authors": ["Chris Adamski"], "date_download": "2020-05-04 20:10:09", "date_modify": "2020-05-04 20:10:09", "date_publish": "2018-07-29 06:30:46", "description": "During a five-minute session with reporters before the first practice of training camp Thursday, James Conner grew annoyed with questions about his increased camp reps in the contract-related...", "filename": "_75ff5c0f5c304ccca59c7029e1fc77ea_1588623009.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_75ff5c0f5c304ccca59c7029e1fc77ea_1588623009.html", "title": "James Conner wants to make every rep count as Steelers' 1st-string running back", "title_page": "James Conner wants to make every rep count as Steelers' 1st-string running back", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "During a five-minute session with reporters before the first practice of training camp Thursday, James Conner grew annoyed with questions about his increased camp reps in the contract-related absence of Le’Veon Bell.\nBut when someone brought up his new haircut, his face lit up.\n“Thank you for asking that,” the Steelers’ No. 2 running back said.\nThe hair-do - closely-cropped all around other than a patch on the center of the back of his head with extensive growth - was termed by Conner himself as, “Got a mullet on the way.”\nObjectively, most would probably say Conner’s haircut was better in Year 1 than it is in Year 2. But in regards to the second year of football for the former Pitt star?\n“You have a natural expectation to see an improvement,” coach Mike Tomlin said. “He’s been around the track for a lap, he understands what’s going on in terms of the environment and professional football. He’s utilized that experience and knowledge to produce a better, more consistent performance.”\nConner spent the first practice of the 2018 training camp at Saint Vincent as the Steelers’ No. 1 running back. Conner consistently got more reps than veterans Stevan Ridley and Fitzgerald Toussaint, fifth-round draft pick Jaylen Samuels and two others.\nOf course, when (if?) Bell signs his franchise tender and shows up, Conner immediately will be demoted back a spot on the depth chart. For now, though, Conner taking the first-team reps is a tacit endorsement from the coaching staff that the 2017 third-round pick is entrenched as part of the offense.\n“Whenever (running backs coach James Saxon) says to get in there for a rep, I am going to make the most of that rep,” Conner said.\n“Le’Veon here or not, I am focused on trying to prove to myself that I am in shape and I can handle playing and all that.”\nAs Pitt fans are well aware, Conner left No. 2 on the school’s career rushing list (3,733 yards) behind Hall of Famer Tony Dorsett and set ACC records for career rushing touchdowns and total touchdowns.\nOh, and he beat cancer, too.\nSo a rookie season in which he was limited to 144 rushing yards and no touchdowns over 14 games before having it end early because of MCL surgery? That’s not something Conner can’t move on from.\n“The biggest thing, James was a rookie last year and his head was spinning,” quarterback Ben Roethlisberger said. “Now you’ve got a year so, hopefully, that’s the big one I want to see. I want to see his growth. Everyone wants to see what he is capable of doing with the opportunity he is going to be presented.”\nConner made the very most of the very first opportunity he was presented with of this camp. On the very first snap of the daily practice-opening “Seven Shots” drill of live 2-point-conversion-style plays, Conner scored by catching a quick slant from Roethlisberger.\nOne practice rep, yes. But it was significant because Conner did not catch a pass as a rookie. And he noted Thursday that pass-catching and pass-blocking are important parts of the game he wants to master.\n“Because all these coaches know - and I know - that I can run the ball,” said Conner, who similarly expressed self-confidence when talking about his organized team activities and minicamp.\nListed at 233 pounds, Conner appears a little more svelte this season and he said he was around 225.\nJust don’t ask him about the extra reps he’s getting in Bell’s stead.\n“I already answered that,” Conner said.\nFor the past two springs and last preseason, he has. Conner believes now it’s less important to talk about his opportunity and more important to show he is taking advantage of it.\n“I want to show it all,” Conner said. “I want to show everything. ... Every time I get in there I am going to make a rep count.”", "url": "https://apnews.com/75ff5c0f5c304ccca59c7029e1fc77ea"}