{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:59:10", "date_modify": "2020-05-04 19:59:10", "date_publish": "2018-01-19 00:00:00", "description": null, "filename": "2018_01_under-neoliberalism-you-can-be-your-own-tyrannical-boss_1588622350.html", "image_url": "https://images.jacobinmag.com/2018/01/19185145/headache.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_01_under-neoliberalism-you-can-be-your-own-tyrannical-boss_1588622350.html", "title": "Under Neoliberalism, You Can Be Your Own Tyrannical Boss", "title_page": "Under Neoliberalism, You Can Be Your Own Tyrannical Boss", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "A new study by Thomas Curran and Andrew Hill in the journal Psychological Bulletin finds perfectionism is on the rise. The authors, both psychologists, conclude that “recent generations of young people perceive that others are more demanding of them, are more demanding of others, and are more demanding of themselves.”\nWhen identifying the root cause of this growing appetite for excellence, Curran and Hill don’t mince words: it’s neoliberalism. Neoliberal ideology reveres competition, discourages cooperation, promotes ambition, and tethers personal worth to professional achievement. Unsurprisingly, societies governed by these values make people very judgmental, and very anxious about being judged.\nPsychologists used to talk about perfectionism as though it were unidimensional — only directed from the self to the self. That’s still the colloquial usage, what we usually mean when we say someone’s a perfectionist. But in the last few decades, researchers have found it productive to broaden the concept. Curran and Hall rely on a multidimensional definition, encompassing three types of perfectionism: self-oriented, other-oriented, socially prescribed.\nSelf-oriented perfectionism is the tendency to hold oneself to an unrealistically high standard, while other-oriented perfectionism means having unrealistic expectations of others. But “socially prescribed perfectionism is the most debilitating of the three dimensions of perfectionism,” Curran and Hall contend. It describes the feeling of paranoia and anxiety engendered by the persistent — and not entirely unfounded — sensation that everyone is waiting for you to make a mistake so they can write you off forever. This hyper-perception of others’ impossible expectations causes social alienation, neurotic self-examination, feelings of shame and unworthiness, and “a sense of self overwhelmed by pathological worry and a fear of negative social evaluation, characterized by a focus on deficiencies, and sensitive to criticism and failure.”\nIn an attempt to gauge how culturally contingent the phenomenon of perfectionism is, Curran and Hall performed a meta-analysis of available psychological data, looking for generational trends. They found that people born in the United States, United Kingdom, and Canada after 1989 scored much higher than previous generations for all three kinds of perfectionism, and that scores increased linearly over time. The dimension that saw the most dramatic change was socially prescribed perfectionism, which increased at twice the rate of the other two. In other words, young people’s feeling of being judged harshly by their peers and the broader culture is intensifying with each passing year.\nCurran and Hall attribute this change to the rise of neoliberalism and its cousin meritocracy. Neoliberalism favors market-based methods of assigning worth to commodities — and it designates everything it can as a commodity. Since the mid-1970s, neoliberal political-economic regimes have systematically replaced things like public ownership and collective bargaining with deregulation and privatization, promoting the individual over the group in the very fabric of society. Meanwhile, meritocracy — the idea that social and professional status are the direct outcomes of individual intelligence, virtue, and hard work — convinces isolated individuals that failure to ascend is a sign of inherent worthlessness.\nNeoliberal meritocracy, the authors suggest, has created a cutthroat environment in which every person is their own brand ambassador, the sole spokesman for their product (themselves) and broker of their own labor, in an endless sea of competition. As Curran and Hall observe, this state of affairs “places a strong need to strive, perform, and achieve at the center of modern life,” far more so than in previous generations.\nThey cite data showing that young people today are less interested in engaging in group activities for fun, attending instead to individual endeavors that make them feel productive or fill them with a sense of achievement. When the world is demanding that you prove yourself worthy at every turn, and you can’t shake the suspicion that the respect of your peers is highly conditional, hanging out with friends can seem less compelling than staying in to meticulously curate your social media profiles.\nOne consequence of this rise in perfectionism, Curran and Hall argue, has been a series of epidemics of serious mental illness. Perfectionism is highly correlated with anxiety, eating disorders, depression, and suicidal thoughts. The constant compulsion to be perfect, and the inevitable impossibility of the task, exacerbate mental-illness symptoms in people who are already vulnerable. Even young people without diagnosable mental illnesses tend to feel bad more often, since heightened other-oriented perfectionism creates a group climate of hostility, suspicion, and dismissiveness — in which the jury is always out on everyone, pending group appraisal — and socially prescribed perfectionism involves an acute recognition of that alienation. In short, the repercussions of rising perfectionism range from emotionally painful to literally deadly.\nAnd there’s one other repercussion of rising perfectionism: it makes it hard to build solidarity, which is the very thing we need in order to resist the onslaught of neoliberalism. Without healthy self-perceptions we can’t have robust relationships, and without robust relationships we can’t come together in the numbers it would take to rattle, much less upend, the whole political-economic order.\nIt’s not hard to see parallels between the three dimensions of perfectionism and so-called “call-out culture,” lately the hegemonic tendency on the Left: a condition in which everyone watches everyone else for a fatal slip-up, holding themselves to impossibly high standards of virtuous self-effacement, and being paralyzed with the secret (again, not unfounded) fear that they’re disposable to the group, that their judgment day is around the corner. The pattern is of a piece with other manifestations of neoliberal meritocratic perfectionism, from college admissions to obsessive Instagram curation. And because it divides rather than unites us, it’s no way to build a movement that ostensibly seeks to strike at the heart of power.\nPerfectionism makes us scornful of each other, afraid of each other, and unsure of ourselves at best. It prohibits the types of solidaristic bonds and collective action necessary to take on neoliberal capitalism, the very thing that generates it. The only possible antidote to atomizing, alienating perfectionism to reject absolute individualism and reintroduce collective values back into our society. It’s a gargantuan task — but with the vise-grip of neoliberalism tightening on our psyches, it’s the only way forward.", "url": "https://www.jacobinmag.com/2018/01/under-neoliberalism-you-can-be-your-own-tyrannical-boss"}