{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:25:06", "date_modify": "2020-05-04 20:25:06", "date_publish": "2018-03-15 12:03:57", "description": "ANDOVER -- One tow truck operator was killed and another was injured late Wednesday night when, towing a vehicle that had been involved in an earlier crash, two additional cars crashed into the...", "filename": "_3f4405c3f29f42cab25c1ce1b5cad1af_1588623906.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3f4405c3f29f42cab25c1ce1b5cad1af_1588623906.html", "title": "Tow Truck Driver Killed in I-495 Crash", "title_page": "Tow Truck Driver Killed in I-495 Crash", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ANDOVER -- One tow truck operator was killed and another was injured late Wednesday night when, towing a vehicle that had been involved in an earlier crash, two additional cars crashed into the scene on Interstate 495, police said.\nShortly before 11 p.m. Wednesday, police and a tow truck were on the scene of a two-vehicle crash that had occurred without injury on the southbound side of 495, just south of Interstate 93. The two operators of the truck were attempting to load one of the vehicles involved onto the flatbed.\nOne two truck operator, a 41-year-old North Andover man, was standing to the left side of his truck in the breakdown lane, while the other, a 44-year-old Lawrence man, was standing on top of the flatbed when another crash occurred, police said in a press release.\nA 2007 Pontiac G6 traveling southbound collided with an unoccupied BMW that had been in the breakdown lane, then struck the left side of the tow truck and the operator who was standing next to it, police said. The Pontiac came to a stop disabled in the right lane of travel, and then it was struck by a 2011 Hyundai Santa Fe that had been driving in that lane past the initial crash scene.\nThe North Andover operator was standing outside his truck when he was hit by the Pontiac, police said. He was transported to Lowell General Hospital’s Saints Campus, where he was pronounced dead.\nThe Lawrence operator fell off the roof of the flatbed due to the crash and sustained minor injuries. He was transported to Lowell General Hospital for treatment.\nThe driver of the Pontiac, a 28-year-old Lawrence woman, sustained serious injuries in the crash and was also transported to Lowell General Hospital. The 26-year-old Lawrence woman driving the Hyundai was not injured.\nPolice did not identify any of the people involved in the crash by name. No charges have been filed at this time, but the incident remains under investigation by state police and the Essex County District Attorney’s office.", "url": "https://apnews.com/3f4405c3f29f42cab25c1ce1b5cad1af"}