{"authors": ["Amanda Cuda"], "date_download": "2020-05-04 20:08:43", "date_modify": "2020-05-04 20:08:43", "date_publish": "2018-09-15 04:00:00", "description": "Pregnancy is like a magnifying glass in that it can significantly amplify issues that already exist in a woman’s body. That’s according to Dr. William Cusick, chairman of obstetrics and...", "filename": "_ceb7221e236f4937a6760dfc50d160b0_1588622923.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ceb7221e236f4937a6760dfc50d160b0_1588622923.html", "title": "High blood sugar in pregnancy takes toll", "title_page": "High blood sugar in pregnancy takes toll", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pregnancy is like a magnifying glass in that it can significantly amplify issues that already exist in a woman’s body.\nThat’s according to Dr. William Cusick, chairman of obstetrics and gynecology at St. Vincent’s Medical Center in Bridgeport.\n“Pregnancy is sort of like a stress test,” said Cusick, who is also obstetrics director for the Western Connecticut Health Network, which includes Danbury, Norwalk and New Milford hospitals.\nFor instance, women who didn’t already have diabetes sometimes develop it temporarily during pregnancy because their body isn’t making enough insulin.\nCalled gestational diabetes, it occurs in 2 to 10 percent of pregnancies, and is more common in women with certain risk factors, such as a family history, being overweight. It can lead to health concerns for both mothers and their babies, including premature birth and higher than average birth weight.\nBut even mothers whose blood sugar doesn’t quite spike high enough to meet the traditional definition of gestational diabetes can see long-term health implications for themselves and their children.\nNew research from the National Institutes of Health shows that women with elevated blood glucose levels were more likely to develop type 2 diabetes a decade after pregnancy, and that their children were significantly more likely to be obese.\nThis isn’t shocking to local health experts, including Dr. Bismruta Misra, division director of endocrinology for Stamford Health, which includes Stamford Hospital. She said because of concerns about the long-term impact of high blood sugar on pregnant women and their babies, the definition of gestational diabetes is constantly changing.\n“The criteria for diagnosing gestational diabetes gets stricter and stricter,” Misra said. “I would say every 10 years, we get information saying the cut-off for diagnosing gestational diabetes is different.”\nLong-term effects\nThe NIH study, published Tuesday in the Journal of the American Medical Association, followed up on a study, done roughly 10 years ago, that found that even slight elevated blood glucose levels increased the risks of complications for the baby — including abnormally large body size — both before and shortly after birth.\nBased on that earlier research, some professional organizations adopted new standards for diagnosing gestational diabetes. But not everyone adopted those standards.\nThe new study, which was mainly funded by the NIH’s National Institute of Diabetes and Digestive and Kidney Diseases, followed mothers and their children 10 to 14 years after the children were born. The researchers looked at the long-term effects of blood glucose levels in mothers who would have met the new definition of gestational diabetes, compared with those who did not.\nResearchers examined 4,697 mothers, none of whom were diagnosed for gestational diabetes during pregnancy. They found that, among women with elevated blood glucose during pregnancy, nearly 11 percent had type 2 diabetes at a follow-up visit 10 to 14 years after childbirth and about 42 percent had prediabetes.\nBy comparison, only 2 percent the women who didn’t have elevated blood glucose during pregnancy developed type 2 diabetes a decade or so down the road, and about 18 percent had prediabetes.\nThe researchers also analyzed 4,832 children for overweight and obesity, and found that 19 percent of children born to a mother with elevated glucose levels were obese, compared to 10 percent for children of mothers with normal glucose.\n‘Shine a light’\nCusick said the results of the study didn’t surprise him. “It’s understandable, from what we know about gestational diabetes and blood sugar,” he said.\nHe hoped the research will “shine a light on the importance of doctors” talking to their patients about the risks of high blood glucose and gestational diabetes, and the importance of good diet, healthy weight and other lifestyle choices.\nThat is important, agreed Barbara Linder, program director the Division of Diabetes, Endocrinology, and Metabolic Diseases for the National Institute of Diabetes and Digestive Kidney Diseases.\nLinder was a project scientist on the study, and said it shows not just that more organizations should probably be adopting those new standards for gestational diabetes, but that more needs to be done to control blood sugar levels in pregnant women.\n“It’s very important for physicians to speak to women who are trying to become pregnant, and help them to becoming as healthy as possible before getting pregnant,” she said.\nOnce women become pregnant, Linder said, their obstetricians need to work with them to control weight gain, which can drive up blood sugar levels, and increase the risk for gestational diabetes.\nLinder said the next step is embark on more studies, looking at what actions can be taken — before, during, and after pregnancy — to control diabetes and weight gain.\n“We need interventional studies to look at mitigation” of these problems,” she said.", "url": "https://apnews.com/ceb7221e236f4937a6760dfc50d160b0"}