{"authors": ["Theo Lawson"], "date_download": "2020-05-04 20:20:16", "date_modify": "2020-05-04 20:20:16", "date_publish": "2018-10-20 00:00:00", "description": "It’s inherently true that not all Top 25 teams are created equal. The gap between No. 1 and No. 5 can be significant, let alone the one between No. 1 and No. 25. But all ranked teams have done...", "filename": "_a65cb7bcc7ab4777bc9707fa175e1931_1588623616.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a65cb7bcc7ab4777bc9707fa175e1931_1588623616.html", "title": "The pick: Why Oregon will beat Washington State", "title_page": "The pick: Why Oregon will beat Washington State", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s inherently true that not all Top 25 teams are created equal. The gap between No. 1 and No. 5 can be significant, let alone the one between No. 1 and No. 25. But all ranked teams have done something to distinguish themselves to win one of those 25 coveted spots – and it’s always a challenge to beat them. The reason Oregon enters Saturday’s game bearing the nation’s No. 12 ranking? The Ducks knocked off one of those Top 25 teams three weeks ago, slamming then-No. 25 Cal 42-24, then followed their off week by stunning another, then-No. 7 Washington, 30-27 in overtime in Eugene. Had Oregon slipped past then-No. 7 Stanford on Sept. 22, its string of consecutive wins vs. ranked teams would’ve been at three games, with a chance of reaching four against the new No. 25, Washington State. That would’ve given the historians and trend researchers quite the assignment next week. So while the Ducks won’t have a chance to run off four straight wins vs. Top 25 teams, I like the odds of them reaching three. Justin Herbert’s prolific arm and WSU’s putrid record (1-5) after a bye week under Mike Leach create a problematic scenario for the Cougars, who haven’t seen the Oregon QB at his best and haven’t seen a Ducks team with this much confidence since 2014. There’s a fourth consecutive bowl bid on WSU’s horizon, but the Cougars will have to wait at least another week to grab it.\nThe pick: Oregon 35, Washington State 31.", "url": "https://apnews.com/a65cb7bcc7ab4777bc9707fa175e1931"}