{"authors": ["Sam Pimper Spimper Columbustelegram.Com"], "date_download": "2020-05-04 20:26:52", "date_modify": "2020-05-04 20:26:52", "date_publish": "2018-04-11 19:54:00", "description": "LINCOLN – Nebraska Attorney General Doug Peterson on Tuesday was joined by 59 high school juniors from across 40 Nebraska communities for the 2018 Attorney General’s Youth Conference held at the...", "filename": "_83cd377944104c2290f6ed71bc18971b_1588624012.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_83cd377944104c2290f6ed71bc18971b_1588624012.html", "title": "CHS junior represents peers at Attorney General's Youth Conference", "title_page": "CHS junior represents peers at Attorney General's Youth Conference", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN – Nebraska Attorney General Doug Peterson on Tuesday was joined by 59 high school juniors from across 40 Nebraska communities for the 2018 Attorney General’s Youth Conference held at the Nebraska State Capitol.\nRepresenting the Platte County area at the conference was Columbus High School junior Aerial Frey, alongside her father, Jon Frey, assistant principal at CHS.\nFrey and her cohorts were selected from across the state representing numerous high schools and communities. Applicants submitted a brief resume of activities, a short essay about their favorite Constitutional Amendment, and personal recommendations, released information says.\n“Aerial has shown recent interest in public policy and policy making, so when the opportunity to apply for the Youth Conference came along it was something that made a lot of sense,” Frey said. “She was actually approached about doing it by either a counselor of staff member – she was referred to do it.”\nEvents of the day included remarks from Attorney General Peterson, lunch at the Governor’s residence and a visit with Lt. Governor Mike Foley. In addition, participants heard messages from Nebraska Supreme Court Justice Stephanie Stacy and District 25 Sen. Suzanne Geist, representing Lincoln.\nStudents engaged in a mock bill debate and oral arguments. They received an overview of the attorney general’s office featuring a panel discussion by the Bureau Chiefs from the attorney general’s office and exploration of issues of consumer protection and online safety hosted by Ryan Sothan, outreach coordinator for the attorney general’s office.\nFrey said that students having the opportunity to immerse themselves into the legislative process was incredibly beneficial.\n“It gave her (Aerial) the chance to take part in some honest to goodness debates and discussions on national topics like gun control, drug and immigration policies,” he said. “These are things they (students) hear a lot about but not from legislators who are on the front line.”\nStudents had the option to sit back and listen to the debate or directly involve themselves in the conversations taking place. Frey said that he’s a former government and history instructor, as well as a speech and debate coach, so the afternoon was quite exciting for him.\n“It was all pretty near and dear to my heart,” Frey said.\nPeterson thanked students for their attentiveness and participation throughout the course of the afternoon.\n“Today, I had the opportunity to be with 59 very bright high school juniors from around Nebraska,” Peterson said through a released statement. “It was encouraging to engage them in several important issues in our state. I trust they learned more about our great state and how they might serve in the future.”\nWhile Frey was in attendance at the Youth Conference in a professional capacity, it was a lot of fun spending time with his daughter.\n“That was the best part of it,” he said. “We had a very nice discussion on the ride home about what she observed and learned. She also is representing Columbus (high school) at Girls’ State in the summer, so this was a really nice precursor to that.”", "url": "https://apnews.com/83cd377944104c2290f6ed71bc18971b"}