{"authors": ["Mitchell Ferman", "Staff Writer"], "date_download": "2020-05-04 21:06:08", "date_modify": "2020-05-04 21:06:08", "date_publish": "2018-11-28 15:45:00", "description": "Inter National Bank and Vantage Bank Texas have completed their merger, a move that will strengthen the control of one family’s banking assets along the U.S.-Mexico border. The...", "filename": "_788237ac89df49e1b161a9c3e7d42bcc_1588626368.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_788237ac89df49e1b161a9c3e7d42bcc_1588626368.html", "title": "Inter National Bank completes merger with Vantage Bank", "title_page": "Inter National Bank completes merger with Vantage Bank", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Inter National Bank and Vantage Bank Texas have completed their merger, a move that will strengthen the control of one family’s banking assets along the U.S.-Mexico border.\nThe consolidation, which will operate under Vantage Bank Texas, will create a community bank with $1.9 billion in total assets. The merger will create “substantial value for all of our customers and employees,” Jim Collins, trustee of the Collins Family Trust, said in a statement.\nCollins began this process two years ago, when he publicly began the acquisition of INB from Banorte, one of Mexico’s largest and oldest financial institutions with more than 1,200 branches and 2,700 employees. That transaction was complete in the beginning of 2017.\nINB has more than 15 branches in Texas, mostly in the Rio Grande Valley, as well as Laredo and El Paso. Collins helped establish INB in 1985 with a group of McAllen businessmen before selling a majority of his investment (70 percent) in 2006 to Banorte. The rest was sold to Banorte in 2009.\nThe Collins family has also been heavily invested in Vantage Bank, which is based in San Antonio and has branches across South Texas.\nPaul Moxley, who used to be with Texas State Bank and is now CEO of Texas Regional Bank, was optimistic in 2017 about the prospect of INB and Vantage Bank merging.\n“The Rio Grande Valley will always be built on the smaller community banks,” Moxley said in an April 2017 interview. “Without knowing the Collins’ plan as to what will happen, if we were to have a merger of two larger banks in the Valley, I think it’d be a good thing for the region.”\nThe combined operation is expected to have a total of 24 branches.\nmferman@themonitor.com", "url": "https://apnews.com/788237ac89df49e1b161a9c3e7d42bcc"}