{"authors": ["Jessie Van Berkel"], "date_download": "2020-05-04 20:18:33", "date_modify": "2020-05-04 20:18:33", "date_publish": "2018-03-20 16:48:47", "description": "A couple of business groups and the state teachers union spent the most money lobbying lawmakers last year but the organization that shelled out the largest sum to influence Minnesota government...", "filename": "_4a570318e3cd4ade8bfff069682251e1_1588623513.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4a570318e3cd4ade8bfff069682251e1_1588623513.html", "title": "Enbridge tops among $74 million spent to lobby policymakers, Public Utilities Commission", "title_page": "Enbridge tops among $74 million spent to lobby policymakers, Public Utilities Commission", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A couple of business groups and the state teachers union spent the most money lobbying lawmakers last year but the organization that shelled out the largest sum to influence Minnesota government officials in 2017 was not focused on the Legislature.\nEnbridge Energy Partners dwarfed the usual big spenders by doling out $5.3 million, nearly all of which was used to influence the Minnesota Public Utilities Commission, according to data released Tuesday. The utilities commission is weighing whether to approve Enbridges proposal to replace its Line 3 crude oil pipeline across northern Minnesota. The millions paid, in part, for legal support and weeks of evidentiary hearings during the Line 3 regulatory process, Enbridge spokeswoman Shannon Gustafson said.\nSpecial interest groups, representing everything from restaurants to realtors to private colleges, spent a total of $74 million to lobby state and local officials last year, according to the Campaign Finance and Public Disclosure Board. Of that, $10 million was used to influence the Public Utilities Commission. Its the most ever reported for lobbying the commission.\nThe Minnesota Chamber of Commerce spent nearly $2.2 million, the second most behind Enbridge. The Minnesota Business Partnership, which represents large state-based corporations, and the teachers union Education Minnesota trailed those groups, each spending roughly $1.4 million on lobbying.\nWe work tirelessly for our members to enhance their ability to succeed, stay, and grow in Minnesota, Chamber of Commerce Senior Vice President Laura Bordelon said in a statement. That includes lobbying the Legislature, state agencies and the Public Utilities Commission to promote responsible, pro-business policies that create jobs and grow the economy for the long-term.\nThe Minnesota Business Partnership focused on three main areas during the last legislative session: creating an environment where jobs can grow by cutting taxes on businesses, closing the gap in education outcomes between white students and students of color, and improving transportation and road infrastructure, said Executive Director Charlie Weaver, one of the organizations four lobbyists.\nTaxes remain at the forefront for everybody at the Capitol, Weaver said of the current legislative session. Republican legislators and DFL Gov. Mark Dayton are at loggerheads over how to alter Minnesotas tax code in response to federal tax changes. And lobbyists from groups like the Minnesota Business Partnership will be giving their opinion.\nEducation Minnesota, which represents teachers and other school staff, made one of the most dramatic spending increases of any group from 2016 to 2017. Their lobbying dollars, paid for by union membership dues, grew from $440,000 to about $1.4 million. The groups spending tends to be higher in odd years, when the governor and Legislature set the two-year state budget.\nRepublicans, who had previously controlled just the House, also took the majority in the Senate in 2017. Education Minnesota President Denise Specht said the GOP came in with bills the union opposed. Much of the lobbying money was spent on television and radio advertisements to oppose school vouchers and support licensing prekindergarten teachers and general funding for education, she said.\nWe needed to defend public education and the funding that goes into public schools. We were facing the weakening of licensing standards for teachers, Specht said. We really had to fight last year.\nCenterPoint Energy, the states largest gas utility, was another group that significantly increased spending at the Capitol, from less than $500,000 in 2016 to nearly $1.3 million last year. The bulk of the cash went to influencing the Public Utilities Commission, which regulates the utilitys rates. CenterPoint spokeswoman Becca Virden said the increase was tied to the companys request in August to hike its rates.\nThe lobbying efforts from businesses seeking a rate increase or pipeline replacement is just one piece of what the commission considers, along with public input and information from other state agencies, said Dan Wolf, executive secretary for the Public Utilities Commission.\nThe commission makes its decision based on the entire record before it, Wolf said.\nWhile overall spending related to the Public Utilities Commission grew in 2017, the total spent to influence legislators, metro government and administrative agencies was about $64 million on par with average total expenditures over the past decade. Along with the organizations representing businesses, teachers and utilities, local government and health care groups also put a lot of money toward influencing policymakers.\nThe League of Minnesota Cities and Coalition of Greater Minnesota Cities each spent more than $650,000 on lobbying efforts, and the spending of various health care and hospital groups totaled several million dollars.\nJessie Van Berkel 651-925-5044", "url": "https://apnews.com/4a570318e3cd4ade8bfff069682251e1"}