{"authors": ["Amy Edelen"], "date_download": "2020-05-04 21:06:11", "date_modify": "2020-05-04 21:06:11", "date_publish": "2018-10-01 00:00:00", "description": "Dairy groups in Washington state are encouraged by the Trump administration’s new North American trade deal announced Monday and what they see as its potential to create additional market access...", "filename": "_656a61796021445695b53b0cdbe7ba6e_1588626371.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_656a61796021445695b53b0cdbe7ba6e_1588626371.html", "title": "Washington dairy interests optimistic in wake of new trade agreement", "title_page": "Washington dairy interests optimistic in wake of new trade agreement", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dairy groups in Washington state are encouraged by the Trump administration’s new North American trade deal announced Monday and what they see as its potential to create additional market access for dairy farmers.\nThe United States-Mexico-Canada Agreement, or USMCA, as it relates to Canada is largely identical to the North American Free Trade Agreement that it would replace, but it includes provisions for the auto and dairy industries.\nUnder the agreement, Canada would drop its Class 7 pricing system, in which that country prices milk ingredients such as powdered and skim milk at a lower cost than butter. It limited imports of those dairy products from the U.S. and drew criticism from President Donald Trump, who claimed it was “unfair.”\nJay Gordon, policy director at the Washington State Dairy Federation, said the new trade agreement would help resolve previous pricing uncertainty facing dairy farmers when tariffs were imposed earlier this year.\n“The effect of it was, you got this uncertainty in the market between buyers and sellers where they don’t know what the price of the product is going to be,” he said. “Those looming questions on what the tariff rates are will be resolved.”\nGordon said there could be a slight increase in market access to Canada for U.S. dairy products and the removal of that nation’s Class 7 system pricing could lessen impact on the U.S. and world markets.\nWashington has more than 450 dairy farms, with about 2,200 jobs created by of dairy exports.\nWashington dairy exports totaled $5.5 billion last year, with top markets in Mexico ($1.3 billion), Southeast Asia ($690 million), Canada ($636 million), China ($577 million) and South America ($291 million), according to a report by the U.S. Dairy Export Council.\n“Looking north, dairy trade with Canada was one of the most difficult and contentious negotiating issues to solve in the entire USMCA deal,” Stan Ryan, president and CEO of Seattle-based Dairgold, said in a statement. “Canada’s closed and supply-controlled system had embarked on a program that essentially dumped milk proteins on world markets and moved American dairy farming and processing jobs, along with thousands of additional high-quality jobs, from the U.S. to Canada.”\nThe USDA would also gain some limited access to Canadian dairy markets they had previously not been able to access, Ryan added.\nThe Washington Council on International Trade, which has advocated for modernizing NAFTA to enhance competitiveness of Washington in global markets, said in a statement it is looking forward to learning more about the new trade agreement and its potential.\nAccording to the WCIT, exports from Washington into Mexico have increased 700 percent and exports to Canada grew to 200 percent since NAFTA was implemented in 1994.\n“WCIT is encouraged that the administration has struck a deal with Canada and Mexico to revise the NAFTA. An integrated North American market, which this new USMCA continues, is critical to Washington state businesses, farmers, ranchers and workers,” WCIT President Lori Otto Punke said in a statement.\nThe new trade agreement includes provisions for 75 percent of auto components to be built in North America – with 40 percent to 45 percent made by laborers making at least $16 an hour.\nThe trade deal with Canada follows an agreement last month between the U.S. and Mexico, which eliminated some tariffs on goods traded between the two countries. The Trump administration set a Sept. 30 deadline for Canada to join the agreement, or tariffs would be placed on vehicles exported to the U.S.\nLeaders from all three countries must sign the USMCA,and Congress, as well as legislatures in Canada and Mexico have to approve it. As a result, implementation of the new trade agreement could take months.", "url": "https://apnews.com/656a61796021445695b53b0cdbe7ba6e"}