{"authors": ["Domenic Powell", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Susan J. Terrio", "Jordan Von Manalastas", "Daniel Denvir", "Walter J. Nicholls", "Nick Tabor"], "date_download": "2020-05-04 19:51:07", "date_modify": "2020-05-04 19:51:07", "date_publish": "2018-06-29 00:00:00", "description": null, "filename": "2018_06_abolish-ice-immigration-cbp-deportation_1588621867.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/06/29124045/GettyImages-978854812.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_06_abolish-ice-immigration-cbp-deportation_1588621867.html", "title": "How to Abolish ICE", "title_page": "How to Abolish ICE", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThanks to the nomination of Alexandria Ocasio-Cortez, it will become nearly impossible for Democrats to avoid taking a position on abolishing ICE. As the demand to abolish ICE grows louder however, we need to ask ourselves: how would we actually do it? The demand to abolish ICE has filled a void left by the Democrats, who thus far have failed to turn momentum from resistance to Trump’s immigration policies into a substantive agenda. While many Democrats have joined protests organized by grassroots immigrant rights groups and styled themselves as leaders of a resistance movement, they have still not articulated what a left-wing immigration policy looks like. In this moment, abolish ICE is the only demand that can be called anything like an alternative vision. Here’s how we can do it.\nA Real Immigration Agenda Despite what moderates may claim, the move from demanding the abolition of ICE to enacting it in policy is not insurmountable. Nor does the work of making it happen have to wait until Democrats take back power. The Republicans have never waited to make their demands known. Even when there was no chance of passing a bill, Republicans responded to every recent flash point with legislation that helps achieve their overarching goal to restrict immigration. When Trump first sensationalized the death of a young woman killed by an immigrant in San Francisco in 2015, Republicans responded with a wave of state and federal “anti-sanctuary” bills. Similarly, after the shootings in Paris a few months later, Republicans in both Congress and in state governments moved to halt refugee resettlement. Although most of these efforts failed, they still sent a message. Now having captured the presidency, they are taking those same ideas and turning them into policy. The Democrats, by contrast, have no similar overarching immigration agenda. Short on fundamentals, Democrats have repeatedly attempted to bring Republicans into negotiations over “comprehensive immigration reform,” based loosely on trading a legalization program for restrictions. A compromise bill has become the default Democratic goal rather than a tactic to achieve a list of demands. If the Democrats take back power in the near future, what policies they would propose remains unknown. Enter abolish ICE.\nWhy Abolition? Abolishing the agency reflects a broader goal of a far more humane immigration system, one in which immigrants aren’t thought of as a population to be policed and controlled by armed agents. Without ICE, children don’t suffer the trauma of their parents being taken away from them in the middle of the night. Without ICE, workers are freer to fight against wage theft and for a union because they don’t have to fear raids and deportation. Without ICE, asylum-seekers can find an attorney to help them stay in the country instead of navigating the system alone from the inside of a detention center. Democrats should support abolishing ICE simply for its raw politics: it materially improves the lives of immigrants, who are by and large a Democratic constituency. If Republicans can rob the welfare state and future generations for a $1.3 trillion giveaway to their super-rich donors, then Democrats should be willing to deliver for the people who could soon become Democratic voters. And while there are conservative voters who are mobilized by immigration restriction, mobilizing them to defend a government agency isn’t the same, particularly when the agency so frequently disgraces itself in the press. Since there will be no opportunity for Democrats to achieve a veto-proof majority before 2020, abolishing ICE will inevitably be a multi-year project. So, what can activists do now to erode ICE before we have a Congress that can abolish it for good? While they are still the minority, Democrats in Congress can demand concessions in appropriations bills that chip away at the agency. Fortunately, ICE recently announced the cancellation of a proposed contract to hire thousands of new agents. But why stop there when we could demand further shrinking the size of the agency? Whole programs like 287(g), which deputizes local law enforcement officers as ICE agents, are obvious contenders for the chopping block. ICE’s ability to hire contractors like Vigilant Solutions, which gives ICE vast access to databases and surveillance technology, should also be stripped away. ICE spends more than $2 billion annually on detention contracts with private prison corporations. That too, can be cut, but may also require eliminating the much-reviled “bed mandate,” which requires ICE to maintain 34,000 detention beds on any given day. By shrinking the budget for detention, we can move progressively toward a world without it.\nA Line in the Sand Even if attempts to shrink the agency don’t succeed in the short term, it is worth drawing a line and demanding that congressional Democrats say which side they are on. As more Democrats come to our side, abolishing ICE will inch toward becoming a reality. Some of the greatest gains toward abolishing ICE can be accomplished at the local level. While many cities have proclaimed themselves to be “sanctuaries” and refuse to hold people for ICE, there are still plenty of ways to strengthen these policies that reduce the overall number of deportations. Activists in Charlotte, North Carolina, delivered a critical blow to immigration enforcement in the state by electing a sheriff in a landslide who promised to end Mecklenburg County’s 287(g) program. Their victory was made even more incredible when you consider the county’s history with the program. Former sheriff Jim Pendergraph brought the 287(g) program to Mecklenburg County in 2006, and became such an enthusiastic supporter that he took a job with Homeland Security to promote the program nationwide. Charlotte’s efforts should be replicated in every city with a 287(g) program. Criminal justice reform efforts at the local level help reduce deportations. The fewer people who are in jail, the fewer people ICE is able to pick up. When anyone is booked in a local jail, their name, fingerprints, and other data is shared with federal agencies, including ICE. If people are given a citation or taken to a treatment program rather than jailed, less of that information is shared with the federal government, or even collected in the first place. Local law enforcement agencies are required to notify foreign governments of fifty-seven countries when they arrest their citizens. As a result, local police ask a person’s nation of origin when they are booked in jail. That information is then shared with ICE. Local police should adjust their booking practices to avoid unnecessarily collecting national origin information, depriving ICE of information on potential targets. States can do more to shut ICE out of important databases that they use to find targets for deportation. For example, ICE frequently uses Department of Motor Vehicle information to find out where people live, or even work with DMVs to set up fake appointments in order to apprehend them. Similarly, local probation and parole offices often voluntarily assist ICE by setting up check-ins and sharing information. According to a report from the University of California, Irvine, the Orange County Probation Department regularly referred juveniles in its care to ICE. While federal law prohibits local governments from refusing to share immigration status information, states are well within their power to restrict access to everything else. Activists can demand that local governments shred their intergovernmental services agreements, or IGSAs, in which local jails rent bed space to ICE. Jails with IGSAs are compensated at a fixed rate for allowing ICE to detain immigrants there, often before they are moved to a longer-term detention center. Aside from propping up the federal detention system, IGSAs create perverse incentives for local communities by investing them in deportation and mass incarceration. Jerome County, Idaho built a new jail larger than necessary specifically in order to lease it to ICE and other agencies. Eloy, Arizona, receives $438,000 per year from a detention contract in Dilley, Texas, between ICE and CoreCivic, a private prison corporation, simply by acting as a middle-man, using its IGSA. In Texas, ICE has used IGSA revenue to entice sheriffs into joining the 287(g) program. If we make detention more difficult locally, we place pressure on Congress to limit its use, or abolish it entirely. There is a countervailing concern with IGSAs that activists should consider: in some areas, the alternative to detaining immigrants locally — often closer to their attorneys and families—is to be in a detention center hundreds of miles away. Since shutting down an IGSA can have adverse effects for the people detained there who have a legal pathway to remaining in the country, activists should be careful to pursue these campaigns in consultation with immigrant community members and organizations.", "url": "https://www.jacobinmag.com/2018/06/abolish-ice-immigration-cbp-deportation"}