{"authors": [], "date_download": "2020-05-04 20:05:23", "date_modify": "2020-05-04 20:05:23", "date_publish": "2018-03-18 06:39:48", "description": "Robert Spekis School: Belle Vernon Sport: Swimming", "filename": "_2c8c6439c51f47058c276b1baefb78a6_1588622723.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2c8c6439c51f47058c276b1baefb78a6_1588622723.html", "title": "Belle Vernon's Robert Spekis, Franklin Regional's Abigail Ramey", "title_page": "Westmoreland athletes of the week: Belle Vernon's Robert Spekis, Franklin Regional's Abigail Ramey", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Robert Spekis\nSchool: Belle Vernon\nSport: Swimming\nClass: Junior\nClaim to fame: Spekis set a new WPIAL record in the 100-yard breaststroke after finishing first with a time of 57.80 seconds at the WPIAL Class AA championships last week at Trees Pool. Spekis also won the 200 IM (1:58.48) and was part of Belle Vernon’s 400-yard freestyle relay that finished second in 3:18.90. Spekis will participate in the PIAA championships March 16-17 at Bucknell.\n“I was very pleased. It’s a great time to just be down there with my team and other kids from the other teams. To do well there made it an overall great meet, especially with me being able to break the WPIAL record,” Spekis said.\nWhat does it mean to you to break the WPIAL record in the 100-yard breaststroke?\nIt’s pretty surreal. I went in hoping to get on the top of the podium. Having (Northgate’s) Nick (Madey) there to push me during the race helped me achieve to get that record. I guess anything is possible, and it happened.\nWhat’s your mindset heading into states?\nI’m very positive right now. Having those two great swims set me up well. Being able to take my teammates to states will get my excitement up for the other two events I’ll be swimming those days.\nWhat is your favorite stroke?\nBreast. It’s different than the other strokes. You’re going as fast you can with the other strokes. There’s a lot of timing and skill with the breast. If you mess up a stroke it can really mess up the rest of the race.\nWhat’s your earliest memory in the pool?\nWhenever I was younger, we would go on vacation to Florida. My dad would always time me when I would go 6 or 7 feet in the pool.\nWhat goes through your mind before a race?\nI tell myself to rely on my training because I know that’s what has gotten me to where I am right now. I need to execute, hit my turns and drive to the wall at the end.\nAbigail Ramey\nSchool: Franklin Regional\nSport: Swimming\nClass: Junior\nClaim to fame: Ramey finished fourth in the 200-yard individual medley with a time of 2:07.03 at the WPIAL Class AAA championships last week at Trees Pool. Ramey finished seventh in the 100 breaststroke (1:06.67) and was part of two relay teams — 200 freestyle (third place; 1:37.09) and 400 freestyle (fifth place; 3:35.66). Ramey will participate in the PIAA championships March 14-15 at Bucknell.\n“WPIALs are always a good time because everyone has a lot of energy. It’s electric. I was nervous leading up to it. I had to trust the hard work I put in,” Ramey said.\nWhat’s your mindset heading into states?\nI’m really excited for it because my 100 breast. I’m really excited about that event because I hope to drop more time in that. States is a different environment, and it’s fun to hang with all your friends.\nHow can you draw from your experience from states last year?\nThis year, I will have more experience, and I will know more of what to expect than some of the people going for their first time. It’s a lot of fun and we have a lot of fun. It’s hard to put into words. You have to experience it.\nHow did it feel to medal in four events at WPIALs?\nIt has been a goal of mine to get four medals. It’s a confidence booster for everything I have done and trusting the process of swimming. It feels good to know I can medal four times at WPIALs since it’s a fast meet.\nWhat is your favorite stroke?\nMy best event is the IM, and we use all of them. I don’t have a favorite stroke.\nWho is your favorite swimmer?\nElizabeth Beisel. I met her last summer, and I love her attitude towards swimming. She had to overcome obstacles, and that’s what swimming is all about. She was very inspiring to me.\n— Andrew John", "url": "https://apnews.com/2c8c6439c51f47058c276b1baefb78a6"}