{"authors": ["Andrea Zelinski"], "date_download": "2020-05-04 20:07:53", "date_modify": "2020-05-04 20:07:53", "date_publish": "2018-05-09 05:00:00", "description": "AUSTIN — Attorney General Ken Paxton is seeking to undo an appellate court’s decision to strike down Texas’ “revenge porn” law, arguing that the statute is clear that someone who didn’t know a...", "filename": "_b0d83a9321d6483d8869b1ea9f520322_1588622873.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b0d83a9321d6483d8869b1ea9f520322_1588622873.html", "title": "Texas defends ‘revenge porn’ law, wants appellate court to rehear case", "title_page": "Texas defends ‘revenge porn’ law, wants appellate court to rehear case", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "AUSTIN — Attorney General Ken Paxton is seeking to undo an appellate court’s decision to strike down Texas’ “revenge porn” law, arguing that the statute is clear that someone who didn’t know a sexually intimate photo was created in confidence cannot be held liable for sharing it.\nIn an amicus brief filed late Tuesday, the attorney general’s office argued the Tyler-based 12th Court of Appeals erred in its April ruling that found the law “extremely broad” and violating too many third parties’ free speech rights because it could apply to anyone who shares the material.\nThe law applies only to to those who had a duty to keep images private because of the circumstances under which the image was created or obtained demonstrated the victim’s reasonable expectation of privacy, according to the attorney general’s office. The court interpreted the statute too broadly and used too strict a standard in its ruling that lumps in people who share the images if they had no knowledge the picture person wanted it secret, according to the brief. The attorney general’s office is asking the court to rehear the case and affirm a lower court’s ruling.\nMORE: Texas ‘revenge porn’ law struck down by state appeals court\nAt issue are interpretations of two lines of Section 21.16(b) of the Texas Penal Code: “A person commits an office if: (1) without the effective consent of the depicted person, the person intentionally disclosed visual material depicting another person with the person’s intimate parts exposed or engaged in sexual conduct; (2) the visual material was obtained by the person or created under circumstances in which the depicted person had a reasonable expectation that the visual material would remain private.”\nThe decision stems from a revenge porn allegation against Jordan Bartlett Jones. He was accused of intentionally disclosing a photo that displayed a woman’s genitals and revealed her identity, although she had reasonable expectation the picture would stay private. He failed to convince a trial court the law was unconstitutional, but the East Texas appeals court agreed with him.\nMORE: GoDaddy.com among defendants in ‘revenge porn’ lawsuit\nThe 2015 law pertains to the sharing of visual material displaying a person’s intimate body parts or engaged in sexual contact. In order to trigger the law, the image much have been shared without the depicted person’s consent; been created or obtained with the depicted person having a reasonable expectation that the image would remain private, or if sharing the material revealed the depicted person’s identity and the disclosure caused them harm.\nThe “Relationship Privacy Act,” a bipartisan bill authored by two Houston state senators and a third from Laredo, passed unanimously in the Texas Legislature. Violation of the law is a Class A misdemeanor punishable by up to 1 year in jail and up to $4,000 in fines.\nRead the Court of Appeals ruling here.\nRead the attorney general’s amicus brief here.\nAndrea Zelinski covers politics for the Houston Chronicle. Follow her on Twitter and Facebook. Send her tips at andrea.zelinski@chron.com.", "url": "https://apnews.com/b0d83a9321d6483d8869b1ea9f520322"}