{"authors": ["Judy Newman", "Wisconsin State Journal"], "date_download": "2020-05-04 20:11:53", "date_modify": "2020-05-04 20:11:53", "date_publish": "2018-03-10 11:30:00", "description": "A Dane County judge has thrown out claims of conspiracy, fraud and racketeering against a former manager at Promega Corp. in connection with an alleged scheme by disgruntled shareholders to take...", "filename": "_469be752037b4d3c966a8a44cb519259_1588623113.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_469be752037b4d3c966a8a44cb519259_1588623113.html", "title": "Judge dismisses part of Promega counterclaims in lawsuit by disgruntled stockholders", "title_page": "Judge dismisses part of Promega counterclaims in lawsuit by disgruntled stockholders", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Dane County judge has thrown out claims of conspiracy, fraud and racketeering against a former manager at Promega Corp. in connection with an alleged scheme by disgruntled shareholders to take over the company.\nCircuit Court Judge Valerie Bailey-Rihn has dismissed counterclaims filed by Promega and CEO Bill Linton against Paul Shain — who was interim general manager of Promega’s North America operations from 2012 to 2014 and served as a board member for eight years. The judge said that nothing in the counterclaims shows Shain acted with malice or that his actions resulted in damage to the company.\nBut she dismissed the claims without prejudice, which means she left the door open for the attorneys for Promega and Linton to make another attempt to support their accusations by filing an amended complaint within 30 days.\nJudge Bailey-Rihn did not rule on the validity of the counterclaims against longtime stockholders Nathan Brand and Ted Kellner, also accused of conspiracy, fraud and racketeering as the alleged instigators of the plot.\nA group of rulings, in late February, is the latest development in a drawn-out legal battle that started when Brand and Kellner filed suit in 2016 against Promega, a Fitchburg biotechnology company, and Linton, the company’s founder.\nBrand and Kellner claimed Linton has refused to let them reap a fair return on their decades-long investment, and intimated that Linton wants to put control of the privately owned company in the hands of Usona Institute, a nonprofit he set up in 2014 to explore the use of hallucinogenic drugs to treat depression and anxiety.\nAttorneys for Linton and Promega responded with the counterclaims against Brand, Kellner and Shain, saying when their attempt to get the company to buy back their shares at inflated prices failed, the trio plotted to take over Promega, kick Linton out, set up Shain as CEO, and then sell the company within five years for a premium price.\nJudge Bailey-Rihn said, though, under a civil conspiracy claim, Linton has to prove that each person named in the conspiracy acted with malice against him. “There must be some factual allegations sufficient to plausibly show, in part, that harm was done for harm’s sake, and not for a legitimate business purpose,” she wrote.\nThe judge said the complaint alleges “very little about acts taken by Shain to cause ‘harm for harm’s sake.’” While Shain wrote emails and letters supporting the efforts of Brand and Kellner, his actions were meant to land the CEO position for himself, not to hurt Linton, she said.\n“Sharp practices, perhaps, but done with the underlying goal of personal financial gain, not malice, at least as the allegations stand now against Shain,” Bailey-Rihn wrote.\nThe rulings said a civil conspiracy requires showing damages, and Promega does not show that the conspiracy created tangible damages for the company. “Promega was not sold, nor were Shain’s shares purchased,” the judge said.\nShe also agreed to let Promega reimburse Shain for his legal fees.\nAn attorney for Shain declined to comment about Bailey-Rihn’s decisions. An attorney for Promega did not respond to questions about the possibility of filing amended claims.\nPromega, founded in 1978, has about 1,500 employees worldwide, including nearly 900 in Dane County, and tallied $386 million revenue in fiscal 2017.\nThe privately owned company makes 3,500 products for use in research, drug discovery and DNA identification, and has branches in 16 countries as well as a campus of multiple buildings in Fitchburg, valued by the city of Fitchburg at more than $125 million.\nNo trial date has been set yet.", "url": "https://apnews.com/469be752037b4d3c966a8a44cb519259"}