{"authors": ["Tim Stephensthe Herald-Dispatchtstephens Herald-Dispatch.Com"], "date_download": "2020-05-04 20:09:14", "date_modify": "2020-05-04 20:09:14", "date_publish": "2018-04-09 07:25:27", "description": "ONA — A saying in coaching is that you never want to be the man who follows the man. In other words, anyone trying to replace a legend likely is in for a rough time. In Cabell Midland High...", "filename": "_a6b5c78646924a41ae12f03cf5ce16f7_1588622954.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a6b5c78646924a41ae12f03cf5ce16f7_1588622954.html", "title": "Midland's Beckett has a tough act to follow", "title_page": "Midland's Beckett has a tough act to follow", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ONA — A saying in coaching is that you never want to be the man who follows the man.\nIn other words, anyone trying to replace a legend likely is in for a rough time. In Cabell Midland High School softball’s case, however, Herman Beckett is the man following the woman. Beckett, a longtime coach of various sports at several schools in Cabell County, took over the Knights program following Jeanne Lunsford’s retirement after last season. Lunsford, a former Milton High School and Marshall University star, was among the more successful coaches in West Virginia and the Tri-State.\nBeckett praised Lunsford for building the program and for the team’s 11-0 start this year.\n“She definitely didn’t leave the cupboard bare,” Beckett said. “She’s tough to follow.”\nBeckett said he likes what he sees from his team, which hopes to challenge defending state champion Hurricane for supremacy in Class AAA, Region IV.\n“We’re getting better,” Beckett said. “I’m having fun. A lot of fun. It only took me 40 years to get this job, I’d better have fun with it.”\nCabell Midland is busy this week. The Knights play at 6 p.m. Monday at St. Albans, entertain Huntington High for a doubleheader at 5:30 p.m. Tuesday, play host to Hurricane at 5:30 p.m. Wednesday, visit Hurricane at 5:30 p.m. Thursday, go to East Carter at 5 p.m. Friday and play Woodford County (Kentucky) at noon and Wheelersburg at 5 p.m. Saturday at East Carter.\nFRIDAY NIGHT TV LIGHTS: Marshall University’s home football game with Middle Tennessee was moved from Oct. 6, a Saturday, to Oct. 5, a Friday, to accommodate ESPN.\nThe change has some local football coaches unhappy.\n“This is the third time we have had a home game at Huntington and Marshall plays the same night,” Huntington High coach Billy Seals said. “Lost revenue for our program! It is not Marshall’s fault, but still makes it tough on local schools.”\nRECRUITING NEWS: Fairland basketball standout Isaiah Howell committed to Kentucky Christian University. He is scheduled to sign with the Knights on Wednesday, joining teammates Keedrick Cuningham (West Virginia State football), Ty Staten (Ohio Northern basketball) and Kol-\n“It only took me 40 years to get this job, I’d better have fun with it.”\nHerman Beckett\nCabell Midland’s new softball coach\nlin Van Horn (Cedarville basketball) as members of the Dragons’ starting five to sign to play college ball. The remaining starter, Luke Thomas, is mulling over several scholarship offers.\nHuntington St. Joe baseball pitcher Charlie White committed to WVU Tech. White, a standout left-hander, is scheduled to sign Wednesday.\nSpring Valley football junior running back/linebacker Owen Chafin visited Marshall University and Princeton University last week and attended Michigan State’s spring game Saturday. Chafin also has drawn attention from Old Dominion, Navy, West Virginia State and Bucknell, among others.\nCabell Midland basketball star Jovaun Light has visited Kentucky Christian University and has visits slated for West Virginia State, WVU Tech, Glen-ville State and the University of Charleston.\nHuntington High defensive end/tight end/punter Bryce Damous visited Elon University last week. Eastern-Meigs girls basketball player Elizabeth Collins signed to play at Siena Heights University, a NAIA school in Adrian, Michigan.\nDAWSON TRANSFERS: Former Huntington High School girls basketball star Jordyn Dawson has transferred from Xavier University to Wabash Valley Community College in Mount Carmel, Illinois.\nLast season as a freshman, Dawson averaged 0.8 points and 1.2 rebounds per game and appeared in 10 contests.\nWabash Valley features former Huntington High standout Dazha Congleton and Huntington St. Joe player lyesha Taylor on its roster.\nROUNDING UP: Spring Valley’s girls won the Chesapeake Lions Club Invitational track meet Saturday with 98 points, edging Huntington High, which finished with 96. The Highlanders won the boys side, with 129 points. Runner-up Rock Hill accumulated 100 points.... Huntington Highs Isaiah Carpenter kicked the longest field goal at the Pro-Kicker Camp at HHS last week. Carpenter booted a 50-yarder. Michael Hughes of George Washington was tops in kickoffs....\nFormer Huntington High basketball star O.J. Mayo signed with San German in Puerto Rico in hopes of making it back to the NBA.... Gallia Academy’s boys and girls won the Saunders Relays last week in Gallipolis, Ohio.... Symmes Valley’s Kara Saunders threw a softball no-hitter last week in the Vikings’ 17-0 victory over Sciotoville East.... Former Ironton High School softball star Breanna Klaiber was named freshman of the week in the East Coast Conference. Klaiber plays for Long Island-Post University. ... Former Wheelersburg High School standout runner Brooke Smith broke the Shawnee State University record in the women’s 1,500-meter run last week at the Raleigh Relays, finishing in 4:38.39....\nMussleman High School’s softball center fielder is named Haley Musselman.... Symmes Valley batters walked 20 times and pounded 12 hits Thursday in a 27-0 softball victory over Sciotoville East.\nTim Stephens is a reporter for The Herald-Dispatch. Call him at 304-526-2759. Follow him on Twitter @sportsturtlell.", "url": "https://apnews.com/a6b5c78646924a41ae12f03cf5ce16f7"}