{"authors": ["Mary Pickels"], "date_download": "2020-05-04 20:04:57", "date_modify": "2020-05-04 20:04:57", "date_publish": "2018-04-04 14:19:52", "description": "Downtown Pittsburgh workers and shoppers will have one fewer choice in lunch spots after Good Friday. Jim Mitchell, third generation owner of Mitchell's Restaurant and Bar, 304 Ross St.,...", "filename": "_ea1356c375ba40b2b9bb93334105c253_1588622697.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ea1356c375ba40b2b9bb93334105c253_1588622697.html", "title": "Downtown's ‘oldest restaurant' ending lunch service,Mitchell's bar and catering business will continue", "title_page": "Downtown's ‘oldest restaurant' ending lunch service,Mitchell's bar and catering business will continue", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Downtown Pittsburgh workers and shoppers will have one fewer choice in lunch spots after Good Friday.\nJim Mitchell, third generation owner of Mitchell’s Restaurant and Bar, 304 Ross St., says in a news release that what he calls “Pittsburgh’s oldest restaurant” will end lunch service on March 30.\nAccording to Mitchell, he intends to focus his energies on expanding his bar business and growing his established corporate catering business.\nFor 114 years, Mitchell says in a Facebook post, the restaurant has taken pride in serving “Downtown Pittsburgh good, home cooked lunches, with fast and friendly service, at a reasonable price.”\nIn the release, Mitchell does not elaborate on his decision to end the daytime meal service.\n“Although you may no longer come to my restaurant for a home cooked meal, you can still have it delivered to your office or special event center. I know many will miss my place for lunch. I will miss you all as well, but ‘It is time,’” he says in the post.\nDetails: 412-471-3663 or originalmitchells.com\nMary Pickels is a Tribune-Review staff writer. Reach her at 724-836-5401 or mpickels@tribweb.com or via Twitter @MaryPickels.", "url": "https://apnews.com/ea1356c375ba40b2b9bb93334105c253"}