{"authors": ["Chris Adamski"], "date_download": "2020-05-04 20:19:18", "date_modify": "2020-05-04 20:19:18", "date_publish": "2018-01-25 00:57:45", "description": "Will the 2018 Cleveland Browns have the feel of the '12 Steelers? They might on offense and special teams. The Browns on Wednesday announced the hiring of two-thirds of their coordinators:...", "filename": "_e795d37211b24ba29f4e406bc629df6a_1588623558.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e795d37211b24ba29f4e406bc629df6a_1588623558.html", "title": "Cleveland Browns add another ex-Steelers coach: Amos Jones", "title_page": "Cleveland Browns add another ex-Steelers coach: Amos Jones", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Will the 2018 Cleveland Browns have the feel of the ’12 Steelers? They might on offense and special teams.\nThe Browns on Wednesday announced the hiring of two-thirds of their coordinators: Todd Haley on offense and Amos Jones for special teams.\nHaley is well known in Pittsburgh because he spent six seasons with the Steelers in the high-profile position of offensive coordinator. The Steelers cut ties with him last week after Haley’s contract expired.\nBut most Steelers fans probably don’t remember Jones, who spent six seasons there after being an original member of Mike Tomlin’s first staff in 2007. Jones was special teams coordinator in 2012, his final season with the Steelers. That was Haley’s first season on Tomlin’s staff.\nIn the Browns’ official release to announce their three coaching hires Wednesday — Freddie Kitchens was named running backs/associate head coach — the team noted Jones was part of the Steelers’ Super Bowl teams in 2008 and 2010 (they beat Arizona in the former and lost to Green Bay in the latter) and that, in 2009, with Amos helping coach special team, the Steelers led the NFL with a franchise-record 1,581 return yards.\n“I got to know (Browns coach) Hue (Jackson) from coaching against him in the AFC North and have always admired his passion and knowledge of football,” Jones said in a statement. “I miss coaching in the AFC North, so getting back to this division is going to be very exciting for me. It’s obviously a highly competitive division where the margin for error is small, so you have to be extremely sound as a special teams unit. I think I have a pretty good feel for the Cleveland fans and look at this as a great opportunity to come in and help flip the organization. Working with John Dorsey is something I also look forward to as a special teams coach. His track record speaks for itself as a guy that knows how to put talent on a football team. As a special teams coach, it’s comforting to know the guy making those decisions about who is on your football team once had 35 special teams tackles in a season. I can’t wait to get to Cleveland to start working with the staff to help create a unit on special teams that will make a difference.”\nBrowns’ owner Jimmy Haslam also has ties to the Steelers. He was a minority partner in the team for a brief period before taking over in Cleveland.\nChris Adamski is a Tribune-Review staff writer. Reach him at cadamski@tribweb.com or via Twitter @C_AdamskiTrib.", "url": "https://apnews.com/e795d37211b24ba29f4e406bc629df6a"}