{"authors": ["Michael Fornabaio"], "date_download": "2020-05-04 20:04:41", "date_modify": "2020-05-04 20:04:41", "date_publish": "2018-11-24 04:02:09", "description": "BRIDGEPORT — Moments away from extending a run bordering on team history, the Bridgeport Sound Tigers lost their lead. Inches away from salvaging the point they’d lost, the puck hit iron and...", "filename": "_2773ba89d01b4db1b071540563353980_1588622681.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2773ba89d01b4db1b071540563353980_1588622681.html", "title": "SOUND TIGERS Hartford comes back again", "title_page": "SOUND TIGERS Hartford comes back again", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BRIDGEPORT — Moments away from extending a run bordering on team history, the Bridgeport Sound Tigers lost their lead.\nInches away from salvaging the point they’d lost, the puck hit iron and caromed away.\nThey could’ve done better. Their goalie kept it from being worse. The Sound Tigers’ seven-game home winning streak ended with a 3-2 shootout loss to the Hartford Wolf Pack on Friday at Webster Bank Arena.\nHartford cut a 2-0 Bridgeport lead in half with a goal on the third of their four consecutive power plays in the second period, then tied it with an extra attacker with 1:17 left.\n“They got the power plays, and obviously that shifts some games. As a team, we’ve got to be able to react to that,” Bridgeport co-captain Kyle Burroughs said. “It’s tough when it happens. We’ve got to level out. It’s tough right now to soak this one in.”\nVinni Lettieri, playing as if asking why the New York Rangers called up Tim Gettinger moments before warmup instead of him, scored both Hartford goals and got the only tally in the shootout.\nThe Wolf Pack outshot Bridgeport 10-4 in the second period, helped by the power plays but also picking up their even-strength game.\n“I thought they played hard,” Bridgeport coach Brent Thompson said. “They ended up winning one-on-one battles. We took some penalties, but they generated their own momentum by us not playing as hard as we need to.”\nThe teams meet again Saturday night in Hartford at 7:30.\nChristopher Gibson’s season-high 32 saves kept it from being more disastrous for Bridgeport than it turned out. He made saves through traffic as the Wolf Pack started coming at Bridgeport. He disrupted Hartford breakaways.\n“Gibby was great. I thought our goaltending was outstanding,” Thompson said. “For the most part the (defense) played hard. There are going to be mistakes. They’re going to happen, especially at this level. We’ve got to learn from them and move forward.”\nLettieri scored through Dawson Leedahl’s screen on a Hartford power play in the second period, then scored on a breakaway off John Gilmour’s lead pass to tie it.\n“It was just one of those where the guy’s got a lot of speed coming through the middle,” said Burroughs, a half-step behind Lettieri.\n“That moment of hesitation, he gets a little lane there. I hate to have that happen. Something I like to pride myself on is being out in the last two minutes and shutting it down.”\nSteve Bernier and Chris Bourque scored power-play goals for Bridgeport in the first period. Bernier’s set off the Teddy Bear Toss, as fans threw stuffed toys onto the ice to be given to children in need.\nGibson stopped a Lettieri breakaway in overtime. Mitch Vande Sompel hit a post behind Hartford goalie Dustin Tokarski soon after. Tokarski denied Scott Eansor on a pair of short-handed breakaways in the second period.\nBridgeport had won seven straight at home; there are only two longer streaks in team history, and none in the past 10 years. The Sound Tigers are 7-0-1-1 in the past nine here; the run began with an overtime loss to Rochester.\nBridgeport is 7-0-1-1 in its last nine overall as well. Both blemishes are Hartford wins in which the Pack came back to tie it late.\n“A 2-1 lead with a minute and a half left should be enough to win the hockey game,” Thompson said. “We’ve got to close the door.”\nAttendance was 5,066, largest of the 10 home games aside from the “Cool Fun 101” school-group morning game.\nmfornabaio@ctpost.com; http://twitter.com/fornabaioctp; http://blog.ctnews.com/fornabaio\nWOLF PACK 3, SOUND TIGERS 2 (SO)\nHartford0 1 1 0 1—3\nBridgeport2 0 0 0 0—2\nFirst Period — 1, Bridgeport, Bernier 7 (Bellows, St. Denis), 11:20 (pp). 2, Bridgeport, C.Bourque 5 (Aho, Sislo), 13:28 (pp). Penalties — Nieves, Hfd (hooking), 9:54; O’Gara, Hfd (interference), 12:53; Crawley, Hfd, major (fighting), 19:52; Jones, Bpt, major (fighting), 19:52.\nSecond Period — 3, Hartford, Lettieri 2 (Gilmour, Schneider), 15:16 (pp). Penalties — Nieves, Hfd (slashing), 1:18; Aho, Bpt, double minor (slashing, tripping), 9:08; Wotherspoon, Bpt (tripping), 15:10; Toews, Bpt (hooking), 15:43; St. Amant, Hfd (tripping), 19:06.\nThird Period — 4, Hartford, Lettieri 3 (Gilmour, Holland), 18:43. Penalties — Toews, Bpt (holding), 1:57; Holland, Hfd (hooking), 7:27. Hajek, Hfd (delay of game), 8:26; Vande Sompel, Bpt (hooking), 10:45; Hajek, Hfd (holding), 13:33.\nOvertime — No scoring. Penalties — None.\nShootout — Hartford, Holland NG, Lettieri G, Butler NG; Bridgeport, C.Bourque NG, Koivula NG, Vande Sompel NG.\nShots on goal — Hartford 10-10-9-5-1—35. Bridgeport 8-4-6-2-0—20.\nPower play opportunities — Hartford 1 of 6, Bridgeport 2 of 7.\nGoaltenders — Hartford, Tokarski 3-3-1 (20 shots-18 saves). Bridgeport, Gibson 6-3-2 (34-32).\nAttendance — 5,066. Referees — Labonte, O’Donnell. Linesmen — M.Baker, E.Ernst.", "url": "https://apnews.com/2773ba89d01b4db1b071540563353980"}