{"authors": ["Tim Benz"], "date_download": "2020-05-04 20:28:04", "date_modify": "2020-05-04 20:28:04", "date_publish": "2018-08-31 20:00:37", "description": "A mass shooting occurred Sunday in Jacksonville, Fla. It took place at a video game competition where gamers were playing the NFL EA Sports Madden '19 game. Three people, including the...", "filename": "_6929dd473e2145b2a290e00a02ec6321_1588624084.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6929dd473e2145b2a290e00a02ec6321_1588624084.html", "title": "Video emerges of gamer shooting in Florida; NFL, EA Sports react", "title_page": "Video emerges of gamer shooting in Florida; NFL, EA Sports react", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A mass shooting occurred Sunday in Jacksonville, Fla.\nIt took place at a video game competition where gamers were playing the NFL EA Sports Madden ’19 game.\nThree people, including the gunman, are dead. Reports have at least 11 others as being injured. The incident prompted this response from EA Sports.\nSteelers wide receiver Antonio Brown is on the cover of the game this year. The NFL issued a statement about the attack.\nThe Jacksonville Jaguars also commented in a press release.\nAccording to accounts from the Los Angeles Times, the shooter has been identified as “a player who had been defeated earlier in the tournament.” The suspect is David Katz, 24, of Baltimore. While on the national circuit of professional gamers, Katz played under other names, including “Bread” and “RavensChamp.”\nAccording to the Times story, the victims were identified as Elijah Clayton and Taylor Robertson. To those in the gaming community, they were known by screen names “Trueboy” and “Spotme.”\nThe competition was being streamed live at the time of the shooting. Video has emerged that shows the moment when the shots were fired. You can actually see a red dot appear on Clayton’s shirt a moment before the screen cuts back to a wide shot of the game.\nThe Times reports Clayton played high school football at Chaminade and Calabasas high schools.\nTim Benz is a Tribune-Review staff writer. You can contact Tim at tbenz@tribweb.com or via Twitter @TimBenzPGH.", "url": "https://apnews.com/6929dd473e2145b2a290e00a02ec6321"}