{"authors": ["Michael A. Mccarthy", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Mathieu Desan", "Shawn Gude", "Neal Meyer", "Luke Savage", "Tom Malleson"], "date_download": "2020-05-04 19:50:08", "date_modify": "2020-05-04 19:50:08", "date_publish": "2018-08-07 00:00:00", "description": null, "filename": "2018_08_democratic-socialism-social-democracy-nordic-countries_1588621808.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/08/07132627/GettyImages-1012583142-e1533663865661.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_08_democratic-socialism-social-democracy-nordic-countries_1588621808.html", "title": "Democratic Socialism Isn’t Social Democracy", "title_page": "Democratic Socialism Isn’t Social Democracy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe concept of “ democratic socialism ” is contested terrain, so there’s no better time than now to put forward ideas to clarify our long-term goals and short-term strategies. As Mathieu Desan and I recently argued in Jacobin, having a long-term vision that transcends capitalism and deepens democracy will help realize equality of opportunity and social solidarity — core principles that should guide any good society. Where do Nordic social democracies fit into the vision for democratic socialism? It’s an important question, one raised by Matt Bruenig in a response to our piece. He agrees that the Soviet Union was not a democracy, because the state was unaccountable to the people. But he says that that critique doesn’t apply to Nordic countries, which are parliamentary democracies. Thus, to draw a hard line between our vision of democratic socialism and actually existing social democracies like Norway is wrong. The point boils down to a simple question: do countries like Norway represent the limit of what we think a democratically run economy and society can look like? If they do, is social democracy the same thing as democratic socialism after all? My argument isn’t that the Nordic countries are undemocratic like the Soviet Union, but that even in the Nordic countries — where there is political democracy — democratic socialism would nonetheless mean a further democratization and public ownership of the economy than currently exists.\nDemocratic Socialism Isn’t Social Democracy The Nordic countries — Finland, Norway, and Sweden — are social democracies. They have constitutional representative democracies, extensive welfare benefits, corporatist collective bargaining between labor and capital that is managed by the state, and some state ownership of the economy. These institutions would be much preferable relative to the ones in our neoliberal wasteland. Yet even if labor is given a greater voice both at the workplace and in the management of the economy, capitalist control persists over the large majority of workplaces. In social democracies, public ownership of the main productive assets is limited in comparison to what it could be. Consider the strongest case, Norway. Bruenig emphasizes its public ownership by pointing out that the state owns seventy-four companies. This is no small matter: the state-owned enterprises (SOEs) in Norway account for nearly 60 percent of GDP . The majority is made up by Equinor, the state-owned oil company, which accounts for about 60 percent of the state’s shareholding (the state owns about 67 percent of its shares). In total, the SOEs, including the oil company, employ about 280,000 workers . But absolute numbers are always deceptive out of their context. There are about 2.8 million total employed workers in Norway. Just 10 percent of the employed workforce work in these state-owned enterprises. The public sector in general employs about 30 percent of the workforce, the highest proportion in the capitalist world. While this is surely a lot in comparison to other capitalist democracies, the Norwegian state still leaves the significant majority of workers working in capitalist firms for their survival. This is even more so the case in the other social democracies. Democratic socialism, on the other hand, should involve public ownership over the vast majority of the productive assets of society, the elimination of the fact that workers are forced into the labor market to work for those who privately own those productive assets, and stronger democratic institutions not just within the state but within workplaces and communities as well. Our characterization of democratic socialism represents a profound deepening of democracy in the economy. This distinction is crucial , but Bruenig seems to gloss over it. In doing so, he ignores what is actually at stake in this debate: why he thinks the relatively limited public ownership and economic democracy in social-democratic countries is either preferable or more feasible than something more extensive. This is not a matter of more short-term policy goals; many of the institutions of social democracy should be the core demands of socialists today. This concerns our long-term vision as socialists.\nSocial Democracy’s Limits At the heart of the limits of social democracy lays a problem that persists in all societies that rely heavily on capitalist firms for employment: what forms of power are most important? Even with a robust political democracy, power in societies with primarily capitalist economies is not exercised mainly through the parliament. Firms, in their simple ability to allocate their investments and resources, make private decisions with huge public implications. And this power undermines the institutions of representative democracy. Even in the best of formal democracies — perfectly free and fair elections — private firms will still have disproportionate influence over elected state officials who are under pressure to support policies that protect profit-making. But how could this happen if they are elected to office and accountable? Why, even in the social democracies, where owners of capitalist firms are a tiny minority of the electorate, do state bureaucrats defend profit? Because most people’s livelihoods are dependent, in large part, on firms, both the voters and politicians tend to favor policies with which business can be happy. But in the event that a socialist agenda is advanced, business has the power to disinvest. Slowing down the economy reduces state revenue through taxes, eliminates jobs, and typically ends with socialist politicians getting voted out of office , reversing course toward austerity , or being forcibly removed through a coup. The capitalist economy acts like an automatic punishing recoil on democratically elected state managers intent on installing socialist institutions for their constituencies. This is precisely why the Meidner wage-earner fund in Sweden , a project that would have transferred ownership of firms from capital to the public — something that Bruenig and I are both very fond of and would like to see realized in some form — ultimately failed to be fully installed. Although democratically supported, it threatened capitalists’ very existence and so was undermined by capitalist power. Even in the best of social democracies, the rapprochement between capitalism and democracy is an unstable one. Does Norway contain institutions that might counter capital strikes? If guided by socialist principles of investment, it appears that Norway’s sovereign wealth fund could offer a line of defense against this kind of business power. Founded in 1990 as a vehicle to invest surplus profits from the state’s oil company, by 2017 it had grown massively to 8,488 billion kroner. In a capital strike , assets could be reallocated to counter domestic job loss or disinvested from companies that are using their private power to counter socialist public policy. But the fund has never been used this way, and deep changes would need to be made for it to weaken domestic business power. Unlike Norway’s much smaller folketrygdfondet fund, their sovereign wealth fund is not primarily domestically invested. It is internationally invested to offset risk from more localized economic crises, owning on average 1.4 percent of every publicly listed company in the world. To its credit, it has taken an active role in disinvesting from some of the more pernicious products (tobacco, nuclear arms and cluster weapons, and coal) and uses shareholder voice often to try to change the practices of the world’s largest companies. But the fund is ultimately guided by the profit incentive and constrained by global capitalist competition. The monetary costs of taking these principled stances have been very small . If used as a bulwark against capitalist disinvestment, it would have to take on significantly more risk and potentially invest in ventures at a loss. The fund brings with it real benefits for Norwegian people, and it also offers real opportunities to contest capitalist logics of investment. But that it might make such a transition to democratic socialism more feasible is not evidence that Norway is already democratic socialist.", "url": "https://jacobinmag.com/2018/08/democratic-socialism-social-democracy-nordic-countries"}