{"authors": ["Liz Sawyer"], "date_download": "2020-05-04 20:12:15", "date_modify": "2020-05-04 20:12:15", "date_publish": "2018-04-29 15:02:19", "description": "A flurry of new apartments and suburban starter homes will help Shakopee alleviate a housing crunch and, city leaders hope, attract more young professionals to town. The Shakopee City...", "filename": "_379562269a1d4056b8f85f67a7bd7d4d_1588623135.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_379562269a1d4056b8f85f67a7bd7d4d_1588623135.html", "title": "Shakopee approves flurry of new housing projects", "title_page": "Shakopee approves flurry of new housing projects", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A flurry of new apartments and suburban starter homes will help Shakopee alleviate a housing crunch and, city leaders hope, attract more young professionals to town.\nThe Shakopee City Council recently approved an assortment of projects, including 158 single-family homes, a 60-unit affordable housing development and a gated luxury apartment complex near Canterbury Park. Seniors will soon have more options as well. Benedictine Health System plans to build 277 units for independent living and memory care along Marystown Road.\nTheres a lot of pent-up demand, said Michael Kerski, Shakopees director of planning and development. Its happening faster than any of us anticipated.\nOver the past 15 years alone, Shakopees population has doubled to 40,600 residents attracting major employers like Amazon, Shutterfly and Entrust Datacard but the city has been unable to keep pace with the growth, at least partly because no new apartments have been built there in over a dozen years.\nThats about to change. Around 1,100 housing units are slated to be built in Shakopee this year, Kerski said. But the market can support at least several hundred more.\nMost of the planned developments are clustered on the west side of town, south of Hwy. 169 and along Marystown Road.\nCommonBond Communities, a St. Paul-based nonprofit specializing in affordable housing, was approved to build a 60-unit apartment complex featuring amenities like a shared community room, computer lab and play area. The building will offer one-, two- and three-bedroom apartments with rents ranging from $800 to $1,100 a month.\nKayla Schuchman, CommonBond project manager, told the council this month that the operator is unique because it provides services such as job training and after-school tutoring for its tenants.\nWe quickly learned that the families we are serving have better outcomes if we can help serve other needs in their lives, Schuchman said.\nMayor Bill Mars expressed excitement about the project, called the Willows, saying that the city could benefit from the diversity in housing options.\nCouncil Member Matt Lehman, who has long opposed most high-density housing, was the lone dissenter. He blamed big government for jacking up housing rates with increased taxation.\nWindmere South, a development boasting 158 villa-style homes, will soon break ground just down the road from CommonBond. Those Freedom Model homes are marketed toward older adults who may not want the hassle of climbing stairs but still cherish independent living.\nBenedictine Health System received unanimous council approval to construct 145 independent-living units, 40 brownstones, 68 assisted-living and 24 memory-care units near St. Gertrudes Health and Rehabilitation Center in Shakopee. The proximity would allow residents to easily go back and forth to receive continued care.\nOur market study showed theres a pretty big demand for that, Kerski said.\nAcross town, Doran Cos. has partnered with Canterbury Park to build an upscale complex on the racetracks grounds.\nThe $400 million project will eventually include 596 apartments with amenities, about 100 units of owner-occupied townhouses and senior condominiums, and a boutique hotel.\nThe Doran apartments are the catalyst to attract other users, said Canterbury Park President Randy Sampson, who envisions a bustling hub of specialty retail shops, eateries and office space.\nOnce completed, Canterbury Commons will be the largest mixed-use development in the southwestern suburbs history.\nConstruction is slated to begin this fall.\nLiz Sawyer 612-673-4648", "url": "https://apnews.com/379562269a1d4056b8f85f67a7bd7d4d"}