{"authors": ["Tesla Mitchell"], "date_download": "2020-05-04 20:11:27", "date_modify": "2020-05-04 20:11:27", "date_publish": "2018-07-09 18:00:00", "description": "Whether you’re up for some renowned deli sandwiches or a protein-packed smoothie, or you need a local electrician, you’re in luck in Winona’s evolving business scene. A beloved Winona lunch...", "filename": "_4bde61e595f54ac09ed98b6bb98f15dc_1588623087.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4bde61e595f54ac09ed98b6bb98f15dc_1588623087.html", "title": "Beno's adds a new location; smoothie place opens", "title_page": "Winona business wrap: Beno's adds a new location; smoothie place opens", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Whether you’re up for some renowned deli sandwiches or a protein-packed smoothie, or you need a local electrician, you’re in luck in Winona’s evolving business scene.\nA beloved Winona lunch stop, Beno’s Deli, is adding a new location.\nBy Wednesday, owner Corinne Loomis said she expects to have a second deli, in the Winona Mall, fully up and running — in the same location that recently housed the Wine of the Bean and a Blooming Grounds secondary location.\nWith enthusiasm bubbling and a laugh behind every sentence, Loomis said she’s excited — and slightly terrified — to expand into a new location and is thrilled to put “a little Beno’s in everybody.”\nThere will be some new wrinkles in the new location, the biggest being extended hours. Beno’s in the mall will be open from 7 a.m. to 6 p.m.\n“That’s one of the biggest complaints I hear from people — that we’re not open longer,” Loomis said.\nBeno’s also will have everything packaged to go for quick lunches. Also, the existing drive-thru will stay open for pick-ups only for those who call ahead of time, and there will be some coffee options on the menu.\nIn the future, Loomis said, she hopes to add breakfast sandwiches and other menu options, but for now she’ll just concentrate on getting the basics down and working through the kinks that come with opening a new location.\n“We just hope the customers are a little patient with us for a little while,” Loomis said.\nLoomis is the third owner of Beno’s Deli in Winona. Loomis — who always dreamed of opening a deli — took over Beno’s in 2014 after a stranger, the previous owner, Penny Kropidlowski, randomly asked Loomis whether she was interested in owning a business. Nine months later Loomis signed the papers.\n“It’s been great,” she said excitedly. “Everyone needs a little Beno’s once in a while.”\nBeating the heat waves with protein-packed smoothies\nThere’s a new smoothie joint in town that’s offering up to 50 flavors of smoothies, including coconut cream pie, puppy chow, Fruity Pebble, Reese’s cheesecake and more.\nThe new business Wav Nutrition, in the same building as the Whistle Clean Laundromat on Huff Street, offers smoothies packed with 24 grams of protein at about 200 calories.\nThat’s because they’re made with Herbalife nutritional shake mixes , owner Paul Loxterman said, adding that he and his two partners are distributors for the global nutrition company.\nAlthough there’s other smoothies places in town, none offer the meal and nutrition supplement theirs does, Loxterman said.\n“There’s nothing like this around here,” Loxterman said.\nThe smoothies are for anytime of the day, but they also have ones that are specific for before, after and during workouts.\nLoxterman said he got into Herbalife after having horrible nutrition and feeling the effects.\n“I was terrible at nutrition,” he said laughed. “(I used to be) running out the door with a candy bar because that’s all I got time for.”\nHe slept all day and still felt tired, he said, and he never seemed to recover from his workout. Then he tried a smoothie. It wasn’t chalky like other protein smoothies, he said, and he decided to give it a try.\nHe’s gained significant muscle since the change — up to 50 pounds of muscle he estimates — and his sleep has improved by leaps and bounds.\n“It really did change my life around,” he said.\nThat’s why he and his partners decided to open the smoothie joint. Rather than selling people the Herbalife nutrition supplements, they decided to make the smoothies for them and let them try all the different flavors. The thought being that if someone wants to get more serious about adding the supplements into their life they can talk to them about it after trying a smoothie.\nThe smoothie joint opened in May and Loxterman said he’s glad they did it. Since it’s right next to the Winona State University campus and college students are one of their main targets, they’re glad to have the summer to work through any challenges that come up so when the students are back it flows nicely.\n“These taste great,” he said as he looked at the smoothie menu. “You actually feel like you’re cheating sometimes.”\nKish and Sons Electric bought by local man\nAn electrical contracting company in town has switched hands and names.\nKish and Sons Electric in Winona — a branch of a La Crosse company — was recently bought by Winona area resident Bruce Bunke, who worked for the company for nine years.\nAlthough the Winona branch has split from the larger company, Kish and Sons Electric in La Crosse is still up and running with the same owners. Only the Winona branch was bought.\n“They’re still in business and doing their thing in La Crosse,” Bunke said.\nThe new name for of Winona business will be Key Electric and Automation Inc., Bunke said.\nBut other than that, nothing else will change.\n“It’s pretty much business as always,” Bunke said.\nThe electrical contracting company does commercial, industrial and residential projects. With 18 employees and an owner who’s a master electrician, the company provides 24-hour service, Bunke said.\n“That’s a service we provide that not everybody does,” Bunke said. “Power loss, utility line going down, fuse trip, anything and everything.”\nBunke said he is looking forward keeping the same “key group of people” and offering quality service.\n“I’m super pumped,” he said. “It’s the kind of work I enjoy doing.”", "url": "https://apnews.com/4bde61e595f54ac09ed98b6bb98f15dc"}