{"authors": ["Rilyn Eischens"], "date_download": "2020-05-04 20:07:55", "date_modify": "2020-05-04 20:07:55", "date_publish": "2018-05-22 06:25:12", "description": "There have been just over 400 tornadoes recorded in Minnesota since 2010 four times more than during the 1950s. But this doesnt mean tornadoes are happening more often. Were just better at...", "filename": "_40285171a7bf42beac3bdb78e61a3004_1588622875.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_40285171a7bf42beac3bdb78e61a3004_1588622875.html", "title": "Minnesota on track for a record number of tornadoes this decade", "title_page": "Minnesota on track for a record number of tornadoes this decade", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "There have been just over 400 tornadoes recorded in Minnesota since 2010 four times more than during the 1950s.\nBut this doesnt mean tornadoes are happening more often. Were just better at spotting them, thanks to technological advances.\nStill, limited record-keeping in the early years of tornado tracking means experts dont have enough information to say whether climate change is influencing the frequency or strength of tornadoes, as has been documented with other dangerous weather like hurricanes.\nWith the changing climate, I think people really want to know whats going on with severe weather, whats going on with tornadoes Weve looked for trends, said Kenny Blumenfeld, senior climatologist with the Minnesota State Climatology Office. It just looks like what we call basic variability.\nThis decade is on track to have the most recorded tornadoes in Minnesota since tracking began, including a deadly tornado that ripped through North Minneapolis seven years ago this month. That tornado killed one person, injured 48 others and caused long-lasting social, physical and economic damage.\nThe advent of Doppler radar technology in the 1990s was one of the biggest advances in tornado tracking and record-keeping, said Patrick Marsh, a warning coordination meteorologist at the National Oceanic and Atmospheric Administration (NOAA).\nImproved technology means experts can anticipate tornadoes, send out warnings and watch to see if they happen, Blumenfeld said. Plus, more spotters are trained to identify tornadoes than in the mid-20th century, and the ubiquity of the camera phone means even the average citizen can document a twister.\nSince 1950, there have been 1,972 tornadoes recorded in Minnesota, injuring nearly 2,000 people and killing 99.\nThe most tornadoes recorded in a single year came in 2010, when 126 twisters swept the state, according to data from NOAA. Those data show the state averages about 29 tornadoes per year but that can fluctuate widely.\nDespite technological advances, scientists are still unsure of some of the finer details of tornado formation and have a hard time classifying and defining them, according to the NOAA.\nExperts do know that most develop from thunderstorms when vertical winds form rotating cylinders of air. The most destructive ones come from supercells rotating thunderstorms. And they happen most often during the summer months in Minnesota.\nThe data also show that high-wind, high-damage tornadoes are not happening more frequently. Since 2010, there havent been any tornadoes with estimated wind speeds exceeding 200 miles per hour in Minnesota. Back in the 1960s, there were 21.\nThe last big one in the state hit the western Minnesota city of Doran on August 7, 2010. It was classified as an EF4 -- four out of five on the Enhanced Fujita Scale, meaning wind speeds were between 166 and 200 miles per hour.\nThe big ones arent getting more frequent or worse in Minnesota, Blumenfled said. Thats also true nationally. Thats been borne out by the research.\nThe May 22, 2011, tornado that hit north Minneapolis was an EF1 (wind speeds between 86 and 110 miles per hour) but was part of a group of six twisters that struck the metro that day.\nSince then, 17 others have hit the seven-county metro area.\nPeople seem to have this belief that tornadoes avoid populated areas, Blumenfeld said. I dont know exactly where that comes from, but it has been shown time and time and time again that its false.\nThis idea is a statistical artifact based on population distribution, Marsh said. In most regions of the country, cities are few and far between, so tornadoes are statistically more likely to strike a rural area.\nBlumenfeld said urban populations are becoming increasingly vulnerable to tornadoes, though the storms arent necessarily more dangerous, and experts are better equipped to predict them.\nWe have a more diverse population. We have more economic disparity and we have lots and lots of different levels of access to information, Blumenfeld said. If you dont speak English, you already have really limited ways of getting information about a tornado thats bearing down on your community.\nAcross the United States, multi-tornado events, like the string of funnel clouds surrounding the 2011 north Minneapolis tornado, are happening more frequently.\nWere seeing fewer days with tornadoes, but when we have a day with tornadoes, were seeing more tornadoes on those days, Marsh said. Theres some speculation that it may have something to do with evolving climate.\nBut experts dont know how climate change has or might affect tornado occurrences. Sixty years of tornado records may seem comprehensive, but its insufficient in the context of a decades-long process like climate change, especially since tornadoes are so rare, Marsh said.\nPlus, tracking these trends is made more complicated by the fact that tornado record-keeping is error-prone or non-existent in much of the world, including the United States, according to the NOAA.\nMarsh said that while its important to track weather research, discussions about tornadoes need to move beyond the numbers.\nWhen we talk about [data], were talking in bulk. Were talking in aggregate. But what it comes down to is tornadoes are highly localized events, he said. When a tornado hits you, it is highly personal.\nRilyn Eischens is a University of Minnesota student on assignment for the Star Tribune.", "url": "https://apnews.com/40285171a7bf42beac3bdb78e61a3004"}