{"authors": ["Tony Paul", "The Detroit News"], "date_download": "2020-05-04 20:08:03", "date_modify": "2020-05-04 20:08:03", "date_publish": "2018-03-07 20:36:53", "description": "At one point early in the conference season, Eastern Michigan's men's team was 2-5 in Mid-American Conference play. At the halfway point, the Eagles were 3-6. Now, they're sitting...", "filename": "_b35d76347f1f4123b003e149d5ac073b_1588622883.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b35d76347f1f4123b003e149d5ac073b_1588622883.html", "title": "Patience pays off as Eastern Michigan surges into MAC tourney", "title_page": "Patience pays off as Eastern Michigan surges into MAC tourney", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "At one point early in the conference season, Eastern Michigan’s men’s team was 2-5 in Mid-American Conference play. At the halfway point, the Eagles were 3-6.\nNow, they’re sitting comfortably in Cleveland, having receiving an opening-round bye into the quarterfinals at Quicken Loans.\nWho would’ve thunk it?\nWell, actually, coach Rob Murphy, for one.\n“I’m not really scratching my head,” Murphy said this week, shortly after boarding the team bus for the trip to Ohio. “These guys had never played together in the MAC conference.\n“We had nine new faces, and two new staff members.\n“We needed to give ourselves a chance to collectively come together. And as we continued to let the season play out, we continued to get better.”\nEastern Michigan (20-11) won its last six regular-season games and eight of its last nine to earn the No. 3 seed in the tournament, and it will play No. 11 Akron (14-17) at 9 Thursday.\nMore: CMU women don’t want to leave anything to chance\nAkron is a stunning participant in Cleveland, after trailing at Western Michigan 18-0 and 27-4, before storming back to win, 79-78.\nNo. 8 Central Michigan (19-13) also made it to Cleveland, to meet top-seeded Buffalo (23-8) at noon Thursday, following the Chippewas’ 81-77 overtime victory over Bowling Green in Mount Pleasant on Monday.\nMurphy is in his seventh season in Ypsilanti — his contract was automatically extended through March 2020 after earning his 20th win of the season in the regular-season finale — and this might be his most talented team yet, even if it’s taken a while to get it together.\nThe Eagles are led by junior forward James Thompson IV (15.3 points, 11.5 rebounds), redshirt junior forward Elijah Minnie (16.8 points), redshirt junior point guard Paul Jackson (14.9 points) and senior guard Tim Bond, named Tuesday the MAC defensive player of the year.\nMore: CMU women, EMU men dominate MAC postseason awards\nMinnie (Robert Morris) and Jackson (Eastern Kentucky) were transfers, and sat out last season because of NCAA regulations.\nJackson, in particularly, was key, Murphy said — even if took time.\n“Everybody wants it immediately. They want the now,” Murphy said. “You have to understand how important it is to let it play out.\n“We had to explain to Paul Jackson, once he started to get others involved, then get himself involved, he will get better and will be better. He’s buying into being a playmaker.”\nThe Eagles are second-worst in the MAC in scoring offense (72.1 ppg), but that’s just fine, given they are the best team in the MAC in scoring defense (67.2). They limit opponents to 40.7 percent shooting, also best in the MAC, though they’re a little more vulnerable to opponents’ 3-point shooting (35.1 percent, seventh in the MAC).\nEastern Michigan also is the best team in the conference in blocks and steals, and is second in turnover margin.\nAs seen in the Horizon League tournament this week at Little Caesars Arena, defense tends to play a huge role this time of year. That’s what the Eagles are banking on, in searching for their first trip to the NCAA Tournament since 1998.\n“I give my staff a lot of credit, they continued to get our guys to buy in,” Murphy said. “The last nine games, we played one bad half of basketball.”\n\\\nMAC men’s tournament\nAt Quicken Loans Arena, Cleveland\nMonday\nCentral Michigan 81, Bowling Green 77 (OT)\nKent State 61, Northern Illinois 59\nMiami 68, Ohio 55\nAkron 79, Western Michigan 78\nThursday\nQuarterfinals\nGame 5: No. 1 Buffalo (23-8, 15-3) vs. No. 8 Central Michigan (19-13, 7-11), noon\nGame 6: No. 4 Ball State (19-12, 10-8) vs. No. 5 Kent State (16-16, 9-9), 2:30\nGame 7: No. 2 Toledo (21-10, 13-5) vs. No. 7 Miami (16-16, 8-10), 6:30\nGame 8: No. 3 Eastern Michigan (20-11, 11-7) vs. No. 11 Akron (14-17, 6-12), 9\nFriday\nSemifinals\nGame 5 winner vs. Game 6 winner, 6:30 (CBSSN)\nGame 7 winner vs. Game 8 winner, 9 (CBSSN)\nSaturday\nFinal\nSemifinal winners, 7 (ESPN2)\ntpaul@detroitnews.com\ntwitter.com/tonypaul1984", "url": "https://apnews.com/b35d76347f1f4123b003e149d5ac073b"}