{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:12:34", "date_modify": "2020-05-04 20:12:34", "date_publish": "2018-10-09 08:00:00", "description": "Blanch H. Layland December 9, 1928 - October 6, 2018 Blanch H. Layland passed away October 6, 2018 in Pocatello, Idaho. Blanch was born December 9, 1928 to Walter Leo and Elizabeth Howard in...", "filename": "_4c2b10f4e4e748baa5aca97950a46697_1588623154.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4c2b10f4e4e748baa5aca97950a46697_1588623154.html", "title": "Layland, Blanch H.", "title_page": "Layland, Blanch H.", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Blanch H. Layland December 9, 1928 - October 6, 2018 Blanch H. Layland passed away October 6, 2018 in Pocatello, Idaho. Blanch was born December 9, 1928 to Walter Leo and Elizabeth Howard in Ririe, Idaho. Blanch was raised in East Idaho calling many towns home as she grew up. She spent the last thirty years in Blackfoot, Idaho before moving to Pocatello shortly before she passed away. Blanch was the proud mother of 6 children who blessed her life with a great posterity. Daughter Dora (Darrel deceased) Saxton have 3 children, 9 grandchildren and 16 great-grandchildren; daughter Della (Walter deceased) King have 4 children, 9 grandchildren and 22 great-grandchildren; son Charles (Lois deceased) Payne had 1 child and 2 grandchildren; son Steven (Linda) Payne have 6 children, 11 grandchildren and 6 great-grandchildren, Lorraine Schmett (deceased) has 3 children (1 deceased) and 6 grandchildren; and son Walter Henery Payne (deceased). In total, Blanch had 17 grandchildren, 33 great-grandchildren and 44 great-great grandchildren. Blanch had several hobbies that included sewing, crocheting, knitting and playing cards, especially pinochle. Blanch was also a member of The Church of Jesus Christ of Latter-Day Saints and a member of Daughters of Utah Pioneers. Blanch is survived by two of her three sisters, and one of her three brothers. She was preceded in death by her parents; husband Ernie Layland; son Walter Payne; daughter Lorraine Schmett; grandson Bobby; brothers Lewis Howard and Grant Howard; and sister Ann Louise. A gathering will be held Wednesday October 10, 2018 from 6-7pm and a funeral service will be held Thursday October 11, 2018 at 11am, both at Wilks Funeral Home, 211 West Chubbuck Road. Burial will take place in Ririe-Shelton following the service. Condolences and memories may be shared with the family at www.wilksfuneralhome.com", "url": "https://apnews.com/4c2b10f4e4e748baa5aca97950a46697"}