{"authors": ["Antoine Dangerfield", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Martin Glaberman", "Eric Blanc", "Vivek Chibber", "An Interview With"], "date_download": "2020-05-04 19:59:47", "date_modify": "2020-05-04 19:59:47", "date_publish": "2018-08-03 00:00:00", "description": null, "filename": "2018_08_wildcat-strike-indianapolis-shut-down_1588622387.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/08/03102511/GettyImages-1684243621.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_08_wildcat-strike-indianapolis-shut-down_1588622387.html", "title": "“We Rise Together, Homie”", "title_page": "“We Rise Together, Homie”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Interview by Micah Uetricht\nUS labor history is full of moments of tremendous drama and upheaval. That history is riveting stuff, but getting a raw, unfiltered view of the human drama of workers fighting their bosses on the shop floor, the place where the day-to-day confrontation between workers and bosses takes place (and occasionally boils over), is rare.\nWhich is what makes Antoine Dangerfield’s recent viral video a must-watch. A thirty-year-old welder in Indianapolis, Dangerfield worked for a construction contractor building a UPS hub. On Tuesday, he says that a small number of Latino workers (millwrights, welders, and conveyor installers, in his telling) working for a different contractor but in the same hub were ordered home after disobeying the orders of a white boss he calls racist.\nIn response, the entire group of workers — over a hundred, in Dangerfield’s estimation — walked out.\nDangerfield caught their wildcat strike on camera at the moment they walked off the job. In his video, he is positively giddy watching them shut down their massive workplace.\n“They are not bullshitting!” he says as Latino workers walk off. Referring to the boss, he says, “They thought they was gonna play with these amigos, and they said, ‘aw yeah, we rise together, homie.’ And they leaving! And they not bullshitting!”\nAfter all the workers are gone, Dangerfield gives the viewer a tour of the empty hub. He’s incredulous: “Ain’t no grinding, cutting, welding — this motherfucker dead-ass quiet. The Mexicans shut this motherfucker down.”\nSince he posted the video on Wednesday, the footage has been viewed millions of times on Facebook (two million) and YouTube (nearly eight hundred thousand) and on sites like WorldStarHipHop (three hundred thousand). It also, as he explains in this interview, led to his firing. Dangerfield thinks it’s worth it, though.\nJacobin managing editor Micah Uetricht spoke with Dangerfield on Thursday afternoon. Neither could track down the striking workers in the video, but Dangerfield spoke about what was a “life-changing” experience for him. The interview has been edited for clarity and brevity.", "url": "https://www.jacobinmag.com/2018/08/wildcat-strike-indianapolis-shut-down"}