{"authors": [], "date_download": "2020-05-04 20:13:00", "date_modify": "2020-05-04 20:13:00", "date_publish": "2018-08-01 07:00:00", "description": "Colin Farrell and Mel Gibson have signed up to star in the revenge thriller 'War Pigs'. The 42-year-old actor and the 'Lethal Weapon' star have jumped on board the forthcoming project,...", "filename": "_2f5d82de0afd44e692796b8acd4df91b_1588623180.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2f5d82de0afd44e692796b8acd4df91b_1588623180.html", "title": "Colin Farrell and Mel Gibson sign up to War Pigs", "title_page": "Colin Farrell and Mel Gibson sign up to War Pigs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Colin Farrell and Mel Gibson have signed up to star in the revenge thriller ‘War Pigs’.\nThe 42-year-old actor and the ‘Lethal Weapon’ star have jumped on board the forthcoming project, directed by Tommy Wirkola, after they were asked to play a character called Drex and The Pastor, respectively, according to Variety.com.\nThe movie - penned by Nick Ball and John Niven - will follow the story of a group of disillusioned former Marines who head out on one last mission to get revenge on the cartel that murdered their colleague and stole their drug money.\nThe complete casting is yet to be announced but production is scheduled for October.\nIt’s a busy time for both Gibson and Farrell as the director is trying to squeeze the film into his schedule before he returns to helm the World War II picture ‘Destroyer’.\nThe directing credit comes as Gibson, 62, is also being eyed for an acting role in ‘The Six Billion Dollar Man’, where he would star opposite Mark Wahlberg.\nWarner Bros.′ big screen adaptation of the 1970s TV series is due to begin shooting this summer, and as of the time of writing, it is unknown what role Gibson is in talks for.\nWahlberg is keen to get Gibson on board after the pair worked together on the Paramount comedy ‘Daddy’s Home 2’ in 2017, where they played father and son.\nFarrell, on the other hand, will next be seen in ‘Widows’ at the end of the year and in Tim Burton’s live-action ‘Dumbo’ in March next year.\nHowever, he has had a tough time recently as he reportedly checked himself into rehab in April as a preventative measure to stop him from slipping into old habits.\nAccording to a source, Farrell became “overwhelmed” following a busy year having completed three back to back films and began getting “urges” to start “using” again.", "url": "https://apnews.com/2f5d82de0afd44e692796b8acd4df91b"}