{"authors": ["Jason Feldman"], "date_download": "2020-05-04 20:14:54", "date_modify": "2020-05-04 20:14:54", "date_publish": "2018-07-23 11:30:00", "description": "MILLVILLE – The only thing that has stopped Eli Tomac this year is his own bike. The 25-year-old from Cortez, Colo., has been dominant at the top level of professional motocross since the...", "filename": "_ba4f8b97d8dc4686b29712ee82bec7fd_1588623294.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ba4f8b97d8dc4686b29712ee82bec7fd_1588623294.html", "title": "Motocross: Tomac back on top of 450 class after sweep at Spring Creek", "title_page": "Motocross: Tomac back on top of 450 class after sweep at Spring Creek", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MILLVILLE – The only thing that has stopped Eli Tomac this year is his own bike.\nThe 25-year-old from Cortez, Colo., has been dominant at the top level of professional motocross since the season started in May, and after a hiccup two weeks ago, Tomac was on a mission Saturday at Spring Creek MX Park.\nThe defending AMA Pro Motocross 450cc Class national champion has annually raced well at Spring Creek, and that tradition continued Saturday during Round 8 of the AMA national championship series.\nTomac said his starts weren’t as strong as he would have liked, but he made that a moot point by finding more speed than anyone on the track when he needed it. For the second time in his four appearances at Spring Creek in the 450 Class, Tomac swept both motos and won the overall for the day.\n“It was good; I ate a lot of sand here (Saturday),” Tomac said. “I felt really good all day, a lot better than last year (when he finished third overall). I felt like we finished where we were supposed to.”\nTomac has raced at Spring Creek eight times, his first four coming in the 250 class. He has won four overalls at the track and finished third twice. Saturday marked the third time he has swept both motos at Millville.\nIn the process, he regained the series points lead from Marvin Musquin, who shot past Tomac during Round 7 two weeks ago at RedBud in Buchanan, Mich., when Tomac’s bike locked up on him during the first moto. The rear wheel on his No. 1 Kawasaki simply stopped working, causing him to earn no points in the moto.\nBut Tomac earned 50 points with his sweep Saturday, while Musquin earned 40 for finishing fourth and second in the two motos. That gives Tomac — who trailed Musquin by three points entering Saturday’s races — a seven-point advantage with four rounds (eight motos) remaining in the season.\n“This was the site of our first 450 Class win in 2014,” Tomac said of Spring Creek, “so I’ve had a pretty good past here. It has similar soil to my house in Colorado so I always feel comfortable here.\n“I had plenty of motivation from RedBud too. You don’t want to get too caught up in that stuff, but that wasn’t an easy pill to swallow to lose the lead that way. I was fired up all day.”\nTomac’s charge to victory in the day’s final race was perhaps the most impressive of his 11 moto victories this season.\nHe was in eighth place on the opening lap, but quickly worked his way into the top five. He passed Blake Baggett for third place with more than 23 minutes remaining on the 30-minute clock (the race goes two more laps after the 30-minute horn) and set his sights on race leaders Musquin and Ken Roczen. Tomac needed nearly all of those 23 minutes to catch Roczen for second, passing him while making a turn after a downhill.\nWith a mostly clear track between him and Musquin, Tomac turned up his speed and passed Musquin just seconds after the 30-minute horn sounded. Tomac pulled away to sweep both motos in a round for the fourth time this season.\n“I was just going forward and once I had a clear track I could go (faster),” Tomac said.\nRoczen finished second overall and Musquin finished third. He’ll have to give up the red number plate on his bike — signifying the current points leader — to Tomac when the series returns to action on Saturday in Washougal, Wash.\n“We just need to keep working hard,” Musquin said, “keep doing what we’re doing. I’m looking forward to the rest of the championships. We have some good tracks left to ride at. I’ll just focus on myself and try to keep getting better.”", "url": "https://apnews.com/ba4f8b97d8dc4686b29712ee82bec7fd"}