{"authors": ["James Halpin"], "date_download": "2020-05-04 20:24:24", "date_modify": "2020-05-04 20:24:24", "date_publish": "2018-02-16 00:00:00", "description": "ASHLEY — Besieged by community outrage over a controversial rapper’s performance and a possibly gang-related shooting, the owners of Bentley’s Nightclub 1.0 this week got more bad news: the lender...", "filename": "_e6e3eba633734b2d9746fa01456dc21f_1588623864.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e6e3eba633734b2d9746fa01456dc21f_1588623864.html", "title": "More Trouble For Bentley’s As Lender Seeks Foreclosure", "title_page": "More Trouble For Bentley’s As Lender Seeks Foreclosure", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ASHLEY — Besieged by community outrage over a controversial rapper’s performance and a possibly gang-related shooting, the owners of Bentley’s Nightclub 1.0 this week got more bad news: the lender is seeking to foreclose on the newly revived venue.\nMeanwhile, the business manager acknowledged Thursday that although borough officials were led to believe all shows at the venue had been canceled, a live concert scheduled for tonight is still on.\nCourt records show that SMS Financial Strategic Investments, the venue’s Phoenix-based mortgagee, filed a foreclosure action Monday against Colbco, LLC, alleging that the $1.225 million mortgage the corporation took out for the property last June is in default.\nAccording to the complaint, the business has not paid its mortgage since Oct. 1, and now owes the $1.225 million principal in addition to $94,359 in interest and about $5,000 in fees and late charges.\nColbco manager Coleen M. Burns, whose family also owns Hottle’s Restaurant in Wilkes-Barre, said in a phone interview Thursday that she was “shocked” to learn about the foreclosure.\n“We have a refinance in the works where they’re getting paid off, so why they get into any kind of aggressive action is beyond me,” Burns said.\nThe long-dormant Bentley’s venue at 2300 state Route 309 began showing new signs of life in December, when it was re-branded Bentley’s Nightclub 1.0 under Colbco’s watch and began promoting rap and hip-hop shows on the club’s Facebook page.\nWhen the news broke that controversial New York City rapper Tekashi 6ix9ine was performing there last Friday, the venue became the target of widespread outrage for hosting such an act. The rainbow-haired rapper, whose real name is Daniel Hernandez, is currently free on bail pending sentencing after admitting to posting lewd videos involving himself and a 13-year-old girl on his Instagram page.\nThat performance appears to have gone off without a hitch. But shortly before 5 a.m. Sunday, a few hours after a Saturday night show headlined by Detroit rapper Dej Loaf, two groups of people exchanged fire outside the club in a shooting police suspect involved members of the Bloods street gang.\nThe burst of violence drew the increased attention of local police and the Pennsylvania State Police Bureau of Liquor Control Enforcement, which was planning to review the revenue’s operations.\nIn the aftermath, Burns told Ashley Council President John Gibbons that the venue had no upcoming concerts, he said Thursday. Ashley Police Chief David Fedorczyk also said he had been told “all scheduled events for the foreseeable future had been canceled.”\nHowever, as of Thursday afternoon, the club’s Facebook page was still advertising several upcoming shows, including a performance tonight by Dominican artist Vakero, who is billed on the flier as being “in concert” at the venue.\nAsked about the discrepancy, Burns said she has canceled “hip-hop and rapper shows” but that the club remains open and will host DJs playing “club music” as well as live performers. Although entertainment magazines Billboard and Vibe have described Vakero as a “rapper,” Burns said she does not perceive him that way.\n“He’s a mariachi singer,” Burns said. “He’s Spanish. He doesn’t even sing American songs.”\nShe also drew a distinction regarding the location of tonight’s performance inside the building, saying the Vakero show is happening in a different section from where the other concerts were held.\n“It’s in the Havana Night Club,” Burns said. “It’s a different room. It’s a different business in the building. This is an event center. There’s one club in the back, then there’s where we hold concerts. Everything up there, where these concerts have been, has been canceled.”\nBurns said promoters have canceled and refunded several shows, although she was unable to name them Thursday.\n“I don’t do the shows, promoters do,” she said.\nBorough officials say Burns has been receptive to working with the borough to prevent future problems. The shooting Sunday took place about two hours after a police detail departed the club, and one potential change being looked at would be for the facility to close at 3 a.m. and to make sure all patrons have left before the police do.\nBurns said the venue is also not catering solely to the nightclub crowd and remains open to other events.\n“Anybody who wants to do weddings or bookings or parties, they’ve been reaching out to us,” Burns said. “We have weddings, we have graduation parties, we have all kinds of parties booked.”\nBILL WELLOCK, staff writer, contributed to this report.\nContact the writer:\njhalpin@citizensvoice.com\n570-821-2058", "url": "https://apnews.com/e6e3eba633734b2d9746fa01456dc21f"}