{"authors": ["Staff Reports"], "date_download": "2020-05-04 20:27:06", "date_modify": "2020-05-04 20:27:06", "date_publish": "2018-10-11 11:52:54", "description": "Greenwich Academy stretched its unbeaten streak to five games by registering a 3-1 win over visiting Hopkins School Wednesday in a rematch of the last two FAA Tournament finals. Juniors...", "filename": "_48557c4c6afe4bd1b6b3932bb395db28_1588624026.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_48557c4c6afe4bd1b6b3932bb395db28_1588624026.html", "title": "Greenwich Academy soccer defeats Hopkins", "title_page": "Greenwich Academy soccer defeats Hopkins", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Greenwich Academy stretched its unbeaten streak to five games by registering a 3-1 win over visiting Hopkins School Wednesday in a rematch of the last two FAA Tournament finals.\nJuniors Katie Goldsmith and Tessa Brooks helped propel the Gators to victor. Goldsmith tallied twice, while Brooks recorded one goal and one assist.\n“Both teams were up for this game, it was a really tough game,” said GA coach Alistair Lonsdale, whose squad raised its record to 7-2-1.\nGA, which beat Hopkins for the FAA Tournament title the past two seasons, took a 1-0 lead in the 20th minute. Smith scored the go-ahead goal, with Brooks assisting on the tally.\n“We had three other good chances of scoring that we missed, but we were up, 3-1, at halftime,” Lonsdale said.\nGathering a pass from senior Paige Keating, Goldsmith scored again 20 minutes into the second half, putting the Gators on top, 2-0. With six minutes remaining, junior Taylor Lane tallied off a Brooks corner kick, giving Greenwich Academy a 3-0 advantage.\nHopkins (5-4-1) scored with two minutes left in the second half, cutting GA’s lead to 3-1. Sophomore Ella Fugelsang got the shutout in goal for the Gators, who were once again sparked defensively by sophomore Schuyler Sargent and Christina Maldonado.\nGreenwich Academy returns to action Monday against visiting Masters School.\n“Our team was tired defensively and worked really hard,” Lonsdale said. “We’ve had a stretch of tough games, so it was good to come out on top.”", "url": "https://apnews.com/48557c4c6afe4bd1b6b3932bb395db28"}