{"authors": ["Joseph Lovercheck Jlovercheck Norfolkdailynews.Com"], "date_download": "2020-05-04 20:08:47", "date_modify": "2020-05-04 20:08:47", "date_publish": "2018-10-19 14:19:00", "description": "The Nebraska Legislature’s District 16 will have a new representative after the Nov. 6 elections because Sen. Lydia Brasch of Bancroft is not able to run again because of term limits. The...", "filename": "_1c5444dec72f41fc82887fc30045dd7f_1588622927.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1c5444dec72f41fc82887fc30045dd7f_1588622927.html", "title": "District 16 will have new representative after elections", "title_page": "District 16 will have new representative after elections", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Nebraska Legislature’s District 16 will have a new representative after the Nov. 6 elections because Sen. Lydia Brasch of Bancroft is not able to run again because of term limits.\nThe district, made up of Burt, Cuming and Washington counties, will elect a new representative between Chuck Hassebrook of Lyons and Ben Hansen of Blair.\n“For my most of my adult life, I’ve worked to create a better future in Nebraska and rural America,” Hassebrook said. “I would like to get back to serving our people and communities.”\nHassebrook said this is a particularly critical time for rural Nebraska.\n“The Legislature will be redistricted in 2021, with rural Nebraska likely to lose even more seats. It is vital that we have strong and experienced representatives who know how to get things done for small town and rural Nebraska,” he said.\nHassebrook’s experience advocating for small towns and rural Nebraska before Congress gives him experience working with both Democrats and Republicans. He was a longtime staff member with the Center for Rural Affairs.\n“I would like to put that know-how to work in the Legislature to get things done for our area,” Hassebrook said. “I’ll support good ideas from Republicans and Democrats and work with both. That is the key to making government work for us.”\nThe three most important issues to Hassebrook are reducing property taxes, reforming the state education policy to help the schools in the district and creating jobs and self- employment opportunities to support small towns and the rural way of life.\nIn regard to taxes, Hassebrook looks to lower property taxes, and relieve the stress from schools by giving more state funding to schools.\nHassebrook said that eight out of the nine schools in the district receive no equalization aid — the primary form of state aid. Hassebrook said that this is the driving factor behind property taxes on farmland going up.\nHassebrook also looks to create economic growth in more rural communities. He said Nebraska’s economic development incentives primarily benefit larger businesses in cities and population centers.\n“I will work to strengthen incentives for small business, beginning farmers and value added agriculture,” Hassebrook said.\nHassebrook’s competitor in the Nov. 6 race is Hansen.\n“My wife and I have been blessed to grow up in Nebraska and to call Nebraska home. We want the same opportunities for our daughter in this great state that were there for us,” Hansen said.\nBut there’s work to be done in order for that to occur, he said.\n“Unfortunately our broken tax system is placing an undue burden on farmers and retirees, and our broken school finance system is short-changing our rural school districts forcing them to increase their reliance on local property taxes,” he said. “Something has to change and I’m determined to go to Lincoln and work toward real solutions and not Band-aid approaches.\nHansen describes himself as a constitutional conservative who believes less government involvement in everyone’s lives will foster entrepreneurship and economic growth.\n“As a state senator representing District 16 ... my promise is to be accessible, to listen, and to work every day to make a difference for Nebraska’s families, farmers, small business and seniors,” he said.\nHansen said the issues of property taxes and education funding are closely tied.\n“We can’t address the burden of property taxes without also addressing our state’s K-12 education finance system,” Hansen said. “Eight of the nine school districts in Burt, Cuming and Washington counties don’t receive state equalization aid, which means our rural school districts have no choice but to rely mostly on property taxes. This is an unfair burden, especially for our farmers.”\nGrowing the state’s economy is also an issue on Hansen’s radar.\n“There isn’t a magic bullet to growing our state’s economy — it’s many things together,” he said.\nHansen said some of the factors are ensuring that the tax burden must be low, that unnecessary government regulation is reduced and that the K-12 schools and higher education institutions are producing graduates with the skills to be successful, not only locally, but globally.\nHansen also said he believes more needs to be done to encourage doctors, nurses and specialists to practice in rural areas. This would help to keep health care costs down in local communities, he said.", "url": "https://apnews.com/1c5444dec72f41fc82887fc30045dd7f"}