{"authors": ["Chris Brooks", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Eric Blanc", "Lois Weiner", "Corey Robin", "Joe Burns"], "date_download": "2020-05-04 20:00:11", "date_modify": "2020-05-04 20:00:11", "date_publish": "2018-05-01 00:00:00", "description": null, "filename": "2018_05_teachers-strikes-collective-bargaining-unions-militant_1588622411.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/05/01155131/GettyImages-941125692.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_05_teachers-strikes-collective-bargaining-unions-militant_1588622411.html", "title": "After the Wave", "title_page": "After the Wave", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIt was only eight years ago that seething hostility towards teacher unions was the status quo. The national media lauded their demonization in liberal documentarian Davis Guggenheim’s Waiting for Superman and corporate-backed education reform policies enjoyed a bipartisan consensus — from Wisconsin governor Scott Walker’s Act 10 to Democratic president Barack Obama’s Race to the Top. The 2012 Chicago Teachers Union strike was the first real public challenge to the business elite’s education agenda. Now, it appears that the teacher strike wave rolling across the country has the potential to finally turn the tide. What started as a walkout in three West Virginia counties quickly spread to the entire state. Since then, walkouts and mass rallies have taken place in Arizona, Colorado, Kentucky, and Oklahoma. The audacity of the West Virginia teachers is clearly contagious. This is an inspiring moment, one that will hopefully leave hundreds if not thousands of activists fundamentally transformed by their experience of collective power. But that is no guarantee that it will result in stronger or more militant unions. Waves ebb and flow. As momentous as the teacher strikes are, they will recede. If unions hope to build off this momentum and become a more powerful voice for teachers and public education, then they will have to make some profound changes and not simply return to business as usual.\nStriking Back from a Position of Weakness One of the most important lessons coming out of the strike wave is that prohibitions against striking aren’t laws of nature — they can be broken. Participating teachers all took a big risk, but they took that risk together. They could have lost their jobs or been targeted for retaliation. In some states, striking educators can be stripped of their license and barred from teaching. But that has yet to happen because they acted collectively, proving yet again that a union’s greatest strength lies in unified action. And yet, the strike wave is being born from a place of deep institutional weakness. Most states have simultaneously slashed funding for public education while providing tax breaks to corporations and the wealthy. This has had a dramatic impact on teacher pay and benefits. Teachers with graduate degrees and tens of thousands of dollars in student debt are making poverty wages. Many hold down multiple part-time jobs. The plight of education workers is so universal that Feeding America, the largest US hunger-relief organization, ran a television ad featuring a pre-K teacher who comes home from her full-time job and doesn’t have enough food to feed her family. Education workers are being squeezed with no relief in sight — and the teacher unions that represent them have been unable to stop the downward slide. In many rural communities, the local school system is the largest employer. Tens of thousands of education workers are employed in every state. It is no surprise then that the National Education Association (NEA) is the largest union in the country, with over three million members, and many NEA state affiliates are the largest union in their respective states. The sheer size of the current and retired education workforce — and the fact that generations of voters have personal connections to them — should be a major source of leverage for teacher unions when it comes to setting a clear education agenda in their communities and state. Yet that is often not the case. Many NEA state affiliates operate primarily in a legalistic fashion, selling union services as the primary basis for membership and relying heavily on political and communications professionals to lobby legislators. The highest demand typically placed on members is to show up for the annual lobby day at the state capitol — a routine action that often only mobilizes a tiny fraction of the state association’s total membership. Lacking a history of organizing education workers and building supermajorities around meaningful fights, the staff-driven, top-down structure of the state associations leaves many teachers and school support personnel feeling only loosely connected to the union. This is one of the underlying reasons why alternative organizations to the union have popped up in almost every state where walkouts and rallies have happened: West Virginia, Kentucky, Oklahoma, and Arizona. In some cases, these new networks have had an uneasy relationship with existing union leaders. In other cases, they have been greeted with open arms. According to rank-and-file teacher Rebecca Garelli, a leader in the activist group Arizona Educators United, she and other activists worked very closely with the leaders in the Arizona Education Association, an NEA state affiliate, to organize the first successful statewide teacher strike in the state’s history. “We are on calls with them every night,” Garelli said. “The union has resources, we don’t. We have the voices of teachers, and they don’t.”", "url": "https://www.jacobinmag.com/2018/05/teachers-strikes-collective-bargaining-unions-militant"}