{"authors": ["Steve Mims"], "date_download": "2020-05-04 20:24:35", "date_modify": "2020-05-04 20:24:35", "date_publish": "2018-01-31 08:00:00", "description": "One of the top two seeds has won each of the past four Pac-12 Tournaments, but this may be the year for a longshot. Arizona could be the only team feeling secure about its spot in the NCAA...", "filename": "_3085489b455748d980d5663b41ea6b3d_1588623875.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3085489b455748d980d5663b41ea6b3d_1588623875.html", "title": "It could be wide-open Pac-12 tourney", "title_page": "It could be wide-open Pac-12 tourney", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "One of the top two seeds has won each of the past four Pac-12 Tournaments, but this may be the year for a longshot.\nArizona could be the only team feeling secure about its spot in the NCAA Tournament when the conference returns to Las Vegas in five weeks. The Wildcats are back in the Associated Press Top 10 and considered a top-four seed in most bracket projections.\nUSC is 8-2, one-half game back of the first-place Wildcats. But the Trojans are seen as much further behind Arizona by pollsters and bracketologists. With four nonconference losses, including one at home to Princeton, and no top-40 RPI victories, the Trojans are unranked and listed as a No. 10 seed by both Joe Lunardi of ESPN and Jerry Palm of CBS Sports.\nWith a three-game road trip coming up to UCLA, Arizona State and Arizona, the Trojans may need to spend the final month of the regular season trying to play their way back into the NCAA field.\nArizona State is still hanging around the AP poll at No. 25 and listed as a sixth seed by Palm and and eighth seed by Lunardi, but a repeat of their 4-5 conference record during the second trip around the Pac-12 could force the Sun Devils to get a win or two at the conference tournament to end a three-year NCAA drought. The Sun Devils have dropped to No. 42 in RPI.\nThe only time a team that did not have a bye on the opening day of the conference tournament and went on to win the title was in 2012 when sixth-seeded Colorado played its way into an automatic berth in the NCAA Tournament.\nThe No. 6 seed could be in a favorable position once again this season beginning with a likely opening-round game against Washington State or California.\nUsing the standings at the midway mark of conference play, Utah would be the No. 6 seed.\nThe Utes would likely avoid Arizona and USC in the quaterfinals and instead face the No. 3 team, which currently looks like UCLA, Washington or Stanford. Coming off a likely easy warm-up win over the Bears or Cougars on Wednesday in the Pac-12 tourney, the Utes wouldn’t be much of an underdog against the Bruins, Huskies, or Cardinal.\nIf Utah advanced to the semifinals, it would likely face USC, which appears likely to be unranked entering the conference tournament. Compare that to last season when Oregon, Arizona and UCLA all arrived in Vegas ranked in the top 10.\nBeat the Trojans, and Utah is into the conference title game, likely against an Arizona team with its NCAA seed all locked up. Meanwhile, the Utes would need to beat the Wildcats to reach the NCAA Tournament.\nArizona may be a double-digit favorite in that matchup, but Utah would certainly have a lot more on the line.\nThat was the case six years ago when Colorado beat Arizona 53-51 in the title game to secure an NCAA bid in the last great upset at the Pac-12 Tournament.", "url": "https://apnews.com/3085489b455748d980d5663b41ea6b3d"}