{"authors": ["Daily News Staff"], "date_download": "2020-05-04 20:17:21", "date_modify": "2020-05-04 20:17:21", "date_publish": "2018-03-14 05:59:00", "description": "RESISTING ARREST/FALSE REPORTING/DISORDERLY CONDUCT/WARRANT ARREST, BULLHEAD CITY — Joe Martin Tinoco Jr., 25, was arrested Monday after Bullhead City police responded to a report of a disorderly...", "filename": "_39610f047cdd40a68e2f2ee29d678271_1588623441.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_39610f047cdd40a68e2f2ee29d678271_1588623441.html", "title": "Community Watch, Wednesday, March 14, 2018", "title_page": "Community Watch, Wednesday, March 14, 2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RESISTING ARREST/FALSE REPORTING/DISORDERLY CONDUCT/WARRANT ARREST, BULLHEAD CITY — Joe Martin Tinoco Jr., 25, was arrested Monday after Bullhead City police responded to a report of a disorderly man at Walmart, 2840 Highway 95. Employees reported that Tinoco was near the restroom being disruptive by yelling and punching the walls, police spokeswoman Emily Fromelt said. He reportedly refused to cooperate with store employees. When officers arrived, Fromelt said, Tinoco continued to act disorderly and uncooperative, even resisting after he was Tased. Tinoco also reportedly grabbed a compressed air duster in the store and inhaled it. Fromelt said he identified himself to police using a fake name and date of birth. Tinoco was booked on suspicion of felony resisting arrest, false reporting to law enforcement, disorderly conduct and shoplifting, and on an outstanding misdemeanor warrant for shoplifting. He was taken to the Mohave County Jail in Kingman.\nDISORDERLY CONDUCT, BULLHEAD CITY — Christian Martin Luna, 23, was arrested Monday after police were called to the 600 block of Highway 95 for a report of a man on a BATS bus being disorderly and refusing to get off the bus. The bus driver reportedly told officers that Luna was using profanities on the bus. Luna continued to be very uncooperative with police, Fromelt said, and officers had to physically remove him. Luna was cited for disorderly conduct and released.\nFAILURE TO REGISTER, BULLHEAD CITY — Paul Michael Salgado, 57, was arrested Monday after police detectives reviewing sex offender statuses reportedly discovered that his license card had expired. Salgado was booked on suspicion of failure to register and a registration violation. He was taken to the Mohave County Jail in Kingman.\nWARRANT ARREST, BULLHEAD CITY — Jordan Randall Clemens, 31, was arrested Monday in the 1100 block of Highway 95 on an outstanding misdemeanor warrant for failure to appear. He was taken to the Mohave County Jail in Kingman.\nUnless otherwise indicated, the preceding information was taken from Bullhead City police reports.", "url": "https://apnews.com/39610f047cdd40a68e2f2ee29d678271"}