{"authors": [], "date_download": "2020-05-04 20:24:34", "date_modify": "2020-05-04 20:24:34", "date_publish": "2018-01-10 05:00:00", "description": "January 8, 1951 ~ January 4, 2018 James Michael Kariger died January 4, 2018, in Rockland, ID. He was born in Ogden, UT, January 8, 1951, the first son of George Washington and Mae Clark...", "filename": "_e8a1be38bf0640a6bf70fbf4a8ec2254_1588623874.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e8a1be38bf0640a6bf70fbf4a8ec2254_1588623874.html", "title": "James Michael Kariger", "title_page": "James Michael Kariger", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "January 8, 1951 ~ January 4, 2018\nJames Michael Kariger died January 4, 2018, in Rockland, ID. He was born in Ogden, UT, January 8, 1951, the first son of George Washington and Mae Clark Kariger. He was educated in Ogden, and graduated in Juneau, AK, in 1970, then served in the Army during the Vietnam War.\nJames was a member of the LDS Church. He worked for the Ogden City Fire Department, Hill Air Force Base and for Ogden City as an Animal Control Officer. He then moved to Deweyville, then to Rockland, ID.\nHe was an avid fisherman and hunter. He led hunting parties and knew the best places to hunt. The thing that brought him the most pleasure in life was working with the youth. He volunteered at the Death and Blind School, was a Big Brother and a Coach in Randy Russell Baseball. He was a positive influence in many young mens lives. He was also involved in scouting throughout his life.\nJames is survived by his sister, Dianne Garrelts; two brothers, Randy and Kevin Kariger; and nieces and a nephew.\nGraveside services will be held at 11 a.m. on Thursday, January 11, 2018, at Memorial Gardens of the Wasatch, 1718 Combe Road, Ogden, UT.\nIn lieu of flowers donations can be made the Humane Society.", "url": "https://apnews.com/e8a1be38bf0640a6bf70fbf4a8ec2254"}