{"authors": ["Corey Williams"], "date_download": "2020-05-04 20:15:33", "date_modify": "2020-05-04 20:15:33", "date_publish": "2018-02-19 13:25:00", "description": "Some cities and regions are highlighting racial diversity along with positive business climates, competitive tax rates and available land in pitches to lure tech companies and high-paying jobs to...", "filename": "_5278f0e744af4090a9d08e880aeceb42_1588623333.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5278f0e744af4090a9d08e880aeceb42_1588623333.html", "title": "Philadelphia among cities pitching diversity in efforts to lure Amazon", "title_page": "Philadelphia among cities pitching diversity in efforts to lure Amazon", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Some cities and regions are highlighting racial diversity along with positive business climates, competitive tax rates and available land in pitches to lure tech companies and high-paying jobs to town.\nPlaces such as Pittsburgh, Philadelphia and Detroit are touting their populations of people of color to chief executives and other corporate officials as part of being open for business.\n“For Pittsburgh and southwestern Pennsylvania, ethnic and racial diversity has been an integral part of our history and a rich part of our narrative,” said Stefani Pashman, CEO of the Allegheny Conference on Community Development.\nPittsburgh and Philadelphia are among 20 cities still under consideration by online retail giant Amazon as locations for the company’ second headquarters.\nPashman said to succeed as a player in a global economy, Pittsburgh “must be a place where there’s a base of talent that looks and thinks like the world because the world is the customer in today’s economy.”\nWhen Seattle-based Amazon sought proposals for its second headquarters, more than 240 cities and regions submitted bids and pitches about what they could offer the retailer. Many pitches came with sleek, professionally filmed videos of bright and busy downtowns, historic landmarks and recreational opportunities.\nSome also featured snapshots of racial diversity in neighborhoods, shops and classrooms. That’s something sought by younger workers who will come to dominate a more tech-driven global economy, according to marketing experts.\nCompanies generally are looking to employ a lot of millennials and those hires are saying they “want to be able to work and live in a place where there are these interesting and diverse cultures,” said Matthew Quint, director of Columbia Business School’s Center on Global Brand Leadership.\nBut tech-based corporations are lacking in diversity, according to some data.\nHigh-tech employment of African-Americans in the U.S. was 7.4 percent compared with 14.4 percent employment of blacks in the public sector overall, according to 2014 data collected by the federal Equal Employment Opportunity Commission. Hispanic high-tech employment was 8 percent compared to 13.9 percent in the public sector overall.\nThe data also showed that less than 1 percent of executives at some leading Silicon Valley tech firms were black and fewer than 2 percent were Hispanic.\n“All tech companies are under this lens, presently, for their lack of diversity,” Quint said. “CEOs are talking about ‘we know we need to change.’”\nMeanwhile, he said, cities recognize the racial diversity they offer is attractive and they’re telling companies, “You are going to have this diverse population to choose from as you’re looking to change your brand.”\nPittsburgh is in Allegheny County. About 202,000 of Pittsburgh’s 305,000 residents are white, and about 74,000 are black, according to census data. An additional 16,000 are Asian.\nIn its pursuit of Amazon’s $5 billion second headquarters project, which could result in possibly 50,000 jobs, Pittsburgh’s video entry is titled “Future. Forged. For all.”\nIn Philadelphia’s pitch to Amazon, a half-dozen or so non-white professionals tell why it would be the best place for the company’s new headquarters.\nDallas-Fort Worth also is among the more than 240 cities and regions to make a run at Amazon and also made the cut down to 20. A video that’s part of Dallas-Fort Worth’s proposal shows a boy of eastern Indian heritage holding a sign that reads: “Diversity.”\nDetroit’s pitch included a 240-page “Move Here. Move the World” book that featured blacks and other minorities who own businesses and also highlighted Hispanic heritage events. But the Motor City, which is 80 percent black and anchors a metropolitan area that also has sizable Arab-American and Hispanic populations, didn’t make Amazon’s cut.\nOfficials in Detroit say the city’s promotion of its diversity didn’t start with its run at Amazon and won’t stop now that the company has its eyes elsewhere.\n“We are going to use that material as much as we can with all of our other business opportunities,” said Jed Howbert, the city’s group executive for Planning, Housing and Development. “We think the diversity of Detroit and the whole metro area is one of the most important assets we have in attracting companies.”\nTina Wells, founder and CEO of Haddonfield, New Jersey-based Buzz Marketing Group, said she’s not aware of other instances in which cities pushed their diversity to companies like some have to Amazon. But, she said, it’s “less about marketing a city’s blackness and more about showing a city is diverse and open to everyone.”\n“When you think about vibrant cities you want to make sure you tell people, ‘You’re welcome here,’” Wells said. “I just think we’re a little slow in reflecting what these cities look like.”", "url": "https://apnews.com/5278f0e744af4090a9d08e880aeceb42"}