{"authors": ["Anne Nickoloff"], "date_download": "2020-05-04 20:13:03", "date_modify": "2020-05-04 20:13:03", "date_publish": "2018-05-02 11:01:00", "description": "The Shoreline offers serene views of Lake Erie: Apartment of the week CLEVELAND, Ohio – Downtown energy meets Lake Erie life at The Shoreline apartments. The luxury apartment building...", "filename": "_11062a0185c64588a0e42eb9aff52f94_1588623183.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_11062a0185c64588a0e42eb9aff52f94_1588623183.html", "title": "The Shoreline offers serene views of Lake Erie: Apartment of the week", "title_page": "The Shoreline offers serene views of Lake Erie: Apartment of the week", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Shoreline offers serene views of Lake Erie: Apartment of the week\nThe Shoreline offers serene views of Lake Erie: Apartment of the week\nCLEVELAND, Ohio – Downtown energy meets Lake Erie life at The Shoreline apartments.\nThe luxury apartment building sits on the edge of downtown Cleveland and on the edge of Lake Erie. Units have large windows full of sweeping lake scenes and the downtown skyline.\nThe Shoreline has some history behind it. The brick building was originally built in 1929 as the Nicholson Cleveland Terminal. The building was used to distribute both automobiles and newsprint, with multiple decks to load cars into the building at the same time.\nIn 1993, the land was purchased to create luxury apartments, and in July 2017, Landmark Companies acquired the apartment building.\nThough the building is nearly a century old, it features a new pool, a fitness center, saunas and a complimentary Starbucks coffee machine in the lobby. For summertime conveniences, there are also a car wash station, a dog park and an outdoor grilling area.\n“The Shoreline offers a one-of-a-kind living experience for its residents,” said Hannah Rohrer, a leasing consultant for The Shoreline. “The property features million-dollar views of the lake and downtown Cleveland. [It] provides a serene sanctuary to those who want the best of both worlds.”\nOne and two bedroom apartments are available. See the full listing here.\nThe Shoreline\nAddress: 5455 North Marginal Rd.\nCity: Cleveland\nPrice: $999-$3310 monthly\nYear built:1929\nSchool district: Cleveland Municipal School District\nManaged by: The Landmark Companies, (216) 432-0622, theshoreline@landmarkmgt.com", "url": "https://apnews.com/11062a0185c64588a0e42eb9aff52f94"}