{"authors": ["Mitchell Byars Staff Writer"], "date_download": "2020-05-04 20:25:05", "date_modify": "2020-05-04 20:25:05", "date_publish": "2018-10-18 17:25:39", "description": "Boulder police are investigating the possible drugging of two women at parties on University Hill. According to a release, two University of Colorado students were treated early this morning...", "filename": "_72cb6ea6c90e43528b8e0b6595492287_1588623905.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_72cb6ea6c90e43528b8e0b6595492287_1588623905.html", "title": "Boulder Police Investigating Possible Drugging of Women at Parties on University Hill", "title_page": "Boulder Police Investigating Possible Drugging of Women at Parties on University Hill", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Boulder Police Investigating Possible Drugging of Women at Parties on University Hill\nBoulder police are investigating the possible drugging of two women at parties on University Hill.\nAccording to a release, two University of Colorado students were treated early this morning at Boulder Community Heath’s Foothills Hospital after unknowingly ingesting drugs while drinking alcohol at parties on University Hill.\nBoulder police spokeswoman Shannon Aulabaugh said police at this time do not have a more specific location on the parties, and do not know if the two women were drugged at the same party or at separate locations.\nAulabaugh said a person who slips a drug into someone’s drink without their knowledge could be subject to second-degree assault charges.\nBoulder police are reminding party-goers to never leave drinks unattended or accept drinks from common, open containers. Symptoms of drugging include memory loss, breathing difficulties and being disproportionately intoxicated compared to the amount of alcohol ingested.\nAnyone with information about this case is asked to call Boulder police Detective Sgt. Barry Hartkopp at 303-441-3473. Those who wish to remain anonymous may contact the Northern Colorado Crime Stoppers at 1-800-222-TIPS or nococrimestoppers.com/\nMitchell Byars: 303-473-1329 , byarsm@dailycamera.com or twitter.com/mitchellbyars .", "url": "https://apnews.com/72cb6ea6c90e43528b8e0b6595492287"}