{"authors": ["Jason Wilde For The State Journal"], "date_download": "2020-05-04 20:06:12", "date_modify": "2020-05-04 20:06:12", "date_publish": "2018-12-09 11:00:00", "description": "GREEN BAY — What Mike Sherman remembers most is how awful he felt. Not about being unemployed — he was sure he’d coach again, eventually. But knowing how he’d disappointed the Green Bay Packers...", "filename": "_685a864f9c9c4e188defb87f52400927_1588622772.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_685a864f9c9c4e188defb87f52400927_1588622772.html", "title": "What’s it like be fired as the Packers coach? ‘You feel like you let people down,’ Mike Sherman says", "title_page": "What’s it like be fired as the Packers coach? ‘You feel like you let people down,’ Mike Sherman says", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GREEN BAY — What Mike Sherman remembers most is how awful he felt. Not about being unemployed — he was sure he’d coach again, eventually. But knowing how he’d disappointed the Green Bay Packers and their fans? That was difficult for him to take.\nIt was January 2006, and Sherman had just been relieved of his duties by Packers general manager Ted Thompson. In Sherman’s six seasons as coach, the Packers had never reached the Super Bowl, but they’d certainly had success. In his first five seasons, the Packers never finished with a losing record, reached the playoffs four straight years and compiled an overall record of 53-27 — a winning percentage of .663, surpassed at the time only by Vince Lombardi (.753), Mike Holmgren (.670) and Curly Lambeau (.668).\nSherman served as both the head coach and the general manager for four seasons (2001-04) following GM Ron Wolf’s unexpected retirement, but team president/CEO Bob Harlan had stripped him of his GM duties after the 2004 season and hired Thompson to oversee the football operation.\nAfter a 4-12 finish in 2005, Thompson fired Sherman. Six days later, Thompson hired Mike McCarthy — and McCarthy held the job for nearly 13 years, before being fired himself last Sunday, shortly after the Packers’ loss to Arizona.\nFor Sherman, who used to randomly pull into the front yards-turned-parking lots near Lambeau Field to surprise the entrepreneurial homeowners before continuing his game-day commute to the stadium, disappointing the team’s fervent fan base was difficult to take.\n“I think the hardest thing going through it — and Mike’s going through it right now — as the head coach of the Packers is knowing you had the best job in sports,” Sherman, 63, said during an interview with ESPN Wisconsin on Friday. “No matter how you cut it, no matter if you’re right or wrong, you feel like you let people down.\n“Because the fans, you know they’re out there and you know they watch the game on TV or in their garage with a group of people or out in the parking lot or in the stadium, and you know every Sunday they’re going to watch the Packers and expect the Packers to win. And when they don’t, there’s tremendous disappointment — and you feel it if you’re a Packers coach who embraces everything about the Packers. You feel that disappointment. And whether it’s your fault or not doesn’t really matter. That’s on your shoulders.\n“When you lose that job, there might be a little bit of relief in the sense that the pressure is off, but at the end of the day, it’s a job you would have always wanted to have kept if you’re a football coach.”\nStaying in Green Bay?\nThe manner in which McCarthy lost the job — moments after a game, with four games left to play (including Sunday’s against the Atlanta Falcons at Lambeau Field) — came as a surprise to him, according to several people close to the former coach.\nMcCarthy, 55, led the 2010 team to the Super Bowl XLV title and finished his Packers tenure having gone 125-77-2 in regular-season play (plus 10-8 in the postseason). Only Lambeau coached the Packers longer or won more games, and before his dismissal, McCarthy was tied with New Orleans’ Sean Payton for the third-longest active tenure in the league (after Cincinnati’s Marvin Lewis and New England’s Bill Belichick).\nAlthough McCarthy returned to Lambeau Field on Tuesday to talk with interim head coach Joe Philbin and the staff, and again on Wednesday to say goodbye to the players, McCarthy has kept a low profile since being fired. Unlike Sherman, whom Thompson allowed to do a news conference after his firing, McCarthy has yet to speak on the record to reporters beyond a handful of text messages.\nHe said he spent much of his Thursday writing a farewell letter that ran as a full-page ad in several newspapers before McCarthy and his family planned to get out of town for the weekend. It’s unclear whether McCarthy, who had one year remaining on his contract, will pursue other NFL head-coaching opportunities or take the year off to spend more time with wife, Jessica, and the couple’s five children, including the four who are still in school — sons Jack and George, who are high-schoolers, and daughters Gabrielle and Isabella, who are in elementary school.\nAt first, Sherman thought he’d stick around. How bad could it be? Sure, there might be some awkward run-ins with fans, but he and his family loved living in the NFL’s tiniest outpost. So what if he was no longer the Packers head coach? It didn’t take long for Sherman’s wife, Karen, to realize it wasn’t going to work. Sherman wound up going to the Houston Texans as Gary Kubiak’s assistant head coach.\n“The coach, his pain is enough, but then the family and what they have to go through as well. Do we stay in Green Bay? Do we go somewhere else?” Sherman recalled. “Even though you love living in Green Bay, can you really live in Green Bay and not be the coach? That’s a hard thing to do once you’ve been that coach.\n“Karen loved Green Bay, but I was driving her crazy in the house. Every time you went out to the grocery store, you ended up interacting with Packers fans, which I’d always enjoyed. But I just didn’t want any empathy or any sympathy for my situation. So that became a little bit difficult for me. You become a little bit housebound and it just wasn’t working.”\n‘Two types of coaches’\nMcCarthy’s three lieutenants — Philbin, the offensive coordinator; Mike Pettine, the defensive coordinator; and Ron Zook, the special teams coordinator — have been left to pick up the pieces for the final four games. At 4-7-1, the Packers aren’t mathematically eliminated from playoff contention, but the final month will be more about how the players respond to having next-to-nothing to play for.\nAll three men also know what it’s like to be fired, as Philbin (as head coach of the Miami Dolphins in 2015), Pettine (as head coach of the Cleveland Browns in 2015) and Zook (as head coach at the University of Florida in 2004 and University of Illinois in 2011) all have been there, done that.\n“They used to always say, ‘There are two types of coaches: Those who have been fired, and those who are going to get fired,’” Zook said. “It’s the nature of the business.”\nPettine, who went 10-22 in two years in Cleveland, was so beaten down by the experience that he’s not sure he will ever want to be a head coach again. He was out of football for two years, doing some intermittent consulting work, before McCarthy hired him as defensive coordinator in January.\n“The range of emotions, you’re all over the map early on,” Pettine admitted. “What it really helps you do, though, is it puts things in perspective. It gives you time to spend quality time — not just time, quality time — with your family, friends, people you love that have supported you along the way. And that was one of the best things for me, was to be able to spend that time and kind of, I don’t want to say rebuild, but strengthen those relationships. And just knowing how important family is to Mike, that I know that’ll be a big part of what he’s doing.\n“It took me awhile. I wasn’t ready to get right back in. … I know some guys have jumped right back in, and the fact that Mike has this month, you never know. But that’s such a personal thing.”\nWhatever McCarthy decides to do, it’ll be the right call, Zook said.\n“To kind of decompress a little bit, I’m sure Coach is looking forward to that,” Zook said. “I know the first year I was out, I didn’t realize I needed to be out, but I did need to be out.\n“(With) coach McCarthy in this case, and myself, you don’t lose confidence. Think about what he’s accomplished here in 13 years. Holy goodness. There’s a lot of people who would love to do what he’s done. You stay the course, and Coach will do that. He’ll keep on. He’", "url": "https://apnews.com/685a864f9c9c4e188defb87f52400927"}