{"authors": ["Dr. Paul Mackarey"], "date_download": "2020-05-04 20:31:36", "date_modify": "2020-05-04 20:31:36", "date_publish": "2018-08-06 00:00:00", "description": "About half of the world’s adult population has had a headache at least once in the past year, according to the World Health Organization. For many people, these headaches are infrequent and...", "filename": "_b2ffbda5fca943ba908e284a86180db6_1588624296.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b2ffbda5fca943ba908e284a86180db6_1588624296.html", "title": "Know Your Headache", "title_page": "Know Your Headache", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "About half of the world’s adult population has had a headache at least once in the past year, according to the World Health Organization.\nFor many people, these headaches are infrequent and don’t often affect daily life. But what about when your headaches occur frequently or are so severe they prevent you from going about your day-to-day activities?\nSome types of headaches are more easily treated and managed than others.\nThere are two types of headaches: primary and secondary. Primary headaches occur without an underlying disease and include migraines and tension headaches. Secondary headaches can be associated with serious disease, requiring emergency care, or can be referred from other structures of the body, such as the cervical spine (neck).\nHeadache symptoms that may constitute a medical emergency include vomiting, seizures, fever, muscle pain, night sweat, weight loss and neurologic symptoms such as blurred vision. If you are experiencing any of these symptoms, if your headache worsens or your symptoms change, you should seek medical attention. Any headache that is unusual for you and does not resolve itself in a reasonable time should be brought to your primary care physician’s attention.\nPrimary headaches\nMigraines: Migraines typically last from four to 72 hours, can range from moderate to severe pain, and usually are located on only one side of the head. Often they can be accompanied by an aura, nausea or vomiting, and sensitivity to sound or light. Migraines can be aggravated by routine physical activity such as walking up stairs.\nThis type of headache is thought to occur in the central nervous system and is related to blood vessels.\nTension-type: Tension headaches are the most common primary headache and can last anywhere from 30 minutes to seven days. They often produce a pressing or tightening sensation on both sides of the head. Usually there is no nausea, vomiting, light sensitivity or aggravation with physical activity.\nThis type of headache is thought to occur in the central nervous system but can have a hereditary component and is usually associated with muscle tender points. Tension headaches can be treated with relaxation techniques such as progressive muscle relaxation, medications and physical therapy.\nSecondary headaches\nThe most common secondary headache that is not related to a serious medical condition is a cervicogenic headache (originating from the neck).\nThe length of time a cervicogenic headache can last varies. Usually, the pain is on one side and starts in the neck. This type of headache is aggravated or preceded by head postures or movements of the neck.\nBecause the nerves of the neck and face share common connections, pain signals sent from one region can lead to discomfort in the other. Physical therapy can be an effective treatment to help relieve symptoms.\nA cervicogenic headache can be caused by an accident or trauma or can stem from neck movement or sustained postures, such as sitting in front of a computer at work or looking down at your phone. Changing these postures throughout the day could help reduce symptoms. This could mean bringing your phone closer to you, using pillows or another supportive surface. If you work at a desk, it could involve taking breaks or getting a standing desk.\nFive tips for tension headaches\nProgressive muscle relaxation: PMR is an effective method for reducing tension throughout the body. With this method, you first tense a muscle group, such as at the neck or shoulder, then relax the muscles, noting the difference between the two. This helps reduce both stress and tension.\nManage your stress level: While stressors vary from person to person, one method of managing stress is with exercise. Any form of exercise can help reduce stress, but a cost-free method is aerobic exercise, such as walking or running. A less time-consuming method could be to perform deep breathing exercises throughout the day.\nHeat or cold: When feeling sore or stiff, applying a hot or cold pack or taking a hot shower can help ease a tension headache.\nPosture: Make sure your head is over your shoulders — that is, don’t sit forward — and make sure you’re sitting or standing up straight with your shoulders back.\nOTC medications: Talk to your doctor or pharmacist for information about over-the-counter medications.\nFive tips for cervical headaches\nPosture: Follow the tension-headache tip above.\nErgonomics: If your job or hobbies require you to sit for extended periods, it may be beneficial to change positions throughout the day or consider getting a standing desk. When sitting, make sure the monitor is at eye level, your legs are able to fit under your desk, and you are close to the keyboard and monitor. If you are working with a laptop, avoid putting it in your lap; bring it closer to you by putting pillows on your lap.\nExercise: Some exercises to help relieve symptoms are chin tucks, shoulder blade pinches and back extensions. These can be performed multiple times throughout the day, sitting or standing.\nPhysical therapy: Physical therapy may include massage, manual techniques, stretching, traction/decompression and exercise. A physical therapist can assess your posture and provide strategies specific to you.\nOTC medications: While medications may not cure cervicogenic headaches, they may help relieve pain. Talk to your doctor or pharmacist for information.\nALEXA RZUCIDLO, a second-year doctor of physical therapy student at Temple University, contributed to this column. She grew up in Factoryville, graduated from Lackawanna Trail High School and received her undergraduate degree in kinesiology from Temple University. She plans to continue her clinical experience at Grand Junction VA Medical Center in Colorado.\nPHOTO MODELS: Danielle\nHiggins and Zack Brandt.\nPAUL J. MACKAREY, P.T., D.H.Sc., O.C.S., is a doctor in health sciences specializing in orthopedic and sports physical therapy. He is in private practice and an associate professor of clinical medicine at Geisinger Commonwealth School of Medicine. His column appears every Monday. Email: drpmackarey@msn.com.", "url": "https://apnews.com/b2ffbda5fca943ba908e284a86180db6"}