{"authors": ["Cody Ronnfeldt"], "date_download": "2020-05-04 20:13:20", "date_modify": "2020-05-04 20:13:20", "date_publish": "2018-08-20 10:00:00", "description": "NORFOLK - Some road construction on streets throughout Norfolk will start to take place soon. Assistant City Engineer Mike Middendorf says on Wednesday they'll start working on is 1st Street...", "filename": "_b04f2be3353d45d9865cf4b2afa8727f_1588623200.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b04f2be3353d45d9865cf4b2afa8727f_1588623200.html", "title": "Get ready for road construction work throughout Norfolk", "title_page": "Get ready for road construction work throughout Norfolk", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NORFOLK - Some road construction on streets throughout Norfolk will start to take place soon.\nAssistant City Engineer Mike Middendorf says on Wednesday they’ll start working on is 1st Street and Monroe Avenue.\nMiddendorf says the road is currently closed and dug up for replacement of a couple of pipes underneath the road.\nHe says they also have some street overlay projects they’ll start working on soon.\nMiddendorf says there’s a multi-step process that goes into the overlays.\n“A concrete contractor comes through and removes the section that need to be replaced. They’ll fill those up with concrete and when that concrete is set and the whole street is ready to go they’ll come in with a milling machine, mill it, sweep it up, and follow it immediately by an asphalt paver and they’ll lay the asphalt right behind that milling machine.”\nMiddendorf says road crews will start the overlay projects with Benjamin Avenue from Victory Road to the rail road tracks.\nHe says other over lay projects include Norfolk Avenue from 9th street to 14th street, 1st street from Bluff Avenue to Northwestern Avenue, and McKinley Street from 5th street to Jackson Avenue.\nMiddendorf says the overlay projects will begin after Labor Day and take two to three months.", "url": "https://apnews.com/b04f2be3353d45d9865cf4b2afa8727f"}