{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "J. W. Mason", "Nuno Teles"], "date_download": "2020-05-04 19:57:09", "date_modify": "2020-05-04 19:57:09", "date_publish": "2018-08-21 00:00:00", "description": null, "filename": "2018_08_public-state-owned-bank-finance-nationalized-banking_1588622229.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/08/21174149/paydayloans.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_08_public-state-owned-bank-finance-nationalized-banking_1588622229.html", "title": "The Case for a State-Owned Bank", "title_page": "The Case for a State-Owned Bank", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "“I’m a college student. I don’t really have assets,” Austin Wilson, a twenty-one-year-old senior at the University of Kansas who was short on rent by a few hundred bucks this month, recently told CNBC. “I own my car, I have a bunch of Dungeons & Dragons books. I could try to sell those.”\nWilson filled out forty job applications, looking for a last-minute gig to supplement his work at a senior care center, but nothing came through in time. His bank wouldn’t loan him anything less than $3,000 with corresponding interest, which he was hesitant to add to his already substantial student loan debt.\nThus Wilson joined the nearly 40 percent of college-age Americans who, according to a poll conducted by CNBC, seriously consider taking out a payday loan — a small-sum, quick-turnaround, high-interest loan that can help in a pinch but can also easily lead the borrower down a spiral of debt.\nThere are nearly twice as many payday lenders as there are McDonald’s locations in the United States. Payday lenders rake in $46 billion a year. The business model is predicated on hidden fees, punitive fines and exorbitant interest rates — up to 700 percent in some cases. These high-risk loans often precipitate financial disaster, but people who are cash-strapped take them anyway, because they have no other option. Without them, they won’t be able to pay rent and may risk eviction, or they won’t be able to afford transportation or childcare and may lose their job.\nPayday lenders operate in the void left by traditional banks, whose services don’t extend to everyone. Banks gamble brazenly with huge sums of money, but are notoriously skittish when it comes to the poor, rejecting working-class loan applicants even when they have good credit. Payday lenders make their money almost exclusively on the 7 percent of American households that are unbanked, meaning entirely boxed out of traditional financial services, and the additional 20 percent who — like Wilson — who are underbanked, meaning they have a bank account but still partially rely on high-cost alternative financial services like pawn shop loans, check cashing, money orders, payday loans and so on.\nThat makes more than a quarter of the American populace a target for predatory loan sharks. And an estimated 12 million people take the bait every year. They usually borrow no more than a few hundred dollars, but in just two weeks owe much more than they were lent. The loans roll over, and the vise of debt begins to tighten. “The cycle of debt is what makes these stores so profitable,” said one payday lender in a particularly candid interview.\nLegislation regulating the interest rates and lending practices of alternative financial service providers is an obvious necessity, and good bills do sometimes squeeze through. But to really solve the problem, we need a more radical solution than simply regulating the bottom-feeders. We need to give them less to feed on. In a new paper from the Roosevelt Institute, researchers Thomas Herndon and Mark Paul suggest a concrete solution: a public banking option.\nIn a world where nearly everything costs money, nearly everybody needs financial services. And yet we leave the provision of those services to private banks, which are institutions that exist to maximize profit for executives and shareholders, not to serve the public. Herndon and Paul advocate for the creation of a government-run financial entity tasked with the “public provision of household financial services” which would “create the financial infrastructure required for universal service.”\nHerndon and Paul recommend that a public bank be established as a government corporation, or a state-owned firm that is required to generate enough revenue to cover its own operating costs — but, without executive salaries and shareholder dividends to pay, no more than that. The bank would be a member of the Federal Reserve system, and it would be regulated by the Consumer Financial Protection Bureau. It would offer basic deposit and transactions services, including a checking account that would come with a debit card, which could in turn be used at charge-free public ATMs. And it would offer loans of varying sizes on “transparent, affordable terms that shielded borrowers from risk” — the complete opposite of how payday lenders operate today.\nPublic banking is not a new idea. It’s done around the world, and one iteration — postal banking — was actually done successfully in the United States for half a century. Progressives have increasingly advocated for the return of postal banking.\nBut Herndon and Paul argue that postal banking doesn’t really cut it, in part because the point of the public bank they envision is not simply to supplant alternative financial services; it’s also to compete with private banks, and compel them to rein in their own exploitative practices. Having a fully-functioning public bank would hold traditional banks’ feet to the fire, placing “the burden of proof on the lender to convince the borrower that the additional loan terms added value for consumers, rather than shifting risk towards the consumer.”\nHerndon and Paul recommend that the public bank operate as a separate entity without competitive restrictions, but still partner with the postal service. This would facilitate universal access, since while private banks increasingly turn their backs on poor areas, there is already a brick-and-mortar post office in every ZIP code in the country.\nUltimately socialists believe that we should eliminate private ownership of the means of production, including private banks, altogether. But we also don’t imagine this is possible until a mass working-class movement coheres that can carry out such an ambitious program. In the meantime, if a public banking system were established offering a diverse range of financial services, not for profit, in every ZIP code in the nation, nobody in the U.S. would be unbanked or underbanked anymore. And predatory lenders would have nobody to prey on.", "url": "https://jacobinmag.com/2018/08/public-state-owned-bank-finance-nationalized-banking"}