{"authors": ["Kathleen Parker"], "date_download": "2020-05-04 20:27:13", "date_modify": "2020-05-04 20:27:13", "date_publish": "2018-11-07 23:12:51", "description": "As the famed author Pat Conroy began his journey from this earth two years ago, he might have dreamed of weekends like this. To see one of his dying wishes realized — to continue his life’s...", "filename": "_b1a19e6bc65c47a9be03f5b4c680a8ba_1588624033.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b1a19e6bc65c47a9be03f5b4c680a8ba_1588624033.html", "title": "Pat Conroy - the ‘Prince of Scribes’", "title_page": "Pat Conroy — the ‘Prince of Scribes’", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As the famed author Pat Conroy began his journey from this earth two years ago, he might have dreamed of weekends like this.\nTo see one of his dying wishes realized — to continue his life’s work nurturing and mentoring readers and writers — he might have also found himself at a loss for words.\nThis would have been a rarity for a man who found so many words tumbling around in his head that he had to put them down on paper — literally and in longhand — to tell his stories. The result was a library of best-sellers, some of which became blockbuster movies, including “The Water is Wide” (”Conrack” in its film adaptation), “The Great Santini” and “The Prince of Tides.”\nThe long weekend of Nov. 1-4 marked the third annual Pat Conroy Literary Festival in Beaufort, South Carolina, featuring book talks, Lowcountry tours, writing workshops, and strolls and carriage rides throughout Conroy’s beloved hometown, where he landed at age 15 when his father, a Marine pilot (famously portrayed by Robert Duvall in “The Great Santini,”) was stationed here.\nConroy fell in love with the marshes and waterways of this moss-draped, antebellum town and missed nothing of its wild grandeur. The combination of a tortured childhood, a brutal father, a mother whose “eyes were our keys to the palace of wildness,” his beloved high school English teacher, Gene Norris, as well as a wide cast of other characters and creatures inspired a body of work that introduced millions to a place that will always belong to the man who defined it.\n“My wound is geography,” Conroy began the prologue to “The Prince of Tides.” “It is also my anchorage, my port of call.”\nWhen I first read those words many years ago, my breath stopped. I knew I was about to enter a world I loved as much as Conroy. With that book in particular, he engraved a blessing upon the souls of every Lowcountry boy and girl (like me) who grew up seeing, smelling and tasting the same enchanted, haunted landscape. He saw what we saw but could describe it in ways we could only dream. We may have been children of the pluff mud — that dark taupe-y sludge that nourishes the tall grasses and burbles to the mystery of undercurrents. But Conroy wrapped words around our senses so that we knew, finally, why we would always return to the marsh.\nHis descriptions of all that inhabited the watery ecosystem surrounding Beaufort opened eyes that had never seen this part of the country: “ospreys slept with their feathered, plummeting dreamselves screaming through deep, slow-motion dives toward herring.”\nThis excerpt from the same prologue corresponds to Conroy’s tribute to his mother, who also had a way with storytelling and a gift for naming things. A monarch butterfly was an “orchid-kissing blacklegs,” and a field of daffodils was a “dance of the butter ladies bonneted.”\nNo wonder Conroy became a writer.\nHe also inspired a generation of authors, many of whom gathered in Beaufort to pay homage to their friend and mentor and to celebrate a special feature of this year’s festival — a just-published book of remembrances to which they and many others contributed. The book, “Our Prince of Scribes,” isn’t just a collection of homages but also a delightful introduction to Conroy’s vast and talented circle of talented friends.\nConroy and I knew each other well, and he was always generous with his praise and encouragement. He celebrated my milestones, commented on columns and mentored my son. As he did with so many others, he urged me to write my story, which I hope to do before the bell tolls for me.\nMy favorite memory of Conroy was when we were two of 10 eulogists for Conroy’s “best friend,” editorial cartoonist Doug Marlette, who was also my “best friend.” We three had earlier formed a daily morning conversation, with Marlette as middleman, that lasted several years. Crushed beyond despair by the sudden death of our genius friend, we were barely verbal.\nSomehow we got through our tributes with lots of help from our teammates. Conroy adored the way we supported each other during the service, patting each eulogist’s back as he or she returned to sit down. He named us “Team Marlette.” It’s obvious now that Conroy was our coach.\nNow, I suppose, we are “Team Conroy,” and his words will have to see us through another season. He would love that, I think.\nkathleenparker@washpost.com", "url": "https://apnews.com/b1a19e6bc65c47a9be03f5b4c680a8ba"}