{"authors": ["George Guido"], "date_download": "2020-05-04 20:16:40", "date_modify": "2020-05-04 20:16:40", "date_publish": "2018-10-17 04:30:53", "description": "A few weeks ago, it looked as if the 58-year streak of Alle-Kiski Valley teams making the WPIAL football playoffs might end. But Freeport caught fire, and the Yellowjackets need a victory...", "filename": "_51ccf391e0174c90986cfa80fa89d0ec_1588623400.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_51ccf391e0174c90986cfa80fa89d0ec_1588623400.html", "title": "George Guido: A few A-K Valley teams holding onto playoff hopes", "title_page": "George Guido: A few A-K Valley teams holding onto playoff hopes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A few weeks ago, it looked as if the 58-year streak of Alle-Kiski Valley teams making the WPIAL football playoffs might end.\nBut Freeport caught fire, and the Yellowjackets need a victory against Mt. Pleasant at home Friday to secure the final playoff berth from the Class 3A Big East Conference.\nIt would be the 28th playoff appearance for Freeport, most in area history.\nFreeport is done with conference play Friday and will have what it hopes will be a playoff tuneup against Knoch on Oct. 26.\nSeveral teams are mathematically alive for playoff berths, though in Kiski Area’s case, the Cavaliers need either a victory over Mars this week or at Armstrong next week to get in.\nHere are several other schools who are on the fringe of contention:\n• Fox Chapel -- The Foxes need a win at Armstrong on Friday to remain in contention. But the loser of Fox Chapel-Armstrong is still alive for a wild card if Kiski Area loses to Mars and Shaler loses to North Hills.\nFive teams from each Class 5A conference qualify, and one wild card is available.\n• Highlands -- The Golden Rams playoff hopes are flickering like a candle in the rain.\nThe loser of Friday’s Highlands-New Castle game is eliminated. The Golden Rams need to win, plus hope Beaver loses to Montour and Blackhawk.\nIf that happens, Highlands, Beaver and Knoch will be tied for fourth place, the final Class 4A playoff spot.\nSince the head-to-head record between those teams is 1-1, we would have to go for the point differential, in which teams get up to plus- or minus-10 Gardner Points in the margin-of-victory criteria. Right now, Beaver is plus-8, Knoch is minus-12 and Highlands is minus-17.\nSo Highlands has to defeat New Castle by at least six and hope Beaver loses by substantial margins to stay in the conversation.\n• Deer Lakes -- If Freeport loses, the Lancers would have to defeat Derry and North Catholic and hope Yough loses to North Catholic or Elizabeth Forward.\nThat’s a tall order.\n• Valley -- That 2-point conversion Friday against Summit Academy last Friday looms big for the Vikings. Simply put, the winner of Valley at East Allegheny on Oct. 26 clinches a playoff spot.\nThe WPIAL playoffs begin Nov. 2.\n101-6\nThe howling has been long and loud over the past few days because of Massillon, Ohio’s 101-6 drubbing of Sun Valley.\nMassillon, the second-winningest high school football program in the nation, had an open date and scheduled Sun Valley, a school from the Philadelphia suburb of Aston that also had a vacancy.\nSun Valley got a check for its troubles and the players toured the Pro Football Hall of Fame in Canton on Thursday, but that was about it.\nSun Valley trailed, 17-0, at the end of the first quarter, but things unraveled after that as the Tigers scored 56 points in the second quarter, including three touchdowns in a 61-second span. A punt and two pass interceptions were returned for scores as Massillon led 73-6 at the half.\nWith the clock running in the second half, Massillon reportedly put in its second- and third-stringers. But Sun Valley lost three skill position players and couldn’t stop the rampaging Tigers.\nIt was 94-6 at the end of three quarters, and Massillon scored on a 77-yard run to hit the century mark.\nMassillon broke its school record for points, previously set in a 94-0 rout over Akron North in 1922.\nThe last A-K Valley school to give up 100 points in a game was Vandergrift in 1923, suffering a 100-0 beatdown against Latrobe.\nIn 1926, Apollo blasted Plumville, 131-0.\nBut it must be noted in those days, after a team scored a touchdown, it had the option of kicking off or receiving. We’re figuring there wasn’t much kicking off in those 1920s shellackings.", "url": "https://apnews.com/51ccf391e0174c90986cfa80fa89d0ec"}