{"authors": ["Steve Terrell", "The New Mexican"], "date_download": "2020-05-04 20:21:05", "date_modify": "2020-05-04 20:21:05", "date_publish": "2018-03-06 06:00:00", "description": "A group of 33 Republican legislators are calling for the head of Allen Sanchez, executive director of the New Mexico Conference of Catholic Bishops, for a statement that racism played a role in...", "filename": "_bd4a3c53ad094df4ae77b3991116391a_1588623665.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bd4a3c53ad094df4ae77b3991116391a_1588623665.html", "title": "GOP legislators seek reprimand of Catholic official following comments on early ed proposal", "title_page": "GOP legislators seek reprimand of Catholic official following comments on early ed proposal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A group of 33 Republican legislators are calling for the head of Allen Sanchez, executive director of the New Mexico Conference of Catholic Bishops, for a statement that racism played a role in the opposition to a Catholic Church-backed proposal to increase funding for early childhood education.\n“The political debate is divisive enough in this country and this state without unwarranted accusations of racism being thrown about without evidence,” the letter, addressed to Santa Fe Archbishop John Wester says. “The fact that this accusation was levied [sic] by a representative of the Catholic Church only makes it more troubling,” the letter said.\nThe lawmakers asked whether Sanchez was “indeed accurately relaying your position on this matter with his remarks.” And if not, they asked that “strong disciplinary action” be taken against Sanchez “and that he no longer serve as a spokesman for the Conference of Catholic Bishops in New Mexico.”\nSanchez made his controversial remarks at a Feb. 14 candlelight vigil outside the Capitol in support of a proposed amendment to the state constitution that would take an additional one percent from the state Land Grant Permanent Fund to pay for early childhood programs.\n“We feel there’s an element of racism here,” he said. “If you look at the footage of the hearings around this proposal, the opposition came from people with power and wealth. They don’t understand what is going on in our communities with poverty.”\nThe constitutional amendment, known as House Joint Resolution 1, passed the House on a 36-33 vote. It died in the Senate Finance Committee Chairman after John Arthur Smith, D-Deming, refused to hold a vote on it. Smith said it didn’t have enough votes to pass.\nSanchez couldn’t be reached for response on Monday. In interviews since his controversial remarks, he has told reporters he was talking about “institutional racism” not personal bigotry. Referring to Smith, Sanchez told The New Mexican last month, “I don’t see him having a personal racial bias. But his decision reflected an institutional racism.”\nThe letter from Republican legislators said opposition to House Joint Resolution 1 crossed political, ethnic, religious, and demographic lines, and opponents hailed from every region of New Mexico.\n“As leader of the Archdiocese of Santa Fe do you condone this type of political debate?” the GOP letter asks Wester. “Are you comfortable with the Catholic Church being represented in this manner? Does the Church wish to set the example that the political ends justify the rhetorical means?”\nIn the House vote most of the no votes came from Republicans — several of whom are Hispanic or belong to other minority groups. One of the two Democrats to vote against it was a Hispanic, Rep. Bobby Gonzales, D-Taos, a former school superintendent.\nContact Steve Terrell at 505-986-3037 or sterrell@sfnewmexica­n.com. Read his blog at http://www.santafenewmexican.com/roundhouse_roundup.", "url": "https://apnews.com/bd4a3c53ad094df4ae77b3991116391a"}