{"authors": ["Randy Johnson"], "date_download": "2020-05-04 20:07:04", "date_modify": "2020-05-04 20:07:04", "date_publish": "2018-03-05 19:19:54", "description": "College football doesnt return in earnest for almost six months, but well be getting glimpses of the sport from spring practices in March and April. For the Gophers and second-year coach P.J....", "filename": "_59c3c9b3b5c34d2581da6963f4d4bbd7_1588622824.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_59c3c9b3b5c34d2581da6963f4d4bbd7_1588622824.html", "title": "As spring football practices begin, Gophers face a boatload of questions", "title_page": "As spring football practices begin, Gophers face a boatload of questions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "College football doesnt return in earnest for almost six months, but well be getting glimpses of the sport from spring practices in March and April. For the Gophers and second-year coach P.J. Fleck, that begins Tuesday, with the first of 15 sessions, including the April 14 spring game.\nThe Gophers coming off a 5-7 season that featured major adjustments as Fleck installed his program and its Row the Boat culture enter spring ball with momentum from a recruiting Class of 2018 that ranked among the top 25 on early signing day and hope that continued development will produce results. After closing the 2017 season with losses to Northwestern and Wisconsin by a combined 70-0, Minnesota faces a 2018 schedule that features games against seven bowl teams and five Big Ten road trips. A productive spring could help the team hit the ground running in training camp in August.\nFleck and his coaching staff will have plenty of questions to address with this team. Here are some of the biggest ones entering spring practice:\nWholl be the quarterback?\nThis, of course, is the question that will determine much of Minnesotas success in 2018. Gone are last years co-starters Demry Croft (transferred to Tennessee State) and Conor Rhoda (graduated). Neither Croft nor Rhoda was a difference-maker, with the Gophers ranking 122nd in FBS in passing offense (126.1 yards per game) and 123rd in total offense (308.5). The Gophers had only nine touchdown passes all year.\nSo, Minnesotas aim is to get much more productivity from under center, and the top two candidates to do so are Vic Viramontes of Riverside (Calif.) City College, the nations top-ranked dual-threat junior college QB in the 2018 recruiting class, and Tanner Morgan, who redshirted for the Gophers last year. On his WCCO Radio appearance Sunday, Fleck also mentioned two others as in the mix: third-year sophomore Seth Green and freshman Zack Annexstad of IMG Academy in Bradenton, Fla., who enrolled in January.\nHowever, dont expect spring practice to determine the 2018 starter. Its going to be a fun battle, all the way through spring, and its going to go into training camp as well, Fleck said. This isnt something where Ill name a starter after 15 spring practices.\nWho will carry the ball?\nThe Gophers are in decent shape here, with seniors Rodney Smith (977 rushing yards in 2017) and Shannon Brooks (359 yards, five TDs) returning. Brooks was limited to six games last year because of a variety of injuries, but Fleck recently said hes ready to go. Bruising back Kobe McCrary used up his eligibility, but junior Jonathan Femi-Cole could take his place.\nWho will catch the ball?\nThe Gophers found out how reliant they were on leading receiver Tyler Johnson, who broke a hand against Nebraska and missed the final two games, in which Minnesota had a combined five receptions for 83 yards. Johnson, who led the team with 35 catches for 677 yards and seven TDs, should build on that solid sophomore season. The return of freshmen Demetrius Douglas and Chris Autman-Bell from injuries should help. Fleck said he remains confident that Douglas, who played three games last year before being injured, will qualify for a medical redshirt from the NCAA.\nHow is the offensive line?\nHealthier and larger. Last spring, the Gophers at time were down to four healthy linemen, but that isnt the case this year. Senior center Jared Weyler will benefit from a full spring, and Fleck raved about the development of sophomore guard Conner Olson.\nAn intriguing part of spring practice will be seeing the progress of massive early enrollees Curtis Dunlap Jr. (6-5, 370 pounds) and Daniel Faalele (6-9, 400) of IMG Academy. The big question is which ones to we redshirt and which ones we play, Fleck told WCCO of his seven incoming freshman linemen.\nIs there a new Stove?\nThe Gophers will miss four-year defensive tackle starter Steven Stove Richardson, but they have candidates to replace him in Gary Moore (287 pounds), Royal Silver (292) and Alabama transfer O.J. Smith (309). In addition, Fleck said sophomore Nate Umlor (269) has moved to an interior position.\nHows the secondary?\nA key in the defensive backfield will be the return to health of standout safety Antoine Winfield Jr., who was limited to four games in 2017 because of a hamstring injury. Fleck is confident Winfield will receive a medical redshirt and retain a year of eligibility, which would make 2018 his sophomore year.\nAlso back is safety Jacob Huff, who led the team with three interceptions, including one he returned for a touchdown. Coney Durr, hampered by a knee injury from the 2016 Holiday Bowl, and Antonio Shenault could man the cornerback spots, where the Gophers lost Duke McGhee and Adekunle Ayinde to graduation.", "url": "https://apnews.com/59c3c9b3b5c34d2581da6963f4d4bbd7"}