{"authors": ["Dave Lavender The Herald-Dispatch Lavender Herald-Dispatch.Com"], "date_download": "2020-05-04 20:06:28", "date_modify": "2020-05-04 20:06:28", "date_publish": "2018-10-22 08:25:50", "description": "HUNTINGTON — With one long and winding scenic train ride, Becky Bumgarner's bucket list just got a little bit shorter. On Sunday, Bumgarner, a retiree who lives in Chesapeake, Ohio, got to...", "filename": "_eebb62f3299f4c449c3e49928c29261f_1588622788.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eebb62f3299f4c449c3e49928c29261f_1588622788.html", "title": "New River Train rides again in Huntington", "title_page": "New River Train rides again in Huntington", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON — With one long and winding scenic train ride, Becky Bumgarner’s bucket list just got a little bit shorter.\nOn Sunday, Bumgarner, a retiree who lives in Chesapeake, Ohio, got to take her first trip on the famed New River Train during its annual fall foliage trips from Huntington to Hinton and back.\nBumgarner is one of about 5,000 riders who will enjoy one of the day-long trips during the train’s four-day run.\nThe Collis P. Huntington Railroad Historical Society ran trips this past weekend on Saturday and Sunday, and have two more remaining on Saturday and Sunday, Oct. 27-28.\n“It has been amazing,” Bumgarner said by phone from the train. “It’s like sitting on a rocking chair on the porch with the breeze blowing in you hair. It is really comforting. It really is a wonderful experience.”\nAs has been the tradition in recent years, Jim Rumbaugh of the Huntington Harmonica Club and the Huntington Blues Society, has gathered up a handful of members to walk the aisles playing a wide range of blues and folk songs, including “Riding On That New River Train.” New this year is “The New River Line,” a song he and Karen Combs worked up based off of the traditional folk song,“Rock Island Line.”\nAfter winding their way through the New River Gorge — often called the Grand Canyon of the East — train passengers disembark in the historic New River Gorge town of Hinton for that city’s Railroad Days Festival, which continues 9 a.m. to 4 p.m. Saturday-Sunday, Oct. 27-28, when Hinton’s streets are filled with a variety of vendors, food, live entertainment and visitors can tour the Hinton Railroad Museum and take carriage rides through the Historic District.\nTyson Compton, president of the Cabell-Huntington Convention & Visitors Bureau, said the four trips bring in 5,000 people who have an economic impact of about $3.5 million in the local economy.\n“What makes it so exciting is that they are literally coming from all over the country,” Compton said Sunday by phone. “On Friday, we had visits in the Visitor Center from both sides of the country — California and South Carolina. For so many of them, this is their first time in West Virginia and their first time in Huntington. What makes it so exciting for us is that it is such a great experience for those people that they are going back and saying great things about Huntington and about West Virginia.”\nThe annual fall tourist train, which is made of three Amtrak locomotives and 30 privately owned passenger cars, was in danger of being canceled this year. And it is not a given for next year.\nIn the spring, the federal government slashed Amtrak’s budget causing the nation’s train service to announce that at the end of March it would end charter and special service trains.\nAfter intervention from West Virginia’s senators and congressmen, Amtrak and the Railroad Historical Society were able to work out a general agreement on pricing that allowed them to continue service for the New River Train that uses Amtrak locomotives and crews on CSX Transportation’s main line through West Virginia.\n“We were very excited it was worked out for them to continue this year,” Compton said. “When it first came up, tickets had already been sold and advertising was out there, and it was a very delicate situation. We appreciate our elected officials who went to bat for us to ensure it would happen this year.”\nAlthough the New River Train, one of the largest mainline excursion trains in the United States, was saved, the Railroad Historical Society had to pull the plug on a couple dozen other trips that were planned to run out of Huntington in 2018. One of those themed trips includes the popular Holiday Train that ran last year for the first time during the Christmas season.\nAnd the Collis P. Huntington Railroad Historical Society has had to operate sight-seeing, tourist train trips out of other locations.\nIn September, they ran their first Adirondack fall foliage trip from New York City to Montreal and back through the great forested expanse of the Adirondacks in upstate New York.\nThey have a Thanksgiving Day Parade trip that leaves Charlotte, N.C., on Wednesday, Nov. 21, for New York City. That trip is on privately owned lounge cars that will attach to a regularly schedule Amtrak train. It returns Sunday, Nov. 25, arriving back in Charlotte about 9 p.m.\nOther fall trips scheduled by the Huntington-based tourist train include The Albany Limited, a Dec. 8-9 and Dec. 15-16 trip that begins and ends in New York City with a trip up into upstate New York and back.\nCompton said they are keeping a close eye on the situation for next year.\n“I hate to say this, but we are still in a precarious situation, and they have not confirmed yet that it will continue,” Compton said. “We would hate for this to be the last year, but there is still some negotiating to be done. For people following the story, it is across the country — that Amtrak has changed their policy with moving private cars. Some of the smaller events have already gone away.... We are hoping we can again see this major event, which has a huge economic impact on both Huntington and Hinton and really across the state. A lot of these people don’t just come for the train but also visit other parts of the state while they are here.”\nRIDING ON THE NEW RIVER TRAIN\nThe Collis P. Huntington Railroad Historical Society ran New River Train trips this past weekend on Saturday and Sunday, and have two more remaining on Saturday and Sunday, Oct. 27-28.\nFor more information on The New River Train and the Collis P. Huntington Railroad Society, visit www.newrivertrain.com and https://www.facebook.com/newrivertrain/.", "url": "https://apnews.com/eebb62f3299f4c449c3e49928c29261f"}