{"authors": ["Chuck Landon"], "date_download": "2020-05-04 20:20:00", "date_modify": "2020-05-04 20:20:00", "date_publish": "2018-02-08 08:57:01", "description": "Good-bye, apprehension. Hello, confidence. In one fell swoop that's how much the attitude of Marshall's football fans changed on Wednesday. Why? There was only one reason.", "filename": "_597d7b6181d041f2a176cfca50c8595a_1588623600.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_597d7b6181d041f2a176cfca50c8595a_1588623600.html", "title": "New QB just what the 'Doc' ordered", "title_page": "New QB just what the 'Doc' ordered", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "New QB just what the ‘Doc’ ordered\nGood-bye, apprehension.\nHello, confidence.\nIn one fell swoop that’s how much the attitude of Marshall’s football fans changed on Wednesday. Why? There was only one reason.\nA new starting quarterback.\nWhen Alex Thomson fell out of the snowy, rainy sky and landed in Marshall’s lap on National Signing Day, it suddenly became a very sunny day.\nForget the sleet. Forget the snow. Forget the freezing rain.\nMarshall has a very promising new starting quarterback and there isn’t a meteorologist on the planet that could rain on that parade.\nThat certainly wasn’t the case going into the day. Instead, trepidation ruled.\nChase Litton had bailed on his final year of eligibility, declaring for the NFL Draft. That left untested redshirt freshman Isaiah Green as the incumbent starting quarterback backed up by only Garet Morrell.\nConsidering the next collegiate snap Green takes will be his first, that didn’t exactly fill the Herd faithful’s hearts with confidence.\nBut then inexplicably a late-blooming quarterback from New Jersey by way of an FCS program in Staten Island, N.Y., suddenly changed everything on Wednesday.\nThat’s because there isn’t a more important player in Marshall’s 2018 recruiting class than Thomson. He could be the linchpin to success. Yes, he possesses that much potential.\nNot bad for a kid who was once so lightly regarded as a quarterback, his only recognition in prep football was making thirdteam punter on the Asbury Park (N.J.) Press newspaper’s All-Shore team.\nOr should that be ah, sure?\nAnyway, Thomson earned an academic scholarship to Wagner, so he joined the football team as a walk-on. Rather humble beginnings for a guy who now is considered a bona fide NFL prospect, huh?\nAh, the beauty of sports.\nThomson parlayed that chance into a scholarship, grew to an impressive 6-foot-5, 225-pound specimen with 4.7 speed and a powerful arm and, then, passed for 2,436 yards with 16 touchdowns and only five interceptions his sophomore season.\nHis future was almost as bright as Nick Foles’. But, then, after only two games in 2017, Thomson was sidelined for the rest of the season with a shoulder injury. Since he carries a 3.55 grade-point average and will graduate in the spring with a degree in Finance, Thomson decided to test the graduate transfer waters.\nSeveral schools were interested, but in the final analysis it boiled down to three contenders — Tennessee, Baylor and Marshall. The Vols offered Thomson a blueshirt, which meant he couldn’t make an official visit and wouldn’t be on scholarship until the first practice of preseason camp. That was less than enticing.\nThomson made a visit to Baylor, but the Big 12 school obviously is still trying to dredge its way out of the aftermath of a seamy scandal. That isn’t very attractive, either.\nThat left Marshall whose resume included an 8-5 record in 2017 and nine returning starters on offense, but, alas, no starting quarterback. Cha-ching.\n“I just think Marshall is the best fit for me,” Thomson told Yahoo Sports’ Pete Thamel on Tuesday night. “I had great communication with the coaching staff. I can see myself winning a conference championship there.”\nBe still your hearts, Marshall fans.\nA richly talented quarterback drops out of the sky and into Almost Heaven and even speaks the very words Marshall’s fans want to hear. What a glorious day.\nIsn’t it amazing how one recruit can change so much?\nMaybe, just maybe, the excitement might return to MU football.\nChuck Landon is a sports columnist for The Herald-Dispatch. Contact him at clandon@herald-dispatch.com.", "url": "https://apnews.com/597d7b6181d041f2a176cfca50c8595a"}