{"authors": ["Chris Bosak"], "date_download": "2020-05-04 20:12:46", "date_modify": "2020-05-04 20:12:46", "date_publish": "2018-04-06 18:15:35", "description": "A store with roots going back more than 90 years in Danbury has closed its doors. Klaff’s, an upscale home design retailer, last week closed its showroom at 11 Newtown Road as it...", "filename": "_4bac230c046b4126ad1bacff53a11de1_1588623166.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4bac230c046b4126ad1bacff53a11de1_1588623166.html", "title": "Klaff’s closes Danbury store; clearance sale pending", "title_page": "Klaff’s closes Danbury store; clearance sale pending", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A store with roots going back more than 90 years in Danbury has closed its doors.\nKlaff’s, an upscale home design retailer, last week closed its showroom at 11 Newtown Road as it restructures its business and shifts its focus on digital platforms. The retail locations in South Norwalk and Scarsdale, N.Y., will remain open.\nKlaff’s is considering converting its Danbury location into an outlet center and possibly its corporate offices. For now, the Danbury store remains closed as it prepares for a clearance sale. Dates for the sale have not been announced.\nKlaff’s Chairman Joe Passero, whose grandparents Joe and Mary Klaff founded the business in 1921, was at the Danbury location Friday afternoon as employees prepared for the clearance sale. Passero said the Danbury store used to perform well, but has dropped off in recent years.\n“After serving over 90 years in Danbury we have closed this location with plans to reopen temporarily for a clearance sale later this spring,” a note on the company’s website reads.\nBill Oakes, Klaff’s chief operations officer, said all orders previously made at the Danbury store will be fulfilled through the company’s Norwalk customer service center. He said key staff members will be relocated to Klaff’s other locations.\n“Klaffs.com generates a substantial amount of traffic, as does KLAFFStyle, our home design magazine — and we’re also seeing our Scarsdale and SoNo stores as favorite stops for an increasing number of top designers, architects and builders,” Passero said in a release. “They’re constantly coming in to talk design and see new products. We see our growth trajectory in these areas and are exploring other strategically located showrooms, and other avenues of business, to accommodate them.\n“Through our in-store and online offerings, we are dedicated to providing everyone a chance to enhance their home, life and style with our quality products,” added Passero.\nIn January, Klaff’s put up for sale the building housing its corporate offices on Water Street in South Norwalk. Its flagship store is on Washington Street in South Norwalk.\nIn 2015, Klaff’s marked its 95th year in business by launching a new look, logo and products.\nThe writer may be reached at cbosak@hearstmediact.com; 203-731-3338", "url": "https://apnews.com/4bac230c046b4126ad1bacff53a11de1"}