{"authors": ["Erin Kayata"], "date_download": "2020-05-04 20:23:05", "date_modify": "2020-05-04 20:23:05", "date_publish": "2018-10-22 21:11:53", "description": "STAMFORD — Gender may have a stricter definition under a new federal government proposal, but in Stamford, things remain fluid. The Ferguson Library has removed from its library card...", "filename": "_b4efe460b0b24e6a84e0d33caf4f7394_1588623785.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b4efe460b0b24e6a84e0d33caf4f7394_1588623785.html", "title": "Stamford library removes gender question from card applications", "title_page": "Stamford library removes gender question from card applications", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STAMFORD — Gender may have a stricter definition under a new federal government proposal, but in Stamford, things remain fluid.\nThe Ferguson Library has removed from its library card application a line to identify gender in a bid to be more inclusive for those who may be struggling with gender identity or transitioning to a different sex.\nThe announcement comes as the U.S. Department of Health and Human Services (HSS) pushes to define sex as biological, either male or female and unchangeable, according reporting from The New York Times, which cited a recently obtained memo drafted by HSS. The policy would define gender by the genitals someone is born with, which critics argue invalidates people who are transgender or choose not to identify as either male or female.\n“I try really hard not to politicize the library,” said Erin Shea, supervisor at the Harry Bennett, Weed Memorial and Hollander library branches of Stamford’s library system. “I don’t feel creating a safe space for transgender people is politicizing...The more we can move toward accepting people for how they choose to identify, the better. I’m very happy the library can make really tiny steps. Taking gender off is not going to inconvenience anyone, regardless of how they identify.”\nThe shift to make Stamford libraries more inclusive began around 2016, when North Carolina passed a law requiring people to use only the bathrooms corresponding to the sex on their birth certificate at government buildings and schools.\nShea said there was a lot of conversation in the librarian community after this about how to make libraries more inclusive. One of the suggestions was providing gender neutral bathrooms.\nShortly afterwards, the Ferguson decided to make the two single-stall restrooms at the Harry Bennett Library on Vine Road gender neutral. When they did, a transgender man from the Norwalk-based LGBTQ resource center Triangle Community Center, came in to talk to the library staff about what the change meant and why it’s being done.\n“We all want to be more welcoming to the community,” Shea said. “Some of us just don’t have the knowledge.”\nThe speaker gave other suggestions about how to make libraries more inclusive, which included not asking for gender on library application forms. Shea consulted the National Library Organization, which suggested the same.\nShea proposed the change at a supervisors’ meeting last week, where it was met with approval.\n“I was worried it would be too radical for the library, but everyone was extremely receptive,” she said. “I questioned what we used people’s gender for and the answer was we don’t really use it.”\nGender data had been collected for demographic purposes, director of public services Susan LaPerla said, but was not beneficial for the library.\nConor Phifer, a TCC development officer, said this is the first library in the area he’s heard of that has made this change. The Ferguson has worked with TCC in the past on training for staff.\n“We’re very happy with the changes implemented by the Ferguson Library,” Phifer said. “This reduces a systemic barrier and provides access to great services at the Ferguson. We hope this is replicated elsewhere locally.”\nOnline application forms have already changed, and will be implemented in the next round of print library card applications.\nIn addition to removing gender on the application form, the Ferguson hosts Stamford Lighthouse, now in its fifth year, which is a meeting group for lesbian, gay, bisexual, transgender and queer teens and their allies.\n“It definitely sends the signal that everyone can consider this a safe space, a non-judging space where they can come and be with their friends, use their resources and feel as comfortable as anyone else might feel here,” LaPerla said.\nerin.kayata@stamfordadvocate.com; (203) 964-2265; @erin_kayata", "url": "https://apnews.com/b4efe460b0b24e6a84e0d33caf4f7394"}