{"authors": ["Evan Macdonald"], "date_download": "2020-05-04 20:09:59", "date_modify": "2020-05-04 20:09:59", "date_publish": "2018-02-12 12:00:00", "description": "Cuyahoga County looks to Dayton as model for rehabilitating youth, reducing juvenile crime CLEVELAND, Ohio -- For the past five years, Cuyahoga County taxpayers have paid to try to make...", "filename": "_16b2711253684090b83b659d904b3384_1588622999.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_16b2711253684090b83b659d904b3384_1588622999.html", "title": "Cuyahoga County looks to Dayton as model for rehabilitating youth, reducing juvenile crime", "title_page": "Cuyahoga County looks to Dayton as model for rehabilitating youth, reducing juvenile crime", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cuyahoga County looks to Dayton as model for rehabilitating youth, reducing juvenile crime\nCLEVELAND, Ohio -- For the past five years, Cuyahoga County taxpayers have paid to try to make Montez Cobb a better person -- after his first arrest at age 12 for stealing a snowblower, after subsequent arrests for fighting and violating probation, and ultimately for his prosecution as an adult for a string of armed robberies.\nThe 17-year-old boy’s odyssey -- and those of other juveniles mired in the system -- has caused officials to rethink how they deal with these young offenders. Recently, prosecutors and juvenile court officials have turned their attention to Montgomery County, which for two decades has taken a different approach to juvenile justice than here.\nThe results are dramatically better.\nCuyahoga County Prosecutor Michael O’Malley has pointed to Cobb’s case while calling for a different approach to juvenile crime in this county. Offering services such as individual and family counseling, mediation, mental health treatment and substance abuse treatment to offenders in the days and weeks after an arrest – rather than when the case is resolved months later – could address issues at home and at school and keep juveniles from re-offending and escalating to more serious crimes, O’Malley said.\n“We see what’s going on in the streets. Nobody can possibly feel good,” O’Malley said during a recent meeting with cleveland.com editors and reporters. “We have to do something different.”\nA Jan. 8 riot at the Juvenile Detention Center – coupled with a rise in violent crimes involving juveniles – has reignited calls for reform from O’Malley and city council members. The Cuyahoga County Juvenile Court’s administrative judge said she would be open to a process to allow dangerous inmates to be held in a separate wing at the adult Cuyahoga County Jail. But that would require a change in state law, and advocates argue it would run counter to the juvenile court’s core mission of rehabilitating young offenders.\nO’Malley pointed to the Montgomery County Juvenile Court’s Intervention Center as a possible inspiration for criminal justice reform in Cuyahoga County. The Intervention Center assesses young offenders in the hours after an arrest to determine if there are any underlying issues -- such mental health or behavioral issues, or problems at home or at school -- that could be addressed through specialized services.\nThe Intervention Center has significantly impacted Dayton and its suburbs since it opened two decades ago. The juvenile court is seeing fewer cases and admissions to its detention center, and young offenders are benefiting from services instead of being locked up, assistant court administrator Eric Shafer said.\n“I think our attitude, from our judges on down, is that we need to try to assist these families. These are kids, and we have a much better chance at helping them when they’re young,” Shafer said. “Let’s do everything we can to help them have access to justice.”\nIn Cuyahoga County, there are few specialized services available to juveniles immediately after an arrest. Select cases – such as domestic violence arrests – are eligible for programs like emergency foster care, said Bridget Gibbons, the director of programming, training and quality assurance for the Cuyahoga County Juvenile Court’s probation department.\nBut it could be months before a case is adjudicated and a pre-sentencing report determines if the juvenile has any underlying issues those specialized services could address. O’Malley likened it to parenting – if a child is not punished immediately after doing something wrong, the rehabilitative aspect of that punishment is lessened.\n“If you punch your brother and you’re disciplined four months later, it doesn’t have the same impact as being disciplined five minutes later,” O’Malley said.\nHelping juveniles at a critical moment\nThere are often underlying issues that need addressed when a juvenile is taken to the Intervention Center, Montgomery County Juvenile Court administrator Jim Cole said. Research has indicated that approximately 90 percent of young offenders were exposed to a traumatic event sometime before the arrest, according to the National Child Traumatic Stress Network.\n“So many of these families are in immediate crisis,” Cole said. “If you deal with it immediately, it tends to smooth things out down the road.”\nThe Intervention Center is open 24 hours per day and 365 days per year, so juveniles are always getting the help they need right away.\n“There’s no waiting until the next day, or next week,” Intervention Center intake manager Dorian Davis said. “It streamlines that process tremendously.”\nThat access to rehabilitative services is key for kids and teenagers, said Erin Davies, the executive director of the nonprofit Juvenile Justice Coalition, which advocates for better treatment of young offenders. Taking a young person out of a home and placing them in a detention center exposes them to more trauma and can have a negative impact on development, she said.\nJuveniles subjected to detainment are more likely to re-offend, less likely to graduate high school and less likely to find employment than those confined at home or given an alternative to detention, according to research from the Annie E. Casey Foundation’s Juvenile Detentions Alternative Initiative.\nKeeping teens out of a detention center and getting them the help they need is much more effective in dissuading them from committing crimes in the future, Davies said.\n“Any time you’re getting to the root cause for why a young person is committing an offense, the better off you’re likely to be,” she said.\nTeens arrested in Cuyahoga County could see the same benefit if officials establish a similar intervention center. Assistant Prosecuting Attorney Gregory Mussman said the majority of juvenile cases he sees involve teens with mental health, substance abuse, domestic, or behavioral issues that could be addressed through specialized services.\n“It’s easy to just say ’arrest him and throw him in jail,” Mussman said. “It’s so easy, and it accomplishes nothing. They just come out and commit more crimes.”\nHow do you assess a juvenile’s needs?\nMontgomery County’s Intervention Center solicited input from judges, prosecutors, public defenders, the department of children’s services and other agencies to develop a scoring system to determine a youth’s needs and the safety risk he or she poses to the community.\nThe assessments help Intervention Center staff members determine if the case should move through juvenile court or if it can be resolved “unofficially” through diversion, individual or family counseling, mediation, mental health treatment, drug and alcohol treatment or other services.\nThe most serious offenses, like violent crimes involving guns, result in automatic referrals to juvenile court and likely admission to the detention center. Lower-level offenses, like misdemeanor crimes, typically result in releases to parents or guardians.\nStaff members ask questions to assess a juvenile’s social history and determine if they are having trouble at home or at school. They also complete a risk assessment to determine if the juvenile is a risk to himself or herself, or the community.\nCaring for Kids, a program funded by Montgomery County’s Alcohol, Drug Addiction and Mental Health Services Board, also conducts drug and alcohol and behavioral health screenings at the Intervention Center.\nThe entire process is completed in roughly four hours. The information gleaned from the assessments helps a magistrate decide if the child should go to the detention center or referred to some alternative.\n“We’re looking at these youths and determining whether they are a public safety risk, or a flight risk,” Cole said. “If not, we’re going to release them or find an alternative, like electronic home monitoring or emergency foster care.”\nThe Intervention Center is effective because staff members take a straightforward approach when speaking with families, Director Tiffany Dulin said. Families are more likely to buy into services if staff members clearly articulate the steps that can be taken to help a child.\n“For us, changing the mindset helps a lot,” Dulin said. “When [families] understand the assessment and understand what the true goal is, it’s better reached.”\nStatistics show impact of Intervention Center\nThe Intervention Center is a key reason the Montgomery County Juvenile Court has seen fewer cases in recent years. Last year, the juvenile court handled 21 percent fewer delinquency cases and 10 percent fewer unruly cases than it did in 2009, statistics show.\nMontgomery County has also seen a 54 percent drop in admissions to its detention center since 2009. It costs $238 per day to keep a juvenile in the facility, so officials estimated $2.7 million in savings last year compared to 2009.\n“We’re not perfect,” Cole said. “But for the most part, everything is trending downwards.”\nThe Cuyahoga County Juvenile Court has also seen declines in cases in recent years. In 2016, the most recent year statistics were available, the court handled 33 percent fewer delinquency cases and 14 percent fewer unruly cases than it did in 2009.\nBut Cuyahoga County has not seen as large a decline in admissions to its detention center. In 2016, there were only 13 percent fewer admissions to the facility than in 2009.\nMontgomery’s County’s Intervention Center is increasingly reliant on alternatives to its detention center, such as electronic home monitoring, emergency foster care, group homes and issuing summons to appear in court. In 2009, just 19 percent of juveniles referred to the Intervention Center were released to alternatives. Last year, 56 percent of juveniles were released to alternatives.\nCuyahoga County’s stats have remained largely uncharged. In 2016, 59 percent of juveniles in the detention services population were in the detention center instead of an alternative like home monitoring or daily reporting. The number was 56 percent in 2009.\nMontgomery County officials feel detention alternatives allow them to accomplish the goal of rehabilitating offenders without endangering the community.\n“We realize there is a balance. We find ways to hold [juveniles] accountable, because they must be held accountable to learn,” Shafer said. “That doesn’t necessarily mean they have to sit in detention for 45 days. We find ways to do that by coming up with these alternatives.”\nBringing change to Cuyahoga County\nCuyahoga County officials have been discussing a similar assessment center for years, and the framework of a model is currently being finalized, Gibbons, O’Malley and Mussman said.\nJudges, court administrators, prosecutors, public defenders, probation officers and outside agencies all see value in an assessment center, and they can look to other jurisdictions to develop a model for Cuyahoga County, Gibbons said.\n“We service these kids anyway [during probation] with our court-funded programs. If we move these services up, you’re striking when the iron is hot,” she said. “Our goal is to save on the back end if we can treat them faster up front.”\nSignificant details still need to be worked out. It’s unclear where the assessment center would be located and precisely how it would operate. Funding would also be needed to hire employees and partner with a mental health services agency that could provide screenings, Gibbons said.\nO’Malley said recent high-profile crimes involving juveniles have created a sense of urgency to address the issue. But it will take collaboration between the juvenile court, prosecutors, Cuyahoga County commissioners and other officials to establish an assessment center.\n“I’m very hopeful that, [if we work] cooperatively with the judges, people are willing to change,” O’Malley said. “But the key is it has to be a priority.”", "url": "https://apnews.com/16b2711253684090b83b659d904b3384"}