{"authors": ["Natalie Beneviat"], "date_download": "2020-05-04 20:18:39", "date_modify": "2020-05-04 20:18:39", "date_publish": "2018-04-10 23:18:22", "description": "Additions to the Hampton Community Park on McCully Road continue to move forward, with the township receiving state funding toward the sports courts renovations earlier than expected. Alex...", "filename": "_ab32a2c1a3134b8fb8f4d83759cd0f01_1588623519.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ab32a2c1a3134b8fb8f4d83759cd0f01_1588623519.html", "title": "Hampton Park sports court renovations to be completed by June", "title_page": "Hampton Park sports court renovations to be completed by June", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Additions to the Hampton Community Park on McCully Road continue to move forward, with the township receiving state funding toward the sports courts renovations earlier than expected.\nAlex Zarenko, director of community services for the township, said he recently received news that the Pennsylvania Department of Conservation and Natural Resources was already providing $180,000 of the $200,000 it previously awarded to Hampton toward the project.\nThe entire project costs approximately $400,000, and Hampton was awarded half of that from the DCNR more than two years ago. The township also applied for additional outside funding, but was unsuccessful, said Zarenko.\nThus, the council last year included in its 2018 budget $200,000 toward the basketball and street hockey court renovations with an additional volleyball court. This was necessary as Hampton had to begin the project this year in order to keep the DCNR funding, said Zarenko.\nThis early receipt of funding is not seen very often. Hampton had been keeping a good record and communication of its progress and steps so far.\n“They are very pleased with how we’re handling the project to date. This is really unique,” said Zarenko.\nThe new plan will include renovation of two full-size basketball courts and one renovated regulation-size street hockey court. And both of these will be oriented appropriately to the sun, north to south, to diminish glare from the sun, said Zarenko in an earlier interview.\nThe existing basketball court and street hockey court were put in place in 1991 and are quite worn.\nNew to the area will also be a sand volleyball court.\nPittsburgh-area based Northern Athletic Construction is doing the work on the sports courts renovation, while Scottie Concrete is installing the ADA ramp at the site\nAny recent adverse weather conditions have not affected the projected timeline of work, said Zarenko. The project must be complete by June 2 per the grant award and he is confident that will happen.\nOther outdoor additions nearby will be a proposed a trail around the Hampton Township Community Center.\nThe 1-mile-long, 10-foot-wide bituminous loop trail can be used for biking, walking or jogging, according to Susan Bernet, assistant manager for the township. It will also be compliant with American With Disability Act standards.\nMunicipal officials are also proposing the walkway to extend between the high school stadium and the park, according to Christopher Lochner, municipal manager for the township.\nFor this project, the township is planning to apply to the Growing Greener Grant of the Pennsylvania Department of Conservation and Natural Resources at a grant value of $500,000. Lochner does not expect a response until 2019.\nIn addition to seeking grant funding, the Hampton Community Association has been collaborating with the township in raising funds for the trail, including a pool party last summer.\nNatalie Beneviat is aTribune-Review contributor.", "url": "https://apnews.com/ab32a2c1a3134b8fb8f4d83759cd0f01"}