{"authors": ["Rob Schultz", "Wisconsin State Journal"], "date_download": "2020-05-04 20:24:17", "date_modify": "2020-05-04 20:24:17", "date_publish": "2018-04-27 01:35:00", "description": "Wisconsin strengthened its hold as the country’s top cheese producer by making a record 3.37 billion pounds in 2017, which accounted for 26.6 percent of the nation’s production, new data from the...", "filename": "_3978b9ed958842b4b8362d88edb8a839_1588623857.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3978b9ed958842b4b8362d88edb8a839_1588623857.html", "title": "State cheese production in 2017 reaches a record 3.37 billion pounds", "title_page": "State cheese production in 2017 reaches a record 3.37 billion pounds", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Wisconsin strengthened its hold as the country’s top cheese producer by making a record 3.37 billion pounds in 2017, which accounted for 26.6 percent of the nation’s production, new data from the U.S. Department of Agriculture shows.\nIt was the 16th straight year that Wisconsin broke its production record set the previous year, according to data from the National Agricultural Statistics Service. Overall cheese production in the state increased 3.6 in one year.\nNationally, cheese production reached 12.7 billion pounds, a 3.9 percent increase. Eleven of the country’s top 14 cheese-producing states increased production in 2017, according to the NASS data. California was the nation’s second-leading producer at just over 2.5 billion pounds, which was a one-year drop of less than 1 percent.\nWisconsin’s overall production was led by big increases in Hispanic (7 percent), American (5.5 percent) and Italian (3.7) cheese production, the data show.\nCheddar’s continued big comeback helped the American cheese numbers.\nCheddar production reached 704 million pounds, the highest total since 2000, according to the data. That’s a 6.5 percent increase from the previous year and a 28.1 percent increase since 2011 when cheddar production hit the lowest levels since 1975. Wisconsin makes 20 percent of the nation’s American cheeses, according to the NASS data.\nAn Italian record\nProduction in the state of hard Italian cheeses such as Parmesan reached a record 218 million pounds — a one-year increase of 26.6 percent — and that helped the overall Italian cheese production numbers reach a record 1.7 billion pounds, the data shows. Mozzarella, which accounts for 65 percent of the Italian cheese made in the state, increased about 1.5 percent to just over 1.1 billion pounds.\nWisconsin’s Italian cheese production topped the overall cheese production of every other state but California. Wisconsin makes 31.6 percent of the nation’s Italian cheeses, according to the NASS data.\nOverall processed cheese production in Wisconsin increased 1.9 percent, but processed cheese foods and spreads dropped 12.5 percent, the data showed. Also, Swiss cheese production in the state dropped 8.4 percent.\nThe number of plants that manufacture one or more dairy products in Wisconsin increased by four to 206 in 2017, according to the NASS data. That total includes 132 cheese factories, and 41 of them make 87.3 percent of the state’s cheese, the data shows.", "url": "https://apnews.com/3978b9ed958842b4b8362d88edb8a839"}