{"authors": ["Travis Lemon"], "date_download": "2020-05-04 20:20:41", "date_modify": "2020-05-04 20:20:41", "date_publish": "2018-11-18 09:01:46", "description": "I think that it's safe to assume that we all experience some sort of stress around the holidays. While holiday stress is a common experience, that doesn't mean we can't try to do anything about...", "filename": "_d7532295e76c4062a0d192ca2d2a87d6_1588623641.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d7532295e76c4062a0d192ca2d2a87d6_1588623641.html", "title": "Tips for managing Holiday stress", "title_page": "Tips for managing Holiday stress", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "I think that it’s safe to assume that we all experience some sort of stress around the holidays. While holiday stress is a common experience, that doesn’t mean we can’t try to do anything about it. Unmanaged stress doesn’t just make us a little uncomfortable in the short term, it can also wreak havoc on our adrenal glands and our immune system. The last thing we need during the holiday season is a compromised immune system. Here are some tips to help manage stress and keep you happier and healthier during the holidays.\nSupport your adrenals\nConsider taking adrenal-supporting supplements. Healthy adrenal glands help keep you energized and focused while managing stress levels. They need lots of support during stressful times, so start a daily regimen of high-quality B vitamins and adrenal supporting herbs like holy basil, ashwagandha or rhodiola.\nKeep your immune system healthy\nTake a little extra vitamin C. Make sure you are taking enough vitamin D. Eat more whole fruits and vegetables.\nTry supplementing with astragalus. Astragalus is an adrenal-supporting adaptogen that is also known to support a healthy immune system.\nPractice metta\nMetta is a meditation practice that is also known as “lovingkindness” meditation. Studies have shown that regularly practicing metta can help you to focus more on positive emotions while not getting as fixated on problematic ones. Look to the writings of meditation teachers like Sharon Salzberg and Jack Kornfield for detailed practice instructions.\nVolunteer\nThe holidays can be a time when we tend to focus on many of the negative aspects in our lives. A good way to divert that focus and also be of benefit to others is to volunteer. Find a local shelter or church that is hosting a free meal service and help serve the less fortunate. Donate to clothing drives and offer to help distribute the clothes as well. Sign up to deliver for Meals on Wheels.\nIncluding these tips in your holiday routine can be a big step in helping your body and mind be a little better prepared for what can be an otherwise stressful time of year.\nTravis Lemon is a certified herbalist and co-owner of Tulsi at The Market in Huntington. He has worked in the natural health and wellness industry for over 14 years. He can be contacted at travislemonmh@gmail.com.", "url": "https://apnews.com/d7532295e76c4062a0d192ca2d2a87d6"}