{"authors": ["Tom Bragg Hd Media"], "date_download": "2020-05-04 20:05:53", "date_modify": "2020-05-04 20:05:53", "date_publish": "2018-09-26 07:45:45", "description": "MORGANTOWN — Former Texas Tech quarterback Kliff Kingsbury's Red Raider teams have upheld the program's reputation as a pass-happy bunch, and the 2018 version is no different. No. 25 Texas...", "filename": "_23fec49b79d64a6989b04d069e1e9617_1588622753.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_23fec49b79d64a6989b04d069e1e9617_1588622753.html", "title": "WVU faces a TT offense that piles up yards, points", "title_page": "WVU faces a TT offense that piles up yards, points", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MORGANTOWN — Former Texas Tech quarterback Kliff Kingsbury’s Red Raider teams have upheld the program’s reputation as a pass-happy bunch, and the 2018 version is no different.\nNo. 25 Texas Tech (3-1, 1-0 Big 12) comes into Saturday’s Top-25 clash with No. 12 West Virginia (3-0, 1-0) again sporting one of the nation’s top passing attacks. True freshman quarterback Alan Bowman has shined in his three starts, throwing for 1,557 yards and 10 touchdowns compared to just two interceptions. The Red Raiders lead the country in passing offense (435.8 yards per game) and total offense (632.5 yards per game).\nWVU’s defense has not faced anything close to an offense that can produce yards and points the way Texas Tech does — fast.\nTempo is the name of the game for the Red Raiders, who rank second nationally at 97 offensive snaps per game. It was a key in their 41-17 win at Oklahoma State last week.\n“They went really, really, really fast,” WVU head coach Dana Holgorsen said during his Tuesday news conference. “We have to be prepared for that. It’s different than what Kansas State did against us — or Youngstown or Tennessee. That’s what they’ve decided they’re going to be, which is why they’re running 95 snaps a game. You’ve heard a lot of people talk about tempo. If you’re not very good and you do it, it kills you. If you’re good at it, it’s hard on defenses, and they’re executing.”\nWest Virginia defensive coordinator Tony Gibson is well aware of the specific challenges the Texas Tech offense presents and said his defense has been built to stop teams like the Red Raiders. Now it’s just a matter of performing.\n“We’ll be simple, gameplan wise,” Gibson said. “Not a lot of calls and that’s been our recipe the last four years with this team so we can get lined up quick. One thing that helps us is we’re not a boundary defense. We can play and line up and that’s one advantage that we have playing against tempo teams, and also we get to go against our offense every day during camp. We don’t do as much formation stuff but at times we can go really fast as well.\n“What we’ve got to do is win up front. That’s easy to say but harder to do when you only have three down. This week is probably not going to be a time where you see four down just because of what they do and their personnel groupings.”\nSo while it will be up to the defensive front to put pressure on the Texas Tech backfleld, WVU’s secondary will be tested in a big way Saturday to keep the Red Raiders’ big plays to a minimum and bow up in the red zone.\n“I think the most (pass) attempts we’ve seen was 35 — and, hell, they may have that by halftime,” Gibson said. “We all know in this league you’re going to give up yards, but the key is when they do get in the red zone to make them attempt field goals and not give up touchdowns. That’s key for us. We have to be able to tighten up inside the 20 and hold them out of the end zone the best we can.”\nWest Virginia’s depth at cornerback was a question many people had coming into the season and it is still a valid one, considering the Mountaineers have not faced a true high-caliber passing attack yet. Gibson has been using a four-man rotation at corner that includes former South Charleston High standout and Gazette-Mail Kanawha County Player of the Year Derrek Pitts — a converted safety.\nPitts, a sophomore, is still a work in progress, Gibson said, but he likes what he’s seen out of the Dunbar, West Virginia, native.\n“Derrek is getting better every week,” Gibson said. “I wish he could catch because he’d be leading the country in interceptions right now. Every week you see something better out of him. He works, he studies a lot of film, he just needs to clean a few things up technique-wise and just keep getting game experience. He’s going to get tested this week. Their wideouts are long, they’re athletic, but he’s going to play.”\nTexas Tech is no slouch running the ball either. Last week against Oklahoma State, the Red Raiders had three players top 10 carries. Demarcus Felton led the ground attack with 130 yards and two touchdowns on 13 carries.\nHolgorsen said that is a testament to the job Texas Tech has done along the offensive line, which has paved the way for the running backs to get loose. Another factor is the run-pass option, which the Red Raiders and their freshman quarterback have been able to successfully implement so far this season.\n“It starts with those guys up front,” Holgorsen said. “Their O-line guy (offensive line coach Brandon Jones) is a guy I coached and was with (WVU offensive coordinator) Jake (Spavital) at Cal.\n“They’re getting coached up real well and they’re all back. Everything starts up front with them. And then their backs, they’ve got kind of a revolving door that’s much like what we’ve got. They have a bunch of quality, capable backs that they’re just going to roll in there to keep guys fresh. They do a lot of run-pass options — a ton of it. That quarterback looks to me like he’s making good decisions on when he hands it or when he puts it in play.”\nWEST VIRGINIA (3-0, 1-0) at TEXAS TECH (3-1, 1-0)\nWhen: Noon Saturday\nWhere: Jones AT&T Stadium, Lubbock, Texas\nTV: ESPN2\nRadio: WWQB 102.3-FM", "url": "https://apnews.com/23fec49b79d64a6989b04d069e1e9617"}