{"authors": [], "date_download": "2020-05-04 20:20:56", "date_modify": "2020-05-04 20:20:56", "date_publish": "2018-04-19 14:55:05", "description": "Lansing — Herban Legends, Green Eden and Pure Green are among the first businesses in Michigan to win pre-approval for a license to participate in the state's new regulated medical marijuana...", "filename": "_a4229096d2c346d7a2e3225b0804f451_1588623656.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a4229096d2c346d7a2e3225b0804f451_1588623656.html", "title": "9 medical pot firms first to win Michigan approval", "title_page": "9 medical pot firms first to win Michigan approval", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lansing — Herban Legends, Green Eden and Pure Green are among the first businesses in Michigan to win pre-approval for a license to participate in the state’s new regulated medical marijuana industry.\nThe Michigan Medical Marihuana Licensing Board on Thursday approved nine applications for planned dispensaries, grow operations, processing or testing centers and transporters that must still pass a facility inspections in order to qualify for a license.\nThe panel tabled one application, asking for further investigation by the Michigan State Police, and rejected two other applicants for “knowingly” submitting false information, a finding they can request a hearing to appeal.\nPre-approved applicants include three Ann Arbor business each owned by James Daly and Brian Doelle, who are seeking licensure to grow up to 500 marijuana plants through a company called Arbor Farms, process the drug at Arbor Kitchen and sell to patients at a Cannarbor dispensary less than a half-mile from the University of Michigan.\nOther Metro Detroit business pre-approved Thursday include a planned ABKO Labs safety testing facility in Troy; Motas Inc., a secure transporter based in Hazel Park; an Herben Legends dispensary in Southfield; and a Pure Green processing facility in Inkster.\nThe board also pre-approved Green Edel LLC of Portage for a dispensary and Class C growing license, the largest variety that allows up to 1,500 plants, along with a combination growing, processing and dispensary operating planned by Agri-Med of Muskegon.\nMichigan legislators approved the new commercial medical marijuana regulations in 2016, building on the 2008 law approved by voters that allowed for caregivers and patients to grow a limited amount of plants at home.\nMichigan State Police and the Department of Licensing and Regulatory Affairs last month served more than 200 cease-and-desist letters to companies they said had been operating outside the law and had not applied for a license. Most of those facilities — 161 — were in Detroit, where officials have imposed a temporary moratorium amid a legal dispute over local medical marijuana ordinances.\nThe state began accepting applications in December and required applicants to pay a $6,000 fee.\nTo date, 470 individuals or companies have submitted pre-qualification applications for a license to run a marijuana business, including 67 provisioning centers, six secure transporters and 49 Class C growers who have also applied for required facility inspections.\nAt least 78 municipalities have opted in to the law and will allow at least some kind of licensed marijuana businesses, according to an unofficial tally by the state. Participating communities in Metro Detroit include Inkster, Garden City, River Rouge, Center Line, Lenox Township, Hazel Park, Walled Lake and Orion Charter Township.\njoosting@detroitnews.com", "url": "https://apnews.com/a4229096d2c346d7a2e3225b0804f451"}