{"authors": ["James Barron"], "date_download": "2020-05-04 20:21:24", "date_modify": "2020-05-04 20:21:24", "date_publish": "2018-04-11 03:00:00", "description": "The purge is about to begin at The University of New Mexico athletics department. It just happened way too late in the ballgame. Hand it to the newbie — UNM President Garnett Stokes —...", "filename": "_b9af3627358a42478682041aa21afb83_1588623684.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b9af3627358a42478682041aa21afb83_1588623684.html", "title": "A purge of UNM athletics department is needed, but may be too late", "title_page": "A purge of UNM athletics department is needed, but may be too late", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The purge is about to begin at The University of New Mexico athletics department.\nIt just happened way too late in the ballgame.\nHand it to the newbie — UNM President Garnett Stokes — for having the fortitude that few in the athletic department had the courage to say: The university has too many sports, and some of them have to go.\nIt was that way 31 years ago, when UNM cut wrestling, baseball, women’s swimming and women’s basketball in 1987, only to have public outcry and private fundraising save all but women’s basketball for the following year. Women’s basketball made its return in 1991.\nIt was that way 19 years ago in 1999, when wrestling, men’s swimming and men’s gymnastics met a more permanent fate.\nIt was that way last year, when the university cut skiing — only to see the private sector come to the program’s rescue (see a pattern?). Each time, money was at the heart of the issue, because UNM could not afford to carry so many sports. Each time, the decision was met with outrage and a rallying cry to “save our sport.”\nUnfortunately, there are only so many sports and so much money for a school in such a poor state for each of them. UNM is now at its critical mass for balancing demand, competition and effectiveness. Sure, the school can continue to have 21 sports, but just how many of them will be competitive? What about the cost each sport incurs (yes, that even includes football and men’s basketball)?\nIt’s easy for the proponent of “X” sport that gets cut to point the finger at the university’s “sacred cows” for their demise and how money could be better spent. And they’re right. The university spends way too much money on football, which will never (and I mean never) compete for a national title or even register as a blip on that radar screen. In fact, any university or college with a football program that is not a part of the Power 5 conferences is essentially throwing money out the window trying to compete with them.\nBut too much money has been spent on the program for UNM to simply say “enough.”\nWe can look at the demise, attendance-wise, of the men’s basketball program as a sign of four lackluster years, but, in reality, it is a larger problem with the sport in general, and the Albuquerque community in particular. Fewer people care about going to games, be it football, basketball or baseball (the Isotopes excepted) — especially students.\nBesides, it’s hard for students who are piling up thousands of dollars in debt just for a degree to empathize with a poorly run athletics department begging for its multimillion dollar debt to be forgiven. They know nobody — and no entity — is coming to wipe their slate clean, so why would they come support a department that’s trying to do just that?\nThat’s why this purge is needed, because the athletics department is choking on its bloated self.\nStill, the move might be too late to save it anyway.", "url": "https://apnews.com/b9af3627358a42478682041aa21afb83"}