{"authors": ["Neal St. Anthony"], "date_download": "2020-05-04 20:11:41", "date_modify": "2020-05-04 20:11:41", "date_publish": "2018-03-20 13:08:53", "description": "The late Bill Cooper, who executed an industry-renowned, five-year turnaround of ailing TCF Financial nearly 30 years ago, was never able to get all the pistons firing at once after the Great...", "filename": "_5db64e9cba2f4421bb6244b7bba356e8_1588623101.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5db64e9cba2f4421bb6244b7bba356e8_1588623101.html", "title": "Under Craig Dahl, and thanks partly to the 2017 tax cut, TCF's outlook is improving", "title_page": "Under Craig Dahl, and thanks partly to the 2017 tax cut, TCF's outlook is improving", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Under Craig Dahl, and thanks partly to the 2017 tax cut, TCF’s outlook is improving\nThe late Bill Cooper, who executed an industry-renowned, five-year turnaround of ailing TCF Financial nearly 30 years ago, was never able to get all the pistons firing at once after the Great Recession of 2008 and 2009.\nBanking regulators cut into TCFs consumer fee-heavy business model after congressional reforms in 2010 that effectively reduced charges for bounced checks and electronic interchange charges of retailers on debit and credit sales.\nBut TCF, which underperformed the banking industry over the last decade, has been buoyed recently.\nCEO Craig Dahl, a former Wells Fargo lender who succeeded Cooper in 2016, has managed to get the stock price above $20 per share, back to where it was in 2007. And Dahl, who helped diversify TCF over the years from its disproportionate dependence on consumer banking, has improved the companys outlook.\nThe December federal corporate tax cut didnt hurt. TCF used some of the money for employee compensation. It also doubled its shareholder dividend and seeded a $150 million share-repurchase plan.\nTCF also benefited by walking away from a business Cooper bought in 2011: Late last year, the bank announced it would discontinue a national indirect auto loan-origination business that was causing angst among analysts. People are hanging on longer to vehicles, which makes for less than a slam-dunk business.\nYet the auto business had grown to about 20 percent of TCFs loan portfolio.\nAnd TCF was dependent on selling chunks of its portfolio annually to generate gains. That can turn against a lender during a period of rising rates.\nAlso last year, a federal judge threw out part of a lawsuit brought earlier by the Consumer Financial Protection Bureau.\nAfter the changes, Dahl received a warm reception from more than 20 institutional investors at a New York analyst conference last week.\nIts a lot more fun talking about all of our businesses, including our new digital checking product, and our product is still free, than it is just having to talk about the indirect auto lending business, Dahl said from New York on Friday. We believe reinvesting the runoff of the auto-loan balances into the our [growing] investment and loan-and-lease portfolios will lead to both earnings improvement and a reduced risk profile\nTCF in late January reported improved 2017 results, after the tax benefit, on a 4.5 percent increase in revenue.\nDuring the year, we improved core earnings trends, reduced our risk profile and executed on key initiatives, Dahl said. Our success in these areas, combined with the benefits from the recent tax reform, enabled us to give [bonuses to employees] invest in our business and drive shareholder value.\nThe stock price, which traded as low as $15.50 per share last August, rose to a high of $22.42 last month before backing down below $21 per share, amid last weeks market downturn.\nAnalyst Christopher McGratty of Keefe, Bruyette Woods in New York, a doubter about TCF a year ago, told investors in a recent note that Dahl, through exiting the indirect auto-loan business and working to settle the CFPB lawsuit over bad-check charges, has created a better future. McGratty raised his 12-month price target to $24 per share.\nJon Arfstrom of RBC raised his projected 12-month price to $25 per share.\nOur TCF thesis is that investors get a valuable company with solid franchise value that has shown consistent credit trends, navigated through fee income issues, and has held expense growth, all while adding to asset-generation potential, Arfstrom wrote. We are optimistic that TCF can replace the auto loans with loan-and-lease originations and acquisitions. We also believe the capital generation potential of the franchise is improving as a result of the large, low-cost deposit base, overall account growth, very strong lending production, and lower cost branch network.\nDahl, 63, is a former star hockey player at International Falls High School and Princeton University. He also coached the first womens team at Princeton after his graduation. Cooper, sometimes combative and verbose, nicknamed Dahl coach for his team-oriented, get-after-the-puck approach. Dahl also has tried to make Plymouth-based TCF a better place to work.\nUnder Dahl, who joined TCF in 1999, TCF expanded its equipment finance, inventory finance and technology finance businesses.\nThey generated an increasing portion of the banks earnings growth, as consumer fees declined.\nDahls diversification of TCFs business over the years helped insulate it somewhat from what proved a dangerous reliance on consumer fees. That backfired when regulators cracked down on the industry in 2010-2011, after years of letting bankers have their way, as the industry was deregulated.\nTCF, with assets of $23 billion, is a seven-state bank holding company with a market value of about $3.5 billion.\nUnder Dahl, it also has closed branch banks, reduced head count in some markets, and invested in electronic-and-telephone banking.\nNeal St. Anthony has been a Star Tribune business columnist and reporter since 1984. He can be contacted at nstanthony@startribune.com.", "url": "https://apnews.com/5db64e9cba2f4421bb6244b7bba356e8"}