{"authors": ["Ucla Health"], "date_download": "2020-05-04 20:06:53", "date_modify": "2020-05-04 20:06:53", "date_publish": "2018-11-02 00:00:00", "description": "Q: How do I know if I have a penicillin allergy? I always tell doctors that, yes, I’m allergic to penicillin, because I think I remember a bad reaction from when I was a kid, but, honestly, I’m...", "filename": "_d2ffb65f9beb456496f6cbfa5411235e_1588622813.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d2ffb65f9beb456496f6cbfa5411235e_1588622813.html", "title": "Penicillin Allergy Is Even Rarer Than Many Think", "title_page": "Penicillin Allergy Is Even Rarer Than Many Think", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Q: How do I know if I have a penicillin allergy? I always tell doctors that, yes, I’m allergic to penicillin, because I think I remember a bad reaction from when I was a kid, but, honestly, I’m not sure. Does it matter if I continue to avoid the penicillin family? A: Like all primary care physicians, we have a number of patients who check the “yes” box for penicillin allergies. It wasn’t until we began a bit of background research into your interesting question, though, that we learned 10 percent of people in the United States think they’re allergic to penicillin. But according to the Centers for Disease Control and Prevention, most of them are wrong. In fact, research shows only 1 percent of the population in the U.S. is truly allergic to penicillin. Penicillin, which was discovered in 1928 and first came into general use in the 1940s, was heralded as a wonder drug. It was the first effective cure for bacterial infections ranging from earaches and sinus infections to strep, pneumonia and meningitis. Today the penicillin family of antibiotics, which are very targeted and quite affordable, remain the best treatment for a range of infections. In addition, a recent study found that patients who were treated with broad-spectrum antibiotics because of a penicillin allergy had an increased risk of acquiring certain serious infections caused by antibiotic-resistant bacteria. So learning the truth about your suspected penicillin allergy is a good idea. Symptoms of penicillin allergy include itching, rash, hives, wheezing, shortness of breath and fever. More severe is anaphylaxis, an acute allergic reaction that affects multiple body systems and can be life-threatening. Since some of these reactions can occur for reasons other than a dose of penicillin, you need to see an allergy specialist for a skin test that can give you a definitive answer. It typically begins with a check of your skin’s reaction to a drop of a saline solution, which should not cause a reaction, and a drop of a histamine solution, which should cause itching and swelling similar to a mosquito bite. If your skin fails to react to the saline, but does react to the histamine, it means you’re able to react to a potential allergen. If your skin reacts to the saline, though, that means your skin is so sensitive that a test of potential allergens can’t be accurately interpreted. To test for a penicillin allergy, a drop of the antibiotic is placed on the skin, which is then scratched to allow penetration. If there is no reaction, this is followed by a small amount of penicillin being injected under the skin. If both of these tests are negative, a challenge dose of penicillin is administered to verify the results. If it turns out that you’re one of the few who is truly allergic to penicillin, always let medical personnel know. ASK THE DOCTORS appears every Monday, Wednesday and Friday. It is written by Eve Glazier, M.D., and Elizabeth Ko, M.D. Send questions to askthedoctors@mednet.ucla.edu, or write: Ask the Doctors, c/o Media Relations, UCLA Health, 924 Westwood Blvd., Suite 350, Los Angeles, CA, 90095.", "url": "https://apnews.com/d2ffb65f9beb456496f6cbfa5411235e"}