{"authors": ["Mary Lynn Smith"], "date_download": "2020-05-04 20:15:42", "date_modify": "2020-05-04 20:15:42", "date_publish": "2018-12-05 20:00:30", "description": "Minnesota officials are considering mail-only ballots for the states 2020 presidential primary, which would be a dramatic change from the states often chaotic and time-consuming party...", "filename": "_eef386b025ec4ccb9dd38a597d8e8fe0_1588623342.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eef386b025ec4ccb9dd38a597d8e8fe0_1588623342.html", "title": "Minnesota officials thinking about mail-only ballots for 2020 presidential primary", "title_page": "Minnesota officials thinking about mail-only ballots for 2020 presidential primary", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Minnesota officials are considering mail-only ballots for the states 2020 presidential primary, which would be a dramatic change from the states often chaotic and time-consuming party caucuses.\nBeginning in 2020, Minnesota will switch to a more straightforward primary system that allows voters to cast ballots for their preferred choice for president rather than jam into classrooms and community centers for their party caucuses. Most other states use a primary system, but Minnesota has done so only a handful of times.\nThe switch to a presidential primary essentially means the state would have to hold three elections in 2020 the presidential primary in late winter, the usual primary election in August and the general election in November.\nA mail-only ballot could make administering the presidential primary easier and possibly less expensive than opening polling places around the state, some backers say.\nGenerally, it takes more than 30,000 election judges to run a statewide election.\nMany election judges are older and retired, and some spend their winters in warmer climes. That could make it more difficult to staff polling places during a presidential primary in February or March, said Ann Lindstrom, a lobbyist for the League of Minnesota Cities.\nIf you can switch it to mail balloting, it will make it more efficient, she said. It also could induce more people to participate, she added.\nMinnesota Republican Party Chairwoman Jennifer Carnahan isnt sold on the idea.\nWe have a democratic republic, and I think we should exercise caution about transforming the system that we know, she said. We should keep the process that people are familiar with.\nA lot of people take pride in going to the polls to cast their ballot, she added. Changing the system is a really big deal.\nMinnesotans who want to mail their ballots by voting absentee could still do that, she said.\nCarnahan said she and her DFL Party counterpart, Ken Martin, met Tuesday with Minnesota Secretary of State Steve Simon, who discussed the mail-only ballot option.\nI dont agree with it, she said.\nThe League of Minnesota Cities, which backs the mail-only ballot, is urging the Legislature to pass it in its upcoming session so it can take effect for the 2020 primary. For now, its an idea being discussed among party leaders and state and local officials.\nStaff writer Patrick Coolican contributed to this report. Mary Lynn Smith 612-673-4788", "url": "https://apnews.com/eef386b025ec4ccb9dd38a597d8e8fe0"}