{"authors": ["Sherry Slaterniki Kelly"], "date_download": "2020-05-04 20:16:38", "date_modify": "2020-05-04 20:16:38", "date_publish": "2018-10-21 05:00:01", "description": "In the wake of high-profile school shootings, superintendents and school board members have been forced to wrestle with the cost-benefit analysis of how much taxpayer money to spend on...", "filename": "_1d38c9860ac04267871ee454d5262755_1588623398.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1d38c9860ac04267871ee454d5262755_1588623398.html", "title": "Budgets crimp security measures", "title_page": "Budgets crimp security measures", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In the wake of high-profile school shootings, superintendents and school board members have been forced to wrestle with the cost-benefit analysis of how much taxpayer money to spend on transforming schools from so-called soft targets to hard ones.\nHow much is enough? And how much is too much? Safety-focused consulting firms that help school officials answer those questions are flourishing.\nEach school shooting brings a new surge of spending : with the education sector of the market for security equipment and services reaching $2.7 billion in revenue in 2017, according to an IHS Markit analysis.\nSo are companies profiting from fear?\n“That is not my personal experience,” said Robert Boyd, executive director of the Secure Schools Alliance in Washington, D.C. “The people in the industry with whom I work on a regular basis are committed to this cause because it’s the right thing to do and they want our nation’s schools to be safe.”\nSafety PASS\nMike Harmon, chief sales and marketing officer for Indianapolis-based Esco Communications, consults with clients across the country and spends more time talking to health care providers, senior living centers, industrial companies and higher education leaders than public school officials.\n“You can harden a school as tight as an airport if you had the money,” he said. “But (they) don’t have the money. And it’s not necessary.”\nInstead, he walks clients through the Safety and Security Guidelines for K-12 Schools drafted last year by the Partner Alliance for Safer Schools. Harmon is an alliance board member.\nThe goal is to address vulnerabilities related to procedures, drills, video surveillance and emergency notification. Other specific areas of potential weakness include the property and parking lot, the building and individual classrooms.\nThe alliance checklist breaks down four tiers of security, with the first tier being the least secure. The guidelines list what measures must be taken to meet each level of safety.\nFor example, the section on parking lot safety lists the first tier as including signs that designate student and faculty parking areas and exterior lights in strategic locations. Tier two calls for parking decals or stickers. Tier three calls for a parking lot attendant. And tier four calls for gated lots accessible only with electronic entry cards.\nHarmon readily admits the fourth level of security isn’t necessary everywhere and not all of Esco’s products make sense for all customers. For example, the company offers a system that will trigger an automatic school lockdown and contact first responders if the sound of a gunshot is detected.\n“It’s pretty expensive,” Harmon said of the technology. “We offer it, but we have not sold it.”\nBeing selective\nDottie Davis, Fort Wayne Community Schools’ director of security, said the district has seen an increase in vendors offering products related to school safety and security. But officials are selective.\n“Some products don’t meet fire code regulations, and others are cost prohibitive for a district our size,” she said in a statement.\n“To balance fiscal responsibility and safety, we evaluate products and services within the entirety of our security plan : never in isolation,” Davis said. “It can be easy for some to get caught up in what appears to be a magical solution, only to find out it is not effective, or worse, could actually increase danger to students and staff.”\nOne area where Davis and Harmon disagree is on the value of hand-held metal detectors.\nFWCS submitted one of more than 300 statewide applications for the devices offered through a new program launched by Indiana officials this summer. The wands can detect objects such as guns, knives, razor blades and foil-wrapped drugs.\nBut Harmon isn’t impressed.\n“That’s really a waste of money. They don’t use them,” he said, referring to school districts in general.\nKrista Stockman, FWCS spokeswoman, said hand-held metal detectors will be used as part of the school system’s “comprehensive security plan.” For that reason, she said in an email, officials “are not sharing specifics on how they will be used.”\nGov. Eric Holcomb’s voluntary program provides up to one hand-held metal detector for every 250 students in a school building. So far, more than 3,200 detectors have been purchased at a cost of $331,000 : paid for by the state.\nErin Kellam, deputy commissioner at the Indiana Department of Administration, said the state looked for an Indiana company but none carried the specific item. So the state used a federal list of competitive prices and worked with Event Metal Detectors LLC in Ohio to negotiate a lower price.\n“The best way to control what happens inside a school is to control what gets inside,” Holcomb said.\nProper training and procedures play a significant role in keeping schools safe, Harmon said. The best lock in the world won’t keep someone from entering a door that’s been propped open by a janitor, for example.\nAnd guarding that perimeter is vital.\n“If you can limit access, I think that’s the biggest first step,” Harmon said.\n‘An uphill battle’\nEsco Communications, Harmon’s employer, works closely with Layered Solutions Inc., a Carmel-based contractor. As Rick Wagner, Layered Solutions’ vice president of sales, explained it, his company designs the mass communications software Esco installs.\nLayered Solutions has two goals, Wagner said.\nFirst, it focuses on speed. The company’s software allows school officials to press one button that triggers a series of events. If it’s an active shooter, those events could include locking down the building, alerting authorities, sending warning messages to all staff and alerting the school resource officer to the alert’s location.\nBy automating many of those steps, nervous people don’t need to remember what to do, he said. “The more steps you add, the more time you waste.”\nSecond, it works to incorporate a client’s existing technology : including surveillance cameras, public address systems and cellphones : into one coordinated network.\n“Schools are always on tight budgets,” Wagner said. “They’re using taxpayer money. It’s an uphill battle when it comes to budgets.”\nLayered Solutions, a 3-year-old company that employs five, has seen demand surge in recent months.\nIt designed security systems for three school districts and one private school in central Indiana the past six months and has contracts to create communications networks for three more school systems over the next six to nine months. Wagner declined to provide revenue figures.\nAnother major player in the school safety industry is Allegion, an Irish company with an office in Carmel. It consults with clients to identify security needs and offer solutions.\nThe $2.4 billion company, which doesn’t report separate revenue figures for school safety contracts, employs 10,000 worldwide and sells products in 130 countries.\nIt is a sponsor of the Secure Schools Alliance, which was formed in 2015 by several school safety vendors as a nonprofit to address the nation’s school security infrastructure, security technology and safety systems.\n“In the nonprofit world, we have an expression ‘no money, no mission,’” Boyd said. “Presently, the alliance is funded by several security companies with extensive expertise in various aspects of physical school security and technology, but the alliance does not advocate for any products or specific solutions. Our fundraising efforts seek a balance between security industry and non-industry donors. School safety and security are complex issues and require input from a wide variety of stakeholders.”\nThe alliance has used Indiana as a national example of a state that is doing things right, including its Indiana School Safety Academy.\nU.S. Rep. Susan Brooks, R-5th, said she has toured Allegion several times. She also formed a school safety caucus in 2015 to spread awareness about security options.\n“It’s not about pushing a product,” she said.\nIt’s about the array of things available to help and each school building might have different needs due to its age and available infrastructure, Brooks said.\nProper procedures\nAll the whiz-bang technology in the world won’t work if people don’t use it, however.\nBrad Aikin, an Allegion official, said it’s important to consider how building keys are assigned and distributed, for example. Without proper procedures, school officials could quickly lose track of who has keys or which electronic entry cards were distributed to which staff members.\nA disgruntled former employee could use an entry card, for example, unless officials can identify and disable it.\nThe doors themselves also have to be maintained, Aikin said. High schoolers do a number on the metal latches when they kick them open after the final bell rings, he said.\n“You can have the best lock, but you have to make sure the door closes so it can be secured,” he said.\nDeteriorating school buildings also present a problem, according to Allegion officials. They referred to data from the National Center for Education Statistics, which show the average public school building is 44 years old. Of those, 24 percent were classified in either fair or poor condition.\nMore than half of public schools need to spend money on repairs and renovations to be classified in good condition, according to the data. Making those upgrades carries an estimated $200 billion price tag.\nAlthough the task of transforming schools into safe havens seems daunting, security professionals take the challenge in stride.\nEsco’s Harmon lives just five minutes from the Noblesville middle school where in May a student shot and wounded a teacher and a classmate. He’s seen how traumatized some of those students still are.\nHarmon also has a granddaughter who attends kindergarten in Iowa. But, he noted, it’s more likely she would be injured in an auto accident than a school shooting.\n“I think you’re always concerned,” he said. “But when you think through it, it’s still very rare.”\nsslater@jg.net\nnkelly@jg.net", "url": "https://apnews.com/1d38c9860ac04267871ee454d5262755"}