{"authors": ["John Gillispie'Smovies"], "date_download": "2020-05-04 20:08:38", "date_modify": "2020-05-04 20:08:38", "date_publish": "2018-01-11 10:16:06", "description": "Movies & More columnist John Gillispie shares his thoughts on \"The Mountain Between Us,\" which is rated PG-13 and available on DVD. \"The Mountain Between Us\" tells a courageous story of two...", "filename": "_69301e1b7dfa45d6b66eacea30bcc139_1588622918.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_69301e1b7dfa45d6b66eacea30bcc139_1588622918.html", "title": "'Mountain Between Us' a compelling survival drama", "title_page": "'Mountain Between Us' a compelling survival drama", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Movies & More columnist John Gillispie shares his thoughts on “The Mountain Between Us,” which is rated PG-13 and available on DVD.\n“The Mountain Between Us” tells a courageous story of two people who survive a small plane crash and struggle to make it safely down a snow-covered mountain.\nFor most of the movie, Kate Winslet as Alex Martin and Idris Elba as Dr. Ben Bass are the only people on screen. Fortunately, Winslet and Elba are so talented that the two of them can carry this large section of the movie. Beau Bridges and Dermot Mulroney have small roles in the film at the beginning and end, respectively.\nAlex and Ben are strangers who meet in an airport where flights are being canceled because of an approaching storm. Alex is trying to get home for her wedding and charters a small plane and invites Ben to join her after overhearing that he is expected to conduct surgery the next day.\nAlex’s leg is injured in the plane crash, and Ben tends to her. After a few days in which no help arrives, the two decide to leave the plane wreckage and try to descend the mountain.\nThere are mishaps and challenges along the way for the two characters, who are joined by a retriever, the pilot’s dog whose name they don’t know. But, despite the physical challenges involved, “The Mountain\nBetween Us” focuses on how Alex and Ben need to learn to rely on each other in such a dangerous situation. The movie does a great job of focusing on the conflicting emotions both characters experience. Alex feels guilty for inviting Ben on the flight, and Ben thinks that he would have a better chance of survival on his own since Alex’s injured leg slows them down. Yet, despite their fears, each tries to help the other as much as possible.\nI found “The Mountain Between Us” to be a compelling drama, and I realized that I had no idea how the movie would end right up until the final moment.\nJohn Gillispie is the public relations director for the Huntington Museum of Art.", "url": "https://apnews.com/69301e1b7dfa45d6b66eacea30bcc139"}