{"authors": ["Courtesy Of The Canton Regional", "Greater West Virginia Betterbusiness Bureau"], "date_download": "2020-05-04 20:09:46", "date_modify": "2020-05-04 20:09:46", "date_publish": "2018-03-19 10:00:45", "description": "Every year, the IRS compiles their \"Dirty Dozen,\" a list of common scams that can affect taxpayers at any time of the year, but strike more often during filing season as consumers finalize their...", "filename": "_feaa3999dedc4c9f8a9885e22a6acce7_1588622986.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_feaa3999dedc4c9f8a9885e22a6acce7_1588622986.html", "title": "IRS releases its 'Dirty Dozen' tax scams", "title_page": "IRS releases its 'Dirty Dozen' tax scams", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Every year, the IRS compiles their “Dirty Dozen,” a list of common scams that can affect taxpayers at any time of the year, but strike more often during filing season as consumers finalize their tax returns. Here are three such scams used to steal taxpayer’s money in 2018.\nHow the scams work\nPhishing Schemes: Year after year, criminals send emails to potential victims, posing as a person or organization the taxpayer trusts or recognizes, such as a bank, credit card company, tax software provider or government agency. Scammers create websites that appear legitimate, but contain phony log-in pages in the hopes the taxpayer will take the bait and provide money, passwords, Social Security numbers and other information that can lead to identity theft.\nIn the most recent version of this scam, thieves steal client data from tax professionals in order to file fraudulent tax returns and then deposit the refunds into the taxpayers’ real bank account. The scam artists then pose as the IRS, debt collection agency officials, or law enforcement, to call attention to the error and ask taxpayers to return the money to them.\nPhone Scams: Since October 2013, the Treasury Inspector General for Tax Administration (TIGTA) reports over 12,716 victims have collectively paid over $63 million as a result of phone scams.\nThe most common version of a phone scam is the IRS scam. Callers pose as IRS representatives and claim that taxpayers owe money to the IRS and need to pay immediately over the phone to avoid punishment, including arrest. In another version, “IRS representatives” advise potential victims that two certified letters were sent\nto them by mail, but were returned as undeliverable. The callers threaten to arrest the potential victim if payment is not made immediately through a prepaid debit card over the phone.\nTax Identity Theft: While, reports of tax-related identity theft have decreased in the last few years, it still remains a top concern for consumers. These scams involve the intent to steal personal and financial data from taxpayers or data held by tax professionals. One such way is when a scammer uses a stolen Social Security number to file a fraudulent tax return and claim the refund. It also happens when someone uses your SSN to earn wages, but gives you the tax bill.\nTips to avoid these scams\nFile early: File your tax return as early as possible to avoid a scammer filing instead.\nBe secure: Use a secure internet connection if you file electronically, or mail your tax return directly from the post office.\nKnow the IRS: The IRS will not contact you by email, text, or social media. If the IRS needs information, it will contact you by mail.\nBe aware of your credit: Check your credit report for free at annualcreditreport.com to make sure there are no unauthorized accounts.\nProtect personal data: Don’t routinely carry a Social Security card, and make sure tax records are secure. Treat personal information like cash; don’t leave it lying around.\nKnow phlshlng: Learn to recognize and avoid phishing emails, threatening phone calls and texts from thieves posing as legitimate organizations. Do not click on links or download attachments from unknown or suspicious emails.\nBe Informed: To see the remaining “Dirty Dozen” and find more tax-time tips, visit the IRS website at www.irs.gov/newsroom/dirty-dozen.\nVisit bbb.org/canton to look up a business, file a complaint, write a customer review, report a scam with Scam Tracker, read tips, follow on social media and more. The Canton Regional and Greater West Virginia Better Business Bureau offers tips and advice for consumers to avoid fraudulent practices.", "url": "https://apnews.com/feaa3999dedc4c9f8a9885e22a6acce7"}