{"authors": ["Robert Snell", "The Detroit News"], "date_download": "2020-05-04 20:06:42", "date_modify": "2020-05-04 20:06:42", "date_publish": "2018-04-05 03:55:14", "description": "Detroit – Embattled Macomb Township Trustee Dino Bucci gave $66,000 to FBI agents months after being indicted, a possible sign he is cooperating with a public corruption investigation targeting...", "filename": "_2d1c93f38b604edda370c80eefd96360_1588622802.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2d1c93f38b604edda370c80eefd96360_1588622802.html", "title": "Bucci surrenders $66K in 'kickback' giveback", "title_page": "Bucci surrenders $66K in 'kickback' giveback", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Detroit – Embattled Macomb Township Trustee Dino Bucci gave $66,000 to FBI agents months after being indicted, a possible sign he is cooperating with a public corruption investigation targeting his former boss, ex-Macomb County Public Works Commissioner Anthony Marrocco, The Detroit News has learned.\nBucci gave the money to FBI agents Feb. 14, according to a federal document obtained by The News. That was three months after Bucci was charged with bribery, extortion, fraud, theft and money laundering in a case that portrays Bucci as a bully and bungling crook.\nBucci received hundreds of thousands of dollars while extorting engineering contractors, forced county employees to drive his child to school and plow snow at his home, and got charged after failing to throw away his disposable “burner” cellphone, according to court records.\nBucci, 58, is Marrocco’s former right-hand man who might be able to provide insight into the office’s operations. Marrocco, who lost a 2016 re-election, is a target of the FBI corruption investigation, according to a sealed wiretap affidavit obtained by The News in December.\n“For Marrocco, this is not a good sign,” said Peter Henning, a Wayne State University law professor and former federal prosecutor. “This could indicate Bucci is cooperating. When you turn over money, it is an acknowledgment that the assets are tainted.”\nLawyers for Bucci and Marrocco, who has not been charged with a crime, could not be reached for comment Wednesday. The U.S. Attorney’s Office declined comment.\nThe FBI picked up the $66,000 from Bucci in Clinton Township, the same city where Bucci’s lawyers have offices. The $66,000 matches the amount of kickbacks prosecutors say Bucci received at one point from township contractor Christopher Sorrentino, who is cooperating with investigators.\nSorrentino met Bucci at the Macomb County Public Works office in Clinton Township in November 2014 and delivered a bag containing $66,000 cash, according to the indictment.\n“During the meeting, Dino Bucci yelled at Sorrentino for not being secretive enough in giving Bucci the bag of money,” prosecutors wrote.\nTargets of FBI corruption investigations have turned over money to local investigators in recent years before striking plea deals with federal prosecutors.\nIn early 2016, Fiat Chrysler executive Alphons Iacobelli was under investigation in a corruption probe. He was accused of buying a $365,000 Ferrari with funds that were supposed to benefit blue-collar union workers.\nFBI agents recovered some of the money.\nIn March 2016, a $354,000 check was given to the U.S. Marshals Service by the law firm Butzel Long. That’s the same firm that employs Iacobelli’s defense lawyer, David DuMouchel.\nIacobelli later pleaded guilty for his role in the auto-industry corruption investigation and is awaiting sentencing.\nIn the Marrocco investigation, a chronology of events outlined in sealed wiretap records shows that by late summer 2014, investigators had started tapping three phones so they could listen to conversations involving Marrocco, a manager employed by a Macomb Public Works contractor and a county employee who worked in the public works office.\nThe wiretaps started as early as August 2014. That’s when FBI agents obtained a court order to tap the phone of Paul Modi, a Macomb County engineering contractor.\nThe short list of people in contact with Modi that drew FBI attention, according to the court filing, included Bucci and Marrocco, a once-powerful political figure who helped award work worth millions of dollars to firms that bid or received contracts from the public works office.\nA separate court filing shows the FBI was listening to Bucci’s phone calls. Agents had at least four wiretaps, including one on Bucci’s phone and one on his disposable “burner” phone — a cheap prepaid phone quickly replaced to avoid being tracked by investigators.\nIn Bucci’s case, agents learned about the phone and tapped it, according to a court filing.\nrsnell@detroitnews.com\n(313) 222-2486\nTwitter: @robertsnellnews", "url": "https://apnews.com/2d1c93f38b604edda370c80eefd96360"}