{"authors": ["Jeff Mordock The Washington Times"], "date_download": "2020-05-04 20:26:08", "date_modify": "2020-05-04 20:26:08", "date_publish": "2018-11-08 11:47:00", "description": "Special counsel Robert Mueller's team has begun writing its final report on its 18-month Russia investigation, according a media report Thursday. The investigation has entered its final...", "filename": "_f2f64377fa095b6e12bea3505a92293b_1588623968.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f2f64377fa095b6e12bea3505a92293b_1588623968.html", "title": "Mueller team begins writing final report", "title_page": "Mueller team begins writing final report", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Special counsel Robert Mueller’s team has begun writing its final report on its 18-month Russia investigation, according a media report Thursday.\nThe investigation has entered its final stages, but federal prosecutors reportedly still have some final pieces to put into place, CNN reported.\nThe Mueller team is seeking information related to Roger Stone, a longtime Trump adviser who has been at the center of the Mueller probe in recent weeks.\nMr. Mueller reportedly asked President Trump’s legal team for call and visitor logs related to Mr. Stone’s visits to Trump Tower in New York before the 2016 election.\nProsecutors are also waiting for Mr. Trump’s legal team to return answers to Mr. Mueller’s questions, CNN said. It is not clear if an in-person interview with the president will happen.\nThe president has repeatedly called the probe into alleged Russian collusion with his campaign a waste of time and money.\n“It’s a disgrace, it should never have been started because there was no crime,” Mr. Trump told reporters Wednesday before former Attorney General Jeff Sessions’ departure was announced.\nMueller’s team does not expect the firing of Mr. Sessions, who had recused himself from the probe, to affect the final report. Mr. Sessions’ successor, Matthew Whitaker, has taken over the investigation from Deputy Attorney General Rod Rosenstein.", "url": "https://apnews.com/f2f64377fa095b6e12bea3505a92293b"}