{"authors": ["Lee Provost"], "date_download": "2020-05-04 20:09:04", "date_modify": "2020-05-04 20:09:04", "date_publish": "2018-04-12 14:30:00", "description": "BRADLEY — CSL Behring, already Kankakee County’s top manufacturing employer, is about to begin a massive expansion which ultimately could be the largest investment in an existing business in the...", "filename": "_495c37d69bb8405797fdc7607b2abeab_1588622944.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_495c37d69bb8405797fdc7607b2abeab_1588622944.html", "title": "CSL unveils huge expansion", "title_page": "CSL unveils huge expansion", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BRADLEY — CSL Behring, already Kankakee County’s top manufacturing employer, is about to begin a massive expansion which ultimately could be the largest investment in an existing business in the county’s history.\nThe first steps of the estimated 1.8 million-square-foot addition — to be called CSL South — will begin this year with site preparation work.\nThe current CSL campus now will be known as CSL North.\nThe addition will be put immediately south of the existing manufacturing plant, which has been on 64 acres at the corner of Armour Road and Illinois Route 50 in Bourbonnais Township since the 1950s.\nThe entire expansion on the recently acquired neighboring 74 acres could take as long as 12 years to complete, noted plant manager and senior vice president Tricia Stewart and project manager Chris Abell.\nThe plans were publicly unveiled this morning at the Kankakee County Economic Alliance meeting at Olivet Nazarene University.\nBoth Stewart and Abell declined to state what the ultimate investment could be for the Melbourne, Australia-based manufacturer of plasma-derived medication.\n“The investment in this area is significant,” Stewart said.\nThe company is completing work on the 300,000-square-foot expansion for the seven-story tower building. That project cost an estimated $240 million.\nThe site where this expansion will unfold is within the 74 acres which was formerly the location for the Bunge Edible Oil manufacturing plant. Bunge ceased production here at the end of 2016.\nCSL entered into a $17-million contract to purchase the property in July 2017. It took possession of the 74 acres in January.\n“We are building buildings to satisfy the needs of the patients who rely on these medications,” she said. “This is about patient needs and demand for our product. These are life-saving medications that go around the world.”\nThe site employs more than 1,400. Stewart said it is far too early to speculate on how many workers CSL could have once the project is complete. As recently as Sept. 1, 2015, the company had a local workforce of 1,100.\nWhile CSL is a global leader in biotherapy medications, it always is exploring new treatment opportunities for its highly-specialized products.\nThe company’s biotherapies treat a variety of disorders, including hemophilia and hereditary angioedema. The local plant also produces Zemaira, a medication used to treat the inherited disorder, Alpha-1. Zemaira helps protect the lungs of people whose bodies do not produce the protein needed to protect their lungs.\nThe current expansion is geared to increase production of medications built with albumin. Albumin is used to treat, in part, blood loss and burn patients. The ongoing expansion also allows for increased production of intermediates used for product development here and its sister sites around the world.\nCSL South will begin at the base of the seven-story manufacturing tower. From there, a variety of one-, two- and three-story manufacturing and processing buildings will be constructed during the next 10 years.\nIn addition to the new construction, buildings bought from Bunge will be used as well.\nFunding has been approved by the company’s headquarters for the infrastructure work, as well as construction of a maintenance building and one of the production buildings.\nThe buildings will be connected by a 1,650-foot-long, three-story “spine” structure, which will connect all of the buildings and serve as a walk-through for employees and products, as well as a way of delivering utilities to the collection of buildings.\nThe initial portions of the spine project already have been sent out for bids.\n“We are moving as fast as we can, which is slow to the average person,” Abell said. He explained because of long lead time for equipment and regulatory requirements by the Federal Drug Administration and other regulatory agencies, progress can seem slow moving.\nThe manufacturing buildings will be facing Illinois Route 50.\n“This will be a very modern and clean design,” Abell said. “This will be a world-class facility. This project is transformational. It is transformational for CSL Behring, the Kankakee community, the state of Illinois and beyond.”", "url": "https://apnews.com/495c37d69bb8405797fdc7607b2abeab"}