{"authors": ["Editorial Board"], "date_download": "2020-05-04 20:31:40", "date_modify": "2020-05-04 20:31:40", "date_publish": "2018-01-12 16:41:43", "description": "A group of six bipartisan senators forged an agreement that would offer a citizenship path for those brought to this country as children by undocumented parents. The deal included increased border...", "filename": "_11aea2938bfc4a6c9467297a7227b141_1588624300.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_11aea2938bfc4a6c9467297a7227b141_1588624300.html", "title": "Despite latest Trump firestorm, make a deal on DACA", "title_page": "Despite latest Trump firestorm, make a deal on DACA", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A group of six bipartisan senators forged an agreement that would offer a citizenship path for those brought to this country as children by undocumented parents. The deal included increased border security and was a way for Congress to avoid a painful and unnecessary government shutdown.\nInstead of using that agreement as a turning point in the as-yet-intractable immigration debate, President Donald Trump opted to kick over the table. On Thursday, he questioned why the U.S. should accept immigrants from shithole countries, such as Haiti, El Salvador and the entire continent of Africa. Instead, he said, the U.S. should allow more immigrants from countries like Norway.\nThe contrast is as inescapable as it is hateful. Whatever his proclamations to the contrary, Trump signaled that he clearly prefers white immigrants to those of color. That is racist on its face. True to past practice, he now denies saying it. But senators in that meeting with the president have confirmed it, with Sen. Dick Durbin, D-Ill., praising the courage of Sen. Lindsey Graham, R-S.C., who he said spoke out against the remarks at the time. Sen. Jeff Flake, R-Ariz., a leader on the bipartisan talks, who also was present, called Trumps remarks abhorrent.\nAmericans must face the fact that whatever else he is, whatever other agenda he carries, Trump harbors troubling racist sentiments that are jeopardizing the well-being of people of color, emboldening racists and, with his latest remarks, triggering international alarm and disgust.\nWords matter. But actions matter even more. As reprehensible as Trumps remarks are, the situation of some 800,000 people known as Dreamers is of such overriding importance that Democrats and Republicans alike must find a way to move past those comments and find a solution. The alternative is unthinkable: hundreds of thousands of friends, neighbors, classmates and workers who consider themselves Americans in every respect ripped away from their homes and deported to countries that are foreign to them.\nThe reported deal from the bipartisan group was a solid start, with genuine compromise from both sides. It included a path to citizenship for Dreamers, funds for enhanced border security some of which could have been used for a wall and changes to the program that distributes via lottery small numbers of visas to nations with low rates of immigration.\nTrumps rejection of that reasonable approach is unreasonable and will only ensure that gridlock continues.\nHouse Speaker Paul Ryan has called Trumps shithole comments unfortunate and unhelpful. That is an embarrassingly weak response. If Ryan hopes to salvage anything from this, he should provide the leadership that the president has not, working toward actual compromise with the Democrats whose votes are needed to fend off a government shutdown by the Fridays deadline.\nAmericans, by wide margins, support a path for Dreamers. Dozens of Republican members have told Ryan they want a fix for the Deferred Action for Childhood Arrivals program (DACA). Ryan himself has said Congress should devise a legislative solution that ensures those who have done nothing wrong can still contribute as a valued part of this great country. Those words will ring hollow if he fails to act now.", "url": "https://apnews.com/11aea2938bfc4a6c9467297a7227b141"}