{"authors": ["Karen Antonacci Staff Writer"], "date_download": "2020-05-04 20:12:26", "date_modify": "2020-05-04 20:12:26", "date_publish": "2018-05-19 02:46:00", "description": "If you go What: Micah Homes Ground Breaking When: 5 p.m. May 31", "filename": "_f3c16283cd8944c0bdf8e73b92cce1b4_1588623146.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f3c16283cd8944c0bdf8e73b92cce1b4_1588623146.html", "title": "Longmont Nonprofits, Churches to Break Ground on Collaborative Affordable Housing Project", "title_page": "Longmont Nonprofits, Churches to Break Ground on Collaborative Affordable Housing Project", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "If you go\nWhat: Micah Homes Ground Breaking\nWhen: 5 p.m. May 31\nWhere: 1500 Ninth Ave., Longmont\nLongmont nonprofit organization, churches, donors and construction companies plan to break ground on a one-of-a-kind collaborative affordable housing project at the end of the month.\nThe Micah Homes — named after the Book of Micah in the Bible in which Micah defends the rights of the poor — started more than a year ago as a partnership between United Church of Christ and The Inn Between of Longmont.\nThe church donated .25 acres for the project and nonprofit architectural firm Radian/Placematters Inc. designed six small apartment units that could house up to 14 people. The Inn Between took the lead on organizing community donations and leveraging funds.\nKrische Construction is the general contractor for the project, providing $214,000 worth of work to the project for free. Carpetwise has provided all of the flooring for free and other local firms and subcontractors have stepped up with materials or free labor. Those companies are: Flatirons Survey, Nixcavating, Redd Iron, Westco, Builders Insulation, Division 6, Action Plumbing, Winnelson Longmont, Fossil Creek Drywall, SJ Ward, M&M Painting, Budget Home Center, Lynn Cunningham Appliance, Rose Electric and Trident Security.\nInn Between Executive Director David Bitler said that the cost of the land and the construction for the project would have been between $1.7 million and $1.8 million, but because of donations and grants, the project cost is about $460,000 right now.\nThat includes $150,000 in Worthy Cause funding from Boulder County, $43,000 from Faith Community Lutheran Church and an individual donor who wrote a check for $10,000, plus smaller monetary donations.\n“The goal is to do it for under $500,000 and we are below that because we’ve got enough donations and gifts to do it,” Bitler said. “We’d like to get (the cost) to $0 if we can.”\nAnyone with material, monetary or labor donations for the Micah Project should contact The Inn Between at 303-684-0810 or theinn@innbetween.org .\nBitler said the project is running slightly behind schedule due to working out permitting issues with the city. While the original projection was to open by the end of 2018, Bitler said Friday that the project will likely open in spring of 2019.\nThe six apartments will comprise four, one-bedroom units and two, two-bedroom units that could house a family of four each. Each apartment will range between 400 and 700 square feet of space. Residents will pay roughly 30 percent of their income for rent and receive supportive services from The Inn Between. Future residents of the Micah Homes will be on low, fixed incomes, such as the elderly and disabled.\nBitler said that one disabled couple currently staying at The Inn Between will be the first to move into their Micah Home when it’s done.\n“They are disabled and elderly and their two years with us are up, but we have extended their stay, so they have a place to go when (the Micah Homes are) built,” Bitler said. “They’ve worked all their lives and owned a home here in Longmont but became disabled and lost their home.”\nThe project represents the first permanent supportive apartment project for The Inn Between. The Longmont nonprofit provides time-limited housing, case management and life-skills training to families and individuals who become situationally homeless. Bitler added that the organization operates eight units at 250 Kimbark St. that are permanent housing, but they aren’t apartments because they are one-bed bedrooms with shared space.\nKaren Antonacci: 303-684-5226, antonaccik@times-call.com or twitter.com/ktonacci", "url": "https://apnews.com/f3c16283cd8944c0bdf8e73b92cce1b4"}