{"authors": ["Staff Writer"], "date_download": "2020-05-04 21:09:07", "date_modify": "2020-05-04 21:09:07", "date_publish": "2018-02-21 05:01:01", "description": "DORIS ADARENE HORAN, 81, of South Point, Ohio, passed away Sunday, February 18, 2018, at her residence. The Fort Gay, W.Va., native was born December 7, 1936, the daughter of the late Milton J....", "filename": "_fc6dbe9697614bbe93425d1db762f8a6_1588626547.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fc6dbe9697614bbe93425d1db762f8a6_1588626547.html", "title": "Doris Adarene Horan of South Point, Ohio", "title_page": "Doris Adarene Horan of South Point, Ohio", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DORIS ADARENE HORAN, 81, of South Point, Ohio, passed away Sunday, February 18, 2018, at her residence. The Fort Gay, W.Va., native was born December 7, 1936, the daughter of the late Milton J. and Vena Aliff Bartram. She was also preceded in death by her husband of fifty years, Alfred Manning Horan, whom she married October 16, 1954. Doris was a 1953 graduate of Clinton High School in Clinton, Michigan. She was a former Accounting Clerk for Logan Corporation and retired in 1992. In addition to her parents and husband, she was preceded in death by her daughter, Monica Horan; three brothers, William Carmi Blodgett, John Franklin Blodgett Jr., Ray Hoover Bartram; four sisters, Anna Mae Blodgett Treat, Mary Elizabeth Blodgett Price, Lucy Marie Blodgett Jones, Alice Christina Bartram Dick; a grandson, Michael Brandon Horan. She is survived by two sons, Michael Horan of South Point, Ohio, and Timothy Horan of Huntington, West Virginia; two brothers, Conrad Allen Bartram of Clinton, Michigan, and Milton J. Bartram of Fort Gay, West Virginia; eight grandchildren and four great-grandchildren. Funeral services will be at noon Friday, February 23, 2018, at Phillips Funeral Home, 1004 South Seventh St., Ironton, with Rev. Terry Wagner officiating. Burial will follow in Woodland Cemetery, Ironton, and visitation will be Friday from 11 a.m. until the time of the service at the funeral home. To offer condolences to the family, please visit www.phillipsfuneralhome.net.", "url": "https://apnews.com/fc6dbe9697614bbe93425d1db762f8a6"}