{"authors": ["Jim Mckee For The Lincoln Journal Star"], "date_download": "2020-05-04 20:25:09", "date_modify": "2020-05-04 20:25:09", "date_publish": "2018-02-24 15:00:00", "description": "From the arrival of Lincoln’s first African-American resident, the concept of a community center grew from churches and fraternal organizations to the Malone Community Center of today. In...", "filename": "_ece454537c694b1c81a4e7bfeef5b716_1588623909.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ece454537c694b1c81a4e7bfeef5b716_1588623909.html", "title": "Jim McKee: A history of African-Americans and integration in Lincoln", "title_page": "Jim McKee: A history of African-Americans and integration in Lincoln", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "From the arrival of Lincoln’s first African-American resident, the concept of a community center grew from churches and fraternal organizations to the Malone Community Center of today.\nIn January 1861, the Nebraska Territorial Legislature passed an act to abolish slavery over the veto of Gov. Samuel W. Black. As Nebraska began the path to statehood, race again entered the picture over the question of voting rights, but after amendments, both houses of Congress ultimately overrode President Andrew Johnson’s vetoes of Nebraska’s proposed state constitution. Nebraska finally entered the union as the 37th state in 1867.\nThe city of Lincoln was not even a year old when an unnamed African-American arrived in the summer of 1868. Two years later, John C. Elder became Lincoln’s first African-American barber, employed by the Central Shaving Parlor, as a time when the U.S. census showed 15 people of African ancestry in the city.\nIn 1872, the first African Methodist Episcopal Church held services at 1024 E St. In the 1890s, the Quinn Chapel A.M.E. Church occupied a former house at 1026 F St. before erecting a new brick building on the site in 1905. In 1915, the building was moved to Ninth and C streets where it remains today. In 1879, what would become Mount Zion Baptist held services on the southwest corner of Seventh and N streets and, in the 1890s, built a basement church building at 1201 F St. on land given to them by the Nebraska Legislature. Also in the early 1890s, Quinn Chapel spun off a second location at 733 J St. as the Newman Methodist Church.\nIn 1874, the African-American Good Templars fraternal lodge opened, but when a group of 150 migrants from Mississippi attempted to settle in Lincoln in 1879, they were reported to have been “driven out.” The following year Tom Cunningham became Lincoln’s first black policeman. Lincoln’s Lebanon Lodge of Prince Hall Masons was established by the 1890s and continues today.\nWith the arrival of World War I, job vacancies brought small numbers of African-Americans to the area, and in 1918 Trago T. McWilliams, Oliver Burkhardt and William Woods spearheaded formation of a local chapter of the NAACP. While the Ku Klux Klan also formed in Nebraska during the 1920s, a network of social and fraternal organizations were also being established, including the Elks, Eastern Star and University of Nebraska fraternity Alpha Phi Alpha.\nIn May 1921, it was reported that white and black boys were wading in unfiltered water at the uncompleted Muny swimming pool. Lincoln’s mayor told the authorities to let them enjoy it, but when the pool officially opened in June, it was segregated and neither African-American nor Japanese boys could swim. When McWilliams objected, the city installed a “street shower,” prophetically at 20th and U streets, some years later.\nWith the Great Depression, the Lincoln Urban League was formed to “integrate housing, sport centers and restaurants.” In 1933, the Civil Works Administration, an affiliate of the Works Progress Administration, funded rental of a house at 1946 S St. as a temporary headquarters while the Federal Housing Administration loaned them $500 to purchase lots at 20th and U streets where a meeting house was built.\nIn January 1940, the U Street building burned. Department store owner Nathan Gold loaned the Urban League enough money for another temporary home while he and others worked with the Community Chest to raise matching funds for a grant to build a new facility at 2030 T St.\nIn 1942, Clyde Malone, born in Lincoln in 1890, succeeded Millard Woods, the founding Lincoln Urban League director, as the new building featuring a gym/auditorium, kitchen, library and meeting rooms opened. Membership, which was just over 800 people, was then more than 50 percent white.\nWhen Malone died in 1951, Lynwood Parker became the director, and when the Lincoln Urban League disaffiliated with the national organization in 1954, the name was changed to the Malone Center in his honor. The current center building, constructed in 1981, retains his name.\nUntil around World War I, African-Americans lived in several Lincoln neighborhoods, typically near downtown. Beginning in 1916, many new residential developments in Lincoln began using race restrictions in their deeds, and non-whites were informally, but pervasively, offered housing for rent or sale only east of the University of Nebraska’s city campus, an area which became known as T Town because of the T Street-area location. The neighborhood, never truly defined, ran from Vine to R and 17th to 27th streets. African-Americans interviewed for a WPA project who lived at both 835 C St. and Fifth and A streets, however, stated they lived in T Town. The T Street community, roughly centered at 22nd and S, supported a “grocery store, a cab service, a dance hall, a sandwich shop” and barbershop.\nWith the initial razing of residences for the proposed but never built Northeast Radial, the eastward expansion of the NU campus, implementation of Fair Housing Act rules, and the ultimate Antelope Valley Project, the African-American community of Lincoln’s T Town has dispersed throughout the city.\nToday’s Malone Community Center at 2032 U St., where the old street shower was located, strives to “create a community where every person develops to their full potential (and serves) all people of all cultures and ethnicities.”", "url": "https://apnews.com/ece454537c694b1c81a4e7bfeef5b716"}