{"authors": ["Emily Nohr World-Herald Staff Writer"], "date_download": "2020-05-04 20:21:58", "date_modify": "2020-05-04 20:21:58", "date_publish": "2018-04-23 05:00:00", "description": "Tom Mumgaard could relate as he thumbed through requests for mayoral pardons. People were really, truly sorry about what they had done. So last year, after the longtime Omaha city...", "filename": "_ec71a6983eb24970933f33523599777f_1588623718.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ec71a6983eb24970933f33523599777f_1588623718.html", "title": "Omaha's mayor can issue pardons for some offenses. Stothert wants to be able to grant more", "title_page": "Omaha's mayor can issue pardons for some offenses. Stothert wants to be able to grant more", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Omaha’s mayor can issue pardons for some offenses. Stothert wants to be able to grant more\nTom Mumgaard could relate as he thumbed through requests for mayoral pardons.\nPeople were really, truly sorry about what they had done.\nSo last year, after the longtime Omaha city attorney retired and stopped working full time, Mumgaard submitted a pardon application of his own.\nHe was convicted of illegal gambling two decades earlier for taking part in a football pool at City Hall. He pleaded guilty to the misdemeanor and paid a $10 fine.\nThe offense was a crime that he said humiliated him and his family.\nMumgaard said he’s refused to participate in social sports betting ever since. It remains the only criminal citation he’s ever received.\nRequesting a pardon from Mayor Jean Stothert, he said, was meaningful.\n“I wanted to ask even if I didn’t get it,” Mumgaard said last week. “I wanted to express my regret, and so I did. I expressed my regret.”\nStothert wants to give more people a chance to express such remorse.\nShe’s asking the Omaha City Council to broaden her little-known ability to pardon people who commit certain crimes prosecuted under city code.\nHer proposal goes before the council for a public hearing Tuesday; the council is set to vote the following week.\nRight now, Omaha’s mayor can pardon people convicted of offenses that fall under a single chapter of the city code, which is made up of dozens of chapters.\nStothert’s proposal would allow her to pardon people convicted of any city ordinance violation.\nSo, for example, she currently can pardon people convicted under city ordinance of misdemeanor assault and battery and damage to property in Omaha.\nShe can’t, however, pardon people ticketed for failing to restrain a dog and maintaining a nuisance, like a dirty yard.\nCity Prosecutor Matt Kuhse said the expansion wouldn’t allow the mayor to pardon someone convicted of a federal or state crime. Those typically are more serious offenses.\nAnd a mayoral pardon isn’t as powerful as a pardon granted by the president of the United States or the Nebraska Board of Pardons, which is made up of the governor, attorney general and secretary of state.\nA mayoral pardon doesn’t erase a conviction. It would still show up on someone’s criminal history, though it would also show that a pardon had been granted. And any fine or sentence a person paid or served wouldn’t be paid back.\nKuhse said that a mayoral pardon is a “formal act of forgiveness” that could benefit someone seeking a job.\n“If it’s asked on a job application if you’ve been convicted of a crime, you’d still have to answer yes. But they’d be able to say, ‘I received pardon,’ ” he said.\nStothert said she’s happy to give people a boost when seeking employment.\n“It gives them another opportunity,” she said. “I think a lot of people feel like that stigma is there because they have a criminal record.”\nA mayoral pardon helped Spencer Danner obtain a concealed carry permit for a firearm.\nMarty Bilek, Stothert’s chief of staff, said people convicted of misdemeanors can get a concealed carry permit except if the misdemeanor is for domestic violence or is a violation of a local gun ordinance.\nDanner was convicted a decade ago for unlawfully transporting a firearm. His offense was a misdemeanor prosecuted by the city. He had been driving with a gun in a unlocked case in his back seat. He pleaded guilty and paid a $100 fine.\nDanner, 39, last week called the incident an oversight that happened when he was younger.\nHe said he had forgotten about the conviction until he went to apply for a concealed carry permit last year. The application asks if the applicant has been convicted of any misdemeanors.\nIt was then he requested a pardon from Stothert, who, at the time, was his boss. Danner stepped down from his job as director of the city’s Human Rights and Relations Department in August; Stothert approved the pardon a month earlier.\nDanner, who is running for Nebraska Secretary of State as a Democrat, commended Stothert, a Republican, for wanting to pardon more people.\nAnd he added that his experience with receiving a pardon could help if he’s elected because he would serve on the State Board of Pardons.\n“When you have a leader that’s willing to take a much-needed step to help citizens so they can get employment and housing, that will go a long way,” he said of Stothert’s proposal.\nStothert said that the city used the standard process when considering Danner’s request and that he never spoke to her about it.\n“I can guarantee this was no special favor,” she said.\nStothert said her proposal builds on a city policy that removed a section from city job applications requiring applicants to list their criminal history. Stothert supported that “ban the box” change when it was adopted several years ago.\nStothert said the pardon process, if expanded, would work the same as it does today.\nPeople who want a pardon submit an application and write a letter describing what happened and why they want to be pardoned. That request goes to the city prosecutor, who looks at the applicant’s criminal record before making a recommendation to the mayor.\nStothert said the city can check that the person hasn’t reoffended in the previous five years. The city prosecutor’s recommendation goes to Bilek for review. Then it goes to Stothert’s desk.\nStothert said she couldn’t recall an instance in which she denied a request that the prosecutor had recommended.\nSince Stothert became mayor five years ago, Bilek said, the Mayor’s Office has processed 235 requests for pardons. Of those, 77 were approved and granted. The crimes included disorderly conduct, harassing someone over the phone, soliciting prostitution and neglect by a caretaker.\nKuhse said some pardons were denied because the mayor didn’t have the authority to grant them: The applicant, for example, committed a crime that was prosecuted under state law. Those are automatically denied.\nCrimes that can be pardoned by the mayor are misdemeanors and other smaller violations.\nMumgaard, who worked for the city for more than 30 years and has been a member of the Papillion City Council for about the same amount of time, said he thinks a mayoral pardon is worthwhile.\n“People should have regret over their missteps and know that the city will reward them for recognizing that they’ve made a mistake,” he said.", "url": "https://apnews.com/ec71a6983eb24970933f33523599777f"}