{"authors": [], "date_download": "2020-05-04 20:18:13", "date_modify": "2020-05-04 20:18:13", "date_publish": "2018-01-05 10:00:00", "description": "Charlie Puth has been forced to delay his second studio album. The 'See You Again' hitmaker is producing his own record - the follow-up to 2016's 'Nine Track Mind' - this time and wants to...", "filename": "_dd7dad876ba743fc9ead8139a2cfc4e5_1588623493.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dd7dad876ba743fc9ead8139a2cfc4e5_1588623493.html", "title": "Charlie Puth delays second album Voicenotes", "title_page": "Charlie Puth delays second album Voicenotes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Charlie Puth has been forced to delay his second studio album.\nThe ‘See You Again’ hitmaker is producing his own record - the follow-up to 2016′s ‘Nine Track Mind’ - this time and wants to make sure it’s “perfect” before unleashing it to his fans.\nThe 26-year-old pop star recently dropped a new song from the record featuring Boyz II Men, titled ‘If You Leave Me Now’, to make it up to his loyal following who will have to wait just a bit longer to receive the full record.\nTaking to Twitter to apologise to his two million followers, he wrote: “So I have good news and bad news.\nThe bad news is that I have to push the album release date. I’m producing this album all myself and with that comes a lot of work, and in my opinion, the album is not perfect yet. However, it will still come out this year, and soon. (sic)”\nSo far, Charlie has released ‘Attention’, ‘How Long’ and ‘If You Leave Me Now’ from the album, which is called ‘Voicenotes’.\nMeanwhile, the dark-haired hunk recently admitted he never thought he would collaborate with Selena Gomez.\nThe pair worked on hit single ‘We Don’t Talk Anymore’ in 2016, and even though he asked her at party if they could collaborate, he never believed it would actually happen.\nRecalling their meeting, Charlie said: “Taylor Swift introduced us at this VMA afterparty a while back. I think I even was like, ‘We should do something sometime.’ I say that to every artist I meet, because I just can’t believe I’m in this position where people want to work with me. But I didn’t actually think it was gonna happen.”\nThe ‘Attention’ musician played Selena, 25, the track over FaceTime four months after they met, and he admits it wasn’t until he got the star’s approval that he decided it would make an excellent duet.", "url": "https://apnews.com/dd7dad876ba743fc9ead8139a2cfc4e5"}