{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:06:32", "date_modify": "2020-05-04 20:06:32", "date_publish": "2018-10-10 10:00:00", "description": "My grade school piano teacher, Betty Carlson, lived down the road from my house. Lessons were at 4 o’clock on Wednesday afternoons, at which time I would walk the quarter-mile of gravel to...", "filename": "_c14c58cca8884ffdae05763297b4b684_1588622792.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c14c58cca8884ffdae05763297b4b684_1588622792.html", "title": "People remember the craziest things", "title_page": "Jen's World: People remember the craziest things", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "My grade school piano teacher, Betty Carlson, lived down the road from my house.\nLessons were at 4 o’clock on Wednesday afternoons, at which time I would walk the quarter-mile of gravel to her house and try to make it look like I’d practiced that week. I mean, aside from the 20 minutes I’d just spent banging out “Minuet” or “Waltzing Matilda” from my Bastien piano book before walking over.\nMrs. Carlson was kind-spoken and fair, patient and warm. Decades later, I found out she also happened to have a freakishly remarkable memory. At least when it came to one thing.\nAbout seven years ago, I ran into Mrs. Carlson at the Hugo’s grocery store in my hometown. We were chatting in the canned vegetable aisle when she said, “Now, isn’t it Amy’s birthday tomorrow? March 6?”\nAmy, my sister, quit piano lessons after a year.\n“It is!” I said. “How could you possibly know that?”\n“I remember birthdays,” she told me, matter of factly. “Yours is Nov. 6. Your dad’s is Jan. 29. Your niece Chloe’s is April 17.”\n“You should take that show on the road,” I said.\nBecause, who remembers stuff like that? Who can explain how the brain even works? Well, I mean, besides neurologists. But who can explain why some of us can remember sitting cross-legged on the blue classroom rug with our hands in our laps in kindergarten while the bespectacled Ms. Cerne taught us the good morning song (“… we’re all in our places with bright shining faces …”), while others can’t for the life of them even remember their kindergarten teacher’s name?\nWhat is that? What makes us remember details — details we sometimes even surprise ourselves with?\nCase in point: Last week, I woke up and looked at my calendar to see what was on the day’s agenda.\n“October 4,” it read. I had a meeting at Dunn Bros. North at 9 a.m. A writing deadline at noon. A high school soccer game at 5 p.m. … but there was something else.\n“Oct. 4,” I thought. “What’s on Oct. 4 …?”\nAnd then it hit me. It was Stephen’s birthday. Stephen being my friend Anita’s son. My friend Anita who moved away from my hometown with her family when we were 14. Who has lived in St. Cloud the overwhelming majority of the time we’ve known each other. Who had her son 20-some years ago. A son who, I should add, if he was standing in line behind me at Dunn Bros. this morning, would have no idea who I was.\nYet, on Oct. 4, one of my very first thoughts of the day is: “It’s Stephen’s birthday!”\nHis isn’t the only date I keep locked in the Vault of Random Facts in my head. 681-1088 and 681-4872 are the phone numbers of my two best friends in grade school, Nicole and Kelly. 681-9945 is the number of the Galaxy Twin Theater, where I had my first job at age 16.\nKB0PK was my Grandpa Farm’s ham radio call letters. Route 1, Box 294B is where I grew up, even though the United States Postal Service hasn’t recognized it as such for decades. 681-4565 is and always will be my Grandma Haugen’s phone number, even though she died about 15 years ago.\nMay 13 is the day I broke up with my first high school boyfriend. Oct. 13 is the first breakup that broke my heart. Feb. 4 is my first date with my husband.\nIt’s not like I’m trying to remember these dates. (Except maybe that Feb. 4 one). I just do.\nPlay me a song that I first heard in 1982 — “Jack and Diane”? “Maneater”? “Ebony and Ivory”? — and I’ll sing every word. I won’t even KNOW that I’ve memorized the song until the lyrics come spilling out. Explain that one, because even I don’t understand it.\nI mean, seriously, isn’t there some more important information that could occupy that part of my brain besides “… And the last known survivor stalks his prey in the night / And he’s watchin’ us all with the EYE ... of the TIGER!”\nI was in the car with my 16-year-old the other day when “Shoop” by Salt ’n’ Pepa came over the radio. I sang Every. Single. Word.\n“How do you KNOW this?” he asked, horrified, as I sang-shouted, “Don’t know how you do the voodoo that you do so well, it’s a spell…”\n“I don’t know,” I said. “But I just do. I really, really do.”", "url": "https://apnews.com/c14c58cca8884ffdae05763297b4b684"}