{"authors": ["Paul Walsh"], "date_download": "2020-05-04 20:21:23", "date_modify": "2020-05-04 20:21:23", "date_publish": "2018-08-21 06:11:39", "description": "Long time Twin Cities sports anchor Mark Rosen gave a brief televised update on his wifes battle with cancer and said his return to work remains on hold. Rosen revealed wife Denises brain...", "filename": "_e1a111cbef904fa48e421ab6c2020f5e_1588623683.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e1a111cbef904fa48e421ab6c2020f5e_1588623683.html", "title": "Mark Rosen says wife's cancer will keep him from TV duties a 'while longer'", "title_page": "Mark Rosen says wife's cancer will keep him from TV duties a 'while longer'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mark Rosen says wife’s cancer will keep him from TV duties a ‘while longer’\nLong time Twin Cities sports anchor Mark Rosen gave a brief televised update on his wifes battle with cancer and said his return to work remains on hold.\nRosen revealed wife Denises brain cancer late last month and the surgery she had to remove a tumor.\nMonday evening on WCCO, he thanked everyone who sent along well wishes and gave a glimpse into the seriousness of his wifes health challenge:\nI want to thank everyone for reaching out during this difficult time with my wifes health. Honestly, all the kind messages have been overwhelming.\nCancer has an insidious way of turning families inside out in the blink of an eye, but families have a way of fighting back even harder. So we fight on against this aggressive form of brain tumor, backed by an incredibly dedicated medical team and waves of positivity.\nIm going to be away from the news desk a little while longer, in the meantime, we will bottle all the love and support sent our way.\nDenise Rosen, 67, and Mark met while she was an artist at WCCO, and they have been married for more than 40 years.\nAlong with his full-time duties at WCCO, Rosen makes regular appearances on KFAN Radio, 100.3 FM. He has also put aside those duties.\nPaul Walsh 612-673-4482", "url": "https://apnews.com/e1a111cbef904fa48e421ab6c2020f5e"}