{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:20:56", "date_modify": "2020-05-04 20:20:56", "date_publish": "2018-12-27 05:01:01", "description": "The headlines say West Virginia lost 11,216 residents in the past year. The longer-term view says the state has lost 47,162 people since the 2010 census. The even-longer-term view says that unless...", "filename": "_62dd2b5f797c4e1bb112c45e48a71147_1588623656.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_62dd2b5f797c4e1bb112c45e48a71147_1588623656.html", "title": "Editorial: W.Va. population decline points to larger problems", "title_page": "Editorial: W.Va. population decline points to larger problems", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The headlines say West Virginia lost 11,216 residents in the past year. The longer-term view says the state has lost 47,162 people since the 2010 census. The even-longer-term view says that unless something changes, things will get worse.\nFrom a statistical point of view, a loss of 47,000 people among more than 1.8 million might not be all that significant. But when the nation’s population grew by 26 million in that same time, it means West Virginia is falling behind as a place where people want to live.\nThe Census Bureau released its latest state population estimates the morning of Dec. 20. Estimates are based on the 2010 census numbers and are adjusted for births, deaths and migration. The most recent estimates are for July 1, 2018.\nThe farther out we get from the 2010 census, the less reliable the estimates will be. The actual head count in 2020 will be far more important than the latest estimates, but the estimates give us an idea where we are headed, whether we want to go in that direction or not.\nYou can look at West Virginia’s stable population as an asset or a liability. We’re not taking on more people than the economy can support, but at the same time our economy isn’t strong enough to take on more people.\nDigging into the numbers, it is apparent West Virginia has two problems. One is that more people are moving out of the state than are moving in. That’s nothing new, and it’s not unique. At least 17 other states have had the same problem since the beginning of this decade. Most are in the Northeast and the Midwest. Ohio is one of them.\nThe other problem is natural increase. West Virginia and Maine are the only two states to have seen more deaths than births since 2010. Maine’s natural increase was negative 7,412, but it gained 18,302 through migration. Perhaps West Virginia officials should look into what is making Maine so attractive to people looking to relocate.\nWest Virginia has lost 27,508 people to migration this decade. Meanwhile, it has had 19,169 more deaths than births.\nWhy is that? Are our young people of childbearing age leaving the state faster than we can attract others to move here? Do the young people living here now have fewer incentives or even less desire to have children?\nThe recent estimates were for the state level. County-level estimates are scheduled for release in March. Those should give us a good grasp of which regions have the greatest problem, although it’s pretty obvious the Morgantown area and the Eastern Panhandle are doing better in population growth than other regions.\nOne impact on the population decline is West Virginia’s representation in the U.S. House of Representatives and the Electoral College. At this rate, West Virginia will lose one of its three seats for the 2022 election, and it will have one fewer vote in the Electoral College in the 2024 presidential election.\nIn 1940, before air conditioning, West Virginia had six seats in the House, and Florida had only five seats. Florida now has 27 seats and could gain one or more after the 2020 census. In fact, Florida has had a larger gain this decade from migration (2.2 million people) than West Virginia has in total population (1.8 million).\nBut politics is only one worry about a declining population. The fact that our economy apparently cannot sustain the number of people we have now should be uppermost in the minds of all involved in providing what West Virginia needs for a prosperous future.\nSome parts of the state are already in a cascade failure, where a decline in one segment of the local economy leads to another in a chain reaction that crashes the whole system. At this rate, not much is happening to prevent that from spreading into more regions.", "url": "https://apnews.com/62dd2b5f797c4e1bb112c45e48a71147"}