{"authors": ["Ben Frederickson St. Louis Post-Dispatch"], "date_download": "2020-05-04 20:09:42", "date_modify": "2020-05-04 20:09:42", "date_publish": "2018-02-21 19:00:00", "description": "Eye on the Tigers podcast: After Ole Miss debacle, how does Mizzou make NCAA tournament? Just how bad was the Missouri men's basketball team's overtime loss to Ole Miss? Well,...", "filename": "_178449cfbeb64e3c8288dad53e74db6a_1588622982.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_178449cfbeb64e3c8288dad53e74db6a_1588622982.html", "title": "Eye on the Tigers podcast -- After Ole Miss debacle, how does Mizzou make NCAA tournament?", "title_page": "Eye on the Tigers podcast -- After Ole Miss debacle, how does Mizzou make NCAA tournament?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Eye on the Tigers podcast -- After Ole Miss debacle, how does Mizzou make NCAA tournament?\nEye on the Tigers podcast: After Ole Miss debacle, how does Mizzou make NCAA tournament?\nJust how bad was the Missouri men’s basketball team’s overtime loss to Ole Miss?\nWell, last-place Ole Miss had lost seven straight entering the game. And had not won a road game all season. And had just parted ways with head coach Andy Kennedy.\nAnd still Mizzou could not get it done.\nIn this edition of the Eye on the Tigers podcast , Mizzou beat writer Dave Matter and sports columnist Ben Frederickson break down what went wrong in the second of Mizzou’s back-to-back losses.\nWhat happened on those final possessions?How does this defeat impact the Tigers’ chances of making the NCAA tournament?More importantly, what do the Tigers have to do to get back to playing the level of basketball that made them a tournament-type team?Matter also updates the Terrence Phillips dismissal and the timetable for Michael Porter Jr’s latest doctor’s appointment.\nThen the topic shifts to Mizzou women’s basketball, where coach Robin Pingeton and star player Sophie Cunningham are creating discussion about coach and player of the year awards.\nClick here to subscribe to this podcast\nClick here for the “Eye on the Tigers” archive", "url": "https://apnews.com/178449cfbeb64e3c8288dad53e74db6a"}