{"authors": ["Lauren Owens Lowens Florencenews.Com Morning News"], "date_download": "2020-05-04 20:07:24", "date_modify": "2020-05-04 20:07:24", "date_publish": "2018-09-12 01:12:00", "description": "FLORENCE, S.C. – The Red Cross and the Florence County Emergency Management Services have opened shelters across the county to aid evacuees from Hurricane Florence. Florence County has four...", "filename": "_8bf4c211511148fc92cffed8e4f4adbf_1588622844.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8bf4c211511148fc92cffed8e4f4adbf_1588622844.html", "title": "Red Cross, Emergency Management Services open shelters across Florence County", "title_page": "Red Cross, Emergency Management Services open shelters across Florence County", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FLORENCE, S.C. – The Red Cross and the Florence County Emergency Management Services have opened shelters across the county to aid evacuees from Hurricane Florence.\nFlorence County has four shelters in operation for the hurricane housed in local schools: Wilson High School, South Florence High School, Lake City High School and Timmonsville High School. The South Florence High School and Wilson High School shelters opened at 4 p.m. Tuesday.\nAccording to the Florence County Emergency Management, the Timmonsville shelter opened later Tuesday.\nAccording to Cuthbert Langley, spokesman for the South Carolina region of the Red Cross, the American Red Cross is working closely with people in the county to make sure there is space for all evacuees in local shelters.\nLangley said Hannah-Pamplico Elementary Middle School can open as a shelter if more space is needed.\nEvacuees should bring their own sleeping bags, pillows, hygiene supplies and extra clothing, Langley said. The Red Cross will provide water, food and snacks to evacuees in the shelters.\nLangley said the shelters will stay open as long as the evacuees need them.\nOne evacuee at the Wilson High School shelter, Shawna Larimer, said she was on her way to North Carolina and went into labor while in Conway. Larimer, her fiancé and cousin were transferred to McLeod Hospital with her twins.\nThe three were sent to the shelter while her children stayed in the NICU at McLeod Hospital because of overcrowding, Larimer said. She also said the shelter is better than staying at the hospital.\n“We’ve just been through a lot,” Larimer said.\nLarimer said she and her family will stay in the shelter until the storm is over.\nSouth Florence High School is at 3200 S. Irby St. in Florence, Wilson High School is at 1411 E. Old Marion Highway in Florence, Lake City High School is at 652 N. Matthews Road in Lake City, and Timmonsville High School is at 304 Kemper St. in Timmonsville.\nIn addition to the Florence County shelters, Darlington County Emergency Management and the Red Cross will open a shelter in Darlington at Darlington Middle School at 7 p.m. today.\nDarlington Middle School is located at 150 Pinedale Drive, Darlington.\nTo help with hurricane relief efforts and shelters for evacuees, people can donate at redcross.org, text Florence to 90999 for a $10 donation, or call 1-800-Red-Cross.", "url": "https://apnews.com/8bf4c211511148fc92cffed8e4f4adbf"}