{"authors": ["David Rothbard", "Craig Rucker"], "date_download": "2020-05-04 20:05:54", "date_modify": "2020-05-04 20:05:54", "date_publish": "2018-04-05 04:02:33", "description": "It certainly seems like going \"green\" is trendy these days. And we hear a lot about the benefits of renewable energy and electric cars. But there may be hidden costs in the pursuit of \"clean...", "filename": "_6abec08c8cb14e1884ff7de2d5551f8a_1588622754.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6abec08c8cb14e1884ff7de2d5551f8a_1588622754.html", "title": "As autos 'go green,' expect to pay more", "title_page": "Column: As autos 'go green,' expect to pay more", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It certainly seems like going “green” is trendy these days. And we hear a lot about the benefits of renewable energy and electric cars. But there may be hidden costs in the pursuit of “clean energy,” and they may affect consumers more than expected.\nTake California’s new Zero Emissions Vehicle (ZEV) mandate. California and nine other states are requiring automakers to sell a progressively larger number of electric cars each year. And so, automakers must either meet their annual ZEV quotas or purchase costly credits to make up the difference.\nUnfortunately for automakers, consumers aren’t hurrying to buy electric cars. One reason of course is the price tag. Even the least expensive ZEVs, like the Nissan Leaf and Chevy Volt, cost roughly $30,000. Those prices are simply out of reach for much of America, where the median annual income is approximately $44,000. A more likely option, in contrast, would be a small, fuel-efficient vehicle like the $17,000 Chevy Cruze. But consumers may also be balking at the limited range of electric cars. The Chevy Volt travels only 53 miles per charge. A Tesla Model S, which currently costs $70,000, may travel 200-300 miles per charge.\nCalifornia is clearly in the vanguard of environmental activism, but the ZEV mandate is having an outsized effect on consumers in others states. That’s because automakers are feeling the progressively rising cost of their ZEV obligations. In 2015, states following the ZEV mandate represented 28 percent of all U.S. vehicle sales. By 2025, those 10 states have mandated that ZEV purchases must exceed 15 percent of total car sales.\nAutomakers not meeting their ZEV quota must purchase credits from electric vehicle manufacturers, like Tesla, or pay a $5,000 fine for each credit they are short. Noting the hefty price tag for electric cars, and the obvious limitations of battery range, it’s likely that automakers will be forced to buy an expensive chunk of credits each year in order to meet their increasing ZEV obligations.\nThat’s when things get interesting, since auto manufacturers already survive on tight margins. Meeting ZEV requirements will mean automakers passing the cost of these credits on to their customers. And that means conventional autos rising in price to help subsidize more costly electric cars.\nRealistically, the ZEV mandate means cash-strapped consumers in heartland America will be paying more to buy a conventional car. And they will be doing so to aid the purchase of electric cars for wealthier Americans. It’s a strangely convoluted scenario, since electric cars are typically purchased as a second or third vehicle for more affluent families. But now, wealthier America will purchase a Tesla more easily, thanks to the subsidies being shouldered by lower income families.\nThere’s a further irony here, too, since almost two-thirds of all electricity generated in the U.S. comes from coal and natural gas power plants. Thus, these plug-in electric vehicles will still be powered mostly by fossil fuels.\nIf ZEV mandates increase, more Americans could be compelled to purchase electric cars — or face escalating auto prices. That could mean even middle class Americans struggling to afford a car. But that might well be the grand intention of those pushing so hard for electric cars — to simply price conventional automobiles out of reach for everyday Americans.\nDavid Rothbard is president and Craig Rucker is executive director of CFACT.", "url": "https://apnews.com/6abec08c8cb14e1884ff7de2d5551f8a"}