{"authors": ["Robert Storace"], "date_download": "2020-05-04 20:04:05", "date_modify": "2020-05-04 20:04:05", "date_publish": "2018-12-10 20:13:32", "description": "A product of “The Harvard Five”, Darien’s 3 Settler’s Trail was built in 1977 but has been restored to its full glory with modern amenities. Philip Johnson was the most prominent member of...", "filename": "_1bb90bcee3594f8ab3d8b6273e08250e_1588622645.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1bb90bcee3594f8ab3d8b6273e08250e_1588622645.html", "title": "hOT PROPERTY One of ‘The Harvard Five’ architects built Darien home", "title_page": "hOT PROPERTY One of ‘The Harvard Five’ architects built Darien home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A product of “The Harvard Five”, Darien’s 3 Settler’s Trail was built in 1977 but has been restored to its full glory with modern amenities.\nPhilip Johnson was the most prominent member of The Harvard Five, who were colleagues and graduates of Harvard University. They were considered ambassadors and innovators of the modernist movement working together designing and building homes in the region, according to William Pitt Sotheby’s International Realty’s Bruce Baker, the listing agent.\nJohnson, Baker said, was the architect responsible for 3 Settler’s Trail, a 1.15-acre gem in the heart of Darien.\n“The home has a great vibe to it,” Baker said. “This is what it’s like in a nature preserve. It is unique architecture. It’s a deck house that is simple, yet uncomplicated.”\nDeck houses, Baker said, “are once again in demand. Their high-quality construction is standing the test of time.”\nThe current owners, Baker said, “have gone all out to respect and take full advantage of what the unique design offers while updating and enhancing the property for today.”\nWith four bedrooms and two-and-a-half half baths, the home has signature refurbished tongue and grooved vaulted ceilings, open-concept living, hidden built-ins and great walls that invite nature in and provide passive solar heat, Baker said.\n“There is an incredible wraparound, elevated new wood deck with cedar railings and copper post caps,” Baker said. New amenities, he said, include utilities, floors, lighting, windows, skylights, radiant heated floors, gas fireplaces, patios, a new roof and a newly designed and constructed two-car garage.\n“Modern meets natural warmth in the gourmet eat-in kitchen,” Baker said. The one-of-a-kind kitchen has mahogany cabinetry and granite countertops.\nIn addition, Baker said, there is a vaulted living/family room with fireplace surrounded by glass exterior walls and deck. The luxurious and serene master suite comes complete with a new marble bathroom.\nThe spacious at-grade lower level, Baker noted, offers a family room with fireplace and plenty of play space opening to a beautiful level-side yard. There are also additional bedrooms, a full bath and a laundry/work-out room.\nLocated a half mile from town, the natural wood-stained brown home is set on a private, wooded acre with many unique plantings, artfully-designed paths and outdoor spaces that are “all sensitively sculpted to the land.” Baker said.\nThere has been major landscaping renovation of the energy efficient property’s entrance and driveway. And, Baker said, the walking trails are filled with perennials.\n“This iconic masterpiece is stunning and not to be missed,” Baker said. “It’s got an historic style and a superb mid-century look and architecture set in desirable Darien, just in time for the breaking ground soon of Darien’s new town Center.”\nListing agent: Bruce Baker, William Pitt Sotheby’s International Realty, (203) 912-7061, bbaker@\nwpsir.com.", "url": "https://apnews.com/1bb90bcee3594f8ab3d8b6273e08250e"}