{"authors": ["Joshua Lloyd"], "date_download": "2020-05-04 20:04:09", "date_modify": "2020-05-04 20:04:09", "date_publish": "2018-01-15 20:58:00", "description": "FLORENCE – Monday marked what would have been the 89th birthday of Dr. Martin Luther King Jr., an icon of the civil rights era whose wisdom on race relations in America still resonates nearly...", "filename": "_35b49f57659e47f28eb48a1d95e2be37_1588622649.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_35b49f57659e47f28eb48a1d95e2be37_1588622649.html", "title": "Florence residents celebrate MLK Jr. Day with 19th annual march", "title_page": "Florence residents celebrate MLK Jr. Day with 19th annual march", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FLORENCE – Monday marked what would have been the 89th birthday of Dr. Martin Luther King Jr., an icon of the civil rights era whose wisdom on race relations in America still resonates nearly half-a-century after his death.\nHundreds of Florentines – black, white, Hispanic and Asian -- took to the streets for the 19th annual march into downtown Florence, not only to celebrate Dr. King’s life and legacy but to reflect on how it can be applied in 2018.\nLaShonda NeSmith, chairwoman of the Florence County Democratic Party and one of the march’s organizers, said this day is about moving forward productively in a time when racial tensions are heightened.\n“Marching in nonviolence, hand in hand, with our community and for our community is the path forward towards real justice and equality,” she said. “Whatever injustices we face, which there are a lot of, we can face it together. It takes all of our voices together to make the kinds of changes we need.”\nNeSmith noted the increased diversity of age, race and gender at this year’s march; a positive sign that Florence residents are aware of the importance of race and gender equality.\nThese marchers started at Shekinah Glory Seventh Day Adventist Church on Oakland Avenue before marching down Oakland Avenue, across the Martin Luther King Jr. Bridge and into downtown Florence, ending with a program at the Francis Marion University Performing Arts Center.\nThe program included singing, dance routines from youth members of the Leap of Faith Praise Dance Ministry and remarks from Dr. Calvin E. Robinson, pastor of Trinity Baptist Church in Florence.\nRobinson’s message also resonated with the theme of moving forward into a better tomorrow for systemically oppressed communities in the American culture.\n“We can see some of the gains made yesterday but what about tomorrow,” Robinson asked those gathered. “We must prepare today so that we do not awaken to a dream of complacency and a nightmare of retrogression.”\nHe said the current political and social climate calls for action.\n“Are we going to continue on a path of parity for all people or will we make a left turn and begin to move backwards once again,” Robinson said. “There are those in power who would erase decades of slow but steady progress. We don’t want anyone to give us anything out of pity, but we can’t be denied what little opportunity we’ve worked for to better ourselves.”", "url": "https://apnews.com/35b49f57659e47f28eb48a1d95e2be37"}