{"authors": ["Lisa Zapalac"], "date_download": "2020-05-04 20:26:52", "date_modify": "2020-05-04 20:26:52", "date_publish": "2018-09-09 05:00:00", "description": "Open daily including Sunday, Sept. 9, from noon to 6 p.m., The Wilshire by Pelican Builders is located at 2047 Westcreek. Listing agent Tina Weinhoffer of Sudhoff Companies said that just a...", "filename": "_29e1d858eab04d02bb6c05c68854d1f3_1588624012.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_29e1d858eab04d02bb6c05c68854d1f3_1588624012.html", "title": "The Wilshire in River Oaks area offers final home opportunities", "title_page": "The Wilshire in River Oaks area offers final home opportunities", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Open daily including Sunday, Sept. 9, from noon to 6 p.m., The Wilshire by Pelican Builders is located at 2047 Westcreek.\nListing agent Tina Weinhoffer of Sudhoff Companies said that just a few homes remain and are ready for move-in at this 17-story high-rise that is within walking distance to some of Houston’s most sought-after shopping, dining and entertainment destinations in the River Oaks area.\nEnhanced by amazing views, the versatile floor plans offer features that include open living areas, 10-foot ceilings, and island kitchens with Sub-Zero and Wolf appliances; German SieMatic European cabinetry; and wood, tile, and stone finishes on flooring and counters. Master suites also feature incredible views, a sitting area, luxury bath and a large closet.\nLocated on the east side of Westcreek between San Felipe and Westheimer, The Wilshire offers residents valet and 24-hour concierge; a resort-style pool with cabanas, indoor lounge spaces with a catering kitchen and AV equipment; a huge fourth-floor lounge, a private dog run, and a state-of-the-art fitness center; and two furnished overnight guest suites for guests of residents.\nOne of the final available residences is #307, with two bedrooms, two baths, a balcony off the living room and 1,392 square feet. It is priced at $699,000.\nFurther details\nFor more information, visit the sales office or www.Sudfhoffco.com.", "url": "https://apnews.com/29e1d858eab04d02bb6c05c68854d1f3"}