{"authors": ["St. John Barned-Smith", "Samantha Ketterer", "Keri Blakinger"], "date_download": "2020-05-04 20:09:33", "date_modify": "2020-05-04 20:09:33", "date_publish": "2018-08-02 05:00:00", "description": "The day before he biked into the middle of the Texas Medical Center and allegedly shot and killed a prominent Houston cardiologist, Joseph James Pappas II signed his Westbury home over to an Ohio...", "filename": "_7938102ef8634e2ca316fa55880edf86_1588622973.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7938102ef8634e2ca316fa55880edf86_1588622973.html", "title": "Houston doctor’s accused killer shed possessions before Medical Center slaying", "title_page": "Houston doctor’s accused killer shed possessions before Medical Center slaying", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The day before he biked into the middle of the Texas Medical Center and allegedly shot and killed a prominent Houston cardiologist, Joseph James Pappas II signed his Westbury home over to an Ohio woman, records show.\nMonths before that, the 62-year-old real estate broker and former lawman appeared to be divesting himself of his other possessions, including furniture, firearms and tactical equipment.\nIt is unclear if the man accused of killing renowned Houston cardiologist Dr. Mark Hausknecht simply was broke or erasing his life, sources close to the investigation said Wednesday.\nThe suspected killer, whom law enforcement sources say could be suicidal, remained at large Thursday nearly two weeks after the July 20 shooting. Police said the motive for the killing likely stemmed from a grudge Pappas held against Hausknecht, after his mother died under the doctor’s care 20 years earlier.\nOn Thursday, Hausknecht’s relatives asked for the public’s help finding Pappas.\n“The Hausknecht family is very grateful for the diligent hard work and professionalism of the Houston Police Department and all the other agencies, organizations and countless individuals who have contributed to the identification of Joseph James Pappas as the suspect in the murder of Dr. Mark Hausknecht,” the family said, in an emailed statement. “The family urges that if you know anything about the possible whereabouts of the suspect, please contact Houston Police Department as soon as possible.”\nWhile it is not clear what prompted Pappas to act last month, he appears to have started offloading furniture online as far back last October, listing an antique desk for sale on the neighborhood-focused social media site Nextdoor.com. On a now-deleted account, he typically posted about lost dogs and dead cats. In January, he started listing dozens of items on Armslist.com and another firearms forum, ranging from a case feed assembly, two shell plates to a round counter to a metal work bench. On Greensheet, he listed a treadmill.\nFive days after the killing, a seller using the same phone number Pappas listed posted ads for two tactical vests, a Smith & Wesson .38-caliber revolver, a $4,500 semi-automatic FN rifle, two sets of ballistic door panels for a Crown Victoria and a box of ammunition. All told, the items were valued at thousands of dollars. It is not clear whether any of them sold — or whether either firearm may have been the murder weapon.\nWhen police entered the home on Stillbrooke early Wednesday, they found ammunition, a gun and multiple holsters. The front room had been almost entirely cleared out.\n“It looks like the guy was trying to get rid of his worldly possessions,” a source familiar with the investigation said.\nThree days after the shooting, and after he’d signed over the deed to his house, Pappas summoned a courier service to file the deed with the Harris County Clerk’s Office.\nJoe Donaldson, the courier who picked up the deed, said Pappas seemed anxious, glancing up and down the street as he handed over the documents.\n“He was very nervous, opened the door a crack,” Donaldson said. “I thought ‘This was strange.’”\nPappas called Donaldson several times after that to check on the status of the deed, which was being conveyed to the Ohio woman, who appears to be a notary public. “Is it filed yet? Is it there yet?” Donaldson recalled him saying.\nDonaldson wondered if Pappas was planning to kill himself.\n“It’s not normal for people to be so antsy about transferring a property,” Donaldson said. “It just indicated he was premeditating this before it ever happened.”\nOther elements of Pappas’ life continued to come into focus as police kept up their search for his whereabouts, even as they acknowledged that the possibility he may have taken his own life.\nRecords from the Texas Commission on Law Enforcement show Pappas worked as a deputy constable with the Harris County Precinct 2 Constable’s Office from 1983 to 1986, and at Precinct 7 from 1986 to 1995. From 1995 to 2013, he worked as a reserve deputy, first at Precinct 7 and then returning to Precinct 2.\nReached by phone on Thursday, former Precinct 2 Constable Gary Freeman described Pappas as “unassuming” and “very professional.”\n“I never had any complaints about Joey,” Freeman said. Pappas often drove for his father, Joseph James Pappas, who had served as former chief deputy at the constable’s office years before under then-Constable George Larkin and who kept his license with the department as a reserve deputy, as well.\n“It’s just mind-boggling, I was really surprised when (Precinct 2 Chief Deputy Jerry) Luman called me and told me Joey was a suspect in this,” Freeman said.\nLuman said that after Constable Chris Diaz was sworn in to office in early 2013, the department asked all its deputies and reserve deputies to re-apply for their positions. Pappas never turned in an application, he said.\nBefore Pappas entered law enforcement, he was an employee at Mitchell Energy Corporation until 1984, according to court records.\nPappas lost his job at Mitchell after he was forced out of the Houston Oil Scouts Association, an industry membership group. In 1986, Pappas sued the association, arguing that by kicking him out, the group wrongfully interfered with his employment and got him fired from his job at Mitchell.\nIn court documents, he said that he was pushed out of the association because he failed “to heed directions to avoid contact with the Internal Revenue Service concerning compliance with IRS regulations.” He also accused an association leader of threatening him.\nUltimately, a jury found that Oil Scouts Association had not interfered with Pappas’ employment, records show.\nRecords filed at the Harris County Clerk’s office show that, in addition to his work as peace officer, Pappas registered several businesses that included an academy for concealed handgun training, a couple of dental clinics, and two organizations identified as Westbury Area Residents for Responsible Flood Control and Westbury Property Owners for Responsible Flood Control. All of the assumed name listings have expired.\nFor nearly two weeks, the Hausknecht case stymied investigators, who combed through “tons and tons” of surveillance footage of the moments before, during and after the brazen July 20 killing.\nHausknecht was biking to work in his scrubs during the morning rush hour, passing by the intersection of Main and Holcombe when a man on a 10-speed Schwinn bicycle passed him from behind just before 9 a.m. Two blocks later, the other rider turned and fired at least twice. The doctor — a famed physician who once had treated former President George H.W. Bush — went down immediately. The gunman rode off headed north, disappearing into morning traffic.\nAside from offering up a trickle of surveillance footage and the tantalizing hint that the attack likely was targeted, authorities remained tightlipped about their investigation.\nOn Monday, one of those videos helped break the case after a tipster alerted police to a possible connection to Pappas, whose mother died on the operating table under Hausknecht’s care roughly two decades ago.\n“It appears that this may have been a 20-year-old grudge that this man held,” Houston Police Chief Art Acevedo told reporters.\nPolice eventually learned that Pappas had texted someone, indicating he wanted to kill himself.\nOfficers showed up at his home late Tuesday for a welfare check, but Pappas was not there. They returned around 4 a.m. Wednesday with a pair of warrants — one to search the house and another to arrest Pappas for murder. Again, Pappas was not home, but investigators said they did find evidence tying him to the killing.\nOn Thursday, friends and neighbors in the Westbury area said they still were in shock.\nPappas, whom many knew as “Joey,” was a quiet, nice man who mostly kept to himself, they said.\nJoe Duce, who lives across the street from Pappas, was getting home from a vacation in New Mexico when he saw the police commotion. He checked the news.\n“Oh my god, that’s our neighbor,” he remembered thinking.\nDuce said he never got the sense that Pappas was harboring such an intense grudge.\n“To carry that with you for 20 years is hard enough,” he said. “But to throw your life away like that, just to get revenge.”\nAt the Texas Medical Center, Hausknecht’s slaying had some colleagues on edge.\nDr. Neal Kleiman, who worked closely with Hausknecht as medical director of the catheter lab at the DeBakey Heart and Vascular Center at Methodist, said the grudge-motivated incident is making people at the hospital more vigilant.\n“It’s definitely spooked people here,” said Kleiman. “You think of this as a very protective environment, but this was definitely a reminder that we’re very vulnerable.”\nStephen Paulsen and Todd Ackerman contributed to this report\nst.john.smith@chron.com\nsamantha.ketterer@chron.com\nkeri.blakinger@chron.com", "url": "https://apnews.com/7938102ef8634e2ca316fa55880edf86"}