{"authors": ["Patrick O'Donnell", "The Plain Dealer"], "date_download": "2020-05-04 20:14:54", "date_modify": "2020-05-04 20:14:54", "date_publish": "2018-01-09 19:15:53", "description": "University School Headmaster Richard Bryan overlooked \"red flags\" of inappropriate teacher-student relationships at old school, report says HUNTING VALLEY, Ohio - University School...", "filename": "_5607ae59ef1d456282aa98b22f8e4170_1588623294.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5607ae59ef1d456282aa98b22f8e4170_1588623294.html", "title": "University School Headmaster Richard Bryan overlooked \"red flags\" of inappropriate teacher-student relationships at old school, report says", "title_page": "University School Headmaster Richard Bryan overlooked \"red flags\" of inappropriate teacher-student relationships at old school, report says", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "University School Headmaster Richard Bryan overlooked “red flags” of inappropriate teacher-student relationships at old school, report says\nHUNTING VALLEY, Ohio - University School Headmaster Richard Bryan downplayed and failed to investigate “red flags” pointing to inappropriate and sexual teacher-student relationships at his old school, an investigation just released by that school shows.\nThe report commissioned by the private Nichols School in Buffalo lays out details of how four teachers had inappropriate relationships with students - some sexual, some emotional - since the 1980s. It also lists lesser details of inappropriate behavior by six other teachers.\nBryan, who came to the all-boys University School a year ago, was either headmaster or head of the upper school at Nichols from 1982 to 2013, when many occurred. He told investigators multiple times and continues to insist that he was never fully told of the relationships, which were early in his tenure, and would have acted if he had known.\nAsked for comment on the report Tuesday, Bryan told The Plain Dealer, “I disagree with the conclusion of the report. I believe very strongly that I didn’t know about this and, had I known about it, I would have acted.”\nHe said that he was not the focus of the investigation, was not accused of any inappropriate behavior himself, and that he led the school to create a new policy covering student-teacher interactions. And he noted that the report found no evidence of inappropriate relationships at Nichols from the early 2000s on.\nThe 85-page report by the Washington, D.C., law firm Crowell and Moring paints a picture of Nichols as a close-knit school where rumors of the relationships were “common knowledge” and where concerns of teachers being too close to students were brought to Bryan’s attention.\nInvestigators found no hard evidence that Bryan was told how far some of the relationships went - noting that most reports were of suspicions and rumors, not of any direct knowledge of teachers crossing boundaries. But the report holds Bryan and his staff responsible for not investigating warning signs.\nBryan, in particular, tops a list in the report titled: “Those who knew and failed to act appropriately.”\nThe report and responses from Bryan and University school are below:\n“They did not...try to determine whether the suspicions or rumors were true and, if so, take steps to address the situation,” the report states. “The question is all the more salient here because, as we now know, some of the rumors turned out to be true.”\nIn the most extreme case, 17-year-old student Elizabeth Russ Mohr had a multi-year sexual relationship with science teacher Arthur Budington in the 1990s, according to the report. Encounters took place in Budington’s office at school and at his rural home.\nBudington has admitted that relationship, which Mohr detailed late last week to The Buffalo News. The investigation started last summer when Mohr wrote to the school about her experience.\nIn another case, the report found that a longtime hockey coach, now deceased, provided alcohol and pornography to male students and had sex with at least one.\nSo many warnings were raised about Budington that investigators concluded that it is “difficult to understand” how Bryan and another key administrator failed to investigate. Those included in the report:\nWidespread rumors of Budington having a sexual relationship with another student - a relationship Budington confirmed to investigators. Multiple teachers reporting Budington making inappropriate comments about female students and having photos on his office wall of mostly-female former and current students that made many uncomfortable. A phone call and office visit from a student reporting how Budington and Mohr’s relationship was affecting Mohr’s sister - a call and meeting Bryan does not recall. He told investigators the student “would march into [his] office with issues; [she] had one crusade after another.“A teacher telling him of rumors of Budington having sex with students.\n“The teacher reported that this conversation with Bryan left him/her feeling as though s/he and (the reporting student) were ‘the problem’ rather than Budington, and that s/he needed to hush up the rumors rather than investigate or tell others,” the report states.\nBryan denies having that conversation.\nIn a written response to the report, Bryan said he first became aware of the relationship with Mohr and Budington when Nichols started its investigation last year.\n“My first reaction after I heard about the incident was to appreciate the courage this student demonstrated in coming forward,” he wrote. “I expressed that I had no knowledge of any inappropriate sexual relationship between any teacher and student during my time at Nichols, and would have acted on a report of such conduct.”\nHe made no mention in his written statement of the report’s repeated findings that he should have investigated.\nBryan and the report also say he pushed Budington out around 2004-05 when he received reports of him having “sexualized” interaction with a fourth student.\nChris Smythe, chairman of the University School trustees, backed Bryan in a letter to alumni and parents this weekend.\n“One of the troubling aspects of the news stories emerging out of this report involves the suggestion that Nichols School leaders at the time disregarded allegations brought by the students,” Smythe wrote. “This is an unfortunate characterization because school leaders didn’t recall any allegations.”\nBoth also said that University School has policies in place to prevent similar incidents from happening at the school and that they would report any inappropriate contact between students and teachers to police.\nSome former students involved in the incidents say they are angry both at the how Nichols School responded when they occurred and at Bryan’s response now. The former students have reached out to The Plain Dealer, blasting University School and Bryan for offering a “misleading” look at the report’s findings by ignoring its conclusion that Bryan knew enough to investigate.\nThey also questioned whether University School parents should trust him to protect their children.\nNichols graduate Abigail Henrich, now pastor of a progressive church in Massachusetts, told The Plain Dealer that she was the unnamed student in the report who warned Bryan about Mohr and Budington.\nHenrich said she gave Bryan more than enough reason to investigate and that his denial of knowledge is “flatly false.”\n“I did not use the word sex,” she said in an e-mail. “I was too young to understand that that could even be possible between a 17-year-old and a 48- year-old. But in my conversations with Rick Bryan, I made it clear that it was an inappropriate relationship and that Liza spent weekends at Art Budingtons home.”\nMohr, now an assistant finance professor at the University at Buffalo, said she reported what happened in the hope that Nichols and other schools would look closely at how they monitor relationships between students and teachers and respond when they cross boundaries.\nShe said she believes Bryan knew and is angry that he did not act. She is also upset that he takes no responsibility for teacher behavior under his watch, even now.\n“I can’t believe that the most powerful people are acting like they were just innocent bystanders when kids were being hurt,” she told The Plain Dealer.\nHere is Bryan’s statement, University School’s letter and the report from Nichols School:", "url": "https://apnews.com/5607ae59ef1d456282aa98b22f8e4170"}