{"authors": ["Saul A. Flores", "News West"], "date_download": "2020-05-04 20:18:01", "date_modify": "2020-05-04 20:18:01", "date_publish": "2018-12-02 06:12:00", "description": "NEEDLES — The Needles Unified School District went into a district-wide lockdown on Friday. “Around noon, a suspicious individual was behind the high school and was seen by district staff,”...", "filename": "_ab602fca35734a33bfa65171707c0991_1588623481.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ab602fca35734a33bfa65171707c0991_1588623481.html", "title": "Suspicious person triggers lockdown of Needles schools", "title_page": "Suspicious person triggers lockdown of Needles schools", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEEDLES — The Needles Unified School District went into a district-wide lockdown on Friday.\n“Around noon, a suspicious individual was behind the high school and was seen by district staff,” said Amy Avila, Needles High and Middle School principal. “The district was placed into a lockdown pending notification by the sheriff’s that all was clear.”\nA statement from the San Bernardino County Sheriff’s Department’s Colorado River Station said that “the suspect was located by deputies walking towards Eagle Pass Road from the area of the high school carrying what appeared to be a rifle. The suspect was taken into custody and the rife was found to be several pieces of pipe and other miscellaneous items taped together. Through the course of the investigation, the suspect was found to be in possession of suspected methamphetamine and additionally had three misdemeanor warrants for drug charges with a total bail amount of $70,000.”\nThe suspect was booked into the Colorado River Station Jail on suspicion of possession of methamphetamine and three drug-related warrants.\n“When the sheriff’s department gave me the all clear then we lifted the lockdown for all school campuses,” said Avila.", "url": "https://apnews.com/ab602fca35734a33bfa65171707c0991"}