{"authors": ["Julia Bergman"], "date_download": "2020-05-04 20:05:18", "date_modify": "2020-05-04 20:05:18", "date_publish": "2018-04-06 05:00:01", "description": "New London — A new report looking at enrollment data, retention rates and disciplinary action at the Coast Guard Academy found that black cadets are more likely than their peers to face...", "filename": "_2f2895c32bab41c9811560299610610a_1588622718.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2f2895c32bab41c9811560299610610a_1588622718.html", "title": "Equity report: Black Coast Guard cadets more likely than peers to face inequalities", "title_page": "Equity report: Black Coast Guard cadets more likely than peers to face inequalities", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "New London — A new report looking at enrollment data, retention rates and disciplinary action at the Coast Guard Academy found that black cadets are more likely than their peers to face inequalities.\nThe report by the Center for Urban Education at the University of Southern California follows a yearlong process of examining academy data, disaggregated by race, ethnicity and gender, with a focus on equity. The academy is the first federal service academy to undergo the process, known as the Equity Scorecard.\n“This project is part of the Academy’s long-term commitment to examine educational outcomes and formulate improvement strategies,” Rear. Adm. James Rendon, academy superintendent, said in a prepared statement. “We will review the data in the report, along with that from other assessments, identify root causes, examine our policies and practices, and take action to improve them. In the years ahead, we will continue our broad effort to use data to assess and improve our programs.”\nRendon was not available for an interview on the report because the academy is holding its Eclipse Week, an annual event that dates backs to the 1970s that focuses on diversity, inclusion and mentorship. This year’s theme is “Embracing a Community of Respect.”\nThe timing of the report’s release on March 30, so close to the start of Eclipse Week, was coincidental but the academy did want to get it out before the event began, officials said.\nThe data covers the past three to five academic years. While other higher education institutions have gone through this process, it had to be tailored for the “specialized needs” of the academy. The report doesn’t explain why inequalities exist, and instead aims to be a “starting point for diagnosing and assessing disparities in cadet outcomes.”\nThe report found gaps in graduation, class pass and retention rates, and that black cadets, in particular, received disciplinary action more often than white cadets. It also found that several minority groups and women are underrepresented in the student body compared to the number of 17- to 24-year-olds in the general population who are eligible for military service.\nIn a memo attached to the report, Rendon says that the data “correlates with trends observed throughout higher education related to disparate outcomes experienced by different groups of students.”\n“Determining causation is a much more complex challenge, requiring that we not make unfounded assumptions or jump to conclusions that, at best, do not address the true causes or worse perpetuate harmful stereotypes and hinder progress toward improvement,” he continued.\nDiscipline and cadet achievement\nThe report found that African-American cadets faced disciplinary action more than any other group. They were consistently more likely to be assigned Class I offenses, considered the most severe violations of cadet regulations, and Class II offenses, which cover more minor infractions. Asian cadets also were consistently more likely to be assigned Class II offenses.\nCadets, staff and faculty members all have the ability to charge cadets with an offense. Class I offenses are investigated by either the assistant commandant of cadets or commandant of cadets, and Class II offenses are adjudicated by company officers or company chiefs.\nAcademics\nDuring their first year at the academy, cadets are required to take five core courses: Calculus 1, Physics 1, Chemistry 1, Fundamentals of Navigation and Macroeconomic Principles. African-American cadets had lower pass rates for all of the courses except Physics. Asian and Latino cadets had lower pass rates in Calculus 1 and Chemistry 1.\nNo African-American cadets received honors in any of the courses, and they, along with Asian, Latino and multi-racial cadets, were less likely to receive Gold Stars, which are assigned to cadets who have a GPA of 3.15 or higher and received no grades of D or F while taking at least five academic courses.\nGraduation, resignation and disenrollment rates\nGraduation rates for African-American cadets have been lower in the last three years than the overall average.\nFor the Class of 2017, the graduation rate for African-American cadets was 75 percent, compared to the class average of 79.9 percent. That year, the rate for Asian cadets was 57.1 percent and 68.2 percent for multi-racial cadets.\nFemale cadets also had lower-than-average graduation rates in the two most recent of the last three graduating classes. For the Class of 2017, the rate for females was 77.1 percent. The graduation rate for female cadets in the Class of 2016 was 68.5 percent, compared to the overall graduation rate of 73.3 percent.\nThe Class of 2018, however will have the highest number of African-American graduates, and the highest number of female graduates in the school’s history, according to academy officials. And the corps of cadets has the highest minority population and highest African-American population ever in a four-year history of the academy.\nAccording to the report, African-American cadets had the highest rate of disenrollment in the classes of 2015-17, at 43.2 percent. That’s in comparison to the rate for white cadets of 11.3 percent. The rate for Asian cadets is 23.1 percent, and the rate for American Indian/Alaska Native cadets is 22.2 percent. Asian and African-American cadets also were more likely to resign than their peers.\nThe report recommends that the academy establish an equity task force, or task its existing Inclusive Excellence Council, to build on the findings and oversee efforts to close equity gaps. Other recommendations include improving data collection, including disaggregated data and creating an academic and social environment that supports African-American cadets.\nj.bergman@theday.com", "url": "https://apnews.com/2f2895c32bab41c9811560299610610a"}