{"authors": ["Jeanne Jakle"], "date_download": "2020-05-04 20:10:21", "date_modify": "2020-05-04 20:10:21", "date_publish": "2018-05-21 15:43:23", "description": "KSAT-TV has named a new 10 p.m. weathercaster to replace veteran Steve Browne who, after 26 years at the station, retires from the job early next month. Following Browne’s last day, June 6,...", "filename": "_cde12e68d0a645b2a2c29d82df6fcc8a_1588623021.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cde12e68d0a645b2a2c29d82df6fcc8a_1588623021.html", "title": "KSAT-TV names Steve Browne’s 10 p.m. successor", "title_page": "KSAT-TV names Steve Browne’s 10 p.m. successor", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "KSAT-TV has named a new 10 p.m. weathercaster to replace veteran Steve Browne who, after 26 years at the station, retires from the job early next month.\nFollowing Browne’s last day, June 6, Adam Caskey, who currently delivers the 5 and 6 p.m. KSAT weather, will add the signature 10 p.m. hour to his duties, KSAT announced.\n“I’m extremely excited,” Caskey, 37, said in a phone chat today. “It’s hard to follow a guy like Steve Browne. I’ve learned a lot from him, and he’s been very helpful to me — so I think that will make for a smooth transition.”\nSimilar to his predecessor, the station’s new chief meteorologist also has a few tricks up his sleeve to help people smile during the weather.\nRELATED: KSAT anchor’s gift to wife mocked on HBO show\nWhile Browne entertained with his nationally recognized “human tuba” routine at Christmas, along with his vegetable garden and critter cam, Adam Caskey channels his inner nerd.\nThe Minnesota native has become famous across the country for his many kitschy handmade thermometers geared to every occasion.\n“They’re 100 percent handmade — from blowing the glass to filling it with alcohol to sealing it, calibrating it and making a scale to doing the woodworking for the final mount,” Caskey said in an earlier interview.\nHe also possesses an infectious grin and is super-friendly with anyone who crosses his path. During fFesta, Caskey brings out his other not-so-secret weapon — the confetti canon — which, during parades and other events, he uses to spray the crowd with the festive stuff.\nSan Antonio, after all, loves TV forecasters with that extra “something” — the colorful asides that bring levity or human interest to newscasts.\nRELATED: Judson alum makes historic TV leap to NBC show’s finale\nFor instance, when San Antonio experienced a fluke snowfall in December, Caskey and fellow KSATers displayed photos of snowmen dressed in all kinds of crazy getups.\nOne reason Browne, after all these years, has remained beloved to viewers is he not only knows the weather, but is adept at keeping people smiling.\n“He makes television. He understands what it’s all about,” his longtime station colleague, sportscaster Greg Simmon, said in a recent online interview that was conducted by anchor Steve Spriester.\n“I just have a weird mind,” Browne joked.\nCaskey, who’s married with three kids, ages 3, 7 and 9, promises to bring new fun to the late news hour when circumstances call for it.\n“Things keep coming up,” Caskey said. “And you have fun with them, you take advantage of the situation.”\nOn a more serious note, Casky also brings plenty of meteorological knowledge and experience to the chief weather position.\nAfter completing a degree in meteorology at the University of North Dakota, he landed a job as weekend weatherman at KVRR in that state’s freezing Fargo.\nIn 2003, he made the big jump to Washington, D.C., and ABC affiliate WJLA-TV.\nBefore coming to San Antonio and KSAT in 2014, he held various on-air jobs there for 11 years, including forecasting the weather as the morning and noon meteorologist.\nKSAT’s news director Bernice Kearney-Bonner teased some exciting new weather developments involving Caskey and fellow station forecasters.\n“Adam and the team plan to take our weather forecasting to a new level,” Kearney-Bonner said in the statement annoucning Caskey’s promotion. “We’re currently working on several new tools that will greatly enhance the way our meteorologists forecast and tell the weather story. Some of the new tools will be rolled out in the weeks ahead, and we can’t wait for viewers to see the sophisticated technology that’s being introduced.”\nAs for whether Caskey will keep alive any of Browne’s trademark extras, he said: “I do really enjoy gardening. I’d love to keep his vegetable garden growing and thriving and healthy.”.\nJeanne Jakle’s column appears Thursdays and Sundays in mySA. Read more of her columns here. | jjakle@express-news.net | @JakleJ", "url": "https://apnews.com/cde12e68d0a645b2a2c29d82df6fcc8a"}