{"authors": ["Brett Hein"], "date_download": "2020-05-04 20:08:01", "date_modify": "2020-05-04 20:08:01", "date_publish": "2018-04-25 02:40:32", "description": "Weber State softball notched its fourth consecutive win by defeating Utah Valley 4-3 in a non-conference matchup Tuesday at Wildcat Softball Field. WSU (24-19, 11-4 Big Sky) moved to 3-0...", "filename": "_66dacce2037141988fe3812ec8d98235_1588622881.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_66dacce2037141988fe3812ec8d98235_1588622881.html", "title": "Weber State softball uses 2 home runs to defeat Utah Valley", "title_page": "Weber State softball uses 2 home runs to defeat Utah Valley", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Weber State softball notched its fourth consecutive win by defeating Utah Valley 4-3 in a non-conference matchup Tuesday at Wildcat Softball Field.\nWSU (24-19, 11-4 Big Sky) moved to 3-0 against the Wolverines this season, having defeated them twice in early March at the Red Desert Classic in St. George.\nThird baseman Ali Belloc hit a two-run home run to left field to give the Wildcats a 2-1 lead after the first inning.\nUtah Valley scored one run in each of the first three innings to claim a 3-2 advantage.\nThat remained until Ashlyn Visser doubled in the fifth inning and, with two outs, Courtney Petska smashed a homer of her own to put WSU up 4-3.\n> WSU softball sweeps Idaho State to keep hold on 1st place\n“Our team battled back throughout the game,” head coach Mary Kay Amicone said. “We had a little adversity and I think we responded excellent with things that were out of our control. I think we had some key plays on defense. Sydney White had a great day on defense and Kate Donaldson pitched a great game.”\nDonaldson pitched the final five innings, holding UVU scoreless and allowing three runs. She induced three consecutive grounders to end the game in the seventh.\nPetska’s homer comes after being named the Big Sky player of the week for last week’s three-game sweep of Idaho State. In those games, she hit 4 for 7 with four RBIs and three runs scored, helping WSU to become the first team to clinch a spot in the Big Sky Tournament.\nThe Wildcats resume conference play Friday with a doubleheader at Portland State, followed by the series finale Saturday.", "url": "https://apnews.com/66dacce2037141988fe3812ec8d98235"}