{"authors": ["Editorial Board"], "date_download": "2020-05-04 20:11:58", "date_modify": "2020-05-04 20:11:58", "date_publish": "2018-02-22 15:57:26", "description": "It may not live on as long as Do you believe in miracles? Yes!, but Here comes Diggins! so far stands out as the top broadcast call of the 2018 Winter Olympics. Young athletes in Minnesota will...", "filename": "_6876fad6d0dc4ce7bff248c467edf07d_1588623118.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6876fad6d0dc4ce7bff248c467edf07d_1588623118.html", "title": "Minnesota athletes deliver on Olympic stage", "title_page": "Minnesota athletes deliver on Olympic stage", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It may not live on as long as Do you believe in miracles? Yes!, but Here comes Diggins! so far stands out as the top broadcast call of the 2018 Winter Olympics. Young athletes in Minnesota will not soon forget that final lap play-by-play or the gold medal determination of Aftons Jessie Diggins.\nThere are more important stories in the news these days, but Minnesotans should take time to celebrate her historic achievements and those of other Pyeongchang stars who call this state home.\nDiggins and teammate Kikkan Randall not only became the first American women to win medals in cross-country skiing early Wednesday, but they also edged Sweden to win gold.\nDiggins was one of several Minnesotans leading the way for Team USA. As Star Tribune sports columnist Chip Scoggins wrote from South Korea, Take that, Norway. You might be running laps around everyone else in the medal count, but you cant have all the Olympic fun. Minnesota stole some of your spotlight on Wednesday.\nThe Gopher State run started with Lindsey Vonn. In what she says will be her last Olympics after a career that began on Buck Hill in Burnsville, Vonn became the oldest woman to win an Olympic Alpine medal by capturing bronze in the downhill. In curling, the Minnesota-led U.S. team shocked Canada to advance to the gold-medal round.\nThen, early Thursday Twin Cities time, a womens hockey team with seven native Minnesotans on its roster beat rival Canada in a shootout, thanks in large part to goalie Maddie Rooney, a 20-year-old Olympics rookie from Andover.\nThroughout the Games, the Minnesotans have represented their home state with remarkable poise, class and sportsmanship. Diggins, in particular, is known for putting team goals above her own. Its the belief this team has in each other that gave us this opportunity, she told the Star Tribunes Rachel Blount in a post-race interview. This isnt our medal. Its Team USAs medal.\nAnd maybe Minnesotas medal, too.\nEditors note: This editorial is excerpted from the daily Star Tribune Opinion e-mail newsletter. To sign up for the newsletter, which highlights the best in opinion, go to tinyurl.com/StribOpinion.", "url": "https://apnews.com/6876fad6d0dc4ce7bff248c467edf07d"}