{"authors": ["Kelly Hinchcliffe", "Wral Education Reporter"], "date_download": "2020-05-04 20:07:51", "date_modify": "2020-05-04 20:07:51", "date_publish": "2018-09-05 09:00:00", "description": "What will the future of work in North Carolina look like, and what careers will be in demand? To help answer those questions, WRAL News asked local college and university leaders to share what...", "filename": "_ccd67b9279370c73bbb8d5e76d408cd1_1588622871.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ccd67b9279370c73bbb8d5e76d408cd1_1588622871.html", "title": "NC colleges share majors, careers that are most in demand", "title_page": "'Connecting the Bots': NC colleges share majors, careers that are most in demand", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "What will the future of work in North Carolina look like, and what careers will be in demand? To help answer those questions, WRAL News asked local college and university leaders to share what majors are most popular and what programs they have added or hope to add to keep up with the changing workforce. Their answers have been edited for length and clarity.\nDuke University As technology transforms our world, engineers continue to be in high demand, according to Ravi Bellamkonda, dean of Duke University’s Pratt School of Engineering.\nMeredith College Some of our largest undergraduate majors include biology, business, psychology, communication and interior design. Many Meredith undergraduate students also choose to earn teacher licensure, according to Melyssa Allen, news director for Meredith College.\nNorth Carolina Central University The most in demand majors that North Carolina Central University students at the undergraduate level pursue reside in our School of Business and College of Behavioral and Social Sciences. They include business administration, criminal justice, family and consumer science, nursing and psychology, according to Quiana Shepard, NCCU’s director of marketing and communications.\nSaint Augustine’s University Based on the size of the program and/or the relative growth, our most in demand majors are sport management, criminal justice, business administration, exercise science and public health science, according to Yvonne Umphrey, professor and provost at Saint Augustine’s.\nUNC-Chapel Hill The top 10 most popular majors at UNC-Chapel Hill, according to 2017 data from the Office of Institutional Research and Assessment, are:\nWilliam Peace University The school’s top six majors are: business, simulation & game design, criminal justice, psychology, biology, and communication. Some of its fastest-growing new majors are business analytics and exercise and sport science, according to Meagan Kittle Autry, assistant dean of academic affairs.\nDuke University We recently introduced a signature undergraduate experience that includes a trio of courses to develop students’ comfort with engineering design, data and decision sciences, and computational tools, according to Bellamkonda. By having them work in teams on real-world, open-ended problems, we hope to develop the creative confidence they will need to solve complex challenges facing society.\nData competency is becoming increasingly important as the information age advances, and we have introduced new programs at the graduate as well as the undergraduate level to meet those needs, including very popular data analytics tracks within our engineering management and health, computing and environmental engineering master’s programs. We’re also a partner in the Information Initiative at Duke’s nationally recognized Data+ program, which brings undergrad and graduate students from across the university together with faculty and clients to explore data-driven approaches to topics ranging from construction machinery marketing to gerrymandering to vaccination rates.\nWe also want to equip our students with an entrepreneurial mindset. We recently launched a dedicated Entrepreneurship @ Duke Engineering program led by successful entrepreneurs to help students across engineering understand how to turn their ideas into impactful solutions, whether that’s an innovative product or a new company. We now offer a Founder’s Workshop course for undergraduates interested in starting companies, as well as a dedicated entrepreneurship study track in our Master of Engineering Management program.\nMeredith College Meredith regularly adds new programs to meet changing demand, according to Allen. One of our most recent additions this Fall is a master’s degree in industrial and organizational psychology. The I/O Psychology field is projected to have a 19-percent growth rate over the next 10 years, with a median salary of $82,000. We’ve also recently added new programs in entrepreneurship and family business to meet the growing interest in entrepreneurship.\nWe’ve also made it easier and faster for students to earn a second bachelor’s degree, because we’re seeing more interest among adult women for changing careers and doing something completely different from what they did with their first bachelor’s degree.\nNorth Carolina Central University NCCU’s School of Business has recently added a senior living community management degree to its curriculum to prepare students for careers in retirement homes and other communities serving the growing aging population, according to Shepard. The new degree offered through the Department of Hospitality and Tourism Administration began in fall 2018 and focuses on management skills for Continuing Care Retirement Communities, a type of residential facility that combines independent living, assisted living and skilled nursing care. With 59 CCRCs located in North Carolina of the approximate 2,000 now operating in the U.S., the industry reports a shortage of qualified managers and administrators.\nNCCU has also formed additional partnerships with surrounding community colleges such as Durham Technical Community College and Vance-Granville Community College in the areas of criminal justice, education, nursing and pharmaceutical sciences.\nAdditionally, in May 2017, NCCU graduated the first Ph.D. degrees at the university in more than 50 years. The graduates, Elena Arthur, Rasheena Edmondson and Helen Oladapo, were the first cohort of students to enter the Integrated Biosciences program when it was created in 2012. The program has two tracks, Integrated Biosciences and Pharmaceutical Sciences.\nSaint Augustine’s University Exercise science, health and physical education (teaching) and public health science are three of the school’s newest majors, according to Umphrey. The programs address health disparities of the African-American community, as well as health concerns related to an American population that is growing increasingly heavier and older.\nUNC-Chapel Hill UNC’s College of Arts & Sciences is home to approximately 90 percent of all Carolina undergraduates and nearly a quarter of its graduate and professional students. Its Shuford Program for Entrepreneurship allows students from any discipline to minor in entrepreneurship.\nAn $18 million gift from the Shuford family last year will allow us to more than double the size of the program to meet student demand, according to Geneva Collins, director of communications for UNC’s College of Arts & Sciences. As noted on the program’s website, “The program was founded on the understanding that there is a common process for the realization of new ventures, whether those ventures are startups, nonprofits, artistic endeavors or even growth within existing enterprises.”\nAlso popular is our fast-growing minor in philosophy, politics and economics, a program of integrated study which we believe prepares students for a wide variety of careers in both the private and public sectors, as well as further graduate study.\nOur longstanding environmental and ecology studies curriculum has been given a new name and structure to emphasize the interdisciplinary nature of this broad field. As of July 1, it has become the Environment, Ecology and Energy Program, nicknamed E³P. Student interest in environmental science at both the undergraduate and graduate levels has more than doubled in the past decade. In the past, environmental science majors might have wound up at a natural resources department, but today’s students are pursuing diverse paths.\nOur English department is encouraging students to make English their second major because the communications skills learned are valuable for any career path.\nOur new neuroscience major is being offered through the department of psychology and neuroscience. There is great demand for a neuroscience major, and the university wants to better position Carolina to prepare students for future careers in brain science and brain health.\nWilliam Peace University At WPU, we have recently added majors designed specifically to address the future careers our graduates will have, according to Kittle Autry. For example, we launched business analytics a couple of years ago, and are the only Triangle-area institution offering it as a major. As we live in an increasingly data-rich society, there is a pressing need for companies to employ people who understand how to effectively use data in a business setting. Our program is designed to address this gap. Similarly, our simulation and game design major prepares students for careers in an industry whose sales have tripled in the last couple of decades, but does not limit them to only working for game companies – they could also work for hospitals designing virtual reality simulations to help train doctors and nurses.\nDuke University We’re planning to expand our online-based master of engineering management program to help meet the demand from working engineers who want to develop business acumen, according to Bellamkonda.\nMeredith College In 2018-19, Meredith is adding a hospitality management program, according to Allen. The hospitality field is a half-trillion dollar industry, and recent labor statistics show that jobs in this field – especially in the management part of the field – increasingly require a bachelor’s degree. There’s also a need for more women in upper management in the hospitality industry, and Meredith’s hospitality management program will prepare women to fill those roles.\nNorth Carolina Central University NCCU is working toward offering new degree options in higher administration, biomedical science, translational sociology, sports medicine and clinical trial research, according to Shepard.\nSaint Augustine’s University There are plans to create concentrations in entrepreneurship, international business, marketing/strategic communications, finance, data analytics, supply chain management, and art therapy to name a few, according to Umphrey. We are also looking to add an online organizational management program for non-traditional learners.\nWilliam Peace University We are launching our first major in the area of health care, an RN (registered nurse) to BSN (bachelor of science in nursing) program, this January, with the intent to add future majors in health care informatics and health administration shortly after, according to Kittle Autry. We know that healthcare occupations are projected to grow much faster than the average for all occupations (Bureau of Labor Statistics), and these majors serve Triangle-area needs for BSN-prepared nurses and educated professionals who can use data effectively in health care settings or manage health care facilities.\nMeredith College Existing majors and degree programs play an equally important role in preparing graduates for jobs of the future, according to Allen. While new jobs and careers are always emerging, the skills employers look for, such as communication and critical thinking, have remained consistent over time. In fact, careers with these kinds of 21st century skills have doubled since 1985 because so many employers prefer hiring people who can move from job to job, rather than those who come to work with a singular skill set.\nOver 96 percent of Meredith seniors report receiving career guidance from faculty and advisors, and 95 percent of Meredith students participate in an applied learning experience such as an internship, study abroad or undergraduate research.\nNorth Carolina Central University We continue to assess our degree offerings to ensure that our students are prepared to excel in the global job market, according to Shepard.\nSaint Augustine’s University Our computer information systems major, touted as a future growth area, is growing, according to Umphrey. Saint Augustine’s University recognizes the importance of the developing “soft skills” in students, so our General Education Program is designed to develop and enhance students’ oral and written communication skills, problem solving and critical thinking skills, and quantitative literacy.\nThe University continues to offer co-curricular experiences and opportunities for students to develop leadership skills whether through registered student organizations, honor societies, fraternities and sororities, or through work with community partners.\nWilliam Peace University It is important to emphasize that being prepared for tomorrow’s workplace is not just about the major that students choose, according to Kittle Autry. At WPU, our general education curriculum is designed to produce citizens who can think critically and creatively, communicative effectively, behave ethically, work with global people and cultures, and adapt to changing situations. We also require every student complete an internship, which provides students with crucial work experience and helps WPU grads have a 98 percent placement rate post-graduation. Overall, it is a liberal arts education, combined with a major, which produces the well-rounded employees that companies are looking for.", "url": "https://apnews.com/ccd67b9279370c73bbb8d5e76d408cd1"}