{"authors": ["Alicia Eler"], "date_download": "2020-05-04 20:14:44", "date_modify": "2020-05-04 20:14:44", "date_publish": "2018-10-26 09:08:17", "description": "He lit up Atlanta with the torch he designed for the 1996 Olympics, but famed artist Siah Armajani has lived quietly in the Twin Cities for nearly 60 years. While he’s taken on a higher profile...", "filename": "_5a37e4d41cfc47d09690c80b35c97363_1588623284.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5a37e4d41cfc47d09690c80b35c97363_1588623284.html", "title": "Five public places to discover the work of famed Minnesota artist Siah Armajani", "title_page": "Five public places to discover the work of famed Minnesota artist Siah Armajani", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "He lit up Atlanta with the torch he designed for the 1996 Olympics, but famed artist Siah Armajani has lived quietly in the Twin Cities for nearly 60 years. While he’s taken on a higher profile with a Walker Art Center career retrospective that’s headed to New York after it closes Dec. 30, Armajani has made his presence felt since the 1980s with public artworks and architectural pieces. Chances are you’ve seen his blue-and-yellow Irene Hixon Whitney Bridge, connecting the Minneapolis Sculpture Garden and Loring Park. But here are five other pieces to check out while the fall colors are still in bloom.\nSky Bridge No. 1\nDowntown Minneapolis is the place to begin searching for Armajani. Opened in 1988 — the same year as the Whitney bridge — this maroon-colored skyway crosses Marquette Avenue between Wells Fargo Center and Six Quebec.\nIn the middle is something you might easily miss while darting from building to building on a lunch break: yellow stained-glass squares surrounded by shades of blue and pink, and topped by a pyramid-shaped roof.\n“Siah had this desire to bring the light in in certain ways,” said Victoria Sung, co-curator of the Walker retrospective. “There’s a golden light when it hits at certain angles, flooding the space with warmth.”\nThis skyway was a collaboration with famous Argentina-born architect César Pelli, who designed Wells Fargo Center. Armajani collaborated with him on several pieces, including the Waterfront Plaza at New York’s Battery Park.\nWhen asked why he chose colored glass, Armajani said: “I thought, ‘Why not?’ There was no other reason except César liked it.” (Marquette Av. between 6th and 7th Sts.)\nSky Bridge No. 2\nThis 1989 skyway over the Nicollet Mall, connecting City Center and Gaviidae Common (another Pelli project), blends in more with the buildings around it.\n“It was trying to reflect the building, to be more contextual,” explained Armajani, who has also built skyways in Leipzig, Germany, and Iowa City, but says he got the idea right here in the Twin Cities.\nSilver steel that matches the lighting on Nicollet crisscrosses the floor-to-ceiling window panes, creating diamond-like shapes. (Nicollet Mall between 6th and 7th Sts.)\nHumphrey Garden\nIn 1987, Armajani had the opportunity to build a contemplative space at the University of Minnesota’s Humphrey School of Public Affairs.\nThe garden is a square, symmetrical on either side. Around it is a short brick wall and green benches that display quotations from school namesake Hubert H. Humphrey, the former vice president and senator from Minnesota. “Only a strong society dares to question its purpose,” one reads.\nAs you walk into the garden, two doors open to a two-step platform. The plantings are simple: just trees and grass. “You can see the various influences on Siah’s public works, in terms of Russian constructivist furniture — these functional, utilitarian designs that marry form and function,” the Walker’s Sung said. (301 19th Av. S., Mpls.)\nLoring Park gazebo\n“All of my work since Day One has been political,” comments Armajani on 1993’s “Gazebo for Four Anarchists: Mary Nardini, Irma Sanchini, William James Sidis, Carlo Valdinoci,” named for political activists who were caught up in the Red Scare following World War I.\nAn open structure with tightly spaced green-painted bars, it’s reminiscent of a prison cell — a metaphor for locking away political prisoners.\nThis is the first of 12 Armajani gazebos around the world, all of them green and white with black roofs. Digging into themes of leftist political activism, Armajani’s gazebos welcome visitors to sit, but once inside, the sense of hospitality shifts.\nFour plaques, on each side of the gazebo, contain text from T.S. Eliot’s “Four Quartets” poem: meditations on home, life and death.\nThese gazebos focus on the idea that many immigrants, outsiders and workers were dealt a terrible hand by the government. (Near 15th St. and Hennepin Av. S., Mpls.)\nWayzata pocket park\nPhilanthropists Judy and Lucy Dayton commissioned the artist to turn a vacant lot across the street from Wayzata’s post office into a cozy park where people could sit and read their mail.\nThis park echoes the gazebo structures and garden/park design of other Armajani works. Two green and white benches greet the visitor, who then walks through a green-painted gazebo with steel bars similar to the one in Loring Park. A little wooden walkway guides visitors to more benches.\nLetters placed around the perimeter spell out a Wallace Stevens poem, “Anecdote of the Jar.” Two green jars are perched on white tables.\nThe space has been altered since it was opened in 1996. A wall at the back was removed, and the space became an extended field.\nThat wall, and the way it originally confined the space, inspired Armajani to use the green jars to create a sense of perspective, much like a medieval painting. He made the second jar smaller, which “gave depth to the garden,” he explained. (Near 229 Minnetonka Av. S., Wayzata)\n612-673-4438 • Twitter: @AliciaEler", "url": "https://apnews.com/5a37e4d41cfc47d09690c80b35c97363"}