{"authors": ["Chuck Yarborough", "The Plain Dealer"], "date_download": "2020-05-04 20:25:20", "date_modify": "2020-05-04 20:25:20", "date_publish": "2018-01-15 19:35:48", "description": "2018 Tri-C High School Rock Off: Meet the bands CLEVELAND, Ohio – Here are the 51 bands and solo acts who will be competing in the 22nd annual Tri-C High School Rock Off, which begins...", "filename": "_8c6b697dd00c44fdb6772056d2fbc44f_1588623920.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8c6b697dd00c44fdb6772056d2fbc44f_1588623920.html", "title": "2018 Tri-C High School Rock Off: Meet the bands", "title_page": "2018 Tri-C High School Rock Off: Meet the bands", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "2018 Tri-C High School Rock Off: Meet the bands\nCLEVELAND, Ohio – Here are the 51 bands and solo acts who will be competing in the 22nd annual Tri-C High School Rock Off, which begins Saturday, Jan. 20, at the Rock & Roll Hall of Fame and ends with the Final Exam there on Saturday, Feb. 17.\nAll the bands were asked to submit information and a photo for use with this post. Only 19 bands sent in photos.\n8 Days Late\nMusic: Jazz.\nMembers: Zeke Brake, 15, guitar, sophomore; Grady Wessollek, 16, drums, junior; Breanna Johnson, 17, trombone, senior; Kate Brand, 16, keyboards, junior; Brooke Noscal, 17, bass, senior; Robbie Eckart, 17, sax, senior; McKenna Monnolly, 16, trumpet, junior.\nSchool: Jefferson Area High School.\nInfluences: Frank Zappa, Snarky Puppy, Tower of Power, Chicago, Maynard Ferguson.\nBest song: Our best song is probably “Zappanaut” because the amount of creativity displayed in the song really makes us proud to perform it for people.\nWebsite: https://www.facebook.com/8DaysLatetheband/\nWhy you can win: Our band is special because we have all been great friends for a while and it’s one thing to make music with people but it’s a whole other thing when you get to make music with your best friends.\nThe 89th Key\nMusic: Classic rock, alternative rock.\nMembers: Brian Griffin, 17, drums, vocals; junior; Cameron Hall, 17, keys, senior; Elijah Hoene, 17, guitar, vocals, junior; Mason Ridge, 18, bass, senior.\nSchools: Holton, Brighton, East Lansing, Williamston high schools, Michigan.\nYears in Rock Off: 0.\nInfluences: Stevie Ray Vaughan, Grateful Dead, Rolling Stones, Red Hot Chili Peppers, Black Keys.\nBest song: Our original song “Back to Me″ ... is unlike our others as it has a different genre and sound. It maintains our original, catchy groove while showcasing the different talented people we have in the band and our dynamic as a group.\nWebsite: www.the89thkey.com\nYoutube: https://www.youtube.com/user/89thkeyband\nWhy you can win: We all have a connection that spans beyond music, and it our brotherlike band dynamic that creates such high energy music and performance. It’s not just the fact that music is our passion, but we have a good time with each other on and offstage, and we think that’s transparent in our musicianship and performance.\nA&T\nMusic: Singer-songwriter, indie.\nMembers: Ava Preston, 13, vocals, Class of 2023; Tristan Ford, 17, piano, senior.\nSchools: Hudson Middle School, Cuyahoga Valley Christian Academy.\nYears in Rock Off: 0.\nInfluences: Norah Jones, Stevie Wonder, Sara Bareilles, Ella Fitzgerald, John Mayer, Stevie Nicks, Jamaraquoi.\nBest song: “Ashes,″ because it has a dark undertone with a deeper representation of reflective hope.\nWebsite: www.avaprestonmusic.com\nYoutube: Ava Preston Music.\nWhy you can win: We have played together for two years and have developed a great chemistry. Our mutual love of jazz makes us unique. Our sound combines old and new, drawing crowds from each generation. Our music is infused with jazz, pop and indie rock. A&T is hard to categorize and easy to please all kinds of music lovers. People know us as the little girl who sings and the talented young man on keys.\nAntic!\nMusic: Alternative, groovy, rock, indie.\nMembers: Ameliarose Allen, 15, piano, vocals, sophomore; Michael Aaron, 16, guitar, sophomore, John Haring, 15, drums, sophomore; Zoe Stene, 16, bass, ukulele, junior; Sam Hyman, 16, guitar, junior.\nSchool: Poughkeepsie Day School (New York).\nYears in Rock Off: 0.\nInfluences: Nothing But Thieves, Radiohead, Maroon 5, Renaissance, Jet.\nBest song: I think our best song is either “Honey″ or “Comet.″ They both have such good grooves and vibes that just make you want to dance in the verse, and rock out in the choruses.\nWebsite: www.facebook.com/weareanticmusic/\nSoundcloud: www.soundcloud.com/weareantic\nWhy you can win: Our band is special because we write songs that matter; songs that people can connect and relate with, yet are deep and meaningful. Having a unique quality as artists is really important to us; to not be one of those cookie cutter LA machine singers or musicians. We, as a band, are very true to ourselves and our roots, and our songs speak to that. We are all really close friends even though we have different interests outside the band. A few of us have known each other since we were in elementary school. We gig a few times a month and work really hard to juggle school, sports and our music. It is tough but we somehow manage it all!\n...\nWe believe we can win the Tri-C High School Rock Off because our songs are catchy and people really seem to like what we do. We are genuine when we perform and love doing it. We are excited to come to Cleveland hope that everyone will enjoy our set. There are no ordinary moments.\nAntimatter\nMusic: Rock, hard rock, classic rock.\nMembers: Ryan Saghy, 13, lead vocals, guitar; Alex Bitzan, 13, guitar; Ty Kruszka, 13, guitar, keyboards; Cooper Eberly, 13, bass, vocals; Rusty Edwards, 13, drums, vocals.\nSchool: Avon Middle School.\nYears in Rock Off: 0.\nInfluences: ’80s and ’90s and hard rock musicians.\nBest song: “Don’t Stop Believing,″ Journey [because it] showcases our wide range of musical talents.\nWhy you can win: We are a group of 13-year-old boys very passionate about learning and playing music together.\nThe Blue Aces\nMusic: Indie rock.\nMembers: Lilly Dunn, 14, guitar, freshman; Alex Manson, 13, drums, seventh grade; Casey Deventhal, 17, bass, guitar, senior; Brendan Burdick, 13, bass, guitar, backing vocals, eighth grade; Rachel Jacob, 14, keyboard, freshman.\nSchools: Brecksville-Broadview Heights, North Royalton, Strongsville high schools.\nYears in Rock Off: 0.\nBest song: “Second Chances,″ because it’s a really positive song and we were able to collaborate on it in a really fun way.\nWhy you can win: We are really passionate about music and really enjoy what we’re doing.\nBorderline Obvious\nMusic: Alternative rock.\nMembers: Casey Delventhal, 17, lead vocals, guitar, senior; Britta Hammitt, bass, senior; Griffin Kenedy,17, drums, senior; Josh Serna, 17, lead guitar, senior.\nSchools: Strongsville, Padua.\nYears in Rock Off: 3.\nInfluences: Red Hot Chili Peppers, Kansas, Led Zeppelin, Panic! At the Disco, Guns N’ Roses.\nBest song: Our best song is our original called “Tic-Tac-Toe,″ because it is the song that best shows our personality as a band.\nWebsite: https://www.instagram.com/borderlineoblivious/\nWhy you can win: We’re special because we have a female fronted band, including the lead singer and bassist, as well as the occasional double bass featuring our two female members. Another reason why our band is unique is that we play a wide variety of genres. This can range from classic rock to alternative, blues, or acoustic. What gives us the best chance of winning are the characteristics above, as well as our classic covers and our originals that grab your attention.\nBucyrus High School Xband\nMusic: Rock, funk, ska, punk.\nMembers: Marcus Neumann, vocals, trumpet, senior; Austin Edington, vocals, trumpet, senior; Arli Hinkle, vocals, trumpet, junior; Taylor Trumbull, vocals, trumpet, freshman; Graham Ditmars, trombone, bass, senior; Tyler Rittenhour, vocals, trombone, junior; Jaden Deskins, trombone, guitar, junior; Nathan Carnes, trombone, sophomore; Morgan Young, trombone, freshman; Samantha Murtiff, sax, bass, senior; Alexis, Schifer, sax, junior; Andrew Mee, vocals, sax, junior; Allison Somers, vocals, sax, sophomore; Alanya Smith, vocals, sax, freshman; Beau Smith, vocals, sax, freshman; Austin Johns, drums, guitar, senior; Darien Jones, vocals, drums, sophomore; Daniel Smith, drums, senior.\nSchool: Bucyrus High School.\nYears in Rock Off: 2 (made Final Exam in 2017).\nInfluences: J. Geils Band, Stevie Wonder, Less Than Jake, Reel Big Fish, Elton John, Kool & the Gang.\nBest song: “Ghostbusters″ is fun to play and audience involvement is typically unreal!\nWebsite: www.bucyrusband.com/page/xband.html\nSoundcloud: www.soundcloud.com/bucyrusband\nWhy you can win: We have a large horn section. When we prepare to perform, we are working for the player beside us, hoping and expecting to bring out the best in them, in ourselves and in our audience.\nLia K. Catallo\nMusic: Acoustic pop.\nMember: Lia K.Catallo, 15, guitar, vocals.\nSchool: Parkway Christian.\nYears in Rock Off: 0.\nInfluences: Ed Sheeran, Stephanie Getangier, Hillsong, Taylor Swift.\nBest song: “Searching.” It’s a song I wrote from my heart and it’s catchy.\nWebsite: www.reverbnation.com/LiaKCatallo\nWhy you can win: I’m in music because I love it and want to make an impact. If I’m meant to win, I get to continue impacting others. I feel if it’s meant to be, it will be.\nCousin Simple\nNo information provided\nJordan Dean\nMusic: Acoustic pop.\nMember: Jordan Dean, 18, acoustic guitar, senior.\nSchool: St. Ignatius.\nYears in Rock Off: 0.\nInfluences: Ed Sheeran, Jack Johnson, Otis Redding.\nBest song: “Cold Hearted.” I have fun playing it and I enjoyed writing it.\nWebsite: www.instagram.com/jordandeansongs/\nWhy you can win: My songwriting and attention to detail.\nDecember\nMusic: Metal.\nMembers: Colin Ferguson, 17, guitar, programmed backing tracks, vocals live, junior; Clay Finck, 17, guitar, vocals, junior.\nSchool: New Lexington High School.\nYears in Rock Off: 0.\nInfluences: Bullet for My Valentine, Avenged Sevenfold, In Flames, Dorje, Alice in Chains, Black Veil Brides, Tool, Avatar, Falling in Reverse, Escape the Fate, Pierce the Veil, Sleeping with Sirens.\nBest song: Our self-titled track “December,″ because we really love the feel, and every new song is our favorite. We just wrote it and love it.\nWebsite: www.decembermetalband.wixsite.com/decembermetalband\nYoutube: www.youtube.com/channel/UCTH4PFuMKPbWfFz4EF9_Fnw\nWhy you can win: We are a two-member band that has backing tracks. This is a very unique and difficult thing to have and pull off live. We feel it brings a new, special element to our band.\nDistracted\nMusic: Alternative\nMembers: Jenna Seeman, 17, vocals, keys, junior; Emily Kmiecik, 17, guitar, senior; Alexis Walker,16, drums, sophomore; Jordan Petzold, 16, bass, sophomore.\nSchools: Normandy, Padua, North Ridgeville high schools.\nBest song: Our original titled “Declamation″ is our personal favorite and best song. It fully demonstrates all of our individual skills in a way that ties into one collective piece, not to mention it’s super catchy.\nWebsite: www.facebook.com/distractedbandcle\nSoundcloud: www.soundcloud.com/distractedband\nWhy you can win: The thing that makes us stand out is we are an all-girls original band. We’re not afraid to put in the time and dedication to make sure we sound and perform to the best of our abilities.\nDistrict Bliss\nMusic: Alternative rock.\nMembers: Wyatt Kunevidius, 18, guitar, lead vocals, senior; Philip Jaworski, 17, drums, senior; Ryan Michota, 17, bass, senior.\nSchool: Independence High.\nYears in the Rock Off: First year for Ryan, second for Phil and third for Wyatt.\nInfluences: Lil Peep, Brand New, Mo Lowda, Bring Me the Horizon, Jack White, Highly Suspect.\nBest song: “Addicted,″ an original. We really like the energy that we bring when it comes to playing this song. We always feel like we’re going full-throttle when we’re playing it.\nWhy you can win: We’re a three-piece band that’s about to sound like a symphony.\nDrift\nMusic: Soul / blues.\nMembers: Julie Blechschmid, 16, drums, junior; Jackie Ward, 16, vocals, junior; Greg Kondas, 17, keys, junior; Paul Kolbus, 17, guitar, senior; Mark Ray, 18, bass, senior; Katrina Jurczyk, 16, vocals, violin, flute, junior; Wyatt Kunivicius, 18, guitar, vocals, senior.\nSchools: North Royalton, Walsh, St. Ignatius, Independence high schools.\nYears in Rock Off: 3.\nBest song: “I’ll Be Good to You″ is our best song. It’s catchy and has great lyrics. The song shows off each member individually because of the level of technique that it demands.\nWhy you can win: We differ from the other talented musicians in this competition because of our unique sound and the chemistry we have with each other. We have a chance to win because of our drive. Drift has a passion for music that is really evident to everyone watching us.\nDying Desolation\nMusic: Alternative metal.\nMembers: Gavin Kerr, 18, vocals, bass, senior; Gabe Gazic, 15, guitar, freshman; Jordan Gannon, 15, drums, freshman.\nSchool: Berea Midpark High School.\nYears in Rock Off: 0.\nInfluences: Linkin Park, Slipknot Breaking Benjamin.\nBest song: Our best song at the moment is “Succubus,″ because the lyrics hold meaning for each of us, and the song itself is very heavy and energetic and never fails to get the crowd bouncing.\nWebsite: www.facebook.com/DyingDesolation\nYoutube: www.youtube.com/channel/UCBRfVbF1yFRJRn1c28pqJ8A\nWhy you can win: It’s very rare to see a band with only three members do so much onstage at once, especially at this young of an age. Great crowd interaction and a wide variety of sounds all come together to really bring our performances to life.\nFiller\nMusic: Alternative rock.\nMembers: Joe Greenfield, 17, bass, senior; Cameron Morris, 17, vocals, junior; Auden Stevenson, 17, drums, junior; Will Ridzon, 17, guitar, senior.\nSchools: Rocky River, Bay Village high schools.\nYears in Rock Off: 0.\nInfluences: Soundgarden, Santana, Jimi Hendrix, Pearl Jam.\nBest song: “Sunset.″ It was the first song we completed fully and paved the way for us to develop our sound. We all brought something to the table, creating a piece of music that truly shows off what each of us are capable of , as well as setting the stage for growth in both songwriting and playing.\nYoutube: youtube.com/channel/UC5wcCCjloqett6cEI73kK4g/featured\nWhy you can win: We are very close as friends, not just as band members. We hold each other accountable and take the time to fine-tune our sound to our liking. We are genuinely having trouble putting our music into a specific genre, and we are taking that as a challenge to specify and develop our sound. We are determined to get our music out there and find our voice in the current musical atmosphere. On the way, of course, finding out exactly where we fit into said atmosphere.\nFloor Dweller\nMembers: Lilith Horschke, 16, guitar, vocals, junior; Miles Games, 16, sophomore, bass; Riana Elhallak, 17, drums, senior.\nSchools: Lakewood, Westlake high schools and Lakewood City Academy.\nYears in Rock Off: 0.\nInfluences: The Garden, Fidlar, the Velvet Underground, the Cure.\nBest song: Our best song would have to be “Bubble.″ This is because it demonstrates our sound and the lyrics capture some of our ethics and worldly sentiments. The song is also catchy, making you want to dance and jump around.\nWebsite: www.facebook.com/floordweller/\nSoundcloud: www.soundcloud.com/floor_dweller\nWhy you can win: We are constantly writing new material and improving our sound. I think we have a chance to win because we are always working hard on producing the best versions of our music and we are determined to become better musicians. We have found a way to combine our individual tastes and styles into making music that we all enjoy and love to play.\nForced Happiness\nNo information provided\nFuneral Proposals\nMusic: Rock ‘n’ roll, surf rock.\nMembers: Holden Shumate, 17, guitar, senior; Samuel Gucciardo, 18, drums, senior; Ryan Hanlon, 18, guitar, senior; Cameron Adkins, 17, bass, junior.\nSchools: Ellet, Copley, Mogodore.\nYears in Rock Off: 4.\nInfluences: My Chemical Romance, Arctic Monkeys, Wavves, Ty Segall.\nBest song: “No Words for You,″ just because of the personal meaning and energy within the song. Everyone has a different favorite song, but every new song we write possesses a new energy.\nWebsite: www.funeralproposalsband.com/\nSoundcloud: www.soundcloud.com/funeralproposals\nWhy you can win: This is our last year eligible for the Rock Off. Last year, we gained confidence by advancing to the Finals. We will work endlessly on our set, and give everything to our performance. This is our last shot at winning and we don’t plan on doing anything less.\nFunkBox\nMusic: Jazz-influenced indie electronica.\nMembers: Evan Schonauer, 16, guitar, vocals, junior; John Polace, 17, keyboards, vocals, senior; Gina Eterovich, 16, drums, junior; Anthony Liotta, 17, bass, senior.\nSchools: Nordonia, Twinsburg high schools.\nYears in Rock Off: 0.\nInfluences: We have a wide variety of influencers, with everything from the Beatles to Thelonious Monk to Prince. More modern influences include Thundercat, Gorillaz, Streetlight Manifesto, Matt Frazier, Homeshake and Mild High Club.\nBest song: Our best song is “Never Gonna Work″ because it is an original song and is just a straight jam . . it BOPS every time!\nWebsite: www. instagram.com/funkbox.band/\nWhy you can win: We all have our unique sounds and our distinctive personalities come through in our playing styles. We believe in and strive for authenticity in ourselves and our music. All of the band members have some unique stories on how they are driven to be a truly great jam band.\nGood How Are You?\nMusic: Rock.\nMembers: Tommy Wild, 17, guitar, vocals, senior; Nick Robbins, 16, guitar, junior; Jack Oebker, 18, bass, senior; Chris Carmon, 16, drums, junior; Tim Rivera, 18, guitar, senior.\nSchools: St. Ignatius, Avon, St. Edward.\nYears in Rock Off: This is Tommy Wild’s third year but the first for everyone else.\nInfluences: Ramones, Green Day.\nBest song: I would say our best song is our cover of “My Own Worst Enemy″ because we have a lot of fun with it and it closes out our set with a bang.\nSoundcloud: www.soundcloud.com/user-186819530\nWhy you can win: I think that we will win because we like having a lot of fun when we play, which is shown while we are onstage. We have one original song we are playing and also two covers. Even though we are doing a few covers, we put our own twist on them to make them unique. Hopefully, this originality will help us win.\nIndigo Storm\nMusic: Alternative, progressive rock.\nMembers: CJ Jones, 16, guitar, vocals, sophomore; Ryan Slayton, 17, drums, senior; David DeWolfe Jr., 17, bass, backing vocals, senior.\nSchools: Scott County, Henry Clay high schools. (Kentucky).\nInfluences: Tool, Alice in Chains, Queens of the Stone Age.\nBest song: All three bandmates have different favorites – but for the same reasons. Ryan likes “Leech,″ David likes “Grow″ and CJ likes “Deep” best. However, the answer to why is the same for each: Because the songs are technically complicated and several different parts come together to make a cool and unique song.\nWebsite: www.indigostormband.com\nYoutube: www.youtube.com/indigostormband\nWhy you can win: Indigo Storm is not your cookie cutter rock band. We are three guys that bring together individual talents to perform technically difficult music – and we like the challenge. Each of us gives the entirety of our efforts – practicing/preparing/working hard - to “bring it” every show. We have a particular passion for what we do because music is a common priority in our lives. It is important that we make honest music. What you hear is all Indigo Storm.\nJack’s Mom\nMusic: Alternative rock.\nMembers: Sam Gilman, 17, guitar, junior; Matt Yost, 17, bass, junior; Ben Semple, 17, guitar, senior; Bailey Rieger, 17, vocals, senior; Charlie Root, 18, drums, senior.\nYears in Rock Off. 4.\nBest song: Our best song is “Cochise″ by Audioslave because it is a really cool song to throw down to.\nWebsite: www.facebook.com/JacksMomBand/\nYoutube: www.youtube.com/channel/UCewxE2yNfh620Zq7KEf5m5g\nWhy you can win: We aren’t like all those cover bands who do the same pop songs and try to please everyone.\nKnock Knock\nMusic: Pop/rock.\nMembers: Faith Wisniewski, 14, guitar, freshman; Brie Farrrell, 13, bass, vocals, eighth grade; Rachel sanders, guitar, vocals, eighth grade; Anthony Cuzzola, 13, drums, eighth grade; Nathan Mascia, 13, keys, eighth grade.\nSchools: Villa High School, Walnut Creek Middle School, Westlake Middle School,St. George Middle School (Pennsylvania).\nYears in Rock Off: 1.\nInfluences: First to Eleven, Hey Violet, 21 Pilots.\nBest song: “After You,” because it showcases all of our talents and it is one of our favorite songs to play.\nWebsite: www.facebook.com/knockknockerie\nWhy you can win: We have a great relationship with each other and we’re all friends. Even the we are unable to win because we aren’t old enough, we appreciate being able to gain exposure and experience in how we perform.\nLake Effect\nMusic: Rock.\nMembers: Evan Manfred, 11, guitar, bass, vocals, fifth grade; Cole Wallace, 10, guitar, bass, fifth grade; David Stalder, 12, guitar, bass, sixth grade, Will Curran, 9, drums, fourth grade.\nSchool: The Rock Academy at Ron Zehel Guitar Center.\nYears in Rock Off: 0.\nInfluences: Green Day, White Stripes.\nBest song: “Seven Nation Army″ really gets the crowd going.\nWhy you can win: The band is too young to be eligible. We really appreciate the Tri-C High School Rock Off for the opportunity to perform on the “big stage″ and gain experience for future Rock Offs.\nLittle G Fresh\nMusic: Rap, hip-hop.\nMember: Georgiana Hasrouni, 14, freshman.\nSchool: Brunswick High School.\nYears in Rock Off: 0.\nInfluences: Eminem.\nBest song: My best song is a song I wrote. It is called “Chance.″ This is my best song because it is truthful, honest and about my life. In the song, I talk about how I wish to have an opportunity in the music industry. I talk about how much I love to rap. I also talk about the many details that happen in my life like my friends and family. The song expresses me strongly. I rap about how I can prove that I am the best but I just need a chance so I can show you my talent.\nWebsite: www.facebook.com/LittleGFresh/?ref=br_rs\nYoutube: www.youtube.com/c/LittleGFresh\nWhy you can win: My act is special because I do everything on my own. I produce myself, I write my own lyrics, and I make my own songs. I am a solo artist. I record and edit my own music videos too. I believe that I have a chance to win because my act is different and unique. I am a young female rapper and I believe that I am very talented.\nMange\nNo information provided\nMontage the Band\nMusic: Rock, with a little bit of everything.\nMembers: Jasmine Sims, 16, bass, vocals, junior; Gabe McGoughy, 17, lead guitar, vocals, senior; Kevin Pace Jr., 17, drums, junior.\nSchools: Cleveland School of Arts, Maple Heights High School.\nYears in Rock Off: 2.\nInfluences: Jimi Hendrix, Buddy Guy, Rush, Snarky Puppy, Led Zeppelin.\nBest song: “Mother Earth″ by Government Mule because it incorporates some of the band’s best sounds and musical conversations.\nYoutube: www.youtube.com/watch?v=6Va2777adqM\nWhy you can win: Because we don’t just play music, but we give people the good feelings and emotions that come with music and we make people really remember what god music sounds like.\nThe Move\nMusic: Alternative, blues, rock, jazz.\nMembers: Leo Zigmond, 17, vocals, keys, senior; Jose Hernandez, 16, guitar, junior; Ben Safos, 18, bass, senior; Michael Petrus, 18, drums, senior.\nSchool: Avon Lake High School.\nYears in Rock Off: 3, including Final Exam appearances with Treble Breathing and the Frats.\nInfluences: Red Hot Chili Peppers, Jimi Hendrix, Black Keys.\nBest song: “What About Me?” It’s an original written by us which we’ll be performing live for our first time. We’re getting real excited for it.\nWhy you can win: We all have very musical minds and great chemistry. Not only that, but we all come from unique musical backgrounds. Our lead singer Leo has been trained more classically as a vocalist and pianist, focusing mainly on choral pieces, as he intends to be a choir teacher in the future. Our guitarist Jose has focused on jazz, as he is the standup bassist for our school jazz band. His jazz influence has helped us tremendously in finding chord progressions for our music, and Leo’s classical background has helped us fine-tune every measure to make sure everything fits in. Ben and Mike, our bassist and drummer, have been to the Finals twice before in two different bands. They know what to expect from the Rock Off. They’ve been very helpful in ensuring our music is new and original. We all love to write and play music, which makes this our ideal setting.\nNational Trail Steel Band\nNo information provided\nNew Horizon\nMusic: Pop rock.\nMembers: Jessica Siracusa, 17, lead vocals, keys, songwriter, junior; Katrina Jurczyk, 17, violin, keys, backing vocals, junior; Maria Marsh, 17, viola, senior; Julie Blechschmid, 17, percussion, senior; Angie Teele, 17, bass, senior.\nSchools: Walsh Jesuit, North Royalton, Brecksville-Broadview Heights.\nYears in Rock Off: 2.\nInfluences: Fall Out Boy, Imagine Dragons, All Time Low.\nBest song: “Iridescent″ by Linkin Park. Great message in the lyrics and how the music comes together.\nWebsite: www.facebook.com/jessica.siracusa.188\nSoundcloud: www.soundcloud.com/holden-szalek/issues\nWhy you win: All-girl band and we use non-traditional instruments, including a violin and viola with unique originals.\nPlus One\nMusic: Rock.\nMembers: Josh Hadden, 18, guitar, senior; Elijah Hadden, 16, guitar, vocals, junior; Noah Hadden, 12, drums, Class of 2023; Nathan Webster, 17, bass, senior.\nSchools: Perry and Harvey high schools, Perry Middle School.\nYears in Rock Off: 2.\nInfluences: Beatles.\nBest song: “A Certain Romance″ because of the multiple difficult parts playing simultaneously.\nSoundcloud: www.soundcloud.com/joshkh\nWhy you can win: We do our own interpretation of songs, not necessarily coves, but our own take on the music.\nPomade\nMusic: Alternative, indie surf rock.\nMembers: Clay Winterstellar, 18, lead guitar, lead vocals, senior; Brandon Thompson, 18, bass, keyboards, backing vocals, senior; Austin Evans, 18, drums, senior.\nSchool: Riverside High School.\nYears in Rock Off: 0.\nInfluences: Twin Peaks, Mac Demarco, the Strokes, Oasis, Coldplay, the Beatles, Black Keys.\nBest song: “Surprise″ or “Wandering Around.″ Both of those are “bangers,″ and we jam to these songs on (and off) the stage.\nWebsite: www.facebook.com/pomadeband\nSoundcloud: www.soundcloud.com/pomadeband\nWhy you can win: We’ve got a unique sound to bring to the table that stems from ’60s garage rock to modern-day alternative rock.\nQueen Bees\nMusic: Pop, rock.\nMember: Jeana Daney, 14, guitar, eighth grade; Clare Fox, 14, guitar, vocals, eighth grade; Ava Gabriel, 12, bass, sixth grade; Izzy Gabriel, 9, drums, fourth grade; Anna Carone, 13, guitar, vocals, seventh grade.\nSchools: The Rock Academy at Ron Zehel Guitar Center, Avon Lake.\nInfluences: Taylor Swift, Grace Vanderwaal.\nBest song: “Roar.″ Great pop tune!\nWhy you can win: Too young to be eligible, but excited to play at the Rock Hall!\nRadithor\nMusic: Alternative hard rock.\nMembers: Colton Emerling, 13, vocals, Class of 2022; Skyler Weaver, 14, bass, freshman; Aeddon Cartwright, 14, lead guitar, freshman; Aeden Alder, 14, rhythm guitar, freshman; Charlie Grel, 14, keyboards, Class of freshman; Zoe Guevara, 15, drums, Class of 2022.\nSchool: Lake High School.\nYears in Rock Off: 0.\nInfluences: Red Hot Chili Peppers, Zakk Wylde, Nirvana, Billy Joel, System of a Down.\nBest song: A 50-50 split between” Blame It On Me″ and “Adventure Awaits″ was decided amongst the band. “Blame It On Me″ was liked due to the song having more contrast, being longer, it’s more epic, it’s a hype/pump-up song, more disciplined and just feels good to play. “Adventure Awaits″ was liked since the parts seem to fit together, the song shows the band’s great diversity and it expresses the band amazingly.\nWebsite: www.facebook.com/radithor4/\nSoundcloud: www.soundcloud.com/user-770169952\nWhy you can win: Our band has a chance to win because our band has a diverse cast, from metal to funk to classical. We also pave our own path. We’re the only band in our town, so we don’t put anything on autopilot. It takes confidence and good teamwork to be the leader, and that’s exactly what we have.\nThe Rapid Jags\nMusic: Alternative rock, garage rock, blues rock, indie rock.\nMembers: Jack Lutz, 14, lead guitar, co-lead vocals, freshman; Logan Gallant, bass, co-lead vocals, Class of 2022; Aidan Schaffer, 15, drums, freshman.\nYears in Rock Off: 0.\nInfluences: Green Day, My Chemical Romance, Fall Out Boy, Panic! At the Disco, Arctic Monkeys, Linkin Park, Red Hot Chili Peppers, the Black Keys, White Stripes, Jimi Hendrix Experience, Stevie Ray Vaughan, John Mayer, Gary Clark Jr., Eric Clapton.\nBest song: Our best song is definitely “Indie Rock Anthem″ because it is a perfect sing-along tune that really gets people dancing and banging heads. The songs calls back to ’60s garage rock sound . . . but with a new pop-style chorus . . . to make a perfect early 2000s indie rock-style song.\nWebsite: www.facebook.com/TheRapidJags/\nYoutube: https://www.youtube.com/channel/UCL6cXRZ2fH4oS0xJD9dDQiQ\nWhy you can win: Our band is special because we are so young, but we are super serious about our music and practice as much as possible. It would mean a lot for us to win this competition while representing Heath City Schools. We are a band that really loves the school music programs and we would want to do as much as possible for them. Winning this competition would show them how much we care for our school’s music department. Our school district is very small. It would be awesome to win the money for the school because our school has a really tight budget when it comes to the music programs. It would help them tremendously and the money would go a long way to fund things like sheet music, instruments, the musical and getting more kids involved. We believe we have a chance to win because we have a sound that you don’t hear much in today’s music. Our sound is really a throwback to the 60s and 70s, but with a modern pop twist. The Rapid Jags also love to stretch songs into long bluesy jams. Individually we have put in endless hours of private lessons and practice. We work on our music individually and then practice as a group. We are dedicated to working hard to make music that others will love.\nRosegun Vibe\nMusic: Metal.\nMembers: Sabrina Double, 16, bass, vocals, sophomore; Cameron Cummings, 15, guitar, sophomore; Reagan Rand, 14, guitar, eighth grade; Sam Gilman, 17, drums, junior.\nSchools: Fort LeBoeuf, McDowell, Harborcreek, Academy (Pennsylvania).\nYears in Rock Off: 4.\nInfluences: ghost, B.C., Halsey.\nBest song: “Square Hammer.″ A lot of people like the way we play it.\nWebsite: www.instagram.com/rosegunvibe/\nWhy you can win: We are younger than a lot of other bands and we still play good.\nSettle Down\nMusic: Alternative.\nMembers: Charley Bates, 17, drums, junior; Samm Grass, 17, keys, junior; Hale Tobin, 17, bass, junior; Daniel Connors, 17, guitar, junior.\nSchool: Shaker Heights High School.\nYears in Rock Off: 0.\nInfluences: Prince, Kevin Parker, Connan Mockasin, Mac Demarco, Steve Lacy.\nBest song: “Break Stuff,″ by Limp Bizkit. It’s a song for just one of those days.\nWebsite: www.facebook.com/SettleDownBand\nSoundcloud: www.soundcloud.com/user-10808001-926548036\nWhy you can win: We’ve been friends long before we started playing music together, and as a result, we hold a strong chemistry that is evident when we perform, making our music sound better as a whole.\nSkippy’s On the Run\nMusic: Pop, alternative rock.\nMembers: Austin Strauss, 15, bass, freshman; Emily Pappas, 15, guitar, freshman; David Stalder, 12, lead guitar, Class of 2024; Nick Szekely, 12, lead vocals, drums, Class of 2024.\nSchools: Avon High School, Bay Middle School.\nYears in Rock Off: 0.\nInfluences: Brad Gendics (lesson teacher).\nBest song: “Brain Stew″ by Green Day, because it sounds tight and clean.\nWebsite: www.instagram.com/skippys4/\nWhy you can win: Half of the band is in middle school and are young and talented. We only have four people in our band, and because we put time in to sound the best.\nJulia Sommer\nMusic: Acoustic rock.\nMember: Julia Sommer.\nSchool: Lehigh Valley Charter High School (Pennsylvania).\nInfluences: KT Tunstall, Led Zeppelin, Heart, and my father, Werner Sommer, who is also a musician.\nBest song: One of my originals titled “Sundial.″ I think it’s one of my best songs because it showcases my vocal power.\nWebsite: www.juliasommer.rocks\nYouTube: www.youtube.com/user/juliasommerofficial\nWhy you can win: I am ready to show the world that women can rock and I want to lead the way to inspire people and rock the mainstream. It’s important to me to be able to connect to people through my music. It’s also very important to me to inspire young people to help them gain the confidence to also follow their passion for music!\nSorry for Interrupting\nMusic: Indie rock.\nMembers: Sam Rosselot, 16, drums, junior; Jake Haire, 18, guitar, vocals, senior.\nSchool: Brecksville-Broadview Heights High School.\nYears in Rock Off: 0.\nInfluences: White Stripes, Tony Williams, the xx.\nBest song: “Deep Sea.″ This song is a cacophony of melodic harmonies synced together through the instruments. Its synergy is both energetic, but mellow, minimalistic but ornate.\nWebsite: www.sorryforinterrupting.bandcamp.com/\nSoundcloud: www.soundcloud.com/user-462370089\nWhy you can win: Our drummer is a jazz aficionado who has spent many years developing her skill through acts such as the Cleveland Orchestra Youth Orchestra, Contemporary Youth Orchestra and her high school’s jazz band. The other piece can play guitar and write lyrics and has spent countless hours listening to music and learning about countless bands and what occurs behind the scenes. Together, they provide a synergy unlike any other band, sending a variety of beautiful music into the ears of audiences that are willing to listen.\nSoundproof\nMusic: Proto-punk – basic punk structure with a funky groove.\nMembers: Justin Godoy, 16, drums, junior; Cade Cubbison, 16, guitar, junior; Nick Zarach, 17, bass, junior; Stephanie Gaidos, 15, vocalist, sophomore.\nSchools: Strongsville High School, Padua Franciscan.\nYears in Rock Off: 0.\nInfluences: The Stooges, Nirvana, IDLES, John Bonham and Led Zeppelin, Green Day, Jimi Hendrix.\nBest song: “Locked and Loaded″ is definitely our best song. It’s powerful and showcases our skills without being overpowering. It’s also the first [song] we finished and recorded, which gives it a special place in our hearts.\nWebsite: www.facebook.com/Soundproof-234458367094310/\nSoundcloud: www.soundcloud.com/soundproof-ohio\nWhy you can win: With our interwoven sound, containing some punk, groove and basic rock elements, we maintain our emotion, edge and heart into everything we do despite varying our sound. Every song we write and/or perform is done with passion and a level of integrity. Nothing we do goes without meaning.\nTell Them\nMusic: Indie rock, emo, alternative.\nMembers: Emma Goggin, 16, lead vocals, junior; Sean Dougherty, 17, drums, junior; Danny Mavis, 17, guitar, junior; Nicolette Miller, 18, bass, senior.\nSchools: Bay, Westlake high schools.\nYears in Rock Off: 0.\nBest song: “Remaining Option″ is our best song.\nSoundcloud: www.soundcloud.com/tell-them\nWhy you can win: We bring our influences from every department of the music industry and we bring a tasteful new edge to everything about it. Also, we are here to tell you and plan on doing so.\nThreat Level Midnight\nMusic: Alternative rock.\nMembers: Megan Woodruff, 18, leas vocals, senior; Anna Wallace, 17, viper (electric violin), senior; Bryan Ream, 18, guitar, senior; Alex Mateos, 18, bass, senior; Mark Fullen, 16, drums, junior.\nSchools: Hilliard Darby, Hilliard Bradley, Hilliard Davidson. (A sixth member is a freshman at The Ohio State University and thus is not eligible to participate.)\nYears in Rock Off: 0.\nInfluences: Paramore, Brand New, Jimmy Eat World, Yellowcard.\nBest song: “Numb.″ It highlights all the unique voices and colors that our band can produce. It rocks hard and people really like it.\nWebsite: www.threatlevelmidnight.rocks\nYoutube: www.youtube.com/channel/UCONZ-UwihoSHHOo5_5_Iaxg\nWhy you can win: We have a unique instrumentation which leads to a truly original sound. Our songs are catchy and our live show is high energy. Winning would be awesome, but we are more excited to share our music in the hallowed grounds of the Rock Hall.\nTime Out\nMusic: Punk rock.\nMembers: Bryan Biros, 18, bass, senior; Ryan Gunter, 17, lead guitar, vocals, senior; Connor Stewart, 18, drums, senior.\nSchool: Hilliard Darby High School.\nYears in Rock Off: 2.\nInfluences: My Chemical Romance, Green Day, Misfits, Johnny Cash.\nBest song: “Rigged.″ It’s an original song that took over a year to write, so it’s like an investment. We like it because we stepped out of our comfort zone and mixed different moods within the song.\nWebsite: www.timeoutrock.com\nYoutube: www.youtube.com/watch?v=vAraNaOgoUM&feature=youtu.be\nWhy you can win: We’ve been playing together since seventh grade and keep building our sound and skills and plan to really bring it for this competition.\nTrouble Clef\nMusic: Rock.\nMembers: Adam Nottingham, 18, rhythm guitar, vocals, senior; Rory McClellan, 18, lead guitar, vocals, senior; Sam Schmucker, 17, bass, vocals, junior; Terence Boggs, 17, drums, senior.\nYears in Rock Off: 1.\nInfluences: Classic rock, blues, punk, alternative.\nBest song: “Auto Pilot.″ Fun to play.\nWebsite: www.facebook.com/theband.011/\nYoutube: www.youtube.com/channel/UCHCYd5fXdYdQxLECR8q-l5w\nWhy you can win: We have grown tremendously over the past year with vocal harmonies, crowd interaction and with having fun.\nTwo Fisted Juice Box\nMusic: Rock.\nMembers: Mike Laub, 15, lead guitar, sophomore; Christian Gendics, 12, drums, Class of 2024; Norman Hobbs, 16, bass, vocals, junior.\nYears in Rock Off: 3.\nSchools: Elyria Catholic, Avon, Amherst Junior High.\nInfluences: Ghost, Metallica, Taylor Swift, Blink 182, Iron Maiden, Snoop Dogg.\nBest song: “Waiting,″ because it’s a hard-driving original.\nWhy you can win: We are a hard-driving trio with years of experience, and we write hard-driving melodic rock originals.\nVenatora\nMusic: Alternative metal.\nMember: Kyle Cerlan, 17, guitar, vocals, drum machine.\nSchool: Amherst Marion L. Steele High School.\nYears in Rock Off: 2.\nInfluences: Tool, Chevelle, Alice in Chains, Nirvana, Soundgarden, System of a Down, Days of the New, Silverchair, Helmet.\nBest song: “Going Down,″ because it’s got such a big chorus. For most of the people who have heard my music, they say “Going Down” is their favorite. People seem to remember the chorus, I hear them singing along with it when it plays. It wasn’t really my intention to write a song like that but it’s cool. I just write music because that’s what I love to do, not because I want to be rich or famous, but if other people can get down with it, that’s cool. The reason I dig the song is the subject matter. It’s a song about how people stay in abusive relationships knowing full well that they can’t do it anymore. Often times I hear people saying that they’re going to leave their “significant” other because their s/o is too abusive to them. They’ll rant all night about how they’re so fed up with him/her but the next day you’ll see them together holding hands and smiling like nothing’s wrong. I just watch it and it really bothers me because I know sooner or later that relationship is going to crash and burn, and that’s where the title “Going Down” comes from. I think a lot of people can relate to that.\nWhy you can win: A lot of bands nowadays are either just following trends or trying to emulate something that’s already been done before and they’re not really sticking up for anything. Rock and Roll has always been about rebellion but I find that recently it has lost its edge. What I do is sing about things that I think need to be said. A lot of my topics for songs are things that I think people know are true but don’t want to admit. The rock music that’s coming out is either really heavy metal or really light indie stuff and to me it’s too divisive. I feel that my music is sort of a breath of fresh air because it’s a blend of the two extremes. I like to have big heavy riffs and do screaming vocals as much as I like to do an acoustic piece with a more melodic style crooning. It kind of brings it all together and that’s why I feel that I have a chance at winning because of the wider appeal of the music styles. It’s given with genuine emotion as well, I’m singing about things I truly care about. I’m not doing break-up songs ’cause I know people will definitely buy those, I’m standing up for something I believe in and I think that’s something that people can respect.\nTheo Williams\nMusic: Indie.\nMember: Theo Williams, guitar, vocals, 19, senior.\nSchool: ECOT School of Ohio.\nYears in Rock Off: 1.\nInfluences: John Mayer, Gary Clark Jr., Steve Ray Vaughan, Allen Stone.\nWebsite: www.theowilliamsmusic.com\nWhy you can win: I have opened for many big acts like Jamie Lynn Spears, and have worked with musical talents, including Ron Fairchild, Donny Carr, Duane Allen and many more. I have been performing in a band with my family for 4 years and we have performed over 300 shows in that time. And even though I may not have a full band with me for this show, I know how to have good time and get the crowd excited!\nW.U.V.A.L.\nMusic: Hard rock.\nMembers: Ben Lopez, 15, drums, sophomore; Dante Montoto, 18, bass, senior; Marco Montoto, 15, lead guitar, sophomore; Connor Balderaz, 15, vocals, guitar, sophomore.\nSchools: Upper Arlington High School, the Arts & College Preparatory Academy.\nYears in Rock Off: 2.\nInfluences: Red Hot Chili Peppers, Green Day, Highly Suspect.\nBest song: “Pyromaniac.″ It’s a high-energy rock anthem that won’t get out of your head.\nWebsite: www.wuval.com\nSoundcloud: www.Soundcloud.com/wuval\nWhy you can win: We are a true gigging band. We’ve done more than 50 shows together. Our gigs have ranged from playing the Ohio Stadium in front of a crowd of 6,000 to playing for 20 people at a neighborhood bar. We’ve played on street corners for 5Ks, church dinners, fundraisers, music festivals, street fairs, social justice events and private parties. Whether the audience is 20 people or thousands of people, whether it’s a 20-minute set or a two-hour set, whether it’s a music festival in our back yard or a show on the road, we are out there non-stop playing, playing, playing.", "url": "https://apnews.com/8c6b697dd00c44fdb6772056d2fbc44f"}