{"authors": ["Thomas Schmeltz", "Sentinel-Tribune Sports Editor"], "date_download": "2020-05-04 20:19:55", "date_modify": "2020-05-04 20:19:55", "date_publish": "2018-03-23 12:39:00", "description": "The quarterback room has a different feel for Bowling Green as spring practice finishes its first week on Saturday. There are fewer questions than at this time last year, and for the first...", "filename": "_a5373e7b5e974a23accc338fb613ea50_1588623595.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a5373e7b5e974a23accc338fb613ea50_1588623595.html", "title": "BGSU quarterbacks all but set ahead of 2018 season", "title_page": "BGSU quarterbacks all but set ahead of 2018 season", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The quarterback room has a different feel for Bowling Green as spring practice finishes its first week on Saturday.\nThere are fewer questions than at this time last year, and for the first time since Mike Jinks has come to Bowling Green, a starter is in place.\nIt’s everything but official for Jarret Doege as he returns for his sophomore season. The 6-foot-3 signal caller is all but assured to be leading the Falcons’ offense onto the field at Oregon on Sept. 1.\nPractice plans and scripts have changed for this spring, but Doege’s demeanor has remained the same as he prepares for his first full season as the starter.\n“What makes Jarret unique is his approach,” Jinks said. “I don’t think he’s approached this spring any different as opposed to last spring.\n“He’s a confident kid, but it’s a quiet confidence.\n“He’s a student of the game,” Jinks said. “He does all the little things that you need to be successful and he goes out and follows it up with production on the football field.”\nDoege played in seven games as a true freshman and made six starts, including the last four of the season. He replaced James Morgan in Week 4 at Middle Tennessee State and started the next game against Akron before a back injury sidelined him until Week 11 at Kent State.\nDoege threw for 1,381 yards and 12 touchdowns as a freshman. He completed 63.8 percent of his passes and threw three interceptions. Morgan, who has elected to pursue a graduate transfer to Florida International after the spring semester, completed just 45.3 percent of his passes with nine touchdowns and seven interceptions.\n“Going into this spring I’ve got a good idea of what we got,” Jinks said. “I didn’t really know a lot about Grant (Loy) and I didn’t know a lot about Jarret. And really, I had my questions about (Morgan).\n“I know what we have at our quarterback position. Last year, everything was live. You won’t see a quarterback get touched this spring. I know exactly who Grant is and what he’s good at, and I know exactly who Jarret is and what he’s good at.”\nLoy is all but penciled in as the backup quarterback and true freshman Bryce Veasley will be the No. 3. At 6-4, 239 pounds, Veasley is an early enrollee from West Bloomfield High School in Southview, Michigan. Walk-on Ricardo Marble is the other quarterback on the roster.\nFor Bowling Green’s offense, this spring is about sharpening its skills with the skill position players and implementing two starters on the offensive line, while creating depth at that position.\nWith few questions at quarterback, the rest of the spring will be geared toward preparing pieces around Doege and Loy, while keeping them both sharp.\n“We’re going to take a more systematic approach,” Jinks said. “During team you’ll see a lot more running just because we feel good about (Doege’s) execution in the heat of the moment. Last year I wanted to get (Morgan) and Grant about 75 percent passes during team sessions because I wanted them to feel it and see if they could execute under pressure.”", "url": "https://apnews.com/a5373e7b5e974a23accc338fb613ea50"}