{"authors": ["Express-News Editorial Board"], "date_download": "2020-05-04 20:26:51", "date_modify": "2020-05-04 20:26:51", "date_publish": "2018-02-17 06:00:00", "description": "The Editorial Board recommends incumbent Greg Abbott and Andrew White in the Republican and Democratic gubernatorial primaries. On the Republican side, this is an easy call. Abbott’s...", "filename": "_e066e249beab4a8d974583a4e07b00e5_1588624011.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e066e249beab4a8d974583a4e07b00e5_1588624011.html", "title": "Abbott and White in governor’s races", "title_page": "Abbott and White in governor’s races", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Editorial Board recommends incumbent Greg Abbott and Andrew White in the Republican and Democratic gubernatorial primaries.\nOn the Republican side, this is an easy call. Abbott’s opponents — political unknown Barbara Krueger and Secede Kilgore (whose name says it all) are simply not credible candidates. And even if we’ve disagreed with Abbott — on the need for a bathroom bill, most notably — he has pretty much pursued the conservative agenda on which voters elected him when he defeated Democratic gubernatorial candidate Wendy Davis in 2014.\nOn the Democratic side, 10 candidates are vying for the nomination, but there are really only two contenders in our view — White and former Dallas County Sheriff Lupe Valdez, who spent much of her childhood in San Antonio.\nOf the two, White, a Houston businessman and son of former Gov. Mark White, demonstrates far more knowledge of the complexities of state governance and speaks with more specifics on the topic.\nHe pledges to close loopholes in the state’s equal and uniform tax law that, he says, allows commercial interests to escape paying their fair share of property taxes, burdening residential taxpayers. He recognizes that the true driver of high property taxes are policies that deprive public education of enough direct state funding, forcing local school districts to raise taxes.\nLikely to be his most controversial position to fix school funding is putting expanded gaming on some future ballot to generate more revenue.\nWhite recognizes that the Legislature’s shifting of state troopers to the border has dubious merit and robs the state of funds that might be put to better use elsewhere — on schools, for instance.\nThe candidate is already generating unease among Democrats for his pro-life stance, but he pledges not to make this a big issue and says he would have vetoed Senate Bill 2, a measure that imposed draconian restrictions on the state’s abortion clinics.\nOn many issues, there is little to no daylight between White and Valdez. But, again, he speaks more knowledgeably and evinces a conciliatory demeanor that a Democratic governor will need if faced with a Republican Legislature.", "url": "https://apnews.com/e066e249beab4a8d974583a4e07b00e5"}