{"authors": ["Michael D Onofrio Tribune Staff Writer"], "date_download": "2020-05-04 20:11:06", "date_modify": "2020-05-04 20:11:06", "date_publish": "2018-03-20 04:00:00", "description": "Trash may be worthless, but the effect garbage-littered streets can have on businesses and residents is not. “You don’t think cleaning is a big thing, but it’s huge. It transforms the vibe...", "filename": "_e68bea6ddd994956b84f09f40e7d7309_1588623066.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e68bea6ddd994956b84f09f40e7d7309_1588623066.html", "title": "Federal funding cuts could cost Philly $40M", "title_page": "Federal funding cuts could cost Philly $40M", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Trash may be worthless, but the effect garbage-littered streets can have on businesses and residents is not.\n“You don’t think cleaning is a big thing, but it’s huge. It transforms the vibe that people feel in the community,” Stephanie Michel said as she stood along the bustling business district along N. 5th Street in Olney at West Chew Avenue recently.\nMichel would know. She is the director of the community-based North 5th Street Revitalization Project. Among other programs, the organization hired two local men to tidy and clean the streets of the 1.5-mile business district a few years ago, which has led to brisker business for store owners and an overall safer feeling for residents, she said.\nBut the federal dollars through the Community Development Block Grant program, or CDBG, that pay for North 5th Street Revitalization Project’s street cleaners and programs — along with upwards of $40 million for programs and services elsewhere in the city — is now in jeopardy.\nPresident Donald Trump has called for eliminating the CDBG program in his proposed 2019 budget.\nOn Monday, U.S. Rep. Brendan Boyle (D-13) City Council President Darrell Clarke, and Councilwoman Cherelle Parker stood alongside Michel and other Olney community members at N. 5th Street and West Chew Avenue to denounce any proposals to gut the CDBG program.\nThe block grant program, which is run by the U.S. Department of Housing and Urban Development, allocates approximately $3 billion a year for financial assistance for economically distressed areas that supports housing rehabilitation, public services, infrastructure improvements, and development and planning, among other things.\nWhat’s at stake for Philadelphia is about $38.7 million in CDBG funding.\nParker described the federal funding as an “essential economic tool for cities, especially cash strapped cities like Philadelphia.”\nThis was the second year in a row the Trump Administration proposed completely eliminating funding for the CDBG program.\nFor the 2018 budget, Boyle said lawmakers managed to stave off the cuts to the program. But the Congressman warned that voters will see the effects in their own neighborhoods if the program is scrapped.\n“The devastating cuts that are proposed would have an effect right here,” Boyle said.\nBeth McConnell, the policy director of the nonprofit Philadelphia Association of Community Development Corporations, said the CDBG program provides “absolutely critical funds” that support neighborhood community corridors to strengthen the local economy by attracting investments and residents.\n“You cannot have a strong community if you do not have a strong commercial corridor,” said McConnell, who attended Monday’s press conference.\nMcConnell warned that any funding cuts to the CDBG program will result in the loss of jobs, fewer homes being rehabilitated and repaired, and reductions in the economic strength of neighborhoods.\n“It’s a huge threat,” she said.\nIn Philadelphia, CDBG funding goes toward a variety of programs, including housing counseling, home repair, rental assistance, affordable housing production and preservation, blight remediation, and business development.\nThose programs help prevent upwards of 1,000 foreclosures a year; repair about 1,000 homes; develop approximately 500 affordable homes; provide rental assistance to about 300 people; and stabilize around 500 vacant lots, among other things.\nAnne Fadullon, director of the city’s Department of Planning and Development, said in an email that: “We are extremely concerned about these proposed cuts, as it would zero out programs that house families, create jobs and revitalize neighborhoods.\n“We are hopeful that our partners in the U.S. House and Senate will see fit to turn their backs on such a devastating plan, and continue funding for programs through which thousands of Philadelphians and millions of Americans benefit each and every day,” Fadullon added.\nAs Philadelphia wonders whether it can count on nearly $40 million in CDBG funding next year, cuts to the program are nothing new. In 2009, the city counted on $51.7 million in CDBG funds, which was down from $71.6 million in 2002.\nThe North 5th Street Revitalization Project, which is a member of the Philadelphia Association of Community Development Corporations, received approximately $207,000 this year to pay for not only street cleaners, but community managers to help local businesses with technical issues, as well as storefront improvements such as signage and murals, Michel said.\nIn addition, Michel said CDBG funding has led to eight businesses installing security surveillance cameras — 24 in all — within the past year.\nThe program has fueled morale and pride in the neighborhood over the years, Michel said, but losing the annual funding could cause all of that to slip away.\n“That’s what my fear is: That pride and that ownership that we built up amongst residents and as business owners will no longer be there when they don’t see that action happening on the corridor,” she said. “When they don’t see people cleaning, when they don’t see new signs coming up, I think they’ll start to feel neglected.”", "url": "https://apnews.com/e68bea6ddd994956b84f09f40e7d7309"}