{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:08:04", "date_modify": "2020-05-04 20:08:04", "date_publish": "2018-10-21 21:25:00", "description": "TODAY The Aiken County First Steps Board of Directors annual meeting will be held at 5:30 p.m. Monday, at the Aiken County Government Center, 1930 University Parkway. For more information,...", "filename": "_b2f9da07f697423e8d8eb314938c0a59_1588622884.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b2f9da07f697423e8d8eb314938c0a59_1588622884.html", "title": "Today's events for Oct. 22", "title_page": "Today's events for Oct. 22", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TODAY\nThe Aiken County First Steps Board of Directors annual meeting will be held at 5:30 p.m. Monday, at the Aiken County Government Center, 1930 University Parkway. For more information, call Marcia Nash at 803-644-6501.\nNorth Augusta Forward will hold its 15th annual North Augusta Classic Golf Tournament at 11 a.m. Monday, at The River Club Golf Course, 307 Riverside Blvd., North Augusta. For more information or to register, email admin@northaugustaforward.org.\nThe Edgefield County Comprehensive Plan Steering Committee will hold a public input meeting from 6:30 to 8 p.m. Monday, in the Johnston Town Hall, 500 Mims Ave., Johnston. For more information, call Kevin Singletary, Edgefield County planner, at 803-637-2101 or email ksingletary@edgefieldcountysc.gov.\nThe South Carolina Bluebird Society will meet at 7 p.m. Monday, in meeting room 3 of the H. Odell Weeks Activities Center, 1700 Whiskey Road. Dr. Christopher Moore, head of the USC Department of Archeology at the Savannah River Archeological Research Program, will be the guest speaker.\nAiken Technical College’s Student Nurses’ Association will hold a guest lecture and demonstration on Meducare at 11:15 a.m. Monday, Oct. 22, at the college, 2276 Jefferson Davis Highway, Graniteville. A helicopter demonstration will be held from 12:15 to 1 p.m.\nTUESDAY\nThe James and Mary Oswald Distinguished Writers Series will be held at 7:30 p.m. Tuesday, in the Etherredge Center on the campus of USC Aiken, 471 University Parkway. Jim Sanderson, author of “El Camino del Rio,” “La Modida,” “Safe Delivery,” and “Dolph’s Team” will be the guest speaker. For more information, call the USCA English Department at 803-641-3498.\nThe Adult Book Club will meet from 2:30 to 4:30 p.m. Tuesday at the Aiken County Public Library, 314 Chesterfield St. S.W. This month’s book is “Sum it Up,” by Pat Summit. For more information or to register, call the reference desk at 803-642-2020 ext. 1131.\nThe Edgefield County Comprehensive Plan Steering Committee will hold a public input meeting from 6:30 to 8 p.m. Tuesday in Edgefield County Council Chambers, 225 Jeter St., Edgefield. For more information, call Kevin Singletary, Edgefield County planner, at 803-637-2101 or email ksingletary@edgefieldcountysc.gov.\nThe Boston Ensemble will perform at noon Tuesday at St. Paul’s Church, 605 Reynolds St., Augusta, as part of Tuesday’s Music Live. The concert is free. Lunch will be served following the concert for $12. For more information or to make a lunch reservation, visit tuesdaysmusiclive.com or call 706-722-3463.\nThe CSRA Parkinson Support Group will meet at 6 p.m. Tuesday in the dining room of St. John Towers, 724 Greene St., Augusta. Claudia Collins, of the Wilson Family Y, will be the guest speaker. Her topic will be the benefits of water exercise and classes designed specifically for Parkinson patients. For more information, call May Ann Navarro at 706-364-1662.\nWEDNESDAY\nThe Edgefield County Comprehensive Plan Steering Committee will hold a public input meeting from 6:30 to 8 p.m. Wednesday in the Sweetwater Community Center, 296 Sweetwater Road, North Augusta. For more information, call Kevin Singletary, Edgefield County planner, at 803-637-2101 or email ksingletary@edgefieldcountysc.gov.\nFOTAS is hosting a Dog Ears Reading Session this Wednesday from 1:45 p.m. to 3 p.m., at the Aiken County Animal Shelter. Reading to the pets is a fun exercise that not only helps children with their verbal and reading skills, but also socializes the shelter animals. The extra contact with children makes the dogs and cats less shy and more adoptable. To make reservations, please call 803-514-4313 or email info@fotasaiken.org. The animal shelter is located at 333 Wire Road in Aiken.\nTHURSDAY\nAn open house in celebration of National Disability Employment Awareness Month will be held at 9 a.m. Thursday at Vocational Rehabilitation, 855 York St. N.E. For more information or to RSVP, call Kaya Perrin at 803-641-7360 or email kperrin@scvrd.net.\nLet’s Talk About It – Modern South Carolina Novelists was held Oct. 18, at the Aiken County Public Library, 314 Chesterfield St. S.W. The movie, “Deliverance,” was shown Oct. 18. A discussion with Dr. Geyer will be held at 7 p.m. Thursday. Participants will read, watch and compare novels to their film adaptations. The program is made possible with a grant from the S.C. Humanities and funding from Friends of the Library. The program is designed for those 18 and older. For more information, call the reference desk at 803-642-2020 x.1131.\nThe Sand River Woman’s Club will hold its Luck Be A Lady fundraiser at noon Thursday in the Aiken Municipal Building, 314 Park Ave. Tickets are $50, and include lunch, cash and prizes. For more information or to purchase tickets, call Lisa Glass at 803-979-3685 or Sharon Hagan at 803-270-2498.\nCold War Patriots will hold a National Day of Remembrance Reception at 9 a.m. Thursday in the North Augusta Community Center, 495 Brookside Ave., North Augusta. The event will feature a worker reunion and coffee hour followed by a recognition and remembrance program. For more information, call 888-903-8989 or visit coldwarpatriots.org.\nPFLAG Aiken will hold its annual business meeting at 6:30 p.m. Thursday at the Aiken Unitarian Universalist Church, 115 Gregg Ave. The regular meeting will begin at 7 p.m. All dues-paying members are invited to participate in the business meeting.", "url": "https://apnews.com/b2f9da07f697423e8d8eb314938c0a59"}