{"authors": ["Benjamin Y. Fong", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Klaus Dörre", "Stan De Spiegelaere", "Miya Tokumitsu", "Stephanie Luce", "Michel Husson"], "date_download": "2020-05-04 19:59:12", "date_modify": "2020-05-04 19:59:12", "date_publish": "2018-07-06 00:00:00", "description": null, "filename": "2018_07_leisure-time-holidays-religion-weekend_1588622352.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/07/06110908/36329571345_31487543b4_k.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_07_leisure-time-holidays-religion-weekend_1588622352.html", "title": "Inventing the Weekend", "title_page": "Inventing the Weekend", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Although “commemoration of the Resurrection” was the official reason early Christians began observing the day of rest on Sunday instead of Saturday, they were also eager to differentiate themselves from Jews, and by the fourth century this eagerness translated into the codification of the Sunday Sabbath in ecclesiastical and civil legislation.\nA millennium and a half later, the Sabbatarian movement pointed to this antisemitism, along with the undue influence of pagan sun worship among early Christians, as reason to reestablish Saturday as the Christian Sabbath day. Temporal, political concerns should not have affected the observance of the true day of rest, so their argument went.\nThere’s another reason Saturday was re-sanctified in the nineteenth century, which has to do with the “illegitimacy” not of Sunday but of Monday. In preindustrial England, according to a poem of George Davis’s, “people of all ranks, at times, obey[ed] / the festive orgies of this jocund day.” Not just skilled laborers but all classes of workers observed “Saint Monday” as a holiday from work, much to the chagrin of emergent entrepreneurs. While it’s true that many workers spent Saint Monday in the alehouse and at cock or dog fights, it was also a day of relaxation and sociability, a day when the public gardens would be “literally swarming with a well-dressed, happy and decorous body of the working classes.”\nThe fact that Monday was often taken as a day of rest was a consequence of the typical rhythm of preindustrial work, in which workers would assemble to complete a certain set of tasks, work intensely for a few days until those tasks were completed, and then be at play half the week. In E. P. Thompson’s portrayal, “the work pattern was one of alternate bouts of intense labour and of idleness, wherever men were in control of their own working lives.” The idea that work was to be done during a set amount of regularly apportioned time, time that was well demarcated from another time of “leisure,” was still rather foreign. In 1806, a committee appointed by the House of Commons to assess the state of woolen manufacture in England found an “utmost distaste on the part of the men, to any regular hours or regular habits.” Work was a set of tasks, and when those tasks were completed, play began.\nUnsurprisingly, the masters expressed no end of frustration at the “great difficulty of getting their men to work on Mondays” and at the ineffectiveness of monetary incentives to change their behavior. “They will not go further than necessity prompts them,” one report complained. This problem became increasingly acute with the dawn of steam power. Compelled by their investment in the means of production, capitalists needed human hands on their machines for as many hours a day as possible, a need stymied by the reviled Saint Monday.\nIn addition to more straightforward tactics — threatening the sack on Tuesday for an absence on Monday — two developments undermined the institution of Saint Monday in the mid-nineteenth century. The first was the moral stringency of the Victorian era. It was no coincidence that when the first temperance movements emerged in the early nineteenth century, they were specifically oriented toward remedying the supposedly degenerate habits of the working class. The rhythm of the steam engine required the erosion of Saint Monday, and the temperance movement arrived on cue to recast jocundity as barbarity. (Admittedly, advances in distilling techniques and the resulting growth of distilled liquor consumption in the eighteenth century — the first and still the most accurate metric of alienation — meant that new heights of inebriation were being reached on Saint Monday.)\nThe second was the Saturday “half-holiday” movement. Always to noisy self-acclaim, employers began letting off their workers a few hours early on Saturday afternoons so as “to induce the working classes to be more steady … [and] to give them the means of lawful recreation.” The press picked up on this and published accounts of worker gratitude for their employers’ beneficence. Soon, specially arranged activities — “rational amusements” such as concerts and football — were planned for these sanctioned holidays, which were made mandatory for women with the 1867 Factory Act and then won for all by the Nine Hours Movement of 1871–72. As the Saturday half-holiday became the norm, Saint Monday became more and more associated with bohemianism and drunkenness. According to the historian Douglas Reid, “the Saturday half-holiday had been used as a sprat to catch a mackerel; a Saturday reduction of three hours (usually) in return for a Monday’s labour of ten or eleven hours.”\nBut the eradication of Saint Monday was more than just the extension of the working week by seven to eight hours: as already mentioned, getting workers to show up consistently on Mondays was part of a transformation of task-oriented work into timed labor. As Thompson argued in his classic article, “Time, Work-Discipline, and Industrial Capitalism,” this transformation led to the increasing incomprehensibility of working life. When one has a task to accomplish, no matter how mundane, labor bears a certain intelligibility: it has a beginning and an end (the completion of the task) and the fruit of one’s work is a marketable object. In Thompson’s words, “the peasant or labourer appears to attend upon what is an observed necessity.”\nNot so with timed labor: one begins and ends the day in the middle of tasks, which appear removed from any final product, mere pieces of a larger process opaque to those participating in it. The elimination of Saint Monday thus coincided not only with the quantitative extension of work but also with its qualitative shift towards meaninglessness — what Marx calls alienation from “products of labor” and “producing activity.”\nMeanwhile, the schools of the nineteenth century — “steam engines of the moral world,” as the Owenites described them — were tasked with recasting this accommodation to alienation as an ethic of “time-thrift.” At some level, all students in capitalist society understand that education is about learning to tolerate pointless activities and internalizing decontextualized knowledge on a strict schedule, as a form of conditioning for a life of alienated labor. But it was only in the nineteenth century that schools became such sites of acculturation to capitalist ideology.\nIn addition to requiring intervention at an early age, the elimination of Saint Monday also necessitated a drastic alteration in what was considered “free time.” At the beginning of the nineteenth century, middle-class reformers like John Foster were outraged at prevailing leisure patterns:\nIn what manner … is this precious time expended by those with no mental cultivation?… We shall often see them just simply annihilating those portions of time. They will for an hour, or for hours together … sit on a bench, or lie down on a bank or hillock … yielded up to utter vacancy and torpor … or collected in groups by the road side, in readiness to find in whatever passes there occasions for gross jocularity; practising some impertinence, or uttering some jeering scurrility, at the expense of persons going by.\nTo stave off the pain of being mocked by the working classes, structured activities (the aforementioned “rational amusements”) were trotted out to give purpose and “cultivation” to those who lacked it. It was essential, moreover, that well-delimited forms of leisure be developed — a cultural trajectory that would eventually bring us the three-minute pop song and twenty-two-minute television show — so as to bring the “work” and “life” spheres into sharper definition. By the 1870s, it was “‘needless to say that on Saturday nights the ‘gallery gods’ muster in strong force at the theatres,’ and the ground had been prepared for the growth of Association Football.”\nAs Thompson argued, it would be wrong to ask ourselves how we are going to “consume all these additional time-units of leisure” in a postcapitalist world, because the question assumes a definition of leisure inimical to socialism, one forged by the Saturday half-holiday proponents. The real question, and one that goes against the grain of our present subjectivity, is rather: “What will be the capacity for experience of the men [sic] who have this undirected time to live?”\nReid concludes that “the eradication of Saint Monday did real harm to the actual and potential quality of working-class life. Half a day was given in exchange for a whole one; in submitting to the norms of industrial capitalism the notion of a proper balance between work and leisure was lost.” But remembrance of Saint Monday is more than just a lamentation for a bygone form of life, one where work made more sense, where we had more control over its rhythms, and where the “unpurposive passing of time” had not yet been funneled into structured play. It is also a reminder of what is to be gained once again.\nWith the achievement of a socialist society, work would not only re-enter the realm of conscious control but also of basic intelligibility; the force behind the cruel vilification of alcohol and drug use — responsible today for the tragedy of mass incarceration — would dry up at its social source; schools would be free to figure out what pedagogy really means, a task made impossible by the demands of capitalist conditioning. And everyone would have the time and space to once again “re-learn some of the arts of living lost in the industrial revolution: how to fill the interstices of their days with enriched, more leisurely, personal and social relations.”", "url": "https://www.jacobinmag.com/2018/07/leisure-time-holidays-religion-weekend"}