{"authors": ["Jennifer Rios Staff Writer"], "date_download": "2020-05-04 20:11:54", "date_modify": "2020-05-04 20:11:54", "date_publish": "2018-10-01 19:35:39", "description": "To see presentations Visit broomfield.org and click on City Council & Agendas Broomfield City Council will hear from departments heads this week about prior year accomplishments,...", "filename": "_5130d91429024f0eaf1d6db568aa98cf_1588623114.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5130d91429024f0eaf1d6db568aa98cf_1588623114.html", "title": "Broomfield Begins 2019 Budget Process", "title_page": "Broomfield Begins 2019 Budget Process", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "To see presentations\nVisit broomfield.org and click on City Council & Agendas\nBroomfield City Council will hear from departments heads this week about prior year accomplishments, current programs and proposed budgets for next year.\nPresentations will be broken into two days with departments heads of Communications and Government Affairs, Municipal Court, Assessor, City and County Clerk, Broomfield Police Department, Community Development, Public Works, Housing Authority and Finance presenting Tuesday.\nThursday, council members will hear from heads of the Mamie Doud Eisenhower Public Library, Recreation and Senior Services, Health and Human Services, Economic Development, Open Space and Trails, Human Resources, City and County Attorney, Information Technology and the City and County Manager.\nTypically, no comment is taking during study sessions, but the public is invited in order to learn more about the budget process.\nPublic hearings where residents can comment on the Proposed 2019 Budgets and Capital Improvement Programs are scheduled Oct. 9.\nThis week’s study sessions, which begin at 6 p.m. both Tuesday and Thursday, will be held in council chambers at the George DiCiero City and County Building, 1 Descombes Drive.\nJennifer Rios: 303-473-1361, riosj@broomfieldenterprise.com or Twitter.com/Jennifer_Rios", "url": "https://apnews.com/5130d91429024f0eaf1d6db568aa98cf"}