{"authors": ["Staff Report"], "date_download": "2020-05-04 20:06:56", "date_modify": "2020-05-04 20:06:56", "date_publish": "2018-08-25 00:00:00", "description": "Trey Potts announced his return with authority, rushing for five touchdowns as Williamsport scored all its points in the first half to open the season with a 62-26 victory over Central...", "filename": "_b90924e493004b0097eb434d48195cab_1588622816.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b90924e493004b0097eb434d48195cab_1588622816.html", "title": "HS FOOTBALL: Potts Scores 5 Touchdowns In Williamsport Win", "title_page": "HS FOOTBALL: Potts Scores 5 Touchdowns In Williamsport Win", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Trey Potts announced his return with authority, rushing for five touchdowns as Williamsport scored all its points in the first half to open the season with a 62-26 victory over Central Mountain.\nPotts, who missed all of his junior season a year ago with a partially torn ACL, carried the ball nine times for 150 yards. Quarterback Joe Fagnano threw for 250 yards and a touchdown, while Marcus Simmons had four catches for 151 yards and a touchdown.\nThe Millionaires scored 27 points in the first quarter before tacking on another 35 in the second. They finished the night with 512 total yards, with 260 of them coming on the ground. Central Mountain did answer Williamsport’s first score of the night, a 31-yard touchdown run by Fagnano.\nFrom there, the Millionaires put the offense in gear scoring on their next five possessions. Potts capped the scoring for the night with a 33-yard run with 31 seconds left to go in the second quarter.\nAthens 38, Hanover Area 6\nHanover Area fumbled away the football on its second play of the year. The turnover led to the first of two touchdowns for Athens in the first quarter, but more importantly, it put the Hawks in a hole they could never crawl out of.\nAthens built a 21-0 lead at the half, and went on to a victory at Athens.\n“We didn’t execute, the fumble put us in a hole early and we never recovered,” Hanover Area coach Mike McCree said.”\nAlready with the 7-0 lead, Athens went up by two scores later in the first quarter when Keegan Rude hauled in a 9-yard touchdown pass from Kaden Rude. Kaden Rude added a 21-yard touchdown run to put Athens up big at the half.\nAthens put the game well out of reach at the beginning of the third quarter when Kaden Rude returned the kick 95 yards for a touchdown. Hanover Area got on the board late in the fourth quarter when Joe Curcio scored on a 52-yard run.\n“We got outplayed,” McCree said. “We will regroup and get ready for Lake-Lehman next week.”\nRich Gavlick contributed to this report.", "url": "https://apnews.com/b90924e493004b0097eb434d48195cab"}