{"authors": ["James Halpin"], "date_download": "2020-05-04 20:13:51", "date_modify": "2020-05-04 20:13:51", "date_publish": "2018-04-26 15:04:09", "description": "WILKES-BARRE — A Luzerne County judge on Wednesday denied an effort by a forgery suspect entwined in a mysterious arson case to have her bail reduced. Linasheri D’Onofrio, 50, of Plains...", "filename": "_0fdc4eeeece9430498cbe31673a1e3ac_1588623231.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0fdc4eeeece9430498cbe31673a1e3ac_1588623231.html", "title": "Woman Connected To Mystery Blaze Denied Bail Change", "title_page": "Woman Connected To Mystery Blaze Denied Bail Change", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WILKES-BARRE — A Luzerne County judge on Wednesday denied an effort by a forgery suspect entwined in a mysterious arson case to have her bail reduced.\nLinasheri D’Onofrio, 50, of Plains Twp., is being held on $300,000 bail as she awaits trial on forgery and theft charges over allegations that she wrote nearly $3,000 worth of stolen checks to her missing mother.\nEarlier this month, Assistant Public Defender Girard J. Mecadon filed a petition for a bail reduction, writing that D’Onofrio is indigent and unable to post bail as set. The filing sought a reduction to a “reasonable amount and an amount that (D’Onofrio) can afford to pay.”\nBut Judge Joseph F. Sklarosky Jr. denied the motion in a video hearing held Wednesday, according to court records. The ruling was without prejudice, meaning D’Onofrio can seek a reduction in the future.\nAccording to the charges against her, D’Onofrio was supposed to be caring for a man’s cats in August 2014 at his home in the East Mountain Ridge Mobile Home Park, Plains Twp., when she wrote six of his checks totaling $2,980 to her mother, Mary Mikulak.\nThe charges say that Mikulak moved into a trailer on another lot in the park with D’Onofrio in 2007, but that family members haven’t heard from her since. If she’s still alive, troopers say Mikulak would be 96 years old.\nBank records showed that $2,327 of the stolen money had been spent from a joint account D’Onofrio had with Mikulak, according to police.\nD’Onofrio is due back in court for a preliminary hearing in that case next month.\nIn the meantime, police are continuing to investigate an arson fire that broke out Feb. 24 near the mobile home where D’Onofrio was staying. When firefighters extinguished a burning shed, they found a human skull and bones, according to police.\nDuring the investigation, neighbors told police that a “crazy lady” who had a disabled child lived nearby, but nobody recalled seeing the child recently before the fire.\nPolice say D’Onofrio initially claimed that the person neighbors thought was her son was actually her brother. But investigators subsequently learned the missing person was in fact her son Shain, who had cerebral palsy and autism, police said.\nInvestigators have collected a swab of D’Onofrio’s DNA as part of the arson investigation into the fire, but no charges have been filed in that case.", "url": "https://apnews.com/0fdc4eeeece9430498cbe31673a1e3ac"}