{"authors": ["Steven Litt", "The Plain Dealer"], "date_download": "2020-05-04 20:26:22", "date_modify": "2020-05-04 20:26:22", "date_publish": "2018-05-16 21:30:05", "description": "Cleveland Museum of Art promotes 3 executives to deputy director rank CLEVELAND, Ohio – The Cleveland Museum of Art has promoted three senior executives to deputy director status reflecting...", "filename": "_b90ebc14a0244549b4c6ec2ff8288073_1588623982.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b90ebc14a0244549b4c6ec2ff8288073_1588623982.html", "title": "Cleveland Museum of Art promotes 3 executives to deputy director rank", "title_page": "Cleveland Museum of Art promotes 3 executives to deputy director rank", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cleveland Museum of Art promotes 3 executives to deputy director rank\nCLEVELAND, Ohio – The Cleveland Museum of Art has promoted three senior executives to deputy director status reflecting greater responsibilities they’ll have in carrying out the institution’s 2017 strategic plan.\nAmong other things, the plan calls for increasing annual attendance from roughly 600,000 to 1 million, boosting the museum’s endowment from $750 million to $1.25 billion, and adding $1 billion worth of art to its collections by 2024, the current end of William Griswold’s contract as director.\nThe three executives are: John Easley, deputy director and chief philanthropy officer; Heather Lemonedes, deputy director and chief curator; and Cyra Levenson, deputy director and head of public and academic engagement.\nThe appointments went into effect in March 19.\n“I am extremely fortunate to work with a highly accomplished seven-member team of senior executives, but it has been several years since I have had a deputy,” Griswold said in a news release. “John, Heather and Cyra are outstanding and talented museum professionals, and I’m pleased to recognize the roles they play, together with the scope of their responsibilities, with their appointment to the position of deputy director.”\nUnder former director David Franklin, the museum had two deputy directors ­­– former chief curator, C. Griffith Mann, now head of the Cloisters in New York; and former chief advancement officer, August Napoli, now president and CEO of the United Way of Greater Cleveland.\nIn the early 2000s, former director Katharine Reid also appointed three deputies – Janet G. Ashe, deputy director of administration and treasurer; Charles Venable, deputy director for collections and programs; and Susan Stevens Jaros, deputy director of development and external affairs.\nIn addition to Levenson, Easley and Lemonedes, the museum’s executive team now includes Jane Alexander, chief information officer; Ed Bauer, chief financial officer; Heidi Strean, director of exhibitions and publications; and Jeffrey Strean, director of design and architecture.", "url": "https://apnews.com/b90ebc14a0244549b4c6ec2ff8288073"}