{"authors": [], "date_download": "2020-05-04 16:09:44", "date_modify": "2020-05-04 16:09:44", "date_publish": "2018-01-15 14:06:53", "description": "Combat Blue Monday and beat your blues with these best-selling light therapy SAD lamps.", "filename": "2018_01_15_cnn-underscored_light-therapy-lamps-shop_index_1588608584.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/181002104923-underscored-lighttherapy-newlead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2018_01_15_cnn-underscored_light-therapy-lamps-shop_index_1588608584.html", "title": "These light therapy lamps are best sellers and can help beat the blues", "title_page": "Light therapy lamps: The best light therapy SAD lamps to boost your mood - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Story highlights According to the APA, the most widely used treatment for SAD is light therapy.\nThese functional light therapy lamps from Amazon could help you feel less blue\nCNN Underscored has interviewed experts to find the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nSpending day after day inside when you're stuck in self-quarantine due to the spread of coronavirus can make you stir crazy and even be detrimental to your health. Your body's circadian system thrives off natural light, and with the lack of sun exposure that comes with locking yourself in your house, your mood and sleep cycles can get thrown off.\nLuckily, there are treatments widely used to help treat Seasonal Affective Disorder (SAD) that may be able to brighten our moods during the quarantine. Light therapy involves buying specialized lamps that emit bright light to mimic natural outdoor light. These devices also filter harmful UV light. The thought is that since the lack of sunlight could contribute to SAD symptoms, such as trouble sleeping, more light could help ease or reverse them.\nIt's important to note that light therapy isn't for everyone. So unless you have been diagnosed with SAD, consult a medical professional before introducing it into your daily routine.\nVerilux's HappyLight Liberty 10,000 LUX Light Therapy Energy Lamp\nIf you're ready to test out a lamp, there are a few things you'll want to consider, namely price and functionality.\nIn the latter category, you'll want to find products that have 10,000 LUX brightness, which is thought to be best for maximum effectiveness and safety. When we scoured the internet for light therapy products, we found a few standouts that feature 10,000 LUX brightness for under $100. Plus, these products have been vetted by thousands of reviewers who have given them the seal of approval.\nVerilux's HappyLight Liberty 10,000 LUX Light Therapy Energy Lamp ($68.75, originally $79.95; amazon.com or $89.99; bedbathandbeyond.com)\nVerilux's HappyLight Liberty 10,000 LUX Light Therapy Energy Lamp\nWith over 1,000 reviews on Amazon and a total rating of 4.5 stars out of 5, the Verilux HappyLight tops our list of light therapy lamps. Its provides 10,000 LUX and has a broad surface area that can emit light brightly and efficiently around your home.\n_______________________________________________________________________________\nCircadian Optics Lumos 2.0 Light Therapy Lamp ($39.99; amazon.com)\nCircadian Optics Lumos 2.0 Light Therapy Lamp\nThis adjustable light therapy lamp can fit in smaller spaces around your home. Its energy efficient bulb can also last for roughly 50,000 hours of usage.\n_______________________________________________________________________________\nMiroco Light Therapy Lamp ($39.99; amazon.com)\nMiroco Light Therapy Lamp\nThis budget-friendly lamp features a compact design and foldable bracket so it can fit anywhere, whether it's at work or home.\nHere are other best sellers for more than $100\nCarex Day-Light Classic Light Therapy Lamp ($114.95; amazon.com)\nCarex Day-Light Classic Light Therapy Lamp\nThis lamp blocks 99.3% of UV light and comes with 10,000 LUX of bright light at 12 inches so there's no need to stick your face right up to the lamp.\n_______________________________________________________________________________\nCarex Daylight Sky Therapy Lamp ($160.81; homedepot.com)\nCarex Daylight Sky Therapy Lamp\nThis lamp blocks 99.3% of UV light and comes with 10,000 LUX of bright light in a height and angle adjustable stand.\n_______________________________________________________________________________\nNorthern Light Technologies TRAVelite - Beige ($166.99; target.com).\nNorthern Light Technologies TRAVelite\nThis lamp provides 10,000 LUX at distances of 10 to 12 inches, plus it's compact and durable making it your perfect travel companion.\n_______________________________________________________________________________\nNorthern Light Technologies Boxelite 10,000 LUX Bright Light Therapy Light Box ($189.99; amazon.com)\nNorthern Light Technologies Boxelite 10,000 LUX Bright Light Therapy Light Box\nThis tried and tested lamp is an easy way to make Blue Monday and the rest of winter feel, well, a little less blue.\nNote: Prices above reflect the listed retailer's price at time of publication.", "url": "https://www.cnn.com/2018/01/15/cnn-underscored/light-therapy-lamps-shop/index.html"}