{"authors": ["Jason Galloway", "Wisconsin State Journal"], "date_download": "2020-05-04 20:07:03", "date_modify": "2020-05-04 20:07:03", "date_publish": "2018-01-28 21:00:00", "description": "It served as more or less a formality when Hough (N.C.) High wide receiver Nolan Groulx met with University of Wisconsin coaches Paul Chryst and Ted Gilmore on Saturday morning. Groulx...", "filename": "_fe4fc6a3430d45f786e1dd02740617b7_1588622823.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fe4fc6a3430d45f786e1dd02740617b7_1588622823.html", "title": "Commitment of wide receiver Nolan Groulx continues Wisconsin Badgers' early success in 2019 recruiting class", "title_page": "Commitment of wide receiver Nolan Groulx continues Wisconsin Badgers' early success in 2019 recruiting class", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It served as more or less a formality when Hough (N.C.) High wide receiver Nolan Groulx met with University of Wisconsin coaches Paul Chryst and Ted Gilmore on Saturday morning.\nGroulx committed to join the Badgers’ 2019 recruiting class at that meeting, but it certainly wasn’t a decision made off the high of an unofficial visit to Madison this weekend.\n“I’ve known for probably a month,” said Groulx, who announced his commitment via Twitter on Sunday. “My family and I have been talking over it a lot, and after our visit in June, and the love from the coaches and how great the campus was, we kind of just knew it was the place to be for me. So we’ve known for a month and we’ve been talking it over just to clarify.”\nGroulx, who ranks as a four-star prospect by 247sports and a three-star prospect by Rivals, chose UW over reported offers from South Carolina, West Virginia, Vanderbilt, Duke, Wake Forest and NC State.\nHe’ll add to an already-impressive group of young receivers the Badgers have accumulated in recent years. Sophomores and freshmen dominated major roles at that position during the 2017 season, and UW already signed three wide receivers in the 2018 class last month.\nThe 6-foot, 185-pound Groulx joined safety Bryson Shaw as those from the 2019 class who pledged to UW while on a visit this weekend. Shaw announced his commitment via Twitter on Saturday night.\nFour of UW’s seven 2019 commitments - Groulx, offensive linemen Logan Brown and Joe Tippmann and quarterback Graham Mertz - are ranked as four-star prospects by at least one major recruiting site. While still early in the process, the Badgers’ class currently ranks third nationally by 247sports’ composite team rankings.\n“The class is looking great, obviously,” Groulx said. “I was told it’s No. 3 in the country right now. With Graham coming in and the two great linemen we have and (Menomonee Falls running back) Julius (Davis), it should be a pretty good offensive class.”\nGroulx said he’ll have the credits to enroll early next January but has yet to make a decision on whether or not he’ll pursue that option.", "url": "https://apnews.com/fe4fc6a3430d45f786e1dd02740617b7"}