{"authors": ["Libor Jany"], "date_download": "2020-05-04 20:07:57", "date_modify": "2020-05-04 20:07:57", "date_publish": "2018-01-01 17:16:54", "description": "With Super Bowl LII just around the corner, the traffic and parking nightmares that come along with hosting the country’s premier sporting event have some downtown Minneapolis employers anxiously...", "filename": "_79d1668b26ef46e29fec7dbeb5cc4c5d_1588622877.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_79d1668b26ef46e29fec7dbeb5cc4c5d_1588622877.html", "title": "Downtown Minneapolis employers brace for Super Bowl disruptions", "title_page": "Downtown Minneapolis employers brace for Super Bowl disruptions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With Super Bowl LII just around the corner, the traffic and parking nightmares that come along with hosting the country’s premier sporting event have some downtown Minneapolis employers anxiously eyeing the calendar.\nInsurance companies, banks, hospitals, law firms and other businesses are warning their employees to expect gridlock on the roads and mass-transit delays.\nLeave your car at home and take the bus or light rail to work, workers are being advised — otherwise, give yourselves extra time for the daily commute. Some are being given the option of working from home.\nAbove all, says Jonathan Weinhagen, many downtown workers are being told to avoid areas surrounding U.S. Bank Stadium before game day, if they can.\n“The 10 days leading up to the game will yield quite a bit of activity and disruption throughout downtown Minneapolis,” said Weinhagen, president and CEO of the Minneapolis Regional Chamber of Commerce. “We’re hearing a lot of folks who are going to increase telecommuting.”\nMore than a million visitors are expected to cram area hotels and restaurants during the lead-up to the Feb. 4 game, with tens of thousands of additional riders on public transportation, heading to events like the NFL’s interactive Super Bowl Experience and Super Bowl Live, a host committee-sponsored entertainment extravaganza featuring free concerts, food trucks and other activities. Earlier this month, Metro Transit and the transit workers’ union averted a potentially crippling strike during Super Bowl week by agreeing to a new wage deal.\nThe Hennepin County Medical Center has braced itself for the street closures near the 2 ½-block security perimeter around the stadium, said Dr. John Hick, the hospital’s medical director for emergency preparedness. Staffing will be beefed up in specialty units like the emergency room on certain days and remain at “summer staffing levels” to handle any emergency up to and including a potential terror attack, he said.\nAmbulances will be deployed around the city to avoid traffic congestion on the way to calls, with emergency rigs from Allina Health Edina Clinic and North Memorial Medical Center expected to pick up the slack in more remote corners of the county.\n“Access to the callers is another thing that we are concerned about,” Hick said. “If there is a ton of traffic downtown, rather than try to fight through that, it may be better for a patient to go through a different facility.”\nRecent Super Bowl host cities like San Francisco and Houston saw only modest increases — between 5 and 10 percent — in 911 calls during Super Bowl week, he said.\nStill, he added, the hospital could see a much heavier patient load, depending on the impact of flu season, so some staff will be on call.\n“Given what we’re seeing with the flu right now, we’re hoping that the peak of the flu season will occur several weeks before the game,” he said.\nWeather will be a factor as well.\n“Snow obviously can play a role in this, so if we have a blizzard or something that occurs over the week, that may change the calculus on this,” Hick said.\nBrochures extolling the importance of bundling up to confront the cold and snow will be handed out to out-of-towners staying at area hotels, officials say.\nHospital spokeswoman Christine Hill said that the roughly 3,700 workers scheduled to work over Super Bowl weekend are being encouraged to use public transportation and park in the hospital’s dedicated ramp.\nSuper Bowl organizers have spent more than a year working on the street plans with city and regional officials, with traffic adjustments focused on three areas: Nicollet Mall, the Minneapolis Convention Center and, of course, U.S. Bank Stadium. Their aim has been minimal disruption to downtown workers and residents.\nBut some Super Bowl-related headaches will be unavoidable for downtown businesses.\nDuring Super Bowl week, there will be staggered street closings near the sites of NFL-sponsored events. Businesses close to Nicollet Mall and the Convention Center, in particular, will see heavy disruptions. Most restrictions will remain in place until early Feb. 6, the Tuesday after the game.\nMore street closures may be announced closer to game day.\nFlexibility is key for places like the Hennepin County Medical Examiner’s office. The 2-acre site abuts the security perimeter that will be established around the stadium on the weekend of the game. But after months of careful planning and back-and-forth negotiations with Super Bowl officials, operations manager Shawn Wilson says the agency is confident it will be prepared.\n“Super Bowl Sunday is not going to be unlike any other normal NFL day for us, with the exception that there is a hardened perimeter that is adjacent to our building,” Wilson said. “We have [a] contingency if a barrier gets dropped in the wrong place or a driveway gets blocked or things like that.”\nAnd, if need be, some employees may be moved to the medical examiner’s satellite office in Apple Valley, he said.\nThe national law firm of Faegre Baker Daniels said it would give some of its roughly 600 employees — more than half of whom already commute on public transportation — the option of working remotely.\n“We will be offering employees some flexibility [to] those who are able to work from home,” said human resources director Yvonne Miller.\n“We’ve been through this before, we have an office in Indy,” Miller said, referring to its office in downtown Indianapolis, which hosted the Super Bowl in 2012. “We did observe that there wasn’t a significant impact during that time.”\nLibor Jany • 612-673-4064 Twitter:@StribJany", "url": "https://apnews.com/79d1668b26ef46e29fec7dbeb5cc4c5d"}