{"authors": ["Patrick Kennedy"], "date_download": "2020-05-04 20:23:11", "date_modify": "2020-05-04 20:23:11", "date_publish": "2018-03-15 13:52:08", "description": "Supervalu is selling 21 of its 38 Farm Fresh Food Pharmacy stores for $43 million. The Eden Prairie based company has found three different retailers to pick up the stores and is looking for...", "filename": "_34463f92b19c45db825d1b8d430579c0_1588623791.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_34463f92b19c45db825d1b8d430579c0_1588623791.html", "title": "Supervalu sells Farm Fresh Food stores", "title_page": "Supervalu sells Farm Fresh Food stores", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Supervalu is selling 21 of its 38 Farm Fresh Food Pharmacy stores for $43 million. The Eden Prairie based company has found three different retailers to pick up the stores and is looking for buyers for the remaining stores.\nFood Lion is buying three of the stores; Kroger Mid Atlantic, eight stores; and Harris Teeter, 10 stores. One of the stores to be acquired by Food Lion is based in North Carolina, the remaining stores are in Virginia.\n“Over the past two years, we’ve been working diligently and rapidly to transform our business to become the wholesale supplier of choice for grocery retailers across the United States,” said Supervalu President and CEO Mark Gross in a statement.\nTo pursue that strategy Supervalu has sold off some of their retail stores — including the $1.37 billion deal in 2016 to sell its 1,350 Save-A-Lot locations — and has made acquisitions to build up its core wholesale business.\n“Exiting the Farm Fresh banner will enable us to allocate greater resources and energy toward the strategic growth of our wholesale business,” Gross added.\nIn 2017, Supervalu acquired wholesalers Associated Grocers of Florida Inc. and California-based Unified Grocers Inc. for a combined $583 million.\nFarm Fresh Foods was founded in 1957 and operates in the North Carolina and Virginia markets and they employ more than 3,300 employees. They’ve been part of Supervalu since they acquired Richfield Holdings in 1999.\nSupervalu expects the buyers to offer positions to existing employees but Supervalu will provide eligible employees severance and other transition support.\nOf the 38 Farm Fresh stores, 32 have pharmacies. In the stores not yet sold, the pharmacies will transfer customer prescriptions, depending on location to Rite Aid or CVS, Supervalu said. Customers of those pharmacies will get detailed instructions within days on how and where their prescriptions will be transferred.\n“We’re focused on the successful transition of Farm Fresh to its new buyers and continuing discussions and exploring potential transactions to sell the remaining Farm Fresh stores,” said Jeff Swanson, spokesman for Supervalu, in an e-mail.\nSupervalu still operates 80 Cub Foods stores, all but one in Minnesota; eight Hornbacher stores in the Fargo-Moorhead area; nearly 40 Shop ’N Save stores in the St. Louis area; and 56 Shoppers locations in the Baltimore, northern Virginia and Washington D.C. area.\nThe Farm Fresh Food Pharmacy deals are expected to close in May.\nSupervalu released the Farm Fresh news after the markets closed on Wednesday. On Thursday, the company’s shares closed down 1.3 percent at $15.48.\nPatrick Kennedy • 612-673-7926", "url": "https://apnews.com/34463f92b19c45db825d1b8d430579c0"}