{"authors": ["Jim Souhan"], "date_download": "2020-05-04 20:09:43", "date_modify": "2020-05-04 20:09:43", "date_publish": "2018-04-06 21:08:16", "description": "Augusta, Ga. Patrick Reed holds the 36-hole lead at the Masters, meaning he has answered one of the most important questions of his career: Yes, he can dominate even when 80,000 Minnesotans...", "filename": "_c4b55f8f19fc480289fd89a387aa84f1_1588622983.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c4b55f8f19fc480289fd89a387aa84f1_1588622983.html", "title": "Patrick Reed out to show he can back his bravado at Masters", "title_page": "Patrick Reed out to show he can back his bravado at Masters", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Patrick Reed out to show he can back his bravado at Masters\nAugusta, Ga. Patrick Reed holds the 36-hole lead at the Masters, meaning he has answered one of the most important questions of his career:\nYes, he can dominate even when 80,000 Minnesotans arent screaming his name.\nReed became a golfing hero at Hazeltine National in 2016, leading the U.S. in points scored and fists pumped. Friday at Augusta, he shot a 66 to follow his opening-round 69 and take a two-shot lead over Marc Leishman with a score of 9 under par.\nI try to treat every event, whether its a major, regular event or Ryder Cup, like its a normal event, he said. Of course, Ryder Cup, just it gets you kind of high, high on adrenaline, just kind of craziness going on.\nHe belied his finger-waving image Friday with a serene round. Playing in the final group, Reed would make another birdie, pick the ball out of the cup and head to the next tee as behind him spectators folded their folding chairs and headed toward the exits.\nReed did not generate the roars that Tiger Woods does when he makes a putt, but he is borrowing a Woods stratagem: sominating the par-5s and surviving the rest of the holes. Reed is 9 under overall, and 8 under on par-5s.\nReed and Leishman each will try to win a first major on a leaderboard crowded with excellence, even if Woods and Phil Mickelson are out of contention. The top seven all rank in the top 25 of the World Golf Rankings, and the five players right behind Reed and Leishman all have won majors.\nReed finished second at last years PGA and is beginning to justify his infamous comment, years ago, that he considered himself a top-five player in the world.\nHe was considered similarly brash in college. Reportedly kicked off the team after one year at Georgia, he ended up transferring to nearby Augusta State. After leading his high school to two Texas state championships, he led Augusta to two titles while taking advantage of free rounds at Augusta National.\nThere was a lot of times we came out and played with the members, Reed said. It was just an awesome week, to be able to go out, to be able to play Augusta National, but also to spend time with some of the members and get to know them and get to know Augusta National in general.\nI mean, everyone knows it from the tournament, but what is it during an off week, when the tournament is not there? You know, the way the guys are in the locker room, the way all the staff is, they are great, and they treat us with the same respect, whether its tournament week or not.\nWhile Reed has tried to distance himself from his perceived prickly past, Leishman may be best known for spontaneous sportsmanship. He was playing alongside fellow Aussie Adam Scott when Scott sank a putt on the 18th green to force a playoff he would win.\nLeishman pumped his fist. Scott, who became the first Australian to win the Masters, didnt know until he later saw a photo of his celebration with Leishman in the background. Scott would say that was his favorite part of his big moment.\nThursday, Martin Kaymer asked Leishman if he was in contention when Scott sank that putt. Im like, No, I wouldnt have been fist-pumping if I did Im not that good a bloke, Leishman said.\nHenrik Stenson is 5 under. Rory McIlroy and Jordan Spieth are 4 under McIlroy being Reeds emotional opponent at Hazeltine, and Spieth being his most frequent partner. Dustin Johnson and Justin Thomas are at 3 under.\nYears ago, Reed talked of daydreaming about making a 2-foot putt to win the Masters. Its allowed me to really believe in myself that I can compete out here, win golf tournaments and hopefully win majors, he said.\nIf he keeps playing this well, the patrons wont be so quiet as he winds through the back nine on Sunday.\nJim Souhans podcast can be heard at MNSPN.com. On Twitter: @SouhanStrib. jsouhan@startribune.com", "url": "https://apnews.com/c4b55f8f19fc480289fd89a387aa84f1"}