{"authors": ["Jonathan Bombulie"], "date_download": "2020-05-04 20:28:17", "date_modify": "2020-05-04 20:28:17", "date_publish": "2018-03-09 10:31:00", "description": "Chad Ruhwedel was set to play his 100th career NHL game Wednesday night in Philadelphia. It's a nice milestone for an undrafted, undersized defenseman who, as a San Diego native, didn't take...", "filename": "_5f7aa41ff5a14fd6a682d6886ecb7faa_1588624097.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5f7aa41ff5a14fd6a682d6886ecb7faa_1588624097.html", "title": "Penguins' Chad Ruhwedel making up for lost time", "title_page": "Penguins' Chad Ruhwedel making up for lost time", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Chad Ruhwedel was set to play his 100th career NHL game Wednesday night in Philadelphia.\nIt’s a nice milestone for an undrafted, undersized defenseman who, as a San Diego native, didn’t take a traditional path to the sport’s highest level.\nFrankly, though, the way Ruhwedel sees it, career game No. 98 represented a greater cause for celebration.\nThat came Saturday against the New York Islanders when Ruhwedel finally dressed after sitting out two months, first because of a neck injury, then as a healthy scratch.\nRuhwedel suffered the injury on a hit during a Dec. 27 game against Columbus. By the time he was ready to return about a month later, Ian Cole was just leaving the press box at the end of a seven-game stint as a healthy scratch.\nCole jelled on a pair with Jamie Oleksiak, and Ruhwedel’s return had to wait some more. Finally, after Cole was dealt at the NHL trade deadline and Matt Hunwick struggled for a few games as his replacement, Ruhwedel got a game jersey in his locker.\nAll told, he sat out 27 consecutive games — 12 due to injury and 15 due to coach’s decision.\n“It’s taxing mentally and physically,” Ruhwedel said. “Obviously, we do a lot of work in the gym, too. Mentally, it’s just staying in a good state of mind and being positive. When the team’s winning, that’s what you want most. You want the team to succeed. They did a lot of that in January and February. It was fun to watch. I’m just glad to be playing with them now.”\nIn his first game back, Ruhwedel was a plus-1 and had three hits. When he was on the ice at even strength, the Penguins outshot the Islanders, 14-7. In his second game back, he scored in a 4-3 overtime win over the Calgary Flames on Monday night.\n“Initially, your adrenaline gets going just naturally being back in the lineup,” Ruhwedel said. “A couple shifts in, it goes away and you just play hockey after that.”\nWhen the Penguins signed Ruhwedel to a two-year contract extension last June, the idea was he would provide depth on defense. Once Hunwick was signed, Ruhwedel was penciled into the eighth spot on the team’s defensive depth chart.\nThese days, it’s hard to argue Ruhwedel isn’t one of the team’s top six options on the blue line, especially when he’s paired with Olli Maatta.\nThe Penguins have used eight defense pairs for at least 100 minutes of even-strength ice time this season. With a 54.6 percent shot-attempt ratio, the top pair of Brian Dumoulin and Kris Letang is best at driving possession. Ruhwedel and Maatta (53.9 percent) are close behind.\n“Olli and I have played together a lot this year, mainly earlier on in the year,” Ruhwedel said. “Stepping in with him, we really didn’t lose a beat. The lineup has changed a bit, but I think our identity has stayed the same. It makes it easier to come in and play.”\nThe pair is a good fit for the Penguins’ philosophy on defense. They’re better in the transition game than they are slugging it out in front of their own net.\n“Just kept things simple,” Ruhwedel said. “Try not to get hemmed in our zone. Get out quick and try to go play in the offensive zone.”\nAdding Ruhwedel to the lineup also allows the Penguins to have a left-handed shot and a right-handed shot on each defense pair. Before his return, Oleksiak was playing his off side.\n“Having lefty-righty on all three pairs, it gives you more options and gives you the ability to run more plays, certain plays,” Oleksiak said. “That’s nice.”\nJonathan Bombulie is a Tribune-Review staff writer. Reach him at jbombulie@tribweb.com or via Twitter @BombulieTrib.", "url": "https://apnews.com/5f7aa41ff5a14fd6a682d6886ecb7faa"}