{"authors": ["Mark Watson Black Hills Pioneer"], "date_download": "2020-05-04 20:10:36", "date_modify": "2020-05-04 20:10:36", "date_publish": "2018-03-16 17:30:00", "description": "SPEARFISH — The South Dakota Department of Environment and Natural Resources (DENR) announced Thursday that it reached an agreement with a mining company drilling exploration holes near the rim of...", "filename": "_c9cdf1ea7b75479b8e6fdbf66ecf9fa5_1588623036.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c9cdf1ea7b75479b8e6fdbf66ecf9fa5_1588623036.html", "title": "DENR fines gold mining company for violations", "title_page": "DENR fines gold mining company for violations", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SPEARFISH — The South Dakota Department of Environment and Natural Resources (DENR) announced Thursday that it reached an agreement with a mining company drilling exploration holes near the rim of Spearfish Canyon.\nThe settlement was made with VMC, LLC and Don Valentine, principal owner of the Valentine Mining Company, doing business as the Deadwood Standard Project.\nAccording to the DENR, VMC and Valentine, who was responsible for overseeing the drilling operation, agreed to pay a penalty of $11,000, after violations were made to an exploration notice of intent that permitted his company to seek gold in an area about seven miles west of Lead, and above the rim of Spearfish Canyon near Savoy.\nAccording to the state, in September 2017, DENR inspectors discovered that several holes had been drilled that month, on property owned by Valentine, in excess of the 100-foot depth limit set by the company’s permit, and one that was measured to be 800 feet deep.\nIn 2012, when the proposed idea of the mine was first made, Mark Nelson, a professional geologist and a partner in the Deadwood Standard Project, said the ore deposits at the proposed mine site are shallow horizontal formations. The average depth of mining would be 23 feet and no deeper than 75 feet.\n“The failure to comply with the exploration notice of intent did not cause any ground-water contamination, but our job is to make sure exploration activities follow all requirements of its approved exploration plan,” said DENR Secretary Steve Pirner.\nThe permit in question is Exploration Notice of Intent 419.\nIn addition to the penalty, VMC and Valentine have agreed to complete reclamation of the disturbed areas by June 1.\nIn total, the company has drilled 16 test holes, according to the DENR. Not all were in excess of 100 feet.\nAn additional violation occurred by the test drilling operations, when mine officials failed to provide the Department of Game, Fish, and Parks a map showing the location of all historic open mine workings in the vicinity of proposed exploration activity so the mine workings could be assessed for bat use. In addition, GF&P was not notified that exploration activity, including drilling, within 100 feet of an historic mine shaft was being conducted.\nDENR officials found no environmental damage due to the drilling. After sampling the holes, all holes were immediately plugged with a bentonite grout in accordance with the applicable regulations.\nValentine could not be immediately reached for comment.\nThe Deadwood Standard Project is a proposed 424-acre gold mine.\nThe state approved the company’s notice of intent to conduct exploration for gold and associated minerals in and around their proposed mine site in December 2012.\n“The testing will be in the Deadwood Standard Project area and other areas … mainly north of Ragged Top Mountain approximately one mile northeast of the mining site,” Mike Cepak, an engineer manager for the DENR said at the time.\nExploration, Cepak said previously, has been conducted around the proposed mine multiple times throughout the decades, but further exploration could be done for several reasons to include checking the continuity of ore bodies as well as finding new ore bodies.\nBut shortly after the permit was approved, the company fell silent. Officials said in 2012 that the company was gathering one year’s worth of baseline data to include water quality from Spearfish Creek that flows through Spearfish Canyon. According to the DENR, the company ceased taking baseline data in 2013, and other than annual reports the September drilling activity was the first interaction the had with the company since 2013.\nTo read all of today’s stories, Click here or call 642-2761 to subscribe to our e-edition or home delivery.", "url": "https://apnews.com/c9cdf1ea7b75479b8e6fdbf66ecf9fa5"}