{"authors": ["Jeff Yip"], "date_download": "2020-05-04 20:06:59", "date_modify": "2020-05-04 20:06:59", "date_publish": "2018-01-24 17:34:07", "description": "Americans invest a lot of time and effort to keep up, pretty up, toughen up or speed up their vehicles. Those goods and services - part of the automotive aftermarket - are a multi-billion dollar...", "filename": "_4cda10c3c15846d0aeb18e8c11dc6763_1588622819.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4cda10c3c15846d0aeb18e8c11dc6763_1588622819.html", "title": "Latest features on display at Aftermarket Expo", "title_page": "Latest features on display at Aftermarket Expo", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Americans invest a lot of time and effort to keep up, pretty up, toughen up or speed up their vehicles. Those goods and services - part of the automotive aftermarket - are a multi-billion dollar industry.\nAccessorizing and personalizing a vehicle can be a do-it-yourself (DIY) project or you can have a professional perform the work.\nAnother avenue is working with the dealership to tailor the car, truck or SUV to your tastes and requirements.\nThe advantages of having modifications done at the time of purchase can be practical; such as adding nearly invisible film like XPEL’s Ultimate clear protection film.\nAfter all, isn’t one of the laws of the automotive universe that that dazzling optional paint you paid extra for will attract its first rock chip as soon as it’s driven off the lot?\nThe dealer’s specialists can also prove valuable by zeroing in on what works and what doesn’t on any particular model.\nAn example would be up-sized wheels and tires for style and performance or installing a lift kit on a truck. Making your vehicle look cooler is great - as long as the modifications don’t inadvertently harm ride, clearance or safety.\nUpgraded wheels and tires are often one of the first modifications that owners make. But the reality is that a set of high-quality forged wheels to dress up a premium sports car like a Porsche Carrera 911 can cost $6,000 and up.\nSome drivers lessen the financial pain by folding the cost of new gear into the sales price of the vehicle - suddenly everything’s financed.\nThe magic of the aftermarket can also be used to restore - or even recreate - a favorite car or truck that isn’t made any more or is nearly impossible to find, used.\nOn the other hand, if you’re out looking at pre-owned vehicles and find one that’s got all the right stuff - options, condition and paint color - but has cloth interior instead of leather, the fix is just a phone call or a few keystrokes away because companies like Katzkin can supply custom-fit leather interior kits.patterns and colors\nPrepare yourself to see a lot of aftermarket eye candy at the Houston Auto Show’s Aftermarket Expo. Vendors like local EVS Motors will have several machines have several performance and show cars on display.\nAllout Offroad, which specializes in Jeeps and trucks, is hosting what it calls “Off-Roadeo” which will bring together a dozen privately owned off-road machines that have been extensively modified.\nThe 12 entries will compete for trophies in categories such as Most Extreme and Best Paint/Wrap.\nMany auto manufacturers get into the aftermarket game, offering appearance and performance products for their most popular models (Ford’s Mustang and the Dodge Challenger to name just two) or coming up with their own wild machines designed to gauge consumer reaction to a new concept, create buzz or get potential customers excited.", "url": "https://apnews.com/4cda10c3c15846d0aeb18e8c11dc6763"}