{"authors": ["Tom Howell Jr.", "Gabriella Muñoz The Washington Times"], "date_download": "2020-05-04 20:05:50", "date_modify": "2020-05-04 20:05:50", "date_publish": "2018-10-10 20:44:09", "description": "President Trump blasted Democrats on Wednesday for trying to overturn his administration's push to give consumers an off-ramp from Obamacare, warning that their defense of the 2010 law is a path...", "filename": "_2ab6134b6f521722294a66057c2a156d_1588622750.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2ab6134b6f521722294a66057c2a156d_1588622750.html", "title": "Democrats' bid to scuttle Obamacare change defeated", "title_page": "Democrats' bid to scuttle Obamacare change defeated", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Trump blasted Democrats on Wednesday for trying to overturn his administration’s push to give consumers an off-ramp from Obamacare, warning that their defense of the 2010 law is a path to government-run socialized medicine.\nHe and fellow Republicans are seeking to reverse the electoral momentum Democrats believe they have gained in their defense of Obamacare, as voters prepare to go to the polls next month with the health debate once again front-and-center.\nGOP senators managed to narrowly defeat Democrats’ attempt to scuttle the off-ramp, which would allow Obamacare customers to buy short-term plans that skirt the law’s strict coverage rules.\nThe Democrats’ bid failed on a 50-50 vote, with only one Republican, Sen. Susan Collins of Maine, joining them. The measure needed a majority to advance.\nThe vote was chiefly for show the rollback wasn’t going to see action in the House but Democrats said it gave their senators a chance to portray Republicans as indifferent to people with pre-existing conditions, who could end up paying more under Mr. Trump’s move.\nSenate GOP leaders, hoping to turn the tables, said if Democrats had been successful, millions of people might have seen their health insurance premiums rise as they were forced to buy Obamacare-compliant plans that covered services the consumers didn’t want.\n“We don’t need more command and control, more paternalism out of Washington,” said Sen. John Cornyn, Texas Republican.\nMr. Trump was more plain-spoken in an op-ed published Wednesday, saying he is making coverage more affordable while Democrats are marching toward a government-run, single-payer system that he said would undo private insurance, threaten Medicare and nudge voters toward a “socialist, Venezuela-esque America.”\n“The truth is that the centrist Democratic Party is dead,” Mr. Trump wrote in USA Today.\nLiberal activists called the Trump piece a litany of falsehoods, and they are increasingly confident voters will reward them for defending Obamacare.\nSen. Tammy Baldwin, a Wisconsin Democrat who is running for re-election, led the push to overturn the Trump rules.\nShe harnessed the Congressional Review Act, which gives lawmakers a chance to veto new rules and regulations, to target the Department of Health and Human Services’ decision to let companies sell short-term health plans that fall short of Obamacare’s full coverage menu and to allow Americans to hold the plans for up to a year. Insurers that sell the plans can charge sicker Americans more than healthy ones.\nDemocrats called the short-term insurance “junk plans,” predicting consumers who buy them will be stuck without needed coverage. Meanwhile, left without those healthy customers in their pools, insurers would raise premiums on sicker customers who remain in Obamacare’s exchanges.\n“Republicans have given voters another reason not to support them next month,” said Sen. Chris Van Hollen, Maryland Democrat and chairman of the Democratic Senatorial Campaign Committee.\nRepublicans, though, said Democrats’ defense of Obamacare is just a midway point on the path to single-payer care, which is popular on the left.\n“Medicare for All” plans have been promoted by self-proclaimed Democratic socialists such as Sen. Bernard Sanders, Vermont independent, and House candidate Alexandria Ocasio-Cortez of New York, but also have been embraced by mainstream, establishment Democrats such as former President Barack Obama.\nThe idea polls relatively well and is gaining traction ahead of November’s midterm elections.\nStill, a single-payer bill is nowhere close to becoming law Republicans who currently control Congress loathe it, and it spooks centrist Democrats who would rather defend Obamacare and attempt a more limited expansion of taxpayer-funded insurance.", "url": "https://apnews.com/2ab6134b6f521722294a66057c2a156d"}