{"authors": ["Gia Mazur", "Staff Writer"], "date_download": "2020-05-04 21:07:19", "date_modify": "2020-05-04 21:07:19", "date_publish": "2018-03-01 00:00:00", "description": "Linda Norsen uses her Glenburn Twp. restaurant not only to feed her customers, but also to nourish community spirit. The Glenburn Grill & Bakery, which has served lunch, breakfast and baked...", "filename": "_0bb41eb8e0b04453beb9cf3290ee255b_1588626439.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0bb41eb8e0b04453beb9cf3290ee255b_1588626439.html", "title": "Glenburn Grill & Bakery Gives Customers Slice Of Homestyle Goodness", "title_page": "Glenburn Grill & Bakery Gives Customers Slice Of Homestyle Goodness", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Linda Norsen uses her Glenburn Twp. restaurant not only to feed her customers, but also to nourish community spirit.\nThe Glenburn Grill & Bakery, which has served lunch, breakfast and baked goods to hungry customers along Routes 6 and 11 since 2009, is known for hearty portions of homestyle goodness. The Grill is open daily from 6:30 a.m. to 3 p.m. and has ample parking as well as seating for about 100 people.\nNorsen thinks these elements, mixed with made-to-order dishes, keep customers coming back.\n“We like to put a good amount of food on the plate, made from scratch, for a reasonable price,” Norsen said on a recent afternoon at the restaurant. “We’re known for our breakfast, but our lunch is just as good. People know what to expect here.”\nThe Grill received its 15 minutes of fame when it appeared on Food Network’s “American Diner Revival” in 2016. The show’s staff, with hosts Ty Pennington and Amanda Freitag, revitalized the Abingtons diner with fresh paint, new floors and other fixes. The Grill then saw an uptick in customers.\n“They were coming from all over,” Norsen said with a laugh. “It was so nice to meet all these people who had seen the show and wanted to see what we were all about. It’s what we had been doing for years — serving good food and making people feel at home.”\nBefore opening the Grill, the Norsens owned and operated the Lake Road Cafe at Lake Winola. The only prior restaurant\nexperience Norsen had was as a waitress but, when she saw the Lake Winola building was for sale, she peeked in the windows and imagined a restaurant.\n“I told (my husband, Alan) I thought I could do this,” she said. “And here we are now. It was a lot of work at first but this is it.”\nAt the Grill, breakfast is served all day, and popular items include specialty pancakes or French toast, 16 different kinds of omelettes and the coveted Eggs Benedict smothered in homemade hollandaise sauce. For lunch, there are hoagies, burgers, salads, sandwiches and homemade soups. The Grill’s Reuben is one of its best-sellers, Norsen said. A real star of the Grill is the baked goods case, filled with signature sweets crafted by Norsen’s daughter, Jessica. Customers can find anything from breads, cookies, cupcakes, cakes and cheesecakes to bars, pies, cinnamon buns and muffins.\nThe Norsens try to keep things interesting with different specials each week, like Apple-Snickerdoodle French Toast with Cinnamon Cream Cheese Drizzle or California BLT Eggs Benedict with arugula, tomato bacon and avocado. During Super Bowl weekend, the Grill served New England or Philadelphia-inspired dishes.\n“Anything creative to keep things fresh or different,” Norsen said.\nAlmost everything on the menu is made from scratch, and Norsen supports local farmers and growers.\n“If I can get it from someone around here, I will,” she said. “As a small business owner, we know how important it is to support local.”\nNorsen admits the past few years have been spotted with difficult times for the restaurant. A few years after the Grill opened, it contended with major road construction along Routes 6 and 11. Norsen said many people she met thought the restaurant was closed during that period.\nSome time later, Norsen’s husband had a stroke. The patriarch was known for being “Mr. Fix-It” around the restaurant, remodeling and renovating, as well as keeping up with the day-to-day duties. Customers knew him, too, and Norsen said the community rallied around the family during the trying time.\n“It was apparent to me then what community really meant,” Norsen said. “It was a very emotional time ... We were so thankful for it. I want to give back and make someone else feel the same way.”\nNorsen’s husband pulled through, but can’t do the same maintenance duties he used to so their son, Jay, helps out. And the couple’s daughter stepped up to help her mom with running the Grill.\n“She’s my right-hand-man,” Norsen said.\nThe restaurant gives back as much as it can, hosting benefits and fundraisers, such as the one for Dalton Fire Company coming up on Wednesday, April 25, from 3 to 8 p.m.\nThe Grill offers special dinner catering that can be picked up and reheated for a hassle-free holiday or party. It also stays open late to host dinner nights once a month. Norsen said the restaurant stopped serving daily dinner about a year ago, but still offers these special nights for customers looking for a fresh, homecooked meal.\nThat’s the Grill’s mission, after all, Norsen said.\n“We want people to come here and eat well and be friends,” she said. “We want them to feel comfortable and at home. This is like our little home where we all get together.”\nContact the writer: gmazur@timesshamrock.com; 570-348-9127; @gmazurTT on Twitter\nGlenburn Grill & Bakery\nAddress: 1144 Lackawanna Trail, Glenburn Twp.\nPhone: 570-585-8777\nHours: Daily, 6:30 a.m. to 3 p.m.\nOwners: The Norsen family\nCuisine: Homestyle, baked goods\nOnline: Visit theglenburn grill.com or Glenburn Grill & Bakery on Facebook.", "url": "https://apnews.com/0bb41eb8e0b04453beb9cf3290ee255b"}