{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:17:36", "date_modify": "2020-05-04 20:17:36", "date_publish": "2018-12-17 07:00:00", "description": "1934-2018 On Wednesday November 28 2018 Robert A Jeffs loving husband, father, grandfather and great grandfather passed away at the age of 84. Robert was born on June 14th 1934 in Mt....", "filename": "_8598db47d1554edf9b7f5f77a2522d2f_1588623456.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8598db47d1554edf9b7f5f77a2522d2f_1588623456.html", "title": "Robert A Jeffs", "title_page": "Robert A Jeffs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "1934-2018\nOn Wednesday November 28 2018 Robert A Jeffs loving husband, father, grandfather and great grandfather passed away at the age of 84. Robert was born on June 14th 1934 in Mt. Pleasant Utah, to Ephraim and Zala Jeffs. He married Erma Jean Shores on March 1st 1968.\nThey raised four sons, and have 8 grand children and 7 great grandchildren. Robert worked for Nebo School District for 19 years. Teachers and many students adored his kindness, humor and friendly nature. He retired in 1996.\nRobert loved to garden and share his tomatoes with everyone. He also enjoyed tinkering in his garage and woodworking. He was well known and loved by everyone in town for his knowledge of how to fix anything and everything.\nHe was preceded in death by his parents Ephraim and Zola Jeffs, Brothers, Jim Jeffs, Carol Jeffs, Sisters, Louise Miller, Twin sister Betty Ellen Jeffs and wife Erma Jean Jeffs. He is survived by his four sons, Nathan (Jennifer), Helper, Justin (Nikki), Helper, Cody (Sammie), Seattle, Matthew, Springville, and many loving family members. A Memorial Service, will be held on December 22nd 2018, at Grace Bible Church, 239 So. Main Street Springville Utah from 1 pm to 4 pm.", "url": "https://apnews.com/8598db47d1554edf9b7f5f77a2522d2f"}