{"authors": ["Staff Writer"], "date_download": "2020-05-04 21:07:08", "date_modify": "2020-05-04 21:07:08", "date_publish": "2018-09-12 23:00:00", "description": "A famous assertion regarding political realities during any election is: \"It’s the economy, stupid.\" Gov. Scott Walker is running for a third term touting Wisconsin’s economy under his...", "filename": "_71b6c5b1e9844b8f90c39c9276df9821_1588626428.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_71b6c5b1e9844b8f90c39c9276df9821_1588626428.html", "title": "Economy would be better without Scott Walker -- Mark Quinn", "title_page": "Economy would be better without Scott Walker -- Mark Quinn", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A famous assertion regarding political realities during any election is: “It’s the economy, stupid.”\nGov. Scott Walker is running for a third term touting Wisconsin’s economy under his tutelage. He is counting on our citizen’s perception that our economy is just humming along and everyone is benefiting from it. But a closer look displays a wide gap in wages and income growth between those Walker favors -- the wealthy, large corporations and mega farms -- and everyone else.\nOur average wages are 10 percent less than the national average, and our job growth rating fares poorly compared to our neighbors, and wage stagnation is more the rule here than elsewhere. Here’s just one example: Wisconsin resident earn $5,000 less and pay almost 50 percent more for health insurance than folks in Minnesota.\nThere are definite reasons you can point to explain this disparity. One is that Gov. Walker’s attempt to destroy the union movement here, both public and private. People living in stronger union states earn more. Also, Gov. Walker has refused to raise the minimum wage. Data shows that raising the minimum wage increases everyone’s wages.\nIf Gov. Walker had been more honest and less combative against workers, everyday workers would be earning more today.\nMark Quinn, Madison", "url": "https://apnews.com/71b6c5b1e9844b8f90c39c9276df9821"}