{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:12:04", "date_modify": "2020-05-04 20:12:04", "date_publish": "2018-07-26 02:25:35", "description": "RIDGEFIELD — The Board of Selectmen on Wednesday made recommendations for modifying suggested changes to the town’s charter, including keeping the Inland Wetlands board and Planning and Zoning...", "filename": "_99d184d6bab744a38f1c1d6289067fb8_1588623124.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_99d184d6bab744a38f1c1d6289067fb8_1588623124.html", "title": "Ridgefield Selectmen favor combined boards", "title_page": "Ridgefield Selectmen favor combined boards", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RIDGEFIELD — The Board of Selectmen on Wednesday made recommendations for modifying suggested changes to the town’s charter, including keeping the Inland Wetlands board and Planning and Zoning Commission combined.\nThe recommendations will return to the Charter Revision Commission, which created a draft report with proposed charter changes. The commission will then decide if they will accept any of the recommendations before returning the report to selectmen for a vote before it heads to voters in November.\nOn splitting the two panels, which was the most controversial of the proposals at a public hearing last week, three of the five selectmen voted to suggest keeping the boards combined.\nSelectman Bob Hebert said a letter from Beth Peyser, the town’s wetlands agent, citing Ridgefield’s ranking in protecting wetlands showed the current system, with the same nine people acting as both boards, is working.\n“There’s no documented reason that we need to issue a modification to the current structure,” Selectman Bob Hebert said. “We have a very good track record and I just don’t see a need to change this.”\nFirst Selectman Rudy Marconi said he thinks the proposal to separate the boards should head to voters, especially because wetlands issues are becoming more complicated. Selecwoman Barbara Manners said the boards should remain combined if, as the commission suggested, the new board would be elected. But the board should be separate if new members are appointed, Manners said.\nOther recommendations the selectmen chose included a proposal to appoint instead of elect make the town treasurer and tax collector.\nThey decided a rewrite of the charter’s Standards of Conduct article, which largely creates rules for elected officials and town employees, should be reviewed further. They voted to have the existing article stand until the town can create a new standard of conduct as an ordinance and pass it by a town meeting.\n“It’s the kind of thing that requires concentrated debate not part of a larger thing,” said David Groggins, the town attorney. “That would be my recommendation.”\nBy a 4-1 vote, the selectmen agreed with a proposed requirement for 2 percent of voters, or about 365 people, to make changes to the budget at the annual town meeting, where town and school budgets are discussed and sent to referendum.\nNow, any person who shows up can propose a change — to a line item of the town budget or to the total amount of the school budget — and it can be approved by the rest of the attendees, no matter the size of the group.\nSelectman Maureen Kozlark voted against the 2 percent requirement, contending a lower threshold, such as 1 percent, might be more realistic. She worried that creating an unrealistic requirement would discourange residents from attending because they feel they won’t be able to make changes.\nBut the four other selectmen voting in favor said the threshold might have the opposite affect and lead to more participation.\n“If you want to come and decrease a budget substantially…it shouldn’t be a handful of people that do that,” First Selectman Rudy Marconi said. “I think it’s a way of encouraging people to come out to vote. If you want to decrease the budget, get some people and come out and vote.”\naquinn@newstimes.com", "url": "https://apnews.com/99d184d6bab744a38f1c1d6289067fb8"}