{"authors": ["Dave Boyer The Washington Times"], "date_download": "2020-05-04 20:13:14", "date_modify": "2020-05-04 20:13:14", "date_publish": "2018-11-09 10:46:54", "description": "President Trump said Friday he hasn't spoken to acting Attorney General Matthew Whitaker about special counsel Robert Mueller's investigation into possible collusion with Russia. \"I didn't...", "filename": "_97cf1752210efd293f8f17d6cba5ff8e_1588623194.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_97cf1752210efd293f8f17d6cba5ff8e_1588623194.html", "title": "Donald Trump says he hasn't spoken to acting Attorney General about Mueller probe", "title_page": "Donald Trump says he hasn't spoken to acting Attorney General about Mueller probe", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Donald Trump says he hasn’t spoken to acting Attorney General about Mueller probe\nPresident Trump said Friday he hasn’t spoken to acting Attorney General Matthew Whitaker about special counsel Robert Mueller’s investigation into possible collusion with Russia.\n“I didn’t speak to Matt Whitaker about it. I don’t know Matt Whitaker,” said Mr. Trump, who promoted Mr. Whitaker Wednesday after firing Attorney General Jeff Sessions.\nMr. Whitaker, who was chief of staff to Mr. Sessions, has expressed skepticism previously about the Mueller probe.\nDemocrats have expressed concern that Mr. Trump didn’t tap Deputy Attorney General Rod Rosenstein, who has been overseeing the special counsel investigation, to the top temporary post. The president said critics are only objecting to Mr. Whitaker now because he appointed him.\n“This only comes up because anybody who works for me, they automatically do a number on,” he said. “He is a very smart man, a very respected man. I think he’ll do a very good job. His reputation is excellent. You didn’t have any problem for Matt Whitaker when he worked for Jeff Sessions.”\nThe president said he is also looking at “other people” to nominate for the permanent position of Attorney General, and will make a decision in the next few weeks.\n“I have some very, very good people,” he said. “There’s no rush. It has to go through a Senate [confirmation] process, which takes a long time. We’ll pick somebody that’s great.”\nAsked about former New Jersey Gov. Chris Christie, Mr. Trump said, “I like Chris Christie, but I have not talked to him about it. He’s a friend of mine. He’s a good man.”\nWhen a reporter asserted that Mr. Whitaker hasn’t gone through a Senate confirmation process, Mr. Trump fired back.\n“Neither has Mueller,” the president said. “Mueller is doing a report [on Russian meddling in the election]. He hasn’t gone through the Senate process.”\nMr. Trump noted that Mr. Whitaker was previously confirmed by the Senate as a U.S. Attorney in Iowa.\n“He was Senate-confirmed at the highest level,” he said. ”’A big complaint people have Mueller was not Senate-confirmed. Why didn’t they get him Senate-confirmed? He should have been Senate-confirmed. But because of all the conflicts [of interest], they didn’t want to bring him before the Senate. Don’t tell me about Whitaker, because Mueller was not Senate-confirmed.”\nIn 2001, the Senate confirmed Mr. Mueller unanimously as FBI director.", "url": "https://apnews.com/97cf1752210efd293f8f17d6cba5ff8e"}