{"authors": ["Eric Mark"], "date_download": "2020-05-04 20:11:49", "date_modify": "2020-05-04 20:11:49", "date_publish": "2018-09-12 00:00:00", "description": "Kathleen Thomas, a delivery driver for The Citizens’ Voice, will receive a prestigious award this month for quick thinking on the job that might have prevented serious injury or worse. Thomas...", "filename": "_80a7d5b45c2049e6ab6cebbe28dc8725_1588623109.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_80a7d5b45c2049e6ab6cebbe28dc8725_1588623109.html", "title": "Citizens’ Voice Delivery Driver To Receive Prestigious Award", "title_page": "Citizens’ Voice Delivery Driver To Receive Prestigious Award", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kathleen Thomas, a delivery driver for The Citizens’ Voice, will receive a prestigious award this month for quick thinking on the job that might have prevented serious injury or worse. Thomas called emergency dispatchers after she smelled gas outside a Lehman Twp. home on her delivery route in the dark, frigid early morning of Jan. 3. A gas pipe cracked in sub-zero cold, authorities later determined. Firefighters and utility workers arrived to shut off the gas and evacuate the home. Emergency responders credited Thomas for doing the right thing and doing it quickly. Now her peers in the newspaper circulation and delivery world will recognize her. Thomas recently learned she will receive the V.T. Curtis Citation Award from the International Circulation Managers Association. The award is bestowed upon newspaper carriers who perform an outstanding service to their fellow man while carrying out the duties of their newspaper route, according to the association’s website. Thomas on Tuesday said she is “just glad everything is OK” and that the resident of the house with the cracked gas pipe was not hurt. She said the resident called to thank her, and other people who read an article about the incident published in The Citizens’ Voice told her she did a good job. Thomas, in January and again on Tuesday, said it was all in a day’s work. Delivery drivers, who often work in the pre-dawn and early morning hours, perform tasks such as clearing limbs and branches from roadways, assisting stranded motorists and even helping to round up horses, she said. Thomas said she is not sure if she will travel to Pittsburgh to receive the award in person at the association’s annual conference next weekend. It is not easy to find someone to cover her challenging 92-mile delivery route, which stretches from Plymouth to Lehman and back again, she said. But challenges and all, Thomas said she plans to keep working for a long time. “The only thing I can say is I love my job,” she said. “You cant beat it. ... and I appreciate my customers. Without them I wouldn’t have a job.” Contact the writer: emark@citizensvoice.com 570-821-2117", "url": "https://apnews.com/80a7d5b45c2049e6ab6cebbe28dc8725"}