{"authors": ["Catarina Príncipe", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Francisco Louçã", "Tor Krever", "Dan Russell", "Mark Bergfeld"], "date_download": "2020-05-04 19:58:06", "date_modify": "2020-05-04 19:58:06", "date_publish": "2018-06-08 00:00:00", "description": null, "filename": "2018_06_portugal-left-bloc-socialist-party-austerity_1588622286.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/06/08170553/GettyImages-613597054.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_06_portugal-left-bloc-socialist-party-austerity_1588622286.html", "title": "The Portuguese Myth", "title_page": "The Portuguese Myth", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The contradiction is that while Portugal is known for having a left-wing government, it is not meaningfully an “anti-austerity” administration. A rhetoric of limiting poverty has come to replace any call to resist the austerity policies being imposed at the European level. Portugal is thus less a test case for a new left politics than a demonstration of the limits of government action in breaking through the austerity consensus.\nNor did the difference with Greece lie in the strength of Portugal’s economy. In fact, its state structure is even weaker than Greece’s, and its economy even more dependent on the European core, after the destruction of almost all productive sectors throughout four decades of European integration. This process was no different from what took place in Greece. Portugal was intended to serve as an example to the rest of Europe: it was meant to prove that austerity does work.\nFormer prime minister Pedro Passos Coelho liked to say that “Portugal is not Greece.” The truth in his slogan was not that austerity was any different in the two countries. Under the diktats imposed by the troika (the International Monetary Fund, the European Central Bank, and the European Commission) memorandum, unemployment and poverty skyrocketed, the labor market was further liberalized, there was a 35 percent tax hike across the board, banks were bailed out, and social services were underfunded. Hundreds of thousands of people emigrated from the country.\nIn this sense, it is fair to say that Portugal is not Greece. If Greece was to serve as an example of what happens to those who do not play by the rules, Portugal was meant to be an example of European success. And this political move, taking place amid a wider situation of economic recovery, allowed for the emergence of a new “center-left” in power — one that would not spearhead any serious resistance to the imposition of austerity measures.\nMoreover, in March 2018, the Portuguese government reached an agreement with the European Commission to keep the money spent in the recapitalization of the public bank Caixa Geral de Depósitos out of its accounts deficit. Despite that decision, the EU statistics agency Eurostat counted the Portuguese deficit at 3 percent, above the Budgetary Treaty limit and way above the government’s 0.9 percent forecast (which would have been the lowest deficit level ever ). Once again, the European Union showed its true face: it plays with figures as necessary, so long as this suits its political objectives — and so long as the political actors in the periphery are sticking to the rules imposed by the center.\nLater on in 2016, although the deficit level was above the limit imposed by the Fiscal Compact , the European Commission decided not to apply sanctions on Portugal and Spain. This was a political move designed not only to allow the Portuguese government some room of maneuver, but most importantly to prevent the rise of the Left in Spain in a scenario in which European-imposed austerity threatened to exacerbate the political crisis .\nPortugal asked for a bailout in 2011, one year after Greece, and from the beginning, it was treated as “ the good student .” “Portugal is not Greece” was repeated over and over again. And it’s true. From the end of 2014 the European Central Bank, through the Bank of Portugal, was allowed to buy Portuguese public debt bonds directly, in a form of quantitative easing. This had two positive outcomes: it lowered the interest rates on the debt, and a part of the interest rates paid by the Portuguese government could thus be paid to the Bank of Portugal, therefore re-injecting money into the Portuguese economy. The European institutions never allowed the Syriza-led government in Greece to resort to such quantitative easing.\nThe European Union, and Germany in particular, needed a positive narrative on the outcome of austerity measures . It would be politically disastrous for Merkel — who herself continued policies of wage dumping and social cuts — to allow for a scenario where austerity could only be implemented in a situation of extreme social and political crisis or — worse — to allow the possibility of a left-wing force overcoming austerity. Portugal’s malaise appeared as the best opportunity to prove that austerity could work, if implemented in a situation of low social mobilization and uncritical obedience to troika-imposed rules.\nDespite the huge popular mobilizations against austerity, the feeling of discontentment never translated into organized political parties. This reduced possibility for a left-wing insurgency in Portugal was another reason why this country could be used to set an example.\nIn Portugal, however, although three parties signed up to the memorandum — the conservative right-wing People’s Party (CDS-PP in its Portuguese acronym), the center-right Social Democratic Party (PSD), and the center-left Socialist Party (PS) — it was the right-wing coalition that governed the country during the four years Portugal spent under this agreement with the European institutions. This created a different political situation: the PS was seen as the opposition to harsh austerity, and the margin for the anti-austerity left parties to grow was much smaller than Syriza was able to exploit in Greece.\nThis process did not start with Pasok — in fact, around Europe over the last three decades, social-democratic parties often have imposed the harshest cuts, as in the case of German chancellor Gerhard Schröder’s Agenda 2010. But in Greece that process went furthest, with the steady disappearance of the traditional social-democratic party.\nTo understand Portugal’s present political situation, we need to understand another way it is “not Greece.” In 2010, upon the introduction of the memorandum in Greece, that country was ruled by the social-democratic Pasok. This drove so-called “Pasokification”: the erosion of traditional social democracy as it became a hollow, neoliberal force.\nThe Resurgence of Portuguese Social Liberalism\nThe October 2015 elections delivered a highly fragmented new parliament. While the right-wing parties, running as a coalition, obtained the majority of the votes, there was no party with an absolute majority. In the end, it was up to the Socialist Party (PS) to decide the future government after a right-wing government was rejected by a parliamentary majority.\nFor a month and a half, the PS was caught in sharp debates over what it should do. The two possibilities were either to join the right wing as a junior partner in a coalition government (which would have been an unprecedented choice in a country with no history of grand coalitions), or take up the challenge made by the Left and negotiate a government with its support. Contrary to most expectations, the PS made the latter decision.\nIn hindsight, this was a smart tactical move: in a climate of slow but steady economic recovery at the European and national level, it allowed the PS to use the breathing space to its own advantage, with the introduction of austerity-lite policies. At the same time, it was the perfect moment to co-opt the Left into a very difficult situation of supporting a government that would never be meaningfully anti-austerity or adopt the Left’s own demands.\nThe PS did not imagine an agreement with the Left as the likely outcome of the general election. The party instead dreamed that the elections would allow its own glorious march to power, as the people rejected the right-wing government’s austerity measures. In fact the party fell far short of securing a majority by itself. The Paf — the PSD in coalition with the CDS-PP — got 38.5 percent and the PS only 32.3 percent.\nThe election’s silver lining came to the left of social democracy. Left Bloc and the CDU (the coalition between the Communist Party and the Greens) won 10.2 and 8.2 percent, respectively. For Left Bloc, which garnered more than half a million votes, this was their highest vote tally ever. Although the right-wing champions of austerity retained control of parliament, almost 20 percent of the new assembly was occupied by representatives who explicitly opposed not just austerity but capitalism altogether. While the PCP’s result was not surprising, both parties’ combined results created an unprecedented situation in modern Portuguese politics that showed how clearly crisis polarizes politics.\nIn the final exchanges of one of the preelection debates, the Left Bloc’s spokesperson, Catarina Martins, surprised the PS’s António Costa by challenging him to discuss a left government after the election, on the condition that he give up some of his program’s more neoliberal policies. The challenge remained unanswered. So the same PS that had started out dismissing the Left Bloc’s proposals as unrealistic — joining the Right in arguing that they would lead the country to a “Syriza nightmare” — ended up with a cowed silence.\nThe three main conditions the Left Bloc placed on the PS, in exchange for supporting a minority government, were: 1) an end to the pensions freeze, 2) no further lowering of the Single Social Tax workers and employers pay into social security, and 3) an end to the liberalization of the labor market. Accepting these three points would force the PS to change its political and economic platform.\nThis was a smart tactic: it forced the PS to define itself politically and to clarify its loyalties. But it was based on three premises that later proved incorrect: 1) that the PS would win the elections, 2) that Left Bloc would receive a low percentage of the vote, and 3) that the PS would refuse to negotiate with the Left.\nThe ambiguous election result forced a series of coalition negotiations. The Left Bloc’s outstanding result, and the active role it had taken in offering the PS baseline terms for an agreement, pushed it to the fore in these negotiations. The Left Bloc, the Communist PCP, and the Greens (who always run in coalition with the PCP) were all forced to take a position on the new government.\nThe negotiation process was complex, full of tense moments, and mostly took place behind closed doors. The three left parties each negotiated the agreement with the Socialist Party separately — a problematic decision since it gave all the information to the PS while the left parties did not communicate among themselves or advance common proposals.\nAfter more than a month, the Left Bloc and the CDU (the electoral coalition of the PCP and the Greens) negotiated agreements with the PS in which they pledged to vote in favor of the budget and various other laws. On November 26, 2015, a PS government was thus able to take office with the left parties’ parliamentary support.\nThe agreement allowed the left-wing parties to vote against some of the government’s measures, since they are not subject to the same discipline as in a real coalition. They insisted that this was not their government and that it wouldn’t solve the country’s fundamental problems, at the same time as they tried to answer the popular hopes of an end to the most damaging austerity measures.\nHowever, while the agreement stipulated the formation of a government for one year only, to be followed by fresh negotiations, in truth the text of the agreements remains the baseline for all of these parties’ discussions of each state budget. Given its evident unwieldy aspects, one right-wing politician ridiculed the new government by calling it the Contraption — Geringonça in Portuguese — a term that became widespread and is today widely used even by those who critically support this solution.\nThe agreement also met with a degree of resistance, at both the national and European levels. Within the PS, the former party secretary aggressively attacked the new, slightly more left-wing, party leadership. At the European level, there were clearly different understandings of the situation across the various political families. The parties and representatives of the Socialist International did tend to support this solution. But German finance minister Wolfgang Schäuble was critical and skeptical of the new government.\nAn important phase of the agreement was the “calming” of the European institutions — the PS had to guarantee that Portugal’s relations with Europe (the Eurozone, the ECB, the Treaties, the debt) — would not be changed by its own agreement with the Left. The PS could only proceed once it had received this green light from the European institutions.\nAlthough this agreement has put a stop to the process of mass impoverishment (which was the government’s real aim, rather than overcoming austerity as such), it would be naïve to suggest that all this has set Portugal on the path to economic recovery. Reports from liberal outlets like the Financial Times praise the new Portuguese miracle as an economic rebound owing to a new left government that has reduced the budget deficit to just 2%= percent. However, if we are to seriously engage in this discussion, we must separate fact from fiction, and understand what is actually happening to the Portuguese economy.\nFirst, it is important to understand that in periods of crisis, budget deficits tend to grow: there is less economic activity, less revenue, and more state expenditure (on social protection, unemployment benefits, and bailing out of banks). Austerity supposedly corrects this deficit growth by cutting state investment and expenditure (on social matters, that is — spending on the financial sector continues apace) and raising taxes in order to bring in more tax revenue.\nYet far from being a solution, austerity aggravates the problem, creating a vicious cycle of lower wages, lower consumption, tax hikes, and rising public debt. But Portugal has in fact gained some breathing space, liberating it from this process.\nWhile during the memorandum years the Portuguese budget deficit was slowly but steadily decreasing, the EU predicted a 2.7 percent deficit for 2016, above the limit imposed by the Budgetary Treaty. The Portuguese government’s own forecast for the 2016 deficit was 2.2 percent, but the final figure was actually 2 percent — the lowest budget deficit in the last forty years. It now expects the deficit to fall to 0.9 percent (excluding expenditure on recapitalizing the public bank). The numbers seem to indicate a sharp change of economic policy. But is this really the case?\nThe simple answer is no, though there are also some complicating factors. This government’s three state budgets thus far have not aimed to reverse austerity, but to limit it: hence the shift toward talking about stopping “impoverishment.” The fact that austerity is no longer so harsh has allowed for a very small income rebound (mainly for public sector workers and pensioners), which has slowly started to rebuild a dismantled middle class.\nThe other factors that explain the fall in the deficit were the huge rise in tourist numbers (and the short-term economic dynamics that such a boost creates), the fall in the price of oil (a decisive factor for an economy heavily dependent on imports), and — most importantly — a shift away from the narrative that “There Is No Alternative” to austerity.\nCrisis and austerity produce fear and conservatism at the level of consumption as well. When a government is able to secure a measure of breathing room and achieve a small income rebound, it can also shift the narrative toward optimistic claims that “austerity is over and everything will be better from now on.” This also allows a shift in consumption patterns, as people are less afraid to spend, or buy, or take out credit. This, in turn, helps feed recovery.\nPortugal went through a period of deep recession. Such periods see a lot of productive capacity underutilized because there is no market for it. But the rise in internal consumption (by domestic and especially foreign consumers) makes it possible to produce more than during the recession period, even without there being any sort of new investment. Public investment has been at a historic low since the beginning of this government, with no structural changes in the country’s productive capacity and only a very small level of private investment. However, there has been economic growth.\nThis is no miracle: it is the combination of internal factors (small income growth, a shift of the narrative around austerity and, therefore, in consumption patterns) and most importantly, external political factors. Not only do part of the European institutions support this government, but the country has also benefited from the political crisis in the Middle East, in the sense that it has driven a fall in the price of oil (an important factor for an import-based economy) and pushed tourism away from this region in favor of destinations like Portugal.\nIf we look closely, we can see other problems with this government. The troika labor laws were left untouched, collective bargaining has almost vanished, and precarity is on the rise. A study by the Observatório das Desigualdades places the real unemployment rate at 17.5 percent — much less than the 28 percent in 2013 but far above the official government numbers (8.5 percent). Almost all the new jobs that have been created are precarious. Public services are crumbling: both health and education are heavily underfunded and on the verge of collapse. The Portuguese banking system is a ticking time bomb, with more banks bailed out with public money but not under public control, leaving it more vulnerable to shifts at the European center than in 2008. The central question of the debt has in fact disappeared from public debate.\nNonetheless, the Portuguese finance minister, Mário Centeno, whom the European commissioner for fconomic and financial affairs, Pierre Moscovici, labelled the “Ronaldo of Portuguese finance,” was elected as president of the Eurogroup. This is a smart symbolic move, not only to show the PS’s counterparts what the revitalization of European social democracy could look like, but also as praise for the “good student” in the periphery who obeyed the center’s rules. Tactically, the PS played this game well: not only did the party secure its best-ever results in the 2017 local elections, but it is polling close to an absolute majority for the 2019 general election.", "url": "https://jacobinmag.com/2018/06/portugal-left-bloc-socialist-party-austerity"}