{"authors": ["Todd Von Kampen Todd.Vonkampen Nptelegraph.Com"], "date_download": "2020-05-04 20:19:47", "date_modify": "2020-05-04 20:19:47", "date_publish": "2018-12-19 09:00:00", "description": "North Platte City Council members bid official farewell to departing Councilman Brook Baker Tuesday night after unanimously re-electing his Ward 1 council colleague Jim Nisley as their president...", "filename": "_04e7f94432c441f5b491803f739df520_1588623587.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_04e7f94432c441f5b491803f739df520_1588623587.html", "title": "City Council bids farewell to Brook Baker", "title_page": "City Council bids farewell to Brook Baker", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "North Platte City Council members bid official farewell to departing Councilman Brook Baker Tuesday night after unanimously re-electing his Ward 1 council colleague Jim Nisley as their president for 2019.\nMayor Dwight Livingston presented his third thank-you plaque for council service this month to Baker, who has purchased a new home outside the city limits. Baker’s resignation, announced after the Nov. 6 general election, will take effect Dec. 31 with two years left in his second four-year term.\n“It’s been a fun six years,” Baker said to applause from his colleagues and city officials in the council chambers.\nLivingston said he hopes to name Baker’s successor, whom council members must confirm, by the time the council holds its first 2019 meeting on Jan. 2. Ward 1 residents interested in taking Baker’s place should call the Mayor’s/City Administrator’s Office at 308-535-8515, he said.\n“I have spoken to several people thus far” since Baker announced his plans to resign, the mayor said.\nNisley, a retired lawyer, was re-elected without opposition last month to his second term as Ward 1’s other councilman. Baker’s successor will be only two meetings behind Councilmen Ty Lucas in Ward 2 and Ed Rieker in Ward 4, who respectively replaced Larry Pedersen and Martin Steinbeck on Dec. 4. Ward 3 Councilman Jim Carman also was re-elected in November.\nAs 2018 council president, Nisley said, he presided over one council meeting in Livingston’s absence and filled in for the mayor at a handful of public functions. Baker’s last motion as a councilman was to nominate Nisley for re-election. No other candidates were nominated.\n“The other people here are probably more worthy than I,” Nisley said after the vote. But “it truly is an honor. It really is.”\nThe council disposed of its last regular agenda for 2018 in 10 minutes, with Nisley’s re-election and all other items approved on 7-0 votes. Councilman Lawrence Ostendorf was absent.\nTheir actions included:\n» Approval of the 10th of 12 low-income homeowners who will receive grants or forgivable loans for rehabilitation of their homes under a 2016 Community Development Block Grant.\n» Renewal through June 2023 of the city’s contract to provide fire protection services within the North Platte Fire Protection District.\n» Acceptance of a $194,102 bid from Altec Industries Inc. for a new 65-foot aerial “cherry picker” for the Electric Department in place of a 2009 Altec model. The purchase was approved as part of the council’s consent agenda.", "url": "https://apnews.com/04e7f94432c441f5b491803f739df520"}