{"authors": ["Bill Cummings"], "date_download": "2020-05-04 20:17:32", "date_modify": "2020-05-04 20:17:32", "date_publish": "2018-12-29 00:57:27", "description": "Connecticut has entered into a landmark agreement with neighboring states to help battle climate change and reduce auto emissions by creating a new system to fund regional transportation...", "filename": "_eda6ebaa68844e3bbaeec559966d5e13_1588623452.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eda6ebaa68844e3bbaeec559966d5e13_1588623452.html", "title": "Conn. joins multi-state pact to tax auto emissions", "title_page": "Conn. joins multi-state pact to tax auto emissions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Connecticut has entered into a landmark agreement with neighboring states to help battle climate change and reduce auto emissions by creating a new system to fund regional transportation improvements.\nThe nine states and Washington D.C. pledged to spend the next year developing a cap-and-invest system in which the worst pollution emitters will pay into a pool that’s used to lower overall emissions.\n“Do not be fooled by the climate change deniers in Washington, climate change is real and if we do not take significant action now to reduce carbon emissions the harm to our economy, communities and the planet will be irrevocable,” said outgoing Gov. Dannel P. Malloy.\nClaire Coleman, a climate and energy attorney for the Connecticut Fund for the Environment, said the regional approach established by the Transportation & Climate Initiative is a good way to lessen climate change.\n“Transportation is the largest contributor of emissions in Connecticut, and pollutants from dirty cars hurt our residents — especially those in low-income communities,” Coleman said.\nThe states — Connecticut, Rhode Island, Delaware, Virginia, Massachusetts, Maryland, New Jersey, Pennsylvania and Vermont — agreed to create caps on transportation related emissions and require fuel distributors to buy pollution permits for the carbon they produce.\nNew York and Maine are also expected to join the initiative; it’s not yet clear if New Hampshire will also join.\nThe initiative runs counter to President Donald Trump’s stance on climate change and auto emissions. Trump has questioned whether climate change science is accurate and proposed relaxing auto emission standards nationwide, a move being opposed by Connecticut and other states.\nLimits and fees\nThe multistate agreement is expected to result in a program similar to the Regional Greenhouse Gas Initiative, a nine-state cap-and-invest system for power plant emissions.\nSince 2005, the RGGI has lowered power plant emissions by about 40 percent by requiring companies to pay a fee if they exceed emission limits. That money is used to help fund carbon-free projects such as solar and wind power and upgrades at existing power plants.\nApplying the concept to auto and transportation emissions could increase costs to motorists by an average of about $6 a month, some experts believe.\nThe states would use the revenue to help fund a variety of transportation projects, including infrastructure for electric vehicles, expanding public transit, carpooling, driverless cars and bike lanes.\n“A cap-and-invest program could unleash billions of dollars to deliver the overdue improvements this region needs,” said Jordan Stutt, carbon programs director for the Acadia Center, an environmental advocacy group based in Boston, which is active in Connecticut.\nA spokesman for Gov-elect Ned Lamont did not respond to a request for comment on the initiative. Lamont so far has been supportive of Malloy’s environmental moves and is expected to deploy similar policies. His transition group on environment issues called for Connecticut to take the lead in regional carbon-pricing programs and said in its report, “Climate change is the most pressing issue of our time.”\nBruce Ho, a senior advocate for the Natural Resources Defense Council, said transportation emissions are key to combatting climate change.\n“This commitment from Northeast and Mid-Atlantic states to transform and modernize our aging transportation — from cleaner cars and trucks to more efficient buses, trains, and walkable and bikeable communities — will make us safer and healthier and help meet the transportation needs of all residents,” Ho said.\nClean energy\nMalloy announced last week that the state accepted new bids from the Millstone Nuclear Plant to directly sell carbon-free electricity to the state’s electric distributors. A bid from the Seabrook nuclear plant in New Hampshire was also accepted.\nMillstone has sought higher priced, clean energy contracts for some time, arguing that the low price it now receives from the commodities market threatens the long-term survival of the facility.\nColeman said the Connecticut Fund for the Environment is “disappointed” the clean energy projects selected by the state are dominated by nuclear plants.\n“The future is off-shore wind, solar, geothermal and smart strategies for efficiency and energy storage — but the small investments in these newer resources compared to the heavy investment in nuclear largely don’t reflect that,” Coleman said.\nRob Klee, outgoing commissioner of the state Department of Energy and Environmental Protection, defended the decision by stressing the future of Millstone is at stake.\n“We agreed with [electric regulators] that the Millstone nuclear facility is at risk of early retirement,” Klee said. “We remain committed to keeping this valuable zero-carbon resource, provided that it is affordable.”\nDEEP has directed Eversource and United Illuminating to negotiate a price with Millstone that reflects a “reasonable rate of return” for its owner, Dominion Energy.\nbcummings@ctpost.com", "url": "https://apnews.com/eda6ebaa68844e3bbaeec559966d5e13"}