{"authors": ["State Journal Staff"], "date_download": "2020-05-04 20:20:53", "date_modify": "2020-05-04 20:20:53", "date_publish": "2018-04-01 04:30:00", "description": "Charlie Ellenbecker won the 3,200 meters in 9 minutes, 55.11 seconds as the Monona Grove boys track and field team scored victories in five events to win the title in the small-schools division of...", "filename": "_e54eb3f9c7414ec6a4ab2f7cf38f7710_1588623653.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e54eb3f9c7414ec6a4ab2f7cf38f7710_1588623653.html", "title": "Monona Grove wins team title at Madison West Relays", "title_page": "Monona Grove wins team title at Madison West Relays", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Charlie Ellenbecker won the 3,200 meters in 9 minutes, 55.11 seconds as the Monona Grove boys track and field team scored victories in five events to win the title in the small-schools division of the Madison West Relays at Camp Randall Memorial Sports Center on Saturday.\nBrett Clevidence won the 55-meter hurdles (:7.84), Anthony Ellis-Krehl won the high jump (5 feet, 10 inches), Michael Williams-Davis the shot put (52-10½) and the Silver Eagles’ 1,600 relay team was victorious in 3:35.04.\nMonona Grove finished with 96 points, 25½ ahead of second-place La Crosse Logan.\nJordan Montgomery won the 55 meters (:6.79) for Monroe.\nCambridge received victories from Spencer DeForest in the 200 (:23.26) and Riley Olson in the 400 (:53.27).\nIn the large-schools division, Waunakee’s L.O. Johnson raced to the 55-meter title in 6.51 seconds, Madison East’s Max Loetscher won the 3,200 (9:43.11) and Verona’s Max Herkert won the pole vault (13-0).\nHartland Arrowhead won the final race of the day, the 1,600 relay, to finish with 74 points and edge Wauwatosa East (72) for the title. Madison West was the top area finisher in 10th with 24 points.\nWatertown Invitational\nSophomore Collin Schulz won the high jump (6-4) and was part of the winning 640 relay (1:21.68) to help the Lakeside Lutheran boys win the nine-team event.\nBeaver Dam’s Kyle Gabel won the long jump (20-9¼) and the 55 hurdles (:8.59).\nIn the girls meet, Daijah Bolden won the 55 hurdles (:9.76) and 200 hurdles (:33.53), and Kylie Jacobs won the 200 (:28.36) and finished second in the 55 to help lift Watertown to the team title.\nRacine Case Classic\nBeloit Memorial’s Amaurii Grosskopf won the shot put with a distance of 52 feet and Leeland Crum placed second in the pole vault (10-6) as the Purple Knights finished eighth in the 15-team meet.", "url": "https://apnews.com/e54eb3f9c7414ec6a4ab2f7cf38f7710"}