{"authors": ["Jon Masson", "Wisconsin State Journal"], "date_download": "2020-05-04 20:06:39", "date_modify": "2020-05-04 20:06:39", "date_publish": "2018-01-04 22:00:00", "description": "The first Badger Conference Girls Basketball Challenge is scheduled for Jan. 12 and 13 at Stoughton High School. Game times on Friday, Jan. 12, will be 6 p.m. and 7:30 p.m. Game times on...", "filename": "_b7225807d9544cbd8c33b189412c10f4_1588622799.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b7225807d9544cbd8c33b189412c10f4_1588622799.html", "title": "Prep girls basketball: Inaugural Badger Conference Challenge on the horizon", "title_page": "Prep girls basketball: Inaugural Badger Conference Challenge on the horizon", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The first Badger Conference Girls Basketball Challenge is scheduled for Jan. 12 and 13 at Stoughton High School.\nGame times on Friday, Jan. 12, will be 6 p.m. and 7:30 p.m. Game times on Saturday, Jan. 13, will be 10:30 a.m. (JV/JV2), noon, 1:30 p.m., 3 p.m., 4:30 p.m., 6 p.m. and 7:30 p.m.\nThe first-place game will be at 7:30 p.m. Jan. 13.\nPairings based on standings in the Badger South Conference and Badger North Conference are scheduled to be announced this Saturday.\nIt is likely Beaver Dam, the current Badger North Conference leader and top-ranked in Division 2 in the WisSports.net state coaches’ rankings, and Monroe, the current Badger South leader and No. 2 in Division 2, will meet in the first-place game at the Badger Challenge.\nVarsity games will be played in Stoughton’s main gymnasium. JV2 and JV games will be played in the Field House.\nThe Badger South teams will be the home teams.\nAdmission will be $5 per day, with wrist bands issues Saturday.\nA percentage of the revenue is scheduled to be donated to a charitable organization announced at the event.\nThe Badger Conference has held a similar challenge for boys and added the girls challenge starting this season.\nThe boys challenge is scheduled this season for Oregon High School and will be a week after the girls’ event.", "url": "https://apnews.com/b7225807d9544cbd8c33b189412c10f4"}