{"authors": ["Bill Beckner Jr."], "date_download": "2020-05-04 20:13:18", "date_modify": "2020-05-04 20:13:18", "date_publish": "2018-03-26 14:57:46", "description": "Alverton's Brandon Stone had narrowed his list of potential college destinations to four schools, and Pitt was one of them. Emphasis on was. With the firing of coach Kevin Stallings,...", "filename": "_9eb25cf426cd48719175861b5eb57077_1588623198.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9eb25cf426cd48719175861b5eb57077_1588623198.html", "title": "With Pitt offer gone, Southmoreland's Stone re-examines options", "title_page": "With Pitt offer gone, Southmoreland's Stone re-examines options", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Alverton’s Brandon Stone had narrowed his list of potential college destinations to four schools, and Pitt was one of them.\nEmphasis on was.\nWith the firing of coach Kevin Stallings, Stone said he no longer has a scholarship offer from the Panthers, so he is ruling them out, leaving Penn State, Duquesne and South Carolina as his top choices.\nThe “stretch four” is down to three, but don’t hold him to that.\nA new option has entered the picture.\nThe versatile, 6-foot-11 swing forward could go from high school, to prep school, to ... an academy before finally playing college basketball.\nStone, the former Southmoreland standout who is at Christ School in Arden, N.C., is considering attending IMG Academy or the SPIRE Institute, sports-performance training schools that often are home to postgraduate athletes for a year before they reach college.\nIMG, a boarding school and “sport-training destination,” is located in Bradenton, Fla. SPIRE is in Geneva, Ohio.\nStone still can “reclassify” and graduate as part of the 2019 class. He said that depends on which college he chooses. Penn State, for instance, wants Stone to wait one more year, he said.\nDuquesne, Stone said, would take him after this school year.\nWhile he has a top three, Stone clearly still has not sealed the door shut on his options. He had, at one time, 15 Division I offers, including from Kansas State, Houston, Virginia and St. Joseph’s.\n“I am going to play another year of AAU (for ITPS) and see how that goes and see what other schools might still be interested,” he said. “I might meet with the South Carolina coach, Frank Martin, after the Final Four.\n“Vanderbilt, Tulsa and some others also have been interested.\n“My whole recruiting process has been messed up the last couple of months. I want to get things straightened out and get ready to make my decision.”\nStone, who has bulked up and sharpened his all-around skills playing against college-level talent, said he will not return to Christ School.\n“I am definitely going to be somewhere else next year,” he said. “I hope to make my decision by the end of April. I can tell you this: I want to play (in the NCAA Tournament). I want to make a Final Four and win a national championship.”\nStone was a Carolina Athletic Association all-conference selection this season.\nHe averaged 15 points and 11 rebounds for the Greenies (23-13).\nStone will play in the ITPS #CancerSucks Charity Classic on Saturday at Chatham.\nBill Beckner Jr. is a Tribune-Review staff writer. Reach him at bbeckner@tribweb.com or via Twitter @BillBeckner.", "url": "https://apnews.com/9eb25cf426cd48719175861b5eb57077"}