{"authors": ["Dr. Carmen Piccolo Mcleod Vascular Surgeon"], "date_download": "2020-05-04 20:17:06", "date_modify": "2020-05-04 20:17:06", "date_publish": "2018-01-08 17:15:00", "description": "Stroke, a leading cause of serious, long-term disability in the United States, ranks as the fifth leading cause of death in South Carolina. In an effort to decrease the risk of stroke for...", "filename": "_ee5931919b404954abd2283c18fad282_1588623426.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ee5931919b404954abd2283c18fad282_1588623426.html", "title": "Carotid surgery: Reversing the blood flow for stroke protection", "title_page": "Carotid surgery: Reversing the blood flow for stroke protection", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Stroke, a leading cause of serious, long-term disability in the United States, ranks as the fifth leading cause of death in South Carolina.\nIn an effort to decrease the risk of stroke for patients who might not be a candidate for other stroke treatments, McLeod offers a new minimally invasive procedure to treat carotid artery disease.\nThe carotid arteries, the main arteries to the brain, carry blood flow on each side of the neck up into the brain. Their function is to provide oxygen.\nOver time, some people develop problems with the arteries to their brain in the form of blockages as plaque builds up in the walls of their carotid arteries. This plaque consists of cholesterol, calcium and fibrous tissue.\nAs the plaque increases, the arteries narrow and eventually the buildup of plaque reduces the blood flow through the arteries. If those blockages get severe enough, they can cause a stroke.\nIschemic strokes account for 80 to 90 percent of strokes, with an estimated 20 to 30 percent caused by disease in the carotid arteries.\nCarotid artery disease is a serious issue, because blood clots can form on the plaque, and if a clot or a piece of plaque breaks loose and travels to the brain, it can block the blood flow to that portion of the brain.\nCarotid endarterectomy is a procedure performed by a vascular surgeon to treat carotid artery disease. During this procedure, the vascular surgeon exposes the carotid artery through an incision on the side of the neck. The artery, after being clamped on both sides of the blockage, is then opened to access the plaque. The plaque is removed from inside the artery and the artery then sewn back together.\nThis is an effective treatment for decreasing the risk of stroke. However, some patients have medical conditions that place them at high risk for carotid endarterectomy.\nFor these patients, a new procedure called transcarotid arterial revascularization (TCAR) is now available. During the procedure, the surgeon makes a very small, one-inch incision just above the collarbone to gain access to the blocked artery while the patient is under local anesthesia. TCAR is a more viable option for patients who have medical conditions that would prohibit them from undergoing an open procedure like the carotid endarterectomy.\nTo divert any dangerous debris that might break loose during the procedure, the blood flow in the carotid artery is temporarily reversed. A soft, flexible tube, placed directly into the carotid artery, connects to a filter system that directs the blood flow away from the brain and captures fragments of plaque that might come loose during the procedure. The blood is filtered and returned through a second tube placed in the patient’s thigh.\nThis filter system also allows stenting to be performed to clear the blockage in the carotid during the blood-flow-reversal process. A stent, a tiny mesh wire tube, implanted inside the carotid artery, stabilizes the blocked area. The stent stays in the artery permanently to hold the artery open. After securing the stent, the filter system is removed and blood flow to the brain resumes its normal direction.\nRecovery time for this procedure is short, since the incision is so small and generally is done with minimal anesthesia. The procedure requires an overnight stay in the hospital, and most patients return to their normal activities within a week.\nAfter the TCAR technology underwent testing and clinical trials, the results were so powerful that the FDA approved and released it to programs such as the McLeod Heart and Vascular Institute, which has an established Carotid Stenting Program and serves as a member of the Vascular Quality Initiative for South Carolina. Being part of a quality initiative means McLeod compares the results of all of its vascular cases with its peers both regionally and nationally. The first class of surgeons in South Carolina to complete the FDA training were from McLeod.\nDr. Carmen Piccolo is a board-certified vascular surgeon. He cares for patients at McLeod Vascular Associates along with Dr. Eva Rzucidlo and Dr. Gabor Winkler, who also are vascular surgeons.", "url": "https://apnews.com/ee5931919b404954abd2283c18fad282"}