{"authors": ["Christian Wihtol"], "date_download": "2020-05-04 20:06:59", "date_modify": "2020-05-04 20:06:59", "date_publish": "2018-02-19 08:00:00", "description": "In its ongoing effort to get Lane County business owners to report the taxes they owe on personal property, the Lane County Assessor’s Office is holding a workshop on the matter. The free...", "filename": "_278b547c084546a3acbcaa67de22822c_1588622819.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_278b547c084546a3acbcaa67de22822c_1588622819.html", "title": "Seminar to help business tax filers", "title_page": "Seminar to help business tax filers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In its ongoing effort to get Lane County business owners to report the taxes they owe on personal property, the Lane County Assessor’s Office is holding a workshop on the matter.\nThe free workshop, on Thursday, is for business owners and those responsible for business bookkeeping.\nThe topics will include who is responsible for filing a personal property tax return, how to file, the timeline for filing, the penalties for late filing and the consequences of not filing.\nImmediately after the workshop, coaching sessions with a personal property specialist will be available.\nBusiness owners owe personal property tax — at the same tax rate as the tax on real estate — on such items as computers, desks, chairs, bookshelves, artwork and other movable items used in the business.\nMachinery and other fixed-in-place equipment is taxed separately.\nAbout 10,000 Lane County business owners file personal property tax returns each year, Lane County Assessor Mike Cowles said.\nSome businesses may not file the return, most likely because they are unaware they need to, Cowles said.\nA typical Lane County business owner has perhaps $50,000 to $75,000 worth of personal property subject to the tax, and pays a couple of thousand dollars a year in personal property tax, Cowles said.\nThe tax is applied only if a business’s personal property has a market value of more than $17,000.\nIn the current tax year, the county will take in about $12.2 million in personal property taxes, Cowles said.\nThat’s a fraction of the roughly $550 million in total annual Lane County property tax receipts.\nThe workshop is “just to make everyone aware of what their obligation is,” Cowles said.\n“There may be new businesses that don’t know about (the personal property tax), or existing businesses who did not know,” he said.\nThe penalty for failing to file a personal property tax return goes up the longer a business delays.\nThe penalty is an amount equal to 5 percent of the tax owed if the return is filed after March 15 but before June 1. Then it increases to 25 percent of tax owed before Aug. 1, and after that to 50 percent of tax owed.\nFollow Christian Wihtol on Twitter @ChristianWihtol . Email christian.wihtol@registerguard.com .", "url": "https://apnews.com/278b547c084546a3acbcaa67de22822c"}