{"authors": ["Grant Traylor The Herald-Dispatch"], "date_download": "2020-05-04 20:03:56", "date_modify": "2020-05-04 20:03:56", "date_publish": "2018-03-11 05:01:00", "description": "HUNTINGTON - As time goes on, it seems like life gets busier and there are fewer opportunities for Tri-State residents to take care of their wellness from a mental and physical...", "filename": "_67ecd6c4b4da40259d5862bb1789071e_1588622636.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_67ecd6c4b4da40259d5862bb1789071e_1588622636.html", "title": "Tri-State boasts several spots to practice yoga", "title_page": "Tri-State boasts several spots to practice yoga", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON - As time goes on, it seems like life gets busier and there are fewer opportunities for Tri-State residents to take care of their wellness from a mental and physical standpoint.\nThat is why yoga has taken off as an integral tool to combat the stresses on the body, mind and soul of daily rigors in life.\nYoga is a beneficial exercise that helps both body and mind by building strength through the use of exercises and postures that promote well-being.\nOver the past few years, the interest in yoga has grown to the point where many wellness centers specializing in the practice have opened.\nHere is a look at some of those businesses that offer yoga services to their patrons:\nBrown Dog Yoga\nAddress: 210 11th St., Huntington.\nOwner: Katrina Mailloux.\nPhone: 681-204-3968.\nServices offered: Yoga, BDY Cycle, BDY Barre, BDY Fusion, Cycle Yoga, Cycle Fusion, Cycle Barre, meditation, wellness workshops.\nWebsite: http://www.browndogyoga.com.\nNotable words: “Our mantra is ‘Unleash Your Inner Calm.’ ... The best investment you can make is in yourself.”\nStudio 8 Yoga\nAddress: 803 8th Ave., Huntington, or 1001 Peyton St., Barboursville.\nOwner: Joan St. Clair.\nPhone: 304-634-0949.\nE-mail: studio8wv@gmail.com.\nServices offered: Hatha yoga, massage therapy, meditation, Tai Chi, nutrition education, stress-reduction and relationship coaching, educational workshops, kids’ classes.\nWebsite: http://www.studio8wv.com.\nNotable words: “Our mission is to cultivate health and mindfulness at the individual level in order to create wellness within the community by embracing and sharing the philosophy of yoga - treating yourself and others with respect.”\nHuntington YMCA\nAddress: 935 10th Ave., Huntington.\nExecutive director: Brian Byrd.\nPhone: 304-525-8127.\nServices offered: Yoga, personal training, Pilates, water aerobics, spinning, youth sports programs and instruction.\nWebsite: http://www.huntingtonymca.org.\nNotable words: “Throughout the Huntington Y, we try to live, teach and portray the four core values of the Y, which are Honesty, Respect, Caring and Responsibility.”\nThe Space on 8th\nAddress: 919 8th St., Huntington.\nOwner: Randi Lynn Greene.\nPhone: 724-875-4326.\nE-mail: RLGFitnessStudio@gmail.com.\nServices offered: Call for details.\nWebsite: http://www.rlgfitness.com.\nNotable words: “It’s my hope that I will be able to encourage others to move their body in a way that feels good to them. I believe in living a life of balance and hope to set the example of how you can live a healthy lifestyle without completely giving up the things you love.”\nJenn Brooks Yoga\nAddress: 947 Main St., Barboursville.\nOwner: Jenn Brooks.\nPhone: 304-638-9608.\nE-mail: huntingtonyoga@gmail.com.\nServices offered: Gentle beginner yoga series (joint limitations), beginner yoga series (no physical limitations, just beginning), Level I, Levi I+, Level II, Restorative.\nWebsite: http:www.jennbrooksyoga.com.\nNotable words: “Stay with the uncomfortableness, the pain. Allow the fiery transformation.”\nPeacetree Center\nAddress: 5930 Mahood Dr., Huntington.\nOwner: Katrina Jefferson.\nPhone: 304-955-5111.\nServices offered: Yoga, massage therapy, essential oils, meditation, functional medicine, nutritional assessment, therapy, workshops.\nWebsite: http://www.peacetreecenter.com.\nNotable words: “Our center is a growing wellness development and training center. It is designed to connect individuals, families and communities to activities that support our mission and vision of peace, wellness and hope.”", "url": "https://apnews.com/67ecd6c4b4da40259d5862bb1789071e"}