{"authors": ["Mike Dougherty", "Life Postbulletin.Com"], "date_download": "2020-05-04 20:23:41", "date_modify": "2020-05-04 20:23:41", "date_publish": "2018-11-09 10:00:00", "description": "The lovely use of words evolves over time. But when was a word first used and how? I've got a site. Old words Merriam-Webster, the dictionary folks, have a great site that my long ago...", "filename": "_d2b4e62b8a7b476b85d9616c5821dbcb_1588623821.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d2b4e62b8a7b476b85d9616c5821dbcb_1588623821.html", "title": "Digital Mike: History of words stands the test of time", "title_page": "Digital Mike: History of words stands the test of time", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The lovely use of words evolves over time. But when was a word first used and how? I’ve got a site.\nOld words\nMerriam-Webster, the dictionary folks, have a great site that my long ago co-worker Jack Erwin spotted. I love it. It’s the Time Traveler feature that allows you to pick a year and then see what words were newly used in that year. I randomly scrolled back and hit 1967. Aerobics was first used then, but it didn’t have the same meaning we mostly think of now. It was in perhaps its more purer form then. This is really fun. It’s great for learning, but you could easily make it part of a game, too. Enjoy!\nwww.merriam-webster.com/time-traveler\nOld books\nAmerican Antiquarian Society has a really interesting site to poke around to see older printing and other works. I came across this intriguing exhibit linked below, but you should meander around the whole site. What’s the American Antiquarian Society? They say it better than I: “Founded in 1812 by Revolutionary War patriot and printer Isaiah Thomas, the American Antiquarian Society is both a learned society and a major independent research library. The AAS library today houses the largest and most accessible collection of books, pamphlets, broadsides, newspapers, periodicals, music, and graphic arts material printed through 1876 in what is now the United States, as well as manuscripts and a substantial collection of secondary texts, bibliographies, and digital resources and reference works related to all aspects of American history and culture before the twentieth century.”\nhttp://americanantiquarian.org/radiantwithcolor/\nOld internet\nCheckSpeedMinnesota.com is a benchmarking tool designed to gather information about the high-speed internet consumer experience in Minnesota. Click the boxes to help them by answering a few questions and running a speed test. They are using the information in partnership with the Minnesota Department of Employment and Economic Development to help create a better overall picture of broadband in the state.\nCheckSpeedMinnesota.com\nElection in photos\nThe Post Bulletin photo staff did another outstanding job of capturing Election Day through their lenses. I hope you’ll give them some clicks. Here’s another good assembling of voting from across our great country. Take a look.\nwww.buzzfeednews.com/article/gabrielsanchez/photos-from-the-2018-midterm\nElection of firsts\nWho all was elected on Tuesday night? Many were women, whose wins marked first times of significance for them or their states. It’s outstanding, but also prompts a puzzled pause from me when I do the math. Women have been voting for nearly 100 years and we’re just now marking these milestones? Give it a look, nonetheless.\nwww.nytimes.com/2018/11/07/us/politics/election-history-firsts-blackburn-pressley.html\nGood thoughts\nAre you a fan of the late John O’Donohue? His books and thoughtful prayers and words continue to bless people long after his death. His web site is worth a look to pick up some titles to read and ponder some words that sing and remind us of the many good things around us. Plus, he’s an Irishman. That’s tops in my book.\nwww.johnodonohue.com", "url": "https://apnews.com/d2b4e62b8a7b476b85d9616c5821dbcb"}