{"authors": ["Erin Kayata"], "date_download": "2020-05-04 20:07:45", "date_modify": "2020-05-04 20:07:45", "date_publish": "2018-08-05 04:00:00", "description": "Six years agoLawyers: Warnings foresaw berserk chimpanzeeAn out-of-control chimpanzee that mauled a Stamford woman in 2009 escaped from his cage five months earlier, prompting his owner to request...", "filename": "_b2ff293846d041fb96ec440f21a8180f_1588622865.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b2ff293846d041fb96ec440f21a8180f_1588622865.html", "title": "Today in history: Aug. 6", "title_page": "Today in history: Aug. 6", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Six years agoLawyers: Warnings foresaw berserk chimpanzeeAn out-of-control chimpanzee that mauled a Stamford woman in 2009 escaped from his cage five months earlier, prompting his owner to request he be shot with a tranquilizer gun, legal papers show.Marcella Leone, owner of a private zoo in Greenwich, testified in a deposition that Sandra Herold, owner of Travis the chimpanzee, called to tell her he needed to be restrained, according to The Hartford Courant.Nobody got hurt in that incident. But lawyers for Charla Nash, who was blinded in the attack and has had several surgeries including a face transplant, say the 2008 phone message was one of several warnings ignored by state officials. Police fatally shot the chimpanzee during the attack.10 years agoUConn warns students of Trump perilsUConn-Stamford administrators have closed the main entrance to protect students and faculty after a 4x4 from the Trump Parc luxury high-rise construction site across the street crashed through the roof of a postal truck.Saturday’s incident, which caused no injuries, was the fourth in a series of construction mishaps since May at the Broad Street and Washington Boulevard site.The University of Connecticut at Stamford previously had recommended that students and faculty not use the main entrance. Alternate entrances include ones on Broad Street across from Target, on Franklin Street and on Washington Boulevard.The precaution, applauded by Ben Barnes, the city’s director of operations, raises questions about whether the city is doing enough to protect pedestrians near the site.Tuesday morning, Barnes dismissed the idea of closing streets surrounding Trump Parc to pedestrians.“I don’t see why we should do that at this point,” he said, adding that the recent accidents affected cars not people.15 years agoCensus: Area seniors flocking to FloridaFairfield County offers a bevy of amenities, but apparently its older residents don’t think those perks can match Florida’s hot days, wraparound beaches and housing costs.That’s what data released today by the U.S. Census Bureau seem to show. The Census Bureau released four reports on domestic migration patterns between 1995 and 2000 and one that looks at migration within the United States of people age 65 or older.Among Connecticut counties, Fairfield County had the most of people age 65 or older move out of state. Fairfield County lost 38.9 people age 65 or older for every 1,000 residents, for a net number of 4,695 moving out of state. The second highest was Hartford County, which lost 22.8 people age 65 or over per 1,000 residents.Their destination, it seems, was usually the Sunshine State.erin.kayata@stamfordadvocate.com; (203) 964-2265; @erin_kayata", "url": "https://apnews.com/b2ff293846d041fb96ec440f21a8180f"}