{"authors": ["James Halpin"], "date_download": "2020-05-04 21:06:38", "date_modify": "2020-05-04 21:06:38", "date_publish": "2018-03-30 00:00:00", "description": "WILKES-BARRE — A Hazleton man who killed another motorist when he swerved into oncoming traffic pleaded guilty Thursday to felony charges. Estiven Rodriguez Fernandez, 21, pleaded guilty to three...", "filename": "_204c2e2b120e48f48ebf69235284dae8_1588626398.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_204c2e2b120e48f48ebf69235284dae8_1588626398.html", "title": "Hazleton Man Pleads Guilty To Charges In Fatal Wreck", "title_page": "Hazleton Man Pleads Guilty To Charges In Fatal Wreck", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WILKES-BARRE — A Hazleton man who killed another motorist when he swerved into oncoming traffic pleaded guilty Thursday to felony charges. Estiven Rodriguez Fernandez, 21, pleaded guilty to three felony counts of fleeing the scene of an accident, as well as summary counts of careless driving and driving with a suspended license. In exchange for the plea, prosecutors dropped other traffic violations against Fernandez. Luzerne County Judge Michael T. Vough accepted the plea and set sentencing for May 7. According to prosecutors, Fernandez caused a head-on crash on Route 924 between South Broad Street and Veterans Road in Hazle Twp. early the morning of July 9, 2016. Troopers arrived to find a red Nissan Maxima with heavy front end damage. The driver, Francisco A. Tineo, told police an oncoming vehicle had crossed the median and hit his car on the front passenger side, where his passenger, Carlos A. Espinal, was sitting. Espinal died the next day at Geisinger Wyoming Valley Medical Center in Plains Twp. Fernandez’s vehicle, a gold BMW, had crashed into a guard rail, according to prosecutors. A passenger in that car, William Hierro Morfa, was in the grass median. When police found Fernandez, he was walking around the road and disoriented with a facial injury, prosecutors said. He said he had been leaving work but couldn’t remember what happened, according to prosecutors. State troopers reconstructed the scene and determined Fernandez’s car had been heading north when it left the road and entered a grass median. The vehicle swerved back on the road, but then Fernandez lost control of the car again and swerved into the southbound lane, troopers said. As part of his sentence, Fernandez will be required to pay $8,445 to Tineo for medical bills, Vough ordered. The judge allowed Fernandez to apply for the Intermediate Punishment Program ahead of sentencing. Court records show Fernandez has been free on $150,000 unsecured bail since his preliminary hearing on Oct. 13. Contact the writer: jhalpin@citizensvoice.com 570-821-2058", "url": "https://apnews.com/204c2e2b120e48f48ebf69235284dae8"}