{"authors": ["Alana Melanson", "Amelanson Lowellsun.Com"], "date_download": "2020-05-04 20:27:20", "date_modify": "2020-05-04 20:27:20", "date_publish": "2018-04-18 10:37:56", "description": "LOWELL -- Whether they went into business, sports, law or politics, all of this year's Bishop John R. McNamara Award recipients are native Lowellians who stepped forward to be community...", "filename": "_410bbca1c6724c288f1c953ab348d804_1588624040.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_410bbca1c6724c288f1c953ab348d804_1588624040.html", "title": "Recognizing Efforts to Be Community Leaders", "title_page": "Recognizing Efforts to Be Community Leaders", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- Whether they went into business, sports, law or politics, all of this year’s Bishop John R. McNamara Award recipients are native Lowellians who stepped forward to be community leaders.\nLowell Catholic Senior Advancement Coordinator Robbie Barnes said her favorite part of the 17th-annual Bishop John R. McNamara Awards Gala, to be held May 8, is the lesson current students will learn.\n“I love when the kids hear about each one of the honorees, because our goal is to tell them, ‘When you get out there, when you make it, give something back. Be a leader,’” she said.\nTwo of this year’s honorees are graduates of Keith Academy, one of Lowell Catholic’s legacy schools, and members of the Lowell Catholic Athletic Hall of Fame.\nRichard Howe Sr., an attorney and 40-year city councilor -- including eight years as mayor -- will be honored posthumously. The 1951 Keith graduate was an all-star first baseman and earned a baseball scholarship to Providence College.\n“I think it helped develop a competitiveness in him that served him so well as a lawyer and an elected official in Lowell,” said his son, Richard Howe Jr.\nHe said his father’s experiences at Keith Academy and his Catholic faith played an important role in his life from childhood until his death in 2015.\nHowe Sr.’s advocacy and leadership led to the construction of the Tsongas Center and LeLacheur Park and a federal lawsuit settlement that resulted in funding 14 new schools.\nDennis Scannell, a 1969 Keith graduate and fourth generation president of Scannell Boiler Works and Lowell Iron and Steel Co., Inc., said the discipline he learned and the friends he made there have stayed with him lifelong. He and Howe Jr. said they’re grateful Lowell Catholic keeps the legacy of the earlier school alive.\n“It’s a really sad thing when you come back from college and you don’t have a high school anymore,” Scannell said.\nHe excelled at sports throughout his educational career, including on the Villanova University football team. Scannell later shared his love of football with local students, coaching 18 years at UMass Lowell and four years at Lowell High School.\nTerry McCarthy attended Lowell Public Schools, but he sees the value of Lowell Catholic’s mission and contributions to the city. He said he’s happy to support it.\n“When I was asked to do this, I just think that there’s so many good things going on here, that with all the community involvement I’ve had over the years, I just think it was the right thing to do to support the organization,” McCarthy said.\nMcCarthy serves on many local boards and organizations, including the city License Commission, Merrimack Valley Food Bank and Washington Savings Bank. He’s spent 50 years with the St. Vincent de Paul Society and was recently named president of Lowell Sun Charities.\nIn the 1990s, McCarthy and his partners, Leo Creegan and the late Tom McKay, formed Mill City Management. They ran the Lowell Memorial Auditorium for 18 years, bringing in Broadway shows and big name performers like Johnny Cash and Willie Nelson.\nWalter Armstrong Jr., a 1978 graduate of St. Margaret Elementary School, will be honored with this year’s St. Margaret Distinguished Graduate Award.\nArmstrong, of Chelmsford, is a founding partner of Liberty Sales and Distribution, in Hatfield, Penn., a supplier of products and services for the natural gas industry.\nA lifelong lover of basketball, Armstrong began coaching at St. Margaret School and church, and now serves as varsity head coach at the Academy of Notre Dame.\nThe gala will be held Tuesday, May 8 at 6 p.m. at Lenzi’s in Dracut. Tickets for $125 per person and other sponsorship options can be purchased at lowellcatholic.org .", "url": "https://apnews.com/410bbca1c6724c288f1c953ab348d804"}