{"authors": ["Chris Higgins"], "date_download": "2020-05-04 20:07:47", "date_modify": "2020-05-04 20:07:47", "date_publish": "2018-04-26 00:30:00", "description": "A proposed large multi-family rental complex in Beaver Dam will move forward despite concerns about safety expressed by Beaver Dam Fire Chief Alan Mannel on Wednesday. The Beaver Dam...", "filename": "_6d2958e6e72b49b08446b7232817347c_1588622867.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6d2958e6e72b49b08446b7232817347c_1588622867.html", "title": "Plan for 82-unit apartment complex in Beaver Dam advances", "title_page": "Plan for 82-unit apartment complex in Beaver Dam advances", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A proposed large multi-family rental complex in Beaver Dam will move forward despite concerns about safety expressed by Beaver Dam Fire Chief Alan Mannel on Wednesday.\nThe Beaver Dam Planning Commission approved a conceptual design for the 12-building, 82-unit development, which would be located north of the Spring Lake Apartments off of Spring Street and Woodland Drive. The complex would be in between two subdivisions. It would have two-bedroom units with average rent of about $900 per month, according to Steve Foote of Infinity Real Estate and Development.\nMannel spoke against the development. The buildings in the complex would not have sprinkler systems, which was a particular worry of his. He said he is concerned about multi-family developments in general.\n“We are going to have fires at the (complex),” he said. “It’s only a matter of time.”\nHe said he is also concerned about response times to the north side location given the fire department’s current staffing levels and location in the center of the city. According to a space needs analysis from 2008 , the fire department was pushing its geographical limits at its current location.\nMannel evoked the recent fire at The Executive apartment complex on West Third Street, which killed two people and left all residents homeless, as well as other fires in multi-family developments. The West Third Street building, constructed in the 1960s, did not have a sprinkler system.\n“Again, no crystal ball, but had there been sprinkler systems, I think the outcome would have been drastically different,” he said.\nThe new complex would have fire walls to slow flames in between units, Foote said.\nGov. Scott Walker’s administration has said it cannot enforce a state rule put in place under Gov. Jim Doyle that required sprinklers in buildings with three to 20 units. As a result, new apartment buildings can be built without sprinkler systems. Single buildings with more than 20 units are required by state law to have sprinklers.\nLast year, Attorney General Brad Schimel wrote that the rule conflicts with a bill signed by Walker that blocks agencies from making regulations more restrictive than what’s in the law. The move was a victory for builders who want to save money, but fire chiefs have spoken out against the change.\nSome other issues that came up were affordability for senior citizens on fixed incomes, road access to the complex, and the city’s low vacancy rate. Two separate fires have eliminated 33 apartment units in the city since the first week of March.\nRobert Ballweg, who is the president of the Beaver Dam Common Council, but spoke in his capacity as the real estate agent working on the property, said the only relevant factors to consider were whether the development fits the law and the city’s goals.\n“We went through a lot of things that make sense, but in reality, they’re of no significance as to what we’re looking at,” he said.\nAfter the vote, committee member Bill Schwartz said the city needs to address the concerns over growth and fire safety.\n“We have a duty to plan ahead for those needs so the argument can never be, ’We shouldn’t approve things because we haven’t planned ahead,” he said.\nThe planning commission also approved switching the property zoning from single-family to multi-family residential. The full common council still needs to approve the concept design. The unincorporated town of Beaver Dam also needs to weigh in, as it borders the property.", "url": "https://apnews.com/6d2958e6e72b49b08446b7232817347c"}