{"authors": ["Phillip Morris", "The Plain Dealer"], "date_download": "2020-05-04 20:12:03", "date_modify": "2020-05-04 20:12:03", "date_publish": "2018-04-01 10:00:10", "description": "Remembering the dead and the living this Easter: Phillip Morris CLEVELAND, Ohio -- \"Why did they make birds so delicate and fine as those sea swallows when the ocean can be so cruel?\" -- The...", "filename": "_365abfd007b04017adb769dca219fdfd_1588623123.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_365abfd007b04017adb769dca219fdfd_1588623123.html", "title": "Remembering the dead and the living this Easter: Phillip Morris", "title_page": "Remembering the dead and the living this Easter: Phillip Morris", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Remembering the dead and the living this Easter: Phillip Morris\nCLEVELAND, Ohio -- “Why did they make birds so delicate and fine as those sea swallows when the ocean can be so cruel?” -- The Old Man and The Sea\nI sometimes think of this line from Ernest Hemingway’s timeless novella when I visit Cleveland’s East 55th Street Marina. The marina has a popular fishing pier that reminds me of the late Robert Godwin Sr.\nThe marina, just east of downtown, continues to beckon aging fishermen like Godwin, who spent some of his final hours there last Easter Sunday morning before he was murdered. It’s sobering to realize it’s been exactly a year since the town lost this humblest of fisherman.\nShortly after leaving the marina with his fresh Easter catch, Godwin returned to his nearby Glenville neighborhood. He shared some of his Lake Erie bounty with a family member and went for a walk to collect cans. It was then that he tragically encountered Steve Stephens, another avid fisherman, who had decided to become a killer.\nStephens, who had been in search of a victim, saw the retired senior citizen approaching and made a spontaneous decision. He exited his car and pointed a camera phone at Godwin, a man he did not know. He momentarily recorded the 74-year-old father and grandfather’s final moments on the side of street, and then shot him dead.\nStephens then uploaded the horrifying video of the killing to Facebook, where it was widely viewed. The 37-year-old Stephens killed himself three days later in Pennsylvania as police closed in on him.\nThe same Easter holiday weekend brought us the deaths of Mike Kuznik, 47, and Trina Tomola, 46, who were murdered at work. The married business partners were killed with their dog in the office of Mr. Car Sales, a business they had owned and operated in the North Collinwood neighborhood for more than a decade. Three men currently await trial on murder and theft charges in connection with that Good Friday attack.\nYes, the ocean can be so cruel.\n“Just when you think things can’t possibly get worse, they do,” Cleveland Councilman Mike Polensek said Friday morning when we spoke about the ongoing effort to combat the high level of gun violence in Greater Cleveland.\n“I thought 2017 was the worst year I’d ever witnessed for violent crime in my decades as a public official, and that’s going back to the time when we had real gangsters in this town. But it’s not stopping.\n“I continue to be stunned by the level of violence in the streets. It doesn’t matter if you’re a nun, a priest, a child or a senior citizen walking down the street. No one is really out of harm’s way,” Polensek said.\nThe news cycle is often depressing. However, I believe there is reason for hope. The seeds of change have already begun to sprout with our young people, who are demanding a seat at the table.\nThe recent youth marches and rallies in Cleveland and numerous cities around the nation to further highlight the horrors of gun violence and to push for social and meaningful political solutions represent a breakthough. The level of adolescent commitment, passion and intelligence on the criminal violence issue is extremely encouraging.\nYoung Americans have grown tired of the unabated and senseless violence that consumes their neighborhoods and invades their schools. They are demanding that adult leaders take affirmative steps to make America a safer place, while doing their part to help make change happen.\nThis growing momentum comes too late to save Robert Godwin Sr., Mike Kuznik and Trina Tomola from their horrible fates. However, something critically important is happening on the gun violence front. America can and will become better.\nThe young now give us reason for hope this Easter and the rest of the coming year. Hemingway’s cruel ocean can be better navigated.", "url": "https://apnews.com/365abfd007b04017adb769dca219fdfd"}