{"authors": ["Mark Curriden"], "date_download": "2020-05-04 20:09:25", "date_modify": "2020-05-04 20:09:25", "date_publish": "2018-11-23 06:00:00", "description": "The recent unprecedented election of 20 Democratic candidates to seats on the state courts of appeals in Austin, Dallas and Houston is going to have an almost immediate and substantive impact on...", "filename": "_4d0bc780e8454cf3b3b4420c27f1b7be_1588622965.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4d0bc780e8454cf3b3b4420c27f1b7be_1588622965.html", "title": "Businesses face major changes in litigation appeals", "title_page": "Businesses face major changes in litigation appeals", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The recent unprecedented election of 20 Democratic candidates to seats on the state courts of appeals in Austin, Dallas and Houston is going to have an almost immediate and substantive impact on business litigation in Texas, according to legal experts.\nAppellate lawyers say that the “blue wave” that shifted control of those intermediary appeals courts from Republicans to Democrats means certain types of business disputes will be impacted because the new judges have different views on critical legal issues, such as enforcement of arbitration clauses, when cases should be dismissed before trial, and how much deference to trial judges and juries in large-dollar plaintiff’s verdicts.\n“There are clearly ways we are different,” Judge Ken Molberg, one of the eight Democratic candidates elected last week to the 5th Court of Appeals in Dallas, told The Texas Lawbook. “We will give a greater deference to jury verdicts and have a keener awareness and understanding of the actions of trial judges.”\nThe effect on the legal profession is also clear: The practice of appellate law in Texas is about to get super hot, as corporate plaintiffs and defendants will need increased legal advice to navigate an unknown or possibly even a treacherous appellate landscape.\n“Businesses are going to need to get appellate counsel involved in their litigation matters much earlier in the process,” said Christopher Kratovil, an appellate law partner at Dykema, which has offices in Houston, Dallas and San Antonio. “This change impacts the litigation strategy in numerous ways, including considerations regarding settlement.”\nFor example, lawyers on the losing side of recent appellate court decisions in Austin, Dallas or Houston might wait until the new judges are sworn in to file their motions for a rehearing. The shifts at the three intermediary appellate courts also change the dynamics involving appeals from those courts to the Texas Supreme Court.\nFor two dozen years, Republican judges controlled the 1st, 5th and 14th courts of appeals in Houston and Dallas. Those judges were viewed as conservative, pro-business, pro-arbitration, anti-large jury verdict jurisdictions.\nThe shift in jurisprudence is comparable to the Republican takeover of the Texas Supreme Court in the late 1990s after decades of justices who were pro-plaintiff — only in reverse.\n“Certainly attorneys representing plaintiffs in employment, consumer and malpractice cases will be feeling more optimistic about their odds of prevailing on appeal on those types of cases,” said Chad Baruch, an appellate law partner at Johnston Tobey Baruch in Dallas.\nJeff Nobles, an appellate partner at Smith Nobles, says the 10 new Democratic justices joining the 1st and 14th courts in Houston will clearly have an impact.\n“The differences in substantive areas will be incremental, not sweeping,” Nobles said. “But there is a human element to judging based on different experiences. So, we might expect to see a better outlook for the accused in some criminal cases, for plaintiffs in business and personal injury cases, and for the underdog in many areas.”\nNina Cortell, a partner at Haynes and Boone, which has offices in Houston, Austin and Dallas, agreed that the “new voices” on the Texas courts of appeals will lead to differences of opinion.\n“No doubt,” she says. “But I would be hesitant to prejudge what those differences will look like. The new justices have all committed to apply the law to the facts presented by the cases before them.”\nFor a longer version of this article, visit TexasLawbook.net.", "url": "https://apnews.com/4d0bc780e8454cf3b3b4420c27f1b7be"}