{"authors": ["Adam Zielonka The Washington Times"], "date_download": "2020-05-04 20:18:02", "date_modify": "2020-05-04 20:18:02", "date_publish": "2018-02-28 14:28:14", "description": "With their tumultuous 6-6-2 February behind them, the Washington Capitals get a three-day break before playing the Toronto Maple Leafs in the 2018 NHL Stadium Series on Saturday in...", "filename": "_d5eb2760a3acc06b8c9e3dd6573b48ba_1588623482.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d5eb2760a3acc06b8c9e3dd6573b48ba_1588623482.html", "title": "Capitals look forward to Stadium Series game while recovering from tough February", "title_page": "Capitals look forward to Stadium Series game while recovering from tough February", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With their tumultuous 6-6-2 February behind them, the Washington Capitals get a three-day break before playing the Toronto Maple Leafs in the 2018 NHL Stadium Series on Saturday in Annapolis.\nNavy-Marine Corps Memorial Stadium, the home of Navy football, will host an NHL game for the first time.\nAfter his team’s 3-2 win over the Ottawa Senators on Tuesday, Capitals coach Barry Trotz said it will be “a fabulous event” due to both the opponent and the location.\n“I’m a big military fan in terms of what our service people do for us and I’ve been in Annapolis many times, so I think it’s gonna be spectacular,” Trotz said. “Two good teams are gonna go nose to nose like we met in the playoffs.”\nThe Capitals regained the Metropolitan Division lead, for now, with Tuesday’s win. They’re one point ahead of Philadelphia, three ahead of Pittsburgh and five ahead of New Jersey. The Devils beat the Penguins Tuesday to strengthen its charge toward a top-three spot in the competitive division.\nWashington is probably glad February is in the rear view. After a light January with just 10 games and the all-star break, the Capitals played 14 games in February and only got one two-day break. They suffered some blowout losses and starting goalie Braden Holtby was pulled early from three games.\n“Honestly, I hadn’t thought a whole lot about (Saturday) until now. We’ve had such a grinding stretch here, the number of games, the opponents, all that,” Trotz said. “I’m looking forward to it now.”\nTrotz also stirred up sartorial rumors by saying he was “looking at a couple things” he could wear especially for Saturday.\n“I actually ordered a couple things I’m gonna have to work on a little bit. I had something, it came in and it was way too warm,” he said. “I’d probably lose about 10 pounds standing there on the bench.”\nIt won’t be the first outdoor game for most Capitals players. The team hosted the 2015 Winter Classic at Nationals Park and beat the Blackhawks 3-2. Saturday will be the franchise’s third appearance in a game outdoors.\nForward Tom Wilson is among the players looking forward to Saturday.\n“One of the big things is it gives you a little bit of a mental break from the rest of the season,” Wilson said Tuesday. “It’s different. You’re outside your comfort zone. It’s fun to play outdoors. There’s a lot of attention. You get family and stuff in.”\nWilson added that the physical break was also important this time of year. Trotz gave the team Wednesday off to recover, but the Capitals will practice Thursday and have a team skate in Annapolis on Friday afternoon.\n“We’re looking forward to (the day off) because it’s been a grind,” Trotz said Tuesday night. “And then we’ll get back. We gotta work on our game a little bit in some areas and keep implementing all our new guys into the fray a little bit.”\nThose new players came from a small wave of roster moves at the end of February, including two trades to acquire defensemen Michal Kempny and Jakub Jerabek. The latter made his team debut Tuesday and played for 12:35 with an even plus-minus. Kempny has now played four games in a Capitals sweater.\nWashington also recalled AHL forward Travis Boyd from Hershey Tuesday, with Trotz saying the team will work him into the rotation. Boyd made his Capitals debut in December and could return to the ice for them in Annapolis.\nWashington beat Toronto 4-2 in the first round of the Stanley Cup Playoffs last year, the first time the teams ever met in the postseason. They’ve split the first two of this year’s trio of games and haven’t met since November.\nToronto is second in the Atlantic Division with 85 points and lost two games in overtime this week to snap a four-game winning streak. The Leafs will be without center Auston Matthews, the first overall pick in the 2016 NHL Draft, who’s been sidelined with a shoulder injury.\nThough the Capitals seem ready to enjoy the experience of playing in Navy’s stadium, players are aware they can’t ease up.\n“We gotta be ready coming off (Tuesday’s win) into the outdoor game and then the Cali trip,” Wilson said. “Points are big right now.”", "url": "https://apnews.com/d5eb2760a3acc06b8c9e3dd6573b48ba"}