{"authors": ["Bill Novak", "Wisconsin State Journal"], "date_download": "2020-05-04 20:22:15", "date_modify": "2020-05-04 20:22:15", "date_publish": "2018-12-06 13:45:00", "description": "Bundle up if going outside in a very cold and windy Madison on Thursday. The high temperature is only expected to reach 25 and winds could gust up to 20 mph, producing a wind chill value of...", "filename": "_990dfa0d8e6b41f3aa6d2a9e0e9fdc04_1588623735.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_990dfa0d8e6b41f3aa6d2a9e0e9fdc04_1588623735.html", "title": "Cold, windy Thursday on tap; sunny and a little warmer this weekend", "title_page": "Cold, windy Thursday on tap; sunny and a little warmer this weekend", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cold, windy Thursday on tap; sunny and a little warmer this weekend\nBundle up if going outside in a very cold and windy Madison on Thursday.\nThe high temperature is only expected to reach 25 and winds could gust up to 20 mph, producing a wind chill value of 11 during the day, and it could be worse Thursday night, with wind chills in the single digits above zero, the National Weather Service said.\nFriday won’t be any better, with a high of 20 and wind chills staying in the single digits, under sunny skies.\n27 Storm Track meteorologist Branden Borremans said it won’t be as cold during the weekend and into next week, with highs of 29 on Saturday and 33 on Sunday, under mostly sunny skies.\nMonday through Wednesday are looking good, with sunshine and highs in the upper 30s.\nThe next chance for light rain or snow comes next Thursday, with a high of 36, Borremans said.\nWednesday’s high of 32 was 2 degrees below normal and 32 degrees below the record high of 64 for Dec. 5, set in 2001.\nThe low of 22 was 3 degrees above normal and 37 degrees above the record low of 15 below for the date, set in 1871.\nA trace of precipitation (rain plus melted snow) fell at the airport, keeping the December and meteorological winter (December through February) totals at 0.65 inches, 0.29 inches above normal.\nThe record precipitation total on Dec. 5 was 1.16 inches in 1982.\nSince Jan. 1, Madison has received 49.19 inches of precipitation, 16.09 inches above normal.\nThe trace of snow on Wednesday kept the December and winter snowfall totals at 0.6 inches, 1.4 inches below normal.\nSince the start of snow season on July 1, Madison has received 4.0 inches of snow, 2.1 inches below normal.\nThe record snowfall on Dec. 5 was 4.8 inches in 1936.", "url": "https://apnews.com/990dfa0d8e6b41f3aa6d2a9e0e9fdc04"}