{"authors": ["Raymond Partsch Iii", "The Daily Iberian"], "date_download": "2020-05-04 20:17:41", "date_modify": "2020-05-04 20:17:41", "date_publish": "2018-02-07 12:00:00", "description": "Landon Collins might have inadvertently killed National Signing Day. For more than a decade, National Signing Day had become a must-watch, anxiety-filled holiday-esque and overrated...", "filename": "_6ca9be5d99324af5b3705b1eb51d0bc9_1588623461.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6ca9be5d99324af5b3705b1eb51d0bc9_1588623461.html", "title": "FOR THE MOST PARTSCH: Collins effect seen in National Signing Day change", "title_page": "FOR THE MOST PARTSCH: Collins effect seen in National Signing Day change", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Landon Collins might have inadvertently killed National Signing Day.\nFor more than a decade, National Signing Day had become a must-watch, anxiety-filled holiday-esque and overrated spectacle for high school football players from the red dirt hills of Georgia to the bright lights of Hollywood, California. Each February on the first Wednesday, schools would put together a makeshift media event for one or two or three star football players.\nThe amount of players signing was usually misleading, as many signed paperwork to attend a Division III school, which doesn’t offer athletic scholarships. The player was essentially signing a paper saying he would attend that university and walk on to the team. Thus, not really a Letter of Intent. But, I digress.\nThe players would sit behind a table, flanked by loved ones and coaches, and have helmets or baseball caps in front of him of the top three or five schools. Everyone in attendance (classmates, school faculty, media, etc.) had to wait as the school’s principal, vice principal, coach, history teacher and janitorial staff grabbed the microphone to speak about the player and the school.\nEssentially, a simple ceremony of signing a piece a paper to be faxed (NSD also has kept the fax machine industry afloat) for some reason needed to be a 20 or 30-minute documented affair. But once again, I digress.\nAfter all that, the player would then in dramatic fashion announce the school he was choosing to sign his athletic scholarship with by grabbing the hat or helmet, and then signing on the dotted line. As more signing day events, and the boom of recruiting coverage, received more recognition, the players themselves started hamming it up for the media — even sometimes unveiling a shirt of one school only to then take that one off and underneath the player’s real school was revealed.\nFor thousands of young men, National Signing Day was the realization of that childhood dream of playing college football. Then Landon Collins had to go and upset all of LSU fandom and his mama.\nThe Dutchtown High School star from near Baton Rouge was the No. 1-rated safety in the country for the 2012 signing class and it had come down to LSU and Alabama. Collins was going to make his choice live on ESPN during the 2012 Under Armour All-America Game.\nFamously, Collins slipped on a pair of Alabama gloves and verbally committed to the Crimson Tide — much to the chagrin of his mother, who was physically and vocally displeased with her son’s decision. Two years later, she would again be disappointed when her younger son Gerald Willis III committed to the Florida over LSU.\nNow, there had been other players make noise with their picks, but Collins’ choice became a viral sensation and it spread like wildfire, just as Facebook and Twitter began to dominate social media.\nEven though an oral commitment is not binding as the actual physical signing day paperwork, it helped shift the importance of the pledge from February, where it was controlled by a school or coach, to the player. All of a sudden, Collins had paved the way for the player to seize control of the signing and that has resulted in less drama for actual National Signing Day.\nMany of the players are committing verbally earlier, keeping that pledge after having announced it at an all-star game or on their own Twitter or Instagram account. Most recruiting experts will admit that there are only a handful or dozen marquee players that are still undecided.\nNot to mention, with the first early National Signing Day held in December, there really isn’t much suspense any more when it comes to a college program putting together its signing class or if your favorite local player is going here or there or anywhere.\nNational Signing Day’s reign as a premier event, or unofficial holiday, has come to an end and a former Louisiana prep star and his mama helped bring it down.\nRAYMOND PARTSCH III is the managing editor of The Daily Iberian.", "url": "https://apnews.com/6ca9be5d99324af5b3705b1eb51d0bc9"}