{"authors": ["Brandon Foster Brandon.Foster Trib.Com"], "date_download": "2020-05-04 20:10:44", "date_modify": "2020-05-04 20:10:44", "date_publish": "2018-03-28 01:49:00", "description": "LARAMIE — After the Wyoming football team beat Colorado State in 2016 in Fort Collins, Colorado, Rams head coach Mike Bobo joked to Wyoming safety Andrew Wingard that he wished he would leave...", "filename": "_48f6eac96bfd4166817ed558f4d5b425_1588623044.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_48f6eac96bfd4166817ed558f4d5b425_1588623044.html", "title": "After brief NFL consideration, Andrew Wingard ready to end Wyoming career with a bang", "title_page": "After brief NFL consideration, Andrew Wingard ready to end Wyoming career with a bang", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LARAMIE — After the Wyoming football team beat Colorado State in 2016 in Fort Collins, Colorado, Rams head coach Mike Bobo joked to Wyoming safety Andrew Wingard that he wished he would leave Wyoming for the NFL.\nBobo might have gotten his hopes up late last season. Among the non-senior players the Star-Tribune spoke to about potentially joining quarterback Josh Allen in leaving early for the NFL, only safety Wingard didn’t say for sure that he knew he’d be returning for the 2018 season.\nLuckily for Wyoming fans, they didn’t have too much to worry about.\n“It was a possibility,” said Wingard, who will be a senior in the fall, “but I kind of conveyed to my roommates and all my friends, ‘I’m going to be back.’ I wanted another year with the guys, another year to mature, get bigger, stronger like I have. I made so much strides this winter in the weight room, getting bigger. So I think it’s really going to benefit me this year.”\nWingard submitted his name to the NFL’s College Advisory Committee, which gives players one of three grades: “potential first round, potential second round, or neither, which is effectively a recommendation to stay in school,” per the NFL.\n“They told me to stay in school,” the three-time all-conference honoree said. “But I think I was going to stay in school anyway, just because I think would benefit me academically, socially and just on the field. One more year of playing football in college will help me for the next level. I was thinking about it a little bit, but ultimately I wanted to come back.”\nSaid Wyoming head coach Craig Bohl: “I think at the tail end (of the season) we talked a little bit. I told him we’d be an advocate. Certainly, there’s an application process to see where you’re at. We’re going to forward stuff on and give you information. But he made a decision to finish his career here and get his degree. Which we’re happy for.”\nConsidering Wingard’s success in his first three years at Wyoming, the Cowboys might be the only happy ones. Wingard earned second-team all-Mountain West as a freshman, when he was also a freshman all-American. As a sophomore and junior he moved up to first team, being named Mountain West preseason defensive player of the year prior to the 2017 season.\nNow, he’s back, stronger and more mature than ever.\n“It’s kind of weird,” Wingard said. “It feels like two days ago I was a freshman running around with my head cut off, and now I’m a senior. It’s my last year of college football. It’s really fun, though. I like being the old guy. I like knowing what I’m doing, being able to help the young guys and just leading by example.”\nAdded Bohl: “Dewey’s one of those guys that has a hard edge. He practices and he plays that way, and certainly the guys understand his competitive nature, and that has a big, big component on how we play on defense.\n“He’s picked up, I don’t know, about 10 pounds. He’s a lot stronger. He’s carrying his weight really well. He was really physical today, and it’s encouraging to see him coming out. He’s an established player that’s recognized around the country, and yet he’s practicing like he’s a hungry freshman.”\nLuckily for Colorado State, he’s not.\n“He’s a cool guy,” Wingard said of Bobo. “I’ve talked to him at media days and stuff for two years now. I really respect him. He respects us. But yeah, he did say (he wished I would leave for the NFL) one time.”\nInjury report\nThe injuries continue to pile up this spring for the Cowboys. Bohl said Tuesday that receiver Jared Scott will be out for the rest of camp with a broken finger. He also said that four or five players sustained injuries in Tuesday’s practice, the Pokes’ fourth of camp. Running back Kellen Overstreet was one of them, suffering a shoulder injury. Carl Granderson (elbow), Marcus Epps (back), Sidney Malauulu (back), Conner Cain (ankle), C.J. Johnson (ACL), John Okwoli (ACL), Ravontae Holt (ACL), Kevin Prosser and Josiah Hall are already out for the entire camp. Ben Wisdorf (hamstring) and Javaree Jackson (back) are also temporarily sidelined.\nThe Cowboys’ practice Saturday, which was closed to media, was their first in full pads, but there was no full contact. Bohl said the team could do some live work for the first time Saturday.", "url": "https://apnews.com/48f6eac96bfd4166817ed558f4d5b425"}