{"authors": ["Shawn Gude", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Kevin Young", "Michael Schwartz", "Tarun Banerjee"], "date_download": "2020-05-04 19:50:51", "date_modify": "2020-05-04 19:50:51", "date_publish": "2018-07-24 00:00:00", "description": null, "filename": "2018_07_democratic-socialism-democracy-ocasio-cortez_1588621851.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/07/24192127/10930089935_12ce96b3bc_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_07_democratic-socialism-democracy-ocasio-cortez_1588621851.html", "title": "Democratic Socialism Is About Democracy", "title_page": "Democratic Socialism Is About Democracy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "There are lots of ways to talk about democratic socialism. Some focus on fairness and equality. Others stress the need to fix the “irrationalities” of capitalism. Still others speak of “convert[ing] hysterical misery into ordinary unhappiness.”\nThe democratic socialist du jour, Alexandria Ocasio-Cortez, recently gave her own definition on Stephen Colbert’s show:\nI believe that in a modern, moral, and wealthy society, no person in America should be too poor to live. So what that means is health care as a human right. It means that every child, no matter where you are born, should have access to a college or trade school education if they so choose it. And, you know, I think that no person should be homeless if we can have public structures and public policies to allow for people to have homes and food and lead a dignified life in the United States.\nNot bad at all.\nBut here’s what I’d emphasize: democratic socialism, at its core, is about deepening democracy where it exists and introducing democracy where it is absent. In countries like the US, that means increasing the scope of popular control in the political arena and broadening it out to include the social and economic spheres.\nThis may sound fairly innocuous — who isn’t for democracy these days? But democratic socialists have something more far-reaching in mind. To us, democracy is not simply a banal amalgamation of procedures, an uncontroversial set of norms and rules that everyone can get behind. It is the quite radical idea that ordinary people — not experts, not elites, not their “betters” — can rule themselves. It is the word we use to describe the flattening of steep hierarchies, the shattering of structures that confer undue wealth and power and privilege.\nWhen democracy is on the march, it lays in its path state despots and private autocrats. It rips decision-making power away from the corporate titan, wrests the billy club out of the beat cop’s hands, divests the domineering husband of his authority. It brings the imperial power to its knees and lifts up the colonial subject, the slave, the worker.\nDemocratic socialists draw their lineage to this long history of bottom-up struggles. In previous eras, kings and churches reigned over their subjects. With the advent of capitalism, the chains of feudalism were broken. But new forms of domination emerged. Those who owned the means of economic activity — the factories, the mines, the railroads — enjoyed extraordinary power over those who only had their labor to sell.\nThe socialist movement — organized through labor parties, radical trade unions, and other working-class associations — arose in response. Socialists took the Enlightenment ideals of autonomy and self-determination to their logical conclusion and asked, if all humans are equal, what gives one the right to arbitrarily rule over another? Why should capital be king?\nThat basic idea animated democratic socialists throughout the nineteenth and twentieth centuries.\nEarly European socialist parties fought class-based voting restrictions and controls on press freedoms. Eugene Debs, the tribune of American socialism, denounced World War I as an anti-democratic escapade and called for the toppling of the “Junkers of Wall Street.” Socialists organized militant labor movements that replaced workplace despotism with the rudiments of democratic rights (Ford Motor Company, to take just one example, had employed spies and goons to keep workers in line). Bayard Rustin, the socialist civil rights leader, contributed essential tactical know-how to bring down a racial caste system that smothered American democracy. Socialist feminists ripped down the walls between the public and the private and asserted the need to place romantic partners on equal footing. More recently, democratic socialists have spearheaded the resistance to colonialism in Jamaica, corporate rule in Bolivia, and anti-abortion laws in Argentina.\nBut despite significant advances, we’re still living with many of the despotisms that early socialists abhorred.\nThe American workplace is one of the most glaring examples. The place where most people spend the bulk of their adult lives, it’s also a place where workers relinquish the most basic of democratic freedoms. Bosses can fire their subordinates for nearly any reason. They can tell workers what to say and what not to say. They can decide whether to keep the worksite where it is or move it abroad. They alone determine how to spend the company’s profits and invest the resources the enterprise has generated.\nDemocracy says that people should have equal control over the decisions that affect their lives. Capitalism laughs in its face.\nOr consider a more democratic space, the political arena. Despite formal guarantees of one person one vote — itself a triumph of past democratic movements — the wealth inequalities that capitalism creates inevitably bleed over into the traditional political process. The rich bankroll politicians, fund think tanks, and dispatch lobbyists. They influence which would-be politicians rise and fall, which ideas circulate widely, and what kinds of policies elected officials prioritize.\nOn top of that, business interests have a crucial trump card: they control the levers of the economy. At certain moments in the history of capitalist democracy — particularly in the decades after World World II, in countries like Sweden — organized labor was strong enough and left parties powerful enough that the historically disenfranchised spoke with a relatively strong political voice. Yet because business leaders could effectively bring the economy to a standstill, their interests had to be heeded. “Business confidence” won out over “political equality.”\nTo socialists, this is unacceptable. We simply can’t tolerate a social arrangement that systematically domesticates democracy — especially in areas so central to people’s daily lives.\nThe radical reforms we advocate are all intended to increase the amount and degree of decisions, relationships, and structures in society that operate according to democratic principles. Capital’s control over investment gives it too much say over the direction of the political economy; we should socialize key industries and foster worker cooperatives. The immigration system makes people into pariahs; we should abolish ICE and allow everyone to vote, undocumented or not. Relying on private housing gives developers unjustifiable leverage over the means of people’s survival; we should build millions of units of social housing. US imperialism brutally undermines democratic movements in countries around the world; we should dismantle America’s empire. The existence of fossil-fuel companies threatens our ability to even make popular decisions in the future; we should put them out of business.\nThose with power don’t like to be stripped of it. Whether it’s kings or patriarchs, capitalists or cops, the threat of a shift toward greater equality of power can prompt a ferocious counter-attack. But to retreat in the face of elite opposition is to accept a social order still strewn with master-servant relationships. A better world, a more democratic world, is possible.", "url": "https://www.jacobinmag.com/2018/07/democratic-socialism-democracy-ocasio-cortez"}