{"authors": ["Wesley E. Wright", "Molly Dear Abshire"], "date_download": "2020-05-04 20:06:50", "date_modify": "2020-05-04 20:06:50", "date_publish": "2018-10-19 05:00:00", "description": "On Sept. 18, the Department of Veterans Affairs published new rules regarding needs-based, non-service related governmental benefits for veterans and their spouses. These benefits are commonly...", "filename": "_3ffae0d619f041599a8bdfa19f839c01_1588622810.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3ffae0d619f041599a8bdfa19f839c01_1588622810.html", "title": "Elder Law New rules make changes to veterans’ needs-based government benefits", "title_page": "Elder Law New rules make changes to veterans’ needs-based government benefits", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "On Sept. 18, the Department of Veterans Affairs published new rules regarding needs-based, non-service related governmental benefits for veterans and their spouses. These benefits are commonly known as Aid and Attendance benefits. The new rules became effective Oct. 18.\nAid and Attendance, along with another needs-based benefit called Housebound Allowance, provide monthly cash assistance paid in addition to a monthly means-tested pension afforded needy veterans who have a discharge other than a dishonorable one and who served at least 90 days in active military duty with at least one day during wartime. This monthly cash assistance is a worthwhile benefit to many veterans who meet the eligibility criteria as it gives them cash to pay for necessary care at home or care in an assisted living center.\nThe new rules establish a bright-line net worth limit for pension entitlement. This is a drastic change to the prior eligibility criteria, which considered multiple factors, sometimes resulting in inconsistent outcomes among similarly situated claimants.\nThe net worth limit now counts the assets and annual income of the claimant according to the standard maximum Community Spouse Resource Allowance (CSRA) promulgated by Congress for Medicaid eligibility. The current CSRA rules allow $123,600 in countable assets. When calculating net worth, the VA will also consider the income and assets of others living in the primary residence, such as an adult child. Additionally, the VA considers the assets of a veteran’s spouse, even if they don’t live together. The VA also considers the veteran’s tangible personal property in calculating net worth, except to the extent such property is suitable and consistent with a reasonable mode of life, such as a vehicle and appliances.\nUnder the new rules, the VA now excludes from the countable assets of the claimant’s net worth calculation, the claimant’s primary residence including a residential lot of 2 acres. Marketable acreage in excess of 2 acres will be included in the asset calculation. However, the lot size may be larger than 2 acres if the excess acreage owned by the claimant is unmarketable. For example, if the property is only slightly larger than the 2-acre limit, or if the additional property is not easily accessible, or if there are zoning limitations, then the excess acreage may not be counted.\nAdditionally, the VA rules now impose a 36-month look-back period. This means any assets transferred within the 36-month time frame for less than fair market value, will be subject to a VA-imposed penalty period. Moreover, the purchase of annuities or transfers to trusts will be considered a transfer for less than fair market value unless the claimant retains control, then the annuity or trust will be included in the claimant’s net worth.\nThere are exceptions to the transfer penalty policy. One exception is that if the annuity is part of a retirement plan that required conversion of a deferred account to an immediate annuity. Then the amount transferred to the immediate annuity would not be penalized as a transfer, but the distributions from the annuity would be countable income.\nAnother exception to the transfer penalty rule is if a transfer was made to a trust that was created for the benefit of a veteran’s disabled child who was permanently disabled and incapable of self-support prior to the age of 18.\nThe VA believes the new rules will provide uniformity and consistency in decisions and ultimately result in efficiency in the claims process. It is worthy to note that this article only highlights a few of the major changes related to the new VA regulations. As always it is best to get sound legal advice tailored specifically to your situation from a competent elder law attorney before embarking on any plan seeking benefits.\nYou may email your questions to education@wrightabshire.com or visit the website at www.wrightabshire.com. Wesley E. Wright and Molly Dear Abshire are attorneys with the firm Wright Abshire, Attorneys, P.C., with offices in Bellaire, The Woodlands, and Carmine. Both Wright and Abshire are Board Certified by the Texas Board of Legal Specialization in Estate Planning and Probate Law and are certified as Elder Law Attorneys by the National Elder Law Foundation. Nothing contained in this publication should be considered as the rendering of legal advice to any person’s specific case, but should be considered general information.", "url": "https://apnews.com/3ffae0d619f041599a8bdfa19f839c01"}