{"authors": ["Dave Morrison For Hd Media"], "date_download": "2020-05-04 20:24:29", "date_modify": "2020-05-04 20:24:29", "date_publish": "2018-06-15 04:01:00", "description": "PRINCETON, W.Va. - Nobody can be sure why Mullens, West Virginia, has become the state's cradle of college basketball coaches. Dan D'Antoni, the Marshall University coach and now the elder...", "filename": "_e661ce630162405f8bf2a54e593e8ff6_1588623869.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e661ce630162405f8bf2a54e593e8ff6_1588623869.html", "title": "D'Antoni's hometown, Mullens, is WV's cradle of hoops coaches", "title_page": "D'Antoni's hometown, Mullens, is WV's cradle of hoops coaches", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PRINCETON, W.Va. - Nobody can be sure why Mullens, West Virginia, has become the state’s cradle of college basketball coaches.\nDan D’Antoni, the Marshall University coach and now the elder statesmen among those coaches - even though he doesn’t look it - has an idea.\n“I think it’s that water over there by the playgrounds that came out of the mountains,” D’Antoni, 70, said. “We used to go over there and drink it.”\nIf Marion County is the cradle of football coaches, boasting among others, Alabama’s Nick Saban and former WVU/Michigan/Arizona coach Rich Rodriguez, certainly Mullens can lay claim to the title for basketball coaches.\nThere is Marshall’s D’Antoni, his younger brother Mike, a longtime NBA head coach now with the Houston Rockets; former Marshall coach Greg White; Shawn Finney, who had several jobs along the way including Kentucky and Tulane and now at Manhattan; Rob Fulford, an assistant at Akron; Kent McBride, who recently resigned at California of Pennsylvania after a successful stint at Concord; and recently hired Justin Caldwell at Glenville State.\nThere’s also legendary former Logan High School basketball coach Willie Akers, who also hails from Mullens. He led the Wildcats to four Class AAA state championships.\nHome is never too far away for these coaches. At a Marshall fundraising event in Princeton, D’Antoni several times referenced Mullens in his 10-minute talk with the crowd.\n“I always tell people I’m from the 10 and 2 territory,” D’Antoni said. “The sun comes up at 10 (a.m) and goes down at 2 (p.m.).”\nHe talked about the park in Mullens being named for his late father, Lewis D’Antoni.\nHe talked about his brother Mike.\nThe theme was obvious. Home and family. The bond is basketball.\nSo why the love affair between Wyoming County and basketball?\nCertainly a lot of the roots can be traced to Lewis D’Antoni, the patriarch of basketball playing D’Antonis and a legendary coach in Mullens.\n“There were a lot of people and I don’t want to leave anyone out, but I’m going to give dad credit for starting those playgrounds,” D’Antoni said. “He started getting kids to the playgrounds and playing ball when they were young. That had a lot to do with pushing basketball. Then he had the state championship in ’55. It kind of grew from there. I hope it continues.”\nThe place where they grew up playing is different than the 1960s when the D’Antonis were coming up. It’s also the same in one respect. Kids still show up and play. Maybe not the throng that used to play, where you could wait all day to get a shot if you didn’t win, but they are there just the same.\nIt will now bear the name of Lewis D’Antoni, who recently passed away at 103.\nMullins native Ronnie Bowling, whose nephew Brett, a Wyoming East graduate, played for D’Antoni his first year at Marshall, helped spearhead the drive to rename the park, and both Mike and Dan contributed to the cause named for their famous father.\n“It meant a lot to us,” D’Antoni said. “In fact, my sons, when we lived in Myrtle Beach (coaching at Socastee High School) for five straight summers came up and stayed with my dad and played on that playground.\n“I’m hoping that it helps the community and the young people there, that they can enjoy what we enjoyed when we were there.”\nHis long-term takeaway from growing up in Mullens, the heart of hoops country, will always be the same: family.\n“They (his parents) provided the basis for having a good life,” D’Antoni said. “They lived it the way you should, they loved each other as a great family and they worked hard and they achieved. I drew aces being the son of Lewis and Betty Jo D’Antoni.”\nObviously, he is typically busy with his own career these days and hasn’t had the opportunity to see the Wyoming East (his alma mater merged with Pineville) vs. Westside (Oceana-Baileysville) rivalry.\nBut he has heard about it.\n“Back when I played the rivalry was Beckley-Mullens,” D’Antoni said. “I’ve heard (Wyoming East vs. Westside) it’s the best (rivalry in the state). I’ve not had enough time to really appreciate it but I’m glad sports still mean something and the people have a passion for it.”\nD’Antoni’s team made some history this season winning the Conference USA title and the school’s first-ever NCAA tournament game.\nAnd he did it with a roster littered with state natives, including Jon Elmore from Charleston and C.J. Burks from Hedgesville, both of whom explored a professional career before returning to Marshall.\nThe roster sprinkled with state natives is not by accident.\n“That was one of the things we wanted to do,” D’Antoni said. “We wanted to make sure we scoured the mountains before we went somewhere else. Obviously we didn’t have to go far because we got four good players and another coming in with Jeremy Dillon from Mingo. We want to continue moving forward with state kids being a big part of it.”\nAs he once was at Marshall, all the way from Mullens.", "url": "https://apnews.com/e661ce630162405f8bf2a54e593e8ff6"}