{"authors": ["Colin Demarest Cdemarest Aikenstandard.Com"], "date_download": "2020-05-04 20:08:47", "date_modify": "2020-05-04 20:08:47", "date_publish": "2018-10-10 19:31:00", "description": "Two of South Carolina's loudest Mixed Oxide Fuel Fabrication Facility proponents have condemned a recent appeals court decision that paves the way for the nuclear project's demise. On...", "filename": "_12e1b317565b4078a9ad619b146e9370_1588622927.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_12e1b317565b4078a9ad619b146e9370_1588622927.html", "title": "S.C. governor, attorney general vexed by appeals-level MOX decision", "title_page": "S.C. governor, attorney general vexed by appeals-level MOX decision", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Two of South Carolina’s loudest Mixed Oxide Fuel Fabrication Facility proponents have condemned a recent appeals court decision that paves the way for the nuclear project’s demise.\nOn Tuesday night, S.C. Attorney General Alan Wilson issued a statement saying he was “disappointed” in the federal appellate judges’ decision to lift a lower court’s injunction that entrenched MOX and protected related construction efforts.\nWilson further said the ruling – made Tuesday afternoon following oral arguments at the end of September – was “inconsistent with governing law” and “foreshadows the court’s” full opinion.\nThe injunction, issued by U.S. District Court Judge J. Michelle Childs, had been in place since early June.\nOn Wednesday, in an interview with the Aiken Standard, S.C. Gov. Henry McMaster said it was fair to say he, too, is not happy with the appeals court decision.\n“That is not what we wanted to happen,” the governor said. “But that’s the way courts work, and we knew that might happen.”\nMcMaster said the court’s order, though, doesn’t change South Carolina’s end goal.\n“We are going full speed to see to it that the right thing is done with that MOX facility,” McMaster said, “and that is to build that MOX facility, to finish building the MOX facility.”\nMOX is a Savannah River Site plant designed to transform 34 metric tons of weapons-grade plutonium into commercial reactor fuel. The MOX project is more than a decade in the making and has exceeded its initial timeline and its initial budget.\nOn May 10, U.S. Secretary of Energy Rick Perry moved to terminate the project in favor of dilute-and-dispose, another plutonium disposition method. At the same time, the National Nuclear Security Administration and the U.S. Department of Defense have expressed their desire to recapitalize MOX for their shared nuclear weapon needs.\nThe state of South Carolina quickly responded with a lawsuit. At a related press conference in Aiken, U.S. Sen. Lindsey Graham, R-S.C., said shutting down MOX was an “ill-conceived idea.”\nInquiries made to Graham’s team on Wednesday were not immediately returned.\nWhen the DOE requested the federal appeals court stay the MOX injunction, South Carolina’s legal team said granting the stay – ultimately done on Tuesday – would cause irreparable, irrevocable harm.\nThe state’s legal team also bet, in the same filing, that the DOE would immediately move forward with MOX termination.\nOn Sept. 14, NNSA chief Lisa Gordon-Hagerty wrote to U.S. Rep. Mac Thornberry, a Texas Republican in charge of the House Armed Services Committee, and reaffirmed Perry’s intent to kill the project.", "url": "https://apnews.com/12e1b317565b4078a9ad619b146e9370"}