{"authors": ["Chris Lisinski"], "date_download": "2020-05-04 21:09:01", "date_modify": "2020-05-04 21:09:01", "date_publish": "2018-06-28 11:43:43", "description": "LOWELL - Facing insurmountable financial pressure after losing a key state contract, the Mental Health Association of Greater Lowell will merge with Vinfen, a community health organization that...", "filename": "_b9313dc192424834b1aae048cca13908_1588626541.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b9313dc192424834b1aae048cca13908_1588626541.html", "title": "Mental-health Merger to Maintain Services", "title_page": "Mental-health Merger to Maintain Services", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL - Facing insurmountable financial pressure after losing a key state contract, the Mental Health Association of Greater Lowell will merge with Vinfen, a community health organization that operates hundreds of locations in New England.\nThe change will have little to no impact on its mission and services, however. Vinfen agreed to maintain all existing MHA operations, leaders of both organizations said, and all staff except for a handful in administrative roles will keep their jobs.\nDan Nakamoto, executive director of the MHA, credited Vinfen leaders for their willingness to support the MHA’s services to more than 2,000 people in the Greater Lowell area, even as almost every mental-health clinic in the state - the MHA’s included - runs a deficit.\n“Without their willingness to step up, we would have had to close our mental- health clinic at a time when there’s a tremendous need for more services continuing,” Nakamoto said.\nThe MHAhas operated in Lowell and surrounding towns for about 60 years. Today, it offers a variety of services and supports in addition to operating a walk-in clinic, including programs for adults with serious mental illness and individuals with brain injury. Clinicians also work with various community organizations such as UTEC and Lowell Public Schools.\nVinfen, a nonprofit founded in 1977, currently oversees more than 260 mental- health programs across Massachusetts and Connecticut. It is the largest contractor for the state Department of Mental Health, according to Bruce Bird, Vinfen’s president and CEO.\nOn July 1, Vinfen will formally take over all operations of the MHA. Bird said “vast majority” of MHA’s roughly 200 full- and parttime employees will continue their work, including Nakamoto, with only a handful of administrative positions cut. The merger will fully go through in the fall when Vinfen assumes all of MHA’s assets and liabilities.\nAll services will remain in place, and Bird plans for Vinfen to bring additional bandwidth to help programs evolve, particularly through the use of technology. As an example, he said, the organization recently tested an app that patients interacted with on their smartphones at home, which offered medication reminders, provided access to a library of resources and allowed caregivers to get a better sense of patients.\n“We feel like we can bring good clinical support and infrastructure support to these programs,” Bird said.\nHe praised work already being done at MHA, particularly given what he called a “shoestring” budget. One program that Bird would like to expand is Project CARE, a collaboration between the association and law enforcement to support children affected by the opioid epidemic.\nThe merger comes as mental-health associations continue to face challenging circumstances. Both Nakamoto and Bird cited a survey from the Association of Behavioral Health reporting that 96 percent of mental- health clinics in Massachusetts are losing money. Mental-health issues also still face harsh social stigmas, which Nakamoto said is why most of the MHA’s branding refers to it by its abbreviation and not by the full name.\nBoth men praised efforts under the administration of Gov. Charlie Baker to improve funding for mental-health programs, but noted that even more is needed to bring care to the level needed.\n“There’s a limit to what even large organizations can carry in the way of financial losses,” Bird said. ”(State leaders) have made some changes in behavioral health funding that have helped, but we’re still struggling, and more help is needed.”\nFollow Chris on Twitter @ChrisLisinski.", "url": "https://apnews.com/b9313dc192424834b1aae048cca13908"}