{"authors": ["Jackie Borchardt"], "date_download": "2020-05-04 20:10:53", "date_modify": "2020-05-04 20:10:53", "date_publish": "2018-02-22 16:14:07", "description": "Ohio casino commission rehired, promoted employee after 'dereliction of duty' guilty plea COLUMBUS, Ohio -- The Ohio Casino Control Commission rehired and promoted an employee after he was...", "filename": "_4e0d083b735d451fa4e98d557d55b136_1588623053.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4e0d083b735d451fa4e98d557d55b136_1588623053.html", "title": "Ohio casino commission rehired, promoted employee after 'dereliction of duty' guilty plea", "title_page": "Ohio casino commission rehired, promoted employee after 'dereliction of duty' guilty plea", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ohio casino commission rehired, promoted employee after ‘dereliction of duty’ guilty plea\nCOLUMBUS, Ohio -- The Ohio Casino Control Commission rehired and promoted an employee after he was convicted of dereliction of duty in his past post as the state’s deputy tax director.\nRick Anthony’s promotion was announced by the commission in a December press release and highlighted in a Thursday report by the Columbus Dispatch.\nAnthony started working at the commission in 2011 after a stint as the deputy tax commissioner. A 2013 inspector general’s investigation found Anthony was responsible for holding up $9 million in tax refunds for businesses dating back to 1999.\nIn July 2014, Anthony pleaded guilty to a second degree misdemeanor charge of dereliction of duty.\nAnthony was put on leave for seven months in 2013 and resigned as commission operations director days before his guilty plea, the Dispatch reported Thursday.\nHe was rehired as operations manager in late 2015.\nIn December 2017, Commission Executive Director Matthew Schuler promoted Anthony to deputy executive director, overseeing all functions related to day-to-day operations of the commission. The announcement touted Anthony’s “35 years of experience in state government” and noted his past job as deputy tax commissioner.\nThe promotion came with a 23-percent raise, to $100,006 a year.\nSchuler told the Dispatch the commission did not consider Anthony’s 2014 conviction because Anthony’s case was sealed. Record sealing restores “all rights and privileges” to the person and Ohio law prohibits questioning job applicants about sealed convictions “unless the question bears a direct and substantial relationship to the position for which the person is being considered,” the Dispatch reported.\nThe commission licenses and regulates Ohio’s four casinos and its 9,000 employees.\n“Rick, from day one, has been an indispensable part of the commission staff,” Schuler told the Dispatch. “He’s one of the smartest, hard-working people I know.”\nAnthony declined the Dispatch’s request for comment.\nCatherine Turcer, executive director of good-government group of Common Cause Ohio, said in the story that people should have second chances, but the casino control commission should especially should be careful about hiring someone convicted of dereliction of duty.", "url": "https://apnews.com/4e0d083b735d451fa4e98d557d55b136"}