{"authors": ["Kori Siebert The Wayne Stater"], "date_download": "2020-05-04 20:12:46", "date_modify": "2020-05-04 20:12:46", "date_publish": "2018-02-08 20:28:00", "description": "The semi-annual career fair is once again right around the corner. Feb. 21 from 11 a.m. to 2:30 p.m. Wayne State students will have the opportunity to network with professionals in their area of...", "filename": "_4ee8b7332c20456fa28ce1268487ea8e_1588623166.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4ee8b7332c20456fa28ce1268487ea8e_1588623166.html", "title": "Career Fair", "title_page": "Career Fair", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The semi-annual career fair is once again right around the corner. Feb. 21 from 11 a.m. to 2:30 p.m. Wayne State students will have the opportunity to network with professionals in their area of study at the Kanter Student Center.\nNot only will students be able to network with professionals, but they will also be able to learn about career opportunities and find jobs and internships.\nHeather Reinhardt, Career Services specialist, mainly helps the graduating seniors with their job search, but she plays a big role in helping set up the career fair by contacting vendors to participate in the career fair.\n“What a lot of students don’t sometimes realize is that we send out thousands, I want to say around two-thousand invitations to businesses to come to the career fair,” said Reinhardt.\nThere are currently 71 venders registered but Career Services is anticipating about 10 more.\n“I think the biggest thing is to go with an open mind,” said Reinhardt. “Definitely go on to CatTracks and look at what companies are coming; do your research and see what companies you would like to visit.”\nStudents can go onto CatTracks and preregister for the career fair to get a name tag and see what companies will be there. Career Services can even look at resumes if they are brought in 48 hours ahead of time.\n“We really encourage freshmen to seniors to come because the more career fairs you go to the more confident you’ll be going and building relationships with the employers that come,” said Reinhardt.\nReinhardt also suggested volunteering for the career fair. She said it’s a great way to network with employers in a more casual way. Students can visit the Career Services office to sign up to volunteer for any amount of time.\nReinhardt said students should dress nice, be themselves and act professional.\nOn top of dressing nice and acting professional, JC Penney is hosting a one-day event for college students to get fitted and find business attire that best suits them.\nThe JC Penney Suit-Up is Sunday from 6:30 to 9:30 p.m. at the Gateway Mall in Lincoln and is exclusively open for college students.\nIn order to attend the JC Penny Suit-Up,Students must present their student ID to receive 40 percent off regular priced and sale items. Staff at JC Penney’s will be availible to help students find business attire, shoes and makeup.\nIf students aren’t able to attend the JC Penney Suit-Up, Reinhardt suggests checking out local stores in Wayne. Thrift Warehouse is an option if people’s pockets are a little tight and Swans for Men and Women is also an option for business attire. There are plenty of opportunities for students to “suit-up,” just in time for the career fair at WSC.", "url": "https://apnews.com/4ee8b7332c20456fa28ce1268487ea8e"}