{"authors": ["Jon O'Connell", "Staff Writer"], "date_download": "2020-05-04 20:07:56", "date_modify": "2020-05-04 20:07:56", "date_publish": "2018-02-05 00:00:00", "description": "SCRANTON — “Go warm them presses up!” Phil Caple shouted as his colleagues started marching upstairs. The Philadelphia Eagles’ nail-biting 41-33 Super Bowl win Sunday over the New England...", "filename": "_87a83774b63c4189bbc80a8505bd10b6_1588622876.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_87a83774b63c4189bbc80a8505bd10b6_1588622876.html", "title": "Eagles Super Bowl Shirts, Printed In Scranton", "title_page": "Eagles Super Bowl Shirts, Printed In Scranton", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SCRANTON — “Go warm them presses up!” Phil Caple shouted as his colleagues started marching upstairs.\nThe Philadelphia Eagles’ nail-biting 41-33 Super Bowl win Sunday over the New England Patriots meant 20 or so workers at Kevin’s Worldwide in Scranton spent the night printing victory apparel for jubilant Eagles fans.\nThe sports clothing company Fanatics hired the Scranton firm to print thousands of T-shirts if Philadelphia won. Apparel companies use hot-market contracts on big game days such as the Super Bowl to produce victory merchandise for nearby markets where they expect sudden and urgent demand.\nLeading up to the big moment, workers trickled down into the basement break room about 8 p.m., a few minutes before halftime, to find boxes of Nearra’s pizza in the corner, potato chips and pretzels.\nAt the front of the room, a big-screen TV streamed the game.\nPhotos: Printing Eagles Super Bowl T-Shirts at Kevin’s Worldwide\nOn the third floor, three hulking printing presses with arms like spiders waited for victory with goopy plastisol ink in troughs and rubber squeegees suspended ready to spread white, green and silver.\n“It’s tough because you can’t get totally ready because you don’t know if we’re going to do it or not,” said Production Manager Jim Pettry.\nTo start, workers unpacked 360 shirts each in extra large, large and medium sizes. Another 14,000 shirts waited on the wings.\n“I’m an optimist. I’m hoping to see 650 per press, per hour, that would make it so we’re not here too darn late,” Pettry said.\nBefore the confetti finished falling at U.S. Bank Stadium in Minneapolis, the screen printing presses hummed and hissed mechanically, spitting out a finished shirt every few seconds.\nCaple, of Scranton, grinning widely, folded the black shirts as they came off the line.\nIn the next room, workers unpacked cases of blank shirts, while others readied new boxes for delivery of the final product.\nThey scrambled to be ready in time for three scheduled pickups at 2, 8 and 11 a.m., for quick distribution to major retailers.\nIf it had gone the other way, and the Eagles lost, Kevin’s would have paid for the food and their workers to watch the game, and everyone would have come back to work this morning.\n“It’s not enough to think about,” Kevin’s Executive Vice President of Sales Scott Tinkelman said, explaining that the chance at printing the commemorative merchandise outweighed the risk.\nPhiladelphia’s win, on the other hand, means some tired, happy printers are taking the day off.\nContact the writer:\njoconnell@timesshamrock.com;\n570-348-9131;\n@jon_oc on Twitter", "url": "https://apnews.com/87a83774b63c4189bbc80a8505bd10b6"}