{"authors": ["Brian Hallenbeck"], "date_download": "2020-05-04 20:14:02", "date_modify": "2020-05-04 20:14:02", "date_publish": "2018-10-17 05:00:01", "description": "Groton — Republican state Sen. Heather Somers battled Democrat Bob Statchen's characterization of her as a reliable GOP partisan Wednesday night, maintaining during a debate that she's earned a...", "filename": "_4ca8c68aa86c4450ba0ccbb21b11f0df_1588623242.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4ca8c68aa86c4450ba0ccbb21b11f0df_1588623242.html", "title": "Somers, Statchen hold their own in substantive debate", "title_page": "Somers, Statchen hold their own in substantive debate", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Groton — Republican state Sen. Heather Somers battled Democrat Bob Statchen’s characterization of her as a reliable GOP partisan Wednesday night, maintaining during a debate that she’s earned a reputation for taking on the “status quo” while serving in Hartford and distancing herself from her party’s gubernatorial candidate as well as the Trump administration.\n“This election is not about Washington,” she said.\nStatchen, 50, a political newcomer from Stonington, said Somers has voted 98 percent of the time with the state legislature’s Republican leadership, a cause for concern, he said, “When we have a Republican candidate for governor who wants to eliminate the income tax.”\nSomers disputed Statchen’s description of her voting record and said she doesn’t believe it’s possible to eliminate the income tax, as the GOP’s gubernatorial candidate, Bob Stefanowski, has proposed doing over time.\nThe Senate candidates’ hourlong exchange was substantive throughout, quieting an audience of more than 400 people seated in the auditorium at Fitch High School — the “very high school,” the 52-year-old Somers noted, from which she graduated. The debate was sponsored by The Day and the Chamber of Commerce of Eastern Connecticut, with help from the League of Women Voters of Southeastern Connecticut.\nPhasing out the income tax “would be nice,” Somers said, but it can’t be done in the near future given the state’s financial straits. A reduction in certain taxes can be achieved, she said, such as those she’s championed for retirees relying on Social Security benefits.\nShe also pointed to her success in lowering the state sales tax on boats, a move she said has spurred economic development in southeastern Connecticut.\nSomers said she stands by the language used in her campaign mailers labeling Statchen a “radical professor.”\n“If you look at the policies he’s put out, he wants the government to take over health care ... sanctuary cities, abolish ICE (U.S. Immigration and Customs Enforcement) ...,” she said.\nStatchen advised voters to look at his website, which lists positions that have to do with promoting growth. He supports increasing the minimum wage and imposing electronic tolls, for example, stances that he said are far from radical.\nSomers cautioned that the state is in no position to raise the minimum wage, a move she said could hurt small businesses, or impose mandatory paid family leave. She said that despite it being “a noble idea,” the state lacks the resources to implement it.\n“We’ve got to stop saying Connecticut can’t do it,” Statchen said. “We have to pay people a livable wage, we have to have paid family leave. We can find solutions. We’re falling behind, we’re hemorrhaging workers (to neighboring states).”\n“I’d like to know how Mr. Statchen’s going to pay for it,” Somers said.\nThe candidates sparred over Somers’ vote against the state’s ban on bump stocks, devices that increase the deadliness of semiautomatic rifles. Statchen said he would have supported the ban.\nSomers said that while she voted for an early version of the bill, she could not back the version that passed because it empowered the state to seize bump stocks that already had been purchased, which some believe would have been unconstitutional.\n“At the end of the day, she didn’t vote for the bill,” said Statchen, who dismissed the “novel theory of constitutional law” she cited as her reason.\nThey also differed over the state’s Citizens’ Election Program, which provides funding for election campaigns for state office.\n“I wouldn’t be sitting here without it,” said Statchen, who called the program a Connecticut “crown jewel.”\nSomers, who also is participating in the program, said the size of the grants should be cut in half.\nStatchen sought to downplay Somers’ role in exposing abuses at the Whiting Forensic Institute, a state-run mental health facility.\nShe said he “couldn’t be more wrong,” asserting that nothing would have happened if not for her demand for a public hearing on the matter, a demand that she said no Democrat supported.\nAsked why she hasn’t spoken out about President Donald Trump’s insensitive comments about women, Somers said she was bothered by such behavior as well as when “Statchen supporters say things about my children ...”\nStatchen said it was important for candidates to speak up about “the values” of our national leadership.\nThe 18th District, stretching north from Groton and Stonington to Sterling and bounded on the east by the Rhode Island border, also encompasses Griswold, North Stonington, Plainfield, Preston and Voluntown.\nStatchen, a clinical law professor at Western New England University School of Law in Springfield, Mass., directs the school’s Small Business Clinic, which pairs students with entrepreneurs and small business owners. He traveled extensively while serving an active tour of duty in the Air Force and has been a member of the Connecticut Air National Guard for more than two decades.\nHe practiced law with a New London firm and taught business and military law at the Coast Guard Academy.\nDuring her first Senate term, Somers has served as co-chairwoman of the legislature’s Public Health Committee and as a member of the Appropriations, Environment, Education and Higher Education committees.\nIn 2014, she was the Republican candidate for lieutenant governor, running on a GOP ticket headed by gubernatorial candidate Tom Foley. The Foley-Somers ticket lost to Gov. Dannel P. Malloy and Lt. Gov. Nancy Wyman.\nSomers served five terms on the Groton Town Council and is a former Groton Town mayor. She was a founding partner of Hydrofera, a medical device manufacturer.\nb.hallenbeck@theday.com", "url": "https://apnews.com/4ca8c68aa86c4450ba0ccbb21b11f0df"}