{"authors": ["Judy Newman", "Wisconsin State Journal"], "date_download": "2020-05-04 20:09:53", "date_modify": "2020-05-04 20:09:53", "date_publish": "2018-01-19 21:00:00", "description": "Hyde, a Milwaukee company that won the Wisconsin Governor's Business Plan Contest in 2016 for its thin, lightweight life vest, will tackle a nationwide stage this weekend, hitting up some...", "filename": "_c16e8f7a4aae441c9bf64314dcda2bb1_1588622993.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c16e8f7a4aae441c9bf64314dcda2bb1_1588622993.html", "title": "Wisconsin startup hopes 'Shark Tank' investors will inflate life-vest company's coffers", "title_page": "Wisconsin startup hopes 'Shark Tank' investors will inflate life-vest company's coffers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Hyde, a Milwaukee company that won the Wisconsin Governor’s Business Plan Contest in 2016 for its thin, lightweight life vest, will tackle a nationwide stage this weekend, hitting up some well-known investors for cash.\nHyde will be a contestant on ABC’s “Shark Tank” on Sunday, showing off its Wingman life vest.\nAfter winning the business plan contest, Hyde co-founder Pat Hughes told the Wisconsin State Journal that he was deeply affected by the death of one of his competitors in a triathlon. During the swimming leg of the triathlon, the athlete had drowned. Hughes said he and high school classmate Mike Fox were determined to develop “the world’s thinnest, most versatile life jacket.” Their flotation vest weighs only 1½ pounds and lies flat until the user pulls a ripcord to inflate it.\nFox, 28, said a casting director for “Shark Tank” emailed the company a year ago, and after a lengthy application process, he and Hughes, 27, taped the segment in California last June.\n“It is intimidating and scary” to go before the panel, said Fox, who admitted he’s a big fan of the TV show and said he has “witnessed people getting shredded” by the tycoons.\n“It’s one of the biggest stages an entrepreneur can ask for,” he said. Participants are not allowed to say anything about the results of their segment until it airs.\nThe episode is scheduled to be shown at 8 p.m. Sunday on WKOW-TV (Ch. 27). Fox said he and Hughes are the only employees of Hyde, so far. Their life vests are made by a water sports company in Thailand. He would not say how much the company has had in sales, but when the pair appeared before the state contest in 2016, they had $67,000 in advance orders through Kickstarter.\nHyde is the second Wisconsin Business Plan Contest winner to appear on “Shark Tank.” Henry Schwartz, founder and president of MobCraft Beer, made his pitch to the “sharks” in an episode broadcast in 2016. And while Schwartz didn’t get a bite from the famed investors, he said hits to MobCraft’s website were running at 40 times the usual volume after the episode aired.\nMobCraft, known for its crowdsourced beer flavors, started in Madison but moved to Milwaukee to grow. The company won the Wisconsin business contest’s advanced manufacturing category in 2014.", "url": "https://apnews.com/c16e8f7a4aae441c9bf64314dcda2bb1"}