{"authors": ["David Louis Today S News-Herald"], "date_download": "2020-05-04 20:08:30", "date_modify": "2020-05-04 20:08:30", "date_publish": "2018-01-17 06:10:00", "description": "Although no action was taken Tuesday, Mohave County Board of Supervisors debated for more than 30 minutes on the logic of holding monthly meetings. The discussion was presented by Supervisor...", "filename": "_34cb02e6783a45d2932c8e17aef27bed_1588622910.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_34cb02e6783a45d2932c8e17aef27bed_1588622910.html", "title": "No changes in Mohave County’s two meetings a month schedule", "title_page": "No changes in Mohave County’s two meetings a month schedule", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Although no action was taken Tuesday, Mohave County Board of Supervisors debated for more than 30 minutes on the logic of holding monthly meetings.\nThe discussion was presented by Supervisor Hildy Angius who wanted to force her colleague on the board, Buster Johnson, to defend claims that by abandoning a twice-a-month meeting schedule it would save the county $500,000 annually.\nReferring to his January newsletter, Johnson said there are 1,200 hours of overall staff time put into an average board meeting. When multiplied by a low average of department heads and managers salary of $35 an hour by 12 meetings, the annual cost savings for monthly meetings would be substantial.\n“When you have monthly meetings (documentation review) is a job you get on and get it done,” Johnson said. “But when you have two meetings it’s a stop and go process. And, when you have department heads … sitting and listening to me pontificate on how long it takes to have a meeting … it would be the best use of our tax dollars to go to one meeting a month.”\nPrior to 2012, the then three-member board held monthly meetings.\n“I used to sit in the front row before I was elected to the board,” Angius said. “There wasn’t a lot of public participation and no call to the public. People were concerned their voices were not being heard.”\nAt the time, because of the smaller board it was often hard to bring items up for discussion, Angius added.\n“Maybe for the staff (monthly) meetings worked a little bit better, but to have a well-run government people’s voices must be heard.”\nAngius’ argument was that monthly meetings, some as long as 10 hours, were also a waste of taxpayers’ money.\n“I don’t understand if we go to one meeting how it would reduce costs,” Angius said. “If you are talking about people’s salaries, they are still being paid. It’s not like they are being paid extra.”\nWhen pressed by Angius that county meetings cost approximately $21,000, County Manager Michael Hendrix tiptoed around his answer.\n“My wife warned me that this would probably be asked of me,” Hendrix said. “My answer is that did you all know if you went with GEICO you could save 15 percent on your car insurance.”\nFollowing the moment of levity, Hendrix admitted he had not conducted an analysis of Johnson’s assertions, but added that staff salaries are included in attending meetings.\n“I don’t think it’s a salary issue, I think it’s a productivity issue if you were going to put a dollar amount on one meeting verses two,” Hendrix said. “My staff is available if it is 20 items twice a month or 40 items once a month. Whatever the board decides I’m going to be tickled to death with.”\nBoard President Gary Watson, who supports the two meeting schedule, reminded the other supervisors why they are there.\n“One of the things we are overlooking is service to our constituents,” Watson said. “If we move to one meeting a month, in many instances it would take two to three months for an action to be taken. It only makes sense to do the very best that we can to service the people who pay the taxes, and allow us to sit in these seats.”", "url": "https://apnews.com/34cb02e6783a45d2932c8e17aef27bed"}