{"authors": [], "date_download": "2020-05-04 20:09:12", "date_modify": "2020-05-04 20:09:12", "date_publish": "2018-01-22 00:07:53", "description": "Washington — Members of the Michigan delegation continued to point fingers as the partial government shutdown stretched into its second day and congressional leaders dug in behind their...", "filename": "_b7d68d3501af49da9bbd35ac94d87c03_1588622952.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b7d68d3501af49da9bbd35ac94d87c03_1588622952.html", "title": "Democrats, GOP dig in amid government shutdown", "title_page": "Democrats, GOP dig in amid government shutdown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Washington — Members of the Michigan delegation continued to point fingers as the partial government shutdown stretched into its second day and congressional leaders dug in behind their positions.\nRepublicans argued that they wouldn’t negotiate with Democrats on “illegal immigration” until the government reopens.\nDemocrats want a commitment that Congress will pass legislation to address the Obama-era executive order for Deferred Action for Childhood Arrivals, or DACA, that has shielded the children of undocumented immigrants from potential deportation. President Donald Trump undid the program and set a March 5 deadline for Congress to pass a legislative compromise on the issue.\n“We’re not negotiating with people who would hold our military and children hostage,” said GOP Rep. Paul Mitchell of Dryden.\n“They are using DACA as leverage for everything, and I see where they’re coming from, but it’s not going to work. ... It’s irresponsible in my opinion.”\nRep. Sandy Levin, D-Royal Oak, said Senate Minority Leader Chuck Schumer of New York had made a concession to President Donald Trump on border-wall funding but Trump later reneged on the framework.\n“Essentially, President Donald Trump has to decide whether he wants to lead or continue to divide,” Levin said.\n“The Republicans haven’t been able to control the process, the policy or the president’s temper. They have defaulted on their responsibilities. They really needed to reach out to us. The bill passed here with no bipartisanship and with no consultation. There wasn’t any.”\nOffice of Management and Budget Director Mick Mulvaney has said Schumer offered Trump the $1.6 billion that the administration requested in the 2018 budget but wouldn’t make a commitment about the $18.4 billion more the president wants to complete the wall or partition along the Mexico border.\nBipartisan groups of lawmakers on both sides of the U.S. Capitol met over the weekend. Sen. Gary Peters, D-Bloomfield Township, was part of a bipartisan group of 22 senators who met Sunday in the office of Maine Sen. Susan Collins, a Republican, working toward a consensus agreement on reopening the government, a Peters spokeswoman said.\nMichigan delegation’s senior Republican, Rep. Fred Upton of St. Joseph, met Saturday with members of a bipartisan group known as the Problem Solvers Caucus.\nBut Upton complained that the Senate had rejected the House-passed funding resolution even though there were no controversial riders attached to it.\n“As it relates to DACA recipients, no one has been a bigger champion than I have — we must continue to work together to get a bipartisan deal done for these folks,” Upton wrote on Facebook.\n“I share the same frustrations as everyone else. Shutting down the government is unacceptable. Enough.”\nMitchell joined Republican Reps. Mike Bishop of Rochester, Tim Walberg of Tipton, John Moolenaar of Midland, Bill Huizenga of Zeeland and Jack Bergman of Watersmeet in a joint statement calling on Michigan’s Democratic senators to be “part of the solution.”\n“There’s absolutely nothing in this funding bill that Democrats oppose, and their failure to keep the government open only delays negotiations for a bipartisan DACA fix,” the Republicans said, noting the bill included a six-year extension for the federally funded health insurance program for lower-income children.\nBut many Democrats said they did object to the legislation because of what it didn’t include. While the bill reauthorized the Children’s Health Insurance Program, Sen. Debbie Stabenow was concerned that the bill cut support for federally funded community health centers that are relied on by many children insured by CHIP.\n“It is very concerning that those two pieces of health care funding for families would somehow be divided,” the Lansing Democrat said Saturday on the Senate floor. “We’re here today to stand up for those families and for an approach that is bipartisan.”\nDemocrats also want spending commitments from Republicans to deal with the opioid crisis, veterans resources, budgetary spending caps and disaster recovery funding for Puerto Rico, the U.S. Virgin Islands and wildfire victims.\nRep. Debbie Dingell, D-Dearborn, said she wants Republicans to act on legislation to help Teamster union members avoid pension cuts related to the distressed Central State Pension Plan.\n“We need our leadership to lead and not do finger-pointing but figure out how we’re going to open our government tomorrow,” she said Sunday. “This isn’t a war or words between two parties. It’s people’s lives.”\nDemocrats said Sunday that a 30-second video released online by Trump’s campaign wasn’t helping the tone on Capitol Hill.\nIn the ad, a narrator says, “Democrats who stand in our way will be complicit in every murder committed by illegal immigrants. President Trump will fix our border and keep our families safe.”\nRep. Dan Kildee, D-Flint Township, said he’s been trying to get some colleagues on both sides of the aisle to tone down their rhetoric, and the ad makes it more difficult.\n“It got pretty contentious yesterday on the floor, and it was not helpful. We have differences, but it’s not an excuse to be uncivil,” Kildee said.\n“What Trump’s political organization is putting out — a terrible TV ad — that kind of rhetoric doesn’t contribute to any positive step forward.”\nTrump tweeted Sunday that, if the stalemate continues, Senate Republicans should kill the 60-vote rule and allow the stopgap spending bill to pass with a simple majority of 51 votes. Senate Republicans rejected the idea, as they did when Trump previously suggested it.\nUnlike most federal employees, members of Congress get paid during a government shutdown. Lawmakers including Walberg and Mitchell asked administrators over the weekend to withhold their pay until the government reopens.\n“The 2 million members of our military will not be paid until the shutdown is over, and neither should Members of Congress,” Walberg said in a statement.\nBergman said he would donate his salary during the shutdown to a charity in his district benefiting veterans.\nHe introduced legislation Friday with Rep. Claudia Tenney, R-New York, that would require members of Congress to work full time with no salary during any shutdown until a bill to fund the government is approved.\nStabenow is also donating her salary and helped to introduce a bill to withhold the pay of members of Congress during a government shutdown.\nSeveral Michigan members said their offices would remain open despite the government closure. They include Kildee, Dingell, Levin, Mitchell, Upton and Huizenga.\nmburke@detroitnews.com\n(202) 662-8736", "url": "https://apnews.com/b7d68d3501af49da9bbd35ac94d87c03"}