{"authors": ["Tony Paul", "The Detroit News"], "date_download": "2020-05-04 20:04:32", "date_modify": "2020-05-04 20:04:32", "date_publish": "2018-03-21 23:44:33", "description": "Sometimes, it's tough to remember Drew Valentine — one of the hot, young basketball coaches in the country — is only 26. Then you see Donte Ingram drain a last-second 3 to send...", "filename": "_41dc42f726b443f7b946c9b95b755d1c_1588622672.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_41dc42f726b443f7b946c9b95b755d1c_1588622672.html", "title": "Drew Valentine enjoying the wild ride at Loyola-Chicago", "title_page": "Drew Valentine enjoying the wild ride at Loyola-Chicago", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sometimes, it’s tough to remember Drew Valentine — one of the hot, young basketball coaches in the country — is only 26.\nThen you see Donte Ingram drain a last-second 3 to send Loyola-Chicago past Miami, 64-62, in the first round of the NCAA Tournament, and, yeah, then you remember.\n“One of the most unprofessional things of my career — luckily the camera didn’t show it — was when Donte hit that shot against Miami, I sprinted across the floor like I was playing,” Valentine said the other day, with a laugh. “You grow up and you see all the different buzzer-beaters during March Madness, and for that to happen literally 10, 15 feet in front of me was like a dream.\n“It was one of the coolest things.”\nIt’s been a year of “coolest things” for Valentine, a Lansing native and former Oakland star player who’s in his first year on Porter Moser’s staff at Loyola — and is heading to the Sweet 16 as his 11-seed, Cinderella Ramblers take on No. 7 seed Nevada on Thursday night in Atlanta.\nIn June, he was hired by Loyola, a rising program in the Missouri Valley Conference. There was the suggestion at the time that it was a lateral move for Valentine, from Oakland to Loyola — but it really wasn’t. Loyola provided him a $50,000 raise, more responsibility and, oh, a job in Chicago, where he would be close to his brother, former Michigan State star Denzel Valentine, who plays for the Bulls.\nIn August, he got married, to Taylor Galloway, in a ceremony in Charlevoix.\nAnd now, the Sweet 16, following a second-round, 63-62 victory over Tennessee — the opponent for which he was responsible for scouting. That saw more late-game heroics, red-shirt junior Clayton Custer hitting the winner with less than 4 seconds left.\n“I mean, it’s obviously been an incredible year,” Valentine said.\nStill, leaving Oakland was not an easy call, by any stretch — considering Valentine spent four years playing for the Golden Grizzlies, which he led to two NCAA Tournament appearances. He came back to Oakland in 2015, when his old coach, Greg Kampe, made Valentine his youngest full-time hire ever, at 24.\nIn total, between playing and coaching, Valentine was part of 205 games at Oakland.\nHe has strong relationships with several current Oakland players, especially Jalen Hayes, another Lansing native whom Valentine has known since middle-school. Hayes played for Valentine’s dad, Carlton.\n“Leaving those guys was the toughest thing for me to do,” Valentine said. “But at this point in time, hindsight is 20-20.\n“And it looks like I pretty much made the right decision.”\nNo kidding.\nLoyola has become the toast of Chicago. It helps that the Bulls and Blackhawks are having down seasons, and Northwestern fizzled out, too.\nNow, Loyola is monopolizing the front page of the dailies — “Sweet Jesus” read the Chicago Tribune headline after the private Catholic school’s victory over Tennessee — having made its first Sweet 16 since 1985, six years before Valentine was born. A victory Thursday would give Loyola its first Elite Eight since 1963.\n“It’s been extremely special, the way the city of Chicago has truly rallied around our program,” he said earlier this week, while hopping in Uber after returning home from a recruiting trip to the JUCO championships in Hutchinson, Kansas — a trip that came immediately after the second-round NCAA Tournament victory in Dallas. “We kind of became Chicago’s team.\n“These guys, they’re truly good kids. I’ve been around a lot of teams with good kids, but these kids, there are no off-court issues, these dudes, they buy into coaching. And just seeing them get rewarded for the sacrifices they make, and them trusting in Coach and the entire staff, has been truly fulfilling for me.”\nValentine graduated from Oakland in 2013 with a degree in communications, then joined Tom Izzo’s staff at Michigan State for two years as a graduate assistant. There, he experienced two NCAA Tournaments, including a Final Four run in 2015.\nKampe, at Izzo’s urging, then took a chance on Valentine, his former star forward who during his playing career averaged 7.9 points and 5.2 rebounds.\nHe made an immediate impact under Kampe, being the main recruiter who landed prized Grand Rapids guard James Beck.\nAt Loyola, he’s continued to be tasked with recruiting, as well as game-planning — his scouting reports sometimes exceed 20 pages. His main bullet point for Tennessee: Keep the Volunteers, who had 13 offensive rebounds in the opening win over Wright State, to six offensive rebounds or fewer. Tennessee had six.\n“When you have that complete buy-in from the team,” said Valentine, “you can do special things.”\nSpeaking of special things, yes, of course, Valentine has gotten to know “Sister Jean,” a 98-year-old nun who is the Ramblers’ chaplain — and who has become a sensation as Valentine and Co. have made their run.\nWhen Valentine had his interview in Chicago last summer, he was taken to her office. And when he got the job, waiting for him at the office was a letter from her.\nAs Loyola has taken the nation by storm, so has Sister Jean, who in a recent interview hilariously corrected a reporter. She hasn’t become a national sensation; international celebrity is more like it, she said.\nValentine got a chuckle out of that comment.\nAnd why not? He knows the feeling of a star on the rise.\nGETTING TO KNOW ...\nDrew Valentine\nAge: 26 (May 25, 1991, in Lansing)\nJob: Assistant coach at Loyola-Chicago\nPrevious jobs: Assistant coach at Oakland University, 2015-17; graduate assistant at Michigan State, 2013-15.\nPlaying career: Four years at Oakland, averaging 7.9 points and 5.2 rebounds over 136 games; made two NCAA Tournaments.\nHigh school: Lansing Sexton\ntpaul@detroitnews.com\ntwitter.com/tonypaul1984", "url": "https://apnews.com/41dc42f726b443f7b946c9b95b755d1c"}