{"authors": ["Courtney Hesslerthe Herald-Dispatchchessler Herald-Dispatch.Com"], "date_download": "2020-05-04 20:25:54", "date_modify": "2020-05-04 20:25:54", "date_publish": "2018-03-18 09:55:51", "description": "HUNTINGTON — A Cabell County grand jury in Huntington charged several individuals last month for allegedly participating in violent crimes. Aubrey Sharnell Gardner was indicted on a charge...", "filename": "_9adae86f62ad4fe4b0701d780c9530cf_1588623954.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9adae86f62ad4fe4b0701d780c9530cf_1588623954.html", "title": "Wanton endangerment among indictments", "title_page": "Wanton endangerment among indictments", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON — A Cabell County grand jury in Huntington charged several individuals last month for allegedly participating in violent crimes.\nAubrey Sharnell Gardner was indicted on a charge of wanton endangerment. According to criminal complaints, witnesses told police Gardner fired a handgun April 29, 2017, at another man after an argument outside their residence near the 1400 block of 28th Street and then left the area in the vehicle, tossing the handgun into an empty lot along Roby Road. A black .38-caliber revolver was recovered from the area.\nAlthough he was not indicted in Cabell County on drug charges, complaints state police discovered Gardner had ripped open a baggie containing around 15.5 grams of suspected heroin and spilled it in the backseat of the arresting officer’s car. Another baggie containing approximately 9.2 grams was allegedly found.\nIn a separate case, a grand jury charged Charles Russell Sams with wanton endangerment. According to criminal complaints, Sams was charged with felony wanton endangerment in March 2017 after his ex-wife’s car was struck by gunfire. Officers heard gunfire in the vicinity of 8th Street and 5th Avenue in Huntington, near the Cabell County Courthouse, and contacted a woman whose vehicle had been struck.\nThe victim alleged that her ex-husband was stalking her and her new boyfriend and had fired at her vehicle.\nAnother indictment charges Glenn Ford Jenkins Jr. with malicious wounding and felon in possession of a firearm. According to criminal complaints, Jenkins allegedly pistol-whipped another man on Nov. 22, 2017, on the left side of his head with a 9mm handgun. During the incident, which took place at Jenkins’ residence, the gun discharged and a bullet struck the victim in his shoulder.\nIn a separate, unrelated indictment, Shannon Deon Monroe was charged with malicious wounding, public intoxication and destruction of property.\nAccording to his criminal complaint, Monroe suddenly struck a male victim in the 1400 block of 5th Avenue in Huntington on Sept. 15, 2017, on the left side of his jaw with a closed fist, resulting in a fractured, disfigured, painful jaw injury. The victim was informed by doctors he will need reconstructive surgery to fix the disfigurement.\nIn a second Oct. 25, 2017, incident in the 2000 block of 10th Avenue in Huntington, Monroe allegedly kicked a female victim in the left leg, causing bruising, according to the complaint.\nA Cabell County grand jury returned the following unrelated indictments in February 2018. An indictment is a formal charge made against a person by a grand jury. It does not establish guilt or innocence. Addresses and ages for those indicted were not made available by Cabell County Prosecutor Sean “Corky” Hammers.\n• Justin Michael Albert: First-degree robbery, conspiracy and possession of a controlled substance.\n• Kenneth Douglas Dean: First-degree robbery and conspiracy.\n• Bradley Walter Bennett: Conspiracy.\n• Jason Scott Smith: Conspiracy.\n• Danny Ray Mers: Possession with intent to deliver a controlled substance and conspiracy.\n• Taylor Sponaugle: Entry of a building other than a dwelling, grand larceny, conspiracy, attempt to commit a felony and receiving stolen property.\n• Edward Mack Anderson: Possession with intent to deliver a controlled substance.\n• Antonio Dazell McClean: Delivery of a controlled substance and possession with intent to deliver a controlled substance.\n• Samuel Braheem Crawford: Possession with intent to deliver a controlled substance and conspiracy.\n• Sherry Dawn Farren: Possession with intent to deliver a controlled substance and conspiracy.\n• Lisa Dawn Nichols: Possession with intent to deliver a controlled substance and conspiracy.\n• Maurice Franklin Johnson: Possession with intent to deliver a controlled substance and conspiracy.\n• Jason Pratt Dawkins: First-degree robbery, conspiracy and possession of a controlled substance.\n• Emilee Dawn Dawkins: First-degree robbery, conspiracy and possession of a controlled substance.\n• Miranda Nicole Thompson: First-degree robbery, conspiracy and possession with intent to deliver a controlled substance, conspiracy and possession of a controlled substance.\n• Samantha Ann Hester: First-degree robbery, conspiracy and possession of a controlled substance.\n• James Lee Hughes II: Embezzlement.\n• Matt Allen Dillion: Domestic assault, brandishing, domestic battery, grand larceny, fleeing in a vehicle with reckless indifference and driving on a suspended or revoked license for miscellaneous reasons.\n• Scott Christopher Dupuie II: Grand larceny, attempt to commit a felony, conspiracy and burglary.\n• Allison Renee Gibson: Attempt to commit a felony and conspiracy.\n• Sydney Montana McGraw: Attempt to commit a felony and conspiracy.\n• Brett Robert Eyermann: Possession with intent to deliver a controlled substance.\n• Christopher Matthew Graphenreed: Possession with intent to deliver a controlled substance, conspiracy, driving under the influence causing serious bodily injury and driving under the influence causing bodily injury.\n• Tina M. Ratliff: Possession with intent to deliver a controlled substance, conspiracy, possession of a controlled substance and driving on a suspended or revoked license for miscellaneous reasons.\n• John Samuel Lowe: Burglary.\n• Jeremy Samuel Lowe: Burglary.\n• Joseph Holley: Burglary, petit larceny and felon in possession of a firearm.\n• Melvin Pearson Jones: Possession with intent to deliver a controlled substance and possession of a controlled substance.\n• Kimberly Ann Legrand: Possession with intent to deliver a controlled substance, obstructing an officer and conspiracy.\n• Brendon Michael Legrand: Conspiracy.\nFollow reporter Courtney Hessler at Facebook.com/CHesslerHD and via Twitter @HesslerHD.", "url": "https://apnews.com/9adae86f62ad4fe4b0701d780c9530cf"}