{"authors": ["Haley Heiden Special To The Daily News"], "date_download": "2020-05-04 20:13:12", "date_modify": "2020-05-04 20:13:12", "date_publish": "2018-11-27 14:37:00", "description": "Dick Bruner spent his early years learning from his 11 older siblings — and developing his faith in God, too. The Norfolkan, not surprisingly, developed a strong work ethic and faith that...", "filename": "_24f2ab6d5fd743f8bb2a23ff3d1a697d_1588623192.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_24f2ab6d5fd743f8bb2a23ff3d1a697d_1588623192.html", "title": "Even at age 86, Norfolkan still serving God and his community", "title_page": "Even at age 86, Norfolkan still serving God and his community", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Even at age 86, Norfolkan still serving God and his community\nDick Bruner spent his early years learning from his 11 older siblings — and developing his faith in God, too.\nThe Norfolkan, not surprisingly, developed a strong work ethic and faith that would serve him throughout his life.\nHe recalls going to the church school on his family’s farm in Cherokee County, Iowa. As a child, Bruner would listen to the minister, grasping the word of God — not yet aware of how it would impact his life.\nBruner confesses that he wasn’t an active Christian as a teenager. That changed when he met Vera, who would become his wife. Around 1950, the two met at an ice-skating rink while in their late teens. They married not long after.\n“Got married when I was 19. He’s preached to me ever since,” Vera said with a smile.\nA regular worship attendee, Bruner was eventually approached by his church’s pastor, who wanted him to consider preaching. But Bruner was in the appliance business at the time and would stay in it for 10 years.\nEven so, he told the minister that he would make his decision about perhaps changing occupations by the time he was 30.\nDuring his late 20s, Bruner got really sick. He promised God that if he’d spare his life, he’d serve as a minister for him. Bruner was spared and so he made his decision.\nAfter selling his appliance business, he and Vera moved to Norfolk, where he started to preach.\nBruner recalls his first time where only eight people attended and half were his family. Bruner came up with what he was preaching every week based on the community’s needs.\nAlso using his skills in business, he was on the building committee for First Christian Church. He acted as the liaison between the congregation members and the builder.\nBruner also was involved in helping First Christian sell its existing facility on 13th Street when the congregation built new at the intersection of Benjamin Avenue and Victory Road. The former church building on 13th Street now serves as a funeral home and chapel, which is something Bruner is proud of.\nAnother one of his projects is apartment buildings. He had started managing them before he came to Norfolk and decided to continue his work once here. He manages two apartments at the moment.\nNow, at age 86, Bruner said he had been retired three times. But as the youngest of 12 children, he learned the importance of work early in life and it’s continued with him through today.\nAccording to Bruner, the two most important things to teach kids are how to work and how to live godly lives.\nBruner said he believes it’s a process to get from this life to the next, and the easiest way to go through it is to help people along the way.\n“God doesn’t want us to just sit around. He wants us to do something while we’re here,” Bruner said.\nThese words are what has motivated his way of life.\nAfter all these years, he kept his promise. Not only did Bruner minister to others, but he continues to help his community in multiple ways.", "url": "https://apnews.com/24f2ab6d5fd743f8bb2a23ff3d1a697d"}