{"authors": ["Christian Hill"], "date_download": "2020-05-04 21:09:11", "date_modify": "2020-05-04 21:09:11", "date_publish": "2018-02-07 08:00:00", "description": "Eugene Water & Electric Board commissioners changed course and adopted an “opt out” policy for so-called smart meters with a unanimous vote Tuesday night. The decision means customers will...", "filename": "_6ee108ee39fe4b5fa6a3eac16c54c609_1588626551.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6ee108ee39fe4b5fa6a3eac16c54c609_1588626551.html", "title": "EWEB opts for ‘opt out’ smart meter policy", "title_page": "EWEB opts for ‘opt out’ smart meter policy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Eugene Water & Electric Board commissioners changed course and adopted an “opt out” policy for so-called smart meters with a unanimous vote Tuesday night.\nThe decision means customers will have to contact EWEB and specifically direct that the meter attached to their home or business not transmit their electric and water usage data. Currently, meter readers visit customers’ properties monthly and take down that information.\nUnder the old “opt in” policy adopted in 2013, when commissioners authorized the smart meter project, customers had to specifically request that EWEB authorize the meter to transmit that data.\nBut the change won’t happen overnight.\nCommissioners still need to approve the specific rule and the procedures that utility employees would follow under the new policy. General Manager Frank Lawson will bring back draft rules for commissioners’ review in March or April.\nThe decision came after commissioners heard testimony from more than a dozen residents — a majority of whom opposed the change because of health and privacy concerns — and asked numerous questions of Lawson and two other employees involved in the project.\nDuring the questioning, Lawson reassured commissioners that EWEB would give customers advance notice of a meter installation, explain the purpose of the project, and spell out clearly that they have the option to either opt in or opt out.\nThe general manager said that EWEB would not charge customers who decide to opt out, at least for the next several years.\n“EWEB is implementing this technology in a responsible way,” he said.\nThe decision comes as the utility will be ramping up its installation of the devices during the next eight years. EWEB has spent millions of dollars on the project that commissioners authorized more than four years ago.\nEWEB has installed about 4,000 of the meters since last year, with two-thirds of those customers giving their approval for the devices to transmit water and electric use data to the utility for billing.\nWith the utility slated to install more than 150,000 of the meters in the next eight years, Lawson told commissioners that the slow deployment of the technology under the opt-in policy is “incredibly inefficient” and keeps the community from realizing the system’s full benefits while costing more.\nPart of the problem with an opt-in policy is that while there’s a percentage of residents strongly for or against smart meters, most people fall in middle, and it can be difficult to get them to respond, Lawson said.\nEWEB estimated that a continued opt-in policy would cost $600,000 more a year during the eight-year installation period compared with the alternative because of increased labor costs.\nThe systemwide benefits include faster power restoration after a large-scale outage, reduction in carbon emissions and improving billing accuracy and utility operations.\nDuring public testimony, residents shared their concerns about the risks that meters pose to human health, personal privacy and local jobs.\nThe meters transit radio waves, a form of electromagnetic radiation, that might harm human health.\nEugene resident Bill Evans said he worried that EWEB was putting cost savings over human health with the policy shift. He noted that there hasn’t been a lot of funding put toward the research of the health effects of radio waves emitted by smartphones and smart meters.\n“If we save a lot of dollars one way or another and we’re not as healthy, what’s the point?” he asked.\nEugene resident Lisa Arkin said the millions of dollars that EWEB has spent on the project so far — which will lead to meter readers losing their jobs — could be better used on job creation.\n“As a public utility, you owe it to the community to create jobs, not lose jobs,” she said.\nDarlene Kelly, the director of property management for Homes for Good Housing Agency, a local provider of low-income housing, supported the policy shift. She said the meters will alert the agency more quickly to power outages, electrical problems and water leaks.\nEugene resident Matt McRae, a climate policy analyst by profession, said smart meters are key to the community’s effort to cut carbon emissions as meter readers no longer would have to drive all over the city.\n“The sooner we can do that, the better,” he said.\nCommissioners said that they appreciated the residents’ input and involvement but expressed skepticism that smart meters pose a health risk, given the amount of radio waves people are exposed to daily in today’s society.\nCommissioner Dick Helgeson said he has reviewed the information and research and hasn’t dismissed health concerns out of hand.\n“I have given thoughtful consideration and disagree with some of the conclusions,” he said.\nCommissioner Sonya Carlson said the faster power restoration that smart meters afford can prevent harm, because linesmen would spend less time out in dangerous conditions restoring power, and residents would spend less time in their cold homes trying to stay warm.\n“Those are also real health concerns,” she said.\nFollow Christian Hill on Twitter @RGchill . Email christian.hill@registerguard.com .", "url": "https://apnews.com/6ee108ee39fe4b5fa6a3eac16c54c609"}