{"authors": ["Debbie Carlson Tribune News Service"], "date_download": "2020-05-04 20:07:47", "date_modify": "2020-05-04 20:07:47", "date_publish": "2018-07-08 18:51:00", "description": "While some high-end companies such as Brooks Brothers have always made clothing in the U.S., it’s been difficult to buy American-made casual clothing because of the textile industry’s...", "filename": "_4578311c61be4ce8a82b0df3bab2df46_1588622867.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4578311c61be4ce8a82b0df3bab2df46_1588622867.html", "title": "‘Grown and sewn in the US’: It’s getting easier to buy completely American-made clothing and home goods", "title_page": "‘Grown and sewn in the US’: It’s getting easier to buy completely American-made clothing and home goods", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "While some high-end companies such as Brooks Brothers have always made clothing in the U.S., it’s been difficult to buy American-made casual clothing because of the textile industry’s consolidation in recent decades, as several mills closed.\nBut the industry didn’t die completely, and now there’s a renaissance of startup labels selling U.S.-made products — both clothing and home goods — where the focus is on high-quality U.S. craftsmanship priced competitively with imports.\nFor these sellers, having everything in the entire supply chain — or nearly all — be U.S.-based is an important part to supporting local communities. Several factors and macroeconomic trends make “grown and sewn in the U.S.” possible: e-commerce lets small firms tell a story and sell directly to consumers who have an interest in natural fibers such as cotton and wool, a willingness to invest in longer-lasting higher-quality goods and a desire to shop local.\nNot surprisingly, many of these labels started because they couldn’t find what they were looking for. At McIntosh, founder of Homegrown Cotton , was disappointed the better-quality polo shirts costing from $80 to $90 were imports.\nHe wanted to keep production as local as possible and guarantee it’s only his cotton in every polo, so every step of the process is done in North and South Carolina. The shirt’s final cutting and sewing happens 40 miles from his farm.\nTaking a page out of the farm-to-table movement, Anna Brakefield and Mark Yeager, father-daughter owners of Alabama-based Red Land Cotton , call their bedding and towel brand a “farm-to-home” product. By growing and ginning their own cotton, they create a higher-quality fiber, which is spun, woven and finished in South Carolina and Georgia before being sewn in their hometown. To differentiate their sheets from other luxury brands, they sent U.S. textile engineers samples of sheets from the 1920s to re-create the quality and feel of heirloom sheets.\nTheir Madeline Gray Lace sheets (sheet set starts at $230) are named after the family friend who donated those original 1920s sheets for testing.\nRob McMillian, founder of Chicago-based Dearborn Denim , said when he started the company in 2016, he wanted to create an all-American apparel company that produced high-quality products at an affordable price to show that locally made goods don’t have to be more expensive. Even though the manufacturing costs are higher in Chicago than using foreign products and labor, the e-commerce route helped keep costs down. His women’s and men’s jeans cost around $60, competitive with prices of jeans from The Gap and Levi’s.\nThese labels’ journey to retail hasn’t been easy, whether it was finding who would segregate their cotton or offer smaller amounts of material, they said. Tom Chappell, founder of Ramblers Way , which offers organic wool and cotton clothing online and does custom-made clothes in their shops in Maine and New Hampshire, said it took a lot of trial and error to get the fabric quality he wanted and to do it sustainably.\nEventually they built their own factory in Canton, Mass., so they could create a superfine worsted Rambouillet merino and organic merino wool that wasn’t itchy and could be worn year-round.\nBrakefield said they had a hard time finding sewers who could do some of the finer detail hemming for their sheets but found a small-scale sewing firm in their hometown to finish the sheets, an operation which she said otherwise would have closed.\nThere is interest in buying U.S. products. A survey by Cotton Incorporated, the cotton industry’s research and promotion arm, showed 66 percent of consumers say they are interested in buying U.S.-made clothing made with U.S.-grown cotton. McMillian said American-made gets people’s attention, but getting people to buy still comes down to quality.\n“Generally, the sentiment (from customers) is, I love the pants, and I love the fact that they’re made-in-Chicago pants. That’s the cherry on top. But we shouldn’t rely on the made-in-America angle as the sole reason to buy our pants,” he said.", "url": "https://apnews.com/4578311c61be4ce8a82b0df3bab2df46"}