{"authors": ["John Bear Staff Writer"], "date_download": "2020-05-04 20:12:34", "date_modify": "2020-05-04 20:12:34", "date_publish": "2018-01-25 01:17:42", "description": "A Longmont woman who ran over a woman and struck another man in the parking lot of a store in 2014 after they called police because she went into a store to buy pickles and left her small child in...", "filename": "_2301687aa3244b1aa74d3c0e4f322884_1588623154.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2301687aa3244b1aa74d3c0e4f322884_1588623154.html", "title": "Longmont Woman Sentenced in 2015 for Hitting Two People with Car Arrested on DUI, Resisting Arrest Charges", "title_page": "Longmont Woman Sentenced in 2015 for Hitting Two People with Car Arrested on DUI, Resisting Arrest Charges", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Longmont woman who ran over a woman and struck another man in the parking lot of a store in 2014 after they called police because she went into a store to buy pickles and left her small child in the car alone has been arrested for DUI and resisting arrest.\nA Longmont police report indicates Kristina Riddell, 30, was arrested Monday morning shortly after midnight on suspicion of resisting arrest, DUI and three traffic offenses following a traffic stop near 500 block of Ninth Avenue.\nThe report states that when Riddell refused to undergo a field sobriety test, an officer attempted to arrest Riddell, who dug her heels into the snow and became angry when the officer would not answer her phone. Police eventually had to pick Riddell up and place her in a patrol car when she went limp.\nRiddell, who told police she had been driving home from a work party, said that she was a mother and the officers were “ruining her life.” She refused to take a chemical test at the Safety and Justice Center and was later taken to Boulder County Jail. She was not listed in custody on Wednesday.\nRiddell pleaded guilty to one count of vehicular assault in 2015 that stemmed from an incident in 2014 when a dispute broke out after a man and woman called police to say Riddell left a child unattended in a car. Police said Riddell ran over the woman’s leg and struck the man, who flew up on the roof of her car.\nRiddell was spared prison because she was pregnant at the time of her sentencing. She was instead sent to jail for 10 days, nine months of work release and ordered to pay $23,000 in restitution and attend anger management classes.\nJohn Bear: 303-473-1355, bearj@dailycamera.com or twitter.com/johnbearwithme", "url": "https://apnews.com/2301687aa3244b1aa74d3c0e4f322884"}