{"authors": ["Sid Hartman"], "date_download": "2020-05-04 20:07:10", "date_modify": "2020-05-04 20:07:10", "date_publish": "2018-01-31 15:18:17", "description": "There has been a lot of talk about Patriots quarterback Tom Brady and his connection to Minnesota with his grandparents living in Browerville. But theres another great connection to Minnesota and...", "filename": "_b954d49101094cca97eaea23f0faf47b_1588622830.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b954d49101094cca97eaea23f0faf47b_1588622830.html", "title": "Gophers' Gino Cappelletti became 'Mr. Patriot'", "title_page": "Gophers' Gino Cappelletti became 'Mr. Patriot'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "There has been a lot of talk about Patriots quarterback Tom Brady and his connection to Minnesota with his grandparents living in Browerville. But theres another great connection to Minnesota and the Patriots with Mr. Patriot himself, Gino Cappelletti.\nCappelletti, the Keewatin, Minn., native who played in college for the Gophers, was on the first Boston Patriots team in the American Football League back in 1960 and played there for 11 seasons before retiring after the 1970 season.\nHis career in New England was one of the greatest in team history.\nWith the Gophers, Cappelletti kicked extra points for coach Wes Fesler, but back then the team didnt attempt field goals. From 1953 to 54, Cappelletti connected on 31 consecutive extra points. He was also a punter as a senior in 1954. He scored three touchdowns as a receiver in 1952, while still attempting PATs.\nDuring his senior season, Cappelletti became the starting quarterback and helped the Gophers go 7-2.\nIt was that kind of multipurpose production that made Cappelletti appealing to the Patriots, even if he was never drafted, playing in the CFL for a few years after leaving Minnesota.\nWe played in Providence, Rhode Island, for the first game, Cappelletti recalled. I remember Bob Mac [Gophers halfback Robert McNamara] and me and a couple of other players played flag football, or whatever you might call it. You know what happened, it was Bob Soltis and three or four guys that came with me to Boston.\nThere were 160 players that tried out for the Patriots and six of them were former Gophers: Cappelletti, McNamara, Soltis, Dick Blakley, Bobby Cox and Gordy Holz.\nOnly Cappelletti and Soltis made the Patriots. Holz and McNamara both made it with the Denver Broncos in 1960.\nI did not miss one game in 10 years, Capelletti said. I did not miss playing in one game in 10 years. Its just lucky. I never got injured enough to keep me out of a game, and I was a starter every game that we played.\nAll-time great\nIn his 11-year career as a receiver and kicker, Cappelletti made 342 of 353 extra points and connected on 176 of 333 field-goal attempts. He also caught 292 passes for 4,589 yards with 42 touchdowns. He completed his only pass, for a 27-yard touchdown against the New York Titans in 1961.\nHe remained the Patriots all-time leading scorer until 2005, when he was passed by Adam Vinatieri.\nCappelletti was a five-time All-Pro and the AFL MVP in 1964, and he had his No. 20 retired by the Patriots along with being inducted into their Hall of Fame. Not bad for a kid from the Iron Range.\nOn top of that, he served as the Patriots radio color commentator for 28 years until 2012. He called 585 games, including six Super Bowls, alongside his broadcasting partner Gil Santos. That endeared him even more to the Patriots and their fans.\nCappelletti, 83, said that these days, he still follows the team from his home in Massachusetts.\nParcells coaching tree\nOne of the people who Vikings coach Mike Zimmer relies on most to talk about coaching is Bill Parcells, the NFL Hall of Famer whom Zimmer talks to almost weekly during the season.\nParcells was both pragmatic and sympathetic when asked about the Vikings final game of the season, their 38-7 loss at Philadelphia in the NFC Championship Game, especially with a chance to play in the Super Bowl on the line.\nI felt sorry for him, Parcells said of Zimmer.\nThe legendary coach certainly can relate. He guided the New York Giants to Super Bowl victories following the 1986 and 1990 seasons. But he also knows what its like to suffer a loss in a big moment.\nThe final time Parcells made a Super Bowl was after the 1995 season with the Patriots, the franchises second of 10 Super Bowl appearances. New England lost to Brett Favre and Green Bay 35-21 in Super Bowl XXXI in New Orleans.\nThe Patriots led 14-10 after one quarter only to be outscored 25-7 as the Packers beat them going away.\nParcells said that tough losses are a part of the business.\nIt happens to everyone that has ever coached, he said.\nParcells said he didnt know what happened to the Vikings against the Eagles. But he said what Zimmer and his coaches were able to accomplish this season, after losing their starting quarterback and running back, was tremendous.\nHe overcame a lot of things, Parcells said.\nWhile Zimmer worked for four seasons with Parcells in Dallas, Parcells greatest coaching connection is with the Patriots Bill Belichick, the defensive coordinator on Parcells two Giants championship teams.\nESPN will run a feature documentary about Parcells and Belichick on Thursday that showcases the unique and sometimes strained relationship between the two. But there was no doubt in talking to Parcells ahead of the feature that he has a lot of respect for how far Belichick has come as a coach.\nWhen asked about what has given Belichick such great longevity in the NFL, Parcells said there were a few factors.\nI coached with him for 14 years you know I just think he knows what hes looking for, Parcells said. He knows what hes doing. He has a good support system. He was able to find a great quarterback and that guy has helped the team sustain, along with some other things.\nHe has good coaches. He has everything that a good organization has, and the results speak for themselves. It has been tremendous.\nParcells recalled that when he was first hired as Giants coach, Belichick was already on the coaching staff, and Parcells instantly had a high regard for him.\nParcells said a lot of the traits he saw in Belichick at the start of his career remain today.\nHe studies the game. Hes a coachs son. He grew up with football, and he loves it, and hes very dedicated and passionate, Parcells said. He knows how to fit into a system, and he does a good job of acquiring the people that fit.\nParcells was asked if having a quarterback like Tom Brady makes it easier to run a smooth system.\nIt certainly helps a lot, he said.\nSid Hartman can be heard on WCCO AM-830 at 8:40 a.m. Monday and Friday, 2 p.m. Friday and 10:30 a.m. Sunday. shartman@startribune.com", "url": "https://apnews.com/b954d49101094cca97eaea23f0faf47b"}