{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:09:22", "date_modify": "2020-05-04 20:09:22", "date_publish": "2018-07-03 15:27:42", "description": "By FERNANDO DEL VALLE Staff Writer RAYMONDVILLE — U.S. Immigration and Customs Enforcement is coming back to town.", "filename": "_26c45aedb2d043ec8a28730e4d0dbb0b_1588622962.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_26c45aedb2d043ec8a28730e4d0dbb0b_1588622962.html", "title": "ICE to hold inmates in new Willacy detention center County enters into contract", "title_page": "ICE to hold inmates in new Willacy detention center County enters into contract", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ICE to hold inmates in new Willacy detention center County enters into contract\nBy FERNANDO DEL VALLE\nStaff Writer\nRAYMONDVILLE — U.S. Immigration and Customs Enforcement is coming back to town.\nYesterday, Willacy County commissioners reviewed a contract with ICE to hold inmates at a new 1,000-bed detention center here.\nCounty Judge Aurelio Guerra said commissioners reviewed the contact to determine whether it might include changes made after they approved the pact in a June 25 meeting.\nThe detention center will open at the site of the former 3,000-bed Willacy County Correctional Center which shut down in March 2015, laying off 400 employees and slashing a third of the county’s $8.1 million general fund budget.\n“Since that time, we’ve been putting our efforts into landing a contract,” Guerra said before the meeting. “The jobs are needed and Willacy County remains in need of improving the local economy. We’re still in need of circulating dollars.”\nFrom the audience, members of Austin-based Grass Roots Leadership and the Rio Grande Valley Equal Voice Network said they opposed the contract because it would lead to the detention of undocumented immigrants.\nIn May, Management & Training Corp. announced it was planning to open a 1,000-bed detention center at the site of the former minimum-security prison largely made up of tent-like domes.\nAt the time, Raymondville Mayor Gilbert Gonzales said MTC was planning to hire 50 to 75 employees.\nIn March 2017, the county sold the 53-acre prison site to MTC after bond holders demanded payment of a $68 million debt.\nAs part of the sale, the agreement will pay the county $3 a day for every inmate held in the new detention center.\nAt full capacity, the 1,000-bed detention center would pay the county about $1 million a year, calculations show.\nThe contract will mark the second time ICE has held inmates here.\nsubhed\nHow we got here\nIn 2006, the $60 million 3,000-bed tent-city opened as an MTC-run detention center which held ICE inmates.\nHowever, under ICE the detention center fell far short of developers’ plans, with the agency filling about half of tent-city’s 3,000 beds.\nBy June 2011, ICE had pulled out, leading to the 120 layoffs.\nThen, developers proposed the Federal Bureau of Prisons take over the facility.\nSoon, the BOP had turned the facility into a minimum-security prison, nearly filling its 3,000 beds with undocumented immigrants convicted of crimes.\nOn Feb. 20, 2015, rioting inmates destroyed much of the facility largely made up of 10 Kevlar tent-like domes.\nWeeks later, the BOP terminated MTC’s contract to hold inmates in the prison described as “uninhabitable.”\nThe prison’s closure led to the layoffs of 400 employees paid some of the highest wages in the area, sparking a financial crisis in this farming region.\nEver since then, county officials have worked with MTC to land a contract to fill the prison site and create jobs in this area struggling with high unemployment.\nLast year, MTC, which operated the facility since it opened in 2006, removed the sprawling tent-like domes while repairing the remaining 1,000-bed concrete housing unit on the 53-acre property surrounded by two high razor-wire fences.", "url": "https://apnews.com/26c45aedb2d043ec8a28730e4d0dbb0b"}