{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:03:50", "date_modify": "2020-05-04 20:03:50", "date_publish": "2018-01-26 06:50:00", "description": "May 19, 1965 – Jan. 15, 2018 Pamela Jean Lorshbaugh, 52, of Lake Havasu City, passed away on Jan. 15. She was born in Pittsburgh on May 19, 1965, the daughter of Richard and Carolyn...", "filename": "_b88ae373d56f4fecb36af526aa41d6f7_1588622630.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b88ae373d56f4fecb36af526aa41d6f7_1588622630.html", "title": "Pamela Jean Lorshbaugh", "title_page": "Pamela Jean Lorshbaugh", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "May 19, 1965 – Jan. 15, 2018\nPamela Jean Lorshbaugh, 52, of Lake Havasu City, passed away on Jan. 15.\nShe was born in Pittsburgh on May 19, 1965, the daughter of Richard and Carolyn Cecotti.\nAfter graduating high school, Pamela attended the Western School of Health and Business, where she achieved her certification in ultrasound. She became an ultrasound technician at Havasu Regional Medical Center.\nPamela and Robert Lorshbaugh were united in marriage in Las Vegas on July 22, 2013.\nPamela loved to play bunco, go off-roading, boating, attend different concerts, and head down to the lake to enjoy the day in the water with her friends and family. Pamela also was a member of the Havasu Trail Association.\nPamela is survived by her parents, Richard and Carolyn Cecotti, of Pittsburgh; husband, Robert Lorshbaugh, of Lake Havasu City; daughters, Heather Alley of Bullhead City and Amber Humphries of Pittsburgh; sisters Michelle Travers of Pittsburgh, Joanne Lewis of Melbourne, Florida, and Jeanne Roman of Altoona, Pennsylvania.\nServices were placed in the care of Lietz-Fraze Funeral Home. Thoughts and condolences can be sent to the family at www.lietz-frazefuneralhome.com. To send a free card to the family, go to www.sendoutcards.com/lietzfraze.", "url": "https://apnews.com/b88ae373d56f4fecb36af526aa41d6f7"}