{"authors": ["Logan Wroge", "Wisconsin State Journal"], "date_download": "2020-05-04 20:05:28", "date_modify": "2020-05-04 20:05:28", "date_publish": "2018-01-28 20:52:00", "description": "Burnie's Rock Shop was broken into early Sunday morning with several thousands of dollars in merchandise being stolen, Madison police Chief Mike Koval said in his daily incident...", "filename": "_f6e1077aba21482bbf47bad447d95a3a_1588622728.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f6e1077aba21482bbf47bad447d95a3a_1588622728.html", "title": "Thousands of dollars of goods stolen from Burnie's Rock Shop, police chief says", "title_page": "Thousands of dollars of goods stolen from Burnie's Rock Shop, police chief says", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Thousands of dollars of goods stolen from Burnie’s Rock Shop, police chief says\nBurnie’s Rock Shop was broken into early Sunday morning with several thousands of dollars in merchandise being stolen, Madison police Chief Mike Koval said in his daily incident blog.\nOfficers went to the jewelry store at 901 E. Johnson St. around 1:15 a.m. after an alarm was triggered, Koval said. A window in the front of the store was smashed, and a trail of blood led away from the business, Koval said.\nThe store was checked by officers, and the robbery remains under investigation, he said.\nA Sunday afternoon post on the Facebook page for Burnie’s Rock Shop appealed to the public for help in finding out who broke into the store.\nThe post said sterling silver chains, colored gemstone rings and pendants in silver had been stolen. Another post on the business’s Facebook page said the store would be closed Sunday and reopen on Tuesday.\nBurnie’s Rock Shop, which specializes in rocks, minerals, gems and associated jewelry, started in 1962 and moved to its current East Johnson Street location from Monroe Street in 1976.", "url": "https://apnews.com/f6e1077aba21482bbf47bad447d95a3a"}