{"authors": ["Kimberly Cauvel"], "date_download": "2020-05-04 20:26:09", "date_modify": "2020-05-04 20:26:09", "date_publish": "2018-10-11 18:00:00", "description": "SEDRO-WOOLLEY — In about a year and a half, a new Sedro-Woolley area library will open to the public, boasting a new book collection and designated space for activities ranging from quiet reading...", "filename": "_452d669f983f4136ac2640f7fb10e979_1588623969.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_452d669f983f4136ac2640f7fb10e979_1588623969.html", "title": "Sedro-Woolley library design nearly complete", "title_page": "Sedro-Woolley library design nearly complete", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEDRO-WOOLLEY — In about a year and a half, a new Sedro-Woolley area library will open to the public, boasting a new book collection and designated space for activities ranging from quiet reading time to children’s learning programs.\nThe 11,125-square-foot building will have a largely wooden exterior, high ceilings and glass interior walls separating meeting and activity rooms from the central library space. There will be a parking lot and entrance to the north, and a sidewalk accessible entrance to the south.\nThe vision — shared by SHKS Architects at a joint Sedro-Woolley City Council and Central Skagit Library board meeting Wednesday — is to create a place where the community can read, work, learn and socialize.\n“Every time you come to the library it should be like a kind of discovery experience,” Kevin Kane of SHKS Architects said.\nKane showed the City Council, the library board and about 30 community members the floor plan and potential furniture selections. Kane also showed videos of the design for the library.\n“I was impressed with how big it is,” Central Skagit Library board member Mindy Coslor said after seeing the videos. “Once we could kind of see our way through and visualize it, that was very helpful.”\nSHKS Architects has had help fine-tuning the design from a committee that includes several City Council and library board members. Kane said the committee has met every week since an early design of the library was shared with the public in June .\nSedro-Woolley Mayor Julia Johnson and City Supervisor and Attorney Eron Berg said it’s exciting to have the design 90 percent complete.\n“We’re on track and on budget to move into this new building in the spring of 2020,” Berg said.\nHe said work will take place through October at the library site, 100 W. State St., to address asbestos in existing buildings, demolish those buildings and put up a fence.\nThe plan is for construction to begin in early 2019.\nKane said several changes were made to the design following the June meeting.\n“At our 30 percent design meeting ... a couple of things came out really clearly, and one of those was that books are important,” he said.\nThe updated design includes more shelving throughout the center of the library, along the outer walls and within areas designated for children and youths.\n“The other thing we heard is that there is a desire for more flexible space,” Kane said.\nIn response, the design committee decided to designate the largest meeting space for STE(A)M — Science, Technology, Engineering, Art and Math — activities as well as for large community presentations or events.\nIn addition, there are rooms that can be used for presentations, a children’s activity room, an area with computers, a room for quiet reading and landscaping where outdoor activities can take place.\n“Those all hopefully work together to create sort of a critical mass of social gathering opportunity,” Kane said.\nA rain garden outside the building will filter water from the parking lot and library roof. The building is also being configured in a way to support possible solar development, Kane said.\nWood will feature prominently in the building’s exterior and interior. Flooring will be a mix of concrete and carpet, which Kane said will be largely a neutral gray with some blue.", "url": "https://apnews.com/452d669f983f4136ac2640f7fb10e979"}