{"authors": ["Tom Meersman"], "date_download": "2020-05-04 20:08:27", "date_modify": "2020-05-04 20:08:27", "date_publish": "2018-04-06 21:30:04", "description": "Robots have long been part of the factory floor, and self-driving cars have been the buzz for a couple of years now. But a Minneapolis-based startup company is trying to bring more...", "filename": "_a8765a90b3cd43e5a28b214d96aa3c4b_1588622907.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a8765a90b3cd43e5a28b214d96aa3c4b_1588622907.html", "title": "Rowbots Systems help bring the future to farming", "title_page": "Rowbots Systems help bring the future to farming", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Robots have long been part of the factory floor, and self-driving cars have been the buzz for a couple of years now.\nBut a Minneapolis-based startup company is trying to bring more automation into agriculture. It has invented a self-driving rowbot thats basically a lightweight tank on wheels with sensors and a GPS system that can drive between row crops, dispensing nitrogen fertilizer or completing other tasks.\nThree brothers founded Rowbot Systems LLC in 2012, and are seeking capital as they continue to test and improve their prototype and produce additional machines.\nThe company was one of 11 firms in North and South America selected to present their businesses recently at Google Demo Day in San Francisco, attended by Google executives and streamed to investors around the country.\nTo meet the selection criteria, each startup must have raised at least $100,000 and must be seeking to actively raise between $1 million and $5 million during the next six months.\nRowbot CEO Kent Cavender-Bares said that so far the company has focused on fertilizing corn, but the robot platform could also potentially spray herbicides or pesticides when needed, plant cover crop seeds between the corn rows in early fall before harvest, or mechanically kill off weeds that have become resistant to chemicals.\nNormally a corn farmer will spray much of the nitrogen fertilizer at the time of planting, and side-dress the corn crop with additional nitrogen in mid-June before stalks grow too high.\nThe problem is that spring rains often wash away much of the nitrogen, which isnt really needed the most until the plant is growing fastest in June and July. Even adding nitrogen in June can be tricky, said Cavender-Bares, because heavy equipment can cause ruts, and by July the cornstalks may be too high to allow spraying.\nThe idea is for a fleet of rowbots to drive through a field two or three times a summer when the corn is growing most rapidly, spraying fertilizer to cover four rows at a time in the places and amounts where it is needed, he said.\nThis represents a clear win-win opportunity because we can help farmers use nitrogen more efficiently while also reducing the amount that ends up in the water, Cavender-Bares said. The goal is to reduce whats leaving the field and the flip side is to increase whats going into the crop.\nRowbot Systems is extremely innovative, said David Mulla, professor and director of the precision agriculture center at the University of Minnesota, who is familiar with the company but not a financial investor.\nIt has a guidance system that allows it to travel between the rows without running over the crop, said Mulla. And then when it gets to the end of a row it can turn around and come back, so the navigation part of it is actually pretty sophisticated.\nThe robots can also be linked to systems that tell it how much fertilizer to apply to different parts of the field, thereby saving farmers time and money.\nDave Boehnke, a hog and crop farmer near Garner in north-central Iowa, said the promise of economic benefits is what attracted him to invest in the company, and to allow a demonstration of the prototype rowbot on one of his fields.\nIf the technology attracts capital and scales up, it can save money on chemicals and lessen environmental concerns, he said. Its the best of both worlds. The best way to solve environmental problems is through science and innovation.\nBoehnke said that machines that can work around the clock could also alleviate the growing shortage of workers on farms.\nCavender-Bares said the company is now working on three new rowbots and would like to add 10 to 20 more in 2019, depending on finances. Our goal would be to get on more fields and do more testing and get in the marketplace in 2019, he said, building its business and testing its business model. Initially the company would lease the machines to individual farmers or co-ops to use.\nMulla said that theres growing interest in robotic systems in agriculture, on the ground and overhead with drones.\nChina and Japan are using drones with huge spray tanks in production agriculture, he said, spraying crops with fertilizer or herbicides.\nThats where were eventually headed in general, he said. Were going to see more fleets of aerial and ground robots to do a lot of agricultural management tasks.", "url": "https://apnews.com/a8765a90b3cd43e5a28b214d96aa3c4b"}