{"authors": ["Deron Snyder The Washington Times"], "date_download": "2020-05-04 20:07:14", "date_modify": "2020-05-04 20:07:14", "date_publish": "2018-11-18 20:58:30", "description": "LANDOVER Every now and then, we get a gruesome reminder of how crazy-violent football can be. The notice comes without warning and often isn't grasped fully until we see watch the wreckage in slow...", "filename": "_42ca822b648de6874c038ae5f79a8297_1588622834.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_42ca822b648de6874c038ae5f79a8297_1588622834.html", "title": "Alex Smith injury could change franchise's plan", "title_page": "Alex Smith injury could change franchise's plan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LANDOVER Every now and then, we get a gruesome reminder of how crazy-violent football can be. The notice comes without warning and often isn’t grasped fully until we see watch the wreckage in slow motion.\nThen we must decide whether to stomach subsequent replays. Announcers might advise the queasy to look away.\nSo much can change in that instant, in the flash when limbs and ligaments are bent in awkward, grotesque fashion. Careers can end and seasons can be altered. Fill-ins can emerge and jobs can be lost. Victories can become defeats and losses can be averted.\nWe don’t yet know the long-term implications of the broken right leg Alex Smith suffered in Sunday’s 23-21 home loss against the Houston Texans. Former Washington quarterback Joe Theismann who was in attendance suffered the same injury 33 years ago and never played again.\nHe was 35 years old; Smith is 34.\nAll of the sudden, Smith’s future in D.C. looks iffy. He’s under contract for four more seasons but questions already were being raised, even as he skippered Washington to a 6-3 record. And the one thing he does best avoiding interceptions was a just a rumor Sunday.\nHe threw a second-quarter pick that was returned 101 yards for a touchdown, drilling safety Justin Reid between the numbers as tight end Jason Reed broke inside. Smith threw another interception two passes later, deep in his own territory, while improvising after his protection broke down. Linebacker Brennan Scarlett had tight coverage on halfback Kapri Bibbs and reached in front for the turnover.\n“People throw interceptions all the time,” coach Jay Gruden said. “It’s unlike him based on his history.”\nIt’s also unlike Smith to lead his team back from a 10-point deficit, which nearly swelled after his second interception. But Washington’s defense stiffened and Houston’s Ka’imi Fairbairn missed a 44-yard field goal. With Washington behind at the half, 17-7, there were rumblings that backup Colt McCoy would provide a better chance to win.\nBut no one wanted Smith to exit like he did, carted off with his leg in an air cast.\nCornerback Kareem Jackson blitzed on a third-and-nine and made a quarterback sandwich with defensive end J.J. Watt. Smith went down in a heap and took off his helmet, grimacing in obvious pain. Players on the field took a knee and both sidelines came out to pat him on the back before the cart pulled off.\n“It’s obviously a very unfortunate thing to happen,” Washington center Chase Roullier said. “You say your prayers as it’s happening and then you’ve got to get ready for the next play with Colt coming in. The game’s not over at that point and you’ve got to just keep pushing on.”\nPush on they did. McCoy’s first pass in relief was good for a 9-yard touchdown to Jordan Reid. He led a 10-play, 67-yard touchdown drive on the team’s next possession, giving Washington its first lead change of the season.\nMeanwhile, Smith was being prepped for surgery “right away” according to Gruden.\n“I think we’re all gutted for Alex,” Watt said. “You go out there and play this game and you know the risks going into it, but you never want to see anybody hurt or injured, especially out for the year. I feel absolutely terrible for him. It sucks. It’s the worst part of the game.”\nIt’s the part that every player knows about but doesn’t talk about. Not until it’s unavoidable, when it happens right in front of them. Unlike racecar drivers who scream around turns at 200-plus mph, football players crash intentionally.\nBut they keep the potential consequences far, far from their minds.\n“You can think about that kind of stuff,” guard Tony Bergstrom said. “You always know what you’re doing. You’re flinging your body around the whole time. If you’re playing scared of getting hurt, that’s when you get hurt.”\nAnd they can get hurt when they’re not scared, too.\nThe devastating injuries always come when we least expect them. Because we never truly expect them. We anticipate that players will rise, regardless, and return to the huddle or sideline, even though we know it doesn’t always work that way.\nSometimes, as in Theismann’s case, that last play was literally a guy’s last play.\nWashington moves on to Dallas with McCoy at the helm. Smith moves on to a lengthy rehabilitation and ... who knows? A full recovery? A new team? An injury settlement?\nThe questions following Sunday’s game are a lot different than they were entering the game. Figuratively speaking, Washington and Smith go their separate ways for now, the NFC East title on one track, convalescence on the other track. Different problems, different issues, different goals.\nThat’s simply how these things can happen in football.\nIn a snap.\n⦁ Deron Snyder writes his award-winning column for The Washington Times on Tuesdays and Thursdays. Follow him on Twitter @DeronSnyder.", "url": "https://apnews.com/42ca822b648de6874c038ae5f79a8297"}