{"authors": ["Macaela J. Bennett"], "date_download": "2020-05-04 20:05:06", "date_modify": "2020-05-04 20:05:06", "date_publish": "2018-02-19 20:16:44", "description": "Rent prices for downtown Greenwich office space have been touted among the most expensive in the country as its vacancy rate drops. A recent office market study ranks Greenwich Avenue as the...", "filename": "_aa8c0977f91341c4a45a5c09a351e8a2_1588622706.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aa8c0977f91341c4a45a5c09a351e8a2_1588622706.html", "title": "Downtown Greenwich office space ranks among nation’s most expensive", "title_page": "Downtown Greenwich office space ranks among nation’s most expensive", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Rent prices for downtown Greenwich office space have been touted among the most expensive in the country as its vacancy rate drops.\nA recent office market study ranks Greenwich Avenue as the fifth priciest area to rent business space in the U.S. At around $86.50 per square foot, downtown Greenwich outpriced Pennsylvania Avenue in Washington, D.C., Ocean Avenue in Los Angeles and Boston’s Boylston Street, per real estate brokerage JLL’s Most Expensive Streets report.\nJLL features 10 areas ranked by their ability to capture top-dollar office rents. San Francisco’s Sand Hill Road topped the list with companies, including prominent venture capital firms, paying more than $119 on average per square foot. JLL noted that rents have hit as high as $185 there.\nNew York City ranked second with Fifth Avenue fetching $116 average rents and also having a $185 ceiling. Hedge funds, investments banks and law firms all pay to claim the address.\nSan Francisco also took third place with Mission Street addresses costing nearly $94 per square foot. Main Street in Boston, located around Kendall Square in Cambridge, Mass., ranked fourth. There, the vacancy rate hovers around 5 percent with office space renting for $90.\nDowntown Greenwich boasts a tight and relatively small office market with many high-profile financial firms vying to be located near the Metro-North train station and primary roadways. According to JLL, office addresses in Greenwich’s central business district typically cost more than $86. At times, tenants have paid north of $100 per square foot, which is a 177 percent premium compared to the rest of Fairfield County, JLL reported.\nSubstantial leases signed by Interactive Brokers, JP Morgan Private Banking and A&M Capital Partners at the end of last year helped lower the downtown area’s vacancy rate to almost 11 percent. That compares to more than a quarter of office space being available for rent in the rest of Fairfield County, according to Newmark Knight Frank’s 2017 Q4 report.\nPremium offices are faring well across the country, according to JLL, which said less than 13 percent of the nation’s most expensive real estate is vacant, much lower than the U.S. average.\n“In the battle for talent, companies are always looking for something new to give them an edge,” JLL’s Managing Director of Agency Leasing Chris Roeder said in a statement. “Developers recognize that these high-end amenities — roof decks, open and collaborative space, etc. — will draw the big name tenants that help developments stand out.”\nContact the writer at mbennett@greenwichtime.com; Twitter @Macaela_", "url": "https://apnews.com/aa8c0977f91341c4a45a5c09a351e8a2"}