{"authors": ["Jesse Tinsley"], "date_download": "2020-05-04 20:09:25", "date_modify": "2020-05-04 20:09:25", "date_publish": "2018-06-04 00:00:00", "description": "Robert “Bob” Strahorn, who made and lost at least three fortunes in his lifetime, is remembered as a rail promoter and optimist. Strahorn (1852-1944) and his wife, Carrie Adell “Dell”...", "filename": "_c6c176bca81d48a082a2ed1502dfcd85_1588622965.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c6c176bca81d48a082a2ed1502dfcd85_1588622965.html", "title": "Then and Now: Union Station", "title_page": "Then and Now: Union Station", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Robert “Bob” Strahorn, who made and lost at least three fortunes in his lifetime, is remembered as a rail promoter and optimist.\nStrahorn (1852-1944) and his wife, Carrie Adell “Dell” Strayhorn (1854-1925), had a great impact on how the western United States was developed in the late 19th century. Their travel writing told the story of the wild frontier in the largely unexplored lands west of the Mississippi.\nRailroad tycoon Jay Gould put Strahorn in charge of the publicity department of the Union Pacific Railroad around 1877. For almost a dozen years, mostly before any transcontinental railroads were connected, the Strayhorns traveled by stagecoach to the places they expected the railroad would soon arrive, trying to drum up interest in moving west. They wrote about the land and the farmers, miners, loggers and speculators who were changing what would become the Western states.\nStrahorn would make recommendations to rail planners about new routes and where new towns and train stations should be placed. He would sometimes speculate himself, investing his own money.\nHe was nearly lynched by a mob from Boise in 1883, when city founders learned he was promoting Caldwell over their town.\nIn 1888, he left the UP and joined a group developing Fairhaven, a town south of Bellingham, in the hope that it would be the western terminus of James J. Hill’s Great Northern transcontinental railroad. But Hill chose Seattle as his terminus and the Fairhaven partners lost their shirts.\nThe Strahorns moved to Boston and started a bond trading business. Even with trading success, Bob Strahorn still dreamed of building his own railroad. In 1898, the Strahorns returned to Spokane.\nStrahorn began to plan a new downtown Spokane train station to compete with Hill’s Great Northern depot, built in 1902.\nWall Street tycoon Edward Harriman pledged $500,000.\nUnion Station opened in 1914, serving the OWR&N, Union Pacific and Milwaukee Road, along with Strahorn’s North Coast Railroad.\nStrahorn continued to build his network of lines, but the Great Depression was a catastrophe. Overextended on credit, he signed everything over to creditors.", "url": "https://apnews.com/c6c176bca81d48a082a2ed1502dfcd85"}