{"authors": ["Geoff Hill - Special To The Washington Times The Washington Times"], "date_download": "2020-05-04 20:07:14", "date_modify": "2020-05-04 20:07:14", "date_publish": "2018-02-25 16:41:34", "description": "In the world's only country that hosts both an American and a Chinese naval base, a Dubai firm is engaged in \"crisis talks\" with Djibouti after the East African state nationalized port facilities...", "filename": "_13206a9af2b519944b23654b88e8cc05_1588622834.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_13206a9af2b519944b23654b88e8cc05_1588622834.html", "title": "Djibouti, DP World in 'crisis' talks after port nationalization", "title_page": "Djibouti, DP World in 'crisis' talks after port nationalization", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In the world’s only country that hosts both an American and a Chinese naval base, a Dubai firm is engaged in “crisis talks” with Djibouti after the East African state nationalized port facilities less than 10 miles from the Pentagon’s key outpost in the troubled Horn of Africa, amid widespread local media reports that a Chinese firm is in line to take over the contract.\nDP World has operated the docks at Port Doraleh near the capital, Djibouti City, for more than a decade, but Djibouti officials on Friday announced that the harbor had been nationalized by presidential decree.\nThe government of Dubai issued a statement condemning the takeover, calling it a political move in the face of an adverse legal ruling for the government.\n“The illegal seizure of the terminal is the culmination the [Djibouti] government’s campaign to force DP World to renegotiate the terms of the concession,” the statement read. “Those terms were found to be fair and reasonable by a London court.”\nThe statement said DP World would contest the move in “the London Court of International Arbitration to protect their rights, or to secure damages and compensation for their breach or expropriation.”\nAnwar Gargash, minister of state for foreign affairs for the United Arab Emirates, called the port’s seizure regrettable in a Twitter post over the weekend. “Agreements, commitments and reassurances didn’t hold up to arbitrary measures against DP World,” he wrote.\nThe company designed and built the terminal in 2006 and signed a 50-year concession to oversee its operations.\nDjibouti’s key strategic coastline along the Gulf of Aden, at the southern entrance to the Red Sea, borders some of the world’s most strategic shipping lanes. Its port also serves as a major refueling and transshipment center.\nNearly 4,000 U.S. military and civilian personnel are based at Camp Lemonnier the only permanent American military base on the continent near the airport in Djibouti City. From there, troops including special operations forces move into Somalia, Kenya and across a narrow strait of water to Yemen and the Middle East, mostly as part of the war on terror.\nFrance, Italy, Spain, Saudi Arabia and Japan also have troops based in the small country with a population under 1 million.\nBut the port became an unlikely focus of the burgeoning Chinese-U.S. rivalry last summer when China’s navy completed its own military base with plans to house up to 10,000 troops, more than the U.S. and French numbers combined.\nChinese officials said the Djibouti base, located right beside the port and the first permanent foreign military installation for the People’s Liberation Army, was being built to resupply Chinese ships taking part in peacekeeping and humanitarian missions off the coasts of Yemen and Somalia, in particular.\nMuch of China’s trade with Africa and the Middle East also passes close by Djibouti’s shores.\nOne berth at Port Doraleh already is reserved for exclusive use of the Chinese navy, and control of the facility by Beijing could have consequences for French and U.S. warships.\nSince independence from France in 1977, Djibouti’s only two presidents have been the incumbent, Ismail Omar Guelleh regarded as a key U.S. ally and his uncle, who died in 1999.\nRights groups including Amnesty International and Human Rights Watch rank the country among the worst in Africa for torture, political oppression and control of the press.\nDespite a two-year term limit for president, Mr. Guelleh changed the constitution in 2011 and again in 2016 to contest elections that critics say were marred by intimidation and electoral fraud. Before counting had finished in 2016, Mr. Guelleh was declared the winner and his party took 87 percent of the vote.\nThe State Department on Friday had not answered a request for comment on cancellation of the port deal.\nThe Djibouti Ports Free Zones Authority said in a statement released Sunday that it stripped DP World of the concession because of the company’s “recent poor performance” and “to rectify irregularities in the agreement covering its operation.”\nAlthough local media were reporting that a Chinese port company may be in line to get the operating contract, The Washington Times could not independently confirm that such a deal was in the works.\nU.S. concerns about Djibouti’s stability and the willingness to accept bases from China and others are not new. In 2016, Rep. Duncan Hunter, California Republican and a member of the House Armed Services Committee, urged the Obama administration to “closely monitor the growing influence of China in Djibouti.”\nMr. Hunter said Washington “should insist on an orderly change of Djibouti’s government based on fair and open elections and open press coverage.”\nRussia also has negotiated with Mr. Guelleh for the right to base troops in his country, citing the need to protect its ships at the entrance to the Red Sea.\nA new rail line from landlocked Ethiopia reaches the sea at Djibouti, but the government in Addis Ababa has not commented on nationalization of the harbor.\nDP World also has a terminal in the self-declared Republic of Somaliland, bordering Djibouti, and may have angered the Djibouti government when the company reportedly offered Ethiopia cheaper use of that harbor.\nEnglish-speaking Somaliland has lobbied for U.S. troops to be based there, but its lack of recognition as a sovereign country has hampered talks. Walter Kansteiner, assistant secretary of state for African affairs in the early years of the George W. Bush administration, proposed a closer bond with Somaliland, but the administration did not follow through.\nThe operation of the port has become a political controversy. In 2015, the Guelleh government took former opposition leader Abdourahman Boreh to court in London, accusing him of treason and of paying bribes to companies, including DP World, to secure contracts for building the harbor.\nMr. Boreh was exonerated, but among the documents filed by his attorneys were papers suggesting that Mr. Guelleh and his family control much of the nation’s economy and linking them to contracts for the port.", "url": "https://apnews.com/13206a9af2b519944b23654b88e8cc05"}