{"authors": ["Anna Quinn"], "date_download": "2020-05-04 20:14:10", "date_modify": "2020-05-04 20:14:10", "date_publish": "2018-07-07 04:00:00", "description": "RIDGEFIELD — Inappropriate posts on Facebook, a recent plan to shuffle teachers and other complaints about her management have led dozens of parents to ask that Scotland Elementary School’s...", "filename": "_a81bdcc881154a6b8c968745d66613d6_1588623250.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a81bdcc881154a6b8c968745d66613d6_1588623250.html", "title": "RIDGEFIELD ‘Toxic’ times at school", "title_page": "RIDGEFIELD ‘Toxic’ times at school", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RIDGEFIELD — Inappropriate posts on Facebook, a recent plan to shuffle teachers and other complaints about her management have led dozens of parents to ask that Scotland Elementary School’s principal be removed.\nComplaints first surfaced against Principal Joanna Genovese last month when parents disagreed with her decision to move six of the school’s teachers to new grade levels next year.\nBut since then, parents have said Genovese’s behavior during a meeting about the shuffle, inappropriate posts online and a lack of supervision during lunch and recess have raised their concerns further.\nThe situation came to a head at a recent Board of Education meeting where 10 parents called for Genovese’s removal during public comment while dozens of others, wearing red shirts to represent Scotland, cheered on in the crowd.\n“If it were only for one unfortunate encounter, if it was only one misdirected comment, if it was only one policy infringement, perhaps I could understand,” said Larry Dunn, a parent of four Scotland students. “Everyone deserves a second chance, but we’re beyond second chances here. I have lost all faith in Ms. Genovese and it is clear in the army of support that have come out with us tonight to stand in solidarity, that I am not alone.”\nSchool board Chair Fran Walton told parents at the meeting it is the board’s policy not to respond to public comments at the meeting unless they are later addressed during a discussion scheduled on the agenda. She added that personnel matters are handled by the superintendent’s office, not the board.\n“The board employs one member of staff and that is the superintendent of schools,” she said. “The superintendent of schools is responsible for all other staffing issues.”\nActing Superintendent Robert Miller did not address the complaints during the board’s meeting. Interim Superintendent JeanAnn Paddyfote, who took over on July 1, could not be reached for comment Friday.\nMany of the parents brought up recent posts Genovese made on Facebook, which they said violated the district’s social media policy for employees.\nIn one post — read by parent Tessa Baum at the meeting — Genovese re-posted an e-card that said “How to be a grown up at work: Replace ‘F— you’ with ‘Ok, great’” and tagged an elementary supervisor and literacy coach from the school. Genovese also tagged the literacy coach in another re-posted e-card that read “Did you know 2-3 vodkas per day can reduce your risk of giving a s—,” Baum said.\n“My jaw dropped when I read that for the first time,” Baum said. “Ms. Genovese is the leader of an elementary school and that statement reflects how she feels about her work place. Would anyone from this room feel comfortable for their child to hear these words from their principal about their school?”\nAnother parent said he was concerned that there is only one paraprofessional on duty during both recess and lunch at Scotland. He and others contended that in this way and others Genovese has failed to provide a safe environment at the school.\nParents also, as they had at a meeting in May, spoke out against Genovese’s plan to switch the six teachers to different grade levels.\n“Our teachers have worked for years to build grade-level specific knowledge and work on powerful collaborative models,” one parent said in an email read at the meeting. “By moving six teachers and creating five new grade level teams for the 2018-19 school year, Ms. Genovese is placing an unfair burden on all of our teachers and creating an environment that places Scotland students at a disadvantage compared to their peers.”\nMany said they felt Genovese did not adequately involve teachers or other administrators in the decision and offered “confusing and conflicting” reasoning about it during a meeting parents requested.\nMost contended there are more parents and staff from Scotland than those at the school board meeting that hold the same concerns.\n“The fact that most parents and teachers have been afraid to voice their concerns exemplify the toxic environment at our school,” one parent said. “Despite my own apprehension, I felt I simply could not sit on the sidelines while the atmosphere at my children’s school is such that it is.”\naquinn@newstimes.com", "url": "https://apnews.com/a81bdcc881154a6b8c968745d66613d6"}