{"authors": ["Micah Uetricht", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Joe Allen"], "date_download": "2020-05-04 19:59:49", "date_modify": "2020-05-04 19:59:49", "date_publish": "2018-08-06 00:00:00", "description": null, "filename": "2018_08_ups-contract-tentative-agreement-teamsters_1588622389.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/08/06140758/GettyImages-51876067.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_08_ups-contract-tentative-agreement-teamsters_1588622389.html", "title": "The Kanye/Jay-Z Approach to Bargaining", "title_page": "The Kanye/Jay-Z Approach to Bargaining", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The econ 101 explanation of how wages and benefits work goes something like this: when times are tough and companies are losing money, they have to limit workers’ compensation and hire less. When they’re flush with cash, companies bump up workers’ pay and hire more.\nWe should all be rooting for high profits and bull markets, since those are the conditions that lead to the invisible hand delivering better conditions for workers. Yet for some reason, that hand is nowhere to be found at United Parcel Service (UPS).\nDave Jamieson has an excellent piece in the Huffington Post on the proposed new union contract for UPS drivers. The contract (which is at the tentative agreement (TA) stage between UPS and the Teamsters, meaning that they are close to sending it to the union’s membership for approval), will cover more than a quarter million workers. It’s a massive workforce for one of the most important logistics companies in the United States and the world, so what’s in the contract matters a lot.\nUPS isn’t hurting right now. Quite the contrary: the company has more packages than it knows what to do with. Deliveries from e-commerce sites like Amazon have all of the parcel carriers operating at full capacity. This huge new demand has been very good to UPS: the company pulled in $1.5 billion in the second quarter alone.\nYou’d think, then, because UPS is making money hand over fist, the company wouldn’t be prioritizing undercutting its workers’ wages and benefits. And it’s true, most UPS workers are being offered higher wages in the TA. But something else is afoot in the new contract.\nIn the TA — which the Teamsters’ leadership has agreed to — UPS introduces a kind of second-tier driver position, a “hybrid” driver that would both deliver packages in a truck and sort them at a hub. As Jamieson reports, quoting a driver named Ken Smith:\nThe new employees would work on a lower pay scale than current full-time drivers, starting and topping out at lower hourly rates. They also wouldn’t enjoy the same limits on forced overtime, opening them up to long work weeks. The way Smith sees it, those factors would essentially make the new drivers second-class within the union and potentially drive down the standards for everyone over the long term.\nPart of the company’s motivation in introducing this hybrid position is that it wants to expand its delivery service to seven days a week. Amazon is using other delivery services like FedEx and the Postal Service to deliver on Sundays. UPS wants to get in on the Sunday action, too. Fair enough.\nBut given the numbers the company is currently doing, and the clear demand for expanded service that is out there right now, you’d assume that UPS would be proposing a solution that pays these new workers more. Nobody wants to work on Sundays, and it’s obvious the company is desperate for more workers.\nYet as Jamieson reports, the proposed wage cap for standard drivers in the new contract is $40; for hybrid drivers/package handlers, by contrast, it’s just over $34.\nOf course, a big part of the company’s motivation is its competition like FedEx and Amazon contractors, who are eking by with far lower compensation. If the Teamsters were to organize the other parcel delivery workforces — no easy task, given the blatant abuse of misclassifying drivers as “independent contractors” that companies like FedEx have engaged in — it would give the UPS workforce some breathing room, as well as reverse miserable conditions at those other companies.\n​But UPS is still doing quite well. Company bargainers aren’t proposing a two-tier contract because they have to. They’re proposing it because they can get away with it. Call it the Kanye West and Jay-Z approach towards shoving a shitty contract down workers’ throats: “Who gon’ stop me, huh?”\nThe answer to that question is supposed to be “the union.” Yet the Teamsters have signed on to the tentative agreement. The reform group Teamsters for a Democratic Union (TDU), on the other hand, is calling for workers to vote “no.” Teamsters United, the slate that ran against Teamsters general president James Hoffa in the last election, is leading discussions around the country about opposing the contract.\nThe union recently voted to authorize a strike at UPS, with 93 percent of workers voting in favor. The last time UPS workers went on strike, in 1997, it drew overwhelming support throughout the country and held the promise of reviving the American labor movement.\nUPS’s actions here don’t quite square with how we’re taught labor markets are supposed to work, but it’s pretty standard stuff these days. University of Illinois labor relations professor Robert Bruno noted a similar phenomenon at the earthmoving company Caterpillar in Joliet, Illinois, in 2012.\nIn forcing an end to a four-month strike at the company, “Caterpillar Inc. got what it wanted. Not some of it or just what it needed, or what was economically justified or even fair, but all of it.” Despite previously agreeing to a two-tier contract and the company’s sky-high profits, the unionized workers “got little more than the privilege to vote for their own abuse” by the end of the contract fight.\nIf they can get away with it, corporations like Caterpillar and UPS will always insist on eroding workers’ compensation. This is how labor markets work under capitalism. And right now, with the labor movement at its weakest in a century, companies feel like they can get away with it.\nIf UPS workers — and every other worker in the global economy — don’t want to see their standard of living steadily eroded, they’ll have to pry open the company’s grubby hands and make them fork over the cash. The invisible hand of the market certainly won’t be delivering it to them.", "url": "https://jacobinmag.com/2018/08/ups-contract-tentative-agreement-teamsters"}