{"authors": ["Margaret Reist Lincoln Journal Star"], "date_download": "2020-05-04 20:25:05", "date_modify": "2020-05-04 20:25:05", "date_publish": "2018-03-07 13:00:00", "description": "Lincoln Public Schools is looking at a substantial jump in revenue for the second year in a row — a nearly $20 million increase in state aid for 2018-19. It's the largest increase the...", "filename": "_fe00be6b10d44d22ad98a622e6aaae63_1588623905.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fe00be6b10d44d22ad98a622e6aaae63_1588623905.html", "title": "LPS looking at jump in state aid for coming year", "title_page": "LPS looking at jump in state aid for coming year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LPS looking at jump in state aid for coming year\nLincoln Public Schools is looking at a substantial jump in revenue for the second year in a row — a nearly $20 million increase in state aid for 2018-19.\nIt’s the largest increase the district has seen in recent years.\nLast year, an $18.9 million bump in property tax revenue helped fund the district’s $420.8 million budget. That windfall was the result of a countywide reassessment of property that ended with a 9 percent valuation increase.\nThis year, LPS has the state to thank. The district’s state aid jumped from $126.7 million to $146.6 million, thanks largely to changes in the way the state aid formula determines how much districts should receive to help educate students in poverty.\n“The biggest factor is the poverty calculation,” said Liz Standish, LPS associate superintendent of business affairs. “The state changed the way they pull the data.”\nIn 2016-17, Nebraska joined other states in testing a new way to calculate which children are automatically certified for the federal free- and reduced-lunch program — the major determiner of poverty in schools.\nThat method considers families who receive Medicaid services to be automatically eligible for the federal lunch program, Standish said. Any family can submit an application for the program, but families that are on some public assistance programs are automatically eligible and used in the formula.\nAdding those who receive Medicaid services meant the number of students automatically eligible for free lunch went from 13,702 in 2015-16 to 15,427 the following year, Standish said.\nThat change wasn’t reflected in the state aid calculation until the 2018-19 year.\nThat meant that the “poverty allowance” — the amount of extra money the state calculates the district will need to educate students who live in poverty — jumped by $11.3 million, said Bryce Wilson, the Nebraska Department of Education’s director of finance and organizational services.\nOmaha Public Schools saw the impact last year, when its poverty allowance jumped by $9.4 million, Wilson said. OPS’ total state aid increased by $62 million to $288.2 million last year. For the coming year — without that bump — its state aid decreased by $12.5 million.\nThe other factor fueling the state aid increase for LPS this year is overall student growth, Standish said. The district has absorbed nearly 5,000 additional students over the past five years.\nBecause of the way the formula averages growth over time, Standish said, the full effect of that growth is beginning to be reflected in the formula.\n“So the growth Lincoln is experiencing is catching up in the formula,” she said.\nThe changes in the poverty allowance and the district’s overall growth offset what likely would have been a decrease or much smaller increase in state aid, Wilson said.\nTypically, a big increase in property valuations one year will mean less state aid the following year.\nFor the past three years, LPS’ state aid stayed essentially flat, though the year before that it jumped nearly $17 million.\nThe 15.75 percent increase for 2018-19 falls in line or is lower than some increases prior to 2015. But in real dollar terms, it’s the largest since at least 1990.\nLPS also will benefit in its upcoming budget from an expected 17 percent increase in commercial and industrial property valuation in Lancaster County.\nThe overall dollar amount of that valuation increase will be lower than last year’s, Standish said, because commercial and industrial property makes up just 28 percent of the total valuation used to determine property tax revenue.", "url": "https://apnews.com/fe00be6b10d44d22ad98a622e6aaae63"}