{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:16:14", "date_modify": "2020-05-04 20:16:14", "date_publish": "2018-10-25 10:30:00", "description": "Stage Coach Players of DeKalb has scheduled announces auditions for two upcoming plays. Auditions for the musical “Disney’s The Little Mermaid” and the comedy “Calendar Girls” will be held...", "filename": "_a11d599e4d994ffea0998750957c77c9_1588623374.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a11d599e4d994ffea0998750957c77c9_1588623374.html", "title": "Stage Coach Players to host auditions", "title_page": "Stage Coach Players to host auditions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Stage Coach Players of DeKalb has scheduled announces auditions for two upcoming plays.\nAuditions for the musical “Disney’s The Little Mermaid” and the comedy “Calendar Girls” will be held from 1 to 5 p.m. Nov. 10 and Nov. 11 and 6 to 9 p.m. Nov. 12 at Stage Coach Theatre in DeKalb.\n“Disney’s The Little Mermaid” is the stage version of the 1989 children’s movie of the same name from the Hans Christian Andersen fairy tale. The music was written by Alan Menken, with lyrics by Howard Ashman and Glenn Slater and book by Doug Wright. Ariel, a mermaid princess who lives in a magical kingdom and dreams of the world above the sea, gives up her voice to find love.\nDirected by Jan Kuntz with music direction by John Feken, roles are available for anyone ages 8 to 80 and there will potentially be callbacks on Nov. 14. Auditioners should prepare a musical song of their choice (16-32 measures), keeping in mind the character for which they are auditioning. An accompanist will be provided, so bring sheet music for that song. There will possibly be a dance audition and a cold reading.\n“Calendar Girls” is a comedy written by Tim Firth based on the true story of 11 Yorkshire Women’s Institute members who pose nude for a calendar to raise money for the Leukaemia Research Fund after the husband of one of them dies of leukemia. A film based on the play was released in 2003 starring Helen Mirren and Julie Walters in the lead roles.\nDirected by Mike Groark, nine roles are available for women ages 20s to 70s. There are four roles for men ages 20s to 50s. Auditions will include cold readings from the play. “Calendar Girls” is set in England, so be prepared to audition with a British accent.\nStage Coach Theatre is at 126 S. Fifth St. in DeKalb. For more information, visit www.stagecoachers.com or call the box office at 815-758-1940.", "url": "https://apnews.com/a11d599e4d994ffea0998750957c77c9"}