{"authors": ["Kori Tuitt", "Ktuitt Lowellsun.Com"], "date_download": "2020-05-04 20:24:35", "date_modify": "2020-05-04 20:24:35", "date_publish": "2018-11-14 12:01:44", "description": "LOWELL -- The mere announcement of Oprah Winfrey coming to Lowell has conjured up excitement in the Merrimack Valley and beyond. While helping to raise money for student scholarships, city...", "filename": "_13300ea41cb34320a27208566868fc9d_1588623875.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_13300ea41cb34320a27208566868fc9d_1588623875.html", "title": "Excitement Ahead of Winfrey Visit", "title_page": "Excitement Ahead of Winfrey Visit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- The mere announcement of Oprah Winfrey coming to Lowell has conjured up excitement in the Merrimack Valley and beyond.\nWhile helping to raise money for student scholarships, city officials believe Winfrey’s visit will also raise the profile of the work being done at UMass Lowell and the city itself.\nThursday night’s event, “A Conversation with Oprah Winfrey,” is the third in the annual Chancellor’s Speaker Series. UMass Lowell Chancellor Jacquie Moloney will interview Winfrey on stage at the Tsongas Center.\n“I think, for us, it’s been a great opportunity to raise money for scholarships,” Moloney said. “She’s doing this all pro bono, so we are hoping to raise a substantial amount of money for scholarships in her name.”\nA number of students who are the first set of recipients of the Oprah Winfrey Scholarship, will be announced at Thursday’s event. Moloney said the scholarships are for those with financial need.\n“We’re also asking for students to have shown courage in pursuing their education because we believe Oprah herself is a very courageous person,” Moloney said. “She has broken through so many barriers in her lifetime.”\nThe previous two guests in the Chancellor’s Speaker Series, author Stephen King and actress Meryl Streep, helped to raise more than $100,000 and $230,000, respectively. At the event, Winfrey will also receive an honorary doctorate of humane letters, the highest honor the university can present.\nVilma Okey-Ewurum, vice president of the university’s Student Government Association, said Winfrey has been a larger than life personality to her for years.\n“I can draw so many parallels between my life with hers, especially being a black woman,” Okey-Ewurum, a UMass Lowell senior, said. “I think she’s just someone I think at some level I’ve always looked up to.”\nAndre DiFilippo, a UML senior and president of the Student Government Association, witnessed what seemed like never-ending lines of students waiting to purchase their tickets for the event. And of course, people have been using the hashtag #OPRAHatUML on social media as another outlet for their excitement.\n“I remember after school everyday, sitting in my living room in my childhood home watching the Oprah Winfrey Show with my mom,” he said. “From a decent age, I consistently watched her show and there are many students who have that same experience.”\nDiFilippo said when he first heard the news Winfrey would be on campus, he screamed in excitement.\n“Of all the places to go -- I mean, Oprah could go anywhere she wanted -- and she chose UMass Lowell,” he said.\nMoloney said Winfrey is a hopeful person with a positive message she knows will have a great impact on students. By the end of the event, Okey-Ewurum said she hopes to be inspired.\n“I think whenever you have an opportunity to see in-person someone who has had such a tremendous impact on our culture an on our country, that’s a real privilege,” City Manager Eileen Donoghue said.\nOne of the things Mayor Bill Samaras said impresses him most about this event is that Winfrey is not charging any fee for her highly anticipated appearance. On top of helping students achieve their educational dreams, Winfrey’s appearance is attracting people to the city from all over. Samaras said her visit will enhance the stature of the university and the city.\n“We talk about our diversity being our strength, but having somebody like her here really enhances that strength,” Samaras said. “She’s been a catalyst for a lot of good things happening all over the world. I expect it to be a very powerful presentation.”\nMoloney said with many people coming into the downtown area, she hopes the restaurants are staffing up for those likely get a bite to eat before the show.\n“This will be great for the city, there will be a lot of people coming to the city of Lowell who have not yet visited and I think they will be very impressed by what they see,” Moloney said.\nA few tickets are still available for purchase online at www.tsongascenter.com or by calling 866-722-8780.\nFollow Kori Tuitt on Twitter @KoriTuitt.", "url": "https://apnews.com/13300ea41cb34320a27208566868fc9d"}