{"authors": ["Luke Nichols Daily Sun Sports Editor"], "date_download": "2020-05-04 20:18:02", "date_modify": "2020-05-04 20:18:02", "date_publish": "2018-02-26 22:32:00", "description": "LINCOLN -- Beatrice had one swimmer return to the Bob Devaney Sports Center on Saturday for the finals of the NSAA State Swimming and Diving meet. Freshman Mikwema Lierman qualified for the...", "filename": "_7534762ca9f14be7bceb888834a00367_1588623482.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7534762ca9f14be7bceb888834a00367_1588623482.html", "title": "Lierman finishes 12th in 50-freestyle", "title_page": "Lierman finishes 12th in 50-freestyle", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN -- Beatrice had one swimmer return to the Bob Devaney Sports Center on Saturday for the finals of the NSAA State Swimming and Diving meet.\nFreshman Mikwema Lierman qualified for the consolation swim of the 50-freestyle. She came into the race seeded 12th and finished in a tie for 12th place with a time of 25.06. She also swam a personal best time in the event.\n“Mikwena has been a great asset for our team this year,” said Beatrice coach Marian Wallen .“And having competed at state this year will give her the confidence to be successful next season. We look forward to see what she will accomplish in her future swimming career.”\nBeatrice’s remaining swimmers were eliminated on Friday after preliminaries.\nMaya Moran swam in the 100-backstroke. She finished with a time of 1:03.09, which was good enough for 28th overall and broke her own school record.\nMoran also swam the 100-freestyle and finished 27. She was .01 off from her personal best time.\nThe girls 200-medley relay team of Josi Mans, Crystal Craft, Maddy Wagner and Mikwena Lierman finished with a time of 2:01.56, which was good enough for 22nd overall and a personal best time.\nMaddy Wagner and Mikwena Lierman finished with a time of 1:43.76, which was good enough for 18th overall. It also broke their own school record and they are the second alternate for Saturday’s consolation swim.\nThe 400-freestyle relay team of Maya Moran, Maddy Wagner, Mikwena Lierman and Mikasa Lierman finished with a time of 3:51.87, which was good enough for 20th overall.\nOn the boys side, Colton Starck swam in the 50-freestyle. His preliminary time of 22.69 was good enough for 20th overall.\nThe boys 200-medley relay team of Colton Starck, Jacob Mason, RJ Suey and Cameron Knepp finished with a time of 1:49.51, which was good enough for 27th overall.\nThe 200-freestyle relay team of Jacob Mason, RJ Suey, Cameron Knepp and Colton Starck finished with a time of 1:36.53, which was good enough for 27th overall.\nThe 400-freestyle relay team of Jacob Mason, RJ Suey, Cameron Knepp and Colton Starck finished with a time of 3:34.67, which was good enough for 25th.", "url": "https://apnews.com/7534762ca9f14be7bceb888834a00367"}