{"authors": ["Grant Traylorthe Herald-Dispatchgtraylor Herald-Dispatch.Com"], "date_download": "2020-05-04 21:06:18", "date_modify": "2020-05-04 21:06:18", "date_publish": "2018-08-15 07:25:52", "description": "HUNTINGTON — Marshall University's football community is mourning the loss of one of its favorite sons. Reggie Oliver, who played quarterback for the Young Thundering Herd in the seasons...", "filename": "_8c4cda1c84bc44eca4259a56f3ce912f_1588626378.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8c4cda1c84bc44eca4259a56f3ce912f_1588626378.html", "title": "Herd icon Reggie Oliver dead at 66", "title_page": "Herd icon Reggie Oliver dead at 66", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON — Marshall University’s football community is mourning the loss of one of its favorite sons.\nReggie Oliver, who played quarterback for the Young Thundering Herd in the seasons following the Nov. 14, 1970, plane crash (1971-73), passed away Tuesday at age 66. The tragedy claimed 75 lives, including most of the football team. Oliver was a freshman at the time and NCAA rules prohibited freshmen from playing varsity football.\nMarshall athletics issued a release on Oliver’s passing just before 7 p.m. Tuesday.\n“We extend out deepest sympathies to Reggie’s friends and family,” the release said. “He was one of Marshall’s true legends and will sorely be missed by the entire Thundering Herd family.”\nOliver was hospitalized last week at Huntsville Hospital in Huntsville, Alabama, after suffering a serious head injury in a fall.\nThe Marshall community came together Friday at the Marshall Memorial Fountain outside the\nMemorial Student Center and had a candlelight vigil for Oliver, which included Marshall’s athletics staff, football head coach Doc Holliday and the entire Herd team.\n“I’m very saddened by this,” Marshall athletic director Mike Hamrick said by phone Tuesday. “It just doesn’t seem fair.”\nHolliday was alerted to Oliver’s passing following the team’s Tuesday practice session.\n“It’s a shame,” Holliday said. “He was a great guy, a great Son of Marshall. He did so much for our program in so many ways.”\nThe vigil occurred at the same fountain where Oliver delivered a powerful speech to Marshall patrons back on April 28 at the annual Spring Fountain Celebration to turn on the water prior to the annual Green-White Spring Scrimmage.\nHolliday said Oliver’s passion was something that immediately stood out when players first met him.\n“He always had a smile on his face and was just so positive about everything,” Holliday said. “Every time he spoke, he just had so much passion for everything he did. He was a great, great man that will always be remembered as a great Son of Marshall.”\nOn that day, Oliver’s powerful personality stood out.\nAs The Herald-Dispatch’s Tim Stephens noted, the Tuscaloosa, Ala., native wore a white suit with a green tie and sunglasses to the event and sang the 1970 Clarence Carter hit “Patches” for the crowd. The song is about a boy raised in poverty in Alabama.\n“People said not to go to Marshall,” Oliver recalled. “They said, ‘They’ll make a wide receiver out of you.’”\nAs it turned out, Oliver not only became a quarterback for the Young Thundering Herd, he became one of the program’s biggest icons, forging Marshall to one of the banner wins in program history.\nOn Sept. 25, 1971, Oliver connected with freshman fullback Terry Gardner on a play called “213 Bootleg Screen” for a 13-yard touchdown on the game’s final play as Marshall upset Xavier, 15-13, in front of an estimated 13,000 fans at Fairfield Stadium in Huntington. It was the first home game for the Herd after the 1970 plane crash of Southern Airways Flight 932, which occurred on Nov. 14, 1970 on the way back from a 17-14 loss at East Carolina.\nChuck Rist, now the public address announcer for Morehead State University men’s basketball team, was Marshall’s sports information director when Oliver played for the Herd.\n“I’m so sorry to hear of Reggie’s passing,” Rist said. “The first game I worked as a freshman on the stat crew at old Fairfield Stadium was the miracle win over Xavier and just on the basis of that experience I’ll forever be grateful for what Reggie did to start the rebirth of football at Marshall. Somewhere heavenward, a referee is now signaling touchdown in celebration of his life.”\nOliver’s college teammates mourned the life of the former Herd star.\n“I hate to hear this,” said Oliver’s college roommate and former Marshall quarterback Dave Walsh, longtime sports writer at The Herald-Dispatch. “He and Terry Gardner are both gone, now. It’s a sad time for Marshall University. Reggie has gone on to a deserving reward. What he did for, and meant to, Marshall University will last forever.”\nAllen Meadows, another of Oliver’s teammates, said he talked with Oliver’s mother and she was appreciative of the prayers for her son.\n“She wanted me to tell you, ‘thank you, thank you, thank you,’ ” Meadows said. “She wanted me to take pictures of the vigil and send them to her so she could see how many people showed up for Reggie.”\nAfter playing professionally in 1974 with the Jacksonville Sharks of the World Football League, Oliver served as an assistant coach for the Herd under Sonny Randle. Oliver also was a teacher and coach at Huntington High, as well as Eastmoor Academy in Columbus, Ohio, and Bowling Green State University in Ohio.\nOliver had lived in Columbus, but returned to his home state of Alabama in recent months to take care of his mother.\nMarshall president Jerome Gilbert laughed with Oliver at the fountain ceremony and appeared to thoroughly enjoy his relationship with the former Herd star. Tuesday, Gilbert mourned Oliver’s death.\n“We lost a great son of Marshall today and my heart is broken,” Gilbert said. “Reggie Oliver was a personal friend, a gentleman and an integral piece of that fabric that makes up Marshall’s story. Our MU family sends condolences to Reggie’s family, especially his mother, and to his many friends.”", "url": "https://apnews.com/8c4cda1c84bc44eca4259a56f3ce912f"}