{"authors": ["Ted Kulfan", "The Detroit News"], "date_download": "2020-05-04 20:15:55", "date_modify": "2020-05-04 20:15:55", "date_publish": "2018-03-17 05:57:26", "description": "Friday Night Fights erupted at Honda Center and the Red Wings more than their held their own against the rugged Anaheim Ducks. But in the overall context of actual hockey — the Red Wings...", "filename": "_e40da523e6464347b5dbf59a96607b48_1588623355.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e40da523e6464347b5dbf59a96607b48_1588623355.html", "title": "Red Wings go down fighting, but go down nonetheless", "title_page": "Red Wings go down fighting, but go down nonetheless", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Red Wings go down fighting, but go down nonetheless\nFriday Night Fights erupted at Honda Center and the Red Wings more than their held their own against the rugged Anaheim Ducks.\nBut in the overall context of actual hockey — the Red Wings continue to come up short.\nAnaheim won the Old Time Hockey reboot with a 4-2 victory over the Red Wings, sending the Red Wings winless streak to nine games (0-8-1).\nIt’s the longest such streak for the Red Wings since 1986.\nBOX SCORE: Ducks 4, Red Wings 2\nThe fans at Honda Center — and those who were flipping channels between hockey and the NCAA Tournament — were treated to an entertaining evening thanks to three spirited fights.\n“It was intense, the effort was there,” Luke Witkowski told Fox Sports Detroit after the game. “It’s frustrating we’re on the wrong end of things again.”\nWitkowski, who entered the lineup knowing the Ducks would be physical, fought Anaheim’s Nick Ritchie after Ritchie took exception to an earlier hit by Witkowski on Anaheim’s Cam Fowler (Farmington Hills).\nJustin Abdelkader went up against the Ducks’ Corey Perry and Anthony Mantha threw down against Anaheim’s Ryan Kesler (Livoina) in the second period.\n“It was fun to play a little battle hockey,” captain Henrik Zetterberg told FSD. “You don’t see that very often anymore. That was nice. The guys stood up for teammates and themselves and it was good to see.”\nThe Red Wings stood up physically, not backing down.\nBut take away the fights, and the Red Wings played a typical, of late, game.\nToo many defensive breakdowns, not tough enough in front of goalie Jimmy Howard, and let another Western Conference team grind them most of the evening.\nThe Ducks outshot the Red Wings 36-30, with Howard coming up with several big saves as Anaheim was able to get close to the net early and often.\n“We have to be better in our detail,” coach Jeff Blashill told FSD.\nMike Green (eighth goal) and Gustav Nyquist (19th) had Red Wings goals.\nRitchie, Grant, Perry and Kesler had Ducks goals.\nPerry scored his 16th goal at 16:42 of the second period, tapping in a loose puck at the post, breaking a 2-2 tie.\nKesler increased the Ducks lead to two goals at 5:04 of the third period with his first goal in 15 games.\nAnthony Mantha poked at Kesler driving through the slot, but Kesler had no problem putting back a rebound past Howard.\nOther observations from Friday’s game:\n■Don’t look now but the Red Wings, thanks to this lengthy losing streak, are sinking in the standings.\nAnd depending on your point of view, that could be a good thing, because of increasing odds for the first overall pick.\nOttawa moved past the Red Wings in the standings — despite both teams with 63 points — as Ottawa has played one fewer game.\nSo, only Buffalo (56), Arizona (57) and Vancouver (59) have fewer points in the overall standings than the Red Wings.\n■It was good to see Mantha stand up to Kesler in a fight, but Mantha needed to do a better job of keeping Kesler away from the net on the third-period goal.\nBlashill talked about “poke-and-hope” hockey several weeks ago, and this was a classic example. Mantha needs to be stronger and more determined on that goal.\n■The Red Wings went 0-for-5 on the power play, another game in which a key goal from the unit may have changed the complexion of the game.\nted.kulfan@detroitnews.com\ntwitter.com/tkulfan", "url": "https://apnews.com/e40da523e6464347b5dbf59a96607b48"}