{"authors": ["Christopher Heimerman Cheimerman Shawmedia.Com"], "date_download": "2020-05-04 20:04:03", "date_modify": "2020-05-04 20:04:03", "date_publish": "2018-04-02 22:29:00", "description": "SYCAMORE – Rudy Ruettiger, made famous by the inspirational film, “Rudy\", is coming to DeKalb County to be the keynote speaker at the Kishwaukee Family YMCA Awards Dinner. It should be...", "filename": "_9f46e79c1a76416892ae9c35af2f9d2b_1588622643.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9f46e79c1a76416892ae9c35af2f9d2b_1588622643.html", "title": "'Rudy' will keynote Kishwaukee Family YMCA Awards", "title_page": "'Rudy' will keynote Kishwaukee Family YMCA Awards", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SYCAMORE – Rudy Ruettiger, made famous by the inspirational film, “Rudy”, is coming to DeKalb County to be the keynote speaker at the Kishwaukee Family YMCA Awards Dinner.\nIt should be noted, he harbors no bitterness toward Northern Illinois University, even though “they never recruited me, and I don’t know why,” he said during a phone interview, laughing.\nRuettiger’s tale, captured in the 1993 film, is one that’s resonated across generations, and with people from all walks of life. Sean Astin plays Ruettiger, an undersized dreamer from a blue-collar family who earns a shot to suit up and play for the Notre Dame Fighting Irish.\n“More than anything else, ‘Rudy’ is a story about hope,” Ruettiger said.\nThe Y’s annual Community Awards Dinner is set for 5 p.m. May 17 at Faranda’s Banquet Center, 302 Grove St. While Reuttiger speaks mostly at corporate events and universities, he said he cherishes his chances to speak at events that celebrate community.\n“It’s always good to speak to YMCA organizations,” he said. “They do a lot of good for the community, so it’s good to empower that.”\nRuettiger said physical fitness is only part of what the Y offers, citing mentoring, children’s programs and camaraderie as some of the greatest assets the organization offers.\n“We need to take care of people, physically, mentally and socially, so they can take care of themselves,” he said.\nThree members of the DeKalb County community will be honored during the annual gala, and the Y is seeking nominations for the following:\n• Youth Leader Award: It honors someone age 18 or younger who has made “a notable impact on the community” in youth development.\n• Emerging Leader Award: It goes to a person age 19 to 35 who made “significant, ongoing” volunteer contributions in DeKalb County.\n• Outstanding Community Leader Award: This one is for a person with “an extraordinary body of volunteer work through leadership, involvement, and and community service” in DeKalb County.\nNominations will be accepted through April 6 at kishymca.org, where you can also buy tickets to the event.\nAs for fitness, though, it’s not about the size of the dog in the fight. Take it from a guy who stood 5-foot-6 and weighed 165 pounds when he got on the field for the Irish and made a tackle for a loss in 1974.\n“You don’t have to be a bodybuilder to keep yourself in shape,” Ruettiger said. “Keep at it. That’s the key.”\nThe film’s storyline is powerful standing alone, but Ruettiger enjoys delving into and analyzing the finer aspects of “Rudy,” particularly the musical score. He said he recently watched the it with USC film students, and marveled at what they took away from it.\n“These are kids from all over the world, and I think it’s really cool to see kids from China, Japan, France, all these talented students getting so much out of the message,” he said. “People get the message out of the movie, regardless of the course of their lives.”\nRuettiger grew up in Joliet and said he’s excited to visit DeKalb, where he’s been numerous times. He’s lived the past 25 years in Las Vegas, where he bass fishes – a lot. He loves competing in tournaments.\n“It’s a lifestyle out here, man,” he said. “It’s cool. But there’s nothing like getting on the road and seeing how his movie’s message affects people.”", "url": "https://apnews.com/9f46e79c1a76416892ae9c35af2f9d2b"}