{"authors": ["Jennifer Rios Staff Writer"], "date_download": "2020-05-04 20:09:22", "date_modify": "2020-05-04 20:09:22", "date_publish": "2018-11-07 01:45:39", "description": "Rosann Doran, a longtime journalist and one of the founders of what is now the Broomfield Enterprise, died Tuesday morning. Doran, who also was Broomfield's public information officer for...", "filename": "_18260a17463045d0b065e5e8ed2afa96_1588622962.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_18260a17463045d0b065e5e8ed2afa96_1588622962.html", "title": "Broomfield Icon Rosann Doran Dies", "title_page": "Broomfield Icon Rosann Doran Dies", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Rosann Doran, a longtime journalist and one of the founders of what is now the Broomfield Enterprise, died Tuesday morning.\nDoran, who also was Broomfield’s public information officer for more than 20 years, was 70.\nShe worked for the City of Broomfield, and later Broomfield City and County, from 1988 to December 2013. She also worked in local newspapers since 1972.\n“She was a consummate journalist her entire life,” Doran’s younger sister Danette Grauberger said. “She was always involved with publishing, writing articles, and doing everything.”\nGrauberger, who lives in Parker with her husband, said the family is finalizing funeral plans.\nIn 1972, Doran came to work in Broomfield to take a job at the Broomfield Star newspaper. Then, she moved over to the Tri-City Journal, which encompassed Broomfield.\nWhen she helped launch the Broomfield Free Enterprise in 1975, now known as the Broomfield Enterprise, she found herself doing everything from writing articles to laying out the paper.\n“It is with great sadness that we learned of Rosann’s passing,” said Carol Wood, editor of the Broomfield Enterprise. “Her legacy with this paper, and those before it, is irreplaceable. Up until recently, she still would pass on news tips and write guest articles.”\nDoran was a member of Nativity of Our Lord Catholic Church for more than 40 years, and sent her son Dan to the parish’s grade school.\nGrauberger said her sister “truly believed” in the work she did, and was conscientious in all her endeavors. She was proud of preserving parks and open space, and assisting in planning the layout of the city.\n“She poured her heart and soul into everything she did for the city,” Grauberger said. “She was endless energy.”\nIn 2013, the year she retired from the city, Doran was awarded a Heart of Broomfield Award in the Heart and Soul category.\n“The number of things she accomplished is just amazing,” Grauberger said, “but she was very humble about it. You would never have known all the things she did.”\nAfter she retired, Doran stayed busy by serving on multiple committees and boards, including with the Broomfield Depot Museum. She loved to travel, to garden and raising a Golden Retriever puppy.\nShe also was part of a reunion committee for Arvada High School and held monthly get-togethers with old classmates.\nWhile with the city, she loved working with youth who came to city hall to learn about local governance. She mentored students, Grauberger said, and helped them with their community service work and internships.\nHer sister was a quiet, hardworking person, Grauberger said, and was the “go-to” person while Broomfield was transitioning to a city and county.\nShe is grateful to the Broomfield community, especially in the last month, for reaching out to Doran. Last week Doran, who was diagnosed with mesothelioma, moved back home from the hospital.\n“It was just impressive how many people came by and expressed their love and concern,” Grauberger said. “It’s a wonderful community, and it was humbling for her. It just made the whole transition that much easier for her.”\nKaren Smith, former executive director of the Broomfield Community Foundation, visited Doran last week.\n“It’s just so sad,” Smith said.\nSmith met Doran in 2003 when she served on the foundation board that hired Smith. Doran also served on the foundation’s grant committee, the Emergency Family Assistance Association board, and as secretary for Colorado Press Women.\nDoran was very involved in her church, Smith said, and close with her family, who loved to bake together around the holidays.\n“She was just a very nice person,” Smith said. “She cared about people and she cared about Broomfield.”\nDoran had a close relationship with her son, Dan, who is an anesthesiologist in Seattle.\nShe also was close friends with former City and County Manager George Di Ciero, who initially hired her on with the city.\nIn an article about her Heart of Broomfield award, Di Ciero praised Doran as the go-to woman when it came to finding out what was going on in Broomfield.\nSince the 1970s, Doran has been a part of just about every major event in Broomfield, he his letter said.\n“She was involved in a lot of different circles,” Smith said. “She had a passion for Broomfield and for people.”\nJennifer Rios: 303-473-1361, riosj@broomfieldenterprise.com or Twitter.com/Jennifer_Rios", "url": "https://apnews.com/18260a17463045d0b065e5e8ed2afa96"}