{"authors": ["Nema Brewer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Cathy Kunkel", "Eric Blanc", "Joe Burns", "Jamie Mccallum", "An Interview With"], "date_download": "2020-05-04 20:00:10", "date_modify": "2020-05-04 20:00:10", "date_publish": "2018-04-02 00:00:00", "description": null, "filename": "2018_04_kentucky-teachers-public-workers-strike-pensions-budget_1588622410.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/04/02101552/KY.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_04_kentucky-teachers-public-workers-strike-pensions-budget_1588622410.html", "title": "“This Is a Struggle of Regular Working People”", "title_page": "“This Is a Struggle of Regular Working People”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "NB\nLast Thursday was the fifty-eighth day of the legislative session, so the session was almost finished. That day, I got a text at 2 PM, saying, “They’re going to try to push this through, you probably want to come to Frankfort.” I got there and sure enough there were a bunch of shenanigans.\nBut we weren’t surprised. I knew they were going to push something through at the last minute, so we were ready. I figured it was going to get ugly. So on Wednesday evening, I closed comments on the main Facebook group — which we call the Motherpage — and I called on people to start organizing through the six geographic zones we had set up earlier. We have separate Facebook groups for each of our six zones, so that people can rapidly organize at their county and at their schools. It helps us respond to things quickly.\nI’m in the gallery watching these legislators and others are watching the livestream on the Kentucky PBS station website. At the last minute, the legislators slid the pension changes into a sewer bill. To add insult to injury, I think they thought that they were being cute.\nBam Carney, the teacher-legislator who had filed the charter bill and now this sewer bill, is a scab. So he stands up on the House floor and starts yelling about teachers have been so unprofessional with these protests, that they’re a minority, etc. It was a disgusting display of arrogance; the guy’s completely out of touch with reality.\nThis new bill basically includes all of the old attacks on the pension system. The one concession is that they weren’t taking away the cost of living increases. And they tried to make this seem like they were doing us a huge favor, making a so-called compromise. But the cost of living increase is already ours. It’s crazy. I can’t believe we’ve had to fight so hard for something we already have. The real democracy was outside, where everybody was screaming at them, making their voices heard.\nSo I started talking to our zone leaders. They’re telling me, “Our folks want to take action.” As I’m sitting in the gallery, I posted the following on our Facebook group: “I’m watching democracy die. I can’t tell you all what to do, but I won’t be at work tomorrow. Follow your heart.”\nThe Legislature passed the bill and I went to get something to eat with other state workers and teachers. We’re all glued to our phones, looking at the Fayette County SubFinder list, where we can see how many substitute positions are needed for the next day. It starts going up and up. First 70, then 574, then higher.\nWe’re watching this together. And we saw that they were going to have to shut down Fayette County schools. I’m getting emotional talking about this, it was really beautiful. When someone writes a book about this, readers aren’t going to believe it happened.\nWe didn’t know people had it in them. But they did. I didn’t think other people knew they had it in them. But they’ve showed themselves that they have worth. We lost the bill that night, but we won something big because we were able to stand together.\nAfter Fayette County went, we saw that if we could get one county, then the others would follow. Our local organization worked well — county after county shut down. Fayette led the way and I’m proud of that because it’s my county.\nAll in all, there were about twenty counties that closed their schools on Friday because people called in sick. We really shut it down, it was the most amazing thing. We had a spontaneous rally on Friday and five to six hundred people show up. Nobody was leading it, but people were madder than hell.\nOne thing I’ve laughed about is that the politicians blame the teachers’ union for all these rallies, uprisings, and actions. They’ve vilified the unions. So when the sickouts happened, I hope the legislators shit their pants. Because the sickouts had nothing to do with the union — workers just said enough is enough. The Republicans have been lying to themselves, saying that this is all happening because of the big bad unions. But it’s actually the work of pissed off moms and dads.\nAnd now Monday is going to be huge. A lot schools are on spring break, so teachers and staff will be coming from all around. I anticipate that this will be one of the largest rallies Kentucky has every seen. And of the schools that aren’t on break next week, there are only three left that haven’t yet announced that they’re closing.\nThe governor hasn’t signed the bill yet. But I have about as much confidence that unicorns exist as I have in Governor Bevin doing something in the interest of working people out of the goodness of his heart. He only cares about his fat cat buddies.\nThe struggle is far from over. The attorney general is saying that he thinks this sewer pension bill is illegal, because of its violation of workers’ inviolable contracts. He said he’s going to file a lawsuit over it. The KEA is going to join in on the suit and it’ll go to court.\nThe next step for us is that now we’re going to fight to stop this horrific budget. It’s going to be a huge battle.", "url": "https://www.jacobinmag.com/2018/04/kentucky-teachers-public-workers-strike-pensions-budget"}