{"authors": ["Michelle Ganassi"], "date_download": "2020-05-04 20:24:56", "date_modify": "2020-05-04 20:24:56", "date_publish": "2018-09-06 02:45:00", "description": "President Donald Trump is coming to Somerset County for the 9/11 remembrance ceremony at the Flight 93 National Memorial. The Associated Press reported that the White House says the...", "filename": "_20274c1c3cfa4e5282cc22bc87a66106_1588623896.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_20274c1c3cfa4e5282cc22bc87a66106_1588623896.html", "title": "Trump to attend Flight 93 anniversary service", "title_page": "Trump to attend Flight 93 anniversary service", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Donald Trump is coming to Somerset County for the 9/11 remembrance ceremony at the Flight 93 National Memorial.\nThe Associated Press reported that the White House says the president will be accompanied at Tuesday’s ceremony near Shanksville by first lady Melania Trump.\nThe event is being held from 9:45 to 11 a.m.\nRepublican Somerset County Commissioner Gerald Walker said he does not believe Trump has been to the site before.\n“I think it is great when any of our presidents or vice presidents or governors have showed up,” he said. “They come and show their appreciation for what those folks gave up.”\nForty passengers and crew died when United Airlines Flight 93 crashed into a Stonycreek Township field after they decided to fight back against four hijackers. Nearly 3,000 people were killed on Sept. 11, 2001, when hijackers flew commercial airplanes into New York’s World Trade Center and the Pentagon.\nWalker said he was not surprised when it was announced that the president would be attending.\n“I think every president has shown up at least once, some every year,” he said. “I really expected him to show up this year.”\nRon Aldom, Somerset County Chamber of Commerce executive director, said it is a good thing when any sitting president comes to Somerset County for a memorial service.\n“It’s not about party politics,” he said. “It’s about the president of the United States coming to Somerset County for a memorial service. It’s a significant thing.”\nTrump observed the solemn anniversary for the first time as president last year. He and the first lady led a moment of silence at the White House surrounded by aides and administration officials at the exact time that hijackers rammed the first of two airplanes into the Twin Towers. Trump also participated in a 9/11 observance at the Pentagon last year.\n(The Associated Press contributed to this report.)", "url": "https://apnews.com/20274c1c3cfa4e5282cc22bc87a66106"}