{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:09:49", "date_modify": "2020-05-04 20:09:49", "date_publish": "2018-08-10 12:57:58", "description": "By Donald Pierson For the better part of a decade, I had the privilege of working with then-UMass Lowell Chancellor Marty Meehan. It was exciting to be a part of a team that initiated a...", "filename": "_c81a19dc51de49ef938b2caf48e2ecac_1588622989.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c81a19dc51de49ef938b2caf48e2ecac_1588622989.html", "title": "Adjunct Faculty's Attacks on Meehan", "title_page": "Adjunct Faculty's Attacks on Meehan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Donald Pierson\nFor the better part of a decade, I had the privilege of working with then-UMass Lowell Chancellor Marty Meehan. It was exciting to be a part of a team that initiated a remarkable transformation of UMass Lowell that continues today. The campus has experienced dramatic increases in enrollment, retention and graduation rates; faculty hiring; research funding; philanthropic donations; and facility modernization.\nMeehan’s success as UMass Lowell chancellor earned him the presidency of the five-campus UMass system in 2015, where his passion for public higher education is felt across the entire state. Leaders with the Marty Meehan’s track record of success are highly sought across the country. This state is fortunate to have his energies focused on advancing opportunities for UMass.\nAround the time that Meehan left UMass Lowell to lead the UMass system, I was serving as an academic officer at UMass Lowell, and personally sat at the negotiating table as we began bargaining for a new contract with the union representing adjunct faculty on campus.\nSince that time, other campus unions have negotiated and approved two contracts; but negotiations with the adjunct faculty United Auto Workers union leadership remain mired and unmoving despite the good faith efforts of the UMass Lowell administration.\nAfter years of failing to build support beyond their own ranks, in recent months a small number of adjunct faculty union leaders have tried a new tactic to generate attention. They have directed a misleading media campaign targeting President Meehan.\nNot only does the campaign mischaracterize President Meehan’s work on behalf of so many students, families, faculty, researchers and residents, all of whom benefit from a top-tier university in Lowell, the union leaders clearly misunderstand the role of the president.\nUnion negotiations occur at the campus level between the individual bargaining units and the campus administration. President Meehan hasn’t been a party to the negotiations for more than three years.\nBy targeting President Meehan, the union leadership’s apparent goal is to gain leverage in negotiations not just by using the profile he has built over 30 years of public service, but by tarnishing his significant record of achievement on behalf of his alma mater and the City of Lowell.\nRather than a transparent diversion tactic, the adjunct union leadership would better serve its membership, which has been waiting more than three years for a new contract, by focusing on bargaining in good faith to achieve a fair and equitable resolution.\nUMass Lowell leaders have a fiduciary responsibility to be judicious stewards of the investment made in the campus by taxpayers, students and their families.\nOver more than 50 negotiation sessions, the faculty adjunct leadership has demanded full health and retirement benefits for adjunct faculty who are teaching two classes a semester -- which doesn’t even meet the minimum half-time work load that is required in Massachusetts to qualify for public benefits. They also seek wage increases as high as 50 percent, all at a potential cost to students, families and taxpayers of more than $24 million.\nMost adjunct faculty teach one or two courses a year and are employed full time in other jobs in their fields. But even when UMass Lowell offered competitive salary increases to all adjunct faculty and health benefits to senior adjunct faculty teaching three or more courses a semester, the offers were rejected by union leadership.\nIt is unfortunate that union leaders have decided to spend time and resources on a misguided attack strategy rather than on settling a contract that would benefit hundreds of hard-working adjunct faculty members.\nDonald Pierson is the former provost at the University of Massachusetts Lowell.", "url": "https://apnews.com/c81a19dc51de49ef938b2caf48e2ecac"}