{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:09:48", "date_modify": "2020-05-04 20:09:48", "date_publish": "2018-11-11 05:00:01", "description": "Emotion crept into Gary Perkey's voice Sunday as he addressed the crowd gathered at Memorial Park for the World War I Memorial Grove rededication ceremony. Members of his organization :...", "filename": "_1b119adab5384fe6bf1638e38a8923e5_1588622988.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1b119adab5384fe6bf1638e38a8923e5_1588622988.html", "title": "Plaque unveiled to honor local WWI heroes on Veterans Day", "title_page": "Plaque unveiled to honor local WWI heroes on Veterans Day", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Emotion crept into Gary Perkey’s voice Sunday as he addressed the crowd gathered at Memorial Park for the World War I Memorial Grove rededication ceremony.\nMembers of his organization : Warrior Breed, a military veterans’ motorcycle club : stood in a semicircle behind him until Mayor Tom Henry beckoned them to help unveil a monument they made possible: a plaque honoring over 100 local military personnel who gave their lives in what, a century ago, was called the War to End All Wars.\nVeterans Day originated as Armistice Day on Nov. 11, 1919, the first anniversary marking the end of WWI.\nAfter the ceremony : and between people approaching him with thanks : Perkey said the emotion during his speech surprised him. He paused for a moment before describing what resonated with him.\n“Sacrifice,” he said.\nAttendee Mary Renninger of Fort Wayne had a personal connection to one of the veterans commemorated on the plaque. Her uncle John E. Pitzen was killed in France, she said.\nHer father also served in the war, and he risked his health by giving his gas mask to another solider, Renninger said. He died when she was 5, she said, adding he received a Purple Heart.\nLike other attendees, Renninger left with a memento of the ceremony: a poster of the new plaque. She said it will likely interest her family.\n“I’ve got to show it to everybody,” she said.\nHumbled but “extremely proud,” Perkey was pleased by the turnout : a crowd that packed the park’s parking lot and later filled the pavilion for light refreshments.\nWarrior Breed raised $40,000 to benefit Memorial Park. Along with the funding plaque, Perkey said, the club paid to replace 71 trees in Memorial Grove late last year to bring the memorial stand back to 125, and benches are planned for next year.\nPerkey described the effort as a worthy cause.\n“When you don’t remember, you don’t learn,” Perkey said, “and when you don’t learn, you make the same mistakes again.”\nOther Veterans Day events included a brief ceremony near another WWI monument in Memorial Park, where an honor guard was to be stationed for 11 hours and 11 minutes.\n“Veterans Day isn’t just a day for veterans,” said Richard Lineberry, a VFW official. “It’s a day for all Americans. It’s a day to remember why they were fighting and a day for all of us to begin our journey of protecting our freedom and the freedom of many future generations.”\nasloboda@jg.net", "url": "https://apnews.com/1b119adab5384fe6bf1638e38a8923e5"}