{"authors": ["Valerie Richardson The Washington Times"], "date_download": "2020-05-04 21:06:12", "date_modify": "2020-05-04 21:06:12", "date_publish": "2018-04-15 12:34:35", "description": "Federal Communications Commission chairman Ajit Pai has denied a request by Senate Democrats to investigate the right-leaning Sinclair Broadcasting Group for news distortion, saying such a probe...", "filename": "_c3660022e6748f23edef2729d4afd22a_1588626372.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c3660022e6748f23edef2729d4afd22a_1588626372.html", "title": "Ajit Pai, FCC chairman, won't probe Sinclair for 'news distortion'", "title_page": "Ajit Pai, FCC chairman, won't probe Sinclair for 'news distortion'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Federal Communications Commission chairman Ajit Pai has denied a request by Senate Democrats to investigate the right-leaning Sinclair Broadcasting Group for news distortion, saying such a probe would be chilling to free speech.\nThank you for your letter requesting that the Commission investigate a broadcaster based on the content of its news coverage and promotion of that coverage, said Mr. Pai in his letter. In light of my commitment to protecting the First Amendment and freedom of the press, I must respectfully decline.\nHis reply was dated April 12, the day after the request from 11 Senate Democrats and Sen. Bernie Sanders, Vermont Independent, who cited Sinclair’s proposed $3.9 billion acquisition of Tribune Media Company.\n“We are concerned that if the Sinclair-Tribune merger continues without a thorough review of these new facts, Sinclair’s practices of news distortion will proliferate to even more local stations, which Americans rely upon every day for fair and impartial news,” said the Senate letter.\nSigners, including Sens. Maria Cantwell of Washington and Elizabeth Warren of Massachusetts, said they were alarmed by Sinclair’s local anchors being required to read a promotional message last month about biased and false news.”\nThe promo touted the stations’ commitment to balanced journalism and warned that “some members of the media use their platforms to push their own personal bias and agenda to control exactly what people think.”\nIn their letter, the senators said that such must-run dictates from Sinclair harm the freedom of the press guaranteed in the First Amendment by turning local journalists into mouthpieces for a corporate and political agenda.\nMr. Pai responded that the FCC lacks the authority to yank broadcast licenses based on the content of a particular newscast.\nI understand that you disliked or disagreed with the content of particular broadcasts, but I can hardly think of an action more chilling of free speech than the federal government investigating a broadcast station because of disagreement with its news coverage or promotion of that coverage, Mr. Pai said.\nThe Sinclair promo unleashed an outcry after Deadspin compiled a video of anchors at multiple Sinclair stations reading it.\nHow America’s largest local TV owner turned its news anchors into soldiers in Trump’s war on the media: https://t.co/iLVtKRQycL pic.twitter.com/dMdSGellH3 Deadspin (@Deadspin) March 31, 2018\nCritics such as former CBS anchor Dan Rather described the episode as “Orwellian,” and Rep. Adam Schiff, California Democrat, tweeted that Sinclair was moving America one step closer to state run media, but Sinclair described the uproar as ironic.\nIt is ironic that we would be attacked for messages promoting our journalistic initiative for fair and objective reporting, and for specifically asking the public to hold our newsrooms accountable,” said Sinclair senior vice president Scott Livingston in a statement. “Our local stations keep our audiences trust by staying focused on fact-based reporting and clearly identifying commentary.\nThe proposed merger would increase Sinclairs television stations from 193 to 220, extending its reach into 72 percent of U.S. homes and raising questions about whether the acquisition would constitute an anti-trust violation.\nReasons Matt Welch argued that the 72 percent figure is overblown, given that only 9 percent of viewers access television without a cable, satellite or internet connection, according to Pew Research, and Sinclair has described its average market share as in the low 20s.\nStill, even conservative media outlets Newsmax, One America Network and the Blaze oppose the merger over concerns about monopoly power.\nFormer Republican Rep. Tom DeLay warned in a Politico op-ed that the acquisition would set a terrible precedent that would allow liberal networks like ABC, CBS and NBC to buy more stations.", "url": "https://apnews.com/c3660022e6748f23edef2729d4afd22a"}