{"authors": ["Sentinel"], "date_download": "2020-05-04 20:10:01", "date_modify": "2020-05-04 20:10:01", "date_publish": "2018-11-30 11:33:38", "description": "By Colin A. Young State House News Service BOSTON -- National Grid says it wants to strike a deal to end its lockout of two unions representing gas workers by Christmas, but the...", "filename": "_37fc9f6f5cb54ba4843d97483810ce46_1588623001.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_37fc9f6f5cb54ba4843d97483810ce46_1588623001.html", "title": "National Grid Knocks Unions' Counter-proposal", "title_page": "National Grid Knocks Unions' Counter-proposal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Colin A. Young\nState House News Service\nBOSTON -- National Grid says it wants to strike a deal to end its lockout of two unions representing gas workers by Christmas, but the utility is not ready to accept a union counter-proposal that it says “only seeks to maintain the status quo.”\nThe utility and United Steel Workers Locals 12012 and 12003 are set to met at the negotiating table Thursday for the first time since the unions offered a counter-proposal last week. On Wednesday evening, the unions said their offering “would meet the needs of our workers, tackle the serious safety problems within the company, and address the priorities expressed by National Grid.”\nThe unions have continued to press the issue of public safety in the wake of the gas explosions and fires in Columbia Gas’s Merrimack Valley territory in September. National Grid has said it is continuing to repair leaks as required by law and is “focusing on high priority (emergency and compliance) work” during a state-mandated work moratorium.\nNational Grid plans on Thursday to negotiate the full counter-proposal, offered last week by the unions that have been locked out since late June, but said in a statement Wednesday evening that the counter-proposal as put forward “doesn’t address the core issues of health insurance and new-hire retirement plans.”\n“It only seeks to maintain the status quo,” the statement, issued by corporate communications director Danielle Williamson, said. “We will be prepared to negotiate for contracts with these two local unions that are in line with those accepted by other unions representing 8,400 employees at National Grid, as well as by other United Steelworkers locals at multiple utilities across New England.”\nWilliamson said the union proposed “slight increases” to health insurance copays but has not addressed “a core proposal” of National Grid’s -- “to adopt a modest sharing of health insurance costs through deductibles and co-insurance, to which 10 other unions in Massachusetts have previously agreed.”\nThe union plan, Williamson said, would allow future hires “the option of maintaining the same pension benefits as current employees, and all employees the option to preserve the Steelworkers’ current health insurance benefits” which have no deductibles and co-insurance.\nAccording to National Grid, its five-year contract offer features wage increases totaling 14.5 percent, a no-layoff guarantee to all employees with five-plus years of service, and an 80 percent company contribution to health insurance premiums.\n“It’s disappointing that rather than negotiate with workers, National Grid chose to reject that offer through a statement to the media,” union presidents John Buonopane and Joe Kirylo said in a statement. “Last June, National Grid made the disastrous and reckless decision to lockout 1,250 of its most experienced employees. The company decided to use its employees’ paychecks and health insurance - and the safety of Massachusetts communities - as a bargaining chip in these negotiations. This is a shame.”\nOn Monday, Kirylo circulated a list of grade 1 gas leaks he said his local had discovered and reported to National Grid. He said each leak would be repaired if his workers were allowed to return to work and cautioned that the leaks could become more dangerous as the weather gets colder.\n“With so much rain over the last three weeks the ground will soon freeze solid soon as the temperatures drop,” he wrote in an email to union members and supporters. “The future looks dangerous for the public with so many grade one leaks going un-repaired.”", "url": "https://apnews.com/37fc9f6f5cb54ba4843d97483810ce46"}