{"authors": ["W. Gardner Selby"], "date_download": "2020-05-04 20:06:21", "date_modify": "2020-05-04 20:06:21", "date_publish": "2018-09-09 23:31:03", "description": "Texas has “had over 600,000 crimes committed by illegals since 2011. Over 1,200 homicides.” — Ken Paxton on Aug. 26, 2018, in an interview on “Fox & Friends” Republican Ken Paxton, the...", "filename": "_bba450435fe544539a62548f596615a3_1588622781.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bba450435fe544539a62548f596615a3_1588622781.html", "title": "Paxton draws on debunked figures for statement on crimes committed by ‘illegals'", "title_page": "Paxton draws on debunked figures for statement on crimes committed by ‘illegals'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Texas has “had over 600,000 crimes committed by illegals since 2011. Over 1,200 homicides.”\n— Ken Paxton on Aug. 26, 2018, in an interview on “Fox & Friends”\nRepublican Ken Paxton, the Texas attorney general seeking a second term against Democrat Justin Nelson, invoked previously debunked numbers when he was asked about Democrats seeking to decriminalize border crossings.\nPaxton, on “Fox & Friends,’ called decriminalizing crossings “a little scary,” telling the host: “Obviously, you know we’re a border state. We are struggling with protecting our border, protecting our people. To have a policy like this that takes away criminalizing crossing the border, you’re basically opening up your borders.”\nPaxton went on: “We’ve had over 600,000 crimes committed by illegals since 2011. Over 1,200 homicides. We’ve had human trafficking. We’ve had all kinds of drug crimes. And if we make it more lenient, we’re going to get more of it. So, it’s going to cost lives if we go down this path.”\nThe big crime counts aired by Paxton reminded us we’ve long found flaws in citations of counts of crimes and homicides attributed to information publicized by the Texas Department of Public Safety, the lead state agency tasked with helping keep watch over the Texas-Mexico border.\nIn July 2014, Gov. Rick Perry warned about the security of the Texas-Mexico border by declaring that more than 3,000 homicides had been committed by “illegal aliens” in six years.\nPants on Fire, we ruled, in that Perry had misrepresented figures on a DPS web page that could be read, at worst, to indicate that in their lifetimes, an unspecified subset of 203,685 “criminal alien defendants” booked into Texas jails over the nearly six years through June 2014 had been charged with — not convicted of committing — 3,070 homicides.\nNortheastern University criminologist Ramiro Martinez, Jr. built his own analysis of Texas crime numbers and said that if Perry’s claim held up, it would mean that more than half the state’s homicides in the six years were committed by unauthorized residents — an absurdity. “It just boggles the imagination that level of ‘aliens’ were involved to that extent over time and nobody noticed,” Martinez said.\nEarly this year, Lt. Gov. Dan Patrick’s statement that “566,000 crimes” had been “made in Texas by criminal aliens in the last six years” earned a Pants on Fire rating. At the time, the DPS said that more than 638,000 charges and over 286,000 convictions had been accumulated by more than 240,000 “criminal aliens” booked into Texas jails in the latest six-plus years. As before, we confirmed the charges had been amassed through their “criminal careers.”\nIn March 2018, a claim by Sean Hannity of Fox News that 642,000 crimes were committed against Texans by criminal immigrants in a recent seven-year period was rated False.\nHannity’s claim, triggered by DPS-posted figures, reflected on mostly petty charges leveled through the lifetimes of 245,000 “criminal aliens” booked into local Texas jails from June 2011 through February 2018 — and 34 percent of them weren’t identified as living in the U.S. without legal authorization at their latest arrest, the DPS said.\nGenerally, nonviolent offenses predominated, accounting for 66 percent of the tallied charges and 55 percent of career convictions. Martinez looked over these DPS-posted numbers, later saying that to his eyes, they reflected what’s known about most domestic crime — a “sea of minor drug and property crimes.”\nIn May 2018, DPS spokesman, Tom Vinger pointed out a substantially revised version of the web page.\nVinger said that the revised web page “only refers to charges and convictions for criminal aliens who were in the country illegally. Past versions” presented higher counts by showing “charges and convictions for all criminal aliens — legal and illegal.” Another change: Vinger said the previous web page tallied crimes for each jailed individual’s criminal “career” while the new version, he wrote, shows charges and convictions occurring since June 2011.\nWhen we requested Paxton’s backup information, a spokeswoman for his state office, Kayleigh Lovvorn, said by email that Paxton’s numbers came from the same DPS web page, “Texas Criminal Illegal Alien Data.”\nInformation on the revised web page failed to support Paxton’s reference to “illegals” committing over 600,000 crimes and more than 1,200 homicides since 2011. The newly available figures linked far fewer offenses, including homicides, to unauthorized residents.\nAccording to U.S. Department of Homeland Security “status indicators,” the DPS reported, “over 261,000 criminal aliens were booked into Texas jails between June 1, 2011, and July 31, 2018, of which over 175,000 were classified as illegal aliens.” In the same period, DPS says, “these 175,000 illegal aliens were charged with more than 273,000 criminal offenses and which included arrests for 505 homicide” charges.\nAll those criminal charges, the DPS says, “have thus far resulted in over 114,000 convictions including 229 homicide convictions; 12,801 assault convictions; 3,016 burglary convictions; 17,002 drug convictions; 159 kidnapping convictions; 6,820 theft convictions; 10,846 obstructing police convictions; 962 robbery convictions; 1,596 sexual assault convictions; 1,087 sexual offense convictions; and 1,215 weapon convictions.”\nAccording to the web page, Homeland Security separately identified another 10,182 “illegal aliens,” all imprisoned in Texas, who together had been charged with more than 6,000 criminal offenses included 83 homicide charges.\nWe combined the two sets of counts — a move supporting the conclusion that, per the DPS, more than 185,000 individuals believed to be living in the U.S. without legal permission were jailed in Texas over the seven-plus years who all told accounted for more than 279,000 criminal charges and over 114,000 convictions including 589 homicide charges and 229 homicide convictions — on all fronts, considerably shy of what Paxton said.\nCato Institute analyst Alex Nowrasteh, who authored a February 2018 study of crimes committed by immigrants in Texas, said that in 2016, according to DPS data he said he obtained through a public information request, 16,277 illegal immigrants were convicted of a crime in Texas, accounting for 4 percent of Texas residents convicted of a crime at a time that illegal immigrants accounted for 6 percent of the state’s residents, according to U.S. Census Bureau research.\nPut another way, Nowrasteh said the “most crime-prone group in Texas were American natives.’\nOur ruling\nPaxton said Texas has “had over 600,000 crimes committed by illegals since 2011. Over 1,200 homicides.”\nBoth of these numbers — which we’ve twice debunked in detail since 2010 — exceed what the state estimates by more than 400 percent. DPS-posted figures lately suggest that since mid-2011, Texas-jailed individuals believed to be living in the U.S. without legal permission account for 229 homicide convictions among more than 114,000 convictions across a range of mostly minor offenses.\nWe rate Paxton’s claim Pants on Fire: The statement is not accurate and makes a ridiculous claim.", "url": "https://apnews.com/bba450435fe544539a62548f596615a3"}