{"authors": ["Joe Burns", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Branko Marcetic", "Meagan Day", "Kevin Prosen", "Jay O'Neal", "Doug Henwood"], "date_download": "2020-05-04 19:53:34", "date_modify": "2020-05-04 19:53:34", "date_publish": "2018-03-05 00:00:00", "description": null, "filename": "2018_03_public-sector-unions-history-west-virginia-teachers-strike_1588622014.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/03/05215259/5539884377_b8af0d0021_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_03_public-sector-unions-history-west-virginia-teachers-strike_1588622014.html", "title": "“There Is No Illegal Strike, Just an Unsuccessful One”", "title_page": "“There Is No Illegal Strike, Just an Unsuccessful One”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "All of this is fitting at a time when anti-union forces are trying to turn back the clock on collective bargaining rights. The modern public employee union movement was born of struggle — the product of a great strike wave in the 1960s and 1970s. The school personnel strike in West Virginia represents a return to those militant days.\nThe ongoing teachers’ strike in West Virginia is remarkable in many ways. Thousands of public workers are engaged in a grassroots rebellion, defying restrictions on their right to strike. They’ve forced the state’s Republican governor to grant concessions, carrying on despite an announced deal by union officials. They’ve inspired other workers to think anew about militant action, both in West Virginia and outside the state .\nMilitancy Present and Past\nTeacher strikes are unlawful in West Virginia. State law does not provide for collective bargaining, and public employees have no legally recognized right to engage in work stoppages. Yet legality has a way of drifting into the background when workers organize en masse.\nDuring the high point of the 1960s and ’70s public sector strike wave — when millions of government workers were involved in work stoppages — unionists had a slogan: “There is no illegal strike, just an unsuccessful one.” Lawmakers could impose draconian penalties, courts could issue injunctions, and the corporate media could fulminate endlessly. But if the strike was strong, if the cause was just, and if community support was robust, harsh penalties were rarely imposed.\nIt hadn’t always been that way. As late as the 1950s, public employee unions barely existed. The ones that were around represented just a fraction of the public sector workforce and weren’t recognized by employers as workers’ representative. With minimal leverage, they were left to beg. That began to change in 1960, when New York teachers walked off the job. Over the next two decades, public workers across the country would follow their example.\nOutlawing strikes did little to deter government workers. Work stoppages occurred more frequently in states with bans on collective bargaining and striking. With no orderly process for bargaining, workers had no choice but to illegally strike to get their demands met. Faced with such intransigence, policymakers gave in and began recognizing public sector unions.\nWe’re seeing a similar scene in West Virginia: after years of pent-up grievances, teachers felt there was no other option but to strike. They had little to lose and much to gain from flouting state law.\nThis isn’t to say that workers can always, everywhere, simply ignore the law and dismiss possible legal repercussions. Striking air traffic controllers found out in 1981 that tactics successful in previous years did not work because the ground had shifted beneath their feet.\nBut the West Virginia strikers seem well-positioned. They enjoy strong public support. There is no indication that repressive action would make the dispute go away. And finally, and of particular importance: their strike is enormous. Rather than striking one school district or county, teachers decided to shut down schools in all fifty-five counties. Given the sheer number of striking teachers, politicians can’t jail or punish them all, and they can’t run the classrooms without them. An old miners’ slogan went, “You can’t mine coal with bayonets.” The same is true with teaching children.\nIt’s easy to imagine a different outcome if the strike was launched on a smaller scale. Isolated groups of teachers could have been easily fired and replaced. Confined to a few locations, the political impact would have been minimal — a blip on the radar rather than an event that’s seized the entire state’s attention.\nThe public sector strikes of the 1960s and ’70s were similarly captivating affairs, leveraging solidarity and mass action to grab headlines for weeks. When sanitation workers struck in Baltimore in 1974, for example, they were soon joined on the picket line by a range of other city employees. As garbage piled up, and all city workers went out on strike, the dispute dominated the news in the city and forced policymakers to respond.\nEmployers hate solidarity. They work to particularize workplace disputes, to make them problems of individual workers rather than group disputes. In the case of public employees, this takes the form of outlawing collective bargaining or, failing that, forcing workers to bargain in small groups. West Virginia teachers have rejected that restricted framework. In doing so, they have given the most powerful advice they could to the labor movement — “go big or go home.”\nBy all accounts, the strike is a bottom-up rebellion. It was organized by rank-and-file teachers, with state teachers’ unions scrambling to catch up. This, more than anything, should give labor partisans hope. We have had decades of inaction by national union leadership, thousands of pages of drivel from union pundits, and little in the way of action. If the labor movement is going to revive, it will be from the bottom up.\nThe early history of public employee unions is again instructive. Entering the 1960s, most public sector unions were conservative, weak, ineffectual, and adamantly opposed to public employee strikes. Most had provisions in their constitutions barring locals from striking, and believed the way to make gains was to appear respectable.\nRank-and-file workers rebelled against this framework. They ignored the national union leadership, court injunctions, and the corporate media. They dismissed union leaders who told them to go back to work. They replaced hidebound leaders, or formed new unions.\nThrough ambitious action, they made the public sector a bastion of unionism.", "url": "https://www.jacobinmag.com/2018/03/public-sector-unions-history-west-virginia-teachers-strike"}