{"authors": ["Karen Farkas"], "date_download": "2020-05-04 20:05:46", "date_modify": "2020-05-04 20:05:46", "date_publish": "2018-03-07 17:26:58", "description": "Kent State University unveils $1 billion master plan that includes new entry, College of Business KENT, Ohio - Kent State University has unveiled a $1 billion, 10-year master plan for the...", "filename": "_9a7bc038406e4b32923c87f50b1a6a94_1588622746.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9a7bc038406e4b32923c87f50b1a6a94_1588622746.html", "title": "Kent State University unveils $1 billion master plan that includes new entry, College of Business", "title_page": "Kent State University unveils $1 billion master plan that includes new entry, College of Business", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kent State University unveils $1 billion master plan that includes new entry, College of Business\nKENT, Ohio - Kent State University has unveiled a $1 billion, 10-year master plan for the 866-acre main campus, including creating a gateway on Main Street, building a new College of Business Administration and adding green space.\n“This is a bold transformative plan,” President Beverly Warren told the board of trustees on Wednesday. “This is grounded in a student-first philosophy.”\nTrustees are expected to approve the plan later in the day.\nThe plan calls for creating an intergenerational village and a Greek village as well as renovating the Student Center and building additions for the School of Music and the Fashion School.\nSee the proposed plan below or click here if on a mobile device.\nThe university currently has no plans to issue bonds to finance the projects, including the first phase, which is expected to cost $220.8 million and be completed in 2020.\nAbout $30 million is expected to be provided from the state capital budget. The university plans to fund another $63.4 million from investment earnings realized last year from the strong market, Warren said.\nThe remaining $127.4 million is to be funded from public/private partnerships with developers and through a capital campaign.\nThe $72.3 million business administration building is expected to get underway this year, officials said. The building will be owned by a developer and leased by the university, but the funding plan had to include a philanthropic component, Warren said.\nFour developers have responded to requests for proposals and will present their designs and financing plans in mid-April. The funding models could including naming rights or donating the building to Kent State, officials said.\nHere are other project proposals:\nThree parking garages, which will replace surface lots, many which will become green space. The garages will be owned by the developer and leased to the university.The former Art Building will be transformed into a Design and Innovation Center, including a lecture hall, classrooms, studios and dining.An addition to Rockwell Hall, which will include a lecture hall, a fashion runway, classrooms and sewing studios.The esplanade connecting the campus to the city of Kent will be expanded.One of two entrances to the university from Main Street will be removed to create a signature gateway.A three-story addition to the Aeronatucs and Technology Building that will include a lecture hall and labs.Creation of new academic and retail space through a public/private partnership on university-owned land at Lincoln and Main streets.Renovations of numerous academic buildings.\n“This is a combination of foresight and flexibility,” said trustee Shawn Riley, who was involved in the 18-month process. “This plan aligns with the university strategy of students first, regional impact and excellence in stewardship.”", "url": "https://apnews.com/9a7bc038406e4b32923c87f50b1a6a94"}