{"authors": ["Kelly Reardon"], "date_download": "2020-05-04 20:08:01", "date_modify": "2020-05-04 20:08:01", "date_publish": "2018-01-13 15:00:00", "description": "See National Weather Service snowfall reports from Friday's ice, snowstorm in Northeast Ohio CLEVELAND, Ohio -- Scattered snow continues to fall across some areas in Northeast Ohio as the...", "filename": "_e02ac30af0134c458037dacd3ef7162d_1588622881.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e02ac30af0134c458037dacd3ef7162d_1588622881.html", "title": "See National Weather Service snowfall reports from Friday's ice, snowstorm in Northeast Ohio", "title_page": "See National Weather Service snowfall reports from Friday's ice, snowstorm in Northeast Ohio", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "See National Weather Service snowfall reports from Friday’s ice, snowstorm in Northeast Ohio\nSee National Weather Service snowfall reports from Friday’s ice, snowstorm in Northeast Ohio\nCLEVELAND, Ohio -- Scattered snow continues to fall across some areas in Northeast Ohio as the arctic front sparking up a snow and ice storm Friday continues to push east, further out of the region.\nThankfully, an end in the snow comes soon -- showers should taper off by the afternoon. With temperatures in the teens until the single digits later tonight, there are still some hazards. While many major highways are already treated, many untreated secondary roads could still be very slick and icy as everything froze solid Friday.\nCalm, but frigid after Northeast Ohio’s Friday snow storm: Weather forecast\nBut the worst of it is over.\nHow much snow did you get in your area?\nCheck out some 12- and 24-hour snowfall reports from the National Weather Service as of Saturday morning:\n(Note: the absence of a report does not indicate zero snowfall)\nPrevious storm coverage:\nLive updates as winter storm hits Cleveland during evening commute from meteorologist Kelly Reardon\nIcy, possibly snow roads ahead for Cleveland commute: Hour-by-hour forecast\nNortheast Ohio winter storm update from meteorologist Kelly Reardon: Snow, ice on the way\nNational Weather Service issues flood advisory for Rocky River in Cuyahoga County until 10 p.m.\nKeep checking cleveland.com/weather for daily weather updates for Northeast Ohio, and don’t forget to submit any weather questions you may have!\nKelly Reardon is cleveland.com’s meteorologist. Please follow me on Facebook and Twitter @KellyRWeather.", "url": "https://apnews.com/e02ac30af0134c458037dacd3ef7162d"}