{"authors": ["Ronan Burtenshaw", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:55:38", "date_modify": "2020-05-04 19:55:38", "date_publish": "2018-02-27 00:00:00", "description": null, "filename": "2018_02__1588622138.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/02/27113220/GettyImages-149366282.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_02__1588622138.html", "title": "Summoning the Future", "title_page": "Summoning the Future", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In the decades before the National Health Service (NHS), health care in Britain was guided by very different ideas. Most of the country’s hospitals were grim Victorian centers for the destitute, derived from workhouse infirmaries established under the Poor Law. This 1834 statute saw poverty as a moral failing — and one that should be punished with hard labor. The Royal Commission report which preceded its passage summed up its perspective: “every penny bestowed, that tends to render the condition of the pauper more eligible than that of the independent labourer, is a bounty on indolence and vice.” The rich avoided the nightmare of the workhouse infirmary by using private doctors, who would often perform surgeries as well as more general practice on house calls. But for a growing proportion of Britain’s workers and poor, the infirmary became the norm for hospital care. When the medical journal the Lancet was given leave to form a commission of examination into their conditions in 1865, they dubbed the infirmaries “a disgrace to our civilization.” The facilities, they said, “sin by their construction, by their want of nursing, by their comfortless fittings, by the supremacy which is accorded to questions of expense, by the imperfect provision made for skilled medical attendance on the sick, by the immense labor imposed on the medical attendants, and the wretched pittances to which they are ground down.” Though the Lancet report would produce reforms, infirmaries remained houses of terror for workers, the elderly, the poor, and the disabled until the twentieth century, long after many were taken into state care as municipal hospitals in the wake of the 1929 Local Government Act. Even as state and charitable provision grew, the British health care system was guided by a conservative ethos and strictly divided by class. It fell far behind its Western counterparts in almost every metric. Surveying this landscape begs the question: how was it that these inauspicious origins developed into the world’s first free, comprehensive, and universal health care system? As historian Charles Webster notes, “the path to the NHS was by no means inevitable.” Indeed, he adds, “any step towards translation of pious sentiments regarding healthcare into practicable objectives was liable to expose clashes of ideological loyalty and stir up conflict between affected vested interests.” Behind Britain’s NHS lies a long struggle against health care profiteers and their political allies, one waged on many fronts and by many protagonists. But the determinant factors throughout were working-class power, labor organization, and a socialist vision — without which the miracles of modern medicine would never have been decommodified and provided to so many as a right.\nThe Wilderness Years To describe British health care at the beginning of the twentieth century as fragmented would be an understatement. Primary care was predominant and provided by an army of independent contractors known as general practitioners (GPs). These GPs — not only medical but also in other sectors such as dentistry — were free to operate where they wished and usually concentrated in affluent areas to the neglect of those with fewer means. The hospital system was divided between public municipal hospitals which were descendants of the Poor Law and a voluntary service run on a charitable basis. A Ministry of Health was established for the first time in 1919, but it couldn’t be said to have any serious national remit until the Second World War, with local authorities jealously guarding responsibilities. Public involvement in health care provision grew. Public health legislation followed the Poor Law and focused at first on the eradication of typhus and cholera, but came to encompass health-adjacent functions such as street cleaning, public laundries, bath houses, and maternity clinics. The School Medical Inspection Service also developed, tasked with monitoring the health of the country’s poorest children. But in health care proper, growth in public involvement was outpaced by a voluntary sector which established hospitals at a far greater rate. Before the First World War these had mostly been funded by elite philanthropy, but with the wealth of the richest diminishing during the interwar slump, endowments gave way to fundraising. “Flag days” supported by royals and celebrities were particularly important. Doctors in voluntary hospitals were usually volunteers, unpaid for their service and either relying on their private practice or largesse from the affluent to get by. One way to convince doctors to undertake such roles was to designate the hospitals as teaching facilities — but with limited regulation or oversight, teaching could sometimes take the form of experimentation on the poorest patients. If health care provision was diverse, the means of payment for it were no less so. In the first decade of the century almost all medical care was provided on the basis of contribution or charity, placing it out of the reach of huge swathes of the population. That changed in 1911, when the Liberal government introduced the National Insurance Act, similar to 1880s reforms introduced by German chancellor Otto von Bismarck. Though a step forward, the underlying logic of these measures was not to improve the health of workers so much as to improve output from work. It was hoped that being covered would mean fewer sick days and more productivity. This was consistent with the 1911 act’s limitations — it applied only to workers, provided only for GP care, introduced inadequate sick pay, and was financially tied to the workplace. Its mandatory contributions were also too expensive for the lowest-paid workers and apprentices, with some even going on strike against its passage. Keir Hardie, leader of the Labour Party at the time, decried the scheme as a “porous plaster to cover the disease that poverty causes.” But those worst off were dependents — working-class women and children — who were denied access to insurance altogether. This meant that as late as 1938, only 43 percent of the British population was covered by the meager insurance the act provided. In hospitals, where insurance didn’t apply, costs were increasingly loaded onto patients. This was especially true in voluntary facilities where fundraising was falling short. They came increasingly to rely on almoners, who would conduct interviews with patients on their arrival to ascertain their means. Payment often had an impact on treatment, with facilities segregated to privilege those who could contribute most. The system was rarely considerate, as maternity patient Doris Hoefling recalled to the BBC decades later: “The almoner asked what we earned. She wanted the lot at first. I said, ‘we can’t afford that, we’ll need to get clothes and food for the baby.’ When the baby died, a couple of days later she came up to me in the ward, with a typical caring attitude, and said ‘now that you’ve lost the baby maybe you can pay more.’” While state intervention did see health outcomes improve during the interwar years, they remained comparatively bad and especially so among the working class and poor. Resistance to centralization and lack of investment in vaccines meant thousands of children died every year from infectious diseases such as pneumonia, meningitis, tuberculosis, diphtheria, and polio. Surveys showed that up to 80 percent of children in the mining areas of county Durham and the poorest boroughs of London had signs of rickets. Childbirth was an ongoing hazard, with the maternal mortality rate around one in twenty and the same number of children failing to make their first birthday. As late as 1938, only 43 percent of the British population was covered by the meager National Insurance Act. The growing working-class movement made fighting the lack of health care access a priority. This took national forms — with both the Labour Party and Trades Union Congress (TUC) adopting policies calling for a national health service decades before its arrival — as well as more local ones, with organizations such as the Workers’ Birth Control Group established by women in mining areas with the slogan “It’s four times as dangerous to bear a child as to work down a mine.” But by far the most important intervention was the establishment of Friendly Societies, vast mutual funds organized in working-class communities to provide insurance for health care costs. Such was their success that, by the turn of the century, six times as many workers were involved in Friendly Societies as in the trade union movement. One of the most successful of these schemes was located in the Welsh mining village of Tredegar. The Tredegar Medical Aid Society was formed by miners and iron workers in the town and grew to offer one of the first comprehensive health care provisions available in working-class Britain. The scheme extended coverage to women and children, made opticians, dentistry, and mental health services available for the first time, and even established its own hospital. By the interwar period it covered 23,000 of Tredegar’s 24,000 residents. The scheme influenced a wide range of health care thinkers — but its most prominent disciple was local miner Aneurin Bevan, whose political career would have a greater influence on the formation of the NHS than anyone else. “I am determined,” he said, “to extend to the entire population of Britain the benefits we had in Tredegar for a generation or more. We are going to Tredegarize you.”\nToward the NHS Britain’s labor movement had grown steadily in the years before the Great War. By 1912 it was organizing mass strikes across the country, most prominently in the coalfields where it had fought for and won the first national minimum wage. With the onset of the war effort, industries were nationalized and production increased, bringing with it an upward pressure on wages. This coincided with the first attempt at working-class unity in the union movement, with the “triple alliance” of miners, railwaymen, and transport workers coming together in 1914. The growing power of labor was also reflected in politics, with Labour’s vote increasing from 300,000 in 1910 to 2.2 million by the 1918 general election. A wave of strikes followed in 1919–20, involving more than two million workers in the docks, railways, and coalfields, prompting much fretting about the threat of “Bolshevism” from business leaders and the coalition Conservative-Liberal government. This pressure encouraged attempts at social reform, with health care provision prominent on the agenda. In 1920 the newly established Department of Health produced what became known as the Dawson Report, a breakthrough in government thinking on public health. Though it didn’t recommend a free service, the report’s conclusion that Britain’s hospitals should be brought together under a national system influenced the debates which were to follow. Six years later the Royal Commission on National Health would go farther, advocating public funds to partially cover health care costs. But as the 1920s wore on, the labor movement’s ascent was stalled. First, the triple alliance was broken on Black Friday, when rail and transport union leaders refused to strike alongside the coal miners. The TUC was formed from the ashes, but its first attempt at a general strike in 1926 was abandoned in failure. The Labour Party’s vote grew through the decade and it formed its first minority government in 1924, yet its leadership was increasingly conservative and, by the late 1920s, was refusing to support strikes led by affiliated unions. In 1929 it found itself in government again during the height of the depression and, when in 1931 a majority of its MPs refused to support budget cuts, the first Labour prime minister, Ramsay MacDonald, left the party to form a national government with the Conservatives. Labour expelled MacDonald’s supporters but still lost four-fifths of its seats in the general election later that year. All of this frustrated serious health reform. The 1930s did see expansion of public health programs but little by way of structural changes in provision. As the government stalled, outside agitation increased. Left-wing doctors who had been organized in the State Medical Service Association formed the Socialist Medical Association (SMA) in 1930. Its constitution outlined aims to develop “a socialized medical service, free and open to all.” The SMA affiliated to the Labour Party in 1931 and by 1934 had succeeded in placing much of its policies in the party manifesto. Health care workers in the Medical Practitioners’ Union, increasingly dismayed by the right-wing leadership of the British Medical Association (BMA), came to endorse a nationalized system too. Even in the BMA a report was produced in 1935 by George M’Gonigle arguing that the government needed to increase health care supports and welfare payments to the poor to stave off ill health. But it wasn’t until World War II that a major change occurred in government policy. The increased demand on medical services quickly highlighted the insufficiencies of the country’s atomized, anachronistic health care system and forced the government to attempt to bring it under national control for the first time. The Emergency Hospital Service (EHS) coordinated all hospitals under the Ministry of Health. Their governing boards remained nominally independent, but central government dictated their function and increasingly took control of their funding. As the war progressed to the Battle of Britain in 1940, with unprecedented aerial bombing of British cities, the EHS expanded to include all medical services as well as responsibility for war-related causalities, both civil and military. In a few short years the Luftwaffe had brought about a rationalization in British health care that planners had failed to implement since 1920. Seizing on the communitarian spirit the war had fostered, the Labour Party pushed for a broad-based review of Britain’s social insurance and allied services. The report, drafted by Liberal economist William Beveridge, was published in November 1942 and became one of the British welfare state’s landmark documents. Identifying five “giant evils” in society — squalor, ignorance, want, idleness, and disease — it proposed the introduction of “a comprehensive policy of social progress” in which the state would significantly scale-up its support for public welfare. “A revolutionary moment in the world’s history,” Beveridge noted, “is a time for revolution, not for patching.” Yet the welfare reforms proposed by Beveridge were, in reality, less than revolutionary. His report made clear that its aim was to “balance” collective and individual responsibility for solving social ills. In line with his progressive liberalism, its focus was on ensuring that society should have a “minimum” below which no citizen should fall but, in doing so, the state should guarantee that it did not “stifle incentive.” This placed the Beveridge Report in the tradition of Britain’s social reformers rather than its radicals, one that aimed at improving the lot of the poor but not transforming the fundamental structures had that made them poor. Beveridge’s health care proposals were consistent with these limitations. He favored a defined contribution social insurance system to one funded by general taxation. This was congruent with the Bismarck model, albeit with the state as the single provider. He also left open the possibility that workers with more dangerous occupations might be charged more for their health care, something he hoped would encourage greater caution. Nevertheless, the Beveridge Report met widespread approval among the British public and became synonymous with the idea of a welfare state, garnering great moral appeal. This forced the wartime coalition government to respond and by 1943 it was producing plans to build a permanent national health care system. The Conservatives’ proposals were modest — a scaling up of the local authority bodies under a national leadership, an expansion of insurance and a contract system to bring all doctors into the pay of the state. But even these did not meet with business-class approval. Under pressure from the voluntary hospitals — who feared the confiscation of their assets — and the leadership of the bma, the government quickly retreated and produced a watered down white paper the following year. The Labour Party meanwhile produced its own document, The National Service for Health , in 1943. More detailed in policy terms than the Beveridge Report, it represented the most advanced case for a national, public, and comprehensive health care system to date. Though it did not commit to the abolition of fees or the insurance system, the nationalization of hospitals, or full centralization, it did propose significant increase in the proportion of health care to be funded by general taxation, as well as fully salaried status for doctors. Its advocacy of preventative medicine — with a focus on the elimination of poverty — was also particularly forward looking. For those on the party’s socialist left it didn’t go far enough, but it was nonetheless a strong foundation for the party’s 1945 general-election manifesto, an election Labour was to win in a landslide.\nSocialized Medicine The 1945 British general election was a momentous political event. With the war won, commitment set in that society should never return to prewar conditions. Against a backdrop of the highest trade union membership since the 1910s, Winston Churchill, hero of the battle against Hitler, was unceremoniously dumped out of office with his Conservative Party losing almost two hundred seats. It was a watershed moment for working-class politics and, with the reforms introduced by the Labour government, a profound blow to the capitalist class. For Aneurin Bevan, it brought to mind Marx’s description of the Crimean War: “As exposure to the atmosphere reduces all mummies to instant dissolution, so war passes supreme judgment upon social systems that have outlived their vitality.” Bevan had been a thorn in the side of British governments from the parliamentary backbenches during the Second World War. An early supporter of the Republican cause in Spain, he had proposed a more left-wing basis to the struggle against fascism. This path led him to argue for a popular front between the Labour and Communist parties, and even for an Anglo-Soviet pact, stances which saw him temporarily expelled from the party. He consistently called for nationalization of strategic sectors of the economy during the war and bitterly condemned the Tory government for placing “private property rights before the needs of the nation.” These comments led Churchill to condemn Bevan as a “squalid nuisance.” Bevan, by contrast, held a more nuanced and insightful view of Churchill’s role in the war effort. Preferring his confrontational approach to Chamberlain’s appeasement, he nonetheless recognized that any alliance with the Tory leader could only be temporary. Churchill’s rhetorical interventions may have stirred the spirit of determination in the face of the Wehrmacht, but “What he did not do, and what he could not do, was to summon the future. For Mr Churchill is the spokesman of his order and of his class, and that class and that order is dying.” It was a mark of the socialist left’s power inside and outside parliament in the wake of the 1945 election that a backbench politician who had been such a vociferous critic during the war became the youngest member of Clement Attlee’s cabinet. It moreover reflected the impact socialists had made in the national debate over public health that he was chosen for the crucial position of minister for health. Far from seeing this as an opportunity to moderate, Bevan was determined to take his socialist principles into the construction of the National Health Service, something he declared would be opposed to the “hedonism of capitalist society.” But Bevan’s path to success was not straightforward. On arrival into the ministry he was warned against radical proposals by his permanent secretary, who pointed out that the previous administration had performed an embarrassing climb-down when it attempted more modest reforms. He was also faced with an operating reality in which the professions in the industry, historian Charles Webster notes, had “effectively annexed policy making” through a process of “permanent negotiation.” Throughout Bevan’s three years attempting to build the NHS, the British Medical Association would be the business class’s vanguard against him. Bevan nonetheless persisted — aided by the clarity of his vision. He was opposed to the insurance system in principle, seeing the buying and selling of patient goodwill as something which “dehumanized” both doctor and patient. He also rejected the idea that health care should be denied in any circumstance to those that couldn’t afford it. “You can’t have different treatment in order of contribution,” he argued, continuing that it would be impossible to “perform a second-class operation on a patient if [they] weren’t paid up.” Instead, health care should be funded through general taxation and be free at the point of access, a radical proposal which would remove it from the predations of the market. He also insisted, against Labour Party policy, on the full nationalization of Britain’s hospitals. In the case of the voluntary sector, which amounted to one-third of the facilities at the time, he proposed to achieve this by appropriation of private property, something the Tories condemned vociferously when his bill reached parliament. These nationalized hospitals were also to be brought, he hoped, under a centrally planned system. This idea met with opposition in the Labour Party and Labour-run municipalities, who lobbied hard for a more localized structure. But Bevan was unconvinced. “I would rather be kept alive in the efficient-if-cold altruism of a large hospital,” he replied, “than expire in a gush of warm sympathy in a small one.” This desire to ensure the best care, and for all people, was also a standout feature of Bevan’s NHS. Public health care was to be comprehensive and universal — modeled not on the Poor Law infirmary but on the elite provision available in the private wing of the voluntary sector hospitals. This meant universalizing specialist and consultant services, making mental health, dental, and ophthalmic medicine available to many for the first time, and finding a way to ensure regulation and equal distribution of GPs across the country. Bevan’s legislation faced considerable opposition both before and after its passage in 1946. The British Medical Association threatened a boycott by the country’s doctors. In the letters page of the British Medical Journal , Bevan’s reforms were compared to Hitler’s national socialism, with doctors supportive of them dubbed “quislings” and the minister himself called a “Medical Führer.” The president of the British Hospital Association, Bernard Docker, charged the government with “mass murder.” Amid much consternation, Bevan was forced to make a number of concessions: the hospital system would be run on the basis of regional boards, with only the minister having centralized powers; consultants would be allowed to retain a part-time private practice as long as they did not establish private facilities; and, most controversially of all, GPs would be permitted to remain semi-independent, under the auspices and direction of government, but not fully salaried. The Socialist Medical Association criticized these measures as unnecessary. But, in view of the full historical record, it is clear the intransigence of the BMA posed a fundamental risk to the NHS’s establishment. This prompted Bevan to, in his own words, “stuff their mouths with gold.” Bevan’s legislation faced considerable opposition both before and after its passage in 1946. It took only two years from the passage of the legislation for the NHS to be launched on July 5, 1948. By then opposition from doctors had melted away and more than 90 percent of the population had been enrolled into the system. Queues formed around the block in cities across England and Wales as people sought information on their new entitlements. Bevan’s department produced a leaflet to inform them: Your new National Health Service begins on 5th July. It will provide you with all medical, dental and nursing care. Everyone — rich or poor, man, woman or child — can use it or any part of it. There are no charges, except for a few special items. There are no insurance qualifications. But it is not a “charity.” You are all paying for it, mainly as taxpayers, and it will relieve your money worries in times of illness.", "url": "https://jacobinmag.com/2018/02/summoning-the-future/"}