{"authors": ["Joe Tjaden"], "date_download": "2020-05-04 20:14:38", "date_modify": "2020-05-04 20:14:38", "date_publish": "2018-07-17 11:43:00", "description": "Washington Nationals outfielder Bryce Harper won the Home Run Derby last night, defeating Chicago Cubs outfielder Kyle Schwarber, 19-18. Harper was down 18-9 with approximately 80 seconds...", "filename": "_9eb019bd4a724dbab38cb200e2232e6d_1588623278.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9eb019bd4a724dbab38cb200e2232e6d_1588623278.html", "title": "Joe's Morning Sports-Tuesday, July 17, 2018", "title_page": "Joe's Morning Sports-Tuesday, July 17, 2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Washington Nationals outfielder Bryce Harper won the Home Run Derby last night, defeating Chicago Cubs outfielder Kyle Schwarber, 19-18. Harper was down 18-9 with approximately 80 seconds remaining in the finals before ending with a flourish, taking advantage of his 30-second bonus time to overtake Schwarber. He homered on nine of his last ten swings of regulation and became the third player to win the derby in his home ballpark.\nThe Washington Nationals’ Max Scherzer will take the mound for the National League against Boston’s Chris Sale in a matchup of strikeout artists. The two have combined for over 350 strikeouts already this season. Sale is the third pitcher to start three times in a row, following Lefty Gomez and Robin Roberts. NL manager Dave Roberts says New York Mets right-hander Jacob deGrom will follow Scherzer for the National League. American League skipper A.J. Hinch says 14-game winner Luis Severino of the New York Yankees will come in after Sale, followed by the Tampa Bay’s Blake Snell.\nLSU football coach Ed Orgeron said yesterday that he erred in hiring Matt Canada as offensive coordinator following the 2016 season and that current coordinator Steve Ensminger was the right choice all along. Canada spent the 2017 season at LSU before mutually parting ways with the school. Orgeron promoted Ensminger, the team’s tight ends coach, to coordinator as Canada’s replacement. Asked at SEC media day about making offensive coordinator changes following his first seasons as coach at both LSU, Orgeron said, “It’s tough when you make a mistake, but it’s even tougher not to admit you made a mistake and it’s just not a good fit. I had to do the best what I thought for the LSU program, and that’s why I did it.” Canada came to LSU from Pitt, where his offense ranked tenth nationally in scoring in 2016, and signed a three-year contract that paid him $1.5 million annually.\nPro Bowl running back Le’Veon Bell and the Pittsburgh Steelers failed to reach an agreement on a new contract by yesterday’s deadline. That means he will play under the franchise tag for a second straight year and hit the open market next spring. The 26-year-old Bell is one of the league’s most versatile players and he has long maintained he wants to be paid accordingly. He led the NFL with 321 carries and caught 85 passes last season. Bell will make $14.5 million whenever he signs his franchise tender, which likely won’t be until the end of training camp.\nThe Final Four is headed back to Houston, Phoenix, San Antonio and Indianapolis. The NCAA announced the sites for 2023-2026 and all four cities recently hosted the finale of the NCAA Tournament.\nThe Wayne State volleyball team was awarded the American Volleyball Coaches Association Team Academic Award announced yesterday. The Wildcat volleyball team recorded a cumulative grade-point average of 3.85 during the 2017-18 academic school year to earn the team academic honor. The school is one of 128 schools in NCAA Division II to earn the award and one of 13 schools from the Northern Sun Intercollegiate Conference to receive the honor. Wayne State is the lone program in the NCAA Division II to have received the academic honor for a minimum of 16 consecutive years. The volleyball team finished the 2017 season with a record of 19-12 overall and finished eighth in the NSIC with a 12-8 league mark. The Nebraska, Creighton, & Nebraska-Omaha volleyball teams also received the AVCA Team Academic Award yesterday.\nClass ‘B’ Juniors State Baseball Tournament at Columbus\nWayne routed Columbus Lakeview 16-3\nAshland eliminated the Elkhorn Training Knights 6-4\nColumbus Lakeview clipped Alliance 4-3\nWayne shaded Hickman 4-3\nClass ‘C’ Juniors State Baseball Tournament at Battle Creek\nPender routed Imperial 10-1\nSt. Paul eliminated Battle Creek 8-7\nShelby/Osceola/Stromsburg snuck past Dannebrog/Cairo/Boelus 5-4\nChecking out the local schedule for today, the Class ‘B’ Juniors State Tournament continues at Columbus, Hickman meets Ashland in a 4:00 elimination game and Wayne takes on Columbus Lakeview at 7:00. At the Class ‘C’ Juniors State Tournament at Battle Creek, Pender plays Dannebrog/Cairo/Boelus in a 5:00 elimination game and Shelby/Osceola/Stromsburg faces St. Paul at 8:00.\nLocal Schedule: Norfolk Seniors at Wayne (Bsbl-7:00); Omaha Storm Chasers at Nashville (Bsbl-7:05).\nLocal Scores: Nashville 5 Omaha Storm Chasers 4 (11 Inn.) (Bsbl).\nCBS Sports Radio at 105.9 WJAG-FM & 780 AM Mon-Fri at 6:00 PM; Sat at 4:00; & Sun at 1:00. Also, the home of the Kansas City Royals!", "url": "https://apnews.com/9eb019bd4a724dbab38cb200e2232e6d"}