{"authors": ["Paul Walsh"], "date_download": "2020-05-04 20:09:05", "date_modify": "2020-05-04 20:09:05", "date_publish": "2018-08-06 13:54:14", "description": "An out-of-court settlement has been reached in a lawsuit that alleged Wells Fargo and one of its mortgage bankers in Mankato mistakenly outed the family of a rape victim given refuge in the states...", "filename": "_b0ef822f197c4008be09570d192b6705_1588622945.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b0ef822f197c4008be09570d192b6705_1588622945.html", "title": "Settlement reached in suit alleging Wells Fargo endangered Minnesota family under victim protection", "title_page": "Settlement reached in suit alleging Wells Fargo endangered Minnesota family under victim protection", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "An out-of-court settlement has been reached in a lawsuit that alleged Wells Fargo and one of its mortgage bankers in Mankato mistakenly outed the family of a rape victim given refuge in the states Safe at Home protection program, an attorney for the plaintiffs said Monday.\nAfter a lengthy sit-down meeting with representatives of Wells Fargo and their attorney, we were able to come to a fair and reasonable settlement of the suit, filed in early May, said plaintiffs attorney Randy Knutson.\nTerms of the settlement were not revealed, Knutson added, but I can say that the settlement will allow our clients to move forward and safeguard their location in the future.\nThe attorney added that terms of the settlement also helped ensure that the same thing will not happen to others in the Safe at Home program.\nWells Fargo spokesman John Hobot said Monday that the company would only say that the lawsuit has been settled on terms that are acceptable to both sides.\nWhile the settlement is confidential, the two sides agreed they would be responsible for their own expenses, according to court records.\nThe banks missteps began soon after the mother applied for a mortgage on a new home in November 2016, four months after her daughter was assaulted and while the defendant was out on bail, according to the suit, which was filed in Blue Earth County District Court.\nMail bearing the mothers name from Wells Fargo and from others targeting her as a new homeowner began showing up at what was supposed to be a secret location, the suit alleged.\nDespite the repeated pleas, the identifying mailings never stopped, the young woman said in an interview with the Star Tribune soon after the suit was filed. We got junk mail addressed to us from places all around, and thats when we knew they sold our information. It just made our fear escalate higher and higher.\nThe suit contended that the mail from senders other than the bank was a sign that [the familys] information had been sold by Wells Fargo Home Mortgage to outside vendors.\nThe mother and her daughter enrolled in the Safe at Home program after the alleged perpetrator threatened to kill [them] before they could testify, according to a supplemental court filing.\nKnutson, the familys attorney, said the assailant was sentenced last fall and set free after getting credit for three months of time served.\nThe Safe at Home program began in September 2007 and is open to survivors of domestic violence, sexual assault, stalking and others who fear for their safety, including law enforcement and judicial personnel. Roughly 8,000 people have been in the program since its inception; there are about 2,800 people in it now, according to the Secretary of States Office.\nPaul Walsh 612-673-4482", "url": "https://apnews.com/b0ef822f197c4008be09570d192b6705"}