{"authors": ["Wire Reports"], "date_download": "2020-05-04 20:19:13", "date_modify": "2020-05-04 20:19:13", "date_publish": "2018-03-31 00:52:07", "description": "Stocks sailed to a strong finish on Monday as concerns over a trade war abated. The Dow Jones industrial average climbed 669 points, or 2.8 percent, to close at 24,202 as the markets took a...", "filename": "_8bdb519eb9734676b87870f37841e231_1588623553.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8bdb519eb9734676b87870f37841e231_1588623553.html", "title": "Dow has its best day since 2008 as concerns ease over a trade war with China", "title_page": "Dow has its best day since 2008 as concerns ease over a trade war with China", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dow has its best day since 2008 as concerns ease over a trade war with China\nStocks sailed to a strong finish on Monday as concerns over a trade war abated.\nThe Dow Jones industrial average climbed 669 points, or 2.8 percent, to close at 24,202 as the markets took a deep breath — then exhaled — over concerns that a trade mess would end a global economic boom.\nThe Standard & Poor’s 500-stock index gained 2.7 percent. Even the tech-heavy Nasdaq composite, beleaguered last week over data issues at its go-to winner Facebook, surged 3.3 percent. Across the board, it was the best day in the markets since 2015.\nThe boomerang came after statements by U.S. Treasury Secretary Steven Mnuchin that he was optimistic that the United States and China could avert a trade war.\n“There’s too much at stake,” says Joe Quinlan, chief market strategist at U.S. Trust. “Policy markers understand that the best and fastest way to harm their constituents is to start a trade war and deny voters low-cost goods produced from around the world while tanking global financial markets.”\nPresident Trump last week announced his intention to impose at least $60 billion in tariffs on Chinese imports into the United States. China in turn signaled that it was going to tax some U.S. goods sold in that country. The back-and-forth sent stocks tumbling to one of their worst weeks in years.\n“We’re having very productive conversations with them,” Mnuchin said on Fox News Sunday, referring to China dialogue. “I’m cautiously hopeful we reach an agreement.”\nOther Trump administration spokesmen headed to the airwaves Monday to calm markets tout the administration’s efforts to rework trade deals with China and with the United States’ North American trading partners Mexico and Canada.\nTrump trade czar Peter Navarro appeared on CNBC’s “Squawk Alley” on Monday, where he bolstered U.S. efforts to renegotiate the North American Free Trade Agreement. Just weeks ago, it looked like NAFTA may be dead.\n“It looks like we might get a really good deal on NAFTA,” Navarro said.\nThe president in a Monday tweet hailed the economy as “looking really good. It has been many years that we have seen these kind of numbers.”\nAmong the leaders blue-chip Dow composite in Monday afternoon trading were several technology plays, including Micsrosoft, Intel, Apple and United Technologies. General Electric was the only laggard in the Dow, down around 1 percent.\nU.S. stock markets are coming off their worst week in more than two years.\n“Any actions or signs that things won’t spiral out of control should be seen as a positive for stocks,” said Chris Zaccarelli, chief investment officer at Independent Advisor Alliance. “Cooler heads can prevail and allow the global economic expansion to continue uninterrupted.”\nThe Dow Jones industrial average plummeted in the final hours of a bouncy day Friday and closed down 424 points, 1.77 percent. The Dow shed 1,100 points in the last two trading days of last week.\n“It’s the old ‘sell on the news’ and then regroup,” said Daniel P. Wiener, chief executive officer of Adviser Investments, a Newton, Mass.-based firm that manages more than $5 billion in assets. “We had the weekend to regroup. It remains to be seen how far President Trump will go with these tariffs ... and whether cooler heads are going to help him negotiate and navigate the no-compromise $60 billion comment he made last week. He has already backed off the blanket 25 and 10 percent tariffs on steel and aluminum.”\nDespite Nasdaq’s rebound, Facebook continued to decline Monday as the social media powerhouse, with more than 2 billion monthly users, reeled from a crisis over data misuse. The Federal Trade Commission on Monday announced it is investigating the company following reports that Cambridge Analytica leak of information on 50 million users. Facebook is around 20 percent off its 52-week high.\nThe Dow appeared to be climbing out of correction territory. The 30-member blue-bellwether finished last Friday down more than 10 percent from its Jan. 26 peak. A 10 percent decline from its high earlier this year is considered a correction.\nThe Dow is still on pace for one of its worst-performing months since 2015 as investors grow anxious that Trump’s trade policies and their fallout could upset a robust global economy. U.S. markets fell swiftly earlier this year when he imposed steep tariffs on steel and aluminum imports.\n“Certainly nothing’s settled,” said Rob Haworth, senior investment strategist at U.S. Bank Wealth Management. “Investors are still viewing this as a glass half-full market and a constructive economy, so it’s not surprising to see them buy on value here, buy on dips to try to rebuild their positions.”\nAll 11 sectors of the S&P were in positive territory Monday. Financial services, information technology and consumer staples were leading the way. The big gainers were Lowe’s home repair retail stores, Microsoft and Intel.\n“This is a relief rally in tech shares that may not suffer from strained dealings with China as much as feared last week,” Washington investment manager Michael Farr said. “Tech was hammered hardest last week and is bouncing highest today.”\nThe S&P is down 1.8 percent so far this year, while the Nasdaq Composite is hanging on to positive territory.\nThe U.S. economy is in good shape, helped by the fiscal stimulus in the recent Republican tax cut, the repatriation of tens of billions in corporate profits and a massive budget President Trump signed last week that includes vast increases in military spending.", "url": "https://apnews.com/8bdb519eb9734676b87870f37841e231"}