{"authors": ["Wire Reports"], "date_download": "2020-05-04 20:12:20", "date_modify": "2020-05-04 20:12:20", "date_publish": "2018-03-29 04:44:50", "description": "Pennsylvania ranks second in the nation in the number of excessive pollution discharges sent into waterways by industrial and commercial facilities, according to a report released Tuesday by...", "filename": "_92ee1fdb7ee343dcabf114806674fa5a_1588623140.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_92ee1fdb7ee343dcabf114806674fa5a_1588623140.html", "title": "Report: Pennsylvania ranked second in country for excessive industry discharges into waterways", "title_page": "Report: Pennsylvania ranked second in country for excessive industry discharges into waterways", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pennsylvania ranks second in the nation in the number of excessive pollution discharges sent into waterways by industrial and commercial facilities, according to a report released Tuesday by PennEnvironment.\nThe report looked at data from the Environmental Protection Agency as well as state agencies on discharges by major industrial facilities during a 21-month span in 2016 and 2017.\nTexas was first in the number of discharges exceeding permitted limits, with 938 instances. Pennsylvania followed with 633, based on data supplied to PennEnvironment by the state’s Department of Environmental Protection.\nStatewide, the discharges ranged from ammonia nitrogen, styrene, copper, and aluminum to oil and grease. Such discharges can alter water chemistry and impact aquatic life.\n“Not only did many major industrial facilities exceed their permit limits — sometimes frequently — but some of those exceedances were particularly severe,” the report states, “with facilities releasing multiple times the amount of pollution permitted under their Clean Water Act Permits.”\nThe report identifies 10 Pennsylvania companies responsible for the most water pollution. The EPA’s 1972 Clean Water Act established a permit system for industrial pollution, setting limits for individual facilities.\nEastman Chemical Resins, on the banks of the Monongahela River and upstream from Pittsburgh, is identified as the second worst with 72 exceedances over its federal permit limit in less than two years, WESA reported.\nOf those exceedances, half were 100 percent more than Eastman Chemical’s permit allows. Another 10 instances went over by more than 500 percent, exposing the Mon River to chemicals including zinc, aluminum and nitrate. Eastman Chemical’s national headquarters has not responded to a request for comment.\nThe state’s top violator, according to the report, is SCI Graterford STP, a correctional facility in Montgomery County north of Philadelphia. EPA data suggest that the prison exposed the Wilson River to fecal matter, ammonia and other pollutants 80 times in less than two years.\n“We should not be fearful of going in the water and drinking the water,” Pittsburgh City Councilwoman-Elect Erika Strassburger said. “We should feel safe and comfortable in our rivers. Unfortunately, that’s not the case ... and a lot of that is due to the industrial pollution that flows illegally into our rivers every year.”\nTo derive its data, PennEnvironment pulled records from the National Pollutant Discharge Elimination System, which was authorized under the Clean Water Act. The act prohibits facilities from sending pollutants into a waterway unless it has a permit to do so. The permits contain limits on how much can be discharged, as well as how a site is monitored. So it examined which facilities exceeded those permitted limits and over how many days. It did not include all violations — some of which could have been bureaucratic in nature. In some cases, state level data were more complete, as was the case in Pennsylvania.\nPennEnvironment, a statewide advocacy organization, said enforcement of the Clean Water Act is often weak and getting weaker. It worked with the Frontier Group to compile the report.\n“Decades after the Clean Water Act was signed into law, nearly 20,000 miles of rivers and streams in Pennsylvania are still considered unsafe for fishing and swimming,” said Stephanie Wein, clean water advocate at PennEnvironment. “And instead of ratcheting pollution down to zero, facilities are still dumping chemicals and other pollutants into our waters beyond the legal limits set to protect health and the environment.”\nEPA records show, according to PennEnvironment, that most violators don’t get punished. Most years, tens of thousands of facilities are out of compliance. Less than half faced any EPA or state enforcement action. Those that did received wrist slaps, such as warning letters.\nThe organization said enforcement is further eroding under the Trump administration and EPA Administrator Scott Pruitt, who has been widely criticized by environmentalists as favoring business. In fact, 2017 appeared to be the weakest year for enforcement since 2012. In 2012, more than $115 million in penalties were assessed for clean water violations. Last year, the total was about $24 million.\nThe administration is also attempting to roll back some clean water protections on wetlands and streams, loosen regulations on pollution from coal-fired plants. and discharge limits for steam electric plants, PennEnvironment noted. It was also seeking to repeal the Clean Water Rule, a 2015 provision of the Clean Water Act, and replace it with a more permissive rule.", "url": "https://apnews.com/92ee1fdb7ee343dcabf114806674fa5a"}