{"authors": ["Liz Sawyer"], "date_download": "2020-05-04 20:19:47", "date_modify": "2020-05-04 20:19:47", "date_publish": "2018-03-29 20:00:40", "description": "Before the beds were stripped bare and the locks were changed, Jean and Larry Zamor stood at the front desk saying goodbye as guests checked out of the Chanhassen Inn for the very last...", "filename": "_f858a38f2412413d80e52bd026fe6fea_1588623587.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f858a38f2412413d80e52bd026fe6fea_1588623587.html", "title": "It's lights out at the Chanhassen Inn, which grew up along with the suburb", "title_page": "It's lights out at the Chanhassen Inn, which grew up along with the suburb", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s lights out at the Chanhassen Inn, which grew up along with the suburb\nBefore the beds were stripped bare and the locks were changed, Jean and Larry Zamor stood at the front desk saying goodbye as guests checked out of the Chanhassen Inn for the very last time.\nThe Zamors, brother and sister and longtime business partners, held back tears as they shared hugs and handshakes with their loyal guests shuffling, luggage in hand, out the door.\nWell miss you guys, they told the Zamors over and over. Some kept their room keys as a memento.\nThis is their home away from home, Jean Zamor said with a sigh. It feels like a death.\nNext month a wrecking ball will rip down the quaint two-story motel that Jean, 71, and Larry, 65, built with their father 36 years ago, a place where they welcomed celebrities, international travelers and Chanhassen Dinner Theatre patrons. The Zamors are retiring, and a Panera Bread cafe soon will replace the inn just off Hwy. 5, 2 miles east of Princes Paisley Park estate.\nChanhassen residents, and frequent guests there, say the family-owned motel will be dearly missed.\nThis is one of the last jewels of Chanhassen, said Susan McAllister, who booked an extended-stay room this week while moving into a new apartment. Youre a person to them, not just money.\nThe modest 74-unit inn became a community staple over the past four decades, known for its quirky sleep-related signs such as Snuggle Up with Us. It offered few frills there was no pool, business lounge or fancy industrial kitchen just clean rooms for affordable rates ($86 per night) and the friendliest staff in town.\nThe Zamors, of Tonka Bay, say their clientele never seemed to mind the lack of amenities. Stars like Bill Murray, Mel Tillis and Sheila E. sought refuge there to avoid paparazzi on jaunts to Minnesota, and regular guests developed friendships with the small staff.\nI wont stay anywhere else, said Prem Sodi of Toronto.\nJean and Larrys father, Lawrence Zamor, had an eye for real estate. So in 1979 he bought some farmland a block from the booming dinner theater complex. Chanhassen, a growing community, had no lodging and he thought it could use some.\nGuests from afar\nThe siblings had spent several years running a Mr. Donut in Robbinsdale and were ready to sell. Though she had no hospitality experience, Jean was happy that her father tapped her to operate the inn. Larry joined a year later, assuming the roles of handyman and co-owner.\nThe Zamors catered to corporate travelers and visiting grandparents, offering initial rates of $26.50 a night. By the mid-1980s, business was booming and they expanded three times to accommodate more guests.\nWhen the Eckankar religious organization moved to Chanhassen in 1986, the inn was among the first to open its doors to its diverse followers. Some residents who didnt understand the New Age religion balked, but not the Zamors.\nThey welcomed us with open arms, thats why were so loyal, said Greta Man of Sarasota, Fla. Two hotels are closer to the Eckankar temple, but for the past 26 years Man has chosen to stay at the inn during Eckankars annual seminar.\nThe homey lobby has remained a gathering place for strangers to sit and sip coffee together. On Thursday, fellow Eckists from Switzerland, Nigeria and Germany gathered for the inns last continental breakfast. Its an honor to be here on their last day, said Barbara Hoefert of Cologne, Germany.\nAnother Chanhassen neighbor also drew visitors, in death as well as life. Prince rented blocks of rooms at the inn for his bandmates during the filming of Purple Rain in 1983 and 1984. Since his death in 2016, devotees have flocked to town on pilgrimages to Paisley Park and stayed at the inn. One woman flew in from Japan for just one day to pay her respects, staffers said.\nPeople are heartsick\nAll the while, Jean and Larry Zamor put off their succession plan. Neither has children, so there was no obvious heir. There was really no one to pass it down to, Larry said.\nPanera representatives approached them in November 2016 about buying the property. The parties agreed to a 15-year land lease that enabled the Zamors to retain property rights and allowed Panera to build there. The news came as a surprise to the inns seven employees.\nThats what scares me the most. I wont be destitute, but its tough, said Leona Woodworth, a longtime front desk employee. This has been my home for 23 years.\nChanhassen Mayor Denny Laufenburger said he was sad to see the inn go, but that Panera would bring 40 new jobs for young people to the area and that the local market was growing enough to attract more lodging in its place. Area attractions such as the Minnesota Arboretum, the dinner theaters and Paisley Park draw an estimated 1 million visitors a year, he said.\nOn Thursday, the inns last day, well-wishers dropped off flowers and guests passed around cards to sign. A housekeeper gave chocolates to the Zamors.\nBy the time the clock struck noon, all 28 guests had checked out and it was time to move on.\nIts over, said Jean, posing with Larry behind the front desk as staffers snapped photos with their cellphones. She plans to save her favorite purple Prince print from the lobby and donate furnishings before the building comes down, sometime in late April.\nPeople are heartsick, said front desk clerk Shirley Warren, 85. This is their life. Its going to be hard for them to get up in the morning and not drive straight to the hotel.\nLiz Sawyer 612-673-4648", "url": "https://apnews.com/f858a38f2412413d80e52bd026fe6fea"}