{"authors": [], "date_download": "2020-05-04 20:06:42", "date_modify": "2020-05-04 20:06:42", "date_publish": "2018-04-03 18:51:40", "description": "As a veteran school-crisis responder, I vividly recall the victims: a murdered faculty member, the dead kindergartener, three witnesses to a classmate's suicide, and the preschoolers missing their...", "filename": "_0a887f62825743cd9508fef03aadb358_1588622802.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0a887f62825743cd9508fef03aadb358_1588622802.html", "title": "Sounding off: Brave school staffers deserve thanks", "title_page": "Sounding off: Brave school staffers deserve thanks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As a veteran school-crisis responder, I vividly recall the victims: a murdered faculty member, the dead kindergartener, three witnesses to a classmate’s suicide, and the preschoolers missing their teen babysitters— dead aboard TWA 800. In every school nightmare, I received solace, strength and inspiration from the school staff.\nFor example, on 9/11, school employees calmly remained at work while the world panicked. They stayed to safeguard our children, while worrying about their own. Indeed, around the globe, teachers assemble makeshift schools in war zones, reassure their terrified pupils in post-disaster shelters, and return to work after wildfires and hurricanes. Yet we take their presence for granted.\nWe tend to overlook the apprehensive school employees who awoke the morning after the Parkland school massacre and dutifully returned to work here and across the nation. Despite being barraged by emails, phone calls and social media posts criticizing their school’s actions, inactions or latest communications, they still show up.\nToday, you can act to make schools safer: Thank the people who work in your local schools — before the well-documented psychological toll leads even more educators to leave the profession. After all, you want them to show up again tomorrow.\nMary Margaret Kerr, Whitehall\nThe writer is a professor of administrative and policy studies, psychology in education, and psychiatry at the University of Pittsburgh.\nThursday, March 29\nHempfield needs police\nLocal school threats have increased at an alarming rate. Hempfield, one of the largest townships in Pennsylvania, does not have a local police force and depends on state police. My concern is response time. This is a safety issue that puts children at risk for any police emergency.\nI keep hearing that Hempfield residents are satisfied with state police coverage. State Sen. Kim Ward and Hempfield officials know they are freeloading off other Pennsylvanians. It’s time for an annual fee or a local police force for Hempfield.\nMy Penn Township taxes pay for a well-trained police force, which reduces response time.\nGeorge Macesic, Penn Township, Westmoreland County\nThe writer’s great-grandchildren attend Hempfield Area School District schools.\nSunday, March 25\nWhy high gas prices?\nLast year, when Hurricane Harvey hit the Gulf of Mexico, we were told that all the oil platforms would have to shut down until the hurricane passed. We were also told that since these platforms supplied 20 percent of our country’s oil, gasoline prices would go up. Several days later, our gasoline prices went up around 30 cents a gallon. Before the year ended, our gasoline prices went up another 25 cents a gallon. My question is: Aren’t the oil platforms now operating at 100 percent? If so, why have our gas prices not gone down by the 30-cent-per-gallon increase? My sister lives just outside Columbus, Ohio, and she filled up the other day for $2.04 a gallon.\nLou Gregovits, North Huntingdon\nMonday, March 26\nSeniors get short shrift\nRegarding Virginia Oplinger’s letter “Spend, spend, spend”: She couldn’t have said it any better. Me, too. My so-called raise in Social Security all went to Medicare, with my health-care coverage falling just $1.50 short of doubling. I was better off without the $20 raise, as always.\nI would like to see any politician live off what we do. People who put into the system all their lives maybe would be better off getting out what they put in. It really can’t be any worse.\nI’m surprised that not many people are responding to this subject like Oplinger did.\nMichael Arnone, Springdale\nTuesday, March 27\nLet’s look at bullying\nThe knee-jerk reaction to the tragic, unfortunate and life-changing school shootings in Florida and other places around the country would be to arm teachers and administrators. This may be a viable short-term solution. A long-term solution would be to hold administrators, teachers and parents of students who engage in bullying, which is ignored by school officials, accountable for their inexcusable actions. This atmosphere plays a role in many of these tragedies.\nThis would not eliminate all attacks, given the influx of foreign terrorism. But as far as violence by citizens against citizens, bullying — via social media or physical assaults — must be recognized and stopped.\nCloser to home, we have a young man from the Franklin Regional School District who, because of the wisdom of the court system, was processed as an adult for his crimes and, accordingly, will spend the majority, if not all, of his life in a state correctional institution. Should not the students who pushed this young man over the edge also be held accountable as adults? No, they were just innocent kids — many of whom are now in college, preparing to live happy lives. Just who was the victim here?\nHenry Miller III, Ross\nWednesday, March 28\nLamb vs. Pelosi\nAccording to George F. Will, Conor Lamb separated himself from Nancy Pelosi’s liberal agenda by saying that he will not vote for Pelosi as speaker (“18th Congressional District race could set template for Democrats”). For whom will he vote? Paul Ryan? Will he vote for Pelosi’s pro-gun, pro-life, pro-defense conservative Democrat opponent? If she is elected, will he not support his own party’s speaker?\nLamb does have one qualification that both Will and Hollywood think recommends him for office: He’s 6-foot-3. This is a qualification that does not apply when the candidate is Donald Trump.\nRichard Rupp, Aspinwall\nFriday, March 30\nResurrection? Case closed\nThe case for Jesus Christ’s resurrection is based on facts, such as the empty tomb. Jesus was seen alive after his death. His disciples were witnesses to his saving power and glory, proving he was God in the flesh. He fulfilled all the prophecies regarding the savior of mankind. We even determine our dates in history by B.C. and A.D.\nThe tombs of other religious leaders, including Muhammad, Buddha, Krishna and Confucius, are still occupied. Only Jesus’ tomb is empty. He is alive forever.\nThere are two types of religion: man-centered, based on man’s ability and works to save himself; and God-centered, depending on Jesus’ death and resurrection to save us. We are saved by grace, Scripture and the glory of God.\nWhen we understand that Jesus was God in the flesh, we understand the importance of his death and resurrection. Be careful what you call Jesus. Your eternal life depends on it.\nIn the early 1800s, Harvard professor Simon Greenleaf found the evidence for Christianity and the resurrection so compelling, he became a Christian. Upon weighing the evidence, I say, “Case closed.” Ask Jesus to be your personal God and savior.\nMaris Sanner, Arnold\nSaturday, March 31", "url": "https://apnews.com/0a887f62825743cd9508fef03aadb358"}