{"authors": ["Lisa Zapalac"], "date_download": "2020-05-04 20:06:23", "date_modify": "2020-05-04 20:06:23", "date_publish": "2018-01-19 15:27:10", "description": "Located directly across from Rice University and fronting 130 feet of Houston's famed oak-arch strip, this European-style home is on a double lot (16,333 square feet) at 2147 University...", "filename": "_87c7311caa6e43d8979cfb5e9df5232b_1588622783.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_87c7311caa6e43d8979cfb5e9df5232b_1588622783.html", "title": "Prime property: European-style home is directly across from Rice University", "title_page": "Prime property: European-style home is directly across from Rice University", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Prime property: European-style home is directly across from Rice University\nLocated directly across from Rice University and fronting 130 feet of Houston’s famed oak-arch strip, this European-style home is on a double lot (16,333 square feet) at 2147 University Blvd.\nListing agent Lance Rosmarin of John Daugherty, Realtors describes the three-story home as rare and exquisite, with balconies and views.\nAn arched door opens to the home’s entry with a stone tile floor and classic architectural finishes, flanked by the large front formal areas.\nThe formal living room or den has a view of the boulevard and running trail, and the formal dining room has an adjoining climate-controlled wine room with storage for up to 1,000 bottles.\nOpen to the great room or family room, the massive kitchen has a large center island; a spacious butler’s pantry that leads into the dining room; a breakfast area with windows and views of the yard; and Wolf appliances including a six-burner range and grill, a double oven, microwave, a Sub-Zero and a pot filler.\nThe second-floor master suite includes a large bedroom with built-ins and a large private balcony overlook, a luxury bath with dual water closets, and a room-size closet with built-ins, storage and a dressing area.\nA laundry room with abundant counter space, storage and a sink is right off the master closet.\nAn en-suite secondary bedroom is also on the second floor and has access to a balcony that has views of the university.\nThere is also a study or optional bedroom with a built-in desk and computer area and access the home’s incredible terrace.\nThe second-floor terrace is a 506-square-foot outdoor living/entertaining area with unobstructed views of the Texas Medical Center, Rice University and the downtown skyline.\nThe home’s third floor includes a media room with built-ins and a kitchenette area with a sink and microwave; and a veranda that is located just off the media room.\nCompleting the third floor are three additional bedrooms.\nOutside, an veranda overlooks the backyard and offers access to the side yard featuring a pool and green space.\nWith five or six bedrooms and 5½ baths, this Inner-Loop home is priced at $4,388,000.\nFor additional information, visit online at www.JohnDaugherty.com.\nProperty Profile\nLocation: 2147 University Blvd.\nLot size: 16,133 square feet (130 x 124)\nListing agent: Lance Rosmarin\nListing agency: John Daugherty, Realtors\nStories: 3\nLiving space: 5,481 square feet\nBedrooms: 5 or 6\nBaths: 5 full, 1 half\nPrice: $4,388,000", "url": "https://apnews.com/87c7311caa6e43d8979cfb5e9df5232b"}