{"authors": ["Walter Williams"], "date_download": "2020-05-04 20:24:35", "date_modify": "2020-05-04 20:24:35", "date_publish": "2018-11-21 09:35:34", "description": "Much of today's incivility and contempt for personal liberty has its roots on college campuses, and most of the uncivil and contemptuous are people with college backgrounds. Let's look at a few...", "filename": "_904a3d69661d4cb19903510315b6e861_1588623875.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_904a3d69661d4cb19903510315b6e861_1588623875.html", "title": "We're seeing the fruits of college indoctrination", "title_page": "We're seeing the fruits of college indoctrination", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Much of today’s incivility and contempt for personal liberty has its roots on college campuses, and most of the uncivil and contemptuous are people with college backgrounds. Let’s look at a few highly publicized recent examples of incivility and attacks on free speech.\nSenate Majority Leader Mitch McConnell and his wife, Transportation Secretary Elaine Chao, were accosted and harassed by a deranged left-wing mob as they were leaving a dinner at Georgetown University. Sen. McConnell was harassed by protesters at Reagan National Airport, as well as at several venues in Kentucky. Sen. Ted Cruz and his wife were harassed at a Washington, D.C., restaurant. Afterward, a group called Smash Racism DC wrote: “No — you can’t eat in peace — your politics are an attack on all of us. You’re (sic) votes are a death wish. Your votes are hate crimes.” Other members of Congress — such as Andy Harris, Susan Collins and Rand Paul — have been physically attacked or harassed by leftists. Most recent is the case of Fox News political commentator Tucker Carlson. A leftist group showed up at his house at night, damaging his front door and chanting, “Tucker Carlson, we will fight! We know where you sleep at night!” “Racist scumbag, leave town!”\nMayhem against people with different points of view is excused as just desserts for what is seen as hate speech. Enterprise Institute scholar Charles Murray discovered this when he was shouted down at Middlebury College and the professor escorting him was sent to the hospital with injuries. Students at the University of California-Berkeley shut down a controversial speaker and caused riot damage estimated at $100,000. Protesters at both UCLA and Claremont McKenna College disrupted scheduled lectures by Manhattan Institute scholar Heather Mac Donald.\nThe Foundation for Individual Rights in Education has discovered so-called bias response teams on hundreds of American college campuses. Bias response teams report to campus officials — and sometimes to law enforcement officers — speech that may cause “alarm, anger, or fear” or that might otherwise offend. Drawing pictures or cartoons that belittle people because of their beliefs or political affiliation can be reported as hate speech. Universities expressly set their sights on prohibiting constitutionally protected speech. As FIRE reported in 2017, hundreds of universities nationwide now maintain Orwellian systems that ask students to report — often anonymously — their neighbors, friends and professors for any instances of supposed biased speech and expression.\nA recent Brookings Institution poll found that nearly half of college students believe that hate speech is not protected by the First Amendment. That’s nonsense; it is. Fifty-one percent of college students think they have a right to shout down a speaker with whom they disagree. Nineteen percent of students think that it’s acceptable to use violence to prevent a speaker from speaking. Over 50 percent agree that colleges should prohibit speech and viewpoints that might offend certain people. One shouldn’t be surprised at all if these visions are taught and held by many of their professors. Colleges once taught and promoted an understanding of Western culture. Today many professors and the college bureaucracy teach students that they’re victims of Western culture and values.\nBenjamin Franklin wrote, “Whoever would overthrow the Liberty of a Nation, must begin by subduing the Freeness of Speech.” Much later, Supreme Court Justice Potter Stewart said, “Censorship reflects a society’s lack of confidence in itself. It is a hallmark of an authoritarian regime.” From the Nazis to Stalinists to Maoists, tyrants have always started out supporting free speech, just as American leftists did during the 1960s. Their support for free speech is easy to understand. Speech is vital for the realization of their goals of command, control and confiscation. The right to say what they please is their tool for indoctrination, propagandizing and proselytization. Once the leftists gain control, as they have at many universities, free speech becomes a liability and must be suppressed. This is increasingly the case on university campuses. Much of the off-campus incivility we see today is the fruit of what a college education has done to our youth.\nWalter Williams is a syndicated columnist. To learn more about him, go to the website at www.creators.com.", "url": "https://apnews.com/904a3d69661d4cb19903510315b6e861"}