{"authors": ["Patty Welsh"], "date_download": "2020-05-04 20:05:52", "date_modify": "2020-05-04 20:05:52", "date_publish": "2018-03-22 21:43:28", "description": "NEWTON, Mass. — Addressing the New Horizons conference here Feb. 28, the Air Force Materiel Command director for Small Business Programs spoke about the importance of small business for the...", "filename": "_6f21ee2d99a44bc9b75cc712eb5911b1_1588622752.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6f21ee2d99a44bc9b75cc712eb5911b1_1588622752.html", "title": "Small businesses help DOD solve big challenges", "title_page": "Small businesses help DOD solve big challenges", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEWTON, Mass. — Addressing the New Horizons conference here Feb. 28, the Air Force Materiel Command director for Small Business Programs spoke about the importance of small business for the defense community and the changes and trends she’s been seeing.\n“Small businesses are the underpinning of our nation,” said Farris Welsh. “Every large business started as a small business, often from garages and kitchen tables. They are important to our national security, partnering with government to provide solutions to our nation’s most challenging problems. The Defense Department couldn’t operate without them.”\nShe highlighted some of the benefits of contracting with small businesses, such as innovation and agility. Rates are normally cheaper, with lower overheard and less bureaucracy. They are usually more mobile and virtual. Currently, many are operating in the cyber and information technology realms, often outpacing larger organizations.\nWelsh emphasized there are small businesses working in every Air Force portfolio area, but that the government needs to do the market research and find out which are the non-traditional, non-typical businesses operating in those areas.\n“This is a wonderful time to be in the small business world,” she said. “There is so much happening in the arena now because people are starting to think about who is best suited to do the job, and what is the best implementation strategy.”\nProgram personnel are looking at requirements first, and seeing if perhaps a small, non-traditional business might be able to provide a solution. They are also looking at innovative contracting instruments, such as Other Transaction Authority, or OTA, Small Business Innovative Research, or SBIR, and Rapid Innovation Fund vehicles.\n“These type of vehicles are phenomenal,” Welsh said, adding that an OTA can be done via a consortium or a competition.\nWhile talking about the SBIR 3, which is used to transition a technology that was researched, developed, prototyped – whether an item or service – to a particular weapon or business system, she mentioned some specific examples from Hanscom Air Force Base, Massachusetts, including one for radome communications and one for work on an integrated air defense system. She said Hanscom has “taken the bull by the horns,” on SBIRs, adding that there are at least four to five active SBIRs on the base at any time.\nOverall, she said Hanscom as a whole is doing very well on its small business goals, exceeding them in 2017.\n“Your PEOs [Program Executive Officers] are very small-business friendly and looking for those solutions, thinking about what can small businesses do.”\nWelsh also highlighted AFMC’s overall work with small business, saying that the Command has the largest proportion of the fiscal year 2017 Air Force small business contract obligations at 56 percent, which equates to more than $6 billion going to small businesses.\nSome of the trends she sees are a continuing increase in dollars for small business, an increase in the use of innovative contracting vehicles, and multiple award contacts. She also expects an increase in the length of contracts, and the use of “pools” or reserves in contracts where something below a certain amount is held for a small business and/or a socioeconomic category.\n“People are looking for what makes sense for what they’re trying to buy,” she said.\nWelsh herself met with more than 700 small businesses, in both plenary and one-on-one sessions last year.\n“We need to develop and sustain an industrial base; we want it to keep growing, keep bringing on small businesses. Twenty years from now we may be looking for something that we don’t even know about now but a small business may already be doing it.”", "url": "https://apnews.com/6f21ee2d99a44bc9b75cc712eb5911b1"}