{"authors": [], "date_download": "2020-05-04 20:10:18", "date_modify": "2020-05-04 20:10:18", "date_publish": "2018-01-26 04:49:08", "description": "East Lansing — Just hours after Larry Nassar was sentenced to up to 175 years in prison for sexually assaulting hundreds of women — some of them Michigan State student-athletes — university...", "filename": "_75f504c90fed4c5897642b9d940e3710_1588623018.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_75f504c90fed4c5897642b9d940e3710_1588623018.html", "title": "Michigan State AD Hollis in the path of scrutiny", "title_page": "Michigan State AD Hollis in the path of scrutiny", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "East Lansing — Just hours after Larry Nassar was sentenced to up to 175 years in prison for sexually assaulting hundreds of women — some of them Michigan State student-athletes — university president Lou Anna K. Simon announced she was resigning.\nIt’s one of the largest sexual assault scandals in history, surpassing even that of Penn State, where an assistant football coach was convicted in 2012 of assaulting more than 30 young boys. Where the fallout ends for Michigan State remains to be seen.\n“The Penn State crisis — and this has a good deal of similarities — was the biggest sports story in 2012,” said Gerald Gurney, an assistant professor of Adult and Higher Education at the University of Oklahoma. “This is a behemoth. This is the mother of all sexual assault scandals. There is nothing like this. It astounds me that anyone in a position of athletic administration at Michigan State that would have anything whatsoever to do with working with the athletes, it would astound me if they felt secure.”\nThe head of athletics, of course, is Mark Hollis. And while a Detroit News investigation showed at least 14 people associated with Michigan State had knowledge of complaints against Nassar before initial media reports surfaced in 2016, Hollis was not among them.\nThat might not matter, experts say.\n“I just am kind of wondering if we’re even close to finding out everything and who knew what and I do think that is gonna be problematic for Mark,” said B. David Ridpath, Associate Professor of Sports Administration at Ohio University. “I didn’t like Lou Anna Simon’s resignation letter but there’s part of it that rings a little bit true, when you’re in charge you’re in charge. And if these things happen you have to ask why they happened. You have to wonder where was Mark Hollis in all this, (MSU senior women’s administrator) Shelley Appelbaum and others there. Who knew what and when? And if they didn’t know, then that’s even a larger question.\n“They are definitely not off the hook here. I think Mark Hollis, his role needs to be heavily scrutinized.”\nFollowing Simon’s resignation city officials and lawmakers have called for the resignations of MSU board members. Erik Altmann, the mayor pro tem of East Lansing and an MSU psychology professor, went further, saying he thinks “our celebrity coaches and our athletic director need to resign, too,” referencing Hollis, men’s basketball coach Tom Izzo and women’s basketball coach Suzy Merchant.\nThe investigations will likely begin soon. MSU trustees have asked Michigan Attorney General Bill Schuette to begin looking into the case, and on Thursday, two Michigan House leaders demanded that MSU officials hand over reports from 2014-16 related to the sexual assault allegations against Nassar and are willing to use subpoena power to get them.\nThe NCAA is also involved, sending a letter of inquiry on Tuesday notifying MSU it was beginning its own investigation into the athletic department.\nWhat the NCAA can do is unclear, but pressure the investigations can put on Michigan State could force more people to step down.\n“I don’t know where it’s gonna go with the NCAA, but I think as more and more comes out, Mark is gonna look worse and worse,” Ridpath said. “And who knows? It might be behind the scenes where people at the NCAA say, ‘Look, we got to do something and you’re gonna have to fall on your sword.’ That might be it. But I don’t think it looks good for him.”\nHollis hasn’t commented on the case, only releasing a statement this week in response to the NCAA’s letter of inquiry.\n“Since my first day on the job as athletic director, my focus has always been on the student-athlete,” Hollis said, adding MSU would cooperate with the NCAA investigation. “They are at the core of our athletic department mission statement. Our first priority has always been and will always be their health and safety.”\nHollis has been Michigan State’s athletic director since 2008 and is well-respected around college athletics. He was named Athletic Director of the Year in 2012 by SportsBusiness Journal/Daily, has had 13 consecutive semesters of student-athletes posting a cumulative grade-point average better than a 3.0, and been a part of several NCAA committees while MSU’s sports teams have won 30 Big Ten championships during his tenure.\nBut there have been many problems, as well. In February 2017, Hollis suspended gymnastics coach Kathie Klages, who has been accused by at least two Nassar victims of discouraging her from reporting Nassar. Klages retired a day after being suspended.\nIn December 2009, two football players were dismissed from the program and eight were suspended after a fight at an MSU residence hall. The football program again had off-field issues in 2017 as four players were dismissed after being charged with sexual assault.\nAfter those players were dismissed in June 2017, Hollis was emotional and talked about making Michigan State a safe environment.\n“This is my home,” Hollis said. “It is where my wife and I attended school, where one son and my daughter have earned their degree and where my other son will enroll this fall. I expect my home to be safe, safe to all who live here and safe to all who visit. Like any home its safety requires shared responsibility and accountability. As athletic director I am responsible to make tomorrow better than today.”\nWhether that applied in the Nassar case should come out in the investigations, said Gurney, who also served as senior associate athletics director at the University of Oklahoma from 1993-2011.\n“What will be determined is if these administrators were simply more interested in protecting their brand or protecting the student-athletes and what, in fact, was done,” Gurney said. “Obviously, not enough was done. And it seems terribly suspicious that the administration was primarily interested in protecting their brand.\n“The one thing I’m certain of, there are people in that administration that knew enough of what was happening to have stepped up and put an end to it and expose it.”\nIf that is true, both experts agree there should be change at Michigan State.\n“I think what Michigan State, like many athletic departments need, is maybe a real house cleaning,” Ridpath said. “It’s pretty insular there. Not as insular as Penn State, but it wouldn’t hurt to bring in some new blood.”\nmcharboneau@detroitnews.com\ntwitter.com/mattcharboneau", "url": "https://apnews.com/75f504c90fed4c5897642b9d940e3710"}