{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:23:12", "date_modify": "2020-05-04 20:23:12", "date_publish": "2018-12-31 05:01:00", "description": "This year, as she celebrated her 100th birthday, the honors kept coming for Katherine Johnson. West Virginia State University unveiled a statue of her at its campus in Institute. President...", "filename": "_75d9cb89bfc24702b1981497c34ddd3f_1588623792.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_75d9cb89bfc24702b1981497c34ddd3f_1588623792.html", "title": "Jim Ross: WV has its share of exceptional people", "title_page": "Jim Ross: WV has its share of exceptional people", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This year, as she celebrated her 100th birthday, the honors kept coming for Katherine Johnson.\nWest Virginia State University unveiled a statue of her at its campus in Institute. President Donald Trump recently signed a bill enacted by Congress renaming a NASA facility in Fairmont as the Katherine Johnson Independent Verification and Validation Facility.\nThese came a few years after the book and movie “Hidden Figures” brought the contributions of Johnson and other African American women to light.\nJohnson’s story is one that needs retelling every now and then to remind us of the talent in our midst - talent that too often can be hidden or extinguished.\nJohnson is best known as one of the human computers used by NASA in the early years of its space program. Launching a space capsule from Earth, predicting its trajectory and getting it back to a specific location takes a lot of mathematical computations.\nLaunching one from Earth and sending it to the moon and back takes even more, made that much harder by the fact both bodies move in complicated ways.\nAccording to Popular Mechanics magazine, women trained in mathematics have a long history of contributions to science, even if it’s not that well known.\n“In the late 19th century, the Harvard College Observatory employed a group of women who collected, studied and cataloged thousands of images of stars on glass plates. As chronicled in Dava Sobel’s book ‘The Glass Universe,’ these women were every bit as capable as men despite toiling under less-than-favorable conditions. Williamina Fleming, for instance, classified over 10,000 stars using a scheme she created and was the first to recognize the existence of white dwarfs. While working six-day weeks at a job demanding ‘a large capacity for tedium,’ they were still expected to uphold societal norms of being a good wife and mother,” one article said.\nThat’s the environment that Johnson entered.\nJohnson was born in White Sulphur Springs. Her mother was a teacher and her father worked at The Greenbrier. As Greenbrier County had no high school for African Americans, her father relocated the family to Institute when she was 10 so she could attend the high school that was part of West Virginia State’s campus.\nWhen she graduated from high school at age 15, she enrolled at WVSU, which was then West Virginia State College, and graduated summa cum laude at age 18 with degrees in mathematics and French.\nIn 1938, Johnson became the first African American woman to desegregate the graduate school at West Virginia University in Morgantown.\nIn 1953, after several years as a teacher and later as a stay-at-home mother, she went to work for the National Advisory Committee for Aeronautics as a human computer.\nNACA had desegregated its human computer department during World War II and kept its minority employees after the war.\nWhen NACA became NASA, the job of human computers shifted to the space program. Johnson calculated the trajectory for Alan Shepard, the first American in space, when he made his suborbital flight.\nBefore John Glenn made his historic flight, he wanted Johnson to double check the flight calculations that had been made by the electronic computers that were beginning to take over the work of the human computers.\nJohnson worked on the space program through the Mercury, Gemini and Apollo missions. She left NASA in 1986 during the shuttle era.\nJohnson’s story was unknown to most of us until “Hidden Figures.”\nPerhaps the greatest honor she has received came in 2015, when President Barack Obama awarded her the Presidential Medal of Freedom, the nation’s highest civilian honor.\nSadly, there are too many among us who are threatened by talent in their midst. They will never accomplish great things, so they try to prevent others from doing so.\nOne prominent Huntington businessman describes it as the crab principle. If you put crabs in a bucket, they will try to climb out. But as one climbs and nears the top, another reaches up and pulls it down.\nBut sometimes the exceptional among us get out of that bucket. Chuck Yeager did. Katherine Johnson did. Who knows how many others are out who don’t yet know there is life beyond the bucket.\nJim Ross is opinion page editor of The Herald-Dispatch. He can be contacted at jross@statejournal.com.", "url": "https://apnews.com/75d9cb89bfc24702b1981497c34ddd3f"}