{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:10:04", "date_modify": "2020-05-04 20:10:04", "date_publish": "2018-08-30 10:37:37", "description": "By Scott Shurtleff sshurtleff@nashobavalleyvoice.com Tammie Reynolds will have a personal story about the Holocaust to tell her students at Groton-Dunstable Regional High School this...", "filename": "_022a0293ce0242f98381aaee5ed0b60c_1588623004.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_022a0293ce0242f98381aaee5ed0b60c_1588623004.html", "title": "Teacher Raises Holocaust Awareness in Classroom", "title_page": "Teacher Raises Holocaust Awareness in Classroom", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Scott Shurtleff\nsshurtleff@nashobavalleyvoice.com\nTammie Reynolds will have a personal story about the Holocaust to tell her students at Groton-Dunstable Regional High School this fall.\nThanks to her extensive interest in and knowledge of that tragic period of history, Reynolds was chosen to travel to Poland and visit the concentration camps where millions of people died.\nHer involvement in Echoes and Reflections, a national organization that encourages teaching about the Holocaust, allowed her to learn first-hand about the many horrors and rare triumphs. The Lunenburg resident was one of 20 educators selected for this year’s trip out of hundreds of applications submitted.\nShe visited the last intact camp at Auschwitz-Birkenau and several demolished and erased sites.\n“I felt like it was necessary for my personal and professional life,” she said.\nShe said the trip will also make her a better teacher of genocides, a specialty that earned her a role as an adjunct professor at Fitchburg State University.\nReynolds, who attended schools in the district from first grade, also was a participant at the Belfer Conference for History Teachers at the United States Holocaust Museum in Washington, D.C.\n“Today’s teenagers are a little more forgiving and tolerant of others than when I was a kid,” she said. “It reaffirms my hope in them and reinvigorates my commitment to get them to ask hard questions,” she said.\nSept. 1 marks the 79th anniversary of the start of World War II, when Germany invaded Poland and began rounding up Jews, Gypsies, homosexuals and others, transporting them to any one of the 900 camps that would crop up around Europe.\nThe seven-day excursion had Reynolds, 53, and her peers offering remembrance to forgotten people.\n“The places that weren’t there any more struck me more solemnly,” she said. “Because you could feel the presence of those who died there even without the visual reminder.”\nReynolds hopes those deep impressions will empower her with a greater ability to reach her students.\n“At Auschwitz, which stands as a maintained museum to the madness of that epoch, is still intact and exactly as the Nazis left it when they retreated from the scene.\nAt Fitchburg State she teaches “Learning From Injustice.” The course and her syllabus at Groton-Dunstable reflect a personal philosophy.\n“Studying the Holocaust is relevant. High school students who care quite often become adults and leaders who care,” she said.\nEchoes and Reflections is sponsored by the Anti-Defamation League to help teachers teach the holocaust. And both social injustice and genocide are interwined in that, “they involve human stories,” she said.", "url": "https://apnews.com/022a0293ce0242f98381aaee5ed0b60c"}