{"authors": ["Lomi Kriel"], "date_download": "2020-05-04 20:04:20", "date_modify": "2020-05-04 20:04:20", "date_publish": "2018-11-09 06:00:00", "description": "President Donald Trump on Friday invoked national security powers to prevent migrants crossing the border illegally from applying for asylum, though advocates immediately challenged it in a...", "filename": "_2969ae9e1e45442fa6ac640622e0af22_1588622660.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2969ae9e1e45442fa6ac640622e0af22_1588622660.html", "title": "Lawsuit seeks to block Trump from denying asylum to migrants crossing the border illegally", "title_page": "Lawsuit seeks to block Trump from denying asylum to migrants crossing the border illegally", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Donald Trump on Friday invoked national security powers to prevent migrants crossing the border illegally from applying for asylum, though advocates immediately challenged it in a federal court in San Francisco.\nTrump in his decree said migrants should seek asylum at ports of entry and that he would commit additional resources to such official crossing points in anticipation of a large influx.\nIf a judge does not intervene, the measure would take effect Saturday.\nIt is certain to cause chaos at over-burdened ports of entry along the southern border. Dozens were already camped this week on or near international bridges from Brownsville to El Paso as they waited to apply for asylum and, at the San Diego port of entry, migrants are waiting up to five weeks to be processed. The Rio Grande Valley, where more than 11,500 families were apprehended for crossing illegally last month, is expected to in particular feel the crush.\nThe president, who has railed for weeks about a caravan of mostly Central American migrants walking through Mexico to reach the United States, issued the proclamation based on the same emergency authority to control the country’s borders that he cited last year when banning travel from several Muslim nations. Federal judges quickly halted the measure, though the Supreme Court allowed the administration to implement a limited version after an 18-month legal fight.\nLegal experts predict a similar battle over the president’s attempt to restrict asylum. U.S. immigration law for decades has explicitly allowed those who fear persecution to ask for protection whether or not they enter the country illegally. The American Civil Liberties Union and other groups argued in seeking the injunction that the administration violated that asylum statute, as well as federal law governing how agencies are allowed to change regulations.\n“Ever since the horrors of World War II, the world’s nations have committed to giving asylum seekers the opportunity to seek safe haven,” said Baher Azmy, legal director of the Center for Constitutional Rights, an advocacy group that is part of the lawsuit. “The Trump administration cannot defy this most elementary humanitarian principle, in violation of U.S. and international law, with a flip of a presidential pen.”\nThe president and senior White House officials said that the number of immigrants necessitated the action. New federal statistics showed 60,745 people were arrested or deemed inadmissible at the southern border in October, more than any other month since Trump took office.\n“The continuing and threatened mass migration of aliens with no basis for admission into the United States through our southern border has precipitated a crisis and undermines the integrity of our borders,” Trump wrote in the proclamation. “I therefore must take immediate action to protect the national interest, and to maintain the effectiveness of the asylum system for legitimate asylum seekers.”\nThe number of people requesting credible fear screenings — the first step to receiving asylum at the border — increased from about 5,000 in 2008 to 97,000 in 2018, according to Justice Department data cited in a Federal Register notice announcing the change.\nOverall illegal immigration is at historic lows, but the number of families coming here — mainly from Guatemala, El Salvador and Honduras — has surged to almost half of all apprehensions at the southern border. A record 23,121 crossed illegally in October, more than any month since Central Americans began coming here en masse in 2013, many fleeing gang violence and poverty.\nThe government is prevented by law from quickly deporting most if they credibly fear return and under a legal settlement protecting children is usually forced to free families from detention. That has frustrated Trump who campaigned against ending “catch and release” and in the run-up to Tuesday’s midterm elections falsely blamed Democrats for the practice as part of an attempt to stoke fear over illegal immigration. He also sent thousands of military troops to the border although they are not allowed to arrest migrants and said he would erect “tent cities” to detain them.\nUnder Friday’s proclamation, and an accompanying interim final rule issued by the Department of Homeland Security and the Department of Justice, immigrants who cross between ports of entry would no longer be eligible for asylum, but could qualify for a type of protection known as “withholding from removal,” which has a far higher burden of proof. It is immensely more difficult to attain so many more immigrants would likely be quickly deported. It also does not lead to any type of legal status as with asylum.\nGroups who support limiting immigration applauded the move, saying that it would reduce the number of migrants seek asylum, which has contributed to a record backlog of more than 1 million cases in the civil immigration courts. It can take years to adjudicate many cases before migrants are deported.\n“The proclamation and subsequent rule changes will make important alterations to the asylum process by attempting to reduce the flood of migrants who enter the United States illegally before asking for asylum,” said Dan Stein, president of the Washington D.C.-based Federation for American Immigration Reform. “Until loopholes that have been exploited for years are closed and asylum laws are changed to protect the credibility of the process, we’ll continue to see increased pressure on our southern border.”\nLegal experts said the administration’s argument appeared unlawful.\n“At the end of the day this is not going to be permissible,” said Leon Fresco, who oversaw immigration litigation as part of former President Barack Obama’s Justice Department. “All of the steps of this are flawed.”\nHe said the emergency authority invoked by the president applied only to people who have not yet entered the United States, not those already across the border. And he noted that the first line of the law governing asylum states that any immigrant who arrives in the country “whether or not at a designated port of arrival” is eligible to apply for the protection.\n“It is literally the first few words of the statute,” he said.\nCharles Foster, a Houston immigration attorney who advised former President George W. Bush, said the law is “black and white.”\n“I don’t see any merit to this argument at all,” he said.\nHundreds of prospective asylum seekers camped out overnight Thursday on the Mexican side of three international bridges linking El Paso and Juarez, said Shaw Drake, an attorney for the ACLU’s Border Rights Center. By Friday, many had moved to shelters in Juarez. He said Customs and Border Protection agents appeared only to be processing up to 20 asylum seekers a day.\nRoger Maier, a spokesman for the agency in El Paso, said it does so “as expeditiously as possible,” given space constraints and other factors.\nThe Center for Constitutional Rights and other groups have separately sued the agency for what it alleges is a practice of turning away asylum seekers who arrive at ports of entry. The lawsuit is ongoing.\nJodi Goodwin, an immigration attorney in Harlingen, said she feared Trump’s order would force a bottle neck upon international bridges in the Rio Grande Valley as immigrants throng there seeking asylum, rather than walking across the river and asking Border Patrol agents for the protection as most do.\nThe region does not have enough shelters on the Mexican side to house all the migrants. Reynosa and Matamoros are largely controlled by drug cartels and have some of the highest kidnapping rates in Mexico, according to the U.S. State Department.\nUnlike the Tijuana-San Diego border crossing, there is no organized process at ports of entry in Texas to gain a spot in line to apply for asylum.\n“As it is, right now, people are living on the bridges or under the bridges just to be able to apply for asylum,” Goodwin said. “The humanitarian effect is going to be horrendous.”\nlomi.kriel@chron.com\n@lomikriel", "url": "https://apnews.com/2969ae9e1e45442fa6ac640622e0af22"}