{"authors": ["Art Kabelowsky", "Wisconsin State Journal"], "date_download": "2020-05-04 20:04:04", "date_modify": "2020-05-04 20:04:04", "date_publish": "2018-11-30 09:45:00", "description": "After stepping on the gas in the second half, the Madison East boys basketball team pulled away for a 62-43 victory over Middleton in the Big Eight Conference opener for both teams on Thursday...", "filename": "_3293719dab5e449cb90ae373ce6bdea1_1588622644.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3293719dab5e449cb90ae373ce6bdea1_1588622644.html", "title": "Prep boys basketball: Madison East revs up in the second half to handle Middleton", "title_page": "Prep boys basketball: Madison East revs up in the second half to handle Middleton", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Prep boys basketball: Madison East revs up in the second half to handle Middleton\nAfter stepping on the gas in the second half, the Madison East boys basketball team pulled away for a 62-43 victory over Middleton in the Big Eight Conference opener for both teams on Thursday night.\nThe Purgolders (3-0, 1-0) sputtered to a 26-22 halftime lead, but then broke loose for a 36-21 advantage in the second half to pull away.\nSenior Anthony Washington scored 13 of his 21 points in the second half, 6-4 junior Marcus Justice added 12 and 6-5 sophomore Jevan Boyton scored 11.\nMiddleton (1-1, 0-1) got 12 points from 6-foot-5 senior forward Jake Klubertanz.\nMadison La Follette 88, Madison West 70\nTroy Reeves scored 20 points as the Lancers (1-0, 1-0 Big Eight) took their first win of the season with a foul-plagued victory over the Regents (1-2, 0-1).\nThe game saw a total of 52 fouls, as West had three players foul out and La Follette had one. The Lancers shot 20-for-23 from the free throw line in the first half, taking a 47-36 lead into the third quarter. La Follette extended the lead to 24 points in the second half.\nVerona 71,\nJanesville Parker 48\nSenior forward Tyler Slawek scored 19 points as the Wildcats (1-1, 1-0 Big Eight) raced to a 43-27 halftime lead and put away the Vikings (0-2, 0-1).\nEight other players scored for Verona, though none reached double figures. Parker got 15 points from Brady Biba and 13 from Tremar Curry.\nJanesville Craig 65,\nBeloit Memorial 42\nThe Cougars (2-0, 1-0 Big Eight) scored at least 30 points in each half and got 15 points from Aaron Leverson to put away the Purple Knights (0-2, 0-1).\nCraig seniors Jack Huml and Jacob Lynch each chipped in 10. For Beloit Memorial, 6-foot-3 senior forward Amariah Cook led the way with seven points.\nRock Valley Conference\nEast Troy 66, McFarland 61\nMcFarland forward Trevon Chislom led all players with 28 points, but the visiting Trojans (1-1, 1-0 Rock Valley Conference) beat the Spartans (2-1, 0-1). Junior guard Quinten Rollins led the Trojans with 22 points.\nJefferson 58, Whitewater 41\nJames Monogue had 22 points as the visiting Eagles (2-0, 1-0 Rock Valley) beat the Whippets (1-1, 0-1). Benjamin Stoll of Whitewater led his team with 11 points.\nEdgerton 66, Beloit Turner 53\nCrimson Tide junior Brian Rusch led his team with 13 points as Edgerton (1-1, 1-0 Rock Valley) used a 10-point second-half margin to overcome the Trojans (0-2, 0-1). Trojans guard Jordan Majeed led all players with 16 points in the loss.\nEvansville 62, Clinton 29\nThe host Blue Devils (2-1, 1-0 Rock Valley) held a 22-16 halftime lead, but went on a 40-13 scoring run in the second half to put away the Cougars (0-1, 0-1).\nThe winners got 12 points from Carson Hill. Clinton got 13 from Tyler Stauss.\nNon-conference\nPalmyra-Eagle 70, Waterloo 60\nThe Panthers (2-1) used a 37-27 first half to edge out the visiting Pirates. Morgan Carpenter scored a game-high 25 points. For Waterloo (0-3), Aaron Brey had 19 points, Spencer Noel 15 and Earnest Jiles 14.\nFall River 74, Deerfield 64\nSenior shooting guard Gage Nemecek and junior power forward Mathew Morton each posted 22 points as the Pirates (1-1) outscored the Demons (0-1) in the second half, 45-34. Wills Manning led Deerfield with 26 points.\nMadison Country Day 62,\nAlbany 55\nSenior guard Colin Green had 25 points as the Prairie Hawks (1-2) defeated the host Comets (0-2).\nJosh Dahl finished with 15 points for Albany, which had three players foul out.", "url": "https://apnews.com/3293719dab5e449cb90ae373ce6bdea1"}