{"authors": ["Enda Curran", "Vivianne Rodrigues", "Alessandro Speciale"], "date_download": "2020-05-04 20:15:52", "date_modify": "2020-05-04 20:15:52", "date_publish": "2018-01-24 00:05:53", "description": "The world’s political and corporate elite gathered in the Swiss ski resort of Davos delivered a robust defense of globalization as U.S. President Donald Trump slapped tariffs on imported solar...", "filename": "_0592492ef89642238acba87032145ed8_1588623352.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0592492ef89642238acba87032145ed8_1588623352.html", "title": "Davos elite doubles down on globalization ahead of Trump’s visit", "title_page": "Davos elite doubles down on globalization ahead of Trump’s visit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The world’s political and corporate elite gathered in the Swiss ski resort of Davos delivered a robust defense of globalization as U.S. President Donald Trump slapped tariffs on imported solar panels and washing machines in his first major trade action.\nThe push-back also came as a group of 11 countries, including Japan and Canada, agreed to move forward on an Asia-Pacific trade pact that Trump withdrew from in 2017. Canadian Prime Minister Justin Trudeau, speaking at the World Economic Forum in Davos, said the revised TPP would be “more progressive and stronger” for workers on intellectual property, culture and for the automotive industry. China also isn’t included.\n“If we are going to push back against the anti-trade tendency in globalization, that will leave us all worse off,” Trudeau said. “We have to put the concerns and the well-being of our ordinary citizens at the center of what we are negotiating.”\nTrump will arrive at the Davos talks this week to deliver a speech on his vision for the future of global trade. He’s expected to attend a World Economic Forum-hosted reception with chief executive officers from the U.S. and Europe, as well as government figures and other officials, according to a U.S. official.\n“When it was announced that President Trump was coming I think jaws dropped because this wasn’t seen as his crowd,” said David Rubenstein, co-founder of the Carlyle Group. “This is seen as the center of the globalization movement and he hasn’t been seen as the biggest supporter of globalization.”\nThe move on tariffs raises the stakes for the world economy that’s enjoying its best performance in seven years. “We’re going to benefit our consumers and we’re going to create a lot of jobs,” Trump said, as he signed the tariff orders on Tuesday at the White House. It demonstrates “the United States will not be taken advantage of anymore.”\nHeightened trade tensions between the U.S. and China, the world’s two biggest economies, is routinely listed as one of the biggest threats facing global growth.\n“We can learn from history that protectionism doesn’t work in the end,” Deutsche Post CEO Frank Appel told Bloomberg News. “It makes the country that puts the tariffs up more expensive and it will not protect employment in that country. Protectionism never has paid off in the long run. Global trade is not a zero sum game.”\nThe current global order was also defended by Fang Xinghai, vice chairman of the China Securities Regulatory Commission, who said on a panel discussion that China is opening up its economy to outside competition and cited a promise by President Xi Jinping to allow more outside competition in the nation’s banking sector. China is routinely criticized by trading partners for not doing enough to allow more inbound investment.\nOutlining ambitions to create a $5 trillion dollar economy by 2025, Indian Prime Minister Narendra Modi used his Davos speech to promise to slash red tape and ramp up foreign investment into Asia’s third-largest economy. He warned that as countries became more inward-focused, globalization “is shrinking.”\n“Although everybody is talking about an inter-connected world, we must accept globalization is slowly losing its luster,” he said. “Trade agreements have come to a standstill. Growth in the global supply chain has also stopped.”\nSome of the policy makers in Davos are hoping that Trump’s announcement doesn’t herald an about-face in the American administration’s trade policy. “We believe in free markets, and we believe that the U.S. are an example of the free market and we do not expect major shift in U.S. trade policies,” Georgia Prime Minister Giorgi Kvirikashvili said.\nFor all the tensions, few are predicting the outbreak of all-out trade conflict. That’s because of increasingly intertwined global supply chains and the overarching risk of economic damage to all sides, said Raymond Nolte, managing partner at SkyBridge Capital.\n“I don’t think it’s a full-blown trade war where it becomes a serve and volley and it keeps escalating and it breaks down trade,” he said. “The world is too globalized for that, business is too integrated for that.”", "url": "https://apnews.com/0592492ef89642238acba87032145ed8"}