{"authors": ["Mason Schweizer"], "date_download": "2020-05-04 20:16:30", "date_modify": "2020-05-04 20:16:30", "date_publish": "2018-06-01 04:09:00", "description": "OTTAWA — As the IHSA postseason tournament brackets get smaller, the competition gets tougher, and Coal City learned that in its Class 3A Ottawa Sectional semifinal against Illiana Christian on...", "filename": "_cef78b1f7ea44cbe8e79f36eed8e0290_1588623390.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cef78b1f7ea44cbe8e79f36eed8e0290_1588623390.html", "title": "Coalers use pitching and small-ball to advance to sectional final", "title_page": "Coalers use pitching and small-ball to advance to sectional final", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "OTTAWA — As the IHSA postseason tournament brackets get smaller, the competition gets tougher, and Coal City learned that in its Class 3A Ottawa Sectional semifinal against Illiana Christian on Thursday night.\nDeadlocked in a tight one-all game, the Coalers (33-5) got a wonderfully efficient start on the mound from Keegan Gagliardo and a tremendous all-around game from catcher Austin Pullara to narrowly knock off the Vikings 3-1 to advance to Saturday’s sectional championship.\nCoalers’ coach Greg Wills said his team used practice time at the beginning of the season to work on small-ball situations.\n“That’s the kind of stuff that we work on early on. Our first-and-third situations, bunt situations defensively and offensively and the things that get monotonous in the gym,” Wills said. “The go-ahead run we scored on a first-and-third situation.”\nThe go-ahead run Wills referred to came in the bottom of the fourth inning, when Pullara stole home, after he already had stolen second and third.\nWith Beau Wills on first and Pullara on third, Beau Wills took off for second while Vikings’ pitcher Tony Lucito was coming set. Lucito stepped off the mound and threw toward second, with a pickle ensuing.\nAs Beau Wills created the commotion between first and second, Pullara took off for home, narrowly beating first baseman Carter Doorn’s throw to the plate to put the Coalers ahead 2-1.\n“You’ve got Beau on the frontside, who’s a really smart runner, and Austin on third, who’s a great baserunner, and has some speed, too, so it was almost a perfect storm to run that play,” Coach Wills said. “It worked out good for us, he was safe by an eyelash.”\n“It was all instinct,” Pullara said. “(Doorn) made a good throw and almost got me, but when (Lucito) turned his back, it was time to go.”\nThe Coalers fell behind early 1-0, but it was Pullara who quickly tied things up in the bottom of the first, legging out an infield single that scored Blake Harseim.\nThe sophomore backstop was 2-for-3 on the night with a double and two runs along with two stolen bases. And according to Coach Wills, what’s most impressive is Pullara was not a regular catcher before the season started.\n“We had kind of a void there, and we were looking for an athlete who’s done some catching, so we brought him in,” coach Wills said. “He’s been fantastic back there handling a pretty good pitching staff; with the bat he gives us, with his glove and with his legs, he really puts pressure on a defense.”\nAnd that pitching staff was pretty good again Thursday, to say the least. After allowing a run on two hits in the first, Gagliardo quickly found his rhythm, at one point retiring 13 out of 14 batters between the first and fourth innings.\nHe finished with a line of five innings, one earned run, four hits, no walks and five strikeouts to earn the win.\n“I think after the first inning, the nerves just settled in, and I was able to get in and execute my pitches, and it worked out nicely,” Gagliardo said. “I was just attacking the strike zone, that’s what I’ve been doing all year.”\nGagliardo spent a lot of his night tipping his cap to shortstop Harseim, who seemingly made an average of about one jaw-dropping play per inning.\nAccording to Coach Wills, the slick-fielding shortstop almost got the nod on the mound, but his defensive ability in the hole was too much to give up.\n“I told Blake, ‘Maybe you deserve the start on the mound, but you’re playing so well in the middle of the field for us right now. I just think with Keegan on the mound, we’re so much better defensively,’” Coach Wills said. “He said, ‘I just want to win, Coach’ ... and that’s the kind of kid he’s been for us since he’s been here with us. He’s a great kid and had just a fantastic night tonight, especially defensively.”\nUp next\nThe Coalers look to claim the sectional championship at 11 a.m. Saturday, when they take on Joliet Catholic in Ottawa.", "url": "https://apnews.com/cef78b1f7ea44cbe8e79f36eed8e0290"}