{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:22:34", "date_modify": "2020-05-04 20:22:34", "date_publish": "2018-11-30 07:00:00", "description": "Another beautiful day in Havasu... Orchids to Cha-Bones for Thanksgiving dinner. I am 82 and use a walker, and a nice young women helped me move to the front of the line so I did not have to...", "filename": "_ee748415c1914ef0b237095319f35db3_1588623754.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ee748415c1914ef0b237095319f35db3_1588623754.html", "title": "Orchids and Onions: Friday, November 30, 2018", "title_page": "Orchids and Onions: Friday, November 30, 2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Another beautiful day in Havasu...\nOrchids to Cha-Bones for Thanksgiving dinner. I am 82 and use a walker, and a nice young women helped me move to the front of the line so I did not have to stand and wait. Very thankful for all they accomplished.\nOnions to the clothing retailer that handed out coupons with pull tabs that had already been opened. The employee said they just were not sealed well enough. Took away the fund of guessing your giveaway. Not good business.\nOrchids to Sheena of the Humane Society who kept me calm and comforted through a most horrific roll-over car accident before the rest of Havasu’s finest got there to provide onsite help and support. I’m am truly grateful.\nOrchids to the kid that stood up to the bullies. Sometimes that’s the only way to stop bullies. The school was wrong. Words do hurt.\nOnions to the Climate Change believers. There is a way to stop climate change. Figure out a way to stop the tectonic plates. Stop volcanoes from erupting and lastly, you have to control the sun spots. Good luck.\nOrchids to LHCPD 911 operator, Lake Havasu City Fire Department Station 3 and River Medical Ambulance Co. for their professional and compassionate care of my special needs son! All of you are amazing!\nOnions to animal control for not doing their job. So many barking dogs. I tried to complain, the problem has still not been addressed properly. How about going up to the front door of the home complaints are being made about, so the home owner will be aware of the complaints?\nOrchids to the speed limit change on S. McCulloch. Now if the local PD would just enforce it between 7 to 9 am, we might stop the chronic offender who terrorizes the area three to four days a week and then again at just after nine pm on weekends only a matter of time before a child is ran over.\nOrchids to ASU’s new donated speaker system. No problem hearing at the back of the auditorium. I hope city parks and recreation can borrow it for their events instead of using their Radio Shack model.\nOrchids to Mary at Albertson’s customer service! What a treat to deal with her helping me get online to shop “Just for you”! Could not have done it without her! Thank you! You are the best!\nSubmit entries of 40 words or less in person or e-mail to planner@havasunews.com.", "url": "https://apnews.com/ee748415c1914ef0b237095319f35db3"}