{"authors": ["Chuck Malloy"], "date_download": "2020-05-04 20:27:17", "date_modify": "2020-05-04 20:27:17", "date_publish": "2018-03-18 06:29:00", "description": "In case you haven’t heard, there is a Democratic primary race for governor and A.J. Balukoff — the presumptive frontrunner — is happy to see it. “I was telling people what I was hoping that...", "filename": "_8d24b5cd200843bdbd47fddafb7783bf_1588624037.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8d24b5cd200843bdbd47fddafb7783bf_1588624037.html", "title": "Democratic gubernatorial primary is one to watch", "title_page": "Democratic gubernatorial primary is one to watch", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In case you haven’t heard, there is a Democratic primary race for governor and A.J. Balukoff — the presumptive frontrunner — is happy to see it.\n“I was telling people what I was hoping that we were going to have a (Democratic) primary,” he said. “I was trying to recruit people to run against me, and no one wanted to do that.”\nThen, along came former Rep. Paulette Jordan of Plummer, and the Boise millionaire’s wish was granted.\nPerhaps Balukoff should be more careful about what he wishes for, because from what I hear Jordan has a good chance of winning this race. There are good reasons why she has a reasonable shot at winning.\nJordan is 38 and the future is in the hands of people of her generation. Balukoff is 72, and perhaps a decade or two away from assisted living. Jordan’s experience in the Legislature gives her a background in state government and working with legislators.\nHis main government experience is 21 years on the Boise School Board. She appears comfortable while posing atop a horse; he has the look of an elderly man who likes bow ties.\nThe voter turnout should be low, with at least some Democrats being more inspired to register for the Republican primary. But members of the Coeur d’Alene Tribe, and other native Americans, no doubt will be motivated to vote for Jordan — and that’s a huge voting block. Jordan doesn’t advertise the fact that she would be the first woman, and the first Native American of any state, to win the governorship. But she doesn’t need to.\n“The Coeur d’Alene Tribe is proud of the accomplishments and efforts of our member, Paulette Jordan,” said Jennifer Fletcher, public relations director for the tribe. “We think that she would make a great governor for Idaho and know she will draw from her traditional roots and combine it with forward thinking in an effort to make Idaho an even better place to live.”\nJordan hits some of the right buttons for Democrats — pushing for improvements in education, health care and environmental quality. And she has plenty of confidence.\n“I know I can win and will win,” she said. “It’s a matter of getting to the people. We have (supporters) who have never voted before, and never engaged. It’s a matter of getting people to believe in their government again.”\nJordan may need some help in political history. Her campaign recently sent out an email blast with her claiming to be the only Democrat from North Idaho to serve in the Legislature. She wasn’t even the first woman from the Coeur d’Alene Tribe to be elected (Jeanne Givens served during the 1980s). Two of those former legislators, John Rusche of Lewiston and Mary Lou Reed of Coeur d’Alene, have endorsed Balukoff.\nOoops.\nBalukoff, who spent nearly $3 million in an unsuccessful run against Gov. Butch Otter in 2014, plans to fork out a few more million in this race — this time with a better campaign organization and better name recognition — especially among Democrats. He relishes a contested primary, because it forces an earlier his start to the campaign.\n“Four years ago, I was running against a popular incumbent, and my chances of winning were slim,” he said. “I really had my eye on 2018.”\nBalukoff is not taking sides on the Republican primary, although he says his contrast is greater with Congressman Raul Labrador.\n“Brad Little is fairly moderate,” Balukoff said. “I’ve known Tommy (Ahlquist) for a long time. I thought he was a pretty moderate person, but he has been running to the right in his campaign. I don’t know where he would end up if he were the nominee. It would be interesting running against a friend in the general election.”\nFor now, Balukoff’s focus is on the Democratic primary. He says he’s “thrilled” to see Jordan in the race, but adds, “I think I bring more experience this time around and had leadership roles that Paulette hasn’t had. I think people should stay with me this time around. She may be what we need the next time.”\nSo, give her a pat on the head and let her go back to her work with the Coeur d’Alene Tribe. … Somehow, I don’t expect Jordan to go away that easily.\nChuck Malloy, a longtime Idaho journalist, is a columnist with Idaho Politics Weekly. He may be reached at ctmalloy@outlook.com. This column originally appeared on idahopoliticsweekly.com.", "url": "https://apnews.com/8d24b5cd200843bdbd47fddafb7783bf"}