{"authors": ["Mike Sautter", "World-Herald Service"], "date_download": "2020-05-04 20:14:03", "date_modify": "2020-05-04 20:14:03", "date_publish": "2018-03-01 16:43:00", "description": "Council Bluffs Lewis Central junior Max Duggan isn't the typical quarterback recruit. Despite being one of the country's most coveted quarterback prospects in the 2019 class, Duggan isn't...", "filename": "_91eeb804578b426595cdf2abb6ae46bf_1588623243.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_91eeb804578b426595cdf2abb6ae46bf_1588623243.html", "title": "Coveted QB Duggan weighs college visits, but he's focused on football", "title_page": "Coveted QB Duggan weighs college visits, but he's focused on football", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Council Bluffs Lewis Central junior Max Duggan isn’t the typical quarterback recruit. Despite being one of the country’s most coveted quarterback prospects in the 2019 class, Duggan isn’t concerned with where he ranks in the major recruiting services.\nHe prefers to focus instead on his craft.\nThe 6-foot-2, 190-pound four-star prospect is the No. 7-ranked dual-threat quarterback in the nation according to the 247Sports composite rankings and a top 300 overall prospect in the 2019 class.\n“I don’t mess with the rankings,” Duggan said. “My goal is to be the best player I can be and to help my team win a state championship next season.”\nDuggan holds offers from some of the country’s top programs. Reigning SEC champion Georgia, Big Ten champion Ohio State, Nebraska, Iowa, Penn State, Oregon and Tennessee are some of the 22 schools that have offered Duggan a scholarship.\nHe is in the process of deciding which of those schools he will visit. Prospects can take five official visits.\n“I will not use all of my official visits this spring,” Duggan said. “I will probably take some unofficial visits in March and maybe one or two official visits this spring.”\nThe 2019 class in the Omaha-Council Bluffs area is shaping up to be one of the best in recent memory. Duggan is one of three players rated as top 300 recruits. Omaha Burke juniors Chris Hickman and Nick Henrich hold double-digit scholarship offers as well. The three have built a relationship and talk often.\n“I talk with a lot of kids in my class, people like Chris and Nick,” Duggan said. “Really seeing if we have the same interest and sharing advice on how to handle the recruiting process of coaches contacting us and what they are saying.”\nDuggan said he plans to be a mid-year college enrollee after playing his senior season at Lewis Central. He talks with some of his peers in the 2018 quarterback class that he met at camps who are currently enrolled in college. Most of those discussions are centered more on campus life and what being a college student is like.\n“I want to make a decision this spring and be in school in January,” he said. “You gotta find the right fit and not necessarily football fit. Sometimes it might not be close to home.”\nOnce he picks a school, Duggan said he will be a firm commit unless something drastic happens.\n“I don’t want to commit somewhere just to say I did and then decommit a bunch of times just to gain more offers,” he said.\nDuggan doesn’t have a top five just yet and doesn’t plan to post a top 10 or top 15 on Twitter as some recruits have done. He is going to rely on one thing when it comes time to make a decision.\n“It will feel right when my gut tells me where I’m supposed to be,” he said.\nAs a top QB prospect, Duggan has been invited to almost every camp in the country this spring and summer. He won’t attend all of them but he does have one goal in mind.\n“One of my goals is to get to Oregon,” he said.\nThe Elite 11 will be named at the conclusion of the Elite 11 regionals and finals. The selected athletes will compete at The Opening Finals in Beaverton, Oregon, from June 30 to July 3.\nDuggan will first compete at the Nashville Elite 11 Regional in Nashville, Tennessee, on April 22. If he isn’t selected to move on to the finals he will head to Canton, Ohio, on May 5.", "url": "https://apnews.com/91eeb804578b426595cdf2abb6ae46bf"}