{"authors": ["Will Stone Will.Stone Nptelegraph.Com"], "date_download": "2020-05-04 20:08:02", "date_modify": "2020-05-04 20:08:02", "date_publish": "2018-05-19 08:00:00", "description": "After 30 years in North Platte, a downtown fixture is closing its doors. The North Platte Art and Gift Gallery’s members have decided that the upcoming Nebraskaland Days art show will be its...", "filename": "_e0bef4cfdb964bbda55e72844349c4a6_1588622882.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e0bef4cfdb964bbda55e72844349c4a6_1588622882.html", "title": "Art and Gift Gallery to close", "title_page": "Art and Gift Gallery to close", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "After 30 years in North Platte, a downtown fixture is closing its doors.\nThe North Platte Art and Gift Gallery’s members have decided that the upcoming Nebraskaland Days art show will be its last as they will be closing for good in late June.\n“We were going just day after day with very few people in. It just seems to be getting worse every year, that downtown there doesn’t seem to be a lot of activity,” 25-year member Nora Wood said, “So just after a while it seemed kind of pointless to be sitting here all day when sometimes nobody would come in.”\nWhen the gallery was founded, over a dozen members helped run it. But today, with just six members — four of whom can man the front desk — they are stretched too thin to continue.\n“We hate to close. We’ve been here a long time,” Wood said, “But it’s time.”\nCurrently the shop houses the art of the six active members as well as any community members who rent wall space to display art of their own.\nThe Nebraskaland Days show will run June 17-24. Over the years it has become an annual staple for the gallery. Operated by the Nebraskaland Days committee, the contest offers cash prizes to winning entrants. The gallery has played host to the competition since it moved from the Platte River Mall several years ago.\nThough the gallery’s days are coming to an end, its existence will leave Wood with fond memories.\n“I’ve really enjoyed being here and meeting people. I think that’s been the most fun part, meeting people who are sometimes just passing through and being a part of it with the other artists, it’s always been fun,” Wood said.", "url": "https://apnews.com/e0bef4cfdb964bbda55e72844349c4a6"}