{"authors": ["Jeremy Stewart"], "date_download": "2020-05-04 20:29:09", "date_modify": "2020-05-04 20:29:09", "date_publish": "2018-04-22 07:00:00", "description": "Cycles in sports provide the ebb and flow of competition on the local, regional and state stage. But the Greater Rome area continued to excel on the wrestling mat on each level this past...", "filename": "_a95b1b7907a3498897efaa8d5c82ad97_1588624149.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a95b1b7907a3498897efaa8d5c82ad97_1588624149.html", "title": "PREP WRESTLING: Triple threat tops All-Area", "title_page": "PREP WRESTLING: Triple threat tops All-Area", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cycles in sports provide the ebb and flow of competition on the local, regional and state stage. But the Greater Rome area continued to excel on the wrestling mat on each level this past season.\nA year after several wrestlers turned heads at the traditional state championships, the local talent kept the trend going this past season, with seven state champions and more than twice as many finishing in the top two of their weight class.\nThree members of that championship class who made the return trip to the top of the podium stood out from the rest.\nDarlington’s Dalton Blankenship and Colton Woods took the challenge to continue their ascension through the varsity ranks and won their third straight state titles this season.\nArmuchee’s Jacob Henderson powered through his opponents and repeated as the Class AA 182-pound state champion in his final season of prep competition.\nAll three highlight the 2018 Rome News-Tribune All-Area Team as the Wrestlers of the Year.\nHenderson came back from a broken leg that kept him from competing in his freshman season to go on and accumulate a 148-10 record, including an undefeated 45-0 season as a junior.\nHe went 54-3 this past season, winning his third straight area championship and finishing on the podium at state for the third year in a row as well, only this time doubling his championship tally with a 5-2 decision over BJ Bradford of Elbert County.\nThe Class A state champion at 132 pounds, Woods went 42-1 this past season, while Blankenship went 40-1 and won the Class A 126-pound state title.\nBoth Darlington juniors have won area, state sectional and state traditional titles each year of high school.\nEach Tiger also won their division this past season at the Tri-State Invitational at Ringgold High School and the Darlington Classic.\n2018 RN-T ALL-AREA WRESTLING TEAM\nFIRST TEAM\nWt. Name School\n106 Griffin Jarrett Chattooga\n113 Wes Conley Armuchee\n120 Ivan Arguello Rome\n126 Dalton Blankenship* Darlington\n132 Colton Woods* Darlington\n138 Lincoln Maddux Trion\n145 Cole Luallen Trion\n152 Rhett McDurmon Darlington\n160 Garrett Sheffield Darlington\n170 Jacoby Cottrell Chattooga\n182 Jacob Henderson* Armuchee\n195 Logan Blevins Trion\n220 JC Burkett Armuchee\n285 Luis Medina Chattooga\n*Wrestlers of the Year\nSECOND TEAM\nWt. Name School\n106 Cameron Espy Armuchee\n113 Carl McDurmon Darlington\n120 Bo Stricklin Trion\n126 Walker Byrd Model\n132 Isaiah Bevels Pepperell\n138 Davis Peek Darlington\n145 Ethan Nixon Armuchee\n152 Austin Kiser Chattooga\n160 Ty Veatch Chattooga\n170 Bryant Wilkinson Rome\n182 Jack Bennett Pepperell\n195 Alex Mears Chattooga\n220 Aiden Brock Trion\n285 Clay Baker Trion\nHONORABLE MENTION\nARMUCHEE: Brayden Butler, Kyle Cushing; CEDARTOWN: Chris Davis, Tanner Mason, Thomas Zenga; MODEL: Duncan Blankenship, Tommy Herod, Dillon Langston, Ray Shaw, Joseph Wallace; PEPPERELL: Landon Camp, Drake Miller, Ethan Sharpe; ROME: Tyler Ingram, Elvis Perez, Mason Sterner; TRION: Branson Bowman, Noah Deparler, Alonzo Francisco.", "url": "https://apnews.com/a95b1b7907a3498897efaa8d5c82ad97"}