{"authors": ["Agustina Santomaso", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:51:14", "date_modify": "2020-05-04 19:51:14", "date_publish": "2018-04-24 00:00:00", "description": null, "filename": "2018_04_argentina-abortion-feminism-ni-una-menos_1588621874.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/04/24135923/niunamenos.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_04_argentina-abortion-feminism-ni-una-menos_1588621874.html", "title": "From the Underground to the Mainstream", "title_page": "From the Underground to the Mainstream", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nApril 10 marked a crucial date in the lives of Argentine women. That day, the National Congress began to review a set of competing bill proposals with potentially far-reaching consequences for access to abortion and reproductive rights. Even if the bills don’t pass, the legislative sessions themselves represent a real advance in the decades-long struggle for the legalization of abortion. They also lay bare a set of socio-political fault lines that rarely, if ever, align with institutional party politics. The first bill is proposed by National Campaign for Abortion Rights and symbolizes the resurgence of Argentinian feminism through the #NiUnaMenos women’s movement. Were the bill to be passed, Argentine women and transgender men would enjoy some of the most progressive reproductive rights in the Western Hemisphere. The other bill, titled “Human Rights for the Pregnant Mother and Unborn Child,” is sponsored by conservative lobbyists and would institute an economic incentive program encouraging women to carry unwanted pregnancies to term. A slew of bills sponsored by individual legislators covers the middle ground. All the majority parties have abstained from issuing an official position on the matter. Today, as Argentina draws closer to the forty-year anniversary of the restoration of democratic rule, access to abortion is the last remaining civil right that no government has had the courage or political will to tackle. In other areas, the country had boasted a progressive track-record when compared to neighboring post-dictatorship Latin American countries: same-sex marriage, a widely-praised gender identity law, and an “open-door” immigration policy. Nevertheless, access to abortion is restricted to a few exceptional cases: if the pregnancy is the result of rape or poses a health risk to the pregnant individual. The congressional sessions follow on the heels of March 8, now known as the International Women’s Strike. This year’s global action — regarded by some to be the largest event of its kind in history — was set against a reactionary political conjuncture. Despite this, Argentina’s feminist organizations have been able to form a rank-and-file movement of massive dimensions and unify around a powerful demand: access to safe, legal, and free abortion. That convergence has forced abortion rights into mainstream debate, making it a hot topic in the media, the workplace, in political speeches, policy circles, and in the public eye. Contrary to the current legal framework, where an abortion can only be obtained under exceptional circumstances and with special authorization, Congress is now preparing to debate a bill in which a woman’s choice is the sole relevant factor.\nAbortion on the Public Agenda Historically speaking, the feminist movement has been almost completely ignored by Argentina’s national media. Important marches in the past have been subject to a media blackout, and the annual National Women’s Gathering, which attracts upwards of sixty thousand women, has been subject to derision. However, as organizing against gender violence crystallized into the #NiUnaMenos campaign in 2016, that icy media reception began to thaw. In January 2018, the country’s most popular daytime talk show Intrusos, invited a number of feminist journalists to discuss an array of issues related to the women’s movement. In debates taking place over a five-day “special on feminism,” abortion quickly emerged as the standout topic. The special was a hit, and soon enough, other media outlets picked up on the topic. Still, programming adhered to television’s typically Manichean formatting: one guest from each camp was invited to speak for or against the legalization of abortion. Those in favor of legalization reminded viewers that back-alley abortions are commonplace in a society where free, safe access is denied. They invoked public health: clandestine abortions are the principle cause of maternal mortality in Argentina. And they called on viewers’ sense of social justice, by discussing how wealthier women are able to obtain the procedure safely and discreetly, while poor women are subject to great, often mortal risk. Those pro-choice voices were reiterating the basic position of the National Campaign for Abortion Rights. The Campaign holds that framing the abortion debate as an urgent public health matter is the best way to cast the widest possible net. Indeed, some might find it odd that amid so much talk of abortion, the concept of a woman’s autonomous control over her body was rarely if ever raised. Nevertheless the consensus within the Campaign, as the privileged political instrumental for all pro-choice organizations, is that the public health line is a strategic priority. It does beg the question whether Argentine society prefers to see the legalization as the lesser of two evils, and ignore the deeper question about the justice of forcing a woman to carry a pregnancy to term and give birth. On the other side, conservatives, anti-choice lobbyists, and religious organizations tend to repeat ad nauseam the same talking points that are familiar the world over: life begins at conception and the embryo is a living being waiting to be born. The same conservative groups who dismiss the military dictatorship’s crimes against humanity cynically invoke the embryo’s “right to life.” Abortion, they maintain, is murder at any stage of gestation and under any circumstance (including cases of rape, or to save the woman’s life). These same anti-rights voices came out in force on March 25, holding a massive demonstration in the capital’s wealthy northern corridor. The march’s itinerary was laden with symbolism, making important stops at the headquarters of Argentina’s historical latifundist cartel, the Sociedad Rural, before continuing on to the Faculty of Law, a bastion for conservative thinking. The social composition of the march, apart from the understandably sizeable evangelical contingent, included neo-Nazis, Catholic organizations, and apologists for the military junta. Anti-rights organizations tend to concentrate their energies on spreading misinformation. For example, they commonly assert that abortion is unconstitutional, arguing that the UN’s Convention of the Rights of the Child and the Inter-American Commission of Human Rights — treaties to which Argentina is a party — protect life starting at the moment of conception. This flies in the face of statements made by the treaty’s own review bodies, which insist that Latin America must decriminalize and guarantee safe access to abortion. Post-abortion trauma is another talking point common to the anti-rights groups, even though competent mental health organizations have shown that the risk of trauma is unsubstantiated. The Achilles heel for the anti-rights groups are their own deeply held beliefs. They refuse to see the connections between their own hostility towards the distribution of contraceptives, sex education, and divorce, and the growing urgency of the abortion issue. This is to say nothing of their retrograde attitude towards homosexuality and transgender people. In a country where more than sixty-two priests stand accused of sexual abuses of minors, these same groups have had the gall to assert that abortion is a more serious crime than pedophilia. Several of the groups’ spokespersons are vocal apologists for the military junta’s genocidal crimes against humanity, and have defended the dictatorship’s kidnapping of the junta’s “disappeared” victims. Of course, pedophilia and the dictatorship’s kidnappings are criminal acts that Argentine society can condemn en masse. By explicitly asserting, as they have in public forums, that abortion is a more serious crime, the right-wing may have run up against an unshakeable social consensus. Pro-rights groups could thus be seen as gaining the upper hand in televised debates. A recent survey indeed shows that the majority of the population is in favor of legalization. Still, religious lobbies, with the Catholic Church leading the way, have until recently been extremely influential in seeing that legislators keep any sort of abortion bill out of committee.\nThe Long March for Legalization Having opened the floor to the abortion issue, the media quickly “discovered” a sizeable and mature feminist movement in waiting. Since the return of democracy in 1983, Argentina’s incipient women’s movement has embraced abortion rights as one of its principal demands. Shaped by her experience with Italian feminism during her time in exile, the Trotskyist attorney Dora Coledesky was one of the pioneers responsible for the creation of a women’s commission advocating for legalization. In 1992, she introduced the first bill proposal that would have regulated the free distribution of contraceptives and the legalization of “voluntary” abortion. The late nineties saw the rise of Argentina’s piquetero movement. This groundswell of social organizations led by unemployed workers began to gain in political relevance as the nation’s economic crisis assumed catastrophic dimensions. Women in particular played a vital role in the movement. They often took the lead in local neighborhood governance, community kitchens, and overseeing a variety of vital functions in a “feminized” informal economy. These new social movements were likewise more permeable to “women’s issues,” while the traditional Left organizations remained fearful, at least initially, that gender politics could overshadow the central class contradictions of society. Around the same time, the National Women’s Gathering became the site, with its mass popular assemblies, for feminist demands to be articulated. The Gathering, which recently has seen between sixty thousand to eighty thousand attendees, is an annual event held at different locations throughout Argentina. Women come together to hold workshops and meetings, to share and learn from different political practices, establish alliances among often disparate political expressions, and develop strategies. The first Gathering took place in 1986 with a small meeting of academic feminists, growing in size and scope with every passing year. 2001 marked a watershed year for the Gathering, when the piquetero movement embraced the event and gave it the popular, mass-based quality that is today one of the characteristic marks of Argentina’s feminist movement. And it was in that historical juncture too that the struggle for abortion was organized into the National Campaign for Abortion Rights, in 2003. Today, the National Campaign, which has centralized the struggle for legalization, is comprised of more than five hundred organizations. Their slogan can be translated as: “Sex education to decide, contraceptives to not abort, legal abortion to not die.” This time around, for the seventh time since 2007, the Campaign has presented a bill that would legalize the voluntary interruption of a pregnancy. The last six times that the bill was introduced it failed to make its way to the floor. The bill would guarantee the right to abortion up to the fourteenth week of pregnancy. If the pregnancy poses a health risk to the pregnant person, was the result of rape, or if the fetus showed serious malformations, that period could be extended up to twenty-four weeks. If the bill were to pass, abortion wouldn’t just be decriminalized; the public health system, private clinics, and social security would be required by law to provide it free of charge.\nInstitutional Equivocation Argentina’s major political blocs have no consensus on the issue and “freedom of conscience” remains the order of the day. This smokescreen of “individual conscience” conceals a historical anti-abortion line shared among the nation’s main political parties. Current president Mauricio Macri as well as former president Cristina Fernández de Kirchner have openly opposed legalization, and in a strongly presidentialist political system, legislators tend to ape the stance taken by party leaders. And yet, for the nation’s majority parties, the abortion issue is becoming a stumbling block that tends to foster internal-party dissension. Only among certain left parties — the Workers’ Left Front (Trotskyist) and the Movimiento Evita (Peronist-Piquetero) — has legalization become a unified party platform position. Propuesta Republicano (PRO), the ruling neoliberal party with a majority bloc in both chambers of Congress, contains legislators that fall on either side of the issue, although the majority are opposed to legalization. A similar pattern can be observed among the opposition forces gathered in the Unidad Ciudadana, a party organization loyal to former president Cristina Fernández de Kirchner. There, Kirchner’s historical opposition to legalization is a millstone obstructing productive dialogue on the issue. The current numbers may temper hopes for the bill’s immediate passage. Current voting projections estimate that in the Chamber of Deputies there are 110 negative votes, 99 in favor, and 48 undeclared. In the Chamber of Senators the no-vote wins by a larger margin: 16 in favor, 27 opposed, and 29 undeclared. The significance of the sizeable undeclared sector, which will clearly cast the deciding vote, is more difficult to interpret. The vote breaks down more along geographic lines than party ones. The pro-abortion vote is concentrated in the City of Buenos Aires, the Greater Metropolitan Area, and the Province of Buenos Aires; that is, in the urban centers. Moreover, many legislators who have publicly stated their opposition to legalization have anonymously contradicted that sentiment, insinuating that they would vote in favor of legislation. Reluctance to take a stand on the issue is in large part due to the pressures of the Catholic Church, which lobbies individual legislators to ensure that reproductive rights stay off the table. Other legislators who initially voiced opposition later began to show signs of indecision as their ears were turned by their own pro-choice constituencies. Threatened by what it perceives as a shift in mood within the political class, the Catholic Church recognizes the mobilized sectors of Argentine society to be its true enemy. The timing of this progress in the abortion debate is something of a paradox. Argentina’s current administration, along with Temer’s government in neighboring Brazil, is at the forefront of a continent-wide, right-wing assault on social rights and constitutional guarantees. At the same time, Argentina’s feminist movement has managed, despite the adverse climate, to grow into a mass movement that cuts across different sectors and struggles. It’s displayed a political dynamism that has allowed it to advance its principal aims while taking the lead in the fight against Mauricio Macri’s neoliberal economic policies. That the dialogue around abortion has reached such an advanced stage is a sign of the vanguard political role played by the feminist movement in Argentina, rather than the leniency of President Macri’s nominally “liberal” administration. Certain segments of the progressive left have nevertheless leveled the accusation that the feminist movement is at risk of being co-opted by a neoliberal administration looking to burnish its liberal credentials. This argument manages to be simultaneously patronizing to the women’s movement while also overestimating the conservative administration’s capacity for social conciliation. Of course, abortion was not on the agenda during the apogee of the region’s so-called populist governments. Evo Morales, Rafael Correa, Hugo Chávez, and Cristina Fernández de Kirchner have all voiced their opposition to abortion. Dilma Rousseff and Lula da Silva in Brazil, and Michelle Bachelet in Chile, favored decriminalization only under limited circumstances. Uruguay did manage to legalize abortion in 2012 under the presidency of Pepe Mujica; though only after Tabaré Vásquez, a member of Mujica’s same Broad Front, vetoed an abortion-decriminalization bill during his first term.\nThe Situation in Argentina Access to abortion is subject to numerous legal restrictions throughout Latin America. In virtually all Central American states abortion is unconditionally prohibited (Nicaragua, Honduras, El Salvador, the Dominican Republic, Haiti). Uruguay, Cuba, Guyana and Mexico City are the only exceptions where there is a legal framework in place allowing for the legal interruption of a pregnancy. In the remaining countries, abortion is only legally accessible under particular circumstances (generally, in cases of rape, or where the woman’s life is at risk). In Argentina, the underground nature of abortion means that it is difficult to calculate how many are being performed nation-wide. Official statistics report that forty-three women died of abortions in 2016. Official figures do not however distinguish between an induced or spontaneous abortion, and more importantly, everything seems to indicate that such events are under-reported. One demographic study estimated that, based on hospital discharges in 2004, there were somewhere between 486,000 and 522,000 abortions performed in a year. During that same year, vital statistics recorded 736,000 live births. Legally speaking, abortion in Argentina is both a crime and a legal right. According to the nation’s Penal Code that has been in effect since 1926, abortion is classified as a crime against life. Article 86 of the same code indicates two exceptions: when the pregnancy is the result of rape, or when it represents a risk to the woman’s life. The primary effect of abortion’s criminalization has been to drive the widespread practice underground. Actual punitive measures are rarely taken, and when they are, they are prosecuted in order to make an example of a handful of women, in a haphazard manner that tacitly recognizes that the phenomenon is too pervasive to be managed through repressive measures. Where exceptional conditions do allow for legal abortions, opponents have gone to great lengths to frustrate their application. Doctors frequently seek legal authorization before performing the procedure; such lengthy processes often force women to carry the pregnancy to term, or else enter the shadow economy of back-alley abortions. This situation led to a 2012 Supreme Court ruling requiring the health care system to handle authorization within a five-day period and without appealing to outside legal authorities. It was further specified that abortion would be legal for any pregnancy resulting from rape (prior to the ruling, one dominant interpretation of the law argued that the clause only applied to rape victims with mental disabilities), and that victims would no longer be required to file a police report before obtaining the procedure. Despite the clarity of the Supreme Court ruling, the new standards have not translated into improved access to legal abortion. In Argentina, the passage of national laws does not always imply the modification of health care practices. One explanation for this discrepancy can be found in the high degree of autonomy enjoyed by medical practitioners as an organized professional sector. Another, more systemic issue are the difficulties confronted when attempting to turn progressive legislation into social practice. The failure to apply a federally mandated sex education curriculum is a recent example. The 2016 legislation stipulated that a comprehensive sex education program would be mandatory from the earliest preschool level up to the university. Despite the ambitions of the nominally progressive legislation, it remains unfulfilled at a number of educational levels across the country. Teachers did not receive required training, and institutions frequently opted out. The sex education curriculum, like the Supreme court ruling on abortion, are just two examples where public policy, absent the political will to see their application, are just dead letters.\nOrganizing for Abortion While the call for legal abortion awaits a fair hearing by society and in Congress, Argentina’s women have organized themselves in order to guarantee that the daily practice of abortion is conducted as safely as possible. The feminist organization Socorristas en Red, for example , facilitates abortion access within a human rights, anti-patriarchal perspective. Those who decide to abort can call and speak with one of the “rescue workers” who will inform them of the safest methods, guide them through the bureaucracy of the health system, point them towards any necessary medical studies, and arrange for medical appointments. The student movement, in concert with teachers and feminist organizations, has also pressed for abortion to become a part of the university curriculum, and abortion is often the subject of extracurricular courses and student-led teach-ins. This is significant, on the one hand, since there is a longstanding precedent in Argentina dating back to the University Reform Movement of 1918 in which the large public university system has acted as the springboard for wider social reforms. Naturally, it also affects the institutions that train the nation’s doctors. A sense of public-health activism also saw a group health professionals establish the Network of Pro-Choice Professionals in 2015. The network has lent visibility to the growing and coordinated effort, catalyzed by the 2012 Supreme Court ruling, to push for a more expansive interpretation of what it means for a woman’s health to be affected by pregnancy, thus allowing greater access to safe and free abortions. One of the interesting effects of this activism and reinterpretation of the law is that an entirely new understanding of health has been broached. In this framework, all the physical, emotional, and social dimensions of a woman’s health that are jeopardized by pregnancy and birth are considered. This framework was affirmed by the National Health Ministry’s guidance that the legal interruption of a pregnancy can occur whenever a women’s health is affected in any sense. Argentina’s provinces have been reluctant, however, to adopt this interpretation at the local level.", "url": "https://www.jacobinmag.com/2018/04/argentina-abortion-feminism-ni-una-menos"}