{"authors": ["John N. Mitchell Tribune Staff Writer"], "date_download": "2020-05-04 20:06:04", "date_modify": "2020-05-04 20:06:04", "date_publish": "2018-03-10 23:31:00", "description": "Enon Tabernacle Baptist Church's focus is on saving souls. However, on Saturday during the church's annual Men's Health Initiative, the focus was on saving lives, which it may have...", "filename": "_3f90e53f79b84f738cd8f71af9a4012a_1588622764.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3f90e53f79b84f738cd8f71af9a4012a_1588622764.html", "title": "Enon Tabernacle Baptist conducts free medical screening at 'Man Cave'", "title_page": "Enon Tabernacle Baptist conducts free medical screening at 'Man Cave'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Enon Tabernacle Baptist Church’s focus is on saving souls.\nHowever, on Saturday during the church’s annual Men’s Health Initiative, the focus was on saving lives, which it may have done.\nWell before the 12-hour event ended at 8 p.m., at least one man, who had suffered two strokes and a heart attack, found out he was dangerously close to having another potentially fatal heart attack, so he was rushed to Chestnut Hill Hospital for further evaluation.\n“You can’t put a price on something like this,” said Charmaine L. Green, Sidney Kimmel Cancer Center Program Coordinator in the Department of Medical Oncology Center to Eliminate Cancer Disparities, said. “That man could have possibly dropped dead and died of a heart attack in the street.”\nGreen spent Saturday at Enon helping other medical professionals administer screenings for prostate cancer. She was one of many participating in the Know Your Numbers initiate at the Mount Airy church that spent the day screening, free of charge, men for abnormalities in blood pressure, cholesterol, BMI, HIV, weight, kidney function and other health issues that African-American men often ignore to their own detriment, sometimes with fatal outcomes.\nThe church, located at 2800 W. Cheltenham Ave., does this once a year, transforming into a center where men, with or without health care, receive free testing, consultation and interaction with medical professionals.\nThe day is dedicated to men’s health, so much so that all other church activities, including the Saturday afternoon worship service, are canceled. Men from 15 shelters around the city were bused to the campus.\nAccording to the Rev. Leroy Miles, Associate Pastor of Sanctification, the goal is make Enon a “Man Cave” where men feel at complete ease. Seven barbers were on hand to give free haircuts. Television screens showed college basketball games, and on a larger screen a recording of the Philadelphia Eagles’ Super Bowl victory last month was being shown. Card games, dominoes and video games were taking place, and breakfast, lunch and dinner were all served.\n“We want them to chill out, watch the game, get to be a dude for a minute and disconnect from some of the challenges they may be facing in life,” Miles, adding that the church expected to screen 1,000 men, said. “The key is to remove every obstacle in front of them that would typically stand in the way of getting screening that in some cases could prove to save a life.”\nWhile the gap has been closing over the years, African-American men have the shortest life span on average of all races and genders (72.2). By contrast, white males live, on average, for 76.71 years\nDoctor Kristi Johnson, a member of Enon, serves as the medical lead for the seven-year-old program. In her third year as the medical lead, she says that the day is invaluable.\n“A lot of men don’t even have primary care physicians,” Johnson, of the Tower Health Medical Group, said. “So, if you have an opportunity to go and get screened this is something you should take advantage of. It gives them a preliminary look at their problems and lays out a blueprint for addressing them.”", "url": "https://apnews.com/3f90e53f79b84f738cd8f71af9a4012a"}