{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:14:24", "date_modify": "2020-05-04 20:14:24", "date_publish": "2018-03-04 21:47:00", "description": "Jackson Reinhardt, 18, of Rock Falls, is Rock Falls High School's January Student of the Month. His parents are Dan and Kim Reinhardt, and he has twin sisters, Elizabeth and Emma. Favorite...", "filename": "_7ea0d91959894a718b3ff9e3e3a67357_1588623264.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7ea0d91959894a718b3ff9e3e3a67357_1588623264.html", "title": "Rock Falls High School January Student of the Month: Jackson Reinhardt", "title_page": "Rock Falls High School January Student of the Month: Jackson Reinhardt", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jackson Reinhardt, 18, of Rock Falls, is Rock Falls High School’s January Student of the Month. His parents are Dan and Kim Reinhardt, and he has twin sisters, Elizabeth and Emma.\nFavorite class: Psychology. I enjoyed learning about the mind and human behavior. Also, I found it interesting learning about the different disorders people had.\nLeast favorite class: Math 3, my junior year. It was an insane struggle trying to remember every way to solve each problem.\nFavorite teachers: Kelly Schaefer for speech and Deena Gallentine for math. Mrs. Schaefer gave me the push to do speech team and plays, and made me enjoy speech a lot more than I use to. Mrs. Gallentine, because she pushed me to do well in math and always helped me understand problems more clearly.\nSchool activities in which you participate: I played basketball my freshman year. After that, I have been in Spanish Club, fall play, speech team, spring play, and thespian troupe.\nDo you have a job? I worked for Sauk Valley Detasseling in past summers.\nHow would you describe your friends? Funny and great people. They make my high school time so much better, and we’re always helping each other out.\nWhat will you do after high school? Go to Sauk Valley Community College for 2 years, then transfer to another college to pursue an education in the medical field.\nWhat is something you learned in high school you think you’ll never use? How to make a Newton’s Third Law car.\nWhat kind of music are you listening to? Anything on the radio.\nWhat’s one thing in your life you can’t do without? My electronics.\nWhat is your advice for surviving high school? Always try to stay motivated to finish and do well in classes. Also, ask for help because it really helps you out in the long run.\nIf you could change one thing about your school, what would it be? I would add an auditorium, because it would make plays a better experience for actors and the audience.\nWhat scares you? Heights.\nIf you could try any job for a day, what would it be? An astronomer, because I was always interested in space and I want to see how the many different things they do.\nIf you could go anywhere in the world for free, where would it be? Europe, to see all the different countries there are, as well as to just look around and try all the different food – especially Italian pizza.\nWhat is your proudest moment? When I was asked to join the thespian troupe.\nWho is your hero/role model? My great-grandfather, Harold Mikkelsen. Although he just recently passed away, he inspired me. He fought in the Korean War, and a few years ago he was able to go on the Honor Flight.\nWhat do you think your life will be like 10 years from now? I’ll be finished with school, doing the job I want to do and hopefully have a family of my own.\nWhat is your life’s philosophy? Do it now, so I do not have to worry about it later.\nWhat is something not everyone knows about you? I cannot snap my fingers.\nShout out to: My family, for motivating and supporting me throughout high school, as well as my friends.\nWhat is your favorite ...\nApp? Twitter\nFood? Cheese pizza\nGame? Bowling\nMovie? The “Star Wars” series\nTV show? “The Strain”\nSports team? Iowa Hawkeyes", "url": "https://apnews.com/7ea0d91959894a718b3ff9e3e3a67357"}