{"authors": ["Michael D Onofrio Tribune Staff Writer"], "date_download": "2020-05-04 20:07:54", "date_modify": "2020-05-04 20:07:54", "date_publish": "2018-04-07 04:00:00", "description": "Dante Jones listened as city officials gave updates on Wednesday about how they will manage the ongoing opioid epidemic in Philadelphia and encampments in Kensington. Jones was there because...", "filename": "_311db969b3ef490aa0fc8e08b63707a8_1588622874.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_311db969b3ef490aa0fc8e08b63707a8_1588622874.html", "title": "Philly opioid epidemic is expected to worsen", "title_page": "Philly opioid epidemic is expected to worsen", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dante Jones listened as city officials gave updates on Wednesday about how they will manage the ongoing opioid epidemic in Philadelphia and encampments in Kensington.\nJones was there because they were talking about him.\nAddicted to heroin for more than five years, the 43-year-old Philadelphia-native lives in the Emerald Street encampment under the Conrail tracks alongside a raft of others.\n“I got caught up in a situation and this is where I am,” Jones said. “I always knew needles were like the last stop: People die when they use needles.”\nWhile standing inside the Bevilacqua Community Center’s auditorium during the public meeting, Jones said he wanted to know what the city’s plans were and gauge the community’s reaction.\nThere were approximately 178 people living in encampments under overpasses at the intersections of Lehigh Avenue at Frankford and Kensington avenues, and Emerald and Tulip streets, said Eva Gladstein, deputy managing director of Health and Human Services.\nIn a city where more than 1,200 people died of drug overdoses in 2017, of which 330 are estimated to be African-Americans, Gladstein said the epidemic is expected to get worse.\n“Unfortunately, we believe that the opioid crisis still has not peaked,” Gladsten told the City Council’s Committee on Public Health and Human Services, which held the meeting. “It’s a national crisis and communities throughout the country are grappling with the epidemic.”\nUpwards of 200 people turned out to the meeting. At the hearing were Council members Cindy Bass, who is chair of the committee, Alan Domb, Derek Green, Helen Gym, Maria Quinones-Sanchez and Mark Squilla.\nMore services, more costs\nMore beds and services are on the way to combat the opioid crisis, and City Council members said they’re prepared to pick up the tab.\n“If it’s more money that’s required to take care of this [opioid] issue, we can make it available,” said Domb at the meeting. “I think we want to get this issue resolved.”\nIn the coming weeks, Gladstein said the city expects to roll out a pilot plan to manage two of the four encampments in Kensington.\nThe program, based on a model used in San Francisco, California, will assist between 60 and 80 people.\nThe plan will include intensive outreach and engagement, and the creation of a navigation center to provide housing for people and their belongings, according to Gladstein.\nThe plan will also offer a slew of services, including treatment and withdraw management.\nThe encampments are communities populated with people living in tents and makeshift shelters on the sidewalks and shooting heroin openly; they have been characterized as open-air drug markets.\nGladstein did not identify which encampments will be targeted as part of the program, or when the other encampments will be included.\n“This has been a really difficult, difficult situation,” she said. “Because we certainly feel for the residents of the community; the quality of life has really been damaged, and we understand their concerns. But also the people living in the encampments are people, and legally in order ask them to move, we have to be able to offer them options.”\nAdditionally, the city will fund the creation of 40 beds at a respite center at Prevention Point, the city’s only needle exchange, at a cost of at least $500,000. The beds will be available in the coming weeks.\nThe new beds will complement the 40 beds already offered at the respite center, which is a shelter-like housing accessible day and night for the homeless.\nOverall, at least 2,000 beds will be required to address the city’s street homelessness, which includes the encampments, Gladstein said.\nReaction\nCouncil members gave mixed reviews on the city’s response to the crisis thus far.\nQuinones-Sanchez criticized the Kenney administration’s response to the epidemic, saying “it is not enough,” and called for lowering barriers for those seeking help and increasing services.\n“This is not acceptable,” said Quinones-Sanchez, whose district includes some of the encampments. “This wouldn’t be happening anywhere else in the city.”\nSquilla said any plan to address the opioid issue in the city “must be a multi-pronged approach” that should include the entire community — both those in the encampments and homeowners.\n“We have to look outside the box on some things, and we have to look at other aspects of how we can treat this situation,” he added at the meeting, “but while we’re doing that … we have to look at the people that are surrounding being affected by what’s going on in the streets, too.”\nGym endorsed a safe-injection site in the city, more formerly known as comprehensive user engagement sites, or CUES.\n“It’s not only that they save lives, but it’s also that they help communities deal with a critical problem,” she said. “They take illegal drug use off the streets; they clean up areas that are filled to the brim with the paraphernalia and detritus of drug usage; they help coordinate services that drive attention to police, and advocates, and health experts and hospitals.”\nIn January, the city encouraged the development of safe-injection sites, which would not be operated by the city but rather private organizations. No safe-injection site location has been proposed.\nResidents who spoke at the meeting expressed frustration at the city’s slow approach to addressing the encampments and opioid epidemic, while others pressed for more services and assistance for those struggling with addiction.\nThe safe-injection sites were among the most contentious issue, with residents lining up for and against them. Some residents attended the meeting with signs which read: “Safe consumption sites = safer neighborhoods.”\nRosalind Lopez, a Kensington resident, rejected any proposal for safe-injection sites in her neighborhood, saying she was unconvinced they would reduce crime or drug sales.\n“To me, it’s just going to be another recovery house in the community,” Lopez said of the safe-injection sites. “So instead of reinventing and spending funds on something new, use what’s already there.”\nJones, who lives under in the Emerald Street encampment, said he would use a safe-injection site, adding that it would benefit the community.\n“You don’t want you and your kid to have to bypass someone shooting up on the street; you don’t want them stepping over needles, but yet you oppose a place that removes these people from the front of your door and puts them in a facility where your kid doesn’t have to see it,” Jones said.\nIn the short term, Jones added the encampments could benefit from two things that don’t take months to coordinate.\n“How about trash bags? It sounds so small but when you’re living in filth, when you’re living with 60 people without real sanitation, a Porta Potty and trash bags are so huge,” Jones said.", "url": "https://apnews.com/311db969b3ef490aa0fc8e08b63707a8"}