{"authors": ["Staff Report"], "date_download": "2020-05-04 20:13:28", "date_modify": "2020-05-04 20:13:28", "date_publish": "2018-08-28 00:00:00", "description": "DIVORCE DECREES • Mary Gerber, Wilkes-Barre; v. Barry J. Gerber Jr., Wilkes-Barre. • Cassandra Davis, Hanover Twp.; v. Matthew Davis, Wapwallopen. • Kimberly Ann Bogaczyk, Luzerne; v. David M....", "filename": "_1c29afb4fe0944e5a058f3e1f4f44cfa_1588623208.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1c29afb4fe0944e5a058f3e1f4f44cfa_1588623208.html", "title": "Court Notes 8/28/18", "title_page": "Court Notes 8/28/18", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DIVORCE DECREES • Mary Gerber, Wilkes-Barre; v. Barry J. Gerber Jr., Wilkes-Barre. • Cassandra Davis, Hanover Twp.; v. Matthew Davis, Wapwallopen. • Kimberly Ann Bogaczyk, Luzerne; v. David M. Bogaczyk, Luzerne. • Robert Heiser, Sweet Valley; v. Marilyn Heiser, Hunlock Creek. • Edward Hayes, Bear Creek; v. Nicole Hayes, Harveys Lake. PROPERTY TRANSACTIONS • Carol A. Price et al. to Wendy L. Morrison, $125,500; Sugarloaf Twp. • John H. Tindell et al. to Jeffrey P. Clemente, $230,000; Kingston. • Robert J. Stavish et al. to Ruben Liriano Jimenez et al., $88,000; Wilkes-Barre. • Kathleen Kwasny to Donald J. Werts et al., $79.200; Keith Street, Hanover Twp. • Helen Zukowski Irrevocable Grantor Trust et al. to Deborah Sue Powell, $116,000; Patriot Circle, Rice Twp. • Edward L. Patrick Jr. et al. to Ryan Hockenbury et al., $442,000; Rice Twp. • Geraldine M. Lewis to Charles F. Ward et al., $275,000; Union Twp. • John V. Morris III to Alfredo Garcia Alcala, $174,500; Wilkes-Barre. • Chester F. Dudick et al. to Dimitrios Mercado et al., $72,000; Forty Fort. • Molly J. Noone to Debra Rosado, $350,000; Dallas Twp. • Francis S. Cromer et al. to Ariel B. Mota et al., $122,700; Butler Twp. • Regina Hudock to Jayne A. Klenner, $109,000; Pittston Twp. • John P. Endler to Colleen A. Wood, $159,900; Plains Twp. • M&T Bank to Richard Rome, $285,500; Jackson Twp. • Richard Mikolosko et al. to Lindsay M. Sutkowski, $114,500; Forty Fort. • Nittinaben K. Patel et al. to Joseph W. Foose III et al., $177,000; Wright Twp. • Dous BB LLC to Ledwing Gutierrez, $88,500; Kingston. • Christine D. Ismail to Meir Rechtshafer et al., $195,000; Kingston. • Ronald Kraemer et al. to Edward Kopec Jr. et al., $246,400; Jackson Twp. • Walter A. Peregrim et al. to Michael Wyand, $200,000; Bear Creek Twp. • Evergreen Hill Estates Inc. to Carmine Development Inc., $400,000; Kirby Avenue, Fairview Twp. • James L. Robins et al. to Crystal Cohen et al., $139,900; Butler Twp. • Sandra Slako et al. to Mandy Guzman, $106,000; Hanover Twp. • David Radaszewski et al. to William G. Clifford et al., $75,000; Penn Lake Park. MORTGAGES • Marla Chepanonis to Residential Mortgage Services Inc., $96,000; Murray Street, Forty Fort. • Ryan P. Smith et al. from Mortgage Electronic Registration Systems Inc. et a., $127,920; Promontory Drive, Bear Creek Twp. • Thomas Harris IV from Mortgage Electronic Registration Systems Inc. et a., $129,883; Crown Drive, Franklin Twp. • Albert Forbes et al. from Mortgage Electronic Registration Systems Inc. et a., $88,271; Schuyler Avenue, Kingston. • Kevin L. Gaylord et al. from Choice One Community Federal Credit Union, $84,000; Lewis Avenue, Kingston Twp. • Jason Williams et al. from FNCB Bank, $200,000; Valley View Road, Franklin Twp. • Donald Sufleta et al. from Mortgage Electronic Registration Systems Inc. et al., $176,025; Moyer Road, Ross Twp. • Lynn Dretzel from Mortgage Electronic Registration Systems Inc. et al., $92,000; Beaver Brook Road, Hazle Twp. • Nicola A. Meckes et al. from Pennsylvania State Employees Credit Union, $164,336; Peat Moss Road, Dennison Twp. • Donald E. Frey et al. from Mortgage Electronic Registration Systems Inc. et al., $148,758; 4th Street, Nescopeck. • David A. Harbison et al. from Citizens Bank, $182,445; Burma Road, Sugarloaf Twp. • Neil J. Cooley et al. from Mortgage Electronic Registration Systems Inc. et al., $91,371; Packer Street, Dupont. • Raiana F. Nichols et al. from Mortgage Electronic Registration Systems Inc. et al., $121,900; East Benjamin Avenue, Conyngham. • CDRK LLC from PS Bank, $225,000; South Maple Avenue, Kingston. • Garrick F. Hakanson from Navy Federal Credit Union, $172,975; Wesland Avenue, Ross Twp. • Miguel Ruiz from Mortgage Electronic Registration Systems Inc. et al., $100,300; North Vine Street, Hazleton. • Gregory L. Harris et al. from Mortgage Electronic Registration Systems Inc. et al., $176,641; Dogwood Road, Butler Twp. • NEPA Property Investors LLC from First Keystone Community Bank, $112,500; Hedge Place, Kingston. • Darlin Jose Rodriguez Plasencio from Mortgage Electronic Registration Systems Inc. et al., $127,645; West Green Street, West Hazleton. • Bernard F. Sweeney Jr. et al. from Mortgage Electronic Registration Systems Inc. et al., $121,377; St. Johns Drive, Foster Twp. • Darla A. Culver from JP Morgan Chase Bank, $116,250; Reese Road, Union Twp. • Ronald K. Heller et al. from Pennsylvania State Employees Credit Union, $81,000; Prospect Road, Sugarloaf Twp. • Elizabeth Ann Adamski et al. from Mortgage Electronic Registration Systems Inc. et al., $101,190; East Grove Street, Pringle. • John Glowaniak et al. from Wells Fargo Bank, $137,765; Zack Street, Hanover Twp. • Julius Brand et al. from Citizens Bank of Pennsylvania, $100,000; Warren Avenue, Kingston. • Franklin A. Peralta-Herrera from Mortgage Electronic Registration Systems Inc. et al., $93,750; West 20th Street, Hazleton. • Carmen D. Gonzalez et al. from Mortgage Electronic Registration Systems Inc. et al., $75,605; Carey Avenue, Wilkes-Barre. • Absalon de los Santos et al. from Community Bank, $98,000; North Pennsylvania Avenue, Wilkes-Barre. • Nicholas Yatsko from Mortgage Electronic Registration Systems Inc. et al., $172,080; Sunshine Road, Huntington Twp. • Kelly Lynn Kramer et al. from Kelly Lynn Kramer et al., $96,187; Fremont Street, West Pittston. • Charles R. Suppon et al. from Mortgage Electronic Registration Systems Inc. et al., $203,000; Ryman Road, Dallas Twp. • Wendy L. Morrison from Mortgage Electronic Registration Systems Inc. et al., $75,000; West County Road, Sugarloaf Twp. • Jeffrey P. Clemente et al. from Fidelity Deposit & Discount Bank, $184,000; Reynolds Street, Kingston. • Ruben Liriano Jimenez et al. from Mortgage Electronic Registration Systems Inc. et al., $86,406; South Grant Street Wilkes-Batte • Nicholas Lohman et al. from Fidelity Deposit & Discount Bank, $235,500; Parkcrest Drive, Duryea. • Michael Zaremba et al. from Citizens Bank of Pennsylvania, $108,400; Cherry Drive, Nanticoke. • Charles J. Dieso Jr. et al. from Citizens Bank of Pennsylvania, $75,000; Hughes Street, Swoyersville. • Kathleen B. Hubbard from Mortgage Electronic Registration Systems Inc. et al., $140,000; Concord Drive, Laflin. • Kenneth Stronski Jr. et al. from Mortgage Electronic Registration Systems Inc. et al., $125,000; Breese Street, Wyoming. • Kenneth Stronski Jr. et al. from Mortgage Electronic Registration Systems Inc. et al., $125,000; Breese Street Wyoming. • MHP Ventures LLC from First Commonwealth Federal Credit Union, $450,000; Andrea Lane, Lehman Twp. • Donald J. Werts et al. from Mortgage Electronic Registration Systems Inc. et al., $80,902; Keith Street Hanover Twp. • Colleen Marie Haggerty et al. from Citizens Bank of Pennsylvania, $100,000; South Mountain Boulevard, Wright Twp. • Executive Land Development LLC from Honesdale National Bank, $1,720,000; Pennsylvania Route 315, Pittston Twp. • Executive Land Development LLC from Honesdale National Bank, $1,100,000; Pennsylvania Route 315, Pittston Twp. • Executive Land Development LLC from Honesdale National Bank, $660,000; Pennsylvania Route 315, Pittston Twp. • Ryan Hockenbury et al. from Citizens Bank, $353,600; Osprey Drive, Rice Twp. • Aldredo Garcia Alcala from Benchmark Mortgage, $171,338; Wyoming Street, Wilkes-Barre. • Debra Rosado from Fidelity Deposit & Discount Bank, $100,000; Kingswood Drive, Dallas Twp.", "url": "https://apnews.com/1c29afb4fe0944e5a058f3e1f4f44cfa"}