{"authors": ["Zach Barrett News-Press Now"], "date_download": "2020-05-04 20:28:26", "date_modify": "2020-05-04 20:28:26", "date_publish": "2018-01-16 03:00:00", "description": "Whipping wind and below-freezing temperatures are forecasted to creep into our area in the next couple of days. This poses a risk of hypothermia, not only to people, but pets. Around the...", "filename": "_e9d37bb435f546a1bd935f9fdb68591b_1588624106.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e9d37bb435f546a1bd935f9fdb68591b_1588624106.html", "title": "Cold temperatures just as deadly for pets as people", "title_page": "Cold temperatures just as deadly for pets as people", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Whipping wind and below-freezing temperatures are forecasted to creep into our area in the next couple of days. This poses a risk of hypothermia, not only to people, but pets.\nAround the city, owners may tether dogs outside in all kinds of conditions, even these dangerously cold temperatures. Some may think the animals’ fur will protect them from the cold, but Dr. Bradley Reynolds from East Hills Veterinary Clinic said these conditions are just as dangerous for pets.\n“You get that wind chill going and it’s going to lead to hypothermia in those guys just like it will with us,” Reynolds said.\nReynolds said he has several pets come into his office suffering from hypothermia.\n“You can have dogs and cats that lose the tips of their ears,” he said. “They’ll come in a few days later and their ears are all black.”\nReynolds is not the only one that has noticed the scary trend of pets being left out in these frigid conditions. Tami Claycomb and her husband, Richard, are animal activists in the area. They said they have been alerted to recent animal deaths due to the cold.\n“We witnessed a frozen dog about a week ago. You want to talk about something that is heart-wrenching,” Tami said.\nThe Claycombs began helping with this problem by providing proper dog houses to pet owners who appear to have a dog in need. She said that sometimes the couple is contacted about the houses, but sometimes they help when they notice an animal in a dangerous situation.\n“I would call Rich and say, ‘Hey, oh my gosh, come help out.’ So, he would take a dog house or hay or whatever it needed to be. That’s how this all started,” Tami said.\nRichard said he has seen instances of dogs being left in the cold more than he would like.\n“Doing what I do, taking these dog houses around and the hay and stuff like that, I see this all the time,” Richard said. “I see it more and more. I’ve been doing this for about five years now.”\nTo combat low temperatures, not just any dog house will do. There are preferred types of dog homes that give pets the best chance to survive, if they must be left outside.\n“(It needs) to have four walls and off the ground a little. Have a solid floor, not on dirt, and have some kind of bedding that will keep dry,” Tami said.\nThe Claycombs believe the only way to curb this problem is if the city implemented a tether ordinance that states dogs can’t be out in certain weather or at certain times of the day.\n“There has to be an ordinance,” Tami said. “If they can pass this ordinance then you have to give people time to get things in order. You can’t just go out in a month and say ‘OK, here’s tickets.’”\nTami and Richard will be speaking at City Hall on Tuesday at 7 p.m. on the third floor to present their case for this ordinance. They also added they are working on creating a task force that would be intended to improve the lives of local animals.\nOverall, Reynolds said the trick to keeping pets safe in this weather is fairly simple.\n“Go out there, let them do their stuff and then come right back inside,” Reynolds said. “Just because they have a heavy coat or something, things like their ears and feet can get issues just like we can.”", "url": "https://apnews.com/e9d37bb435f546a1bd935f9fdb68591b"}