{"authors": ["Gabriella Muñoz The Washington Times"], "date_download": "2020-05-04 20:28:53", "date_modify": "2020-05-04 20:28:53", "date_publish": "2018-09-27 10:36:34", "description": "Deborah Ramirez, the second woman to accuse Supreme Court nominee Judge Brett M. Kavanaugh of sexual misconduct, sent a message through her lawyer to Christine Blasey Ford on Thursday before the...", "filename": "_98c79e29184c5856b493aedaa7db75a3_1588624133.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_98c79e29184c5856b493aedaa7db75a3_1588624133.html", "title": "Deborah Ramirez sends message to Christine Blasey Ford ahead of hearing", "title_page": "Deborah Ramirez sends message to Christine Blasey Ford ahead of hearing", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Deborah Ramirez, the second woman to accuse Supreme Court nominee Judge Brett M. Kavanaugh of sexual misconduct, sent a message through her lawyer to Christine Blasey Ford on Thursday before the Senate Judiciary Committee hearing on her allegations.\nMs. Ramirez said in a statement, “They want us to feel alone and isolated but I’m there wrapping my arms around you and I hope you feel the people of this nation wrapping their arms around all of us.”\nFrom Debbie Ramirez: “Thinking of you today, Christine. They want us to feel alone and isolated but I’m there wrapping my arms around you and I hope you feel the people of this nation wrapping their arms around all of us. Holding you up in spirit.” John Clune (@CluneEsq) September 27, 2018\nMs. Blasey Ford came forward publicly on Sept.16 in a Washington Post article, in which she alleged Judge Kavanaugh assaulted her at a party when they were both in high school.\nA week later, Ms. Ramirez’s allegations were published in The New Yorker. She claims that Judge Kavanaugh exposed himself to her at a college party when they were both intoxicated.\nJudge Kavanaugh has denied all allegations.", "url": "https://apnews.com/98c79e29184c5856b493aedaa7db75a3"}