{"authors": ["Matthew Toth Mtoth Dailyamerican.Com"], "date_download": "2020-05-04 20:18:00", "date_modify": "2020-05-04 20:18:00", "date_publish": "2018-12-11 03:45:00", "description": "Boswell Borough officials are looking to deal with another blighted building that may soon share the fate of a collapsed structure along Morris Avenue. A house at 425 Center St. began to...", "filename": "_d751e081d41c4efe88b2f7467d85d48d_1588623480.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d751e081d41c4efe88b2f7467d85d48d_1588623480.html", "title": "Boswell hopes to prevent another building collapse", "title_page": "Boswell hopes to prevent another building collapse", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Boswell Borough officials are looking to deal with another blighted building that may soon share the fate of a collapsed structure along Morris Avenue.\nA house at 425 Center St. began to collapse in November. Borough officials said it needs to be demolished for health and safety. The borough has already spent $48,572 for the demolition and cleanup of a hardware store and bank building along Morris Avenue that collapsed in May. Council President Mary Ann DeLuca, who lives next door to the blighted property, said half the roof is gone.\n“In about a month or so that’s going to come down,” she said.\nBorough officials have been working with the Somerset County Redevelopment Authority to gain access to the site. In a telephone call with the Daily American Monday night, authority Executive Director Steve Spochart said officials are trying to work out the logistics of getting onto the property.\n“We’ll work with them as best as we can to prioritize and take the steps the (borough) needs to, so something like the one on Morris Avenue doesn’t happen again,” he said.\nSpochart said the borough could use federal Community Development Block Grant funding to pay for the demolition of the Center Street building, but there are a lot of things officials need to do to be eligible for funding.\n“There’s things the borough needs to do on their end to get ownership of those properties, which doesn’t happen overnight,” he said.\nThe county has a demolition fund for blighted properties that county officials started last year that is up to $70,000, enough for possibly one demolition, according to officials.\nBorough council members are still seeking $50,000 and control of the Morris Avenue property, currently owned by Jolee Properties. The municipality is asking for the costs of cleanup, demolition and legal fees.\n“We’ll never recoup the money we put in, to tear that place down, but at least it’s gone,” DeLuca said.\nThe brick building, located near Main Street, fell down in May after months of deterioration. No one was injured. Crews from Berkey Excavating demolished the dilapidated buildings.\nOfficials also finalized their budget Monday, passing a $270,290 budget for 2019 that keeps taxes at 7 mills despite the borough’s blight problem. There are nine blighted properties in Boswell that need to be demolished because of health and safety concerns, according to borough officials.\nDeLuca said officials hope to have control of the Morris Avenue property soon.\n“Blight is blight, I don’t care where you go,” DeLuca said. “You go to Berlin, apparently they have the same problem too, so they are not unique.”", "url": "https://apnews.com/d751e081d41c4efe88b2f7467d85d48d"}