{"authors": ["Grant Traylor The Herald-Dispatch Gtraylor Herald-Dispatch.Com"], "date_download": "2020-05-04 20:15:40", "date_modify": "2020-05-04 20:15:40", "date_publish": "2018-09-15 09:55:33", "description": "HUNTINGTON — Normally, football is a sport played on a 100-yard field. On Friday night, Huntington High cut that field in half. Huntington High had five of its six first-half drives...", "filename": "_de380fa09cc847dc8fed487fc9aba6e0_1588623340.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_de380fa09cc847dc8fed487fc9aba6e0_1588623340.html", "title": "Highlanders flip the field on Woodrow Wilson, win 47-14", "title_page": "Highlanders flip the field on Woodrow Wilson, win 47-14", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON — Normally, football is a sport played on a 100-yard field.\nOn Friday night, Huntington High cut that field in half.\nHuntington High had five of its six first-half drives start at midfield or better and the Highlanders used a balanced offense to earn a 47-14 win over Woodrow Wilson at Bob Sang Stadium.\n“Field position is always huge,” Huntington High coach Billy Seals said. “That’s something we’ve harped on because we didn’t feel like the first three weeks, we came out and took care of it. We had made the offense go 80 or 90 yards and that’s tough. We came out ready to play tonight and I was happy to see that.”\nIn all, 26 of Huntington High’s 32\nfirst-half plays came from inside Woodrow Wilson territory.\nThe tone for the game was set on the second play from scrimmage when Huntington High’s defense forced Woodrow Wilson’s Micah Hancock into a fumble, setting the Highlanders up at the 26-yard line.\nThree plays later, Tajhan Blackwell found Kris Brown for a 24-yard touchdown to open the scoring less than two minutes into the game.\nIt set the tone for Blackwell’s big game as he threw for three scores and ran for another. Blackwell was 8 of 14 for 176 yards while spreading the ball to his receivers well.\n“For us to be successful and to be where we want to at the end of the year, we have to be able to do that,” Seals said. “I thought we did a nice job of running good routes in the middle of the field and on vertical stuff. We did a nice job of mixing it up.”\nIn addition to Brown’s scoring reception, Blackwell found Jahronimo Mitchell in the middle of the field for a 33-yard scoring strike and later added a 6-yard scoring run with 49 seconds left before the half that gave the Highlanders a 34-0 lead.\nOn the first drive of the second half, Blackwell hooked up with Brown again for a 27-yard score on a play in which Brown made a nice double-move in single coverage on the outside and gained separation before hauling in the pass.\nBrown finished with three receptions for 73 yards — two of which went for scores.\nWhile the passing game got on track, the rushing attack kept its momentum from last week’s win over George Washington.\nThe Highlanders had a pair of 100-yard rushers as Ty Wilcoxon went for 156 yards and two scores while Malik Johnson rushed for 100 yards — all in the second half — and a 2-yard score.\nDespite the win, Seals wasn’t fully pleased with his team’s execution on special teams snaps and mental mistakes that led to penalties.\nThe Highlanders had a pair of bad snaps on extra points and a bad snap on a punt helped lead to Woodrow Wilson’s first score, which was a 3-yard run from Peyton Shehan with 3:33 left in the third quarter.\nHuntington was penalized 14 times for 136 yards in the contest.\n“We addressed that after the game,” Seals said. “That’s ridiculous. We can’t have that.”\nShehan later connected with Martay Lee, who broke a tackle and sprinted 68 yards for a score late in the fourth to set the final score.\nThe Flying Eagles struggled to get anything going offensively, staying under 100 yards for the contest until Lee’s 68-yard score. Woodrow Wilson also had three turnovers.", "url": "https://apnews.com/de380fa09cc847dc8fed487fc9aba6e0"}