{"authors": ["Shawn Gude", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:47", "date_modify": "2020-05-04 19:50:47", "date_publish": "2018-05-14 00:00:00", "description": null, "filename": "2018_05_the-tragedy-of-bayard-rustin_1588621847.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/05/14130842/Rustin-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_05_the-tragedy-of-bayard-rustin_1588621847.html", "title": "The Tragedy of Bayard Rustin", "title_page": "The Tragedy of Bayard Rustin", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Staughton Lynd was incensed. Here was the anti–Vietnam War movement, growing into something that could challenge LBJ’s murderous campaign, and Bayard Rustin — Bayard Rustin! — goes and sullies the largest antiwar protest to date, accusing it of harboring Communist elements. Lynd, a Yale professor and prominent antiwar activist, decided to make his fury public.\n“You must know in your heart that your position betrays your essential moralism over the years,” Lynd wrote in an open letter to Rustin in April 1965. “The lesson of your apostasy on Vietnam appears to be that the gains for American Negroes you advise them to seek through coalition within the Democratic Party comes at a price.… The price is to make our brothers in Vietnam a burnt offering on the altar of political expediency.”\nAcidic words not exhausted, Lynd took to the pages of Liberation , a radical publication that Rustin himself had helped found, to further excoriate this “labor lieutenant of capitalism” that was in “coalition with the Marines.”\nUnderneath the outrage had to be a sense of hurt. Rustin — in addition to his decades toiling in the civil rights trenches — had opposed World War II and the Korean War on pacifist grounds and long pronounced his socialist convictions. He’d befriended anticolonial leaders in Africa and forged ties between liberation struggles and pacifists. How could he now turn around and give ammunition to the forces of American imperialism, red-baiting a movement actually fighting it?\nLynd wasn’t alone in asking such pointed questions. “Perhaps no one in American politics was so maligned by radicals in the peace movement asBayard Rustin,” one biographer notes.\nRustin never out and out supported the Vietnam War. But his fidelity to a particular strategy of radical trans-formation led him to mute his criticisms even as antiwar sentiment built to a deafening crescendo.\nBayard Rustin was born to a black Quaker family in West Chester, Pennsylvania on March 17, 1912. Raised by his grandparents, Rustin’s talents were recognized from a young age. He was a handsome track star, a gifted student, a precocious tenor. But it was through activism that Rustin would distinguish himself.\nFollowing a brief association with the Young Communist League, Rustin stepped into the milieus that would mold him for the next couple decades: the pacifist movement and the civil rights struggle.\nRustin’s first major role was as a youth organizer for A. Phillip Randolph’s abortive 1941 March on Washington, which ultimately forced Franklin Roosevelt to issue an executive order barring discrimination in the defense industry. From there, as a field secretary for the Fellowship of Reconciliation (FOR), Rustin threw himself into the unpopular task of spreading the pacifist gospel. He traveled to college campuses, organized pacifist groups, visited imprisoned conscientious objectors, helped Japanese Americans held in internment camps, and schooled people on the ins and outs of nonviolent direct action.\nIn the first eight months of 1942 alone, Rustin logged ten thousand miles and traversed twenty states. Speaking in a studied British accent — an idiosyncrasy he’d consciously picked up as a boy — Rustin would lay to rest the nagging doubts of skeptics and summon the moral force of absolute nonviolence.\nHis work with FOR also took him into the crucible of the early civil rights struggle. Years before the movement could warrant the name, Rustin participated in sit-ins at segregated establishments and “freedom rides” on segregated buses, all the while making the case for non violent resistance. Over the subsequent decades, he would advise Martin Luther King Jr behind the scenes on nonviolent tactics, and — linking freedom struggles at home with those abroad — support anticolonial movements in India (through the Free India Committee), Ghana (where he conferred with Kwame Nkrumah), and Nigeria (where he met with Nnamdi Azikiwe). He was a fierce internationalist, a socialist critic of both major world powers, a dogged antiwar activist who was jailed for his principles.\nIn the early 1960s, when planning for the March on Washington began, it was natural that Rustin would be tapped to lead it. Rustin, a gay man, had experienced homophobic bigotry that resulted in a number of career setbacks. But Randolph trusted him completely. After the successful demonstration, Life magazine splashed the visages of Rustin and Randolph across its cover and praised the pair of socialists as the “leaders” of the march. For once, Rustin wasn’t in the background.\nBy the mid-1960s, the Civil Rights Movement had won a series of hard-fought battles against segregation in the South — battles that culminated in the passage of the 1964 Civil Rights and 1965 Voting Rights acts. With de jure Jim Crow all but toppled, Rustin and others in the move-ment turned their sights to the economic forces ravaging the lives of workers and poor people.\n“The Negro today,” Rustin wrote in an influential 1965 piece, “From Protest to Politics”, “finds himself stymied by obstacles of far greater magnitude than the legal barriers he was attacking before.… They are the result of the total society’s failure to meet not only the Negro’s needs but human needs generally.”\nAttacking these ills would send the movement careening directly toward the foundation of the Ame-rican economy. It demanded nothing less than the conquest of political power. A formidable task — and the black voter couldn’t do it alone. For Rustin, that meant solidifying the coalition “which staged the March on Washington, passed the Civil Rights Act, and laid the basis for the Johnson landslide — Negroes, trade unionists, liberals, and religious groups.”\nAs his strategy took shape, the Democratic Party loomed especially large. At the time, the party housed both Southern racists (Dixiecrats) and Northern liberals. Rustin — as well as others in and around the Socialist Party — saw an opening. If liberals and labor could take over the party, he reasoned, it would become comparable to a European social-democratic party — a coherent social force with the interest and ideo-logy to push through massive investments in health, education, and employment.\nTheir strategy was called realignment. Their plan was the “Freedom Budget.” Released in 1966 under the auspices of the Rustin-led, AFL-CIO–funded A. Phillip Randolph Institute — and bearing the signatures of a wide range of civil rights leaders and liberal luminaries — the eighty-four-page document laid out a radical plan to lift up the immiserated. Poverty would be banished within a decade. Full employment would be the law of the land. The US’s political economy would be transformed.\nFatefully, the budget also declined to take a position on the Vietnam War.\nTwo months before the document’s launch, Socialist Party leader Norman Thomas had fretted about the omission: “I don’t see how we can avoid reference to what effect the Vietnam War may have on the Budget,” he commented. “There is already a ‘real’ as well as a psychological strain on the economy due to the war.” Others, including Rustin, argued that disagreements over the war shouldn’t scuttle the coalition behind the Freedom Budget. The US could have its guns and its butter too, even if Rustin preferred to dispense with its guns.\nHe seems to have sold his soul completely to the Democratic Party.\nBut over the next couple years, as the body bags piled up and protests erupted, the war assumed center stage and the Freedom Budget receded from the political agenda. The AFL-CIO leadership, never much interested in offering more than nominal support, grew even less willing to prioritize it. Many liberal congressmen — the elected officials who were supposed to compose the majority of this newly progressive Democratic Party — dismissed the plan as unrealistic.\nWithout a mass movement to pressure recalcitrant legislators, Rustin and his compatriots had little recourse but to try to paper over tensions and hope for the best. In 1964, they had seen in Johnson’s resounding victory the coming of a new majority, one that would usher in the second phase of the Civil Rights Movement. They would stick with LBJ and liberal allies to the end, even if it meant staying on the antiwar sidelines.\nThough less important, another factor informed Rustin’s actions: his deep anticommunism. Like others in the realignment camp, Rustin shook his head at the demonstrators who cheered for a Vietcong victory. His democratic socialism couldn’t countenance the elevation of ideas he saw as ending in tyranny. And he couldn’t see a movement attracting a mass following if it permitted such stances in its ranks.\nAlready many young radicals had written Rustin off. After all, this was the man who had accepted the notorious compromise at the 1964 Democratic National Convention, which failed to fully seat delegates from the anti-segregationist Mississippi Freedom Democratic Party. “He seems to have sold his soul completely to the Democratic Party,” civil rights activist Julian Bond lamented at the time.\nRustin’s jabs at antiwar activists seemed to them just further confirmation of his ignominious drift.\nMore sympathetic observers have portrayed Rustin’s shift as the inevitable result of descending into the muck of policymaking. As he moved from “protest to politics” — as he migrated from the ethereal realm of nonviolent activism to the corrupting world of political sausage making — purity had to go.\nThis shortchanges Rustin’s brilliance. No political naïf, he thought deeply about the landscape of US politics — what fissures in elite circles could be widened and exploited, what actors had the interest and heft to push through concrete programs, what strate-gies could improve the lives of workers and the oppressed while opening up more radical possibilities. He knew politics meant coalition building and compromise. But it’s a mistake to assume that hardheaded politics demanded Rustin’s quiescence as more and more bombs went off.\nAs scholars Paul Le Blanc and Michael Yates point out, the strategy Rustin himself laid out in “From Protest to Politics” didn’t propose dropping protest entirely in favor of backroom dealmaking. Left unresolved, however, was whether street politics would play an essentially adjunct role to a Democratic Party freed of Dixiecrats, or whether it would provide its own impetus, challenging party bosses up to, and including, Johnson himself.\nSame with the labor movement. “I certainly do not look for an alliance which would include the AFL-CIO per se,” Rustin wrote in 1964. But by the time the Freedom Budget was unveiled and the Vietnam War had stepped up in earnest, Rustin had drifted closer to pro-war labor leaders.\nMartin Luther King Jr publicly denounced the Vietnam War. More progressive unions grew increa-singly antiwar. Opposition spread from the campuses to many working-class constituencies. Yet Rustin stayed the course.\nAnd therein lies the tragedy of Bayard Rustin: one of the most adept tacticians of his generation, one of the most impressive American socialists of the twentieth century, ultimately saw the best in the Democratic Party and the worst in the antiwar movement — not in service of a budget that transformed the country but a war that ended only after more than a million perished.", "url": "https://www.jacobinmag.com/2018/05/the-tragedy-of-bayard-rustin"}