{"authors": ["Zachariah Durr"], "date_download": "2020-05-04 20:22:41", "date_modify": "2020-05-04 20:22:41", "date_publish": "2018-01-19 16:32:03", "description": "Cleveland water tower may be getting a brand new look (video) CLEVELAND, Ohio -- The Garrett Morgan power surge tower that stands just off the Detroit Shoreway by the West 45th Street exit...", "filename": "_17c9ecc031d648a69a6cbc0fd0968d6e_1588623761.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_17c9ecc031d648a69a6cbc0fd0968d6e_1588623761.html", "title": "Cleveland water tower may be getting a brand new look (video)", "title_page": "Cleveland water tower may be getting a brand new look (video)", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cleveland water tower may be getting a brand new look (video)\nCleveland water tower may be getting a brand new look (video)\nCLEVELAND, Ohio -- The Garrett Morgan power surge tower that stands just off the Detroit Shoreway by the West 45th Street exit has stood near Lake Erie for over 40 years. A familiar sight to many commuters, the tower is painted white, except for a simple “City of Cleveland Est. 1796” written on its side.\nThat may be changing soon.\nSpearheaded by LAND Studio in conjunction with the Cleveland Water Department, the tower may be joining other locations in the Ohio City area to be painted with a large-scale mural. Funded by private donors, talks are underway for it to be transformed by Spanish artist Sam3, who has worked worldwide in creating paintings that integrate art into their surroundings. His artwork normally features human silhouettes and interweaving linework, with a playful, dream-like tone.\nA community meeting was held Thursday to hear from members of the community, getting their thoughts on what the water tower’s look and message should reflect. Sketches of possible water tower designs were also on display, although the process of a design was “just beginning,” according to LAND.\nWork on the tower would optimally begin in the summer, correlating to the structure’s cleaning and maintenance, with the artwork being the last component. This would be dependent on permits and working with the city on final approval.\nIf all goes to plan, the Cleveland landmark will have a brand new look.", "url": "https://apnews.com/17c9ecc031d648a69a6cbc0fd0968d6e"}