{"authors": ["John Spoto"], "date_download": "2020-05-04 20:26:06", "date_modify": "2020-05-04 20:26:06", "date_publish": "2018-01-14 14:05:51", "description": "In our previous article, we talked about how the increase in the nation's elderly population has placed much of the responsibility for long-term care, squarely onto family members. Now let's...", "filename": "_cb79a841b2bc4a4d87ea9a8b61e5bd11_1588623966.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cb79a841b2bc4a4d87ea9a8b61e5bd11_1588623966.html", "title": "The Impact of Elder Caregiving", "title_page": "The Impact of Elder Caregiving", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In our previous article, we talked about how the increase in the nation’s elderly population has placed much of the responsibility for long-term care, squarely onto family members. Now let’s discuss the emotional, physical and financial impact this caregiving has on families.\nFirst, there is a growing evidence that for the chronically ill, what matters most is the relational rather than the functional aspects of their care. Functional refers to the quality and efficiency of the clinical care. Relational relates to the elder person’s sense of dignity including being listened to, being involved in decisions about their care and being emotionally supported. Caring for frail family members at home can result in improvement in the patients’ lives and better health outcomes, a higher overall sense of well-being and a slower rate of mental and physical decline.\nThe second line of research has focused on the effects on those providing the care. Studies have shown that while the patient benefits from this personal attention, it is often to the detriment of the caregiver. The work can be physically exhausting and emotionally draining, involving responsibilities like managing activities including administering medications and navigating a complex health care system. It also includes personal care and household management needs.\nFurthermore, as the health conditions of the elderly worsen, the demands on the caregiver intensify, especially if the caregiver is elderly and coping with their own health limitations or an adult child juggling their family and job responsibilities. Not surprisingly, caregivers suffer from high rates of anxiety, depression, social isolation, and health problems. Caregiving is known as a “life deferred.” Sleep, good nutrition, and time spent with other people are often sacrificed tending to a loved one’s needs.\nWhile the health effects of long-term caregiving are significant, so too is the economic impact. It is vitally important that the patient and caregiver prepare financially for the task. Even when family members bear the brunt of the daily responsibilities, certain outlays are unavoidable and substantial. Expenses for out-of-pocket medication, supplies and special equipment can easily total several thousand dollars each year. Also, if the physical demands of the work exceed those of the caregiver, finding outside help may be necessary. Hiring even a low-skilled home health aide for just two hours a day could easily cost $30,000 per year.\nThe true financial impact on caregivers, however, extends far beyond the out-of-pocket expenses and can negatively affect employment. The compromises required, including a reduced schedule and passed up opportunities for overtime or promotions, can adversely affect a career, resulting in lost income, smaller retirement savings and reduced pension and Social Security benefits. One study conducted by the National Center on Women and Aging estimated that on average, caregivers lose almost $650,000 over a lifetime in lower pay and other benefits.\nAlthough much of the discussion around caregiving is framed in terms of the burdens and difficulties, many caregivers perceive their role as personally rewarding despite the sacrifices. Caring for an elderly spouse or parent seems to satisfy the basic human desires help those who are vulnerable and improve the quality of life of a loved one. The process can strengthen family bonds and perhaps even model the kind of behavior that they hope to instill in their children and grandchildren.\nLongevity is a blessing in many respects and allows us to spend more time with our family members throughout the course of our lives, however, it is often accompanied by the realities of age-related limitations and illness. Because of financial constraints and shortcomings in our country’s long-term care system, elderly Americans in failing health will continue to rely primarily on family for assistance. For caregivers, it can be a difficult proposition. However, with proper financial preparedness, one aspect of this challenge can be alleviated, allowing caregivers to maintain a higher quality of life for themselves while also providing better care for their loved ones.\nJohn Spoto is the founder of Sentry Financial Planning in Andover and Danvers. For more information, call 978-475-2533 or visit www.sentryfinancialplanning.com .", "url": "https://apnews.com/cb79a841b2bc4a4d87ea9a8b61e5bd11"}