{"authors": ["Bradford Richardson The Washington Times"], "date_download": "2020-05-04 20:21:59", "date_modify": "2020-05-04 20:21:59", "date_publish": "2018-05-20 13:44:47", "description": "There could have been more than one FBI informant snooping on the Trump campaign, House Intelligence Committee Chairman Devin Nunes said on Sunday, but we do not know because the Justice...", "filename": "_b4883915e69c4508a6a95f1fbd9d9eff_1588623719.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b4883915e69c4508a6a95f1fbd9d9eff_1588623719.html", "title": "Devin Nunes says multiple FBI informants in Trump campaign possible", "title_page": "Devin Nunes says multiple FBI informants in Trump campaign possible", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "There could have been more than one FBI informant snooping on the Trump campaign, House Intelligence Committee Chairman Devin Nunes said on Sunday, but we do not know because the Justice Department has stonewalled congressional requests for documents outlining the impetus for the investigation.\nMultiple reports have identified Stefan Halper, 73, a Cambridge professor with ties to American and British intelligence, as the FBI informant who snooped on the Trump campaign over the summer.\nMr. Nunes said he may not be the only one.\n“We asked for specific documents that we have still not received from the Department of Justice,” Mr. Nunes said on Fox News’ “Sunday Morning Futures.” “So they continue to leak out things about this informant, and we don’t know if there’s one informant or more informants because there’s so much out there now. It’s really getting tough to follow, and all we’re asking for is give us the documentation that you used to start this investigation.”\nThe New York Times reported on Friday that an “American academic who teaches in Britain” met with Trump campaign advisers Carter Page and George Papadopoulos in the summer of 2016.\nThe informant was later identified in media reports as Mr. Halper.\nIn a series of tweets over the weekend, President Trump equated the arrangement to spying and said it could be the “all time biggest political scandal!”\nIf the reports are true, Mr. Nunes said it’s a “red line” that the FBI cannot be allowed to cross again.\n“If they paid someone, it’s an absolute red line, and this is over with,” he said. “I mean, there is no possible way that we should be allowing, even if it was legal, we should never allow this in this country. Congress should not allow for anything like this to ever occur again to any political campaign, if it in fact happened.”\nMr. Nunes also questioned the timing of the media reports about the FBI’s informant.\nHe said the Justice Department invited him and Rep. Trey Gowdy, South Carolina Republican, to a meeting on Friday, which the congressmen declined to attend after information from a previous meeting was leaked to the press.\n“They were trying to get Mr. Gowdy and I to go on Friday to the Department of Justice for supposedly another briefing,” Mr. Nunes said. “We said, ’Look, unless we’re going to get documents’we found out Thursday night they were not going to provide documents, so therefore we’re not going to go. Now, if you look what happened on Friday night, probably the mother of all leaks of all time to two major newspapers that came out late Fridaynight. Now had Mr. Gowdy and I went to that meeting, you can bet they would have tried to pin that on us.”", "url": "https://apnews.com/b4883915e69c4508a6a95f1fbd9d9eff"}