{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:29:11", "date_modify": "2020-05-04 20:29:11", "date_publish": "2018-12-10 05:16:00", "description": "Breaking down the Bears' 15-6 win against the Los Angeles Rams on Sunday night at Soldier Field. THREE MOMENTS THAT MATTERED 1. Coming out halftime the Bears found a way to put two...", "filename": "_9114db5532274ebc87aef851004e0dc9_1588624151.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9114db5532274ebc87aef851004e0dc9_1588624151.html", "title": "Breaking down the Bears' 15-6 win over the Rams", "title_page": "3 and out: Breaking down the Bears' 15-6 win over the Rams", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "3 and out: Breaking down the Bears’ 15-6 win over the Rams\nBreaking down the Bears’ 15-6 win against the Los Angeles Rams on Sunday night at Soldier Field.\nTHREE MOMENTS THAT MATTERED\n1. Coming out halftime the Bears found a way to put two points on the board with Eddie Goldman dragging down Rams QB Jared Goff for a safety. But the play before, with Leonard Floyd wrapping up Todd Gurley for a 5-yard loss on first down, was the one that put the Bears in position to pick up the safety.\n2. Who knew that Akiem Hicks’ rushing touchdown last week against the Giants was just the beginning? This time, the Bears lined up Hicks in the backfield only to fake the handoff with Mitch Trubisky finding offensive lineman Bradley Sowell for a 2-yard TD in the third quarter.\n3. There were plenty of turnovers to choose from, but we’ll go with Kyle Fuller’s interception late in the third quarter. Down 15-6, the Rams were in scoring position after picking off Trubisky, but the Bears got the football back one play later with Fuller’s seventh interception of the season.\nTHREE THINGS THAT WORKED\n1. Neutralizing Aaron Donald. The Rams All-Pro defensive lineman entered the game with 16 1/2 sacks. He didn’t have much of a chance to improve on that number Sunday. Rookie lineman James Daniels held his own, and the Bears did a terrific job with double teams to slow Donald down.\n2. Pressuring Goff. The Rams were so concerned with Khalil Mack, who still managed another strip sack, that the other Bears defenders routinely found themselves in one-on-one situations. The Bears, including Goldman, Akiem Hicks and Roy Robertson-Harris kept the pressure up and routinely forced Goff into regrettable throws.\n3. Taking Gurley away. The Bears’ run defense has been stout all season, but Gurley was their toughest test to date. Gurley entered the fourth quarter with seven rushing yards on seven carries. In short, the Bears made the Rams’ dynamic offense incredibly one dimensional.\nTHREE THINGS THAT DIDN’T\n1. Trubisky’s accuracy. We’re not sure if his shoulder is still bothering him, if there was some rust or if it was just an off game, but Trubisky’s first game action since Nov. 18 wasn’t pretty. The second-year QB completed only 16-of-30 attempts, threw three interceptions and routinely overthrew receivers.\n2. Red-zone penalties. The Bears had to settle for the field goal early in the second quarter despite having first-and-goal following Roquan Smith’s interception. Back-to-back penalties sent the Bears all the way back to the 19-yard line. They have to execute in the red zone.\n3. Another miss for Cody Parkey. The game was well in hand when Parkey’s field goal sailed wide in the fourth quarter, but his troubles remain a concern.\nWHAT’S NEXT?\nThe Bears welcome Aaron Rodgers and the Green Bay Packers to Chicago next Sunday. The Bears will be trying to avenge their 24-23 loss from Week 1.\nVisit ProFootballWeekly.com | View Latest E-Edition", "url": "https://apnews.com/9114db5532274ebc87aef851004e0dc9"}