{"authors": ["Editorial Board"], "date_download": "2020-05-04 20:21:47", "date_modify": "2020-05-04 20:21:47", "date_publish": "2018-07-26 00:00:00", "description": "Among the many factors that make local governance needlessly expensive in Pennsylvania is that the commonwealth has 500 school districts, in addition to about 2,500 municipal governments and...", "filename": "_dfb5906e9b5642fea6a7459e6ac14631_1588623707.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dfb5906e9b5642fea6a7459e6ac14631_1588623707.html", "title": "Consolidation Could Reduce School Costs Consolidation Could Reduce School Costs", "title_page": "Consolidation Could Reduce School Costs Consolidation Could Reduce School Costs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Among the many factors that make local governance needlessly expensive in Pennsylvania is that the commonwealth has 500 school districts, in addition to about 2,500 municipal governments and several thousand more related commissions, boards and authorities. That situation guarantees highly expensive redundancy in the delivery of basic services. The state government proved that redundancy when, in 2011, the Legislature required consolidated wage tax collection for municipal governments and school districts. Reducing the number of wage tax collectors from more than 500 to just 69 reduced the cost of collection alone by more than $200 million a year statewide. Despite that success, the Legislature has failed to consolidate property tax collection or to require or even encourage the consolidation of local governments and school districts. Especially regarding schools, the needlessly large number of jurisdictions not only drives up costs but guarantees unequal education due to vastly disparate resources among districts. A new study by EdBuild, a New Jersey-based nonprofit, nonpartisan organization that studies school funding, 18 Pennsylvania school districts have sought mergers since 2000 but only one such merger — the Center Area and Monaca districts in 2009 — has been executed. State law allows mergers if both school boards agree but, as the study notes, districts and boards rarely are equals. A struggling district rarely finds a willing partner, and the state government offers no incentives. “As a result, the more fortunate district holds the power to throw a lifeline or to withhold one,” the report states. “And without the prospect of any real benefit, the well-off districts will almost certainly choose to maintain the status quo, leaving their neighbors stranded.” The report cited the Midland Borough District in Western Pennsylvania, which has attempted to merge with other nearby districts since 1985. It has paid a neighboring Ohio district tuition to take high school students, and has paid charter school tuition for them. Following the example of local tax collection based mostly on county lines, Pennsylvania could vastly reduce school administrative costs and diminish the wide disparities facing districts by mandating consolidations along county lines, and providing managerial and financial assistance to ease the transition. Maryland, which has county-based districts and school performance equal to or better than Pennsylvania’s, offers a ready model. It’s a matter of political will to create modern governance for public education. Among the many factors that make local governance needlessly expensive in Pennsylvania is that the commonwealth has 500 school districts, in addition to about 2,500 municipal governments and several thousand more related commissions, boards and authorities. That situation guarantees highly expensive redundancy in the delivery of basic services. The state government proved that redundancy when, in 2011, the Legislature required consolidated wage tax collection for municipal governments and school districts. Reducing the number of wage tax collectors from more than 500 to just 69 reduced the cost of collection alone by more than $200 million a year statewide. Despite that success, the Legislature has failed to consolidate property tax collection or to require or even encourage the consolidation of local governments and school districts. Especially regarding schools, the needlessly large number of jurisdictions not only drives up costs but guarantees unequal education due to vastly disparate resources among districts. A new study by EdBuild, a New Jersey-based nonprofit, nonpartisan organization that studies school funding, 18 Pennsylvania school districts have sought mergers since 2000 but only one such merger — the Center Area and Monaca districts in 2009 — has been executed. State law allows mergers if both school boards agree but, as the study notes, districts and boards rarely are equals. A struggling district rarely finds a willing partner, and the state government offers no incentives. “As a result, the more fortunate district holds the power to throw a lifeline or to withhold one,” the report states. “And without the prospect of any real benefit, the well-off districts will almost certainly choose to maintain the status quo, leaving their neighbors stranded.” The report cited the Midland Borough District in Western Pennsylvania, which has attempted to merge with other nearby districts since 1985. It has paid a neighboring Ohio district tuition to take high school students, and has paid charter school tuition for them. Following the example of local tax collection based mostly on county lines, Pennsylvania could vastly reduce school administrative costs and diminish the wide disparities facing districts by mandating consolidations along county lines, and providing managerial and financial assistance to ease the transition. Maryland, which has county-based districts and school performance equal to or better than Pennsylvania’s, offers a ready model. It’s a matter of political will to create modern governance for public education.", "url": "https://apnews.com/dfb5906e9b5642fea6a7459e6ac14631"}