{"authors": ["Mina Corpuz", "Mcorpuz Sentinelandenterprise.Com"], "date_download": "2020-05-04 20:19:12", "date_modify": "2020-05-04 20:19:12", "date_publish": "2018-09-18 10:33:40", "description": "LUNENBURG -- Single-use plastic bags could be banned from the town through a citizens' petition that is expected to be up for a vote in November. Resident Judit Ernst is gathering signatures...", "filename": "_e0b9d67e51a140aabe32cf008e8b5cb0_1588623552.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e0b9d67e51a140aabe32cf008e8b5cb0_1588623552.html", "title": "Lunenburg Petition Calls for Ban on Single-use Plastic Bags", "title_page": "Lunenburg Petition Calls for Ban on Single-use Plastic Bags", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LUNENBURG -- Single-use plastic bags could be banned from the town through a citizens’ petition that is expected to be up for a vote in November.\nResident Judit Ernst is gathering signatures for a bylaw that would prohibit the use of thin-film plastic bags with handles that are commonly given out in stores.\n“Outside of convenience, there are no pros to using them at all,” she said.\nThe bylaw would eliminate the bags from all retail and grocery stores in town by June 2019, which would help further Lunenburg’s commitment to sustainability.\nStores would be encouraged to sell reusable checkout bags at a reasonable price. To avoid purchasing them, customers could bring their own bags.\nPlastic bags for produce, meat, bulk foods, wet items, dry cleaning, and other similar merchandise that don’t have handles would still be allowed, according to the proposed bylaw.\nIt would also set fines that include a warning for the first offense, $25 for the second, and $50 for the third and each subsequent offense.\nIf Ernst collects 100 signatures, the proposed bylaw can appear on the Special Town Meeting warrant.\nAs of Thursday, about 80 people have signed on, Ernst said. She hopes to get the remaining signatures by the time the warrant opens up next week.\nErnst wanted to propose a plastic bag ban in town after watching a National Geographic video that showed bags floating around in the ocean and harming sea life.\nThe bags are typically made from petroleum-based plastic that doesn’t biodegrade, according to the U.S. Department of Environmental Protection. They can be difficult to recycle because they clog equipment.\nThe Sierra Club estimates that Massachusetts residents use more than 2 billion bags a year, which is about one bag per person each day.\nErnst started writing to big corporations like Walmart, Hannaford, and Target about their plastic bag use in the spring. She heard back from Hannaford’s president, Mike Vail, but the others didn’t respond.\nOver the summer, Ernst researched what could be done locally. She learned that about 80 municipalities, including cities like Boston and Lowell, have banned single-use plastic bags.\nWestford passed a petition to ban retail stores from using the bags at its 2017 Spring Town Meeting. It will go into effect in January and will require stores to offer recyclable or reusable bags.\nAthol, another town that approved a plastic bag reduction bylaw last year, was the basis for Lunenburg’s proposed bylaw, Ernst said.\nShe presented the bylaw last month to the Board of Selectmen.\nTo reach out to other residents, Ernst posted a copy of the proposed bylaw on Facebook and said she was gathering signatures. Some supported the effort and said they would sign the petition.\nIn the community, the possibility of eliminating plastic bags appeals to some local businesses.\nLisa Lanni, a manager at Lanni Orchards on Route 13, said purchasing plastic bags can get costly. They can cost between 5 and 10 cents each and the orchard buys them in bulk.\nThe store has plastic bags out for customers to use for produce and other products, and they are offered at checkout.\n“If people were to use reusable bags it would be better for us,” she said.\nCustomers tend to bring their own bags to buy goods or containers to pick fruit, Lanni said. The orchard is also looking to offer cloth bags with their logo on it.\nErnst’s petition has also received criticism.\nOn Facebook, some people said the bags aren’t really single use because they use them for other purposes, like as garbage bags around the house. Others suggested better recycling practices to address the issue.\nAnother criticism was that banning the bags could affect lower income people because not everyone can afford reusable totes.\nSome local businesses worry that banning plastic bags could raise prices.\nMaureen Dupuis, of Highland Farm, said purchasing heavier duty plastic bags or paper ones would be more expensive and the cost would likely transfer over to customers. The farm uses bags at farmers markets to sell meat products.\n“I don’t feel like banning something outright is the solution,” she said. “It’s going to be a learning curve if this goes through.”\nDupuis does want to find a solution and help the environment, but she said that could be done in a way that minimizes harm for local, independent businesses in town.\nAlthough municipalities in the state have banned single-use plastic bags, some recent efforts did not succeed.\nA bylaw amendment to reduce plastic bag use in Littleton did not pass last year.\nDuring the most recent legislative session, state lawmakers did not act on a bill that would have banned plastic bags across Massachusetts. The proposal was taken out of an environmental bond bill that later passed.\nMoving forward, Ernst wants to reach out to people in Lunenburg, talk with them about the effort, and encourage them to vote on it.\n“I understand it takes time to establish new habits,” she said. “It’s a small inconvenience for a really big cause.”\nFollow Mina on Twitter @mlcorpuz.", "url": "https://apnews.com/e0b9d67e51a140aabe32cf008e8b5cb0"}