{"authors": ["Erica Moser"], "date_download": "2020-05-04 20:27:07", "date_modify": "2020-05-04 20:27:07", "date_publish": "2018-11-01 05:00:01", "description": "New London — Joseph Parise lit a candle in memory of his brother, and flames were shared among the hundred or so people gathered outside on Jay Street until each person's candle was...", "filename": "_103214a48a1b41b2bbe997cd9ea06c99_1588624027.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_103214a48a1b41b2bbe997cd9ea06c99_1588624027.html", "title": "Vigil memorializes Parise, other domestic violence victims", "title_page": "Vigil memorializes Parise, other domestic violence victims", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "New London — Joseph Parise lit a candle in memory of his brother, and flames were shared among the hundred or so people gathered outside on Jay Street until each person’s candle was aglow.\nAccompanying the smell of melting wax in the warm air, and the sound of sniffling, was Michael Zaitchik playing “Bring Him Home” from “Les Miserables” on piano and singing along.\nSafe Futures, an organization that helps victims of domestic violence and sexual assault, on Thursday evening held a vigil to remember Robert Parise, who was killed a month ago in a domestic violence incident.\nBut the event was also to build understanding, so that people don’t blame victims and ask why they don’t leave. It was also to remember that not all domestic violence victims are women. It was also to remember other victims of domestic violence.\n“The sorrow and pain we feel as a family is immeasurable,” Joseph Parise said. “The loss is beyond, beyond, beyond explanation. I am here to tell you that my brother’s life mattered.”\nHe told those gathered that their lives matter, that this community matters. After reading a Bible verse, he ended by saying, “Don’t wait until a tragedy like the one my family and others have experienced to make your voices heard. We’ve got to do better.”\nHe thanked the staff and advocates at Safe Futures, first responders, the trauma team at Lawrence + Memorial Hospital and the pastor who brought him the news of his brother. As chaplain for the Waterford Police Department, Joseph Parise has been on the other side, delivering tragic news to family members.\nRobert Parise was stabbed on Oct. 4 and told the first responders that Christopher Petteway — his housemate and former partner — attacked him, police said. Parise was pronounced dead at Yale New Haven Hospital less than 12 hours after the stabbing.\nParise previously had told Safe Futures staff that Petteway threatened to kill him, Safe Futures Executive Director Katherine Verano said.\nSafe Futures worked with Parise after Petteway was arrested on threatening and disorderly conduct charges in a June 19 incident, for which he spent 30 days in prison.\nMelissa Zaitchik, part of a team of court-based advocates, recalled Parise as someone who was “always polite, good-natured, kind” and she said he would apologize for calling and taking her time.\nVerano said Safe Futures staff called him “a sweet man and a gentle soul.”\nThe word “gentle” was also one that Melissa Ferguson used to describe Parise. One of the vigil attendees, she became friends with him through a mutual friend, and she recalled his sense of humor and his love for his dogs.\nVerano said that as advocates, she and her staff often hear people say of victims “Why do they stay?” and “Why do they love unconditionally?”\nBut she wants people to stop blaming victims and stop putting it all on the victims to maintain their safety. She wants victims to stop feeling guilty.\n“To love, to care, to forgive, they are gifts Robert had that are special gifts,” Verano said.\nLaura Mooney, past president of the board of Safe Futures, said that Parise has reminded us of what we sometimes forget: Domestic violence affects people regardless of gender. She noted that Safe Futures is working hard to make sure men feel welcome to come to the shelter.\nAttendees of the vigil included friends and family of Parise and other domestic violence victims, past and present Safe Futures board members, advocates and elected officials.\ne.moser@theday.com", "url": "https://apnews.com/103214a48a1b41b2bbe997cd9ea06c99"}