{"authors": ["Nick Mallard", "Nmallard Sentinelandenterprise.Com"], "date_download": "2020-05-04 20:10:18", "date_modify": "2020-05-04 20:10:18", "date_publish": "2018-03-08 12:01:56", "description": "LOWELL -- As a kid growing up in the Pacific Northwest, Devan McConnell had a dream of playing hockey at Boston University. The 35-year-old admits he's not sure where that ambition started,...", "filename": "_b56f4fde889240f4bf9dc617d58f6785_1588623018.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b56f4fde889240f4bf9dc617d58f6785_1588623018.html", "title": "McConnell in Charge of Keeping the River Hawks in Shape", "title_page": "McConnell in Charge of Keeping the River Hawks in Shape", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- As a kid growing up in the Pacific Northwest, Devan McConnell had a dream of playing hockey at Boston University.\nThe 35-year-old admits he’s not sure where that ambition started, but he’s long moved on from wanting to play at BU. These days, he’s part of a turnaround at a program that aims to make life in Hockey East difficult for the Terriers.\nMcConnell serves as the head hockey performance coach at UMass Lowell, helping the team’s staff help every player on the roster achieve his full potential. And before landing the gig in Lowell -- and a prior sports performace job at Stanford University and time working the San Jose Sharks and Anaheim Ducks -- McConnell plied his trade between the pipes at the Wallace Civic Center as a three-year starter for the Fitchburg State hockey team.\n“My time in Fitchburg was fantastic. I couldn’t have asked for a better experience,” said McCon-nell, who now resides in Groton. “And ending up in Fitchburg was close enough to satisfy my desire to play in Boston.”\nIt also acted as something of a springboard for the career that followed. Undecided on a major prior to his move east, McConnell had some interest in physical therapy and that set into motion the events leading to his current job.\n“I had no real direction going in academically, but landed at a school with a great exercise science program,” McConnell said. “Part of the reason I ended up in Fitchburg was the opportunity to get on the ice and play right away, but academically it was a good fit for me, getting into the training side of things.”\nIn the classroom, McConnell excelled just as much as he did on the ice. In his final year with the Falcons, he was named one of four recipients of the 2007-08 MASCAC Scholar-Athlete award, given to an athlete boasting at least a 3.2 GPA.\n“Devan was always a great communicator, which is part of why he’s been a great teacher for these players,” longtime Fitchburg State head coach Dean Fuller said. “He’s done quite a bit to get them where they are and in the direction they’re going.”\nMcConnell graduated from Fitchburg State in 2008 with a bachelor’s degree in Exercise Science and went on to earn his Master’s in Exercise Science, Performance Enhancement and Injury Prevention from California University.\nThe stops at Stanford and with the NHL clubs followed. But for the past seven years, McConnell has been a mainstay at UMass Lowell with head coach Norm Bazin.\n“I’ve had an incredible time here,” McConnell said of his tenure in Lowell. “I’ve gotten to go along for an incredible ride and be a small piece of the culture that’s been built here.\n“The details are important and we ask everyone here to buy into the details, all the staff and players. We’re always looking for ways to improve and the growth in this program has been amazing.”\nHe’s also the co-author of a recently published book titled “Intent: A Practical Approach to Applied Sport Science for Athletic Development.” Written along with Justin Roethlingshoefer, the book puts into practical terms all the things he’s learned about getting athletes to perform at a high level.\nMcConnell says he stresses to players that “no one is here on a weight-lifting scholarship,” and that adding mass alone isn’t what the team is looking for. And, for the most part, he says they’ve bought in.\nHaving past players return to train during the offseason doesn’t hurt in getting his message across, either.\n“If training were optional, I think most of these guys would still do it, but they might not have the right direction,” McConnell said. “I’m here to motivate them and be able to relate to what they’re doing. My biggest thing is being able to communicate to these guys why I’m saying what I’m saying, why I’m telling them what I’m telling them.\n“It’s a self-cleaning oven once they buy in. We have guys come back from the NHL to train and these guys see the success.”\nSuccess on the ice isn’t something new to McConnell. His name is etched throughout the Fitchburg State record books after a collegiate career that saw him as the primary goaltender for the Falcons for three years.\nOver his four years with the team, McConnell compiled a 41-34-9 record with shutouts. He’s first all-time in games played by a goalie (85), has the most saves in a career (2,604) and most saves in a season (824 as a junior).\n“I had a pretty good run,” McConnell said. “Coach Fuller has been a major influence. He’s been unbelievably helpful to me to get me where I am. We still talk pretty regularly.”\nMcConnell says that while his hockey career was something to be proud of “the guys at UMass Lowell play at another level.”\nAnd maybe, just maybe, the kid who dreamed of playing in Hockey East has had a hand in getting the River Hawks to that next level.\nFollow Nick Mallard on Twitter @n_mallard.", "url": "https://apnews.com/b56f4fde889240f4bf9dc617d58f6785"}