{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:19:44", "date_modify": "2020-05-04 20:19:44", "date_publish": "2018-11-29 05:01:00", "description": "In 2003, Congress declared November as National Epilepsy Awareness Month in an effort to end the stigma surrounding the disorder and generate compassion and understanding for people who live with...", "filename": "_b71e001cf07f44148a72e6e15ffa6310_1588623584.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b71e001cf07f44148a72e6e15ffa6310_1588623584.html", "title": "Samrina Hanif: Change is possible for those with epilepsy", "title_page": "Samrina Hanif: Change is possible for those with epilepsy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In 2003, Congress declared November as National Epilepsy Awareness Month in an effort to end the stigma surrounding the disorder and generate compassion and understanding for people who live with epilepsy.\nEach year, people across the country find ways to get involved and show their support for epilepsy awareness. As that awareness grows, our voice becomes stronger. Together, we can help create change for those who live with epilepsy every day.\nThey say “knowledge is power” because it’s true. Epilepsy is a spectrum condition with a wide range of seizure types and varying control from person to person.\nIn approximately one-third of patients with epilepsy, seizures persist despite adequate trials of several anti-epileptic drugs (AEDs). These patients are at increased risk of Sudden Unexplained Death in Epilepsy Patients (SUDEP). To prevent such an outcome, it is necessary that patients and caregivers adhere to medication regime, avoid sleep deprivation, flashing lights, alcohol, drugs or any other medications that can lower the seizure threshold.\nPatients with disabling, complex partial seizures with or without secondarily generalized seizures and who have failed appropriate trials of at least two or three AEDs should be considered for epilepsy surgery. In March 2018, Marshall Neuroscience and Cabell Huntington Hospital had their first epilepsy resective surgery patient. Following the surgery with Dr. Alastair Hoyt, a neurosurgeon with Marshall Health, the patient has been seizure-free since March.\nIn West Virginia, the collective support network between Cabell Huntington Hospital, Marshall Health and the Epilepsy Foundation has made all the difference. Marshall Health started its annual epilepsy awareness walk four years ago, usually on the second Saturday of November. We also co-host with Cabell Huntington Hospital an epilepsy support group that meets the third Tuesday of every month.\nRaising awareness about epilepsy and its different treatment options is essential. For patients with refractory epilepsy, there is hope for better treatment options. New medications, clinical trials, device therapy and epilepsy surgery are all options that need to be discussed with your neurologist at every visit in order to improve quality of life.\nOur motto is to speak up and speak out for the rights of individuals with epilepsy.\nFor more information about epilepsy or treatment options available, visit www.marshallhealth.org or call 304-691-1787.\nDr. Samrina Hanif is a board-certified, fellowship-trained neurologist and an assistant professor of neurology at the Marshall University Joan C. Edwards School of Medicine.", "url": "https://apnews.com/b71e001cf07f44148a72e6e15ffa6310"}