{"authors": ["James Albert"], "date_download": "2020-05-04 20:13:35", "date_modify": "2020-05-04 20:13:35", "date_publish": "2018-06-03 11:03:56", "description": "FITCHBURG -- Despite finishing third in the 100 meters and fourth in the 200, Oakmont Regional senior John Caouette was extremely displeased with his performance at Saturday's All-State meet, held...", "filename": "_b356de46b1ec484e92ede14c7a8e41e4_1588623215.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b356de46b1ec484e92ede14c7a8e41e4_1588623215.html", "title": "Caouette Leads Oakmont at All-State Track Meet", "title_page": "Caouette Leads Oakmont at All-State Track Meet", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FITCHBURG -- Despite finishing third in the 100 meters and fourth in the 200, Oakmont Regional senior John Caouette was extremely displeased with his performance at Saturday’s All-State meet, held at the Fitchburg University’s Elliott Field.\n“I ran didn’t run (well) at all, it’s unacceptable,” he said. “I’ll use this as motivation and run better next week. It was terrible. I’ll use it as training motivation and come back stronger for next week.”\nCaouette finished at 10.88 seconds in the 100 and at 21.88 in the 200.\n“My goal is to win, it’s always to win,” he said. “My goal is to win. That’s the main goal, always. I’d rather win than have a personal record. I didn’t have great starts but everyone else was using the same blocks as me, so there’s no excuse. Today was terrible.”\nOn the girls’ side Oakmont’s Alyssa Madden, a junior, was second in the 200 with a time of 25.03. Laura McBride just missed out on placing in the 400-meter hurdles with a time of 1:06.97.\nNashoba Regional’s Meredith Goad was fourth in the pole vault, which was held on Friday at Elliot Field, as she cleared 10 feet, 3 inches.\nThe Nashoba girls were led by Anna Cressman and Tati Picard, who finished 13th and 21st in the shot put, throwing 34-7.75 and 32-6.25, respectively.\nIn the boys’ competition, Charles Jackson of Fitchburg placed 13th in the triple jump at 43-4. Leominster’s Joachim Ennoo was 12th in the triple jump at 43-5.25.", "url": "https://apnews.com/b356de46b1ec484e92ede14c7a8e41e4"}