{"authors": ["Joe Tjaden"], "date_download": "2020-05-04 20:13:50", "date_modify": "2020-05-04 20:13:50", "date_publish": "2018-04-18 11:57:00", "description": "The Toronto Raptors have a two-games-to-none lead in an NBA playoff series for the first time in team history. DeMar DeRozan matched his career playoff high with 37 points and Jonas Valanciunas...", "filename": "_0557c2ee7413455f9137cc39d0879265_1588623230.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0557c2ee7413455f9137cc39d0879265_1588623230.html", "title": "Joe's Morning Sports-Wednesday, April 18, 2018", "title_page": "Joe's Morning Sports-Wednesday, April 18, 2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Toronto Raptors have a two-games-to-none lead in an NBA playoff series for the first time in team history. DeMar DeRozan matched his career playoff high with 37 points and Jonas Valanciunas added 19 with 14 rebounds as the Raptors outscored the Washington Wizards, 130-119 in Toronto. C.J. Miles finished with 18 points, including a big three-pointer to ignite a late 17-4 run that gave Toronto an 18-point lead.\nThe Boston Celtics enjoy a 2-0 advantage in the first round of the NBA playoffs after Jaylen Brown scored a playoff career-high 30-points in a 120-106 downing of the Milwaukee Bucks. Brown nailed a three-pointer to cap an 11-2 run that put Boston ahead 118-99. Giannis Antetokounmpo finished with 30 points, nine rebounds and eight assists for Milwaukee, which hosts Game Three on Friday.\nThe New Orleans Pelicans are coming home with a two-games-to-none lead in their first-round series after Jrue Holiday torched the Trail Blazers for a playoff career-high 33 points in a 111-102 victory at Portland. Rajon Rondo had 16 points, ten rebounds and nine assists for New Orleans, which blew an eleven-point lead in the second half before Holiday’s pull-up jumper and Rondo’s layup put the Pelicans ahead to stay. CJ McCollum had 22 points for the Blazers, who resume the series on Thursday.\nShohei Ohtani brought a 2-0 record and a 2.08 ERA into his third major league start last night. Mookie Betts greeted him by leading off the game with the first of his three home runs as the Boston Red Sox blasted the Angels, 10-1 at Anaheim. Ohtani didn’t last very long, yielding three runs and four hits on 66 pitches before exiting with a blister on his pitching hand. David Price yielded three hits and four walks over five innings as the Red Sox improved to 14-2, extending the American League’s best start since 1987. The Angels ended a seven-game winning streak and dipped to 13-4.\nNebraska basketball coach Tim Miles is receiving a one-year contract extension. Athletic director Bill Moos previously announced Miles would be back for a seventh season. Miles is 97-97 with one NCAA Tournament appearance in six years. Moos, hired away from Washington State in October, said after the season he liked what he saw this season as the Cornhuskers went 22-11 and finished tied with Final Four-bound Michigan for fourth place in the Big Ten. Miles’ contract now runs through the 2020-21 season.\nCreighton, Clemson, Georgia State and St. Bonaventure, which competed in the NCAA Tournament, will headline the second annual eight-team Cayman Islands Classic College Basketball Invitational Nov. 19-21. Akron, Boise State, Georgia and Illinois State also will play in the tournament which will be held at John Gray Gymnasium, just minutes away from world famous Seven Mile Beach. Creighton posted a 21-12 record last year, finishing third in the BIG EAST Conference, while advancing to the NCAA Tournament for the fifth time in the last seven years.\nWayne State women’s basketball coach Chris Kielsmeier announced yesterday he is leaving the Wildcat program to become head coach at Division I Cleveland State in Ohio. He just completed his tenth season at Wayne State, guiding the Wildcats to records of 237-72 overall and 166-50 in Northern Sun Conference play. Last season, Wayne State was 25-7 overall and second place in the NSIC South Division with an 18-4 league mark, the seventh time the Wildcats won 20 or more games in a single season under Kielsmeier. He won four NSIC regular season titles (2011, 2012, 2014, & 2015), two NSIC Tournament titles (2010, 2012) and five trips to the NCAA Division II National Tournament (2010, 2011, 2012, 2014, & 2015). Kielsmeier led the Wildcats to the 2011-12 NCAA Central Region title and the schools’ first-ever trip to the Elite Eight.\nChecking out the local schedule for today, in baseball, the Northeast Hawks home game against the Midland JV has been cancelled, Nebraska hosts Nebraska-Omaha at 6:35, and the Omaha Storm Chasers entertain Memphis at 6:35. Also, the Northeast Hawks softball team’s home doubleheader versus Iowa Lakes Community College has been cancelled.\nThis week’s Hausmann Physical Therapy Star Athlete of the Week goes to Brent Wetovick of the Fullerton track & field team. Last Thursday at the Shelton Invitational, he won four gold medals. Wetovick claimed the 200, 400, 800, & 1600. He was a three-time State Champion last year and has lost only one race this year. Wetovick has broken two school records so far in his career. He was nominated by Coach Ryan Haughton. Congratulations to Brent Wetovick of the Fullerton track & field team, he is this week’s Hausmann Physical Therapy Star Athlete of the Week.\nLocal Schedule: Nebraska-Omaha at Nebraska (Bsbl-6:35); Memphis at Omaha Storm Chasers (Bsbl-6:35); Midland JV at NECC (Bsbl-Ccd.); Iowa Lakes CC at NECC (SB DH-Ccd.).\nLocal Scores: Nfk High 6-3 Lincoln NE 4-2 (Bsbl DH); Nfk High 9 Sioux City Heelan 0 (G. Tenn. Dual); NECC 9-1 Iowa Lakes CC 8-10 (Bsbl DH); Marshalltown CC, IA 14-5 NECC 7-27 (SB DH); Kansas St. 4 Nebraska 3 (Bsbl); Creighton 9 Nebraska-Omaha 2 (Bsbl); Creighton 5-13 Missouri-Kansas City 4-12 (SB DH); WSC 4-3 Upper Iowa 2-6 (Bsbl DH); Upper Iowa 7-9 WSC 0-3 (SB DH); Omaha Storm Chasers 4 Memphis 3 (10 Inn.) (Bsbl).\nHausmann Physical Therapy Star Athlete of the Week: Brent Wetovick of the Fullerton Track & Field team.\nCBS Sports Radio at 105.9 WJAG-FM & 780 AM Mon-Fri at 6:00 PM; Sat at 4:00; & Sun at 1:00. Also, the home of the Kansas City Royals!\nINTERLEAGUE\nFinal Miami 9 N-Y Yankees 1\n---\nAMERICAN LEAGUE\nFinal Toronto 11 Kansas City 3\nFinal Toronto 5 Kansas City 4, 10 Innings\nFinal Detroit 4 Baltimore 2\nFinal Texas 7 Tampa Bay 2\nFinal Cleveland 6 Minnesota 1\nFinal Oakland 10 Chi White Sox 2\nFinal Boston 10 L-A Angels 1\nFinal Houston 4 Seattle 1\n---\nNATIONAL LEAGUE\nFinal Colorado 2 Pittsburgh 0\nFinal Washington 5 N-Y Mets 2\nFinal Philadelphia 5 Atlanta 1, 10 Innings\nFinal Milwaukee 2 Cincinnati 0\nFinal St. Louis 5 Chi Cubs 3\nFinal Arizona 1 San Francisco 0\nFinal L-A Dodgers 7 San Diego 3, 12 Innings\n---\nNATIONAL BASKETBALL ASSOCIATION PLAYOFFS\nFinal Toronto 130 Washington 119\nFinal Boston 120 Milwaukee 106\nFinal New Orleans 111 Portland 102\n---\nNATIONAL HOCKEY LEAGUE PLAYOFFS\nFinal SO Washington 3 Columbus 2\nFinal Winnipeg 2 Minnesota 0\nFinal Vegas 1 L.A. Kings 0", "url": "https://apnews.com/0557c2ee7413455f9137cc39d0879265"}