{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:06:48", "date_modify": "2020-05-04 20:06:48", "date_publish": "2018-03-24 10:35:58", "description": "College dropout Wayne Huizenga started with a trash hauling company, struck gold during America's brief love affair with VHS tapes and eventually owned three professional sports...", "filename": "_d6a30c5151084ae09105de5f3e0c0836_1588622808.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d6a30c5151084ae09105de5f3e0c0836_1588622808.html", "title": "Ex-Dolphins Owner Huizenga Dies", "title_page": "Ex-Dolphins Owner Huizenga Dies", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "College dropout Wayne Huizenga started with a trash hauling company, struck gold during America’s brief love affair with VHS tapes and eventually owned three professional sports teams.\nHuizenga owned Blockbuster Entertainment, AutoNation and the world’s largest trash hauler, and was founding owner of baseball’s Florida Marlins and the NHL Florida Panthers. He bought the NFL Miami Dolphins for $138 million in 1994.\nThe one thing he never got was a Super Bowl win.\nHuizenga died late Thursday, according to Valerie Hinkell, his longtime assistant. He was 80.\nBASEBALL\nBumgarner breaks bone\nSan Francisco Giants left-hander Madison Bumgarner is hurt for the second straight year, breaking a bone in his pitching hand when hit by a line drive off the bat of Kansas City’s Whit Merrifield during a spring training game. The Giants said X-rays showed the 28-year-old fractured the fifth metacarpal on the outside of his left hand.\nBoston catcher Oscar Hernandez, Chicago Cubs pitcher David Garner, St. Louis pitcher Matt Pearce and Pittsburgh shortstop Andrew Walker have been suspended for 50 games each under baseball’s minor league drug program.\nFOOTBALL\nWarrant issued for Bennett\nAuthorities issued a warrant for the arrest of three-time Pro Bowl defensive end Michael Bennett, who is accused of injuring a paraplegic woman as he tried get onto the field at last year’s Super Bowl to celebrate with his brother.\nThe Harris County district attorney’s office said a grand jury indicted the 32-year-old Bennett, acquired earlier this month by the Philadelphia Eagles, on a felony count of injury to the elderly.\nBennett was a spectator at the game at NRG Stadium in Houston in February 2017 when he tried to get onto the field immediately afterward to see his brother, Martellus Bennett, a tight end for the Patriots at the time. Prosecutors allege he pushed through security personnel, including a 66-year-old woman in a wheelchair who was a stadium employee and who had told him to use a different entrance to access the field.\nNew York Giants defensive end Josh Mauro and Los Angels Chargers defensive lineman Corey Liuget have been suspended by the NFL for the first four games of the season for violating the league’s policy on performance-enhancers. ... Coach Adam Gase’s new backup quarterback in Miami is his former backup quarterback in Denver. Brock Osweiler signed a one-year contract Friday with the Dolphins to provide veteran insurance behind Ryan Tannehill, who is coming back from two knee operations.\nGOLF\nRomo finishes last\nTony Romo figured his weaknesses would be exposed in his PGA Tour debut. They were -- and then some. The former Dallas Cowboys quarterback finished last in the 132-man field in the Corales Puntacana Resort and Club Championship, bogeying the first six holes in a 10-over 82. At 15 over, he was six shots worse than the next player on the leaderboard and 28 strokes behind leader Brice Garnett.\nJoe Durant had three straight birdies in a back-nine burst and a shot 6-under 66to take the first-round lead in the PGA Tour Champions’ Rapiscan Systems Classic in Biloxi, Miss. ... In Carlsbad, Calif., Cristie Kerr shot an 8-under 64 in the Kia Classic to open a five-stroke lead halfway through the second round. The 40-year-old Kerr, the 2015 winner at Aviara, had eight birdies in her second straight bogey-free round to reach 13-under 131.\non the rain-softened course. ... Novak Djokovic’s 16-match Key Biscayne winning streak ended, and his struggle to come back from an elbow injury continued. Djokovic lasted barely an hour at a tournament he has won six times, losing his opening match in the Miami Open to Benoit Paire, 6-3, 6-4.", "url": "https://apnews.com/d6a30c5151084ae09105de5f3e0c0836"}