{"authors": ["Thomas M. Hanna", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Peter Gowan", "Jeremy Corbyn", "Mio Tastas Viktorsson", "Leigh Phillips"], "date_download": "2020-05-04 19:54:54", "date_modify": "2020-05-04 19:54:54", "date_publish": "2018-12-09 00:00:00", "description": null, "filename": "2018_12_public-state-ownership-united-states-socialism_1588622094.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/12/09200517/15215128883_2bc8df4f1b_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_12_public-state-ownership-united-states-socialism_1588622094.html", "title": "The Public Ownership Solution", "title_page": "The Public Ownership Solution", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nSocialism in the United States is making a comeback. Socialists are winning elections at the local, state, and federal levels; the membership of Democratic Socialists of America stands at a record fifty-five thousand; and polling consistently finds that younger Americans have relatively positive opinions of the concept. While the term “socialism” means different things to different people, for the vast majority in the burgeoning movement it suggests the promise of a very different kind of system — one that is far more equitable, democratic, and ecologically sustainable than both capitalism and past experimentation with its alternatives. This system, though qualitatively different from the current order, won’t be conjured out of thin air. It will have to be constructed, at least partially, from existing institutions and arrangements. In the economic realm, one such approach is expanding public ownership — enterprises, services, assets, and other entities owned and operated by the state at various levels. When done the right way, public ownership can create more equitable distributions of wealth and power and can be a mechanism for addressing vital social needs. America is frequently assumed to have little experience with, or even interest in, public ownership. This is the epicenter of global capitalism, after all — the beating heart of free-wheeling, no-holds-barred market capitalism. But public ownership in the United States is far more common than many people realize. To say so is not to suggest that the US is experiencing creeping socialism. Publicly owned enterprises and services in the United States tend to be quite conventional in their outlook, orientation, and governance — often structured like for-profit companies and concerned with observable financial goals; at worst, they’re opaque, unaccountable, and insulated from democratic control. Public ownership can serve the interests of business just as easily as the interests of workers. But what is different about public ownership is that it can be bent to serve democratic and social concerns in a way that private ownership inherently precludes. Public ownership, while not enough, is a prerequisite for building a more democratic and socially just society. And in this respect, there’s more of a basis for constructing socialism in the US than one might suspect.\nNew Energy Many publicly owned enterprises in the United States, especially at the local level, have their roots in the organizing of socialists, progressives, populists, and leftists during the Gilded Age of the late nineteenth and early twentieth century. In our new Gilded Age — with opulence amid squalor and tech billionaires acting like robber barons — public ownership is once again on the agenda. This has been most visible in the renewed energy to defeat privatizations and re-municipalize local enterprises and services. Between 2007 and 2014, for instance, the number of privately owned water systems fell by 7 percent and the number of people served by such systems dropped by 18 percent. Last month, Baltimore become the first major city in the United States to amend its charter to ban water and sewer privatization when around 77 percent of voters backed a referendum on the question. The effort was supported by the local chapter of AFSCME, nonprofit organizations, activists, and elements of the faith community. In Boulder, Colorado, climate activists have for several years been engaged in a high-profile campaign to municipalize the city’s energy supply (currently provided by the energy giant Xcel). One area of public ownership experiencing tremendous expansion is local, municipal high-speed internet systems. In recent years, more than 750 communities have established publicly owned full or partial networks, including 130 (in 27 states) with super-fast networks. These publicly owned systems commonly provide higher speeds, better service, lower costs, and updated infrastructure in communities often neglected by large for-profit companies. Another area seeing intense organizing is public banking. The US recently got its second publicly owned bank, when in early 2018 the Territorial Bank of American Samoa was given final approval by the Federal Reserve. Private banks had essentially deserted the island — by 2016 no loans had been made there in several years. In Los Angeles, a hastily convened coalition managed, on a shoe-string budget, to convince 42 percent of voters to support the creation of a public bank in a recent referendum. Although that effort came up short, a similar campaign — backed by a diverse array of activist groups — is gaining momentum in New York City.\nDemocratizing Public Ownership There is clearly a desire in the US for public ownership. But simply returning to (or maintaining) traditional top-down managerial forms is clearly insufficient. “The transfer of ownership to the government,” Martin Carnoy and Derek Shearer have noted, “does not automatically guarantee the establishment of an egalitarian, democratic society.” The Bank of North Dakota, for instance, operates much like a regular bank despite being formally owned by the state’s residents. Public ownership must be embedded in the give-and-take of political life, empowering people to fully and freely participate in the economy and control the fruits of their labor. It must prioritize human rights over private profit. It must, in short, be democratized. There are at least four reasons for this. First, involving workers, the public, and other stakeholders in economic decision-making benefits individuals (by promoting empowerment and self-development), society (by increasing community cohesiveness and participation), and the economy (by reducing inequality and boosting productivity). Second, democratic participation can enhance the effectiveness of publicly owned enterprises by tapping into the direct experience of employees and users of public goods and services — while at the same time building a constituency of support that can help beat back privatization attempts. Third, economic democracy — and specifically, the active exercise of individual worker and community member ownership rights — is a critical cornerstone of a vibrant political democracy. As many political scientists have pointed out, direct, hands-on experience with democratic practice in the workplace provides people with the tools and knowledge to create more democratic structures outside the shop floor or classroom. And fourth, democratization amplifies the voices of groups and individuals that have traditionally been excluded from decision-making. This includes women and people of color, who are often under-represented in the private workplace (but are already much more equitably represented in the public sector), as well as the natural world, which often has no representation at all in private industry. Taken to its maximal state, democratization offers the opportunity to supersede the wage labor system altogether by fundamentally altering the concept of who owns, manages, and governs an enterprise.\nExamples of Democratization Fortunately, there are examples emerging around the world of how to democratize public ownership. In Paris, for instance, the re-municipalized water utility (Eau de Paris) — which has been lauded for its efficient operations, improved service, and transparency — was set up alongside an “observatory” to promote citizen involvement with the water system. Eau de Paris’s board includes city councillors, worker representatives, and civil society representatives (including from the observatory and environmental and consumer groups). In Costa Rica, Banco Popular (BPDC), the country’s third largest bank, has a democratic assembly made up of 290 members. The assembly, in turn, advises on the bank’s strategic direction and selects four of the company’s board members, with another three appointed by the government. The bank uses a nationwide, popular consultative process to craft its future strategic direction, requires 50 percent of board members to be women, and directs a portion of revenues to social projects through its Social Bank subsidiary. The bank has also become a leading financier of ecological sustainability in the country as part of its “triple bottom line” approach seeking economic, social, and environmental returns. In the US, several renewable energy advocates have successfully run for the elected board of one of the largest publicly owned energy companies in Nebraska, the Omaha Public Power District, signaling what one solar installer called “a new age for this power district.” This capacity for progressive change in democratically structured enterprises has inspired other activist efforts — including in Boulder, Colorado and Providence DSA’s #NationalizeGrid campaign — to on their for-profit electric supplier. In the Boulder effort, activists have used public referenda not only to advance the municipalization process in the face of concerted corporate opposition, but also to place transparency requirements on the process. And in Providence DSA activists realize that while transitioning to public ownership and fighting climate change aren’t the same thing, they also know that you need more of the first before you can have the second. In the water sector, residents and activists are increasingly banding together to stop privatization and return systems to public ownership. In addition to the campaign in Baltimore, similar efforts have been successful recently in Atlantic City and Florida. The water sector has also been the site of some interesting examples of public-public partnerships, where public entities partner with other public entities, workers (and their unions), and additional stakeholders to increase service quality and effectiveness rather than resorting to privatization or private investment. In a few places in the United States, public ownership of land is now being combined with community control of land and housing, offering the hope of a powerful barrier to displacement. For instance, in Buffalo, the city has begun transferring vacant public land to the new Fruit Belt Community Land Trust (a permanently affordable housing strategy that usually has a democratic multi-stakeholder board structure) in a predominantly black community that is facing displacement pressures from the growth of a nearby medical campus. As with any organizational structure, there are tensions and unresolved questions when it comes to operationalizing democratic forms of public ownership. Perhaps the most important is how to balance the principles of worker self-management with other stakeholder representation (such as that of consumers, local residents, environmental activists, and so on). Within whatever structure is ultimately adopted (which will likely differ from industry to industry, from city to city), workers should be able to organize collectively, and have strong collective bargaining rights, progressive and enabling employment and training conditions (including clear career pathways and promotion opportunities), and a strong voice in the management and organization of work. Public must become synonymous with democratic.", "url": "https://jacobinmag.com/2018/12/public-state-ownership-united-states-socialism"}