{"authors": ["Ted Dunnam"], "date_download": "2020-05-04 20:07:52", "date_modify": "2020-05-04 20:07:52", "date_publish": "2018-10-12 05:00:00", "description": "FRIENDSWOOD -- Defense hasn’t exactly been the backbone of the Richmond Foster football team this season, but in a key District 10-5A football game Friday night, the Falcons showed some...", "filename": "_8c0489781ff84086bb588e324a96906a_1588622872.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8c0489781ff84086bb588e324a96906a_1588622872.html", "title": "Mustangs plagued by mistakes in loss to Falcons", "title_page": "Mustangs plagued by mistakes in loss to Falcons", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FRIENDSWOOD -- Defense hasn’t exactly been the backbone of the Richmond Foster football team this season, but in a key District 10-5A football game Friday night, the Falcons showed some spine.\nWhile junior running back Mario Simmons was scoring three times, the Falcons limited Friendswood to just one second-half touchdown and made a key stop late in taking a 28-20 victory at Henry Winston Stadium.\nThe outcome in a battle of district unbeatens allowed Foster (4-2) to improve to 3-0 in 10-5A while Friendswood (5-1) fell to 2-1.\nThe Falcons used a 21-point second quarter to open a 21-14 halftime lead, and used Simmons’\n17-yard touchdown run on third-and-nine for a 28-14 cushion with 3:08 left.\nFriendswood rallied with a 4-yard touchdown pass from Luke Grden to Christian Lee with 57 seconds left, but the PAT kick was blocked, leaving the score at 28-20.\nThe Mustangs’ Ryan Helton then recovered the ensuing onside kick at the Foster 45-yard line to give Friendswood one more chance.\nHowever, on fourth-and-eight at the Falcon 43-yard line, a throwback pass from Mustang Zach Zamora to quarterback Luke Grden was slightly low, and the off-balance Grden stumbled to the ground after making the catch well short of the first down.\nFoster then easily consumed the remaining time.\n“When they got that onside kick, I just told the defense that we need them,” Foster head coach Shaun McDowell said. “We had a second chance after not getting that onside kick.\n“We had some guys put pressure on the quarterback and make some plays. Our defense really stepped up.”\nMany of the Mustangs’ woes were self-inflicted. Key mistakes on offense, defense and the kicking game proved costly.\nThose errors ranged from penalties to turnovers to bad snaps. All helped kill Friendswood drives or extend Falcon marches.\n“I just told my kids I’m proud of them for the way they fought,” Mustang head coach Robert Koopmann said. “The encouraging thing was that we beat ourselves.\n“Our mistakes…we can control it and come back Monday and start working on those things. We’re not going to let this loss define us. After we lost to Clear Springs last year, I took a bet on who was going to be in the playoffs longer.\n“We plan on being in the playoffs a long time. Tonight, it was frustrating. We had a few bad snaps, and defensively we had a hard time. (Foster) has some D1 kids, and some talented dudes.”\nFriendswood led 7-0 at 4:03 of the first quarter after driving 88 yards in just six plays.\nThe key installment was the scoring heave of 39 yards from Grden to Austin Alvarez.\nFoster then tied the game when it moved 73 yards in nine plays with quarterback Ryan Stubblefield throwing a 25-yard pass into the end zone where junior wide receiver Case Parker made a nice leaping catch.\nAt the 9:20 mark of the second period, the game was knotted at 7-7.\nFriendswood then went ahead for the final time when it moved 54 yards in nine plays for a 14-7 cushion 5:59 before halftime.\nThe Mustangs overcame an 18-yard loss and a 15-yard penalty in the drive to score on a well-executed 22-yard screen pass from Grden to Lee.\nFoster, though, would tie the game at 14 when it used just four plays to travel 42 yards to score with 1:55 left in the half. Following a 30-yard pass play from Stubblefield to Sean Kelly, Simmons sprinted 24 yards to the end zone.\nThat appeared it would hold up as the halftime score, but a bad snap by Friendswood in punt formation allowed Foster to regain possession at the Mustang 36 with just 31 seconds left in the half.\nFrom there, the Falcons would score just six seconds before intermission on a 20-yard burst by the explosive Simmons to take a 21-14 advantage.\nThe Falcons then delivered the telling blow with Simmons’ 17-yard touchdown run with 3:08 left in the game, marching just 43 yards for the score. Simmons had a key 25-yard gainer in that drive.\n“I just felt like once we started getting some stops, we would take advantage of it,” McDowell said. “We were getting them in third-and-long and forcing them to punt.\n“Offensively, I felt like we could do pretty much whatever we wanted as long as we were consistent. We had one big turnover, but it didn’t cost us.\n“For the most part, our game plan was solid. Hats off to Friendswood - they’re a quality program, but we’ll take the win. Our kids are tough and resilient and love football. We’re improving every week, even if it’s one percent.\n“I don’t feel like we’ve taken too many steps backward. We’ve gotten better and better, and that’s due to these guys coming to work every day.”\nFoster hosts Angleton next Saturday while Friendswood hosts unbeaten Shadow Creek on Friday.\ntdunnam@hcnonline.com", "url": "https://apnews.com/8c0489781ff84086bb588e324a96906a"}