{"authors": ["Mark Brewer"], "date_download": "2020-05-04 20:14:03", "date_modify": "2020-05-04 20:14:03", "date_publish": "2018-05-22 23:05:48", "description": "If you're reading this, the odds are you already know that craft breweries in our area are popping up faster than the dandelions in our front yards. Let me put this into perspective. The...", "filename": "_f3b15600097b46b99b277498224cc02b_1588623243.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f3b15600097b46b99b277498224cc02b_1588623243.html", "title": "What's Brewing? Hop aboard and check out the 13 stops on this beer tour", "title_page": "What's Brewing? Hop aboard and check out the 13 stops on this beer tour", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "What’s Brewing? Hop aboard and check out the 13 stops on this beer tour\nIf you’re reading this, the odds are you already know that craft breweries in our area are popping up faster than the dandelions in our front yards.\nLet me put this into perspective. The state of California has the most breweries in the country with just over 764. Collectively they produce slightly more than 3,285,000 barrels of craft beer each year.\nThat’s a lot of beer, but don’t let your dandelion heads pop off just yet. Pennsylvania ranks sixth in the entire nation with more than 282 craft breweries that produce more than 3,724,00 barrels of craft beer each year. POP!\nThe Brewers Association reported that Pennsylvania produces more barrels of craft beer than any other state in our country. Who’s drinking all of this beer might not be as appropriate to mention as the breweries that contribute to this massive production.\nThere are more than 45 in Western Pa. alone. At this rate, Devout Brewing Co. (Export) and Allusion Brewing Co. (Vandergrift) may be open before you finish reading this article, so we’ll just go on counting breweries and bottles of beer on the wall.\nThere are multiple companies offering guided tours, which will provide interesting information, food and, of course, unique beer for you to sample at each stop. You’ll want to check them out especially if you don’t have a designated driver. If you’re a bit of a rogue like me, you might want to concoct your own brewery tour. Besides Uber-ing — which you’ll be doing unless your dear friend or significant other really owes you a BIG favor — it isn’t that expensive.\nHow many breweries have you visited in the area? Let’s look at some of the choices so you can decide which breweries will be on your tour this weekend.\nMark Brewer is a Tribune-Review contributing writer and the author and illustrator of Brewology, An Illustrated Dictionary for Beer Lovers.\n1. Spigot Brewing Co.\n931 Fourth Ave., Ford City\nTry: Puzzle Bits – Porter (ABV 6.2%) brewed with chinook, cascade and fuggles hops. Sweet with notes of chocolate and roasted malt.\n2. Cellar Works Brewing Co.\n110 South Pike Road #205, Sarver Try: Bourbon Barrel Aged Cocoa Bean Stout — (ABV 7.0%) aged for 8 months in Wild Turkey bourbon barrels. Hints of chocolate and vanilla!\n3. Conny Creek Brewing Co.\n4323 Shearsburg Road, New Kensington,\nTry: Major Minor — Porter (ABV 5.8%) with notes of coffee and chocolate.\n4. Leaning Cask Brewing Co.\n850 Pittsburgh St., Springdale\nTry: Mango Mastiff – IPA (ABV 5.2%) with brewed fresh mangos and mosaic hops. Finishes with notes of citrus, lemon and pine.\n5. Rivertowne Brewing Co.\n5578 Old William Penn Highway, Export\nTry: Float Trip – IPA (ABV 5.2%) brewed with nugget, cascade, el dorado, citra and galaxy hops.\n6. Yellow Bridge Brewing Co.\n2266 PA-66, Delmont\nTry: Saison Delmont — Saison (ABV 5.8%) packed with clove and banana aromas with a nice hop finish.\n7. Full Pint Brewing Co.\n1963 Lincoln Highway, North Versailles\nTry: Social – Session IPA (ABV 4.3%) brewed with grapefruit for a refreshing way to deal with the dog days of summer.\n8. Fury Brewing\n13380 US-30, Irwin\nTry: No Lines – New England style IPA (ABV 5.7%) brewed with heaping amounts of mosaic and galaxy hops. A juicy delight!\n9.Quinn Brewing\n3000 Commerce Loop, Suite 3200, Irwin\nTry: Grand Reserve Belgian style tripel — (ABV 9.5%) Warming with notes of vanilla and clove. Brewed traditionally and with respect to this style!\n10. All Saints Brewing Co.\nRoute 119 and Roseytown Road, Greensburg\nTry: Saint Mosey — Black pilsner (ABV 4.1%) with subdued hop bitterness, rich malt character, light bodied and well balanced.\n11. Four Seasons Brewing Co. and Pub\n745 Lloyd Ave Ext., Latrobe\nTry: Nebulous – New England style IPA (ABV 6.8%) with amarillo, citra, simcoe and mosaic hops. Hazy looking and juicy tasting!\n12. Bloom Brew\n100 Riverside Drive, West Newton\nTry: Mothra vs. Citra – IPA (ABV 8%) brewed with citra hops. Always 24 unique beers on tap including many sours!\n13. Helltown Brewing\n3 Henry C Frick St., Mt. Pleasant\nTry: Mischievous Brown – English-style brown ale (ABV 5%) with strong nut and caramel characteristics with notes of cocoa, biscuit and brown sugar.", "url": "https://apnews.com/f3b15600097b46b99b277498224cc02b"}