{"authors": ["Robert Snell", "The Detroit News"], "date_download": "2020-05-04 20:17:55", "date_modify": "2020-05-04 20:17:55", "date_publish": "2018-05-10 01:58:00", "description": "She told police they met on a Texas beach, fellow college students visiting South Padre Island during spring break 1996. She was a 21-year-old college student at a large university; they...", "filename": "_3895aced624740ce898c40ec27df988d_1588623475.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3895aced624740ce898c40ec27df988d_1588623475.html", "title": "Lions' Patricia indicted, not tried in '96 sex assault", "title_page": "Lions' Patricia indicted, not tried in '96 sex assault", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "She told police they met on a Texas beach, fellow college students visiting South Padre Island during spring break 1996.\nShe was a 21-year-old college student at a large university; they were two football players and Theta Chi fraternity brothers at Rensselaer Polytechnic Institute in upstate New York.\nOn the evening of March 15, 1996, the woman told police that two men burst into the upscale hotel room where she was sleeping and took turns violently sexually assaulting her, according to court records and a news account at the time. They were arrested, charged and later indicted by a grand jury on one count of aggravated sexual assault — but they never stood trial and were not convicted.\nOne of the indicted men was 21-year-old Matt Patricia, who was hired as the head coach of the National Football League’s Detroit Lions in February. The other, his friend and captain of RPI’s football team, Greg Dietrich, 22.\nAlthough both men have gone on to successful careers, the relevance of even old and untried charges raises questions for the Lions at the height of the “Me Too” movement, which has brought new scrutiny to sexual misconduct allegations.\nThe indictment remained an untold part of Patricia’s past during his rise in the coaching ranks, and the Lions said it eluded them during a background check that only searched for criminal convictions.\nWhen approached by The Detroit News, team president Rod Wood initially said “I don’t know anything about this” — but hours later said his review of the situation only reinforced the team’s decision to hire Patricia.\n“I am very comfortable with the process of interviewing and employing Matt,” Wood said. “I will tell you with 1,000-percent certainty that everything I’ve learned confirmed what I already knew about the man and would have no way changed our decision to make him our head coach.”\nWood also said the woman recanted the sexual assault allegations multiple times — a claim not substantiated by existing records or lawyers for Patricia and his fraternity brother.\nTeam owner Martha Ford, lauded by Detroit Police in 2016 for her stance against domestic violence and commitment to changing the culture in the NFL, also did not know about the allegations.\nOne of Patricia’s defense lawyers said he believes the alleged assault never happened.\n“In my opinion, it was a fabrication,” attorney Jeff Wilson said. “I’m telling you it was a ‘he said, she said.’ I don’t know what type of problems the girl was having; I don’t know why she made that allegation. We vehemently denied that he was doing anything wrong or did anything wrong.”\nThere are no legal prohibitions against requesting or considering past criminal charges for employment in Michigan, although federal civil rights guidance discourages holding an unsubstantiated charge against an applicant.\nPatricia, 43, and Lions general manager Bob Quinn were not available for an interview about the indictment Wednesday.\nMany details of the alleged attack are unclear. The police report was discarded, and several figures involved said they could not recall the case — not the police chief, lieutenant, grand jury forewoman, prosecutor, assistant prosecutor or defense attorneys.\nThe woman who identified Patricia and Dietrich to police as the perpetrators did not respond to multiple attempts to contact her over several weeks. The News has a general policy against identifying alleged victims of sexual assaults.\nShe ultimately concluded that she would not testify, court records show.\n“Victim does not feel she can face the pressures or stress of a trial,” reads a hand-written note above the signature of Cameron County Assistant District Attorney Jacqueline Reynolds-Church in the Jan. 28, 1997, motion to dismiss the case.\nCameron County District Attorney Luis Saenz, also the district attorney at the time of the indictment, said he did not recall the case.\n“It’s extremely frustrating,” Saenz said of dismissals prompted by a reluctance to testify. “Sometimes we get angry about it, get mad about it and pull our hair out. We don’t like to do this. It just sends the wrong message and is something that hurts all sexual assault cases.”\nTheta Chi fraternity brothers Patricia and Dietrich\nAssailants ‘burst in’\nThe assault case dates to Patricia’s time at RPI, where the 5-foot-11, 227-pound offensive lineman played center and guard. Dietrich was a team captain and president of the Theta Chi fraternity.\nThe men were in South Padre Island during Texas Week, an annual celebration that lured more than 100,000 people to the Gulf Coast island just north of the Mexican border.\n“We referred to Texas Week as the week from hell,” said E.E. Eunice, South Padre Island’s police chief at the time.\nHe does not remember Patricia or the alleged assault.\nFive days after the alleged attack, Eunice was quoted in a March 20 newspaper article carried in the Brownsville (Texas) Herald and at least one other newspaper.\n“She told us she had palled around with them for a few days,” Eunice told the newspaper at the time.\nAt approximately 6 p.m. on Friday, March 15, the men arrived at a room at the Radisson hotel where the woman was sleeping, the newspaper reported.\nPatricia and Dietrich “burst into” the room and awoke the woman before taking turns sexually assaulting her, according to the newspaper.\nNot true, Patricia’s lawyer said.\n“His alibi is this was a false accusation,” Wilson said. “He didn’t do anything.”\nThe accuser identified Patricia and Dietrich, who were arrested later that night and released on $20,000 bond, according to the story and court records.\nDietrich’s criminal defense attorney at the time, Sheldon Weisfeld, said he doesn’t recall the case.\n“You’re talking damn near 22 years ago,” Weisfeld said.\nMonths later, an indictment\nEunice said it was customary for his department to take sexual-assault accusers to an area hospital so medical staff could search for evidence of sexual assault.\nAfter the alleged incident, a secret grand jury of Texas residents heard evidence presented only by prosecutors. To return an indictment in Texas law, nine of 12 grand jurors must vote that probable cause exists that the defendants committed a crime.\nAn indictment requires grand jurors find sufficient evidence to believe someone committed a crime, said Peter Henning, a Wayne State University law professor and former federal prosecutor.\n“It’s a fairly low standard,” Henning said. “It is certainly not proof that the person committed the crime. Especially if the evidence changes.”\nOn Aug. 14, 1996, the grand jury indicted Patricia and Dietrich, each on one count of aggravated sexual assault, a felony that carries a maximum sentence of up to life in prison, according to Texas statute.\n“The defendants compelled the victim to submit and participate by the use of physical force and violence ...,” it reads.\n“It would have never gotten to that level if it was a weak case,” said Robert Rodriguez, a South Padre Island Police lieutenant at the time of the alleged sexual assault.\nJohn Tasolides, a lawyer who responded to messages left for Dietrich this week, disagreed.\n“If your complaining witness is not willing to come into court and testify, a case doesn’t get any weaker than that,” he said.\n″(Dietrich) pled not guilty; he denied any responsibility for this, and the charges were dismissed,” he said. “Once an indictment is dismissed, you’re as innocent as the day before you were accused.”\nThe accuser likely did not testify in front of the grand jury, assistant district attorney Reynolds-Church told The News.\nThe grand jury likely was presented with the accuser’s statement, witness statements and any physical evidence, Reynolds-Church said.\nCase is dismissed\nFive months after the indictment, in January 1997, the case collapsed.\nWilson, Patricia’s lawyer, said he remembers preparing for trial in his hotel room on Jan. 26, 1997. The television was on — Patricia’s future employer, the New England Patriots, were playing the Green Bay Packers in Super Bowl XXXI — but Wilson wasn’t watching.\nThe next day, Wilson said he arrived in court to pick a jury.\n“She didn’t show up,” Wilson said of the accuser.\nProsecutors stood up and asked to dismiss the case, Wilson said, a request that was granted.\nThe dismissal was prompted by a request from the accuser, according to court records.\n“Victim is unable to testify and can not give a date certain when she will be available,” the dismissal reads. “Victim may request that the case be refiled at a later date.”\nLast-minute dismissals are dramatic but not uncommon in criminal sexual conduct and domestic violence cases, Henning said.\n“This does happen, in part, because of the stigma attached,” Henning said. “It reflects on them personally, and that’s very difficult for the victim.”\nPatricia felt a great sense of relief after the dismissal, his lawyer said.\n“It was a freakin’ nightmare for Mr. Patricia and his friend,” Wilson said. “Imagine if you’re innocent and charged with something like that — which nowadays would be worse.\n“It was a pretty serious charge, man.”\nA victim’s inability to testify can destroy a case, said Saenz, the Cameron County District Attorney in 1996 and today.\n“It’s almost next to impossible in a sexual assault case where the jury wants to hear what happened,” he said.\nAccording to the Rape, Abuse & Incest National Network, in 1,000 sexual assaults, all but six perpetrators will walk free.\n“It is fairly common for a survivor to not want to testify,” said Ted Rutherford, spokesman for the Texas Association Against Sexual Assault. “There is a fear of retaliation, fear that if they do report and if things go public with the story, their personal lives will be on display and picked apart.”\nThe case is unusual in one respect.\n″(They) were immediately arrested, and that’s pretty rare,” Rutherford said.\nThere is nothing unusual about the case, said Dietrich’s lawyer, a former prosecutor.\n“The people who make immediate outcries are false accusers many times,” Tasolides said.\nNo finding of guilt\nAt the time of the alleged assault, Patricia was an aeronautical engineering student. The criminal case was pending when he graduated from RPI in 1996 and took a job as a graduate assistant for his college football coach. He later worked as an engineer at an air and filtration systems company in Syracuse, New York, before eventually joining the Patriots.\nAfter being charged, Dietrich, now 44, graduated with an engineering degree from RPI and received a master’s degree from Columbia Business School before working for IBM, GE and serving as a managing director of Credit Suisse in New York City, according to online biographies. He is a vice president of a Virginia-based technology company and lives in New York.\nIn a 2017 interview with the Theta Chi alumni magazine, Patricia said he and Dietrich remained close.\n“We still talk all the time,” Patricia said.\nGreg Dietrich\nAn indictment is merely an allegation, and since the case was never prosecuted, Patricia and Dietrich are considered innocent, said Keith Corbett, a veteran defense attorney and former federal prosecutor.\n“But on a personal level, it’s a brand that stays with you forever,” Corbett said. “There’s no way to get around it. (They) never had a chance to defend against it, and there was no finding of guilt but from a public-perception standpoint; this is a thing that may follow them for the rest of their lives.”\nQuinn did not know about the indictment before Patricia was hired, Wood said. Quinn is a former Patriots scout and executive who worked with Patricia for 12 years.\nOn the day of his introductory press conference in 2016, Quinn said that character would be a point of emphasis for players.\n“That’s definitely going to be taken into account on every draft pick, every free agent signing that we take,” Quinn told reporters. “The two things that are zero tolerance are domestic violence and dangerous weapons. Those are the two things I’m not going to stand for.”\nHe later signed little-used tight ends Orson Charles and Andrew Quarless, who were both accused of gun-related crimes.\nAfter the signings, Quinn clarified his zero-tolerance policy.\n“I think every incident and every situation is different,” Quinn said last year. “Looking back, I probably should not have said that, because the more you do research on each individual incident, what you read in the newspaper and the Internet is sometimes not accurate.”\nBackground check conducted\nThe month before the Lions hired Patricia, the New Jersey-based private investigations firm APG Security requested copies of the indictment and dismissal from the county prosecutor’s office, The News has learned. When contacted by The News, an APG official said he was unaware of anyone requesting the court records.\nThe NFL’s personal conduct policy for players states athletes, coaches and employees all must avoid “conduct detrimental to the integrity of and public confidence in” the league or be subject to discipline.\n“It is not enough simply to avoid being found guilty of a crime ... even if the conduct does not result in a criminal conviction, players found to have engaged in any of the following conduct will be subject to discipline,” it reads. The prohibited conduct includes sexual assault, but it is ambiguous about the implications of a previous allegation.\nThe NFL hired four women to help shape league policy relating to domestic violence and sexual assault in 2014 amid complaints about how the league punished players, particularly former Baltimore Ravens running back Ray Rice, who was suspended for two games for a domestic violence incident with his then-fiancee. Rice later was suspended indefinitely after video emerged showing Rice knocking her unconscious, discipline that was later overturned on appeal by an arbitrator. An assault charge against Rice was dropped, and he underwent counseling, but no team ever signed him again.\nLaws allowing employers to conduct background checks and hold people accountable for prior arrests and convictions vary from state to state. But in practice, employment decisions are routinely made during informal checks of court databases, social media and sex-offender registries available online, labor experts said.\n“Studies show that once you get past seven years after a crime was committed and the person hasn’t engaged in any other criminal conduct, they are no more likely to engage in criminal conduct than you or I,” said Stacy Hickox, an assistant professor at Michigan State University and expert on employment law. “Others say ‘I don’t care how long ago it was,’ if it was a significant crime like the one you’re describing, then we’re going to look back as far as we want to look back.”\nMichigan employers are allowed by law to ask prospective employees about arrests for felonies, but not misdemeanors. In Massachusetts, where Patricia worked for the Patriots from 2004 until earlier this year, state law bars employers from asking about arrests that did not end in a conviction.\nFederal law does not prohibit employers from asking about criminal histories but an arrest, by itself, may not be used to discriminate against someone, according to the U.S. Equal Employment Opportunity Commission.\n“We did a complete background check,” said Wood, the Lions’ president. “Our background check was limited to employment matters only and does not disclose any criminal matters that don’t result in a conviction or a plea agreement.”\nAfter being hired by the Lions on a reported five-year deal, Patricia said he favors giving a second chance to players facing arrests or convictions.\n“Obviously, depending on the degree of the issues. But let’s just say just in general, I think it’s important to work with all those guys,” Patricia told reporters during an NFL meeting in Orlando earlier this year. “We’ll go through the process and if we feel that there’s someone that would be good for us and a good fit for our organization and what we need, then that’s my job as a coach to go in and do everything I can to try to make them the best player they can be or the best people they can be.\n“I really look at it as we’re educators, we’re trying to teach these guys. And one of the reasons I left engineering and got into coaching was for that reason, to be able to have that human element of trying to make a difference in people’s lives.”\nrsnell@detnews.com\nTwitter: @robertsnellnews", "url": "https://apnews.com/3895aced624740ce898c40ec27df988d"}