{"authors": ["The Day Editorial Board"], "date_download": "2020-05-04 20:28:10", "date_modify": "2020-05-04 20:28:10", "date_publish": "2018-02-16 05:00:01", "description": "Those of a certain age remember the days when a trip to the grocery store culminated with a clerk bagging the food, rolling the cart out to the car and loading it all in the trunk. Likewise,...", "filename": "_1165291dd87042d2ace789bbb87b1ddd_1588624090.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1165291dd87042d2ace789bbb87b1ddd_1588624090.html", "title": "Saying so long to another link to better service past", "title_page": "Saying so long to another link to better service past", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Saying so long to another link to better service past\nThose of a certain age remember the days when a trip to the grocery store culminated with a clerk bagging the food, rolling the cart out to the car and loading it all in the trunk. Likewise, banking meant dealing with a teller face to face. Real people, not recordings, answered calls to businesses and they were local folk, not someone sitting in another state or country.\nAnd then there were the gasoline stations. Pull in and an attendant was soon at the car window, inquiring about the desired fuel type and amount. While the pump filled the tank, the attendant checked the oil and cleaned the car’s front, side and back windows. Sometimes, even the car mirrors got a spritz and wipe-down.\nTimes change. The high cost of doing business combined with the advent of new technologies, touched off the steep and steady decline in local and full service operations decades ago.\nThe first remote access, self-service gasoline pump opened in Colorado in 1964. By 1987, 80 percent of the U.S. gasoline market derived from self-service pumps, according to the National Association of Convenience Stores. By 2011, 90 percent of gasoline customers pumped their own fuel.\nA few service stations still maintain at least one full-service pump, but even these are succumbing one by one.\nJim Sullivan’s Sunoco in Mystic ceased its full-service gasoline operation two years ago, for example. Most recently, Broadway Auto in Mystic, one of the few remaining full-service stations in the region, stopped selling gasoline all together. Marlin Hoffman, Broadway Auto’s owner, said he would have needed to replace his 30-year-old gasoline tanks within a year. He estimated removing and replacing them would cost nearly 160 worth of gasoline a day. Deduct the cost of doing business from that amount and the decision to eliminate gasoline sales becomes obvious.\nThose seeking full-service gasoline locally need to head to either New London, Niantic or Westerly.\nThe move to self-service gasoline largely was a customer pleaser. People are more rushed these days and don’t necessarily want to daydream while an attendant fiddles under the hood and wipes down windows.\nStill, the disappearance of full-service gasoline stations is unfortunate for the elderly or those with physical limitations. It’s just not that easy for these folks to spring out and service their vehicles, nor manipulate unfamiliar technology.\nWhat businesses can no longer afford to offer, however, individuals can provide. We all should look out for our elderly and physically limited neighbors. If someone’s struggling at the gasoline pump, offer a hand. We can’t reverse time, but old-fashioned neighborliness is timeless.", "url": "https://apnews.com/1165291dd87042d2ace789bbb87b1ddd"}