{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:12:48", "date_modify": "2020-05-04 20:12:48", "date_publish": "2018-05-25 23:39:00", "description": "The Winona County Historical Society’s Historic Bunnell House will open June 1 for the summer season. Explore the home of Winona County’s first permanent Euro-American settlers, their relationship...", "filename": "_baad27c0860f4972b15b095992caaa67_1588623168.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_baad27c0860f4972b15b095992caaa67_1588623168.html", "title": "Historic Bunnell House opens for season June 1", "title_page": "Historic Bunnell House opens for season June 1", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Winona County Historical Society’s Historic Bunnell House will open June 1 for the summer season. Explore the home of Winona County’s first permanent Euro-American settlers, their relationship with the local Dakota and storied past, plus learn more about the unique architecture of their house. Guides take you on a journey through the house and time with engaging activities, stories and more.\nThe house was built by Willard and Matilda Bunnell in the 1850s, the first permanent white settlers in Winona County, fur trappers and traders, and suppliers to the increasing number of steamboats traveling the area via the river. It was a home up until 1954 when the WCHS acquired it and made it a house museum, opening in 1956. The Bunnell House overlooks the Homer landing along the Mississippi River. The river profoundly shaped the communities and people of the Winona area, just as they have influenced the character of the river itself in turn. People had to learn the ways of the river to survive and prosper; similarly, they had to create relationships and networks with their neighbors along the river (whether American Indian or Euro-American). Without these relationships, already difficult lives became an even greater struggle.\nThe Bunnell House is open from 11 a.m. until 4 p.m. Thursday through Saturday and 1-4 p.m. Sunday from June to August for guided tours.\nAdmission is $5 adults, $3 students, WCHS members and youth 7 and younger are free. The house is located about three miles south of Winona in Homer, right along Hwy. 61. Watch for brown signs.\nFind more and plan your visit at winonahistory.org, call 507-454-2723 or call the Bunnell House during operating hours at 507-452-7575. Have a group? Schedule a group tour at a discounted rate by calling or emailing tours@winonahistory.org.", "url": "https://apnews.com/baad27c0860f4972b15b095992caaa67"}