{"authors": ["Chris Kaufman Ckaufman Appealdemocrat.Com"], "date_download": "2020-05-04 20:26:38", "date_modify": "2020-05-04 20:26:38", "date_publish": "2018-02-01 02:45:00", "description": "Editor’s note: Area residents and officials had a variety of comments and appraisals of President Donald Trump’s first State of the Union Address. Here’s a sampling (compiled by the...", "filename": "_d3670d75dc4543ad9202a8d0efd19a7a_1588623998.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d3670d75dc4543ad9202a8d0efd19a7a_1588623998.html", "title": "Yuba-Sutter officials and residents share their thoughts on Trump’s State of the Union", "title_page": "Yuba-Sutter officials and residents share their thoughts on Trump’s State of the Union", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Editor’s note: Area residents and officials had a variety of comments and appraisals of President Donald Trump’s first State of the Union Address. Here’s a sampling (compiled by the Appeal-Democrat’s Chris Kaufman).\nBrynda Stranix, president and chief operating officer of Yuba-Sutter Economic Development Corporation:\n• “I am encouraged about a commitment to infrastructure. Not only the investment in the much-needed projects themselves but the jobs those projects will bring will be a boon to the economy.”\n• “And, I do believe the tax cuts will help bring jobs and provide some financial relief to families. All-in-all, I’m optimistic about the future for Yuba-Sutter and the nation.”\nRicky Samayoa, Marysville mayor and head of E Center, which administers a variety of federally funded programs in the area, including Head Start:\n• “I try to look at is as a local, elected official and what does that mean for our city and region and I try to look at it policy-wise.\n• “We see things from a different perspective and given that the Republicans are the majority, they control the direction of the country.”\n• “For the tax plan, removing some of the barriers for companies to expand – that’s great – and hopefully that creates opportunity at the local level to expand businesses and create jobs. That could take a little time.\n• “There are other issues affecting our area like homelessness and other issues that aren’t as simple as creating new jobs.”\n• “Overall, its was a patriotic effort to get everyone on the same page. We need to figure out if the local, small business owners will have more opportunities to expand and create jobs.”\n• “Immigration was another big topic because it touches on the labor force as an economic issues and our area relies heavily on migrant workers and how that is going to be affected.”\n• “We need to look at the workforce and need to make sure we allocate resources that are dedicated to schools and support new industry.”\n• “We all have to be working together in the cities, counties and the Sacramento region. We have to get to work and have the infrastructure available to build new homes as part of growth. I’m not sure how quickly we can get there, if we have a shortage of labor, we’re not going to be able to expand as quickly as possible.”\nAssemblyman James Gallagher, Yuba City Republican:\n• “Overall, I think it was an inspiring speech.\n• “I think he addressed a lot of the things that are going right, in terms of the economy, wage growth, with all the businesses giving out bonuses, tax reform and unemployment continuing to go down – all things that we should celebrate because it’s been a great benefit to American workers.”\n• “He detailed challenges we face.”\n• “In terms of infrastructure, we have crumbling roads and need to get them upgraded and certainly Oroville Dam comes to mind. Here in California, and in the nation, we need to make those investments. That was music to my ears.”\n• “He mentioned the opioid problem and the rising cost of prescriptions drugs and said it’d be a top priority to lower the price.”\n• “Also, he talked about the threats abroad and we have some real, looming threats and they need to be taken seriously with vigilance and toughness. I think the pressure he’s been applying has been working and that he’ll continue to be strong and precise in dealing with Iran and North Korea.”\nArea U.S. Rep. John Garamendi, Walnut Grove Democrat (statement issued via email):\n• “... President Trump spent 90 minutes literally applauding himself, but there wasn’t much for everyday Americans to be excited about. Contrary to Trump’s claims, job creation last year fell to its lowest rate since 2010. The bulk of the benefits of the tax cut he praised himself so much for went to America’s wealthiest, with only cents on the dollar for the Middle Class and the working poor. Meanwhile, Trump’s reckless efforts to repeal the Affordable Care Act have jacked up the uninsured rates and the cost of healthcare, including prescription drugs.”\n• “On immigration, President Trump offered far from a middle-of-the-road compromise, providing instead a divisive roadmap that provides no answers to the needs of California’s agricultural industry. On foreign policy, Trump further alienated our allies and provoked our adversaries, while committing to a massive expansion of our nuclear arsenal that will damage both our safety and our economy.”\n• “ ... Our vision is one that seeks to unite, rather than divide by gender, color, creed and country of origin. That’s not the vision we got from President Trump tonight, but that’s the vision that I believe in and will fight for every day.”\nJack Crowder of Yuba City:\n• “Trump is the man. He’s bringing our country back and it will take time, but the liberals will see what he’s doing is helping the country even though they fight him tooth and nail.\n• “Do it for the country, don’t do it for yourself.\n• “He’s a knucklehead sometimes but aren’t we all.\n• “They say he’s not presidential but being presidential has gotten us into trouble in the past.”\nJan Cavazos of Yuba City:\n• “I thought it was terrible and there was no substance.”\n• “I didn’t hear him mention DACA at all and that’s what’s I wanted to hear about most.”", "url": "https://apnews.com/d3670d75dc4543ad9202a8d0efd19a7a"}