{"authors": ["Nicole Norfleet"], "date_download": "2020-05-04 20:05:40", "date_modify": "2020-05-04 20:05:40", "date_publish": "2018-04-08 19:07:00", "description": "A light dusting of snow covered the Commons park and the east side of downtown Minneapolis as Pat Ryan looked out over the blocks his company built. It was a sea of asphalt, Ryan, chief...", "filename": "_6875208fc5704920b3761f66255954a6_1588622740.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6875208fc5704920b3761f66255954a6_1588622740.html", "title": "In downtown Minneapolis, rapidly rising east end still seeks a heart", "title_page": "In downtown Minneapolis, rapidly rising east end still seeks a heart", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A light dusting of snow covered the Commons park and the east side of downtown Minneapolis as Pat Ryan looked out over the blocks his company built.\nIt was a sea of asphalt, Ryan, chief executive of Ryan Cos., said from a vantage point on the 15th floor of one of the Wells Fargo office towers.\nIn less than five years, he and other developers have spent more than $1 billion to construct offices, apartments, condos, hotels and other commercial projects around U.S. Bank Stadium. But the area still requires some heavy lifting not involving cranes or concrete to become the vibrant, cohesive place people like Ryan envisioned.\nWhats happened here in a very short period of time has never happened in the city of Minneapolis, Ryan said. You take a look at the North Loop. Thats been evolving for 20 years. This is five.\nNew apartments and condos are filling up, the park is busy during warm months, and a highly anticipated grocery store will open this summer.\nBut plenty of office and retail space is yet to be filled. Coffee shops and restaurants still outnumber service-oriented businesses. The park hasnt drawn all the funds it requires, and the areas recently established identity, East Town, hasnt fully solidified.\nYou can build things quickly, but things have to still mature, said Dan Collison, pastor of First Covenant Church. As executive director of the East Town Business Partnership, hes one of the neighborhoods biggest cheerleaders.\nEast Town consists of 120 square blocks on the eastern side of downtown, from 5th Avenue S. on the west to Interstate 35W on the east and from the Mississippi River on the north to Interstate 94 on the south. It incorporates the established neighborhoods of Downtown East and Elliot Park.\nThe areas makeover was jump-started by the demolition of the Metrodome and construction of U.S. Bank Stadium, which opened in 2016. The exit of the Star Tribune from five blocks near the stadium allowed Ryan Cos. to develop twin Wells Fargo office towers, the Commons, the Radisson Red hotel, the Block 1 parking ramp, the Edition apartments and the Millwright office building, where it is now headquartered.\nWith all of the new investments, businesses decided to rebrand the area East Town, hoping the name would become as well-used as the Mill District, Warehouse District and Uptown.\nMany other projects have also sprung up. Last month, Hennepin Healthcare Clinic and Specialty Centers, the HQ apartments and the new Finnegans brewery and taproom opened their doors.\nOne of the developers who has been in East Town the longest, George Sherman of Sherman Associates, is now working to bring in some of the retail services that the area still needs. Sherman is remaking an entire block on Washington Avenue next to the Old Spaghetti Factory with a hotel and apartment complex that will include a Trader Joes, Starbucks and Jimmy Johns sandwich shop.\nIn Thresher Square, a former farm equipment plant on part of the block, builders have installed new timber beams, similar to others that have been holding up the structure for more than a century. Sherman walked through it last week as they continued to frame the hotel rooms that will circle an atrium.\nHe then walked around the corner to his mixed-use project, dubbed East End, to check on progress for the new Trader Joes. Jogging up some stairs, Sherman came to the courtyard and shell of a dip pool for the apartment complex. With the housing, with the Trader Joes coming in, it is very walkable, Sherman said. You got to put up the buildings, then you get the people, then you get the fabric.\nOn the other side of East Town, Kraus-Anderson, a development company that has called Elliot Park home for 75 years, has remade not only its headquarters but the entire block with the recently completed HQ apartments complex, a hotel and Finnegans. There was a unique responsibility as well as opportunity, said Mike Hille, executive vice president of realty and development with Kraus-Anderson.\nMeanwhile, the Commons park, which was designed to unify the district, has been surprisingly divisive at times. The park is owned by the Park Board, leased to the city and managed by nonprofit Green Minneapolis, but its funding continues to be in flux and lawsuits have been filed criticizing its operation.\nThis is the best asset of this neighborhood, said Paul Mellblom, a principal at design firm MSR and president of the board of the East Town Business Partnership. Once the Commons has more investment, a secondary transformation of East Town should result, he said.\nA second phase of the park, which could include a cafe and operations building, has yet to be completed due to the lack of money. Last year, the Park Board agreed to allot up to $8 million in fees to the Commons for the next decade, which would likely still fall short of what is needed for improvements.\nBut many say the park is already well designed with a lot of programming. This is already the community asset that people want, said Beth Shogren, executive director of Green Minneapolis. They just need to know about it.\nThe need for awareness can also apply to the name East Town itself. Residents, workers and builders alike still use different monikers for the area.\nEast Town really hasnt caught on that much. To have a name like that catch it has to be adopted locally, said Joe Tamburino, who chairs the Downtown Minneapolis Neighborhood Association.\nSteve Fletcher, who represents Downtown East on the Minneapolis City Council, said hes not convinced the two neighborhoods of Downtown East and Elliot Park can be linked. Creating an identity across that doesnt feel organic, he said.\nTom Fisher, director of the Minnesota Design Center at the University of Minnesotas College of Design, said there needs to be more cohesiveness between the various parts of East Town but that the district idea does work.\nI think we need more north-south connections in the district because a lot of the open spaces run east-west, Fisher said.\nA 2017 urban study, produced by architecture and design firm BKV Group, identified Park and Portland avenues as connectors that could be developed to bridge the community.\nSuch changes wont be as dramatic as the construction of the past few years, but they are key to the financial and livability payoffs from all that work.\nFor instance, after leaving busy Nicollet Mall, Ryan Cos. was alone in its four-story Millwright building for a year. Now, the firm has a commitment from a tenant for the empty top floor.\nWe are moving the center of gravity of downtown, Ryan said.\nNicole Norfleet 612-673-4495\nTwitter: @nicolenorfleet", "url": "https://apnews.com/6875208fc5704920b3761f66255954a6"}