{"authors": ["Ayana Jones Tribune Staff Writer"], "date_download": "2020-05-04 20:12:49", "date_modify": "2020-05-04 20:12:49", "date_publish": "2018-02-13 05:00:00", "description": "In his new book “Rise and Grind,” Daymond John addresses how people can become more productive in their life and career. The CEO and founder of FUBU and Shark Tank investor gleaned...", "filename": "_7b385f46fdf947088b5ee76968290109_1588623169.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7b385f46fdf947088b5ee76968290109_1588623169.html", "title": "FUBU founder highlights tips on increasing productivity", "title_page": "FUBU founder highlights tips on increasing productivity", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In his new book “Rise and Grind,” Daymond John addresses how people can become more productive in their life and career.\nThe CEO and founder of FUBU and Shark Tank investor gleaned productivity tips for his book by interviewing 16 high profile people such as actress Catherine Zeta-Jones, musician Carlos Santana, entrepreneur Gary Vaynerchuk and talk show host Wendy Williams.\nThe idea to interview these individuals stemmed from John feeling overwhelmed by his busy lifestyle.\n“I started taking things from them that I could use in my life in making me more efficient and as I started doing that I became more efficient,” John said as highlighted his book during an event held by the Arts + Business Council of Greater Philadelphia.\n“We talk so much about business and how it’s done and inventory and assets but we don’t talk about the use and the masterization of time so I decided to put that in a book.”\nIn this follow up with to the New York Times and Wall Street journal bestseller, “The Power of Broke “ John reveals the strategies he and other business leaders use to achieve success everyday.\nOne of his key takeaways from his interviews is how these successful people are managing their social media.\n“The thing that I found the value the most of is that most of the successful people will not answer any e-mails in the first hour of the day, because as soon as you wake up answering e-mails you’re answering everybody else’s problems,” he explained during an interview with Colleen Rooney, chief communications officer and vice president, Communications and Community, QVC Group.\n“They look at their in box as their defense and their out box as their offense and so they’re always on offense.”\nAnother productivity tip is what John refers to as the one touch rule when something hits your desk. He said people should avoid analysis paralysis and deal with things before they pile up.\nJohn addressed the importance of turning your disadvantages into advantages. He has used being dyslexic to his advantage.\n“Being dyslexic made be apply myself more because whenever I read something I either didn’t retain all the information properly or I had to read it many times, so I just started to do it, to see if I could accomplish it, “ John stated.\n“I think that being dyslexic is something that really helped me in regards to becoming a person in business.”\nDuring the interview, John also gave some insight into what he looks for in an entrepreneur seeking an investment through the Shark Tank show.\n“I look at the person. I couldn’t care less about the product,” John stated. “I’m looking at you personally.”\nAfter his interview, John participated in an interactive panel discussion on entrepreneurship moderated by Traci Gusher, leader of Lighthouse – KPMG’s Center of Excellence for Data & Analytics and Artificial Intelligence. The panel of entrepreneurs also included Muhga Eltigani, founder and CEO of NaturALL Club, a subscription-based service specializing in delivering organic hair products; Ofo Ezeugwu, co-founder and CEO of WhoseYourLandlord, an online community of renters sharing landlord reviews, neighborhood insights and resources and William Tyrone Toms, co-founder, REC Philly, a marketing agency and creative incubator helps freelance creators grow their businesses.\nThe panelists addressed a range of topics including the importance of mentorship, successful crowdfunding methods and building a brand.\n“When it comes down to building a brand, what it really is, is you’re just building a community,” said Toms, who is focused on the entertainment and technology industries.\n“Audience building is dope but community building is more important. What all the best brands do is they build audiences around the ideas that they care about.”\nJohn, who grew up in Queens N.Y. started FUBU in 1992 with three close friends on a $40 budget. The company has since morphed into a global lifestyle brand with more than $6 billion in sales. John is the CEO of The Shark Group, a consulting firm whose clients range from Fortune 500 companies to new media businesses and celebrities. President Barack Obama appointed John a Presidential Ambassador for Global Entrepreneurship, a position focused on promoting entrepreneurship around the world.", "url": "https://apnews.com/7b385f46fdf947088b5ee76968290109"}