{"authors": ["Rebecca Moss"], "date_download": "2020-05-04 20:07:11", "date_modify": "2020-05-04 20:07:11", "date_publish": "2018-11-30 10:00:00", "description": "Ten years ago, a security guard at Los Alamos National Laboratory submitted a petition to the federal government seeking compensation and benefits for his fellow lab workers who were sick with...", "filename": "_75ecdd268ac145568d7bb41a712ae0e6_1588622831.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_75ecdd268ac145568d7bb41a712ae0e6_1588622831.html", "title": "‘JUSTICE DELAYED’", "title_page": "‘JUSTICE DELAYED’", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ten years ago, a security guard at Los Alamos National Laboratory submitted a petition to the federal government seeking compensation and benefits for his fellow lab workers who were sick with cancer and believed that radiation at the lab was to blame.\nAndrew Evaskovich’s petition took advantage of a process put in place by Congress in 2000 that allowed groups of workers to secure benefits if they could show that they worked at a nuclear facility, that they had a cancer linked to radiation and that lab managers failed to accurately keep track of their exposures over time.\nUnder the law, the National Institute for Occupational Safety and Health, a federal agency that makes recommendations on work-related injuries and illnesses, had six months to review Evaskovich’s petition and recommend whether it should be approved or denied.\nA decade later, Evaskovich and his colleagues are still waiting for a final answer.\nIn 2009 and again last year, NIOSH recommended that Evaskovich’s petition be denied. Both times, however, outside reviewers found major flaws in its analysis, and a federal advisory board told NIOSH to keep working.\nIn October, NIOSH again recommended that the petition be denied. And this month, outside reviewers again indicated that they had found serious problems in its analysis.\nDuring a meeting Thursday, members of the federal Advisory Board on Radiation and Worker Health agreed NIOSH had failed to answer key questions about record keeping and exposure at Los Alamos and asked the agency to continue looking into the matter. NIOSH said further investigation could take up to three years.\n“I’ve got a heartache with this,” said board member Bradley Clawson, a nuclear worker at Idaho National Laboratory.\nFacilities around the country continue to be fined for failing to limit radiation exposure and monitor workers, he said. “I am not going to take it on blind faith” that Los Alamos is following federal rules just because officials say they are.\nWhat has happened to Evaskovich’s petition is playing out at nuclear labs across the country. At the Savannah River Site in South Carolina, a petition has languished for 11 years. At Sandia National Laboratories in Albuquerque, workers have been waiting seven years for a final decision.\nTaken together, the delays show the glaring holes in a process set up to help injured nuclear workers collect compensation for radiation-linked cancers in a “timely, uniform and adequate” way, an investigation by the Santa Fe New Mexican and ProPublica has found. Petitions linger for years without resolution, violating the spirit, if not the letter, of the law. And NIOSH has repeatedly made improper conclusions about the safety and record keeping at Los Alamos and other sites, only to be contradicted by independent consultants and forced to redo its assessments.\nThe path to compensation has been particularly narrow for employees hired after 1996 — the year a new federal radiation safety rule took effect that required nuclear sites to limit radioactive risk and monitor workers’ exposure. The government assumed the new regulations meant workers would be safe, accurate exposure records would be kept and compensation decisions therefore could be based entirely on those records.\nIn fact, public records show Los Alamos consistently violated radiation and nuclear safety rules after 1996. In one incident in 2000, Los Alamos workers were exposed to what inspectors called one of the worst radiation events in decades.\nOne government report in 2008 found nuclear safety issues at the lab were “long-standing,” with few buildings following safety guidelines and numerous incidents of “unusually high, unexplained dosage reading for workers.”\nSince 2004, 269 petitions similar to Evaskovich’s have been filed with NIOSH for review. Of those, about half have been approved, mostly for those who worked at nuclear sites before the 1990s. NIOSH and the U.S. Department of Health and Human Services have yet to decide on 13 petitions, most of which seek to help workers employed after the mid-1990s.\nDavid Michaels, who helped establish the compensation program as assistant secretary of energy for environment, safety and health in President Bill Clinton’s administration and later led the Occupational Safety and Health Administration under President Barack Obama, said the problems identified by The New Mexican and ProPublica show the program is not working as intended. “Congress has to fix it,” he said.\nThis is not the first time government officials have been accused of delaying action on petitions by nuclear workers. In 2006, members of Congress faulted the administration of President George W. Bush after internal memos suggested plans to deny petitions based on cost, rather than on scientific merit, in order to keep the overall expense of the benefits program down.\nAs a result of the delayed petitions, thousands of workers across the country have been left to navigate the benefit process by themselves, sometimes with incomplete or questionable exposure and employment records. Often, they are denied benefits. Last month, The New Mexican and ProPublica profiled the case of Chad Walde, a maintenance worker at Los Alamos who was diagnosed with brain cancer in 2014 and whose claim for benefits was denied. Walde’s recollections of his radiation exposure, confirmed by family members and colleagues, were not reflected in the lab’s official records, which formed the basis of the denial. Walde died in June 2017.\nAt Los Alamos alone, at least 967 people who began working at the lab since 1996 have applied individually and been denied compensation for cancer, and most of them would become eligible for benefits if Evaskovich’s petition is approved. Another 800 people have been approved, federal data show. Countless others may be sick but haven’t applied, said former New Mexico Gov. Bill Richardson, energy secretary during the Clinton administration.\nThe Department of Energy, which oversees nuclear labs, and NIOSH say that nuclear sites are safer and have done a better job monitoring workers since 1996, largely because of the new federal rule.\nThe regulation requires sites to limit the amount of radiation workers are exposed to annually, monitor the amount of radiation absorbed by skin and inside the body for “at-risk” workers, and implement plans to protect workers from radiation. The government says it is confident the only workers who weren’t monitored were those who faced no risk of radiation.\nLos Alamos spokesman Kevin Roark said all employees who work near radiation are required to wear badges that measure their exposure and that the lab complies with all federal requirements. “Radiation exposure,” he said, “has been consistently recorded at the laboratory over many decades.”\nBut Joe Fitzgerald, an independent consultant paid by the government to assess the scientific integrity of NIOSH’s work, said last year that officials should have analyzed how well the lab’s radiation protection program was actually working rather than taking Los Alamos at its word that it was following the more stringent federal safety regulations.\nThe lab “did not magically” have the ability to follow the rules in 1996 just because the government said it had to, Fitzgerald told the Advisory Board on Radiation and Worker Health, which includes physicians, scientists and workers and was established to advise the government.\nFitzgerald, who has been working with the advisory board for roughly 15 years, declined to discuss the petition in an interview.\nIn his most recent assessment, dated Nov. 16, Fitzgerald concluded NIOSH’s latest recommended denial again ignored serious questions about the adequacy and completeness of worker-monitoring records at Los Alamos.\nIn an interview in September, a NIOSH official acknowledged that the agency was wrong to assume that Los Alamos was implementing radiation safety rules for years.\n“I thought we were being efficient and expedient, and it didn’t work out,” said LaVon Rutherford, a health physicist responsible for reviewing the petition Evaskovich filed.\nStill, Rutherford said he stands behind the integrity of his agency’s assessments and believes the petition should be denied.\nThe lab says training and other precautions are taken before work is done at the lab. Moreover, at-risk workers are identified after accidents. It says its rate of worker injuries is far lower than “comparable industry averages.”\nBut post-Cold War workers are stuck in something of a bureaucratic loop. To qualify for compensation, they must prove they were exposed to a certain amount of radiation. But they can’t show that because, they say, the lab didn’t properly monitor them. All told, Evaskovich gathered more than 50 examples of issues that he believed had prevented the lab from correctly tracking workers’ exposure.\nEvaskovich, who started working on the petition in 2005, said federal officials have failed to address his concerns and problems at the lab are only continuing.\n“I’ve felt frustrated for the last 12 years,” he said. “It’s a tough job.”\nA question of compensation\nIn September 1999, workers at a Department of Energy uranium processing plant in Paducah, Ky., sued the plant’s management contractors, including Union Carbide Corp., Lockheed Martin Corp. and others. They alleged the contractors deliberately withheld information from workers about the risks at the plant. A separate lawsuit accused the contractors of defrauding workers and the government about the amount of plutonium in the environment surrounding the plant, reporting lower levels than what actually existed. The U.S. Court of Appeals for the 6th Circuit ruled against the workers in the class action, and the Supreme Court declined to hear the case. The environmental lawsuit ultimately was settled.\nThe disclosures, however, were among many revelations in the late 1990s that shaped how the Department of Energy crafted its compensation program for nuclear workers with cancer and other illnesses. Richardson, the energy secretary at the time, apologized on behalf of the government for failing to inform workers of the risks at Paducah and other sites.\nIn 2000, the Paducah workers became the first to be designated a “special exposure cohort” under the Energy Employees Occupational Illness Compensation Program Act passed by Congress. It meant workers wouldn’t need to show they were individually exposed to radiation, only that they worked at the site during the time period when exposure was likely and had one of 22 radiation-linked cancers. Workers at uranium production sites in Ohio and Tennessee received similar designations.\nUnder the law, groups of workers at other nuclear facilities could apply for this special status, too, if they could show similar problems with record keeping. Each petition would essentially amount to an investigation into federal and laboratory safety and documentation practices.\nThe process required coordination between the Department of Energy, NIOSH and the Department of Labor, which oversees the claims process. The Department of Energy would turn over environmental and worker radiation records to NIOSH, which would take that data and run elaborate risk calculations that compare the hazards present at a site to their likelihood of harming workers. The final say on the petitions was left to the Health and Human Services secretary.\nThe rollout of the law did not go smoothly. In the years after its passage, Health and Human Services delayed putting in place regulations to implement the petition process.\nIn February 2004, 16 senators, including Hillary Clinton of New York and Pete Domenici of New Mexico, wrote to the Health and Human Services secretary urging action, and the department began accepting petitions that year.\nBut before long, there was again resistance, this time from the White House and Department of Labor, which were anxious about the number of workers who might qualify for benefits because of approved petitions — and the amount of compensation the government would have to pay.\nIn 2005, Shelby Hallmark, director of the Department of Labor’s Office of Workers’ Compensation Programs, wrote in an email to the White House Office of Management and Budget: “We should do everything possible to oppose” the petitions, saying this would be “the single most effective way to prevent billions of dollars in spending.” One memo proposed allowing “interested agencies,” including the White House and the Labor Department, an opportunity to comment on the outcome of each petition.\nAfter the memos were leaked to the Associated Press and lawmakers, Congress held five hearings on the topic. Rep. John Hostettler, R-Ind., said during one hearing that such efforts “would not bear well under scrutiny. Those involved in this backroom manipulation of the program have destroyed the government credibility again.”\nOthers who participated in the hearings pointed to other memos Hallmark had written, made public by Congress, trying to limit the power of the federal advisory board and its consultants. In one, Hallmark suggested the independent consultant reviewing NIOSH’s work, Sanford Cohen & Associates, was too worker-friendly because of its criticism of the agency.\nHallmark acknowledged in a recent interview that he had concerns about the cost of the program. But more broadly, he said he believed the approach scientists were using to estimate a person’s risk of developing cancer was flawed.\n“I was concerned about cost,” he said, “but my main concern was having a program that was balanced and rational.”\nHe said he thought Congress should get rid of the petition process and NIOSH’s reliance on exposure data for individual claims.\nIn the years that followed, the Government Accountability Office determined the claims process and the scientific review involved had proved to be more difficult and expensive than anticipated.\nThe GAO also questioned a lack of transparency within the Labor Department, which was weighing in on scientific decisions without explaining why. That “could give the appearance of an effort to deny benefits to eligible claimants,” the GAO wrote in 2007.\nAt a congressional hearing that year, Dr. James Melius, an international medical expert who chaired the Advisory Board on Radiation and Worker Health, said the amount of time it was taking for NIOSH to process petitions and individual workers’ claims far exceeded what was reasonable.\n“We need to make that process work better,” said Melius, who helped create the compensation fund for 9/11 first responders and died in January.\nHe said that if a petition review went beyond a set period of time, it should automatically be approved. “If not, it’s justice delayed a long time.”\nBut his advice has not been heeded.\nThe quest that doesn’t end\nAs Congress was reviewing the program, Evaskovich found himself navigating the Las Vegas Strip in September 2006.\nHis union, International Guards Union of America Local 69, had paid his way to attend a meeting of the advisory board. Evaskovich sat beside Harriet Ruiz, a former New Mexico state legislator who had written a petition asking that Los Alamos workers employed through 1975, including her husband, Ray, be designated a special class for benefits.\nRay Ruiz, who served in the New Mexico House of Representatives, had died of lung cancer while working on the petition. His wife took over his House seat and his work advocating for his former Los Alamos colleagues.\nEvaskovich’s fellow guards, however, worried that Ruiz’s petition, which would be approved in 2010, would do little to help them because few, if any, had worked at the lab in 1975. Some of them hadn’t even been born at the time. Even though some were young, they were sick and wondered if their cancers were caused by radiation. They said they stood guard in normal uniforms as scientists worked nearby in layers of protective clothing and masks.\nAt that first meeting, Evaskovich learned those filing petitions had dedicated years of their lives to trying to unearth information about problems within a department that is one of the nation’s most secretive. Many were the friends, co-workers, wives or children of sick nuclear workers.\nEvaskovich returned to Los Alamos and promised his union brothers that he would be their champion. Each day, after his shift at the lab, he would deposit his gun, hit the gym and then go to the union house to research the health and safety conditions that surrounded him.\n“I saw there was a problem and I wanted to help,” he said.\nOne Memorial Day, he recalled, the guards wrote the names of their deceased colleagues on a whiteboard, with the cause of death listed beside. Almost all of them had died from cancer, Evaskovich said.\n“There were a lot of names on there,” he said. “It struck me as a pretty significant number.”\nIt took Evaskovich nearly two years to complete the petition, but in April 2008, he filed his request, asking that workers employed at the lab between 1976 and 2005 be given the special designation that would make it easier to gain benefits. His petition was accompanied by a 10-pound box of documents and digital CD-ROMs.\nHe had submitted documentation that well after the early ’90s, Los Alamos was not following some aspects of the Clean Air Act and had other environmental monitoring problems. The petition described how open-air explosive tests at the lab released depleted uranium and other toxic substances into the atmosphere, spreading debris throughout lab property. In affidavits, workers described handling radioactive water and burying the bodies of irradiated animals while wearing little protective clothing.\nEvaskovich also researched an incident he remembered firsthand: In the summer of 2005, a scientist opened a package sent from the lab’s plutonium facility and released radioactive americium. The scientist spread the contamination through the laboratory, to a grocery store, into his home and across three states. It was on the security badge he handed over to guards each day. Eleven days passed before lab managers realized anything was wrong. Only on that day were workers checked for radiation exposure.\nRoark, the lab spokesman, said the response to this event was “comprehensive and deliberate.” He said the lab tracked where the contamination spread and which individuals were affected.\nIn the summer of 2008, after Evaskovich submitted his petition, people stood on the sidewalk in Española, advocating for workers struggling to access federal benefits. They held up signs to passing traffic that read “Approve our claims now” and “ ‘Good’ Jobs Today, Sickness and Death Tomorrow: LANL.”\nRemembering that first meeting in Las Vegas, Nev., Evaskovich knew that it could take a couple of years for his petition to move through the system, but he didn’t expect what was to come.\nIn January 2009, NIOSH recommended that the Los Alamos petition be rejected.\nNIOSH said that, dating back to the 1970s, Los Alamos had kept robust proof of its workers’ exposure to radiation and the documentation was sufficient to know the unique risk faced by each worker. Because of that, the agency said, it was confident a special cohort was unnecessary.\nBut the recommendation overlooked numerous issues, including a large federal investigation into the laboratory’s practices in 1991 that directly contradicted many of NIOSH’s conclusions. It found hundreds of significant problems with how the University of California, which independently ran Los Alamos at the time, was handling environmental health and safety at the lab.\nNIOSH’s report drew pushback from the federal radiation advisory board, independent scientific consultants and members of Congress. The consultants, Sanford Cohen & Associates, found certain types of health monitoring had actually decreased in the ’90s, which could make it difficult for NIOSH to accurately assess claims from that period.\nThree years later, NIOSH reversed its decision. In the late summer of 2012, the agency said it had been wrong in its 2009 findings and actually didn’t have enough information about workers or environmental contamination to estimate their radiation exposure. The agency found that workers employed prior to 1996 “may have accumulated substantial chronic exposures through intakes of inadequately monitored radionuclides.”\nNIOSH recommended allowing those employed before 1996 to be eligible for benefits without proving they were exposed. It said it would continue to review the petition covering those who started work from 1996 to 2005, but it assumed Los Alamos followed the Department of Energy’s new occupational radiation protection rule as of Jan. 1, 1996.\nBack to the drawing board\nIt took until April 2017 for NIOSH to release another recommendation on the Los Alamos petition filed by Evaskovich. The agency again recommended it be rejected.\nThe agency said in several public meetings that it was delayed in reaching a decision in part because it could not access all the records it needed from Los Alamos prior to early 2017.\n“We are also going to review the current reporting system as soon as we get access to that,” NIOSH official Rutherford told the advisory board at a meeting in November 2016.\nRoark, the Los Alamos spokesman, said radiation records are “readily accessible” and “our complete exposure history has been provided” to NIOSH.\nStuart Hinnefeld, director of the compensation analysis and support division for NIOSH, told The New Mexican that while the Department of Energy in general has been “very responsive” to NIOSH’s requests, the agency has little recourse to compel the department or its contractors to provide records.\n“There is no bully pulpit,” he said. “We are somewhat limited in terms of the aggressive approaches we can take with another agency.”\nOnce NIOSH obtained access, it said it had found Los Alamos was following the federal radiation protection rule.\nWhile only half of the workers who filed claims for cancer had monitoring records for urine samples to measure radiation exposure, Rutherford said he was not troubled by that the number. Not all workers needed to be monitored, he noted, just those in high-radiation areas. For the others, their jobs shouldn’t involve them having contact with radiation.\nBut within four months, Sanford Cohen & Associates came back with its own report. It again found numerous problems with the national institute’s conclusions.\nWhile NIOSH said the mid-1990s represented a turning point in nuclear safety, Fitzgerald, the independent consultant who reviewed its work on behalf of Sanford Cohen & Associates, said this shift did not happen immediately.\n“Radiation protection was very much an evolutionary program,” he said during a teleconference last summer with the advisory board and NIOSH.\nProblems with health and safety programs were deeply rooted, he said, and couldn’t be “turned around overnight by a piece a paper.”\nIndeed, records show that the Department of Energy and its National Nuclear Security Administration, which oversees the nuclear labs, had cited more than 50 violations of radiation protection and other safety rules at the lab between 1996 to 2005. That would have amounted to more than $3.4 million in fines, but those penalties were ultimately reduced and waived.\nIn 2003, Linton Brooks, then the administrator of the National Nuclear Security Administration, wrote that “LANL’s previous corrective actions have not been effective in preventing the recurrence of the radiological and safety” violations after yet another problem occurred that year.\nFitzgerald said Los Alamos and other sites were given “quite the latitude as to what extent that their existing programs met” the Department of Energy’s radiation safety rule.\nThe process began again. When NIOSH responded to Fitzgerald’s critique this October, the agency agreed Los Alamos had not completely followed the 1996 radiation safety rule and that there had indeed been violations. But NIOSH said there was ample evidence to conclude the lab had been adequately monitoring workers in recent years.\nNIOSH once again said it could use algorithms to determine how much radiation workers were exposed to based on data supplied by the lab. That would allow each worker’s claim to be judged individually.\nRoark, the Los Alamos spokesman, defended the lab’s compliance with Energy Department rules, saying “isolated violations over roughly a decade do not amount to” problems with their program.\nIn a PowerPoint presentation during Thursday’s advisory board meeting, Fitzgerald again said many of NIOSH’s assumptions were unfounded. His findings also noted NIOSH had not addressed problems identified by the lab and the Department of Energy in the late ’90s that were not corrected until the early 2000s.\nJosie Beach, who chairs the federal advisory board’s working group focused on Los Alamos, suggested the group recommend Evaskovich’s petition be approved, at least for workers employed before 2000.\nBut other board members said they should give NIOSH more time to determine what new records they might need to prove Los Alamos’ unmonitored workers weren’t at risk.\nNIOSH said it will provide a plan to the board by March.\nThe fight continues\nCriticism of NIOSH’s work has extended to several other laboratories, with consultants frequently poking holes in the agency’s logic.\nIn late 2007, an attorney filed a petition on behalf of workers at the Savannah River Site in South Carolina asking that workers employed between 1950 and 2007 be granted special status.\nThree years later, NIOSH recommended the petition be denied, saying, just as it had with Los Alamos, that it could use equations to estimate how much radiation every worker at Savannah River had been exposed to since 1950.\nDavid Anderson, an attorney working on the matter, disagreed. “When we looked more closely at these methods and data, we discovered alarming levels of inappropriate extrapolation and even exaggeration, as well as significant gaps” in their data, he said during an advisory board meeting in 2012.\nThe Advisory Board on Radiation and Worker Health hired Sanford Cohen & Associates to evaluate the NIOSH recommendations at Savannah River and it agreed with Anderson’s critique. The group questioned how workers were tested for radiation absorption after 1996.\nThe critiques prompted NIOSH to reassess its work and partially reverse itself. The government ultimately determined all workers employed between 1952 and 1972 should be eligible for benefits. The petitioners are still trying to gain benefits for more recent years.\nRichardson, the former energy secretary who established the employees’ compensation program in 2000, said work at nuclear facilities is “still dangerous.”\n“There’s a lot of new positive safety, accountability measures, but there are still workers that are getting exposed and we should at the very least treat them right and give them medical attention and protect them,” he said in an interview with Investigate TV, a partner with ProPublica and The New Mexican.\nRichardson estimated hundreds of thousands of workers could be eligible for benefits but lack the records to support their claims.\nAfter more than a decade working on the petition, Evaskovich feels like the system is stacked against him and other petitioners. For years, he has organized his vacations around NIOSH meetings in Florida, Ohio, New York, Georgia and Colorado so he can plead his case, on his own dime.\nEvaskovich said safety is still not where it should be. Friends still get injured on the job, new guards are still not always enrolled in monitoring programs and his colleagues still warn one another to avoid unsafe material scattered at a site, he said.\n“There isn’t a problem with having safety concerns and addressing them,” he said. “It may cost, but it’s cheaper than having people die on the job.”\nProPublica researchers Decca Muldowney, Alex Mierjeski and Gabriel Sandoval contributed to this report.\nRebecca Moss covers energy and the environment, including Los Alamos National Laboratory, for the Santa Fe New Mexican. Email her at rmoss@sfnewmexican.com and follow her on Twitter @rebeccakmoss.", "url": "https://apnews.com/75ecdd268ac145568d7bb41a712ae0e6"}