{"authors": ["Rodd Cayton", "The Daily News"], "date_download": "2020-05-04 20:08:35", "date_modify": "2020-05-04 20:08:35", "date_publish": "2018-01-05 05:29:00", "description": "BULLHEAD CITY — Terry Puryear wants the public’s help in saying “no” to state legislators. Puryear is public affairs coordinator at Mohave Electric Cooperative. He spoke recently to a local...", "filename": "_16a01fe4c2534625977c677254ac2554_1588622915.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_16a01fe4c2534625977c677254ac2554_1588622915.html", "title": "State wants to claim unrefunded MEC deposits", "title_page": "State wants to claim unrefunded MEC deposits", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BULLHEAD CITY — Terry Puryear wants the public’s help in saying “no” to state legislators.\nPuryear is public affairs coordinator at Mohave Electric Cooperative. He spoke recently to a local group about a proposal to siphon into Arizona’s general fund money that is owed to the utility’s members.\nThe money is in what MEC calls “unclaimed capital credits.”\nPuryear told the Colorado River Republican Women’s Council at its December meeting that the money is the property of members who leave the area without collecting it, such as when they are due refunds on their deposits.\nMEC’s position is that the capital credits belong to the cooperative and are a form of equity, and originally were intended for use by the cooperative.\nMEC now uses the money to buy new poles, transformers and other system improvements that otherwise would require loans. The money also benefits programs that include River Fund, Inc., the Northern Arizona Veterans Resource Center, MEC’s Classroom Grants Program and the annual Washington D.C. Youth Tour.\nPuryear said that the Arizona Department of Revenue plans to “sweep” that money, in a manner similar to that in which the state has withheld local highway and state park dollars in recent years. The Department of Revenue would then disperse the money statewide.\nPuryear said that electric cooperatives are opposed to that plan, viewing the credits as local money that should stay in local economies.\nMEC is responding with a Call to Action, a strategy aimed at showing state officials the resistance present in the affected communities.\nThe latest development in the strategy is a letter-writing campaign, directed toward officials representing state Legislative District 5: Sen. Sonny Borrelli and Reps. Regina Cobb and Paul Mosley.\n“This campaign is intended to inform these officials that these funds should not be unfairly swept by the Arizona Department of Revenue,” Puryear said.\nThe letters are to be hand-delivered to LD5 representatives at the Co-op Legislative Rally later this month.\nPuryear said that many Mohave County residents already have signed letters supporting the effort.\nPuryear did not provide an exact dollar amount, “but if you look at the list of programs we support in the community with assigned capital credits ... it’s a significant number,” he said.\nAnyone interested in signing a letter may go to www.mohaveelectric.com/content/Call-to-Action to get more information, or visit the MEC office at 928 Hancock Road, where member service representatives will assist in signing letters.\nPuryear will address the Colorado River Tea Party Patriots at 2:30 p.m. Saturday at the Mohave County Library, 1170 Hancock Road.", "url": "https://apnews.com/16a01fe4c2534625977c677254ac2554"}