{"authors": ["Metro Creative"], "date_download": "2020-05-04 20:07:19", "date_modify": "2020-05-04 20:07:19", "date_publish": "2018-02-02 10:06:28", "description": "Statistics indicate more and more men, women and children are overweight or obese. The National Institutes of Health state that more than 35 percent of adults in the United States are obese and...", "filename": "_eb0926e0787a452e83356c62576120c7_1588622839.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eb0926e0787a452e83356c62576120c7_1588622839.html", "title": "Is dieting or exercise better for weight loss?", "title_page": "Is dieting or exercise better for weight loss?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Statistics indicate more and more men, women and children are overweight or obese. The National Institutes of Health state that more than 35 percent of adults in the United States are obese and more than 34 percent are overweight, while 17 percent of children and adolescents in the United States are obese. Obesity rates are three times as high among today’s children than they were among youngsters just one generation ago.\nAs individuals attempt to lose weight, they may wonder what is the most effective way to accomplish that objective. Some argue that the secret to weight loss is lots of exercise, while others insist that calorie control is the key. When it comes to slimming down, some may be surprised by what the experts have to say.\nThe Mayo Clinic advises that cutting calories through dietary changes appears to promote weight loss more effectively than physical exercise alone. According to Shawn M. Talbott, Ph.D., a nutritional biochemist and former director of the University of Utah Nutrition Clinic, weight loss is about 75 percent diet and 25 percent exercise. People generally see the largest short-term results when they eat healthy foods and healthy portions.\nPoor diets can be difficult to overcome, as it takes a lot of exercise to spur dramatic weight loss, whereas a low-calorie, healthy diet can be a simple and effective means to losing weight. Nutritionists often point to a balanced diet that focuses on fruits and vegetables, lean proteins and whole-grain carbohydrates over fad diets or ones that require the adherence to strict guidelines that are difficult to follow for lengthy periods of time.\nBut exercise should not be abandoned in favor of a low-calorie diet. Dr. Yoni Freedhoff, who runs one of the largest obesity clinics in Canada, says that weight loss occurs from what’s created in the kitchen, but health is gained\nin the gym. Freedhoff often advises his clients to make smart changes to the foods they eat to spur weight loss, and then incorporate exercise into their lifestyles as a way to keep the body in top form. Regular physical exercise is necessary to maintain strong bones, build muscle, improve flexibility, and keep the cardiovascular system working efficiently. Exercise also releases endorphins, which can improve mental alertness and feelings of well-being.\nThe Mayo Clinic notes that studies have shown that people who lose weight and keep it off over the long haul are those who get regular physical activity.\nWhen it comes to losing weight, the foods a person eats play a bigger role than exercise. But it is the combination of both diet and exercise that can lead to greater overall health and sustained weight loss.", "url": "https://apnews.com/eb0926e0787a452e83356c62576120c7"}