{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Matt Bruenig", "Corey Robin"], "date_download": "2020-05-04 19:59:07", "date_modify": "2020-05-04 19:59:07", "date_publish": "2018-06-21 00:00:00", "description": null, "filename": "2018_06_teenagers-anxiety-study-medicare-for-all-free-college-education-privatization_1588622347.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/06/21175135/34589074824_4f5004c4f2_h-e1529617906656.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_06_teenagers-anxiety-study-medicare-for-all-free-college-education-privatization_1588622347.html", "title": "The Age of Teenage Anxiety", "title_page": "The Age of Teenage Anxiety", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\n“An adolescent’s world can be bleak,” said an official with the Centers for Disease Control and Prevention this week. The agency just released the results of its National Youth Risk Behavior Survey, which revealed an increase in teens reporting “feelings of sadness or hopelessness.” The report found that “during the 12 months before the survey, 31.5% of students nationwide had felt so sad or hopeless almost every day for 2 or more weeks in a row that they stopped doing some usual activities.” Overall, the numbers portray a teenage populace that — while less likely than a decade ago to binge drink, for example — is increasingly discouraged. To cope with the problem, the CDC urges intervention by schools and health-care providers. But we also shouldn’t neglect to ask bigger questions about how to actually make life better for teenagers. And while there’s no doubt that acute interventions by schools, service providers and caretakers can be crucial in many cases, making life better for teens requires thinking about how we arrange society as a whole — and how we might rearrange it. Here are three large-scale reforms that would dramatically improve young people’s lives. Because they all involve major redistributions of society’s material resources, they can only be won through mass political struggle against entrenched capitalist interests. Perhaps that’s why we rarely hear them mentioned in typical conversations about public health: they require more political imagination than we’re used to. These reforms would undoubtedly make life seem less bleak, less scary and less hopeless for teenagers — but not just teenagers. By emphasizing collective social wellbeing over private profits they would improve life for all of us.\nMedicare for All Nearly ten percent of American adolescents are medically uninsured. This means two million teenagers have no access to medical care that they can’t afford out-of-pocket, and since the majority of uninsured people live in poverty, that often means no medical care at all. Medicines to treat depression can cost up to $200 a month without insurance, and an ambulance ride goes for over $1,000 out-of-pocket in some places. Any serious program aimed at improving teen health, mental or otherwise, needs to start with a demand for universal health insurance, no exceptions. But universal access to the current insurance system won’t cut it. In United States today, even people who are insured are frequently blocked from attaining the care they need. That’s because in the US health insurance provision is dominated by private companies oriented entirely around profit, and therefore materially motivated to reject clients, trim services, and deny claims wherever possible. Consequences for teenagers range from not having access to mental and behavioral health specialists — which are disproportionately out-of-network — to experiencing financial difficulties at home that are exacerbated by unaffordable deductibles and out-of-pocket expenses. We need not only to design a system where everyone is insured, but also to shift the responsibility for financing health care from the private to the public sector. A single-payer healthcare or Medicare for All system, at least as socialists envision it, would not only guarantee that teenagers and their families have insurance, but that all care is cost-free at the point of service — no premiums, copays or deductibles. The system would be financed through taxes based on ability to pay. Contrary to neoliberal folk-wisdom that capitalist markets can provide everything society needs better and more efficiently than public programs, under a single-payer system Americans would see their healthcare costs drop while their access to health services goes up. Unlike private insurance, where profit-driven companies play doctor for their clients by selecting which services they deem medically necessary, a single-payer insurance program would cover everything that requires a health professional, for everyone. Teenagers and their families would be able to access everything from ambulance rides to mental, reproductive and sexual health services, without prohibitive costs or corporate gatekeeping. This would not only make it easier to stage acute interventions when teenagers are in crisis, but it would also improve their families’ and communities’ overall financial and health outlooks. And that would make life a lot less bleak.\nStop School Privatization Even in the United States, the beating heart of global capitalism, ordinary citizens tend to believe that some things are too vitally important to be left exposed to the free market. For a long time public education was chief among these, and there was a broad consensus that the government should provide free public education to the nation’s children with money raised through taxes. But capitalism is driven by a compulsion to open and invade new markets, and when it lacks a viable opposition it will target even our most sacrosanct public institutions for privatization. For decades, as funding drained from local public schools — especially in poor and racially segregated neighborhoods — neoliberal reformers advocated privatizing them in whole or in part, through voucher schemes and charter schools. The worse those schools performed, the louder the privatization chorus grew, and the more plausible their solutions looked to desperate parents and students. In other words, after years of denigrating and neglecting public education, neoliberals looked upon their handiwork with feigned horror and proclaimed that public education system irreparably broken. It must—for the kids, of course—be replaced by a labyrinthine patchwork of semi-private alternatives, which are partially publicly funded but from which someone always profits. By allowing charter schools to siphon kids out of public schools, and by funding that outsourcing of education with public money, we’re subsidizing the “death by a thousand cuts” of our own public educational system. And when the institutions meant to serve teenagers are so visibly de-prioritized and allowed to decay, the teenagers are bound to notice. It’s hard to imagine that there isn’t a correlation between teenagers feeling demoralized and the deterioration of the institutions where they spend most of their waking lives — schools with larger class sizes, decaying equipment, fewer teachers at worse pay, evaporating art and recreational opportunities, and dwindling mental health support, all due to austerity budgets and neoliberal market-based reforms. The enormity of the threat to public schools, and the magnitude of the task of restoring them, can’t be overstated. But a moratorium on charter schools would be a good place to start.", "url": "https://www.jacobinmag.com/2018/06/teenagers-anxiety-study-medicare-for-all-free-college-education-privatization"}