{"authors": ["Daniel Finn", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:10", "date_modify": "2020-05-04 19:56:10", "date_publish": "2018-09-14 00:00:00", "description": null, "filename": "2018_09_labour-antisemitism-controversy_1588622170.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/09/14103441/Jeremy_Corbyn_Leader_of_the_Labour_Party_UK_speaking_at_rally.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_09_labour-antisemitism-controversy_1588622170.html", "title": "The Antisemitism Controversy", "title_page": "The Antisemitism Controversy", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe latest stage of the synthetic controversy about “Labour antisemitism” in Britain has now reached a provisional conclusion. The party’s National Executive Committee (NEC) caved under pressure and voted to accept constraints on what Labour members are permitted to say about Israel. This decision will not draw a line under the controversy; it will simply embolden the party’s critics (as could be seen within a few hours of the vote). However, it does provide an opportunity to draw up a balance-sheet of the ludicrous affair that has dominated coverage of British politics for an entire summer. There are clear lessons to be drawn for any left-wing party that takes a principled stand in defense of Palestinian rights.\nA New Phase Anyone who has followed previous episodes in this ongoing row will be familiar with the basic pattern, but this chapter has had several distinctive features. First, Labour’s critics have ramped up the rhetoric to a much higher level. In place of the sly innuendo and guilt-by-association tactics used previously, we have seen frank assertions that the Labour Party under Jeremy Corbyn is directly comparable to the Nazis and harbors genocidal intent towards Britain’s Jewish population. The country’s media has passed along these grotesque falsehoods without the slightest hint of critical analysis. Second, the critics have adopted a new approach to smearing the Labour leadership. Formerly their stock-in-trade was exaggeration: find a handful of genuine incidents involving a tiny proportion of Labour’s membership and present them as being representative of the entire party; take insensitive or ill-informed comments and present them as evidence of hardened bigotry. This time, however, we have had the purest example of a “meta-controversy” you are ever likely to find: a row about antisemitism that has absolutely nothing to do with prejudice against Jews. Rather than making a mountain out of a molehill, Labour’s detractors have spent their time simply assuring us that the mountain really does exist, somewhere beneath a cloud of hot air, even if it remains invisible to the naked eye. Finally, the implicit subtext has now been made fully explicit: the controversy is not really about antisemitism at all, it is about attitudes towards Israel and the Palestinians. The entire row has focused on an alleged “definition of antisemitism” that lays down very detailed guidelines for what people are and are not allowed to say about Israel. Instead of defending those guidelines on their merits, their advocates have tried to impose them by brute force, deploying slander and emotional blackmail in place of reasoned argument. They will continue to use the same tactics against anyone who puts forward effective criticisms of the Israeli state. There will be no “drawing a line” under this saga. The bullies have to be faced down with the same determination they bring to the task of smearing their opponents. Otherwise they will prevail.\nDelegitimizing Solidarity For all the space devoted to this controversy in Britain’s media, the basic facts of the matter have been sorely lacking. The International Holocaust Remembrance Alliance (IHRA) has put forward a “working definition of antisemitism” that includes eleven examples that “could, taking into account the overall context” be construed as antisemitic. Some of these examples are clearly antisemitic in any context — calling for Jews to be killed, denying the Holocaust took place, etc. But several concern attitudes toward Israel. It should certainly be uncontroversial to accept that “holding Jews collectively responsible for actions of the state of Israel” is a form of antisemitism. But other “examples” are far more dubious, in particular the following: “denying the Jewish people their right to self-determination, e.g., by claiming that the existence of a State of Israel is a racist endeavor”, and “applying double standards by requiring of it a behavior not expected or demanded of any other democratic nation”. The first casts a shadow of suspicion over any accurate historical account of Israel’s settler-colonial origins and the violent dispossession of the Palestinian people between the Balfour Declaration of 1917 and the 1947–48 war. The second contains a built-in premise — Israel’s status as a “democratic nation” — that only makes sense if we pretend that the occupation of Gaza and the West Bank since 1967 is strictly external to the Israeli state and has no implications for its political character. As many commentators have pointed out, these “examples” can be used — and have already been used — to censor and delegitimize Palestine solidarity activism in Britain and elsewhere. That is precisely why pro-Israel campaigners are so insistent that they must be adopted in full. It is not a question of the text being misused for partisan ends. The wording itself allows for such use. As a definition of antisemitism, it is inherently flawed and unfit for purpose. Even the relentlessly partisan, sub-standard report of the Home Affairs Committee at Westminster suggested that it could only be adopted with “caveats”. However, as a tool for undermining support for Palestinian rights, the IHRA definition works very well. In this respect, its vagueness is an asset, not a liability. The Israeli state and its supporters usually insist that they have no problem with criticism as such, but once that criticism crosses a certain ill-defined boundary it becomes antisemitic. In practice, the line always happens to coincide precisely with the point at which such criticism might prove troublesome for Israel. Toothless, ineffectual criticism is fine; robust, hard-hitting criticism is illegitimate.\nMaking a List There can be no meaningful discussion of antisemitism in the modern world that does not take account of the way that the Israeli state and its supporters routinely muddy the waters by lumping criticism of Israel together with bigotry against Jews. The annual “list of antisemitic/anti-Israel incidents” published by the Simon Wiesenthal Center (SWC) exemplifies this approach, in a way that would be comical if the real-life consequences were not so serious. In 2014, the SWC listed a row between US journalist Max Blumenthal and the German Left Party leader Gregor Gysi over the party’s policy towards Israel as the fourth-worst incident of “antisemitism” anywhere in the world that year. By comparison, the murder of three American Jews by a KKK supporter only ranked ninth, trailing behind a Palestine solidarity event at UC Berkeley in eighth place. In 2015, the EU’s decision to correctly label the produce of Israeli settlements became the world’s third-worst instance of “antisemitism” — just behind a threat from ISIS to kill Jews wherever they lived. The following year, a UN resolution against settlement expansion in the Occupied Palestinian Territories became the worst example of “antisemitism,” followed by the British Labour Party, French labels on settlement produce, and support for the BDS campaign. Richard Spencer’s “sieg heil”-ing neo-Nazi rally in Washington could only manage fifth place, while state-sponsored Holocaust denial in Poland barely scraped onto the list at tenth place. Any one of those risible “lists” should have been enough to discredit the SWC for good, but it remains a widely respected and influential campaigning group — and a leading advocate for the IHRA’s antisemitism definition.\nSetting Standards Supporters of the definition have tried very hard to avoid engaging in discussion about its merits at all. They lean heavily upon a circular argument. Everyone should accept the IHRA document because it’s the standard definition. And why is it the standard definition? Because everyone accepts it. In fact, they don’t. The proponents of the IHRA text refer to it as the “internationally accepted definition,” which is only true in the sense that Buddhism is the internationally accepted religion, or baseball is the internationally accepted sport. At the time of writing, a tiny handful of the UN’s member-states have accepted the IHRA’s definition in full, by the organization’s own account. (All of those states, with the exception of Israel, are European.) Labour’s NEC correctly decided earlier this year that the IHRA document was not fit for purpose in its original form and made some adjustments to protect the right to criticize Israel in its own code of conduct. If you’re wondering where the real substance of this controversy begins, that’s all there is. For an entire summer, claims that Labour poses a grave threat to the survival of Britain’s Jewish community have been allowed to dominate the news cycle, purely because it declined to adopt a shoddy definition whose flaws become obvious on a moment’s scrutiny.\nDeclaring War Although the details of the meta-controversy are far from edifying, they need to be recounted all the same. It began with a carefully calculated stunt by the anti-Corbyn Labour MP Margaret Hodge. Having made sure there was an audience to hear her, Hodge screamed abuse at Jeremy Corbyn in the House of Commons, calling him a “fucking antisemite and a racist.” Corbyn’s detractors then lavished praise on Hodge, an egregious hypocrite who once earned praise from the neo-fascist British National Party for her race-baiting comments about immigration. The Guardian gave Hodge a column to double-down on her smears — although she took care not to repeat the specific allegation when parliamentary privilege no longer applied. A second anti-Corbyn politician, Ian Austin, followed this up with another abusive tirade, this time directed towards the party chair Ian Lavery. Austin is a notably juvenile figure, even by the standards of right-wing Labour MPs: he once spent the best part of two days on Twitter telling a member of the Labour shadow cabinet that he was fat. Unsurprisingly, he forgot to include even a token reference to antisemitism in his outburst. No matter: it served its purpose. By now, the ball was rolling, and it was time to up the ante. The editors of three newspapers — the Jewish Chronicle, Jewish News and Jewish Telegraph — decided to publish a statement that described Corbyn’s Labour Party as an “existential threat to Jewish life” in Britain. The statement claimed that Labour would be “seen by all decent people as a racist, antisemitic party” if it did not follow the IHRA text to the letter in censoring criticism of Israel by its members. This defamatory nonsense received top billing in the national media. Corbyn’s opponents appear to have entered a state of delirium at this point, realizing that they could say whatever they liked and still be taken seriously. Marie van der Zyl, president of the Board of Deputies of British Jews (BOD), accused the Labour leader of having “declared war on the Jews.” Margaret Hodge compared her own indulgent treatment by Labour’s disciplinary process to the persecution of Jewish people in Nazi Germany, and went on to claim that the party leadership was motivated by “hatred of Jews”. It is an insult to everyone’s intelligence to pretend that such claims were made in good faith by rational people who were trying to describe reality as they perceived it. The purpose of these attacks was not to convey a perception but to create it. If that meant trivializing the crimes of Nazism for the sake of a cheap political smear, so be it. Along the way, the now-familiar process of digging up dirt from Jeremy Corbyn’s political past hit rock-bottom. For several weeks, Corbyn was denounced at maximum volume for actions that had nothing to do with antisemitism: chairing a meeting at which a Holocaust survivor, Hajo Mayer, affirmed his support for Palestinian human rights; paying tribute to victims of an Israeli terrorist attack in Tunis; or gently mocking a small coterie of yobs who try to disrupt every Palestine solidarity event in London.\nDouble Vision In a very good and very useful article for Novara, Barnaby Raine drew a comparison that unfortunately obscures more than it illuminates about this affair: When the Muslim Council of Britain (MCB) highlighted Islamophobia in the Conservative Party, it was darkly comic to watch the Tories insist that nobody should listen to the MCB because they took supposedly objectionable positions on other political questions, all while wheeling out [Home Secretary] Sajid Javid to reject the charges, speaking “as a Muslim.” That was a dreadful response to accusations of widespread prejudice, but it mirrored precisely the response of some on the left to accusations of antisemitism in Labour raised by the Board of Deputies. The parallel here is one of form, not content. The incentive for the MCB to make false allegations about the prevalence of Islamophobia in British politics is extremely low. It is hard enough for the Council, or politicians like Sayeeda Warsi, to get a hearing for allegations that are easily proven and well-documented. Much of the British media simply doesn’t consider bigotry against Muslims to be a bad or objectionable thing. In fact it’s very much part of their political message, as it is for the Conservative Party. If Warsi or the MCB started embellishing the truth in their critiques of Tory Islamophobia, the same newspapers that studiously ignore their comments today would immediately jump on them and put even the smallest exaggeration under the microscope. For groups like the Board of Deputies, the incentive structure is very different. As the experience of the past few months has shown, no claim will ever be fact-checked and no demand will ever be considered unreasonable, as long as its effect is to damage a left-wing Labour Party. This fact unfortunately leads some people to imagine that there is an all-powerful “Israel lobby” in Britain that can dictate terms to the country’s political class. But that kind of mystification gets us nowhere. The power of the BOD or the Jewish Leadership Council to vilify their opponents can only be exercised in one political direction. If they set about making false allegations — or indeed true allegations — against the Conservative Party, they would soon find themselves hitting a brick wall. There is already an anti-Left, anti-Corbyn consensus in the British media that stretches from the Mail to the Guardian, one that would exist irrespective of anyone’s position on Israel. It is only because the attacks on Labour harmonize perfectly with the needs of that consensus that they carry so much weight.\nKnow Your Enemy In order to refute the claims made by the BOD’s van der Zyl, or the Jewish Chronicle editor Stephen Pollard, we don’t have to show that they took up “objectionable positions on other political questions,” as Raine put it. The false or exaggerated character of those assertions can be demonstrated on their own terms, without bringing anything else into it. Nevertheless, if we want to understand why such claims continue to be made and taken seriously in spite of all the evidence, we do need to recognize that their authors are bitterly hostile to the Left: not simply because of its critical stance towards Israel — although that is certainly part of it — but because they support a wider right-wing agenda. Stephen Pollard is on record describing the British Left as the “enemy” of “Western civilization and freedom”. For the Jewish Chronicle editor, writing in 2006, the fact that Tony Blair faced resistance to the invasion of Iraq from within his own party “says almost all that needs to be said about the outlook of most Labour Party MPs and members.” Pollard no doubt sees his current post as a useful rampart in the “battle to preserve Western civilization,” however much his methods of prosecuting it differ from those used by the US military in Fallujah. He may not be able to deploy white phosphorous or free-fire zones against the “enemy within,” but he can certainly slander them at will. Pollard also writes for the Express and the Telegraph, two right-wing newspapers whose combined circulation is almost forty times greater than the Chronicle’s. But no attack on the Left that he penned for those outlets came close to achieving the impact of July’s “existential threat” statement. There has been a lot of talk about the need for Labour to “reach out” and “restore trust” with the Jewish community. The Labour leadership should certainly take every reasonable step to show that it will do all in its power to root out genuine cases of antisemitism: not as a matter of expediency, but because it’s the right thing to do. However, if “reaching out” and “restoring trust” is defined as winning the approval of the BOD and its ideological co-thinkers, it will prove to be an impossible task. No matter what the party leadership does, the goalposts will keep moving every time — as we have already seen happen repeatedly. Figures like Stephen Pollard and Jonathan Sacks can never be appeased: not as long as Labour has a left-wing leadership that supports Palestinian rights. They must be taken on, and their shabby political agenda must be held up to scrutiny.\nLoyal Opponents A similar point applies to the Jewish Labour Movement (JLM), which unlike the other organizations is actually affiliated to the Labour Party. The JLM’s name suggests that it is simply an organization for Labour members who happen to be Jewish. But in fact its stated political identity is based on “Labour or Socialist Zionism”, a tradition it considers to be represented today by “our sister party in Israel,” the Israeli Labor Party. In any debate over Israel and Palestine, no self-professed ally of the Israeli Labor Party can be accepted as a good-faith interlocutor of the progressive Left. The JLM’s Israeli sister organization has an openly racist leadership that insists the illegal settlements in the occupied Palestinian territories will have to remain under Israeli control in perpetuity. On all the most important questions of war and peace, Israeli Labor and its leader Avi Gabbay have become “a sad replica of Mr. Netanyahu himself,” as a New York Times op-ed aptly put it last year. It came as no surprise when Gabbay denounced Jeremy Corbyn for his “very public hatred of the policies of the Government of the State of Israel.” Gabbay issued that statement directly after the Israeli army’s massacre last spring of Palestinian civilians in Gaza, which he endorsed, giving the lie to those who depict his party as some kind of progressive alternative to Netanyahu’s Likud. Nor is it surprising that repeated efforts by the Labour leadership to work with the JLM have proven to be entirely futile. The group even threatened to sue the Labour Party for not adopting the IHRA text in full, and threw its full weight behind Margaret Hodge, making her an honoured guest at its 2018 conference, where she vowed to destroy Corbyn at all costs. The JLM is a classic example of the “loyal opposition” that Israeli diplomats and the more sophisticated pro-Israel organizations work assiduously to cultivate. They understand that Israel can’t always expect to have politicians like Donald Trump or pundits like Alan Dershowitz going out to bat mulishly for its cause. The undiluted extremism of Netanyahu and his coalition partners will be too strong for some palettes. The important thing, from the perspective of Israeli officials like the UK ambassador Mark Regev, is to keep the backlash against Netanyahu within safe limits. A few token words of criticism to maintain a fig-leaf of credibility are perfectly acceptable, as long as there’s no danger that such words will lead to meaningful action. House-trained critics like the JLM trot out the same platitudes about “peace” and a “two-state solution” that European foreign ministers have been regurgitating for years, and murmur their disapproval when Israel continues to expand its illegal settlements. But they respond with bitter hostility to anyone who wants to apply real pressure on the Israeli state to end its oppression of the Palestinian people. Labour’s shadow foreign minister Emily Thornberry followed the same script at an event to celebrate the Balfour Declaration last year, where she denounced the BDS campaign as “bigotry against the Israeli nation,” while praising Avi Gabbay and “our friends in the Israeli Labor Party” to the hilt. There is a small, embattled left inside Israel, represented by parties like Hadash, campaigning groups like the Alternative Information Center, and commentators like Gideon Levy. Unsurprisingly, they have given their full support to Corbyn against his critics — and faced threats of state repression for doing so. They are the ones entitled to solidarity from the Left in Britain — not Thornberry’s “friends” in the JLM’s sister party.\nUs and Them The most pernicious thing about this row is not the abuse directed towards Jeremy Corbyn and his supporters, or even the frivolous invocations of Nazism by petulant narcissists that cheapen the memory of its crimes. It is the complete indifference to the views of Palestinians, including Palestinian members of the Labour Party. With the honorable exception of alternative platforms like Novara and Middle East Eye, nobody in the British media has thought to ask whether Palestinians might have something to say about Israel, and about the constraints that should be imposed on discussion of its — their — history. This calculated myopia is profoundly racist in itself. With breathtaking shamelessness, supporters of the IHRA text have repeatedly claimed that “no other ethnic minority would be denied the right to define its own oppression” — while doing exactly that to the Palestinians. This double standard can only be explained in terms of an ill-concealed hierarchy. Palestinians are not white, not Western, not like us. Expecting the majority of British politicians and media commentators to listen to them, with the same respect they would unhesitatingly accord to Israelis or Europeans, is like asking a Trump supporter to acknowledge the bravery of Colin Kaepernick. The very idea that Palestinians should try to “muscle in” on a debate about their own history is considered a gross impertinence, much like taking a knee during the national anthem. Part of the hostility directed towards Jeremy Corbyn from the British commentariat stems from a recognition, conscious or otherwise, that he has never internalized this racial hierarchy of people who matter and people who don’t. They sense that he views a Palestinian victim of Israeli violence as one of us, not one of them, and they find it deeply unsettling. Such elementary humanism is so alien to Britain’s political mainstream that it must be denounced as “anti-Western,” “antisemitic,” or simply as treason to the realm. Of course, there is nothing unique about Corbyn’s empathy for the victims of “Western civilization.” Britain has always had strong, vibrant solidarity movements that challenged the racism of its ruling class at home and abroad. The best elements of Corbynism draw strength from that tradition, and if the movement ever cuts itself off from those roots, it will be lost. It’s long past time to start listening to Palestinians and their allies. Expecting the dominant voices in the British media to do so is a hopeless task. However, the Left in Britain can and should do better. If ever there was a need to “reach out” and “restore trust,” it lies in this field. The NEC’s cowardly decision to buckle under pressure is a real setback, but it need not be fatal, as long as we learn the right lessons.", "url": "https://www.jacobinmag.com/2018/09/labour-antisemitism-controversy"}