{"authors": ["Dave Gong"], "date_download": "2020-05-04 20:22:45", "date_modify": "2020-05-04 20:22:45", "date_publish": "2018-03-08 05:00:01", "description": "Fort Wayne businesses who receive a Tax Increment Finance incentive from the city could soon be asked to contribute up to $100,000 to a new public art fund, city officials announced...", "filename": "_2d8bde9a54fe4d1ebf19a0d30fce3e8d_1588623765.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2d8bde9a54fe4d1ebf19a0d30fce3e8d_1588623765.html", "title": "Councilmen propose public art fund", "title_page": "Councilmen propose public art fund", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Fort Wayne businesses who receive a Tax Increment Finance incentive from the city could soon be asked to contribute up to $100,000 to a new public art fund, city officials announced Thursday.\nA city ordinance sponsored by Councilmen Glynn Hines, D-6th, and Tom Freistroffer, R-at large, will be introduced Tuesday to create a public art program with the goal of integrating public art throughout the city. The ordinance also establishes the city’s public art fund.\n“Public art helps create interesting and vibrant spaces, the kinds of places that people want to visit and come back to,” Mayor Tom Henry said in a statement. “Public art tells our unique story to residents and visitors and communicates that we value quality of life, creativity, culture and diversity.”\nIf approved, the public art fund would be overseen by a 13-member volunteer Art Commission. The commission would review and select projects for display in public spaces downtown and throughout Fort Wayne’s neighborhoods. Funding would come from local businesses located in Tax Increment Finance districts, which would be asked to contribute 1 percent of their Tax Increment Finance incentive to the program, with a cap of $100,000.\nFor more on this story see Friday’s print edition of The Journal Gazette or return to www.JournalGazette.net after 1 a.m.\ndgong@jg.net", "url": "https://apnews.com/2d8bde9a54fe4d1ebf19a0d30fce3e8d"}