{"authors": ["Adam J Sacks", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Shawn Gude", "Danny Katch", "Gabriel García Márquez"], "date_download": "2020-05-04 19:59:09", "date_modify": "2020-05-04 19:59:09", "date_publish": "2018-11-23 00:00:00", "description": null, "filename": "2018_11_socialist-humanism-luxemburg-ella-baker_1588622349.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/11/23134232/3129327902_f4cd6ed180_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_11_socialist-humanism-luxemburg-ella-baker_1588622349.html", "title": "Socialism Is For Humanity", "title_page": "Socialism Is For Humanity", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Marx had a keen eye for the heart in a heartless world. From a young age he worried about the ways that capitalism submerged the “human problems” in the struggle for material survival. He looked forward to the day when they would come more clearly into focus, when the oppressive veil of capitalism had been lifted and a “humane society” had finally come into being.\nAt a time when socialists are being called to explain their politics anew, it’s important to remember that socialism has always been, and still remains, a humanist movement that seeks to free people from domination and exploitation — promoting individual flourishing, creativity, and even spiritual enrichment in place of stunted dreams and alienation.\nSocialists have long held such aims. When socialism emerged as a mass movement in the late 1800s, it was not uncommon to hear it heralded as the greatest advance in humanitarianism since the New Testament. Socialism, its adherents thought, could provide the renewal of conscience needed to save society.\nIn the early twentieth century, German socialist Leo Kestenberg adopted the motto “education to humaneness” for a Europe facing a deluge of fascism. He hoped that the struggle for socialism could serve as a bridge toward a radical new humanism, a society that rewarded kindness instead of exploitation. The so-called “Pope of Marxism,” Karl Kautsky, invoked the notion of a “Socialist conscience,” as a means of “saving the nation” (he had the US in mind).\nSeveral decades later, in his inaugural address to the Chilean Parliament, Salvador Allende spoke in similarly rapturous tones, describing socialism as a “mission” that could infuse the country with meaning:\nHow can people in general — and young people in particular — develop a sense of mission which will inspire them with a new joy in living and give dignity to their existence? There is no other way than that of devoting ourselves to the realization of great impersonal tasks, such as that of attaining a new stage in the human condition, until now degraded by its division into the privileged and the dispossessed. . . . Here and now in Chile and in Latin America, we have the possibility and the duty of releasing creative energies, particularly those of youth, in missions which inspire us more than any in the past.\nHere was the heart of Marxian philosophy: the elan of the human subject, the inspired striving toward growth.\nRosa Luxemburg, the great Polish-German socialist, embodied this in the very way she lived, writing to a comrade:\nTo be a human being means to joyfully toss your entire life ‘on the giant scales of fate’ if it must be so, and at the same time to rejoice in the brightness of every day and the beauty of every cloud . . . the world is so beautiful, with all its horrors, and would be even more beautiful if there were no weaklings or cowards in it.\nThe American civil rights organizer and socialist Ella Baker also emphasized humanism in her daily practice. To her, the purpose of organizing was to awaken the human spirit and empower people to change the world. “Give light,” Baker famously said, “and people will find the way.” Treating people as playthings, even in the service of an ultimately liberatory goal, was anathema to the spirit of socialism.\nToo often, critics have confused the ethical and humanist side of socialism as a variant of the “utopian” socialism that Marx railed against. Marx contrasted his writings with thinkers whose imaginings, like Charles Fourier and Robert Owen, brought them into the realm of hyper-idealism if not quasi-magical flights of fantasy. He identified his own work as “scientific.” Yet this English word does not quite capture the meaning of the German original “wissenschaft.” This latter term implies the holistic human search for knowledge within both the natural and the human “sciences” rather than the English connotation, where science is entirely cordoned off from “the humanities.” Marx’s critique of present conditions was shot through with a commitment to realizing human dignity — he deplored the “soulless” commodities of capitalism and its implications for the human self.\nPerhaps the greatest theorist of socialism as a kind of post-secular humanist meta-morality was Jean Jaurès, best known in the US for his 1911 book A Socialist History of the French Revolution. Jaures surveyed the dominant discourses of turn-of-the-century France and found them terribly stultifying. Nationalism was a deliberate reactionary strategy to prevent thoughts of a higher sphere. Official religion was a noxious force whose much-vaunted charity simply cloaked a new form of oppression. And the vogue spiritualisms of the day — such as Theosophy, which lured people away from organized religion into new post-secular cults — amounted to dilettantist mysticisms, dampening people’s courage to face real-life struggles. Only socialism, Jaurès argued, could emancipate human conscience and restore a sense of infinite human possibilities.\nLater in the twentieth century, one of the strongest voices for a Marxism of the conscience was Isaac Deutscher, best known for his definitive biographies of both Stalin and Trotsky. A Galician Jew who opted for the Polish Communist Party over the Bund, Deutscher was in a unique position to observe both the disenchantments of state socialist power in the East and New Left pessimism in the West. He would return time and again to that fundamental human subjecthood at the heart of Marxism. Deutscher observed that this human subjecthood, which already exists within each of us as potential, is distorted, crushed, and stultified by capitalism. It literally reduces our personhood, which is damning to our social wellbeing as much as our economic livelihood. The promise of socialism, for Deutscher, was in the expansion and reintegration of our personality — of the rediscovery of parts of ourselves that had been lost.\nFollowing the collapse of the Soviet Union, a critical voice for socialist humanist hope was the Cuban physicist Celia Hart. A daughter of the founding generation of revolutionaries, Hart died tragically young in a car accident — but not before providing reinvigoration to what she called the “beautiful battle.” An internal critic of Cuban state socialism, she nevertheless defended the role of political parties in the “betterment of humanity” and adopted as her slogan a quote from the Cuban poet José Martí: “homeland is humanity.” She called for a return to the origins of socialism and spoke out for a kind of Marxist ecumenism — “we need all those who said a truth to humanity.” In 2016, shortly before her death, Hart’s writings were collected in an English-language volume entitled, appropriately enough, “It’s Never Too Late to Love or Rebel.”\nIn these traditions and figures, we can see a socialism that has sought to combat not just the scarcity of material goods but the scarcity of immaterial, humanist values such as respect, esteem, and self-actualization. Matters of the moral, psyche, and the soul have never been relegated to the margins, because each are integral to the free growth and flowering of the human subject.\n“Spiritual, not religious,” is a cliché of our day; in this tradition, we might replace it with the motto “socialist, not religious” — and hold out a different aspiration: not the end of human history but instead its true beginning.", "url": "https://www.jacobinmag.com/2018/11/socialist-humanism-luxemburg-ella-baker"}