{"authors": ["Amanda Cuda"], "date_download": "2020-05-04 20:19:15", "date_modify": "2020-05-04 20:19:15", "date_publish": "2018-12-30 18:03:06", "description": "Flu activity in Connecticut has “rapidly increased,” according to the state Department of Public Health and the death total from the contagious illness is slowly but steadily...", "filename": "_4000a36c639f449fb4fcffa40cd7bb80_1588623555.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4000a36c639f449fb4fcffa40cd7bb80_1588623555.html", "title": "Flu totals, deaths rising in state", "title_page": "Flu totals, deaths rising in state", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Flu activity in Connecticut has “rapidly increased,” according to the state Department of Public Health and the death total from the contagious illness is slowly but steadily rising.\nAccording to the state, as of Dec. 22 — the most recent date for which statistics were available — a total of 527 people had tested positive for the flu. That’s a whopping increase from the previous week, when 347 people tested positive for flu. There also have been three flu-associated deaths in the state, up from two the week before, and 162 people have been hospitalized for flu.\nThis was also the week that flu was finally designated as “widespread” in Connecticut, which means that there has been outbreaks of influenza or increases in influenza-like illness cases and recent laboratory-confirmed influenza in at least half the regions of the state with recent laboratory evidence of influenza in the state.\nInfluenza A viruses are the predomine type of flu circulating, with very few influenza B viruses being reported.\nEven as the season progresses, the state urges residents to protect themselves against the flu.\n“December is still a good time for you and your family to obtain your flu vaccine and take steps to prevent influenza-related illness and hospitalization,” a release from the DPH reads.", "url": "https://apnews.com/4000a36c639f449fb4fcffa40cd7bb80"}