{"authors": ["Mandy Mitchell", "Wral Reporter"], "date_download": "2020-05-04 20:15:18", "date_modify": "2020-05-04 20:15:18", "date_publish": "2018-10-26 14:09:00", "description": "Justin McCurry was 33 years old when he walked out of work for the final time. \"You always have those doubts,\" he said. \"Am I doing the right thing? Is this what I should be...", "filename": "_cf12b5e8f7fffa105cb4f174bb537696_1588623318.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cf12b5e8f7fffa105cb4f174bb537696_1588623318.html", "title": "He retired in 2013 at age 33. Find out how", "title_page": "He retired in 2013 at age 33. Find out how", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Justin McCurry was 33 years old when he walked out of work for the final time.\n“You always have those doubts,” he said. “Am I doing the right thing? Is this what I should be doing?”\nMcCurry wasn’t just changing jobs. He was retiring. And he’s been retired for five years now.\n“There have been lots of people who said this idea is crazy,” he said.\nMcCurry and his wife, who asked not to be named in this story, are part of a growing movement of people who work to save and invest the bulk of their income with the hopes of retiring early. The movement was recently dubbed FIRE, which stands for financial independence, retire early.\nAnd to hear McCurry describe it, it’s not exactly financial wizardry. The couple’s combined income never topped $150,000 a year in their decade of work. They never hit big on a massive investment and they did not start with money they inherited.\n“Saving a large percentage of my income was a big part of it,” he said. “We saved about half of our incomes and that increased as we made more money throughout the years.”\nMcCurry said he and his wife both maxed out their 401(k)s, put money in other savings accounts and invested in the stock market.\n“We never bought Apple or Google before they went big,” he said. “We focused on index funds.”\nThe strategy led them to a portfolio of just over $1 million dollars, which has since grown to $2 million. They are now a family of five living on $40,000 a year. The spending falls right in the sweet spot of what most financial planners will advise when planning for retirement. The conventional wisdom is if you spend 3 percent to 4 percent of the portfolio per year, you won’t run out of money.\n“That’s a safe assumption when you’re 70,” said Ron Elmer, who is both a certified public accountant and a certified financial planner. “It’s less safe when you’re 55 and even less so the younger you go.”\nMcCurry said he hasn’t seen any negatives yet. The family eats most of its meals at home and only owns one car. And while they are on a strict budget, they still find the means for long vacations every summer and have the money for things that tend to pop up in life.\nThey have health insurance, and so far have not run into any major medical expenses. They still live in, and pay a mortgage on, a starter home. They have money set aside in 529 savings plans to help pay for their kids’ college tuition.\n“Since retiring early five years ago we’ve replaced the roof, we’ve replaced the siding, we’ve purchased a used car,” McCurry said. “So a lot of the same things people have happen to them every single year we have had happen to us and we budgeted for it.”\nMcCurry is a bit of a rock star in the FIRE community. He shares his financial success on his blog called “Root of Good,” which averages more than 100,000 page views per month. Young people flock to the blog to try to follow the blueprint with hopes of living the early retirement dream.\n“People are reading the blog,” he said. “People are interested in the concept of financial independence,”\nIt’s not a life of frills but it’s certainly a life of freedom and that’s what McCurry was looking for when he started the journey.\n“I just view money as a tool to bring you things that you enjoy,” said McCurry. “The simplicity of waking up knowing I don’t have to go to a job today, being able to wake up and say I can lay in the hammock and read a book and drink coffee all morning if I want to.”", "url": "https://apnews.com/cf12b5e8f7fffa105cb4f174bb537696"}