{"authors": ["Chris Rickert", "Wisconsin State Journal"], "date_download": "2020-05-04 20:05:56", "date_modify": "2020-05-04 20:05:56", "date_publish": "2018-10-17 10:30:00", "description": "Frustrated by what he sees as a sharp increase in serious crimes committed by children, Madison’s police chief is publicly chastising judges and others in control of Dane County’s juvenile justice...", "filename": "_5f20d336cc634c9398af9df77b1eb46d_1588622756.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5f20d336cc634c9398af9df77b1eb46d_1588622756.html", "title": "Madison police chief takes judges, juvenile 'justice' system to task in blog post", "title_page": "Madison police chief takes judges, juvenile 'justice' system to task in blog post", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Frustrated by what he sees as a sharp increase in serious crimes committed by children, Madison’s police chief is publicly chastising judges and others in control of Dane County’s juvenile justice system for not doing enough to keep residents safe.\nThe Madison Police Department “has spent considerable time and resources in our attempts to prevent, investigate, and arrest juveniles engaged in criminal behavior,” Chief Mike Koval wrote in a Tuesday morning blog post . “Regrettably, the juvenile ‘justice’ system is not responding to the issues at hand and we see a plethora of reasons why it is failing.”\nKoval points to an Oct. 10 incident in which a 13-year-old Madison boy allegedly took part in a vicious attack on a 59-year-old woman before stealing her car , which was later found crashed into a tree on Seminole Highway. Three girls, ages 13, 13 and 15, were also arrested in connection with the incident.\nMadison police spokesman Joel DeSpain said the youth had 10 contacts with police over six months, is a self-described gang member, and had previously boasted to police investigating an earlier car theft that “‘This is only the beginning. We’re just getting started.’”\nKoval writes that he agrees with restorative justice efforts and other alternatives to more punitive treatment of young criminals who have had difficult upbringings and been exposed to early-childhood trauma .\n“But the one thing I haven’t heard enough discussion about are the needs of the victims of crimes caused by juveniles,” he writes. “What about accountability?”\nIn a statement, the four Dane County Circuit Court judges who have since at least August 2017 been handing juvenile cases noted that juvenile offenders and their families “often have long-standing deprivation, serious mental and cognitive health issues and multiple trauma experiences.”\nBut judges Juan Colás, Shelley Gaylord, Julie Genovese and Everett Mitchell also said they “fully understand” the risks some of those offenders pose, and they rejected the notion that they are regularly being released after arrest, even as it becomes more difficult to find places to take them.\n“The overwhelming majority are held in detention awaiting a first hearing,” they said. “In fact, we are holding youth longer than historically has been done.”\nIn his own statement, District Attorney Ismael Ozanne said “it is past time” that the community recognize that “the juvenile’s best interests and the safety of our community are linked.”\nHe implored “the people of this county to resist the urge to turn towards more severe and harsher punishments and instead ask them to join me in demanding and creating change,” including “interventions to prevent abuse and neglect,” reduce domestic violence and provide better housing, health care, access to food and public schools.\nHe said incarceration is sometimes warranted for juvenile offenders but “as a county, we cannot and should not want to simply incarcerate our way out of our juvenile justice problems.”\nIn contrast to the Madison Police Department’s recent impressions of juvenile crime, the department’s annual reports show the number of arrests of juveniles overall in recent years has been steady or dropping.\nAnd in August, Koval appeared at a press conference called by Mayor Paul Soglin at which the mayor touted a reduction in the number of arrests and contacts between police and citizens generally, and attributed the declines in part to restorative justice efforts such as Dane County’s Community Restorative Courts .\nDeSpain said it’s not necessarily that there are more juveniles being arrested, it’s that a small group of them are committing more serious crimes more often — and seemingly without much fear that police or the court system will do anything to stop them.\nHe said the department has identified about 30 young people who are responsible for a disproportionate amount of the crime, and he pointed to year-over-year increases in burglaries and robberies , especially on the West Side.\n“We have a core group of people who are out to burglarize and steal cars,” he said. “The way the system is currently, there’s really no deterrent built into the system that’s changing behavior.”\nIn their statement, the judges also referred to about 30 “repeat offenders,” and said: “We fully understand the risks they pose when deciding whether or not they can be properly supervised in the community or must be removed.”\nFar West Side Ald. Paul Skidmore, 9th District, said he’s seen an uptick in the number of constituents contacting him about car thefts and other crimes by teens. He’s scheduled a community public safety meeting for 6 p.m. Nov. 5 at Blackhawk Church, where county judges, Madison police and others have been invited to speak.\nPolice are “wrongly being blamed,” he said. “They catch them and turn them in, but they don’t have anything to do with the justice system.”\nSimilarly, in an Oct. 9 emailed response to a woman who had complained to her City Council representative about car thefts, West Police District Capt. Cory Nelson said “our officers are arresting (these) kids every chance we get, yet they are many times almost immediately released.\n“We have arrested many kids who are on bracelets from their last arrest,” he wrote. “They seem to think our arrests are a big joke. Our frustration is with the justice system. If you want to make a change, you need to do so at the ballot box when judges are elected.”\nSkidmore pointed in particular to Mitchell, who faced no opposition in winning election to the bench in April 2016 and who at a forum the year before questioned whether Walmart and other big box retailers should pursue charges against shoplifters .\n“That’s the activist judge that we’re dealing with,” Skidmore said.\nIn a statement to the Milwaukee Journal Sentinel , Mitchell later said his “comments around ‘big box’ retailers were in no way an endorsement of shoplifting or other criminal behavior, but part of a point about how the distribution of police resources to areas with high numbers of misdemeanor crimes can bring low income or people of color into frequent contact with law enforcement.”\nAmong the things judges point to as hampering greater accountability for serious juvenile offenders, Koval wrote in his blog, are a lack of restorative programs and mental health treatment, and too few places to hold juvenile offenders.\n“While I endorse community-based restorative justice initiatives, I draw the line at serious, felony behaviors,” he writes. “Furthermore, victims need to stay empowered in making decisions on how to proceed with the management and prosecution of cases that do not (and should not) qualify for diversion from the criminal justice system.”", "url": "https://apnews.com/5f20d336cc634c9398af9df77b1eb46d"}