{"authors": ["Michael Divittorio"], "date_download": "2020-05-04 20:09:06", "date_modify": "2020-05-04 20:09:06", "date_publish": "2018-03-09 01:45:10", "description": "Demolition at the future Oakmont Bakery site at Third Street and Hulton Road caused some traffic issues Saturday. A telephone pole with wires was knocked down during the project being done...", "filename": "_00e1796474d047928f7f78eb94a0349c_1588622946.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_00e1796474d047928f7f78eb94a0349c_1588622946.html", "title": "Oakmont Bakery site demolition causes weekend traffic issues", "title_page": "Oakmont Bakery site demolition causes weekend traffic issues", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Demolition at the future Oakmont Bakery site at Third Street and Hulton Road caused some traffic issues Saturday.\nA telephone pole with wires was knocked down during the project being done by Harmarville-based Sean Panza Excavation.\nTraffic was reduced to one lane along Hulton Road until the debris was removed.\nOwner Sean Panza said Sunday no one was injured as a result of the incident.\nThe building that housed ATA Oakmont Martial Arts, Kelsey’s Dance & Fitness and LA Tanning across from Riverview High School has been razed.\nTwo houses, a tire shop and an ice cream business were already gone before this weekend. Demolition is expected to be completed by the end of the month.\nConstruction of the new bakery could take place in March, if all permits are acquired. Grand opening is slated for October or November.\nOakmont Bakery is owned by Marc Serrao and his family. They opened the bakery in 1988. Its current location at 531 Allegheny Ave. features a retail space and a separate production building next door.\nThe new development would have operations all under one roof.\nMichael DiVittorio is a Tribune-Review staff writer. Reach him at 412-871-2367, mdivittorio@tribweb.com or via Twitter @MikeJdiVittorio.", "url": "https://apnews.com/00e1796474d047928f7f78eb94a0349c"}