{"authors": ["The Detroit News"], "date_download": "2020-05-04 20:17:18", "date_modify": "2020-05-04 20:17:18", "date_publish": "2018-04-09 16:17:51", "description": "Boston College defensive end Harold Landry is the Detroit Lions' first-round pick, at No. 20, in CBS Sports' latest mock draft, published Monday. \"This pick can be viewed as insurance for...", "filename": "_9c832527f51d4020ae5f8082572cd909_1588623438.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9c832527f51d4020ae5f8082572cd909_1588623438.html", "title": "Harold Landry to Lions in CBS Sports' latest mock draft", "title_page": "Harold Landry to Lions in CBS Sports' latest mock draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Boston College defensive end Harold Landry is the Detroit Lions’ first-round pick, at No. 20, in CBS Sports’ latest mock draft, published Monday.\n“This pick can be viewed as insurance for the Lions if they can’t extend Ziggy Ansah, and Landry doesn’t have to be the team’s alpha pass-rusher in his rookie campaign,” says CBS Sports’ Chris Trapasso.\nThe Lions placed the franchise tag on Ansah and he will earn $17.5 million this season if he plays under the tag. The Lions and Ansah have until July 16 to work out an extension.\nLandry (6-3, 250) was limited to nine games as a senior at Boston College due to an ankle injury. He had 8.5 tackles for loss as a senior and 47.5 for his career, including 22 as a junior.\nTrapasso’s predictions for the first three picks are USC quarterback Sam Darnold at No. 1 to the Browns, North Carolina State defensive end Bradley Chubb at No. 2 to the Giants, and Oklahoma quarterback Baker Mayfield at No. 3 to the Jets.\nMichigan defensive tackle Maurice Hurst is also in Trapasso’s first round, at No. 22 to the Bills.\n“The Bills add the best penetrating defensive tackle in the class to be the heir apparent to Kyle Williams,” Trapasso says. “GM Brandon Beane and Sean McDermott see a lot of Kawann Short in Hurst.”", "url": "https://apnews.com/9c832527f51d4020ae5f8082572cd909"}