{"authors": ["Dave Williams"], "date_download": "2020-05-04 20:09:53", "date_modify": "2020-05-04 20:09:53", "date_publish": "2018-06-19 21:15:00", "description": "Today's look back at country music >>> 1914 - Born on this day in Overton County, Tennessee, was Lester Flatt, bluegrass musician best known for his work in the Bluegrass duo The Foggy...", "filename": "_3a128c02bcbd43b1b3cdd852d9d18794_1588622993.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3a128c02bcbd43b1b3cdd852d9d18794_1588622993.html", "title": "This Day in Country Music: June 19", "title_page": "This Day in Country Music: June 19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today’s look back at country music >>>\n1914 - Born on this day in Overton County, Tennessee, was Lester Flatt, bluegrass musician best known for his work in the Bluegrass duo The Foggy Mountain Boys. He was also known as “Flatt and Scruggs”\n1954 - “I Don’t Hurt Anymore” by Hank Snow began a 20 week run at #1 on the Country Best Seller list\n1956 - Born on this day, in Newnan, Georgia, was Doug Stone, country music artist who had the 1991 US #1 Country hit “In A Different Light.” Stone made his acting debut in the film Gordy\n2001 - Lonestar released their fourth album I’m Already There\n2006 - Gretchen Wilson and Josh Gracin performed for president George W. Bush along with 6,000 guests at the President’s Dinner at the Washington Convention Center\n2008 - Loretta Lynn joined the Songwriters Hall of Fame during a ceremony at the Marriott Marquis Hotel in New York City. Anne Murray also received the Hitmaker Award\n2010 - Dancer Dean Sheremet divorced Grammy Award-winning singer LeAnn Rimes after nearly eight years of marriage due to infidelity\n2013 - Singer Slim Whitman, who reportedly once sold over 120 million records, passed away. He was 90", "url": "https://apnews.com/3a128c02bcbd43b1b3cdd852d9d18794"}