{"authors": ["Tim Benz"], "date_download": "2020-05-04 20:22:05", "date_modify": "2020-05-04 20:22:05", "date_publish": "2018-04-16 16:12:25", "description": "Pittsburgh is awash in Penguins playoff hysteria and a hot start by the Pirates. The Steelers and the NFL have — dare I say it — taken a backseat of late in the local sports scene. So...", "filename": "_f20702eba7f946668ed2dacbf417be4b_1588623725.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f20702eba7f946668ed2dacbf417be4b_1588623725.html", "title": "Tim Benz: Steelers and Browns angling for same player? Bengals being the Bengals. No more kickoffs?", "title_page": "Tim Benz: Steelers and Browns angling for same player? Bengals being the Bengals. No more kickoffs?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tim Benz: Steelers and Browns angling for same player? Bengals being the Bengals. No more kickoffs?\nPittsburgh is awash in Penguins playoff hysteria and a hot start by the Pirates.\nThe Steelers and the NFL have — dare I say it — taken a backseat of late in the local sports scene.\nSo let’s look at recent AFC North and league-wide events in our occasionally written, semi-regular, it’s a good idea but I haven’t firmly committed to it yet, “Friday Football Footnotes.”\nSteelers thinking like ... Cleveland?!\nI know. Normally reading a sentence like that may cause you to shudder with fear.\nBut in this case, it makes sense.\nBoth the Cleveland Browns and Steelers had interviews with Jordan Mailata. He’s the 6-foot-7, 346-pound Australian rugby star who is getting some buzz as a potential offensive tackle.\nOn the surface, this may sound like a whacky Browns experiment where they miss on a pipe dream.\nYou know, like Johnny Football.\nBut as a late-round draft choice, or a rookie free agent, why not take a shot? He’s huge. And the guy can move!\nFrom a Steelers perspective, Mike Munchak turned Alejandro Villanueva from a pass catcher at Army to a starting left tackle in the pros. He’s also helped to develop the likes of Ramon Foster, B.J. Finney, and Chris Hubbard.\nNone of those guys were drafted. So give him a project and see what he can do with it.\nFrom a Cleveland point of view, it makes sense. After being one of six teams to allow at least 50 sacks last year, why not throw raw talent and numbers at the problem?\nNo more kickoffs?\nMany think the NFL will eventually copy the Alliance of American Football’s decision to ditch kickoffs and just automatically spot the ball instead.\nI hope that doesn’t happen.\nJust because big kickoff returns don’t occur often, I’d rather have the potential for them than not.\nSecondly, what do you do about onside kicks? The new league is going to give teams a fourth-and-10 play from the 35 with one chance to convert instead of a kickoff.\nThis gimmick will become football’s version of the NBA’s awful rule that advances the ball after a timeout. Way too much help for the trailing team without earning the assistance.\nIt’s far too easy in my opinion. It should be a fourth-and-20 from 10-yard line.\nAnd as far as the player safety stuff? C’mon. How much further are we really going to go with this empty posturing?\n’Cuz it’s the Bengals\nThe Cincinnati Bengals were at least interested in signing Eric Reid.\nBut according to a ProFootballTalk story, this highly capable free agent safety left their facility without a contract, largely because of the team’s concerns over the fact that he supported Colin Kaepernick’s kneeling-during-the-anthem campaign.\nSo let me get this straight.\nManagement that has employed — and a fan base that has rooted for — the likes of criminals such as Adam Jones, on-field goons like Vontaze Burfict and locker room disruptions like Chad Ochocinco can’t tolerate a social protester like Reid?\nThat’s quite a disconnect.\nI have often ripped the anthem protesters. I think their message is worthy, but their protest is misguided.\nYet I find it comical that the notion of Eric Reid as a player, and this issue at large, is suddenly where the Bengals — of all teams — have decided they are going to grow a moral conscience.\n’Cuz it’s the Bengals Part II\nLSU pass rusher Arden Key — a potential second-day pick the Steelers may like — revealed that the Bengals quizzed him with math questions at the NFL Scouting Combine.\nThe Bengals also famously asked Tyler Boyd about the Civil War a few years ago.\nThe apparent goal of these questions isn’t really to see if Key knows trigonometry or to find out if Boyd can detail what happened at the Battle of Bull Run.\nBut the hope is to see how these guys react when they are put in situations that are unfamiliar to them.\nI’m just not sure how the classroom-like subject matter at hand equates to their real-life decision making.\nSeriously. What am I to glean from this? That a nut job like Vontaze Burfict can do long division and is schooled on Sherman’s March to the Sea?\nThat’s come in handy so far with him, eh?\nBombs away in Baltimore\nIt looks like the Baltimore Ravens are staying committed to their plan of rebuilding the wide receiver group for Joe Flacco.\nFormer Steeler Mike Wallace, Michael Campanaro and Jeremy Maclin are out. Michael Crabtree and John Brown are in.\nAlso, many draft boards have Baltimore taking a wide receiver in Round 1. ESPN has them selecting Alabama’s Calvin Ridley at pick 16. Many consider him the best receiver in the draft.\nIf not him, Maryland product DJ Moore is getting buzz.\nMel Kiper suggested Baltimore may look at pass-catching tight end Mark Andrews out of Oklahoma in Round 2.\nTim Benz is a Tribune-Review staff writer. Reach him at tbenz@tribweb.com or via Twitter @TimBenzPGH.", "url": "https://apnews.com/f20702eba7f946668ed2dacbf417be4b"}