{"authors": ["Jeanne Jakle"], "date_download": "2020-05-04 20:31:46", "date_modify": "2020-05-04 20:31:46", "date_publish": "2018-03-29 22:37:50", "description": "Most national TV broadcasters — and maybe TBS celebs such as Tracy Morgan — are expected to arrive in San Antonio for Final Four festivities and games Friday or Saturday. However, one of...", "filename": "_0089b61594c248a189356fe6a5ece270_1588624306.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0089b61594c248a189356fe6a5ece270_1588624306.html", "title": "TV sports legend broadcasting from River Walk", "title_page": "TV sports legend broadcasting from River Walk", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Most national TV broadcasters — and maybe TBS celebs such as Tracy Morgan — are expected to arrive in San Antonio for Final Four festivities and games Friday or Saturday.\nHowever, one of them — radio and television sports legend Dan Patrick — already has set up shop on the River Walk, bringing the city’s charm to viewers across the country prior to college basketball’s biggest weekend.\nNBC’s former Sunday night football host arrived Wednesday, and “The Dan Patrick Show” broadcasts from 550 E Market St. (on the River Walk level) started today from 8 to 11 a.m. They will resume at the same time on Friday.\nThe telecasts, complete with a beauteous San Antonio setting and Patrick’s exuberant sidekicks “The Danettes,” can be seen on DirecTV (channels 101 and 500) and AT&T Audience Network.\nToday, Patrick’s special guest was NBA great and TNT commentator Reggie Miller, who dribbled and shot hoops before talking Spurs — the need for LaMarcus Aldridge to return and the conundrum surrounding Kawhi Leonard, who was described as one of the top five players in the country — and lots more.\nOn Friday, Patrick will host Jim Nantz (CBS Sports broadcaster for TBS’s Final Four and National Championship games), Clark Kellogg (CBS lead college basketball analyst on TBS) and Patrick Ewing (NBA Hall of Famer and Georgetown’s basketball coach).\nPublicist Zac Herndon wrote in an email: “Dan is loving the city, the fans and the great energy around the show. It’s the perfect place to celebrate the Emmy nomination (for Outstanding Sports Personality). The show has renamed the city — Dan Antonio!”\nSpectators are welcome, Herndon added: “There is an area designated for fans.”\nJeanne Jakle’s column appears Thursdays and Sundays in mySA. Read more of her columns here. | jjakle@express-news.net | @JakleJ", "url": "https://apnews.com/0089b61594c248a189356fe6a5ece270"}