{"authors": [], "date_download": "2020-05-04 21:07:18", "date_modify": "2020-05-04 21:07:18", "date_publish": "2018-12-15 08:00:00", "description": "Dick Van Dyke had \"some misgivings\" about 'Mary Poppins Returns'. The 93-year-old actor has reprised his role as Bert, 54 years after the original movie was released, and he admitted he...", "filename": "_e02c17ecf74441998ecbdc959d505eb7_1588626438.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e02c17ecf74441998ecbdc959d505eb7_1588626438.html", "title": "Dick Van Dyke had Mary Poppins Returns doubts", "title_page": "Dick Van Dyke had Mary Poppins Returns doubts", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dick Van Dyke had “some misgivings” about ‘Mary Poppins Returns’.\nThe 93-year-old actor has reprised his role as Bert, 54 years after the original movie was released, and he admitted he wasn’t initially sure a sequel was a good idea because they usually “don’t work” and can’t compare to the original.\nHowever, he’s delighted with the new film - which sees Emily Blunt take over from Dame Julie Andrews as the magical nanny - and thinks it’s a fitting tribute to the original Walt Disney movie.\nHe said: “I had some misgivings, because almost traditionally sequels don’t work. They’re never quite as good as the original.\n″[But] this is an homage to Walt and the original movie. I was so impressed that their heart was in the right place. They wanted to pay respect to the original. And I was so tickled when they asked me, because it was kind of like bookends for me.”\nThe veteran actor was “surprised” at how well he got to grips with his song-and-dance number in the new movie and he had a great time shooting the scene.\nHe told People magazine: “The minute I heard I was going to do a little number, that sold me.\n“And I thought I could contribute by just being a little bit of a reminder of the original. And I think it turned out well.\n“I got to jump up on a desk and do a dance number. It surprised everybody, but nobody was as surprised as I was. We did several takes of it, and I was just amazed. And I enjoyed it, of course.”\nDespite his lengthy career, Dick thinks ‘Mary Poppins’ is what he’ll always be remembered for.\nHe said: “I would imagine it would be the thing I would be remembered for.\n“I get a lot of mail today from kids who have just discovered ‘Mary Poppins’. So it’s on its third generation and holding up very well. I’m sure that if I’m remembered for anything it’ll be ‘Mary Poppins’.”", "url": "https://apnews.com/e02c17ecf74441998ecbdc959d505eb7"}