{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:21:58", "date_modify": "2020-05-04 20:21:58", "date_publish": "2018-01-31 09:00:00", "description": "Tracy Barnes October 4, 1977 - January 30, 2018 Tracy Ann Crookston Barnes completed her earthly mission and was called home to her loving Heavenly Father Tuesday, January 30, 2018. She was born...", "filename": "_d98855175d76406d99db45d292c8ef98_1588623718.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d98855175d76406d99db45d292c8ef98_1588623718.html", "title": "Barnes, Tracy", "title_page": "Barnes, Tracy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tracy Barnes October 4, 1977 - January 30, 2018 Tracy Ann Crookston Barnes completed her earthly mission and was called home to her loving Heavenly Father Tuesday, January 30, 2018. She was born October 4, 1977, in Pocatello, Idaho the third child of Nicholas James and Geraldine Godfrey Crookston. She spent her childhood in Preston, Pocatello, and Chubbuck, Idaho where she enjoyed working in the family business, Geraldine’s Bake Shoppe and Deli. She graduated from Highland High School in Pocatello, Idaho and attended Idaho State University and graduated from their Dental Hygiene program. During her time in college she met and married the love of her life Brandon J. Barnes, son of Boyce and JoLene Barnes, whom she loves dearly. They were sealed for time and all eternity in the Logan Utah LDS Temple on August 14, 1998. Together they were blessed with an ever growing and eternal love. They became the parents of six beautiful children, Britanne McKae 17, Kelsey JoLene 15, Lettie Geraldine 12, Mattie Delece 9, BoDee James 7, and Bentley Vera 5. Tracy was a devoted wife and mother who fought a progressive form of cancer that robbed her of the breath and energy she so desired to care for her husband and children and all she came in contact with. She was also a devoted sister to Tamara (Eddie) Crookston, R.J. (Alida) Crookston, Scott (Marie) Crookston, Toni (Blair) Watt, Bryant (Marci) Barnes and Britnee (Brad) Campbell. She was a wonderful Aunt to her 18 nieces and nephews and she loved her many aunts, uncles and cousins. Tracy touched the lives of so many. She constantly served with compassion, tenderness, and sensitivity. She was always willing to help anyone. Her house was always open to family and friends. Tracy was blessed with a cheerful countenance and spunky personality and was always fun to be around. She made everyone feel like they were a child of God. She truly loved everyone she came in contact with. Her quiet dignity and warmth made others comfortable in her presence. Her testimony of the gospel of Jesus Christ was firm and unwavering. She loves her Savior and shared that love with everyone by serving them. The family is grateful for the loving care she received from their many friends, extended family, BJ Barnes and Sons, Marsh Valley Dentistry, their Mountain View Ward family and the Marsh Valley community. We want to thank those that supported Tracy and Brandon and their family through the Corn Walk Alley corn maze in Preston, Idaho. Funeral services will be held Saturday, February 3, 2018 at 11:00 am at the McCammon Stake Center, McCammon, ID. Friends may call Friday from 6-8 p.m. and Saturday from 9-10:30 a.m. at the stake center. Interment will be in the Norton Cemetery in McCammon. Memories and condolences may be shared with the family at www.webbmortuary.com", "url": "https://apnews.com/d98855175d76406d99db45d292c8ef98"}