{"authors": ["Emilia Benton"], "date_download": "2020-05-04 20:05:41", "date_modify": "2020-05-04 20:05:41", "date_publish": "2018-01-12 18:34:00", "description": "The Houston Chronicle's 2017 Salute to Nurses program awarded scholarships to three outstanding nursing students as assistance to support their nursing educational paths. The Chronicle highlights...", "filename": "_ef9cb50f486c41a4bf371cb9268e61bf_1588622741.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ef9cb50f486c41a4bf371cb9268e61bf_1588622741.html", "title": "Three nursing students receive deserved scholarships", "title_page": "Three nursing students receive deserved scholarships", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Houston Chronicle’s 2017 Salute to Nurses program awarded scholarships to three outstanding nursing students as assistance to support their nursing educational paths. The Chronicle highlights this tradition every year during National Nurses Week, which takes place May 6-12.\nAs part of their recognition, the students received:\n$1,000 scholarship,\nTwo invitations to the Salute to Nurses luncheon,\nCommemorative award at the luncheon, and\nRecognition in the Houston Chronicle’s Salute to Nurses special section.\nThe 2017 scholarship recipients are:\nTheresa Lober, University of St. Thomas Carol and Odis Peavy School of Nursing\nTheresa Lober is a junior at the University of St. Thomas working toward her Bachelor of Science in Nursing degree. Various factors contributed to her decision to go into nursing. She began her educational path at a community college, thinking she wanted to become an X-ray technician. After taking an anatomy and physiology class that she really enjoyed, she realized she wanted a job doing something more meaningful to help other people rather than just make a living.\nLober is aiming to start her career in the intensive care unit (ICU) or possibly the pediatric ICU, as she really enjoyed her pediatric rotation. She hopes to go back to school to be a nurse practitioner.\n“Receiving the scholarship is a blessing, because as one of 12 children, I am paying for college on my own,” she said.\nJennifer Ward, Lone Star College - Montgomery\nJennifer Ward is in her final semester of the transition nursing program at LSC - Montgomery. She decided to pursue nursing several years ago when her mom suffered a traumatic brain injury,which left her in intensive care for about six weeks. “I watched day after day how the nurses cared for my mom and how compassionate they were toward me and my siblings,who were all fairly young,” she said. “I remember one nurse in particular just sitting in the ICU room with me for what seemed like hours. “My passion for being a nurse came from that moment,” she said. Ward plans to start the bachelor’s program at UT - Arlington in July. “Being selected to receive this scholarship has been a tremendous honor and a huge reminder of who I aspire to be,” Ward said.\nJennifer Wood, Alvin Community College\nJennifer Wood is in her third semester at Alvin Community College and is set to graduate at the end of the year. Although she had a rewarding career as a theater teacher, she had always been interested in health care and always wanted to become a nurse. Originally from Buffalo, New York, Wood regularly visited her grandparents in Houston as a child, where she and her grandmother volunteered at Conroe Regional Medical Center every summer. Years later, Wood decided she needed a change and wanted to do something she had a passion for.\n“I feel like I have a calling to be an ER nurse, as I’ve had many experiences in life where I’ve had to unexpectedly use my medical and CPR skills,” she said.", "url": "https://apnews.com/ef9cb50f486c41a4bf371cb9268e61bf"}