{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:31:59", "date_modify": "2020-05-04 20:31:59", "date_publish": "2018-02-10 08:30:43", "description": "Other West Virginia native artists being inducted into the West Virginia Music Hall of Fame on Saturday, Feb. 10, are: • The late Fred \"Sonic\" Smith, a guitarist for the influential rock...", "filename": "_8adb14a5cef94e3292d62f3ec56a7603_1588624319.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8adb14a5cef94e3292d62f3ec56a7603_1588624319.html", "title": "A LOOK AT THE OTHER INDUCTEES", "title_page": "A LOOK AT THE OTHER INDUCTEES", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Other West Virginia native artists being inducted into the West Virginia Music Hall of Fame on Saturday, Feb. 10, are:\n• The late Fred “Sonic” Smith, a guitarist for the influential rock band the MC5. He was born in Broad Branch, Lincoln County, and grew up in Detroit. The band helped create the Detroit sound, a high-powered, low-fi precursor to heavy metal and punk. The band was signed to Elektra Records — one of the label’s first hard rock acts — after its performance at the stormy 1968 Democratic National Convention. The group subsequently appeared on the cover of Rolling Stone and released its controversial debut, “Kick Out the Jams,” before disbanding in 1972. In 2003, Rolling Stone ranked Smith 93rd in its list of the 100 Greatest Guitarists of All Time. Smith went on to lead his own group, Sonic’s Rendezvous Band, with former members of other Detroit groups including the Stooges. In 1980 he married poet/singer Patti Smith, and the couple retired from music to raise their children. In 1988, the couple released “Dream of Life” together, an album that featured Fred Smith’s songs and guitarwork. He died from heart failure in 1994.\n• Ann Magnuson, a Charleston native writer, actress, singer, musician and stage performer whose extensive career covers almost every facet of the arts. She has acted in Hollywood blockbusters, off-Broadway plays, TV sitcoms and indie films, fronted various bands, written for numerous publications and presented her original performance art pieces at museums including The Museum of Modern Art, Lincoln Center for the Performing Arts, The Andy Warhol Museum and Tokyo’s Sogetsu Hall.\n• The late Hasil Adkins from Boone County, began recording as a one-man band in the 1950s. With the roguish aura of a hillbilly James Dean and songs like “She Said,” “Chicken Walk” and “No More Hotdogs,” he pioneered a genre that would be dubbed “psychobilly.” Adkins also appeared in several movies, documentaries and television shows, including Asia Argento’s 2004 film “The Heart Is Deceitful Above All Things.”\n• In traditional music, the Clay County brother group The Morris Brothers — the late David Morris and John Morris — who shared their music at the Morris Family Old-Time Music Festival. They were also instrumental in establishing the first Vandalia Gathering at the Cultural Center in 1977. The Morris Brothers’ music was featured in Barbara Kopple’s 1976 film “Harlan County, USA.” David Morris, who died in 2016, contributed music to Kopple’s 2015 film about Vietnam vets, “Shelter.”\n• Frank Hutchison, a blues musician and coal miner who is considered to be one of the first white artists to record blues. He worked as a coal miner in Logan County both before and after his career as a recording artist. Hutchison participated in medicine shows in the 1920s and recorded only from 1926-1929 during which he recorded more than 30 songs, many released on the Okeh label. His song “The Train That Carried My Girl from Town” became a staple for Doc Watson, who was heavily influenced by Hutchison. Hutchison’s playing also influenced Leo Kottke and Bob Dylan. His song “Coney Isle” was later popularized by the New Lost City Ramblers. Examples of his mastery of the Piedmont finger-picking blues style include “The Chevrolet Six” and “KC Blues” (both recorded at his final session in 1929 in New York City). Later that year, Hutchison recorded in Atlanta with Emmett Miller, Fiddlin’ John Carson, Namour & Smith, Moonshine Kate, Bud Blue, the Black Brothers and Martin Molloy. The three-disc album of music and comedy was titled “The Medicine Show.” Hutchison is considered one of the finest performers of the “white country blues” genre of early folk music.", "url": "https://apnews.com/8adb14a5cef94e3292d62f3ec56a7603"}