{"authors": ["Vagney Bradley"], "date_download": "2020-05-04 20:07:00", "date_modify": "2020-05-04 20:07:00", "date_publish": "2018-03-08 15:57:47", "description": "A new business park is being planned for the Spring area. Old Town Spring Business Park is a 196,000 square-foot, flex industrial development with office and warehouse space. Depending on...", "filename": "_fbc4bb9c5782425291b10b18d606bcfb_1588622820.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fbc4bb9c5782425291b10b18d606bcfb_1588622820.html", "title": "New business park planned for Spring", "title_page": "New business park planned for Spring", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A new business park is being planned for the Spring area.\nOld Town Spring Business Park is a 196,000 square-foot, flex industrial development with office and warehouse space. Depending on final interior build-outs, the total project cost ranges between $10-$15 million.\nThe ownership entity is Giddy Up Development, LLC whose partners are Steve Phillips, Brian Alberts, and Rob Stahlman.\nLisa Nickel, listing broker for the property and sales agent for Ryoak Real Estate Group, speaks on behalf on Giddy Up Development, LLC.\n“We believe the project will benefit the local community by providing a reasonably priced leasing option for small business, with great access to major transportation corridors,” Nickel said. “The additional day time tenants will benefit local businesses by purchasing food, fuel and other services.”\nGiddy Up Development acquired approximately 22 acres, 16 of which are being developed as Old Town Spring Business Park. Amenities at the business park will include security gates, cameras, be 18-wheeler accessible, and have access to parking.\nApproximately 5.5 acres of commercial pad sites are served with all utilities and an off-site detention pond, currently under construction. Additionally, the company chose the site because of the newly aligned Riley Fuzzel and Spring Stuebner roads, scheduled for construction by Harris County later this year.\nGiddy Up Development also owns six-acres of commercial that will have frontage on the new Riley Fuzzle road alignment.\n“They thought it was a good location due to its proximity to the Grand Parkway, Hardy Toll Road, and Interstate 45. We think it will be a mix of office and warehouse space,” Nickel said. “There may be building supply companies, home builders, and probably trades that are in the building industry.”\nOld Town Spring Business Park is not in a flood plain and the area did not flood during Hurricane Harvey. The business park is near Old Town Spring, the ExxonMobil campus, and The Woodlands. Interstate 45, the Grand Parkway, and the Hardy Toll Road are all near the business park as well.\nThe business park will include nearly 200,000 square-feet of office and warehouse space in four buildings. Suite sizes will range from 2,650 square-feet to 49,000 square feet.\nProjections show the first building to be ready by August.\n“Now that Interstate 45 and the Grand Parkway are done and completed, it’s just a lot of new attractions going on in that area. The business park will have a combination of different tenants such as electricians, plumbers, maybe dance studios,” said James Schuepbach, listing broker and representative for Giddy Up Development. “We are still really early into it. We will have dozens and dozens of tenants that will occupy the space, and we are really pretty excited about the area. A lot of positive things are happening.”\nWant to know more?\nOld Town Spring Business Park\n27335 W. Hardy Rd.\nSpring, TX 77373", "url": "https://apnews.com/fbc4bb9c5782425291b10b18d606bcfb"}