{"authors": ["Maj. Gen. Duke Richardson"], "date_download": "2020-05-04 20:26:34", "date_modify": "2020-05-04 20:26:34", "date_publish": "2018-02-01 16:43:26", "description": "We tend to think of the formal mentoring session as that special, dedicated time where all the secrets to professional success and development are unlocked. We come to the mentoring meeting well...", "filename": "_b6dee29ac3784052b55a62f8e8226cf1_1588623994.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b6dee29ac3784052b55a62f8e8226cf1_1588623994.html", "title": "Mentoring: A mentality, not a meeting", "title_page": "Mentoring: A mentality, not a meeting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "We tend to think of the formal mentoring session as that special, dedicated time where all the secrets to professional success and development are unlocked. We come to the mentoring meeting well prepared with questions in hand and pen-and-paper at the ready for fear of missing an important make-or-break detail.\nThere is certainly great value in such meetings, and I’ve engaged in many both as mentee and mentor because they expose alternate possibilities and steps a mentee may not have otherwise considered.\nBut, these meetings are only part of the mentoring story. They’re too infrequent and episodic, typically focused on the next big career decision. Expanded professional development and success, the kind that most benefits our Nation and yields a real experience that opens new professional doors, begins with an everyday mentoring mentality.\nThis kind of mentoring can be just as important and offers greater real-time learning opportunities. Yes, this takes time. To get the most from mentoring, both the mentee and the mentor need to step up their game and invest the extra time.\nHas your boss ever made a decision that surprised you? That just didn’t make sense? Has your boss ever asked you to do something without providing the strategic context? Without stating why they needed it?\nThese situations have happened many times to me. Each time, I had to quickly assess whether to ask questions and what harm might come to me if I did. Except for situations where it’s not appropriate – such as social, safety, or time-critical scenarios – I encourage you to ask your questions.\nHaving your boss explain their mental maps and thought processes, as well as the strategic context, as they work through real problems is a powerful form of real-time mentoring that no pre-scheduled annual meeting could ever replicate. You might find you agree with your boss, or you might find you don’t. That’s okay.\nQuestioning allows you to think through problems as if you were the decision maker and indirectly gives you an experience you can use later when you are the boss! Some bosses may feel threatened, perhaps thinking you disapprove of their leadership. To keep yourself “safe” during your next feedback session discuss your development needs and desire to ask questions.\nState that you’d like to understand and learn from them as they lead the organization and make decisions. When you later ask questions respectfully and with a pure heart, most bosses in our great Air Force will be excited to mentor you in this way.\nOkay, so what if you’re the boss and mentor?\nI encourage you to make every day mentoring a part of your everyday process. You should start by encouraging your team to ask questions, and then be open, friendly, and interested when they do.\nBetter yet, you should explain what led you to your decision or tasking in advance of their questions. Most work situations afford time for these mentoring moments that can and should be leveraged for the betterment of junior workforce professional development. Your time to serve and lead is limited, yet the needs of our nation are enduring.\nYou must do your part by investing the extra time now to grow our next generation of Air Force leaders. I think you’ll find that genuinely executed everyday mentoring pushes you closer to being the leader you dreamed of being. And the best part? It always feels right.\nMentoring is a mentality, not a meeting. While we need to continue the formal mentoring sessions of which books have been written, we can get more out of mentoring, both as mentee and mentor, if we’re willing to invest the time and make it part of nearly everything we do.", "url": "https://apnews.com/b6dee29ac3784052b55a62f8e8226cf1"}