{"authors": ["Tom Kahl"], "date_download": "2020-05-04 21:06:54", "date_modify": "2020-05-04 21:06:54", "date_publish": "2018-02-05 17:00:00", "description": "Micah Shepard and the Sabercats got back on the winning track in style Saturday night as Shepard reached 1,000 points in an 85-77 win over Silver Lake. Shepard joins an elite list of just 19...", "filename": "_c05dbda2e86142e8927dc72f9d112a06_1588626414.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c05dbda2e86142e8927dc72f9d112a06_1588626414.html", "title": "Mens hoops: Shepard tops 1,000 points as MBU rallies", "title_page": "Mens hoops: Shepard tops 1,000 points as MBU rallies", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Micah Shepard and the Sabercats got back on the winning track in style Saturday night as Shepard reached 1,000 points in an 85-77 win over Silver Lake.\nShepard joins an elite list of just 19 players in program history to reach this milestone, including coaches Jeff and Joel Borchardt.\nThe game was tightly contested from start to finish as the lead changed hands like a hot potato.\nSilver Lake came out of the gate with a point to prove. Riding the momentum of some accurate shooting from downtown, the Lakers basically doubled the Sabercats’ score through the opening minutes of the first half.\nThe Sabercats tried to stay with the Lakers, and their determination paid off in the late minutes of the first half. A well-balanced Sabercats offense strung a 10-2 run together to get right back into the game. A pair of free throws from Jonathan Book tied the game with just over a minute left in the half. Silver Lake came back to hold the two-point lead at the break, but the Sabercats had clawed their way back.\nA David Lerma layup gave the Sabercats their first lead of the game just over two minutes into the second half. The basket from the junior signaled a number of lead changes over the next five minutes, as neither team established clear command of the game.\nShepard’s big moment came with nine minutes left in the second half, when he found himself wide open in the corner, right in front of the Sabercats bench. As he has done time after time in his career, Shepard effortlessly connected his 3-point jumper to reach the coveted mark of 1,000 career points.\nThe milestone moment was a part of a 20-point night from Shepard.\nFrom then on, the Sabercats held the lead until the horn sounded. It wasn’t without a scare from the Lakers, who came within three points a few different times down the stretch.\nLerma led the Sabercats with 23 points while Justin Blake, Matt Gill and Jonathan Book all recorded 10 points.\nShepard, Lerma and the Sabercats shot 45 percent from 3-point range. That was their best mark in two weeks.\nSLC’s Dreshawn Dorsey led the visitors with 16 points.\nThe Sabercats now lead the all-time series 4-3.\n“Silver Lake has a good team, and they came ready to play today. They’re going to be tough in years to come,” said coach Keith Salscheider after the game. “It was nice to have our guys come together at the right time and stick to the game plan. When we do that, we’re going to be good. Congratulations to Shep on his 1,000 points — it’s a testament to his hard work and ability, and it’s a testament to the guys he’s played with. We are excited for him, and we are excited for where we are headed.”\nThe Sabercats will travel to Lincoln Christian University on Tuesday for a 6 p.m. tip.\nMBU 85, SILVER LAKE 77\nSilver Lake 36 41 — 77\nMBU 34 51 — 85\nSilver Lake (fg-ft-tp) — Harris 4-0-9, Lloyd 5-1-14, Tormo 2-0-4, Duckworth 6-2-15, Harper 3-3-11, Hughes 3-0-6, Dorsey 7-0-16, Kerrihard 1-0-2. Totals 31 6-10 77.\nMBU (fg-ft-tp) — Blake 3-3-10, Cashner 2-0-4, Book 3-4-10, Shepard 8-0-20, Lerma 7-5-23, Medina 1-2-4, Jones 1-0-2, Wilkerson 1-0-2, Gill 3-4-10. Totals 29 18-27 85.\nThree-point goals — SL, Harris, Lloyd 3, Duckworth, Harper 2, Dorsey 2; MBU, Blake, Shepard 4, Lerma 4.\nTotal fouls — SL 21, MBU 16.\nFouled out — Duckworth.", "url": "https://apnews.com/c05dbda2e86142e8927dc72f9d112a06"}