{"authors": ["Journal Gazette"], "date_download": "2020-05-04 20:24:21", "date_modify": "2020-05-04 20:24:21", "date_publish": "2018-01-11 05:00:01", "description": "Indiana State Police are looking for two people they say stole a pickup truck from a used car dealership in Columbia City on Sunday. At 10:20 p.m., a 2018 Dodge Dakota pickup pulled into...", "filename": "_0bf253b95b5b4757926b3cfc8a0f3752_1588623861.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0bf253b95b5b4757926b3cfc8a0f3752_1588623861.html", "title": "Pickup truck stolen at Columbia City lot", "title_page": "Pickup truck stolen at Columbia City lot", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Indiana State Police are looking for two people they say stole a pickup truck from a used car dealership in Columbia City on Sunday.\nAt 10:20 p.m., a 2018 Dodge Dakota pickup pulled into Bart’s Car Store, 3536 Lincoln Way, state police at Fort Wayne said.\nSurveillance video shows two people getting out of the truck and taking a dark gray 2004 Ford F-250 Super Duty Lariat from the lot, police said.\nAnyone with information about the suspects is asked to call Detective Andrew Mills at 260-432-8661 or 800-552-0972.\n2 dogs rescued from house fire\nFort Wayne firefighters are investigating the cause of a late-night house blaze Tuesday in which two dogs were saved, but a family was left homeless.\nCrews responded to the fire at 4503 Anthony Wayne Drive about 11 p.m. When firefighters arrived, there was heavy smoke and fire, the department said.\nTwo dogs at the one-story home were rescued. One of the animals was unconscious but was revived by firefighters and taken to Fort Wayne Animal Care & Control for treatment, the fire department said.\nTwo adults and two children lived at the house. Red Cross is assisting them, officials said.\nThe fire, which investigators believe began in the kitchen, was under control in about 10 minutes, the department said.", "url": "https://apnews.com/0bf253b95b5b4757926b3cfc8a0f3752"}