{"authors": ["Richard Gregory"], "date_download": "2020-05-04 20:19:22", "date_modify": "2020-05-04 20:19:22", "date_publish": "2018-04-06 23:55:26", "description": "Massacusetts Maritime Academy women’s lacrosse coach Marc Palombo refers to senior attacker Stephanie Hunt as his team’s “go-to girl” — and for good reason. Because time after time, when the...", "filename": "_5470bb83563d46e1b5709290a5bf9d3c_1588623562.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5470bb83563d46e1b5709290a5bf9d3c_1588623562.html", "title": "200 and counting: Brookfield’s Hunt reaches scoring milestone with Mass. Maritime lacrosse team", "title_page": "200 and counting: Brookfield’s Hunt reaches scoring milestone with Mass. Maritime lacrosse team", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Massacusetts Maritime Academy women’s lacrosse coach Marc Palombo refers to senior attacker Stephanie Hunt as his team’s “go-to girl” — and for good reason.\nBecause time after time, when the Buccaneers have needed a big goal or a clutch play, it has been Hunt, a former multi-sport standout at Brookfield High School, who has provided it. For instance, it was Hunt’s goal with four seconds remaining that lifted the Bucs to a thrilling 13-12 victory over SUNY Maritime in the fourth-annual Maritime Cup tournament. It was just one more shining moment in a career that has been filled with them.\n“She puts a lot of weight on her shoulders to get the job done,” Palombo said. “She’s a really good player, and we’re going to miss her next year. We’re going to miss our go-to girl.”\nThe all-time leading scorer in program history, Hunt passed a special milestone on March 27 when she scored her 200th career point in an 18-1 victory over Becker College. Hunt entered the game with 196 points, and tallied three goals and three assists that day. She reached the 200 mark with her third goal of the game, scored less than nine minutes in.\n“It feels incredible,” Hunt said. “At the end of last season, I realized I was just under 200, so this whole season my personal goal was to get to 200.”\nHunt is enjoying a sensational senior season. In eight games, she has recorded 43 points (23 goals and 20 assists. She has 209 career points with seven games remaining in the regular season, including Saturday’s showdown at Massachusetts State College Athletic Conference foe Worcester State.\nThe Bucs are 4-4 at roughly the midpoint of the season, which may not seem like a big deal, but for a program which has never had a winning season since its inception as a varsity team in 2012, and which entered this season with 18 wins combined in its first six seasons, those four wins have created a good deal of excitement — not to mention confidence. The Bucs are hoping their efforts result in a spot in the MASCAC tournament for the first time since 2013, when they lost in the first round.\n“We’re looking forward to trying to get into the playoffs this year,” Hunt said.\nHunt has had a busy four years at Massachusetts Maritime. In addition to being the best women’s lacrosse player in school history, she also starred on the women’s soccer team, leading the Bucs in scoring her junior year with 24 points (11 goals, two assists). She also plays the flute in the school band, and is the executive officer of the academy’s Seventh Company, which includes the band, honor guard and drill team.\n“When I was looking at schools, I wanted a place where I could continue to (play soccer and lacrosse and play in the band),” she said. “I wanted to be able to do those three things, and Mass. Maritime was a place where I could get incredible leadership experience and do the three things that I love to do.”\nHunt is on schedule to graduate in June with a degree in International Maritime Business.\nIn the meantime, she and the Buccaneers will be plotting a course toward the playoffs.\nrgregory@newstimes.com; Twitter @DanburySports", "url": "https://apnews.com/5470bb83563d46e1b5709290a5bf9d3c"}