{"authors": ["Mark Brunswick"], "date_download": "2020-05-04 20:15:15", "date_modify": "2020-05-04 20:15:15", "date_publish": "2018-02-14 21:01:13", "description": "It was artwork once deemed too real to display. But the Minneapolis Veterans Affairs Medical Center on Wednesday reversed itself and will now allow Iraq war vet Bill DeRoche to display a sculpture...", "filename": "_339b366f884e4590b0e42bb83fe508f5_1588623315.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_339b366f884e4590b0e42bb83fe508f5_1588623315.html", "title": "A combat vet's banned sculpture can now be viewed. But is it too late?", "title_page": "A combat vet's banned sculpture can now be viewed. But is it too late?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A combat vet’s banned sculpture can now be viewed. But is it too late?\nIt was artwork once deemed too real to display. But the Minneapolis Veterans Affairs Medical Center on Wednesday reversed itself and will now allow Iraq war vet Bill DeRoche to display a sculpture he created for the VAs ongoing art show.\nThe VA originally banned the sculpture because the featured inert shells in the artwork violated federal weapons prohibitions. It also claimed DeRoches work appeared to be so real that it could trigger trauma for veterans viewing it.\nBut after a lawyer representing DeRoche suggested in a letter that the VA was violating DeRoches First Amendment rights, the agency said it would allow the sculpture to be displayed after all as part of its Creative Arts competition at the medical center.\nBefore the artwork can be shown, however, the VA said DeRoche must get an expert to certify that it is safe. He must also provide the VA with documentation of the inspection. If both conditions are met, the VA said it will then display the piece behind a partition with a sign stating what it is so individuals can decide about viewing it.\nThe art show started Wednesday and runs through Friday.\nDeRoche, who learned of the VAs reversal from a reporter, said the conditions were reasonable but added that he would have to hustle to meet the VAs requirements in time to display his work in the show.\nThis could have all been handled so differently, but it took on a life of its own, he said. Maybe its an ego thing, but 90 percent of these people would never admit they are wrong.\nAfter the story of the VA banning DeRoches sculpture was published in the Star Tribune last month, lawyer and Army veteran Larry Frost contacted DeRoche and offered his support. In a letter dated Monday to the VA, Frost, who spent 27 years in the military, said banning the artwork violated DeRoches free speech rights and that the inert casings could not be considered weapons.\nYes, shell casings (in this case) are legally recognized as speech,andthinsp; Frost wrote in his letter. The VA is forbidden by Supreme Court decisions of very, very long standing from censoring speech on the basis of content. You and your agency cannot reasonably claim they were unaware of these rights. You have specifically censored Mr. DeRoches speech because of its content.\nFrosts letter added: I am enraged that the VA would dare to decide that we, adult combat veterans, are incapable of deciding for ourselves whether to view Mr. DeRoches art or not to do so. Your nanny mentality smacks of the kind of paternalism no veteran is likely to stomach.\nAs late as Tuesday, as the opening of the art show approached, the VAs position banning the artwork was unchanged. In a letter to Frost, a VA attorney said the organization had consulted with the federal Bureau of Alcohol, Tobacco and Firearms and still believed the artillery casings to be an explosive device.\nFrost heralded the reversal on Wednesday.\nOnce you make a decision, you kind of get committed to it. Im very glad the VA reconsidered, and I think its a reasonable decision under the circumstances, he said.\nDeRoche, a Marine veteran, said he had been encouraged for years to enter the art competition. Injured in a 2004 bomb blast that struck his convoy in Iraq, it would be a way, he was told, to publicly address the trauma that continues to affect him.\nBut the VA balked when it got a look at photos of the sculpture DeRoche planned to enter. The piece includes four 155-millimeter shells connected by wires, a representation of the improvised explosive devices (IEDs) used in the kind of blast that wounded him. The shells in the artwork were a risk to public safety and a threat to a vulnerable population, the VA said.\nAlthough the shells are inert, the VA wanted them removed. DeRoche refused, saying it would ruin the works message.\nThe sculpture features the four casings wired together inside a wooden crate, with two fake skulls, a deck of cards, DeRoches dog tags, and various symbolic medals and coins. A flickering light bulb projects up from the box. It is meant to show the light that helped DeRoche through his darkness, he said.\nThe purpose of the competition, which generates 100 to 150 submissions a year, is to recognize veterans for their creative accomplishments and to educate and demonstrate to our community the therapeutic benefits of the arts, according to a pamphlet the VA distributed about the event.\nThe VA said the initial decision on DeRoches work marked only the second time in 30 years of the competition that an entry had been rejected.\nMark Brunswick 612-673-4434", "url": "https://apnews.com/339b366f884e4590b0e42bb83fe508f5"}