{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:16:18", "date_modify": "2020-05-04 20:16:18", "date_publish": "2018-10-31 04:01:01", "description": "BAZAAR: Milton's Lighthouse Baptist Church hosts its twelfth annual bazaar from 10 a.m. to 2 p.m. Saturday, Nov. 3, in its new fellowship hall. Lunch is available, along with crafts, baked goods...", "filename": "_0105468f8d28469897d5eddfececd1ed_1588623378.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0105468f8d28469897d5eddfececd1ed_1588623378.html", "title": "Brenda Lucas: community news for Wednesday, Oct. 31", "title_page": "Brenda Lucas: community news for Wednesday, Oct. 31", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BAZAAR: Milton’s Lighthouse Baptist Church hosts its twelfth annual bazaar from 10 a.m. to 2 p.m. Saturday, Nov. 3, in its new fellowship hall. Lunch is available, along with crafts, baked goods and white elephant sale.\nBLESSING: Thursday, Nov. 1, marks a very special day for my sister and me. Our Momma, Nada Lucas, turns 87 years young and we still try to do as she says. Why should we doubt her now as she has always been there for us and tried her best to steer us right. How blessed can two girls be to be able to say - happy 87th birthday momma. We love you. Hope you have many more birthdays, better health and fond memories to come.\nUNCLE: My family considered Bill Gillespie more than an uncle the Herald-Dispatch retiree with many years’ service and uncle by marriage (my dad’s sister, Deloris) came to the rescue of my family many times. He would have celebrated a birthday Thursday, Nov. 1, but passed away several years ago. His kindness continues to be missed.\nLUNCHEON: Wednesday, Oct. 31, is deadline for a luncheon/monthly meeting hosted by Democratic Women’s Club of Cabell County at 12:30 p.m. Saturday, Nov. 3, at Barboursville Moose Lodge, Eastern Heights Shopping Center, 43351 U.S. 60 E. A presentation regarding West Virginia Supreme Court candidates is given. A luncheon buffet costs $15. Reservations are required. Contact janetartrip@yahoo.com or 304-634-5855; kbs25701@gmail.com; 304-522-1471; ahughart@usgs.gov or 304-964-3669; or 304-523-4389.\nSPAGHETTI: The 45th annual spaghetti dinner fundraiser sponsored by Our Lady of Fatima Parish School is from noon to 7 p.m. Sunday, Nov. 4, at the school. The event features spaghetti/homemade sauce by Chef Jeremiah Bowen of Black Sheep Burritos and Brews and his sauce crew, along with meat or marinara sauce, salad, bread, drink and dessert. A book fair, basket raffle, sweet shoppe with homemade goodies are also available. Advanced tickets are $10; $5 ages 4-10; or $11 and $6 day of event. Tickets are available in school or parish office. Call 304-523-2861.\nMEET: The monthly meeting of Southside Neighborhood Organization takes place at 7 p.m. Thursday, Nov. 1, at St. Paul Lutheran Church. Enter double doors off parking lot. Joe Fincham discusses two constitutional amendments appearing on ballot in the upcoming election.\nAUCTION: God’s House of Worship conducts a benefit auction at 6 p.m. Friday, Nov. 2. Mike Bowen is auctioneer. New and used items and a concession stand are available. Contact Pastor Wayne Craft, 304-617-0907.\nBAZAAR: A Christmas bazaar featuring 20 vendors is from 9 a.m. to 2 p.m. Saturday, Nov. 3, at Grayson Nazarene Church, 105 South Court St., Grayson, Kentucky. A country breakfast and hog dog lunch are served. Proceeds help fund community ministries.\nEVENT: United Methodist Women of Forrest Burdette Memorial United Methodist Church hosts its annual festival from 9 a.m. to 2 p.m. Saturday, Nov. 3, at the Hurricane, West Virginia, church. Arts, crafts, books, vendors, hot dogs, BBQ and the country store are featured.\nFILMS: Marshall Artists Series presents “The Fall International Film Festival” featuring six films from around the world Thursday-Sunday, Nov. 1-4, at Keith-Albee Performing Arts Center, as part of Marshall Artists Series. Films include “Back to Burgundy,” 5:30 Thursday and Saturday; “Loveless,” 7:40 p.m. Thursday and 12:30 p.m. Sunday; “RBG,” 11 a.m. Friday, 12:30 p.m. Saturday and 7:35 p.m. Sunday; “A Fantastic Woman,” 5:30 p.m. Friday and 7:45 p.m. Saturday; “Angels Wear White,” 7:30 p.m. Friday and 2:45 p.m. Sunday; “The Insult,” 2:30 p.m. Saturday and 5:30 p.m. Sunday. Tickets are $10; $5 part-time students; and free to full-time MU students with valid student ID. Call 304-696-6656.\nTODAY’S BIRTHDAYS: Megan Evans, Abigail Howat, Jennifer Johnson, Brittany Booth, Robin Hanson, Mary Brown, Dylan Shepard, Kristi Scarberry, Allison Watson, Sharon Wallace, Anna Weatherholt, Lisa Dudley, Jim Mitchell.\nTODAY’S ANNIVERSARIES: Chris and Kelly Journell Beltz, Clyde and Sharon Crawford, Michael and Debi Campbell, Brue and Sharon Fizer.\nTHURSDAY’S BIRTHDAYS: Chris Callicoat, Gabriel Hanley, Adriaunna Paige Craft turns 5, Randalee DeJong, Matt Reed, Izack Massie, Aaron Tufts, Alex Tufts, Jacquelyn Goodenough, Anne Imperi, Marcella Corkrean, Katie Lynch, Kara Ramey.\nFRIDAY’S BIRTHDAYS: Jim Dixon crosses over number 70 to 71, Linda Arthur, Paul Dickerson, Syd Hanson, “Pool Doctor” Paul David Brown turns 72, Nancy Coffey, Brent Fulks, Peggy Wilmink, Carol Ashworth, Ann Marie Battista Clarke of Catlettsburg, Kentucky, daughter of Dino Battista, is 48.\nFRIDAY’S ANNIVERSARY: The Rev. Jamie and Carol Gump.\nCHUCKLE: One Halloween night, Jimmy’s youngest sister dressed up as a ghost. They were out trick-or-treating when suddenly she started screaming and running down the road. Mom asked her what was wrong. Turns out his sister was being chased down the street by her own shadow!\nSend items to Brenda Lucas, P.O. Box 596, Ona, WV 25545; fax to 304-526-2857; or email to bklucas53@aol.com.", "url": "https://apnews.com/0105468f8d28469897d5eddfececd1ed"}