{"authors": ["Julia Bergman"], "date_download": "2020-05-04 20:15:20", "date_modify": "2020-05-04 20:15:20", "date_publish": "2018-04-24 05:00:01", "description": "Hartford — Veterans organizations from across the state gathered at the Capitol on Tuesday to urge state lawmakers, as they negotiate a final budget deal, to keep intact 1 million for the new...", "filename": "_881e5a936ada4aaebdc0b66e3185d160_1588623320.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_881e5a936ada4aaebdc0b66e3185d160_1588623320.html", "title": "Veterans groups urge lawmakers not to slash state VA's budget", "title_page": "Veterans groups urge lawmakers not to slash state VA's budget", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Hartford — Veterans organizations from across the state gathered at the Capitol on Tuesday to urge state lawmakers, as they negotiate a final budget deal, to keep intact 1 million for the new fiscal year starting July 1. Over the past decade, the department’s budget has been cut by more than 35 percent, resulting in understaffing and negative impacts on the veterans’ home in Rocky Hill and restrictions at the veterans’ cemetery, the veterans groups said.\nThe budget passed by the General Assembly during the 2017 special session included a proposal from the governor to change the license of the Sgt. John L. Levitow Healthcare Center, a 125-bed facility that provides care to veteran patients with chronic and disabling medical conditions, from a chronic disease hospital to a skilled nursing facility. The licensure change was expected to save 2 million cut remained on the table.\nOn Friday, Democratic and Republican legislators unveiled their proposals for the next state budget, both of which restore the funding. The Veterans Affairs Committee also proposed legislation to restore the $2 million.\n“It’s inexcusable, really, the type of cuts that have happened to our veterans over the years. I’m sure when they stood up and they raised their hand, they took that oath, they weren’t expecting this kind of treatment when they came back to Connecticut,” said Rep. Charles Ferraro, R-West Haven, ranking member of the Veterans Affairs committee.\nFerraro said he was confident the funding would stay intact in the final budget deal. The session ends on May 9.\nVeterans organizations that were represented Tuesday at the Capitol include: Veterans of Foreign Wars, American Legion, American Veterans, Disabled American Veterans, Vietnam Veterans of America, the Marine Corps League, Jewish War Veterans, the Franco American War Veterans, Iraq and Afghanistan Veterans of America, Military Order of the Purple Heart, and Catholic War Veterans.\n“There are a lot of organizations here, all united. Expect to see this more going forward,” said Kennedy, the head of the Connecticut chapter of IAVA.\nj.bergman@theday.com", "url": "https://apnews.com/881e5a936ada4aaebdc0b66e3185d160"}