{"authors": ["Steve Mocarsky"], "date_download": "2020-05-04 20:25:21", "date_modify": "2020-05-04 20:25:21", "date_publish": "2018-06-15 00:00:00", "description": "WILKES-BARRE TWP. — Tommy Van Scoy Jr. had developed contingency plans for robberies, for fires — but not a tornado. “There’s no place for anyone to go with a tornado like this,” the owner...", "filename": "_c9743389ed8b4029bd13cd918e5cb4ee_1588623921.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c9743389ed8b4029bd13cd918e5cb4ee_1588623921.html", "title": "For Businesses, No Contingency Plan", "title_page": "For Businesses, No Contingency Plan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WILKES-BARRE TWP. — Tommy Van Scoy Jr. had developed contingency plans for robberies, for fires — but not a tornado.\n“There’s no place for anyone to go with a tornado like this,” the owner and president of Tovon and Co. said Thursday — the day after an EF2 twister destroyed the family-owned jewelry store.\n“Most of the stores here are open till 8 or 9 o’clock. People would have died if it came two or three hours earlier,” Van Scoy said.\nThe jewelry store is located in a strip mall within the Wilkes-Barre Township Commons shopping center next to Panera Bread, where several restaurant employees had been working to close for the night and were trapped inside after the tornado hit at about 10 p.m.\nVan Scoy said a police officer told his wife the Panera employees escaped serious injury because they sheltered inside a walk-in cooler. The mall has no basement areas.\nHad a tornado hit when his store was still open, Van Scoy said the smartest thing to do would be to shelter in “the closest cubicle, like a bathroom,” which he believes would offer more structural support and protection from debris.\nVan Scoy said given increasingly unpredictable weather patterns, he plans to talk with the shopping center owner about what can be done to protect people from “something like this in the future.”\nHe noted in some southern states, small tornado shelters that can accommodate a handful of people are commonplace.\nA representative from Urban Edge Properties, the shopping center owner with offices in New York City and Paramus, New Jersey, did not return a message seeking comment.\nRobert Tamburro, trustee and general partner of TFP Limited, the owner and landlord of the adjacent Arena Hub Shopping Center, where several stores also sustained major damage, said he’s immediately focused on working with his insurance company “on a game plan to get everything cleaned up and stabilized.”\nTamburro said the goal is to get stores and restaurants “renovated, fixed and back in business.”\nHe estimated the jobs of as many as 1,000 employees working on TFP Limited properties alone might have been affected by at least temporary closures while utility crews work to restore power.\nVan Scoy said his immediate concern is for his three employees — two of which have worked for him for about a quarter-century — and making sure his insurance company covers their pay while the store is closed. “They have mortgages, they have car payments; I want to make sure they’re taken care of.”\nNext, he said, he’ll find a temporary location with a separate phone number to serve his customers. He said all customer jewelry at the store for repair or cleaning was locked in a safe, and the safe is “intact and undisturbed.”\nVan Scoy said getting the business back up to full-service will take some time because he made several of his pieces of machinery by hand and they can’t be purchased.\nDesigning and then producing jewelry to a customer’s specifications is one of the services offered by the company, which has been in business since 1987.\nTovon and a few other small family businesses face a bigger challenge than the corporate chain stores that were devastated such as Barnes & Noble and Dick’s Sporting Goods because the smaller businesses have only one location, he said.\n“If a chain location is closed, they can rely on income from other stores,” Van Scoy said. “This is our only livelihood.”\nMegan Millo, vice president of Operations for Ken Pollock Auto Group, said the company’s Nissan dealership on Mundy Street sustained damage to the building as well as to vehicle inventory.\n“We’re 100 percent customer-focused and we’ve been reaching out to all of our customers,” Millo said. “Our hearts go out to our business neighbors as well.”\nWico van Genderen, president and CEO of the Greater Wilkes-Barre Chamber of Business and Industry, said the chamber will be able to offer low-interest loans to help businesses beyond what their insurance covers, especially the smaller, family-owned businesses.\nVan Genderen said the chamber still has access to funding in a Metro Action Loan Fund that was left over after it was acquired to help area businesses recover from major flooding in 2011. Loans are available at 1 percent interest, he said.\nContact the writer:\nsmocarsky@citizensvoice.com\n570-821-2110, @cvmocarsky\nNEED HELP RECOVERING?\nAny business people who would like assistance in connecting with local resources that can help in recovery after the tornado are encouraged to call the Ben Eaton at the Greater Wilkes-Barre Chamber of Business and Industry at 570-408-1728.", "url": "https://apnews.com/c9743389ed8b4029bd13cd918e5cb4ee"}