{"authors": ["Ralph Miliband", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Marcel Liebman", "Meagan Day", "Shawn Gude", "Alex Gourevitch"], "date_download": "2020-05-04 19:55:22", "date_modify": "2020-05-04 19:55:22", "date_publish": "2018-06-18 00:00:00", "description": null, "filename": "2018_06_ralph-miliband-socialism-legitimation-hegemony_1588622122.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/06/18161022/5279909248_a184f19345_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_06_ralph-miliband-socialism-legitimation-hegemony_1588622122.html", "title": "Counter-Hegemonic Struggles", "title_page": "Counter-Hegemonic Struggles", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The rise of mass democracy presented economic and political elites with a conundrum. How, with the political enfranchisement of ever-greater parts of the population, could they maintain an order that still left many behind in the economic and social spheres? Did the rise of democracy mean the end of capitalism? In retrospect, their fears might seem paranoid — of course capitalism could withstand a broader electorate. But their anxiety vaulted them into action. Coupling repression with spirited (and well-funded) defenses of the system, they blunted the most radical threats confronting it. They made “capitalist democracy” seem like common sense — the best of all social arrangements, or at least the best of those possible. The problem, as Ralph Miliband points out in the following essay, first published in the 1990 edition of Socialist Register, is that many people’s day-to-day lives continue to cause them to question the justness of the status quo: The message speaks of democracy, equality, opportunity, prosperity, security, community, common interests, justice, fairness, etc. The reality, on the other hand, as lived by the majority, is very different, and includes the experience of exploitation, domination, great inequalities in all spheres of life, material constraints of all kinds, and very often great spiritual want. But is there really an alternative? Miliband argues forcefully that there is, and proceeds to make an extended case for socialism and a Marxist politics, answering both right-wing critics and left-wing skeptics. Miliband never shied away from tackling the big questions — and that’s why he’s one of our favorites here at Jacobin.\nHegemony, in Gramsci’s meaning of the term, involves both coercion and consent. As consent, it means the capacity of dominant classes to persuade subordinate ones to accept, adopt, and “interiorize” the values and norms which dominant classes themselves have adopted and believe to be right and proper. This might be described as the strong meaning of hegemony-as-consent. A weaker version is the capacity of dominant classes to persuade subordinate classes that, whatever they might think of the prevailing social order, and however alienated they might be from it, any alternative would be catastrophically worse, and that in any case there was nothing much that they could do to bring about any such alternative. Weaker though this second version might be, it is not much less effective than the first one in consolidating the social order. In either version, however, hegemony is not something that can ever be taken to be finally and irreversibly won: on the contrary, it is something that needs to be constantly nurtured, defended, and reformulated. The dominant classes of capitalist-democratic regimes understand this very well, and do not take hegemony for granted. The whole history of these regimes, since the achievement of an extended suffrage, the creation of national working-class movements, and serious political competition between bourgeois and labor or socialist parties, has been marked by a determined “engineering of consent” on the part of conservative forces, and by their fierce striving to win the hearts and minds of their subordinate populations. The sources of these struggles have been extremely varied, and their forms have ranged from the most sophisticated and subtle to the most stridently demagogic. The purpose, however, is always the popular ratification of the prevailing social order, and the rejection by the working class (and everybody else) of any notion that there could be a radical and viable alternative to that order. This purpose, it should be added, is also served by real concessions to pressure from below, notably in the realm of welfare services: it would be a great mistake to take hegemony-as-consent to be purely a matter of mystification. Be that as it may, the main reason why the struggle for hegemony-as-consent can never be taken to be finally won in capitalist-democratic regimes is that there exists a vast discrepancy between the message which hegemonic endeavors seek to disseminate, and the actual reality which daily confronts the vast majority of the population for whom the message is mainly intended. The message speaks of democracy, equality, opportunity, prosperity, security, community, common interests, justice, fairness, etc. The reality, on the other hand, as lived by the majority, is very different, and includes the experience of exploitation, domination, great inequalities in all spheres of life, material constraints of all kinds, and very often great spiritual want. Reality may not be conceived and articulated in these precise terms, but it is nevertheless adversely felt, and produces frustration, alienation, anger, dissent, and pressure from below for the resolution of grievances. A crucial purpose of hegemonic endeavors is to prevent such sentiments from turning into a generalized availability to radical thoughts. Were it not for the discrepancy between hegemonic message and lived reality, there would obviously be much less need, or no need at all, for the unremitting assault on popular consciousness. Nor would it be necessary to take much account of counter-hegemonic endeavors: such strivings would be the work of isolated individuals, who could be dismissed as eccentrics, and who would have no hope of achieving a serious hearing. As it is, the discrepancy between rhetoric, even when backed by real concessions, and reality as it is lived, does provide a very large terrain for counter-hegemonic endeavors. The terrain is sometimes more favorable, sometimes less, but it is never altogether barren, given the nature of capitalism. The terrain is sometimes more favorable, sometimes less, but it is never altogether barren, given the nature of capitalism. These endeavors are as diverse in form as hegemonic ones; and one of the most notable features of the present epoch is how diverse also have been their sources. Much, for instance, has rightly been made in recent decades of the quite outstanding contribution which feminist, ecological, antiracist and other “new social movements” have made to the disturbance of the mental status quo of the countries in which they have flowered; and it must be assumed that they will continue to affect the political culture and the political agenda of these countries. There was a time, not very long ago, when it was taken for granted on the Left that the only source of “real” dissent and challenge was the working class, and more specifically labor movements. The presence of “new social movements” on the ideological and political scene has produced a general awareness on the Left that this was an aberration, and that these movements had a major and indispensable contribution to make. Indeed, the wheel has now come full circle, with many people on the Left now persuaded that only “new social movements” can be expected to provide an effective challenge to the status quo, and that labor and socialist movements are too steeped in ancient (and obsolete) modes of thought to be able to do so. This loss of confidence in “traditional” socialist ideas, not to speak of labor and socialist agencies, has indeed been the dominant feature of the political culture of the Left in the eighties. “New times,” it has been insistently proclaimed, require new thinking; and new thinking requires the abandonment of many, perhaps most, of the long-cherished but by now quite irrelevant ideas which have been at the core of the socialist tradition. The message has been conveyed in many different versions; but it ultimately amounts to a retreat from the search and the striving for a socialist alternative to capitalism. The present essay is written in the belief that this is a grievously mistaken perspective, and that socialists do have a distinctive contribution to make to counter-hegemonic struggles; and that the socialist alternative which they propose is now more than ever needed in the struggle against conservative hegemony. Of course, this socialist contribution does not in any way oppose the concerns of “new social movements.” On the contrary, these concerns — anti-sexism, anti-racism, ecology, sexual liberation, peace, etc. — are part of the socialist agenda; and there are many people in “new social movements” who are themselves socialists and who conceive their concerns as bound up with socialism. But the question which I want to raise here is what are the fundamental positions which may nowadays be said to constitute the specific contribution which socialists can make to counter-hegemonic struggles. These positions need restating on at least two counts. The first, as already noted, is that they are now so often contested on the Left, or simply ignored. The second is that the crisis of Communist regimes, and the collapse of some of them, has given hegemonic forces a wonderful opportunity to proclaim not only that Communism was dead or dying, but that socialism in any version was in the same condition. Nothing, from a socialist perspective, could be more necessary than to counter this, and to provide a reasoned argument on behalf of the main propositions which define socialism.\nThe point of departure of such an argument has to be two closely related items: on the one hand, it involves a radical critique of the prevailing social order; on the other, an affirmation that an entirely different social order, based on radically different foundations, is not only desirable (which is easy enough), but possible. Critiques of capitalism on the Left have increasingly tended in recent times to be piecemeal, and specifically related to immediate “problems,” shortcomings, and failings over a multitude of issues. In other words, criticism on the Left tends to be directed at one aspect or another of the workings of a social order dominated by capitalism, without this criticism being related to the nature of the system as a whole. A socialist critique, on the other hand, is distinguished by the connections which it always seeks to make between specific ills and the nature of capitalism, as a system wholly geared to the pursuit of private profit, whose dynamic and ethos suffuse the whole social order, and which necessarily relegates all considerations other than the maximization of private profit to a subsidiary place, at best, in the scheme of things. A socialist critique is distinguished by the connections which it always seeks to make between specific ills and the nature of capitalism. A socialist critique, unlike liberal or social-democratic critiques, does not treat the economic, social, political, and moral failings of the system as unfortunate deviations from normality, but on the contrary as intrinsic features of the system. It is the attenuation of ills by way of public intervention and regulation which must be taken as deviations from the essential dynamic of capitalism, and as contrary to its spirit and purpose. There is, from this point of view, a perverse logic in the “libertarian” argument against all such intervention and regulation: “libertarians” simply have the callous courage which politicians devoted to “free enterprise” and the rule of the market cannot afford to have. Socialists do of course support and demand piecemeal reforms. But they also offer a critique of the limited nature and palliative character of such reforms; they demand an enlargement of the scope of reform and struggle against the constraints imposed upon reforms by the capitalist context in which they occur; and they warn against the illusion that the deep ills generated by the system can be truly cured within its framework. Thus, a socialist critique of the “welfare state” does not in the least denigrate the value of the reforms which are encompassed within this rubric; but it does point to the inadequacies which are bound to exist in a system unsympathetic to collective provision. Similarly, a socialist critique of public ownership points to the need to infuse it with an altogether different spirit from the spirit which moves capitalist enterprise, but also acknowledges that this, to be fully realized, requires the transcendence of capitalism itself. I suggested earlier that a socialist critique of the prevailing social order is always coupled with the insistence that a radical alternative is not only desirable but possible. “A radical alternative,” as I understand it, simply means the creation of a cooperative, egalitarian, democratic, and ultimately classless society, to be replicated in due course throughout the world. Any such project was always utterly repellent to anti-socialists everywhere, and fiercely denounced by them as utopian nonsense and as a sure recipe, whatever the intentions of its proponents, for the creation of a murderously repressive and totalitarian social order. Some such view, however, is now also quite commonly held in many parts of the Left as well. Here too, there is now considerable suspicion of the radical transformations which socialism undoubtedly implies. This, it should be noted, is not only a matter of saying that the project must be conceived as a long-term affair, as a process which is bound to extend over a very long period, and which may never come to be completed. All this is mere common sense; and if common sense was not sufficient, the experience of Communist regimes would show well enough that large-scale social change is a very difficult and complex business, even in the best of circumstances, which are not likely to exist anywhere, and which certainly did not exist in the countries where Communists assumed power. The view often found on the Left nowadays proceeds from a different position, namely that we don’t really know where we are, that we certainly don’t know where we should be going, that to try and impose a “pattern” upon what is called reality is dangerously arrogant, and that the very notion of a radical alternative to the here and now is laden with dangerous consequences. Thus speaks “postmodernism,” and other currently fashionable modes of thought as well. The experience of Communist regimes has many important lessons for socialists. But it cannot be taken to show that any attempt to create a society radically different from what capitalism has produced is bound to be disastrous. It is good conservative propaganda to argue that the only alternative to capitalism is the kind of regime which characterized Communist rule. But this is a very stunted view of what is possible by way of social arrangements; and one of the tasks of counter-hegemony is precisely to insist, with the help of programs and policies and “prefigurative” modes of behavior and organization, on the distance that separates socialism from Communist experience. The experience of Communist regimes has many important lessons for socialists. But it cannot be taken to show that any attempt to create a society radically different from what capitalism has produced is bound to be disastrous. There is obviously no way of proving this, save in practice; and this makes it possible for conservatives to point with much glee to the fact — and it is a fact — that nowhere has the kind of society advocated by well-meaning socialists come into being; and the point is reinforced by the fact that societies claiming to be socialist have been created, but have not been, to say the least, good models of what a socialist society should be. The point cannot be brushed aside; but what it means is that the socialist case has to be presented with due regard for the many difficult questions it raises. In other words, the case has to be made without the naive and implausible claims which have often been advanced for socialism. Socialism is not a doctrine of instant salvation, with the promise of a perfectly harmonious, strife-free society, in which all ills which have always afflicted humankind will be miraculously dissipated. Its claims are rather more modest. What it offers is the promise of a social order in which remediable ills would at least be drastically attenuated, and in which altruism and fellowship would be made possible by a context altogether different from the context provided by capitalism. There is, in this connection, a fundamental point which needs to be made: this is that the socialist project is based on the premise that “ordinary people” are capable of ruling themselves and of ensuring the viability of a cooperative, humane, and rational social order. This too is a message that goes against the grain in an epoch soaked in blood. The twentieth century has been a century of war, massacre, and horrors on an immense scale, in which masses of “ordinary people” have been willing participants, and to which even larger masses of people have given their support, or to which they have at least acquiesced. Does it then really make sense, after the bloodbaths of World War I and World War II, and all the other wars which this century has witnessed, after Auschwitz and the Gulag and Hiroshima and Vietnam and a host of other infamous such names, to project a rosy picture of societies — indeed of a world — peopled by humans capable of sociality, cooperation, altruism, and guided by rational modes of thought and behavior? The answer, in socialist terms, is not to deny mass participation in, or support for, or acquiescence in, the horrors which have marked the twentieth century; but rather to note the crucial fact that these horrors were not initiated by “the masses.” The ready attribution of guilt to everybody (“we are all guilty”) masks the fact that the high policy decisions which led to the horrors were made by rulers, with very little if any “input” by “the masses.” It was not “the masses” which decided to build gas chambers, or to build the Gulag, or to carry out saturation bombing in Korea or Vietnam. Socialism is not a doctrine of instant salvation, with the promise of a perfectly harmonious, strife-free society. Its claims are rather more modest. That “the masses” supported their rulers and took part in the enterprises which the latter set in train shows well enough that “ordinary people” are not innately good, which is hardly news, and that plenty of people easily develop an executioner’s vocation. This is a sobering thought, but it cannot be taken to mean that people are innately bad and incapable of sociality and altruism. What any such ascription — positive or negative — misses is the importance of the context in which “good” or “bad” qualities flower. At the heart of the socialist perspective, there is the conviction that nothing in this realm is settled, predetermined, and that human nature is not implacably cursed by “innate” cruelty and aggression. Allied to this conviction, there is the further notion that societies based on domination and exploitation, and in the grip of crises which they cannot resolve, will inevitably produce deep pathological deformations, of which racism, sexism, antisemitism, xenophobia, ethnic hatreds, cruelty, and aggression are common manifestations; and that socialism (not to be confused with Stalinism) offers the only possible context in which these deformations can be effectively countered and thus turned into marginal and increasingly rare phenomena. “Socialism or Barbarism” may be an overdramatic slogan; but insofar as barbarism is compatible with great technological and cultural sophistication, the notion of Socialism or Civilized Barbarism embodies a truth which counter-hegemonic struggles need to stress.\nRegrettably, any serious discussion of socialist alternatives has to tackle an exceedingly difficult question, namely the question of public ownership. I say “regrettably,” not because it is difficult, though it is, but because it is a subject which hardly quickens the blood or which provides much inspiration. Nor does it attract much support, even on the Left. Conservative propaganda, ever since the end of World War II, when measures of nationalization were part of the agenda of social-democratic parties, has succeeded in making the idea of public ownership all but synonymous with bureaucracy, inefficiency, sloth, and neglect of the consumer; and this propaganda has been given further credence by the unattractive forms which nationalization, under social-democratic auspices, did acquire. Also, Communist experience, here too, has served to strengthen the view that state enterprise is inefficient, and that it also constitutes a sinister additional support for unbridled statism. The Left nowadays may not be wholly reconciled to capitalist enterprise, but it has become exceedingly uncertain about any alternative to it; and the uncertainty has been greatly enhanced by the new difficulties which measures of nationalization in any single country, in the era of global capitalism, are deemed to entail. Counter-hegemonic endeavors imperatively require a reasoned discussion of these questions, and a resolute defense of public ownership as an absolutely indispensable foundation for a social order radically different from capitalism. It needs to be said, for instance, that public ownership is not synonymous with state ownership, and that it can and must assume many different forms, from state ownership of the commanding heights of the economy to municipal and cooperative ownership. Nor need public or social ownership, even in its different forms, be all-encompassing. However disagreeable this may be to purists, it is desirable that a private sector, with a multitude of small-scale enterprises, catering to a variety of needs, should continue to exist alongside the public sector: the point about this “mixed economy” is that the public sector should greatly outweigh the private one. Furthermore, it is pure propaganda and prejudice which affirm that state enterprise is inherently bureaucratic, inefficient, slothful, and so forth. There are plenty of instances, drawn from many countries, including Communist countries, to show that it need not be so. As for the dangers of enhanced statism, everything here depends on the nature of the regime in which public enterprise is located. An authoritarian regime, in which the state is indeed dominant over society, will hardly turn state enterprises into models of democratic practice. A capitalist-democratic regime, for its part, which conceives such enterprises in capitalist rather than democratic terms, will be as unsympathetic as private business to pressures for democratic control. A socialist regime, on the other hand, would be expected — in fact required — to include public enterprise in the general democratization of life which it would seek to foster. Nor can the growing internationalization of economic life make impossible the transfer into public ownership of strategic sectors of the national economy. It no doubt complicates the process, but the notion that it spells disaster, ruin, and chaos is, in this as in the case of other policies and measures which run counter to powerful interests and conventional modes of thought, born of ideological bias rather than cool assessment. Still, there are problems here sufficiently acute to require a compelling answer to the question: why bother? What is the point of so demanding and fraught an enterprise? The answer is made up of a combination of economic, political, and also moral factors which cannot be neatly disentangled. Insofar as a fundamental purpose of socialism is the creation of a genuinely democratic society, it cannot admit the existence of a formidable concentration of power in the hands of a small group of people, who exercise that power with very little external control. But such is precisely the power exercised by corporate elites in capitalist societies; and economic concentration renders that power ever greater and more extensive with every day that goes by. Insofar as a fundamental purpose of socialism is the creation of a genuinely democratic society, it cannot admit the existence of a formidable concentration of power in the hands of a small group of people. Of course, corporate elites themselves are much given to scoff at this notion, and to point at the constraints to which they are subjected by the state, their shareholders, customers, public opinion, the market, and so forth; and it is indeed the case that their power is not absolute, and that they do not form a perfectly cohesive bloc. But it is also sheer obfuscation to claim that because corporate power is not absolute or perfectly cohesive, it is not very great. On the contrary, it is very great indeed, and affects very deeply all economic, political, and cultural aspects of their societies, not to speak of its impact upon what the state does or does not do. It is in this respect a good illustration of the meaning of hegemonic obfuscation that its ideologists should have been able to foster the notion that the “special interests” which had real power in society and were able to “hold it to ransom” were the trade unions rather than capitalist interests. Corporate power turns “capitalist democracy” into a contradiction in terms, into a formulation laden with tension and double speak. For democracy, in any but a formal and stilted sense, requires a rough equality between the members of society: capitalist power precludes it. It also requires that power should be directed to purposes democratically determined by society, and carried out by responsible and accountable agents. Corporate power evades that requirement. This is not something for which the holders of corporate power can themselves be blamed. They too are the prisoners of a system whose rationality excludes so far as it can all considerations other than the maximization of profit for the firm. The notion that this is certain to produce the best possible results for everybody is belied by the whole history of the system. For throughout that history, it has been necessary for the state to step in and at least attenuate the socially detrimental effects of what capitalists, in the pursuit of private profit, were doing to their workers, consumers, and society at large. But this intervention, intended not least to save capitalism from itself, cannot — and is not intended to — cure the crucial and inherent fault of the system, namely the fact that it is not designed to assure the socially beneficial utilization of the immense resources which it has itself brought into being. Its productive capacity has been and remains truly prodigious; and this provides the basis for humane societies. But having created that basis, capitalism is itself the greatest obstacle to the realization of such societies. There are many people on the Left who accept all this, and more, but who go on to argue that the failures, shortcomings, and derelictions of capitalism require by way of remedy greater state intervention, regulation, direction, and prohibition, rather than public ownership, which is declared to be irrelevant. It is obviously an attractive argument, since it appears to dispose so easily of all the great complications and problems which are certain to attend the implementation of measures of public ownership, even in conditions where it enjoys wide support; and the argument is all the more attractive since it has been possible to achieve a good deal of regulation of capitalist enterprise. The trouble, however, is that this intervention has not normally impaired very materially the freedom of corporate power to make decisions of major local, regional, national, and international importance without much or any reference to anybody. A more radical measure of interventionism is possible in crisis circumstances, but is difficult to maintain effectively, at least in capitalist-democratic conditions, against the opposition, ill-will, circumvention, and sabotage which it is bound to encounter on the part of business. Nor obviously does interventionism change the essential character and dynamic of capitalism. In short, intervention and regulation, necessary though they are, are no substitute for public ownership, if the purpose is indeed the radical transformation of the system. Intervention and regulation, necessary though they are, are no substitute for public ownership, if the purpose is indeed the radical transformation of the system. On this score, the rehabilitation of public ownership has to be a major task of counter-hegemonic struggles in the socialist mode. Given the present state of the issue, this is likely to be a lengthy and arduous business; but it is an essential contribution which socialists have to make. So too do they need, quite obviously, to produce realistic answers to the questions posed by the relation of plan to market. Planning forms part of the economics and the politics of socialism. But how to plan, and how much, remain questions high on the socialist agenda. There is another, rather different reason why the transcendence of capitalism by way of the creation of a predominant public sector is necessary, namely that it is the only way in which may be initiated one of the crucial purposes of socialism: the abolition of wage labor. Wage labor is here taken to mean work performed for a wage in the service of a private employer who is entitled, by virtue of his or her ownership or control of the means of work, to dispose of the surplus produced by workers as he or she thinks fit, and without any reference to the people who have produced that surplus. In other words, the abolition of wage labor means the end of a system in which people are employed for the sole purpose of enriching their employers. Wage labor thus understood is of course the essence of capitalism. It will at once be said, quite rightly, that the exploitation which is inherent in wage labor is also possible, and may well be much worse, at the hands of controllers of state enterprise; and that public ownership does not therefore entail the end of wage labor. This, however, misses a crucial difference between private and public ownership. Public ownership does not automatically mean the end of wage labor; but exploitation under its auspices may be taken as a deformation of it, and capable of being avoided by means of democratic control. Exploitation, on the other hand, is the very purpose of capitalist enterprise: it may, under its auspices and by way of external intervention, be attenuated, but it cannot be eliminated. Public or social ownership under democratic control offers the possibility and promise of realizing the abolition of wage labor; such a possibility and promise is rigorously excluded by the very nature of capitalism. The point may be illustrated by reference to slave labor. The conditions under which slave labor occurred in history varied greatly, with the more humane treatment of slaves here, and their less humane treatment there. But slavery itself endured, was until not all that long ago generally taken to be quite “natural,” and required not attenuation but abolition. Wage labor is not slave labor. But while it too may be attenuated, and is taken to be quite “natural,” it needs to be abolished. This cannot be achieved very rapidly; but that is no reason for not beginning the process as soon as possible, and thus set in train a new and very different type of “relation of production.” In due course, and with the generalized practice of these new relations, the notion of one person working for the personal enrichment of another will be seen to be as odious and “unnatural” as the notion of one person owning another.\nPerhaps the greatest of all successes which conservative ideologists and politicians have scored in the struggle for hegemony has been in the appropriation of democracy as their particular cause and concern. This is all the more remarkable in that conservatism has historically fought tooth and nail against democratic advances; and when forced to retreat, has always striven to narrow as far as possible the meaning and scope of the concessions it has had to make. But hegemonic success in this respect is perhaps not so remarkable after all, given the nature of Communist regimes, and the opportunity which their repressive and undemocratic character offered to conservative ideologists to proclaim that, in opposing Communism, they were defending democracy against its enemies on the Left, whether those enemies called themselves Communists, socialists, or whatever. It is clearly one of the main tasks of counter-hegemonic endeavors to expose the shallowness of these democratic proclamations, to point to the narrowness of the meaning which conservative and liberal, and much social democratic discourse, attaches to democracy, and to point also to the crippling limitations which affect democratic forms and processes in class-dominated societies. So too is it necessary to stress that bourgeois democracy is never safe at the hands of the bourgeoisie, not only in periods of great social tension, when the authoritarian elements which form part of bourgeois democracy come to the fore, but also in “normal” times, when hegemony-as-coercion permanently cohabits with hegemony-as-consent. Again, part of the socialist critique of bourgeois democracy has to be the latter’s confinement of democracy to strictly “political” forms, whereas democracy, in socialist terms, is conceived as a pervasive force in all areas of life. Bourgeois democracy is never safe at the hands of the bourgeoisie. To argue all this, and more, in detail, is very necessary. But it leaves open a very large question, which socialists have found it difficult to tackle. This is whether socialist democracy is essentially a radical extension of capitalist democracy, or whether it amounts to an entirely different system, which may be defined in terms of semi-direct democracy. The social-democratic left has traditionally endorsed capitalist democracy, and only sought marginal improvements in its workings. This is quite logical: adaptation to capitalism is here paralleled by adaptation to capitalist democracy. For their part, Communist parties have gone through an evolution with two distinct phases. From their creation in the years immediately following World War I to the turn to the Popular Front in the mid-thirties, they coupled their wholesale denunciation of bourgeois democracy as a complete sham with a commitment to replace it by a local version of the Soviet model, which was defended as immeasurably more democratic than bourgeois democracy. In a second phase, they abandoned this posture and for all practical purposes accepted the framework of bourgeois democracy, with various proposals for its further democratization, and this is their position today. This “reformist” position was adamantly rejected by other sections of the Marxist left, which clung with unflagging dedication to the vision of a democratic order in which popular power would be barely mediated by representatives who would be delegates constantly accountable to and revocable by those who had chosen them. This was of course the vision evoked by Marx in his glowing defense of the Paris Commune in The Civil War in France in 1871; and it was also advanced in much greater detail by Lenin in The State and Revolution in 1917. This was indeed — or rather would have been if it had ever been realized — an entirely new form of regime, in which the power hitherto appropriated by the state would be re-appropriated by those in whom it should by right be vested, namely the people, who would not merely rule, but also govern, with the state in a process of rapid decomposition. Attractive though this vision is, it does represent a jump into a far-distant future, and cannot be taken as a realistic view of the kind of regime that would be needed in the construction of a socialist society. Such a regime would undoubtedly welcome and foster a great extension of popular participation and power; and it would seek the radical democratization of the state apparatus. But it would also need a state that was not, in any real meaning of the term, “withering away.” The state would be representative, accountable, controlled, and circumscribed; but it would nevertheless need a great deal of power to take care of all the functions which the state, at local, regional, and national level, is alone able to fulfill. Not the least of these would be the settlement of conflicts that are certain to arise even in a democratic society freed from the shackles of capital. Also, it is to the state that would ultimately fall the duty to protect the rights of minorities and to ensure that popular power is not exercised arbitrarily. Popular power and state power, in this perspective, would complement each other, and would also, under agreed procedures, check each other. Socialists are not alone in the defense of what are misleadingly called bourgeois rights; but socialists should be their most resolute and principled partisans, and the most fervent advocates of their extension. Far from helping Marxists in counter-hegemonic struggles for democracy, the vision of an entirely new social order based on semi-direct democracy has tended to make them oblivious to the need to explore seriously the ways in which socialists ought to tackle the vast problems which the notion of a genuinely democratic system is bound to pose. Such an exploration, conducted soberly and without demagogic rhetoric, is an essential part of counter-hegemonic endeavors. Meanwhile, there are democratic and civic rights to be defended against the conservative forces which constantly seek to curb them. Socialists are not alone in this struggle in the defense of what are misleadingly called bourgeois rights; but socialists should be their most resolute and principled partisans, and the most fervent advocates of their extension.\nThe discussion so far has concentrated on socialist concerns within capitalist societies. But socialism has always had a strong international, and internationalist, dimension. What does this mean nowadays? What, if anything, is there which distinguishes socialist internationalism from other versions of internationalism, and which may be said to constitute a specific socialist contribution to counter-hegemonic struggles? In recent years, Mikhail Gorbachev has sought with great eloquence to define the kind of internationalism which the world requires today, and has done so in terms of universal values and aspirations, beyond boundaries of nations, classes, and creeds — values and aspirations relating to peace, disarmament, the protection of the environment, and so on. These are indeed universal values, and socialists obviously subscribe to them. But such subscription cannot alone be taken to define socialist internationalism (nor for that matter does Gorbachev suggest that they can). For socialist internationalism has to proceed from the regrettable but crucial fact that, however much the decision-makers in capitalist countries may subscribe to universal values, they are moved by very different considerations in regard to international affairs. Uppermost among these considerations, ever since the Bolshevik Revolution and particularly since the end of World War II, has been the determination of major capitalist governments, to contain, curb, or crush movements of radical reform and revolution throughout the world, and to contain, curb, crush, or bring into line governments intent on pursuing policies of which these capitalist governments disapproved. Another way of making the same point is to say that, particularly since 1945, there has existed a state of global war, or an international civil war, between the major capitalist powers, led by the United States, on the one hand, and the movements and governments to which I have referred on the other. This conflict has assumed many different forms — economic, political, cultural, military. But it has defined much of the reality of international relations, not to speak of what it has meant for the countries concerned, for the best (or rather the worst) part of this century. The Cold War made it appear that the conflict was above all a matter of confrontation between the United States and the Soviet Union, and their respective allies; and a massive hegemonic assault on the consciousness of the peoples of the “Free World” turned into a not-to-be-questioned part of conventional wisdom the notion that the confrontation was based upon the aggressive and expansionist designs of the Soviet Union. In fact, that was never the issue at all. The real war, sometimes cold and often murderously hot, was always that between conservative forces, local and external, and the forces, notably but not exclusively in the “third world,” which sought a transformation of the status quo unacceptable to those conservative forces. In this perspective, the collapse of Communist regimes in Eastern Europe (and its likely collapse elsewhere) clearly constitutes a great strengthening of the hope nurtured by conservative forces that the world might be shaped (or reshaped) in an image acceptable to them. There is now a very good chance that some Communist countries at least will move towards the restoration of capitalism: some of them are already well advanced on that road. So too is it quite likely that countries in the “third world” which had previously proclaimed a commitment to socialism and “Marxism-Leninism” will follow the same path. No wonder that the defenders of capitalism should be celebrating a glorious victory, and proclaiming the end of socialism, which is also what is meant by the “end of history.” Such celebration and proclamation is, however, rather premature. Soviet-type Communism, with the centrally planned command economy and the monopolistic one-party political system, is out or on the way out, and will not be resurrected. But the notion that this is the end of socialist striving and eventual socialist advances leaves a vital fact out of account. This is that, despite the current apotheosis of capitalism, it has resolved none of the problems which give sustenance to socialist aspirations and struggles. Given the inherent and ineradicable failings of capitalism, there is no reason to doubt that the striving for radical alternatives will continue. Such striving is subject to phases of advance and phases of retreat; and the seventies and eighties have undoubtedly been a phase of retreat. But to believe that this is irreversible is naively unrealistic. No one can tell when advance will be resumed, or what forms it will take; but resume it will. It is in the light of the permanent struggle on a global scale of conservative forces against forces of radical reform and revolution that socialist internationalism has to be understood. This does not exclude concern with large (or small) “humanist” issues and causes. Nor of course does it preclude close collaboration with groups and movements primarily interested in such issues and causes. But socialists nevertheless have their own perspectives to advance in the realm of international relations and conflicts. Their most obvious task is eliciting support for movements and regimes which are subject to hostility and destabilisation by conservative forces at home and abroad. Another is the advancement of socialist explanations of the roots of the interventionism in which the United States and its allies have been and are engaged across the world; for in no area is hegemonic obfuscation, disinformation, and plain lying more common than in this realm. This, it should be added, is by no means to say that socialist internationalism automatically resolves all the problems which frequently arise in relation to the support which it demands. There are movements which loudly proclaim their liberating and anti-imperialist commitments, but whose credentials, from a socialist point of view, may be exceedingly dubious. Similarly, governments issued from struggles against tyranny and imperialism may turn out to be themselves vicious tyrannies, notwithstanding their anti-imperialist rhetoric. The Iranian regime is an obvious example. What this means is that support based on socialist internationalism, even in the worthiest of cases, can never be wholly unconditional. Stalin once described an internationalist as “one who is ready to defend the USSR without reservation, without wavering, unconditionally”; and this was long endorsed and followed by Communists everywhere. Socialist internationalism does not involve such a surrender of critical faculties in favor of any movement or regime. Support based on socialist internationalism, even in the worthiest of cases, can never be wholly unconditional. There are obviously many other issues than those arising from the requirement of international solidarity which socialist internationalism does not automatically resolve, and which are susceptible to diverse and divergent positions. One of these issues has to do with institutional arrangements beyond the nation state. Socialists can have no concern with the preservation of national “sovereignty” as such. At the same time, they cannot be indifferent to arrangements which, as in the case of the European Economic Community and the pressure for a federal structure for its members, are likely to confirm and solidify capitalist hegemony in the countries concerned. From a socialist point of view, it may well be that the most acceptable position is neither an insistence on national “sovereignty,” nor an acceptance of federalism under capitalist auspices, but regional confederal structures in which a degree of institutionalized cooperation between the member countries would be allied to a high degree of autonomy in the determination of major issues of policy. Perhaps more immediately to the point, socialist internationalism requires the fostering of the closest possible ties between socialist movements (and trade union movements) across frontiers for the purpose of mutual reinforcement and the forging of common policies. The need for such cooperation has long been obvious, but in terms of real effectiveness has remained a largely unrealized aspiration. Given the ever-greater internationalization of capital, it is now more urgent than ever; and the chances of it being advanced are now better than they have been since 1917, given the lessening of the divisions which have plagued left movements thereafter.", "url": "https://www.jacobinmag.com/2018/06/ralph-miliband-socialism-legitimation-hegemony"}