{"authors": ["Jason Turner Sports Writer"], "date_download": "2020-05-04 20:06:12", "date_modify": "2020-05-04 20:06:12", "date_publish": "2018-03-24 03:55:00", "description": "The offense and defense shined at times in Utah State’s first scrimmage of spring football camp, but there’s no question which unit reigned supreme in the second scrimmage. The defense...", "filename": "_579fa9e1da8849a59c881a165cebb127_1588622772.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_579fa9e1da8849a59c881a165cebb127_1588622772.html", "title": "Defense dominates second scrimmage", "title_page": "Defense dominates second scrimmage", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The offense and defense shined at times in Utah State’s first scrimmage of spring football camp, but there’s no question which unit reigned supreme in the second scrimmage.\nThe defense unquestionably ruled the afternoon on a sunny Friday at Maverik Stadium. An approximately hour-long practice was held prior to the scrimmage.\nIn 64 total snaps, the Aggie defense forced a trio of turnovers, broke up five passes and recorded eight tackles for loss. USU’s offense only managed two field goals in its first 12 possessions, and both drives essentially started at midfield.\n“Today was won by the defense, clearly,” USU head coach Matt Wells said. “... Great job by the defense, really the whole day. I thought they tackled well in space, they did a great job backed up in the red zone and (they forced) a couple of turnovers.”\nThe Aggie offense finally found paydirt on its final possession. On the first play of the last situational drive, starting quarterback Jordan Love found a wide open DJ Nelson for a 25-yard scoring strike.\nFor the most part, though, the Aggies struggled to establish their aerial attack. Four signal callers combined to complete 11 of 24 attempts for 85 yards.\nRedshirt freshmen Jamaal Evans and Zahodri Jackson each intercepted a pass. Jackson, a cornerback, had a golden opportunity to pick one off earlier in the scrimmage, but made up for it by nicely high-pointing a pass intended for wide receiver Dylan Spradling.\nOn the play before his INT, Evans, who was a high school quarterback, deftly batted away a pass by Andrew Peasley. Evans also recovered a fumble, which was forced by fellow linebacker Jordan Hayes.\n“Jamaal Evans is a talented young man,” Wells said. “We’ll wait and see how he continues through the summer, but he’s on the right track and we’ve need him now to inside (line)backer, and he does some really natural stuff (from that position).”\nUSU’s red zone defense was superb Friday. The offense went three-and-out on back-to-back possessions that started at midfield, plus the defense buckled down and limited the offense to field goals of 22 yards by Michael Smith and 31 yards by Dominik Eberle.\n“It was very encouraging because red zone defense is one of the most important things,” USU linebacker David Woodward said. “If we can be a dominant red zone defense, then we’ll have a good season.”\nWoodward finished with 2.0 tackles for loss, as did fellow linebacker Mason Tobeck. Tobeck, linebacker Suli Tamaivena and safety Chase Nelson tallied four tackles apiece.\nAs well as the defense played, the offense did have some success running the football. Tailbacks Gerold Bright, Tre Miller and Moriah Walker Jr. all had some nice runs, as did Peasley. USU racked up 133 yards on 34 carries, but penalties plagued the Aggies offensively during the scrimmage.\nWalker Jr. was still nursing a long-term injury when the Aggies held their first scrimmage, but the powerful 220-pound redshirt freshman looked good Friday. Eltoro Allen is still out with an injury, but this is the most healthy USU’s tailbacks have been collectively so far during spring camp.\n“I want to start off by saying I love competition,” said Bright, who has competed with the first-team offense during both scrimmages. “Competition helps me get better and, quite frankly, if their wasn’t any competition, everybody wouldn’t be getting better, so I like the fact that we’ve got different backs with different styles coming in to contribute.”\nJordan Nathan finished with a team-high three receptions and gained 16 yards on a well-executed reverse inside the red zone.\nDespite the offense’s struggles Friday, Wells has been encouraged by how both units have competed the past few weeks.\n“I think this is going to be a good team and I’ll reserve the right to (make) judgment on whether it can be a great team,” Wells said. “... The next two weeks of spring practice and three or four months through the summer is going to dictate a lot. The decisions we make to continue to invest and buy in and the decisions we make off the field, all those kind of things I think will go a long way. I think this team is pretty talented. I think it’s a team that’s playing better right now, it looks better at this point than the last two teams, the last couple of years, I think.”\nThe Aggies will hold a pair of practices next week — Tuesday and Thursday — and two the following week on the same days before concluding camp with the Blue vs. White Spring Game on Saturday, April 7.", "url": "https://apnews.com/579fa9e1da8849a59c881a165cebb127"}