{"authors": ["Steve Mocarsky"], "date_download": "2020-05-04 20:05:48", "date_modify": "2020-05-04 20:05:48", "date_publish": "2018-01-11 00:00:00", "description": "WILKES-BARRE — Asialena Bonitz was shocked when she dropped a quarter in a parking meter on South Main Street Wednesday afternoon and saw it only bought her eight minutes. “It’s kind of...", "filename": "_74db6d28444b4f5992b27a197ccac7dc_1588622748.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_74db6d28444b4f5992b27a197ccac7dc_1588622748.html", "title": "‘Too Early To Tell’ Impact Of Meter Fee Hike In W-B", "title_page": "‘Too Early To Tell’ Impact Of Meter Fee Hike In W-B", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WILKES-BARRE — Asialena Bonitz was shocked when she dropped a quarter in a parking meter on South Main Street Wednesday afternoon and saw it only bought her eight minutes.\n“It’s kind of ridiculous,” the 22-year-old Penn State Wilkes-Barre students said, unaware that the city had doubled its parking meter rate to $2 per hour this week until she fed the meter.\nBonitz and her boyfriend, Bloomsburg University student Brian Sweetra, said they drove to downtown Wilkes-Barre just to eat at Thai Thai Restaurant, and they were surprised at the cost to park on the street.\n“I’m from Scranton, and we get 12 minutes for a quarter there,” Bonitz said.\n“We get a half hour for a quarter” in Bloomsburg, said Sweetra, 23.\nAsked if the higher meter rate would deter them from coming back to eat at Thai Thai, the couple agreed that it probably would not.\n“If I have to put $2 in to eat here, it’s not that bad.” Bonitz said. “But if I have to put three quarters in to get a cup of coffee at Dunkin’ (Donuts), I’ll just go somewhere else.”\nWhen it was pointed out that there was a city parking garage directly across the street from Thai Thai, the couple said they would probably use it on their next visit to the restaurant.\nCouncilwoman Beth Gilbert and several city residents had criticized the meter rate increase at council meetings after Mayor Tony George had proposed the initiative, saying they thought the higher meter rate would deter people from shopping, eating and conducting business downtown.\nIt’s one of the reasons Gilbert had said she voted against George’s 2018 budget, which passed council by a 4-1 vote.\n‘Too early to tell’\nPublic Square merchants interviewed Wednesday said they hadn’t noticed any effect on their business from the meter rate increase.\nGranit Mahmutaj, manager at Cafe Toscana, said some customers complained to him about the higher meter rate, and one man said he planned to complain to the mayor.\n“Our customers park around the square, so it may affect us, too,” Mahmutaj said. “But it’s too early to tell if it’s affecting our business. I don’t know if it’s slow because of the holidays being over and the weather. There are many factors.”\nMark Bronsburg, owner of Mimmo’s Pizza and Restaurant, looked out his windows onto Public Square and noted, “There’s a whole lot less cars out there than normally, but most of my customers don’t use the parking meters,” as much of his business is from college students and people who work downtown.\n“If they do (use a meter, it’s usually carry-out customers, and) we usually get them out of here in a minute, so it really doesn’t affect me,” Bronsburg said.\nBronsburg said he understands why city officials raised the parking meter rate.\n“They don’t want people parking for hours at a time. I can see their point of view,” he said.\nWhen George proposed doubling the meter rate during his 2018 budget address last October, he said it would not only increase revenue for the city — he budgeted parking meter revenue to rise from $525,000 in 2017 to $1 million this year — but also improve business for merchants.\nGeorge predicted higher meter rates would persuade downtown employees and people who parked downtown for several hours at a time to utilize the city’s parking garages and open-air lots, freeing up curbside spaces for short-term parking and enable more curbside parking turnover.\nThe rate at city parking lots and garages is $1.50 per hour.\nSuccessful so far\nThe strategy seems to be working, according to one downtown employee.\n“Now, cars that I’ve seen parked here all day aren’t parked on the square anymore,” said Brenda Sokolowski, who works at Circles on the Square.\nCircles employee Bill Scholl agreed, adding that as far as deli customers, he doesn’t think the higher meter rate “makes any difference to anybody. They’ll either put the money in or just park and cross their fingers,” hoping they don’t get a parking ticket.\nSokolowski also said she doesn’t think the new meter has had an impact on business. “Our business has been the same as before (the meter rate) went up,” she said.\nThe mayor could not be reached for comment Wednesday, but city Administrator Ted Wampole said he found the feedback from merchants and downtown patrons interesting.\n“It sounds to me like that (college) couple kind of gets the idea,” Wampole said.\n“And we’ve been seeing people commenting positively — cars they recognize not being parked there all day anymore,” Wampole added. “That was part of the idea — to get long-term parkers not to park in front of an establishment all day.”\nWampole said he witnessed himself what appeared to be a higher turnover in curbside parking this week, with more vehicles pulling in and out of spaces more frequently.\nManaging a resource\nLarry Newman, executive director of the Diamond City Partnership, an alliance formed to promote downtown revitalization, said he’s heard no feedback this week from anyone who uses parking meters, which isn’t necessarily a bad thing.\n“The whole point of a public parking network is not to make money for a city, it’s to manage the use of a resource that is needed for the benefit of the downtown economy. And one of the things that is positive about the increase is that it prices parking at the curb at a higher rate than off-street.\n“Ideally, you want to manage the parking system through pricing. You want to use pricing to drive the behavior, maintain turnaround. Meters are the most valuable spaces — they are most convenient to the stores. The idea is, you should pay more for the convenience,” he said.\nNewman also noted that many downtown businesses provide free parking in garages and lots through parking validation.\nNewman said the parking meter rate increase is “really one small step in a larger discussion that needs to occur regarding the downtown parking system. … What the business community would not want to see is to let the discussion stop simply with doubling the price of parking at meters.”\n“Last time we did a comprehensive downtown parking study was in 2003-2004.” Newman said. “It was certainly before the expansion of so many parts of the downtown economy. It was before the downtown came back. So it’s time to do it again.”\nContact the writer:\nsmocarsky@citizensvoice.com\n570-821-2110\n@SteveMocarskyCV\nA PARKING SNAPSHOT\nHere’s what curbside metered parking looked like around Public Square around 2:30 p.m. Wednesday.\nn Between West Market and South Main streets: Two of 17 regular metered spaces were unoccupied; one of two compact car spaces was unoccupied; one motorcycle space was unoccupied; two of three handicap spaces were unoccupied.\nn Between South Main and East Market streets: Three of nine regular metered spaces were unoccupied; two of four spaces in front of Rodano’s and Franklin’s with signs designating free 10-minute parking were unoccupied.\nn Between East Market and North Main streets: 11 of 14 regular metered spaces were unoccupied; one space reserved for a taxi was unoccupied. n Between North Main and West Market streets: Seven of 13 regular metered parking spaces were unoccupied.\nn In the first block of South Main Street, 22 of 39 regular metered spaces were unoccupied; one space designated for free 10-minute parking was occupied.", "url": "https://apnews.com/74db6d28444b4f5992b27a197ccac7dc"}