{"authors": ["Don Maines"], "date_download": "2020-05-04 20:12:37", "date_modify": "2020-05-04 20:12:37", "date_publish": "2018-04-16 05:00:00", "description": "Betty O’Bannon won the hearts of both the judges and her fellow contestants, as she was named Miss Congeniality and crowned the winner of the 2018 Ms. Pasadena Senior Pageant on April 5 at the...", "filename": "_34b1aadb83924b64b525c90812117982_1588623157.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_34b1aadb83924b64b525c90812117982_1588623157.html", "title": "Ms. Senior Pasadena wins laughs, crown", "title_page": "Ms. Senior Pasadena wins laughs, crown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Betty O’Bannon won the hearts of both the judges and her fellow contestants, as she was named Miss Congeniality and crowned the winner of the 2018 Ms. Pasadena Senior Pageant on April 5 at the Pasadena Convention Center.\n“God gave me a talent to make people laugh,” said the 85-year-old widow, who tickled the audience with a comedy routine as “Miss Minnie” in the talent competition of the 18th annual event.\n“My late husband and I performed at many oprys doing our own comedy act,” O’Bannon said. “We also performed at churches, AARP, birthday parties, retirement parties and many more.”\nIn addition to a crown, O’Bannon won a $500 cash prize, a diamond necklace and a deluxe gift basket.\nTwelve women, ages 63 to 85, competed in the pageant, which attracted 800 fans, said director Lou Ann Nolan. Each contestant was scored in four categories, with each round of competition counting 25 percent. The categories were interview, philosophy of life, talent and poise, with each contestant modeling an evening gown onstage.\n“My philosophy of life is to be happy and to share your joy with others,” said O’Bannon. “Laugh and be happy.”\nThe first runner-up was Alice Moore, 83, a water aerobics instructor.\nMelinda Leza, a graduate student at age 63, was named as second runner-up.\nSylvia Ramirez, 80, a singer and guitarist, was the third runner-up.\nRounding out the field of contestants were Julie Rabalais, age 72; Laura Tant, 79; Katie Coones, 71; Teresa B. Burkholder, 70; Rosa Herrera, 78; Esperanza Rodriguez, 66; Sharon Billingsley, 65; and Joyce H. Sullivan, 68.\n“The pageant’s theme, ‘The Age of Elegance,’ reminded us that each stage in life provides new opportunities and to live each season to the fullest,” said Nolan, who also directs the Madison Jobe Senior Center.\nPasadena’s new director of Parks and Recreation, Jed Aplaca, called the pageant “a statement to honor women of achievement, women of courage, women who dare to dream and grow. We are proud to encourage them here in Pasadena because we are about family and community and making lives better.”\nLast year’s winner, Juanita Washington, said, “I am changed and forever grateful. Words cannot explain the different experiences and moments that have touched my heart this year.”\nWashington joined five previous titleholders - Jeannie Robinson (2016), Martha May (2013-2014), Bobbie Byrant (2011), Ann Cunningham (2009) and Edwina Prisk (2003) - in a show-stopping performance of the song “These Boots Are Made for Walking.”\nThe show’s live band was comprised of Bay Area musicians Randy Meadows (singer, lead guitar and rhythm guitar), Randy Cornor (singer and lead guitar), Freddy Pate (singer, lead guitar and rhythm guitar), Kevin Hardin (fiddle), Jody Cameron (steel guitar), Vince Hiller (bass), Randy Wall (keyboard), Walter Cross (drums) and Missy Brown (singer).\nThe event was co-hosted by Stephanie Gerry, a reporter on KPRC-TV’s “Houston Life,” and Paul Driscoll, a magician and comedian.\nThe pageant was free and open to the public, compliments of its major sponsor, Cigna HealthSpring, said Nolan.", "url": "https://apnews.com/34b1aadb83924b64b525c90812117982"}