{"authors": ["Dave Lubach For The State Journal"], "date_download": "2020-05-04 20:25:34", "date_modify": "2020-05-04 20:25:34", "date_publish": "2018-03-30 01:00:00", "description": "A family trip to Costco usually means a ride home with a trunk full of food in bulk, and mom and dad sporting a much lighter wallet. For a young, developing sprinter from Waunakee, one such...", "filename": "_30976c4d6dc14e03a3d0cad6ecbd47ac_1588623934.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_30976c4d6dc14e03a3d0cad6ecbd47ac_1588623934.html", "title": "Waunakee's speedy sprinter, L.O. Johnson, comes from first-class stock", "title_page": "Waunakee's speedy sprinter, L.O. Johnson, comes from first-class stock", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A family trip to Costco usually means a ride home with a trunk full of food in bulk, and mom and dad sporting a much lighter wallet.\nFor a young, developing sprinter from Waunakee, one such visit provided the foundation for a future state track and field champion.\nAs a sprinter who was struggling to find his way, L.O. Johnson was walking back to his car with his father when, all of a sudden, he started running the way he always intended to.\n“Whenever I got to the track, I would always lose my form,” Johnson said. “I was a little bit out of control. Then one day in the parking lot, coming from Costco, I was like, ‘This is how you want me to run.’\n“I know you’re not supposed to run in the parking lot, but he said, ‘That’s exactly how I want you to run.’ ”\nJohnson has been running past opponents ever since that eighth-grade “aha” moment. And as the returning WIAA Division 1 state 100-meter dash champion, the senior has his sights set on a grander plan.\n“I know Michael Bennett has the state record, but I’d be excited if I could see my name as the state record-holder instead of Michael in the 100,” Johnson said. “That would be my biggest goal, to break that record.”\nDespite qualifying only seventh for the finals at last year’s state meet in La Crosse, Johnson stunned the crowd to win the 100 in 10.99 seconds, beating top qualifier Dwayne Ford of Racine Park, who finished in 11.07.\nAfter a rough qualifying race, Johnson was fortunate just to make the final. But once he reached the final, he was not going to be denied his shot at history.\n“It gave him confidence and the realization that he could do it,” Waunakee coach Jennifer Grabarski said. “I knew that was his goal and he really wanted it.\n“He really struggled after the trials on Friday night. He didn’t have a great start and just made it into the finals. He kind of panicked and wanted to go work on his start. We said no, his start was there. Mentally, you just need to bring yourself back.”\nThe rise to the top of the podium was a few years in the making for Johnson, who is the son of two former University of Wisconsin sprinters, Vernetta and Lawrence Johnson. Lawrence also played for the Badgers football team from 1975 to 1979 and in the NFL for eight seasons, retiring in 1987.\nIn 2015, Johnson became a rare freshman qualifier for the Division 1 100 finals, finishing fourth in :11.14. He followed that up with another fourth-place finish as a sophomore, lowering his time to :11.11.\nThis year, his target time is :10.33, the standard that Bennett, of Milwaukee Tech and a former UW and NFL running back, ran in the preliminaries in 1998 when he also set the 200 mark of :20.68 in the prelims, a record that also still stands.\nGrabarski thinks Johnson has a legitimate shot at the state record. “It would be very cool for him to get it,” she said.\nJohnson also will compete in the 200 meters and the 400 relay this season. He made it to state in both events last year, finishing out of medal contention in the 200 but running the anchor leg of the fifth-place 400 relay.\n“The 200 (championship), I believe, is in his grasp,” Grabarski said. “That race always plays with his head. There’s a wall, it seems. He has a love-hate relationship with it. There’s an obstacle that if he can power out of it he can do really well in it.”\nAs the son of two sprinters, the sport was injected into Johnson at a very young age. He participated in track meets as early as the fifth grade, and his parents have helped to coach him every step of the way.\nGrabarski realized that Johnson was a special athlete from the minute he first burst ouf of the starting blocks at Waunakee.\n“This is my 18th year at Waunakee, and certainly he is the most high-level sprinter I’ve ever had come through,” she said. “He’s a competitor, and I never foresee him losing that. He’s ready for big things.\n“Right now (at the start of the season), we’re trying to break down his 100. Most kids, we’re just trying to give them the best start we can and then blast them off the line. For him, we can break down so many phases of his 100. He’s got so much more potential to get out of him.”\nThe next stage of Johnson’s journey will take him to the University of New Mexico, where he received a scholarship to play running back for the Lobos.\nThe Warriors won the WIAA Division 2 state championship last fall, and the 5-foot-11, 205-pound Johnson rushed for almost 600 yards and 10 touchdowns on 93 carries. He also caught 15 passes for 205 yards and two more scores. Johnson accomplished all of that despite missing three games due to a high ankle sprain.\nJohnson also plans to run track and field for the Lobos, an option he looked for when searching for a school.\n“It was almost a no-brainer,” Johnson said of attending New Mexico, which will play the Badgers on Sept. 8 at Camp Randall Stadium next season. “They’re a school that runs the ball, and in track and field they had two Olympians there (in the 2016 Olympics). It was the perfect mix of track and football.”\nAs a nationally-ranked sprinter, Johnson was invited to the 2017 National Indoor Championships and ranked among the Midwest’s top 10 times for sprinters his age in the 100. He also harbors dreams of giving the Olympics a shot.\n“Around the Olympics is the time when I think it would be really cool to be an Olympian,” he said. “My dad was in the Olympic Trials and has a certificate for doing that. I dream about doing that.”", "url": "https://apnews.com/30976c4d6dc14e03a3d0cad6ecbd47ac"}