{"authors": ["Andrew Blake The Washington Times"], "date_download": "2020-05-04 20:06:33", "date_modify": "2020-05-04 20:06:33", "date_publish": "2018-06-05 13:33:30", "description": "Ecuador's foreign minister on Monday defended suspending Julian Assange's internet access more than two months since stripping the WikiLeaks publisher and longtime guest of the Ecuadorean Embassy...", "filename": "_bd31ca74152942c50cb9c5ca3b59a482_1588622793.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bd31ca74152942c50cb9c5ca3b59a482_1588622793.html", "title": "Ecuadorean official defends booting Julian Assange offline, says 'not a matter of censorship'", "title_page": "Ecuadorean official defends booting Julian Assange offline, says 'not a matter of censorship'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ecuador’s foreign minister on Monday defended suspending Julian Assange’s internet access more than two months since stripping the WikiLeaks publisher and longtime guest of the Ecuadorean Embassy of his online privileges.\nMaria Espinosa discussed the situation surrounding Mr. Assange in an interview conducted ahead of Tuesday’s session of the United Nations General Assembly in New York City, The Associated Press reported.\n“On several occasions he has agreed on not intervening in internal politics of third-party countries and unfortunately he has not complied with his commitment, so for the time being he is not allowed to have access to the internet,” Ms. Espinosa told the AP.\n“It is not a matter of censorship,” she added.\nMr. Assange, 46, entered theEcuadorean Embassy in London nearly six years ago seeking protection from U.S and Swedish prosecutors, and Ecuador subsequently granted him asylum and citizenship in 2012 and 2017.\nMore recently, Ecuador cut Mr. Assange’s internet access in late March after his social media posts allegedly violated “a written commitment made to the government at the end of 2017 not to issue messages that might interfere with other states,” President Lenin Moreno’s office said at the time.\nEcuador asked Mr. Assange to comply with “his obligations” when it comes to “respecting international law,” Ms. Espinosa said Monday, AP reported.\n“We have asked him to do so and he has said he would,” she said. “Unfortunately, he did not on several occasions.”\nEcuador has not set a date yet for restoring Mr. Assange’s internet access, Ms. Espinosa said Monday.\nWikiLeaks did not immediately respond to a message seeking comment. The group previously said that Mr. Assange had his internet access severed because he refused a plea from Ecuador to delete a tweet decrying the arrest of Catalonian separatist leader Carles Puigdemont by Spanish police.\n“Claims made by Ecuador’s public affairs office that @wikileaks editor @julianassange is under an obligation to not report or comment on human rights violations or political arrests, or that such reportage is interferring in the internal affairs of a state, are false,” WikiLeaks tweeted previously.\nEcuador previously suspended Mr. Assange’s internet access inside the embassy after WikiLeaks published documents damaging to Democratic nominee Hillary Clinton during the 2016 U.S. presidential race.\nPresident Trump praised WikiLeaks on the campaign trail for releasing documents damaging to his opponent, but his attorney general, Jeff Sessions, subsequently said that arresting Mr. Assange is a “priority” for law enforcement.\nMr. Assange’s status at the embassy is not in danger as long as he refrains from intervening in the politics of other countries,” Mr. Moreno told Deutsche Welle last week.", "url": "https://apnews.com/bd31ca74152942c50cb9c5ca3b59a482"}