{"authors": ["Troy Thomas"], "date_download": "2020-05-04 20:06:11", "date_modify": "2020-05-04 20:06:11", "date_publish": "2018-02-04 10:26:48", "description": "\"Just Cut Taxes And Win.\" That's the moniker given to legislation being considered in the West Virginia Legislature to phase out the property tax on business inventory, machinery and...", "filename": "_d891f7291ccf4c96a2ce97e23fc50fe5_1588622771.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d891f7291ccf4c96a2ce97e23fc50fe5_1588622771.html", "title": "Phaseout of business tax will aid WV economy", "title_page": "Phaseout of business tax will aid WV economy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "“Just Cut Taxes And Win.” That’s the moniker given to legislation being considered in the West Virginia Legislature to phase out the property tax on business inventory, machinery and equipment.\nThe bill title and the legislation are simple and straightforward and we in the manufacturing community believe it will spur job creation and economic investment in West Virginia, if passed and placed in the hands of West Virginia voters.\nSogefi manufactures automotive parts in over 40 plants located across 23 countries around the world. At our Prichard, Wayne County, facility in West Virginia, our 360 employees work to supply filtration and engine air products to customers, including Ford, GM, Subaru, Toyota, Mercury Marine and others.\nAutomotive parts manufacturing is a capital intensive industry and requires advanced technology that changes and requires constant updating. In West Virginia, we are taxed on all the inventory we carry, the machinery we use to manufacture our products and the property on which we conduct our operations.\nOur competitors in other states, Mexico, Canada and overseas do not tax capital assets like West Virginia does. Our competitors also enjoy other advantages as it relates to currency exchange and labor costs. The elimination of the tax on business inventory, machinery and equipment will make us more competitive.\nIf the “Just Cut Taxes And Win” resolution is passed into law, we could increase capital investment in new technology and capacity and enhance benefits to our employees. That leads to more local jobs, support for local vendors and a more robust economy.\nManufacturing is a wealth-creating endeavor. Most of our revenue comes from outside West Virginia. The dollars we spend in payroll, to local vendors, and for taxes actually originate from someone outside our state. Simply put, we bring other people’s money into the state for the benefit of West Virginians. This legislation will make West Virginia more competitive for manufacturing investment.\nWe recognize the importance of property tax revenue to our counties. These dollars fund our schools and public services. The “Just Cut Taxes And Win” bill would make our counties whole, making sure they retain the money to fund these critical and beneficial initiatives. That’s a winning scenario all the way around, and we encourage others to support this bill.\nTroy Thomas is manager of the Sogefi USA, Inc. plant in Prichard, W.Va.", "url": "https://apnews.com/d891f7291ccf4c96a2ce97e23fc50fe5"}