{"authors": ["Loren Else News Postbulletin.Com"], "date_download": "2020-05-04 20:09:23", "date_modify": "2020-05-04 20:09:23", "date_publish": "2018-09-14 06:00:00", "description": "1993 – 25 years ago • Some 400 hardy Rochester souls braved the rain over the noon hour to celebrate Rochester’s No. 1 ranking by Money Magazine as the best place to live in the United...", "filename": "_b0ef96391cde4f7cb68ed2faf2e70da0_1588622963.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b0ef96391cde4f7cb68ed2faf2e70da0_1588622963.html", "title": "Day in History: Man of mystery escapes from Rochester State Hospital", "title_page": "Day in History: Man of mystery escapes from Rochester State Hospital", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "1993 – 25 years ago\n• Some 400 hardy Rochester souls braved the rain over the noon hour to celebrate Rochester’s No. 1 ranking by Money Magazine as the best place to live in the United States. Those that showed up formed a giant numerical one and waved for a photograph. (Weather was a minor consideration in the rankings).\n• Kara Nagorney and Justin Sipie were crowned as homecoming queen and king at Lourdes’ coronation ceremony.\n1968 – 50 years ago\n• Dr. Harry Hall, an orthopedic surgeon from Edina, was named to the University of Minnesota Board of Regents today by Gov. Harold LeVander. Hall fills a vacancy created by the recent death of Dr. Charles W. Mayo of Rochester.\n• Rochester State Hospital used furniture and equipment will be sold this week at the Fairgrounds dairy cattle barn with profits going to buy new hospital furnishings.\n1943 – 75 years ago\n• Miss Virginia Payne, of Chicago, known to millions of radio listeners as Ma Perkins, was in Rochester over the weekend to visit her father, Dr. John Lewis Payne of Cincinnati, Ohio, who is in Worrall hospital after undergoing an eye operation.\n• A representative of the U.S. Civil Service Commission will be in Rochester this week to conduct interviews and to offer immediate employment to many. Positions are open at the U.S. Naval Ammunition Depot at Hastings, Neb. Jobs include labor positions and machinists.\n1918 – 100 years ago\n• A man of mystery who is classified as a dangerous alien has escaped from the Rochester State Hospital. He was recently arrested in a slacker raid and has pretended to be an idiot. Many believe that he is not crazy. He is being sought by immigration and Department of Justice officials. The man is small but has a bulging forehead and thick dark hair. He might pass for a youth of nineteen.\nFrom news services\nTen years ago: Losing its devastating punch as a major hurricane, Ike nevertheless drubbed the Midwest with powerful winds and floodwaters. Carlos Zambrano pitched the first no-hitter for the Chicago Cubs in 36 years, striking out 10 in a 5-0 win over Houston in a game relocated to Milwaukee because of Hurricane Ike.\nFive years ago: A diplomatic breakthrough on securing and destroying Syria’s chemical weapons stockpile, negotiated by the U.S. and Russia, averted the threat of U.S. military action.\nOne year ago: CIA Director Mike Pompeo canceled a planned appearance at Harvard University over the school’s decision to name Chelsea Manning a visiting fellow. Former CIA deputy director Mike Morell resigned from his post at Harvard’s John F. Kennedy School of Government, saying he couldn’t be part of an organization that “honors a convicted felon and leaker of classified information.” More than 80 people were killed in an attack in southern Iraq targeting a restaurant frequented by Shiite Muslim pilgrims; the Islamic State group claimed responsibility.\nToday’s birthdays: Actress Zoe Caldwell is 85. Actor Walter Koenig is 82. Basketball Hall of Fame coach Larry Brown is 78. Singer-actress Joey Heatherton is 74. Actor Sam Neill is 71. Singer Jon “Bowzer” Bauman (Sha Na Na) is 71. Actor Robert Wisdom is 65. Rock musician Steve Berlin (Los Lobos) is 63. Country singer-songwriter Beth Nielsen Chapman is 62. Actress Mary Crosby is 59. Singer Morten Harket (a-ha) is 59. Country singer John Berry is 59. Actress Melissa Leo is 58. Actress Faith Ford is 54. Actor Jamie Kaler is 54. Actress Michelle Stafford is 53. Russian Prime Minister Dmitry Medvedev is 53. Rock musician Mike Cooley (Drive-By Truckers) is 52. Actor Dan Cortese is 51. Contemporary Christian singer Mark Hall is 49. Actor-writer-director-producer Tyler Perry is 49. Actor Ben Garant is 48. Rock musician Craig Montoya (Tri Polar) is 48. Actress Kimberly Williams-Paisley is 47. Actor Andrew Lincoln is 45. Rapper Nas is 45. Actor Austin Basis is 42. Country singer Danielle Peck is 40. Pop singer Ayo is 38. Actor Sebastian Sozzi is 36. Actor Adam Lamberg is 34. Singer Alex Clare is 33. Actor Chad Duell (TV: “General Hospital”) is 31. Actress Jessica Brown Findlay is 31. Actor-singer Logan Henderson is 29. Actress Emma Kenney is 19.", "url": "https://apnews.com/b0ef96391cde4f7cb68ed2faf2e70da0"}