{"authors": ["Bill Mcmillen The Daily News"], "date_download": "2020-05-04 20:10:02", "date_modify": "2020-05-04 20:10:02", "date_publish": "2018-08-10 06:11:00", "description": "MOHAVE VALLEY — The Mohave Valley Irrigation & Drainage District board approved placing an order for 39,746 acre-feet of water during the 2019 calendar year, an increase of roughly 2,400 acre-feet...", "filename": "_6a8f29cd345348cc8caa2342495a2f48_1588623002.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6a8f29cd345348cc8caa2342495a2f48_1588623002.html", "title": "MVIDD’s water order less than maximum allotment", "title_page": "MVIDD’s water order less than maximum allotment", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MOHAVE VALLEY — The Mohave Valley Irrigation & Drainage District board approved placing an order for 39,746 acre-feet of water during the 2019 calendar year, an increase of roughly 2,400 acre-feet over this year’s order but still below the district’s allotment from the Bureau of Reclamation.\nAlthough the order, which was about 2,400 acre-feet under the district’s 42,250 acre-foot maximum, didn’t include any mention of water that potentially could go out of the district, Mohave County Manager Mike Hendrix wanted assurances from the board that it would stay that way.\n“Will you be voting for water (in the order) that will be used” by outside entities, Hendrix asked.\n“We cannot answer that. It’s not on the agenda,” responded board chairman Chip Sherrill.\nHendrix said that all five board members, land owners with assigned water rights in the district, stood to profit from any arrangement to sell water rights to outside entities; he said that it was “hard to imagine a more direct conflict” of interest.\nBecause no agenda item involved moving water to any entities outside the district — a possible sale of water rights involving the Central Arizona Project fell apart earlier this year — the board could not respond directly to Hendrix’s query. Hendrix noted that Mark Clark, manager of the district, gave a summary of water use within the order and that summary accounted for every acre-foot to be used within the district.\n“There is no intent ... at this time to do that,” Clark said of outside sales.\nClark’s answer seemed to satisfy Hendrix and the board voted 5-0 to approve the order.\nAn acre-foot of water is about 325,850 gallons, enough water to supply two typical households for a year. Clark said 32,000 acre-feet — about 80 percent of the MVIDD order — is earmarked for agricultural use.\nThe district used 17,755 acre-feet through the end of June, about 3,000 more than through the first six months of 2018. Usage is very close to the 18,199 acre-feet ordered for the first six months and about 49 percent of the district’s allotment. July and August are typically months of high use before water usage tapers off over the last four months of the year, Clark said in his report.\nBOR statistics indicate that Lake Mead is at 38 percent capacity and Lake Powell at 50 percent; those two reservoirs store a bulk of the water that goes to states as part of a seven-state pact covering Colorado River water usage, Clark said.\nThe BOR’s 24-month study is scheduled to come out in the next week.\n“It is the critical one,” Clark said. “It tells us whether there’s going to be a water shortage declared on the river.”\nDuring the call to the public, Bullhead City resident Gabrielle Lake asked the board about the proposed efforts to sell water rights to outside entities.\n“To what benefit is it to us?” she asked.\nAgain, Sherrill said it wasn’t an agenda item and could not be addressed by the board. Lake then asked how to get such a question on an agenda for a future meeting.\nMohave County District 5 Sup. Lois Wakimoto asked if there was enough water available for growth in the district, suggesting that a developer was planning “100-something” homes.\n“I hope you have enough water left,”she said, noting that the water order was shy of the maximum allocation.\nSherrill assured her that the district had anticipated growth in their request.\nThe MVIDD order for 2019 included 1,200 acre-feet for “interim” use, a reserve that could go for growth in the valley or to make up for shortages in other areas, Clark said.", "url": "https://apnews.com/6a8f29cd345348cc8caa2342495a2f48"}