{"authors": ["Brock Netter", "Bnetter Daily-Journal.Com", "Twitter"], "date_download": "2020-05-04 20:25:06", "date_modify": "2020-05-04 20:25:06", "date_publish": "2018-05-09 20:11:00", "description": "Going into the season, BBCHS water polo coach Emily Caise wasn't sure what to expect from her team. A large group of seniors had just graduated, namely most players on the defensive side of...", "filename": "_1c1860794f84447a969690480630b460_1588623906.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1c1860794f84447a969690480630b460_1588623906.html", "title": "BBCHS water polo gearing up for postseason", "title_page": "BBCHS water polo gearing up for postseason", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Going into the season, BBCHS water polo coach Emily Caise wasn’t sure what to expect from her team.\nA large group of seniors had just graduated, namely most players on the defensive side of the ball, and ushered in a brand new wave of new talent.\nHowever, this year’s young Boiler team, featuring just eight seniors, endured growing pains and catapulted itself to a 15-11-2 record, which earned the Boilers a No. 5 seed in the Lincoln-Way East regional.\n“There were so many questions marks and after 28 games, I’m pretty happy with the results,” Caise said. “We have so many young players who have worked just as hard as our seniors to and to see the way this group has come together over the season has been fantastic.”\nAmong the eight seniors who were extremely critical to the Boilers’ success, the one who stood out the most to Caise was Lexi Fischer.\nAfter much success in the pool during the girl’s swimming season, Fischer continued that success as the team’s leader in steals (88) and assists (45) while being second in goals scored (43).\n“Lexi has been outstanding for us,” Caise said. “She really took on the challenge on being a leader and showing the younger kids how things are done. The other seniors have been the same way in showing the young kids and leading by example, but everything starts with Lexi.”\nHowever, it’s not just the senior do-it-all player that has done the heavy lifting. Junior Megan Schroeder has taken advantage of her opportunities and the lack of experience to lead the team in goals with 53 and counting. She also tied for third (Lizzy Elliott) in steals with 45.\n“Megan has really gotten it done for us,” Caise said. “She attacks the defense really well and seems to be in the right place at the right time when we need her to be. She’s taken on a big responsibility and handled it extremely well.”\nBut it was in goalie where Caise had to make the tough decision to roll the dice and insert freshman Sydney Kane back there.\nIt’s paid dividends for the Boilers as she’s come up with 212 saves this season alongside 27 assists.\n“I was a little nervous about putting a freshman in such an important spot as goalie,” Caise said. “But Sydney has been so great and picked the speed of the game up really quickly. Those young mistakes are still there from time to time, but the level of growth I’ve seen from her is unreal and she still has three years left. She has a bright future.”\nThe fifth-seeded Boilers travel to Lincoln-Way East today for its opening tournament matchup against Lincoln-Way West, who already own a 13-6 victory over the Boilers.\nHowever, that was the Boilers’ second game of the year. Now entering their 29th game, things should be a little different.\n“Obviously the goal is to win,” Caise said. “But more importantly, I want the girls to leave it all in the water. Lincoln saw us at the very beginning of the season when we were working a bunch of things out. They’re not going to be the same team, but the advantage for us is that we’ve seen what they have. They haven’t seen a fully loaded team because nearly no one has and that potential is what has me excited. I can’t wait, hopefully it’s not our last game.”", "url": "https://apnews.com/1c1860794f84447a969690480630b460"}