{"authors": ["Staff Writer"], "date_download": "2020-05-04 21:06:29", "date_modify": "2020-05-04 21:06:29", "date_publish": "2018-12-24 08:20:51", "description": "Courtesy of the Better Business Bureau Scams are everywhere and ever-changing, unfortunately. So, our best defense is being aware and knowing the warning signs. BBB asks... have you heard of...", "filename": "_06cd14176e5d48b0af466aaf8bb17abe_1588626389.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_06cd14176e5d48b0af466aaf8bb17abe_1588626389.html", "title": "Prepare for these five common scams", "title_page": "Prepare for these five common scams", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Courtesy of the Better Business Bureau\nScams are everywhere and ever-changing, unfortunately. So, our best defense is being aware and knowing the warning signs. BBB asks... have you heard of these five current scams popular with thieves but unpopular with their victims?\nHow these scams work\nTHE OVERPAYMENT SCAM: For this scam, someone pays you for some work or a product. They send you a check, but, whoops! It turns out they accidentally paid too much, and innocently ask you to send back the excess.\nNO! The scam is that the only real money is the so-called overpayment they are hoping you send back. Don’t cash that check, demand a new one for the agreed amount.\nPHISHING EMAILS: What is the latest phishing email floating around? Being asked to update your payment details for your Netflix account...whether you have Netflix or not!\nThe email has the logo of Netflix and appears to be an actual email from the company, however legitimate companies do not operate by asking their customers to click links or open attachments in emails. If there is a problem, you will be asked to sign in to your account on the company website.\nTHE GOVERNMENT GRANT SCAM: This scam appeals to the idea that the government’s just handing out money, all you have to do is pay a fee and send in some personal information. The scammers will steal both.\nThis red flag may seem obvious, but the BBB says it’s important to know that “free” money doesn’t come easy, and should be treated skeptically. Remember: if it sounds too good to be true, it probably is!\nTHE CAR TITLE SCAM: Here’s how this one works: you’re trying to sell a car and the prospective buyer wants a car history report from a particular website. It’s a site that will take your identity and your money. Be wary of any seller who asks you to use a particular website as a condition for a sale.\nCONTRACTOR/HOME REPAIR SCAMS: Contractor and home repair scams never go out of style. Hire the wrong contractor, and you could be stuck with huge debts, unfinished work or even a lawsuit.\nProtect yourself by taking multiple bids and demanding a contractor registered with the state. Always get everything in writing and talk to local people that have used the contractor recently if possible.\nFor more about scams, go to BBB Scam Tips (BBB.org/ScamTips). To report a scam, go to BBB Scam Tracker (BBB.org/Scam-Tracker).Visit bbb.org/canton or call 330-454-9401 to look up a business, file a complaint, write a customer review, read tips, follow us on social media.", "url": "https://apnews.com/06cd14176e5d48b0af466aaf8bb17abe"}