{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:25:08", "date_modify": "2020-05-04 20:25:08", "date_publish": "2018-10-05 22:56:00", "description": "CHI Memorial’s mobile health coach will provide mammography screenings at LaFayette-Walker County Library on Tuesday, Oct. 9, from 9 a.m. to 4 p.m., and at Primary Health Care of Rossville on...", "filename": "_b335b1b72a144852b3516ceeb9def95b_1588623908.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b335b1b72a144852b3516ceeb9def95b_1588623908.html", "title": "CHI Memorial mammography health coach to visit Walker County twice in October", "title_page": "CHI Memorial mammography health coach to visit Walker County twice in October", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHI Memorial’s mobile health coach will provide mammography screenings at LaFayette-Walker County Library on Tuesday, Oct. 9, from 9 a.m. to 4 p.m., and at Primary Health Care of Rossville on Tuesday, Oct. 16, from 9 a.m. to 4 p.m.\nAll women should have one screening mammogram between the ages of 35-40. After age 40, a screening mammogram is recommended every year. Any woman who meets these age guidelines and has not had a mammogram in the past 12 months may participate, with or without insurance.\nFor those with insurance, you must bring your insurance card and a photo ID, such as a driver’s license. Insurance will be filed for you. If you do not have insurance, you may qualify for financial assistance.\nThe MaryEllen Locher Breast Center receives grant funds from Avon Breast Cancer Crusade to provide women with education about and access to breast health services. Partnerships with Tennessee Breast and Cervical Screening Program and the Susan G. Komen Foundation provide eligible uninsured and under-insured women with breast and cervical screenings.\nIf an abnormality is discovered, the diagnostic work up is covered and a financial plan is provided for any follow-up care.\nWomen need to know their doctor’s first and last name.\nTo schedule a screening, call 423-495-4040 or 866-591-2254.", "url": "https://apnews.com/b335b1b72a144852b3516ceeb9def95b"}