{"authors": ["Jonah Bronstein"], "date_download": "2020-05-04 20:27:17", "date_modify": "2020-05-04 20:27:17", "date_publish": "2018-01-05 01:04:21", "description": "Buffalo, N.Y. — Sweden reminded the United States how difficult it is to earn a medal at the world junior hockey championship. Filip Gustavsson made 29 saves and Sweden had a three-goal...", "filename": "_f0b7d82fec8b44cc93105e7499de89a3_1588624037.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f0b7d82fec8b44cc93105e7499de89a3_1588624037.html", "title": "U.S. 'blindsided' by Sweden in World Junior semifinals", "title_page": "U.S. 'blindsided' by Sweden in World Junior semifinals", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Buffalo, N.Y. — Sweden reminded the United States how difficult it is to earn a medal at the world junior hockey championship.\nFilip Gustavsson made 29 saves and Sweden had a three-goal third period to beat the defending champion Americans, 4-2, on Thursday in the semifinals.\nSweden will face the Canada-Czech Republic winner in the title game Friday night.\n“You have a chance to win gold. You have nothing to lose,” Swedish coach Tomas Moten said. “We have the silver medal already, so you go for the win. You go for the gold.”\nElias Pettersson, Lias Andersson, Oskar Steen and Axel Jonsson Fjallby scored for Sweden, which has not trailed in any game during the tournament. Linus Lindstrom had two assists.\nWith the expected No. 1 pick in this year’s NHL draft, defenseman Rasmus Dahlin, and several other top prospects on the roster, the Swedes believe they have the talent to claim their first gold medal since 2012. Sweden finished fourth each of the last three years after finishing second in 2013 and 2014.\n“We have every chance to win gold,” Dahlin said. “We’re so excited about tomorrow.”\nThe U.S. was trying to become the first country to win back-to-back gold medals since Canada claimed five straight from 2005-09. The Americans have never won a gold medal on home ice.\n“This one blindsided us because we felt so strong with how we were going,” U.S. coach Bob Motzko said. “We had a vampire suck it out of us today. It just tells you how tough it is.”\nKieffer Bellows and Brady Tkachuk scored late goals for the U.S. after Sweden built a 4-0 lead midway through the third period.\n“The goal at the beginning of the tournament when everything starts is gold medal,” Bellows said. “But I know we have to push this behind us and get ready for the bronze medal game. We’re doing this for the team in the locker room and USA Hockey as a whole.”\nThe U.S. controlled the action for much of the first two periods before Pettersson’s power-play goal put Sweden ahead 1-0 with 6:30 left in the second.\nWith U.S. defenseman Dylan Samberg in the penalty box for high-sticking, Pettersson, the Vancouver Canucks’ No. 5 overall pick last year, received a pass in the left faceoff circle from Buffalo Sabres 2016 first-round selection Alex Nylander and one-timed a slap shot over Woll’s shoulder into the far corner of the net.\nNylander’s assist gave him 28 career points at the world juniors, equaling father Michael Nylander for fourth on Sweden’s career list.\nGustavsson’ preserved the lead when stopped U.S. forward Casey MIttelstadt on a 3-on-0 breakaway in the final minute of the second period. Mittlestadt, the Sabres’ most recent first-round pick, entered the game leading the tournament with 10 points.\nAndersson made it 2-0 when he tapped in his sixth goal of the tournment on a 2-on-1 with Fredrik Karlstrom early in the third period. Steen and Jonsson Fjallby scored shorthanded goals 38 seconds apart before the U.S. pulled goaltender Joseph Woll with 11:25 remaining.\n“We failed Joe tonight,” Motzko said. “Joe didn’t fail us.”\nBellows scored his tournament-leading seventh goal on a power play to end Gustavsson’s shutout bid with 7:36 remaining. The U.S. could not convert on its first four power plays while allowing the two shorthanded goals.\nTkachuk’s goal came with 3:01 left to play and the U.S. was unable to score on a power play in the closing minutes.\nPro Football Hall of Famer Thurman Thomas dropped the ceremonial first puck wearing a replica of one of his older Buffalo Bills jerseys, matching the U.S. uniforms. Team USA also wore the blue jerseys and pants during its preliminary-round win over Canada outdoors at the Bills’ New Era Field.", "url": "https://apnews.com/f0b7d82fec8b44cc93105e7499de89a3"}