{"authors": ["James Farrell Fremont Tribune"], "date_download": "2020-05-04 20:18:11", "date_modify": "2020-05-04 20:18:11", "date_publish": "2018-04-14 14:00:00", "description": "Nebraska state Treasurer Don Stenberg made several stops in Dodge County county schools on Friday, talking finance, handing out checks for unclaimed property and fielding questions from...", "filename": "_bc3a4fc8c365431db5466454805efcb7_1588623491.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bc3a4fc8c365431db5466454805efcb7_1588623491.html", "title": "FRE/041418/A1/JCAC town hall", "title_page": "FRE/041418/A1/JCAC town hall", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Nebraska state Treasurer Don Stenberg made several stops in Dodge County county schools on Friday, talking finance, handing out checks for unclaimed property and fielding questions from students.\nAt a town hall with Johnson Crossing fifth graders, Stenberg also answered student questions about his job, whether he would run for governor, about a meeting with Donald Trump before he was president and more.\nThe Johnson Crossing town hall was organized to congratulate students who had completed the Vault program, a free, state-sponsored online financial literacy program offered to grade school students through the Nebraska Educational Savings Trust (NEST).\n“Whatever you do, whether you work for a paycheck, whether you have your own business, whether you’re a teacher whether you’re an electrician, doesn’t matter,” Stenberg told the students. “All of you will need to understand finances and spending and how to be responsible so you don’t get into financial trouble, which all too many people do.”\nStenberg also offered financial advice—”You need to spend less than you earn,” he said—and suggested that, as students begin looking at financing their college educations, they save money from summer jobs and look into scholarships.\nHe also pointed to NEST, a state-sponsored college savings program which offers tax advantages that can help families save for education.\nWhen asked if he would run for governor, Stenberg, who is term limited this year, said that he wouldn’t.\n“The governor’s become a pretty good friend and I’m supporting him for his re-election campaign,” Stenberg explained.\nAfter Stenberg shared that he had met Donald Trump before he was president, a student asked him about the experience.\n“Donald Trump is a very interesting guy,” Stenberg said. “He’s not lacking in self-confidence—that was kind of the biggest thing I learned from the speech that he gave us.”\nEarlier in the day, Stenberg also visited Arlington High School to participate in a round-table discussion on financing college education, student debt and more with students who had completed another financial literacy program geared toward high school students, called the Nebraska NEST Financial Scholars program.\n“They’ve got a really great program at Arlington High School for financial literacy,” he told the Tribune. “They require every student to take a financial literacy course in order to graduate, and personally, I’d like to see the state of Nebraska require that for every school.”\nStenberg also made a stop at Midland University, where he presented president Jody Horner with an unclaimed property check for $4,153. The money was from 11 different properties, including more than $3,900 in death benefits from the Midland National Life Insurance Co. for a longtime Fremont resident and business owner, Verna Hudson, who died in 2011.\nStenberg told the Tribune that he made the trip to Fremont to highlight that the NEST financial literacy programs used by Arlington and Johnson Crossing are available to any grade school in the state.\n“We’re very happy 300 or so students here in Fremont that did take advantage of the program,” he said.\nHe added that he has personal ties to the area—he grew up in Tekamah, and his daughter recently moved to Fremont.", "url": "https://apnews.com/bc3a4fc8c365431db5466454805efcb7"}