{"authors": ["Bill Cummings"], "date_download": "2020-05-04 20:07:19", "date_modify": "2020-05-04 20:07:19", "date_publish": "2018-03-22 21:38:29", "description": "HARTFORD - A key legislative committee on Thursday told the state’s auto dealers and car maker Tesla to strike a deal over selling electric cars. The General Assembly’s Transportation...", "filename": "_bac0b0f09c8d490aaec9f98ff2a1a9a1_1588622839.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bac0b0f09c8d490aaec9f98ff2a1a9a1_1588622839.html", "title": "Sale of Tesla cars moves to the House", "title_page": "Sale of Tesla cars moves to the House", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HARTFORD - A key legislative committee on Thursday told the state’s auto dealers and car maker Tesla to strike a deal over selling electric cars.\nThe General Assembly’s Transportation Committee voted to send a bill to the House allowing Tesla to sell it’s cars outside of the traditional dealership franchise system. But committee members said the bill will not pass the House or Senate unless an agreement between car dealers and Tesla is reached.\n“We have been at this three or four years now,” said state Rep Tony Guerrera, D-Wethersfield and a committee co-chairman.\n“It’s agreed upon by all the chairs that we get this out of committee, but before a House vote we would like to have some compromise,” Guerrera said. “If they don’t, it will be up to us to make those decisions.”\nTesla and the state’s car dealers are at odds over Tesla’s business model, which does not use a typical dealership, complete with repair facilities, to sell cars. Instead, Tesla sells its cars from a simple office without the other functions.\nUnder franchise laws, Tesla is prohibited from direct sales and state residents have been going to dealerships in Westchester County, New York, to buy the product. Tesla wants to alter those franchise laws to suit it’s business model.\nThe state’s car dealerships say changing the rules would cost jobs and jeopardize the millions of dollars invested in dealerships across the state, in part because other car manufacturers could follow Tesla.\nState Sen. Toni Boucher, R-Wilton, said she voted to move the bill to the House in hopes of a compromise.\n“Some bills are a hot bed of controversy, such as this one, and it points to a big change in our economy,” Boucher said. “But we have concerns about dealerships who have a big investment in our communities.”", "url": "https://apnews.com/bac0b0f09c8d490aaec9f98ff2a1a9a1"}