{"authors": ["Alexis Zanghi", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Jennifer Baum", "Jefferson Pooley", "F. T. Green", "Matt Hartman"], "date_download": "2020-05-04 19:49:53", "date_modify": "2020-05-04 19:49:53", "date_publish": "2018-03-23 00:00:00", "description": null, "filename": "2018_03_carving-out-the-commons-review-cooperatives_1588621793.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/03/23155709/dc.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_03_carving-out-the-commons-review-cooperatives_1588621793.html", "title": "Carving Out the Commons", "title_page": "Carving Out the Commons", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nBy now, you could be forgiven for assuming that “the commons” refers to another cocktail bar or coffee shop in yet another neighborhood people used to be able to afford. In Chicago, the Commons Co-op is a co-working space inside a cocktail lounge inside a Virgin-branded boutique hotel. In Brooklyn, Common is a property management start-up (backed by $65 million in venture capital) that specializes in something called “co-living.” For just $1,400 a month, Common tenants in New York City get a private bedroom and share amenities like a bathroom, kitchen, and free coffee: an Instagrammable SRO. Common calls this “city living made better.” But it wasn’t long ago that a different kind of urban cohousing proliferated, organized by and for the working class: limited-equity cooperatives (LECs). Amanda Huron’s new book, Carving Out the Commons, focuses on ten LECs formed during the first wave of gentrification in Washington, D.C., and considers their history and future as urban commons. A geographer and urban planner who teaches social sciences at the University of the District of Columbia, Huron demonstrates how tenants resisted eviction and built their political power to reclaim housing from capitalists. In doing so, she grounds the urban commons in the everyday struggles of working people.\nCo-op City Washington, D.C., had experienced periodic influxes of bourgeois whites since the 1930s, but, by the 1970s, residents of working-class areas were worried about the further “Georgetownization” of their neighborhoods. Until the District of Columbia Home Rule Act passed in 1973, the city didn’t even have a locally elected city council, making working-class tenants even more vulnerable to exploitation. The Home Rule Act finally gave the city the right to set its own policies with minimal congressional interference. As Huron explains, “just as this majority-black city was gaining the right to govern itself, low-income people, mostly African American, were threatened with displacement.” The City-Wide Housing Coalition organized tenants and lobbied for rent control. Neighborhood committees, a grassroots Anti-Speculation Task Force, and a tenants’ union emerged to demand better living conditions, deter real estate speculation, and secure renter protections. Beginning in 1975, a flurry of legislation passed at the city level that struck at capitalists’ interests: rent control, a moratorium on condo conversions, a real estate transfer tax that penalized speculators who attempted to “flip” residential units. The Rental Housing Act of 1977 allowed tenants to purchase their building if the landlord put it up for sale. All of these measures sought to decommodify housing for DC’s working-class tenants, who had emerged as a powerful political force. But organizers knew that they needed equal footing with their landlords, and, for that, they needed capital. Under further pressure, the city passed the Tenant Opportunity to Purchase Act (TOPA) in 1980, which strengthened protections for tenants in buildings that were put up for sale and corresponded with low-cost financing for tenants’ associations to purchase these buildings and convert them to limited-equity cooperatives. To found one of these cooperatives, members first obtain a “blanket” or collective mortgage. Each household purchases a share by paying a relatively small up-front fee, similar to (but much lower than) a down payment on a conventional mortgage. They then make modest monthly payments toward the building’s maintenance, mortgage, and taxes. (In Huron’s research, these payments average roughly half of market-rate rents.) When a member moves, a new member purchases their share, and the original member receives their initial down payment plus a modest appreciation. By 1981, more than six thousand units in DC became limited-equity cooperatives, and roughly half of these units remain LECs today.\nThe Common State Limited equity cooperatives are (mostly) decommodified housing that shelter members from at least some of the demands of capitalism. Despite the fact that shares are still bought and sold, Huron considers them commons. First, they are an example of autonomous and community-driven spaces. Equally important, their restricted resale value drastically limits the possibility of turning a profit on a basic need and essential community resource, while removing units from the speculative housing market. Some criticize limited-equity cooperatives because they do not allow shareholders to build equity in the same way a mortgage would. But home ownership (by way of debt peonage) as the primary path to wealth accumulation is both an old assumption that’s faced increased scrutiny and one that continues to exclude people of color. The LECs profiled in Carving Out the Commons offer shareholders stable, below-market rate housing — and the opportunity to save money that would have otherwise lined a landlord’s pocket. Some of the people Huron interviews invested these savings; some spent more money on their children or on going back to school themselves. Overall, residents of limited-equity cooperatives report less stress and a freedom from waged labor that renters (and increasingly overleveraged homeowners) do not. They feel like owners of their homes, able to set curfews for noise and fix up their apartments as they choose. They enjoy the benefits of reduced housing costs and security promised by individual homeownership — an opportunity that they might not otherwise have been able to access by traditional means. Residents in Carving Out the Commons have limited access to capital and credit. Before incorporating as limited-equity cooperatives, they were facing mass evictions and displacement. By reclaiming their homes from the housing market, these tenants were not doing so out of any idealistic impulse but out of necessity in a time of crisis. As Huron writes, commoning is “a rational choice often made by people with a relatively narrow range of choices: people without access to capital, for whom capitalism is not working” — often because they have been systemically and strategically excluded from it. Working people create urban commons to meet basic needs: it is a practice that seeks solutions. While Huron acknowledges that state power historically serves capitalists’ interests, the material conditions for reclamation are made possible “under the aegis of the state”: [T]he creation of a commons is not guaranteed but is contingent on historical forces at work.… The commons constituted by D.C. LECs could not have been created were it not for the legal protections and financial assistance that the city, under pressure from tenant organizers, agreed to provide.… The urban commons … should be understood more as a pragmatic practice in the face of crisis rather than a utopian project, dreamed up in a time of leisure. Huron contrasts her assessment of the state’s role in building these LECs with two dominant schools of thought concerning the commons: institutionalism and alter-globalization. As social scientists, institutionalists utilize case studies to examine how the commons are regulated and maintained over time. For example, institutionalist Elinor Ostrom focused on collective regulation of “common-pool resources,” such as farmer-managed irrigation systems. Institutionalists conceive of the commons as bounded resources, like forests, fields, or buildings, and see the collective governance of the commons as a “third way,” between the market and the state. Huron and others have argued that Ostrom never interrogated how the commons relate to capitalism. Alter-globalizationists fill this gap. Their approach examines the conditions of enclosure, reclamation, and maintenance of the commons, often arguing that the neoliberal state colludes with capitalists to privatize and enclose resources. Because capitalism touches everything, the commons isn’t a single resource system in a discrete location, but a network of enmeshed sites of social reproduction. For alter-globalizationists, the commons represents a process, a thing that people do rather than a place they go or resource they share. Using the institutionalists’ methods and the alter-globalizationists’ political framework, Huron works toward an “investigation of how the commons operates on the ground, and from below.”\nContradictions of Commoning “To practice the urban commons,” Huron writes, “is to engage directly with the contradictions of life under capitalism.” The term urban commons sounds like an oxymoron: the enclosure of the commons, the process by which rural peasants were dispossessed of publicly held land in early modern England, is central to the creation of contemporary capitalism and the emergence of the city as its epicenter. Having lost these previously communal resources and without other means of sustenance, peasants were forced to rely on waged labor to survive. The city is thus a product of enclosure and is already enclosed; the urban commons therefore “exists in dialectical tension with capital.” The enclosure of the commons didn’t just drive peasants from country to city. It also shifted the division of labor within households. Because domestic labor no longer directly provided subsistence, women were made further dependent upon men. Housework was not assigned a monetary value and instead was seen as supporting mostly male waged labor. Silvia Federici calls this dynamic “the patriarchy of the wage.” Federici’s work is important to Huron’s interpretation of the commons, and Huron suggests that “seeing how women’s labor has been obscured and naturalized helps us to see that the work of the commons has … been naturalized and ignored.” These co-ops help us understand domestic labor’s essential role in capitalism. Working-class women created and maintained the LECs in Washington, but their labor is often treated as different from — and less valuable than — the productive, waged labor typically associated with men. It is gendered activities (like copying flyers and organizing barbecues) that reclaim the commons. This work is either un- or underpaid, but it is nevertheless necessary in preserving a space outside the market and helping workers break their dependence on waged labor. This feminist understanding of the labor and contradictions of spaces like LECs leads Huron to caution her readers against romanticizing the urban commons. A resource that is governed collectively isn’t always regulated equitably. (Huron points to patriarchal and even fascist squats in contemporary Europe as examples.) While the commons may be a democratic and anti-capitalist practice, LECs are inherently exclusive. Even with state assistance, Section 8 vouchers, and mutual aid among residents, the cooperatives profiled in Carving Out the Commons exclude the extremely poor and destitute, in large part because “the financial health of the commons as a whole is bound up in the financial lives of its individual members.” Further, once reclaimed, the commons remain vulnerable to the pressures of capital as the cooperative inevitably accumulates value. As soon as shareholders pay off the blanket mortgage, they have the freedom to convert the building to market rate, thus re-enclosing the commons — a process that does not benefit all members equally. “When commoners sell out,” Huron writes, “they lose the commons. What they gain — sometimes — is cash.” In order to sustain the urban commons, we must continue to reclaim resources from capitalism, expanding horizontally and from below. Neither Federici nor Huron are idealizing the precapitalist commons, but both argue that we are worse off without them. To reclaim resources from capitalism, we can’t continue to reproduce the values capitalists have assigned to our labor and our time. For Huron, a “call to reclaim the commons is not a call to return to some sort of mythical precapitalist society, but to create a new society, based in the commons and truly emancipatory.”", "url": "https://jacobinmag.com/2018/03/carving-out-the-commons-review-cooperatives"}