{"authors": [], "date_download": "2020-05-04 20:17:23", "date_modify": "2020-05-04 20:17:23", "date_publish": "2018-01-16 16:48:16", "description": "The fallout continues for HM over an ad featuring a black child modeling a hoodie emblazoned with the words Coolest monkey in the jungle. The Weeknd cut ties with HM over the ad; Nicki Minaj...", "filename": "_1d26054c3e42407b84b3e428616859bc_1588623443.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1d26054c3e42407b84b3e428616859bc_1588623443.html", "title": "Shawn Brundidge wouldn't have subjected his model son to HM monkey business", "title_page": "C.J.: Shawn Brundidge wouldn't have subjected his model son to HM monkey business", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The fallout continues for HM over an ad featuring a black child modeling a hoodie emblazoned with the words Coolest monkey in the jungle.\nThe Weeknd cut ties with HM over the ad; Nicki Minaj fans are pressuring her to do the same. LeBron James posted a critical tweet that in part said: we aint having it. The child in the ad is reportedly being offered a chance to model Diddys Sean John fashions.\nA little closer to home, I sought the perspective of Shawn Brundidge, father of Andrew, now 11, who started making money as a model at nine months of age. Brundidge is director of operations at a St. Paul health center with a mission to serve the poor and uninsured. Hes a married father of four with a few rules by which he lives, some connected to Andrews modeling career.\nQ: What modeling imagery is nonnegotiable where your son Andrew is concerned?\nA: No monkeys at all. Weve been portrayed too long as monkeys, apes and baboons, and I was not going to have my son subjected to that kind of modeling. If any of that stuff came up, we were walking.\nQ: So he couldnt wear the word or an image of a monkey?\nA: Nope, not even the cutest little monkey.\nQ: You dont hold HM responsible for this PR debacle?\nA: Mom or Dad or whoever was there should have pulled him out of that ad. That is something you wouldnt see little white boys model, so dont put little black boys in it.\nQ: Do you risk being called difficult if you walk off a set for this reason?\nA: I think they have other options to model something. You could model a shirt that doesnt have writing on it. Any clothing photo shoot we have ever gone to with Andrew, there was always more than one outfit they could choose from.\nQ: Is stereotyping the reason the child in the HM ad looked so oiled up and shiny?\nA: Could be, but I think theres a problem with lighting dark skin. It could be you need more light and tone down the Vaseline, too [laughter].\nQ: Did they ever put Vaseline on Andrew?\nA: No.\nQ: Did Andrew ever have a meltdown at a modeling shoot?\nA: Yeah, there were incidents where he wasnt cooperative. You have to pack up and go home, especially at the age he started; at nine months they can be unpredictable. There is typically a lull in the modeling activity. When they hit about 2andfrac12;, they know enough to be disobedient and not want to follow the rules.\nQ: From where do your tendencies as a do-gooder come?\nA: Being the fourth of five kids, knowing you have to wait your turn and look out for everybody else in the family unit. We werent raised to be selfish.\nQ: People who live in warm climates are perplexed by you leaving the warmth of Texas for a job in Minnesota, then moving back to Texas only to return to Minnesota for another job. What is so appealing about Minnesota?\nA: It is a better place, in my opinion, to raise a family, even an African-American family, because the school systems are better. In Houston, we had to pay for Andrew to go to a private school to ensure he got a good education. We didnt have much faith in the educational systems of the public schools. In Minnesota we dont have the same concerns. Now we left Minnesota with one child, had three children in Texas and realized Minnesota is a better place to raise a family. I am a product of the public school system and Ive done fairly well.\nQ: Whats the down side of being married to Sheletta, once crowned the Funniest Woman in the Twin Cities?\nA: I get no recognition for all the material she steals from me.\nQ: You do most of the cooking at your home because ...\nA: I enjoy it and I have pretty good system with my wife. If Im cooking she is more than happy to clean.\nC.J. can be reached at cj@startribune.com and seen on Fox 9s Buzz.", "url": "https://apnews.com/1d26054c3e42407b84b3e428616859bc"}