{"authors": ["Jeff Horwitz"], "date_download": "2020-05-04 20:14:17", "date_modify": "2020-05-04 20:14:17", "date_publish": "2018-03-28 05:00:00", "description": "WASHINGTON — President Donald Trump's family hotel business has lost a bid to regain control of the luxury hotel in Panama that ousted his brand, according to a new emergency arbitration...", "filename": "_f46dc46ccab94167ae0220d6d011a64a_1588623257.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f46dc46ccab94167ae0220d6d011a64a_1588623257.html", "title": "Trump hotel business fails to undo Panama takeover", "title_page": "Trump hotel business fails to undo Panama takeover", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WASHINGTON — President Donald Trump’s family hotel business has lost a bid to regain control of the luxury hotel in Panama that ousted his brand, according to a new emergency arbitration ruling.\nThe arbitrator ruled Tuesday that Trump’s company should not have been evicted while a broader arbitration dispute was ongoing between the hotel owners and Trump. But with Trump outmaneuvered in Panama and the hotel in the owners’ hands, the arbitrator declined to reinstate the Trump team. He also barred all parties from starting new legal fights over the matter.\n“The facts on the ground now militate against forcibly undoing the steps that have been taken,” arbitrator Joel Richler wrote. He said his decision might be different if Trump had sought an emergency arbitration decision before the hotel owners successfully petitioned the Panamanian courts for help.\nAlan Garten, the Trump Organization’s general counsel, declined to comment on the ruling. But in past statements to the Associated Press, he has said that the Trump Organization expects the arbitration process will ultimately find that Trump Hotels’ firing and subsequent removal from the property without an arbitrator’s approval violated Trump’s contract.\nTuesday’s decision dashes the Trump Organization’s hopes of promptly reversing its high-profile eviction from the property, a 70-story luxury high rise on Panama City’s waterfront now named The Bahia Grand Panama. The owners of the property — which was run by Trump under a management agreement — sought to fire his company last October, citing damage to Trump’s brand and mismanagement by hotel officials. But the Trump Organization disputed its termination as illegitimate and refused to hand over the property.\nThe fight — initially waged in confidential arbitration — burst into the public eye in February when Orestes Fintiklis, the hotel’s majority owner, sought to fire Trump’s hotel management and take control of the property on behalf of the owners’ association. Trump’s family company responded by beefing up its security team and blockading doors — sometimes by building walls in the administrative office’s hallways. Rival teams of hotel security guards skirmished on the property, and police were repeatedly called in to keep the peace.\nThe standoff ended March 5, when Panamanian judicial officials sided with Fintiklis and a justice of the peace backed by police officers ordered the Trump management team to vacate the property. A workman immediately scrubbed Trump’s name from the hotel, using a crowbar to pry “TRUMP” off the hotel’s signage amid a scrum of news cameras.", "url": "https://apnews.com/f46dc46ccab94167ae0220d6d011a64a"}