{"authors": ["Amaris Castillo", "Acastillo Lowellsun.Com"], "date_download": "2020-05-04 20:07:51", "date_modify": "2020-05-04 20:07:51", "date_publish": "2018-12-24 04:47:40", "description": "LOWELL -- Congregants on Sunday morning filtered into The Church of Jesus Christ of Latter-day Saints' Lowell chapel on Princeton Boulevard. They were there for their sacrament meeting, a time of...", "filename": "_e287238e0adf4e8593af32ee4757f314_1588622871.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e287238e0adf4e8593af32ee4757f314_1588622871.html", "title": "Word of God, No Translation Needed", "title_page": "Word of God, No Translation Needed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- Congregants on Sunday morning filtered into The Church of Jesus Christ of Latter-day Saints’ Lowell chapel on Princeton Boulevard. They were there for their sacrament meeting, a time of worship.\nBecause it was two days before Christmas, different choirs performed songs such as “When Joseph Went to Bethlehem” and “The First Noel.” At times, the sacrament meeting featured the Portuguese language -- a sign of a recent major shift.\nA Portuguese congregation was officially organized earlier this month at the Mormon church’s Lowell chapel. The collective decision by church leaders has been embraced with delight by Portuguese-speaking members, most of whom hail from Brazil. Starting next week, the new congregation will have its own dedicated sacrament meetings on Sundays in their native tongue.\n“We are so excited,” said Sheila Almeida, a Lowell resident whose family has been attending the church for 14 years. “I think this is the time for growth for us. For us, it’s like a special time because it’s the plan of the Lord.”\nAlmeida and her husband, Fabio Almeida, both 44, are originally from Brazil. Almeida said this congregation was needed because some members don’t yet speak English fluently.\nDavid Holland, president of the Nashua New Hampshire Stake that approved the creation of a Portuguese congregation, said the Lowell chapel has had a community of Portuguese-speaking members for a long time.\n“It just began to grow in strength and in vitality and activity. It became very clear to us that they deserved their own congregation and a place where the community could continue to grow and flourish,” Holland said. “It has already demonstrated to us the power of this gathering of men and women, that they have served one another and helped one another and are ready to create their own church family.”\nOfficially called the Lowell 2nd Branch, the new Portuguese congregation is being led by Tales Barros, a Lowell father of four who is originally from Brazil. It’s a volunteer position that Barros, 39, is excited about taking on despite juggling long hours between his cleaning services company and a gig as an Uber driver.\nBarros said a challenge for many has been the language barrier. English, he said, takes a while to learn.\n“We are so happy,” Barros said. “When we received the news, we know there’s going to be a huge difference for other members.”\nAt the tail end of the sacrament meeting, Barros in his closing remarks spoke of his faith with the help of an interpreter. The proud father grew emotional when he spoke of his eldest child, 15-year-old Ashley, who earlier had led a choir as they sang “Oh Come, All Ye Faithful” in Portuguese.\n“It was really special. It’s the end of the year and we’re remembering Christ,” Ashley later said. “I know that people have been here for a long time, and they deserve this.”\nThe Church of Jesus Christ of Latter-day Saints is located at 421 Princeton Blvd. in Lowell.\nFollow Amaris Castillo on Twitter @AmarisCastillo.", "url": "https://apnews.com/e287238e0adf4e8593af32ee4757f314"}