{"authors": ["Barry Adams", "Wisconsin State Journal"], "date_download": "2020-05-04 20:17:05", "date_modify": "2020-05-04 20:17:05", "date_publish": "2018-07-08 21:00:00", "description": "BLUE MOUNDS — Back stage can be filled with black walnut, elm, white oak and hickory trees. There are no stage lights, sound systems or even tickets. The aisles are at times covered in grass...", "filename": "_51c2bf45ea58403080a3d44b81fb6f97_1588623425.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_51c2bf45ea58403080a3d44b81fb6f97_1588623425.html", "title": "No makeup but plenty of sunscreen and bug spray for Shakespeare in state parks", "title_page": "No makeup but plenty of sunscreen and bug spray for Shakespeare in state parks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BLUE MOUNDS — Back stage can be filled with black walnut, elm, white oak and hickory trees.\nThere are no stage lights, sound systems or even tickets. The aisles are at times covered in grass or gravel and audience members come wearing hiking boots, baseball caps and T-shirts.\nThe performers keep a close eye on the weather with their smartphones and wear colorful Converse tennis shoes, but makeup is nowhere to be found. Instead, applications of sunscreen and bug spray are the coverings of choice for a nomadic troupe of thespians crisscrossing the state this summer to turn 17 state parks, at least for a few hours, into William Shakespeare’s Illyria.\nAnd the show goes on despite mosquitoes, rain showers, smothering heat and humidity and, last Sunday, a tornado watch.\n“Really supportive people come,” said Joe Picchetti, 28, a charter member of Milwaukee-based Summit Players. “We thought it was going to be a one-and-done type thing but it’s grown into this amazing thing. We’re just so proud of what has happened with the company and the impression it has left on the state.”\nThis is the fourth summer that Summit Players, made up of current and recent graduates of UW-Milwaukee and Marquette University, has ventured out for an in-state tour that includes free weekend performances at some of Wisconsin’s most popular state-owned destinations.\nAfter four weeks of rehearsals, the season began June 23 at Richard Bong State Recreation Area in western Kenosha County and will conclude Aug. 12 at Pike Lake State Park near Hartford. In between there have already been shows at High Cliff and Devil’s Lake state parks, among others, with 11 still to come, including shows July 21 at Mirror Lake State Park near Lake Delton and July 22 at Lake Kegonsa State Park north of Stoughton.\n“It’s been really fun to get to leave Milwaukee for a little bit and travel the state,” said Caroline Norton, 20, an Alabama native who camped as a child, will be a junior this fall at Marquette and studies theater and digital arts. “Since moving here I’ve pretty much been in Milwaukee or some of the suburbs so I’m excited to see (the state). It’s beautiful.”\nThe idea is to use abbreviated performances to expose Shakespeare to audiences that may not be able to afford or have access to professional theater. The shows also stand in contrast to most state park programs where the topics can include bats, bears, geology and stargazing. Although the play has provided an opportunity for Reed Cockwell, the naturalist at Blue Mound State Park, to develop a hike that points out the flora in the park like nettles, hemlock, oak trees and vines that are also mentioned in the works of Shakespeare.\n“I read through the plays and he knows so much about botany,” said Cockwell, 56, who became transfixed with Shakespeare while at UW-Platteville and is a regular at American Players Theatre in Spring Green. “You would swear he was a gardener or a botanist. I’ve always had a passion for Shakespeare.”\nHannah Klapperch-Mueller is executive director of Summit Players , one of its founders and this season is playing Olivia, among other roles, in the troupe’s production of “Twelfth Night.” Klapperch-Mueller, 24, grew up in West Milwaukee near Miller Park and after graduating from West Allis Hale went to Marquette University, where she earned a double major in theatre arts and writing-intensive English. She has performed with a variety of theater companies in the Milwaukee area but got the idea for Summit Players when a traveling theater company visited Marquette when she was a sophomore and performed Shakespeare’s “Cymbeline” with just six actors, each playing multiple roles.\nAt about the same time she had recently camped with her parents in Door County’s Potowatami State Park where she discovered the park’s amphitheater and began thinking about bringing Shakespeare to state parks as a final project when she graduated. She began sending out feelers to the state Department of Natural Resources in the summer of 2014 and a year later her group performed in 13 state parks. At the first show, 85 people were in the audience.\n“It all grew from there,” Klapperch-Mueller said. “It was really that audience feedback that first summer that made us say we needed to keep doing this.”\nThe troupe’s $33,000 budget helps pay for travel expenses and small salaries for its members, all of whom have day jobs outside of their weekend Shakespeare gig. Funding comes from grants, including from the Wisconsin Humanities Council, donations and in-kind donations from Marquette University, which provides rehearsal space, the small wardrobe and props, most of which fit into a single steamer trunk scavenged from the university’s prop room.\nThere are few hotel stays, with most overnights spent in a tent. Performances, each about 75 minutes, have been in front of as few as 15 people and as many as 215. Only one has been scrubbed due to adverse weather but some have been moved to shelters.\n“What is my favorite thing is when a parent comes up to us after a show and says, ‘This is the first time my child has seen a play,’ or, ‘This is the first time they’ve seen Shakespeare,’ ” Klapperch-Mueller said. “And this is exactly how we wanted it to be for them. It’s just like a little taste.”\nLast weekend, about 100 people sat in stifling heat on June 29 at Lapham’s Peak State Park near Delafield, with about 35 in the audience the next night at Devil’s Lake State Park near Baraboo. That Sunday, about 25 people took in the show at the hill-top amphitheater at Blue Mound State Park. The venue, refurbished in 2016 by an Eagle Scout along with funding from the Friends of Blue Mound State Park, features 27 benches and a 16-by-20-foot stage. A picnic table was used as an additional performance platform in front of the stage.\nThe weather started out threatening 90 minutes before the show and included some light rain. But by showtime the skies had cleared and a steady breeze combined with the shade made for a surprisingly comfortable viewing experience, although at times, the wind and the swaying trees forced the actors to project more than usual. An audience member even brought a tray of brownies for the cast, crew and spectators.\n“It just gives me a deeper appreciation for what we do, braving the elements and venturing to new places to bring our craft to people who might not have an opportunity to see it,” said Michael Nicholas, 22, an actor and writer from Palatine, Illinois, who graduated this year from Marquette and is in his second season with Summit. “It’s not only fun but we get to have some adventures as well. This is as Thoreau as it gets.”\nFor Nick Parrott, who will be a senior at Marquette this fall, the travels bring back fond memories of camping at Devil’s Lake State Park where he, his sisters and cousins would put on impromptu performances for family in the amphitheater of Northern Lights Campground. Last weekend, Parrott, from Gurnee, Illinois, performed in the park as a professional.\n“It was bitter sweet, seeing where I was as a kid and those early aspirations and not really knowing what I wanted to do but clearly having a passion for being on stage and performing,” said Parrott. “Doing Shakespeare for an audience is just so rewarding.”", "url": "https://apnews.com/51c2bf45ea58403080a3d44b81fb6f97"}