{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:15:23", "date_modify": "2020-05-04 20:15:23", "date_publish": "2018-03-03 00:00:00", "description": "In the historic decision District of Columbia vs. Heller on the Second Amendment, the U.S. Supreme Court, led by Justic Antonin Scalia, got it wrong. The court stated that this 27-word...", "filename": "_a8f8e7896c5e4adb99eb09e8da2dd404_1588623323.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a8f8e7896c5e4adb99eb09e8da2dd404_1588623323.html", "title": "Second Amendment ruling is faulty -- Mark Quinn", "title_page": "Second Amendment ruling is faulty -- Mark Quinn", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In the historic decision District of Columbia vs. Heller on the Second Amendment, the U.S. Supreme Court, led by Justic Antonin Scalia, got it wrong.\nThe court stated that this 27-word amendment guaranteed all Americans the right to own a gun. Most experts who have researched this amendment have disputed that interpretation. From the writings of James Madison and others, it is clear the Second Amendment meant something to them that has little to do with Scalia’s interpretation.\nIn 1791, American s had a great mistrust of a standing army. This country had just defeated the British army, and many of our Founding Fathers had equal misgivings about a standing army of our own, fearing too much centralized power.\nThey recognized however, that to protect this new country from turmoil within or from foreign adversaries, state militias had to be made readily available for protection.\nScholars have found no evidence that the Second Amendment was about individuals owning guns. Madison wasn’t talking about that. His concern was for a collective group, armed of course, formed to protect this nation and to guarantee order.\nUnfortunately, the “originalists” on the Supreme Court have misinterpreted our history.\nMark Quinn, Madison", "url": "https://apnews.com/a8f8e7896c5e4adb99eb09e8da2dd404"}