{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:06:05", "date_modify": "2020-05-04 20:06:05", "date_publish": "2018-10-27 14:50:12", "description": "Hamilton Avenue School and the Town of Greenwich are on the verge of an important 20th anniversary, but do not expect anyone to celebrate. There will be no proclamation of achievement from...", "filename": "_5ffa65dfcd174c4e9c155ae5a7e93cca_1588622765.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5ffa65dfcd174c4e9c155ae5a7e93cca_1588622765.html", "title": "Commentary An anniversary that shouldn’t be", "title_page": "Commentary An anniversary that shouldn’t be", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Hamilton Avenue School and the Town of Greenwich are on the verge of an important 20th anniversary, but do not expect anyone to celebrate.\nThere will be no proclamation of achievement from the Office of the First Selectman, no congratulatory ceremony hosted by the Board of Education. That is fine; It would be wholly inappropriate to honor two decades of academic failure at the elementary school in Chickahominy, just as it would be inappropriate to honor the other elementary school nearby, New Lebanon, for its equally inept record over the last 12 years.\nThe state first added Hamilton Avenue to its list of racially imbalanced schools in 1999. New Lebanon followed seven years later. In the school year 2001-02, 69 percent of Hamilton Avenue students were proficient in reading. By 2017-18 that number was just 47 percent. In math, 88 percent of Hamilton Avenue students were proficient in 2001-02. By 2017-18, only 47 percent met that goal, according to reports on edsight.gov, a website published by the state school board. New Lebanon’s numbers are also shocking. The needle is moving in the wrong direction.\nAfter 20 years, it is time to investigate. In fact, it is well past time to demand answers and accountability from a system that has failed multiple generations of young students. When administrators discuss the scores mentioned above, they talk about how measurement parameters have changed, and they argue over methodology. But even allowing for some variances in the definition of proficiency from 2001 to 2018, a decline from 88 percent to 47 percent is clearly a signal that something is very, very wrong.\nLike other towns, Greenwich gets federal education dollars from various programs, all based on the number of students district-wide who qualify for free or reduced meals. Greenwich puts virtually all those monies into the racially imbalanced schools. Tens of millions of dollars over the last 20 years have translated to more classroom teachers, smaller class sizes and specialists in such areas as reading, speech therapy and coaching for teachers. It is not working.\nWe know the school board puts student achievement first because it tells us every chance it gets. The board blares it from its website and doubly emphasizes this commitment every time it submits a new plan to the state Board of Education. When it comes to the eastern and central parts of Greenwich, elementary achievement scores are among the top in the state. Hamilton Avenue’s and New Lebanon’s are near the bottom.\nThere are those who argue that the racial composition of a school’s student body has no bearing on student achievement. Twenty years of futility at Hamilton Avenue argues against that. But Hamilton Avenue’s and New Lebanon’s experiences also argue that more money alone is not the answer.\nMaybe this 20tnh anniversary will be a wake-up call to the school board and to town voters. There needs to be a serious conversation about what has not happened in western Greenwich for all these years. And that conversation needs to start with the findings from an independent examination of what isn’t working and why that is so. The school board should not be allowed to continue on the path of declining student achievement in schools in the poorest and most politically underrepresented part of town.\nPolitical representation is a problem for both the New Lebanon and Hamilton Avenue neighborhoods. The last member of the school board from either of those neighborhoods was Stephen Anderson, a former board chairman who left the board in 2013. But his kids did not attend either of those schools; through the lottery they were admitted to Julian Curtiss. Without a seat on the school board, particularly in a town so wedded to neighborhood schools, there is no one to advocate for these students. Can you imagine the political fallout if any elementary school on the east side of town performed as poorly as those on the west side? There would be rioting at the country and yacht clubs.\nThis is not an intractable problem. It is more a question of will and commitment. There are many top performing schools in less than affluent neighborhoods. How hard can it be to find a superintendent or an administrator who has accomplished what needs to be done at Hamilton Avenue and New Lebanon? While the school board looks for yet another superintendent, it should make such experience an absolute pre-requisite.\nBob Horton can be reached at bobhorton@yahoo.com.", "url": "https://apnews.com/5ffa65dfcd174c4e9c155ae5a7e93cca"}