{"authors": ["S.A. Miller The Washington Times"], "date_download": "2020-05-04 20:13:40", "date_modify": "2020-05-04 20:13:40", "date_publish": "2018-05-24 16:45:00", "description": "President Trump presented the Medal of Honor on Thursday to a retired member of the Navy's SEAL Team 6, recognizing the sailor's heroic acts during a mountainside firefight in the early days of...", "filename": "_d37089f4f1cb9ff94875c98256e31f11_1588623220.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d37089f4f1cb9ff94875c98256e31f11_1588623220.html", "title": "Trump presents Medal of Honor to Britt Slabinski, Navy SEAL hero of 'Battle of Robert's Ridge'", "title_page": "Trump presents Medal of Honor to Britt Slabinski, Navy SEAL hero of 'Battle of Robert's Ridge'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Trump presented the Medal of Honor on Thursday to a retired member of the Navy’s SEAL Team 6, recognizing the sailor’s heroic acts during a mountainside firefight in the early days of the Afghanistan War.\nThe military’s highest decoration went to retired Master Chief Petty Officer Britt Slabinski for what the military deemed “conspicuous gallantry” when he led a rescue effort for a fellow team member into enemy fire up the 10,000-foot snow-covered Takur Ghar mountain.\nAt a White House ceremony, Mr. Trump described the retired Navy Seal as “a special man, a truly brave person.”\nHe recounted the grueling battle when Chief Slabinksi and his team jumped into a firefight atop a steep mountain to save a fellow team member, only to have to fight their way back down the icy slope carrying another badly injured sailor.\n“We are free because warriors like you are willing to give their sweat, their blood, and, if have to, their lives for our great nation,” Mr. Trump told Chief Slabinski.\nSeveral other survivors of the mission attended the ceremony. Also in the room were many of Chief Slabinski’s family members, including his son Bryce, a senior at Ohio State University.\nThe rescue effort of what became known as the Battle of Robert’s Ridge began as a reconnaissance mission by helicopter to the mountain peak. The helicopter unexpectedly came under machine gun fire and, as it lurched away, Petty Officer 1st Class Neil Roberts was knocked out of the helicopter and fell onto the mountainside, according to the Pentagon’s official account.\nChief Slabinski and the rest of the team survived when the helicopter crashed in the valley. When a second helicopter arrived to retrieve them, they were told that Roberts may still be alive.\n“The team faced a choice: to wait for reinforcements and pretty much safety, or to return immediately to the enemy stronghold in the hope of saving Neil’s life,” said Mr. Trump. “They would be outmanned, outgunned and fighting uphill on a steep, icy mountain. And every soldier knows you don’t want to fight uphill. They learned that at Gettysburg you don’t fight uphill.”\nHe continued, “The odds were not good. They were not in their favor. But Britt and his team didn’t even hesitate for a moment. They made their decision. For them, it was an easy one. They went back to that mountain.”\nWhat followed was a 14-hour ordeal against al Qaeda insurgents and the elements as they entered the highest-altitude battle in American military history.\nChief Slabinski rallied his men and charged into the battle, repeatedly exposing himself to enemy fire as he engaged in a pitched, close-quarters firefight against the tenacious and more heavily armed enemy forces.\nDespite the heroic effort, Roberts was captured and killed by al Qaeda fighters. In all, seven Americans were killed and six wounded on the mountaintop.\nMr. Trump described the valiant rescue effort:\n“When their helicopter reached the mountain peak, they jumped out into a furious onslaught of machine gun fire like none of them had ever seen before. Britt and his teammate [Air Force Technical Sgt.] John Chapman charged uphill toward the enemy, where John was shot after clearing a bunker.\n“Britt continued to engage the enemy, repeatedly exposing himself to horrendous fire. Two of his other teammates, [Aviation Boatswain’s Mate 1st Class] Stephen “Turbo” Toboz and [Petty Officer 2nd Class] Brett Morganti, both suffered very, very serious leg injuries.\n“Britt helped them to safety and called in airstrikes as continuous fire drove them ever-further down the face of the mountain got worse and worse, more and more dangerous. He kept going,” said the president.\nThe firefight continued as they descended the steep mountain carrying Mate Toboz with them.\n“When they could go no further, Britt tended to the wounded and coordinated their escape until his team was finally evacuated from enemy territory,” said Mr. Trump.\nThe high honor bestowed on Chief Slabinski follows years of controversy over the rescue mission. Reports said Chief Slabinski and his SEAL team left Sgt. Chapman behind at the bunker. Newsweek reported that Sgt. Chapman was later killed by al Qaeda militants.\nAlthough Chief Slabinski reportedly believed Sgt. Chapman was dead, the Air Force said in a 2016 New York Times report that he left the sergeant to fight alone for more than an hour before he was killed.\nThe Pentagon determined the official version of events based on high-tech surveillance tools.\n“Today, we also remember the brave soldiers who gave their lives on that mountain,” said Mr. Trump, “for whom these events are now known. It’s called the Battle of Roberts Ridge. Incredible event.”", "url": "https://apnews.com/d37089f4f1cb9ff94875c98256e31f11"}