{"authors": ["Jackson A. Thomas"], "date_download": "2020-05-04 20:11:24", "date_modify": "2020-05-04 20:11:24", "date_publish": "2018-07-03 16:00:00", "description": "Summer and grilling go together like Independence Day and fireworks and your favorite beach towel and sun-drenched sand. It’s now prime time to break out the apron and get sizzling, but that...", "filename": "_7b0521147e694c19a4dbaeb718c6dbff_1588623084.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7b0521147e694c19a4dbaeb718c6dbff_1588623084.html", "title": "Put a healthy spin on grilling with summer fruits and veggies", "title_page": "Put a healthy spin on grilling with summer fruits and veggies", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Summer and grilling go together like Independence Day and fireworks and your favorite beach towel and sun-drenched sand. It’s now prime time to break out the apron and get sizzling, but that doesn’t mean you can’t be healthy about it. Learn how to serve up some smart choices and have everybody on your block raving about your next cookout.\nSavor the flavor\nStefani Pappas, a registered dietitian nutritionist based in Great Neck, New York, says the biggest benefit of grilling is the added flavor it brings out in the foods, especially for fruits and vegetables.\n“Grilling foods wallows for less fat and calories than frying or sauteing,” Pappas says. “Plus, grilling gets the whole family outdoors. This can inspire family members to toss a Frisbee or play in the backyard together while grilling dinner.”\nSome of her favorites include red bell peppers, zucchini, eggplant and asparagus. “You can lightly brush these vegetables with olive oil and sprinkle with pepper,” Pappas says. “Ditch the salt, and let the natural flavors of these vegetables shine on the grill. Peaches, plums and pineapple also grill up nicely and make for the perfect dessert.”\nOnions, eggplant, squash, zucchini, carrots, big kale leaves and potatoes also pack in plenty of flavor on the grill — and come with an added crispy crunch.\n“There’s no need for additional oil or butter for flavor, which can add extra calories and fat,” says Katie Boss, a registered dietitian based in Grand Rapids, Michigan. “Most people prefer vegetables when they are grilled. Grilling allows vegetables to retain the majority of their vitamins and minerals, which can commonly be lost when they’re cooked over the stovetop.”\nMeat your maker\nFor healthy grilling meat options, Pappas says focus on lean proteins. “Some of my favorite healthy grilling items include tuna steak, swordfish, ground turkey burgers and pork tenderloin,” she says. “Try to keep your protein portion to the size of your palm, about 3 or 4 ounces.”\nDr. Daryl Gioffre, a nutritionist based in New York City, says his favorite grilled “meat” is cauliflower steaks with turmeric, ginger and cumin.\n“If you are going to grill animal proteins, wild-caught Alaskan salmon is a great fish for grilling as is wild-caught trout and herring,” Gioffre says. “It is high in essential omega-3 fatty acids, low in mercury, and will decrease the inflammation levels in your body and brain. It is important to stick to healthy options and avoid processed meats like hot dogs or sausages, which is literally cancer on a bun.”\nAnd be careful to keep the meat — as well as the fruits and veggies — from charring while on the grill, Gioffre says, as this prolonged exposure to smoke can have carcinogenic effects on it.\nAlways ensure the meat is cooked to a proper temperature, Boss says, and keep the grill cleaned.\n“Before placing items on the grill, give it a good scrub,” she says. “Clear it of any leftover grease or char to prevent any open flames while cooking, which would then lead to additional exposure to chemicals.”\nMediterranean figs with goat cheese and pistachios\nIngredients\n4 fresh figs, halved1 tablespoon extra virgin olive oil, plus more for brushing2 tablespoons balsamic vinegarDrizzle raw honey1/4 cup crumbled goat cheese1/4 cup chopped pistachiosSprig of mint\nDirections\nPreheat grill to medium heat. Lightly brush the inside of the halved figs with extra virgin olive oil, then place face down on grill. Grill about 5 minutes until they’re soft to touch and slightly browned. Remove figs from grill and place on serving platter. While the figs are still hot, drizzle balsamic vinegar, extra virgin olive oil and honey. Sprinkle crumbled goat cheese and crushed pistachios. Top with a few sprigs of mint.\nSource: Dietitian Stefani Pappas\nBlackened salmon sandwich\nIngredients\n1 pound skinned salmon fillet, quartered2 teaspoons blackening or Cajun seasoning1 small avocado, pitted2 tablespoons mayonnaise4 whole-wheat rolls, split and toasted1 cup arugula2 plum tomatoes, thinly sliced1/2 cup red onion, thinly sliced\nDirections\nOil grill rack; preheat grill to high. Rub salmon on both sides with seasoning. Grill until cooked through, 3 to 4 minutes per side. Mash avocado and mayonnaise in a small bowl. To assemble sandwiches, spread some of the avocado mixture on each roll and top with salmon, arugula, tomato and onion.\nSource: Dietitians Kitty Broihier and Allison Stowell of Guiding Stars\nCauliflower steaks with ginger, turmeric and cumin\nIngredients\n1 large head cauliflower1 tablespoon coconut oilSalt and pepper to taste\nFor anti-inflammatory steak sauce\n1 tablespoon extra virgin olive oil1 teaspoon freshly grated ginger1 teaspoon ground cumin1/2 teaspoon ground turmericSmall handful of cilantro, chopped\nDirections\nFor steaks: Cut the stem off the cauliflower and remove leaves. Using a large knife, cut cauliflower from top to the base into “steaks” (3/4-inch thick or so). Season with sea salt and black pepper on both sides. Brush on coconut oil and grill each side until golden.\nFor steak sauce\nIn a separate bowl, whisk together 1 tablespoon of olive oil, ginger, cumin and turmeric. Brush mixture onto the cauliflower steaks. Grill until tender. Garnish with cilantro and serve.\nSource: Nutritionist Dr. Daryl Gioffre\nGrilled tuna with fire and ice salsa\nIngredients\n1 cup watermelon, diced1 cup pineapple, diced2 tablespoons lime juice1 tablespoon minced fresh cilantro1 teaspoon minced jalapenoFour 8-ounce tuna steaks, 1-inch thick1/8 teaspoon salt1/8 teaspoon pepper\nDirections\nCombine the watermelon, pineapple, lime juice, cilantro and jalapeno in a small bowl and toss gently to combine. Pat excess moisture from the tuna steaks with a paper towel, and rub a few drops of olive or vegetable oil on each side. Season both sides with salt and pepper. On a grill over high heat, place the tuna steaks for 2 to 3 minutes without moving. Rotate the steaks 180 degrees to create crosshatch grill marks and let cook for 1 minute. Flip the tuna steaks and allow to cook for 2 minutes, then repeat the rotation and allow to cook until medium-rare (2 to 3 minutes). If you desire a more well-done steak, reduce the heat to medium low, lower the grill lid, and allow to cook until opaque (3 to 4 minutes). Allow the tuna to rest for 2 to 3 minutes before serving. Top with the salsa and serve with a wedge of lime.\nSource: Dietitians Kitty Broihier and Allison Stowell of Guiding Stars", "url": "https://apnews.com/7b0521147e694c19a4dbaeb718c6dbff"}