{"authors": ["Art Kabelowsky", "Wisconsin State Journal"], "date_download": "2020-05-04 20:10:57", "date_modify": "2020-05-04 20:10:57", "date_publish": "2018-01-06 06:15:00", "description": "Junior Drake Baldwin recorded a hat trick as the Madison West boys hockey team defeated Madison Edgewood 3-2 in a non-conference game on Friday night. Baldwin opened the game with a pair of...", "filename": "_d65045f8fbd147819dd47aaf566061fe_1588623057.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d65045f8fbd147819dd47aaf566061fe_1588623057.html", "title": "Drake Baldwin scores a hat trick to lead Madison West's hockey team past Madison Edgewood", "title_page": "Prep sports: Drake Baldwin scores a hat trick to lead Madison West's hockey team past Madison Edgewood", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Junior Drake Baldwin recorded a hat trick as the Madison West boys hockey team defeated Madison Edgewood 3-2 in a non-conference game on Friday night.\nBaldwin opened the game with a pair of first-period goals, coming just 42 seconds apart.\nThe Crusaders (10-3-1) bounced back as Quinn Friedow put the hosts on the board, and then assisted on a Teddy Kluesner goal with just over two minutes remaining in the second period.\nBut Baldwin put the Regents (8-3-2) back on top with the game-winning goal 10 minutes into the third period.\nAdam Buencamino tallied 29 saves for Madison West.\nJoe Clark and Colin Pulkrabek each had an assist for the Regents.\nVerona 7, Madison La Follette/East 0\nSenior Aidan Schmitt scored a goal and tallied two assists to lead the Wildcats (10-3-2 overall, 7-1-0 Big Eight Conference) over the visiting Lakers (0-13-1, 0-9-0).\nKeegan Lindell had three assists for Verona.\nOregon 10, Milton/Fort Atkinson 0\nThe Panthers (11-2-0 overall, 6-1 Badger South Conference) controlled action from start to finish in a victory over the Red Hawks (2-10-1, 0-5).\nBlack River Falls co-op 5, DeForest co-op 4\nJacob Meek scored two goals and assisted on another as the host Tigers (8-7) defeated the Norskies (2-10).\nTrent Bachman recorded a hat trick for DeForest. Nathan Johnson added a goal and an assist for Black River Falls.\nGirls hockey\nMiddleton co-op 8, Mauston co-op 1\nThe Metro Lynx (5-10, 3-3 Badger Conference) dealt the Badger Lightning (0-8, 0-5) their eighth straight loss in league action at Reedsburg Area Community Arena.\nThe Lightning pulled within 2-1 on Emily Patton’s goal off an assist from Bailey Babcock. But the Metro Lynx scored two more second-period goals and added four in the third.\nBeloit Memorial co-op 6, Onalaska 3\nMaggy Henschler netted four goals and an assist as the visiting Fury (13-2-2) defeated the Hilltoppers (5-7-1). Jaidyn Groshek scored a goal and had an assist for Onalaska.\nAnne Runde and Alyssa Knauf scored for the Fury.\nWrestling\nSauk Prairie 34, Waunakee 30\nAdam Nolden (132 pounds) and Marcus Hankins (195) earned pins as the visiting Eagles beat the Warriors, ranked ninth in Division 1 by WIwrestling.com, in a Badger North Conference dual.\nSam Lorenz (106) and Zachary Marek (160) scored pins for Waunakee.\nBaraboo 53, Portage 6\nBrandon Jesse (120), Jacob Kimpfbeck (195) and Joseph Schick (285) each recorded pins as the host Thunderbirds defeated the Warriors in a Badger North dual.\nFort Atkinson 39, Monona Grove/McFarland 28\nSawyer Brandenburg (106), Draven Sigmund (138) and John Klatt (195) each recorded pins as the host Blackhawks beat the Silver Spartans in a Badger South dual. Reese Barker (220) and Kristian Schlicht (285) each pinned their opponents for Monona Grove/McFarland.\nMadison West 43, Verona 24\nOzzy Romero (152), Harrison Schreiber (160) and Jackson Mozena (182) each earned pins as the host Regents beat the Wildcats in a Big Eight dual.\nBoys swimming\nMiddleton triple dual\nThe host Cardinals, ranked second in the state, took a 137-28 victory over Madison La Follette and a 142-45 win over Verona/Mount Horeb in a Big Eight Conference triple dual.\nThe Wildcats beat La Follette 131-31.\nJanesville Parker triple dual\nState top-ranked Madison West took a 120-50 victory over the host Vikings and a 114-56 victory over Beloit Memorial in a Big Eight Conference triple dual. Also, Beloit Memorial beat Parker, 108-62.", "url": "https://apnews.com/d65045f8fbd147819dd47aaf566061fe"}