{"authors": ["Emily Bamforth"], "date_download": "2020-05-04 20:06:02", "date_modify": "2020-05-04 20:06:02", "date_publish": "2018-01-19 20:36:00", "description": "Akron and eBay partner to give online storefronts, training to local entrepreneurs AKRON, Ohio -- eBay will launch its new online retail training program in Akron, providing online...", "filename": "_865171aad45a4c2a88e4b8f8ec590d74_1588622762.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_865171aad45a4c2a88e4b8f8ec590d74_1588622762.html", "title": "Akron and eBay partner to give online storefronts, training to local entrepreneurs", "title_page": "Akron and eBay partner to give online storefronts, training to local entrepreneurs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Akron and eBay partner to give online storefronts, training to local entrepreneurs\nAKRON, Ohio -- eBay will launch its new online retail training program in Akron, providing online storefronts and advice so that local entrepreneurs can modernize the way they do business.\nLocal small to medium-sized businesses in Akron and Warren can apply for “Retail Revival” until Feb. 9 at 11:59 p.m. The goal is to provide these businesses with not only the means and the training to sell nationally or internationally through eBay storefronts, but also to give them a network where they can share best practices and support one another.\n“We really loved the maker community here in Akron,” said Chris Librie, senior director, of global impact and giving at eBay. “We love to feature businesses ... that have something we know will sell but will also bring a uniqueness to our inventory.”\nTraining is a series of events and webinars focused on selling online. That will cover the basics of running a eBay storefront and best practices in beginning to sell outside of the region. Participants will receive a complimentary eBay storefront subscription.\nBy teaching these local businesses how to distribute their products nationally or internationally and providing them with a complimentary they will have more money to expand.\nEntrepreneurs in the program will also have a dedicated customer service team at eBay.\nWhen the company scouted the country for the best place to start the 12-month program, it was looking for a place with a strong eBay selling community, as well as local support and a diverse community of startups and small businesses.\n“I think it’s a great testimonial to the Greater Akron business climate,” said Rick Rebadow, executive vice president for the Greater Akron Chamber of Commerce.\nHe said the selection is just another story that shows how the region is moving away from its “Rust Belt” moniker. Though Cleveland was skipped as a potential site for Amazon’s HQ2, Columbus and Pittsburgh are still in the running.\n“That’s positive affirmation over and over again,” said Rebadow. “We’re looking to create that visibility and that momentum. This is a great way to advertise that, and the fact that a company such as eBay has the savvy to look at our region says a lot about our region.”\nThere are resources in Akron already for entrepreneurship, including Akron’s Northside Marketplace, a series of local start-up and small business storefronts. This will allow local businesses to expand their customers outside of footfall, Librie said.\n“It’s time we share our exceptional goods and first-class customer service with the rest of the world,” Akron Mayor Dan Horrigan said in a news release. “By introducing our local businesses to eBay’s massive customer base, world-class infrastructure, and global reach, we expect to see significant, organic growth that will enable these businesses to hire new people, open or maintain physical retail spaces, and expand their market share.”\neBay CEO and president Devin Wenig in a column for USA Today wrote that the technology sector should ensure that their products and innovations are helping across the country, not just in tech hubs such as Silicon Valley, Austin and Denver.\n“As technology becomes the central focus of our lives, it’s up to us in the industry and the government to have candid conversations about the role we play in architecting the next industrial revolution. At the end of the day, the U.S. economy is going to be a technology economy. And we should ensure it is inclusive and equitable for all.”\nInterested businesses can fill out an application form here.", "url": "https://apnews.com/865171aad45a4c2a88e4b8f8ec590d74"}