{"authors": ["Dave Gong"], "date_download": "2020-05-04 20:07:04", "date_modify": "2020-05-04 20:07:04", "date_publish": "2018-11-09 05:00:01", "description": "Fort Wayne Mayor Tom Henry on Thursday lauded the efforts of Red River Waste Solutions less than a week into a new trash collection schedule and announced a plan to explore refunds for...", "filename": "_54bc31cf31764a788364d388ce137fd8_1588622824.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_54bc31cf31764a788364d388ce137fd8_1588622824.html", "title": "Henry lauds Red River's efforts", "title_page": "Henry lauds Red River's efforts", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Fort Wayne Mayor Tom Henry on Thursday lauded the efforts of Red River Waste Solutions less than a week into a new trash collection schedule and announced a plan to explore refunds for ratepayers.\n“We know that many residents have experienced challenges over the past several months. The exploration of a measure of appreciation to our customers is the right thing to do. Therefore, I’m asking the working group to explore various options that might be available to provide possible monetary relief to our solid waste ratepayers,” Henry said in a statement. “This discussion will be part of their next meeting that will take place later this month. I’m looking forward to the outcome of the meeting and we’ll keep the public informed of next steps.”\nHenry applauded the efforts of the city’s contractor, which has had trouble since taking over the contract in January with missed collections. Since the new schedule was implemented Monday, misses have been reduced, Henry said, and the city’s 311 call center has had significantly fewer calls reporting issues with garbage collection.\nSince Red River took over the city contract from Republic Services earlier this year, City Council members and 311 operators have been inundated with calls related to missed collections.\nThe firm has been fined several times for misses throughout the summer, despite company officials vowing to improve.\nThe new collection schedule, which city officials say will cut down on the number of problems experienced by ratepayers, went into effect Monday.\ndgong@jg.net", "url": "https://apnews.com/54bc31cf31764a788364d388ce137fd8"}