{"authors": ["Alex N. Press", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Benjamin L. Mckean", "Daniel Lazare", "Nicole Colson", "Stuart Schrader"], "date_download": "2020-05-04 20:00:15", "date_modify": "2020-05-04 20:00:15", "date_publish": "2018-10-29 00:00:00", "description": null, "filename": "2018_10_squirrel-hill-synagogue-shooting-antisemitism-pittsburgh_1588622415.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/10/29135339/GettyImages-1054421316.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_10_squirrel-hill-synagogue-shooting-antisemitism-pittsburgh_1588622415.html", "title": "Doubling Down After Pittsburgh", "title_page": "Doubling Down After Pittsburgh", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "On Saturday morning, I woke up to a text from my brother: “There is an active shooter at the tree of life synagogue in sq hill. Crazy response happening outside.” He lives in Squirrel Hill, near the house where we grew up and not far from the Tree of Life synagogue.\nThat morning, Robert Bowers, a forty-six-year-old white man from Baldwin, a suburb of Pittsburgh, walked into the synagogue during a bris, a celebration of birth, and opened fire. He carried multiple guns and killed eleven people. As he said after he was taken into police custody, he was motivated by a desire to see all Jews die. It is reportedly the deadliest attack on Jewish people in US history.\n“Thirty-eight of your friends have marked themselves safe during The Shooting at Tree of Life Congregation Synagogue, Pittsburgh, Pennsylvania, USA,” Facebook’s dystopian algorithm informed me in a notification. When I clicked through, it also read, ominously, “177 friends not marked safe.”\nThe thing you might not realize about mass shootings is how long the wait for the victims’ names to be released feels. Suddenly, my ignorance about which families went to which congregations was a handicap. In a neighborhood as closely knit as Squirrel Hill, everyone would know someone who was in that temple. I spent the day staring at my phone as friend after friend announced on social media, often awkwardly, uncomfortably, that they were not dead.\n“My parents are okay,” read the statuses. “Thank you for asking. We go to a different synagogue. This is all so sad.”\nMuch of my childhood was spent in Squirrel Hill, and most of my childhood friends are Jewish. About half of Pittsburgh’s Jewish children live in the neighborhood. Our family even joked that we had our own rabbi, though we aren’t Jewish (my dad was raised Jewish, but much to the old neighborhood’s disappointment, he doesn’t practice). “Our” rabbi was the rabbi who lived next door to us, his congregation being one that met at the synagogue on our corner. We were always over for dinners or celebrations or to help with anything they needed on the sabbath. I passed his temple every morning as I walked to Taylor Allderdice, my high school.\nIt’s an uncannily tranquil place, so idyllic that it was literally Mr. Rogers’s neighborhood — he lived a few blocks from the Tree of Life synagogue. Squirrel Hill is middle class, which plays a big role in its reputation, but beyond the neighborhood’s beauty — all parks and hills and quiet — it’s the collectivity of the Jewish community that makes Squirrel Hill such a rarity.\nIn contrast to the pervasive alienation and loneliness of twenty-first-century American life, Squirrel Hill brims with a sense of community. People were always knocking on one another’s doors, inviting strangers into their homes. There was always a bar or bat mitzvah to attend. The Jewish Community Center was a sprawling place with basketball courts and plays and music. Even if I didn’t see my friends at the synagogue, the fact that their families saw each other there infused relations with a warmth I haven’t encountered since I left.\nFor such a place to now become synonymous with death couldn’t be more disorienting. But what’s happening in the aftermath makes a lot more sense. As every dispatch from the neighborhood shows, the Squirrel Hill community is using the tragedy to do what it does best: embrace life. Hour by hour, they’re modeling how all of us should react to a racist attack: refusing to wall themselves off from the rest of the world; embracing those who offer assistance while rejecting the well-wishes of the Right; connecting what happened in Squirrel Hill to attacks on Muslims and African-Americans.\nA vigil organized by Allderdice students on Saturday was attended by thousands of people, all of them standing in the rain at Forbes and Murray, transforming the intersection where I spent so much of my teenage years goofing around with friends into a site of solidarity and solemnity. As David Shribman wrote yesterday, a clock tower with Hebrew letters looks out from above the intersection. I thought of it when looking at the photos of the vigil: there was something comforting in imagining it keeping time on the neighborhood’s longest day.\nSince Saturday, Muslim organizations have raised over $70,000 for the victims and their families. Some of the city’s Jewish leaders wrote a letter to Donald Trump, telling him not to visit the city. A man who has blood on his hands shouldn’t be welcomed to a crime scene he helped create.\nThe remembrances of the dead are pouring in. Jerry Rabinowitz, a doctor who treated HIV-positive patients at the height of the AIDS crisis, holding their hands at a time when so many doctors refused to treat such patients, much less touch them. Cecil and David Rosenthal, brothers, disabled, staples of the congregation. Rose Mallinger, who, at ninety-seven, had been alive during the Holocaust, only to die at the hands of an antisemite in the end. The elderly and the vulnerable, people I might have passed on the sidewalk a million times, become the dead.\nAntisemites, inflamed by the rising white-supremacist movement, do not only hate Jews. The man who attacked Squirrel Hill targeted this congregation because they worked with HIAS, formerly known as the Hebrew Immigrant Aid Society, to assist refugees. As he wrote on Saturday morning before entering the synagogue, HIAS “likes to bring invaders in that kill our people. I can’t sit by and watch my people get slaughtered. Screw your optics, I’m going in.” Deploying an antisemitic conspiracy popular on the right-wing forums he frequented, he equated the work of resettling refugees, of supporting the needy, with invasion. As if “his people” in Baldwin, Pennsylvania, are “getting slaughtered” by refugees.\nNo, he, like the man who last week mailed a dozen bombs to high-profile political figures — including George Soros, another favorite target of the antisemitic right — was inflamed by baseless lies that circulate online and in the mouth of the president, in particular the recent hysteria around a group of asylum-seekers travelling to the US. The Trump administration seems to be setting in motion a standoff between the US military and the migrants, and the fear-mongering about the “caravan” of migrants likely preoccupied Bowers as he prepared to commit a massacre against these Jews, in particular, who recognized the responsibility of the oppressed to work in solidarity with one another.\nAs Alex Kane recently wrote, “most Jews recognize that when minorities are targeted by a white-supremacist friendly administration, it’s not only right to fight back; it’s an imperative because we know Jews will be next.” The response to this shooting must be to double down on that conclusion.\nThat’s the only hope that can come from this tragedy: the hope for a sharpening of perspective, a recognition that no one can be safe and free if anyone else is not. Jewish people, Muslims, LGBTQ people, women, people of color, the poor, the Left — those who hate us group us all together. And rightfully so. Anyone who defends the vulnerable is a threat to the forces of repression. Our interests are tied up with one another: so long as one group is targeted, the rest of us will suffer, too.\nLast week also saw a white man kill two black people in Kentucky, telling a white bystander who tried to intervene that “Whites don’t shoot whites.” He did so only after failing to enter a black church nearby, a reprise of the 2015 murder of nine black people in a Charleston, South Carolina church. The Charleston shooting, in a church as historic in its community as a Squirrel Hill synagogue is for American Jews, should impress upon everyone why Jewish people and African-Americans have a storied history of organizing together, and how pressing it is to rebuild those sometimes-frayed ties.\nThose pushing racist policies; those closing, rather than opening, our country’s borders; those rolling back women’s right to reproductive freedom; those defending state-backed Islamophobia; they are our common enemies. No politician would endorse the actions of a Robert Bowers, but they know the impact their words and policies have on those like him who, eventually, will take them seriously and begin killing their neighbors. It’s not a question of “if” anymore — it’s when and where.\nOpportunists will now use Pittsburgh’s suffering to push an even more reactionary agenda. Trump, the man behind the startlingly backward idea that more guns at the synagogue could’ve stopped the massacre, is threatening to come to town. So are particularly indefensible representatives of Netanyahu’s Israel, a regime that gladly works with antisemites when it suits their interests.\nIt would all be more than enough to feel crushed. But Squirrel Hill residents themselves aren’t. It comes as no surprise that many are already articulating a political response, calling for “an end to the scapegoating of immigrants and a reduction of guns” and rejecting Trump’s condolences. The shooter succeeded in killing people, yes, but the community he targeted has refused to become debilitated in their grief. The world beyond Squirrel Hill shouldn’t, either.", "url": "https://www.jacobinmag.com/2018/10/squirrel-hill-synagogue-shooting-antisemitism-pittsburgh"}