{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:16:14", "date_modify": "2020-05-04 20:16:14", "date_publish": "2018-08-04 05:00:00", "description": "Bank of the Valley is proud to announce and welcome Aaron Luneke as the Bank’s Chief Financial Officer. Luneke will be responsible for the leadership and management of the Bank’s financial,...", "filename": "_f0c8a42339af410d95569e97b65f0719_1588623374.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f0c8a42339af410d95569e97b65f0719_1588623374.html", "title": "Bank of the Valley welcomes Chief Financial Officer", "title_page": "Bank of the Valley welcomes Chief Financial Officer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Bank of the Valley is proud to announce and welcome Aaron Luneke as the Bank’s Chief Financial Officer. Luneke will be responsible for the leadership and management of the Bank’s financial, accounting, budgeting/forecasting and asset liability functions.\nHe joins Bank of the Valley from Foundation One Bank in Omaha, NE, where he previously served as Chief Financial Officer and VP of Finance. During his time there he served on the Executive Team, leading initiatives that included accounting functions, call reports, budgets, human resources, and Bank investment process components. Aaron earned his Bachelor’s Degree from UNO in Finance & Banking, further complimented with an MBA from Midland University.\n“Omaha has blessed me with ample opportunities and great leaders who have selflessly mentored me,” says Luneke. “My 10 year banking career has allowed me to hone a solid work ethic, personal values, and multiply these abilities into tangible value for the community. The positive impact from a well-managed Financial Institution has a profound impact on the families and community that are supported by it. This is why I absolutely love everything about banking. My passion for banking is second only to my family.”\nLuneke joined the Bank of the Valley team on July 9th, and is based in the Columbus Branch location.\nBank of the Valley is a Community Bank that offers a full range of personal, agricultural, and business banking services. As a community bank, we have a personal interest in the people and communities in which we live and work. Since opening our doors in 1983, we have grown from one location to five, with branches in Bellwood, David City, Platte Center, Columbus and Humphrey.\nWe believe in relationships because knowing our customers helps our experienced team deliver the best solutions. We believe in making decisions right here where their impact will be felt. We believe needs and goals change, and so must our services and solutions – sometimes on the spot. Together we go further. It’s how we approach each day and each customer. It’s how we continue to better serve our customers and our community.\nBank of the Valley is a Member FDIC, Equal Housing Lender", "url": "https://apnews.com/f0c8a42339af410d95569e97b65f0719"}