{"authors": ["Brandon Stone"], "date_download": "2020-05-04 20:10:44", "date_modify": "2020-05-04 20:10:44", "date_publish": "2018-03-02 15:00:00", "description": "SEDRO-WOOLLEY — PeaceHealth United General Medical Center debuted Wednesday a new resource room at its cancer center. Char’s Room is named in honor of Charlene “Char” Ovenell, a member of...", "filename": "_4ac6ba874242484badef6d19ac815d83_1588623044.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4ac6ba874242484badef6d19ac815d83_1588623044.html", "title": "Hospital unveils cancer resource room", "title_page": "Hospital unveils cancer resource room", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEDRO-WOOLLEY — PeaceHealth United General Medical Center debuted Wednesday a new resource room at its cancer center.\nChar’s Room is named in honor of Charlene “Char” Ovenell, a member of the United General Auxiliary fundraising group who died in 2014 after a battle with breast cancer.\n“It was her dream to do something like this,” her husband Jim Ovenell said at a ribbon-cutting ceremony Wednesday. “She always wanted to help other people.”\nThe resource room will serve as a way for patients of the hospital’s North Puget Cancer Center to get information about their diagnosis and what they can do to cope, said Chris Johnston, the hospital’s chief administrative officer.\n“There’s a lot here about how to deal with a terminal diagnosis,” Johnston said. “(The room) is another avenue for us to say ‘Hey, we’re here to help.’”\nWhen patients are facing a potentially terminal diagnosis, he said, they’re often overwhelmed and don’t know what information they can trust.\nThe books, pamphlets and other information in the resource center are vetted by staff and available for patients to keep, Johnston said.\n“They’ve got a lot of other things going on,” he said. “They don’t need to worry about taking their $15 book back.”\nBrenda Sem, a longtime friend of Char Ovenell and member of the auxiliary, helped organize the fundraisers to pay for the resource room.\n“I’ve never taken on such a rewarding project,” she said. “My heart is full with what comes out of her friends and our community to support her vision.”", "url": "https://apnews.com/4ac6ba874242484badef6d19ac815d83"}