{"authors": ["Chris Higgins"], "date_download": "2020-05-04 20:14:11", "date_modify": "2020-05-04 20:14:11", "date_publish": "2018-03-08 14:30:00", "description": "Water levels on Beaver Dam Lake could change after city officials asked the Wisconsin Department of Natural Resources to change the order guiding operation of the dam in Cotton Mill Park. At...", "filename": "_6bd4f74cd64746eabb4629435ac95f51_1588623251.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6bd4f74cd64746eabb4629435ac95f51_1588623251.html", "title": "Beaver Dam Common Council moves on lake level", "title_page": "Beaver Dam Common Council moves on lake level", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Water levels on Beaver Dam Lake could change after city officials asked the Wisconsin Department of Natural Resources to change the order guiding operation of the dam in Cotton Mill Park.\nAt its Monday meeting, the Beaver Dam Common Council approved a resolution to ask the state Department of Natural Resources to consider adjusting its order controlling the water flow of the downtown dam and, as a result, the water level of the lake.\nThe city proposes to lower the lake from its current level in the fall and winter while raising it from its current level in the spring and summer.\nMayor Becky Glewen said discussions about changing the lake level started after a construction project on Cooper Street that required the water level to be lowered which resulted in several thousand fish dying below the dam. Although that was an intentional change, the water does also change naturally with the seasons as well and can impact the environment and animals.\n“Can we prevent this from happening in the future?” Glewen said. “We want the health of the ecosystem to be OK in the future.”\nAccording to city documents, the changes would also intend to better follow natural rainfall. The goal would be to improve animal habitats, reduce shoreline and wetland loss, and maintain recreational opportunities.\nAdjusting the lake level is also intended to reduce ice damage to properties and homes along the lake in the winter.\nThe proposal comes about two years of data collection with programs at the University of Wisconsin. The UW Hygiene Laboratory performed an analysis.\nInitial findings were then presented at public hearings before the final request the council approved.\nThe dam order was last changed in 2004, a contentious process that took years of divisive public hearings and debate that even led to personal threats against some of those involved.\nGlewen said the DNR is “very positive” about the idea. There will be more public hearings about the proposed changes.", "url": "https://apnews.com/6bd4f74cd64746eabb4629435ac95f51"}