{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:10:01", "date_modify": "2020-05-04 20:10:01", "date_publish": "2018-07-24 12:03:00", "description": "The hunt for a man police say killed an 18-year-old woman in an unprovoked knife attack in the San Francisco Bay Area ended where it began: In a train station. John Cowell, 27, a...", "filename": "_ae8ceb329b94499ebe3f306ec002a574_1588623001.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ae8ceb329b94499ebe3f306ec002a574_1588623001.html", "title": "Man arrested in deadly knife attack at California train station", "title_page": "Man arrested in deadly knife attack at California train station", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The hunt for a man police say killed an 18-year-old woman in an unprovoked knife attack in the San Francisco Bay Area ended where it began: In a train station.\nJohn Cowell, 27, a recently paroled robber with a violent history, was peacefully arrested on a train Monday night about a dozen miles from the Oakland station where investigators believe he killed Nia Wilson and wounded her sister Sunday night.\n“This is the first step to achieving justice for Nia and her family,” Bay Area Rapid Transit Police Chief Carlos Rojas said at a news conference.\nA phone call from a BART rider led police to stop and search a Richmond-bound train at the MacArthur Station in Oakland but Cowell wasn’t aboard, Rojas said.\n“About 10 minutes later after we got the call, another patron told us the subject got on an Antioch-bound train,” Rojas said.\nThat train was stopped at the Pleasant Hill station in Walnut Park, northeast of Oakland. Cowell was on board and was arrested without incident. It wasn’t immediately known if Cowell had a lawyer.\nAsked how a wanted man could have gotten back into the BART system, Rojas said he didn’t immediately know but said the public transportation system is “porous” and large.\nRojas said police officers were on duty at the MacArthur station where the attack took place but wasn’t sure it could have been prevented because of the suddenness of the unprovoked and possibly random attack.\nIn a “prison-style attack,” Cowell stabbed Nia Wilson twice in the neck and then attacked her sister before fleeing and apparently doffing his pants and sweatshirt to evade capture, Rojas said. The knife believed to have been used in the attack was found at a nearby construction site.\nLetifah Wilson, 26, said that she, Nia and a third sister had been returning from a family outing when they were “blindsided by a maniac.”\n“He didn’t know us, we didn’t know him,” Wilson said.\n“I looked back and he was wiping off his knife and stood at the stairs and just looked. From then on, I was caring for my sister,” she told ABC7 News on Monday, speaking outside a family member’s home with a bandage on her neck.\nThe women’s father, Ansar Muhammad, said one of his daughters called him, crying hysterically, and told him to get to the MacArthur station.\n“It’s nothing imaginable, seeing your child on the BART platform with a yellow tarp over her body,” Muhammad said Monday evening. “That is an image I’ll never forget for the rest of my life. So I want justice. All I want is justice.”\nSurveillance video on the train and at the station’s platform showed Cowell had been riding the same car as the sisters Sunday, but they did not interact, Rojas said.\nA motive for the attack remained unclear. The victims were black and Cowell is white.", "url": "https://apnews.com/ae8ceb329b94499ebe3f306ec002a574"}