{"authors": ["Molly Smith", "Staff Writer"], "date_download": "2020-05-04 20:14:54", "date_modify": "2020-05-04 20:14:54", "date_publish": "2018-10-31 16:04:00", "description": "Hidalgo Police Chief Rudy Espinoza has been suspended, Mayor Pro-Tem Gustavo “Gus” Sanchez confirmed Tuesday. The decision was made in executive session during the Oct. 15 city council...", "filename": "_a2130eb0feb8407db977fe00b40140d0_1588623294.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a2130eb0feb8407db977fe00b40140d0_1588623294.html", "title": "Hidalgo police chief suspended; reasons unclear", "title_page": "Hidalgo police chief suspended; reasons unclear", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Hidalgo Police Chief Rudy Espinoza has been suspended, Mayor Pro-Tem Gustavo “Gus” Sanchez confirmed Tuesday.\nThe decision was made in executive session during the Oct. 15 city council meeting, and city personnel attempted to keep the decision under wraps over the past two weeks.\nAfter failing to return multiple requests for comment, Hidalgo City Manager Julian Gonzalez, through City Secretary Denise Elliff, told The Monitor on Oct. 23 that he was not ready to comment at the moment, but would call as soon as he knew something, this despite Gonzalez being present at the meeting.\nCity Attorney Ricardo Perez also failed to return multiple calls requesting comment, as did Mayor Sergio Coronado.\nSanchez cited the fact the decision was made in executive session as to why he couldn’t discuss it further, saying, “It wasn’t a decision that we made; it was more just something that came up based on the city manager.”\nEspinoza has served as police chief since 2012. An attempt to reach him for comment Tuesday was unsuccessful.\nThe city of Hidalgo has provided no information as to the terms of the suspension.\nLt. Jesus Ortega has been named interim police chief, according to a police dispatcher.\nmsmith@themonitor.com", "url": "https://apnews.com/a2130eb0feb8407db977fe00b40140d0"}