{"authors": ["Marc Bona"], "date_download": "2020-05-04 20:31:58", "date_modify": "2020-05-04 20:31:58", "date_publish": "2018-07-25 11:32:03", "description": "Irishtown Bend Red Ale to be released for local greenspace efforts CLEVELAND, Ohio – Market Garden Brewery is planning to release Irishtown Bend Red Ale on Friday, Aug. 3. A $1 from...", "filename": "_23a47922443345a8b0447cccdf51a4a2_1588624318.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_23a47922443345a8b0447cccdf51a4a2_1588624318.html", "title": "Irishtown Bend Red Ale to be released for local greenspace efforts", "title_page": "Irishtown Bend Red Ale to be released for local greenspace efforts", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Irishtown Bend Red Ale to be released for local greenspace efforts\nCLEVELAND, Ohio – Market Garden Brewery is planning to release Irishtown Bend Red Ale on Friday, Aug. 3.\nA $1 from every glass sold will support what Sam McNulty calls the “transformative new greenspace in Ohio City that will be enjoyed by Clevelanders from all walks of life.”\nThe ale’s name is an historic homage to the shanty-town area on the West Bank of the Cuyahoga River in Ohio City in the early 1800s.\nMcNulty, one of the owners of Market Garden, bills the brew as having notes of rich caramel and toasted malts that lead to a smooth finish. It’s 5.8 percent alcohol.\nOhio City Inc., LAND studio and the Port of Cleveland have teamed to refigure the area into an urban park . NOACA, the Northeast Ohio Areawide Coordinating Agency, provided funding.\nMcNulty is a proud Clevelander who will champion the region’s history and heritage both vocally and in beer names. Market Garden also brought us Danny Greene Enforcer Imperial Stout, the name coming from one of Cleveland’s most notorious gangsters. He was killed in 1977; the 2011 movie “Kill the Irishman” details Greene’s life. The brewery’s St. Emeric’s Stout is named after a nearby church, and Guardian Hoppy Amber takes its name from the sentries on the Lorain-Carnegie bridge.\nMore coverage on Irishtown Bend: The Plain Dealer’s Steven Litt has a story about the potential transformation of the weed-infested wasteland.", "url": "https://apnews.com/23a47922443345a8b0447cccdf51a4a2"}