{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:07:19", "date_modify": "2020-05-04 20:07:19", "date_publish": "2018-04-17 07:30:47", "description": "Sometimes, nurturing what you have provides a far greater reward than seeking out some shiny new object. That notion is at play for the Huntington Area Development Council, or HADCO, the...", "filename": "_1f842ff4e0224893a041fb9041086f05_1588622839.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1f842ff4e0224893a041fb9041086f05_1588622839.html", "title": "Development agency on right course to help region", "title_page": "Development agency on right course to help region", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sometimes, nurturing what you have provides a far greater reward than seeking out some shiny new object.\nThat notion is at play for the Huntington Area Development Council, or HADCO, the economic development agency which aims to grow the number of jobs in the region. It recently announced an increased emphasis on its efforts to retain businesses already in the area and helping them expand wherever possible.\nBasically, HADCO officials feel that enhanced effort will yield more success than trying to attract new employers to the Tri-State. And the data on job creation backs them up.\nIt’s not that the organization isn’t still trying to draw new business, but that’s a daunting challenge that often pays no dividends. “HADCO’s colleagues in the Advantage Valley region all agree that business attraction is a challenging process that takes time to be successful and requires a significant budget commitment to support the effort over time,” HADCO President and CEO David Lieving told The Herald-Dispatch’s business reporter, Fred Pace, for an article published last week. “Helping to grow our existing business base is the quickest and most economical way we can impact our local economy.”\nToward that end, HADCO recently added to its corps Adam Phillips as a business development specialist. The mission for Phillips, formerly with the Southern Ohio Port Authority, is to help companies solve problems and team them up with other resources to help them be competitive. His addition to HADCO is part of larger business retention and expansion program managed by Advantage Valley, a regional economic development marketing entity encompassing the Interstate 64 corridor from Huntington to Charleston.\nThe new focus makes sense. The U.S. Small Business Administration and the Bureau of Labor Statistics estimate that 60 percent to two-thirds of net new private-sector jobs are generated by existing businesses rather than new or start-up companies. The Bureau of Labor Statistics also reports that over the past two decades, more than 85 percent of total job gains were attributable to existing businesses.\nHelping local businesses survive and grow actually could be helpful in attracting new businesses and create the environment for new enterprises to spring up in the region, according to Phillips. ”... the best possible tool for attracting new investment into our community is a diverse and growing local economy,” Phillips said.\nOf course, HADCO does not provide assistance by itself. It has developed partnerships with various local organizations, who stand ready to offer their help to local businesses, including new entrepreneurs. Among them are Marshall University, West Virginia Small Business Development Center, Unlimited Future Inc. and the Robert C. Byrd Institute.\nThe technical assistance provided by HADCO and its partners is free and available to all manufacturers and other companies in the Cabell County and Wayne County area, Lieving said.\nSo, any businesses or would-be entrepreneurs in the region who believe they could use a helping hand to position themselves for more success should take advantage of this newly available assistance. Doing so is a simple as contacting Phillips by phone at 304-525-1161 or by email at aphillips@hadco.org.\nBuilding up existing businesses can make the whole region stronger economically.\n“Helping to grow our existing business base is the quickest and most economical way we can impact our local economy.”\nDavid Lieving\nHADCO president and CEO", "url": "https://apnews.com/1f842ff4e0224893a041fb9041086f05"}