{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:24:32", "date_modify": "2020-05-04 20:24:32", "date_publish": "2018-12-14 08:15:00", "description": "Dear Dr. Roach: I have allergies and am congested a lot at night. I have read about over-the-counter clips and adhesive tapes. Would they help me breathe better? Are they safe for the long term? —...", "filename": "_89be1508a3ea4f9c9b285f9961162783_1588623872.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_89be1508a3ea4f9c9b285f9961162783_1588623872.html", "title": "Dr. Keith Roach: Considering nose strips, other nighttime congestion remedies", "title_page": "Dr. Keith Roach: Considering nose strips, other nighttime congestion remedies", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dear Dr. Roach: I have allergies and am congested a lot at night. I have read about over-the-counter clips and adhesive tapes. Would they help me breathe better? Are they safe for the long term? — M.V.M.\nAnswer: There are many different types of external devices that are designed to open the nasal passages during sleep to make breathing easier. Some of them are more like adhesive tape; others are inserted into the nostrils. They are marketed both for nighttime use and to improve sports performance.\nA few years ago, a comprehensive review of studies on safety and effectiveness on these types of devices was published showing modest effectiveness, with as much as 75 percent improvement in symptoms. However, reviews at an online retailer were decidedly mixed. I believe that a person’s individual anatomy may be suited to only a particular type of device, or perhaps none at all. Fortunately, these devices are relatively inexpensive and safe, and may have significant benefit, so it may be worth a try. They almost certainly are safer than prescription or even over-the-counter medication.\nDear Dr. Roach: I am a 79-year-old woman, recently diagnosed with fatty liver. When I asked what to do about it, I was told to eat more fiber. No one gave me a suggested eating plan to help me do this. My present weight is 221 pounds, and I am 5 feet, 5 inches tall. I take oxcarbazepine for epilepsy and amlodipine for high blood pressure. I was never a drinker, just an occasional drink on a special occasion. Otherwise I am an active senior. I am not opposed to doing something natural instead of getting another prescription drug, unless that’s the only way to go. — J.M.\nAnswer: Fatty liver, in people who do not drink excess alcohol, is a spectrum of disease. It ranges from mild enlargement of liver with fat (usually in association with being overweight, and called “non-alcoholic fatty liver disease”) to inflammation of the liver (nonalcoholic steatohepatitis). This last can lead to fibrosis of the liver and eventually cirrhosis.\nThe best treatment for NAFLD is a change in diet. Fiber certainly is one important component, but it’s disheartening to me that you didn’t get even a basic discussion of what your diet should be. The optimal diet for someone with NAFLD is similar to that for a person with diabetes, and any registered dietician nutritionist would be able to help you with that.\nStaying active while making some changes in your diet can help you lose a few pounds. Oxcarbazepine can make people gain weight. The next time you see your neurologist, you might ask about an alternative, if possible. I also would recommend complete abstinence from alcohol (although a rare drink is unlikely to cause much harm).\nJust changing your diet will help, but usually weight loss is necessary to reverse the fatty liver. Some experts in this condition prescribe drugs to promote weight loss or even consider bariatric surgery (though not normally to someone in your age). However, most people are able to make significant improvement without resorting to these therapies.\nVitamin E sometimes is used in people who already have some fibrosis in the liver (which is on the pathway toward cirrhosis). The evidence in favor of use is not compelling, but vitamin E is generally considered safe.", "url": "https://apnews.com/89be1508a3ea4f9c9b285f9961162783"}