{"authors": ["Raun Kopp", "Special To Cleveland.Com"], "date_download": "2020-05-04 20:21:19", "date_modify": "2020-05-04 20:21:19", "date_publish": "2018-12-06 15:15:58", "description": "Meet Dudley the chinchilla: Send us your pet rescue stories BRUNSWICK, Ohio -- My special pet is Dudley, a chinchilla. I have had three before him. He is about 6 months old, and could live...", "filename": "_b0d39f5027254412a95384f67ae2c76e_1588623679.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b0d39f5027254412a95384f67ae2c76e_1588623679.html", "title": "Meet Dudley the chinchilla: Send us your pet rescue stories", "title_page": "Meet Dudley the chinchilla: Send us your pet rescue stories", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Meet Dudley the chinchilla: Send us your pet rescue stories\nBRUNSWICK, Ohio -- My special pet is Dudley, a chinchilla. I have had three before him. He is about 6 months old, and could live between seven and 12 years.\nWe got Dudley in June after our last chinchilla passed away. He was very similar in color and only about 3 months old then, which is perfect for bonding and training. We have had chinchillas as pets for many years, and I think they make a good pet. They will bond and like to be held, but only on their terms and schedule. They are sensitive and probably not a good pet for younger kids.\nThey are smart and like to interact with humans. We love how soft they are, too.\nDudley likes to come out each day to be held and to run around. He also needs a cage big enough to run and jump in.\nChinchillas make great pets, but do require some special care, including their diet of hays and pellets. They also need sticks and wood to chew, because their teeth are always growing and need to be sheared down by chewing, like other rodents such as hamsters and gerbils.\nChinchillas like Dudley also need and love to take “dust baths.” About every two days, Dudley needs to dry out his fur and body. He does this in a little plastic house filled with special dust. He rolls around and spins in it for about five minutes. It’s a riot to watch, and a must for his health.\nRaun Kopp,\nBrunswick\nDo you share your life with an animal that is near and dear to you? Tell us something about your pet - all species are welcome - and send along a photo of the two of you. Be sure to tell us which Greater Cleveland community you live in. Send everything to Ann Norman at anorman@cleveland.com.", "url": "https://apnews.com/b0d39f5027254412a95384f67ae2c76e"}