{"authors": ["Joey Guerra"], "date_download": "2020-05-04 21:06:19", "date_modify": "2020-05-04 21:06:19", "date_publish": "2018-01-30 19:39:43", "description": "Garth Brooks is as big as it gets for RodeoHouston. He's one of the best-selling artists of all time. He's known for his high-energy live shows. And he never does anything small. He'll open...", "filename": "_eedc2de76b9c4a56945804638dacfd4f_1588626379.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eedc2de76b9c4a56945804638dacfd4f_1588626379.html", "title": "A few things to know about Garth Brooks, who will open and close RodeoHouston", "title_page": "A few things to know about Garth Brooks, who will open and close RodeoHouston", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A few things to know about Garth Brooks, who will open and close RodeoHouston\nGarth Brooks is as big as it gets for RodeoHouston.\nHe’s one of the best-selling artists of all time. He’s known for his high-energy live shows. And he never does anything small. He’ll open and close this year’s RodeoHouston concert series.\nBrooks released his first album in 1989, scoring hits with “Much Too Young (To Feel This Damn Old),” “If Tomorrow Never Comes,” “Not Counting You” and “The Dance.” It set the stage for a run of albums and songs that quickly established him as as country-pop crossover titan.\nSeven of Brooks’ albums have achieved diamond status, signifying sales of 10 million copies each. He’s the only artist in history to accomplish that feat. Yes, he’s had a couple of missteps - Chris Gaines, his fictional rock star persona, and GhostTunes, his online music store and digital library - but, hey, even superstars are allowed a few mistakes.\nBrooks has headlined a Las Vegas residency and has been a staunch supporter of LGBT rights. In 2005, he married fellow country star Trisha Yeawood, a frequent touring partner. His last local shows were a run of eight dates in 2015 at Toyota Center. Expect him to pack just as much energy into this year’s pair of RodeoHouston performances.", "url": "https://apnews.com/eedc2de76b9c4a56945804638dacfd4f"}