{"authors": [], "date_download": "2020-05-04 20:08:34", "date_modify": "2020-05-04 20:08:34", "date_publish": "2018-10-29 00:00:00", "description": "The Wyoming Valley Interfaith Council will hold its annual Citation of Distinction Award luncheon at noon Monday, Nov. 5, at Genetti Hotel and Conference Center, 77 E. Market St., Wilkes-Barre....", "filename": "_acbc8ef0bffd40e4b468d8be25a0cd41_1588622914.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_acbc8ef0bffd40e4b468d8be25a0cd41_1588622914.html", "title": "W.V. Interfaith Council To Honor Rabbi Larry Kaplan", "title_page": "W.V. Interfaith Council To Honor Rabbi Larry Kaplan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Wyoming Valley Interfaith Council will hold its annual Citation of Distinction Award luncheon at noon Monday, Nov. 5, at Genetti Hotel and Conference Center, 77 E. Market St., Wilkes-Barre. This year’s honoree will be Rabbi Larry Kaplan. Kaplan is a native of Philadelphia and was active as a teenager in USY and Camp Ramah in the Poconos. His first encounter with Temple Israel in Wilkes-Barre was in the summer of 1972 when a busload of campers joined their friend (now Rabbi) Charles Popky in helping in the aftermath of Hurricane Agnes. Kaplan received his BA in Judaic Studies from Brandeis University and his Master’s and Rabbinic Ordination at the Jewish Theological Seminary of America in 1987. He has served pulpits in Hartford and Miami before coming to Wilkes-Barre. Kaplan sits on the boards of many local organizations, including the Interfaith Council, The Downtown Ministerium, Ruth’s Place, Step By Step, the Jewish Community Alliance, and is past chair of the advisory board of Luzerne County Children and Youth Services. Kaplan studied under the tutelage of the late Monsignor Andrew J. McGowan, to learn how to be master of ceremonies and give invocations at community events, including the annual dinners of the Luzerne Foundation, Association of the Blind, and Leadership Wilkes-Barre. He has taught Jewish History at Wyoming Seminary and teaches Old Testament at King’s College and World Religions at Misericordia University. He serves as the Jewish chaplain at the Wilkes-Barre VA Hospital and is an instructor for the Substance Abuse Residential Rehabilitation Treatment Program there. He has served as chaplain at the Dallas State Correctional Institution. He leads an interfaith trip to Israel every other year and teaches adult education programs at the Jewish Community Center, and often lectures at community venues including the Elder Issues Coalition and Leadership Wilkes-Barre. He has been serving Temple Israel since 1998. He is the rabbi of Temple Israel in Wilkes-Barre. He and his wife, Gerri, are the parents of 12 ranging from mid-30s to 4, plus a 2-year-old granddaughter. Seven have been adopted through foster care. The “Citation of Distinction” of the Wyoming Valley Interfaith Council is conferred annually upon individuals who are recognized as leaders within the community for exemplifying the high ideals of human dignity, compassion, and friendship for all people.", "url": "https://apnews.com/acbc8ef0bffd40e4b468d8be25a0cd41"}