{"authors": ["Justin Madden"], "date_download": "2020-05-04 20:19:33", "date_modify": "2020-05-04 20:19:33", "date_publish": "2018-05-11 21:07:37", "description": "Police called to Cleveland Heights restaurant after brunch dispute CLEVELAND HEIGHTS, Ohio — Cleveland Heights police were called last weekend to a popular restaurant following a brunch...", "filename": "_88e0ae967ae24aeda6799146c9b2d0f6_1588623573.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_88e0ae967ae24aeda6799146c9b2d0f6_1588623573.html", "title": "Police called to Cleveland Heights restaurant after brunch dispute", "title_page": "Police called to Cleveland Heights restaurant after brunch dispute", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Police called to Cleveland Heights restaurant after brunch dispute\nCLEVELAND HEIGHTS, Ohio — Cleveland Heights police were called last weekend to a popular restaurant following a brunch dispute between three customers and the restaurant’s management.\nBetty Cowans, Meagan Coggins and their friend, Caleb Wright, were celebrating Cowans’ birthday Sunday afternoon at Lopez Southwest in the East Side suburb when they were forced to leave after a verbal disagreement with the restaurant’s management over service.\nThe friends said they were incorrectly described as being belligerent and intoxicated to police after they questioned the service of the restaurant. Cowans and Coggins said the incident is far too common and is reflective of the current political climate and highlights the dangers black people have in America where they are susceptible to prejudices, actions and speech that are anti-black.\nCowans, Coggins and Wright are all black, 27 years old and grew up in Cleveland Heights.\n“We were literally asking the management a question for a service we paid for and it led to the police being called on us,” Cowans said during a telephone interview with a Cleveland.com reporter. “I have never in my life been that humiliated and I never thought that would happen somewhere I grew up.”\nThe owner of Lopez Southwest, Michael Herschman, said Sunday’s incident was not a case of discrimination and police were called because one of the women started demanding a personal telephone number from an employee. He added the group was provided service after the brunch concluded and once their check was paid their restaurant experience was over.\n“Just the accusation of some type of racial element that preceded what happened regarding the end of their service is what none of us, the Lopez family, understands because nobody has brought up what that discriminatory element is,” Herschman said.\nThe women went to the restaurant between 1:45 p.m. and 2:30 p.m. and were seated in the patio. They ordered bottomless mimosas from the brunch menu for $20 after it was suggested by their waitress, the women said. They were told to order before 3 p.m. if they wanted to eat brunch because the menu was switching over to dinner.\nWright, a local musician, joined the women a half-hour later and also ordered food and a beverage. He wrote about his experience at the restaurant in a lengthy Facebook post that has been shared numerous times and received several dozen reactions.\nLopez serves brunch from 11 a.m. to 2 p.m., according to its website.\nThe group was told by their waitress that her shift was ending and if they could cash out before her departure. They willfully obliged with the waitress’s request, and was told another server would take care of them.\nCowans and Coggins said they asked for a second round of drinks and the waitress brought it to them. After getting their drinks, the waitress said it would be their last round because they had paid their check already. The women said they were not originally told about the policy by their original waiter.\nThe waitress called a manager who told the women that since they had already cashed out they couldn’t get another drink. The manager later gave in and brought one drink to the two women. He soon asked the three people to leave because they were intoxicated, belligerent and loud, Cowans, Coggins and Wright said.\nThe women shared a short video of the incident that captured the women asking a man why they had to leave. The man said he spoke to the owner over the phone and requested the three to leave because he was concerned about their alcohol consumption.\nCowans and Coggins, who work as educators, both asked to speak with the owner but was told they would need to call him.\nThe man in the video told them they needed to leave or police would be called because of trespassing. The group said go ahead.\n“It seems to be an ongoing and growing pattern that police are called on people of color by white people consistently because of almost a learned fear that they have and issues that they have within themselves and biases they have,” Coggins said. “All the things they were saying that we were, maybe that’s how they perceive me to be. But that’s not how we were. We did not present ourselves in a hostile or angry way. Maybe a little irritated, because we paid for something we weren’t getting.”\nCleveland Heights police said they received a call Sunday at 4:57 p.m. There was no police report taken or 911 calls available, police said. The call was logged as three unruly guests who were refusing to leave.\nHerschman and his public relations manager, Richard Stewart, said police were called because Coggins was aggressive and combative with the hostess when she asked for the owner’s telephone number. The hostess told restaurant management she felt threatened, according to Stewart.\nStewart said the group arrived at the restaurant at 2:30 p.m. and was accommodated with brunch as a courtesy, but had “overstayed their welcome” after sitting at the eatery for two hours and 15 minutes and became combative when they were asked to leave.\nCoggins denied the allegations and said the hostess was smiling during their interaction while they spoke with inside voices.\nThe group said officers were polite and escorted them out of the restaurant and apologized for the incident but felt it was easier for the parties to split. The women offered to give a breathalyzer test to police after they were accused of being drunk.\nThe group got in their vehicles and drove away from the restaurant.\nCowan and Wright met with Herschman Tuesday in an attempt to settle the matter. Coggins was unable to be at the meeting due to work.\nHerschman, who said his restaurant employs and attracts a diverse group of people and does not tolerate discrimination in his business, offered an apology and said the situation was handled poorly.\n“We both had misunderstandings about how the events culminated,” he wrote in an email. “I surely understood and respected their position, as we agreed to start afresh. I truly am heartfelt the guests felt how they did and it truly does not reflect the Lopez experience and wish them the best whereas they seem to be sweet and kind people and what escalated should have never occurred.”\nCowans said Herschman’s apology was appreciated but calling it a misunderstanding does not provide accountability for the way she, Coggins and Wright were treated. She added Herschman may not have meant any intent but it happened and it’s unfortunate.\n“It sucks because none of it was true and it was completely and totally uncalled for,” Cowans said. “It’s just getting frustrating because we can’t do anything in this country. We can’t mind our own business, we can’t wear a hoodie, we can’t stand in our grandmother’s backyard, we can’t play with toys at a park and now we can’t ask questions for a service we paid for. It’s really unfortunate.”\nTo comment on this story, visit Friday’s crime and courts comments page.", "url": "https://apnews.com/88e0ae967ae24aeda6799146c9b2d0f6"}