{"authors": ["Elliott Lapin"], "date_download": "2020-05-04 20:27:41", "date_modify": "2020-05-04 20:27:41", "date_publish": "2018-10-01 05:00:00", "description": "The Hargrave Falcons had two drives that began inside of the Concordia Lutheran Crusader 35-yard line. They came away empty both times. The inability to capitalize on great field position...", "filename": "_26e5ea713032414f929c7d91caa2dec7_1588624061.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_26e5ea713032414f929c7d91caa2dec7_1588624061.html", "title": "Notebook: Missed opportunities doom Hargrave", "title_page": "Notebook: Missed opportunities doom Hargrave", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Hargrave Falcons had two drives that began inside of the Concordia Lutheran Crusader 35-yard line. They came away empty both times.\nThe inability to capitalize on great field position and a few big plays that the Falcons gave up on defense, resulted in a 29-12 loss to the Crusaders on Friday night Sept. 28 at Falcon Stadium.\nThings looked promising early for Hargrave as an 18-yard touchdown pass from junior Justin Shively to junior Garrett Halbrooks capped a game opening 67-yard scoring drive. Freshman Luis Garcia missed the PAT kick.\nLater in the first quarter, the Falcon defense forced a three-and-out deep in Crusader territory. A high snap sailed over the punter’s head and rolled into the end zone, but the punter was able to pick up the ball and get a short punt off.\nThe Hargrave offense picked up just two yards in four plays, as the Concordia Lutheran defense forced a turnover on downs.\nEarly in the second quarter, with Hargrave leading 12-7 after long touchdown receptions by Hargrave senior Aaron Johnson and Concordia Lutheran senior Colin Howard, Halbrooks returned a kickoff to the Crusader 33-yard line.\nThe Falcons gained 1 yard on four plays as the Crusader defense forced another turnover on downs.\n“That’s what we’ll lay in bed awake tonight thinking about, why we didn’t punch those in,” Hargrave coach Mike McEachern said. “You have to punch those in if you’re going to win. It’s something good teams do and we didn’t do it.”\nHoward added touchdown receptions of 18 yards, 45 yards, and 41 yards on passes from junior Brett Simcox, evading multiple tackles each time, as Concordia Lutheran finished the game with 29 unanswered points.\n“We started off a little cold and didn’t play very well,” said Concordia Lutheran coach Bobby Lundquist. “I think our defense came up big. We had that second half shutout. We stuck with it and kept playing and made them go the long, hard way. We didn’t give up the big play, and that made a huge difference right there. “\nHoward finished the game with nine catches for 229 yards.\nJohnson’s 43-yard touchdown reception, during which he broke multiple tackles, and a 31-yard run by junior AJ San Miguel were the only plays of more than 25 yards that the Falcon offense had all night.\nSimcox was 20/27 passing for the game with 338 yards and four touchdowns.\nShively was 12/35 for 168 yards with two touchdowns and an interception.\n“We keep shooting ourselves in the foot with something or the other,” McEachern said. “We’ll either drop a ball or not make a throw or have a penalty or miss a block.”\n“We’re not where we need to be, but the good thing is we don’t start district play tomorrow; we don’t even start it next Friday. We’re going to use it [the upcoming bye week to get back to the basics on some things and just be able to shore up and get better at what we do.”\nHargrave falls to 2-3 as it completes pre-district play. The Falcons have a bye week on Oct. 5 and begin district play at new district opponent Lumberton on Oct. 12.\nCrosby comes from behind to beat Vidor in triple overtime\nThe Crosby Cougars faced a 13-point halftime deficit and a 14-point deficit early in the fourth quarter, but once again, the Cougars found themselves on top at the end of the game as they beat the Vidor Pirates 42-36 in a triple overtime game on Friday night, Sept. 28 at Pirate Stadium in Vidor.\nA 25-yard touchdown pass from backup quarterback Kobe Coker — who entered the game in the first quarter in place of injured starter Jaiden Howard — to senior Zach Simon with 8:33 left in the fourth quarter and a four-yard touchdown run by Simon later in the fourth quarter tied the game at 28, where the score remained, sending the game into overtime.\nA missed 41-yard field goal by Vidor, followed by a lost fumble from Crosby sent the game into a second overtime.\nA four-yard touchdown run by Simon, followed by a successful two-point conversion put the Cougars up, but the Pirates responded with a 1-yard touchdown run by Gage Galloway and a successful two-point conversion sent the game to a third overtime.\nThe Crosby defense forced and recovered a fumble on Vidor’s next possession, and a 7-yard touchdown run by Simon ended the game.\nSimon finished the game with 165 yards on 30 carries and three rushing touchdowns. He also had a 25-yard touchdown reception.\nCrosby moves to 4-0, 1-0 in district play.\nCrosby hosts 0-5 Dayton on Friday, Oct 5.\nchris.shelton@chron.com", "url": "https://apnews.com/26e5ea713032414f929c7d91caa2dec7"}