{"authors": ["Adam Zielonka The Washington Times"], "date_download": "2020-05-04 20:25:31", "date_modify": "2020-05-04 20:25:31", "date_publish": "2018-04-22 09:59:25", "description": "The No. 14 Navy men's lacrosse team upset No. 9 Syracuse 13-12 on a last-second goal at the Carrier Dome Saturday afternoon. The Navy-Syracuse game pitted Joe Varello, a Navy senior, against...", "filename": "_2fdbe48704ea8a6b891045dd7a8afde8_1588623931.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2fdbe48704ea8a6b891045dd7a8afde8_1588623931.html", "title": "Navy lacrosse beats Syracuse on buzzer-beating goal in brothers' faceoff battle", "title_page": "Navy lacrosse beats Syracuse on buzzer-beating goal in brothers' faceoff battle", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The No. 14 Navy men’s lacrosse team upset No. 9 Syracuse 13-12 on a last-second goal at the Carrier Dome Saturday afternoon.\nThe Navy-Syracuse game pitted Joe Varello, a Navy senior, against freshman brother Dan Varello, two faceoff specialists competing against one another for the first time.\nIn the final 10 seconds of the game, with the score tied, Joe beat Dan for a faceoff, beat his close defense, passed the ball to teammate Jeff Durden and received it back from him in time to fire off a buzzer-beating goal.\nWhy we love lacrosse sports today: @navymlax Joe Varello wins faceoff vs younger brother Dan, scores game winning goal with 0.2 seconds left to upset #9 @CuseMLAX. The brothers then share an embrace at the end of the game (video courtesy ACC Network Extra) pic.twitter.com/s9p7JzZDwK Lax Sports Network (@LaxSportsNet) April 21, 2018\nThere were four lead changes and six ties in the game, the regular season finale for both teams. Navy improved to 9-4 overall, while Syracuse finished 7-5. Both squads are in the running for at-large bids to the NCAA Tournament, and this quality win certainly could help Navy’s chances.", "url": "https://apnews.com/2fdbe48704ea8a6b891045dd7a8afde8"}