{"authors": ["Sentinel"], "date_download": "2020-05-04 20:23:13", "date_modify": "2020-05-04 20:23:13", "date_publish": "2018-12-16 11:33:42", "description": "THE WHEELS ARE turning for economic development in Fitchburg. A brand new Fitchburg Center Transitional Assistance office on Nursery Lane gave life to a former mill building and brought...", "filename": "_9d2b24d48f7c40a0b6c6e0e7acfe058d_1588623793.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9d2b24d48f7c40a0b6c6e0e7acfe058d_1588623793.html", "title": "Former Mill Building in Fitchburg Gets New Life", "title_page": "Former Mill Building in Fitchburg Gets New Life", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "THE WHEELS ARE turning for economic development in Fitchburg.\nA brand new Fitchburg Center Transitional Assistance office on Nursery Lane gave life to a former mill building and brought activity to the area.\nSunday notebook\n“You’re a spoke in the wheel of economic development,” Mayor Stephen DiNatale said about the office at a Friday open house and ribbon cutting ceremony.\nThe office relocated to the new space in October.\nStaff and members from the Department of Transitional Assistance, including Commissioner Jeff McCue, were there to tour the new space, which is co-located with various state agencies and the Montachusett Opportunity Council.\nWHEN GOV. CHARLIE BAKER took office, it started snowing. And soon thereafter Bev Scott took herself “out the picture.”\nFrom there, Baker and Transportation Secretary Stephanie Pollack turned to Frank DePaola to run the aging and crumbling MBTA. And then Brian Shortsleeve. And then Steve Poftak. And then Luis Ramirez.\nFour years and six general managers later, it’s Poftak’s turn again.\n“Obviously it’s a well-paid position so they attracted candidates from around the country but in some respects it’s getting to be like filling the president’s chief of staff position. It just takes a lot,” said Rep. William Straus, who co-chairs the Transportation Committee on Beacon Hill and couldn’t resist the comparison to President Donald Trump’s soap-operatic search for a new chief.\nIt’s not that all of those GMs didn’t work out. There was a retirement and private sector opportunities. A couple were never meant to be permanent. Those weren’t the cases with Ramirez, however.\nRamirez signed a three-year contract after a nationwide search in the summer of 2017, and was supposed to stick around. But Baker and Pollack reached an agreement this week with Ramirez for him to step down as the head of the T after just 15 months on the job.\nThey didn’t really get into detail about why it didn’t work out, but after hiring an out-of-state businessman with no public transit experience, the administration is once again promoting from within. No pretense of process required.\nPoftak has sat on the Fiscal Management and Control Board since 2015, and ran the T for three months during the general manager search that landed on Ramirez. He’s also, as Pollack noted, a lifelong T rider, and has studied transit issues in research jobs at the Pioneer Institute and Harvard.\n“I certainly would have liked to have seen it last longer, but I do believe the secretary and Luis had a series of what I would describe as honest discussions and I do think Steve is the right guy to run with the capital program,” Baker said Thursday.\nBaker said what the T needs right now is someone to implement the multi-year $8 billion capital investment plan. But after watching the T churn through leaders and struggle to make noticeable improvements in service, Straus said it’s going to take more than putting Poftak at helm to succeed.\n“If someone thinks managing alone is going to stop the kinds of equipment issues we’ve seen, they’re mistaken,” he said. Straus didn’t say from where he thinks the state should pull new revenue for the T because, he said, all ideas should be welcomed at this stage, but revenues, he said, will be needed.\nTHE PROBLEM FOR transportation advocates and policy makers like Straus is that they’re not alone in crying out for a tax plan to support their cause.\nThe Massachusetts Teachers Association this week detailed its new campaign to pressure lawmakers into committing $1.5 billion in new funding to public education.\nAnd, sure, that might sound good. But the union is also not talking about where it thinks that money should come from.\nHigher taxes? Budget cuts to other programs? And this while economists are warning lawmakers that another recession could be around the corner, and advising them to sock away whatever free cash they can find.\nTAXES PROBABLY WEREN’T on the agenda at the University of Massachusetts Amherst this week where freshman legislators congregated to get schooled by the upperclassmen and experts on the finer points of bill filing, campaign finance law, committee hearings and communications.\nJudging from Twitter, however, it doesn’t seem the new class needs much of an education in the latter as selfies flooded from the #NewbieBootcamp to Twitter and Instagram with partnerships forming over #Medicare4all and other issues.\nSOME LARGE EMPLOYER groups are trying to do their part for cost cutting by banding together to try to reduce avoidable emergency room visits, thereby driving down the overall cost of health care in Massachusetts.\nThe Health Policy Commission says that one-third of Bay State residents who have employer-sponsored health coverage reported making their last visit to the ER for a condition that wasn’t an emergency.\nTo help reverse this behavior, the Massachusetts Employer Health Coalition has developed educational materials for businesses to give to their employees to help them make better, or at least cheaper, health care decisions.\nHOUSE AND SENATE leaders are also contemplating legislation that would ensure utility companies make better decisions when working on gas pipelines. Speaker Robert DeLeo and Senate President Karen Spilka said this week that they’re both aiming to pass a gas safety bill filed by the governor before Jan. 2.\nThe two leaders made that declaration a day before a hearing where members of the Joint Committee on Telecommunications, Utilities and Energy put gas company executives through their paces about safety in the wake of the Merrimack Valley gas disaster.\nDuring a week when Baker and other leaders went up to Lawrence to declare the gas service restoration efforts “substantially complete” three months after the overpressurization event, Sen. Michael Barrett and others wanted to know whether understaffing or lax safety protocols might be putting residents in other parts of the state at risk.\nBaker’s bill came from a recommendation made by the National Transportation Safety Board after the Merrimack Valley event, and would require all potentially dangerous gas work plans to be signed off on by a certified professional engineer.\n“There is definitely a sense of urgency here that we should get it done,” Spilka said.\nSTORY OF THE WEEK: Exit Ramirez, reenter Poftak.\nContributors to the Sunday Notebook are Sentinel & Enterprise staff writer Mina Corpuz and State House News Service reporter Matt Murphy.", "url": "https://apnews.com/9d2b24d48f7c40a0b6c6e0e7acfe058d"}