{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Keeanga-Yamahtta Taylor", "Phyllis Bennis"], "date_download": "2020-05-04 19:52:04", "date_modify": "2020-05-04 19:52:04", "date_publish": "2018-07-15 00:00:00", "description": null, "filename": "2019_02_wielding-the-imperial-presidency_1588621924.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/07/15234859/19197596204_90207ab56f_k.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_02_wielding-the-imperial-presidency_1588621924.html", "title": "Here’s What Bernie Could Do in Power", "title_page": "Here’s What Bernie Could Do in Power", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nBernie Sanders is the most popular politician in the United States. If he were to make it through a crowded Democratic Party primary field, successfully dodging attacks from party elites who recognize he’s not their ally, there’s no question that he could win the presidency in 2020. It’s an exciting prospect for those of us who believe, as Sanders once put it, that “this is class warfare, and we’re going to stand up and fight.” But a democratic socialist in the White House is far from a silver bullet. The Supreme Court will be lost to liberals, let alone socialists, for many decades to come, and a majority of Congress will likely be composed of some combination of conservative Republicans who are bent on austerity and centrist Democrats who are more than willing to meet them halfway. Even if their numbers increase exponentially, progressives like Rashida Tlaib and Alexandria Ocasio-Cortez, who share Bernie’s economic and social justice agenda, will be in the minority under a Sanders administration. We should have healthy reservations about what a lone democratic socialist could accomplish at the helm of the capitalist state. In this political environment, what could Sanders do besides fight and lose, negotiate and concede, inevitably disappoint? Executive orders are powerful tools for the president, who often issue hundreds of them for both good and ill. There are the soaring heights of Lincoln’s famous Emancipation Proclamation, and there’s also Trump’s recent directive permitting more federal logging on public lands. Franklin D. Roosevelt used 3,522 executive orders to do things like create the Civil Works Administration, which gave jobs to the unemployed, and the Rural Electrification Administration, which brought power to the rural poor; he also used an executive order to initiate the internship of Japanese Americans during World War II. Executive orders are ephemeral: they can be reversed by the president who comes next, overturned by the Supreme Court, and in some cases nullified by new legislation. To make lasting change, we can’t rely on directives from a single politician. We need a mass movement from below that can send progressive and democratic-socialist representatives into the state, while mounting protests, strikes, and other disruptive activities that create crises outside of the state, to which officials are forced to respond. But building that movement is not mutually exclusive with aggressive executive action. If a hypothetical President Sanders were to pass hundreds or even thousands of orders intended to curb the power of capitalists, it would be a major boon to extra-parliamentary movements. First, ambitious executive orders can expand the popular imagination and raise expectations. Policy ideas that once seemed unfeasible can be instantly legitimated, and so can the politics that animate them. Second, adjustments made by executive order that mitigate ruling-class power make it easier for workers to organize and participate in political activity aimed at longer-term change. The Right has caught onto the fact that dramatic shifts in policy have enormous potential to alter the balance of power. Donald Trump’s barrage of executive orders is a case in point. From instituting a discriminatory travel ban to ordering the construction of a border wall, he has moved political goalposts and established horrifying norms in American politics, even as fights have ensued in the courts and in Congress. A President Sanders wouldn’t be able to bring society’s masters to heel alone, but he would be obligated to use every tool at his disposal, including executive orders. Here are just a few examples of the kind of measures he could issue in office. This list is far from comprehensive, but it demonstrates the power of a single president to intervene and to create new political possibilities — in this case for the many, instead of the few.\nClimate By executive order, a president could set aggressive greenhouse gas and energy use reduction goals across the federal government, including the military (the Department of Defense is one of the world’s worst polluters). He could direct all appropriate executive branch agencies — including the Environmental Protection Agency, the Interior Department, and the Army Corps of Engineers — to account for the greenhouse gas impacts of any proposed infrastructure project, and declare that any project with the potential to exacerbate climate change should be rejected. “This will inevitably lead to litigation,” explains Basav Sen, Climate Justice Project Director at the Institute for Policy Studies (IPS). “Courts will eventually allow some of these projects to proceed, but this is a very important delaying tactic, and it creates a roadblock because the industry will have to fight a court battle against the federal government for every piece of harmful infrastructure they try to build. Some of them will be blocked and all of them will be significantly slowed down, sinking capital and making it harder to build new fossil fuel infrastructure.” Sanders could also issue an executive order directing federal agencies to account for environmental justice impacts of all proposed infrastructure projects, Sen adds, and then reject the ones which do disproportionate harm to communities of color and the poor. He could also issue an executive order to rejoin the Paris Climate Accord. “The Paris agreement is fundamentally flawed,” says Sen. “Its goals are not ambitious enough and it is entirely voluntary. But that being said, it is still important for us to be part of the global community of responsible nations, and actually engage with this process and contribute in the ways that we can to global climate action.” A President Sanders could establish an interagency task force to lay out the parameters of a Green New Deal. He could also stop all lease sales for coal, oil and gas extraction, uranium mining, and other forms of mining and logging on federal land. Finally, he could bar any company with environmental violations in the last ten years from securing federal contracts. Taken together, these executive orders would push American climate policy in a dramatically more sustainable direction, making it harder for business to degrade the planet for profit.\nForeign Policy The United States has the most far-reaching military presence in world history. By executive order, President Sanders could “withdraw troops from countries around the world where they are deployed,” says Phyllis Bennis, Director of the New Internationalism project at IPS, including places where they are “carrying out assassinations and other so-called counterterrorism actions, which are in violation of international law and which are not keeping us safer and are not keeping people in other countries safer.” Sanders could issue an executive order declaring the official termination of the “Kill List,” a database of individuals that the Pentagon has flagged for capture or murder. He could also end all secret bombing campaigns. “In 2017 alone, there may be as many as six thousand civilians who have been killed in US-led coalition bombings in Iraq and Syria,” says Bennis. “It’s horrific. Secret bombings are clearly not secret to the people who are being bombed,” and yet they occur constantly, wasting money to destroy lives. As commander in chief, Sanders could end them unilaterally. President Sanders could issue an executive order reestablishing the legitimacy of the War Powers Resolution, which requires Congressional consent to make war. Presidents have been violating this law for decades. The first successful assertion of Congress’s power to override executive warmaking since 9/11 came last year, when Sanders himself invoked the War Powers Resolution in a bill to end US support for Saudi intervention in Yemen. Sanders could issue an executive order establishing a policy of abjuring any military intervention not authorized by Congress, publicly affirming the antiwar and pro-democratic principles that would motivate his own compliance with the War Powers Resolution. Sanders could also declare that no individual who has worked for a defense contracting company can be appointed to a federal agency. Issuing an order like this “would have the effect of redefining publicly what American interests are,” says Bennis. “Do the interests of the Pentagon reflect the interests of corporations, or of the US people?” While the power of the purse belongs to Congress, Sanders could establish a commission to conduct a top-to-bottom review of the military budget, with a view to radically scaling it down. President Trump recently ordered a task force to identify bloat in the US Postal Service — why not create one to assess the most frivolous and destructive military the world has ever encountered? Finally, the Pentagon currently has a program to provide free and low-cost military equipment to US law enforcement agencies. “That’s how you got an armored personnel carrier in the streets of Ferguson after Mike Brown was killed,” says Bennis. “And when they had it, they used it.” President Sanders could issue an executive order discontinuing this program, forestalling efforts to militarize domestic police and make war in American streets.\nCriminal Justice The structure of the criminal justice system poses unique challenges for the executive branch, since most of its activity occurs under state and local jurisdiction. Still, a president could chip away at the foundation of mass incarceration through certain executive orders, and could use others to send a powerful message. Sanders could issue an executive order directing his Department of Justice and the Department of Homeland Security to shutter federal private prisons completely, including immigrant detention centers, and cut all contracts with private prison companies. Sanders could also issue an executive order directing the Department of Justice to abandon mandatory minimum sentences in federal prosecution, and to pursue non-carceral solutions for low-level offenders. The president also has the power to grant clemency to federal prisoners by executive order: President Jimmy Carter pardoned draft dodgers en masse in the wake of the Vietnam War, and Obama did the same for hundreds of drug offenders in his final days in office. Obama’s commutations applied selectively to inmates who had completed ten years of their sentence and who had behaved well in prison. Sanders could finish the job by pardoning every federally incarcerated drug offender sentenced under the draconian requirements of the War on Drugs, no matter how much of their sentence they’d served or whether they’d gotten a GED or held a job — criteria that were important to the Obama administration. Similarly, while presidents can’t decide on absolute funding amounts, they can set priorities for how that funding is used within agencies. “The Department of Justice can say we’re not going to spend this billion dollars that would otherwise go to the Drug Enforcement Agency for law enforcement on pursuing and prosecuting drug dealers,” says Kara Gotsch, Director of Strategic Initiatives at The Sentencing Project. “Instead we want that money to be shifted. We want to take a billion dollars and invest in an intervention program trying to divert people with substance-use disorders into treatment, a community health-based approach. There’s so much that can be done at the administrative level to reprioritize strategies on how we address crime.” Sanders could issue an executive order directing all agencies to stop civil asset forfeiture, the practice of seizing someone’s property merely on the suspicion that they’ve committed a crime. Obama’s attorney general, Eric Holder, placed limits on it, but they were rolled back. Sanders could declare an immediate end to the civil asset forfeiture across agencies, from the DEA and the FBI to the Department of Homeland Security. By executive order, Obama “banned the box,” meaning the tick-box that compels federal employment applicants to disclose their criminal records. Trump has not rescinded the order yet, but he’s likely to get around to it sometime. If he does, Sanders can reissue the order with an extra provision: ban the box for federal contractors as well, since they are nearly as many of them as there are direct federal workers. Finally, Sanders could take some risky moves with executive orders in an attempt to break new ground around criminal justice issues. For example, last year Sanders introduced a bill in the Senate to withhold federal anti-crime funding from cities that use a cash bail system. While funding is primarily the jurisdiction of Congress, an executive order could be a powerful gesture to legitimate the movement to end cash bail. In 2017, Trump issued a comparable order stripping sanctuary cities of eligibility for federal grants. Though it was swiftly declared unconstitutional by the courts, it had a major impact on the political atmosphere, escalating anti-immigrant sentiment and validating the idea that undocumented immigrants endanger US citizens. If Sanders were to try the same tactic for cash bail, it might get struck down — but it would put the injustice of the cash bail system in the national spotlight, strengthening congressional efforts to pass a bill like his No Money Bail Act.\nEconomy The United States is full of places that banks have decided it’s unprofitable to serve. This forces people to turn to predatory payday lenders and check-cashing operations, spending an average of 10 percent of their income on the exorbitant fees that “alternative” financial services charge. There’s a solution to this problem within our reach: federal law already requires the US Postal Service to have a brick-and-mortar post office in every zip code, and 60 percent of them are in zip codes with only one or no bank branches. President Bernie Sanders could issue an executive order directing the post office to begin offering public banking, ensuring that nobody will be kept from traditional financial services. Besides simply avoiding certain neighborhoods, banks also engage in discriminatory lending. While they’re no longer allowed to deny loans to African Americans on racial grounds, for example, they can run complex risk-assessment algorithms that perpetuate racial bias, and simply hide behind the numbers when the fairness of their lending policies is questioned. Sanders could issue an executive order requiring all financial supervisory agencies to prioritize documenting and combating lending discrimination, not only reaffirming the spirit of the Fair Lending Act but also leaving a paper trail of disparate outcomes and potential corporate violators. The Volcker Rule, which prohibits banks from using depositors’ money for the kind of risky speculation that led to the 2008 economic collapse, made Wall Street angry. Under Trump, federal bank regulators were put to work rewriting the rule to give bankers more leeway. Sanders could issue an executive order instructing all of these agencies — the Fed, the SEC, and the FDIC — to leave the Volcker Rule intact. And while he’s at it, Sanders could issue an order prohibiting Obama-style appointments of Wall Street bankers, lawyers, and lobbyists to agencies tasked with overseeing the finance sector. In 2014, Obama issued an executive order setting the minimum wage for federal employees and contractors at $10.10 per hour — four dollars less than what analysts at MIT determined constituted a living wage. Sanders could issue an executive order correcting the problem, establishing a task force to determine the real living wage across the United States and setting the federal worker minimum accordingly. Finally, Sanders could issue an executive order establishing new priorities across federal agencies that administer social programs. Last April, Trump issued an order stating that “many of the programs designed to help families have instead delayed economic independence, perpetuated poverty, and weakened family bonds” and instructing agencies to adhere to what it called the “Principles of Economic Mobility”: strengthening work requirements, reserving benefits only for the poorest (means-testing), reducing “wasteful spending by consolidating or eliminating Federal programs that are duplicative or ineffective” (austerity), and empowering the private sector to step in and solve problems currently delegated to the federal government (privatization). Sanders could immediately reverse that order and issue one of his own, instructing agencies wherever possible to operate according to “Principles of Economic Equality,” such as universal program design instead of means-testing, decommodification instead of privatization, and redistribution instead of austerity.\nCanceling Student Debt Americans hold more than $1.5 trillion in student debt. It keeps tens of millions of people from buying homes and starting families, and locks them into jobs they don’t want, often more than one at a time, scrambling to make payments before interest gets out of control. What could a President Bernie Sanders do by executive order to address this crisis? For one thing, he could issue an executive order directing his secretary of education to erase all debt from fraudulent for-profit colleges. During Obama’s tenure, activists pressured his education secretary, Arne Duncan, to cancel all the federally held debt incurred by students who pursued degrees at fraudulent for-profit colleges like Corinthian and ITT. But Duncan demurred. One of the rationales he gave, according to Ann Larson of the Debt Collective, was that the Department of Education didn’t have a mandate for such a dramatic move, since its leaders aren’t elected. An executive order from Obama would have undermined that rationale — but none materialized. But that would still be only a drop in the bucket. What about students with degrees from typical nonprofit universities who are struggling to find a foothold due to their student debt burden? In 2015, 70 percent of college seniors graduated from nonprofit colleges with student debt. Larson says a president could do something about that, too. “When Congress was first given the power to issue and collect student loans in 1958, the Department of Education also received a power from Congress called ‘compromise and settlement,’ which allows them to waive the right to collect on them,” says Larson. “And then the Higher Education Act in 1965 solidified that power in the hands of the secretary of education.” Sanders could issue an executive order directing his secretary of education to immediately write off all student loan debt for which the federal government is the creditor, which is the majority of student loan debt in the United States. The executive order could also direct the Department of Education to assume all the debt of borrowers who owe money to private lenders, and write that off too, reducing Americans’ student loan burden from $1.5 trillion to zero. According to economists’ estimates, immediate cancellation of all student debt would deliver a major windfall to the American economy, reducing unemployment by roughly 0.3 percent and boosting GDP by almost a trillion dollars over the next decade.", "url": "https://jacobinmag.com/2019/02/wielding-the-imperial-presidency"}