{"authors": ["Robert Nott", "The New Mexican"], "date_download": "2020-05-04 20:27:55", "date_modify": "2020-05-04 20:27:55", "date_publish": "2018-01-25 06:20:00", "description": "Santa Fe Public Schools is moving forward with a plan to take over use of a district-owned building on N.M. 14 south of the city that now houses the Turquoise Trail Charter Elementary...", "filename": "_b98e62d41336452798197a6de41a8778_1588624075.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b98e62d41336452798197a6de41a8778_1588624075.html", "title": "SFPS plans to offer alternative site to Turquoise Trail school", "title_page": "SFPS plans to offer alternative site to Turquoise Trail school", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Santa Fe Public Schools is moving forward with a plan to take over use of a district-owned building on N.M. 14 south of the city that now houses the Turquoise Trail Charter Elementary School.\nMembers of the school board decided this week, in a unanimous vote, to include the building in the district’s long-term master plan for facilities with the goal of finding another site for Turquoise Trail within the next few years.\nThough the district does not have any vacant buildings to offer at this time, officials have said that Chaparral, E.J. Martinez and Nava elementaries in central Santa Fe, which have aging structures and have struggled with stagnant or declining enrollment, could face closure in the future. It’s possible that one of these three sites would be offered to Turquoise Trail.\nThe district wants to reclaim the Turquoise Trail building to help ease crowding in schools on Santa Fe’s south side as the city’s population continues to shift in that direction. The school board informed Turquoise Trail earlier this month that it would not renew the building lease after the agreement expires in 2021.\nBut leaders of Turquoise Trail say they plan to stay put.\nThey’d prefer to work with Santa Fe Public Schools to find a compromise that would allow the charter school, which serves over 500 students, to remain in the building while also addressing the district’s south-side squeeze, said Floyd Trujillo, head of the school’s governing board.\nAnd they are open to taking the matter to court.\n“Turquoise Trail Charter School has been serving the south-side Santa Fe community of Turquoise Trail for more than 25 years,” Trujillo told The New Mexican on Wednesday. “Turquoise Trail has worked hard to support the community, and we have no doubt that the community fully expects for us to continue to do so. We have no intention of leaving the current facility.”\nState law says a school district must allow a charter school to use a district-owned facility, unless the building in question is “currently used for other educational purposes.” Because Santa Fe Public Schools is not using the Turquoise Trail building for its own purposes, Trujillo argued, the district cannot force the school to move.\nIf the two sides cannot reach an agreement, he said, it’s possible the conflict could end up in court.\nSuperintendent Veronica García said she hopes that doesn’t happen.\n“I don’t think it’s a good use of taxpayer dollars to litigate and wind up in court,” she said Wednesday.\nThe district has the right under state law to offer an alternative building for the school, García added.\nDuring Tuesday’s school board meeting, Trujillo asked the five school board members to give him a chance at their next meeting to discuss the issue.\nSchool board President Lorraine Price said in an email Wednesday that the board is reviewing that request. But, she said, “As a matter of course, the board of education as a public body doesn’t enter into dialogue with outside entities during its regularly scheduled meeting.”\nThe school at the center of the controversy became one of the state’s first charter schools in 1994 under the oversight of the Santa Fe district. Two decades later, the school opted, instead, to ask the state to hold its charter, a move to help it leverage more federal funding.\nBut Turquoise Trail began as a public elementary school that served students who lived in a large rural area of the district stretching from the central-western Santa Fe County villages of Madrid and Cerrillos to the communities of Lone Butte and La Cienega — an area now served by the Amy Biehl Community School.\nThat facility, just 7 years old, is already so overcrowded that the school board decided this month to cap its enrollment and send new students elsewhere.\nTrujillo said at least half of Turquoise Trail’s students live within a five-mile radius of the school, so, in a sense, it is already easing the population problem at Amy Biehl. He believes it could serve even more of the area’s children.\nEric Carlson, the parent of a first-grader at Turquoise Trail, also raised that issue. If the charter school were forced to relocate to a site within city limits to make room for a district school, he said, most of the families living in communities south of the city would enroll their children in the new public school to avoid a longer commute.\n“And how will that solve this overcrowding problem?” he asked.\nTurquoise Trail has an ally in state Public Education Secretary-designate Christopher Ruszkowski, who said in an email Wednesday that the district’s plan to shake up what he called a successful charter school serving low-income students is “deeply concerning.”\n“The public deserves to know the truth about why this is happening,” Ruszkowski said, “and the School Board should be held accountable.”\nContact Robert Nott at 505-986-3021 or rnott@sfnewmexican.com.", "url": "https://apnews.com/b98e62d41336452798197a6de41a8778"}