{"authors": ["Barry Lytton"], "date_download": "2020-05-04 20:31:39", "date_modify": "2020-05-04 20:31:39", "date_publish": "2018-11-28 22:18:37", "description": "STAMFORD — The stages were set this week for the next big development spat in the city, centered on a parcel a half mile north of the site that prompted the prickliest fight between residents and...", "filename": "_fcbce9373fd14450be49d13046333459_1588624299.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fcbce9373fd14450be49d13046333459_1588624299.html", "title": "Residents decry latest BLT plan", "title_page": "Residents decry latest BLT plan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STAMFORD — The stages were set this week for the next big development spat in the city, centered on a parcel a half mile north of the site that prompted the prickliest fight between residents and a developer in recent history.\nBut this time, instead of a drawn-out altercation over developer Building and Land Technology’s South End boatyard demolition, the fight is away from the waterfront — which is partially why some are up in arms.\nInstead of working within the Harbor Point district outlined a decade ago around old industrial brownfields near the water, BLT’s newest proposal is for land across the street from a community center and blocks from historic homes nestled within the historic district.\nSome residents see it as BLT’s slow march to the train station to the north.\n“At first I thought it was wonderful. ‘Oh boy, they’re building all these buildings.’ But now it’s a concrete jungle,” longtime resident Marlene Rhome told members of the Planning Board Tuesday. “It’s atrocious, how many more buildings are going to go up?”\nBLT contends the plan simply puts housing where a neighborhood eyesore — a garbage transfer facility — once stood.\nFor three decades, the land housed B&S Carting. During B&S’s South End tenure, residents complained of the noxious smells and fluttering debris, said the builder’s attorney William Hennessey,\nThen BLT bought Carting out.\nHennessey chided residents for forgetting how much BLT had done for the neighborhood. His scolding came after a dozen residents told the board that the new South End is overwhelming the neighborhood with highfalutin restaurants and city-scale luxe apartments they can’t afford.\n“They look like projects, they don’t look like a living space ... it doesn’t feel like a home environment anymore,” said resident Doris Ganues. “I remember when there were two pharmacies, a meat market, a fish market, a whole lot of things, two or three restaurants that everybody could go into ... we don’t have that no more.\n“We just have buildings,” she said. “We want an environment that feels like it’s home, you know? We don’t want the environment to feel like a corporate city where the houses are so big, but we can’t live in them, the restaurants so expensive, we can’t go in there.”\nHennessey took exception to the idea that the pre-Harbor Point South End was an ideal neighborhood that BLT seeks to destory.\n“For people to pine about the prosaic old days when there were deer and turkey (in the neighborhood), well there was — I saw the deer and turkey. They were on the old Helco site when it was an overgrown cyanide wasteland,” Hennessey said. “That stuff existed. This is the good part of redevelopment. They were hardly hardy deer and turkey.”\nThe Planning Board will now mull whether to change the city’s master-plan map to allow for higher density housing on the B&S Carting parcel between Woodland Avenue and Walter Wheeler Drive. The board closed comment, and will next take up the matter Jan. 8.\nThe map change is the first edit of land-use codes needed for BLT to erect several new buildings, including a complex with five-story street frontage along Pacific Street, 22-story tower on Walter Wheeler Drive and 15-story building on Woodland Avenue. The complex is comprised of some 670 proposed housing units.\nThe Planning Board has jurisdiction over the master plan change, and will discuss that and a referral to the Zoning Board on accompanying zoning-code text changes at the January meeting.\nZoning could take up the text changes at its next meeting on Dec. 3.\nbarry.lytton@stamfordadvocate.com; 203-964-2263; @bglytton", "url": "https://apnews.com/fcbce9373fd14450be49d13046333459"}