{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:25:06", "date_modify": "2020-05-04 20:25:06", "date_publish": "2018-02-07 21:13:38", "description": "By Matt Murphy and Colin A. Young State House News Service BOSTON -- As their investigation into her predecessor continues, Senate Democrats agreed Wednesday to make Sen. Harriette...", "filename": "_f34810c432924c619404760747cdd970_1588623906.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f34810c432924c619404760747cdd970_1588623906.html", "title": "Senate Democrats OK Chandler Finishing Year As President", "title_page": "Senate Democrats OK Chandler Finishing Year As President", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Matt Murphy and Colin A. Young\nState House News Service\nBOSTON -- As their investigation into her predecessor continues, Senate Democrats agreed Wednesday to make Sen. Harriette Chandler of Worcester the permanent president of the Senate for the remainder of the year, and will vote Thursday to remove “acting” from her title.\nThe decision, according to Chandler, is intended to send a message that the Senate wants to put the turmoil caused by questions about former Senate President Stanley Rosenberg’s future in the rearview mirror so that the body can focus on policy priorities for the remaining six months of the formal, two-year session.\nChandler, 80, will not be a candidate for the permanent position in January when the next Senate is scheduled to elect a new Senate president. She said it will up to Rosenberg whether he stands for election at that time -- all members of the Senate are first up for re-election to their seats this fall.\nThe decision was announced after Senate Democrats met for more than three hours in a private caucus. It’s a clear and potentially permanent step away from Rosenberg, who is the subject of a Senate Ethics Committee investigation. While senators say they are trying to create a stable environment, the branch remains at risk of being riled by months of wrangling this year by potential Chandler successors.\nTwo North Central Mass. senators applauded the move.\nAnne Gobi, a Democrat from Spencer, said the move gives the Senate stability.\n“When she was voted in back in December, she was voted for the term of acting Senate president. We don’t want her just to be considered ‘acting,’ we want her to have the full power of the office and remain as the Senate president for the remainder of the legislative session,” said Gobi. “It was more about the perception... The term ‘acting’ doesn’t make it sound permanent and there might have been some hesitation in dealings with her.”\nDean Tran, a Fitchburg Republican, said “In my opinion, President Chandler has brought a lot of stability to the Senate and has been a very easy person to work with. I wouldn’t mind her holding the senate presidency for the entire year and I look forward to working with her, if that’s the case.”\nWednesday’s decision was a departure from the posture Senate Democrats have been holding since December, when they authorized the Senate Ethics Committee to conduct an investigation into whether Rosenberg violated any Senate rules in connection with the activities of his husband, Bryon Hefner. Hefner has been accused of sexually harassing men with business before the Legislature and meddling in Senate affairs.\nUp until now, many senators had been pointing to the investigation as a reason to hold off on making any final decisions on leadership until the findings were released. That position started to lose credibility with some senators after another story over the weekend in the Boston Globe in which it was alledged that Rosenberg’s promised firewall to keep Hefner out of Senate business had been breached.\nHogan Lovells, the law firm hired by the Ethics Committee to conduct the Rosenberg probe, continues to explore the charges of harassment and Senate interference by Hefner, but some senators began to feel that the mounting stories in the press had created too much of a distraction, and one member of the Ethics COmmittee -- Sen. Richard Ross -- said there was “a long way to go” before the investigation would be completed.\nRosenberg, who has expressed hope his name will be cleared, remains a senator and has taken out nomination papers with plans to seek re-election this year.\nChandler emerged from the president’s suite with the full Democratic caucus behind her shortly after 2 p.m. to read a prepared statement and answered a few questions.\n“Today the Democratic caucus voiced their support to continue my term through the end of 2018. An election will be held on the first date of the 2019 season, which is January 2, as is the normal course of business for the Senate,” she said.\nChandler said that following the Thursday vote to remove the “acting” adjective from her title, she plans to move into the president’s office full time, and select a new majority leader. She currently hold both titles.\n“Our focus today continues to be on policy, the budget and the business of legislating,” she said.\nAsked if she would be a candidate for the presidency next year, Chandler said, “No, no,” but said she would be seeking re-election to her seat.\n“We have now reached a point where we are into the business of doing what we’re here to do, which is legislating. We have a budget, Joint Rule 10 day. We have work to do for the people who have elected us, and acting doesn’t quite do it anymore. We are now at the point where we need a president who has the full responsibilities and the full authority of a president of the Senate,” Chandler said.\nA spokesman for Gov. Charlie Baker said the administration “looks forward to continuing to work with Senate President Chandler to tackle the pressing legislative priorities remaining this session, including the administration’s opioid, public safety and affordable housing proposals.”\nFour senators have already expressed interest publicly and to their colleagues that they aspire to the presidency.\nQuestioned on whether she had asked those senators to refrain from lobbying colleagues for votes, Chandler said, “They were among the people, they’re all in there, and they were among the people who agreed to this and voted for it.”\nSenate Ways and Means Chairwoman Karen Spilka, her vice-chair Sen. Sal DiDomenico and Sens. Eileen Donoghue and Eric Lesser are all considered potential successors to Chandler, and the new development means their potential candidacies could become an issue in Senate races around the state this year. Even Senate Minority Leader Bruce Tarr, who leads a seven-man Republican caucus, could make a case during the 2018 campaign season for a Tarr presidency in 2019.\nDonoghue said the decision made by the Democratic caucus Wednesday was to “clarify the situation for 2018,” but as for her continued interest in the presidency she said, “We’ll cross that bridge when we come to it.\n“I fullly support the vote for President Chandler to remain in her position throughout 2018,” Donoghue said in a statement on Wednesday. “The Senate has an aggressive legislative agenda and today’s action will allow all of us to continue our important work on behalf of the people of the commonwealth.”\nLesser predicted the behind-the-scenes jockeying for support as the next president would now take a backseat to making the remainder of the legislative session a productive one.\n“I think it’s sort of implied, so everyone is ready to take a pause, we’re ready to focus on Joint Rule 10 Day, we’re ready to focus on the budget, we’re all united behind Harriette Chandler and we’ll have a discussion about the future in the new session,” he said.\nLesser, however, did acknowledge his interest in the post.\n“I’m thinking about it. We’ll follow up soon. I’m certainly considering it because I think I would have potentially a role to play in helping shape the future. For now, we fully support President Chandler, she has my 100 percent support and enthusiastic support to finish out the term, and a new year and a new session is a new opportunity to have a conversation about the future of the body,” Lesser said.\nInformal sessions are scheduled over the last five months of 2018, which would give potential presidency candidates a window before January to lobby colleagues, although there’s nothing stopping them from trying to round up the votes as soon as they wish.\nSen. Tarr said the Republican caucus will be “fully supportive” of the decision to firm up Chandler’s position as leader of the Senate.\n“I think it’s a very viable solution, I think it brings stability,” Tarr told reporters. “As far as I’m concerned, Senate President Chandler is the president, I think we need to clarify that and confirm it because we have a lot of work to do and the question will be off the table for the remainder of this session and I think that’s appropriate.”\nThe Republican leader, who said earlier Wednesday that his caucus directed him “to pursue the presidency as vigorously as possible,” said he thinks settling the question of Senate leadership for the rest of this year will create a more stable process of selecting a new president.\n“I think it removes the sense of urgency that potential candidates will have that someone is going to wake up tomorrow and read that somebody else has the votes,” he said. “I think it’s human nature that people are interested in being Senate president and aren’t going to stop being interested in Senate president for the rest of the year, but what it does do is allow us to focus not on a race for Senate president but on the matters that are before us as a Legislature and they are many.”\nAsked whether the decision to stick with Chandler through 2018 forecloses the possibility that Rosenberg could return as Senate president, Tarr said, “I think as a practical matter, the answer is yes.”\nMichael P. Norton contributed reporting, as did Sentinel & Enterprise reporter Peter Jasinski", "url": "https://apnews.com/f34810c432924c619404760747cdd970"}