{"authors": ["Alex Burness Staff Writer"], "date_download": "2020-05-04 20:18:44", "date_modify": "2020-05-04 20:18:44", "date_publish": "2018-02-17 19:17:37", "description": "What is the Right to Rest Act? The bill, which is being introduced at the Capitol next week, takes aim at the criminalization of homelessness in Colorado. Per its summary, it \"establishes...", "filename": "_57fa3c1add0b4c9dbaf7cf733448a073_1588623524.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_57fa3c1add0b4c9dbaf7cf733448a073_1588623524.html", "title": "Colorado Lawmakers Set to Consider Homeless Right to Rest Act for Fourth Time", "title_page": "Colorado Lawmakers Set to Consider Homeless Right to Rest Act for Fourth Time", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "What is the Right to Rest Act?\nThe bill, which is being introduced at the Capitol next week, takes aim at the criminalization of homelessness in Colorado. Per its summary, it “establishes basic rights for persons experiencing homelessness, including, but not limited to, the right to use and move freely in public spaces, to rest in public spaces, to eat or accept food in any public space where food is not prohibited, and to have a reasonable expectation of privacy of one’s property.” The bill has died at the committee level three years in a row, though its co-sponsors, Rep. Jovan Melton of Aurora and Rep. Joe Salazar of Thornton, both Democrats, believe this year’s version may have better odds.\nLast year at the State Capitol Building, on an April Thursday just before midnight, after an emotional, 10-hour hearing, a proposal called the Colorado Right to Rest Act — sometimes referred to as a homeless bill of rights — died in committee for the third consecutive year.\nThat night, Rep. Jovan Melton of Aurora, the bill’s co-sponsor lamented that the bill, which sought to ban the criminalizing of homelessness in Colorado, could not win support even with a significant amendment that, in Melton’s words, had stripped the bill to its “bare bones.”\nOn Wednesday, the Right to Rest Act will return for a committee hearing for a fourth year in a row. This year’s version offers the biggest concession Melton and his co-sponsor, Rep. Joe Salazar of Thornton, who’s running for state attorney general, have made yet: Cities that ban homeless people from camping outdoors, like Boulder, Longmont and Denver, could be eligible for exemptions that would allow them to continue enforcing camping bans if they meet certain criteria.\nSome believe it has a better shot than previous versions at advancing out of committee to the House floor. It is very unlikely, though, that it will become law.\nAnd that’s welcome news to the Boulder City Council, whose legislative agenda includes a formal opposition to the Right to Rest Act .\nTo date, no municipality or law enforcement agency in Colorado has signed on to support the bill.\nIt takes direct aim at local policies that criminalize homeless activities, establishing, according to its summary, “basic rights for persons experiencing homelessness, including, but not limited to, the right to use and move freely in public spaces, to rest in public spaces.”\nBut the bill also threatens to undermine local control, opponents say, by seeking to legalize certain behaviors cities, including those in Boulder County, are trying to dissuade as they work to transition people out of homelessness and into more permanent solutions.\nIn the city of Boulder, in fact, the official position against the Right to Rest Act is titled “Fund and protect the municipal justice system’s ability to combat homelessness.”\nSaid Brian Bagley, the mayor of Longmont, “I don’t know what impact the bill would have besides dissuading people from seeking the permanent solutions to their own personal housing problems.”\n‘Forced registration’\nThe new system of homeless services in Boulder County, which was rolled out Oct. 1 of last year after a lengthy drafting period, de-prioritizes emergency programming and instead directs staffing and funding toward creating exits from homelessness.\nBetween Oct. 1 and the end of 2017, officials reported, 77 people exited that system with long-term housing solutions; 64 were in Boulder, 13 in Longmont.\nIt’s “really positively impacting lives,” Boulder City Manager Jane Brautigam said of the new system during the recent State of the City .\nBut as the system hums along, homeless people continue to get citations for violating the urban camping ban. According to Curtis Johnson, deputy chief of the Boulder Police Department, 65 people have been cited in Boulder between Oct. 1 and today — nearly double the number cited during the same timeframe a year ago.\nSince Sept. 1, 2016, when Boulder lifted what had been an unofficial pause of the camping ban, 372 people have been issued citations, Johnson said.\nThough all that criminalization has coincided with a significant number of exits from homelessness, Melton said the results were achieved by questionable means.\n“Boulder’s doing a forced registration,” he said. “To me, it’s still a violation of rights because it’s forcing someone to come forward. You can say that you have a camping ban but you’re still willing to help people. Well, some people don’t feel safe in shelters. Some people don’t feel safe going back to their families.”\nHe added, of the city’s opposition to his bill, “I struggle sometimes with the progressive argument against the bill — that it’ll get in the way of providing services. We’re not trying to get in the way; we’re just saying don’t criminalize. We’re not saying law enforcement can’t interact with the homeless; we’re saying please do it, in fact, and just make it a more positive interaction.”\nLink to jail overcrowding\nThe Right to Rest Act, proponents argue, is a nod to the humanity of homeless people, who should not be subjected to arrest simply for sleeping outside. The ACLU is among those proponents.\nFor Robin Ryan, a Boulder homeless woman, the case is simple.\n“If you’re a corporate executive, you can break any law you want, whereas if you’re economically challenged, you may be vilified,” Ryan said. “just for trying to have an extra layer of material around you so you don’t die from hyperthermia.”\nOthers argue that citing homeless people for sleeping outside or in their cars, or any of a number of activities, is counterproductive.\nBoulder County Sheriff Joe Pelle hasn’t taken a stance on the Right to Rest Act, but he’s been very clear that he does not believe the current approach is working.\n“When they criminalize behaviors like sleeping or smoking in a park, or those sorts of things that tend to target homeless people, they write a ticket. Those tickets are seldom paid and those people frequently don’t come to court and they end up with a warrant for their arrest for failure to appear in court,” he said.\nWhen that happens, Pelle continued, they end up at the severely overcrowded county jail, where they can’t post bond. They stay in jail until they can appear in court, usually receive minor sentences, and get released back on to the street.\n“And in the end,” Pelle said, “nothing’s changed in regard to their behavior, no public safety need has been served and they’ve used the space in a very expensive and a very crowded facility that in my opinion should be used to house people that are dangerous to our community.”\nSome of the laws that criminalize homeless are necessary for public health and safety, others in Boulder County contend.\nJohnson, of Boulder PD, said in response to Pelle, “I understand Joe’s frustration ... but he’s not getting calls from the community complaining about people sleeping in their public spaces, parks and places where people are trying to recreate and enjoy. It’s disturbing to people who want to use the park.”\nOffered Mayor Bagley, “If you go talk to business owners on Main Street in Longmont, they’ll tell you they already have transients sleeping in their doorways, bothering or harassing their clientele. They’ll talk about drug use, the needles they find on the ground.\n“Condoning and welcoming more of that behavior ... needs to be thought through very, very carefully.”\nHoping for ‘a little victory’\nIn Denver on Wednesday, legislators will once again try to weigh these competing desires when they consider the Right to Rest Act for the fourth year in a row.\nThis time around, they’ll have the exemption to chew on, as part of a revised bill that now states that services must be provided to homeless people before a ticket is written. If there is no appropriate service available, the city can’t write a ticket, the bill says, but if the city does offer services and homeless people refuse them, citations can still be issued.\nMelton, desperate to see the proposal finally gain even a sliver of momentum at the Capitol, called the exemption a “huge step back.”\n“It’s something my coalition of the homeless aren’t happy with,” he admitted. “But this is year four of running this bill without it getting even out of committee. I’m trying to find a compromise the cities can work with.”\nThere’s plenty of support from the homeless and prominent advocacy groups for the Right to Rest Act, as will likely be on display at the upcoming hearing, as it has been in years past.\nBut even so, and even with the exemption written in, the lack of formal backing from every Colorado city and law enforcement agency will, once again, make it a very difficult sell among lawmakers.\n“I feel better about this year,” Melton said. “I don’t have a lot of hope of getting it through the Senate, but each year we’ve brought this we’ve gotten it a little further. If we can at least get it out of the House for once, that’s a little victory.”\nAlex Burness: 303-473-1389, burnessa@dailycamera.com or twitter.com/alex_burness", "url": "https://apnews.com/57fa3c1add0b4c9dbaf7cf733448a073"}