{"authors": ["Naeem Mcfadden"], "date_download": "2020-05-04 20:25:47", "date_modify": "2020-05-04 20:25:47", "date_publish": "2018-09-19 03:37:00", "description": "MARION , S.C. – Magnolias on Main Restaurant owners Dolgun and Karen Dervish lost their home for a second time as a result of flooding from a hurricane this past weekend. However, the couple spent...", "filename": "_650e6b8278194396accb978a080c4f5c_1588623947.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_650e6b8278194396accb978a080c4f5c_1588623947.html", "title": "Marion restaurant owners provide free lunches despite losing home in hurricane", "title_page": "Marion restaurant owners provide free lunches despite losing home in hurricane", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MARION , S.C. – Magnolias on Main Restaurant owners Dolgun and Karen Dervish lost their home for a second time as a result of flooding from a hurricane this past weekend. However, the couple spent the past two days serving more than 150 free lunches to hurricane victims in the community.\n“We know the pain of people losing their home,” Dolgun Dervish said. “We thought about other people that do not have electricity or means to cook, and we know what they’re going through. We have a restaurant and could do this.”\nKaren Dervish said the couple still can’t get to their home in Marion near Catfish Creek, so they wanted to do something good with their time.\nIt took the Dervish family nearly two years since Hurricane Matthew to repair their home, and they said they were 95 percent complete before Hurricane Florence struck.\n“It’s a very major loss,” she said.\nHurricane Matthew also damaged their buffet restaurant on Main Street in Marion.\n“We lost the buffet to Matthew, and after we were pretty much done with our home, we renovated in here to do a smaller restaurant and have been here since February,” Karen Dervish said.\nMagnolias transitioned to serving a popular gyro along with a variety of soups, salads and daily specials.\n“It was closed for just about two years, and we just opened,” Dolgun Dervish said, adding that they took precautions ahead of the arrival of Hurricane Florence, including sandbags. Despite opening for business back in 2006 and moving to a bigger restaurant in 2011, the Dervish family closed indefinitely Tuesday.\nDolgun Dervish, 72, said it was easier operating a smaller restaurant but had to close to focus on their home and save what they can.\n“We may reopen maybe, but we just don’t know,” Karen Dervish said. “It’s all in God’s hands.”\nCostumer Daniel Young stopped by for a plate and said he will miss Magnolias.\n“He is a good man, and what he is doing for the community is helping a lot of people out,” Young said. “I loved their gyros. I ate here about three times a week. I’m going to miss it really bad.”\nKaren Dervish said it was a good experience at home before the storm damage.\n“It was heaven there,” she said. “We made it a home. Unfortunately it wasn’t in God’s plan for us to stay. We were just devastated to have another storm hit, but we will be OK. We’re resilient people, and God has our back.”\nServing others during a tough time helped the Dervish family in their own recovery process.\n“I feel terrific,” Dolgun Dervish said. “We might open again. You never know.”", "url": "https://apnews.com/650e6b8278194396accb978a080c4f5c"}