{"authors": ["Taylor Stuck The Herald-Dispatch Tstuck Heralddispatch.Com"], "date_download": "2020-05-04 20:18:40", "date_modify": "2020-05-04 20:18:40", "date_publish": "2018-11-06 10:20:29", "description": "HUNTINGTON — A long with the usual sounds of students meeting up with friends and the patter of water from the Memorial Fountain, the Marshall University Memorial Student Center plaza Monday was...", "filename": "_905334479da147449de28e679703d9df_1588623520.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_905334479da147449de28e679703d9df_1588623520.html", "title": "Marshall students build habitat walls for Highlawn home", "title_page": "Marshall students build habitat walls for Highlawn home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON — A long with the usual sounds of students meeting up with friends and the patter of water from the Memorial Fountain, the Marshall University Memorial Student Center plaza Monday was filled with the sounds of hammers hitting nails.\nStudents with the university chapter of Habitat for Humanity were building walls for a new home to be built in the Highlawn neighborhood alongside the future homeowner. Students also were able to leave encouraging notes to the homeowner on a “blessings board.”\n“This will continue to benefit the city of Huntington, even after we graduate,” said Taylor Burke, vice president of the Marshall student chapter and senior psychology major.\nThe wall build was both a practical event and a way to raise awareness for both the campus chapter and the Huntington WV Area Habitat for Humanity, said David Michael, executive director/CEO of the Huntington WV Area Habitat for Humanity.\n“It helps us out in a few different ways,” Michael said. “It’s an awareness piece but it also gets students involved, particularly here on campus, who have never thought about doing anything with Habitat before.”\nThe first wall build Habitat did at Marshall was during Week of Welcome in 2017, Michael said. The organization also has done them in coordination with fundraisers, such as the most recent at Direct TV off 5th Street Hill in Huntington. The employees raised money for the home and then got the chance to build the wall.\nThe student chapter is working to build membership, Burke said, with hopes it will be able to continue once the seniors graduate in May. Instead of meeting on campus, the group meets at volunteer sites, including the ReStore, to really get involved.\nBurke said students who want to make a lasting impact on Huntington should volunteer.\n“It’s nice to be able to actually see the effects you are making,” she said.\nThe students also will help raise the walls they built on Dec. 5.\nStudents who would like to join the student chapter can email club president Courtney Farmer at farmer73@marshall.edu or Burke at burke75@marshall.edu.\nCommunity members can support the Huntington Habitat by shopping/donating at the Huntington ReStore on Veterans Memorial Boulevard, donate funds or volunteer. No construction experience is required. Volunteers must be 16 years old or older.\nFollow reporter Taylor Stuck on Twitter and Facebook @TaylorStuckHD.", "url": "https://apnews.com/905334479da147449de28e679703d9df"}