{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:27:34", "date_modify": "2020-05-04 20:27:34", "date_publish": "2018-12-17 05:01:01", "description": "CHARLESTON - The West Virginia Department of Arts, Culture and History (WVDACH) invites families to the West Virginia State Museum at the Culture Center, State Capitol Complex in Charleston during...", "filename": "_cfd32d44b3d5422c80dc7a8bc28324f3_1588624054.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cfd32d44b3d5422c80dc7a8bc28324f3_1588624054.html", "title": "WV State Museum to host holiday activities", "title_page": "WV State Museum to host holiday activities", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLESTON - The West Virginia Department of Arts, Culture and History (WVDACH) invites families to the West Virginia State Museum at the Culture Center, State Capitol Complex in Charleston during the holidays for fun family activities. The activities, including making a seasonal picture frame to take home, necklaces and New Year’s Day hats, will take place in the museum education classroom, Wednesday Friday, Dec. 26 28, from 10 a.m. 3 p.m.\nThe West Virginia State Museum also hosts other special youth activities throughout the year, including Saturday family programs and afterschool activities for students and parents. Every Saturday of the month beginning Jan. 1, 2019, from 10 a.m. 3 p.m., the museum education classroom will feature games and fun for the whole family. Themes for the day include classic board games, retro video games, old-time games and a West Virginia trivia game.\nThe West Virginia State Museum’s operating hours are Tuesday through Saturday from 9 a.m.until 5 p.m.\nThese programs are free and open to the public. For more information about all education programs at the State Museum, call Chris Reed, museum education specialist for the department, at 304-558-0220 or Chris.J.Reed@wv.gov.\n- The Herald-Dispatch", "url": "https://apnews.com/cfd32d44b3d5422c80dc7a8bc28324f3"}