{"authors": [], "date_download": "2020-05-04 16:58:58", "date_modify": "2020-05-04 16:58:58", "date_publish": "2018-03-28 14:25:50", "description": "Our team reviewed luxury sheets and found Parachute, Snowe, Riley Home, Crane & Canopy, Boll and Branch, and Brooklinen are actually worth the price.", "filename": "2018_03_28_cnn-underscored_best-luxury-linen-shop_index_1588611538.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180807164841-underscored-newlead-luxurylinens-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2018_03_28_cnn-underscored_best-luxury-linen-shop_index_1588611538.html", "title": "Luxury linens that are worth the price", "title_page": "Parachute, Boll and Branch, Brooklinen review: Which luxury linens are worth the price \n - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Story highlights We tested different luxury linen brands and found six that are worth the price\nOur top sheets were from Parachute, Snowe, Riley Home, Crane & Canopy, Boll and Branch, and Brooklinen\nBy now, you probably already know just how easy it is for your sleep schedule to get compromised. Whatever it is -- whether you're pulling all-nighters for work, losing an hour of z's to Daylight Savings or waking up earlier than usual for a morning workout -- life always seems to get in the way of you and your beauty sleep.\nSimple swaps, however, can help you make the most of your time in bed. Take your linens, for example. Investing in luxury linens can help you stay cool and comfortable throughout the night, leaving you less prone to overheating and waking up in the middle of the night. On the opposite end of the spectrum, if you're a cold sleeper, the right duvets and sheets can keep you warm and cozy.\nIt's a relatively straightforward investment that could help you reap big benefits.\nOf course, high-quality linens don't come cheap. To help you navigate which brands are actually worth their price tags, our team reviewed different brands. Ahead, find out our top picks and whether they fit your sleeping style.\nBoll & Branch\nBoll & Branch is a direct-to-consumer brand that specializes in a chemical-free supply chain. Its GOTS certification -- which ensures that dangerous chemicals and dye runoff don't affect farming and local populations or contaminate water systems -- is a testament to this. Eco-conscious shoppers can rest easy knowing that throughout the entire life cycle of the sheets, extra steps are taken to ensure the product is pure and chemical-free.\nThe company's bread and butter is its luxurious cotton sheets (although it also sells a number of cozy essentials including towels, throws, pillows and duvets). These come in a number of colors and sizes, and the sheet sets start at $200.\nWhen we tested out Boll and Branch's sheets, we were impressed by the color and overall style. The fit was great on a bed that had both a thick mattress and a topper. The sheets were a little stiff at first but got softer after each wash, making them hold up in the long run. Our tester considers herself a relatively warm sleeper, and thought the sheets were comfortable and not too cold. She noted that \"I find they aren't super cold, so when I slide into bed, they aren't a shock to my system (as I don't like cool sheets). They're a solid middle-ground; I'm not too cold, but I also don't sweat because of them either.\"\nIf you find yourself in the same predicament, and need sheets that are not too hot and not too cold, we recommend the Hemmed Sheet Set (starting at $160; bollandbranch.com), which is our favorite, as well as the site's most popular offering.\nParachute\nFor cold sleepers, consider investing in linen instead of cotton. Linen is known for its moisture-wicking properties, so you'll stay dry (while still feeling warm) throughout the year. For those prone to overheating at night, linen is great at regulating temperature and keeping the bedding as breathable as possible. Linen sheets are good for those who don't mind a bit more lax look to their bedrooms, as they do tend to wrinkle.\nWhen our resident cold sleeper tested linen sheets, Parachute's Venice Bedding Set (starting at $359; parachutehome.com) came out on top. Parachute also takes its organic production process seriously. The brand has gained an impressive Oeko-Tex certification, which means rigorous checks must be done while producing the sheets in order to ensure overall quality. It's an even higher designation than organic. The Venice Bedding Sheet also gives back with every purchase to Nothing But Nets, an organization that donates life-saving malaria bed nets to those in need.\nDuring our review, our tester was impressed by how cool the sheets felt for the duration of the night. She noted, \"I tend to toss and turn a lot at night, and get very restless if I'm not completely cool. It's why cotton sheets have been so fickle for me over the years. But when I switched over to this linen set, I've noticed a real increase in my sleeping quality. I feel cool throughout the night. The laid-back aesthetic of the sheet set also perfectly suits me; I'm not bothered by a wrinkle (or three) and think it adds a little more charm to my space.\"\nParachute also produces sheets for all types of sleepers. It offers a Sateen Sheet Set (starting at $129; parachutehome.com) which is more silky and warm in addition to a Percale Sheet Set (starting at $109; parachutehome.com) which is characterized as crisp, all-weather bedding.\nBrooklinen\nAnother top contender that's Oeko-Tex certified and is a solid cotton sheet for both warm and cold sleepers is Brooklinen's Luxe Hardcore Sheet Bundle (starting at $219; brooklinen.com). Brooklinen is a direct-to-consumer brand that delivers high-quality sheets with a reasonable price tag. It focuses on the small aspects of the production process that ultimately create sheets that are soft and can stand the test of time. For instance, Brooklinen utilizes long cotton fibers, which retain the fabric's strength and softness. Meticulous weaving gives its sheets their signature texture.\nOur editors recently tested the Luxe Hardcore Sheet Bundle and quickly realized the sheets were a game-changer for both warm and cold sleepers. Available in a number of colors, this premium 480 thread-count set feels smooth to the touch and doesn't overheat you while you sleep. It came as no surprise to us that it's a best-seller on the site, with an average rating of 4.7 out of 5 stars from more than 50,500 customers.\nAs for the brand's duvets, we were equally impressed. The handmade all-season down comforter got 5-star ratings from over 1,400 satisfied customers. As our tester noted, \"It's so fluffy (and lightweight), you'll totally feel like you're sleeping in a hotel while you slumber.\"\nPeacock Alley\nPeacock Alley is a company with a long tradition — over 40 years — of creating classic, quality products that aim to add luxury to your everyday life. And though its linens are pricier than others on this list, they're definitely worth the cost.\nWe tested two of the brand's bestselling options: the Lyric Percale Sheet Set (starting at $740; peacockalley.com) and the Soprano Sateen Sheet Set (starting at $405; peacockalley.com). If you're wondering about the main differences between percale and sateen, Peacock Alley breaks it down simply: Percale is lighter and more breathable, while sateen is the thicker, smoother and more snuggly option. While that's the most simple way to position these options, they're anything but basic.\nBoth sheet sets include one flat sheet, one fitted sheet and two pillow cases, though you also have the option of purchasing the sheets on their own. Our tester loved how breathable and crisp, yet super soft, the Lyric Percale Sheets were during the past couple of warmer months. They're made from a 100% extra long-staple cotton, imported from Italy, and feature a 500-thread count. The sheets are softer after each wash, which is a huge bonus in knowing your investment in such high-quality bedding is going a long way.\nAs its been getting cooler, our tester has been able to compare the percale sheets to the Soprano Sateen Sheet, which have become \"almost synonymous\" with the Peacock Alley brand. Made from 100% extra long-staple cotton that's imported from Portugal, the sateen sheets are heavier than the percale option. Our tester noted how buttery, silky and luxurious these felt, and mentioned that they're the type of sheets that make it tough to get out of bed.\nAnd though there's no arguing that Peacock Alley's linens are definitely luxurious, we'll be hard pressed to believe you won't fall in love with your investment.\nCrane & Canopy\nCrane & Canopy has been making bedding since 2012 that not only feels luxe, but also saves you time. Swapping out duvet covers is a notoriously annoying process, but the company's signature Nova duvet cover (starting at $139; craneandcanopy.com) simplifies things by placing a hidden zipper in the middle of the cover in lieu of the standard bottom button closure. The Nova duvet's color blocking and strategically placed piping mimic the look of a perfectly folded flat sheet without the hassle of actually, well, perfectly folding a flat sheet — creating the appearance of a crisply made bed in no time at all.\nReviewers praise Crane & Canopy's inclusion of thoughtful details like this, along with its commitment to using quality materials and its range of designs to suit any aesthetic. While many luxury linen brands stick to neutral tones, Crane & Canopy's Oeko-Tex certified sheets and duvets come in a huge range of colors and prints — everything from polka dots, stripes and herringbone to embroidery and borders. And don't worry: the company hasn't sacrificed comfort in the name of looks. The 400 thread count sateen sheet sets (starting at $149; craneandcanopy.com) are woven from premium extra-long staple cotton for a silky smooth feel against your skin. Breathable linen sheet sets (from $149; craneandcanopy.com) are woven from 100% Belgian flax that gets softer with every wash.\nCrane & Canopy also offers sets that don't include a top sheet (from $89; craneandcanopy.com) — allowing those of us who (correctly) forego unnecessary top sheets the chance to save money by bundling products without paying for something we'll never use.\nRiley Home\nRiley Home works exclusively with fourth-generation family-owned textile mills in Portugal, which allows it to ensure that its products are high quality and ethically made by artisans paid a living wage.\nLike Crane & Canopy, Riley offers Oeko-Tex certified sateen and percale sheet sets, both of which are made from 100% long staple Egyptian cotton. Those looking for cool crispness should check out the percale sheet set (from $149; rileyhome.com), while those who value smoothness will love the sateen sheet set (from $149; rileyhome.com). Chances are, you'll be pleased with whichever one you ultimately go with: Both sheets boast a 5-star rating from a combined 1,000 reviews. One happy customer deems the \"decadent\" sateen set \"so soft and comfortable I don't think I'll ever buy sheets anywhere else again!\"\nRiley's towels and bathrobes are beloved as well, with its lush spa towels (from $19; rileyhome.com) and hooded waffle robe ($109; rileyhome.com) earning particular raves.\nSnowe\nAnother Oeko-Tex certified brand, Snowe offers highly-rated percale, sateen and linen sheet sets, along with smooth duvet covers and cloudlike down comforters. The company's best-selling 500 thread count percale sheets (starting at $200; snowehome.com) are made in Italy from long staple Egyptian cotton, creating a super crisp, high-end feel. \"It feels like I'm staying in a hotel every night,\" one customer says; another self-proclaimed \"sheet snob\" declares them \"the best sheets at the best price we have tried.\"\nThe ultrafluffy down comforter (starting at $250; snowehome.com) is another great buy; it comes in a choice of two fills for warm and cool sleepers (lightweight and all season), and can even be machine washed and dried. If you're up for a full bedding overhaul, the Starter Sleep Bundle (starting at $375; snowehome.com) includes a fitted sheet, flat sheet, two pillowcases and a duvet cover. If the reviews are any indication, it's worth the investment: One customer raves that after buying the Sleep Bundle, \"I literally have been sleeping an extra hour every day!\"\nSnowe's bedding comes with a 90-day trial period, during which you can send them back for a full refund in you're not satisfied — but with their hundreds of 5-star reviews, you almost certainly will be.\nNote: The prices below reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2018/03/28/cnn-underscored/best-luxury-linen-shop/index.html"}