{"authors": ["Matthew Leblanc"], "date_download": "2020-05-04 20:25:08", "date_modify": "2020-05-04 20:25:08", "date_publish": "2018-12-14 05:00:01", "description": "Allen County jurors convicted Bryan Flowers on Thursday of shooting to death a man last year outside an apartment complex in southeast Fort Wayne. The Dec. 23 slaying was captured on...", "filename": "_cbc98907124d4a36b2b97fd98f6b8bed_1588623908.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cbc98907124d4a36b2b97fd98f6b8bed_1588623908.html", "title": "Suspect guilty of murder", "title_page": "Suspect guilty of murder", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Allen County jurors convicted Bryan Flowers on Thursday of shooting to death a man last year outside an apartment complex in southeast Fort Wayne.\nThe Dec. 23 slaying was captured on surveillance video, and witnesses testified at the trial this week. DNA from a cigarette left at the scene also tied Flowers to the crime. A man who was at the party testified that he saw Flowers argue with and point a gun at De’andre Voss, 32, about 4 a.m.\nVoss was shot in the left cheek, and the bullet traveled downward and severed his spinal cord, forensic pathologist Dr. Scott Wagner said Thursday. He died instantly, Wagner testified.\nFlowers, 35, was arrested in April, and his trial began Tuesday in Allen Superior Court.\nProsecutors argued for three days the case was clear-cut. The video shows the shooting, the DNA evidence ties him to the crime, and testimony from Javon Rolan : the man who saw Flowers with the gun, a 9 mm Glock pistol : proves Flowers killed Voss, they said.\n“There is no evidence ... that shows it was anyone else,” Allen County Deputy Prosecutor Adam Mildred said.\nDefense attorney Stanley Campbell disagreed, saying there are possibilities prosecutors didn’t consider.\nMaybe Rolan shot Voss outside building 2A at the Villages of Hanna complex, he said. Campbell insisted the surveillance video was not continuous and included gaps of about 1.8 seconds between frames.\nA lot can happen in that time, he argued, using a basketball analogy in which a player sinks a last-second shot to win the game.\nRolan initially told investigators he didn’t see what happened : a move that prosecutors said was prompted by warnings from Flowers, whom Rolan said was “a father figure.”\n“Here’s the problem,” Campbell said, “Javon Rolan has no credibility. He is a liar.”\nJurors : six men and six women : sided with prosecutors, however. They deliberated for about 21/2 hours before returning the verdict and also added an enhancement because he used a firearm to commit the crime.\nMurder carries a penalty of up to 65 years in prison, and the enhancement could add more time behind bars.\nFlowers, dressed in a white shirt with a striped tie, shook his head slowly when the verdict was read. A few minutes later, he said the trial was unfair and was told by Allen Superior Court Judge Fran Gull and a bailiff to be quiet.\nA motive for the killing remains ambiguous.\nRolan said Voss and Flowers argued after leaving the party on the second floor of the building. Court documents said someone spilled alcohol at the party and Voss asked them to leave.\nMildred quoted Rolan as saying the killing was a result of “stupid drunk (expletive).”\nAfter the shooting, Flowers dropped a cigarette butt and got into a green-and-beige van and drove away. The vehicle was registered to Flowers, and police found it at the complex hours after Voss was killed.\nA DNA analyst testified Wednesday that DNA on the cigarette butt was a trillion times more likely to have come from Flowers than anyone else.\nA sentencing hearing is scheduled for Jan. 11.\nmleblanc@jg.net", "url": "https://apnews.com/cbc98907124d4a36b2b97fd98f6b8bed"}