{"authors": ["Ron Shawgo"], "date_download": "2020-05-04 20:05:57", "date_modify": "2020-05-04 20:05:57", "date_publish": "2018-10-25 05:00:01", "description": "With their waistlines showing little or no change, Indiana's children continue to rank high in obesity. Among people ages 10 to 17, 17.5 percent are obese, placing Indiana 11th highest among...", "filename": "_e50da90b5d2945659842c42de3ed91a2_1588622757.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e50da90b5d2945659842c42de3ed91a2_1588622757.html", "title": "State 11th in childhood obesity", "title_page": "State 11th in childhood obesity", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With their waistlines showing little or no change, Indiana’s children continue to rank high in obesity.\nAmong people ages 10 to 17, 17.5 percent are obese, placing Indiana 11th highest among the states, according to a report released Wednesday by the Robert Wood Johnson Foundation. There was no statistically significant change from the year before, when 18.5 percent of children were reported obese. The state’s ranking also remained unchanged.\nThe Indiana State Department of Health does not comment on studies done by outside parties, spokeswoman Megan Wade-Taxter said in an email. “But we can say that obesity is a concern for children and adults in Indiana,” she said.\nWade-Taxter noted initiatives the department has to reduce child obesity, such as working with schools to add more physical activity and healthier foods for students, promoting Walk to School Day and increased emphasis on identifying client nutritional risks in the Women, Infants and Children program. That program also encourages breastfeeding, known to reduce the risk of obesity in children, she said.\nDr. Deborah McMahan, Fort Wayne-Allen County health commissioner, outlined the health risks involved if obesity is unchecked.\n“The high rates of childhood obesity create not only short-term health issues but portend long-term issues as well, including early onset of diabetes and all of the accompanying complications, joint problems and other chronic health issues,” she said in an email. “As health care providers, we will have to likely adjust screening for early detection for some of these chronic health issues associated with obesity.”\nNationwide, 15.8 percent of young people were obese. Mississippi had the highest rate, at 26.1 percent, and Utah had the lowest, at 8.7 percent, according to the report. The data come from the 2016 and 2017 National Survey of Children’s Health, with analysis by the Health Resources and Services Administration’s Maternal and Child Health Bureau.\nOnly North Dakota had a statistically significant change in child obesity, dropping from 15.8 percent to 12.5 percent.\n“Childhood obesity continues to be a major public health challenge, with significant financial and societal implications,” Jamie Bussel, senior program officer at the Robert Wood Johnson Foundation, said in a news release. “Far too many young people in this country are facing increased chances of diabetes, heart disease, and high blood pressure, all due to a preventable condition. And black and Latino youth are still more likely than their white peers to face these problems. We must help all children grow up at a healthy weight, so they can lead healthy lives, and save the nation billions in health care costs.”\nScientists predict that more than half of today’s children will be obese by age 35 if current trends continue, according to the report.\nMeanwhile, Hoosier adult obesity keeps growing. A little more than a third of adults were obese last year, compared with 32.5 percent the year before. Indiana is ranked 12th highest for adult obesity.\n“Some experts believe that obesity is more prevalent in communities with higher rates of poverty : that would make sense because cheaper foods are usually higher in calories,” McMahan said. “And of course, places with large areas of poverty usually are associated with food deserts, which compounds the issue of access to healthy food. One would hope that with more stores and entities like Amazon improving access to healthy foods via nontraditional methods like home delivery, we may be able to finally address the issue of uneven access to foods that promote healthy weight and strong productivity in our youth.”\nrshawgo@jg.net", "url": "https://apnews.com/e50da90b5d2945659842c42de3ed91a2"}