{"authors": ["Daily Inter Lake"], "date_download": "2020-05-04 20:15:57", "date_modify": "2020-05-04 20:15:57", "date_publish": "2018-01-24 05:00:01", "description": "Flathead County posted a 5.6 percent unemployment rate for the month of December 2017, a slight increase from a 5.4 percent jobless rate reported in November. Area counties also saw their...", "filename": "_4152a6de376d4954b4e04548d38b9511_1588623357.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4152a6de376d4954b4e04548d38b9511_1588623357.html", "title": "Flathead County unemployment rate up slightly", "title_page": "Flathead County unemployment rate up slightly", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Flathead County posted a 5.6 percent unemployment rate for the month of December 2017, a slight increase from a 5.4 percent jobless rate reported in November.\nArea counties also saw their jobless numbers increase slightly. Lincoln County increased from 8 to 8.7 percent. Sanders County posted 7.8 percent unemployment in December, up from 7.2 percent in November; and Lake County rose from 4.3 to 4.6 percent.\nMontana’s unemployment rate moved to 4.1 percent for the month of December, ticking up slightly by from 4 percent in November to end 2017 despite strong payroll employment gains at the second fastest in the nation. The U.S. unemployment rate remained at 4.1 percent.\n“Montana is starting off the new year with Montana workers, businesses, and communities benefiting from our strong economy and rising wages,” Gov. Steve Bullock said in a prepared statement. “Montana added nearly 4,000 payroll jobs in the last month, making Montana the second fastest state in the nation for payroll employment growth.”\nPayroll employment increased by 3,900 over the month, the strongest payroll job gains since January 2015. Despite the strong payroll employment growth, the unemployment rate ticked up slightly because model estimates indicate that total employment (which includes payroll jobs plus the self-employed and agricultural workers) remained fairly level over the month.\nUnemployment rate and employment estimates are revised each year in February in a process called benchmarking, which typically results in more accurate estimates and that likely will resolve conflicts between total and payroll employment trends.", "url": "https://apnews.com/4152a6de376d4954b4e04548d38b9511"}