{"authors": ["Fernando Del Valle", "Staff Writer"], "date_download": "2020-05-04 20:07:13", "date_modify": "2020-05-04 20:07:13", "date_publish": "2018-02-27 16:57:00", "description": "HARLINGEN — TV host Hilda Reyna is singing gospel. Reyna, known for her Spanish love songs, is headlining the New Life concert Saturday. “God put it in my heart,” Reyna, who hosts the...", "filename": "_82e99bdf7a3e48d2865279e10f57e490_1588622833.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_82e99bdf7a3e48d2865279e10f57e490_1588622833.html", "title": "TV host to sing gospel concert", "title_page": "TV host to sing gospel concert", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HARLINGEN — TV host Hilda Reyna is singing gospel.\nReyna, known for her Spanish love songs, is headlining the New Life concert Saturday.\n“God put it in my heart,” Reyna, who hosts the TV show La Rancherita and Friends, said Friday. “I’m doing it with an attitude of gratitude. I’m grateful to God. I like gospel music because it’s positive. It has positive messages — lyrics.”\nThe concert’s line-up includes Pistoleros De Cristo and Rosie Gonzalez.\nReyna said her career has included gospel songs.\n“I’m a cross-over singer,” she said. “I never stopped singing gospel.”\nGospel music helps her better express life experiences, Reyna said.\n“It’s usually based on true stories — testimonial experiences,” she said. “It’s the closest (genre) for expressing testimonials and God’s love and power.”\nReyna said she wants to share God’s message of love with her fans.\n“As a songwriter, I try to put a positive message in my songs,” she said. “The message is to spread positive messages to my audience. If you include God in your plans, most definitely you will succeed.”\nThe concert is set for 6 p.m. Saturday at Spirit of Praise Church, 25674 Lewis Lane in Harlingen.\nFor more information, call 956-792-3343.\nfdelvalle@valleystar.com", "url": "https://apnews.com/82e99bdf7a3e48d2865279e10f57e490"}