{"authors": ["Bill Novak", "Wisconsin State Journal"], "date_download": "2020-05-04 20:12:50", "date_modify": "2020-05-04 20:12:50", "date_publish": "2018-04-30 17:30:00", "description": "Three people were hit by paintballs Sunday evening in Downtown Madison, allegedly fired from a car with five young males inside, one of the young men arrested for the shootings. Alex Ziobro,...", "filename": "_ced33493a16d47c8ad4ebfab8ceec244_1588623170.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ced33493a16d47c8ad4ebfab8ceec244_1588623170.html", "title": "Random paintball shootings Downtown land Prairie du Sac man in jail", "title_page": "Random paintball shootings Downtown land Prairie du Sac man in jail", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Three people were hit by paintballs Sunday evening in Downtown Madison, allegedly fired from a car with five young males inside, one of the young men arrested for the shootings.\nAlex Ziobro, 21, Prairie du Sac, was arrested on a tentative charge of second-degree reckless endangerment, and three teens under 18 in the car were ticketed for unlawful possession of a paintball gun.\nThe incident happened at about 7 p.m. Sunday in the West Johnson Street/Wisconsin Avenue/North Lake Street area.\n“The first victim, a 19-year-old Madison man, was talking with friends when a car drove past and someone inside the car fired a paintball, hitting him in the head,” said police spokesman Joel DeSpain.\nMoments later, two more 19-year-old Madison men were hit by paintballs fired from the car, one victim hit in the backpack and one hit in the leg.\n“The two victims got the car’s license number,” DeSpain said. “A patrol officer spotted the car near Langdon Street and pulled it over.”\nThe five people in the car had four paintball guns and ammunition.\n“All said they just purchased the guns and were planning to use them at a designated paintball range, but for some reason they decided to cruise around Downtown and on the isthmus,” DeSpain said.", "url": "https://apnews.com/ced33493a16d47c8ad4ebfab8ceec244"}