{"authors": [], "date_download": "2020-05-04 20:14:19", "date_modify": "2020-05-04 20:14:19", "date_publish": "2018-02-21 23:45:40", "description": "Food and beverage events Detroit Restaurant Week: Two dozen Detroit restaurants will offer three-course meals for either $39 or $29. Through Sunday. detroitrestaurantweek.com. Royal...", "filename": "_7558dce1468842e8a4dd1120db402c31_1588623259.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7558dce1468842e8a4dd1120db402c31_1588623259.html", "title": "Upcoming chef dinners, wine events, beer fests and more", "title_page": "Upcoming chef dinners, wine events, beer fests and more", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Food and beverage events\nDetroit Restaurant Week: Two dozen Detroit restaurants will offer three-course meals for either $39 or $29. Through Sunday. detroitrestaurantweek.com.\nRoyal Oak Restaurant Week: More than 20 participating restaurants in downtown Royal Oak will offer three-course lunch or dinner for $15, $25 or $35 per person. Friday-March 4. dineroyaloak.org/events.\nFrisky Whiskey at Saint Andrew’s Hall: Tickets include 10 whiskey samples, plus burlesque entertainment, DJ and live painting from area tattoo artists. 7 p.m. Thurs. $50 at the door. 431 E. Congress, Detroit. (313) 961-8961.\nJolly Pumpkin Bière Dinner at Chapman House: This collaborative dinner includes seven courses paired with Jolly Pumpkin sour beers. 7 p.m. Thurs. (doors at 6 p.m.). $100 per person. 311 Walnut, Rochester. exploretock.com/chapmanhouse.\nFELT LIKE at Frame Restaurant: Chef Craig Lieckfelt pop ups with his soup company inside Frame, a restaurant with a revolving chef inside Hazel Park’s Joebar. Lieckfelt will be joined by craft cocktail master Marlowe Johnson for beverage pairings. The chef will donate some soup to Forgotten Harvest for every ticket purchased. 6 p.m. Fri.-Sun. $60, $30 additional for beverage pairing. 2389 John R, Hazel Park. framehazelpark.com.\nChef Max Hardy at House of Pure Vin: Chef Maxcell Hardy of River Bistro in Detroit will serve a three-course southern meal paired with wine from black winemakers chosen by master sommelier Claudia Tyagi and certified sommelier Michael Calvert. 5-8 p.m. Sun. $75. 1433 Woodward, Detroit. houseofpurevin.com.\nWinter Chef Series with Lena Sareini and Michael Conrad at Gather: Selden Standard pastry chef Lena Sareini and Michael Conrad of Takoi will take over the kitchen at Gather for five course meal. This is the last dinner in this series. 5:30 and 8 p.m. Mon. $60 per person. 1454 Gratiot, Detroit. Eventbrite.com.\nNapa vs. Sonoma Wine Seminar and Dinner at Rugby Grille: This interactive wine dinner is led by sommerlier Nidal Daher and includes a three-course menu. 6:30 p.m. Feb. 28. $95, plus tax and tip. Reservations required. 100 Townsend, Birmingham. (248) 642-5999.\nV313: Detroit’s Premiere Vegan Celebration at Eastern Market: Try a variety of food from local vegan chefs, restaurants and vendors, plus live music, games and speed-dating. 3-9 p.m. March 8. $15. Shed 5, 2934 Russell, Detroit. V313.info.\nEmpty Bowls Detroit at Eastern Market: A fundraiser for Cass Community Social Services, this soup-fest features food from 20 local restaurants, plus beer, wine and desserts. 5-10 p.m. March 9. $40, $100 for sponsors. Shed 5, 2934 Russell at Alfred, Detroit. emptybowlsdetroit.com.\nHard Cider and Honey Pairing at Blake’s Orchard: A benefit for nonprofit organization Bees in the D, this event pairs a flight of Blake’s Hard Cider products with five local honeys. The event also includes a tasting of a not-yet-released Blake’s cider. 7-10 p.m. March 9. $44.28. 71985 Armada Center, Armada. Eventbrite.com.\nWinter Beer Carnival at Chevrolet Plaza at Little Caesars Arena: Michigan craft beer, lawn games, giant Jenga, carnival games, food trucks and more. 1-5 p.m. March 10. $40. 2645 Woodward, Detroit. detroitbeercarnival.com.\nCooking Class Series at the Root Restaurant & Bar: Learn to cook with executive chef Nick Rodgers. The first class at 11 a.m. March 12 covers soup, followed by brunch food on April 2, seafood on April 9 and pickle and charcuterie basics on April 16. $75-$100 per person, per class. 340 Town Center, White Lake. Reserve by calling (248) 698-2400.\nBell’s Brewing Beer Dinner at HopCat Royal Oak: A four-course, ballpark-themed dinner paired with five Bell’s beers. 5:30 p.m. March 20. $31.80. 208 W. Fifth, Royal Oak. Eventbrite.com.\nWhisky Experience 2018 at Eastern Market: A benefit for the Luella M. Harden Foundation, which raises money for college scholarships and contributes to the Leukemia Society, this spirit-tasting event has samples, swag, some food and more. 5:30-9:30 p.m. April 20. $54.84, $75.95 for VIP. Eastern Market, 2934 Russell, Detroit. facebook.com/luellamhardenfoundation.\nChef’s Schoolyard Dinner at Great Lakes Culinary Center: A benefit for Detroit Prep, this first annual dinner is a collaboration between local chefs John Vermiglio, James Rigato, Anthony Lombardo, Brad Greenhill, Joe Giacomino, Andy Hollyday, Kate Williams and Alex Clark. 6-9 p.m. April 30. $250. 24101 W. Nine Mile, Southfield. detroitprep.org/schoolyard.\nDetroit Sushi Festival at Eastern Market: Food from local sushi restaurants and vendors of Japanese of culture. Aug. 24. $27, $54 VIP. Shed 5, 2934 Russell, Detroit. Tickets on sale Feb. 28 at detroitsushifest.com.\nRestaurant briefs\nForbes Honors: The 2018 Forbes Travel Guide is out, rating luxury hotels across the globe. This year the Townsend Hotel once again earned a four-star rating. MGM Grand Detroit and its Wolfgang Puck Steak restaurant were given four stars, as well. The list also gave a “recommended” rating to MotorCity Casino and Hotel’s Iridescence restaurant and the Townsend’s Rugby Grille. MotorCity’s Hotel was inspected by Forbes, but is not yet rated.\nMulefoot to become Hiram’s Tavern: Mulefoot Gastropub (244 E. Third in Imlay City) will transition to a more casual bar and restaurant called Hiram’s Tavern. Mulefoot exits April 28 and the new concept will debut May 2.\nMelody Baetens", "url": "https://apnews.com/7558dce1468842e8a4dd1120db402c31"}