{"authors": ["Rob Rossi"], "date_download": "2020-05-04 20:10:30", "date_modify": "2020-05-04 20:10:30", "date_publish": "2018-03-31 02:00:56", "description": "Sidney Crosby and Alex Ovechkin might meet again in Round 2 of the Stanley Cup playoffs. We should be so lucky. Of course, some people would have us believe this possibility begins and ends...", "filename": "_dbea3e6f54ad4b71b122d09960c0921d_1588623030.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dbea3e6f54ad4b71b122d09960c0921d_1588623030.html", "title": "With Crosby vs. Ovechkin more often, NHL's playoff format works", "title_page": "Rob Rossi: With Crosby vs. Ovechkin more often, NHL's playoff format works", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sidney Crosby and Alex Ovechkin might meet again in Round 2 of the Stanley Cup playoffs. We should be so lucky.\nOf course, some people would have us believe this possibility begins and ends any debate about the NHL’s current postseason format. And those people are correct.\nWell, those people are sort of correct.\nA third second-round showdown between the clubs captained by the two most famous hockey players of this generation definitively should prove the NHL improved what was already professional sports’ greatest yearly tournament. But such a declaration surely will not gain favor amongst critics who have blasted the postseason format since the NHL instituted it for the 2014 playoffs.\nOh well.\nCommissioner Gary Bettman got this one right, folks.\nBefore that 2014 postseason, Crosby and Ovechkin faced off in one best-of-seven series. Their duel in 2009 remains arguably the signature playoff series of the salary-cap era. Unfortunately, it was a one-and-done event, and the NHL was the biggest loser of the six-year lapse between Penguins-Capitals playoff series.\nWe’ve been given two of those series in the past four years. A third in five seasons would be icing on what we can all agree has been a delicious cake.\nIf you’re bored of Crosby vs. Ovechkin in the Stanley Cup playoffs, you’re not an educated hockey fan.\nIf you’re of the thought that Penguins-Capitals would have been a better Eastern Conference final than it was a Round 2 pairing each of the past two springs, you’re not seeing the big picture.\nA playoff series featuring Crosby and Ovechkin is the big picture for a NHL starved for mainstream attention. Any postseason format that increases the odds of NBC Sports getting a Penguins-Capitals series — as does this format — is best for the NHL’s business.\nWho cares when it happens so long as it happens?\nAs for the contention that Round 2 of hockey’s postseason shouldn’t overshadow the conference finals and the Cup Final ... please, spare such silliness. Some of the most memorable moments of the NHL’s past 30 postseasons have happened in Round 2.\nSteve Yzerman’s double-overtime winner in Game 7 from 1996 comes to mind. So does Keith Primeau’s fifth-overtime silencer from Game 4 in 2000. As for better days in Pittsburgh hockey, Round 2 was where: the Mario Lemieux-less Penguins rallied to eliminate the Rangers (1992); Marc-Andre Fleury capped Ovechkin in Game 7s (2009, ’16); and Darius Kasparaitis improbably extended Jaromir Jagr’s final season by beating Dominik Hasek like a rented mule (2001).\nWhat, did we forget about those great days for hockey?\nThe Stanley Cup playoffs tend to peak with Round 1. It is where clubs are freshest, where upsets are most likely, where drama is spread throughout 16 markets and where casual fans are most easily drawn into the drama that is playoff hockey.\nCasual fans weren’t sticking with playoff hockey prior to this current NHL format. The league had to do something to protect against turning off its already-small television audience in the month between Round 1 and the Cup Final.\nSetting up second rounds to feature likely series between division rivals was the way to go. Sacrificing possible sexier conference-final pairings was a risk worth taking, and is a risk worth continuing to take.\nIf the playoffs started Tuesday, favorites’ bets would be on the following second-round matches: Capitals-Penguins, Lightning-Bruins, Predators-Jets and Golden Knights-Sharks. There is too much parity in this NHL to guarantee any one of those Round 2 matchups, but either one could steal the show in the Stanley Cup playoffs.\nThe Penguins and Capitals stole the show in Round 2 the last two years. After 13 of 14 possible games between those clubs, nobody could complain.\nOK, that isn’t true. Fans of the Capitals complained.\nBut if you’re complaining about when your club loses in the Stanley Cup playoffs, you’re not not seeing the big picture, either.\nRob Rossi is a contributing columnist. Follow him on Twitter @Real_RobRossi", "url": "https://apnews.com/dbea3e6f54ad4b71b122d09960c0921d"}