{"authors": ["Angelique S. Chengelis", "The Detroit News"], "date_download": "2020-05-04 20:05:49", "date_modify": "2020-05-04 20:05:49", "date_publish": "2018-01-16 02:59:43", "description": "Michigan is coming off a largely disappointing 8-5 season in Jim Harbaugh's third season as head coach, and still, Vegas oddsmakers and early preseason prognostications think the Wolverines will...", "filename": "_164bd5931d354b3db1a02db0ef22faef_1588622749.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_164bd5931d354b3db1a02db0ef22faef_1588622749.html", "title": "Wolverines will have a tough road for success in 2018", "title_page": "Wolverines will have a tough road for success in 2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Michigan is coming off a largely disappointing 8-5 season in Jim Harbaugh’s third season as head coach, and still, Vegas oddsmakers and early preseason prognostications think the Wolverines will bounce back in a big way.\nThe Wolverines are 10-to-1 favorites to win the national championship, according to recently released odds from Westgate Las Vegas Sportsbook. Those are the fourth-best odds behind defending national champion Alabama (5-2), Clemson (6-1), and Georgia and Ohio State share 8-1 odds.\nIn the way-too-early Top-25 rankings that several publications like to share in January, Athon Sports ranks Michigan No. 7, while the Sporting News has the Wolverines at No. 17.\nSo why the optimism?\nPerhaps because Michigan returns nine of 11 starters on defense, highlighted by defensive ends Chase Winovich and Rashan Gary and linebacker Devin Bush, in addition to a young secondary that surpassed expectations during the 2017 season.\nIt is hard to say where the offense will go this fall. Brandon Peters was the starting quarterback as a redshirt freshman at the end of the season, but Michigan has added Ole Miss transfer Shea Patterson. Patterson does not yet know if he will be cleared by the NCAA for immediate eligibility, but he was the No. 1 quarterback recruit in the 2016 class and expectations are high. The quarterback room also includes talented freshman Dylan McCaffrey, who redshirted last fall, and early enrollee freshman Joe Milton.\nTarik Black was the team’s leading receiver when he injured his foot three games in and was lost for the season. He showed tremendous upside along with fellow freshman Donovan Peoples-Jones. Karan Higdon will be back at tailback along with Chris Evans and Sean McKeon and Zach Gentry are experienced tight ends.\nBut the biggest question remains the offensive line that will replace two starters and seems to have plenty of moving pieces to be partially resolved in spring practice.\nWhile the oddsmakers are confident, Michigan will play its three rivalry games – Notre Dame, Michigan State and Ohio State – on the road. Here’s a look at the Wolverines’ game-by-game schedule this fall.\nSept. 1 — Notre Dame\nA year after going 4-8, Notre Dame rebounded in a big way with a 10-3 record capped by a 21-17 victory over LSU in the Citrus Bowl. The Irish is the first of three rivalry games for Michigan this fall and all are on the road. The teams last played in 2014, a 31-0 victory by Notre Dame in South Bend, but Michigan coach Jim Harbaugh and Notre Dame coach Brian Kelly thought it vital for both programs to resume the series. Notre Dame’s defense will be a strength, as will Michigan’s. The Irish will sort out its quarterback competition involving Brandon Wimbush, Ian Book and Phil Jurkovec.\nSept. 8 — Western Michigan\nWestern Michigan was coming off a 13-1 season and the loss of coach P.J. Fleck to Minnesota before Tim Lester returned to his alma mater. Fleck’s 2016 season was a tough act to follow, and the Broncos were 6-6 last season, 4-4 in the Mid-American Conference in Lester’s first season. Lester was pleased with the Broncos’ recruiting hall during the early signing period. This will be the seventh meeting between Michigan and Western Michigan. They last played in 2011 and Michigan has a 6-0 series advantage.\nSept. 15 — vs. SMU\nThis will be SMU’s first game against a Big Ten team since playing at Wisconsin in 1965. The Mustangs were 7-6 last season including a bowl loss to Louisiana Tech. It was SMU’s first bowl appearance since 2012. They played in the wake of a coaching change from Chad Morris to Sonny Dykes. With the switch to Dykes comes a new staff, new schemes on both sides of the ball and that could lead to a choppy first season as the changes are put in place.\nSept. 22 — Nebraska\nHave you heard? Scott Frost is back at Nebraska and boy is the confidence high in Lincoln now that Frost is leading his alma matter. Frost most recently led Central Florida to an unbeaten season. His big-picture focus is getting Nebraska back to a consistently competitive program and that means getting the defense to play hard and physical, which is a hallmark of his teams. Nebraska was last in total defense in the Big Ten last year, and offensively it had its moments but not enough of them and finished at about the middle of the league.\nSept. 29 — at Northwestern\nThe Wildcats finished the 2017 season as one of the hottest teams in college football. The Wildcats earned their 10th win with a 24-23 victory over Kentucky in the Music City Bowl. They lose a couple key players, running back Justin Jackson and safety Godwin Igwebuike, and the status of quarterback Clayton Thorson, who suffered a torn ACL in the bowl game, is unclear. This will be his fourth year as a starter if he’s ready to go, but if he isn’t, coach Pat Fitzgerald will look to either T.J. Green or Andrew Marty.\nOct. 6 — Maryland\nThe Terps endured one injury setback after another at quarterback and as a result took a step back with a 4-8 record in D.J. Durkin’s second season as head coach. They were clobbered 66-3 at home by Penn State to finish the season. Still, things are looking up – how could they get any worse in terms of the quarterback situation – considering they were forced to use five different quarterbacks. Durkin was a defensive coordinator most recently at Michigan, so he knows his Maryland defense needs work after finishing last in the Big Ten in scoring defense (37.1 points) and second to last in total defense after yielding an average 419.4 yards a game).\nOct 13 — vs. Wisconsin\nNo one feels sorry for the Badgers’ defense that loses seven starts and a couple more impact players. After all, the offense returns a ton of talent. Alex Hornibook is back to quarterback a program that he helped lead to a 13-1 record last season, while talented freshman tailback Jonathan Taylor also is returning. And the Badgers have four top-notch receivers back – A.J. Taylor, Kendrick Pryor, Danny Davis and Quintez Cephus, who is coming back from a leg injury. The biggest loss on offense is All-American tight end Troy Fumagalli.\nOct. 20 — at Michigan State\nThis is the second of Michigan’s three rivalry games on the road. The Wolverines lone victory over Michigan State under Jim Harbaugh came in 2016 at Spartan Stadium, and he is eager to even the score and get the record to 2-2 against his in-state rival. As the Wolverines know, this won’t be easy. Michigan State bounced back in a big way from a 3-9 season and finished with a 10-win season that featured a win in Ann Arbor. Quarterback Brian Lewerke is back and is only getting better.\nNov. 3 — Penn State\nPenn State coach James Franklin has led the NIttany Lions to back-to-back 11-win seasons and capped the 2017 season with a 35-28 victory over Washington in the Fiesta Bowl. They move forward with some significant losses from last year’s team, most notably, running back Saquon Barkley and offensive coordinator Joe Moorhead, now the head coach at Mississippi State. Ricky Rahne is the new offensive coordinator and plans to stick with much of what Moorhead laid out. A big boost for Penn State is the return of starting quarterback Trace McSorley.\nNov. 10 — at Rutgers\nChris Ash is entering his third season and Rutgers fans are eager to finally see things turning in Piscataway. The Scarlet Knights have missed a bowl for three straight seasons. While the early part of their schedule is reasonable this fall, the final five games are against Northwester, Wisconsin, Michigan, Penn State and Michigan. Ouch. Giovanni Rescigno, who will be a redshirt senior, has started 11 games at quarterback but keep an eye on Tom Flacco, the walk-on transfer who played in 13 games at Western Michigan.\nNov. 17 — Indiana\nThe Hoosiers went 5-7 last season and they will look for progress this fall without several key players. While quarterback Peyton Ramsey is back and will be playing behind a fairly experienced offensive line, gone are linebacker Tegray Scales, wide receiver Simmie Cobbs and kicker Griffin Oakes.\nNov. 24 — at Ohio State\nMichigan got a look at quarterback Dwayne Haskins during the rivalry game last season. Haskins showed how much different a quarterback he is than J.T. Barrett. Haskins was 40-of-57 (70.2 percent) for 565 yards our touchdowns and one interception, but he is not the capable runner Barrett has been. It’s still possible Joe Burrow or Tate Martell could win the job. The Buckeyes will reload as usual, so don’t expect any dropoff.", "url": "https://apnews.com/164bd5931d354b3db1a02db0ef22faef"}