{"authors": ["Barry Adams", "Wisconsin State Journal"], "date_download": "2020-05-04 20:14:10", "date_modify": "2020-05-04 20:14:10", "date_publish": "2018-06-18 04:00:00", "description": "When Brad Werntz and 16 investors opened Boulders Climbing Gym in November 1996, they realized they probably built a facility that was too big for their needs. That sentiment was reinforced...", "filename": "_c9169fd9f3c4483e828aa2cc490056fd_1588623250.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c9169fd9f3c4483e828aa2cc490056fd_1588623250.html", "title": "After some lean years, Boulders Climbing Gym is booming and expanding", "title_page": "After some lean years, Boulders Climbing Gym is booming and expanding", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When Brad Werntz and 16 investors opened Boulders Climbing Gym in November 1996, they realized they probably built a facility that was too big for their needs.\nThat sentiment was reinforced a few months later when revenue at the 8,500-square-foot facility for one month in 1997 was just $250.\nThe first five years of the climbing business were lean, but the next five saw improvement to the bottom line. And in the last 11 years, it’s taken off for Werntz, who in 2015 added 3,000 square feet to the facility at 3964 Commercial Ave. near Stoughton Road and Highway 30.\nBut that expansion has done little to ease the pressure at the gym for Werntz, who doesn’t advertise birthday parties, has a waiting list for all of his youth programs and barely promotes the $10 to $20 day passes because it takes away from gym time for his more than 1,000 members, who pay $49 per month.\n“We’ve been primarily member-driven for the past two years,” Werntz said. “Everything we do to increase business in other ways upsets our members. So we’ve known we’ve needed to take some of the pressure off of this place to achieve the potential of it.”\nRelief is on the way — and in a big way that will dramatically alter the area’s robust climbing scene.\nWerntz, 52, who bought out his investors at the end of 2016, is building a 10,500-square-foot, $1.25 million gym in street-level space at the corner of South Carroll and West Doty streets in Downtown Madison. Once that opens as expected in October, Werntz will turn his efforts to an even more ambitious $6 million project that would add a 20,000-square-foot climbing gym on Madison’s Southwest Side. Werntz declined to identify an exact location for the facility but said it would be a stand-alone building that would blend in well with its surroundings and create a sense of place.\nThe Downtown gym will be for bouldering, which involves 14-foot-high walls, doesn’t require ropes or harnesses and focuses more on movement and holds. The Southwest Side gym, however, would include walls that tower over 50 feet high, more than double the height of those in the Boulders facility on Madison’s East Side. Werntz said construction could begin in spring of 2019 and be completed by summer of 2020.\n“We don’t want to be the anchor tenant of a concrete jungle,” Werntz said of the Southwest Side gym. “I’ve visited almost 100 climbing gyms in the country, and the ones that I remember are the ones (that) aren’t in strip malls, aren’t in parking lots and aren’t in industrial parks. We didn’t have that opportunity when we built our first gym, and we have it now, so we’re going to make sure we’re going to hit those marks.”\nSport reported to be growing nationwide\nClimbing gyms are on the rise, and the sport will get a major bump when it debuts at the 2020 Olympics in Tokyo. Already, there are more than 400 commercial gyms in the United States, according to the Climbing Gym Association. The sport grew by 10 percent in 2017, when 43 new commercial climbing gyms opened, the Climbing Business Journal reported in January. The new openings were nearly double that of 2016 and set a record for the number of gyms to open in a single year.\nBoulders is the largest climbing gym in Dane County and was one of the first commercial climbing gyms to open in the country.\nOther sports venues like trampoline parks or indoor soccer facilities have climbing walls, while Summit Strength & Fitness, 3118 Kingsley Way, offers classes and more technical and strength-based training programs. Its customers include many who also climb at Boulders. Keith Kubiesa opened his 3,500-square-foot Summit facility with 14-foot high bouldering walls in January 2017. The additions by Werntz will increase the climbing culture in the Madison area, which will also be beneficial to Kubiesa.\n“If they get more people interested in climbing, they’ll gravitate to me for more technical training,” Kubiesa said. “It’ll be good for climbing. (The sport) is growing, and Madison is a very active community. So, from a fitness standpoint, it will continue to grow.”\nWerntz, who grew up in Arizona and Wyoming, is a graduate of Northwestern University and moved to Madison in 1990 for a job at outdoor retailer Erehwon on State Street. He has competed in four Ironman triathlons, been on Mount Everest and climbed the Grand Tetons in western Wyoming and Washington’s Mount Ranier. He spent years as an independent sales representative for the outdoor retailing industry and has written for Outside, Climbing and Rock & Ice magazines.\nDowntown area ripe\nfor climbing concept\nIn the mid-1990s, he was also part of a group that created The Barn, a 3,000-square-foot climbing co-op in an old dairy barn west of Verona. The private club featured climbing walls as high as 30 feet and at one point had about 50 members, Werntz said.\nBut the climbing industry and the local marketplace have changed dramatically since then. In Downtown Madison, the restaurant scene is one of the best in the Midwest, while thousands of new residents and workers have been added, thanks to a flurry of redevelopment. There are new office buildings and hotels, as well as apartment and condo towers. The Judge Doyle Square project behind the Madison Municipal Building is under construction and is likely to add hundreds of employees to its office spaces, located just a few blocks from the new Boulders Downtown location.\n“This site is the absolute bull’s-eye for a bouldering gym, in terms of demographics, density and market presence,” said Bob Richards, a climbing-wall consultant who worked with Werntz on the project. “By these metrics, I’m not sure how you could pick a better location.”\nThe volumes of new bodies that live and work in the city’s Downtown are all prime candidates for Werntz’s new facility. It’s also located on the ground floor of Urban Land Interests’ 25 West Main project, which features 171,000 square feet of office space, 32,000 square feet of retail, and will house about 1,300 workers — including two floors of employees for Zendesk, a San Francisco-based company that makes customer service software.\nWerntz, who has been searching for a suitable Downtown location for about five years, predicts the new gym could ultimately get more than 1,000 visitors a day. The gym, located below an outdoor terrace, features two 10-by-10-foot skylights, and pedestrians walking by will be able to see into the gym, thanks to large windows at street level. The building is also wrapped in imported stone from the mountains of Europe.\n“It’s a stunning location. Bouldering gyms are going into high-end real estate all over the country and all over the world. And this is absolutely stunning,” Werntz said. “Our only concern is that we didn’t build it big enough.”", "url": "https://apnews.com/c9169fd9f3c4483e828aa2cc490056fd"}