{"authors": ["Erin Golden"], "date_download": "2020-05-04 20:18:09", "date_modify": "2020-05-04 20:18:09", "date_publish": "2018-04-30 15:42:39", "description": "A new state report says Minnesotas long list of programs for young children has created a system thats confusing for parents or for anyone trying to figure out if the programs are working well,...", "filename": "_5d084f8799204642ab38640f741e5213_1588623489.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5d084f8799204642ab38640f741e5213_1588623489.html", "title": "Legislative audit finds early education programs 'complex and fragmented'", "title_page": "Legislative audit finds early education programs 'complex and fragmented'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A new state report says Minnesotas long list of programs for young children has created a system thats confusing for parents or for anyone trying to figure out if the programs are working well, running efficiently, or adequately preparing children for elementary school.\nThe assessment from the Office of the Legislative Auditor, presented to state lawmakers Monday, found that the 42 programs related to early education are complex and fragmented and in need of significant review and coordination.\nLegislative Auditor James Nobles said his offices audit focused specifically on nine of those programs, which vary in eligibility requirements, funding, and training required for instructors, among other areas.\nThe only things that seem to connect them are good intentions and a sincere hope that they are working effectively, Nobles told members of two state Senate education committees. Good intentions and hope are important, very important, but they are not enough.\nEarly education is frequently stated as a top goal of lawmakers from both parties, and has been a major spending priority for Gov. Mark Dayton. For years, the state has expanded its offerings; In the last decade alone, it has added the ParentAware Quality Rating and Improvement System, early learning scholarships, voluntary prekindergarten, and school readiness plus. Thats on top of longer-running programs like Head Start, a home-visit program and school readiness, which is different from school readiness plus.\nIn 2016, the state spent more than $300 million on early learning programs and services. Another $165 million went to early learning scholarships and child-care assistance for low-income families.\nWhile the state has evaluated some of the programs independently, the 142-page audit found that government departments have not done a more extensive review to see how the programs work together, which are more effective, or if any efforts are being duplicated. Additionally, Minnesota does not have a comprehensive system to determine if children who participate in any of the programs are ready for elementary school when they enter kindergarten.\nState law places a priority on childrens readiness for school, the report notes. One of the goals in the states Worlds Best Workforce statute is to meet school readiness goals. However, the state does not currently measure whether children statewide are prepared for school.\nMeanwhile, the report found that the patchwork of programs, rules and applications makes it tough for parents to sort out where they can get help. Some programs are only open to families under a certain income limit, some offer enrollment on a sliding scale, and some are open to all state residents. They vary in whether they have to provide transportation, how they handle waiting lists and the age of children who can participate.\nLawmakers said they intend to figure out how to make the programs more accessible and easier for the parents and the state to track. With just three weeks left in the legislative session, new legislative proposals will have to wait for next year.\nI would hope we would have a very robust bipartisan working group that could tackle this during the summer and come up with thoughtful recommendations for the upcoming session, said Sen. Charles Wiger, DFL-Maplewood.\nSen. Carla Nelson, R-Rochester, said shes already working on a bill related to the evaluation of early childhood programs.\nWe know that education is the great equalizer and students must enter kindergarten ready to learn, she said.\nRecommendations from the Legislative Auditors Office include a common application that would allow parents to skip the complicated process of figuring out which programs they can use.\nThe state has a lot of work to do to reform and make these programs more coordinated and into a system that we can judge and measure, Nobles said. Erin Golden 612-673-4790", "url": "https://apnews.com/5d084f8799204642ab38640f741e5213"}