{"authors": ["Steve Sharp", "Ed Zagorski Of The Daily Times Staff"], "date_download": "2020-05-04 20:17:31", "date_modify": "2020-05-04 20:17:31", "date_publish": "2018-08-20 16:59:00", "description": "Watertown is living up to its name this month. On the heels of last week's street and basement flooding as a result of 8.6 inches of rain Friday, Watertown residents had better brace...", "filename": "_8295cc21527747d0a6b39671e859cece_1588623451.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8295cc21527747d0a6b39671e859cece_1588623451.html", "title": "City cleaning up from flood: Brace yourself, more coming", "title_page": "City cleaning up from flood: Brace yourself, more coming", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "City cleaning up from flood: Brace yourself, more coming\nWatertown is living up to its name this month.\nOn the heels of last week’s street and basement flooding as a result of 8.6 inches of rain Friday, Watertown residents had better brace themselves again, because the National Weather Service says there is a 100 percent chance for heavy rain again tonight.\nFor today, showers and thunderstorms are likely, then showers and a possible thunderstorm after 5 p.m. The high will be around 77 degrees. New rainfall amounts are to be between a quarter and half-inch.\nTonight, showers and thunderstorms are predicted before 1 a.m., then showers and possibly a thunderstorm, mainly after 1 a.m. Some of the storms could produce heavy rain, according to the NWS. Patchy fog will hamper travel between 8 and 11 p.m., and the low will be around 65 degrees. New rainfall amounts should be between 2 and 3 inches.\nOn Tuesday there is a chance of showers and thunderstorms before 1 p.m., then a slight chance of showers. Some of the storms could produce heavy rain again.\nWednesday and Thursday appear to be dry days with highs between 76 Wednesday and 78 Thursday.\nThe flash flooding that happened in Watertown Friday kept emergency crews and city staff busy.\nWatertown Assistant Fire Chief Tim Gordon said Friday afternoon fire crews rescued four individuals from three different cars at two separate locations.\n“We were getting one of the stranded motorists out of a car when I watched another car drive around a ‘Road Closed’ barricade and head right into the standing water,” Gordon said. “He had to be pulled from his vehicle too.”\nThe assistant fire chief said the “Road Closed” barricades are on the streets to keep motorists safe.\n“We also pulled two young women from a car after they drove through some very high standing water,” Gordon said.\nWatertown Police Chief Tim Roets stressed to motorists to not drive into standing water on any roadway.\n“Do not drive around barricades which have been placed to prevent drivers from driving into standing water,” Roets said. “We had several drivers learn this lesson the hard way and stranded themselves in standing water on the roadway.”\nRoets said the heavy rains caused some flooding in the basement of city hall.\n“We had as much as two inches in some locations,” Roets said Friday. “Our city hall janitorial staff did an exceptional job sand bagging in a couple locations and adding auxiliary pumps to prevent a disaster.”\nHe said the emergency communications equipment did not experience any interruptions and was not damaged by the flooding.\n“We are going to have a lot of humidity in the city hall basement and we will need to address that, as will many citizens in Watertown in their homes and apartments,” Roets said.\nWarning Coordination Meteorologist Tim Halbach of the National Weather Service said he was in Waterloo when the heavy rains were pounding Watertown and causing the flash flooding in the area.\n“This is the worst I have seen in this area,” said Halbach at the intersection of Highway 19 and Carriage Hill in Watertown. “There is a lot of standing water here. That’s what happens when you get an increasingly high amount of rainfall in a short period of time.”\nHalbach said driving through washed out roads is the number one reason why most people die in thunderstorms.\n“It’s just best to avoid these areas,” Halbach said. “Turn around and don’t drown.”\nJon Gantner, who lives on Fremont Street, walked down to the intersection of Highway 19 and Carriage Hill Drive to see the flooded roads.\nHe was there when personnel from the Watertown Fire Department arrived to get motorists from their partially submerged vehicles and onto drier ground.\n“This is really bad out here,” said Gantner, who said the flooding reminded him of the same type of weather that occurred in 2008.\n“That was even worse than this, but this is something to see,” he said while snapping photos of the flooded areas around him.\nDue to high water levels, Jefferson County’s Rock River Park, located at W5281 County Highway B, Johnson Creek, is closed until further notice.\n“We thank the public for understanding,” Mary Nimm, program assistant with the Jefferson County Parks Department said this morning.", "url": "https://apnews.com/8295cc21527747d0a6b39671e859cece"}