{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Ellen David Friedman", "Eric Blanc", "Jane Mcalevey", "Amir Fleischmann", "John Milios"], "date_download": "2020-05-04 19:57:26", "date_modify": "2020-05-04 19:57:26", "date_publish": "2018-09-11 00:00:00", "description": null, "filename": "2018_09_teachers-pay-wages-austerity-tax-cuts_1588622246.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/09/11175458/7977716129_823c0ae08c_k.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_09_teachers-pay-wages-austerity-tax-cuts_1588622246.html", "title": "The Shocking Attack On Teacher Pay", "title_page": "The Shocking Attack On Teacher Pay", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "According to a new survey conducted by Airbnb, 10 percent of the company’s hosts in the United States are teachers. That’s pretty remarkable given that less than 2 percent of the country are K-12 educators. So what’s driving teachers to rent out their homes and spare bedrooms? It’s obvious: low pay.\nA new analysis from the Economic Policy Institute finds that public school teachers are paid on average nearly 20 percent less than workers in professions that require similar education and training. The researchers also found that in 1994 the pay gap was roughly 2 percent — meaning the “wage penalty” that public school teachers face for electing to educate our nation’s children has risen by 18 percentage points in just a couple of decades.\nIt’s not just the comparison to other professions that’s dismal. The report finds that, adjusted for inflation, teacher pay has actually decreased since the mid-90s. Meanwhile costs of living have skyrocketed, and each dollar buys less than it did twenty years ago. Many teachers are desperate for ways to make up the difference.\nPoliticians beholden to corporate interests, who prefer spending public money on tax breaks for industry rather than teacher pay, like to point to teachers’ relatively decent benefits compared to other workers. But EPI found that a slight advantage in non-wage benefits was nowhere near enough to compensate for the huge teacher wage penalty. Even with decent benefits — which are themselves under attack, as we saw West Virginia, where teachers went on strike over both low pay and deteriorating health benefits — public school teachers are lagging behind other workers.\nWhich isn’t to say other workers have it easy. All wages have stagnated since the 1970s, as out-of-pocket medical costs, college tuition, childcare expenditures, housing prices, personal debt payments and other living costs go through the roof. Hardly anyone is faring better than they did in decades past. But the upshot here is that teachers are faring even worse, by a long shot, compared to their professional counterparts. In an age of punishing austerity, they’re being punished the hardest.\nLow teacher pay is not a natural side-effect of a shaky economy, a times-are-tough inevitability. It’s a political choice. For one thing, the process predates our economic woes: deteriorating compensation for public educators began with the neoliberal austerity and privatization movements of the late twentieth century, and has picked up steam with the billionaire-backed charter-ization movement in the twenty-first. Nor can low teacher pay simply be blamed on the “loss of government revenue available for education spending due to the recession and slow recovery,” observe the EPI report’s authors. “Rather, it is the result of revenue declines states brought on themselves by cutting tax rates.” And in a host of state governments that favor the private over the public sector — and the 1 percent over the rest — that meant giving money to corporations and the rich instead of to teachers and schools.\nTeacher wage suppression has gone along with a larger effort to defund and privatize public education, driven by corporate elites like the Walton family, the Koch brothers, Bill & Melinda Gates, the DeVos and Mercer families, and others. The result has been less money in public education overall, which adds an additional financial strain on teachers who deeply care for their students and wish to see them succeed. The Department of Education found that 94 percent of teachers spend money on classroom supplies for their students.\nAs a result of dwindling wages and rising living costs, public school teachers are five times more likely to work a second job than the average American full-time worker. Airbnb is just one of the many ways that public educators seek to plug holes in their family finances. In Arizona, where the teacher wage penalty is nearly twice as high as the national average — teachers there make 34 percent less than their professional counterparts — it’s not uncommon for public school teachers to work three jobs and get as little as four hours of sleep a night.\nAirbnb was proud of the high-teacher-usage statistic, using it to “promote the narrative that [hosts] are truly everyday people” NYU business professor Arun Sundararajan told The Atlantic. “Highlighting the number of workers who are teachers can be a particularly effective way of advancing that narrative,” which the company hopes will normalize the practice of hosting and provide a public relations boon amid controversies surrounding the company’s demonstrated tendency to drive up housing costs (including, of course, for teachers).\nBut expecting public school teachers to take on a side-hustle that lines the pockets of a massive corporation — indeed, expecting them to concede their privacy and monetize their own homes to make ends meet — is not, of course, a solution to decades of disinvestment in public education. We don’t need life hacks to help teachers survive. Public education is fundamental to any functioning democratic society, and teaching is one of its most valuable and indispensable professions. We need to pay teachers enough to live comfortably without taking on other work, period.\nOnly one force is capable of reshuffling our priorities and easing the burden of educators, and it isn’t Airbnb. It’s teachers themselves. And when they unite around demands for change — especially alongside other school workers whose fates are intertwined with theirs — the socially vital nature of the work they perform becomes an enormous asset. In West Virginia, Oklahoma, Arizona, Colorado, North Carolina, Kentucky, Washington, and elsewhere, the 2018 teachers’ strike wave has withheld or threatened to withhold labor that is essential to the functioning of society. And in so doing they’ve accomplished more than they ever could by simply voting for appealing candidates or leaving voicemails for legislators.\nThe strike wave isn’t over. In late August public school teachers in Los Angeles voted nearly unanimously to authorize a strike, and this week they voted to allocate their $3 million union-managed strike fund to making it as impactful as possible. One of their demands is a 6.5 percent pay increase. It’s still less than the nearly 15 percent wage penalty in California, but it’s a start. And if anyone actually has the motivation and the power to close the gap, it’s thousands of public school teachers standing in solidarity against austerity.", "url": "https://www.jacobinmag.com/2018/09/teachers-pay-wages-austerity-tax-cuts"}