{"authors": ["Angelique S. Chengelis", "The Detroit News"], "date_download": "2020-05-04 20:08:45", "date_modify": "2020-05-04 20:08:45", "date_publish": "2018-01-16 09:33:19", "description": "Ann Arbor — Grant Newsome is not one for dramatics, but the reality is, he was minutes from losing his leg after a chop block he will never describe as a dirty play, dislocated his knee, setting...", "filename": "_e008e5a2f79943bb988815e61e40d0ad_1588622925.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e008e5a2f79943bb988815e61e40d0ad_1588622925.html", "title": "Michigan's Grant Newsome almost lost leg, but has plenty of heart", "title_page": "Michigan's Grant Newsome almost lost leg, but has plenty of heart", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ann Arbor — Grant Newsome is not one for dramatics, but the reality is, he was minutes from losing his leg after a chop block he will never describe as a dirty play, dislocated his knee, setting off a chain of medical events that required quick thinking and even quicker decision-making by doctors.\nThe play happened early in the 2016 season against Wisconsin, and Newsome spent 38 days in the hospital and had six surgeries in 40 days.\nNewsome has made a gritty comeback, working tirelessly to not only walk again normally but to have a real shot at playing offensive line again for Michigan this fall, a goal he says no one should bet against.\nMichigan will begin spring practice in March, and Newsome expects to be part of it.\n“Spring is the realistic goal,” Newsome said in a recent interview with The Detroit News. “That’s kinda been the goal for a while. Bowl practice would have been ambitious, very ambitious. It could have been close. Decided to delay it for a little bit. Really focus on making the leg stronger. We’ll see if my doctors let me go full or limited, but spring is a very realistic goal to be on the field in some capacity, Day 1 of spring ball.\n“For me, it’s been so long, every day it’s like, ’All right, I’m ready to go.”\nNewsome has described his right leg as “dying” and if the Michigan doctors had not acted quickly within a critical 30-minute window after he arrived at the hospital, he could have lost it.\nHe began running last summer, about eight months out from his last surgery, and has been doing plyometrics and weights.\n“Doing O-Line specific stuff now,” Newsome said. “That’s what we’re getting back into, doing the drills we would go through normally in practice making sure I’m functional through those. Now it’s really more football-related. We kind of got through the normal every-day person stuff, running and jogging, so now it’s more position-specific, seeing any deficiencies I may have and figuring out ways to address them.”\nNewsome, who spent the past season working with the coaching staff and trying to assist his teammates, said he fully expects to play this fall.\n“I’m not a betting man, but I never bet against myself,” Newsome said. “If I had to put money on it, I’ll be back in the spring, at least in a limited capacity, and then full-go for fall camp. There’s where we’re progressing. Each thing we’ve been able to accomplish, it’s improved those odds.\n“We went from basically being 99.9 percent that I would never play again that first morning after the surgery to now where even the most conservative of my doctors would say they’re favorable odds. It’s all trended well. We haven’t had any big setbacks. I feel very, very confident that I will be on the field.”\nHe obviously hasn’t taken a football hit since the injury, but he’s not worried.\n“We’ll see,” he said with a laugh. “The first time I pull, I may get a little PTSD. No, I think I’ll be fine. It’s been so long, instincts will kick in and get back out there.”\nHis teammates and coaches have marveled at his comeback.\n“It’s been tough, but he’s been handling it really well,” Mason Cole, who played his final game for Michigan in the bowl, said. “Can’t wait to see him back on the field.”\nUM fans takes sides\nThe response from fans has been overwhelmingly encouraging since the injury. Newsome has read plenty of messages on social media wishing him well and saying they look forward to his return. He also has read comments from doubters who believe it’s wishful thinking he can play again.\n“I understand why people say stuff like that,” he said. “I was very close to losing my leg, so I understand the inclination. But I’m never going to bet against myself. I think I’ll be a different player.\n“Whether that’s better, worse, I think mentally, 100 percent I’m already two times the player I was when I got hurt, just having this time off and being able to sit around with the coaches and understanding the entire offense.\n“A lot of people say, ‘Be happy’, and I am happy. I’m incredibly happy I can live a normal life. But a lot of people say take your win and move on. It’s hard when you’ve been a competitor and you’ve been on the field just to give it up. That’s the biggest thing that’s driven me through this whole process. If this happened in year eight or 10 of my NFL career, I’d probably be hanging it up. But I feel like I have unfinished business. I feel like this team has unfinished business. It’s impossible to give up that urge to go out and compete.”\nNewsome is not focused on football exclusively. He has opinions on a wide-range of topics, including politics, and he isn’t afraid to share his thoughts on social media. He is particularly active on Twitter.\nHe doesn’t support any idea that a football player should only be seen and not heard\n“I like to talk about whatever,” he said. “I hate that idea that athletes should just be football players and not talk about anything else. I like giving my opinions on things. Sometimes they’re right, sometimes they’re wrong, sometimes people disagree with them. Whether it’s politics or social issues or Lavar Ball, recruiting, if something comes to mind, I share an opinion.”\n“I always try to be respectful and present opinions. Anytime you can present an educated opinion, it helps to dispel that stereotype that, ‘Oh, we’re just all dumb athletes and we don’t have opinions.’ It’s like some people say, ‘If we want to boo you at home, we’re going to boo you at home. Shut up, you get a free education.’ And the flip side is, whatever you say is the word of God, and it shouldn’t be like that. If I say something and you don’t agree to it, you should respond to it and we can have an educated discussion about that. So I think it goes both ways. Any time you can personalize athletes, it’s a good thing.”\nHis goal is to affect change\nNewsome might eventually get involved in politics or consulting, but he plans to have an NFL career from which he will have a bigger platform to get involved in social issues and projects.\n“Something where I can affect positive change,” he said. “That’s really what my goal in life is, to get to a position where I can not only financially but socially affect a positive change for the most people I possibly can.”\nNewsome, who hopes to attend graduate school at Michigan after completing his course work for a degree in American Culture with a minor in African-American Studies, said going through the injury and the rehab have completely changed him.\n“Everyone’s first inclination, ‘Oh, I’m still the same person,’ but any time you go through anything that serious in your life it’s impossible for it to not change you,” he said. “I can’t sit here and say I’m going to be the exact same player. There’s no way I am. For better or worse, I’m going to be different physically, different mentally. It’s maximizing both of those things so I can be a better player overall than I was before.\n“Definitely mentally and emotionally it’s definitely changed me, I’d like to think for the better. It’s definitely given me an appreciation for the hardships people go through on a daily basis. I was fortunate I had the best care, the best doctors and the best possible situation. I think there are a lot of people who don’t. Their stories aren’t publicized. They’re going through things that are worse, cancers. It’s given me a bigger appreciation for that and given me perspective. It’s made me appreciate the little things in life.\n″ Just walking and being able to jog with my brothers and play football with my brothers. Things I won’t take for granted that I would have before the injury.”\nHe will use spring practice to judge what he needs to improve physically. His left leg is stronger than before, he said, and his understanding of the game has taken an enormous leap.\n“It’s really been remarkable,” Newsome said. “For me, I judge it day to day. Looking back now, if you had asked any of my doctors the day of or coming out of surgery would I be running again, they were like, ‘We hope you can walk normally again.’ It really is remarkable how much we’ve been able to accomplish.”\nBut there’s so much more Newsome wants to do on the football field and beyond.\nachengelis@detroitnews.com\ntwitter.com/achengelis", "url": "https://apnews.com/e008e5a2f79943bb988815e61e40d0ad"}