{"authors": ["Tripp Girardeau"], "date_download": "2020-05-04 20:20:47", "date_modify": "2020-05-04 20:20:47", "date_publish": "2018-08-09 19:00:00", "description": "A former candidate for Georgia’s 10th Congressional District is facing murder charges in the death of an Aiken County man. Kellie Lynn Collins, 30, was arrested Wednesday by the McDuffie...", "filename": "_b26ce8812b144a51913ced796e524189_1588623647.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b26ce8812b144a51913ced796e524189_1588623647.html", "title": "Former Georgia congressional candidate charged with murder of Aiken County man", "title_page": "Former Georgia congressional candidate charged with murder of Aiken County man", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Former Georgia congressional candidate charged with murder of Aiken County man\nA former candidate for Georgia’s 10th Congressional District is facing murder charges in the death of an Aiken County man.\nKellie Lynn Collins, 30, was arrested Wednesday by the McDuffie County Sheriff’s Office in Georgia on charges connected to a suspicious death investigation on Old Powderhouse Road in Aiken County.\nThe victim has been identified as Curt Jason Cain, 41, of Aiken, according to a news release from Aiken County Coroner Tim Carlton.\nAuthorities began working the suspicious death investigation on Old Powderhouse Road on Tuesday.\nWarrants were obtained against Collins for murder and grand larceny, according to a news release from the Aiken County Sheriff’s Office.\nCain is believed to have died on Aug. 4, Carlton said. Autopsy results revealed Cain was shot and subsequently died from the wounds, Carlton said.\nCain’s manner of death is to be ruled a homicide, and the cause of death is due to loss of blood, the coroner said.\nCain was employed by Swiss Krono in Barnwell for approximately 14 years, Carlton said.\nHis body was discovered at his home Tuesday evening on Old Powderhouse Road by deputies responding for a well-being check.\nDuring the course of the investigation, it was discovered Cain’s vehicle, a blue Subaru Legacy, was missing from the residence.\nInvestigators later identified the suspect as Collins and obtained warrants for her arrest.\nCollins surrendered to authorities with the McDuffie County Sheriff’s Office, where she will continue to be held pending extradition proceedings.\n“Without the assistance of McDuffie County Sheriff’s Office, the Aiken County Coroner’s Office and the exceptional work of the investigators of the Aiken County Sheriff’s Office, this arrest would not have been possible,” Aiken County Sheriff Michael Hunt said. “We hope this will bring some closure to the family of the victim.”\nThis investigation is still on-going.\nCollins was previously running as a Democratic candidate for the U.S. House to represent the 10th Congressional District in Georgia in the 2018 election; however, she dropped out of the race before the election, according to the website Ballotpedia.com .\nCurt Cain is listed as treasurer for Collins’ 2018 official Political Action Committee when she was running for District 10, according to the website opensecrets.org .\nCain was a member of the Aiken County Democratic Party, said Elizabeth Foy, representative with the Aiken County Democratic Party.\nHe was also extremely close to finishing his MBA at USC Aiken, said USC Aiken Chancellor Dr. Sandra Jordan.\n“Curt was a member of the third on-campus MBA cohort and was on the verge of completing the program next week,” Jordan said. “According to School of Business faculty, Curt was one of the top students in his class and had a promising future ahead of him.”", "url": "https://apnews.com/b26ce8812b144a51913ced796e524189"}