{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:06:11", "date_modify": "2020-05-04 20:06:11", "date_publish": "2018-10-31 09:35:50", "description": "EDNA IRENE MESSINGER BURGER, 91, of West Hamlin, West Virginia, died Saturday, October 27, 2018, at Lincoln Nursing and Rehabilitation Center in Hamlin, W.Va. She was born February 3, 1927, in...", "filename": "_bb8d2df3ecf1452fb8a255cbf5aaeb35_1588622771.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bb8d2df3ecf1452fb8a255cbf5aaeb35_1588622771.html", "title": "EDNA IRENE MESSINGER BURGER", "title_page": "EDNA IRENE MESSINGER BURGER", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "EDNA IRENE MESSINGER BURGER, 91, of West Hamlin, West Virginia, died Saturday, October 27, 2018, at Lincoln Nursing and Rehabilitation Center in Hamlin, W.Va. She was born February 3, 1927, in West Hamlin, W.Va., to the late M. Susan Covey Messinger and the late Willard Vernon Messinger. In addition to her parents, she was preceded in death by eleven Messinger and Burger sisters-in-law and brothers-in-law; her former husband, Brady Dale Burger of Huntington, W.Va.; two sons-in-law, Lynn E. Westfall of Buckhannon, W.Va., and Calvin C. Gillett of Quicksand, Ky.; a grandson-in-law, William Brown Habel of Midland, Mich.; a brother, Cencil Ward “C.W.” Messinger of Bridgewater, Va.; and infant grandchildren and great-grandchildren. Edna is survived by two brothers, Curtis Messinger and wife Terese of Pleasantville, N.Y., and Arles Messinger and wife Carol of Parma, Ohio; three sisters-inlaw, Jane (Salisbury) Messinger of Bridgewater, Va., Vilma Burger Swanson of Cedarville, Ohio, and Jan Lawson and husband Odell of Branchland, W.Va.; three children, Suzanne Joyce Gillett of Quicksand, Ky., Felicia Jane Johnston and husband William Cyril of Buckhannon, W.Va., and Ronald Scott Willard Burger and wife Jean of Charlotte, N.C. She is also survived by three grandchildren, Yvonne S. Habel of Midland, Mich., Adam C. Gillett of Lexington, Ky., and Zachary A. Burger of Charlotte, N.C.; step-great-granddaughter, Renee Shocknesse of Midland, Mich.; step-grandchildren, Laura Godfrey and husband Robert of Cumberland, Md., and Karen Johnston of Lansdale, Pa.; and step-great-grandchildren, Emma Godfrey of Annapolis, Md., Robin Godfrey of Cumberland, Md., and Morgantown, W.Va., and Patrick Godfrey of Cumberl and, Md., currently serving in the U.S. Marine Corps in California; and many nieces and nephews. The family expresses special thanks to cousins Linda and Gary Messinger of Fall Creek, W.Va. Edna graduated from Guyan Valley High School in Pleasant View, W.Va., in 1943. On August 1, 1945, she married Brady Dale Burger of Branchland, W.Va. During her teen years, she worked assisting the family of Dr. McClellan in West Hamlin. After marriage, she worked as an assistant in an apartment complex in Warren, Ohio, where the family lived for a brief time before settling in Huntington, W.Va. She worked as a homemaker and was an excellent seamstress and clothing designer, making clothing for her family and for the dolls of family members. She had been a member of Twentieth Street Baptist Church in Huntington, W.Va., where she taught Sunday School classes for young children. Visitation will be at McGhee-Handley Funeral Home in West Hamlin, W.Va., on Saturday, November 3, 2018, at 1 p.m., followed by a memorial service conducted by Rev. Cyril Johnston at 2 p.m. at the funeral home. Interment will follow at Midkiff Cemetery, West Hamlin, W.Va. The family respectfully requests that visitors not wear fragrance, to assist the health of many family members with severe asthma and allergies. Memorial donationsmay bemade to Marshall University Medical Center; for more information and online donation links, please go to https://jcesom.marshall.edu/alumni-giving/giving/; donations may also be mailed to Marshall University Medical Center, 1600 Medical Center Drive, Huntington, WV 25701. McGhee-Handley Funeral Home in West Hamlin, W.Va., has been entrusted with arrangements for Edna Irene Messinger Burger.", "url": "https://apnews.com/bb8d2df3ecf1452fb8a255cbf5aaeb35"}