{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:50:00", "date_modify": "2020-05-04 19:50:00", "date_publish": "2018-09-24 00:00:00", "description": null, "filename": "2018_09_segregation-bay-area-high-rents-gentrification-displacement_1588621800.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/09/24192104/4232167373_104575c6ec_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_09_segregation-bay-area-high-rents-gentrification-displacement_1588621800.html", "title": "Segregation Is Back - And It’s Profitable", "title_page": "Segregation Is Back — And It’s Profitable", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "A new report from the Urban Displacement Project confirms what anyone who’s lived here already knows: rising housing costs are resegregating the Bay Area.\nResearchers found that between 2000 and 2015, soaring rents pushed thousands of low-income black households out of what were once racially and economically diverse neighborhoods in Oakland, Berkeley, San Francisco, and Richmond. Nearly half of those who relocated left the Bay Area altogether, and many of the rest have moved to more racially segregated and economically homogeneous — that is, poorer — suburbs like Antioch and Pittsburg to the east, and the Eden area to the south.\nLike every American metropolitan area, the Bay Area boasted a great deal of racial and social inequality before 2000. But by some measures it had come a long way from the mid-twentieth century, when many of the region’s subdivisions were redlined and legally segregated. By the 1990s, for instance, Oakland was the most ethnically diverse city in the country and was helmed by black political and corporate leadership.\nThe problem was that even as explicitly racist ideology gave way to a new official multiculturalism, the economic power of the region’s business elite was never sufficiently challenged. On the contrary, it was catered to in the early aughts by corporate-friendly city administrations eager to take advantage of new revenue streams promised by the booming tech and real-estate industries. They justified permissive policy and tax incentives to these industries by selling it as a win-win for the capitalist and working classes. The deluge of private investment, the thinking went, would eventually lift all boats.\nToday those industries continue to run the show. Despite lip service to racial equality, they are focused on one objective: maximizing profit. And in their pursuit of profit, they’ve driven housing prices up so dramatically that whatever gains in integration that were won in the late twentieth century have begun to erode. The Bay Area is now on track to achieve redlining-era segregation levels, only this time de facto instead of de jure.\nSegregation presents a fundamental obstacle to racial equality. As Martin Luther King Jr put it in 1956:\nThere was a time that we attempted to live with segregation. There were those who felt that we could live by a doctrine of separate but equal, and so back in 1896 the Supreme Court of this nation, through the Plessy v. Ferguson decision, established the doctrine of separate but equal as the law of the land. But we all know what happened as a result of that doctrine: there was always a strict enforcement of the separate without the slightest intention to abide by the equal. And so as a result of the old Plessy doctrine, we ended up being plunged across the abyss of exploitation, where we experienced the bleakness of nagging injustice.\nKing was speaking after the 1954 Supreme Court decision that ruled school segregation unconstitutional. But as he explained, “Segregation is already legally dead, but it is still factually alive.” And he went on to explain how the fundamental problems with segregation are no less pronounced when it’s simply a matter of fact rather than of law:\n[Segregation] ends up depersonalizing the segregated. That’s the end results of segregation. The segregated becomes merely a thing to be used, not a person to be respected. He is merely a depersonalized cog in a vast economic machine.\nThis phenomenon is familiar to poor workers in the Bay Area — black workers especially, but also Latino, Asian, and displaced white workers. While rising rents have forced low-wage workers to move further afield into new suburban ghettos south of San Leandro or east of Concord, the jobs are mostly still in the economic centers from which they came: driving Uber in Oakland, cleaning tech offices in San Francisco, serving food in the cafeterias at UC Berkeley.\nAs King observed, segregation encourages depersonalization, which provides cover for exploitation. The residents of the Bay Area’s wealthier waterfront cities are increasingly high-wage earners and mostly white. Their lack of contact with, or even awareness of, commuting workers of color establishes conditions for cultural rationalizations of economic exploitation, racist and otherwise, to flourish.\nThat makes it easier for Uber to suppress drivers’ pay, or for the University of California to try to break custodians’ unions, with the tacit approval and sometimes explicit support of municipal officials who need not fear public pushback. Political leaders regularly court, incentivize, and reward corporations that abuse low-wage workers, and their constituents hardly bat an eyelash. Segregation makes it all seem so abstract.\nTo end the drift toward resegregation and get back on the path toward racial equality, the Bay Area needs to move aggressively to end its housing crisis. To do that, we have to repeal the statewide anti-tenant Costa-Hawkins law so that we can pass real rent control in California cities and keep prices affordable for ordinary working people, so they don’t have to move to keep a roof over their head. A widely supported ballot measure, Proposition 10, will accomplish this if it passes this November.\nAt the same time, we need to build new public and affordable housing — and lots of it.\nWe can’t leave this task to real estate developers, whose single-minded devotion to profit compels them to build luxury units for high-income tenants, which does nothing to bring back displaced workers. The best existing blueprint for addressing the Bay Area housing crisis is the Housing For All idea put forward by Jovanka Beckles, a democratic socialist who’s running for State Assembly in AD-15. Beckles’s platform calls for the large-scale construction of new social housing, to be paid for with higher taxes on the wealthy including taxes on housing speculation, vacant units that function as investments rather than shelter, and luxury home sales.\nTaxing the rich who have created this crisis to build new affordable and public units would make it possible for low-wage workers in the Bay Area, the majority of whom are people of color and the poorest of whom are black, to live in the cities where they work.\nThis leads us to a larger takeaway: we can’t achieve racial justice without pursuing economic justice.\nThe dominant liberal idea of anti-racism — which proffers nonwhite representation in the upper echelons of society rather than policies that materially empower the multiracial working class — can’t deliver the equality it promises, because it keeps what King called the “vast economic machine” intact. To achieve racial equality, we have to reject the type of society that generates racism and segregation, and pursue a model whose driving principles are cooperation and solidarity, not exploitation and competition.\nAs King wrote in his foreword to the Freedom Budget, “We shall eliminate slums for Negroes when we destroy ghettos and build new cities for all.”", "url": "https://jacobinmag.com/2018/09/segregation-bay-area-high-rents-gentrification-displacement"}