{"authors": ["Ronan Burtenshaw", "Anton Jäger", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Matt Karp"], "date_download": "2020-05-04 19:55:52", "date_modify": "2020-05-04 19:55:52", "date_publish": "2018-11-30 00:00:00", "description": null, "filename": "2018_12_guardian-populism-europe-cas-mudde-hillary-clinton-immigration-tony-blair_1588622152.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/11/30154011/GettyImages-905150760.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_12_guardian-populism-europe-cas-mudde-hillary-clinton-immigration-tony-blair_1588622152.html", "title": "The Guardian’s Populism Panic", "title_page": "The Guardian’s Populism Panic", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Last week, amid much fanfare, the Guardian launched its new series on populism. Its contributions include research into the rise of populist parties in Europe, investigations into international networks supporting these new populist forces, and quizzes that place participants on a scale of populism. These are supplemented by analysis from some of the leading political scientists in the field of populism studies. Prominent among these is Cas Mudde, academic superstar of the discipline, whose definition of populism provides the intellectual basis for the series. Populism, he says, is a flexible ideology, which combines with a “host” that can either be “on the left or right,” but is characterized fundamentally by anti-elitism. Populists, according to these terms, see society as “ultimately separated into two homogeneous and antagonistic groups,” consisting of “the pure people” and “the corrupt elite.” This dichotomy forms the basis of a populist worldview, framing politics as an expression of the “general will” and offering little ground for pluralism. In attempting to develop this approach, populists are “moralistic rather than programmatic,” preferring to demonize opponents than to debate them on policy terms. Moreover, they are prone to illegitimately personalizing the political sphere, rather than engaging in its modern complexities. Mudde’s definition does, of course, have its merits. It would be foolish to dismiss earnest debate over populism, especially when the term has come to define our era and a significant number of political actors now self-identify as populists. One might ask if this situation is, in part, the result of an obsession with populism by its opponents. As the Guardian points out elsewhere in its series, there has been a sevenfold increase in the frequency of the term within its pages in the past twenty years. But debating populism is one thing. The increasing border traffic between journalism and political science seems rather more concerned with raising it as a specter. The Guardian’s populism series is a case-in-point, seeking not so much to shed light on populism as to define it as the enemy of decent, liberal politics. It is less a reflection on a phenomenon than a reflex against it.\nDefinitional Problems This is not a new affliction for populism studies. Many political scientists starting out in the field have read some of Mudde’s canonical works when they embark on research projects. Often such projects culminate in what can only be called political consultancy: European politicians worry about how the “populist menace” might come to affect their home countries (or political careers) and hire a group of specialists to inform them on counterstrategies. Since the terms of such research are set in advance, the results are painfully predictable, with some minor variations as to whether the politician in question should engage with “populists” or shun them entirely. We begin to see the definitional problems with the Guardian’s latest endeavor when it sets out to define populism’s opponents. It finds these in three “centrist heavyweights” who, it says, have been scalps of populist politics in recent years: Hillary Clinton, Matteo Renzi, and Tony Blair. These three are invited to discuss why they lost out to populists and how the political center can fight back. But, on reflection, it takes a particularly jaundiced view of politics to situate these three outside of ‘populism.’ Tony Blair’s New Labour was, of course, famous for defining those it represented as “hardworking families.” It would be hard to imagine a term that better fit into the category of a pure people that Cas Mudde lays out in his article. New Labour was also prone to the kind of demonization the series attributes to populists, whether it was the “hooded youths” and “shopping-center thugs” that Tony Blair was so consumed with in his later days, or the more standard migrant-bashing he engaged in throughout his tenure. As Steve Bloomfield pointed out, New Labour trucked in rhetoric about “bogus asylum seekers” who were “cheats” and “played the system” long before the storm of right-wing populism gathered on the horizon. And it did so while introducing a swath of legislation designed to make migrants’ lives harder. Clearly, a version of this rhetoric has now become the stock and trade in Brexit Britain. Blair was hardly the only “centrist” with populist proclivities, however. Hillary Clinton used her intervention in the Guardian to call for “curbs on immigration,” saying that it had “lit the flame” of Europe’s current political predicament (a number of academic contributors to the series, such as Cas Mudde and Benjamin Moffitt, distanced themselves from her sentiments). Yet this classically populist rhetoric should not be a surprise from someone who played her part in mid-1990s racist panics by dubbing young black men “super-predators,” who showed “no conscience” and “no empathy.” But populism has always been part of the Clinton modus operandi. After all, one of the terms Cas Mudde cites himself as an example of defining a pure people, the idea of the American “heartland,” was central to Bill Clinton’s rhetorical repertoire. He not only referenced it in his 1996 acceptance speech but developed the term “heartland citizens” to almost perfectly fit Mudde’s populist mold. Matteo Renzi, meanwhile, hardly holds his own as an anti-populist. Under his government, an “Italians first” policy was pursued before Salvini made it a slogan. His Interior Minister Marco Minniticut border crossings by 87 percent, justifying this by saying the threat of Jihadism “had never been so great in Italy.” Doesn’t sound like such a world apart from populists like Donald Trump, does it? But then again, when fellow centrist hero Emmanuel Macron is proudly describing himself as a “populist,” it can be difficult to know where the boundaries lie. While believing in a pure people and using the rhetoric of demonization are integral to the Guardian’s definition of populism, they are not what defines it. This role is reserved for anti-elitism, which Cas Mudde argues is “what populism is about.” But that implies a rather strange understanding of right-wing populism in particular. Is it really credible to argue that a billionaire real estate mogul like Donald Trump is more defined by his opposition to “corrupt elites” than to immigrants and their rights? Certainly his politics seem to have a more detrimental impact on the latter.\nPop Quiz However, despite the fact policy is supposed to be the ground on which anti-populists prefer to debate, it seems to have played a surprisingly small role in defining the terms of the Guardian’s populism series. This can perhaps best be seen in the so-called “How Populist Are You?” flowchart produced by a group of researchers calling themselves Team Populism. Here, readers can take their own personal quiz to find out where they stand on the chart, with questions closely related to the series’ foundational definition — should politicians listen to the people? Is government run by a few big interests? If you disagree with people politically, does that make them evil? These questions about people’s instincts define whether they are populist, with the left-right axis determined not by any policy sophistication but by their responses to singular terminology. “Socialism,” good or bad? “Free trade,” yes or no? What about “patriotism”? By this point the exercise seems to be taking the form of a Rorschach test. This process reaches its bizarre conclusion with the placement on the chart of political figures intended to be used as reference points. Not only is the chosen cast of characters deeply strange (French president Emmanuel Macron compared not with Jean-Luc Mélenchon or Marine Le Pen, but with Mexican president-elect Andrès Manuel López Obrador?) but the method of their placement is absurd. These figures are not situated on the chart based on their policy positions or previous statements, but by how a select group of purported experts believe they would answer the questionnaire. Here we have passed from pop psychology to some form of telepathy. Unsurprisingly, the results it produces are disastrous. Centrist champions Barack Obama and Emmanuel Macron — both of whom pursued classically neoliberal agendas involving historic tax cuts — are located to the left of Bolivian president Evo Morales, who has pursued policies of nationalization and wealth redistribution for years. On the other end of the chart, Donald Trump, whose administration has managed to achieve relatively little by way of radical reform despite the rhetoric, is somehow considered more right-wing than Hungarian strongman Viktor Orbán, who has all but buried liberal democracy in his country and introduced laws to, among other things, criminalize any individual or group providing assistance to refugees. Perhaps what is most striking about the perp walk of populist figures wheeled out for the chart is who is omitted. By contrast to the non-populist left quadrant (which is largely empty, a fact that further indicates the definitional problems of this exercise) the populist left quadrant features Bernie Sanders and Pablo Iglesias. So where is Jeremy Corbyn? Based on the positioning of Sanders and Iglesias, one could assume Corbyn would feature somewhere on the farthest left end of the scale. But in fact, he doesn’t feature at all. Jeremy Corbyn, the leader of the party most closely associated with the Guardian over many years, is conspicuously absent. A reason one could proffer for this omission is that, in other parts of the research, when populism has been measured, only parties of the far-left and far-right have been eligible for consideration. In this metric, established by Matthijs Rooduijn, Europe’s mainstream center-right, which produced such figures as Silvio Berlusconi, must be considered free of the influence of populism. But even this cannot justify Corbyn’s omission from the How Populist Are You? segment. Why then was Bernie Sanders, who ran in the Democratic Party, considered? Or Donald Trump, for that matter? Jeremy Corbyn’s name is also peculiarly absent from the five articles providing the intellectual bulwark of the populism series, as listed on its homepage. In fact, the name Corbyn appears only once, briefly, in the articles listed under news and comment. The first time he is substantively referenced is in the letters page, where a Guardian reader queries why Greece’s Syriza, which today defends its reputation as a “champion” of neoliberal reform, is considered left-wing populist while Jeremy Corbyn’s Labour Party isn’t. In fact, it is arguable that Corbyn’s performance in the 2017 general election is the high point of left-populist politics in the West, achieving 40 percent of the vote. It was also run on an explicitly anti-elitist slogan: “for the many, not the few.” Only the Guardian can answer the question of why Jeremy Corbyn was omitted from their series, but any attempt to study the phenomenon of populism that dare not even speak his name is unlikely to produce serviceable conclusions.\nThe Horsehoe Returns None of this means the Guardian series has nothing to offer. Mudde himself gives a helpful genealogy of how “populism” became our era’s most cherished buzzword, and what connects it to differing societal trends. Matthijs Rooduijn offers some valid reasons why “populism” might indeed capture a central dimension of the crisis of representation in global democracies, which moves beyond the scaremongering indulged in when the topic is debated. But these are rare breaks from liberal cliche. Unsurprisingly, one of the most significant impacts of the Guardian’s series is to reaffirm the laziest tenet in the liberal worldview: horseshoe theory. Its adherents hold that the further one drifts on the spectrum, left or right, one is bound to end up at a point which converges with the other extreme. What other conclusion could you draw from this treatment of “populism,” a singular phenomenon that sees in the anti-Roma marches of Hungarian post-fascists Jobbik and the anti-gender violence demonstrations of Spanish leftists Podemos essentially the same thing? The problem of how to establish a policy common ground between these “populists” of the Left and Right — and how to distinguish this policy ground from what might be advocated by the center — haunts the Guardian series. After all, when it comes to their mutual opposition to “globalism” in trade policy, any serious interrogation of what the Left and Right actually propose will reveal an enormous difference. For instance, in the context of Brexit, Nigel Farage is currently proposing a Canada-style free trade agreement as an alternative to European Union membership. But when such an arrangement was proposed in Europe — in the form of the CETA trade deal — its strongest opponents were on the radical left. This tends to be the case across the board: on social and economic policy, the so-called “populists” on the Left are closer to the social democrats than they are to their estranged relatives on the populist right. So why try to unite these poles? The answer to this question is simple: to defend liberalism against its foes. In a previous piece for the Guardian, Cas Mudde made this ambition clear when he defined populism as fundamentally “illiberal” and called for action from “liberal democrats” to oppose it. He extends this in his own contribution to the Guardian series, making the bold claim that “nationalism and socialism” both “mobilized as anti-democratic extremism” in “the early twentieth-century.” This historical perspective is interesting, to say the least, considering the largest socialist parties of the era — such as the German Social Democratic Party — had been at the forefront of the fight for universal suffrage, taking strong positions on the question before their liberal equivalents. The first demand of the seminal 1891 Erfurt Programme, which was the standard of socialist parties across Europe for decades, was for “universal, equal, and direct suffrage with secret ballot in all elections.” Of course, when the fires of “anti-democratic extremism” did come to engulf Europe, today’s liberal blacksmiths weren’t around to bend that horseshoe. Instead, it was socialists who led the struggle against fascism in Spain, who resisted Mussolini most fiercely (while the Italian Liberal Party helped him into government) and were the first to be dispatched to concentration camps under Hitler. In the latter case, recent research has demonstrated just how much “liberal democrats” adapted to and even flourished under Nazism — a lesson more useful in the discussion of populism than most proffered by the Guardian’s series. Despite its shaky intellectual ground, horseshoe theory has long been a cherished artifact of liberal historiography. As with today, its political ambition is most often to convince liberal intelligentsia of the need secure a clean break with the Left. In the late 1940s, for instance, the American historian Arthur Schlesinger Jr prophesized in his book The Vital Center that the greatest threat to the world was the Nazi-Stalinist doublet. But the book’s aim was not to criticize the 1939 Molotov-Ribbentrop pact. Rather, it sought to foreground the fight against the Red Peril in the debate over redistributive programs at home. As Samuel Moyn and David Priestland have argued, Cold War intellectuals exercised a decisive influence on the 1950 Truman cabinet’s decision not to push for an additional welfare bill and instead to focus on rearmament overseas. In choosing bellicose posturing instead of social democracy, that generation of liberals put American welfare behind by decades. This habit has died hard: in recent years, British liberals have focused far more energy on attacking Jeremy Corbyn over foreign policy and Brexit than on contesting Theresa May’s cuts to the welfare state and punitive immigration policies.", "url": "https://jacobinmag.com/2018/12/guardian-populism-europe-cas-mudde-hillary-clinton-immigration-tony-blair"}