{"authors": ["James F. Mccarty", "The Plain Dealer"], "date_download": "2020-05-04 20:21:10", "date_modify": "2020-05-04 20:21:10", "date_publish": "2018-04-24 16:52:00", "description": "Judge's order consolidates more than 40 lawsuits filed against UH fertility clinic into a single case CLEVELAND, Ohio – The top judge in Cuyahoga County Common Pleas Court has issued an...", "filename": "_349f7bc9ce554f8d8cd0a3308eacdfb4_1588623670.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_349f7bc9ce554f8d8cd0a3308eacdfb4_1588623670.html", "title": "Judge's order consolidates more than 40 lawsuits filed against UH fertility clinic into a single case", "title_page": "Judge's order consolidates more than 40 lawsuits filed against UH fertility clinic into a single case", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Judge’s order consolidates more than 40 lawsuits filed against UH fertility clinic into a single case\nCLEVELAND, Ohio – The top judge in Cuyahoga County Common Pleas Court has issued an order to join the more than 40 lawsuits filed against University Hospitals’ fertility clinic into a single case.\nJudge John Russo, the court’s administrative and presiding judge, issued the opinion “to allow for a convenient administration of the cases in promoting judicial economy and to afford justice to the parties,” he wrote.\nRusso noted that all of the more than 40 lawsuits filed to date by more than 70 named plaintiffs are “substantially the same.”\nConsolidation will allow all of the plaintiffs consistent adjudication with one judge, “while also independently maintaining the protection of their rights as each case will still retain its own unique identity under the law,” Russo wrote.\nUH’s lawyers had sought consolidation since the lawsuits began following the events of March 3-4, when a temperature fluctuation in a fertility center storage tank destroyed as many as 4,000 eggs and embryos belonging to 950 patients.\nUH argued that all of the cases were based on the same series of events and involved common questions of law alleging negligence and breach of contract.\nConsolidating the cases, UH said, would allow the opposing parties to streamline discovery and remove the need for multiple depositions of the same witnesses; conserve resources and reduce expenses; allow the litigation to proceed along a single, unified path; and avoid the risk of inconsistent adjudications.\nFor now, all of the cases will be consolidated onto the docket of Judge Stuart Friedman, although it is undecided whether he will keep the cases because he was planning to retire at the end of the year. Friedman has offered to continue to preside over the UH cases and work past his retirement date.\nThe consolidation does not answer the question of whether the cases qualify for class action status. The majority of plaintiffs’ lawyers have expressed their intention to pursue a class action, although several of the lawyers say they will seek individual litigation separate from a class.\nFor instance, Michelle and Bryan Roman of Solon have filed motions defending their plans to pursue individual claims “to avoid being lumped in with unnamed class members or being compelled to litigate class certification.”\nRusso’s consolidation order included an exception for a case brought by Wendy and Rick Penniman of Broadview Heights, because theirs is an action for declaratory judgment and does not involve the similar questions of fact and law presented in the other cases.\nA declaratory judgment is a ruling by a court that determines the rights of parties without ordering anything be done or awarding damages.\nBruce Taubman, the Pennimans’ lawyer, filed a separate lawsuit with a different judge asking the court to determine whether their embryos were human lives.\nThe Pennimans maintain that UH treated their embryos as chattel, or property, and has only offered to reimburse them for the production of the embryos, not for the loss of a potential son or daughter.\nThe Pennimans “view the embryos as patients of UH who should have been protected as such,” their lawsuit says.\n“The Pennimans contend that life begins at conception, meaning the embryos have the legal status of a person,” according to the lawsuit.\nAlthough the U.S. Supreme Court has ruled that a fetus is not a person, the Ohio Supreme Court ruled in the 1985 case Werling vs. Sandy that a viable fetus is a person, and that a fetus begins at conception.\nJudge Deena Calabrese has not yet scheduled a hearing on the issue.", "url": "https://apnews.com/349f7bc9ce554f8d8cd0a3308eacdfb4"}