{"authors": ["Tim Benz"], "date_download": "2020-05-04 20:10:30", "date_modify": "2020-05-04 20:10:30", "date_publish": "2018-10-30 14:14:39", "description": "The Pittsburgh Penguins are five games into the 2018-19 season, and Sidney Crosby has yet to score. It isn't time to panic. But it is time for us to ask, \"why?\" After all, Crosby and...", "filename": "_06af690bcbf24d6696b66fb0d8abe45c_1588623030.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_06af690bcbf24d6696b66fb0d8abe45c_1588623030.html", "title": "Why Penguins' Sidney Crosby hasn't scored yet this season", "title_page": "Tim Benz: Why Penguins' Sidney Crosby hasn't scored yet this season", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Pittsburgh Penguins are five games into the 2018-19 season, and Sidney Crosby has yet to score.\nIt isn’t time to panic. But it is time for us to ask, “why?”\nAfter all, Crosby and his coach seem to have posed the same question. And they seem to have found the reasons. Now Crosby -- and his linemates -- need to start doing it.\nThere are a few obvious reasons for the captain’s slow start. Crosby just hasn’t had a lot of lucky bounces to begin October. Goaltenders opposing Pittsburgh have made some of their most impressive saves against Crosby. And his trademark tips and deflections haven’t quite found their way into the net with the frequency that they have in previous years.\nAs an example, look at the beauty he smacked downward last night that Vancouver’s Anders Nilsson barely kept out of the net during the Canucks’ 3-2 overtime win at PPG Paints Arena.\nHowever, there are some elements to Crosby’s game that he can control which will help him get on the scoreboard sooner rather than later.\n“We have to hold onto pucks,” Crosby said after the loss. “That’s how you generate down low. We have to do a better job of holding onto pucks and winning battles.”\nThat’s not just Crosby spitting out an empty cliche to wrap up an interview session after a frustrating defeat. Mike Sullivan offered the same explanation in a more lengthy manner during his news conference.\nHe said he and Crosby had a video review session in his office after practice Monday.\n“We just looked at some of the offensive zone stuff,” Sullivan said. “He’s such a student of the game. Sometimes it just gives you another vantage point. It’s a great learning opportunity to see yourself in that situation.”\nThe tape study seemed to corroborate Crosby’s complaint that he and his linemates need to do a better job of holding onto the puck -- especially down low in the offensive zone -- to eventually create chances.\n“Sid is such a physically fit guy. He can wear players down by hanging onto pucks,” Sullivan said. “When they get tired, he doesn’t. He tends to have another gear. The more he and his line hang onto pucks, that’s a huge competitive advantage for us.”\nSullivan assessed that Crosby and his linemates did a better job of that in the Vancouver loss than they have in some other games of late. He thought Crosby and his linemates showed more patience with the puck and did better work controlling territory than they did in other games. But, in his words, “we can get it to another level.”\nAs an example, Sullivan pointed to the game in Montreal. He said in that contest the team made way too many “hope passes” to the slot and essentially ignited the Canadiens’ transition chances with turnovers.\nIt’s not all on Crosby. His new linemate, Derick Brassard, a natural center trying his hand at wing, said he and fellow winger Jake Guentzel could help more in that context.\n“We have to play (to) each other’s strengths,” Brassard said. “We want Sid to get the puck (low). Jake and I have to find some space and a lot of times let him play that one-on-one and find those sweet spots for some scoring chances.”\nThe quest to get Crosby in the goal column doesn’t stop there. Sullivan said Crosby’s shot volume can increase.\nThrough five games, Crosby ranks 110th in the NHL with 24 shots attempted. That stat is a little skewed given that some in the league have played up to seven games.\nBut Chicago’s Patrick Kane has 56 through five, trailing only Jonathan Marchessault’s 58 in Vegas. Alexander Ovechkin has 41 shots attempted, also through five games.\nNathan MacKinnon, Jack Eichel and Mika Zibanejad are other centers all above 40 shots attempted through six games. Tyler Seguin has 53 in that span.\n“Just like our team, I think one of the things we are encouraging Sid to do is shoot the puck a little bit more and simplify his game,” Sullivan said. “He’s too good of a player not to break out of this. We just have to stay with it.”\nA slow start isn’t new for Cosby. He had only one goal in the team’s first five games in 2017. Plus there was an 11-game stretch without a goal between Oct. 21 and Nov. 11.\nGoal output is one area where Crosby’s game could improve this season. Last year’s 29-goal total was a career-low mark in a year where he played at least 79 games.\nWays to increase that number are clear to him, his coach and his linemates. Now it’s just a matter of making it happen.", "url": "https://apnews.com/06af690bcbf24d6696b66fb0d8abe45c"}