{"authors": ["Tim Gallagher"], "date_download": "2020-05-04 20:07:14", "date_modify": "2020-05-04 20:07:14", "date_publish": "2018-02-06 06:00:00", "description": "STORM LAKE, Iowa | When Brandon Graham stripped the football from Tom Brady's hands toward the end of Super Bowl LII on Sunday, I didn't stir. I had no pervasive rooting interest in Super...", "filename": "_a3e97c96631442a9bca8182de230b33b_1588622834.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a3e97c96631442a9bca8182de230b33b_1588622834.html", "title": "GALLAGHER: Buena Vista Beaver shared brush with future Super Bowl star", "title_page": "GALLAGHER: Buena Vista Beaver shared brush with future Super Bowl star", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STORM LAKE, Iowa | When Brandon Graham stripped the football from Tom Brady’s hands toward the end of Super Bowl LII on Sunday, I didn’t stir.\nI had no pervasive rooting interest in Super Bowl LII. Oh, I’d done a story earlier in the week on Shaun Huls, the Eagles’ director of high performance. Huls is a 1996 graduate of Gehlen Catholic High School in Le Mars, Iowa. I leaned toward the Eagles for Huls.\nI’d also done a story a couple of years ago on Cole Croston, the New England Patriots rookie whose improbable rise from Sergeant Bluff-Luton High School to the University of Iowa football team to the Patriots had nearly everyone in Siouxland awestruck. I leaned toward New England for Croston.\nBrandon Graham? The name didn’t ring a bell. It should have.\nSeconds after Brady’s fourth-quarter fumble, our oldest son, Grady Gallagher, sent a note from DeWitt, Iowa, where he teaches and coaches. Grady met and wrote about Brandon Graham when Grady was a senior basketball player at Buena Vista University in Storm Lake, Iowa, four years ago.\nGrady had kept track of Graham in the ensuing years, following the former Michigan Wolverine through his career as a linebacker and defensive end, a journey that began in 2010 with his selection by the Eagles as the No. 13 overall pick in the first round of the NFL draft.\nThe two of them sat side-by-side on an airplane in December 2014 as it flew from Philadelphia to Detroit, Michigan.\nGrady had a seat among his basketball teammates, the Beavers of Coach Brian Van Haaften who’d just come off a holiday tournament victory in Reading, Pennsylvania, not far from Philadelphia.\nThe last person to board the plane was a young gentleman who, according to Grady, sported Jordan 6s, BeatsPros and had an iPhone 6-plus. He looked to be in fantastic shape, leading Grady to wonder if he maybe was an athlete.\nAs he wondered, BV teammate Thomas Wisecup, of Sergeant Bluff, texted Grady. Wisecup, who sat three rows behind, asked if the man next to Grady might be a professional athlete, perhaps an NFL player.\nIt took mere minutes for Wisecup to scan NFL rosters, narrowing his list among 400-some professional players. “Brandon Graham,” he texted Grady before the plane took off. “Plays for Philly, but went to Michigan. From Detroit...”\nGrady, 21 at the time, wasn’t sure how to break the ice. He chose to ask the man if he played collegiate football.\nGraham nodded and said, “Yeah, I played at Michigan.”\nGrady responded, “Well, we’re from Iowa so we’re big Hawkeye fans and I also have a friend who’s a big Michigan fan, so that must be where I’ve seen you.”\nGraham answered: “Oh nice, yeah, and now I’m actually a player for the Eagles.”\nThe voice inside Grady’s head said, “Boom, there goes the dynamite!” (It’s a sports expression for “Yessssss!”)\nMystery solved. It was Brandon Graham. And, for the next 30 minutes, the two talked about Graham’s life in the NFL. They talked about his future in the league.\nThey visited about Buena Vista and what it’s like to play collegiate basketball in the Iowa Conference vs. football in the Big Ten. Graham was sincere and interested in the Beavers prospects that season. At the time, Graham was a free-agent coming off his best and healthiest season as a pro. He hoped the Eagles would keep him as he loved the passion of Philadelphia fans. (The Eagles kept him, as it turns out. What a great decision!)\nGrady returned to the BV campus in Storm Lake and wrote about the encounter in his column for the school newspaper. It was an incredible trip, he noted, as his team won a couple of games, and he’d gotten to see parts of New York City and Philadelphia. And, to top it off, he met and conversed at length with a player in the National Football League, a guy he’d certainly keep track of as the years passed. The two followed one another on Twitter.\n“One thing I don’t ever want to forget,” Grady wrote at the time, “everyone should be a fan of Brandon Graham. He is kind, genuine, hardworking and resilient, someone that young athletes should look up to...Really an awesome dude I’ll never forget.”\nAfter Sunday, millions upon millions will remember Brandon Graham for a long, long time.", "url": "https://apnews.com/a3e97c96631442a9bca8182de230b33b"}