{"authors": ["Michael Fornabaio"], "date_download": "2020-05-04 20:31:52", "date_modify": "2020-05-04 20:31:52", "date_publish": "2018-07-02 22:59:18", "description": "The new New York Islanders braintrust spent years building the New Jersey Devils. In the past two days, they’ve signed two of the top scoring forwards they found with the Devils over the past 10...", "filename": "_50cf6877721e4d3aa3006a6755eff179_1588624312.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_50cf6877721e4d3aa3006a6755eff179_1588624312.html", "title": "AHL Hockey Islanders make free-agency splash for Sound Tigers with Sislo, Lorito", "title_page": "AHL Hockey Islanders make free-agency splash for Sound Tigers with Sislo, Lorito", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The new New York Islanders braintrust spent years building the New Jersey Devils. In the past two days, they’ve signed two of the top scoring forwards they found with the Devils over the past 10 years.\nThe Islanders announced Monday that they’ve signed wingers Matt Lorito and Mike Sislo. Both could be depth forwards for the NHL team, but could also be key contributors for a Bridgeport Sound Tigers team that has lacked high-end scoring at times in recent years.\nLorito, who turns 28 on Tuesday, won the Calder Cup with Grand Rapids in 2017. He scored 49 points in 59 games for the Griffins this past season, though he was injured at the end of the regular season and missed the playoffs. He has 171 points in 202 AHL games since the Albany Devils signed him to an amateur tryout in 2015 out of Brown.\nSislo, 30, is a four-time 20-goal scorer in the AHL, including last year with the Pacific Division-champion Tucson Roadrunners. In 444 AHL games, he has scored 129 goals and 142 assists.\nThough direct comparisons aren’t easy and sometimes aren’t fair, Lorito’s point totals would have led Bridgeport in each of his three full pro seasons. Sislo’s would have led the Sound Tigers this past year and in 2015-16.\nBoth Sislo and Lorito have played in the AHL All-Star event. Sislo was voted the second-team right winger on the AHL postseason all-star team in 2015-16, when he scored 27 goals and 26 assists for Albany. He also holds the Lowell/Albany/Binghamton Devils team record with 14 power-play goals that season.\nLorito scored 54 points to lead that Devils team, which also included defenseman Seth Helgeson, who played all 76 games last year for Bridgeport.\nLorito signed a two-year contract. CapFriendly.com, which compiles NHL contract information, reported that the second year is a one-way deal, paying him the same $700,000 whether he’s in the NHL or AHL.\nSislo signed a one-year, two-way contract.\nLou Lamoriello, who became the Islanders’ general manager last month, ran the New Jersey Devils for almost three decades before leaving for Toronto in 2015. His son, Chris, had been Albany’s general manager; he joined the Islanders in 2016 and is Bridgeport’s GM.\nThe Islanders also announced their re-signing, as previously reported by Montreal-based reporter Renaud Lavoie, of both goalie Christopher Gibson and Helgeson to two-year contracts. They also signed former Pittsburgh Penguins forward Tom Kuhnhackl to a one-year deal.\nmfornabaio@ctpost.com; @fornabaioctp; blog.ctnews.com/fornabaio", "url": "https://apnews.com/50cf6877721e4d3aa3006a6755eff179"}