{"authors": ["Rosa Salter Rodriguez"], "date_download": "2020-05-04 20:14:56", "date_modify": "2020-05-04 20:14:56", "date_publish": "2018-02-18 05:00:01", "description": "On his laptop, Jason Kissel pulls up a topographical map : one that shows northern Indiana without the traditional lines of roads and highways and outlines of counties and cities that appear on...", "filename": "_79fdd2199e97419a867327079511e040_1588623296.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_79fdd2199e97419a867327079511e040_1588623296.html", "title": "Land trust sizes up its successes, challenges", "title_page": "Land trust sizes up its successes, challenges", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "On his laptop, Jason Kissel pulls up a topographical map : one that shows northern Indiana without the traditional lines of roads and highways and outlines of counties and cities that appear on most maps.\nInstead, this map shows aerial views of rivers and their wetlands and woods and other natural features : hills and plains, ridges and valleys.\nThroughout the map are little splotches of bright green : places where ACRES Land Trust, the Huntertown-based regional land conservation nonprofit group, has preserved land.\nKissel, ACRES’ executive director, says the map provides a different way to look at the landscape : one the group hopes to encourage well into the future as preservation efforts continue.\n“The mission hasn’t changed. We’re in this business for preserving land forever,” he said. “And we’re being very strategic about it.”\nBut there soon may be changes for the organization, he said. ACRES recently began a two-year self-study examining all aspects of the group’s work. The study is being undertaken from a position of strength, Kissel said, because ACRES recently marked two milestones : its 60th anniversary and its 7,000th preserved acre.\nIn the last 14 years, the group has acquired more land than it did in its first 44. In the last three years, 1,282 acres were added, bringing the total preserved acreage to 7,047.\nBut those additional acres mean challenges that have propelled strategic planning, Kissel said.\nFor example, several recent acquisitions were funded, at least in part, by the Bicentennial Nature Trust. The trust celebrated Indiana’s 200-year history in 2016 by spending $30 million in state-provided and private money to help buy land with significant natural features. It otherwise would have taken more than a decade to acquire that much ground, the trust’s leaders said.\nMore than $3 million of the trust’s money went for land that ACRES acquired, some that had been on the group’s wish list for many years, Kissel said.\n“That money was a nice influx of money to purchase (land),” he said. But now, he added, that land must be maintained as those who engineered the trust negotiate how its work might be continued.\n“It means one less potential funding source,” Kissel said. “But what is good is that ACRES is diversified,” with existing private and foundation funding sources.\nThe Indiana Land Protection Alliance is now seeking to lobby the state legislature to contribute about $6 million annually to help fund continued acquisition, said Clark Chapman, president and executive director of the Central Indiana Land Trust in Indianapolis.\nThe funding vehicle would combine the trust with the Indiana Heritage Trust funded through custom vehicle license plates, he said.\n“We know that if it’s done, we’ll be bringing more private money to fund,” he said. “The polling done in the past shows there is overwhelming support for this (land conservation).”\nFor ACRES, an immediate challenge is maintaining the group’s lands, which are spread among 18 counties in Indiana, 10 in northwest Ohio and five in Michigan, Kissel said.\nThat raises the question of whether the group needs to develop separate organizations or regional offices, he said. A bigger land maintenance staff also may be needed to tend to visitor amenities, including parking lots and trails, and work on wetlands restoration and invasive species management, among other tasks.\nOne maintenance employee has been added, and an endowment for spending on land management has been created, Kissel said.\nOther areas of inquiry in the study include governance issues, such as whether the 1,400-member ACRES should remain a membership-based group, and marketing and membership recruitment and fundraising methods.\nAlso being examined are expanding alternatives to preserving land other than through ownership by ACRES, such as conservation easements, educating landowners for self-protected land or partnering with other organizations.\nLand groups increasingly “are looking at unlikely partnerships with organizations like health institutions and local farms and farming cooperatives” to preserve land, said Erin Heskett, director of national and regional services of the Washington, D.C.-based Land Trust Alliance’s office in Kalamazoo, Michigan.\n“They’re looking at the needs of a community and working together to provide for it, whether it’s continuing a local supply of clean healthy food or places to recreate themselves or with their families,” he said.\nKissel said it’s unclear whether changes to federal tax laws that might curb nonprofit giving or estate transfer practices will be implemented. ACRES acquires land by way of donations through people’s estates, and 54 percent of its $682,000 annual operating budget is funded through individuals’ monetary donations.\nThen there’s the question of what land should be acquired. While the organization in its last 10-year strategic plan aimed : and succeeded : in doubling its acreage, the group does not simply take every piece of land it is offered, Kissel said.\nThat’s where the topographical map comes in.\nThose green spots, he said, are significant natural places, and one goal of future land acquisition is to complement them by extending already preserved areas and their habitats. That’s because large sections of contiguous habitat are important to many wildlife species.\nIt’s a bit like turning single pearls into a necklace, Kissel said.\nIn Allen County, the largest green spot on the map is along the Cedar Creek corridor near the ACRES office and the Dustin Nature Preserve.\nAbout a half-dozen newly acquired properties, including the 7,000th acre, fill gaps, building a continuous corridor of preserved land along Cedar Creek, Kissel said.\nUsed by American Indians and early settlers as part of a transportation system, Cedar Creek is one of three scenic riverways in Indiana, with about 1,400 acres preserved by ACRES and others, Kissel said.\nOther recent acquisitions have similar natural significance:\n• Quog Lakes, 126 acres of rare quaking bog south of Lagrange.\n• Claxton Woods, ACRES’ first working and sustainable tree farm near Spencerville, containing 93 acres.\n• Wayne Township Preserve, 48 acres of the easternmost edge of original Midwestern prairie grassland south of Warsaw.\n• Caparotta Family Nature Preserve, a rare example of natural succession woodland and wetland habitat in Elkhart County.\n• Blue Cast Springs, an 80-acre site along the Maumee River near Woodburn that contains a heron rookery and a tree that is more than 200 years old.\n“When you see the topographical map,” Kissel said, “you can see what makes the land unique.”\nThe next task, he added, is “finding the next Cedar Creek Corridor,” a place where proactive preservation will add quality of life and “a real sense of place.”\nA good candidate might be the confluence of the Salamonie and Wabash rivers, where ACRES recently acquired 96 acres of forest and meadow, Kissel said, adding that scientists including geologists and biologists would help select the right properties.\n“We’re not doing this in a time of crisis. We’ve been successful,” he said of the self-study.\n“We just want to make sure we can continue that, and maybe we could be more successful than just doubling our acquisitions.\n“I don’t think the organization is going to look a lot different coming out of the other end,” Kissel added.\n“But we’re going to take the time to look at everything. ... We want to look at the most unique things we do and enhance that.”\nrsalter@jg.net", "url": "https://apnews.com/79fdd2199e97419a867327079511e040"}