{"authors": ["David Taylor"], "date_download": "2020-05-04 20:06:22", "date_modify": "2020-05-04 20:06:22", "date_publish": "2018-03-10 05:15:54", "description": "Beverly Ferguson loves her job. The regional director of community relations for Congressman Brian Babin's office shared her passion for helping people at the monthly Dayton Chamber of...", "filename": "_52b3c68e121246b2b791125aaefac7b7_1588622782.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_52b3c68e121246b2b791125aaefac7b7_1588622782.html", "title": "Dayton chamber learns in's and outs of constituent services", "title_page": "Dayton chamber learns in's and outs of constituent services", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Beverly Ferguson loves her job.\nThe regional director of community relations for Congressman Brian Babin’s office shared her passion for helping people at the monthly Dayton Chamber of Commerce luncheon and revealed some important information that many of the members were unaware of but needed to know.\n“Working in a congressional office is like going to church,” she said.\n“You don’t know who’s sitting next to you, you don’t care who’s sitting next to you, you don’t care how they vote, you don’t care for any of those things,” Ferguson told the members.\n“That’s what a congressional office is in that we represent everyone,” she said as she looked across the crowd.\nFerguson joined Babin’s congressional team when he came into office on Jan. 1, 2015. The district is comprised of nine counties, some 740,000 people and numerous offices to take care of those constituents.\n“We have three regional directors. I’m on this side and we have another in Woodville and another in Beaumont,” she explained.\nThe district includes Newton, Jasper, Tyler, Polk, Orange, Hardin, Liberty, Chambers and a portion of southeastern Harris County.\nIn her realm of responsibilities, Ferguson supervises constituent services.\nAmong those services is the staff interns.\n“I’m eyeing those ambassadors back there who did a wonderful job here today. We’re always looking for interns to work in the office,” she said. Ferguson spent time after the luncheon meeting the ambassadors group from Dayton High School and encouraged them to apply for an internship in the congressional office.\n“It’s funny, they spend a summer with us and when they’re done, they walk out of there thinking they’re congressmen now,” she said as the crowd laughed.\nFerguson also mentioned they work with veterans.\n“We’ve helped them get medals that they were never awarded,” she said. One such veteran who called in and asked about one medal he failed to receive, discovered that he was actually due seven medals.\n“We also have a great relationship with DeBakey, the veteran’s hospital. We can help with medications, with coverage, any number of items that veterans are having difficulty overcoming,” she said.\nTax fraud, tax questions, or any other items relating to the Internal Revenue Service, the congressional office can handle.\n“We don’t do Medicaid or Food Stamps, that’s a state office,” she said, “but anything relating to veterans, social security, IRS, or even the postal service, we can handle because it’s federal.”\nWhen she asked if anyone had any issues with the postal service, the chamber members responded with laughter and heads nodding yes.\n“I also work heavy on the immigration side. We help folks who are doing the right thing trying to come into our country,” she said.\nThere have been occasions that Ferguson and members of her staff have been in tears as they worked as advocates for the constituents in the district.\n“We take this serious. If you have a federal issue, sometimes it’s tough, but that’s what we do in constituent services is help you,” she told the chamber members.\nIn addition to all of those services, they can also help with passports.\n“We’ve had people call where everything went wrong, but we can help with that,” she said.\nWith all the services Ferguson said they were willing to do to help on a federal level, there was also some things they could not do or risk jail time.\n“In the congressional office, we don’t talk politics. That’s not our mission. Regardless of whether or not you are Republican or Democrat or Independent, we represent you all,” she said.\nFerguson said they get phone calls from people who want to call and talk politics with them, but they are forbidden by law to discuss politics.\n“That’s reserved for the campaign people,” she said, “but in our office, we talk services.”\n“We’re not trying to ignore you when you have a complaint. We just can’t have that conversation,” she explained.\nFerguson said that they take complaints or opinions and suggestions and send them off to D. C. since they are not allowed to get involved in the political arena.\nOn March 27 they have a pastor’s roundtable where the congressman can sit and listen to their concerns. The congressman also gives them an update on what’s happening in Washington.\nBabin’s office also hosts annually the veteran’s breakfast where he meets and listens to them and shares stories when he was in the military.\nBabin served in both the Army and the Air Force.\n“We also host a congressional art contest. Dayton is onboard with us with one class and the winner advances to the national congressional art contest,” Ferguson said. The artwork hangs in the Capitol Building Tunnel System that connects the capitol and other buildings in Washington, D. C.\nThe art contest is this spring and Dayton Community Center will be the host of the submissions this year. The theme of the contest this year for students to draw or paint is “Harvey through your eyes.”\nThere was also praise for the congressman’s intervention into the appearance of the Dayton post office.\n“We appreciate you helping us get the post office cleaned up,” said Alan D. Connor.\n“They haven’t finished yet, but it looks a lot better, especially outside,” he said.", "url": "https://apnews.com/52b3c68e121246b2b791125aaefac7b7"}