{"authors": ["Brian Hallenbeck"], "date_download": "2020-05-04 20:10:56", "date_modify": "2020-05-04 20:10:56", "date_publish": "2018-10-04 05:00:01", "description": "Mashantucket — When state revenue agents showed up this week at his tiny convenience store on the Mashantucket Pequot reservation, Kenny Reels wondered where they'd been. \"I was shocked it...", "filename": "_5a6473a0aa1447658b092712c3f5977f_1588623056.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5a6473a0aa1447658b092712c3f5977f_1588623056.html", "title": "Reels vowing to press case over state cigarette tax on reservation", "title_page": "Reels vowing to press case over state cigarette tax on reservation", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mashantucket — When state revenue agents showed up this week at his tiny convenience store on the Mashantucket Pequot reservation, Kenny Reels wondered where they’d been.\n“I was shocked it took so long,” Reels said Thursday, days after the Department of Revenue Services seized most of the inventory of cigarettes he’s been selling the past 18 months from his Pequot Trading Post at 11 Ephraim’s Path, which happens to be his home.\n“They took my Native American cigarettes — everything except my Marlboros and my Newports, which I pay taxes on,” said Reels, the former tribal council chairman who served the tribe during Foxwoods Resort Casino’s heyday.\nReels said he didn’t pay taxes on other cigarettes in his store, the ones manufactured and distributed by federally recognized Indian tribes, including the Senecas and the Mohawks of New York state and the Seminoles of Florida. He believes the sovereign status of those tribes exempts their products from state taxes, regardless of whether they’re sold to tribal or nontribal members.\nIt seems the state disagrees.\nA revenue department spokesman who said earlier in the week that the raid on Reels’s store was part of an “ongoing criminal investigation,” declined to comment further Thursday. He said the investigation could take weeks.\n“They haven’t charged me yet, but pretty soon,” said Reels, whose store’s files and cash register software also were seized. “The revenue agent told me the state gets $4.35 in excise tax on every pack of cigarettes sold in Connecticut. I let him know the Mashantucket Pequot Tribal Nation is not Connecticut.\n“The next step is court,” he said.\nReels, 58, battling bone cancer, sounded neither belligerent nor especially defiant. But he’s been wanting to make a point about tribal sovereignty and said he and his lawyer, Michael Blanchard, think he’s got a good case.\nBlanchard was not immediately available Thursday.\n“My long-term plan is for the tribe to grow our own tobacco, manufacture our own cigarettes and sell them,” Reels said.\nCigarette sales on Indian reservations have caused controversy in the past.\nIn 2003, Rhode Island state police arrested several members of the Narragansett Tribe, including its chief, Matthew Thomas, in a raid on a tribal smoke shop selling untaxed cigarettes on the Narragansetts’ Charlestown reservation. Tribal members were wrestled to the ground and handcuffed in the confrontation.\nAn incident in Connecticut occurred a decade earlier on the Golden Hill Paugussetts’ reservation in Colchester, where the tribe’s chief, Moonface Bear, was charged with illegally selling tax-free cigarettes. Moonface Bear led a 13-week standoff against state police before surrendering to arrest.\n“He was a friend of mine,” Reels said of Moonface Bear, who was 35 when he died in 1996.\nb.hallenbeck@theday.com", "url": "https://apnews.com/5a6473a0aa1447658b092712c3f5977f"}