{"authors": ["Karen Price"], "date_download": "2020-05-04 20:20:08", "date_modify": "2020-05-04 20:20:08", "date_publish": "2018-03-20 20:30:52", "description": "Roger Ziegler and his wife, Paula, were living one of every parent's worst fears when their nine-year-old son fell desperately ill in 2002. Over the next two years they would grapple with...", "filename": "_7f3e3d6383fa4ec185baf18ea45fbac9_1588623608.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7f3e3d6383fa4ec185baf18ea45fbac9_1588623608.html", "title": "Gibsonia man writes book about son's triple-organ transplant journey", "title_page": "Gibsonia man writes book about son's triple-organ transplant journey", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Roger Ziegler and his wife, Paula, were living one of every parent’s worst fears when their nine-year-old son fell desperately ill in 2002.\nOver the next two years they would grapple with the terror of losing him as he awaited a three-organ transplant at UPMC Children’s Hospital of Pittsburgh. In the years following the 15-hour operation, the family would relocate permanently from California to Wexford, and then Gibsonia, as Noah received ongoing treatment at Children’s.\nNoah is now 24 years old and a graduate of Pine-Richland High School, and Roger Ziegler has written a memoir chronicling his journey entitled, “Patchwork Kid: A Boy’s Transplant Journey of Hope Through the Midst of Tragedy.” He hopes to use part of the proceeds to one day start a nonprofit. The self-published book is available on both Amazon and Barnes and Noble’s online store.\n“The story is so powerful, and it’s a story of hope that should transcend family circumstances and be relevant to everyone, I think,” Ziegler said. “We want to continue to support Noah through his adventures but the bigger vision is to be able to give back to other families in the trenches. We can be a hand, we can be a friend and lock arms with those families and people and say, ‘You’re not alone. We’ve been through the fire.’ That’s the big picture.”\nNoah Ziegler was born with gastroschisis, a condition in which a baby’s intestines are outside the body. He had surgery and spent his first month of life in the NICU, then grew up an active, healthy child. One day, however, he woke up with symptoms that seemed like the stomach flu. Over the course of the day his condition worsened to the point that he became critically ill.\n“He’d been a quote-unquote normal kid — running, playing, eating, you name it,” Ziegler said. “We lived in Southern California so he was very active, out in the sunshine every day. Then boom, all of a sudden here we go. We’re living in crisis mode.”\nNoah had his small and large intestines removed. He began receiving nutrition intravenously, and the family was told that eventually that would begin to tax his liver. It could take 15 years, or it could happen sooner.\nOne year later, Noah was already showing signs of liver disease. In 2004, in order to save his life, Noah would need a three-organ transplant — liver, pancreas and small intestine. His doctors said he needed to be flown to Children’s Hospital of Pittsburgh, the top facility in the country for what their son required.\nSome dark months followed as Noah and Paula lived in Pittsburgh awaiting news on new organs, while Roger and their other three children remained in California.\n“It got to the point where we were getting three or four updates a day and a couple of times (Paula) said you need to get on a plane right now, he’s probably not going to make it,” Ziegler said. “The horror just overcomes you.”\nThe whole family flew out to celebrate Noah’s 11th birthday. He was gravely ill and running out of time.\nTwo days later they got a phone call that there was a match for all three organs.\nWhen Noah first became sick, there was no Facebook for posting updates. Ziegler used CarePages, a website created for families experiencing illness or hardship to share news, to update loved ones about Noah’s health and treatment.\nThose posts became the foundation of the book.\nZiegler, whose family also gives back to Ronald McDonald house, said he hopes the book will not only highlight the work of doctors and nurses at Children’s Hospital in saving their son’s life but also give hope to others.\n“After taking eight years to write my memoir of his journey, my desire is to share with the world how we’ve had such an amazing hope over the years,” he said. “I know our story will touch hearts in big ways.”\nKaren Price is a Tribune-Review contributor.", "url": "https://apnews.com/7f3e3d6383fa4ec185baf18ea45fbac9"}