{"authors": ["Chris Adamski"], "date_download": "2020-05-04 20:18:45", "date_modify": "2020-05-04 20:18:45", "date_publish": "2018-03-21 05:46:48", "description": "A month ago, Josh Jooris was playing for the AHL affiliate of an NHL team that appeared well locked into also-ran status in the Eastern Conference playoff race. Monday, he found himself in...", "filename": "_b4b8052adcc5446c9128246b25ce3e56_1588623525.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b4b8052adcc5446c9128246b25ce3e56_1588623525.html", "title": "Josh Jooris back ‘where he wants to be' with Penguins", "title_page": "Josh Jooris back ‘where he wants to be' with Penguins", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Josh Jooris back ‘where he wants to be’ with Penguins\nA month ago, Josh Jooris was playing for the AHL affiliate of an NHL team that appeared well locked into also-ran status in the Eastern Conference playoff race.\nMonday, he found himself in the Penguins’ locker room.\nShuttling back and forth between Pittsburgh and Wilkes-Barre over the past two weeks? Jooris can deal with that.\n“It’s not like it’s a flight or anything; it’s not that big of deal,” Jooris said after practice at the UPMC Lemieux Sports Complex. “But this is where I want to be.\n“Whenever I have a chance to get up here and get an opportunity, I am excited.”\nAcquired via a deadline-day deal from the Carolina organization Feb. 27, Jooris has played in five games for the AHL Penguins and two games for the NHL Penguins.\nHe went scoreless in centering the fourth line in March 10-11 games; during this stretch, Jooris will be playing on the fourth-line’s left wing, if Monday’s practice is any indication.\n“That’s the position they need filled and I can play both,” Jooris said. “It’s definitely different responsibilities, but I have gone back and forth so many times throughout my career I am pretty used to it.”\nChris Adamski is a Tribune-Review staff writer. Reach him at cadamski@tribweb.com or via Twitter @C_AdamskiTrib.", "url": "https://apnews.com/b4b8052adcc5446c9128246b25ce3e56"}