{"authors": [], "date_download": "2020-05-04 20:04:28", "date_modify": "2020-05-04 20:04:28", "date_publish": "2018-01-30 12:00:00", "description": "Iggy Azalea has called for women to boycott the Grammys Awards next year. The 'Go Hard Or Go Home' singer was responding to Recording Academy President Neil Portnow's comments that women in...", "filename": "_d2a31601e2bb44c2995a590f59024673_1588622668.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d2a31601e2bb44c2995a590f59024673_1588622668.html", "title": "Iggy Azalea calls for women to boycott Grammys", "title_page": "Iggy Azalea calls for women to boycott Grammys", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Iggy Azalea has called for women to boycott the Grammys Awards next year.\nThe ‘Go Hard Or Go Home’ singer was responding to Recording Academy President Neil Portnow’s comments that women in music need to “step up” if they want to win Grammys.\nIggy, 27, hit back on Twitter: “Neil Portnow really has me heated with his ‘women need to step up’ Grammy-Boys-Club bulls*** statement. [sic]”\nResponding to a fan who tweeted she should “diss” him in her music, Iggy replied: “Or instead of being gracious and wearing white flowers on the carpet (bringing in the viewers for his telecast in designer gowns) women should consider if we NEED to take firmer action and stay at home in PJs next year ... see how that works out for Neil.”\nThe ‘Black Widow’ rapper was not actually in attendance at this year’s awards. After attending the Roc Nation pre-Grammy brunch in New York, she jetted back to Los Angeles before the ceremony.\nIggy is not the only “woman in music” to take offence at Portnow’s comments.\nNine-time Grammy winner Sheryl Crow fumed: “To put it on women not tapping into their creativity and not pushing for roles in the business of music such as producing, it seemingly comes off as sexist. It is a strangely insensitive thing to say, particularly at this juncture of women standing up for themselves, demanding equality and fairness. The lack of female representation is not about there not being enough quality coming from women in music, it’s about the fact that the opportunities for women to have a presence have been chopped in half. #GrammysSoMale [sic]”\nCharli XCX also blasted Portnow by tweeting: “Ugh bout 2 step up on 2 ur face ... women are making AMAZING music right now wtf is this dude talking about ????? [sic]\nPortnow made his comments following the criticism that male winners dominated the ceremony held at Madison Square Garden in New York City on Sunday night (01.28.18).\nHe was quoted as saying after the ceremony: “It has to begin with ... women who have the creativity in their hearts and souls, who want to be musicians, who want to be engineers, producers, and want to be part of the industry on the executive level. [They need] to step up because I think they would be welcome.”\nPink was also angered by the remarks, publishing an open letter in response on social media.\nShe wrote: “WOMEN IN MUSIC don’t need to ‘step up’. Women have been stepping since the beginning of time. Stepping up, and also stepping aside. Women OWNED music this year. They’ve been KILLING IT. And every year before this.\n“When we celebrate and honor the talent and accomplishments of women, and how much women STEP UP every year, against all odds, we show the next generation of women and girls and boys and men what it means to be equal, and what it looks like to be fair. [sic]”", "url": "https://apnews.com/d2a31601e2bb44c2995a590f59024673"}