{"authors": ["Eric Shultz"], "date_download": "2020-05-04 20:14:03", "date_modify": "2020-05-04 20:14:03", "date_publish": "2018-03-31 00:00:00", "description": "As a wide-eyed freshman in 2014-15, Abby Zolner saw even the District 2 swimming and diving championships as a challenge. Then her Dallas 200 and 400 freestyle relays won D2 titles, and the...", "filename": "_aeeda4227e2544fd87a633cf335613a7_1588623243.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aeeda4227e2544fd87a633cf335613a7_1588623243.html", "title": "Citizens’ Voice Girls Swimmer Of The Year: Dallas Senior Abby Zolner", "title_page": "Citizens’ Voice Girls Swimmer Of The Year: Dallas Senior Abby Zolner", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As a wide-eyed freshman in 2014-15, Abby Zolner saw even the District 2 swimming and diving championships as a challenge.\nThen her Dallas 200 and 400 freestyle relays won D2 titles, and the latter placed fifth in the state.\nSuddenly, Zolner went from a freshman without lofty expectations to a returning state medalist hoping to return to the PIAA championships. She made sure she didn’t peak early.\nZolner broke the Mountaineers’ 500 free record and won D2 gold in the 100 butterfly — tying for sixth at states — as a sophomore. Her junior year ended at states again, this time in the 400 free relay, 100 fly and 500 free.\nShe still found room to raise the bar after all that success. In her final trip to states, Zolner and the rest of the Mountaineers finished second in the Class 2A team standings. She led the way, swimming to fourth in the 400 free relay and 100 fly, sixth in the 200 free relay and seventh in the 200 IM.\nZolner’s wildly successful senior season was also enough to earn her Citizens’ Voice Girls Swimmer of the Year honors. It’s the fourth all-star selection for the three-sport athlete, who also does cross country and track and field.\nZolner recently talked about her season with staff writer Eric Shultz:\nQ: When did you start swimming, and why?\nA: I think I was in third grade. I know my mom always tells me that she was the first one to take me swimming at those baby classes at Misericordia, so she likes to take credit for that. My dad took me to (a club team practice) and said, “We need to find something you like to do.” There was a two-week trial and ... it was fun. I enjoyed it, and I just stuck with it and liked it more and more.\nQ: You made it to states in all four years of varsity swimming and earned medals in three of those four seasons. What made that kind of success possible?\nA: Freshman year, it wasn’t really expected that we’d get to states. I didn’t even think about that because it was my first year, and getting to districts was a challenge. Once we made it, we said, “Oh, this is cool.” After that, it was kind of expected of us. … Our work ethic throughout the year and coach (Romayne) Mosier’s help and pushing each other, eating better, sleeping better — all those things matter.\nQ: What goes into your diet when you’re trying to swim well?\nA: I cut out all junk food. I made sure I was eating three full meals with healthy snacks because that diet really plays into how well you do in the sport. … Junior year didn’t really go that well for me. I didn’t want to plateau like some people do when they get to my age, so I knew I had to change something. That was something that I set as a personal goal, to eat better and do that much better.\nQ: What stands out through all of your individual and team success as something you’ll remember most?\nA: It’s just so incredible, and you can compare our team to any other team in the past, too. Our season and our four years, and four-year district champions and places at states really stand out because it’s better than anyone’s ever really done, even on the boys side. It was amazing how that many girls could get to states and get second. … Coming in as a freshman and seeing what we could do and carrying that was incredible.\nQ: As far as senior years go, two relay medals, two individual medals and a second-place team finish is hard to top. Did this season go the way you hoped?\nA: It definitely exceeded my expectations. I never thought, even the day before states, I’d leave with four medals. Oh cool, I made it in the IM, I’ll get some points. I never thought I’d get top-eight in the IM. … Getting second, no one would have expected that.\nQ: When your final relay finished and you get to leave the state meet on that kind of note with your teammates, how do you remember feeling?\nA: It was incredible that I got to finish it with my team and my relay team. Me, Missy (Melissa Leonard) and Annalise (Cheshire) have been practicing since last year, and me and Annalise have always been looking for those two other girls to take us to the podium. I’m glad I was there with them. It was surreal. It didn’t even feel like my season was over; it still doesn’t.\nQ: You qualified for the state meet in tough events like the 200 IM and 500 freestyle over the years. Is any one event most challenging to you?\nA: I think those are the two hardest events because they’re just so grueling. The 500 is just 20 laps of freestyle. But I truly think the IM is the hardest because it’s four different strokes. It’s so tough to swim the 50 fly as hard as you can — and have three more strokes to go. Anyone who can do the 200 IM successfully, that’s what a swimmer is.\nQ: You still have a track and field season to go with Dallas. What are you hoping to accomplish there?\nA: I’m hoping we can maybe take home a Wyoming Valley Conference championship in that. My goal is to qualify for states in any event so I can be a three-sport state qualifier. That’s been my goal since I was a freshman. It really came to my head junior year because I didn’t really have a fall sport, but I joined cross country. … I have my shot, I’m two sports down.\nContact the writer:\neshultz@citizensvoice.com;\n570-821-2054; @CVEricShultz on Twitter", "url": "https://apnews.com/aeeda4227e2544fd87a633cf335613a7"}