{"authors": ["Rand Wilson", "Peter Olney", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Kim Moody", "Rossana Cillo", "Lucia Pradella", "Jörn Boewe"], "date_download": "2020-05-04 19:59:34", "date_modify": "2020-05-04 19:59:34", "date_publish": "2018-10-04 00:00:00", "description": null, "filename": "2018_10_salt-amazon-union-logistics-organizing-socialists_1588622374.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/10/04154708/GettyImages-825338340.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_10_salt-amazon-union-logistics-organizing-socialists_1588622374.html", "title": "Socialists Can Seize the Moment at Amazon", "title_page": "Socialists Can Seize the Moment at Amazon", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe Challenge Amazon is the third-largest retailer in the world (after Walmart and CVS) and is now the largest online retailer edging out Alibaba, the Chinese online distributor. Until very recently Amazon relied solely on online sales, but with its acquisition of Whole Foods, its business model is changing. Amazon operates worldwide with distribution/fulfillment centers in over 18 countries. There are 351,000 employees worldwide and 280,000 in the US alone. Distribution centers operate in the twenty-five major metropolitan areas of the United States. Jeff Bezos, the founder of Amazon, is now the owner of the Washington Post with vast financial resources and an increasing role in national politics. Union strategists and organizers have been both inspired and chastened by recent organizing drives at Walmart and the ongoing Fight for $15 campaign. While an organizing campaign at Amazon is a daunting prospect, the labor movement was built at key moments by thinking big and acting boldly. For example, thousands of garment workers were organized in New York City in the “Rising of the Ten Thousand” in 1909. William Z. Foster’s strategic vision inspired organizers to plan and execute a brilliant strike at Big Steel in 1919. While unsuccessful, the lessons and experience from this effort inspired future organizers who would eventually crack the industry fifteen years later. And of course, the iconic sit-down strikes in the thirties were conducted by organizers who understood the vulnerabilities in the production chain of giant auto companies like General Motors. Only twenty-one years ago, the International Brotherhood of Teamsters struck the premiere symbol of on-time deliveries: United Parcel Service. Once UPS’s inter-city “feeder” drivers stopped hauling between the company’s hubs and its package cars stopped deliveries, the strike’s impact was immediate. Mere hours after the strike began, packages piled up and clogged the sorting belts at its distribution centers, paralyzing the workflow. The Teamsters’ success in framing the walkout as a battle against part-time and precarious work was a shining example of workers rising up to challenge one of the largest corporations in America.", "url": "https://www.jacobinmag.com/2018/10/salt-amazon-union-logistics-organizing-socialists"}