{"authors": ["Donald Hunt Tribune Staff Writer"], "date_download": "2020-05-04 20:28:47", "date_modify": "2020-05-04 20:28:47", "date_publish": "2018-04-03 04:00:00", "description": "Philadelphia Phantomz to open their third season The Philadelphia Phantomz football team, an all women’s tackle football team, will open its season on Saturday, April 7. The Phantomz will...", "filename": "_f44eb29eaf4b4c17ad70523fd113f9ee_1588624127.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f44eb29eaf4b4c17ad70523fd113f9ee_1588624127.html", "title": "Sports Notes: Philadelphia Phantomz football to start its third season", "title_page": "Sports Notes: Philadelphia Phantomz football to start its third season", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Philadelphia Phantomz to open their third season\nThe Philadelphia Phantomz football team, an all women’s tackle football team, will open its season on Saturday, April 7. The Phantomz will play the Boston Renegades at Marcus Foster Memorial Stadium, Germatown and Hunting Park avenues, at 6 p.m.\nThe Phantomz had a terrific season last year where they made a trip to the Eastern Conference championship. The Phantomz are one of the new teams in the Women’s Football Alliance (WFA). The league is comprised of 36 women from the Philadelphia area.\nCouncilwoman Cindy Bass will start the game with an official coin toss. The game will feature a halftime to recognize Rashida Cornitcher, an NFL agent with Ultimate Vision Sports Management. For more information on the team, go to www.phantomzfootball.com.\nJoe Hand Gym to hold Golden Gloves tourney\nFans can see some of the top amateur boxers in the state battle in the annual Pennsylvania Golden Gloves Eastern Regional Championships. The event will be held on Saturday, April 21 at the 2300 Arena.\nTickets for general admission are $25 at the door or by contacting Joe Hand Promotions at 1-800-557-4263. The doors will be open at 6 p.m. and the first bout will begin at 7 p.m.\nThe Joe Hand Boxing Gym and Computer Lab will host the tournament. This marks the 22nd year the gym has participated in this event. The proceeds from the event will help fund the Joe Hand Boxing Gym’s programs for children as well as the ongoing search for a larger facility to accommodate more community members in need.\nThe Golden Gloves have produced a number of professional fighters such as Danny Garcia, Marvis Frazier, Jesse Hart, Chazz Witherspoon, Tim Witherspoon, James Shuler, Ivan Robinson and Olympic-medalists Terrance Cauthen and David Reid.", "url": "https://apnews.com/f44eb29eaf4b4c17ad70523fd113f9ee"}