{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:27:54", "date_modify": "2020-05-04 20:27:54", "date_publish": "2018-05-18 10:00:00", "description": "La PORTE – La Porte Hospital has opened a new Wound Care Center, combining the expertise of specialized wound care providers and nurses with the resources of an advanced healthcare...", "filename": "_ab2578417c934f8e8d1f2610059bcf96_1588624074.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ab2578417c934f8e8d1f2610059bcf96_1588624074.html", "title": "La Porte Hospital opens new Wound Care Center", "title_page": "La Porte Hospital opens new Wound Care Center", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "La PORTE – La Porte Hospital has opened a new Wound Care Center, combining the expertise of specialized wound care providers and nurses with the resources of an advanced healthcare system.\nThe La Porte Hospital Wound Care Center, located on the first floor of the hospital at 1007 Lincoln Way, provides outpatient wound care services for a variety of wounds and conditions.\n“We are pleased to bring a formalized wound care program to La Porte County and are looking forward to taking care of patients, healing them, and helping them return to their normal lives,” said Ashley Dickinson, CEO at La Porte Hospital.\nThe center’s medical director is Mangalore Subba Rao, M.D., a general surgeon with La Porte Physician Network. Subba Rao and a team of wound specialists provide a comprehensive range of therapies for the clinical management of acute and chronic wounds.\n“Unlike normal wounds that your body can heal, chronic or traumatic open wounds show no significant signs of healing over a period of several weeks. A non-healing, chronic wound can be frustrating, time-consuming and costly,” Subba Rao said. “Our wound care treatment team provides a comprehensive approach to the diagnosis and treatment of non-healing wounds. The team approach can result in less cost and quicker healing of the wound.”\nJill Chorba, program director for the Wound Center, said each patient receives an individual treatment plan, coordinated with the patient’s primary care provider and other physicians.\n“In many cases, wounds require long-term treatment. The La Porte Hospital Wound Care Center is here to provide this specialized service so a patient’s primary care and other doctors can focus on other aspects of their care. We are in continual contact with a patient’s doctor, home health agency, skilled nursing team or extended care facility,” Chorba said.\nLa Porte Hospital Wound Care Center professionals treat many different types of wounds, including: diabetic wounds, arterial ulcers, pressure ulcers, venous stasis ulcers, trauma wounds/crush injuries, compromised skin grafts and flaps, complex soft tissue wounds, osteomyelitis (bone infection), problem surgical wounds, soft tissue infections and gangrene.\nThe medical professionals in the wound center closely evaluate patients to determine what medical conditions might be causing the wound, and whether that might block the natural healing process.\n“This is why it is important to coordinate wound care across the patient’s care continuum,” Chorba said.\nThe La Porte Hospital Wound Center is located on the first floor of the hospital, at the south east entrance of the facility. Patients may be dropped off at the circular south entrance, and parking is available at the hospital’s main entrance to the west.\nFor more information or to make an appointment, call (219) 326-2415.", "url": "https://apnews.com/ab2578417c934f8e8d1f2610059bcf96"}