{"authors": ["Natalie Shure", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Colin Gordon", "Timothy Faust", "Adam Gaffney"], "date_download": "2020-05-04 19:51:25", "date_modify": "2020-05-04 19:51:25", "date_publish": "2018-12-18 00:00:00", "description": null, "filename": "2018_12_affordable-care-act-federal-judge-ruling_1588621885.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/12/18122305/GettyImages-678681132.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_12_affordable-care-act-federal-judge-ruling_1588621885.html", "title": "Can We Just Have Medicare for All Already?", "title_page": "Can We Just Have Medicare for All Already?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "A federal judge’s ruling last week striking down the Affordable Care Act has evoked a nearly uniform response. The decision, everyone notes, is “bananas,” “crazypants,” and unlikely to hold up on appeal in higher courts. Even the ACA-disliking Wall Street Journal editorial board slammed its reasoning; others have called it “lawless,” a “cruel mistake,” and “absurd.”\nThey aren’t wrong: the argument they’re skewering contends that by eliminating the financial penalty for not having health insurance coverage, the individual mandate went from being an exercise of taxing power to an exercise of illegal government coercion (even though the only conceivably coercive element to begin with was the tax penalty). According to Judge Reed O’Connor of North Texas, the individual mandate was also not severable from the rest of the health care law — and so when Congress removed the penalty in a bill last year, the body signaled its intent to repeal Obamacare entirely. The idea that Congress could not have possibly intended to leave the rest of the ACA intact while axing one element is contradicted by the fact that that’s exactly what they did.\nOf course it’s an idiotic argument. But this wasn’t a failure of logic; it was a triumph of antidemocratic power wielded by capital’s handmaidens. Legal decisions are not produced by neutral algorithms that yield objective judgments based on formal logic. They’re written by people making ideological arguments, in support of ideological outcomes.\nAs a longtime member of the Federalist Society — an archconservative judicial pipeline that grooms right-wing legal professionals and places them in a networking pool of pro-business zealots — Judge O’Connor did exactly what he was supposed to do. He delivered for the plaintiffs who intentionally filed suit in his district, the twenty attorneys general who signed onto it, and the Trump administration, which declined to step in to defend federal law. O’Connor’s legal reasoning was circuitous lunacy because the preselected conclusion — that millions of sick and poor people ought to be harvested for profit to enrich those at the top — is so indefensible to begin with.\nThat is quite literally what the conservative case against the ACA boils down to: the conviction that minimizing rich people’s tax bills ought to be funded by the mass indiscriminate deterioration of other people’s lives. The world that the Right wishes to build is one in which extreme inequality is a feature, not a bug — in which the resources necessary to sustain society are privatized and hoarded, without any mechanism to redistribute the spoils to those unlucky enough not to own property and wealth.\nThis vision engineers concentrated wealth and widespread suffering by definition; the sole purpose of the Federalist Society is to entrench it into law. By further shrinking the meager American welfare state, the Right raises the rich’s ceiling by lowering the poor’s floor. The Affordable Care Act was the most downwardly redistributive piece of legislation in a generation — exactly the type of thing the Federalist Society fights to reverse.\nUnilaterally decimating Obamacare is undeniably vile. But the solution isn’t to merely fight for the ACA’s preservation — it’s to fight for a universal, publicly funded health care system free at the point of service.\nThe most important expansions of democracy in American history — the abolition of slavery, the extension of labor rights, the winning of civil rights, the establishment of the welfare state — have all been driven by social movements demanding justice. These movements reshaped political imaginations, impacting what legislation reached the courts, who served on them, and what exactly would-be maniacal, boot-slobbering judges were willing to stake their legacies on.\nWe need the same today — a movement that would entrench solidarity over oligarchy. If we organize against the Right on a mass scale, we can scare them, replace them, and take back so much of their money that they have none left to spend on shitty district judges in the first place.", "url": "https://www.jacobinmag.com/2018/12/affordable-care-act-federal-judge-ruling"}