{"authors": ["Joey Morona"], "date_download": "2020-05-04 20:16:26", "date_modify": "2020-05-04 20:16:26", "date_publish": "2018-02-08 15:05:30", "description": "Who are 100 Thieves, Dan Gilbert's other team? CLEVELAND, Ohio -- The Cleveland Cavaliers and Golden State Warriors renew their rivalry once again on Sunday. Don't double check your...", "filename": "_c32f551091314baaa30b1a165594f47c_1588623386.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c32f551091314baaa30b1a165594f47c_1588623386.html", "title": "Who are 100 Thieves, Dan Gilbert's other team?", "title_page": "Who are 100 Thieves, Dan Gilbert's other team?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Who are 100 Thieves, Dan Gilbert’s other team?\nCLEVELAND, Ohio -- The Cleveland Cavaliers and Golden State Warriors renew their rivalry once again on Sunday.\nDon’t double check your NBA schedule, though, because the battle isn’t being played on a basketball court. It’s being decided in a gaming arena in Los Angeles.\nThat’s where 100 Thieves, the eSports team owned by Dan Gilbert, takes on the Golden Guardians, the team owned by the Warriors, in a North America League of Legends Championship Series (NA LCS) match.\nThe Cavaliers owner is among the growing list of major league sports team owners to invest millions of dollars in eSports, or competitive video gaming. In addition to 100 Thieves, Gilbert owns the Cavs Legion Gaming Club of the new NBA 2K League launching in the spring.\nSo, who is the other sports franchise in Gilbert’s life? We caught up with 100 Thieves founder Matt “Nadeshot” Haag and president and COO John Robinson to find out.\nGILBERT’S ROLE\nHaag announced back in November that the Cavaliers owner was making a “multimillion dollar investment” in 100 Thieves. Since then, Gilbert has been integral in getting the team off the ground and helping it get into the ultra-competitive, very expensive NA LCS, which reportedly charges a $10 million franchise fee.\n“I had the idea and I had the concept, but they really helped me execute it. I don’t think 100 Thieves would be where it is without Dan’s involvement. It was really, really big for me,” Haag said.\nOne of Gilbert’s other companies, Rocket Mortgage, serves as 100 Thieves’ primary sponsor.\nTRADITIONAL SPORTS & ESPORTS\nOver the past few years, more than two dozen sports team owners from the New England Patriots to the New York Mets, from the Philadelphia 76ers to the Washington Capitals, have been snatching up existing or launching their own eSports teams in a frenzy akin to the Oklahoma land rush of 1889.\nWhy? Running an eSports team is certainly similar to owning a traditional sports team from a competitive and financial standpoint, but there’s something else at play.\n“I think everyone just sees the demographics, the trends and the interest. You look out a few years and I think everyone can see eSports competing with the big traditional sports in the U.S.,” Robinson said. “I think these owners as business people understand where the fans of the future are, what they’re going to be watching and they want to get in early.”\nThe majority of eSports fans, incidentally, are between 13 and 24 years old, according to Statista.\nTHE POPULARITY OF ESPORTS\nHow valuable is the eSports audience? Very. According to the research firm Newzoo, eSports will generate $922 million in revenue in 2018 and attract 221 million hard-core fans.\n“Video games are more popular than ever before and that’s turned into entertainment in of itself,” Robinson said. “It’s not just participatory but something that people want to watch as a pastime.”\nWHAT IS 100 THIEVES?\nThe company was founded by Matt “Nadeshot” Haag, a former “Call of Duty” world champion and professional video gamer since high school. In addition to fielding a League of Legends team, the brand also focuses on content creation and has an apparel line. “For me, 100 Thieves is much more than just an eSports team. It’s really a lifestyle,” Haag said.\nLEAGUE OF LEGENDS\nSo far, 100 Thieves has fielded only one team -- in League of Legends, a hugely popular online real-time strategy and role-playing game -- but the brand is planning to expand into more games later this year.\n100 Thieves assembled five of the top League of Legends players, originating from South Korea, China and the U.S., with the hopes of winning it all this year. Not yet halfway through the regular season, the team is currently in fourth place with a 4-2 record in the NA LCS.\nIn an ironic twist, the Golden State Warriors’ team, the Golden Guardians, are 0-6 and in last place.\n“There is a rivalry between 100 Thieves and the Warriors,” Haag said. “I definitely think there is a lot of talk surrounding it, being a Finals rematch from the previous year. So, it’s pretty cool to be a part of that.”\nMatches are played on the weekends at Battle Arena in Los Angeles and streamed live online at lolesports.com.\nHOW LUCRATIVE IS A CAREER IN ESPORTS?\n“This year, the top players just broke $1 million in salary for the first time ever,” Robinson said. “That gives you a sense of how valuable these players are to the teams.”\nIn addition, the NA LCS doled out $200,000 in prize money last season. At worlds, nearly $5 million was awarded to the winning teams.\nTHE FINAL WORD\nHaag said if there’s one thing people who might not totally get eSports could learn, it’s the dedication the top players put into honing their craft. It’s not unlike LeBron James hitting the gym early day in and day out in order to get better.\n“From the outside looking in, it might just look like you’re in your room playing games all day, it’s a lot more than that. There’s a lot of more strategy, preparation and time that goes into all this for people to be the best,” he said.", "url": "https://apnews.com/c32f551091314baaa30b1a165594f47c"}