{"authors": ["Justin A. Cohn"], "date_download": "2020-05-04 21:06:37", "date_modify": "2020-05-04 21:06:37", "date_publish": "2018-04-03 05:00:01", "description": "The Mad Ants needed to convert a 3-pointer as time expired tonight or their season was over. Bearing that in mind, I'd have put the ball in the hands of the hottest player in the league right now,...", "filename": "_6a77ce144e4b4bd18e7bbaf54e9e090a_1588626397.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6a77ce144e4b4bd18e7bbaf54e9e090a_1588626397.html", "title": "Why wasn't ball in hands of Ants' Jones?", "title_page": "Why wasn't ball in hands of Ants' Jones?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Mad Ants needed to convert a 3-pointer as time expired tonight or their season was over. Bearing that in mind, I’d have put the ball in the hands of the hottest player in the league right now, DeQuan Jones.\nInstead, the shot went to Jamil Wilson. That’s fine. He’s a very good player. He played in the NBA this season. And he had been fouled twice on 3-pointers in the fourth quarter tonight.\nBut, still, with the season on the line?\nAfter the Mad Ants’ 119-116 loss to the Erie BayHawks at Memorial Coliseum : it was the Eastern Conference semifinal game : coach Steve Gansey said the shot went up as scripted. It just didn’t come down where it was supposed to, and now the BayHawks will face Raptors 905.\n“It was exactly what I was looking for,” Gansey said. “Obviously they jumped it, but the 3 was for Jamil and the shot faked and he still got the look but it went off the back iron. It was what we wanted, though, coming down at the end. When you’re down 27 points and you cut it all the way down to 3 (and can) tie it, it’s a tough one to swallow.”\nIt’s no secret, I think Gansey is one of the best coaches around. So, yes, I’m nitpicking here. And this is one of those hindsight-is-20/20 situations; if Wilson had made the shot I’d be saying it was brilliant, but since he missed it I have to question it.\nWilson had only 10 points in the game and was 0 for 4 from 3-point range. Jones had a game-best 29 points and was 1 for 4 from beyond the arc. (Jarrod Uthoff was 4 for 5; Edmond Sumner 1 for 1; and Trey McKinney Jones is also a clutch player who only got 16 minutes in this game).\nWilson did get a fairly open look at the basket, though he said Josh Magette gave him some trouble defensively before the ball went off the back of the rim. I have to believe that either Gansey would like that decision back or, maybe, it was lip service and this wasn’t exactly as he’d scripted it and they couldn’t get the ball to Jones.\nEither way, this is a play we’ll all be thinking about for a long time in Mad Ants land.\nThat the team came out flat today is more on the leaders than Gansey to me; the coach can’t put the sneakers on for them. And he really developed the young talent well today. The Mad Ants feel like they’re ready to take the next step under the Pacers, assuming they bring him back and I think they will.\njcohn@jg.net", "url": "https://apnews.com/6a77ce144e4b4bd18e7bbaf54e9e090a"}