{"authors": ["Tom Meersman"], "date_download": "2020-05-04 20:05:53", "date_modify": "2020-05-04 20:05:53", "date_publish": "2018-03-04 12:00:19", "description": "The farm economy has been struggling for the past several years, but Land O’Lakes Inc. — with its dairy foods, animal feed and crop supply businesses — has been forging ahead...", "filename": "_fae0a978c227488096c4bf3d9f22186c_1588622753.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fae0a978c227488096c4bf3d9f22186c_1588622753.html", "title": "Diverse portfolio helps Land O'Lakes carve out record profit in lean times", "title_page": "Diverse portfolio helps Land O'Lakes carve out record profit in lean times", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The farm economy has been struggling for the past several years, but Land O’Lakes Inc. — with its dairy foods, animal feed and crop supply businesses — has been forging ahead successfully.\nThe Arden Hills-based cooperative reported record net earnings of $364 million on $13.7 billion in sales in 2017, up 14 percent from 2016 and the company’s fourth consecutive year of growth.\nPresident and CEO Chris Policinski said the company’s strategy is to add value to products in ways that help both farmer and co-op members and meet changing expectations from consumers in the marketplace. That may mean spreadable butter and premium cheese in food, and specialized animal feed and new plant growth products on the farm.\n“Our strategy is a little bit different than a lot of other co-ops that tend to be production-oriented,” said Policinski in an interview. “We try to be an insight-to-innovation co-op, driving new services and products into the marketplace that customers want.”\nPolicinski said that focus is paramount for Land O’Lakes’ three main business segments: Dairy Foods, known for its butter, cheese and other products; Purina Animal Nutrition and its animal feed operations; and WinField United, the company’s seed, crop protection and farm services division.\nMichael Boland, University of Minnesota agricultural economics professor, said that trio of different businesses helps Land O’Lakes remain resilient during the economic ups and downs of farming, including the sluggish ag economy of the past few years.\n“Anybody working in ag today is facing headwinds, but I think the diversification of businesses in their portfolio has really helped Land O’Lakes,” he said. “There’s a lot of emphasis on cost control, cost efficiency and what they can do to find synergies across those three business units.”\nThe cooperative is owned by 1,959 dairy producers, 886 ag producers and 751 co-op members. In addition, 367 independent retailers joined Land O’Lakes through its merger last year with United Suppliers.\nCash returned to members in 2017 totaled $149 million, or $215 million when combined with United Suppliers’ cash payments, the ninth consecutive year returns have exceeded $100 million.\nBill Densmore, a senior director and analyst at Fitch Ratings, said that Land O’Lakes exceeded expectations slightly in 2017, and he has no concerns about the company’s performance.\n“Dairy was maybe a little flatter than we initially thought, but crop inputs and particularly animal feed had a strong year,” Densmore said. “Overall on a consolidated basis and especially given the current market conditions, they’re doing relatively well.”\nThe company’s dairy foods division reported earnings of $71 million in 2017, up from $70 million in 2016. Its branded butter did well, but margins in its global dairy ingredients business were lower due to a challenging operating environment for global milk powders and other factors, the company said.\nPolicinski said there’s a lot of financial stress in the dairy industry, which made it more important than ever for the company to manage its food business very carefully.\n“We’ve had to hedge our risk and produce certain things at certain times so we’re not left with inventories that devalue,” he said. The company acquired Vermont Creamery in 2017, adding specialty, artisanal and premium style dairy products to its food offerings.\nThe company’s animal nutrition business reported earnings of $91.6 million in 2017, compared to about $73 million in 2016. Densmore said Land O’Lakes did better than a number of its competitors that have reported less robust growth as producers, especially dairy farmers, looked for ways to reduce feed costs in a declining economy.\n“In those situations, maybe farmers don’t buy as much of certain kinds of pre-mix or feed,” he said. “Land O’Lakes doesn’t appear to have had as much exposure to that as what we’ve seen with other companies.”\nThe company’s crop inputs business reported earnings of $230 million, up from about $203 million in 2016. The success was driven by higher volumes of crop production products as well as higher seed volumes, the company said. It also completed a two-year merger — the largest in company history — with United Suppliers Inc. an Iowa-based seed and crop services firm. The resulting business, WinField United, had sales of $5.7 billion in 2017, making it the largest Land O’Lakes division.\nPolicinski said all three of Land O’Lakes’ main businesses face stiff competition, especially its crop products and services segment, because of mergers between other large companies.\n“We have DowDuPont, Bayer-Monsanto and Syngenta China Corp.,” he said. “They’re all coming together and they’re all big competitors.”\nLand O’Lakes also continued to build its commercial portfolio internationally in Mexico, Canada and Africa, the company reported, and continued investing in Sustain, a business unit that offers conservation planning tools and other services to help dairy farmers improve air, soil and water in their operations.\nBoland said that Land O’Lakes will need to stay at the top of its game to compete successfully with large players in the industry, and to cope with the farm economy if prices remain low as expected this year and farm profits continue to be squeezed.\nOne of the company’s strengths is its ownership structure of farmer and co-op members, Boland said.\n“They know there are cycles in agriculture, they know that net farm incomes go up and down, and they know we have credit cycles,” he said. ”So the ownership structure tends to think long-term as opposed to short-term.”\nTom Meersman • 612-673-7388", "url": "https://apnews.com/fae0a978c227488096c4bf3d9f22186c"}