{"authors": ["Susan Kang", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Matt Stone", "Jeremy Gong", "Michael Kinnucan", "Tom Malleson", "Lee Carter"], "date_download": "2020-05-04 19:52:10", "date_modify": "2020-05-04 19:52:10", "date_publish": "2018-07-04 00:00:00", "description": null, "filename": "2018_07_alexandria-ocasio-cortez-joe-crowley-democratic-machine_1588621930.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/07/04154334/GettyImages-984863336.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_07_alexandria-ocasio-cortez-joe-crowley-democratic-machine_1588621930.html", "title": "How Ocasio-Cortez Beat the Machine", "title_page": "How Ocasio-Cortez Beat the Machine", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "I first met Alexandria Ocasio-Cortez in August 2017, at a picnic for the Queens branch of the New York City Democratic Socialists of America (DSA). It was a hot, muggy day. I was with my children, and Alexandria came to meet with us without pushing any kind of agenda. She was stylish and charming, and everyone was extremely impressed. Her political vision spoke to the values and political goals of DSA.\nBut for a (then-) twenty-seven-year-old unknown to run for Congress in our district, NY-14, seemed like an impossibility. Alexandria would sometimes come to our branch meetings and speak about her campaign, but as NYC-DSA was focused on city council races in Brooklyn that fall we didn’t take the idea of supporting a long-shot candidate like herself seriously — taking on the “Queens Machine” seemed like a masochistic task at best. The Queens DSA branch had not yet run its own electoral operation, so taking on a multi-borough district of a half million people, with the highest levels of linguistic diversity, seemed overly ambitious. Some DSA members were reluctant to support an endorsement, despite liking Alexandria, for fear that her loss might hurt the organization’s reputation. But through our internal democratic processes, NYC-DSA endorsed Ocasio-Cortez on April 22, 2018, following a spirited debate at our Citywide Leadership Committee meeting.\nHer opponent, Congressman Joe Crowley, was a high-ranking Democrat rumored to be next in line for speaker of the house. More importantly, Crowley seemed to wield superhuman power locally as the King of Queens. Standing 6’5” tall, bald, fifty-three years old, and probably the last of the old Irish ruling class of Queens, Crowley was called a “modern day Boss Tweed,” with a vast war chest and control of the Queens Democratic machine. As the chair, he makes judicial appointments and decides how to fill vacancies in special elections (in New York State, about one-third of all state legislature seats are handpicked in this way). Almost all Democratic seats in a highly Democratic county were decided with Crowley’s blessing (Queens county has about 2.4 million people, with a eight-to-one ratio of Democrats to Republicans, which means that the primary is the most contested race in almost all Queens elections). While some individuals might win against the machine, eventually they get incorporated — generally falling in lockstep with Crowley and the county committee. In addition to controlling Queens politics, Crowley brings his influence to bear on appointments like the powerful New York City Council chair: instituting a pro-real estate council speaker in 2017, and using the position to enrich his political allies.\nThe key reason why Crowley and the machine were seen to be unbeatable is the impressive Democratic club infrastructure and his relationships (often economic) to other power brokers. There are a series of Democratic clubs that make up the true believers and committed activists within the Democratic Party. Some of these activists may want to become politicians themselves, and they do their time — volunteering from high school age, serving as elected but unpaid “district leaders,” and demonstrating their loyalty to Crowley and the machine. Failure to do this can lead to swift punishment for any possible slights and perceived disloyalties.\nFurthermore, Crowley relies on his relationships with other elected officials and leadership within local unions for endorsements and resources to help canvass and get out the vote. (As a member of a faculty and staff union, I was really displeased to see my statewide union affiliate send out an expensive mailer to my home the day before the election, stating “more than ever, we need Congressman Joseph Crowley,” with no mention of his policies.) Crowley has also used his access to power and resources to benefit his partners and family members. In other words, despite our current political climate, Crowley’s incumbency advantage seemed insurmountable.\nA good illustration of the reach of the machine can be seen in my interaction with “Inez,” a forty-something Latinx community leader. On Saturday, June 23, I met up with Inez and a group of women in Elmhurst — the working-class, Latinx and Asian neighborhood in northern Queens where the candidate’s office is located — and we had the privilege of doing a get-out-the-vote canvass with Alexandria. After Ocasio-Cortez left to catch a flight to Texas (to protest the separation of migrant children), Inez and I walked around the blocks knocking on doors of apartment buildings, with mostly strong positive responses from voters. Over tacos afterwards, Inez told me that she could not be public with her support for Ocasio-Cortez because she sat on the community board, and knew that even a social media post in support of the campaign would jeopardize her relationships with other elected officials, and thus hurt her ability to advocate for the progressive causes she cared about.\nYet despite this context, DSA volunteers grew cautiously optimistic about the possibility of an Ocasio-Cortez victory. Following our April 22 endorsement, our field captain began almost daily canvasses in which an average of six people went out (and sometimes as many as fifteen members came to volunteer). Other members who couldn’t travel to Queens held local phone bank parties. Phone banking and canvassing led to the identification of supportive neighbors. DSA helped to contribute to the canvassing efforts, and especially to the get-out-the-vote efforts, but we always worked in coalition with other movements — including Black Lives Matter, Muslims for Progress, local Resistance and Indivisible-type groups throughout Queens and the Bronx, existing educational justice organizations, and the Bernie infrastructure. And Ocasio-Cortez’s bold, socialist vision brought dozens of people to a cramped, often-overheated office on the second floor above a tacqueria in Elmhurst.\nOn June 15, NYC-DSA asked its members to turn out for a debate watch party/phone bank event to watch Ocasio-Cortez bring her unapologetic vision for economic and social justice against Congressman Crowley’s more measured stances. The volunteers, mostly young and very diverse, were thrilled to support her strong performance against Crowley. And the work of the coalition-based ground team must have been effective, as Ocasio-Cortez was polling thirty-six points behind Crowley just three weeks before the primary, but won by fifteen points in the end.\nThe election of Donald Trump has demonstrated that American politics is riven with unpredictable openings — and that applies to the Left as well. While Ocasio-Cortez’s impressive field operation was a testament to the value of a motivated volunteer force, perhaps the strongest asset was Alexandria herself. Ocasio-Cortez rarely attacked Crowley on a personal level, but the one theme that even my white, male, conservative Democratic neighbor told me really affected him was the idea that Crowley did not live in the district, breathe our air, drink our water, or send his kids to our schools.\nI can’t overstate the effect of her viral campaign video, created by DSA members in Detroit and volunteers (including the author’s children) that presented Ocasio-Cortez’s beautiful socialist vision to the world. But unlike other candidates’ slickly produced videos that stress their exceptional qualities, Ocasio-Cortez’s video presented her as a humble and passionate everywoman: sitting and chatting with ordinary New Yorkers, changing her shoes on a subway platform, and chatting in an apartment with a huge window air conditioning unit next to her chair.\nOcasio-Cortez was a compelling candidate with a socialist and humanist vision that positioned her to take down the Queens machine, and demonstrated that the power of the moderate, transactional political class was no match for the passion, energy, and strength of the broader democratic socialist movement. Ocasio-Cortez’s vision of “democratic participation in our economic dignity, and our economic, social, and racial dignity” spoke to the people of New York Congressional District 14, myself and my neighbors, in a way that made the impossible possible.", "url": "https://www.jacobinmag.com/2018/07/alexandria-ocasio-cortez-joe-crowley-democratic-machine"}