{"authors": ["Michelle Iracheta"], "date_download": "2020-05-04 20:31:51", "date_modify": "2020-05-04 20:31:51", "date_publish": "2018-09-23 05:00:00", "description": "Dr. Zachary Hodges has been employed with the Houston Community College System for 41 years and has deep roots in Katy and in education going as far back as the 1970s when he and his wife fell in...", "filename": "_eee450fe5d784f1c99d5f16163df381c_1588624311.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eee450fe5d784f1c99d5f16163df381c_1588624311.html", "title": "Dr. Zachary Hodges, Houston Community College Northwest president", "title_page": "Dr. Zachary Hodges, Houston Community College Northwest president", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dr. Zachary Hodges has been employed with the Houston Community College System for 41 years and has deep roots in Katy and in education going as far back as the 1970s when he and his wife fell in love with the community.\nHe currently serves as the president of the Northwest College, which is comprised of the Spring Branch, Alief, Katy and West Houston campuses. He began his career as a counselor in 1976 and moved up through the ranks of HCC.\nWhat attracted you to Katy? What made you feel so comfortable here?\nThe people. We liked the idea of being on the west side. Katy has always been good to me. I think I’ve been really good to Katy, so my wife and I were actively engaged in the Katy community, in the schools and with our daughters in school, so Katy was just home. Those were our roots. We lived, first of all, in the Williamsburg settlement, then we moved to Nottingham country and we lived in Nottingham country until we lived closer into Houston.\nWhat made you want to be an educator?\nI’m a marriage and family therapist licensed professional counselor and I was hired at Houston Community College. I don’t know maybe it’s divine intervention. I ended up going to visit Katy and trying to start courses there with Katy and again I don’t know why you’re attracted to a community. Ii mean i didn’t change my my goals. I worked my way up within Houston Community College Houston community colleges served Katy since 1979 and I’ve had a lot of opportunities to leave but I’ve never had a really good reason to leave because it was home. West Houston and Katy is where I want to be, so it was more about community than it was about a job. What do they say, “you bloom where you’re planted,” and for whatever reason I was planted in Katy and so that’s where I’ve grown and I think Katy’s grown and it’s been a good match.\nDuring your time here as president, what have been some of the things that you are most proud of at the campus?\nI’m proud to say that our board has approved the concept of us moving the Katy campus over to be co-located with the University of Houston at Katy, so we will be close to them and we are offering their freshman and sophomore level courses. I’m excited about the prospects about students from the Katy community being able to get a complete four-year degree without leaving home. It will be a great partnership for Katy. I also started the dual-credit program in Katy, which started really back in 1979. This semester we’ll probably have 1,000 students enrolled in dual credit within Katy ISD. I’m proud of having served on Partners in Education Advisory Board for Katy ISD for 25 years and being involved and engaged in school districts. We’re also on the board of Katy Economic Development Council. We are actively engaged in all the major decision making as it relates to higher ed and in education, I’m real proud of always having had the opportunity to take a leadership role as far as kind of being the higher education expert in the Katy area.\nWhat are some of are you goals moving forward in HCC Northwest?\nWe have a Texas A&M Engineering Academy right here. We are talking with the Cullen College of Engineering at the University of Houston to begin offering engineering academy to Katy area resident similar to that where it will be the first two years of the community college and then finishing up with the University of Houston in engineering to continue to expand high education opportunities for the Katy area.\nIs there anything that has impressed you about the community you serve?\nWell you learn this later in life, but I don’t want somebody to say on my gravestone, “Here lies Zach Hodges. He was a good manager.” I would want it to say I made a difference. Meaningful work is important to me. I have the best job in the world because I get to engage with all kinds of people. I get to take lead on innovation with students. Higher education is changing fast and it’s around relevance and how do we create relevance in this age, where students attention span … they’re not reading as much as they used to. How do you give them hands-on experience? How to you change their educational experience to relevancy to the 21st century? All those kinds of issues I get to deal with and I get to be the visionary who says to the world, “Looks to me like this is where we’re going,” and then bring everyone else along with me, but it never looks the same. Another life lesson I’ve learned is, it’s a lot easier to do it together than it is alone. Hire great people and leave them alone.\nmichelle.iracheta@chron.com", "url": "https://apnews.com/eee450fe5d784f1c99d5f16163df381c"}