{"authors": ["Jay O'Neal", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Prianka Srinivasan", "Cathy Kunkel", "James Green", "Trish Kahle", "Micah Uetricht"], "date_download": "2020-05-04 19:53:33", "date_modify": "2020-05-04 19:53:33", "date_publish": "2018-03-01 00:00:00", "description": null, "filename": "2018_03_west-virginia-teachers-strike-activist-interview_1588622013.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/03/01151535/40284378442_31315e73b9_k.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_03_west-virginia-teachers-strike-activist-interview_1588622013.html", "title": "The Strike Is On", "title_page": "The Strike Is On", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "JO\nI was at the capitol yesterday morning and, to be honest, there was a sense of chaos. Nobody seemed to know what was going on. When I asked the union staffers, they just said, “I don’t know.”\nThe legislators were in session, but they complained that they couldn’t vote on anything since they had not been delivered any details from the governor. It was so chaotic that there were strong rumors that Governor Justice had resigned — he even had to respond to this on Twitter, to tell people that these were just rumors.\nFrom below, I can only really speak about the situation in my county, which is local to Charleston. We decided to have a meeting at 1 PM to try to straighten things out and to get some correct information. It was all super last minute, we had to plan it in a couple of hours. We met in a nearby church. The room was absolutely packed, with pews and aisles filled way past capacity.\nThe local county presidents of the three different unions — the two teachers’ unions and the staff union — wanted to get information out about the deal. But it got really heated, quick. I think teachers let out their frustration.\nThe general sentiment was: hey, the first time we found out about this supposed settlement was on TV, we wish we would have been told first. When one of the union staff said, “We want to be democratic,” someone shouted out, “You weren’t democratic Tuesday night!”\nHonestly, I was worried that the meeting might spiral out of control. But then a teacher from the floor spoke up and said: “We want to vote, we want to decide when to go back in.” This really expressed where people are at. In my county at least, the sentiment is that we’re not going back to work until there’s solid proof that our demands are going to be met. Our biggest fear is that they’re just going to keep pushing back the question of PEIA.\nAfter the meeting, we building reps met. It was agreed that we were willing to stick it out. But we needed to hear from everyone else. My county is the biggest, and we had to find a way to allow all school employees to vote on this in a matter of hours. Every school is different, but at my school I used our phone tree and texted or called everyone to see where they stood.\nOverall, the big majority wanted to stay out. I reported back to our county union reps, who reported back to the superintendent. The votes must have gone the same way at the other schools, because the county superintendent cancelled classes for the next day.\nEarlier in the strike, when there was more direction from the union statewide, we found out more or less at the same time whether other counties were going out the next day. But last night it was very slow moving. It was nerve wracking.\nThis time we had to wait to hear back, county by county. Each county had to vote first, then report to their superintendent. Eventually, late in the evening, we found out that all fifty-five counties had decided to stay out on strike. It was really something, because we know we need unity to win.\nAlso, I really want to give a lot of credit to the service personnel in the schools. This is a big difference from the 1990 strike: this time all school employees are on board. This makes a huge difference, because the buses aren’t running. And without these, students can’t get to school.\nBus drivers are a real linchpin of the strike. So are the cooks. We live in a high-poverty state, and a lot of our students really depend on the free lunches provided at school. So with all the personnel on board, we’re a lot stronger.", "url": "https://www.jacobinmag.com/2018/03/west-virginia-teachers-strike-activist-interview"}