{"authors": ["Joe Rutter"], "date_download": "2020-05-04 20:16:30", "date_modify": "2020-05-04 20:16:30", "date_publish": "2018-01-13 01:44:54", "description": "With the Steelers preparing to face the Jacksonville Jaguars on Sunday in an AFC divisional round playoff game, the Tribune-Review is taking a look back this week at some of the most memorable...", "filename": "_a11fa441654e4f07b06e574be73de9cb_1588623390.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a11fa441654e4f07b06e574be73de9cb_1588623390.html", "title": "3 memorable individual performances in Steelers divisional-round games", "title_page": "3 memorable individual performances in Steelers divisional-round games", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With the Steelers preparing to face the Jacksonville Jaguars on Sunday in an AFC divisional round playoff game, the Tribune-Review is taking a look back this week at some of the most memorable plays, teams and games.\nToday: Three singular achievements in a divisional game (in reverse chronological order).\nJan. 15, 2017: Steelers 18, Chiefs 16\nChris Boswell accounts for all of the scoring by kicking a playoff-record six field goals, and the Steelers hold off the Chiefs to get to the conference championship game for the first time since the 2010 season.\nIn order, Boswell’s field goals are made from distances of 22, 38, 36, 45, 43 and 43 yards. The sixth one, with 9:49 left, gives the Steelers an 18-10 lead.\nIt’s the second time in a month that Boswell is 6 for 6 in a game, the other being in the regular season at Cincinnati.\nDec. 19, 1976: Steelers 40, Colts 14\nTerry Bradshaw compiles a perfect passer rating.\nThis game is best remembered for injuries to 1,000-yard rushers Franco Harris and Rocky Bleier that kept them from playing in the AFC championship game the following week in Oakland. The Steelers lost, 24-7, denying them a third consecutive trip to the Super Bowl.\nBradshaw, though, was magnificent against the Colts. He completed 14 of 18 passes for 264 yards and three touchdown and no interceptions. This amounted to a 158.3 passer rating, which was not a regularly used stat in those days.\nBradshaw opened the scoring with a 76-yard touchdown pass to Frank Lewis. Later, he threw a pair of touchdown passes to Lynn Swann (29 and 11 yards).\nDec. 27, 1975: Steelers 28, Colts 10\nAndy Russell’s 93-yard fumble return for a touchdown seals a win that sends the Steelers to the AFC championship game for the second year in a row.\nAfter starting the season 1-4, the Colts win their final nine games in a row and present a serious challenge to the Steelers in the divisional round. The Steelers’ chances of returning to the Super Bowl after winning it in 1974 take a hit when the Colts jump to a 10-7 lead in the third quarter.\nTouchdown runs by Rocky Bleier and Terry Bradshaw push the Steelers in front, 21-10, early in the fourth quarter. Bert Jones enters at quarterback for the Colts and leads a drive to the Steelers 3. Jack Ham sacks Jones, forcing a fumble. Russell grabs the ball on the bounce at the 7 and takes off upfield. Donnie Shell and Dwight White form a wall that protects Russell, who needs more than 12 seconds to make it to the end zone.\nThe return is the longest in NFL history.", "url": "https://apnews.com/a11fa441654e4f07b06e574be73de9cb"}