{"authors": ["Madison Guernsey Mguernsey Journalnet.Com"], "date_download": "2020-05-04 20:06:49", "date_modify": "2020-05-04 20:06:49", "date_publish": "2018-04-11 03:26:00", "description": "POCATELLO — When Tanner Conner was bring recruited to run track at Idaho State, he had bigger plans. During his official recruiting visit to ISU, he stopped by the football offices to...", "filename": "_5d97adb853ea4f5495ccd2042b9657e4_1588622809.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5d97adb853ea4f5495ccd2042b9657e4_1588622809.html", "title": "ISU football: Tanner Conner a budding multi-sport star in football and track", "title_page": "ISU football: Tanner Conner a budding multi-sport star in football and track", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "POCATELLO — When Tanner Conner was bring recruited to run track at Idaho State, he had bigger plans.\nDuring his official recruiting visit to ISU, he stopped by the football offices to introduce himself. After he left, coaches popped on his highlight reel.\n“We were like, ‘Holy smokes,’” Bengals football coach Rob Phenicie said after Monday’s spring practice.\nConner, originally a track prospect, was later offered a football scholarship and also committed to join the track team. Because his school expenses are covered by the football team, Conner is essentially a track walk-on and does not count against the program’s scholarship count.\nAnd after two years on each team, Conner is establishing himself as a force in both sports.\nHe starred for the track team during the recent winter indoor season, finishing first in the 60- and 55-meter hurdles at five of six meets and winning the long jump once. He set personal-best marks in both events and finished 11th in the 60-meter hurdles and 15th in the long jump at the Big Sky Conference championships.\nSo far this outdoor season — which he’s balancing with spring football practices — Conner won the 110-meter hurdles in his only try, at the UVU Collegiate Invitational on March 30. He plans to compete in meets at Utah State and BYU before the outdoor conference championships May 8-11 in Moscow.\nConner is excused from football activities on Fridays, when most meets occur. He also has Tuesdays and Thursdays open to practice with the track team and spends Mondays, Wednesdays and Saturdays at football.\n“His schedule’s amazing,” Phenicie said. “What he does, it blows me away. We’re trying to make it work best we can, so he can do both and give him every opportunity to compete in the hurdles.”\nWith football running from the start of fall camp in August through the final game in mid-November, followed by indoor track in the winter and the jam-packed spring season, Conner is competing close to year-round.\n“I had Thanksgiving break off, and that was about it,” Conner said Monday. “Came back and I started training again.”\nOn the football field, Conner got his first shot at action last season after redshirting as a freshman in 2016. Injuries to fellow wide receivers Mitch Gueller and Scooby Reynolds vaulted Conner into the lineup early in the season, including a starting nod in ISU’s upset win at Nevada. His best game was the season opener, when he had four receptions for 73 yards against Western Oregon.\nThis spring, Conner has again been elevated to the first-string offense as injuries have hampered players’ availabilities. But Phenicie says injuries or not, Conner is one of his top wideouts.\n“If we were to play a game, everybody was healthy right now, he would be starting opposite of Mitch,” Phenicie said. “So he’s got to be ready.”\nThe 6-foot-3, 180-pound Conner was a three-sport letter winner in high school, adding basketball to his repertoire. He was dominant in the 300-meter hurdles as a senior at Kentridge High School in Kent, Washington, winning the event in 13 of 14 races, including the state championships, when he notched a personal best. He also took second in the 110-meter hurdles and third in the long jump.\nIn football, Conner was a first-team all-conference pick at defensive back and a first-team selection at wide receiver.\n“I have passion for both sports,” Conner said, “and I couldn’t seem to let go of one or the other.”\nConner has elite athleticism in his genetics. His father, Andy Conner, was a linebacker at the University of Oregon from 1988-91 and spent brief stints with the NFL’s Seattle Seahawks and Los Angeles Rams before a shoulder injury derailed his career.\nTanner said he hopes to exceed his father’s achievements by reaching the NFL and qualifying for the Olympics.\nThe next Olympic Trials are in 2020, when Tanner will be entering his final season of college eligibility. By that time, Tanner says, he hopes to bring his 110-meter hurdle time down from his 14.81-second college time, down to his high school PR of 14.09, to the Olympic Trial qualifying mark of 13.52 seconds.\n“That’s the long-term goal,” Conner said. “This year, the goal is to get 14 and slowly work to that 13.52 mark. It’s something I definitely think is attainable, and I think I can do it with enough training.\n“A lot of people believe I can do it. … That’s kind of my thing is to break barriers, break the stereotype of a two-sport athlete. We’re kind of a dying breed. Really proving to people that it’s possible and that you can do both and be successful at both. That’s kind of what drives me.”", "url": "https://apnews.com/5d97adb853ea4f5495ccd2042b9657e4"}