{"authors": [], "date_download": "2020-05-04 20:05:08", "date_modify": "2020-05-04 20:05:08", "date_publish": "2018-03-19 15:58:00", "description": "High school athletes, coaches and teams in the central and eastern part of North Carolina will have a chance to be honored on the biggest of stages in June as the \"HighSchoolOT Honors\" takes over...", "filename": "_9155ee5f7a645824978ab767b0d1712a_1588622708.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9155ee5f7a645824978ab767b0d1712a_1588622708.html", "title": "'HighSchoolOT Honors' event to honor top athletes, coaches, teams in June", "title_page": "'HighSchoolOT Honors' event to honor top athletes, coaches, teams in June", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "High school athletes, coaches and teams in the central and eastern part of North Carolina will have a chance to be honored on the biggest of stages in June as the “HighSchoolOT Honors” takes over downtown Raleigh.\nHighSchoolOT.com, along with presenting sponsor Pella Windows & Doors, will host the “HighSchoolOT Honors” ceremony on Saturday, June 23, at the Duke Energy Center for the Performing Arts in Raleigh. The event, which will be hosted by WRAL Sports anchor Jeff Gravley and HighSchoolOT.com senior editor Nick Stevens, will name winners in dozens of categories, including male & female athletes of the year, male & female coaches of the year and team of the year.\nNominations for all categories are open from Mar. 19 until Apr. 15 and coaches, teachers, athletic directors and members of the public are invited to make nominations. Finalists will be announced on Apr. 23. Tickets will go on sale after finalists are announced. Finalists will receive complimentary tickets. Voting is open until May 13.\n“HighSchoolOT Honors” winners will be announced live at the event on June 23.\nCarolina Panthers linebacker Thomas Davis will serve as the keynote speaker at the event and answer questions from the hosts.\nHighSchoolOT.com will provide full coverage of the event before, during and after the winners are named. Follow along on social media with the hashtag #HSOTHonors and follow @HighSchoolOT on Twitter and Instagram.\nThe nomination period for the “HighSchoolOT Honors” is open now, so submit your nominations for each of the categories.\nA limited number of sponsorship opportunities remain for this event. See WRAL Digital Solutions for more information.", "url": "https://apnews.com/9155ee5f7a645824978ab767b0d1712a"}