{"authors": ["Journal Staff"], "date_download": "2020-05-04 20:16:47", "date_modify": "2020-05-04 20:16:47", "date_publish": "2018-10-31 02:04:00", "description": "Halloween will likely be snowy in East Idaho. The National Weather Service has issued special weather alerts calling for up to four inches of mountain snow in East Idaho and a rain-snow mix...", "filename": "_0f2a994bf24842c3b28c0728087450b0_1588623407.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0f2a994bf24842c3b28c0728087450b0_1588623407.html", "title": "SNOW IN FORECAST FOR HALLOWEEN IN EAST IDAHO", "title_page": "SNOW IN FORECAST FOR HALLOWEEN IN EAST IDAHO", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Halloween will likely be snowy in East Idaho.\nThe National Weather Service has issued special weather alerts calling for up to four inches of mountain snow in East Idaho and a rain-snow mix in the lower elevations such as Pocatello, Preston, Fort Hall, Blackfoot, Idaho Falls and Rexburg.\nThe snow is forecast to start falling on East Idaho’s mountains on Wednesday morning and to continue until Thursday morning.\nThe rain-snow mix in East Idaho’s lower elevations is not expected to start falling until Wednesday afternoon and will likely continue until Thursday morning. Snow accumulations are expected to be less than a half-inch in the lower elevations.\nThe public should expect difficult road conditions because of the precipitation, the weather service said.\nThe most snow will likely fall on East Idaho’s mountain passes, such as Targhee Pass on Highway 20, Pine Creek Pass on Highway 31, Emigration Pass on Highway 36, and on Highway 34 between Wayan and the Wyoming border, the weather service said.\nThe central Idaho mountains including the Ketchum and Stanley areas are also expecting snow — up to three inches — from the storm Wednesday morning through Thursday morning.\nStay with idahostatejournal.com for the latest weather forecast updates.", "url": "https://apnews.com/0f2a994bf24842c3b28c0728087450b0"}