{"authors": ["Brock Netter"], "date_download": "2020-05-04 20:09:23", "date_modify": "2020-05-04 20:09:23", "date_publish": "2018-10-12 00:52:00", "description": "MANTENO — Whether it's on the road or its own home floor, big games atmospheres don't affect Manteno at all. Those games with conference championships implications that can create some...", "filename": "_c96d54587bc748679349141f39e72cc8_1588622963.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c96d54587bc748679349141f39e72cc8_1588622963.html", "title": "VOLLEYBALL: Manteno takes down Herscher, remains unbeaten in I-8", "title_page": "VOLLEYBALL: Manteno takes down Herscher, remains unbeaten in I-8", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MANTENO — Whether it’s on the road or its own home floor, big games atmospheres don’t affect Manteno at all.\nThose games with conference championships implications that can create some nerves, but not with this experienced Panther team.\nAfter some early battles in both sets, Manteno did what it usually does and finished strong for a straight-set 25-19, 25-19 over Herscher on Thursday.\nThe victory leaves Manteno as the only team left in the Interstate Eight with only one tournament left standing between it and a sixth-straight I-8 title.\n“This game was super important,” senior outside hitter Alyse Crowe said. “We have been working hard all season and we knew this game wasn’t going to be easy. But it puts us one step closer to the title.”\nWho flinches first\nNaturally when a game of this magnitude rolls around, both teams are looking for the smallest opening to exploit and seize control.\nHerscher fed its powerhouse outside hitter Claudia Huston often and early while Manteno’s attack was more spread out among Crowe, Kaycie Wenzel, Brandi Woods and Reese Bachus.\nHuston notched six kills while the Manteno quartet had two kills apiece along with an ace each from Wenzel and Crowe to tie the game at 18.\n“Through the first 18 points, it looked like the heavyweight fight I thought it would be,” Herscher coach Joel Huizenga said. “We got tight down the stretch and they found an opening. Can’t do that against a good team like Manteno.”\nHowever, it wasn’t any over those players who had the biggest impact down the stretch.\nThat belonged to senior Sierra Cureton, who came on with a pair of kills alongside another Wenzel ace to give Manteno the first set win.\n“We executed well and passed the ball very well,” Manteno coach Cheryl Davis said. “We had some nice swings at the net, but then came a point where we couldn’t get a set close enough to actually attack the net. We focused primarily on doing that in the second set and taking care of the small stuff.”\nLather, rinse, repeat\nThe two titans locked horns in similar fashion in the second set. The same suspects were back at it for both teams.\nHuston powered a kill to bring the Tigers within a point, 11-10, but they couldn’t quite get over the hump from there.\nBachus and Wenzel registered back-to-back kills sandwiched between another Huston kills to push the lead to 17-11 before a pair of kills down the stretch from Crowe sealed the Tigers’ fate and a Panthers’ victory.\n“I just wanted to help out my team in any way I could,” Crowe said. “We kept our focus the whole game and give it our all.”\nStat book\nWenzel finished with 14 digs, six kills and three aces for the Panthers while Crowe added 10 digs and four kills.\nWoods added seven digs, four kills and four assists, Bachus logged five kills and three digs while Elena Gomez had four blocks and three digs.\nAmanda Crowley dished out 16 assists and Jackie Kasalko had 12 digs.\nFor Herscher, Huston finished with 10 digs and nine kills. Chloe Chavers dished out nine assists while Jordan Pierce added seven assists and five digs.\nOlivia Ruder had nine digs and Mady Rogers added five digs.\nUp next\nHerscher hits the road on Saturday to play in the Plainfield Central Fall Harvest tournament Friday and Saturday.\nManteno can officially clinch its sixth-straight I-8 title on Tuesday at Reed-Custer. But before that game comes, it participates in the Bradley Invitational on Saturday.\n“It means everything that my teammates and I have been able to remain consistent and successful through high school,” Crowe said. “With all the hard work and dedication we’ve put in over the years, anything less than a conference title would be a disappointment.”", "url": "https://apnews.com/c96d54587bc748679349141f39e72cc8"}