{"authors": ["William Whalen"], "date_download": "2020-05-04 20:28:21", "date_modify": "2020-05-04 20:28:21", "date_publish": "2018-04-12 06:50:06", "description": "Jonathan Simon School: Fox Chapel Class: Junior", "filename": "_1bc54278e48740a689971e8df3b9ba9a_1588624101.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1bc54278e48740a689971e8df3b9ba9a_1588624101.html", "title": "Fox Chapel's Jonathan Simon, Riverview's Carys Kenny-Howell", "title_page": "A-K Valley athletes of the week: Fox Chapel's Jonathan Simon, Riverview's Carys Kenny-Howell", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jonathan Simon\nSchool: Fox Chapel\nClass: Junior\nSport: Baseball\nReport card: Simon was the starting pitcher and helped lead Fox Chapel (1-1) to a 9-5 nonsection win against Shaler. The 6-foot-1 lefty struck out two and walked two through four innings. Simon also showed up at the plate, where he singled twice and drove in three runs in the Foxes’ win.\nWhen did you begin playing baseball?\nWhen I was 5 years old.\nWhat’s the difference between last year’s team and this year’s team?\nLast year’s team, we were a much younger team. Eight of my fellow classmates were sophomores on the team.\nWhat’s your best pitch?\nMy slider.\nHave you been clocked?\nI’m around 85-86 mph. That was last year.\nFox Chapel lost a lot of close games last year. Can the Foxes score more runs?\nI think that we’ll be able to push across a few more runs and get the wins.\nIs this team ready to turn the corner?\nI definitely think so, and I think we’ll definitely make the playoffs this year.\nWho is the most underrated player on the team?\nI would say our leadoff hitter Mitch Miles. We’ve played two games, and he’s led off with hits so far.\nWhat do you predict the Pittsburgh Pirates overall record will be this year?\nI think they’re gonna win 95 games. So, 95-67.\nDo you have the Pirates in the postseason?\nOh, yeah.\nWho is your favorite all-time Pittsburgh Pirates player?\nAndrew McCutchen.\nIIf you could have walk-up music on your way to the plate, what song would you use?\nThere’s some kid who yodels in a Walmart and I would say “the yodeling kid” remix.\nWhat actor should play you in a Hollywood movie?\nBradley Cooper.\nWhat’s your favorite subject at school?\nSpanish.\nWhat is something interesting about you that nobody knows?\nI volunteer at a summer camp for baseball every year. It’s at the high school.\nDo you have any plans for after high school?\nNo, not yet but I’ve been talking to a bunch of Division I schools. I’ve been talking to Davidson, George Washington and William & Mary.\nCarys Kenny-Howell\nSchool: Riverview\nClass: Senior\nSport: Softball\nReport card: After taking her junior year off, Kenny-Howell returned and delivered an 8-2 win over Section 3-A rival Jeannette last Friday. The 5-foot-11 pitcher struck out seven, walked two and knocked in two runs in the Raiders’ season debut. Kenny-Howell also is a captain on the Raiders girls golf team.\nWhen did you begin playing softball?\nI think I was 9. I started playing (with the) Riverview Athletic Association’s modified fast-pitch.\nAfter a cold and rainy start to spring, how nice was it to finally get a game in?\nIt was so nice. It felt so great to be outside again. There’s a lot of things that you can work on in the gym but nothing beats being outside.\nAfter taking a year off, how does it feel to be back?\nIt feels great. It’s really a unique experience playing school ball. It’s a different dynamic.\nHow far can this team go this season?\nI think we can go really far. I certainly have high hopes for playoffs and the postseason.\nWhere does Riverview need to improve the most?\nI think just getting a lot of reps is going to help.\nIt’s still early, but what’s the strength of this team?\nIt’s our hitting for sure. We have a really strong lineup the whole way through.\nWho is the most underrated player on the team?\nI think sophomore Annie Betler. She plays a little of first base, a little bit of outfield and catcher. She’s athletic and feisty.\nIf you could have walk-up music on your way to the plate, what song would you use?\n“Stronger” by Kanye West.\nWhat’s your favorite subject?\nI like math and science.\nWhat is something interesting about you that nobody knows?\nI volunteer at St. Margaret Hospital. I was also a volunteer at the Miracle League.\nWhat are your plans for after high school?\nNext year, I’m going to attend Simon Fraser University in Vancouver and major in biomedical physiology and also play softball while I’m there. They’re the only school in Canada that is in the NCAA.\nWhat area in the medical field are you looking into?\nI’m really interested in neurology and really interested in working with kids.\n—William Whalen", "url": "https://apnews.com/1bc54278e48740a689971e8df3b9ba9a"}