{"authors": ["Joseph Sabino Mistick"], "date_download": "2020-05-04 20:12:25", "date_modify": "2020-05-04 20:12:25", "date_publish": "2018-08-27 05:06:45", "description": "It has been a week so filled with entertainment news out of the White House that it is easy to forget that there are real problems out there in the world. Omarosa Manigault Newman, now a...", "filename": "_4ce6d68a4f12498694ca4d994496668b_1588623145.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4ce6d68a4f12498694ca4d994496668b_1588623145.html", "title": "Joseph Sabino Mistick: The Trump soap opera provides daily entertainment", "title_page": "Joseph Sabino Mistick: The Trump soap opera provides daily entertainment", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It has been a week so filled with entertainment news out of the White House that it is easy to forget that there are real problems out there in the world.\nOmarosa Manigault Newman, now a one-name celebrity simply called Omarosa, often shared the set of “The Apprentice” with Donald Trump and followed him into the White House. After the move, neither broke character.\nTrump remained the impresario and Omarosa was the ardent acolyte. But Trump taught her well. After she was fired, the world learned that she had secretly recorded Trump and his family and staff.\nSince then, she has played her audience deftly, foreshadowing each morsel that bursts into the media. It is a saga of betrayal, dishonor, deceit and idolatry gone wrong. It is also delicious schtick.\nThere are other enticing subplots still in play, including Michael Avenatti, Stormy Daniels’ lawyer, who baits Trump daily, often prompting less-than-presidential tweets that always evoke a chuckle.\nAnd rambling back and forth across the stage is Rudy Giuliani, either Trump’s court jester or a calculated distraction, who acts like the late “Professor” Irwin Corey, a bumbling comic who billed himself as “The World’s Foremost Authority.”\nGiuliani often asserts a strong defense of Trump and then presents a couple of equally strong counter- arguments that he claims could prove him wrong. It is both baffling and entertaining.\nDuring the Great Depression, many Americans found refuge from the bad news of the times at the movies. Theaters were packed with folks who lost themselves for a couple of hours in the fantasy of posh sets and glamorous characters.\nThen, it was OK to indulge in distractions, because you knew that the serious business of American society was being addressed, even while you were in that darkened theater. Not so today.\nNow, the movie set is the White House and soap opera is the reality of American political life. And Americans are faced with problems for which entertainment is no tonic.\nIn June, after a public outcry over a Trump administration decision to separate refugee parents from their children at the border, a federal judge ordered that the families be reunited immediately. Hundreds remain apart; some will never be reunited.\nTrump says, “Tariffs are the greatest.” But his economic war is already hurting farmers and manufacturers. Senate Republicans have proposed limits on the president, but the Republican House has balked.\nThe Trump tax cut has been a flop for average workers, but a boon for the super rich and corporations, as they use their windfall for stock buy-backs instead of increased wages for their workers.\nTrump constantly attacks Obama­Care, which still provides vital health care for millions of Americans. Last week, he again blamed Sen. John McCain for voting no on the Trump plan to replace ObamaCare with nothing.\nRussia continues to probe our free election system, prompting every intelligence official in the Trump administration to publicly declare that we are under cyber attack. But Trump is not so sure.\nAnd our unaddressed and crumbling roads, bridges, water systems and airports will guarantee third-world status for our children’s generation.\nMeanwhile, we get tweets and entertainment from the White House.", "url": "https://apnews.com/4ce6d68a4f12498694ca4d994496668b"}