{"authors": ["Bryan Clark Bclark Postregister.Com"], "date_download": "2020-05-04 20:07:26", "date_modify": "2020-05-04 20:07:26", "date_publish": "2018-04-05 18:02:00", "description": "A federal lawsuit filed Friday alleges a local retired obstetrician-gynecologist used his own genetic material to impregnate a patient who received fertility treatment in 1980, a fact only...", "filename": "_0218c1eb9ebe4bb8acc6bd3dc4d96f1a_1588622846.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0218c1eb9ebe4bb8acc6bd3dc4d96f1a_1588622846.html", "title": "Suit alleges misconduct by OB-GYN", "title_page": "Suit alleges misconduct by OB-GYN", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A federal lawsuit filed Friday alleges a local retired obstetrician-gynecologist used his own genetic material to impregnate a patient who received fertility treatment in 1980, a fact only discovered last year when her daughter sought genetic testing.\nThe suit has been brought against Dr. Gerald Mortimer, an OB-GYN who was first licensed less than three years before the alleged incident, according to Idaho State Board of Medicine records.\nRepeated efforts Wednesday to reach Mortimer for comment were unsuccessful.\nNews of the lawsuit was first reported Friday by the website courthousenews.com and the story was picked up by news organizations around the world starting Monday.\nThe suit alleges that Sally Ashby and her then-husband Howard Fowler sought help with trouble conceiving in 1979, when Fowler was employed at the Naval Reactors Facility. According to the suit, Mortimer recommended a procedure where Fowler’s genetic material would be mixed with a donor’s, and the mixture would be used to cause pregnancy.\nThe couple specified that the donor would be a man resembling Fowler: a college student with brown hair, blue eyes and more than 6 feet tall. The suit alleges they paid for access to a donor bank to obtain such a sample.\nBut the complaint alleges that Mortimer instead used his own genetic material, and when their daughter, Kelli Rowlette (née Fowler), was conceived, she was Mortimer’s biological offspring. Rowlette discovered that fact in July, when she received genetic testing results from Ancestry.com indicating that she was Mortimer’s child. Rowlette was unaware her parents had sought a sperm donor, or that Mortimer had been her mother’s OB-GYN.\nRowlette relayed the results to her mother, complaining that the Ancestry.com results appeared unreliable. But when her mother and father became aware of the results, they were “devastated,” according to the suit.\n“Ms. Ashby and Mr. Fowler struggled to cope with their own anguish, and had difficulty contemplating the torment the discovery would cause their daughter if she found out (Mortimer was her biological father),” the complaint states.\nThe suit states that Rowlette finally looked at a copy of her birth certificate, which Mortimer had signed, and called her parents in a panic.\n“Since discovering Dr. Mortimer’s actions, Ms. Ashby, Mr. Fowler and Mrs. Rowlette have been suffering immeasurably,” the complaint states.\nThe suit alleges medical negligence, failure to obtain informed consent, fraud, battery, intentional infliction of emotional distress, negligent infliction of emotional distress, breach of contract and violations of the Idaho Consumer Protection Act. They are seeking as-yet undetermined damages in excess of $75,000 — the minimum amount to pursue such a case in federal court.\nThe suit also alleges negligent supervision by Obstetrics and Gynecology Associates of Idaho Falls, where Mortimer formerly worked. The firm’s lawyer issued a statement Tuesday emphasizing that none of the current staff were with the company during the period in question.\n“None of the health care providers currently at Obstetrics and Gynecology Associates of Idaho Falls were part of the practice in 1979 to 1980 and they diligently strive to provide care to their patients that is in compliance with the standards of health care practice,” said Michael Wheiler, the clinic’s attorney.\nIn an interview, Wheiler added that Mortimer hadn’t worked at the clinic in more than a decade.\nIf Mortimer did use his sperm to impregnate a patient, he wouldn’t be the first doctor to have done so. There have been reports of similar actions throughout the U.S. and abroad. An Indiana fertility doctor was reported to have used his own sperm to “impregnate as many as dozens of women,” the Chicago Tribune reported in December.\nMortimer has held many prominent positions within the local community. He served six years on Bonneville Joint School District 93’s school board in the late-1990s, according to past reporting, including serving as its chairman.\nAccording to news releases and reports from The Church of Jesus Christ of Latter-day Saints, Mortimer served as a mission president of San Pablo, a city in the Philippines, in 2005. He was made president of the temple in Cebu, another city in the Philippines, from 2009 to 2012.", "url": "https://apnews.com/0218c1eb9ebe4bb8acc6bd3dc4d96f1a"}