{"authors": ["Kaylee Remington", "Yadi Rodriguez - Cleveland.Com"], "date_download": "2020-05-04 20:03:49", "date_modify": "2020-05-04 20:03:49", "date_publish": "2018-04-24 20:31:02", "description": "Gunselman's Tavern a local hot spot with a flair for burgers (photos, video, poll) FAIRVIEW PARK, Ohio -- What was once a speakeasy is now a favorite local hang out among Clevelanders...", "filename": "_7398f0da862944d485a50d5a3de62dbf_1588622629.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7398f0da862944d485a50d5a3de62dbf_1588622629.html", "title": "Gunselman's Tavern a local hot spot with a flair for burgers (photos, video, poll)", "title_page": "Gunselman's Tavern a local hot spot with a flair for burgers (photos, video, poll)", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Gunselman’s Tavern a local hot spot with a flair for burgers (photos, video, poll)\nFAIRVIEW PARK, Ohio -- What was once a speakeasy is now a favorite local hang out among Clevelanders throughout the area.\nGunselman’s Tavern is home to a variety of drinks patrons can come in and enjoy, but they can also indulge in some of the bar’s specialty burgers.\nCleveland’s Best reporters Kaylee Remington and Yadi Rodriguez along with comedian Mike Polk visited Gunselman’s Tavern Monday. The tavern is a Top 20 contender in Cleveland’s Best Burger contest.\nThe winner is going to be decided by you, the readers. You can vote in the poll found at the bottom of this post until 9 a.m. May 15.\nGunselman’s Tavern\nLocation: 21490 Lorain Road, Fairview Park, OH 44126\nPhone: (440) 331-5719\nWebsite: www.gunselmans.com\nSocial media links: https://www.facebook.com/gunselmans, Twitter: @GunselmansTav, Instagram: @gunselmanstavern\nAt each of the Top 20 finalist restaurants we all sampled five beef burgers: A plain burger, a burger chosen by the restaurant, two burgers chosen by Cleveland’s Best reporters Kaylee Remington and Yadi Rodriguez and a burger selected by Cleveland’s Best celebrity host, comedian Mike Polk.\nPLAIN BEEF BURGER\nMike Polk says: Solid, good texture and good seasoning.\nKaylee Remington says: Nice smoky flavor. Juicy burger.\nYadi Rodriguez says: Tasty, a burger that you can eat plain without any toppings and still tastes great.\nCleveland’s Best manager Kristen Davis says: Thick, has grill taste, meat is well packed.\nRESTAURANT’S CHOICE\nMushroom Swiss – Sautéed mushrooms and grilled onions with swiss cheese.\nPolk says: Perfectly cooked.\nRemington says: Not a huge fan of mushrooms but the burger was good. Thick burger.\nRodriguez says: Really good texture, mushrooms cooked just right, cheese melted perfectly.\nDavis says: Meaty, big burgers, mild cheese and mushrooms. The burger shines.\nREMINGTON’S CHOICE\nBuffalo style – Gunselman’s house buffalo sauce, blue cheese slaw, diced tomato\nPolk says: Nice contrast with tomato’s.\nRemington says: The buffalo sauce and blue cheese combined was delicious. I love buffalo sauce so I enjoyed it on the burger.\nRodriguez says: Good combination of tomatoes and blue cheese. The tomato really helps take the bite from the buffalo sauce.\nDavis says: Tomato adds a nice touch. Spice lingers and medium heat.\nRODRIGUEZ’S CHOICE\nHickory bacon BBQ – Gunselman’s BBQ sauce, hickory bacon, cheddar, onion straws.\nPolk says: Great bacon, sauce was great.\nRemington says: Bacon was crispy and thick, BBQ sauce was sweet and complimented the burger well.\nRodriguez says: Loved the bacon, thick and just the right amount. The BBQ sauce was just the right amount.\nDavis says: Sweet sauce, nice bite to it. Thick bacon.\nPOLK’S CHOICE\nBlack & Blue – Cajun dry rub, blue cheese butter, onion straws and A1 sauce (housemade)\nPolk says: Amazing! Life-changing, perfect. Sauce was great.\nRemington says: A1 sauce was amazing! Love that it’s homemade.\nRodriguez says: The crunchy onion straws added a great texture, Nice thick burger.\nDavis says: Mellow cheese, Cajun flavor is lacking.\nMore about Gunselman’s Tavern:\nOwner: John Caine, David Grace and Joe McDonough\nWhen did it open: December 11, 1936. John, David and Joe took over in Sept. of 2014.\nHow many different beef burgers are on the menu: Nine\nBun options: Brioche buns.\nBest seller: Just Plain Jane – A hand-packed burger from the Westside market.\nMost unique beef burger: Black & Blue – Cajun dry rub, blue cheese butter, onion straws and A1 sauce (housemade)\nPrices: burgers start at $9\nSpecials: Every Monday you can get the Plain Jane and a pint for $7\nHere are the important details on the final poll: Voting is open until 9 a.m. May 15. The big winner will be revealed later that day in a surprise Facebook Live video.\nWe invite you to vote hourly. The restaurants are listed in alphabetical order in the poll. Please make sure you scroll all the way down to see all the finalists. Also, you need to scroll all the way down and click the “Submit” button in order for your vote to be counted.\nNote: If you’re viewing this on cleveland.com’s mobile app, you need to click here to see the poll and to vote.", "url": "https://apnews.com/7398f0da862944d485a50d5a3de62dbf"}