{"authors": ["Tom Rosshirt"], "date_download": "2020-05-04 20:12:56", "date_modify": "2020-05-04 20:12:56", "date_publish": "2018-04-20 00:00:00", "description": "My brother Matt died of AIDS 26 years ago, passing away in his bed in my parents’ home in Houston. It was a benighted time for people with AIDS. There were no antiretrovirals then. There was...", "filename": "_f3ead4280de2441c94eb98497623dbbe_1588623176.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f3ead4280de2441c94eb98497623dbbe_1588623176.html", "title": "Barbara Bush’s Wise Compassion", "title_page": "Barbara Bush’s Wise Compassion", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "My brother Matt died of AIDS 26 years ago, passing away in his bed in my parents’ home in Houston.\nIt was a benighted time for people with AIDS. There were no antiretrovirals then. There was nothing much you could do for an AIDS patient but hold his hand. And many people still thought you could get AIDS by touching. My parents knew of individuals who’d been fired from their jobs for volunteering for AIDS organizations. That’s how crazy the fear was.\nAs Matt was dying, we were befriended by a man named Lou Tesconi, a volunteer from the local AIDS organization. Lou came by to visit with Matt and to offer whatever service and kindness he could to my mom and dad.\nShortly after Matt died, Lou began studies to become a Catholic priest. Within the year, he was diagnosed with AIDS and kicked out of the seminary. Lou was a lawyer by training and temperament. He appealed to a Catholic bishop, who then asked Lou to found and head a ministry for people with AIDS. It was called Damien Ministries and was established in a poor part of Washington, D.C.\nIn early 1989, when the country was still very ignorant and fearful of AIDS, Lou got a call from the White House. First lady Barbara Bush was planning to visit Grandma’s House, a home for infants with AIDS. It was one of the very first outings in her tenure as first lady, and Lou was asked to join a team of people to brief her privately before the event.\nDuring the briefing, Lou told me later, he said: “Mrs. Bush, it is a fantastic thing that you are holding these babies with AIDS. But the country sees them as innocent and the rest of us with AIDS as guilty. The whole suffering AIDS community needs a collective embrace from you today.”\nLou thought he was speaking metaphorically. Apparently, Mrs. Bush doesn’t do metaphor. She stood up, walked over to Lou and gave him a big hug.\nAfter the briefing, Mrs. Bush took a tour of the facility as she talked to the press. She hugged, kissed and played with three little girls and then nailed the message: “You can hug and pick up babies and people who have ... HIV. ... There is a need for compassion.”\nAt the news conference afterward, Lou stood by his point on Mrs. Bush’s visit: “I’m afraid that it may send a message that babies are innocent and can be helped,” he said, “but that the rest of us aren’t.” He added: “I told her it would certainly help to get a collective hug from the first lady.”\nThen, this time in front of the cameras, Mrs. Bush wrapped Lou up in a big embrace.\nMrs. Bush wrote of this visit in her memoirs. She noted that “even then, people still thought that touching a person with the virus was dangerous.” But she didn’t give herself any credit for dealing a blow against stigma by embracing a gay man with AIDS in 1989.\nLou had a buzz from that hug that never went away.\nIn the fall of 1991, near Thanksgiving, I got a call from a friend that Lou had gone into the hospital again. He didn’t have to tell me that it was for the last time. I called the White House and asked whether I could speak to the first lady’s office. I was a nobody press secretary on the Hill. I didn’t expect anyone in the White House to talk to me. Suddenly, I was speaking with the first lady’s press secretary, Anna Perez, who had accompanied Mrs. Bush to Grandma’s House that day. I began to recount the events of two years before, and she saved me the time: “I remember Mr. Tesconi,” she said. I explained Lou’s condition and said, “It would be so comforting for him to receive a letter from Mrs. Bush.”\nA few days later, I went to see Lou in the hospital. As soon as he saw me, he reached beside his bed with a slow and shaky hand and pulled out a letter: “Look what I got,” he said.\nThe letter was unflinching and full of love. She didn’t duck the issue that Lou was dying. She used it as a pivot to say, “Well done.” At the bottom, in her own hand, she wrote to Lou that his life mattered, that he had made an impact.\nThat was a long time ago. But some things you don’t forget — and shouldn’t. In a time of ignorance, her wise touch eased the sting of exclusion for my friend and many others.\nThank you, Mrs. Bush.", "url": "https://apnews.com/f3ead4280de2441c94eb98497623dbbe"}