{"authors": ["Ken Thomas Kthomas Wiscnews.Com"], "date_download": "2020-05-04 20:06:16", "date_modify": "2020-05-04 20:06:16", "date_publish": "2018-03-19 22:30:00", "description": "Not many Beaver Dam residents recall a feature that made the city’s downtown an economic powerhouse, but bits and pieces of it still remain. It was known as the “frying pan,” and it...", "filename": "_ecd6971d57b8433fb6a7744fe352a4fa_1588622776.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ecd6971d57b8433fb6a7744fe352a4fa_1588622776.html", "title": "River walls a relic of city's industrial past", "title_page": "Out of the frying pan: River walls a relic of city's industrial past", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Not many Beaver Dam residents recall a feature that made the city’s downtown an economic powerhouse, but bits and pieces of it still remain.\nIt was known as the “frying pan,” and it connected the center of the city to destinations across the United States and around the world. Part of that structure — the Beaver Dam River retaining walls — is now under siege. And even though demolition is likely, local historian Patrick Lutz is eager to share its colorful past.\n“The frying pan was put in place to serve the businesses that were originally established in the heart of the city,” Lutz said. “The Milwaukee Road railroad line came to Beaver Dam in 1856 and originally stopped at the edge of the city, just north of where University Avenue meets North Spring Street.”\nA branch line was constructed in 1882, and soon freight and passengers were brought to the Monarch Range plant (now Monarch Plaza and Rechek’s Food Pride) and to the downtown area.\n“Lincoln Avenue was originally called Railroad Street because it ran fairly parallel to the nearby railroad line,” Lutz said. “A limestone depot was built there, followed in 1901 by the current red brick building (now the Beaver Dam Chamber of Commerce). The line was extensively used for outings from Milwaukee, Chicago and beyond.”\nA trestle bridge was constructed to cross the Beaver Dam River and a loop of track was constructed on the river’s southwest side (now Gene’s Tires and the Kraft Foods parking lot). A freight depot served clients in that area (now Black Waters Coffee). Stumps of the trestle posts still remain along with battered sections of a concrete abutment (stamped 1900).\nBehind the dams at Mill and Davis streets, large mill ponds grew. The force of those water bodies powered industries such as Western Malleable Iron Co. (a portion of which is now Kirsch Foundry), Phenix Cheese (now Kraft Foods), Mayr’s Feed & Seed (now InterQuest), Rowel Manufacturing (now vacant) and other concerns.\nThe contour of the land was much different than it is today.\n“If you look at the back of the buildings on South Spring Street, their doors are much higher than the parking lot is now,” Lutz said. “That’s because the water came up to those walls. The height of the water fluctuated a lot.”\nAs electricity replaced water power, the city’s lower dams were removed.\n“They were taken out in the early 1900s,” Lutz said. “When electricity came into play, everybody switched over because it was so much more reliable than water power. There are certain times of the year when the water was low there and the factories couldn’t operate.”\nAlthough the Beaver Dam River continued to flow through a small channel, the low-lying basin was filled with garbage, sewage and just about anything else anyone wanted to dispose of. Citizens complained about the stench, but years passed before anything was done.\n“There was a lot of junk thrown in there and rumor had it that at one time a dead horse was pushed into it,” Lutz said.\nIn 1937, the city insured a supply of clean water by building a large water tower, which still remains. The structure was recently deemed to be in excellent condition, with replacement costing double the price of renovation.\nIn 1965, the river was restricted to a narrow channel and was run through a culvert under what was often called the Tower Parking Lot. That narrow channel led to dramatic consequences during severe flooding in 2008 and 2010. At that time, floodwaters reached 100-year levels, causing great concerns that the dam would fail and rushing water would destroy the entire downtown area. Following those floods, many buildings were found to be either structurally compromised or contaminated with mold. Eleven buildings, some of which were constructed over and against the river channel, were demolished with the help of state and federal grants.\nUnfortunately, Lutz believes that those floods also weakened the 1931 retaining walls. The city is currently requesting permission from the DNR to remove the walls between the water tower and Mill Street since they are now crumbling and leaning inward. Current plans are to replace those walls with banked rip rap (large crushed stones).\n“I wish they could keep those walls,” Lutz said. “I’m sure it would be a big task, but I’m sure there are ways it could be done if they really wanted to.\n“It’s a big part of the city’s history, and it’s sad to see them go.”", "url": "https://apnews.com/ecd6971d57b8433fb6a7744fe352a4fa"}