{"authors": ["Dan Boylan The Washington Times"], "date_download": "2020-05-04 20:05:56", "date_modify": "2020-05-04 20:05:56", "date_publish": "2018-04-17 20:01:49", "description": "Security officials in Russia and Iran, two of the world's tightest-controlled media markets, are scrambling to get control of the cloud-based messaging service Telegram, whose privacy and...", "filename": "_b9e8a75c820890ef313250457d87a74f_1588622756.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b9e8a75c820890ef313250457d87a74f_1588622756.html", "title": "Pavel Durov's Telegram messaging app bane of Russian, Iranian governments", "title_page": "Pavel Durov's Telegram messaging app bane of Russian, Iranian governments", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Security officials in Russia and Iran, two of the world’s tightest-controlled media markets, are scrambling to get control of the cloud-based messaging service Telegram, whose privacy and anti-hacking encryption features have made it the communications tool of choice in a growing number of repressive societies.\nTelegram’s Russian-born founder and CEO, Pavel Durov, sounded a defiant note Tuesday after a Russian court issued a ban on the service when it refused to turn over its encryption keys to the state. Russian intelligence officials have denounced Telegram as a favorite of “international terrorist organizations,” and Russian internet companies by mid-Tuesday had blocked some 17 million web addresses on servers owned by Google and Amazon in an effort to suppress the app.\nMr. Durov, often called the “Russian Mark Zuckerberg,” posted on his own Telegram channel Tuesday that he wasn’t backing down as the government’s communications watchdog moved to enforce the court order.\n“For us, this was an easy decision,” he wrote. “We promised our users 100 percent privacy and would rather cease to exist than violate this promise.”\nThe service has proved a technological headache for repressive regimes. Telegram’s 200 million users include huge numbers in China, where it is officially banned, and Iran, where a ban is set to go into place this month. Despite the clear hostility of the Kremlin and the Federal Security Service (FSB), Telegram has nearly 10 million users in Russia as well.\nIn Iran, where Telegram claims some 40 million users, the head of the Supreme Cyberspace Council warned this week that the app could be blocked “at any moment” and that a ban was being instituted on Iranian college campuses. President Hassan Rouhani has said the government is seeking to “free [Iran] from the dominant foreign messenger’s monopoly.”\nThis week’s move by the Kremlin’s state telecommunications regulator, Roskomnadzor, has shone a fresh spotlight on the battle over privacy and government oversight in authoritarian countries. Tech companies were struggling to deal with a law enacted last year requiring the FSB to easily access all their data.\nNext year, Facebook and Twitter could close down in Russia completely if they fail to start storing Russian personal data on servers inside the country for easy access by intelligence investigators.\nTwitter has promised to comply by the middle of this year, but Facebook has been vague. In testimony last week on Capitol Hill, CEO Mark Zuckerberg dodged the question of what data his firm would share with the Kremlin.\nNow a billionaire, Mr. Durov founded the firm five years ago after launching the popular Russian-language Facebook clone, VKontakte, which he no longer controls. With his famous mathematician brother, Mr. Durov has lived in self-imposed exile defying Russia’s draconian information security laws since 2014.\nAlong the way, Telegram, now based in Dubai and armed with $850 million in fresh capital after a cryptocurrency initial share sale, has been a portal of freedom amid Russia’s heavily censored and monitored internet. Its features, including its privacy features and the ability to add an unlimited number of correspondents to your Telegram “group,” have made it broadly popular.\nIn Russia, journalists and members of the political opposition rely on Telegram. But so does the Kremlin’s media office, which has used the platform in the past to arrange conference calls between reporters and President Vladimir Putin’s spokesman.\nThe battle with the FSB mushroomed Monday when Roskomnadzor announced that it would start closing down Telegram because Mr. Durov was refusing to share encryption keys.\n“We consider the decision to block [Telegram] unconstitutional and will continue to stand up for the right of Russians to confidential correspondence,” Mr. Durov replied.\nTelegram supporters reacted by tossing paper airplanes, the company slogan, at FSB headquarters in central Moscow.\nRussian social media showed pictures of the paper birds scattered on the streets and news of 12 protesters detained.\nIranian clash\nIn Iran, more than 50 percent of the population of 80 million are said to use the app, which exploded in popularity after another messenger, Viber, was blocked over suspected ties to Israel.\nIranians found Telegram easy to use for sharing text, videos and audio files. Even the hard-line government’s state TV channels initially used it to solicit viewer feedback.\n“Iran lives on this app,” Hossein Derakhshan wrote Monday in a New York Times opinion piece. “If you are Iranian, much of your life for the past few years has depended on [Telegram]. It has become something of a parallel, but uncensored, internet.”\nBut massive pro-reform protests that rocked the Islamic republic in 2009 made officials wary of foreign-based social media and messaging platforms, said Mr. Derakhshan, a media analyst who spent six years in an Iranian prison for online activism.\nTelegram, however, successfully avoided the crackdown and was even noted for its role in helping moderates win parliament during elections in 2016.\nLate last year, Iran experienced its largest street protests since 2009. Since then, hard-liners have moved quickly to restrict what is left of the country’s social media networks with Telegram topping their list.\nDuring the uprisings, Mr. Durov tweeted on the side of demonstrators criticizing the government for going after a “peaceful” protest.\n“Iranian authorities are blocking access to Telegram for the majority of Iranians after our public refusal to shut down and other peacefully protesting channels,” he wrote.\nAt the time, the Paris-based National Council of Resistance of Iran, relying on what it said were sources inside the government, announced there was evidence that Tehran’s intelligence services were significantly accelerating spying on citizens and ramping up “mass surveillance” of protesters and dissidents.\nTheir method for watching people is a web of state-produced mobile phone apps.\nTelegram was an outlier of freedom, and authorities in Tehran have banned the app on campuses nationwide in recent weeks.\nOn Monday the secretary of the Iranian Supreme Cyberspace Council told a radio program that Telegram could be blocked “at any moment.”", "url": "https://apnews.com/b9e8a75c820890ef313250457d87a74f"}