{"authors": ["Lizzie Stokes"], "date_download": "2020-05-04 20:03:37", "date_modify": "2020-05-04 20:03:37", "date_publish": "2018-07-03 20:09:28", "description": "If you see empty lawn chairs lined up by the water at the Wonderland of the Americas amphitheater this month, do not be alarmed. San Antonio jazz fans are just saving their spot for the 25th...", "filename": "_fa11105a48424af780831f44742939c1_1588622617.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fa11105a48424af780831f44742939c1_1588622617.html", "title": "Balcones Heights Jazz Festival celebrates its 25th year", "title_page": "Balcones Heights Jazz Festival celebrates its 25th year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "If you see empty lawn chairs lined up by the water at the Wonderland of the Americas amphitheater this month, do not be alarmed. San Antonio jazz fans are just saving their spot for the 25th annual Balcones Heights Jazz Festival.\nThe free festival will kick off its anniversary series on Friday at the amphitheater with performances by smooth jazz guitarist Peter White, saxophonist Will Donato and Warhawk, an offshoot of the U.S. Air Force Band of the West.\nThe festival runs through July, with concerts every Friday evening. This year, festival organizers have assembled an all-star lineup of returning acts as a tribute to the event’s two-and-a-half decade run.\nMusicians returning to Balcones Heights include Joseph Vincelli, who has played the festival 15 times, and Slim Man, who has done it 12 times.\n“You couldn’t ask for a more appreciative crowd,” said Slim Man, a jazz singer from Baltimore. “I mean, they’re out there putting up their lawn chairs the night before the show!”\nThe seating at the event is first-come, first-served, and dedicated fans have been known in past years to reserve a spot by setting up their chairs ahead of time. It has slowly become a festival tradition.\nSlim Man also said that the festival has only improved over the years, as its production systems have grown to accommodate the event’s ever-increasing audience.\n“It’s just a very well-run festival at this point,” he said. “And people are enjoying it more than ever.”\nThe horn band Warhawk will kick off this year’s festival at 6:30 p.m. Friday. The ensemble consists of eight airmen musicians who are stationed at Lackland Air Force Base.\nMajor David Alpar, commander of the Band of the West , said audiences this year can expect great music and lots of patriotism.\n“(Our) program is designed not only to play America’s own artform, jazz, but is designed to also honor America as we approach the Independence Day weekend,” Alpar said.\nBand members are excited to play in uniform for San Antonio, which is proudly referred to as Military City, U.S.A. Alpar said the city’s jazz fans are “one of the best audiences ever.”\nLorenzo Nastasi, director of economic development and public affairs for the city of Balcones Heights, said this year’s festival will be marked by enhancements in lighting and tech systems. The city also has plans to install video walls on the grounds of the amphitheater in response to the event’s growing popularity.\nOver the past 25 years, Nastasi said, people have met their future spouses at the festival, have had class reunions on the grounds and have run into long-lost friends in between acts.\nQ 101.9 DJ David Munoz, the festival’s longtime master of ceremonies, called the Wonderland amphitheater a “safe haven” where jazz fans can come to listen to good music and to connect with each other. When people set out those lawn chairs out the night before a concert, they know they’ll still be there the next day.\nlizzie.stokes@express-news.net", "url": "https://apnews.com/fa11105a48424af780831f44742939c1"}