{"authors": ["Courtesy", "Louisiana Tech Athletics"], "date_download": "2020-05-04 20:26:50", "date_modify": "2020-05-04 20:26:50", "date_publish": "2018-01-14 04:29:00", "description": "BIRMINGHAM – It was another tough second half in another tough road environment for Louisiana Tech as they fell to UAB, 74-62, on Saturday night inside Bartow Arena. Playing without star...", "filename": "_3d130c307a5e464eb714d5ba39fbcbbc_1588624010.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3d130c307a5e464eb714d5ba39fbcbbc_1588624010.html", "title": "Second-half woes doom Bulldogs on the road", "title_page": "Second-half woes doom Bulldogs on the road", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BIRMINGHAM – It was another tough second half in another tough road environment for Louisiana Tech as they fell to UAB, 74-62, on Saturday night inside Bartow Arena.\nPlaying without star point guard DaQuan Bracey, LA Tech (10-9, 1-5 C-USA) battled to have a one-point edge at halftime behind six made three-pointers and nine assists.\nThe second half was the opposite with zero made triples and just two assists to go along with 10 turnovers. UAB (13-5, 4-1 C-USA) in the second stanza made over half its shots and led for the final 18 minutes of the game.\n“I thought we played hard and really competed,” head coach Eric Konkol said. “In the second half, from an execution standpoint, we just weren’t able to accomplish what we wanted to on offense and defense. Turnovers really hurt us and their interior play hurt us.\n“We have to just keep plugging away. We have to keep learning from these experiences and find ways to be successful on both ends of the floor.”\nJacobi Boykins came into the game needing just two threes to set the LA Tech career record. It took him just 56 seconds as he hit two from the corner to put the Bulldogs quickly up 6-0.\nIt was career three-pointer No. 225 that did it, passing Kenyon McNeail who set the record back in 2014.\nMaking those passes was Amorie Archibald, stepping in at the point guard position.\nThe true freshman had an incredible nine assists in the first half alone, including two that went to Derric Jean for a layup and one to Exavian Christon for a three which sparked an 8-0 run to end the half to go ahead 40-39.\nAnthony Duruji made the first basket for either team to start the second stanza, giving the ’Dogs a three-point edge (they had as much as an eight-point lead at 14-6).\nThe Blazers responded though by going on a 7-0 run to retake the lead. The Bulldogs kept it to within one possession after a driving layup by Boykins made it 53-50 with 12:22 to go.\nUAB went on another run, this one a 9-0. LA Tech could not get within eight the rest of the way in what was the seventh road game out of the last nine games played.\nLA Tech shot 40 percent from the field (20-50) and 25 percent from three-point range (6-24). Four Bulldogs scored in double figures, led by Boykins who had 16.\nDerric Jean and Oliver Powell added 15 and 10 points, respectively, while Archibald registered the first double-double of the season for the team with 13 points and a career-high 10 assists in 38 minutes of action.\n“Amorie really stepped up for us. He is gaining more and more confidence and great experience. To make a start in this environment against a really good team and have a double-double. The way he commanded the offense says a lot about him.”\nUAB was 31-of-58 from the field (53 percent) and 6-of-15 from beyond the arc (40 percent). Chris Cokley led the way with 24 points.\nNext up on the schedule is a home matchup against North Texas on Thursday, Jan. 18 (seven of the next nine games are inside the Thomas Assembly Center). Tipoff is set for 6:30 p.m. and will be broadcast by Stadium.\nFor all the latest in Bulldog Basketball, follow them on Twitter (@LATechHoops), Instagram (@LATechHoops) and Facebook (LATechMBB) or visit the official website at LATechSports.com.", "url": "https://apnews.com/3d130c307a5e464eb714d5ba39fbcbbc"}