{"authors": ["Chris Bosak"], "date_download": "2020-05-04 20:05:47", "date_modify": "2020-05-04 20:05:47", "date_publish": "2018-05-11 19:08:02", "description": "The Hearst Foundations announced a pair of $50,000 grants to Connecticut nonprofit organizations following its most recent board meeting. The Silvermine Arts Center in New Canaan will use...", "filename": "_77f18a99fbcb4304a7334a82c048036f_1588622747.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_77f18a99fbcb4304a7334a82c048036f_1588622747.html", "title": "Hearst Foundations Silvermine Arts Center, LEAP benefit from grants", "title_page": "Hearst Foundations Silvermine Arts Center, LEAP benefit from grants", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Hearst Foundations announced a pair of $50,000 grants to Connecticut nonprofit organizations following its most recent board meeting.\nThe Silvermine Arts Center in New Canaan will use the grant for its Art Partners Outreach Education Program. The other grant will support the Youth Development program at Leadership Education and Athletics in Partnership, or LEAP, of New Haven.\nGeorge Irish, the eastern director of Hearst Foundations, said the organizations considered for grants are vetted by Foundations staff. He oversaw the examination of Silvermine Arts Center.\n“It brings art into schools in a way that schools can’t do on their own,” he said of the Art Partners program. “It’s a small organization that does a lot with a little budget. I’m very impressed with that. The same can be said for the work LEAP does.”\nThe Silvermine Arts Center’s Art Partners Program provides free or subsidized professional teaching artists to underserved students in Stamford and Norwalk public schools. It serves nearly 1,000 students each year.\n“With this grant, Art Partners, now in its 26th year, will continue to broaden and deepen the effectiveness of these programs through an increased number of teaching hours,” Sophia Gevas, outreach education director at Silvermine Arts Center, said. “This grant reflects the Foundations’ understanding of our commitment to educating the whole child and offering arts opportunities to these students.”\nThe Hearst Foundations, which include The Hearst Foundation Inc. and The William Randolph Hearst Foundation, are operated separately from Hearst Corp., the parent organization of Hearst Connecticut Media. The foundations started in 1975 with $137 million from Hearst Corp. It has made more than 20,000 grants totaling more than $1 billion.\nThe foundations give grants to organizations in the areas of education, culture, social service and health.\nIrish said there is an open application process with no deadline. Applications are available at www.hearstfdn.org.\nLEAP was founded in 1992 to provide educational and enrichment opportunities to low-income minority youth. It serves more than 1,000 children between the ages of 7 and 18, and trains more than 100 college or high school students each year to be counselors and role models.\nRachel Kline Brown, director of development for LEAP, said state funding over the last four years has been cut from $760,000 to $300,000. The cuts forced LEAP to close one of its five locations within New Haven, but the grant will allow it to be reopened.\n“The grant is a big deal for us,” Kline Brown said. “We had been struggling financially. The Hearst Foundations grant positions us to get funding from other national sources.”\nThe writer may be reached at cbosak@hearstmediact.com", "url": "https://apnews.com/77f18a99fbcb4304a7334a82c048036f"}