{"authors": ["Tamara Wolk"], "date_download": "2020-05-04 20:11:37", "date_modify": "2020-05-04 20:11:37", "date_publish": "2018-04-10 15:23:00", "description": "From a tragedy in a neighboring state, a big dream was born in Ringgold. Tina Pinkston, Chrissie Brown and other mothers in the Ringgold area started thinking after the school shooting in...", "filename": "_21617e960f804d3db1089daf06f8aa23_1588623097.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_21617e960f804d3db1089daf06f8aa23_1588623097.html", "title": "LIFT kicks off with Earth Day event in Ringgold", "title_page": "LIFT kicks off with Earth Day event in Ringgold", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "From a tragedy in a neighboring state, a big dream was born in Ringgold.\nTina Pinkston, Chrissie Brown and other mothers in the Ringgold area started thinking after the school shooting in Parkland, Fla., about how they might help avert such an incident here.\n“We want to reach young people who are at risk of becoming at risk,” says Pinkston. “Kids who might feel lonely, isolated, like outsiders, kids who are struggling. We’re thinking about kids who walk home from school by themselves and spend the afternoon alone because parents are at work, kids who don’t have a strong network of support.”\nWhat came from this concern is an organization called LIFT Ringgold, and its goals are, appropriately, lofty. “For starters,” says Pinkston, “we’ll be doing events around the community and in neighborhoods for kids in the middle school and high school age range, but eventually we hope to have a youth center.”\nEarth Day Ringgold\nWhen: Sunday, April 22, from 2-4 p.m.\nWho: The whole family\nDetails: Community art projects, cookie decorating, seed planting, live music, “Butterfly Lady,” community work projects\nThe “L” in LIFT stands for “Loved (as you are).” LIFT wants young people to know they’re loved and accepted.\nThe “I” stands for “Inspired (to be more).” Another goal of LIFT is to help young people see their potential and work toward it.”\n“F” stands for “Found (in community).” To be “found” and to become part of a community that cares is also a primary focus of LIFT for the young people it aims to help.\nFinally, “T” stands for “Trusted (to make a difference).” “We want to build confidence and skills in young people, so they’ll be able to trust themselves to make a positive difference in the world,” says Pinkston.\nLIFT is only two months old as an organization, but the group is already connecting and partnering with many others in the community, including the City of Ringgold and Catoosa County, the Catoosa County Library, Outdoor Ringgold, Above the Ridge, Girl Scouts, Boy Scouts, Catoosa Home Education Association and many others.\n“We want to come together to make sure everyone where we live feels like a vital part of our community,” says Pinkston.\nKick-off: April 22 Earth Day\nTo that end, LIFT and their partners in good are kicking off with a big Earth Day celebration on Sunday, April 22, at the Little General Park in Ringgold.\nThe event is suited for all ages, from little children to adults. People will be able to help create a piece of art from recycled trash, plant seeds and decorate an edible “earth cookie.” There will be live music and the “butterfly lady” will be there to teach about the habits of her pretty winged creatures.\nFolks will also be able to sign up to help with a project to help beautify the city, from picking up trash and helping at the recycling center next to the park to cleaning up walking trails or kayaking along waterways to scoop debris. The clean-up projects will begin at 3 p.m. and last for an hour or so.\nAnyone interested in helping to sponsor the event or being involved in it can contact LIFT through its Facebook page. “We’re looking for people who can offer something community-focused, things that help make our community a better and more loving place,” says Pinkston.\nEarth Day Ringgold will take place on April 22 from 2-4 p.m. at Little General Park, 15 Cleveland St., Ringgold.\nTo learn more about Earth Day Ringgold, visit facebook.com/events/426396287806423.\nTo learn more about LIFT, visit facebook.com/LIFTRinggold.", "url": "https://apnews.com/21617e960f804d3db1089daf06f8aa23"}