{"authors": ["Barry Adams", "Wisconsin State Journal"], "date_download": "2020-05-04 20:07:12", "date_modify": "2020-05-04 20:07:12", "date_publish": "2018-04-04 18:00:00", "description": "What will be Madison's largest liquor store will open next week, add a new dimension to West Towne Mall and ratchet up the competition for beer, wine and liquor sales in Dane County. Total...", "filename": "_aeb6f4932d514fd49d1efecbc28f3a82_1588622832.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aeb6f4932d514fd49d1efecbc28f3a82_1588622832.html", "title": "Total Wine to open April 12 at West Towne Mall", "title_page": "Total Wine to open April 12 at West Towne Mall", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "What will be Madison’s largest liquor store will open next week, add a new dimension to West Towne Mall and ratchet up the competition for beer, wine and liquor sales in Dane County.\nTotal Wine & More has announced that it will open its 23,146-square-foot store on April 12, just days after the neighboring Dave & Buster’s opens its restaurant and arcade center. Both are in part of what for nearly five decades was home to a Sears store, which has been downsized to 56,000-square-feet to make way for the two new additions that focus not just on retail sales but tout themselves as experience-type destinations.\nThe openings will also add a jolt to the south side of the mall property where Granite City closed its brewpub in October after 11 years while the nearby Toy’s R’ Us store is conducting a going-out-of-business sale.\nDave & Buster’s, scheduled to open Monday, announced in September that it would locate its 100th store in Madison. The 31,000-square-foot facility includes a full-service restaurant, televisions to watch sporting events and a large arcade filled with simulators and games of skill.\nMaryland-based Total Wine, founded in 1991 by brothers David and Robert Trone, has been more quiet with its entry into the market and only recently began talking publicly about its plans, which were unveiled in October to the city. But the store, stocked with 8,000 wines, 3,000 spirits and 2,500 types of beer, is nearly twice the size of the nearby liquor department at Woodman’s Market and is expected to make a big splash when it opens.\nIt features eight checkout lanes, a wine tasting station, a brewery area for tastings and to fill growlers and a room for wine, beer and spirit classes. The room, which can also be reserved by area non-profits, is also equipped with audio and visual equipment to allow students to interact with brewers, wine makers and distillers from around the country.\nThe store, with 50 employees, three-quarters of which are full-time, also has the same type of liquor license as a bar, which allows it to sell more than just tastes of products.\n“Our type of store is an experiential one where customers love to come and not only avail themselves to the selections, and the service and the price, but really it’s really about the customer experience,” said Edward Cooper, Total Wine’s vice president of public affairs and community relations. “This is unlike anything that Madison has ever seen. We are a destination spot and a destination retailer. We will pull a whole lot of consumers from a pretty good sized ring.”\nIt’s unclear what impact the store may have on other retailers like Pick ’n Save, Hy-Vee, Metcalfe’s and Costco and smaller independent stores like Steve’s Liquor, a Madison mainstay for nearly 70 years and now with three locations, two of which are on the West and Far West sides of the city.\nCooper, however, said the business model of Total Wine is different from other retailers which could limit the impact, he said. Many of its customers visit only six to 12 times a year but stock up when they visit.\n“I think it will be minimal,” said Cooper, whose company has over 170 stores in 21 states. “The smaller independent stores have their business models and their niches and they work quite effectively.”\nThe opening of Total Wine and Dave & Buster’s will complete months of work on the south side of the mall property that is owned not by CBL & Associates but by Seritage Growth Properties, which bought the 18-acre Sears property from CBL in 2015.\nThe $17 million project has included a new parking lot and drainage system and the reconfiguration of the Sears store into three separate spaces. The Sears automotive center was not touched by the redevelopment and remains open.\nIn November 2016, Total Wine opened its first store in Wisconsin in Brookfield, although it was turned down for a class B liquor license. It opened a 24,000-square-foot store in the Milwaukee suburb of Greenfield last month but Copper said the company will wait and study the Madison market further before deciding if it will open a store on the city’s East Side or in Sun Prairie.\n“It’s not unusual for us to open a new store in a new market and gauge where our customers are coming from,” Cooper said.", "url": "https://apnews.com/aeb6f4932d514fd49d1efecbc28f3a82"}