{"authors": [], "date_download": "2020-05-04 20:09:50", "date_modify": "2020-05-04 20:09:50", "date_publish": "2018-10-19 19:12:30", "description": "Two detention officers at the Durham County jail lost their jobs Friday and face criminal charges in connection with an assault on an inmate last month. Joseph Harris, 25, was charged with...", "filename": "_1332fdc90e01601b9e026bfe0626edec_1588622990.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1332fdc90e01601b9e026bfe0626edec_1588622990.html", "title": "Durham detention officers charged, fired over inmate assault", "title_page": "Durham detention officers charged, fired over inmate assault", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Two detention officers at the Durham County jail lost their jobs Friday and face criminal charges in connection with an assault on an inmate last month.\nJoseph Harris, 25, was charged with misdemeanor assault. Austin Taylor, 26, was charged with accessory to assault. Harris had worked as a detention officer since May, while Taylor had worked at the jail since July 2016.\nHarris filed a use-of-force report regarding a Sept. 23 incident, and his supervisor reviewed surveillance video of the incident, authorities said. The detainee didn’t report the encounter, and when approached by staff after it occurred, reported not being injured.\nThe supervisor believed there was possible evidence of excessive force and forwarded the information up the chain of command for additional assessment, authorities said. Command staff at the detention center then requested internal and criminal investigations to be conducted. Harris and Taylor were placed on paid leave during the two investigations.\n“This does not reflect the work efforts of the men and women of the Durham County Sheriff’s Office,” Sheriff Mike Andrews, who oversees the jail, said in a statement. “Incidents such as these will not be tolerated and will be addressed through the courts. It is unfortunate that we had to take this action against two of our own today.”\nThe Durham County jail employs 196 detention officers and 18 civilians.", "url": "https://apnews.com/1332fdc90e01601b9e026bfe0626edec"}