{"authors": ["Joshua Gutierrez", "Jgutierrez Appealdemocrat.Com"], "date_download": "2020-05-04 20:06:16", "date_modify": "2020-05-04 20:06:16", "date_publish": "2018-03-02 01:48:00", "description": "A half-million-dollar relocation project for Yuba College's veterinary technician program will double the instructional space and increase enrollment, school officials said. The college's...", "filename": "_ac64f69a432f4d5aac624169765b9966_1588622776.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ac64f69a432f4d5aac624169765b9966_1588622776.html", "title": "Yuba College officials highlight half-million-dollar vet tech relocation", "title_page": "Yuba College officials highlight half-million-dollar vet tech relocation", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A half-million-dollar relocation project for Yuba College’s veterinary technician program will double the instructional space and increase enrollment, school officials said.\nThe college’s board of trustees awarded the $580,792 contract to REM Construction, which would provide significant renovation to Building 1700 on the Linda campus and allow it to meet Americans with Disabilities Act requirements.\nPresident G.H. Javaheripour said the project is both a remodel and relocation meant to create additional and safer space for students using a very small facility, Building 800, awkwardly placed near the center of campus.\n“Hopefully, the expansion of the facility is going to permit us to increase student enrollment and provide access to a unique program, which serves the populations north of Sacramento all the way to the Oregon border,” Javaheripour said.\nAmber Kuykendall, veterinary technician specialist with the program, said she believes the program’s building has been renovated once since 1972 and the move will accommodate steadily-increasing enrollment.\n“We will be able to grow out the program significantly and a have the capability to add different aspects to what we already provide,” Kuykendall said. “The number has been increasing, with the past application process having the maximum number of applicants. We expect it (the program) to keep growing.”\nWith 33 enrollees in the program, Kuykendall said the expansion creates an opportunity to broaden the curriculum to include more specialized career fields. In addition, more seats for online distance learners will provide access to students across Northern California.\nKuykendall said the two-year degree presents graduates with a range of employment opportunities, including at local practices, research facilities, and in food inspection or sales.\nJavaheripour said the cost of the project was in part driven up by an uptick in commercial construction throughout the country. He said the original projected construction cost was somewhere near $450,000, but jumped up nearly $60,000 because of the current demand for commercial construction projects.\nRoughly $66,000 of the contract awarded is for furnishings and equipment.\nThe Veterinary Technician Relocation Project follows a pair of $200,000 renovations to a radiologic technology center and an update to the manufacturing facility in the past few years.\nJavaheripour said the project is part of a concerted effort to modernize the Linda campus. In the coming weeks, Javaheripour said the board of trustees will vote to approve replacing the roofs of most of the buildings on campus.", "url": "https://apnews.com/ac64f69a432f4d5aac624169765b9966"}