{"authors": ["Matt Mckinney"], "date_download": "2020-05-04 20:12:10", "date_modify": "2020-05-04 20:12:10", "date_publish": "2018-03-10 14:47:56", "description": "A publishing executive who made millions and then gave it away to schools, hospitals and people down on their luck, John Nasseff was a wealthy philanthropist who rose from poverty to become a...", "filename": "_ff5d031872254534b8110868c0a6fa55_1588623130.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ff5d031872254534b8110868c0a6fa55_1588623130.html", "title": "St. Paul publisher and philanthropist John Nasseff dies at 93", "title_page": "St. Paul publisher and philanthropist John Nasseff dies at 93", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A publishing executive who made millions and then gave it away to schools, hospitals and people down on their luck, John Nasseff was a wealthy philanthropist who rose from poverty to become a pillar of St. Paul’s business community.\nA singular character in the city’s history, he spent five decades at West Publishing and retired as a board member and vice president despite not having more than a ninth-grade education. He was known for his generosity, dapper sense of fashion and for living the classic American story of rising through his own hard work.\nNasseff died Feb. 21, the day he turned 94, at his St. Paul home.\nA family history written by Jacqueline Nasseff Hilgert told the story of Nasseff’s parents, Betros and Zmorroud, and their emigration from Lebanon. Hoping for a new life in America, Betros undertook an arduous, yearslong journey before eventually reaching Mexico City, where Zmorroud joined him. They then traveled to St. Paul to be near Betros’ brother and began their new life on St. Paul’s West Side.\nJohn Nasseff was born in 1924 and shared a bed with his brother, Art, in their tar-paper-sided house. His mother instilled in him a deep sense of charity. Old clothes purchased by the pound were the children’s wardrobe, but the best finds were shipped off to Lebanon for needy children there.\nHe was a restless child, running away to New York City at age 12 by hopping freight cars. His father warmly welcomed him back home when he returned.\nHe left school in the ninth grade to work. He shipped out from Union Station in 1943 for the Pacific front during World War II.\nIt was when he came home after the war that one of Nasseff’s brothers helped him get a job unloading boxcars at West Publishing. Nasseff rose through the company’s ranks over the next 50 years and was instrumental in helping the company move from downtown St. Paul to Eagan. West was sold to Thomson Reuters in 1996, and Nasseff’s long history of buying West shares netted him about $175 million in the sale.\nSt. Paul Police Chief Todd Axtell said he got to know Nasseff as a rookie officer. “One of the greatest honors of my life was getting to know him and seeing firsthand how selfless he was,” Axtell said.\nNasseff gave millions to United Hospital for a heart center and other needs, $10 million to the St. Agnes School in St. Paul’s Frogtown for a student activities center and $3 million to the St. Paul Police Department for its new training center, which opened in November. He’s also given to orphanages around the world, Eagan’s historic Town Hall, a dental clinic in Lebanon, the Mayo Clinic, St. Maron’s Catholic Church in Minneapolis and other beneficiaries.\nHis wife, Helene Houle, said she was awe-struck by the long line of people at Nasseff’s memorial service who said their lives were made better by him. “He never talked down to anybody. He had a lot of compassion, for immigrants especially,” she said. Fearless and full of curiosity, Nasseff had a feeling for people and a deep intelligence, she said.\n“I just would like to really express how sad I am without him in my life now. And how happy he made me all those years, and how generous he was,” Houle said.\nThe portion of Plato Boulevard between Wabasha and Robert streets in St. Paul was co-named John Nasseff Boulevard in 2016.\nIn addition to his wife, Nasseff is survived by a son, Arthur; his former wife, Rose Nasseff; three grandchildren, five great-grandchildren and a great-great-grandchild. Another son, John Jr., preceded him in death.\nServices have been held.\nMatt McKinney • 612-673-7329", "url": "https://apnews.com/ff5d031872254534b8110868c0a6fa55"}