{"authors": ["John Fryar Staff Writer"], "date_download": "2020-05-04 20:21:57", "date_modify": "2020-05-04 20:21:57", "date_publish": "2018-06-14 02:47:36", "description": "The Boulder County commissioners have approved joining Longmont in acquiring a conservation easement over the 20-acre Harper property northwest of Colo. 66 and East County Line Road. Under...", "filename": "_b7b197c6e4dd40cd86157ca9ddc2d822_1588623717.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b7b197c6e4dd40cd86157ca9ddc2d822_1588623717.html", "title": "Boulder County OKs Conservation Easement Purchase North of Longmont", "title_page": "Boulder County OKs Conservation Easement Purchase North of Longmont", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Boulder County commissioners have approved joining Longmont in acquiring a conservation easement over the 20-acre Harper property northwest of Colo. 66 and East County Line Road.\nUnder the transaction supported by Commissioners Cindy Domenico and Deb Gardner on Tuesday, ownership of the property would remain private, but the city and county would pay the current owners $720,000 to buy the conservation easement to limit future development at 12621 Ute Highway.\nBoulder County will pay $240,000 toward that conservation easement purchase, and the city will pay $480,000.\nMel Stonebraker, a land officer in the county’s Parks and Open Space Department, told the commissioners that the Harper property “really is at the gateway” between Boulder and Weld counties, as well as a gateway to northeast Longmont.\nAnother feature of the agreement that’s been negotiated by the city and county staffs and the Harper family and the property’s severed mineral rights owners, Stonebraker said, is that any future drilling for and production of oil and gas developments would have to be done remotely, from an off-site location, and there could be no surface disturbances on the Harper property itself from such oil and gas activities or facilities.\nGardner applauded that agreement, saying the pressure to develop oil and gas in the area “is extreme.”\nSo, too, she said, is the potential the area might someday be developed for housing or other non-agricultural uses without a conservation easement in place.\nDomenico called the conservation easement acquisition “very important” in terms of maintaining an urban-shaping buffer around Longmont.\nCommissioner Elise Jones did not attend Tuesday’s meeting, and no one spoke at a public hearing on the proposed conservation-easement purchase.\nThe Longmont City Council endorsed the proposal on April 24.\nJohn Fryar: 303-684-5211, jfryar@times-call.com or twitter.com/jfryartc", "url": "https://apnews.com/b7b197c6e4dd40cd86157ca9ddc2d822"}