{"authors": ["Donnie Collins"], "date_download": "2020-05-04 20:18:18", "date_modify": "2020-05-04 20:18:18", "date_publish": "2018-03-22 00:00:00", "description": "Just a day or so before Dunmore’s girls basketball team would go where it always seems to go, boldly into the belly of the beast, its star junior post player Victoria Toomey took a brave stance on...", "filename": "_ce7c0e89c8a246dbb80b658eb8d9b757_1588623498.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ce7c0e89c8a246dbb80b658eb8d9b757_1588623498.html", "title": "Collins: Basketball Recruiting More Than Just A PIAA Rules Issue", "title_page": "Collins: Basketball Recruiting More Than Just A PIAA Rules Issue", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Just a day or so before Dunmore’s girls basketball team would go where it always seems to go, boldly into the belly of the beast, its star junior post player Victoria Toomey took a brave stance on the Bucks’ attitude about playing powerhouse Neumann-Goretti.\n“We’re not afraid,” she said of the three-time defending state champs.\nIt would be really nice if someone in District 12 shared the sentiment.\nThe Bucks went where they always seem to go Monday night, and they were met with the same result they always seem to meet. Neumann-Goretti proved too big and too fast and too deep and too darn good yet again, 66-42.\nThis marks the fourth time in five seasons Dunmore’s season ended at the Saints’ whims. Three of those losses were by at least 24.\nThat’s the nature of high school sports, really. You can have a great program, and Dunmore certainly does, that just can’t get over the hump against a better program. Happens to teams all the time in baseball and football and tennis and every sport the Pennsylvania Interscholastic Athletic Association sanctions. And that’s fine, if everyone is playing by the same rules.\nWhat makes this different is Neumann-Goretti and others similar to it do not.\nThe Saints and coach Andrea Peterson hit the free-agent market to make sure they sealed the deal on their fourth consecutive PIAA title. As the Saints slumped down the stretch, they secured the services of sophomore guard Diamond Johnson, who averaged 33 points per game in 19 appearances for Phoebus High School in Hampton, Virginia, this season. Simply admitted her to the school. Pretty convenient.\nJohnson already has an NCAA Division I offer from Radford, and her transfer turned into a pretty big deal in Hampton. On Feb. 6, she scored 23 points and had five fourth-quarter steals for Phoebus, four days after she told her team she’d be heading off to Neumann-Goretti in a week.\nExactly one month later, the District 12 committee did Neumann-Goretti a solid by making Johnson eligible, effective March 6. Of course, that meant Peterson didn’t have Johnson to bring off the bench for any regular season games or the District 12 playoffs — which, incidentally, the Saints did not win without their star free agent. But she was allowed to play in the PIAA Class 3A playoffs, which is quite opportunistic for the basketball-mad district and the school that churns out Division I basketball talent without having to explain how it obtained it to begin with.\nJohnson scored 18 in the win over Dunmore and is averaging 15.8 points in the four games she has been allowed to play — all in the state playoffs.\nIt is easy to criticize Johnson, but look at it her way. All she did is accept an opportunity to play at a prestigious, big-city private school that has landed big-time college scholarships for its players for a long, long time. If she had to sit out the rest of this season and wait until next winter to play, she likely would have done so. It’s a great opportunity.\nBut she didn’t even have to wait.\nJust make some half-hearted claim about academics being the motivating factor for the move, get a couple of signatures from the principals — one who doesn’t want to stand in the way of a move to a private school; the other who knows how much a player like Johnson benefits the basketball program — and you can play as soon as the district committee can convene a meeting to publicly throw its hands up in as helpless a manner as it can contrive.\nThe District 12 committee’s stance: It couldn’t “legally” deny Johnson’s transfer request. We live in a litigious society for sure, and to be fair, the committee vice chairman, Joe Sette, told a reporter from sports radio 96.7 FM in Hermitage that Johnson moved back to Philadelphia, where she spent most of her childhood, because of a “private family matter.”\nTo do that may keep the district and the PIAA out of a legal skirmish, but it also ignores the preponderance of the evidence that Neumann-Goretti simply brought in a ringer when the going got tough.\nIn February, Johnson’s mother, Dana Brooks, told the Daily Press in Hampton Roads that her daughter had been trying to get into Neumann-Goretti for a while, which suggests the acceptance on Neumann-Goretti’s part came more than halfway into the school year. She also said Johnson will make the 300-mile trip home to Virginia every other weekend and will still play for a travel team in the Hampton Roads area, which suggests the family doesn’t consider Philadelphia its primary residence. Johnson even told the paper Neumann-Goretti is “better for my basketball and education.”\nThis does not seem like rocket science, folks. Johnson isn’t the first student to use the “educational opportunities” crutch to secure an athletic transfer, and there are too many easily beatable loopholes in the PIAA’s current rules on transfers to suggest she won’t be the last. But it’s reprehensible that the adults in charge are allowing this, at the time of year they are, simply to cover their own backsides against a half-baked legal challenge. There isn’t a committee that is saying, “We’re not allowing this because it isn’t right?” There’s not a legislative body willing to stand up for rules that better guarantee fair competition? Even worse, there isn’t a principal or coach willing to live or die with the team they built, willing to say that winning a game isn’t more important, can’t be more important, than doing right by every student at every school in every city or town in the state?\nUnbeknownst to Neumann-Goretti, the sports world doesn’t revolve around Neumann-Goretti, which has fielded transfers from all over the world to beat teams like Dunmore, which fields its players kids from a nine-square-mile plot between a landfill and a Price Chopper. As a member school, Neumann-Goretti has to have some responsibility toward enforcing the PIAA’s mission statement, which says it should “emphasize the educational values of interscholastic athletics, promote safe and sportsmanlike competition, and provide uniform standards for all interscholastic levels of competition.”\nWhat it’s being allowed to do now may be technically legal, but it is patently unfair.\nIn the last 10 years under head coach Ben O’Brien, the Bucks are 252-38 with those players from that one small town. But even that isn’t good enough against a school that is always allowed to take whichever players it wants and, for now, is free to do so whenever it wants.\n“This has been a hot-button issue for many years now,” O’Brien said leading into Monday’s game, “and it’s hard to imagine that no one has been able to come up with an equitable solution.”\nHard to imagine. Impossible to stomach as it is to understand.\nDONNIE COLLINS is a Times-Shamrock sports columnist. Contact him at dcollins@timesshamrock.com and follow him on Twitter @DonnieCollinsTT.", "url": "https://apnews.com/ce7c0e89c8a246dbb80b658eb8d9b757"}