{"authors": ["Larry Wood"], "date_download": "2020-05-04 20:06:12", "date_modify": "2020-05-04 20:06:12", "date_publish": "2018-04-14 01:00:00", "description": "Paladin Productions will present “Mending Fences” as the final play in its 2017-18 season. Performances will be at 7:30 p.m. April 21 and at 3:30 p.m. April 22 in the Cedar Creek Owners...", "filename": "_359893fc886d4114baf0e7ad9662a77c_1588622772.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_359893fc886d4114baf0e7ad9662a77c_1588622772.html", "title": "Paladin Productions caps off season with comedy, 'Mending Fences'", "title_page": "Paladin Productions caps off season with comedy, 'Mending Fences'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Paladin Productions will present “Mending Fences” as the final play in its 2017-18 season.\nPerformances will be at 7:30 p.m. April 21 and at 3:30 p.m. April 22 in the Cedar Creek Owners Association Community Center at 2584 Club Drive. For reservations, call 803-644-0416.\nA third production will be at 7 p.m. April 17 in the Mount Vintage Town Center at 235 Mount Vintage Plantation Drive in North Augusta. For reservations, call 803-624-7265.\nOther performances will be at private country clubs. For a list of those dates, visit paladinproductions.org .\nBy Canadian playwright Norm Foster, “Mending Fences” is a “forceful and poignant comedy,” director Bob Franklin said in a news release about the production. The play explores the awkward and sometimes stormy reunion of a father and son who have been estranged for nearly 15 years.\nHarry Sullivan, his wife, and their young son, Drew, left the big city to find a new and more meaningful life on a ranch in Saskatchewan, Franklin said. But after nine years of trying to be happy, Harry’s wife leaves him and returns to the city, taking their teenage son with her.\nNow an adult with problems of his own – for many of which he blames his father – Drew returns to Saskatchewan itching for a fight, and Harry, stubborn as ever, is happy to give him one.\nInto the mix walks Virginia, a widow who owns the neighboring ranch. She and Harry are in a relationship, and she tries, with varying degrees of success, to help the father and son get along, Franklin said.\nJames Raby as Harry, Jason Latimer as Drew and Dana Cheshire as Virginia play the comedy’s three characters, but each actor plays other characters in a series of flashback scenes.\n“Dana, for example, in addition to handling the role of Virginia, becomes both Harry’s wife and his mother,” Franklin said. “James plays himself and his father, and Jason plays Drew, young Drew and young Harry.”\n“Character changes are particularly difficult for an actor, both artistically and emotionally,” Cheshire said.\nLatimer agreed.\n“One doesn’t simply learn a different set of lines,” he said. “I must become a different person with a different attitude and personality and voice. It is challenging to keep track of the differences in the middle of a performance.”\nFranklin said he finds each of the characters portrayed to be very real and very complex, adding he is proud of the hard work the cast has put into their roles to make them believable.\n“Audience members will see themselves or someone they know or have known in each of the characters presented on stage,” he said.", "url": "https://apnews.com/359893fc886d4114baf0e7ad9662a77c"}