{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:27:44", "date_modify": "2020-05-04 20:27:44", "date_publish": "2018-01-17 01:00:00", "description": "Adapted from a recent online discussion. Dear Carolyn: I’m 27 weeks pregnant and just moved to a new city for a great job, but I think I made a big mistake. I loved my old life and...", "filename": "_23502bb5c4a24d66b27a15c54f0300db_1588624064.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_23502bb5c4a24d66b27a15c54f0300db_1588624064.html", "title": "Hax: Was moving while pregnant a big mistake?", "title_page": "Hax: Was moving while pregnant a big mistake?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Adapted from a recent online discussion.\nDear Carolyn:\nI’m 27 weeks pregnant and just moved to a new city for a great job, but I think I made a big mistake. I loved my old life and feel so homesick for it. But my husband and I bought a house, so moving is not a feasible option. Any advice for making the best of a big uncomfortable transition?\n— Relocation\n“Just moved” is a state of being that makes just about any place seem miserable. Plus, homesickness is normal after leaving a place you loved. Plus, pregnancy could be heightening your emotions and attachments. So, “mak[e] the best of this” by recognizing, to start, that your feelings are (1) normal and (2) going to change sooner rather than later.\nNote that I didn’t say they’d change for the better, necessarily; a year from now you might still believe moving was a mistake. But you’ll have had a year to adjust, and you’ll have your routines so basics like going to the grocery store won’t feel alien anymore.\nOf course, your pregnancy means you’ll have other changes to adapt to, but that’s a variable we can’t account for yet besides never sleeping or leaving the house — I kid! — so I’ll leave it out. It could make you glad you moved or regret your move even more.\nAnyway, the key to starting over as an adult is, in my experience, patience + effort + an open mind. Strong new roots can take years, and those years can be difficult.\nShould you decide for some reason that the new location will never be what you’d hoped and that you want to return to the old one, owning a home makes that decision complicated, but not impossible. People uproot at inconvenient times, it’s just a fact of life; that’s why houses get rented, and even losses get absorbed.\nThinking this way tends to undermine the patience-and-open-mind plan, though, so I suggest you consider it, rule it out for now and really invest in your new place. You moved for a reason, and it may still hold up — after this initial panic clears.\nRe: Stressful:\nThey say the stressful life changes are marriage, death, divorce, babies, moving, buying a house, and starting a new job. You have a few of those. And hormones. You are possibly isolated and alone because you are in a new place. Do you know anyone nearby to connect with? Can you find a new moms’ group? When I had had my first kid, I felt isolated — and I had lived in that city for quite some time. I had no friends with kids. I presume you have limited time and energy to socialize between work and being pregnant, but try, at least, to make the best of it, and make an informed decision after having more data.\n— Been There\nRe: Moving:\nFive years after I bought at the top of the market, I got a job on the opposite coast and the market tanked, so my home was unsellable without a massive loss. I found a manager, rented it out, and it has been great to have the income and the tax deduction. There is nothing that can’t be survived.\n— Anonymous\n“Surmounted,” let’s say, and thanks.\nEmail Carolyn at tellme@washpost.com, follow her on Facebook at www.facebook.com/carolyn.hax or chat with her online at noon Eastern time each Friday at www.washingtonpost.com.", "url": "https://apnews.com/23502bb5c4a24d66b27a15c54f0300db"}