{"authors": ["Ken Borsuk"], "date_download": "2020-05-04 20:26:14", "date_modify": "2020-05-04 20:26:14", "date_publish": "2018-01-18 21:13:49", "description": "GREENWICH — After considerable drama, a contract with the town’s Teamsters union was accepted this week with little fanfare. But with other labor negotiations about to start, town officials...", "filename": "_13d1656aeb6446d8bc23842082dbbc67_1588623974.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_13d1656aeb6446d8bc23842082dbbc67_1588623974.html", "title": "RTM factions disagree on approach to future labor deals", "title_page": "RTM factions disagree on approach to future labor deals", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GREENWICH — After considerable drama, a contract with the town’s Teamsters union was accepted this week with little fanfare. But with other labor negotiations about to start, town officials disagree over how they should proceed.\nOfficials are about to begin negotiations with unions representing school health nurses and Health Department nurses. Once agreed upon, those contracts will go to the Representative Town Meeting for final approval. But two key RTM committees are at odds over approval strategy.\nTheir disagreement originated during the Teamsters process. In December 2016, the RTM took the unprecedented step of rejecting an agreed upon labor contract between the town and Teamsters Local 456. The action sent the three-year contract back to the negotiating table and ultimately to binding arbitration.\n“The RTM’s rejection of the Teamster contract made history,” RTM Budget Overview Committee Chairman Lucia Jansen said this week. “Never before had the RTM rejected a labor contract proposed by the town to the RTM.”\nJansen celebrated the Dec. 2016 vote and the Dec. 2017 arbitrator’s decision, which provided 2.25 percent wage increases in the first two years of the contract, which the union had requested, and a 1.5 percent increase in the third year, which was sought by the town. The arbitrator also decided the town did not have to increase its 401K match with the union members.\nJansen called the decision “an amazingly wonderful outcome” which saved the town money and constituted a psychological win in that a state arbitration panel agreed that a contract was too high, outpacing inflation and private sector growth, even for a wealthy town like Greenwich.\nShe and others say the result should lead to a harder line on future deals.\nBut a different faction of the RTM, led by the Labor Contracts Committee, contends it still is unwise to risk arbitration.\n“The positive view is that the RTM rejection of the contract and the ensuing arbitration should be considered a historic psychological and strategic victory for the town, even if the financial gain is relatively modest,” David Detjen, chairman of the Labor Contracts Committee, said this week. “But the other perspective, which I would call the temperate view, is that we dodged a bullet to a certain degree and the town probably did better in the arbitration than it deserved.”\nDetjen said ultimately only about $600,000 in savings was achieved by rejecting the Dec. 2016 contract.\nThe Labor Contracts Committee had urged against the initial rejection of the Teamsters contract.\n“The BOC, which until recently had focused on budgetary process, is now focusing also on the negotiating process. It has been urging that labor contracts be negotiated in the context of the BOC’s budgetary goals when negotiating things like (general wage increases),” Detjen said. “The LCC has not been convinced of the wisdom of trying to achieve budgetary goals in labor negotiations.”\nDetjen said it was best to leave the work to the town’s labor negotiator. He also expressed skepticism about the ability to synchronize the budgetary process and the labor negotiation process.\n“The budget process is a glacial eight to nine month process from the fall to the spring and labor negotiations are being undertaken in real time all the time,” Detjen said.\nBut Jansen insists a hard line is the right policy for Greenwich.\n“The BOC hopes to see future contracts reflect our current economic reality,” Jansen said. “Our governor in our own state is aligning with the budget message with the labor contracts. They’re inextricably tied. To say that there is no connection between labor contracts and budget is simply not in economic reality.”\nThe RTM voted with 179 in favor and 14 opposed, with three abstentions, to indefinitely postpone consideration of the Teamsters contract Tuesday. By taking no action, the contract goes automatically into effect. Teamsters Local 456 represents 389 full-time and 93 part-time employees working for the school district and town departments.\nOn Wednesday RTM Moderator Tom Byrne said the RTM is well served by any committee doing in-depth reviews of an item brought before it.\n“BOC is a special committee charged with identifying the specific areas it believes it should concentrate on,” Byrne said. “The focus of the committee changes from term to term. If any particular incarnation of the BOC wants to look at a labor contract, it has the right to do so. The Labor Contracts Committee does excellent work coordinating with the town’s director of labor relations and informing the RTM of developments in the collective bargaining process. The system works well.”\nkborsuk@greenwichtime.com", "url": "https://apnews.com/13d1656aeb6446d8bc23842082dbbc67"}