{"authors": ["Jeff Mayes Staff Writer"], "date_download": "2020-05-04 20:28:51", "date_modify": "2020-05-04 20:28:51", "date_publish": "2018-12-05 23:01:53", "description": "La PORTE – Haley Harkness admits she flipped a coin to decide where to attend high school. And she got it right. After finishing eighth grade at Chesterton Middle School, she said, it was...", "filename": "_f5a139e93bb84d148f2887d49cae58ac_1588624131.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f5a139e93bb84d148f2887d49cae58ac_1588624131.html", "title": "Coin flip came up big", "title_page": "Coin flip came up big", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "La PORTE – Haley Harkness admits she flipped a coin to decide where to attend high school. And she got it right.\nAfter finishing eighth grade at Chesterton Middle School, she said, it was between Chesterton High School and La Lumiere School.\n“My dad knew about La Lumiere so I checked it out,” said Harkness, now a senior at the private school north of La Porte. “I came here and it felt like home. I’m glad it worked out the way it did.”\nShe has thrived at La Lumiere and is a semifinalist for the 2019 class of the Coca-Cola Scholars Program, which would include a $20,000 scholarship.\n“I was looking online for ways to find money for college, and I thought, $20,000 for a couple of hours filling out an application was worth the time,” Harkness said.\nThe program is one way Coca-Cola is “giving back to the communities we serve,” Jane Hale Hopkins, president-elect of the Coca-Cola Scholars Foundation said.\n“We believe that identifying these young leaders throughout the country and encouraging their passion for serving others not only empowers the students, but also lifts up those around them.”\nWhen Harkness found out she was a semifinalist, she tried to keep it a secret.\n“I did some research and found it was a pretty big deal. But I didn’t even tell my parents,” she said. “I was hoping I could surprise them by saying I won a lot of money for college.”\nHowever, word got out through the school and local media, giving away the secret, but making her parents very proud.\nIt was never a secret that Harkness was talented academically.\n“I always tried to be at the top of my class,” she said of her early school years. “I’ve always liked science. It was my best subject, and biology and chemistry were always my favorite classes.”\nAt La Lumiere, she’s put her love of science to good use, working as an intern on the QuarkNet Project at the University of Notre Dame last summer.\nShe found the project, which dealt with upgrading optical detector components for one of the two primary detectors in the Large Hadron Collider at the CERN laboratory in Switzerland, fulfilling.\nWhile she said she’s “not particularly interested in particle physics,” taking part in the project “solidified my decision to go into the sciences. I got to work with a real professor [ND’s Randy Ruchti] doing real work.”\nShe plans to study medicine and become an MD, but said she wouldn’t mind doing more research in the area on the side. She’s applied – or plans to – at Notre Dame, Yale, Vanderbilt, Boston College, Emory and Indiana University.\n“I’m 18 so my decisions are all pretty fickle at this point,” she said. “I’m all over the place and really have no idea what I will be doing in the future.”\nFor now, she’s one of the busiest teenagers around.\nHarkness has earned multiple medals as part of La Lumiere’s Science Olympiad team, and was the recipient of La Lumiere’s Excellence in 21st Century Math and Science Award, and the Traute and Miller Bransfield Award for the 2017-2018 school year. She also took first place for her speech in the school’s Poetry Out Loud and Speech Competition last spring.\nShe’s in her second term as the Admissions Prefect for the school, which means she spends a lot of time working with the Admissions Department on things like open houses, campus tours, student visits and even in-home visits with prospective students and their parents.\nShe also serves on the Prefect Board, which La Lumiere spokeswoman Devon Carlson said makes Harkness “a leader and voice for the student body.”\nAnd she plays on the Lakers soccer and tennis teams, after being a part of the crew team as an underclassmen.\n“I’m pretty good at tennis, but pretty bad at soccer,” she said, adding there is absolutely no chance of an athletic scholarship.\nSo where does she find the time for all this – and still try to do the things a normal teenager would.\n“I just don’t really sleep that much,” Harkness says with a grin. “But I still do a lot of things outside of school. My weekends are generally open so I can babysit – I love to babysit – and go out with my friends and family to movies and things.\n“You have to make time,” she said, “and don’t sleep as much.”\nShe may be losing a little more sleep, too.\nAs one of about 1,900 semifinalists chosen in the Coca-Cola Scholars competition – from among 95,715 entries – she has some work to do to make the final cut of 150 scholarship winners.\nSemifinalists must complete Phase 2 applications, which include essays, recommendations and transcripts, Hopkins explained. A selection committee reviews applications and selects 250 Regional Finalists in January to participate in online or in-person interviews. Winners are named in March and go to Atlanta in April for a celebratory banquet and Leadership Development Institute.\nIn the meantime, Harkness will just enjoy her final year at La Lumiere, which has become a special place for her and two younger siblings who now attend.\nShe thinks classes are “tougher” than she would’ve had at Chesterton, but that’s fine with her.\n“I talk to my CHS friends and they might be having a leisurely afternoon, while I have hours of homework, as well as after-school activities and meetings. It’s definitely challenging.”\nAnd more like a college atmosphere, she said.\n“You find every type of student here, and the big thing is, they are more involved than at other schools. Everyone has a niche, and people show up for things. They are willing to help with projects; they show up to cheer on the sports teams; they show up for student visits.\n“It’s just an amazing experience,” she said. “I can’t imagine being anywhere else.”", "url": "https://apnews.com/f5a139e93bb84d148f2887d49cae58ac"}