{"authors": [], "date_download": "2020-05-04 20:14:40", "date_modify": "2020-05-04 20:14:40", "date_publish": "2018-06-01 17:54:20", "description": "Our constitutions are often designed to protect those without a political voice. There isn’t much need for freedom of religion for Catholics in Boston. There isn’t much need for freedom of speech...", "filename": "_bb1c41a852b24c9ca2c3ca19f5c42221_1588623280.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bb1c41a852b24c9ca2c3ca19f5c42221_1588623280.html", "title": "Educating ourselves on our Constitutional rights", "title_page": "Educating ourselves on our Constitutional rights", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Our constitutions are often designed to protect those without a political voice. There isn’t much need for freedom of religion for Catholics in Boston. There isn’t much need for freedom of speech if you are speaking to the like-minded. A well-designed constitution takes into account the fluctuations of political power and the tides of the majority. And who is more vulnerable than children?\nWouldn’t it be nice if there was a constitutional right for free public education for all children? Well, if you live in Utah, you are in luck. The Open Education Clause or Article X, Section 1 of the Utah Constitution reads: “The Legislature shall provide for the establishment and maintenance of the state’s education systems including: (a) a public education system, which shall be open to all children of the state; and (b) a higher education system. Both systems shall be free from sectarian control.”\nThis provision of the Utah Constitution illustrates how the citizenry actually has more constitutional protection under a state constitution. A state can always offer more constitutional rights than the federal constitution, but it can’t offer less. So all the children in Utah have a constitutional right to a public education system, free of religious control. If you are wondering why the “free from sectarian control” is in our constitution, it is part of history. Congress made it a requirement of Utah’s Constitution in order for statehood to be granted. Apparently there was some concern back then about the predominant religious culture controlling the school system.\nBut what does it mean that our children have the right to a public education system that is “open to all children”? Especially when general fees for just one year at my son’s high school is a minimum of $150.00. Is the system open to children who don’t have $150? In my daily legal practice, I’ve encountered hard-working families with three children of school age who make less than $40,000.00 per year. There is nowhere in that family budget for $450.00 in school fees.\nWe need to understand that this is a debate not about how our schools should be funded. This is a discussion about how we protect the constitutional rights of our children to an open public education system.\nThe constitutional crisis becomes more apparent when you look at what happened to school fees from 2012 to 2017. The total fees collected from students in 2017 was $79 million or about $121 per student. The total fees collected in 2012 was $63 million at about $100.00 per student.\nBut what about inflation? Wouldn’t that account for the increase? Nope. To get a better grasp on school fees versus inflation, you would need to go back to 1994 and then see how school fees fared compared to inflation. Some student fees increased five times the rate of inflation over that twenty three year period.\nI am getting all of these numbers from a largely unreported audit of the Utah school fee system that was prepared by the Utah State Board of Education (“Board”) and published on April 12th of this year. As bad as the numbers are, the findings of the audit should have been big news. Basically the Board fessed up to violating our low-income children’s constitutional right to open education: “Based on our findings, we believe there is a high level of non-compliance with current school fee and fee waiver policy resulting in an unreasonable system of fees, which jeopardizes equal opportunity for all students by limiting access to school programs, both curricular and extracurricular, based on a student’s ability to pay.”\nThis isn’t the first time our public school system has gotten in trouble with student fees. Back in 1992, eighteen students sued various school districts and won a permanent injunction that dictated how school districts needed to behave to properly comply with Utah law and the Utah Constitution. One thing about permanent injunctions, they are permanent and the court order is still in place. The 2017 audit tells the Board to “consider employing remedies and sanctions as outlined in the Permanent Injunction.” Twenty-five years later, the Board is now looking to enforce a long existing court order on non-compliant schools and districts.\nToo often we let our constitutional rights be trampled out of ignorance. Like our children, we need to be educated. Our schools should not be a place where economic burdens of participation are heaped upon the most vulnerable families of our society. We live in a state where our children have a constitutional right to be free from that pressure, so they can keep their focus on their education, where it belongs.", "url": "https://apnews.com/bb1c41a852b24c9ca2c3ca19f5c42221"}