{"authors": ["Ted Kulfan", "The Detroit News"], "date_download": "2020-05-04 21:09:02", "date_modify": "2020-05-04 21:09:02", "date_publish": "2018-01-26 21:12:00", "description": "Detroit — You hear it so often these days, players shying away from participating in their sport's All-Star game. They prefer to have the time off to themselves and recharge for the rest of...", "filename": "_fdbba554b8cc4b77a4f7a9d82f8f160a_1588626542.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fdbba554b8cc4b77a4f7a9d82f8f160a_1588626542.html", "title": "Unsure fate won't take glitz off Green's All-Star day", "title_page": "Unsure fate won't take glitz off Green's All-Star day", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Detroit — You hear it so often these days, players shying away from participating in their sport’s All-Star game.\nThey prefer to have the time off to themselves and recharge for the rest of the season, rather than play in the exhibition game.\nTalk to Mike Green, though, and you get a totally different viewpoint.\nThe Red Wings’ lone representative to Sunday’s NHL All-Star Game can’t wait to get down there.\nSure, the weather helps. But so does the fact he expects a fun weekend, mingling with the best of the NHL.\n“I’m just going down there and enjoy myself with my family,” Green said. “Just take it all in. The whole experience will be fun.\n″(It’s fun) getting to see some familiar faces and getting know guys personally. Obviously, we see each other pretty frequently during the season, it’ll be good to put some personalities to the faces.”\nFor Green, 32, this will be his second All-Star game. He made it in 2011 as a member of the Washington Capitals.\nThis will be the first All-Star game, though, Green brings along his 2-year-old son, Axel.\n“He’s starting to get it,” said Green, of Axel’s realization dad is a pro hockey player. “He enjoys being around the rink now. We’ll bring him down and have some fun.”\nEnjoyment is also what Green expects to get from the actual game, which for the third time is a 3-on-3 format between the four divisions.\nThe two winning teams face each other in the championship.\nGenerally speaking, fans and players alike enjoy the format, with its wide-open play and room for highlight reel plays.\n“It’s exciting, obviously it’s exciting during the year with how the games pan out,” said Green of the 3-on-3 format. “It will make for a fun game.\n“As a player it’s (the format) fun, the 3-on-3. As a fan, it’s exciting. It creates more opportunity. Actually, it creates more defense, to be honest, because you’ve got to be kind of aware of where you’re at (defensively).”\nOnce Sunday’s game is over it’s back to the business at hand — and increasing rumors about Green’s future.\nA potential unrestricted free agent, Green will almost certainly be shipped by the Feb. 26 trade deadline.\nGreen has appeared in all 48 games this season with 26 points (5 goals, 21 assists) and a minus-5 plus-minus rating.\nHalf of his point-total (13) has come on the power play (1 goal, 12 assists), where is value mostly is, along with his mobility and right-hand shot.\nOn a contending team, Green would provide nice insurance with his attributes.\nBut Green does wield some say in this matter.\nHe has a modified no-trade clause in his contract so Green can squash to a deal to a team he doesn’t want to go to.\nGreen insists he isn’t thinking about the trade deadline.\n“A lot can go on and obviously there’s potential for it,” Green said. “But as of right now, I’m focused on the day-to-day here.\n“Everything is speculation until something happens.”\nThere are several teams who could use depth defensively.\nWashington, where Green spent the first 10 seasons of his career, has been linked to the defensman, and be a destination he’d likely accept.\nTampa Bay has been hit with injuries on defense, and would appear to need a bit of veteran depth. Pittsburgh, Toronto, Vegas (where Green’s Washington general manager George McPhee now manages), and Colorado are other teams that could have a need.\n“Guys, I can’t give you an answer to that, as I said I haven’t even thought (about it),” said Green of a potential trade. “I don’t want to give you a half answer.”\nThere has been speculation the Red Wings would entertain the idea of bringing back Green on July 1, when free agency begins.\nGreen is the team’s leading scorer among defensemen, and has been the lone offensive threat for much of his three seasons here.\nBut how the roster looks at that point, who is running the team, and what Green’s situation is at that juncture, are all parts to the equation.\nGreen hasn’t hid his feeling about playing in the Red Wings organization.\n“I do love it here,” Green said. “This organization is great, and they’ve been very good to me. Like I said, I haven’t read too much into it (trade speculation) and I haven’t thought too much about it until it presents itself.”\nNHL All-Star Game\nFaceoff: 3:30, Sunday, Amalie Arena, Tampa, Fla\nTV: NBC, Channel 4.\nNotable: All four divisions will be represented with two semi-final games, then the championship, all games in the 3-on-3 format...The skills competition is Saturday at 7 p.m. (NBC Sports Network).\nted.kulfan@detroitnews.com\ntwitter.com/tkulfan", "url": "https://apnews.com/fdbba554b8cc4b77a4f7a9d82f8f160a"}