{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:06:03", "date_modify": "2020-05-04 20:06:03", "date_publish": "2018-04-27 10:00:00", "description": "La PORTE — Three concert choirs from La Porte High School recently participated in the organizational contest sponsored by the Indiana State School Music Association April 19 at Concord High...", "filename": "_5bc720d996ae4654b8860b561481789d_1588622763.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5bc720d996ae4654b8860b561481789d_1588622763.html", "title": "3 LPHS choirs receive honors at competition", "title_page": "3 LPHS choirs receive honors at competition", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "La PORTE — Three concert choirs from La Porte High School recently participated in the organizational contest sponsored by the Indiana State School Music Association April 19 at Concord High School.\nChoirs may enter in one of five different levels: Group V being the most novice and Group I, the most advanced. Every performing group is heard by a panel of three judges who give scores in several categories including Intonation, Note and Rhythmic Accuracy, Dynamics, Enunciation, Musicality and Stage Presence.\nThe Beginning/Intermediate Women’s Choir performed in Group III, singing three selections: “What a Wonderful World,” “In Time of Silver Rain,” and “Make a Joyful Noise Unto the Lord.” All three of the performance judges rated this choir in the superior or “Gold” range.\nThe Treble Chorale performed in Group I and was the only Group I women’s choir at this particular contest site. They sang Handel’s “Awake the Trumpet’s Lofty Sound,” “Nuit d’etoiles” by Debussy (in French), and “Ergen Deda” (in Bulgarian). This choir also earned three “Gold” ratings from their performance judges. Two of the scores were as high as possible in every category for a perfect score.\nThe Mixed Chorale performed in Group I, receiving accolades for their artistic performance. They sang Sicut Cervus by Palestrina (in Latin), All Too Soon by Hatfield, and Tres Cantos Nativos Dos Indios Kráo by Leite (in Portuguese). The Chorale also received three “Gold” ratings as well as excellent compliments from all three judges.\nFollowing each performance, the choirs go to a different room to sight read musical excerpts for a fourth judge. Each choir has to read one rhythmic exercise, one unison melodic exercise, and one two, three, or four-part harmonic exercise with only a brief time to look at the music before they perform it. All three ensembles received a “Gold” rating from their sight reading judge, missing only a few half-points from their total score.\nWhen all the scores are combined, the overall rating is determined. All three of the La Porte choirs received “Gold” ratings and “Gold” plaques with a special label marked “With Distinction,” indicating a combined score that is no more than six points away from a perfect score.\nParticipants in the Beginning/Intermediate Women’s Choir are Alexus Allen, Shelby Attar, Lyndsey Bartholomew, Jasmine Bukowski, Zyanya Camacho, Skye Castaneda, Roseva Cheeks, Cali Colwell, Olivia Combs, Chloe Comeno-Rosenbaum, Katrina Cooper, Mickayla Danielson, Delaney Dunfee, Jaelyn Gaunt, Brianna Graffis, Brooklynn Grott, Lilly Haverstock, DeMira Hunter, Lily Koehler, Stephanie Komasinski, Claira Kuta, Marissa Lingle, Madeline Martino, Paige Maudlin, Roziland McCoy, Nevaeh Mendoza, Madison Micallef, Brittany Miller, Eliana Muñoz, Makana Paulson, Gabrielle Payne, Kristyn Principe, Tori Satchwell, Amari Seymour, Asia Seymour, Cheyanne Seymour, Ava Sinclair, Madison Smelser, Alyssa Stacy, Natalie Thiem, Angel Thomas, Bethany Thomas, Sammantha Thomas, Brianna Thorp, and Holly Trieu.\nTreble Chorale’s members are Salem Bahar, Payton Berg, Sierra Blaney, Jessica Campbell, Kristen Cole, Nicole Collins, Hailey Elkins, Jessica Gamez, Jaylin Gilmore, Alexus Hine-Holzapfel, Jennifer Hixon, Olivia Huff, Alexandra Leal, Lianna Lewis, Yazmin Lopez, Faith McAlister, Madison Mulzon, PuaLani Naue, Payton Neely, Kamryn Perz, Saraidee Reyes-Villa, Jennika Schoff, Olivia Strieter, Rebecca Wawok, Stephanie Wuthrich, Miranda Yon, and Sandra Young.\nMixed Chorale consists of 30 members: Reid Bello, Jack Boardman, Austin Buda, Vivianne Cartagena, Jocelynn Coleman, Jeromie Forystek, Sophia Gardner-Orbovich, Bethany Gunter, Casey Gunter, Brandon Gurrola, Joslyn Holt, Anthony Hughes, Keith Keehn, Erica Lynch, Emily Miramontes, Elisabeth Novak, Jayme Osowski, Nikki Parsons, Rachel Porter, Shania Povlock, RJ Pray, Hattie Rudnick, Brenton Ruskowsky, Wyatt Stacy, Geovanny Tapia, Linda Tharpe, Julie-Ann Thiem, Natalie Tuholski, Akash Vyas, Danielle Walsh\nThese three groups are under the direction of Thomas Coe and are accompanied on the piano by Jane DeVries. Local audiences can hear some of the choirs’ contest performance selections on their upcoming Spring Choral Concert in the LaPorte High School Main Gymnasium on Wednesday, May 9 at 7 p.m.", "url": "https://apnews.com/5bc720d996ae4654b8860b561481789d"}