{"authors": ["Amanda Burke", "Aburke Sentinelandenterprise.Com"], "date_download": "2020-05-04 20:18:52", "date_modify": "2020-05-04 20:18:52", "date_publish": "2018-09-28 10:33:35", "description": "FITCHBURG -- The city has issued a request for proposals for a feasibility study that will develop potential designs and related costs associated with either building an addition, renovating the...", "filename": "_0209dbffaa874aa8b2a6140a9d106dde_1588623532.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0209dbffaa874aa8b2a6140a9d106dde_1588623532.html", "title": "Crocker School Solution Could Cost $50M-$60M", "title_page": "Crocker School Solution Could Cost $50M-$60M", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FITCHBURG -- The city has issued a request for proposals for a feasibility study that will develop potential designs and related costs associated with either building an addition, renovating the existing, or constructing an entirely new building at Crocker Elementary School.\nColliers International has been hired to manage the project at Crocker school, said Assistant Superintendent of Finance and Operations Robert Jokela. It’s the same company performing a similar service for the City Hall renovation project.\nAccording to the request for proposals, which closes on Oct. 24, the estimated total cost of the project could be between $50,000,000 and $60,000,000.\nThe Massachusetts School Building Authority has agreed to reimburse the city for 80 percent of eligible costs related to the feasibility study and construction, according to Jokela.\nOn Oct. 3, interested designers will take a walk through Crocker Elementary School before compiling bids, he said.\nAccording to Jokela, on Feb. 6 the City Council signed off on a $1 million loan order to finance the feasibility study and project management services from Colliers International.\nThe MSBA is expected to reimburse the city for the feasibility study and project management services in the amount of $800,000, he said.\nIn other school building needs, the City Council as a Whole is set to take up an additional appropriation of $400,000 for Fitchburg Public Schools at its Tuesday, Oct. 9 meeting.\nThe appropriation is required in order for the city to meet its net school spending requirement under the state’s Chapter 70 funding formula.\nWhile the School Committee will ultimately vote on how the district will use the funds, Jokela said he will recommend the bulk of it go toward school building needs.\nHis recommendation will be to spend about $250,000 of the net school spending money on mold remediation at Fitchburg High School, which like school buildings in other districts experienced an outbreak over the summer after a string of humid days.\nJokela will propose spending another $50,000 of the net school spending money paying the deductible on an insurance claim related to cleaning up after a fire broke out in fish tank in a science room at the high school.\nThe School Committee may vote to pledge the remaining $100,000 to social-emotional programming and student needs, he said.\nBut Jokela said a chance remains that the entire appropriation could be put toward building needs.", "url": "https://apnews.com/0209dbffaa874aa8b2a6140a9d106dde"}