{"authors": ["E.J. Dionne"], "date_download": "2020-05-04 20:07:16", "date_modify": "2020-05-04 20:07:16", "date_publish": "2018-01-17 06:00:00", "description": "WASHINGTON -- Political leaders in democracies have a few core obligations. They are charged with solving today's problems and preparing their nations for the future. They are responsible for...", "filename": "_305cce28d3b947b0aeb10e94a8b7ae44_1588622836.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_305cce28d3b947b0aeb10e94a8b7ae44_1588622836.html", "title": "E.J. DIONNE, JR.: Will Trump exhaust our democratic capacities?", "title_page": "E.J. DIONNE, JR.: Will Trump exhaust our democratic capacities?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WASHINGTON -- Political leaders in democracies have a few core obligations. They are charged with solving today’s problems and preparing their nations for the future. They are responsible for creating some sense of shared purpose and mutual respect among their citizens -- above all a common commitment to preserving the very freedoms on which democracy depends.\nWithin this context, citizens exercise their right to argue about how to define the public interest, how to identify the central problems, and how to choose among competing values.\nGiven my social democratic leanings I would assert, for example, that equal opportunity -- including the opportunity to participate fully in self-government -- demands a far greater degree of economic security and equality than we currently enjoy. This is particularly true when it comes to access to health care, education, family time away from paid labor, and the chance to accumulate wealth.\nYou might push back and say that my proposals toward these ends impinge more than they should on individual freedom and require higher levels of taxation than you are willing to put up with. Or you might insist that I am focusing too much on economics and that promoting better personal values society-wide is more conducive to the nation’s well-being than any of my programs for greater equity.\nAnd, yes, we might quarrel about who has a right to join our political community and become part of our nation. We should not pretend that our current battles about immigration are unique to our time. In the United States, we have been wrangling over immigration since at least the 1840s. I suspect (and may God preserve our republic) we will be having at least some contention around this subject in the 2140s as well.\nSuch debates can be bitter, but democracy’s health depends on our ability to hold our passions against each other in check and to offer each other at least some benefits of the doubt.\nAs the political scientists Steven Levitsky and Daniel Ziblatt emphasize in their timely new book, “How Democracies Die,” democracy requires “mutual toleration,” which is “the understanding that competing parties accept one another as legitimate rivals,” and “forbearance,” which means that politicians “exercise restraint in deploying their institutional prerogatives.”\nWhich, alas, brings us yet again to President Trump, who (no matter how much we want to) cannot be avoided at this moment because he threatens the conditions under which democracy can flourish.\nOur current debate is frustrating and not only because Trump doesn’t understand what “mutual toleration” and “forbearance” even mean. By persistently making himself, his personality, his needs, his prejudices and his stability the central topics of our political conversation, Trump is blocking the public conversation we ought to be having about how to move forward.\nAnd while Trump’s enablers in the Republican Party will do all they can to avoid the issue, there should now be no doubt (even if this was clear long ago) that we have a blatant racist as our president. His reference to immigrants from “s---hole countries” and his expressed preference for Norwegians over Haitians, Salvadorans and new arrivals from Africa make this abundantly clear. Racist leaders do not help us reach mutual toleration. His semi-denial 15 hours after his comment was first reported lacked credibility, especially since he called around first to see how his original words would play with his base.\nBut notice also what Trump’s outburst did to our capacity to govern ourselves and make progress. Democrats and Republicans sympathetic to the plight of the Dreamers worked out an immigration compromise designed carefully to give Trump what he had said he needed.\nThere were many concessions by Democrats on border security, “chain migration” based on family re-unification, and the diversity visa lottery that Trump had criticized. GOP senators such as Lindsey Graham, R-S.C., and Jeff Flake, R-Ariz., bargained in good faith and were given ample reason by Trump to think they had hit his sweet spot.\nTrump blew them away with a torrent of bigotry. In the process, he shifted the onus for avoiding a government shutdown squarely on his own shoulders and those of Republican leaders who were shamefully slow in condemning the president’s racism.\nThere are so many issues both more important and more interesting than the psyche of a deeply damaged man. We are capable of being a far better nation. But we need leaders who call us to our obligations to each other as free citizens. Instead, we have a president who knows only how to foster division and hatred.", "url": "https://apnews.com/305cce28d3b947b0aeb10e94a8b7ae44"}