{"authors": ["Jerry Guenther Regional Norfolkdailynews.Com"], "date_download": "2020-05-04 20:08:04", "date_modify": "2020-05-04 20:08:04", "date_publish": "2018-11-15 14:53:00", "description": "MADISON — Two areas in the western part of Madison County will be the first to be studied for their suitability for possible wind farms. Following a pair of public hearings Wednesday, the...", "filename": "_b9559676d14c43dc8291fd2506f87cd2_1588622884.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b9559676d14c43dc8291fd2506f87cd2_1588622884.html", "title": "County gives approval to test towers to collect wind speeds", "title_page": "County gives approval to test towers to collect wind speeds", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MADISON — Two areas in the western part of Madison County will be the first to be studied for their suitability for possible wind farms.\nFollowing a pair of public hearings Wednesday, the Madison County board of commissioners approved two conditional-use permit applications sought by Invenergy Wind Development of Denver.\nOne is for a temporary meteorological tower on land about eight miles north of Newman Grove at the intersection of 832nd Road and 526th Avenue.\nThe second temporary tower will be located on land 10 miles south of Meadow Grove on 540th Avenue.\nHeather McWhorter, the county’s zoning administrator, said both towers will be less than 200 feet tall and will measure wind speed to determine the feasibility of wind farms in the area.\nBoth “met towers” as they are called, will not require any foundations, power or lighting. Each will be secured by four sets of guy wires and constructed by a two- to four-person crew in coordination with the landowners, McWhorter said.\nInvenergy already has secured lease and easement agreements with each of the landowners, she said.\nThree letters of opposition were expressed for the wind tower at the intersection of 832nd Road and 526th Avenue when it was earlier considered by the joint planning commission.\nJosh Framel, senior manager of renewable development for Invenergy, said the towers are temporary in nature. He said it usually takes at least two years worth of data to know whether winds are sufficient for a wind farm. The met towers measure wind speed, direction, temperature and have instruments to record them at a couple of levels, he said.\nInvenergy built and operates both Prairie Breeze projects west of Madison County and recently finished construction of the Upstream Wind Farm, north of Neligh.\nFramel said there is a lot of demand for wind energy in Nebraska and there are good markets for it.\nAs a result, a company sometimes will seek to build four or five met towers, depending on the topography of the land. He said there is no exact science to how far out the towers can measure suitability for wind turbines, but the more miles out from the met towers, the less reliable they are.\nWithin three miles of the met tower, they are considered accurate, but sometimes will be used for up to 15 miles — with less accuracy, Framel said.\nPaul Kreikemeier of rural Battle Creek said he favors the met towers because it is necessary to find out if the county is suitable for wind farms. It also is important to diversify energy sources, he said.\nKreikemeier said some people don’t like the aesthetics of wind farms, but years ago there were windmills located in each quarter section of land. In addition, there were tall silos that many people did not think looked good, “but people lived through it,” he said.\n“I’m in favor of putting up these two towers to see if it is feasible,” Kreikemeier said.\nThis isn’t the first time Madison County approved met towers. A little more than 10 years ago, the county approved two conditional-use permits for met towers requested by Third Planet Wind Power of Bad Axe, Mich.\nThose met towers were located between Battle Creek and Norfolk and in the Meadow Grove area. The information collected is considered proprietary, so it isn’t known what information they yielded. No permits for wind farms were ever sought.", "url": "https://apnews.com/b9559676d14c43dc8291fd2506f87cd2"}