{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Benjamin Y. Fong", "Matt Bruenig"], "date_download": "2020-05-04 19:58:47", "date_modify": "2020-05-04 19:58:47", "date_publish": "2018-12-28 00:00:00", "description": null, "filename": "2018_12_hygge-holidays-design-denmark-social-democracy-solidarity_1588622327.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/12/28091557/relaxing-1979674_1920-e1546006621290.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_12_hygge-holidays-design-denmark-social-democracy-solidarity_1588622327.html", "title": "You Don’t Want Hygge. You Want Social Democracy.", "title_page": "You Don’t Want Hygge. You Want Social Democracy.", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIt’s the holidays, and you long to be cozy. You want to curl up in a plush armchair next to a crackling fire. You want the softest of blankets and wooliest of sweaters. You want to devour grandma’s pecan fudge, get tipsy on eggnog with your cousins, and watch Miracle on 34th Street — mom’s favorite — for the thirty-fourth time. Or maybe neither Christmas nor family gatherings are your thing, but you like the idea of sipping hot toddies and playing board games with a few close friends while outside the snow falls and the lights twinkle. But you can’t have it, because you couldn’t spring for a plane ticket. Or relatives are in town, but times are tight, and it seemed irresponsible to pass up the Christmas overtime pay. Maybe everything circumstantially fell into place, but you can’t relax. You’re eyeing your inbox, anxious about the work that’s not getting done. You’re last-minute shopping, pinching pennies, thinking Scrooge had some fair points. Or you’re hiding in your childhood bedroom, binge-watching television and scrolling social media, because a rare break from the pressures of daily life feels more like an occasion to zone out than to celebrate and be merry. Either way, you feel terrible, because you know that someone somewhere is literally roasting chestnuts on an open fire, and you’re missing out. The Danes have a word for the thing you desperately want but can’t seem to manifest: hygge. The word isn’t easy to translate. It comes from a Norwegian word that means “wellbeing,” but the contemporary Danish definition is more expansive than that. In The Little Book of Hygge: Danish Secrets to Happy Living, author Meik Wiking writes, “Hygge is about an atmosphere and an experience, rather than about things. It’s about being with the people we love. A feeling of home. A feeling that we are safe, that we are shielded from the world and allowed to let our guard down.” You can have hygge any time, but Danes strongly associate it with Christmas, the most hyggelig time of the year. When asked what things they associate most with hygge, Danes answered, in order of importance: hot drinks, candles, fireplaces, Christmas, board games, music, holiday, sweets and cake, cooking, and books. Seven out of ten Danes say hygge is best experienced at home, and they even have a word for it — hjemmehygge, or home hygge. But Wiking stresses that while hygge has strong aesthetic properties, it’s more than the sum of its parts. You don’t just see it, you feel it. “Hygge is an indication that you trust the ones you are with and where you are,” he writes, “that you have expanded your comfort zone to include other people and you feel you can be completely yourself around other people.” The opposite of hygge is alienation. It’s no coincidence that this concept is both native to and universally understood in the same country that consistently dominates the World Happiness Report and other annual surveys of general contentment. On rare occasions when Denmark is surpassed by another country, that country is always a Scandinavian neighbor. What makes people in these countries happier than the rest of us is actually really simple. Danes and their neighbors have greater access to the building blocks of happiness: time, company, and security. Scandinavians don’t have these things just because they value them more, or for cultural reasons that are congenital, irreplicable, and beyond our reach. People all over the world value time, company, and security. What Scandinavians do have is a political-economic arrangement that better facilitates the regular expression of those values. That arrangement is social democracy.\nThe Politics of Hygge Denmark is not a socialist country , though like its neighbor Sweden, it did come close to collectivizing industry in the 1970s. That effort was driven by “unions, popular movements, and left parties,” write Andreas Møller Mulvad and Rune Møller Stahl in Jacobin . “It was these mass forces — not benevolent elites, carefully weighing the alternatives before deciding on an enlightened mix of capitalism and socialism — who were the architects and impetus behind the Nordic model. They are the ones responsible for making the Nordic countries among the happiest and most democratic in the world.” A strong capitalist offensive stopped this Scandinavian coalition from realizing the transition to socialism, and the legacy of their efforts is a delicate compromise. The private sector persists, but taxes are both progressive and high across the board. The country spends 55 percent of its total GDP publicly, making it the third-highest government spender per capita in the world. Meanwhile, the power of employers is partially checked by strong unions, to which two-thirds of Danes belong. This redistributive arrangement significantly reduces the class stratification that comes from capitalism. As a result, Denmark has one of the highest degrees of economic equality in the world. All of that public spending goes to funding a strong welfare state. Everybody pays in, and everybody reaps the rewards. This egalitarian, humane, and solidaristic model allows the values associated with hygge to flourish. It also gives people more opportunities to act on them. In Denmark, health care is free at the point of service. Same goes for education, all the way through college and even grad school. Twenty percent of the Danish housing stock is social housing, regulated and financially supported by the state but owned in common by tenants, and organized in the “tradition of tenants’ participation and self-governance.” Denmark offers year-long paid parental leave, and guarantees universal child care for all children beginning the moment that leave ends, when the child is one year old. Similarly, due in large part to the past and and present strength of unions, Denmark has worker-friendly labor laws and standards which make for a more harmonious work-life balance. Danes get five weeks’ paid vacation, plus an additional nine public holidays. Unlike the United States, Denmark has a national paid sick-leave policy. Denmark also has generous unemployment benefits and a wage subsidy program for people who want to work but, for reasons outside their control, need more flexible arrangements. The normal work week in Denmark is set at thirty-seven hours, and people tend to stick to it. Only 2 percent of Danes report working very long hours. In a survey of OECD countries Denmark ranked fourth for people spending the most time devoted to leisure and personal care. (The US ranked thirtieth.) All of this has a profound effect on individuals’ ability to experience pleasure, trust, comfort, intimacy, peace of mind — and of course, the composite of these things, hygge. For one thing, there are only so many hours in a day. And there are some activities that make us happy, and some that make us unhappy. The Princeton Affect and Time Survey found that the activities that make us happiest include playing with children, listening to music, being outdoors, going to parties, exercising, hanging out with friends, and spending time with pets. (These are also the activities that Danes associate with hygge.) The ones that make us least happy include paid work, domestic work, home maintenance and repairs, running errands, personal medical care, and taking care of financial responsibilities. Everyone has to do activities in the unhappy category in order to keep their affairs in order. But it makes sense that if you take some of those responsibilities off people’s plate and design the economy to give them more time to do activities in the happy category, they will be more content and lead more enriching lives. Many working-class Americans don’t have much time for activities in the happy category, because they work multiple jobs or long hours and also have to keep a household in order without much assistance. Many more are afraid that if they take time away from their stressful responsibilities, they will overlook something important and fall behind, and there will be no social safety net to catch them — a pervasive anxiety that creeps up the class hierarchy. This breeds alienation, not intimacy. Additionally, working people in highly capitalist countries, where economic life is characterized by cutthroat competition and the punishment for losing the competition is destitution, tend to develop hostile relationships to one another, which is not very hyggelig. The social-democratic model is predicated instead on solidarity: my neighbor and I both pay taxes so that we can both have a high standard of living. We care for each other on the promise that we will each be cared for. By working together instead of against each other, we both get what we need. Universal social programs like those that make up the Scandinavian welfare states are thus engines of solidarity , impressing upon people that their neighbor is not an opponent or an obstacle, but a partner in building and maintaining society. By pitting people against each other, neoliberal capitalism promotes suspicion and animosity. This frequently maps onto social divisions and manifests as racism, sexism, xenophobia, and so on. But it also just makes people guarded and antisocial in general. People who live in social democracies are far from invulnerable to prejudice or misanthropy, but the social compact remains more likely to promote kindness, trust, and goodwill among people than neoliberal capitalism — and indeed the Danes are some of the most trusting people in the world, of friends and strangers alike. One of these political-economic arrangements strengthens people’s connection to the fundamentals of happiness, and of hygge — time, company, and security — while the other severs it. The abundance or scarcity of these fundamentals forms the material basis of collective social life.", "url": "https://www.jacobinmag.com/2018/12/hygge-holidays-design-denmark-social-democracy-solidarity"}