{"authors": ["Editorial Board"], "date_download": "2020-05-04 20:24:57", "date_modify": "2020-05-04 20:24:57", "date_publish": "2018-05-22 09:58:02", "description": "A healthier food stamp program should be on the menu: editorial Trying to push more people to work for food stamps by adding harsh provisions to the farm bill has sharply divided Congress,...", "filename": "_48e0578cccf04862bbcf635574e408c6_1588623897.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_48e0578cccf04862bbcf635574e408c6_1588623897.html", "title": "A healthier food stamp program should be on the menu: editorial", "title_page": "A healthier food stamp program should be on the menu: editorial", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A healthier food stamp program should be on the menu: editorial\nTrying to push more people to work for food stamps by adding harsh provisions to the farm bill has sharply divided Congress, even though the high-stakes bill failed to pass the U.S. House Friday, mostly over unrelated issues.\nCongress can take the food stamp work-requirement dispute off the table entirely. Instead of punitive, ill-considered measures likely to hurt hungry children, Congress should instead take aim at the unhealthy foods that are contributing to the obesity epidemic among our young people.\nAdding clear nutrition standards to the food stamp program, known as SNAP, for Supplemental Nutrition Assistance Program, would make a positive difference for family health and kids’ futures.\nHow to accomplish this?\nActually make SNAP nutritional by incorporating restrictions on what food stamps can buy based on the fat, sugar and salt content of foods. Such limitations could also have the beneficial corollary effect of forcing producers of breakfast cereals and other processed foods to make their products healthier for all.\nGranted, the idea we propose is not currently on Congress’ radar, nor has it been part of the debate on renewal of the five-year farm bill, which covers SNAP.\nBut it should be.\nMaking SNAP healthier is more important than fixating on ill-designed, self-defeating and costly proposals to make more people work or enter job training programs to keep their food stamps, especially when so many on food stamps already work, and it’s not clear the required jobs or training would be there.\nWe support working and job training, but the version of the farm bill that was before the House last week would have forced able-bodied adults caring for children over the age of six and childless adults up to 59 to work or job-train for food stamps, and document those efforts, or face long disqualifications for food stamps. The proposal would have abolished waivers for high-unemployment areas.\nAnd county job agencies would see their paperwork burdens grow, while already pressed local food banks would have to find private donations to do more.\nDavid Merriman, administrator for Cuyahoga County Job and Family Services, said an estimated 3,000 poor families in Cuyahoga County with children over six could be subject to these harsher SNAP rules. Expect hunger to spread in its wake.\nIn contrast to these onerous proposals, adding nutrition standards to food stamps is a constructive change aimed at improving the quality of the food needy children receive.\nCongress needs to abandon its ill-judged focus on food-stamp work requirements and put its energy into ensuring that SNAP benefits are used to buy healthier, more nutritious foods.\nAbout our editorials: Editorials express the view of the editorial board of cleveland.com and The Plain Dealer -- the senior leadership and editorial-writing staff. As is traditional, editorials are unsigned and intended to be seen as the voice of the news organization.\nHave something to say about this topic?\n* Use the comments to share your thoughts. Then, stay informed when readers reply to your comments by using the “Follow” option at the top of the comments, and look for updates via the small blue bell in the lower right as you look at more stories on cleveland.com.\n* Send a letter to the editor, which will be considered for print publication.\n* Email general questions about our editorial board or comments on this editorial to Elizabeth Sullivan, director of opinion, at esullivan@cleveland.com.", "url": "https://apnews.com/48e0578cccf04862bbcf635574e408c6"}