{"authors": ["Staff Report"], "date_download": "2020-05-04 20:12:45", "date_modify": "2020-05-04 20:12:45", "date_publish": "2018-02-01 00:00:00", "description": "NIGHTLIFE THURSDAY 279 Bar & Grill, 279 S. River St., Wilkes-Barre: David Cupano", "filename": "_6ec2a9f3b71e48c193c96d4ce90b8168_1588623165.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6ec2a9f3b71e48c193c96d4ce90b8168_1588623165.html", "title": "Nightlife In Northeastern PA, Feb. 1 To 7", "title_page": "Nightlife In Northeastern PA, Feb. 1 To 7", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nNightlife In Northeastern PA, Feb. 1 To 7\nNIGHTLIFE\nTHURSDAY\n279 Bar & Grill, 279 S. River St., Wilkes-Barre: David Cupano\nAugustine’s Club 17, 518 N. Main St., Old Forge: Line dancing with Chris and Darlene\nBackyard Ale House, 523 Linden St., Scranton: Blues Broker Records Blues Jam\nBart & Urby’s, 119 S. Main St., Wilkes-Barre: Trivia Night\nBoulder View Tavern, 123 Lake Harmony Road, Lake Harmony: Strawberry Jam\nChacko’s Memory Lane Lounge, 195 N. Wilkes-Barre Blvd., Wilkes-Barre: Kartune\nElixir Bistro Bar at Mohegan Sun Pocono, 1280 Route 315, Plains Twp.: Sarah Carne\nGrotto Pizza/Skybox Sports Bar, Wyoming Valley Mall, Wilkes-Barre Twp.: Know Limit Trivia\nHeat Bar & Nightclub, 69-71 N. Main St., Wilkes-Barre: Karaoke\nIrish Wolf Pub, 503 Linden St., Scranton: Casper NYHC Gomez\nLevels Bar & Grill, 519 Linden St., Scranton: DJ NRG\nThirst T’s Bar & Grill, 120 Lincoln St., Olyphant: Marilyn Kennedy\nThe V-Spot Bar, 906 Providence Road, Scranton: Jonathan Dressler\nThe Wine Cellar, 815 Mulberry St., Scranton: Eric Rudy\nFRIDAY\n279 Bar & Grill, 279 S. River St., Wilkes-Barre: Tori Viccica\nAle Mary’s at the Bittenbender, 126 Franklin Ave., Scranton: Black Tie Stereo\nAli Baba Liquor Lounge, 219 S. Main St., Wilkes-Barre: All White Attire Affair\nArlo’s Tavern, 10340 Route 171, Union Dale: Chris Ross and The North\nAugustine’s Club 17, 518 N. Main St., Old Forge: Hot Coffee\nBackdraft Sports Bar & Restaurant, 1256 Hamlin Highway, Lake Ariel: Marilyn Kennedy\nBADS, 415 Main St., Luzerne: Karaoke\nBar Louie at Mohegan Sun Pocono, 1280 Route 315, Plains Twp.: County Lines\nBenny Brewing Co., 1429 Sans Souci Parkway, Wilkes-Barre: Strawberry Jam Duo\nBoozer’s Sports Bar, 635 Main St., Avoca: Facing the Giants\nBoulder View Tavern, 123 Lake Harmony Road, Lake Harmony: Doug Drost\nElixir Bistro Bar at Mohegan Sun Pocono, 1280 Route 315, Plains Twp.: Area 52\nGrotto Pizza, 36 Gateway Shopping Center, Edwardsville: Dashboard Mary, Dashboard Mary\nGrotto Pizza/Grand Slam Sports Bar, RR 415, Harveys Lake: Empire in Decline\nGrotto Pizza/Skybox Sports Bar, Wyoming Valley Mall, Wilkes-Barre Twp.: Leighann & Company\nHeat Bar & Nightclub, 69-71 N. Main St., Wilkes-Barre: TopCatt’s Cabaret: NYC Takeover Drag Show\nIII Guys Pizzeria & Restaurant, 11 Garbutt Ave., Dallas: Better With Beer\nJJ Bridjes Restaurant, 925 Northern Blvd., Clarks Summit: Sarafinko Trio\nMendicino’s Pizza, Route 502, Covington Twp.: Tony Vergnetti and Robby Walsh\nMolly O’Sheas at Mohegan Sun Pocono, 1280 Route 315, Plains Twp.: Broken Road Duo\nRiver Street Jazz Cafe, 665 N. River St., Plains Twp.: Fake Fight and Vine Street\nStreamside Bandstand at the Woodlands, 1073 Route 315, Plains Twp.: Boomer Happy Hour with Frankie and Toby\nThirst T’s Bar & Grill, 120 Lincoln St., Olyphant: Riley Loftus, Brett Alexanders and Joe Cigan\nThe V-Spot Bar, 906 Providence Road, Scranton: Small Town Titans\nWildflowers New York Bistro, 600 Wildflower Drive, Wilkes-Barre: Jeff Lewis\nThe Wine Cellar, 815 Mulberry St., Scranton: Tim McGurl\nWise Crackers Comedy Club at Mohegan Sun Pocono, 1280 Route 315, Plains Twp.: Kevin Brennan and Tyler Rothrock\nSATURDAY\nAle Mary’s at the Bittenbender, 126 Franklin Ave., Scranton: Talking Machine\nAugustine’s Club 17, 518 N. Main St., Old Forge: Flatland Ruckus\nBackyard Ale House, 523 Linden St., Scranton: The Soul Shakers\nBenny Brewing Co., 1429 Sans Souci Parkway, Wilkes-Barre: 20Lb Head\nBottler’s Tavern, 200 Delaware St., Jermyn: Dashboard Mary\nBoulder View Tavern, 123 Lake Harmony Road, Lake Harmony: Counting Stars\nBreakers at Mohegan Sun Pocono, 1280 Route 315, Plains Twp.: That 90’s Band\nElixir Bistro Bar at Mohegan Sun Pocono, 1280 Route 315, Plains Twp.: Cruise Control Acoustic Duo\nHeat Bar & Nightclub, 69-71 N. Main St., Wilkes-Barre: Bearlesque One-Year Anniversary\nHog’s Hollow Saloon, 1459 State Route 93, Berwick: Sister Esther\nIII Guys Pizzeria & Restaurant, 11 Garbutt Ave., Dallas: Bret Alexander\nMendicino’s Pizza, Route 502, Covington Twp.: Seize Fire\nMil & Jim’s Parkway Inn, 24 W. Kirmar Ave., Nanticoke: Bounty Hunter\nMolly O’Sheas at Mohegan Sun Pocono, 1280 Route 315, Plains Twp.: Neil Nicastro Duo\nRiver Street Jazz Cafe, 665 N. River St., Plains Twp.: Grass Is Dead\nStreamside Bandstand at the Woodlands, 1073 Route 315, Plains Twp.: Popstar Drive (formerly amRadio)\nThirst T’s Bar & Grill, 120 Lincoln St., Olyphant: Nowhere Slow and John Quinn\nThe V-Spot Bar, 906 Providence Road, Scranton: Graces Downfall\nThe Wine Cellar, 815 Mulberry St., Scranton: Giles Davis and Jerry Trapper, Jam Band\nWise Crackers Comedy Club at Mohegan Sun Pocono, 1280 Route 315, Plains Twp.: Kevin Brennan and Tyler Rothrock\nSUNDAY\nHeat Bar & Nightclub, 69-71 N. Main St., Wilkes-Barre: Not Yo Granny’s Bingo\nHoneychilds’, 109 E. Drinker St., Dunmore: Super Bowl Party\nOmnia Bar Grill and Bottle Shop, 223 S. Main Street, Wilkes-Barre: Super Bowl Sunday\nSlocum Hollow Bar and Restaurant at Montage Mountain, 1000 Montage Mountain Road, Scranton: Pair of Nuts Acoustic Duo\nThe V-Spot Bar, 906 Providence Road, Scranton: Karaoke with DJ Huff\nMONDAY\nBoulder View Tavern, 123 Lake Harmony Road, Lake Harmony: Trivia Night with Josh & Michael\nDuffy’s Coffee House, 306 S. State St., Clarks Summit: Open jam session\nThe V-Spot Bar, 906 Providence Road, Scranton: DJ APTRIK\nTUESDAY\nIII Guys Pizzeria & Restaurant, 11 Garbutt Ave., Dallas: Mike Hagan\nThe V-Spot Bar, 906 Providence Road, Scranton: Tom Osbourne\nWEDNESDAY\nBADS, 415 Main St., Luzerne: Open mic night\nOle Tyme Charley’s Restaurant & Pub, 31 S. River St., Plains Twp.: Karaoke\nThe V-Spot Bar, 906 Providence Road, Scranton: Last Call Trio", "url": "https://apnews.com/6ec2a9f3b71e48c193c96d4ce90b8168"}