{"authors": ["Wayne County News"], "date_download": "2020-05-04 20:26:29", "date_modify": "2020-05-04 20:26:29", "date_publish": "2018-06-06 04:01:00", "description": "CHARLESTON — West Virginia Attorney General Patrick Morrisey warns consumers to be cautious of Medicare scams that seek to steal personal and sensitive information. Scammers will pose as a...", "filename": "_293f028ca2b2442a8d72c68cd849aa94_1588623989.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_293f028ca2b2442a8d72c68cd849aa94_1588623989.html", "title": "Morrisey warns consumers of Medicare scam", "title_page": "Morrisey warns consumers of Medicare scam", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLESTON — West Virginia Attorney General Patrick Morrisey warns consumers to be cautious of Medicare scams that seek to steal personal and sensitive information.\nScammers will pose as a Medicare representative or an affiliate and ask for bank account, credit card, Medicare and/or Social Security information, and in some instances seek payment for the consumer’s newly issued Medicare card.\nMore than a dozen West Virginia consumers report having received such calls in recent weeks.\n“There are many people who unfortunately target and exploit the elderly for nefarious purposes,” Attorney General Morrisey said. “I take that very seriously and have introduced numerous measures to stop it from happening.”\nScam activity may be encouraged by the recent distribution of new Medicare cards. The new cards contain a new beneficiary number, instead of the recipient’s Social Security number, to limit fraud.\nScammers may look to take advantage of the transition. This means consumers must be wary of any unsolicited calls.\nMedicare representatives will not call someone uninvited to threaten the cancellation of benefits, request money and/or ask for personal information, such as his or her new Medicare beneficiary number.\nConsumers should always remember to verify the authenticity of the recipient before handing over personal information. They also must recognize any bullying or intimidation tactics as an immediate red flag.\nThe Attorney General’s elder abuse litigation and prevention unit encourages anyone with questions or concerns to contact the unit’s senior services and elder abuse hotline at 304-558-1155 or HelpForSeniors@wvago.gov.\nSenior citizens and their loved ones also can subscribe to the email scam alerts at http://bit.ly/SeniorScamAlert.", "url": "https://apnews.com/293f028ca2b2442a8d72c68cd849aa94"}