{"authors": ["David Hendee World-Herald Staff Writer"], "date_download": "2020-05-04 20:07:17", "date_modify": "2020-05-04 20:07:17", "date_publish": "2018-04-05 05:00:00", "description": "Denmark’s ambassador to the United States, Lars Gert Lose, paused Wednesday on Main Street in Elk Horn, Iowa, to take a photo of the village settled largely by Danes a century and more...", "filename": "_9992607b200542158785368125fe9f24_1588622837.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9992607b200542158785368125fe9f24_1588622837.html", "title": "Denmark’s ambassador proud of Iowa’s Danish tributes", "title_page": "Denmark’s ambassador proud of Iowa’s Danish tributes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Denmark’s ambassador to the United States, Lars Gert Lose, paused Wednesday on Main Street in Elk Horn, Iowa, to take a photo of the village settled largely by Danes a century and more ago.\n“I love this,” he said. “The landscape reminds me of Denmark. The people remind me of Denmark. To be here and to have this piece of Denmark is a fantastic feeling. It makes me proud.”\nLose (pronounced LOH-suh) toured the national Museum of Danish America and its Genealogy Center in Elk Horn and met with about 80 students from kindergarten to third grade at Exira-Elk Horn-Kimball Community School. Also in Elk Horn, Lose visited the community’s reconstructed 1848 windmill, which was imported from Denmark in the 1970s.\nIn nearby Kimballton, he toured the Hans Christian Andersen-themed sculpture garden with its replica “Little Mermaid” sculpture. He also visited the New Century Art Guild. The organization provides art therapy to military veterans suffering from post-traumatic stress syndrome.\nLose started his three days in the Midlands with a Tuesday visit with Nebraska Gov. Pete Ricketts, a tour of the State Capitol and a meeting with University of Nebraska-Lincoln students. He also talked with University of Nebraska Medical Center students about their research work with the University of Southern Denmark.\nHe wraps up the trip with a roundtable discussion hosted by the Greater Omaha Chamber of Commerce on agriculture, ethanol and other industries Thursday morning.\nLose came to Nebraska and Iowa at the invitation of Rep. Don Bacon, R-Neb.", "url": "https://apnews.com/9992607b200542158785368125fe9f24"}