{"authors": ["Phaedra Haywood", "The New Mexican"], "date_download": "2020-05-04 20:05:31", "date_modify": "2020-05-04 20:05:31", "date_publish": "2018-04-27 03:30:00", "description": "Santa Fe has lost a bard. Self-described “modern satirical poet” Sanford “Rosé” Cohen died April 4 of complications from pneumonia. He was 83. More beatnik than hippie, Cohen was a seminal...", "filename": "_ec9245fc73f743be962f75596f6f0166_1588622731.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ec9245fc73f743be962f75596f6f0166_1588622731.html", "title": "Counterculture poet remembered as inspiring force", "title_page": "Counterculture poet remembered as inspiring force", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Santa Fe has lost a bard. Self-described “modern satirical poet” Sanford “Rosé” Cohen died April 4 of complications from pneumonia. He was 83.\nMore beatnik than hippie, Cohen was a seminal figure in East Coast and Southwest counterculture circles — an author, art patron, world traveler and entrepreneur who once owned a gallery on Palace Avenue. His greatest joy was performing his long-form poetry, rife with puns and rhymes, for a live audience.\n“Think Byron filtered through Hunter S. Thomson and Bob Dylan crooned by Desi Arnaz,” political cartoonist Jonathan Richards wrote in his review of Cohen’s 2012 book, The Pearl Upon the Crown, an epic poem Cohen wrote and performed over a period of 30 years.\n“He was the best-read man I ever came across,” said Synergetic Press editor Linda Sperling, who first published Cohen’s work in a broadsheet sponsored by Evangelo’s bar and also published The Pearl and Cohen’s 2001 book Poetraits.\n“The depth and breath of his reading was astonishing, and how much knowledge he incorporated into his poetry,” Sperling said.\nCohen was born in the Bronx borough of New York City in 1934. He graduated from high school at 16 and earned a bachelor’s degree in teaching from City College of New York in 1954. He then went to Columbia University to study to be a pharmacist, like his dad. But he decided that career wasn’t for him and instead joined the Army, where he worked as a typist for two years before returning to City College to study ancient Greek.\nAfter graduating with a master’s degree in 1962, Cohen worked as an English teacher in New York and tried his hand at other pursuits, including lifeguard, masseur and astrology writer.\nHe married Linda Gordon in 1971, and the pair lived in Hawaii, the Yucatán Peninsula, Jamaica and Miami before coming to the Southwest in the early 1970s.\nHe was never a member of any commune but bought land and built a house on the border of the Libre commune in southern Colorado. He struck up friendships there with some of the communards, including Brent Seawell, who remembered that when Cohen needed his help — a haircut or refrigerator repair — he asked for the favor by poem.\nIn 1975, Cohen, his wife and their daughter, Nicteha Rebecca Cohen — who was born in a hammock in the Yucatán — settled in Santa Fe, where the couple’s second daughter, Bella Fiesta Cohen, was born.\nStand-up-style poetry was Cohen’s passion, and he performed his poems — always memorized, never read, his wife said — in public and private venues on both coasts and in Santa Fe, which, Sperling said, emboldened other local poets.\n“He was a force for inspiring poets to come out of their little corners and admit they were poets publicly,” Sperling said. “This is an important thing, when an artist inspires other artists.”\nHis daughters remembered their father as a man whose ideas were ahead of their time.\nHe was a pioneer in Colorado’s cannabis industry before it became legal, they said, and published the World-Wide Home Rental Guide for several years in the 1990s, a publication his daughters described as a pre-internet incarnation of Airbnb. He also owned Rosemont Gallery, a jewelry business, a hammock business and, his daughters said, a phone-answering service before voicemail became a thing.\nCohen was a devoted patron and promoter of the late “Atomic Artist” Tony Price — an anti-nuclear activist who created some of his work from scrap salvaged from Los Alamos National Laboratory.\nCohen arranged Price’s first showing in New York City. And in 2005, after Price died, Cohen arranged a retrospective of his work at the United Nations in New York, an exhibit for which he received support from the New Mexico Department of Cultural Affairs.\nThe final stanza from Cohen’s poem Santa Fe:\nIt’s Paradise, I won’t be vague\nLand of the Flea, Home of the Plague\nThe cozy Great Southwest\nSmart Dinner Clubs, Art without reason\nPrison riots, the Opera Season.\nCohen’s family will host a gathering to commemorate his life at his home in Santa Fe from 1 to 4 p.m. Sunday, April 29. For directions or more information, email rosememorial2018@gmail.com.\nContact Phaedra Haywood at 505-986-3068 or phaywood@sfnewmexican.com. Follow her on Twitter @phaedraann.", "url": "https://apnews.com/ec9245fc73f743be962f75596f6f0166"}