{"authors": ["Jon Gard Staff Writer", "Jgard Heraldargus.Com"], "date_download": "2020-05-04 20:27:31", "date_modify": "2020-05-04 20:27:31", "date_publish": "2018-02-08 01:52:46", "description": "La PORTE — Articles of incorporation and bylaws for a new organization formed to manage the fairgrounds were given initial approval Wednesday by the La Porte County Board of Commissioners. A...", "filename": "_d6846f71f9e44a0fa834fb3da9bd9748_1588624051.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d6846f71f9e44a0fa834fb3da9bd9748_1588624051.html", "title": "Proposal reorganizes fairgrounds management", "title_page": "Proposal reorganizes fairgrounds management", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "La PORTE — Articles of incorporation and bylaws for a new organization formed to manage the fairgrounds were given initial approval Wednesday by the La Porte County Board of Commissioners.\nA final vote on the documents will be delayed until April, according to the motion made by Commissioner Vidya Kora, giving existing Fair Board members and other stakeholders plenty of time to discuss the proposal.\nMembers of a blue ribbon commission, appointed in June, recommended formation of a not-for-profit corporation as part of an effort to overhaul management of the fairgrounds.\nAlthough the fairgrounds property is owned by the county, the weeklong 4-H Fair and other events have been managed since 1845 by the La Porte County Agricultural Association, commonly known as the Fair Board.\n“I want to emphasize, this new corporation will not touch the operation of the fair,” Kora said.\nThe purpose of the organization is to operate the fairgrounds for charitable and educational purposes with a steady source of funding, Kora said.\nThe La Porte County Council last year agreed to forgive a $250,000 loan to the Agricultural Association for sewer improvements when the group expressed concern about its ability to continue making payments. The council also agreed to fund future improvements at the fairgrounds.\nA resolution approved by the council calls for the new organization’s responsibilities to “go above and beyond preparing the fairgrounds for the annual fair to include a variety of exhibitions, concerts, functions and events.”\nCommissioner Rich Mrozinski said the new organization would manage the fairgrounds. Under the previous arrangement, the association maintained the buildings, mowed, paid for utilities and hosted activities year-round, including the volunteer-run Pioneer Land, which depicts life in Indiana in the early 1800s.\n“A lot of improvements need to be made out there,” Mrozinski said. “The electrical system is dangerous, and the insurance is sky high. The idea is that this arrangement will solve those problems and still give the Fair Board a voice.”\nMembers of the existing Agricultural Association would hold two of the 11 seats on the board of directors of the new La Porte County Fairgrounds Management and Events Corp.\nTwo seats would also be held by the County Council or its designee.\nThe remaining seats would filled by the county Board of Commissioners, a representative of an investor-owned or membership cooperative utility appointed by the commissioners, a member selected by the Purdue Cooperative Extension, a member of Pioneer Land, a member of La Porte County 4-H, a member of the La Porte County Convention and Visitors Bureau and a member appointed by the county sheriff.\nIn other action Wednesday, the Board of Commissioners:\n• Approved a $175,000 job-skills training assistance agreement for call-center employees and data accountants at CareEnroll, 1900 W. Severs Road\nThe grant, arranged through the Indiana Economic Development Corp., uses local funding.\nIt will allow the company to retain 45 existing jobs paying an average of $27.50 an hour and create another 131 jobs through 2023 paying an average of $20.35 an hour, both above the county’s average wage rate, according to county economic development coordinator Michael Seitz.\nExpansion at the company is tied to a new federal Medicaid program known as the “1115 waiver,” which funds experimental, pilot or demonstration projects. CareEnroll helps health care providers and health plans achieve their goals by helping patients enroll in an appropriate health plan and maintain their coverage.\nSeitz said this is only the second time this type of local training grant has been implemented in Indiana, with the other in Tippecanoe County.\n“These are good-paying jobs that will benefit the local economy,” Seitz said. “These people will pay a county payroll tax, and it shows La Porte County’s willingness to work the Indiana Economic Development Corp. to sustain jobs and expand the local employment base.”\nCouncil Attorney Douglas Biege said the County Council previously expressed support for the project. He said the agreement approved by the commissioners Wednesday will ensure the funds are spent on specific training programs and guarantee a payback to taxpayers if employment goals are not met.\n• Approved a resolution in support of political redistricting reform in Indiana. Similar resolutions have been approved by the cities of La Porte and Michigan City, as well as municipalities across the state.\n• Approved an ordinance lowering the speed limit on Otis Road from 45 mph to 40 mph to accommodate the design of a new bridge, as recommended by county engineer Jay Sullivan.", "url": "https://apnews.com/d6846f71f9e44a0fa834fb3da9bd9748"}