{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:15:56", "date_modify": "2020-05-04 20:15:56", "date_publish": "2018-02-06 12:25:00", "description": "Even the historic drop in the Dow on Monday should not make investors start panicking, yet. The drop on Monday was followed by more heavy selling in Asia and Europe on Tuesday. The sudden...", "filename": "_dc5b1d7f8fd8480e93bb1db23dbd459c_1588623356.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dc5b1d7f8fd8480e93bb1db23dbd459c_1588623356.html", "title": "Don't panic yet over stock market meltdown", "title_page": "Don't panic yet over stock market meltdown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Even the historic drop in the Dow on Monday should not make investors start panicking, yet.\nThe drop on Monday was followed by more heavy selling in Asia and Europe on Tuesday. The sudden plunges come after a strong rally for global stocks in 2017, raising the question of whether the party is over.\nMany experts say this week’s slump is likely to be a short-term blip and not cause for bigger concerns. That’s partly becuase the global economy is in good shape.\n“As long as recession is unlikely in the U.S. and globally, it’s likely to just be a correction,” said Shane Oliver, head of investment strategy at money manager AMP Capital.\nAnd there’s no talk of recession among economists.\nIn the U.S., unemployment is at a 17-year low. Average hourly wages went up last month the most in eight years. Consumer and business confidence are near record levels.\nThat counts for a lot more than a few days of losses on Wall Street.\n“Listed companies are not very important economically,” said Paul Donovan, global chief economist at UBS Wealth Management, adding that they account for “a minority of employment and economic activity.”\nPlunging markets can make for unhappy reading of your stock portfolio or pension -- but a short-term dip shouldn’t be a reason to freak out.\n“The wealth effect on consumers is important, although labor markets can outweigh that,” Donovan said. “Most Americans have a job. Almost half of Americans do not own equity.”\nIt’s not just the U.S. that’s doing well. Europe has also been firing on all cylinders. And the World Bank and International Monetary Fund both recently gave upbeat outlooks for the global economy this year.\nSigns of trouble ahead would include high inflation, rapidly rising interest rates and runaway property prices.", "url": "https://apnews.com/dc5b1d7f8fd8480e93bb1db23dbd459c"}