{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:15:13", "date_modify": "2020-05-04 20:15:13", "date_publish": "2018-01-15 05:00:00", "description": "I’d almost finished my column. It was about Monday’s historic transfer of power from Republicans to Democrats on the Greenwich Board of Estimate and Taxation. But just as I prepared to file the...", "filename": "_9e7c091b1db24c60ac666bf804787841_1588623313.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9e7c091b1db24c60ac666bf804787841_1588623313.html", "title": "Alma Rutgers: King reminds us to raise volume vs. injustice", "title_page": "Alma Rutgers: King reminds us to raise volume vs. injustice", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "I’d almost finished my column. It was about Monday’s historic transfer of power from Republicans to Democrats on the Greenwich Board of Estimate and Taxation. But just as I prepared to file the column Thursday night, I was compelled to switch topics. That was because of President Donald Trump’s racist statements that morning.\nHow could a column that appears the day before the nation honors the legacy of Martin Luther King, Jr. ignore the mocking of King’s memory, the trashing of his dream, and the disgrace to our nation? How could this Sunday column let racism slip by?\nIt can’t, I concluded, and I can’t. I had no choice but to scrap the column I’d written. .\n“Why are we having all these people from shithole countries come here?” Trump is reported to have said during a Thursday morning discussion in the Oval Office with lawmakers who are seeking a bipartisan immigration deal that would include protections for immigrants from Haiti, El Salvador, and some African countries.\n“Why do we need more Haitians?” he is reported to have said. “Take them out.”\nDuring a June meeting with cabinet officials in the Oval Office, according to New York Times reporting, Trump had said all Haitians have AIDS and Nigerians who came here would never return to their “huts.”\nThursday, when his racist statements were followed by his preference for immigrants from countries such as Norway, Trump left little doubt that “Make America Great Again” really means what many, perhaps most, of us have always known it meant: keep out people of color and make America white again.\nNot that America ever was “white.” Our most native population is not “white.” And our non-white slaves, ancestors to many of today’s African-Americans, were here long before the ancestors of most “white” Americans, including Trump’s immigrant mother and immigrant grandparents on his father’s side.\nMy continual sense of outrage over Trump, always simmering, reached a new boiling point in the wake of his racist outburst.\nI decided to write this column after returning from a panel discussion: “Fighting Modern Day Slavery ... a conversation about the battle against human trafficking.” The standing-room-only program at the Greenwich YWCA, co-sponsored by nearly 30 community partners, was the Y’s annual tribute to the legacy of Dr. Martin Luther King, Jr.\nThe human trafficking statistics are alarming. According to conservative estimates, there are 40.3 million victims of human trafficking at any given moment globally, with an estimated hundreds of thousands in the United States. This global modern day slavery exists in our nation, states, cities, and towns, including in Greenwich.\nCommunity awareness and education are critical elements in the battle against this scourge. The panel discussion was inspiration to engage in struggle. I found myself planning some future column about this evil.\nBut as I began this week’s column late Thursday night, what came to my mind — my immediate takeaway from the human trafficking program — were these words spoken by Martin Luther King: “In the end, we will remember not the words of our enemies, but the silence of our friends.”\nSilence in the face of injustice is our enemy.\nQuoted by one of the program’s panelists, King’s words were intended to inspire us to speak out about the scourge of human trafficking, this enslavement of human beings, but really it could be heard as a call to speak out against all injustice, everywhere.\nBy speaking out against bigotry and hate, we honor Martin Luther King’s legacy, which is the American legacy that our founders have bequeathed us in our Constitution and Declaration of Independence. By speaking out against injustice, we heed the call to engage in the struggle toward a world that values human dignity, with freedom and justice for all.\nAs Americans, regardless of political party, we have an obligation this Martin Luther King Day to speak out against Trump’s anti-American stance.\nWith the silence of good people our enemy at a time like this, the perpetual silence of a Republican Congress is deafening. Surely there must be good people there. They need to call Trump out, for the sake of our country.\nAlma Rutgers served in Greenwich town government for 25 years. Her blog is at blog.ctnews.com/rutgers/", "url": "https://apnews.com/9e7c091b1db24c60ac666bf804787841"}