{"authors": ["Irene North"], "date_download": "2020-05-04 20:22:01", "date_modify": "2020-05-04 20:22:01", "date_publish": "2018-01-17 01:30:00", "description": "A pair of moccasins rests on a shelf on display at the James H. Cook Gallery at Agate Fossil Beds National Monument. Written on the soles are the words, “Chief Red Cloud’s moccasins, Presented to...", "filename": "_ce9b93f004cc4f0c818f7e4b6f3815a3_1588623721.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ce9b93f004cc4f0c818f7e4b6f3815a3_1588623721.html", "title": "Agate display gives insight into a friendship across the ages", "title_page": "Agate display gives insight into a friendship across the ages", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A pair of moccasins rests on a shelf on display at the James H. Cook Gallery at Agate Fossil Beds National Monument. Written on the soles are the words, “Chief Red Cloud’s moccasins, Presented to James H. Cook May 12th 1908 at Agate Neb.” They are a testament to the unique friendship between Cook, a white rancher, and Red Cloud, chief of the Lakota, during a time when hostility was the norm.\nVisitors at Agate Fossil Beds National Monument on Monday got a bit of insight into that friendship as they were given a personal tour of the gallery and the stories behind many of the items on display.\nTheir friendship began in 1875 when Cook was at the Red Cloud Agency, the American Indian reservation where the Lakota had been resettled. When famed paleontologist O.C. Marsh was trying to convince Red Cloud to let him go into the badlands to look for fossils. Red Cloud was convinced he was really looking for gold and he was going to steal the land. Cook was 17 or 18 at the time and knew sign language and a little bit of Lakota. He acted as interpreter between the cook.\n“They sat down and Cook was able to tell Red Cloud that they were crazy enough to only want stone bones (fossils),” said Lil Mansfield, park ranger.\nThe pair’s friendship began then and continued to grow over time. By the time James and Kate (Graham) Cook bought Agate Springs Ranch, Red Cloud had a standing invitation to visit. After receiving permission to leave the reservation, Red Cloud often brought his friends and family with him. It took five days to make the arduous 150-mile trip.\nThe James Cook Gallery is filled with items Red Cloud and other American Indians gave to him as gifts or for safe keeping. The entire gallery is a testament to the cultural diversity between Cook and his American Indian friends and the trust they placed in him not only to preserve items, but their story and their legacy.\nWhen Mansfield first saw the area where the gallery was going to be built, she didn’t think it was going to be big enough. There are more than 500 items in the collection. When she learned what items were chosen for permanent display, she began to understand why the size was chosen for the gallery.\n“If you just line everything up, you can’t take it all in,” she said.\nAs time went on and Cook became friends with other American Indians, he received one special gift, which is one of the most important items in the collection. A whetstone belonging to Crazy Horse was given to Cook by his sister. It is one of the last things she had belonging to her famous brother and she wanted it to be preserved.\n“It speaks to the kind of man that Cook was,” Mansfield said. “They knew he was going to protect these things.”\nThe collection also has a war club used by American Horse during the Battle of the Hundred Slain, or Fetterman Fight. The story told to Harold, Cook’s son was that American Horse presented the club to Cook during one of their many meetings at the ranch. During the battle, American Horse had raised the club to strike Fetterman. The impact broke the handle and knocked both men to the ground. The fought hand-to-hand. American Horse killed Fetterman with a knife.\nThough they won the battle and the Bozeman Trail was closed, 12 years later, the Lakota were forced onto the Pine Ridge Reservation.\nA large display in the gallery depicts Lakota life in transition. Red Cloud’s shirt is there. Three generations of pipe bags belonging to the Red Cloud family are there. So is Red Cloud’s wife, Good Road’s, three-elk skin dress. Other items of daily life of the family are there, too, including children’s toys, ladles and a hair brush.\n“To me, this is a powerful message of how this whole family had enough respect to give James Cook these items,” Mansfield said.\nOne of the many items on display at the Cook Gallery that isn’t part of the Cook collection is the Lakota Winter Count. To keep track of time, American Indians will often do so by important events and not by a linear count with numbers.\n“Each year, the keeper of the count would paint an account of something that happened that year,” Mansfield said.\nThe one on display at the entrance to the gallery was made by Lakota Dawn Little Sky and depicts through symbols time from the formation of the Earth to the present time. Many of the events are specific to the Lakota in the Black Hills, but also have symbols about other parts of American History, such as the Civil War and Man landing on the Moon.\n“Meeting the traders was a big thing,” she said. “It improved their lives, but was also the start of their demise.”\nThe legacy of the friendship not just between two men, but many at the Agate Springs Ranch is still reverberating among people today. A photo depicting a Fourth of July celebration at the ranch shows many neighbors, cars and Lakota. When the photograph was put on a kiosk at Agate, one current neighbor came by and asked where the photograph came from and if he could get a copy.\n“Some of his great uncles were in the picture,” she said. We have lots of stories of like that, but they are getting fewer and harder to find.”\nIn that same photograph, American Indians can be seen writing on a hide. It is reportedly the “remembering of the Battle of Greasy Grass.” The battle is also known as the Battle of the Little Big Horn. A replica hangs in the gallery. The original was painted with natural dyes.\n“They worked on it, talked, drew some more, talked, drew a little bit until they had their story written down,” she said.\nThere are three notable people on the hide - Custer falling off his horse, a physician shooting himself in the head and what many believe is Jack Red Cloud, Red Cloud’s son. It is believed this means JAck was at the battle.\nOther items entrusted to Cook from American Indians is one of the guns used at the Cheyenne Break Out, ledger art, a pipe used at the Ft. Laramie Treaty of 1868 and Red Cloud’s portrait.\nThere is also a collection of letters to and from Cook, which are available to researchers.\n“One of the letters is requesting Cook be an Indian Agent because they trusted him and believed in him,” Mansfield said. “I haven’t seen it in writing, but I have been told he didn’t get the position because he wasn’t working for the government, didn’t know the right people or wasn’t related to them.”\nCook had asked Red Cloud to sit for a painting, but he wasn’t interested. Then, one day, Red Cloud comes for a visit in his famous shirt ready for his portrait.\n“This is Sioux County. You’d be hard-pressed today to find a portrait painter, yet alone then,” she said.\nAs it turns out, Kate’s friend Bessie Sander Butler, of Chicago, was a portrait painter and was visiting. Red Cloud’s portrait hung in the house for many years. One day, a female Lakota visited the Cooks after Red Cloud had died. She was frightened when she saw the photo and ran away.\n“She believed his spirit was still here,” Mansfield said.\nEach artifact that Cook kept and preserved has a story. From the mirror the Lakota gave Harold Cook when he went to the University of Nebraska to the bison statue that doubles as an ink well.\nThe rotating exhibit lets visitors see things that can’t be on permanent display, but all add to the story of the white man who befriended a Lakota and cared what happened to him, his family and his people. Even Mansfield, who has spent decades around the family, the ranch and the artifacts learns more each time the exhibit is changed.\n“I’ve been in the vault many times doing inventory, but the piece I’ve never seen was the arrow straighteners,” she said.\nMansfield and the other park rangers are always happy to take visitors around and tell stories. It doesn’t have to be just on Martin Luther King Day where they learn about Cook and his family’s concerns over the rights and welfare of their friends. All you need to do is stop by and ask.\nGallery preserves the trust and friendship between two men during a time when the white man and American Indian were in conflict.", "url": "https://apnews.com/ce9b93f004cc4f0c818f7e4b6f3815a3"}