{"authors": ["Mary Ann Thomas"], "date_download": "2020-05-04 20:08:15", "date_modify": "2020-05-04 20:08:15", "date_publish": "2018-04-15 16:51:08", "description": "Scenic sections of the Allegheny River sprinkled with historic sites will highlight the new 1.5-mile extension for the Tredway Trail, according to officials who unveiled details at a public...", "filename": "_3e28e176977b483882e61529f99fdc33_1588622895.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3e28e176977b483882e61529f99fdc33_1588622895.html", "title": "Tredway Trail to add new sights, sites with 1.5-mile expansion", "title_page": "Tredway Trail to add new sights, sites with 1.5-mile expansion", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Scenic sections of the Allegheny River sprinkled with historic sites will highlight the new 1.5-mile extension for the Tredway Trail, according to officials who unveiled details at a public meeting Thursday night.\nAllegheny Township and Senate Engineering outlined the new $327,000, 10-feet-wide, crushed-limestone trail extension from the River Forest marina to the Freeport Bridge.\nThe trail head for the Wynn and Clara Tredway Trail, a two-mile bike and walking path, is located at the border of Allegheny Township and the Braeburn section of Lower Burrell. The recreational trail extends along the Allegheny River to the River Forest marina in Allegheny Township.\nThe new extension will not just make it longer but will end under the Freeport Bridge where cyclists will have to travel about on 900 feet on River Landing Road to reach the new bike lane on the Freeport Bridge and the 21-mile Butler Freeport Trail.\nMuch of the trail will follow the edge of the River Forest golf course, which Tredway developed, according to William Braun, an engineer with Senate Engineering who is designing the trail.\nThe trail follows the former rail line of the Allegheny Valley Railroad, he said.\nTrees will be planted as buffer zone where the trail closely parallels River Forest Drive.\nJohn Framel, a River Forest resident and a former supervisor, spoke against a proposed parking lot near the intersection of Club House and River Forest drives, and the golf course.\nFramel negotiated with Tredway his donation in the late 1990s of the ground for the two-mile trail to the township.\n“Mr. Tredway did not want any access to the trail from the golf course,” Framel said. “I’m just honoring the wish of man who has since died,” he added.\nTownship Manager Greg Primm said the current supervisors can discuss and make a decision on the parking lot. “People are already parking there,” Primm said.\nThose cars are likely overflow parking of visitors.\nMost of the parking for the trail would be under the Freeport Bridge.\nSupervisors will decide on a construction bid in late summer with trail construction to finish by the summer of 2019.\nHistorical markers will likely be developed for the trail to note Native American and European settlements.\nMary Ann Thomas is a Tribune-Review staff writer. Reach her at 724-226-4691, mthomas@tribweb.com or via Twitter @MaThomas_Trib.", "url": "https://apnews.com/3e28e176977b483882e61529f99fdc33"}