{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:12:41", "date_modify": "2020-05-04 20:12:41", "date_publish": "2018-03-03 17:38:00", "description": "INDIANAPOLIS -- Coach Mike McCarthy and the Packers find themselves in unfamiliar territory this offseason coming off a 7-9 season, their first non-playoff campaign since 2008, and also the last...", "filename": "_bb3ee31815d94726b03af1a7cb04a2b9_1588623161.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bb3ee31815d94726b03af1a7cb04a2b9_1588623161.html", "title": "Green Bay Packers defense begins climb back from depths of 2017", "title_page": "Green Bay Packers defense begins climb back from depths of 2017", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS -- Coach Mike McCarthy and the Packers find themselves in unfamiliar territory this offseason coming off a 7-9 season, their first non-playoff campaign since 2008, and also the last time they didn’t finish above .500.\nMaybe the 2017 season should come with an asterisk, since QB Aaron Rodgers missed nine games, during which the Packers went 3-6 behind the uneven performance of backup QB Brett Hundley. In his second pro season, Hundley threw 12 interceptions and nine TD passes for an un-Rodgers-like 70.6 passer rating.\nThe Packers replaced offensive coordinator Edgar Bennett with Joe Philbin, who held that job in Green Bay from 2007-11, but most of the offensive assistants remain. It was the defense that took the brunt of the blame after finishing 26th in points allowed and 22nd in yards allowed. McCarthy fired coordinator Dom Capers after nine seasons and replaced him with Mike Pettine. Only Winston Moss remains from the old defensive staff.\nThat would represent a major shakeup on any team, but for a Packers franchise known for its stability it was a seismic shift, so McCarthy was asked at the Scouting Combine if a culture change was needed on defense.\n“That’s a big statement,” he said, not disagreeing. “From my perspective, you have evaluations that you do each and every year, you have filters that you run your data and your conversations (through) and all the input that you take from within the organization and even outside, and then with that you assess.\n“Obviously, the last nine years, I felt that internally we were able to take the resources that we had, build a vision, a plan for the upcoming season. Obviously, I felt different this year, when we went externally, and obviously the result was all the coaching changes.”\nBut, what about that culture change?\nI don’t get too far away from the reality of how the operation is every day, and that is the culture,” McCarthy said. “The culture is what makes it go, that’s how you sustain success, and it definitely has been changed. On a lot of levels, it’s been adjusted, too. That’s our outlook.”\nCapers was a staunch 3-4 guy, and that’s been Pettine’s history as well, but McCarthy says flexibility will be a key component of the defense going forward. Since most defenses now play half their snaps in sub packages anyway, the lines between 3-4 and 4-3 have become blurred. McCarthy believes it’s more important for the defense to adapt to a player’s strengths than try to force a player into an uncomfortable role, so that will be Pettine’s task.\n“Frankly, if you asked Mike the question if he plays a 4-3 or 3-4, he’d say, ‘Yes,’ ” McCarthy said. “That’s the reality of what a good defensive system is, the ability to utilize their players.\n“We’ve never had the luxury of saying, ‘Hey, we need this specific kind of player.’ In our system; offense, defense and special teams we need to take advantage of those players and make sure we’re playing to their strengths, and that’s no different with Mike.”\nIn points allowed, last year’s defense ranked lower than any Packers team since 1986, so any change will probably be beneficial.\nVisit ProFootballWeekly.com | View Latest E-Edition", "url": "https://apnews.com/bb3ee31815d94726b03af1a7cb04a2b9"}