{"authors": ["David E. Malloy"], "date_download": "2020-05-04 20:28:57", "date_modify": "2020-05-04 20:28:57", "date_publish": "2018-07-05 04:01:00", "description": "IRONTON — The following information was compiled from Lawrence County Sheriff's Office reports: DRUG ARRESTS: After receiving a call about drug activity on a parking lot last week in Perry...", "filename": "_96616efe7f73413983d29d71f3558a49_1588624137.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_96616efe7f73413983d29d71f3558a49_1588624137.html", "title": "Two charged with drug trafficking in Perry Township", "title_page": "Two charged with drug trafficking in Perry Township", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "IRONTON — The following information was compiled from Lawrence County Sheriff’s Office reports:\nDRUG ARRESTS: After receiving a call about drug activity on a parking lot last week in Perry Township, a sheriff’s deputy arrested Dewey D. Nance, 41, of Private Drive 3367, South Point, on charges of drug trafficking and having weapons while under disability. Michelle K. Curry, 36, of Wilson Drive, Coal Grove, was arrested on charges of drug trafficking, possession of drugs and possession of a dangerous drug. Authorities recovered 9.6 grams of meth, digital scales, $521 in cash, a loaded handgun and ammunition, two chainsaws and other drugs.\nBURGLARY: A sheriff’s deputy on Sunday arrested Jesse D. Mezo, 32, of County Road 70, Proctorville, on charges of burglary, domestic violence, resisting arrest and violation of a protection order and transported him to jail.\nTHEFT: A 31-year-old South Point area woman reported last week that someone stole a wedding band set valued at $10,000 from her home.\nBURGLARY: A 37-year-old Pedro area man reported last week that someone broke into his residence and stole tools, an iPhone, a Playstation 4, a wireless sound bar, jewelry, and miscellaneous cash and change. The items were valued at $3,502.", "url": "https://apnews.com/96616efe7f73413983d29d71f3558a49"}