{"authors": ["Chris Mccosky", "The Detroit News"], "date_download": "2020-05-04 20:11:55", "date_modify": "2020-05-04 20:11:55", "date_publish": "2018-03-04 22:32:45", "description": "West Palm Beach, Fla. — This is how it often works in spring training. What seems like a logjam one minute suddenly becomes an open lane the next. Only to jam up again later. And we're not...", "filename": "_3ddf50d960074f9eb29fec63d7869204_1588623115.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3ddf50d960074f9eb29fec63d7869204_1588623115.html", "title": "Tigers arms race: Opportunity still knocking for relief roles", "title_page": "Tigers arms race: Opportunity still knocking for relief roles", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "West Palm Beach, Fla. — This is how it often works in spring training. What seems like a logjam one minute suddenly becomes an open lane the next. Only to jam up again later.\nAnd we’re not talking about the traffic patterns on Florida roads.\nWith Travis Wood (knee surgery) out for the season and Francisco Liriano’s spring delayed by a couple of weeks because of his late signing, it seemed a path opened, potentially, for Blaine Hardy or Chad Bell to claim the second left-hander role in the Tigers bullpen.\nIf only it were that cut and dry.\nFirst of all, manager Ron Gardenhire and pitching coach Chris Bosio might not feel the need to keep two lefties in the bullpen. Gardenhire has said throughout camp that the decision would most likely come down to taking the best seven pitchers, regardless of which arm they throw with.\n“You’d love to be able to mix and match and go lefty-lefty, righty-righty and those kinds of things,” he said. “But it doesn’t always work like that and you have to ad-lib. It’s all about having the best arms and guys who can figure out how to get guys out.”\nThe situation also is clouded by the possibility of using a four-man starting rotation for the first couple of weeks of the season, since there are two off-days in the first nine days.\n“We still have a long way to go,” Gardenhire said. “We have a lot of games left to see who comes through this thing healthy. We’ll figure things out. But if we go with a 12-man pitching staff, starting with a four-man rotation is not a bad thing. You can piggy-back two of them in a game if you had to.\n“You can do a lot of different things in the first part of the season that you can’t do as you go along and you get deeper into the season and innings start piling up.”\nMore: Blast by Harper aside, Tigers’ Wilson sees outing as another step forward\nSo, whoever wins the fifth starter job — Daniel Norris, Liriano, Alex Wilson — would be available to work out of the bullpen for the first few games. Norris and Liriano are lefties.\nLet’s look at how things stand as we reach the midpoint of spring training.\n■ Projected locks: RHP Shane Greene (closer), RHP Warwick Saupold, RHP Joe Jimenez, RHP Drew VerHagen and LHP Daniel Stumpf.\nAssuming the Tigers take the usual collection of seven relievers, that leaves two open spots. One of those, almost certainly, will belong to Wilson if he doesn’t win a rotation spot. The other could be Liriano’s if he doesn’t win a spot in the rotation.\nBut for intents and purposes, there are two spots.\n■ Right-handers in the hunt: Johnny Barbato, Buck Farmer, Zac Reininger, Kevin Comer, Mark Montgomery and Enrique Burgos.\n■ Left-handers in the hunt: Hardy and Bell.\nInteresting mix. Bell and Hardy are finesse pitchers, though Bell can power up when he needs to. Other than Montgomery — who has a wicked slider — the right-handers in the mix are all power pitchers. Barbato, Farmer, Reininger, Comer and Burgos all sit in the mid to upper 90s with their fastball.\n“We’ll let those guys decide,” Gardenhire said. “They’re the gladiators out there doing battle. We’re going to kind of let them tell us who should be here and we’ll take what best fits for our rotation and what’s best for these guys.”\nGardenhire said general manager Al Avila and his staff also will have a voice in the decision.\n“It won’t just come from Boz and I, it’ll come from upstairs, too,” he said. “It’s a remodel, as they say, and they are going to have their say.”\nGardenhire said the plan is for the coaches and front office staff, including analytics, to meet when the club gets back to Lakeland on Sunday. Although Avila and his top lieutenants — David Chadd and Scott Bream — are on the trip to West Palm Beach and Port St. Lucie.\n“We’re all going to sit down after this little road trip and talk about a few things,” Gardenhire said. “Just to kind of see where we are at.”\nBell and Hardy have to be considered dark horses at this point. Bell has pitched well in his two outings this spring. Hardy, who had a cortisone shot earlier in the week to alleviate soreness in his shoulder, has yet to pitch and he’s champing at the bit.\n“I want to throw regardless of what the situation is,” he said. “I don’t like sitting around seeing everyone else throwing.”\nHardy’s shoulder has been wonky since he pitched 61.1 innings in 70 games for the Tigers in 2015. He’s been on an off the disabled list the last couple of seasons. But when he’s healthy, as he was for the first month last season when opponents hit .216 off him and he struck out nine in 11 innings, he can be effective in multiple roles.\n“I had the MRI (last week) and it said everything is good and I’m 100 percent,” Hardy said, meaning the structure of his shoulder. “As long as they let me push it, I should be ready for the season.”\nIt’s not likely the Tigers will let him push too hard. He has long-tossed out to 100 feet but there was no timetable yet for when he will throw a bullpen session.\n“I want to throw one today but they won’t let me,” Hardy said Saturday. “They said they were going to do this on the fly, day to day, because they don’t want to push it too slow or too fast. And I appreciate that.”\nOne thing 2015 taught Hardy is where his limits are. And that, he says, will keep him sane during what has to be agonizing times — seeing an opportunity and not being able to chase it.\n“I am not going to do something stupid and try to push it beyond where I should,” he said. “But I am probably going to be a little impatient at times. But being a week late for the season is better than missing a month.”\nBell, who has toggled between the rotation and bullpen in his time with the Tigers, has been quietly effective. He’s pitched four scoreless innings in two outings, allowing two hits and a walk with three strikeouts.\n“I am just going about it to get as many outs as I can in whatever innings I am out there, without any runs being scored,” he said. “You never know what the needs are going to be.”\nLike last season, when he made a strong first impression with the Tigers, Bell’s fastball was sitting 94 in his first outing and then dropped to 92-93 in his second outing. But unlike last spring, the command on his slider and curveball (which he lost the feel for last year) has been much sharper.\n“You know what, if I can sit at 93, throwing from a little bit lower arm slot, getting a little run and a little life on it — if you throw it where you want, the results should be pretty good,” he said. “I’m trying to take a couple of miles per hour off my change-up, too, just messing with grips and stuff.\n“But from a role standpoint, if you can keep pounding the zone and getting outs, they will find a spot for you.”\nIn one sense, Gardenhire and Bosio got exactly what they wanted — intense competition for jobs and creditable options.\n“We have a lot of big bodies and big arms, and that’s impressive,” Bosio said, earlier in camp. “With young guys, you don’t really know what you have. The talent is there, but they have to go out there and they have to do it.\n“They’re going to have the opportunity to have success in many different roles.”\nchris.mccosky@detroitnews.com\ntwitter.com/cmccosky", "url": "https://apnews.com/3ddf50d960074f9eb29fec63d7869204"}