{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:13:28", "date_modify": "2020-05-04 20:13:28", "date_publish": "2018-01-19 06:00:00", "description": "DEAR DR. ROACH: I’m a 75-year-old male with a prostate the size of a Buick. I have to get up four to five times a night to urinate. After about the third time, I cannot get back to sleep. I can...", "filename": "_86e254d8a05d40c3bdf2d2a86bdf82f6_1588623208.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_86e254d8a05d40c3bdf2d2a86bdf82f6_1588623208.html", "title": "Dr. Keith Roach: Buick-size prostate has reader seeking sleep remedy", "title_page": "Dr. Keith Roach: Buick-size prostate has reader seeking sleep remedy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DEAR DR. ROACH: I’m a 75-year-old male with a prostate the size of a Buick. I have to get up four to five times a night to urinate. After about the third time, I cannot get back to sleep. I can get about five hours before the problem occurs. My doctor prescribed 10 mg Ambien, and if I take half of the pill, I can get another two hours. My family history is one of dementia and Alzheimer’s disease. My wife tells me that if I continue to take sleeping pills, I will develop Alzheimer’s too. My question: Do I take the pill to get more sleep, or be tired all day with five hours? — E.H.\nANSWER: There are two questions here: the first is whether there is a better treatment for a Buick-size prostate than zolpidem (Ambien), and the second is how dangerous zolpidem is, in terms of causing Alzheimer’s dementia.\nCertainly, there are effective treatments for most men with symptoms of a large prostate. One class, the alpha blockers, act on the muscles of the prostate, specifically a special kind of muscle, called “smooth muscle.” Because the urethra, which carries the urine, goes straight through the prostate, relaxing the internal muscles of the prostate allows better urine flow. Another class, the 5-alpha reductase inhibitors, prevent the body from making a type of testosterone (dihydrotestosterone) that enlarges the prostate and promotes baldness. Men who don’t do well with medications can consider various surgical procedures, some using cold or laser, to reduce prostate size and improve urine flow. All men can get some benefit in nighttime symptoms by drinking less fluid in the evening and nighttime. Hopefully, with treatment, you can sleep through the night and won’t need a sleeping pill.\nThe second question is about the risk of dementia in people taking sleeping medications, such as zolpidem.\nThere have been a few studies that have suggested an increased risk of developing dementia with regular use of zolpidem and other sleep aids. In general, the more often they are used and the higher the dose, the higher the risk; however, it is hard to estimate the magnitude of the risk based on the types of studies done. I suspect the risk is fairly low. It’s also possible that early dementia, which can sometimes involve sleep disturbances, may have not been recognized, and thus the apparent relationship may not mean that the zolpidem is causing dementia at all.\nHowever, there are many good reasons, especially in older adults, to use as little sleeping medication as possible. I worry about the other risks of zolpidem, including complex sleep behaviors (people have been known to eat and even drive while asleep on zolpidem). This is more common in women on higher doses (above 6.25 mg). The day after taking sleep medications, driving also may be impaired, and fall risk is increased. I’d get back with your general physician and see whether there might be some better ways of treating your automotive-size (should be only walnut-size) prostate.\nDEAR DR. ROACH: What are some healthy desserts to bring to a potluck dinner? — E.T.\nANSWER: I’m fond of desserts using mostly (or all) fresh fruit, but nuts and dark chocolate are other good options for dessert. I’d also say to make them small: Eating a lot after a full meal isn’t necessary.", "url": "https://apnews.com/86e254d8a05d40c3bdf2d2a86bdf82f6"}