{"authors": ["Dave Lavender The Herald-Dispatch Lavender Herald-Dispatch.Com"], "date_download": "2020-05-04 20:09:41", "date_modify": "2020-05-04 20:09:41", "date_publish": "2018-09-28 10:15:00", "description": "Hope you're hungry because we have a full plate of early fall food fests coming our way. Here's a look at a few incoming food festivals around the region this weekend through mid...", "filename": "_825e9595941848cea80e3f1d633ed23d_1588622981.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_825e9595941848cea80e3f1d633ed23d_1588622981.html", "title": "15 great fall food and beer fests", "title_page": "15 great fall food and beer fests", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Hope you’re hungry because we have a full plate of early fall food fests coming our way.\nHere’s a look at a few incoming food festivals around the region this weekend through mid October.\nThe 36th annual Greek Fest\nThe 36th annual Greek Festival is set for Friday-Sunday, Sept. 28-30, on Huntington’s Southside neighborhood at the historic St. George Greek Orthodox Church, 701 11th Ave., Huntington.\nThe fest runs 11 a.m. to 8 p.m. Friday and Saturday and 11:30 a.m. to 4 p.m. Sunday and features Greek foods, music, dancing, a Greek gift shop, tours of the historic church and more.\nVisit www.stgeorgehwv.org/festival/.\nOktoberfest Bahnhof\nThe Tri-State destination German-Appalachian gastropub, Bahnhof WVrsthaus & Biergarten, 745 7th Ave., will be hosting live music, food specials and events at the Biergarten during traditional Oktoberfest season in late September including live polka from 6 to 9 p.m. Saturdays, Sept. 29 and Oct. 6.\nThere will also be a Bahnhof Coin Hunt. During the week of Sept 22-29 coins will be hidden all around Huntington area. Clues will be posted multiple times during the week on their Facebook page. Find a coin and bring it in Sept. 29 to get $5 off per coin or trade it in to win prizes big and small.\nOktoberfest food will include Oxtail Stew, Knackwurst Sausage, Steak Brot, Braised Beer and Apple Pork Shank and a Taste of Germany Smörgåsbord of German Favorites\nFind Bahnhof on Facebook or Twitter @BAHNHOFWV to find out more about their German beer specials and other Oktoberfest events.\nOktoberWest 2018\nSet for 4 to 9 p.m. Saturday, Sept. 29, in Charleston’s West Side, it’s the 11th annual OktoberWest with more than 100 craft brews, and several limited Octoberfest and German varieties, listen to three incredible bands at this year’s festival including Lucky Chops, and Rev Peyton’s Big Damn Band. There’s also Stein holding and best traditional dress contests and new this year is the keg rolling contest.\nAdmission is $35 GA, $20 for non-drinkers and $10 for kids 12 and under. Tickets increase by $5 at the gate.\nGo online at charlestonwestside.org/events/.\nBluefield Oktoberfest\nWith Bramwell no longer hosting its epic Oktoberfest, the city of Bluefield has taken up the tradition. The third annual Oktoberfest in the Park takes place at 3 p.m. Saturday, Sept. 29 at the Bluefield City Park.\nEnjoy a host of regional beers including Starr Hill Brewery, South Street, Blue Mountain, and Chaos Mountain. There will be live music from the 13-piece, Sauerkraut Band from Roanoke, Va., as well as food trucks serving up German foods, as well as burgers and pasta and much more.\nTickets are $25 advance or $30 at the gate for the fest for adults 18 and over.\nGet tickets at Eventbrite.\nRoadkill Cookoff\nThe Pocahontas County mountain town of Marlinton plays host to the world famous Roadkill Cookoff and Autumn Harvest Festival on Saturday.Sept. 29.\nThe West Virginia RoadKill Cook-off is one of the region’s most fun and exciting annual events. In years past, the Food Network, the Travel Channel and the Discovery Channel have all covered this wild and offbeat festival.\nIf one ever wanted to taste exotic dishes like squirrel gravy over biscuits, teriyaki-marinated bear or deer sausage, it will be in Marlinton. Cooking starts at 9 a.m. - judging starts at noon - and grub tasting after 11 a.m. Tasting ticket sales close at 1 p.m. A $5 ticket allows access to the tasting area where one-of-a-kind delicacies can be sampled.\nThis internationally famous event in the mountains is part of the Autumn Harvest Festival (http://pccocwv.com/autumn-harvest-festival/). Marlinton’s Main Street and its avenues will be filled with food and craft vendors.\nWeathered Ground Oktoberfest\nFrom noon to 10 p.m. Saturday, Sept. 29, Weathered Ground Brewery, 2027 Flat Top Road, Cool Ridge, will host its second annual Oktoberfest. They will be kicking off the celebrations with the release of “AJ’s Festbier,” as well as live music, a German inspired menu brought to you by A&J Catering, pretzel necklaces, give aways, corn hole tournament, and much more.\nCall 304) 223-2500 for more info or go online at http://www.weatheredgroundbrewery.com/ to find out more about Weathered Ground whose Farmhouse Ale Rad Roots, was just named one of the 50 best beers in America in Men’s Journal.\nDevils Backbone Hoopla\nJust over the mountains in Roseland, Virginia, Devils Backbone Hoopla is set for Sept. 28-30 with nearly 20 musical acts (including Tyler Childers and Larry Keel, Sarah Shook and the Disarmers) as well as camping, workshops & outdoor activities, award-winning craft beer and great eats. Kids 12 and under get in free. Two day adult passes range from $60 (for Saturday and Sunday) to $95 for Friday and Saturday.\nPrinceton AutumnFest\nCelebrate fall with the fam friendly Princeton Autumn Fest taking place from 10 a.m. to 5 p.m. Saturday, Sept. 29 along Mercer Street in downtown. Enjoy good food, entertainment, activities for children, dog show, contests and more at this event sponsored by the Princeton-Mercer County Chamber of Commerce.\nCall 304-487-1502 or go online at http://www.frontiernet.net/~pmccc/autumnfest/index.htm for a full schedule and more info.\nBurning Bike 2018\nFayetteville’s Arrowhead Bike Farm, located at 8263 Gatewood Road, hosts the Burning Bike 2018 Friday and Saturday, Sept. 28-29 with two days of fun including live music, food and beer specials, fire twirlers and Bicycle the Band will be playing four hours.\nThere will be things for the kiddos, and the bike burning will commence at dusk on Saturday night.\nCall 304-900-5501 for more info.\nThe West Virginia Pumpkin Festival\nSet for Thursday-Sunday, Oct. 4-7 at Milton’s West Virginia Pumpkin Park, the West Virginia Pumpkin Festival features all things pumpkin from baking and cooking contests, to pumpkin food booths, contests and, of course, the giant pumpkin auction to raise money for scholarships.\nHeld since 1986, the West Virginia Pumpkin Festival, which has turned into one of the state’s largest fests with more than 50,000 people travel to Milton to participate in our celebration of the pumpkin harvest.\nThere’s also one of the largest arts and crafts selections in the region with more than 100 crafters as well as food and business vendors, and a wide variety of demonstrations as area master craftsmen share their expertise in areas such as blacksmithing, pottery making, quilting and woodworking, a mountain men encampment, and lots of old-time demonstrations like sorghum making, and much more, along with many business booths.\nHours will be 9 a.m. to 9 p.m. Thursday through Saturday and 9 a.m. to 6 p.m. Sunday. Admission is $8 Thursday and Friday and $10 on Saturday and Sunday. Children 5 and under are free. There’s a group rate, as well. Parking is free.\nCall 304-743-8774 for more information or visit wvpumpkinpark.com.\nHoptoberFest\nHoptoberfest is set to run 3 to 7 p.m. Saturday, Oct. 6 at the East Kentucky Expo Center in Pikeville, Ky.\nEnjoy more than 80 craft beers from all over the globe paired with local music and food vendors.GA tickets are $30 and include 15 sample tickets and a free sampling glass. VIP is $50 for early entry, free wings for one hour, t-shirt and a sampling glass. Designated driver tickets are $10 and includes entry and free soft drinks.\nWing Fling\nThe SMG managed Big Sandy Superstore Arena’s 2018 Wing Fling is set for noon to 3 p.m. Saturday, Oct. 13 with what football tailgate fans will recognize as both food groups - chicken wings and beer.\nThe 2018 Wing Fling sponsored in part by Huntington Bank, Republic Services, Sprint and media sponsors Kindred Communications, WOWK and the Herald Dispatch. The event will feature all-you-can-eat wings with special sauces and dry rubs from a who’s who of Tri State area restaurants including, Roosters, SAVOR Big Sandy, Texas Roadhouse and many more to be added by event day. The event includes a “King of the Wings” wing eating contest sponsored by Roosters. A Battle for Bragging Rights, the fan favorite contest in which the restaurant crowned fan favorite will receive a traveling trophy.\nTickets are $20 for all-you-can-eat wings. There will also be a limited number of VIP tickets for $30, which includes two drink vouchers (for beer or soft drinks), 30 minutes early entry and special seating inside the Arena.\nIf you are interested in your restaurant becoming a participant, contact Jennifer Sturgeon at 304-696-5563 or Jennifer@bigsandyarena.com .\nThe Cast Iron Cook-Off\nGet your cast-iron in the fire and the grease melting for the eighth annual Cast-Iron Cook-Off as part of the Way Back Weekend series at Heritage Farm Museum and Village.\nThis year’s event is set for 10 a.m. to 3 p.m. Saturday, Oct. 13, at the village, 3300 Harvey Road, Huntington, as part of the Fall Fest which also features the Mountain Games, during which teams compete in an obstacle course run, a tomahawk throw, coal shoveling, rock climbing and other mountain-themed tasks.\nFall Fest will also feature wagon rides, cider, and lots of farm fall fun.\nHops and Heat\nThe East End Bazaar in Charleston will host Hop & Heat from 2 to 6 p.m. Oct. 20 as a FestivALL Fall event. Hops & Heat, an Appalachian Craft Beer and Chili Cookoff celebrating the close to the Open-Air Bazaar season, will encompass more than 80 craft beers from more than 20 Appalachian breweries and crown the Bazaar’s best chili in a chili cookoff competition between 10+ Bazaar cooks.\nThe Hops & Heat Chili Cookoff winner will receive an award created by an East End Bazaar artisan.\nFeatured again this year is the “Best Chili Beer Competition.” Won last year by Pubstomper and in 2016 by Big Timber, the competition was a big hit. It will see returning competitors such as Big Timber, Country Boy, and Foothills. Several new breweries will enter the competition in 2018.\nOnly 500 tickets will be sold. Drinker tickets cost $35 and include 5 oz. samples of beer, unlimited chili samples, three 12 oz. beer tickets, and one branded tasting cup. Nondrinker tickets are $20 and include unlimited chili samples and access to East End Bazaar food and artisan vendors and the Hops & Heat concert featuring Suga Grits from Washington D.C.\nGo online at https://www.cwvmainstreets.org/hops--heat.html for more info.\nPutnam County Craft Beer Festival\nThe Sleepy Hollow Golf Club will be hosting a Putnam County Craft Beer Festival from noon to 4 p.m. Saturday, Nov. 4 at the Golf Club.\nEnjoy an afternoon of live music, food trucks, arts and crafts vendors and beers from around West Virginia and the region.\nGeneral Admission Tickets: $28 (includes entrance, 12 tasting tickets and commemorative tasting mug)\nVIP Tickets: $38 (includes 11 a.m. (hour early) advance entrance, VIP parking, t-shirt, commemorative tasting mug and 16 tasting tickets)\nComplimentary shuttle service will be provided by the Pace Foundation. The pick-up and drop-off locations will be Valley Park and West Teays Elementary. A $2 (per passenger) donation is welcome!\nThis event is for adults 21 years and older.\nIf you would like vendor information, please contact via email: sleepygolfevents@gmail.com and go online at https://sleepy-hollow-golf-club-events.ticketleap.com/putnam-county-craft-beer-festival/ for more general information and to get tickets.", "url": "https://apnews.com/825e9595941848cea80e3f1d633ed23d"}