{"authors": ["Christian Hill"], "date_download": "2020-05-04 20:21:27", "date_modify": "2020-05-04 20:21:27", "date_publish": "2018-03-11 08:00:00", "description": "Last March, shortly after Stacey Yates started working in Eugene’s Whiteaker neighborhood, a thief broke into her car and stole a $1,200 laptop computer. Yates filed a police report online...", "filename": "_124336090bf04ac0bb443dd3604deb90_1588623687.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_124336090bf04ac0bb443dd3604deb90_1588623687.html", "title": "Thinning blue line", "title_page": "Thinning blue line", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Last March, shortly after Stacey Yates started working in Eugene’s Whiteaker neighborhood, a thief broke into her car and stole a $1,200 laptop computer.\nYates filed a police report online and then resigned herself to the fact the thief — who had committed a felony — would not be caught. No one from the police department followed up on her report, she said.\nOther residents have told Yates, a board member of the neighborhood’s association, that they don’t bother to report property crimes because police pay little or no attention to them.\n“They know nothing is going to happen,” Yates said.\nEugene Police Department statistics show that residents are right.\nPolice or 911 dispatch supervisors disregarded one-third of the daily average calls that the department received last year. They did so because the calls were deemed low priority and no officer would be available — either immediately or hours later — to respond, David James, the interim police director, told city councilors recently.\nAnd when they do respond to crime reports, it’s taking longer for officers to get to the scene.\nPolice officials say there’s a simple reason for this decline in police service: Too few officers are on duty to respond to a growing number of calls for service.\n“The calls just get so stacked,” said Detective Patrick Willis, the police union’s vice president. “Our officers just can’t keep up with them.”\nHe acknowledged many low-level calls fall by the wayside and called the situation “a disservice to the community.”\nOn a typical day, a minimum of eight or nine officers at a time patrol the 44-square-mile city, according to the department. At night, between 13 and 15 officers are on duty.\nLast year, police received an average 220 calls a day for service, up 20 percent from three years earlier.\nOfficers continue to put a high priority on crimes in progress and will respond in force during emergencies. Neighborhood leaders say they provide timely response in those situations.\nBut the litany of offenses that draw late or no police response chips away at residents’ sense of security — in their neighborhoods and in the community at large, neighborhood leaders say.\nCity leaders are taking notice. They have launched a broad discussion about public safety that could eventually lead to a ballot measure to pay for more police officers.\nStaffing will be a major issue for Eugene’s next police chief. Three candidates for the job will be interviewed this week. City Manager Jon Ruiz could announce his hire by the end of the month.\n“Amongst our candidates, this will not be a foreign conversation,” James said about staffing issues.\nTo expand the force, residents may be asked to pay more in taxes even as the police department’s budget has grown by nearly 11 percent in four years.\nThe department spends more of the city’s property tax-supported general fund on its operations than any other city department.\nOperating the department this fiscal year is projected to cost $53.2 million, or $5 million more, than it did four years ago. Most of the annual increases pay for hikes in compensation, including salaries and benefits for employees.\nIt wouldn’t be unprecedented if city officials eventually decide to ask voters to approve a public safety operating levy.\nIn 2015, voters approved a separate tax levy to improve and expand library services. In May, voters will decide another separate tax levy to improve the parks and recreation system. That measure includes money to increase security in city parks and along bike paths.\nAnd the current law enforcement discussion isn’t limited to police officers. City officials say the 911 dispatch center and city prosecutor’s office need more employees to respond to greater demand. In addition, the cost for the city to rent jail beds from Lane County and the city of Springfield continues to climb.\nKeeping up with growth\nThe long waits for police response are among the most visible signs for residents of a public safety system under pressure.\nIn a Feb. 20 presentation to city councilors, James said Eugene’s population has grown by 7,000 in four years, but the number of sworn officers has remained unchanged.\nThe force has the budget to pay for 192 sworn officers; seven of the positions are vacant. Sworn officers include patrol officers, detectives, officers assigned to the downtown and university details, and department brass. The department employs 121 patrol officers.\nWillis, vice president of the Eugene Police Employees’ Association, said activation several years ago of the downtown detail — nine officers and a sergeant — added a couple of new officers per shift downtown but “barely scratched the surface” of citywide needs.\n“We’ve watched the population grow, and we’ve watched the police department not grow,” he said.\nBudget documents show the department’s entire staffing, including sworn officers, 911 dispatchers and civilian employees, has remained virtually unchanged since at least 2009.\nThe statistics also show officers are taking longer on average to respond to calls for service from the public.\nJames attributed the increase to two main factors: more violent crimes, which take officers longer to investigate, and the department’s emphasis on training and techniques to defuse tense encounters and reduce the use of physical force.\nOfficers often respond to volatile calls, such as domestic disputes, individuals in emotional crisis, and homeless people who are intoxicated and disturbing the peace.\nThe recent emphasis in policing nationally is for officers to be less heavy-handed. Officers use communication and other techniques to gain compliance rather than quickly turning to more aggressive tactics that can lead to violent or deadly encounters.\nJames told councilors that during a recent ride-along with an officer, he and an officer were dispatched to a report of a drunken homeless man who had stolen mail and broken into a nearby building before passing out. James, who observed the encounter and arrest, noted the man was difficult and was known to have “a very long record of activity with us, sometimes not pleasant.”\n“His state of intoxication was so great that he wasn’t a great deal of a problem, but (the officers) handled it delicately, emphatically, and I was very proud of them for the work they did that night. But it takes time.”\nIn that case, it took a lieutenant and two officers more than a hour to clear that call for service, he said.\nIn an interview, James said the department is committed to that type of policing approach.\n“It’s not a platitude, it’s not something that’s being forced upon them,” he said. “Training, education and the experience of a success further gives confidence to officers that this is the correct approach.”\nOn a per-capita basis, the force has 1.14 sworn officers per 1,000 residents, down from 1.2 in 2014.\nJust to maintain the current staffing rate into 2022, when Eugene’s population is expected to reach 175,600, the department would need to hire nine officers during the next five years.\n“This would only help maintain the same service levels that we have today,” James said.\nTo increase the rate to 1.2 officers per 1,000 residents, for example, James said the department would need to add 12 officers — and continue adding officers to maintain that rate as Eugene’s population grows.\nIndependent data shows the size of Eugene’s police force lags behind the national average for departments serving communities with populations of more than 25,000.\nGoverning Magazine, drawing on police data reported to the Federal Bureau of Investigation, reported those communities had an average of 16.8 officers for every 10,000 residents in 2016.\nEugene’s rate of 11.4 is based on 188 officers, according to the magazine’s online database.\nSalem, Vancouver, Wash., and Bellevue, Wash., all similarly sized cities, had rates of 11.4, 11 and 12.3, respectively, according to the database. The rate for neighboring Springfield was 10.6. Other communities of similar size to Eugene had lower and higher rates. Salinas, Calif., had a rate of 8.4; Peoria, Ariz., 10.5; Sioux Falls, S.D., 13.6; and Springfield, Mo., 20.4.\nPolicing isn’t cheap\nHiring more officers would be expensive. A veteran patrol officer costs taxpayers up to $144,000 a year in pay and benefits, according to the department. An entry-level patrol officer earns at least $60,528 a year under the current union contract. The cost of that officer’s benefits wasn’t available.\nThe current contract, which expires in June 2019, calls for officers and other employees to receive 2 percent annual raises.\nNeighborhood leaders say they’re aware of the department’s staffing limitations.\nYates, the Whiteaker Community Council board member, said police response has been timely in emergencies, but the lack of regular officer presence in the neighborhood is a problem.\nGroups of menacing individuals loiter in the parks and frequently camp along the Willamette River, she said, and many residents are afraid of using the riverside bike path.\nNeighbors have called police to report drug sales and information about crime suspects, but have been told no officer is available to follow up, Yates said.\nYet she praised police for their neighborhood outreach and said officers are doing the best they can with the limitations.\n“We just want more of what works,” Yates said.\nThomasina “Tomi” Bates, chairwoman of Churchill Area Neighbors, agreed that police response in emergencies is timely, but regular patrol presence and follow-up to nonemergency incidents is lacking.\nSimilar to Whiteaker, Churchill-area residents in southwest Eugene have concerns about illegal camping and other activities along the Fern Ridge Path as well as petty theft and vehicle break-ins.\n“The residents would love to see more of a presence on the bike path ... just something to preemptively make it a safer place for everybody,” Bates said. “People would love to use our bike path more. They’d love to spend more time in our parks, but they don’t feel comfortable doing so.”\nBoth residents said seeing more patrol vehicles roll through their neighborhoods would be reassuring.\nWillis, the detective, said he understands residents’ frustration. He knows there are open cases with suspect information not being followed up on because of too few investigators.\nOfficers once had time between calls to drive around neighborhoods and make stops if they observed suspicious activity, Willis said.\nThat doesn’t happen much now, he said.\n“They just don’t have the time,” Willis said. “If they do, it’s the exception to the rule.”\nDuring their recent discussion about law enforcement, city councilors acknowledged more needs to be done.\n“I recognize our efforts downtown (to improve safety) have been very successful, but I’m beginning to hear more and more” that problems are moving to other parts of town, southwest Councilor Chris Pryor said.\nCouncilor Emily Semple, whose ward includes downtown, said increased police presence in the area has helped, but problems are returning.\nShe said the city needs more police officers.\n“Bottom line, how much is this going to cost for another 12 officers?” she asked. “How much do we need for the 911 center (to hire more call takers and dispatchers)?\n“Do we need more jail beds and, if so, how much does this cost? Budget is coming up now. This is critical,” she said.\nRuiz, the city manager, said this “is not just a couple hundred thousands of dollars solution.\n“To do this well, it’s multiple millions of ongoing dollars” to substantially improve policing and criminal justice in Eugene, he said.\nWillis said paying more taxes for city services is unpopular, but the issue comes down to priorities.\n“Do we not want to pay more and continue on with what we have, which is really not a good option for our community? Or do we to decrease services elsewhere to pay for a better police department?\n“There’s no easy answer,” he added. “Ultimately, we have to fund the police department properly somewhere, someway, somehow.”", "url": "https://apnews.com/124336090bf04ac0bb443dd3604deb90"}