{"authors": ["Lynn Henning", "The Detroit News"], "date_download": "2020-05-04 20:23:25", "date_modify": "2020-05-04 20:23:25", "date_publish": "2018-03-15 21:21:54", "description": "Lakeland, Fla. — It's a rare day in Lakeland — by 2018's weather standards, anyway. After weeks of solid-80s temps, a breeze with cold teeth is chomping from the northeast into kid players...", "filename": "_a5e87a22e606453590b767bdd9480d15_1588623805.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a5e87a22e606453590b767bdd9480d15_1588623805.html", "title": "Diamonds are Tigers prospects' back fields of dreams", "title_page": "Diamonds are Tigers prospects' back fields of dreams", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lakeland, Fla. — It’s a rare day in Lakeland — by 2018′s weather standards, anyway.\nAfter weeks of solid-80s temps, a breeze with cold teeth is chomping from the northeast into kid players wearing navy-blue Tigers hoodies. They gather in bright 10 a.m. sun on four back diamonds that are an instructional backbone of the TigerTown complex: the Cobb, Cochrane, Gehringer, and Heilmann fields.\nThey have had their warm-up stretching exercises and calisthenics. Now they’re into long-toss pairings with teammates, stretching and building young arms. The sounds of balls slapping into leather gloves is like a steady drum solo.\nIt is March 13 and the first day of full-squad workouts for Tigers prospects and minor-leaguers whose lives are shaped a few hundred yards from Marchant Stadium’s Publix Field, where the big boys are deep into their Grapefruit League schedule.\nAn airhorn sounds at 10:40 a.m. Players, a dozen to two dozen on each of the four fields, gather with coaches and instructors. Orders and objectives are laid out.\nOn the Cochrane diamond, coaches hit bouncing fungoes to an alternating cast of infielders in a bid to sharpen eyes, timing, and responses.\nOver at Gehringer, there are simulated bunting drills. Here, rather than tap bunts with bats, a pitcher feigns his delivery as coaches roll grounders to be grabbed by various defenders. The ball is gloved by either a pitcher or an infielder as coaches, playing the role of catcher, yell to the players: “1, 1, 1, 1,” signifying first base as being the best option for an out, or “3, 3, 3, 3,” for third.\nHeilmann’s baseball laboratory today features outfielders snagging fungo-struck, ground-ball base hits followed by relay pegs to home plate. But there’s no catcher taking throws. Instead, a white bucket turned upside down is the target. The Tigers have been bothered by too many off-target outfield pegs and are installing within their developmental system a tighter focus on accuracy.\nMeanwhile, across the pea-gravel walkway that separates the Heilmann and Cobb diamonds, pitchers are getting a workout on Cobb’s mound. Today’s session is all about holding runners. About coming to set with a runner on first and making quick-strike throws minus balks, all in a bid to keep base thievery to a minimum.\nIn the background, music plays over loudspeakers mounted on the observation deck that offers a 360-degree view of the TigerTown quadrant. Earth, Wind and Fire, Kiss, AC/DC, Van Halen, hip-hop, Latin groups — it’s a mixed bag that tends to enliven what was, in the view of new Tigers manager Ron Gardenhire, a dead atmosphere that benefited neither players nor coaches. They needed, if not dance music, something more energized than TigerTown’s back-lot silence.\nIt isn’t only the quadrant fields where kids are being groomed in temperatures that now are slowly rising from the 50s into the 60s. There are two more fields, one just south of the quadrant, near the old minor-league clubhouse. And another adjacent to it, just east of the Marchant Stadium tract, which now features new clubhouses and office buildings that were part of a $50 million renovation of TigerTown and the Publix Field-Marchant overhaul.\nHere, the youngest farmhands are working either on drag-bunting habits or conventional PFP — pitchers’ fielding practice, which is heavy on pitchers covering first and taking in stride throws from a first or second baseman.\nThe players and groups rotate, from field to field, each taking turns at the various on-field seminars and clinics that are part of all big-league teams’ development process. It’s a galaxy headed by Dave Littliefield, the Tigers’ vice president of baseball development, who works with Tigers general manager Al Avila and with assistant GM David Chadd on schooling talented kids in how to play, with big-league sophistication, a game as difficult and as precise as baseball.\nThe fields are dotted with dozens of coaches and instructors. All the Tigers’ minor-league managers are involved. So are their coaches. Roving instructors like Bruce Fields (hitting) and A.J. Sager (pitching) are on the grounds every day, as are their partners, Scott Fletcher and Jaime Garcia, as well as outfield instructor Gene Roof, and catching guru Joe DePastino. Fletcher has moved to the hitting side as the Tigers in 2018 deploy a new infield tutor, Jose Valentin, who was an infield regular with the Brewers, White Sox, and other clubs from 1992-2007.\nThey are baseball’s classroom professors. They are the course instructors assigned to elevate skills and help youngsters become all that their talents allow.\nBaseball, life skills\nAnd that’s only the on-field part of turning teens and young men into adults who must deal not only with baseball’s challenges, but with life.\nSharon Lockwood, the Tigers’ international player programs coordinator, earlier this month spent a day at the bank with Tigers prospects from Venzuela and the Dominican Republic. They were counseled on how to open checking accounts.\n“Player development is not just hitting fastballs and blocking pitches in the dirt,” said Littlefield, squinting through sunglasses as he watched the various fields and prospects. “The players all went to a musical together the other night.”\nThe Tigers don’t suggest stage plays are as nurturing as lunch time, which is why, precisely at 12:20, players and staff head for their clubhouse quarters and for a mid-day meal designed to be heavy on protein, with lean meats, chicken wraps, fruits, vegetables, and healthy carbs (brown rice, quinoa, etc.) all part of the banquet.\nA team’s broader investment in player development joined last year with the TigerTown makeover to allow the Tigers and prospects new liberties. Players can now stay during off-seasons in the player dorms. They can take year-round advantage of the biggest weight-lifting center offered by any minor-league headquarters anywhere. They are attended by medical staff and have coaches at their disposal year-round. And the players aren’t charged a dime.\nAn hour after they broke for lunch, players are back on the fields, stretching. Most will be joining four teams for intra-squad games on the Cochrane and Gehringer fields. Other, younger players who aren’t part of the game rosters head to Heilmann and Cobb for batting practice.\nIntra-squad games are serious, which can be deduced as laptops are opened by staffers behind each batting cage and radar guns are uncased. These games are chronicled for pitch counts and at-bats and innings are not necessarily 1-2-3 frames.\n“Roll it,” one of the managers or coaches will yell, meaning it’s time for fielders to head to their bench and for the team at-bat to grab its gloves.\nThere are no umpires. Rather, catchers call balls and strikes. And given that their teammates are on the field and at bat, justice tends to be blind.\nThe starting pitchers for afternoon games that will run two hours are Artie Lewicki (Cochrane) and Austin Sodders (Gehringer).\nThey are replaced a few innings later by Franklin Perez, Tyler Alexander, Gregory Soto, Victor Alcantara, and others.\nThe hitters are faring better at Cochrane. Ignacio Valdez, an outfielder from the Dominican Republic, cracks a homer off Lewicki. So, too, does catcher Brady Policelli, a 13th-round pick in 2016 from Towson University, against prospect-star Perez.\nAcross the path at Gehringer, outfielder Cam Gibson swats a hanging Alexander breaking pitch for an opposite-field single. Alexander gets him back when he catches Gibson leaning. Gibson finally is tagged after a long to-and-fro dance that might have pleased Gibson’s dad, Kirk, who was never into conceding rundowns.\nThe day’s formalities cease at 3:20. Players head for the clubhouse, many of them destined for a post-workout stint in the weight room.\nTrying to climb the ladder\nA player who earlier was in left field in the Gehringer game is familiar to those who follow Tigers prospects. He is Christin Stewart, the left-handed power-puncher who has cracked 58 home runs the past two seasons at Single A and at Double A.\nStewart, 24, was a first-round pick three years ago but wasn’t invited to big-league camp in 2018. He does not acknowledge bruises. But they were sustained. He wants only to play his way into the Tigers’ lineup, the sooner the better. The Tigers are thinking about Stewart as a September call-up — if his bat and defense smooth this season at Erie and, almost certainly, later at Triple A Toledo.\n“Every day I’m not here,” he says of the TigerTown complex, “I’m one day closer to the big leagues.”\nIt is his way of saying that Erie and Toledo are his corridors to Comerica Park. Stewart played at the University of Tennessee, but even as a teen at Providence Christian Academy, in Lilburn, Ga., the Tigers were paying attention. They took him with their 34th overall pick in 2015 after a 6-foot, 205-pound outfielder had unveiled a gift every big-league team loves: left-handed power.\n“Pretty long day today,” said Stewart, talking outside the clubhouse after he had showered and changed into casual clothes.\nThe day for Stewart began with an alarm wake-up at 6:45 a.m. He lives during spring camp in a rented house he shares with fellow Tigers prospects Grayson Greiner, Mike Gerber, A.J. Simcox, and Will Maddox. Breakfast was shared with Simcox and Maddox at a diner up the road from TigerTown.\nHe was at the clubhouse by 8 and on the field an hour later.\nThis is a critical year for Stewart, who has been working steadily with Roof to polish his defense in left field. He has two wondrous traits the Tigers love and need: that capacity to put a ball in the seats, as well as a splendid batting eye, which is how you put together a .363 on-base percentage in the minors, with 142 walks the past two seasons in 268 games.\nWhat no one, including Stewart, can explain is why there were such peculiar splits to his 2017 season at Erie: .989 home-park OPS, and only .697 on the road.\n“Faced the same pitching,” Stewart said, shaking his head.\nThere is no theory, no suspicions, no sense for why the numbers were so ridiculously lopsided in favor of his home ballpark. Rather, he says, it’s all part of a single goal in 2018.\n“Obviously, consistency,” said Stewart, whose career minor-league batting average is .262, and who averages a strikeout per game. “When I get to the bigs, I want to stay there.”\nSo does Sodders, a 22-year-old starter and left-hander the Tigers nabbed two years ago with a seventh-round pick when he was pitching at California-Riverside. Sodders had a neat first full year in professional ball: 11-5, with a 1.81 ERA, and 0.96 WHIP, splitting time between two Single A stops, at West Michigan and Lakeland.\nSodders threw 139 innings last year, with 122 strikeouts and only 30 walks. Tigers development generals are chirping this spring because Sodders has added a couple of mph to his fastball.\n“I focused on weight-training during the offseason and using my body more to pull my arm through,” said Sodders, who is 6-3, 210.\nHe is a California native who has habits often associated with the left coast’s culture. Sodders awakes each morning at 6:15 and does 10 minutes of meditation.\n“Been doing it since the beginning of last offseason and it really helps,” said Sodders, who shares an apartment with prospects Daniel Pinero and Josh Lester. “It’s good for mental focus and for concentration.”\nOn this Tuesday morning, he moved from meditation to making a breakfast shake from fruits, vegetables, and coconut shavings.\nHe arrived at the clubhouse at 7:10 and headed for the cafeteria for a more substantial meal. He then went through a shoulder-strengthening routine ahead of formal warm-ups and drills at 9:10.\nSodders was a political science major at Riverside and probably would have gone to law school had professional baseball not been on his docket. His fastball now can run anywhere from 89-93 and “is definitely a little harder than last year.”\nThis, he explains, helps when his delivery carries deception that can also help his curveball and change-up.\nHe was pleased with his stint in the intra-squad game, which followed a lunch straight from the Tigers’ nutritional Bible: grilled chicken wrap, spinach, black beans and guacamole.\nLater that night, he said, he would be cooking at home — go ahead and guess fish — before he and his roomies would take in something on Netflix, given that their apartment doesn’t offer a full cable menu. Or, he would dig into the book he now is reading: “Grit: The Power of Passion and Perseverance,” a success through psychology guide by Carol S. Dweck.\nThen the lights would be cut and Sodders would head for bed. It’s anywhere from 8 to 81/2 hours of slumber for this 22-year-old. Sodders believes a day on the back fields at TigerTown, or anywhere in baseball’s farm-team cosmos, are more comfortable and productive when a prospect serious about his future isn’t yawning.\nTomorrow would feature another day of regimentation and rigors. Indeed, this business of learning baseball, of making a complex game instinctual, takes time, Sodders acknowledged.\nIt was something perhaps for he, and his young colleagues, to collectively meditate upon.\nlynn.henning@detroitnews.com\ntwitter.com/Lynn_Henning", "url": "https://apnews.com/a5e87a22e606453590b767bdd9480d15"}