{"authors": ["Joe Tjaden"], "date_download": "2020-05-04 20:11:55", "date_modify": "2020-05-04 20:11:55", "date_publish": "2018-07-13 11:49:00", "description": "Free-agent guard Isaiah Thomas has agreed to a one-year, $2 million deal with the Denver Nuggets, league sources told ESPN. This is a high-reward, low-risk gamble for Denver, who aspire to reach...", "filename": "_828f711c7de54e928a3a539c03f45cab_1588623115.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_828f711c7de54e928a3a539c03f45cab_1588623115.html", "title": "Joe's Morning Sports-Friday, July 13, 2018", "title_page": "Joe's Morning Sports-Friday, July 13, 2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Free-agent guard Isaiah Thomas has agreed to a one-year, $2 million deal with the Denver Nuggets, league sources told ESPN. This is a high-reward, low-risk gamble for Denver, who aspire to reach the Western Conference playoffs this season. For Thomas, it is a chance to re-establish himself on a winning team, stay healthy and re-enter free agency next summer. The Nuggets are planning for Thomas, who is rehabbing from hip surgery, to play a significant scoring and playmaking role off Denver’s bench. Thomas, 29, has been steadily progressing in rehabilitation since an early-April arthroscopic cleanup procedure on the right hip. He averaged 28.9 points per game for the Boston Celtics in 2016-17, but an injury on the same right hip that cut short his playoffs in 2017 and cost him eight months of rehab, and trades to the Cleveland Cavaliers & Los Angeles Lakers have been his recent trek.\nA person with knowledge of the deal says the Brooklyn Nets have agreed to trade Jeremy Lin to the Atlanta Hawks. The Nets made the move early this morning to ease their logjam at point guard. ESPN first reported the deal, saying Brooklyn and Atlanta would swap future second-round picks. Lin has a year left on his contract, and the trade ends his injury-plagued stint in Brooklyn. He ruptured the patella tendon in his right knee during the Nets’ opener last season, and while he was out Spencer Dinwiddie stepped in and became one of the NBA’s most improved players. Brooklyn also has D’Angelo Russell at point guard after acquiring him from the Los Angeles Lakers.\nFormer Omaha Burke standout Shereef Mitchell committed to Creighton last night according to the Omaha World Herald. Mitchell will add some local flavor to a program that has had high-end Omaha talent recently. Omaha North 2015 graduate Justin Patton and 2014 Omaha Benson graduate Khyri Thomas played for the Jays and went on to be NBA draft picks. Mitchell turned 18 this month, so he is young for his grade, and by reclassifying he will enroll at Creighton in 2019. The 6’1 guard was the captain of this year’s Omaha World Herald All-Nebraska basketball team and was the Nebraska Gatorade boys basketball player of the year after averaging 24.6 points and 3.8 assists as a senior at Burke. Mitchell also had scholarship offers from UNO, Drake, Kent State, LIU Brooklyn, Loyola of Chicago, Murray State, Robert Morris, South Dakota State and UMKC. Creighton is set to have Davion Mintz and Marcus Zegarowski at point guard in 2019-20.\nFormer Wimbledon men’s doubles champions Jack Sock and Mike Bryan are into another All England Club final at their first Grand Slam playing together. The American duo cut off a comeback attempt from 15th-seeded Dominic Inglot and Franko Skugor to win 6-3, 6-1, 6-7 (11), 6-7 (4), 6-4. Sock and Bryan had six match points in the third set, but were taken the distance. The former Lincoln native Sock and his teammate will face Raven Klaasen and Michael Venus in Saturday’s final. Sock won the title in 2014 playing alongside Canadian Vasek Pospisil.\nFormer Husker Taylor Edwards will be returning to Bowlin Stadium, this time as a volunteer assistant for the Nebraska softball team according to the Lincoln Journal Star. Edwards, who is currently playing with the United States National Team in the International Cup, was a four-year starter (2011-14) and an All-American at Nebraska. She will work with NU’s catchers. Edwards’ twin sister Tatum was a graduate assistant for the Huskers in 2016 and 2017, and their younger sister Tristen is about to enter her junior season at NU.\nThe Northeast Hawks women’s basketball team has added four new recruits to its 2018-19 roster. Coach Matt Svehla said he has signed Jacalyn Schwanebeck of Hyannis, Eriana Brown of Iowa, Emina Hadzihusejnovic of Bosnia and Herzegovia, and Katie Richards of England. Schwanebeck, a 5’10 forward, helped lead Hyannis to a 21-4 fourth place finish at the state tournament this year. She averaged eleven points per game, seven rebounds, and a team-high 3.2 steals. The Hawks finished 25-5 last season.\nThree players are tied at the top after the first round of the 51st Nebraska Junior Amateur Championship at Elks Country Club after yesterday. The trio tied at 71 (-1) includes defending champion Tucker Knaak of Plainview, Omaha’s Josh Peters and Grand Island’s Cade McCallum. After today’s second round, the field will be cut to the low 40 scores and ties for Saturday’s final round. Other scores include Norfolk’s Kellen Rossman (73); Creighton’s Chase Largen (76); Norfolk’s Jake Kluver (76); Atkinson’s Mason Hale (76); Fordyce’ Matthew Schaefer (77); Norfolk’s Isaac Heimes (79); Columbus’ Shane Hess (80); Norfolk’s John Canham (81); Bancroft’s Devin Darnell (81); Wisner’s Rockney Peck (82); Scribner’s Teague Stewart (83); & Wayne’s Tanner Walling (92).\nKaitlyn Hanna of Omaha took the lead after the first round of the 18th Nebraska Girls’ Amateur Championship at Elks Country Club yesterday. Hanna fired a round of 75 and leads by two strokes over two players at 77, including defending champion Ricki Hickstein of Chadron and Wahoo’s Lauren Thiele. The final round begins today at 12:30, with the leaders set to tee-off at 2:30. Other scores included Columbus’ Aspen Luebbe (78); Hartington’s Cassidy Ulrich (87); Snyder’s Livia Hunke (97); & Columbus’ Ashley Warner (113).\nLocal Schedule: Memphis at Omaha Storm Chasers (Bsbl-7:05).\nLocal Scores: Nfk Seniors 8-4 Nebraska City 3-9 (Bsbl DH); Memphis 6 Omaha Storm Chasers 3 (Bsbl).\nCBS Sports Radio at 105.9 WJAG-FM & 780 AM Mon-Fri at 6:00 PM; Sat at 4:00; & Sun at 1:00. Also, the home of the Kansas City Royals!\nINTERLEAGUE\nFinal Philadelphia 5 Baltimore 4\n---\nAMERICAN LEAGUE\nFinal Oakland 6 Houston 4\nFinal Boston 6 Toronto 4\nFinal N-Y Yankees 7 Cleveland 4\nFinal Minnesota 5 Tampa Bay 1\nFinal L-A Angels 11 Seattle 2\n---\nNATIONAL LEAGUE\nFinal Colorado 5 Arizona 1\nFinal Pittsburgh 6 Milwaukee 3\nFinal Washington 5 N-Y Mets 4\nFinal L-A Dodgers 3 San Diego 2", "url": "https://apnews.com/828f711c7de54e928a3a539c03f45cab"}