{"authors": ["Amaris Castillo", "Acastillo Lowellsun.Com"], "date_download": "2020-05-04 20:13:45", "date_modify": "2020-05-04 20:13:45", "date_publish": "2018-11-04 04:13:41", "description": "DRACUT -- Dracut's fall Annual Town Meeting will begin at 7:30 p.m. Monday in the Lester G. Richardson Center for the Performing Arts at Dracut High School, 1540 Lakeview Ave. Below are some...", "filename": "_963f822d448242a8b2ebc2811bfeed33_1588623225.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_963f822d448242a8b2ebc2811bfeed33_1588623225.html", "title": "Up for Votes at Dracut Town Meeting Monday Night", "title_page": "Up for Votes at Dracut Town Meeting Monday Night", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DRACUT -- Dracut’s fall Annual Town Meeting will begin at 7:30 p.m. Monday in the Lester G. Richardson Center for the Performing Arts at Dracut High School, 1540 Lakeview Ave.\nBelow are some highlights:\n* Article 9, which looks to add existing town-owned parcels to the approximate 17 acre parcel of land at 144 Greenmont Ave. and on a .92 parcel of land located at 1530 Bridge St. for the purposes of designing and developing senior housing on the properties, according to the warrant.\n“I went to the Housing Authority to request that they convey it back to the town for a nominal fee, a dollar, and for us to be able to seek proposals to develop senior affordable housing there,” Town Manager Jim Duggan said recently. “It could be a for-profit, non-profit developer. We’re looking to have a long-term land lease.” Duggan said Articles 9 and 10 go hand in hand.\n* Article 22, which looks to change the zoning designation of several properties and/or portions thereof from Residential 3 to Business 3. The properties include 1381 Bridge St. and 1367 Bridge St.\n* Article 23, which looks to see if the town will amend the Town Bylaw, Chapter 11: Personnel, Wage and Salary Administration by deleting the section titled “Sexual Harassment.”\n* Article 45, which looks to adopt Mass. General Laws Chapter 33, Section 59, under which public employees are fully paid while they are fulfilling their military service obligations through drills and training. The benefit from this law is up to 34 days.\n“My position has not changed,” Duggan said recently of Dracut firefighter Justin George’s article. “Right now we are fulfilling the requirements according to the law that was adopted in 2006.”\n* There are also multiple articles for street acceptances.", "url": "https://apnews.com/963f822d448242a8b2ebc2811bfeed33"}