{"authors": ["Ileana Najarro"], "date_download": "2020-05-04 20:06:03", "date_modify": "2020-05-04 20:06:03", "date_publish": "2018-10-03 05:00:00", "description": "The Greater Houston Partnership is launching a new initiative to increase diversity and inclusiveness at all levels in the local work force. The Houston NEXT event on Thursday brings...", "filename": "_36185ddfda334e2aa12140bc64e92293_1588622763.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_36185ddfda334e2aa12140bc64e92293_1588622763.html", "title": "Greater Houston Partnership explores workplace diversity", "title_page": "Greater Houston Partnership explores workplace diversity", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Greater Houston Partnership is launching a new initiative to increase diversity and inclusiveness at all levels in the local work force.\nThe Houston NEXT event on Thursday brings together community and business leaders for panel discussions and sessions on such topics as gender equality in the workplace, the costs and benefits of retaining talent, and management of multigenerational workplaces.\nIn January, the partnership will launch a new talent resources program focused on helping human resources executives and others involved in actively changing their companies’ workforce demographics.\nThe initiative came out of months-long conversations with top-level corporate executives who wanted to increase their workplace diversity as a means to improve their bottom line, partnership president and CEO Bob Harvey said.\nA 2015 McKinsey study found that companies in the top quartile for racial and ethnic diversity are 35 percent more likely to have greater-than-the-median financial returns in their respective industries nationally. Gender diversity made them 15 percent more likely to see these results.\nThe study also found that for every 10 percent increase in racial and ethnic diversity at the senior executive level, earnings before interest and taxes rise 0.8 percent.\nHarvey said more needs to be done to diversify the C-suite and boardrooms in Houston despite the region’s diverse population — and despite local corporations’ promoting this diversity to attract younger workers. While there’s been a slight increase in the number of women board members, he said, African-American and Hispanic representation needs more attention.\n“The challenge in Houston is that Hispanic leadership on all boards lags behind the Hispanic representation in the city broadly,” Harvey said.\nHispanics make up more than 40 percent of Harris County’s population. While the Houston Hispanic Chamber of Commerce is commissioning a study to quantify the number of Hispanics serving in the top reaches of corporate Houston, chamber president Laura Murillo said that anecdotally if a company has one Hispanic on its board, they are ahead of the pack.\nWhen talking about diversity and inclusion in the workplace, Murillo said it is often limited to boosting the number of women and minorities in entry-level roles. For Houston corporations to benefit financially and better reflect the city’s makeup, she urged more attention at the top.\n“It’s not enough to say you have Hispanics working for you,” Murillo said.\nShe said the Hispanic Chamber’s annual Emerging Leaders Institute places program graduates into nonprofit and political leadership roles.\nHarvey said changing the makeup of corporate boards could require a shift in perceptions of what qualifies someone for these positions. For now, the main criteria is someone with C-suite level experience, which historically has been out of reach for women and minorities.\nHarvey said the partnership’s ties to thousands of corporate entities in Houston should help it spur change.\n“We are proud that Houston is America’s most diverse city, which feeds into our culture and our way of life, and we believe increasing the diversity of our regional workforce will improve company culture and performance,” Harvey said in a statement.\nileana.najarro@chron.com\ntwitter.com/IleanaNajarro", "url": "https://apnews.com/36185ddfda334e2aa12140bc64e92293"}