{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:04:30", "date_modify": "2020-05-04 20:04:30", "date_publish": "2018-05-30 10:35:59", "description": "Tewksbury native Scott Oberg has rejoined the Colorado Rockies. The 28-year-old reliever, a right-handed pitcher, was recalled from Triple-A Albuquerque when Adam Ottavino was placed on the...", "filename": "_315e9130051b4bbc96ef08e6280e852b_1588622670.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_315e9130051b4bbc96ef08e6280e852b_1588622670.html", "title": "Oberg Returns to Colorado Bullpen", "title_page": "Oberg Returns to Colorado Bullpen", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tewksbury native Scott Oberg has rejoined the Colorado Rockies.\nThe 28-year-old reliever, a right-handed pitcher, was recalled from Triple-A Albuquerque when Adam Ottavino was placed on the 10-day disabled list.\nThe former Tewksbury High and UConn standout began the year with the Rockies but was optioned to Triple-A on April 24 after posting a 6.55 earned run average in 10 appearances. At Albuquerque, Oberg was outstanding in 12 appearances, compiling a 1.88 ERA while earning two saves, striking out 13 and walking just two.\nLast year, only six of 38 inherited runners scored against him when he was with the Rockies.\nAstros catcher Brian McCann, in a 1-for-26 slide that has dropped his batting average to .219, was put on the 10-day disabled list because of right knee soreness and returned to Houston. ... Chicago Cubs manager Joe Maddon believes Anthony Rizzo’s slide that upended Pittsburgh Pirates catcher Elias Diaz at home plate on Monday is still perfectly legal. Major League Baseball? Not so much. MLB chief baseball officer Joe Torre informed both clubs that Rizzo should have been called for interference for swiping Diaz’s right leg while Diaz attempted to make a throw to first base to complete a potential double play in the eighth inning.\nSOCCER\nCincinnati joining MLS\nNo longer just a pro baseball or football city. Not just a hotbed for college hoops. Thousands of soccer fans held a pep rally to celebrate Cincinnati’s surprising ascendance on the pitch.\nIt’s now a soccer city, too. Major League Soccer added Cincinnati in its latest round of expansion, rewarding a city that set attendance records during three seasons of United Soccer League play and has a stadium deal in place. The announcement brings MLS to 26 teams, two shy of its ultimate goal. It began as a 10-team league in 1996.\nGENERAL\nWilliams soars in Paris\nFor all that has changed in the 16 months since Serena Williams last played in a Grand Slam tournament -- she is now married and a mother -- so much was familiar about her at the French Open.\nThe fashion statement, this time in the form of a black bodysuit with a red belt that she said made her feel like a “warrior princess.” The big serves that provided 13 aces. The returns that eventually produced three consecutive breaks of serve.\nAnd, yes, the victory. Competing as a mom for the first time at a major, and only about nine months since giving birth to her daughter, Williams edged 70th-ranked Kristyna Pliskova of the Czech Republic 7-6 (4), 6-4.\nFrigid Super Bowl LII brought $370 million in net new spending to the “Bold North” Twin Cities area, according to a report released Tuesday by Gov. Mark Dayton’s office and the local host committee. The final tally by Rockport Analytics came in $50 million over the consulting company’s pre-Super Bowl projections.\nIt also said the 10 days leading up to the Feb. 4 game at U.S. Bank Stadium in Minneapolis brought in $32 million in new tax revenue for state and local government. ... Kentucky football coach Mark Stoops has dismissed safety Marcus Walker following his arrest on charges of trafficking cocaine and marijuana. The school had no other comment in a statement besides listing his career statistics of 17 tackles in 21 games.", "url": "https://apnews.com/315e9130051b4bbc96ef08e6280e852b"}