{"authors": ["Chris Adamski"], "date_download": "2020-05-04 20:05:13", "date_modify": "2020-05-04 20:05:13", "date_publish": "2018-03-02 16:18:11", "description": "For the second time in his career, Antonio Brown was honored as the AFC's offensive player of the year at the NFL 101 Awards. The Steelers receiver led the NFL with 1,533 receiving yards...", "filename": "_ec4e421f1bc04454b4912222e93be596_1588622713.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ec4e421f1bc04454b4912222e93be596_1588622713.html", "title": "Steelers' Antonio Brown receives NFL 101 Awards' AFC offensive player of the year", "title_page": "Steelers' Antonio Brown receives NFL 101 Awards' AFC offensive player of the year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "For the second time in his career, Antonio Brown was honored as the AFC’s offensive player of the year at the NFL 101 Awards.\nThe Steelers receiver led the NFL with 1,533 receiving yards despite missing the final 2 ½ games of the season because of a calf injury. At the time of his regular season-ending injury, Brown had an NFL-high 101 receptions; he also had nine touchdowns.\nThe NFL 101 awards are given to honorees chosen by a national committee that includes 101 sportswriters and broadcasters that cover the NFL. The ceremony was held in Kansas City.\nBrown shared the 2014 AFC offensive player of the year award with teammate Le’Veon Bell.\nAmong the other honorees for the 2017 season – the organization gives offensive and defensive players and a coach of the year for each conference – was former Penn Hills and Pitt star Aaron Donald. The Los Angeles Rams lineman was named NFC defensive player of the year.\nAccording to Steelers.com, quarterback Kordell Stewart (2001) and running back Barry Foster (1992) are previous winners of the NFL 101 AFC offensive player of the year; Troy Polamalu (2010), James Harrison (2008), Carnell Lake (1997), Greg Lloyd (1994), Rod Woodson (1993), Jack Lambert (1976), Mel Blount (1975), and Joe Greene (1972, 74) are prior winners of the NFL 101 AFC Defensive Player of the Year. Bill Cowher won NFL 101 AFC coach of the year in 1994.\nChris Adamski is a Tribune-Review staff writer. Reach him at cadamski@tribweb.com or via Twitter @C_AdamskiTrib.", "url": "https://apnews.com/ec4e421f1bc04454b4912222e93be596"}