{"authors": ["Mark Reagan", "Staff Writer"], "date_download": "2020-05-04 20:10:42", "date_modify": "2020-05-04 20:10:42", "date_publish": "2018-01-01 04:11:00", "description": "Every year, Cameron County has its share of criminal activity, with law enforcement officers making hundreds of arrests and prosecutors whose hands are full of investigations and court...", "filename": "_202f29246cdf4145a47e0a0656de9761_1588623042.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_202f29246cdf4145a47e0a0656de9761_1588623042.html", "title": "Shootings among highlights in eventful 2017", "title_page": "Shootings among highlights in eventful 2017", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Every year, Cameron County has its share of criminal activity, with law enforcement officers making hundreds of arrests and prosecutors whose hands are full of investigations and court hearings.\nThere were plenty of notable instances in 2017, including officer-involved shootings, public corruption charges, exonerations and high-profile trials. Here’s a look back:\nEscape, Chase and Shooting\nA June escape by a CameronCounty inmate being transported to the dentist ended with murder and a high-speed chase that highlighted how the sheriff’s department wasn’t following its own policy because of a personnel shortage.\nOn June 6, inmateMiguel Garcia attacked the officer transporting him with a shank made out of a razor and a toothbrush when the man tried to take Garcia out of the vehicle for his dentist appointment.\nGarcia overpowered the transportation officer, slashed him in the neck and stole the officer’s duty weapon before swimming across a resaca near the 3700 block of Boca Chica Boulevard to a home on Fruitdale Road, where he shot and killed 56-year-old Mario Martinez in front of the man’s family and friends.\nAfter stealing a 2014 Hyundai Elantra from the victim’s family, Garcia led multiple law enforcement agencies on a high-speed chase from FM 511 to Expressway 77 toward San Benito.\nThe chase ended in an industrial park at Williams Road and the frontage road where Garcia and law enforcement officers exchanged gunfire.\nAuthorities shot Garcia, who was taken to ValleyBaptistMedicalCenter in Harlingen, where he died.\nAfter the tragedy unfolded, Sheriff Omar Lucio said the department would immediately follow its policy of requiring two officers to transport an inmate for medical services regardless of personnel shortages and overtime costs. Lucio also acknowledged that his department lost 45 deputies and 302 detention officers over a three-year period.\nBPD shoots, kills suspect\nIn early October, Brownsville police executing an arrest warrant for burglary of a habitation shot and killed a 31-year-old man who tried to attack them with a fillet knife.\nGerman Ornelas was shot two times by Brownsville police on Oct. 5 in an apartment on West St. Charles Street.\nOn Dec. 8, Brownsville Police Chief Orlando Rodriguez and Cameron County District Attorney Luis V. Saenz held a press conference announcing the release of body cam video worn by a police officer that caught the entire shooting on camera.\nThe video shows Ornelas wielding a 7- to 8-inch fillet knife over his head and lunging at police before two officers fired six shots at Ornelas, striking him twice and killing him.\nA CameronCounty grand jury no-billed Detective Lorenzo Rosales and Officer Jaime Ortega a day before authorities released the body cam video.\nNot guilty\nWhat started with a January 2016 raid by federal and state officials at the Cameron County Courthouse administration building ended in a 2017 not-guilty verdict in Corpus Christi for County Tax Assessor-Collector Tony Yzaguirre Jr.\nA NuecesCounty jury found Yzaguirre not guilty on 15 counts of bribery, abuse of official capacity and official oppression on Feb. 3.\nProsecutors had alleged Yzaguirre was taking bribes for illegally registering vehicles.\nCase dismissed\nNearly one year ago, the Cameron County District Attorney’s Office arrested former interim Cameron County Judge Pete Sepulveda Jr. on charges of abuse of official capacity, misapplication of fiduciary property and theft by a public servant.\nSepulveda, who previously was executive director of the Cameron County Regional Mobility Authority before being appointed to the interim position in 2015, was accused of using county funds and employees to pave a private San Benito road.\nOn June 6, Sepulveda agreed to enter a Pretrial Diversion Program and the case was dismissed. Sepulveda is also required to pay CameronCounty restitution for materials, equipment and labor for the offense of which he was accused.\nBrothers in crime\nIn February, nearly two years after the naked headless body of Palacios Paz was found in the waters off South Padre Island, a former Border Patrol agent, two of his brothers and two others were convicted and sentenced for their roles in the murder.\nJoel Luna, a former Border Patrol agent, was sentenced to 20 years in prison after being found guilty of engaging in criminal activity. His brother, Eduardo Luna Rodriguez, was found guilty of capital murder, murder and two counts of engaging in criminal activity and was sentenced to life in prison without parole.\nDuring a search of Joel’s mother-in-laws house, authorities found a safe Joel purchased containing $90,000 in cash, a kilo of cocaine, a ledger of drug and weapon sales, and a golden gun inscribed with Eduardo’s nickname, “Pajaro,” and “Cartel de Gulfo.”\nTheir other brother, Fernando Luna Rodriguez, agreed to testify against his siblings and received a deportation order and 10 years probation. Two other men were sentenced to 15 years for their roles in the murder.\nEduardo shot and killed Paz, a Honduran immigrant, at the office in Eduardo’s Edinburg tire shop after Paz’s common-law wife, Martha Sanchez, told Fernando that Paz was going to inform authorities of the Luna brothers’ criminal enterprise that involved smuggling and the sale of drugs and weapons to and from the United States and Mexico.\nZetas get life\nTwo members of a Zetas hit squad that ambushed and murdered U.S. Immigration and Customs Enforcement special agent Jaime Zapata, of Brownsville, and injured special agent Victor Avila, were sentenced to life in prison in November.\nThe sentences closed the long chapter of the 2011 attack near San Luis Potosi, Mexico.\nMexican officials have said the attack on Zapata and Avila was a case of mistaken identity by the cartel hit squad that was out on the highway looking for vehicles to steal that day.\nJose Emanual Garcia Sota, aka Juan Manuel Maldonado Amezcua, aka “Zafado,” 36, of San Luis Potosi, and Jesus Ivan Quezada Piña, aka “Loco,” 29, of Matamoros, were the only two assailants to go to trial. They were found guilty in July.\nFive other defendants previously pleaded guilty to their roles in the murder.\nParole delayed\nOne of the most high profile Rio GrandeValley residents to be sent to prison in Texas was nearly paroled in 2017.\nTejano star Joe Lopez, a Grammy award winning singer and co-founder of Grupo Mazz, was sentenced to 20 years in prison in 2006 for one count of aggravated sexual assault of a child, 8 years for a second count of aggravated sexual assault of a child and four years for indecency with a child. He is serving his sentences simultaneously.\nLast January, the Texas Pardons and Parole Board ordered Lopez, 66, to complete a four-month Sex Offender Treatment Program in May, meaning Lopez could have been released this fall.\nThe Texas Pardons and Parole Board, however, made that decision without speaking to Lopez’s niece, and victim, Krystal Lopez. She was 13 when Lopez raped her.\nKrystal, who the board failed to notify of her uncle’s parole hearing, met with the victim and adjusted its decision by ordering Lopez serve a nine-month program before being released on parole, meaning Lopez wouldn’t be released until 2018.\nFajita-gate\nPublic corruption in CameronCounty has never been so tasty.\nIn a case Cameron County District Attorney Luis V. Saenz said could be a skit right out of Saturday Night Live if it weren’t so serious, authorities arrested and accused Gilberto Escamilla, an employee at the Cameron County Juvenile Justice Department, of stealing $1.2 million worth of fajitas over nine years.\nEscamilla’s alleged plan went from a sizzle to a fizzle on Aug. 7 when he took the day off to go to a medical appointment and a driver from Labatt Food Service in Harlingen called the Juvenile Justice Department’s kitchen to let them know their 800-pound delivery of fajitas arrived.\nThe Juvenile Justice Department, however, does not serve fajitas.\nAfter digging through documents from Labatt Food Service, the Juvenile Justice Department’s food vendor, and the CountyAuditor’s Office, which included invoices, vouchers and purchase orders, investigators alleged that Escamilla stole $1,251,578 worth of fajitas.\nThe DA’s Office Special Investigations Unit executed a search warrant at Escamilla’s house where they found packets of fajitas in his refrigerator.\nmreagan@brownsvilleherald.com", "url": "https://apnews.com/202f29246cdf4145a47e0a0656de9761"}