{"authors": ["Scott Ericson"], "date_download": "2020-05-04 20:24:25", "date_modify": "2020-05-04 20:24:25", "date_publish": "2018-04-07 23:05:55", "description": "WEST HAVEN—In a game many considered the best matchup of the FCIAC-SCC challenge weekend, the Notre Dame West Haven and Westhill baseball teams did not disappoint. In the end, it was NDWH...", "filename": "_c95874d700394070b2d3ddb2724c0e14_1588623865.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c95874d700394070b2d3ddb2724c0e14_1588623865.html", "title": "BASEBALL: Sansone, NDWH defeat Westhill", "title_page": "BASEBALL: Sansone, NDWH defeat Westhill", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WEST HAVEN—In a game many considered the best matchup of the FCIAC-SCC challenge weekend, the Notre Dame West Haven and Westhill baseball teams did not disappoint.\nIn the end, it was NDWH starting Mike Sansone who would take control of the game, not allowing a hit after the second inning, leading his team to a 4-2 win.\nWesthill got to Sansone in the first two innings, scoring twice in the second but once the Fairfield University-bound pitcher started finding his curveball, he was unhittable.\n“Early in the game I threw a lot of fastballs, the change-up was good but the curveball in the beginning was either too high or I bounced it. I just waited and let that pitch come later,” Sansone said. “After that second inning, I was definitely more locked in and everything felt better.”\nWesthill took a 2-0 lead in the top of the second on a single by Shane Hackett, a RBI triple to right center by Leo Socci and a single by Jason Bria, scoring Socci.\nThat would be it for the Vikings on offense.\n“After the second inning, he was really good. He throws three pitches for strikes and he didn’t really start throwing that curveball until after we scored those two runs,” Westhill coach DJ Mulvany said. “The little things were big today. We didn’t get bunt down, we got doubled off on a sacrifice and we stayed at two runs. It was a clean baseball game but the little things made a difference today. It is what it is and I still really like our team.”\nNDWH tied the game in the bottom of the second on a RBI single by Eddie Zanor, scoring Jason Ostrowski and a single to left by Milone, scoring Zanor.\nMilone would score the go-ahead run, scampering home on a wild pitch in the fifth.\nHe was 2 for 3 with a walk, RBI and run.\nNotre Dame would tack on another run in the sixth when Max Mariano plated Mike Robertson with a double to left.\nPLAYER OF THE GAME\nMike Sansone, NDWH. Sansone struck out six, allowing three hits and picking up the complete game victory.\nQUOTABLE\n“Once he started hitting his spots and got into a rhythm. He never got flustered, he only got stronger,” NDWH coach Don Martone said. “I liked that our kids were battling at the plate. We have to do a better job with two strikes of putting the ball in play because the competition is only going to get better and better.\nSericson@stamfordavocate.com; @EricsonSports\nNOTRE DAME WEST HAVEN 4, WESTHILL 2\nWESTHILL 020 000 0—2 3 0\nNDWH 020 011 X—4 8 1\nRecords: W—1-1; NDWH—2-1\nBatteries: W—Charles Olsen (L), Ryan Carroll (6) and Alex Cordone; NDWH—Mike Sansone (W) and Jason Ostrowski", "url": "https://apnews.com/c95874d700394070b2d3ddb2724c0e14"}