{"authors": ["Matthew Stolle"], "date_download": "2020-05-04 20:09:07", "date_modify": "2020-05-04 20:09:07", "date_publish": "2018-04-28 08:00:00", "description": "Next month, Mary Mejia will board a plane with her two young children and leave behind most everything she knows — her job, her family and friends, nearly all her possessions — to begin a new life...", "filename": "_35c24d5179834db6824af74c819bf2cc_1588622947.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_35c24d5179834db6824af74c819bf2cc_1588622947.html", "title": "Family moves to Mexico to escape uncertainty", "title_page": "Family moves to Mexico to escape uncertainty", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Next month, Mary Mejia will board a plane with her two young children and leave behind most everything she knows — her job, her family and friends, nearly all her possessions — to begin a new life in Mexico.\nIt was not the life that the Rochester native sought nor even imagined for herself. But it is, as far as she is concerned, the only option available to her for keeping her family together.\nMary McGuire met and fell in love with Carlos Mejia while working at a Burnsville restaurant. In 2011, the couple were married. They have been together for seven years and are raising two children, Gabriel, 5 and Camille, 2.\nCarlos Mejia also is an undocumented Mexican immigrant. At the time of the marriage, Mary didn’t see the issue as a barrier, believing her marriage would confer legal status on Carlos. But that belief proved to be mistaken, as the law had changed in 1999.\nIt would be the first of many daunting revelations as the couple sought to negotiate U.S. immigration law.\n“We didn’t realize. We didn’t research it,” Mary said. “We just assumed that if he married me, he would have citizenship.”\n‘I cried the whole day’\nThe couple was also unable to predict or prepare for how hardening attitudes toward undocumented immigrants — epitomized by the election of President Trump — would eventually make living together in the U.S. nearly impossible.\nThe day after the presidential election, Mary checked her phone to see that Trump had won the election. The outcome, she knew, extinguished whatever embers of hope she had in bringing her marriage out of the shadows.\n“Basically, I cried the whole day,” she said.\nLast year, Mary and Carlos broke the news to her parents during Thanksgiving weekend: The couple were moving to Mejia’s boyhood home of Cuautla, Mexico, a city of 150,000 people an hour and half’s drive south of Mexico City. The decision came after the anxiety and paranoia of day-to-day living became nearly intolerable.\nIt had never been easy. Carlos’s undocumented status meant he couldn’t get a driver’s license. That made driving between home and work fraught with peril.\nCarlos had been pulled over twice by Burnsville police for minor infractions without a driver’s license. A third time would have landed him in jail. So, to reduce the chances of being pulled over, Carlos would plot different routes to work and home.\nIt was a family life laced with fear and uncertainty. If Carlos was late from his expected arrival home, Mary would be thrown into a panic, her mother, Lois McGuire, said. Had he been arrested? Were they deporting him?\n“I would always wait up for him to come home, because I would worry about him driving home,” Mary Mejia said. “And then I’d worry about him driving during the day (when he dropped) Gab off at pre-school.”\nA marked man\nThe day-to-day fear only heightened after the election of Trump, who campaigned on taking a hard line on illegal and legal immigration. While President Obama told U.S. Department Homeland Security Immigration and Customs Enforcement (ICE) to focus on violent offenders and recent border crossers, among others, Trump widened the net.\nIn early 2017, the Trump administration issued a series of edicts to ICE agents, prosecutors and immigration judges: All of the estimated 11 million people in the country illegally were fair game for deportation.\n“There’s no population that’s off the table,” Thomas Hogan, the acting director of ICE, told reporters. “If you’re in the country illegally, we’re looking for you.”\nCarlos had paid taxes, but had also used a fake Social Security number. That branded him in the eyes of ICE agents as a criminal. Though Carlos’ only infraction in the U.S. was a parking ticket, he was and felt like a marked man.\nThe implications of those directives began to play out around Mary and Carlos Mejia. Three apartment buildings in Burnsville near where the couple lived were raided by ICE within a two-week period after Trump’s election. A day after Carlos quit his restaurant job, ICE agents raided the restaurant.\nThe only way to stay together as a family, the couple decided, was to move to Mexico. Carlos left in July. Mary and her two children plan to follow later next month. Meanwhile, Mary and the children have moved into her parent’s Rochester home while Mary makes arrangements for the move.\nMary Mejia admits to being scared, but she also misses her husband.\n“I miss our family unit. I miss watching him with the kids, but I am scared,” Mary said. “I won’t know anybody. I won’t have a job. I’m working on dual citizenship, but that will take two to four years. I don’t know the language.”\nThe 10-year clock\nThe couple’s hope of one day returning to the U.S. as a family hinge on a long-range plan. Carlos is permanently barred from entering the U.S. due to the fact that he twice crossed the border from Mexico into the U.S. illegally.\nBut Mary Mejia, as an American citizen, is allowed to seek a federal waiver for her husband after 10 years. By moving back to Mexico in July, nearly a year before his wife and kids join him, Carlos was able to start the 10-year clock.\n“The waiver is not guaranteed, but after seeing dozens of lawyers, it’s our only chance of ever living in the United States without the anxiety and the low-paying jobs,” Mary said.\nSince moving in with her parents, Mary has been learning the ropes as a single parent. Between work as a full-time office manager for a private equity firm, her son’s school schedule and daycare, Mary uses what free time she has making preparations for the trip to Mexico.\n“Kudos to all single parents, because I don’t know how they do it without help,” she said.\nFamily heartbreak\nMary’s parents, Bill and Lois McGuire, have cherished the time with their daughter and grandkids, who refer to them as Koko and Papa. But the imminence of their departure also fills them with a sadness and heartbreak that lurks just below the surface.\nBill told his wife recently that while holding his 2-year-old granddaughter, Camille, he burst into tears.\n“You catch us at the right moment, we’re going to melt on you,” Lois McGuire said.\nLois McGuire says she and her husband were both concerned about Carlos’ undocumented status when they learned about their daughter’s intention to marry him. One of the first things they did was consult an immigration lawyer.\n“We had not thought about all of this stuff. And how it is almost impossible for a Mexican person to get citizenship in the U.S,” she said.\nOne thing Lois is not in doubt about is her daughter’s commitment to Carlos and her family. Why else would she sell almost everything she has and move away from everything she knows?\n“A couple of my friends have talked about how they view this as an incredible love story,” Lois said. “Mary likes to have things. I don’t know if she’s materialistic, but she likes nice things. And she has sold everything she owns, other than their clothes and toys, and is moving away from her family, which she is very close to … and to do this for this man.”\nIt’s not the move to Mexico that troubles Lois McGuire so much as the circumstances that are forcing the move. It would be different, she said, if her daughter were moving to Mexico to pursue a job or an economic opportunity. At the very least, her sadness would be offset by excitement for her daughter.\nBut her daughter is moving to Mexico because it remains the only option available to her for keeping her family intact, and that “just feels mean” and unChristian.\n“That’s what is happening to a lot of families. They are being broken up,” Lois McGuire said. “I just don’t think that a border ... Many of these people (who support such policies) are Christian, which I am, too, but I just don’t see where God would support all of this.”\nOne thing that both Bill and Lois McGuire agree on is the importance of educating the public about the nation’s immigration laws and how it is impacting, and in some cases breaking up, families. At Christ United Methodist Church recently, Bill McGuire addressed the congregation to talk about his daughter’s predicament.\nThose who learn about Mary and Carlos’ situation often want to know why he can’t apply for citizenship. Or they want to know how long it would take for him to become a citizen.\nThey don’t realize that for someone in Carlos’ situation, there is no easy path to legal status. They also don’t know that the State Department is so backlogged that it’s currently processing visa requests for Mexican siblings filed on Nov. 15, 1997, according to Time magazine.\nNor do people know, for example. that immigration laws haven’t changed or been updated since the time of Ronald Reagan’s presidency. Bill McGuire said he is no fan of Donald Trump, but “one of the things that has happened is we have more dialogue about (immigration) than we’ve ever had.”\nThree weeks before her departure, Mary Mejia is maintaining an upbeat attitude about the move. At the very least, her family will be together again.\n“I’m nervous, but I think you have to look at it as an adventure,” Mary said.", "url": "https://apnews.com/35c24d5179834db6824af74c819bf2cc"}