{"authors": ["Special To Cleveland.Com"], "date_download": "2020-05-04 20:14:17", "date_modify": "2020-05-04 20:14:17", "date_publish": "2018-01-17 18:11:00", "description": "Miniature schnauzer is welcome \"brother\" for Shaker Heights family's first pet: Send us your pet rescue stories SHAKER HEIGHTS -- I'm Nick Feuer from Shaker Heights. Last January, my wife,...", "filename": "_58037cf4f89c406fbfec23302d2ae4d4_1588623257.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_58037cf4f89c406fbfec23302d2ae4d4_1588623257.html", "title": "Send us your pet rescue stories", "title_page": "Miniature schnauzer is welcome \"brother\" for Shaker Heights family's first pet: Send us your pet rescue stories", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Miniature schnauzer is welcome “brother” for Shaker Heights family’s first pet: Send us your pet rescue stories\nSHAKER HEIGHTS -- I’m Nick Feuer from Shaker Heights. Last January, my wife, Gabby, and I rescued a miniature schnauzer from the Cuyahoga County Animal Shelter in Valley View. His name is Gandalf.\nBefore we adopted Gandalf, we already had one mini schnauzer that we raised since she was 8 weeks, Arya. I am allergic to most dogs but schnauzers are one breed that works for me. My wife and I knew we wanted a second dog but we didn’t want to raise a puppy again. This meant that we wanted to rescue a dog, but because of my allergies, we couldn’t just rescue any dog. We had to wait for the perfect one.\nOne of my friends posted on Facebook that the shelter had a mini schnauzer for adoption. I texted my wife about it and then she called the shelter immediately to check on the dog’s status. Unfortunately, the dog had already been adopted. It dawned on me how unfair it is that shelters are full of pit bulls and mutts, but as soon as a pure-bred dog like a schnauzer comes in, it gets adopted immediately. Fortunately for us, the shelter notified my wife that a second mini schnauzer was coming in that day. This dog was found on the streets. Gabby took off work to go visit with the dog and she thought he would be perfect for our family. He had a microchip so the shelter contacted the number associated with the chip but no one responded. We needed to wait eight days before taking the dog home to give the former family enough time to respond. They never did.\nI also visited the dog without my wife to see if I liked him. I really did and we decided that we wanted him. The last step was to bring Arya to the shelter to meet the dog and see if they got along. After sniffing each other when they first met, the two dogs basically ignored each other. We thought that this was a good sign because they obviously didn’t have any issues with each other. Once the eight days were up, we brought the new dog home and named him Gandalf.\nHe was a well-trained dog when we got him and still hasn’t had one accident (it has been almost a year since we adopted him). Both Gandalf and Arya are about 20 pounds. Arya lets us left her up whenever but Gandalf absolutely refused to be lifted up initially. When we tried, he would roll onto his back and if we kept persisting he would try and bite us. We also found that Gandalf had some issues with resource guarding and would bite you if you tried to take food away from him. Even though he’s only 20 pounds, his bite packs a mean punch. It was also clear from the beginning that Gandalf didn’t really like me, but he loved Gabby and Arya. Gandalf and Arya are best friends and that is the part about Gandalf that I love the most. They are always snuggling or play wrestling. We send them to daycare a few days a week and whenever there are pictures of them on the daycare’s Facebook group, they’re always right next to each other. Gandalf truly became the big brother that Arya never had.\nWe worked with Gandalf with a few different trainers and his resource guarding has gotten so much better. We are able to make him wait for his food and we can tell him to drop his food and we can pick it up. When we first got him, both of these things would never have happened. And although Gandalf won’t let us pick him up if he hears the bath water running, he has gotten much better at allowing us to pick him up, which we often need to do when he tries to jump at people coming in the house.\nGandalf has definitely made me appreciate rescue animals, especially now in the winter months. When I see him snuggled up with his sister in the warm house, it kills me to think that he was found alone on the streets in the middle of winter last January. It really makes me think how hard stray animals have it, and how important it is for shelters to be able to accommodate them once they’re found. Gandalf has also showed me that it is OK to be different. His and Arya’s personalities could not be any different. Whereas Arya is always trying to lick someone or play with her toys, Gandalf always prefers to be sleeping or getting petted. Initially, it annoyed me that Gandalf didn’t want to play because Arya would be having so much fun and I wanted Gandalf to have fun too. But I had to realize that my (and Arya’s) idea of fun wasn’t what Gandalf liked. This also showed me that it’s important to give them freedom, to let them do what they want because if I decide for them, it might not be what they want.\nOverall, rescuing Gandalf was the best decision our family made in 2017 and I hope other people can find it in their hearts to help out an animal in need in 2018.\nNick Feuer\nShaker Heights\nDo you share your life with an animal that is near and dear to you? Tell us something about your pet – all species are welcome – and send along a photo of the two of you. Be sure to tell us which Greater Cleveland community you live in. Send everything to Linda Kinsey at lkinsey@cleveland.com.", "url": "https://apnews.com/58037cf4f89c406fbfec23302d2ae4d4"}