{"authors": ["Gregg Krupa", "The Detroit News"], "date_download": "2020-05-04 20:12:04", "date_modify": "2020-05-04 20:12:04", "date_publish": "2018-03-29 00:00:17", "description": "Loyola is not often in the Final Four. But, when it is, the small, private school on the North Side of Chicago is noticed. In 2018, Loyola is the classic Cinderella.", "filename": "_edad7275ddf349ca8dd462bd88426e33_1588623124.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_edad7275ddf349ca8dd462bd88426e33_1588623124.html", "title": "trendsetter to Cinderella", "title_page": "Loyola's court story: trendsetter to Cinderella", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Loyola is not often in the Final Four.\nBut, when it is, the small, private school on the North Side of Chicago is noticed.\nIn 2018, Loyola is the classic Cinderella.\nSo unheralded are the Ramblers that their Final Four appearance against Michigan Saturday combined with the Jesuit founding of the university and the popularity of Sister Jean Dolores Schmidt, the team chaplain, conjures the notion that this miracle of sport may have its origin in faith.\nLoyola is a team to which parents can point, when their children say, “I can’t.”\nIt is sound evidence of the possibility of attainment against long odds.\nIn 1963, the Ramblers won the National Championship as an offensive dynamo, upsetting a great, defensive Cincinnati team highly favored in the final.\nDuring that season, Loyola helped break down an unofficial color line that, by custom and unwritten agreement, kept more than one or two black players from playing at the same time in the collegiate game. Coach George Ireland and the Ramblers often started and played four blacks, three years before Texas Western finally started five black men in a 1966 tournament game.\nTheir season-long initiative climaxed in the early rounds of the 1963 tournament, in the legendary game at Jenison Field House, in East Lansing, against a segregated, all-white Mississippi State team. The so-called Game of Change was memorialized at the White House 50 years later.\n“You would have liked to have seen coaches in that day just do it,” said Jerry Harkness, the point guard and captain of the 1963 National Champions, about breaking the racial barrier.\n“And, that’s how it was done. We just did it!\n“I understand a few things: Coaches were worried that maybe the board of directors in the schools would not like it, or maybe the fan base would not like it, to see three or four African-Americans.\n“But, when we played, with our success at Loyola, they packed the gyms.\n“So, they found out that,” Harkness said.\n“And then, they found out they had to really recruit African-Americans if they were going to be competitive.”\nLoyola played men’s basketball for 47 years, and remained largely unnoted, before 1963.\nBut, by then, Coach Ireland had met Walter November, in New York City.\nTheir felicitous acquaintance would lead to four NCAA Tournament appearances in the next six years, including the National Championship.\n“Walter was a really good guy,” Harkness said. “He was white, and he was going around trying to help African-Americans that play basketball.\n“He had them on his teams, and then he would try to get them in college. He wouldn’t just coach them. He’d talk to them positively about what are the right things to do in life, and what to watch out for in life.\n“One of those guys was me,” he said. “He just took me by the hand and gave me the opportunity.”\nIreland soon recruited Harkness, Ron Miller, Pablo Robinson and Billy Smith, all from New York.\nMeanwhile, Ireland was not the sort of guy to let a bit of tradition hinder him, and he came with a bit of an edge.\n“He was not your warm and fuzzy coach, like Porter Mason is today,” said another member of the 1963 championship team, Dan Connaughton said.\n“But I would say he was the right coach, for the right time.”\nHarkness said he recalls when Ireland walked into a meeting of coaches from other schools, one asked he had been delayed because he was recruiting in Africa.\n“He would get to meetings, some coaches’ meetings, and they had that unwritten rule. That’s the kind of stuff they were telling him,” and he just said, ‘Forget you,’ ” Harkness said.\n“He was sort of a rabble-rouser, when it comes to things like that.”\nConnaughton and Harkness say they were young athletes and college students, long before ESPN and the 24-hour news cycle. What otherwise might have been considerable pressure largely went unnoticed, as they played through the schedule.\n“You don’t have time to muse intellectually about all these things,” said Connaughton, who was the youngest player on the team. “You’re just trying to get by in life, and you’re playing basketball on a scholarship.\n“But, as you get along in life, you realize, there was a lot of pressure going on.”\nJust before the season began, James Meredith, backed by 500 U.S. Marshals, and 10,000 federalized troops, integrated the University of Mississippi, amid days of rioting.\nThree weeks after Loyola won the National Championship, police arrested Martin Luther King Jr. in Birmingham, Alabama on Good Friday, April 12, 1963, leading to King’s “Letter from a Birmingham Jail,” defending non-violence and asserting a moral responsibility to break unjust laws.\nPlaying mostly nonconference games in the upper Midwest and schools in the Missouri Valley Conference, four black players on the court went over easy, through much of the course of the regular season.\nIn Houston, however, they had problems.\n“It was rough,” Connaughton said. “Guys in their kicker boots, with their big buckles and Bolo ties yelling stuff at the bench, ‘Take those (racial slur) back to Chicago!’ and throwing stuff on the floor. So, that was a very rough environment.\n“We probably should have beaten them by 20 or 30. We beat them by eight or 10.\n“It kind of shut the guys up a bit.”\nOther than Houston, Harkness agreed, playing four black guys at the same time went well.\n“We were playing, but not realizing the significance of it,” he said.\n“The significance came when we shook hands with Mississippi State and all the railing around that accompanied that.\n“That’s when we really felt, hey, this is more than a game, this is history.”\nMississippi State refused to play in previous NCAA Tournaments, because so many black players participated. Despite political opposition throughout segregationist Mississippi, Coach James “Babe” McCarthy, Mississippi State President Dean Colvard vowed to let the team play in the 1963 event.\nJust before it was to face Loyola, of all schools, in East Lansing, Colvard directed McCarthy to take the team north of the Tennessee line, while a group of guys, some of them tall, circulated around the Mississippi State campus as decoys.\nWhen Governor Ross Barnett obtained an injunction barring the team from leaving the state to play in the tournament, it had little effect.\nHours later, just before tip-off, when Harkness shook hands and center court with the Mississippi State captain, Joe Dan Gold, the historic weight of the moment suddenly registered.\nLoyola won and went on to win the championship, the only school from Illinois to ever win it, still.\nThe Ramblers returned to the Tournament three times in the next five years, but Ireland and November eventually had a falling out. Some of the stars from New York went to other schools.\nSince 1968, Loyola has played in tournaments twice, eliminated by cross-state rival Illinois in the first round of the 1980 NIT, and by Georgetown in the 1985 Sweet Sixteen round of the NCAA Tournament.\n“When they made that run in 1985, I was a freshman in high school and that was when I made my decision to go to Loyola, being a basketball fan,” said Nat Caputo, of Chicago.\n“I graduated in ’94, and we suffered for a long time. I don’t know of any other way to put it. And, now that we’re here, it’s just an amazing thing.\n“I haven’t seen a turnout like this in 30 years.\n“My phone, I’ve seen my battery decrease so fast. The amount of texts and phone calls that are going around from Loyola people is just incredible,” he said.\n“If it’s another 33 years before we are in again, it will be 2051!”\ngregg.krupa@detroitnews.com\ntwitter.com/greggkrupa", "url": "https://apnews.com/edad7275ddf349ca8dd462bd88426e33"}