{"authors": ["Chad Sokol"], "date_download": "2020-05-04 20:16:19", "date_modify": "2020-05-04 20:16:19", "date_publish": "2018-03-20 00:00:00", "description": "For many Americans, curling is a spectacle to be enjoyed every four years, while watching the Winter Olympics on television. And in the Inland Northwest, there aren’t many places to try playing...", "filename": "_492ddb00a8994714977bf7bd6ae40238_1588623379.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_492ddb00a8994714977bf7bd6ae40238_1588623379.html", "title": "Not just an Olympic spectacle: Hundreds try curling in Coeur d’Alene", "title_page": "Not just an Olympic spectacle: Hundreds try curling in Coeur d’Alene", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "For many Americans, curling is a spectacle to be enjoyed every four years, while watching the Winter Olympics on television. And in the Inland Northwest, there aren’t many places to try playing the sport.\nOn Sunday and Monday evening, however, some 200 people gathered at the Frontier Ice Arena in Coeur d’Alene for massive group curling lessons led by members of the Coeur d’Alene Curling Club. They were children, teens and adults – mostly beginners unacquainted with the rules of the game and the tricky kneeling-sliding motion involved.\nRyan Montang, an amateur curler who teaches social studies at University High School, spent two hours coaching about a dozen of those people as they took turns launching themselves from the starting block, known as a “hack,” and sliding as far as they could with a polished granite stone.\nThe goal, Montang explained, is to release the stone before it crosses the “hog line,” aiming for a target at the other end of the curling sheet. To succeed in a curling competition, he said, it’s important to communicate with teammates as they sweep just ahead of the stone, smoothing the ice so that it glides more easily.\n“You need to have good improv skills and make adjustments as the stone is moving down the ice,” Montang said. If the teammates with the brooms pave a good path for the stone, he said, “it will go farther and it will stay straighter because it’s not grabbing the ice.”\nSome of the people who showed up for Monday’s Learn to Curl event were naturals. Others slipped and fell on their first few sliding attempts. Montang offered a friendly reminder: “If you’re on ice, you’re going to fall sometime.”\nAndrea Fulks, of Post Falls, said curling was the only Olympic sport she bothered to watch this year, and she was surprised to learn there’s a curling league in her area. She doesn’t plan on joining it, though.\n“I’m just doing this to write it off my bucket list,” Fulks said, smiling. “I just want to do it this one time, and then I’m done.”\nJay Weintraub, of Coeur d’Alene, went to the Frontier Ice Arena a second time Monday after taking part in the Learn to Curl event the previous evening with his wife and stepdaughter. He said he had played hockey and enjoyed ice skating, but never before had an opportunity to try curling.\n“I just thought, at my age, it’s a sport I might actually be good at,” Weintraub said, adding that he was considering joining the curling league. “It is a lot harder than it looks.”\nThe league’s spring season is scheduled to begin Thursday and end May 10. Meets will be held each Thursday at the Frontier Ice Arena. The cost to register a team is $500, and the league will accept the first 16 teams that pay up front.\nA sixth annual curling tournament, known as a bonspiel, will be held April 20 and April 21. Participants will camp out in the parking lot of the ice rink, and organizers say the competition will include thousands of dollars in prizes.\nBecause of the great turnout at the Sunday and Monday curling lessons, organizers will host a third lesson March 25 from 11 a.m. to 1 p.m. The price of admission is $10 per person. More information is available at cdacurling.com, and questions can be emailed to cdacurling@gmail.com.\n“If I had more stability I think I could get the hang of it,” said Jeff Hutchinson, who attended Monday’s lesson with a buddy from Coeur d’Alene. “I’m definitely coming back on Sunday.”", "url": "https://apnews.com/492ddb00a8994714977bf7bd6ae40238"}