{"authors": ["Patrick Buchanan"], "date_download": "2020-05-04 20:07:51", "date_modify": "2020-05-04 20:07:51", "date_publish": "2018-10-14 05:00:00", "description": "Was Washington Post columnist Jamal Khashoggi murdered inside the Saudi consulate in Istanbul, and then his body cut up with a bone saw and flown to Riyadh in Gulfstream jets owned by Crown Prince...", "filename": "_1eb71b60444b4cc082ee63cc6f86a952_1588622871.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1eb71b60444b4cc082ee63cc6f86a952_1588622871.html", "title": "PATRICK BUCHANAN: Is Saudi Arabia connected to disappearance of journalist?", "title_page": "PATRICK BUCHANAN: Is Saudi Arabia connected to disappearance of journalist?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Was Washington Post columnist Jamal Khashoggi murdered inside the Saudi consulate in Istanbul, and then his body cut up with a bone saw and flown to Riyadh in Gulfstream jets owned by Crown Prince Mohammed bin Salman?\nSo contend the Turks, who have video from the consulate, photos of 15 Saudi agents who flew into Istanbul that day, Oct. 2, and the identity numbers of the planes.\nSupporting the thesis of either a murder in the consulate or a “rendition,” a kidnaping gone horribly bad, is a Post story that U.S. intel intercepted Saudi planning, ordered by the prince, to lure Khashoggi from his suburban D.C. home back to Saudi Arabia. And for what beneficent purpose?\nIf these charges are not refuted by Riyadh, there will likely be, and should be, as John Bolton said in another context, “hell to pay.”\nAnd the collateral diplomatic damage looks to be massive.\nAny U.S.-backed “Arab NATO” to face down Iran, with Riyadh as central pillar, would appear dead. Continued U.S. support for the Saudi war in Yemen would now be in question.\nThe special relationship the crown prince and President Donald Trump’s son-in-law, Jared Kushner, have established could be history.\nCongress could cancel U.S. arms sales to the kingdom that keep thousands of U.S. defense workers employed, and impose sanctions on the prince who is heir apparent to the throne of his 82-year-old father, King Salman.\nToday, the Saudi prince has become toxic, and his ascension to the Saudi throne seems less inevitable than two weeks ago. Yet, well before Khashoggi’s disappearance in the consulate, Crown Prince Mohammed’s behavior had seemed wildly erratic.\nAlong with the UAE, he charged Qatar with supporting terrorism, severed relations, and threatened to build a ditch to sever Qatar from the Arabian Peninsula. To protest criticism of his country’s human rights record by Canada’s foreign minister, he cut all ties to Ottawa.\nLast year, he summoned Lebanese Prime Minister Saad Hariri to Riyadh, held him for a week, and forced him to resign his office and blame it on Iranian interference in Lebanon. Released, Hariri returned home to reclaim his office.\nA professed reformer, Crown Prince Mohammed opened movie theaters to women and allowed them to drive, and then jailed the social activists who had called for these reforms.\nThree years ago, he initiated the war on the Houthis, after the rebels ousted a pro-Saudi president and took over most of the country.\nAnd, since 2015, the crown prince has conducted a savage air war that has brought Houthi missiles down on his own country and capital.\nYemen has become Saudi Arabia’s Vietnam.\nThat our principal Arab ally in our confrontation with Iran, which could lead to yet another U.S. war, is a regime headed by so unstable a character should raise serious concerns about where it is we are going in the Middle East.\nHave we not wars already?\nDo we not have enough enemies in the region -- Taliban, al-Qaida, ISIS, Hezbollah, Hamas, Syria, Iran -- to be starting another war?\nAs for our regional allies, consider.\nNATO ally Turkey, which is pressing the case against our Saudi allies, leads the world in the number of journalists jailed. Our Egyptian ally, Gen. al-Sissi, came to power in a military coup, and has imprisoned thousands of dissidents of the Muslim Brotherhood.\nWhile we have proclaimed Iran the “world’s greatest state sponsor of terror,” it is Yemen, where Saudi Arabia intervened in 2015, that is regarded as the world’s great human rights catastrophe.\nMoreover, Iran is itself suffering from terrorism.\nLast month, a military parade in the city of Ahvaz in the southwest was attacked by gunmen who massacred 25 soldiers and civilians in the deadliest terror attack in Iran in a decade.\nAnd like Afghanistan, Iraq, Syria and Libya, Iran suffers, too, from tribalism, with Arab secessionists in its southwest, Baloch secessionists in its southeast, and Kurd secessionists in its northwest.\nThe U.S. cannot look aside at a royal Saudi hand in the murder of a U.S.-based journalist in its consulate in Istanbul. But before we separate ourselves from the Riyadh regime, we should ask what is the alternative if the House of Saud should be destabilized or fall?\nWhen Egypt’s King Farouk was overthrown in 1952, we got Nasser.\nWhen young King Faisal was overthrown in Baghdad in 1958, we eventually got Saddam Hussein. When King Idris in Libya was ousted in 1969, we got Qaddafi. When Haile Selassie was overthrown and murdered in Ethiopia in 1974, we got Col. Mengistu and mass murder. When the Shah was overthrown in Iran in 1979, we got the Ayatollah.\nAs World War I, when four empires fell, testifies, wars are hell on monarchies. And if a new and larger Middle East war, with Iran, should break out in the Gulf, some of the Arab kings, emirs and sultans will likely fall.\nAnd when they do, history shows, it is not usually democrats who rise to replace them.", "url": "https://apnews.com/1eb71b60444b4cc082ee63cc6f86a952"}