{"authors": ["Staff Report"], "date_download": "2020-05-04 20:10:14", "date_modify": "2020-05-04 20:10:14", "date_publish": "2018-01-25 01:23:41", "description": "The final phase to consolidate the Colorado Department of Agriculture in Broomfield is underway. CDA's Inspection and Consumer Services division will move to Broomfield, where the main...", "filename": "_ffeb004b8b014fe4b9f9ae32df8f0327_1588623014.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ffeb004b8b014fe4b9f9ae32df8f0327_1588623014.html", "title": "Colorado Department of Agriculture Breaks Ground on Broomfield Lab", "title_page": "Colorado Department of Agriculture Breaks Ground on Broomfield Lab", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The final phase to consolidate the Colorado Department of Agriculture in Broomfield is underway.\nCDA’s Inspection and Consumer Services division will move to Broomfield, where the main office is located, and will include three laboratories — metrology, animal health and biochemistry. The new facility will replace the nearly 50-year-old site in Denver.\nCompletion is scheduled for early 2019.\n“This office consolidation will create a more efficient and effective work environment for our staff while creating a “one-stop” shop for our agricultural customers,” Commissioner of Agriculture, Don Brown, said in a news release. “It’s exciting to know that, in just over a year, our new laboratories will be up and running to continue providing the consumer protection efforts that affect every person in Colorado.”\nThe project includes a 6,000-square-foot of renovation to the existing building, 305 Interlocken Parkway, and construction of a new 27,000-square-foot facility next door. Unique components include humidity and vibration controls in addition to a variety of specialty equipment in the biochemistry labs.\nPrimary goals of the Division of Inspection and Consumer Services are: consumer protection, promotion of equity in the marketplace and animal and human health safety.\nPrograms include providing economic protection to agricultural producers and ensuring that Colorado consumers receive products that are safe, properly labeled, and sold in an honest manner, according to the release.\nICS also regulates pet care facilities, animal feed, fertilizer, anhydrous ammonia, compost, farm products dealers, commodity handlers/grain warehouses, scales and other measuring devices, pricing and package weight accuracy, eggs, home food service plan operators, custom meat plants and wild game processors.\nICS has two laboratories: the Metrology Laboratory and the Biochemistry Laboratory. The Rocky Mountain Regional Animal Health Laboratory also will be located in the new building.", "url": "https://apnews.com/ffeb004b8b014fe4b9f9ae32df8f0327"}