{"authors": ["Sam Lounsberry Staff Writer"], "date_download": "2020-05-04 20:08:36", "date_modify": "2020-05-04 20:08:36", "date_publish": "2018-09-15 04:03:37", "description": "An extended runway and additional services for jets at Longmont's Vance Brand Airport is envisioned by a group exploring methods to further develop the airstrip. The informal committee of...", "filename": "_040c34591e5b44c1913fa3aa89fdee68_1588622916.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_040c34591e5b44c1913fa3aa89fdee68_1588622916.html", "title": "Group Hopes to Expedite Development of Longmont's Vance Brand Airport to Make It More Business-friendly", "title_page": "Group Hopes to Expedite Development of Longmont's Vance Brand Airport to Make It More Business-friendly", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Group Hopes to Expedite Development of Longmont’s Vance Brand Airport to Make It More Business-friendly\nAn extended runway and additional services for jets at Longmont’s Vance Brand Airport is envisioned by a group exploring methods to further develop the airstrip.\nThe informal committee of four individuals came together earlier this year and told city officials of their intent to propose airport development they believe would make it more attractive to commercial users.\nLongmont Councilwoman Marcia Martin, the city council liaison for the city’s Airport Advisory Board, said group members are Dave Copp, who Martin described as a helicopter pilot who has a hangar at the airport; Dan Dunn, a developer Martin said wants to build new hangars at the airport; Tom Briggs, a financier involved in the construction of Denver International Airport; and Jeff Bowman, a Boulder entrepreneur and a hobby antique plane pilot.\n“The members of the development committee ... are extremely proactive people who have gone out and actually looked at ways to get what the airport needs,” Martin said.\nBowman said the group’s goal is to by the end of the year, or shortly thereafter, get a plan together that could be presented to the city for feedback.\nThe extension of the airport’s runway by 1,000 feet was identified as a five- to 10-year capital improvement in Longmont’s 2012 update to the Airport Master Plan, but the project remains unfunded.\nWork to add a taxi lane in the southern part of the airport property, though, has started, and once complete will open the possibility of the runway extension.\n“The taxi lane to the south side is so we can incentivize and bring in developers and give them access to the runway and primary taxiway system,” airport manager David Slayter said.\nThe taxi lane project will cost $580,000, with the city chipping in $67,875, and the majority of the rest of the funding coming from the Federal Aviation Administration and a smaller portion from the Colorado Department of Transportation’s Aeronautics Division, according to Slayter.\n“I think (the city’s share of the cost) is a very reasonable amount for the importance of the project and what it can bring,” Slayter said.\nThe new airport development committee might be able to fast-track the runway extension as well as hangar construction that could house larger jets with private funding through a partnership with the airport.\n“If you look around at the way government locally has trended, there has been a lot more public-private partnerships. This may or may not occur,” Airport Advisory Board Chairman Dale Vanzant said.\nBowman believes waiting for Federal Aviation Administration grant funding for the runway extension means it wouldn’t be complete for 10 to 20 years.\n“We’re trying to figure out we can expedite that,” Bowman said. “We’re not looking to do anything outside the city’s Airport Master Plan.”\nExtending the runway likely would need to be coupled with an addition of services from the airport’s fixed-base operator, which handles fueling and plane maintenance and is currently city-hired contractor Fly Aviation Services, Bowman said.\nNew services would have to be more tailored to small jets for the airport to attract more commercial activity.\n“If you go to other airports geared toward business, they tend to have fixed-base operators that offer more services, certainly nicer accommodations than you find at Longmont,” Bowman said.\nThe addition of food service at the airport also is desired, he said.\nWhen the runway is extended and more aviation options are available out of the airport, Martin and those looking at the prospects of expediting the project predict it will be an economic boon for not only Longmont, but the entire area.\n“It could be a win for not just Longmont but Boulder County,” Martin said. “Boulder Municipal Airport is landlocked, it’s not ever going to be more than what it is today. Boulder has a lot of businesses that would be helped by a more full-service airport with a longer runway.”\nSam Lounsberry: 303-473-1322, slounsberry@prairiemountainmedia.com and twitter.com/samlounz .", "url": "https://apnews.com/040c34591e5b44c1913fa3aa89fdee68"}