{"authors": ["John Reinan"], "date_download": "2020-05-04 20:11:06", "date_modify": "2020-05-04 20:11:06", "date_publish": "2018-01-27 11:22:10", "description": "Ohm my — they did it. A coalition of electric utilities, government agencies and environmental groups recently completed the first highway corridor in Minnesota that’s fully friendly to...", "filename": "_5b62d36f242d45a49415ab118d8f9bbd_1588623066.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5b62d36f242d45a49415ab118d8f9bbd_1588623066.html", "title": "Electric vehicles now can charge all the way from Twin Cities to North Shore", "title_page": "Electric vehicles now can charge all the way from Twin Cities to North Shore", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Electric vehicles now can charge all the way from Twin Cities to North Shore\nOhm my — they did it.\nA coalition of electric utilities, government agencies and environmental groups recently completed the first highway corridor in Minnesota that’s fully friendly to electric vehicles.\nFrom the Twin Cities to the North Shore and beyond, travelers on Interstate 35 and Hwy. 61 will be able to find enough charging stations for their electric vehicles to ensure they can make the trip without running out of juice.\nIt won’t be the last electrified corridor. Other likely routes include I-94 from the Twin Cities to Fargo and I-90 across the southern part of the state.\nThe adoption of electric vehicles has always raised a chicken-and-egg question: Will more charging stations encourage people to buy electric vehicles, or will greater sales of the vehicles encourage people to build charging stations?\nElectric vehicle supporters in Minnesota are answering “yes” to both questions, pushing for the creation of charging infrastructure while also adopting policies to promote electric vehicle purchases.\nThe state of Minnesota has set a goal of reducing the emissions of its vehicle fleet by 30 percent over the next 10 years. To meet that goal, it will add more than 1,500 electric vehicles to its fleet. In addition, state agencies throughout Minnesota are adding charging stations to their facilities.\nThere are already 60 charging stations in the Capitol complex in St. Paul, said Larry Herke, director of the Office of Enterprise Sustainability.\nThe biggest challenge is boosting charging capacity outside the Twin Cities, Herke said, adding that new electric vehicles with longer driving ranges will be a big help.\nThe state worked with General Motors to get early delivery of the new Chevy Bolt, an electric car with a range of nearly 250 miles on a charge. The state bought 13 Bolts and local governments bought nine.\nTo encourage greater use of electric vehicles by local government fleets, the state is allowing the locals to buy their vehicles under the state contract, which will get them a better price, Herke added.\nLocal governments can save money on fuel with electric vehicles, said Dan Thiede, a spokesman for the Clean Energy Research Teams at the University of Minnesota.\n“For many of the applications cities are looking at, electric vehicles make a lot of sense, because they’re making a lot of short trips,” Thiede said. Electric vehicles also can be a draw for businesses that offer charging facilities, he added.\n“There are all sorts of businesses who’d like to attract people who want to stop and charge,” he said. “Come in, charge, and have a cup of coffee. Come to church and charge while you’re in church.” Many of the newest Hy-Vee stores in Minnesota are offering charging stations, he said.\nTobies Restaurant and Bakery, a landmark on I-35 in Hinckley, installed Tesla charging stations and is now a regular stop for drivers of the high-end electric vehicles, said co-owner Chris Hickle.\n“All the Tesla owners know it’s there,” he said of the charging station. “There’s a group of Tesla owners that periodically come through — they road trip together.”\nAnd they buy Tobies’ famous caramel rolls, Hickle added. “For sure, it’s a positive,” he said.\nThe I-35 corridor is a perfect place to encourage electric vehicle use, said David Ranallo, a senior marketing specialist with the electric co-op Great River Energy.\n“A lot of people still don’t consider electric vehicles a viable option for them,” Ranallo said. “We felt like this was an area we could move the needle.”\nJohn Reinan • 612-673-7402", "url": "https://apnews.com/5b62d36f242d45a49415ab118d8f9bbd"}