{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:04:07", "date_modify": "2020-05-04 20:04:07", "date_publish": "2018-08-29 11:03:00", "description": "Tell me about Kenya,” I said to my friend Nenna. We were on the phone — me in Rochester, Nenna in Denver where she lives. I was asking about her experiences working with Doctors Without...", "filename": "_c9024cf991254916974390fb4528e852_1588622647.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c9024cf991254916974390fb4528e852_1588622647.html", "title": "Aid worker finds beauty, hope amid desperate conditions", "title_page": "Jen's World: Aid worker finds beauty, hope amid desperate conditions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tell me about Kenya,” I said to my friend Nenna. We were on the phone — me in Rochester, Nenna in Denver where she lives.\nI was asking about her experiences working with Doctors Without Borders, the international humanitarian organization that brings emergency medical care to people in need.\n“While I was working in Kenya,” she said, “there was a huge influx of people fleeing from Somalia into the refugee camp, but not enough room to settle inside of the camp. So these people were settling on the outskirts of the camp, with no access to water and with no latrines. People had to stay awake all night so wild animals wouldn’t attack their children and families, because there were no shelters.”\nNenna was telling me about her assignment at Dadaab, where she’d spent 9 months as an aid worker at what was then the largest refugee camp in the world.\n“It took a long time, several weeks, to get these people access to water and latrines and shelter,” she continued. “(Doctors Without Borders) was able to build another health post outside the camp so these people would have easier access to health care instead of having to travel into camp.”\nI’d heard Nenna’s stories before. She’s been part of MSF (Doctors Without Borders’ French name is Médecins Sans Frontiéres, so she typically uses that acronym when referring to them) since 2008. Currently, she’s a regional coordinator for return MSF volunteers in the Denver area. But previously, as a field worker, she completed five international assignments.\nHer first was in Mozambique, where she worked for 13 months on an HIV project.\nEthiopia followed, where Nenna’s team provided aid during a cholera outbreak.\nIn Cape Verde, she helped those suffering from dengue fever. In Honduras, she was part of a street outreach team working with victims of urban violence.\nIt was between these assignments that Nenna worked at Dadaab refugee camp in Kenya. This is the work I wanted to talk to her about.\nMy interest wasn’t random. For one week next month, Doctors Without Borders is bringing its Forced From Home exhibition to Minnesota. Its focus — the plight of refugees — reminded me of Nenna’s work.\nThe free and interactive 10,000-square-foot exhibit, which will come to The Commons by US Bank Stadium, is designed to convey the challenges facing a person forced to flee. The exhibit includes virtual reality and 360-degree video and allows visitors to interact with material gathered from refugee camps, sea rescue missions, and emergency medical projects around the world.\nThese were, of course, experiences Nenna witnessed firsthand.\n“The thing I remember most,” she told me last weekend, “is that it was so hot and dusty. Yet, as hot as it was for me in the compound where we were living, there were places where we were able to get shade. And I’d think about the refugees who didn’t have shelter yet. They had to flee their homes and leave everything behind — most coming with the clothes on their back and literally that’s it. There was a lot of malnutrition. And here they were outside the camp, with no respite from the sun, just hoping for some sort of assistance.”\nIt was, Nenna said, painful to witness — and, clearly, still painful to recall. But that’s where the power of an aid worker comes in. “Getting the health post up and running and being able to provide therapeutic food for families and children was a huge lifesaver for them,” she told me.\nPlus, she pointed out, she frequently saw beauty and hope amidst difficult conditions.\n“As a supervisor of the health post, I worked with Somali refugees,” Nenna said. “One young man was the most energetic, positive person that I worked with. He always had a smile, was a super hard worker and was fun to be around. He got chosen to be relocated to the U.S., and I remember how excited and happy he was to have this chance to get out of the refugee camp. In the camp, opportunities are limited. There are no universities, no opportunities to make your life something different. His dream was to go to school and study, get a job and make something better for himself. He was ecstatic that he got to go to the U.S. and go to school.”\nIt’s stories such as these, and so many others, that speak to the power of organizations such as Doctors Without Borders.\n“Being able to provide care where there isn’t any, to give people some kind of medical care when they have access to none is amazing,” said Nenna. “You’re providing this vital service that everyone should have access to, but not everybody does.”\nForced From Home will be in Minneapolis from Sept. 9-16. For more information, check out www.forcedfromhome.com/locations/the-commons .", "url": "https://apnews.com/c9024cf991254916974390fb4528e852"}