{"authors": ["Zach Lentz T D Correspondent"], "date_download": "2020-05-04 20:03:46", "date_modify": "2020-05-04 20:03:46", "date_publish": "2018-01-13 22:55:00", "description": "CLEMSON -- Clemson will retain the services of three of the most dominant players in college football for another season, according to multiple sources. Defensive ends Austin Bryant and...", "filename": "_1c9106c7e70b483f81785aade31f8104_1588622626.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1c9106c7e70b483f81785aade31f8104_1588622626.html", "title": "CLEMSON FOOTBALL: Sources say D linemen staying", "title_page": "CLEMSON FOOTBALL: Sources say D linemen staying", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CLEMSON -- Clemson will retain the services of three of the most dominant players in college football for another season, according to multiple sources.\nDefensive ends Austin Bryant and Clelin Ferrell and defensive tackle Christian Wilkins have all decided to forego the NFL Draft and remain in school for their senior season.\nUnderclassmen have until Jan. 15 to make a final decision whether they are leaving for the NFL, but all indications are that, barring unforeseen circumstances, the trio will return for the 2018 season.\nTony Pauline, NFL Draft analyst and publisher of DraftAnalyst.com, further confirmed the sources stating on Twitter, “… Clemson coaches are telling people they (are) reasonably confident all three defensive linemen, Christian Wilkins, Clelin Ferrell & Austin Bryant will return to Clemson this season.”\nAll three were projected to be first-round selections by many NFL Draft publications, but with this year’s draft being very “need specific,” they faced uncertainty as to where they would fall in the draft.\nWilkins, the first player in the history of the program to graduate in 2-1/2 years, has amassed 141 total tackles, 10.5 sacks, 13 pass breakups, two fumble recoveries and one forced fumble. He was also named the recipient of the Bill Willis Award as the National Defensive Lineman of the Year by the Columbus (Ohio) Touchdown Club. Wilkins will be honored at the organization’s annual banquet on Feb. 17.\nThe junior from Springfield, Mass., was named a first-team All-ACC selection, first-team All-American by the Football Coaches Association and the Sporting News and a second-team selection by Associated Press.\nBryant came back in his junior season and became the dynamic player that many thought he would be. In 2017, Bryant has 7.5 sacks with 47 tackles, 14.5 for a loss, one interception and two forced fumbles.\nFerrell followed up a breakout postseason in 2016 with a dynamic 2017 season -- leading the Tigers with 9.5 sacks, making him one of the most feared defensive ends in the country. Ferrell also leads Clemson’s defense in tackles for loss with 18. The sophomore has 66 tackles overall. He is fourth on the Clemson team and first among defensive linemen.\nFerrell, who was named first-team All-ACC, had 5.5 tackles for loss at Syracuse and five in the win over N.C. State. He is the only player in the nation with two games with five tackles for loss and the only Clemson player in history to do it in one season.\nWith the announcement, the Tigers vault to the clear favorite to once again win the ACC and make a return trip to the College Football Playoff, returning 15 of their 22 starters off of last year’s CFP semifinal team that finished the season 12-2.", "url": "https://apnews.com/1c9106c7e70b483f81785aade31f8104"}