{"authors": ["Brittany Nader", "Special To Cleveland.Com"], "date_download": "2020-05-04 20:20:48", "date_modify": "2020-05-04 20:20:48", "date_publish": "2018-02-14 18:49:53", "description": "Goodyear to honor Earnhardt family in new Daytona 500 commercial AKRON, Ohio — Goodyear will unveil its new television ad, featuring Dale Earnhardt Jr., during the Daytona 500 at 2:30 p.m....", "filename": "_26e71f4ab0284d429e7db1cddc1dad1c_1588623648.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_26e71f4ab0284d429e7db1cddc1dad1c_1588623648.html", "title": "Goodyear to honor Earnhardt family in new Daytona 500 commercial", "title_page": "Goodyear to honor Earnhardt family in new Daytona 500 commercial", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Goodyear to honor Earnhardt family in new Daytona 500 commercial\nGoodyear to honor Earnhardt family in new Daytona 500 commercial\nAKRON, Ohio — Goodyear will unveil its new television ad, featuring Dale Earnhardt Jr., during the Daytona 500 at 2:30 p.m. Sunday, Feb. 18.\nThe “Make a Name” commercial will air on FOX, SiriusXM, NASCAR RADIO and Motor Racing Network.\nAn extended version is available to view on Goodyear’s YouTube channel.\nThe minute-long ad highlights the relationship between Goodyear and Earnhardt Jr., introducing the viewer to the tire company’s history with the Earnhardt family.\nIt is set to a cover of Jim Croce’s “I Got a Name,” performed by Croce’s son A.J. The original version of the song was used in the 1973 sports biopic “The Last American Hero” about NASCAR driver Junior Johnson.\n“It’s been an honor to represent my family name and bring my father’s song to life with Goodyear,” A.J. Croce said in a news release.\nGoodyear created a special design on its Wingfoot One blimp to honor the new ad. The tire maker temporarily replaced the iconic “Goodyear” text with ”#MakeAName” on the blimp.\nA 30-second version of the commercial will debut during one of the most legendary races with one of the most legendary drivers, said Seth Klugherz, Goodyear’s director of North America marketing, in a news release.\n“Dale Jr.’s story underscores Goodyear’s commitment to hard work, determination and drive, and we are proud to stand by his side,” Klugherz said in the release.\nEarnhardt Jr. won all of his NASCAR races with the support of Goodyear tires.\n“Goodyear has always been part of my family, and I’m proud to partner with them on this ‘Make a Name’ spot, which is a reflection of one’s legacy, values and drive,” Earnhardt Jr. said in a news release. “It tells a very personal story about me growing up, but it also hits home with where I am today, both personally and professionally.”\nWatch the new Goodyear commercial at youtu.be/3MkFzZtSz3A.\nWant more Akron news? Sign up for cleveland.com’s Rubber City Daily, an email newsletter delivered at 5:30 a.m. Monday through Friday.", "url": "https://apnews.com/26e71f4ab0284d429e7db1cddc1dad1c"}