{"authors": ["Jane Morice"], "date_download": "2020-05-04 20:10:18", "date_modify": "2020-05-04 20:10:18", "date_publish": "2018-06-10 17:04:54", "description": "Reports: Justin Bieber used 'racial epithets' during 2016 downtown Cleveland brawl, new lawsuit says CLEVELAND, Ohio – The man who claimed Justin Bieber attacked him at a Cleveland hotel in...", "filename": "_525776e572d14156ab183308a2a3ba8c_1588623018.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_525776e572d14156ab183308a2a3ba8c_1588623018.html", "title": "Justin Bieber used 'racial epithets' during 2016 downtown Cleveland brawl, new lawsuit says", "title_page": "Reports: Justin Bieber used 'racial epithets' during 2016 downtown Cleveland brawl, new lawsuit says", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Reports: Justin Bieber used ‘racial epithets’ during 2016 downtown Cleveland brawl, new lawsuit says\nReports: Justin Bieber used ‘racial epithets’ during 2016 downtown Cleveland brawl, new lawsuit says\nCLEVELAND, Ohio – The man who claimed Justin Bieber attacked him at a Cleveland hotel in 2016 has filed a lawsuit saying that the singer used “racial epithets” against him during the fight, reports say.\nRodney Cannon, 36, filed his lawsuit Thursday. He said that during the fight outside the Westin hotel on St. Clair Avenue, the singer’s “threatening communications made in public in front of a number of people included the use of racial epithets,” according to PEOPLE Magazine.\nHowever, a source close to Bieber told PEOPLE that no racial epithets were uttered during the brawl.\nCannon’s lawsuit also claims that the brawl “caused... physical and emotional harm, while also forcing him to miss multiple days of work,” Billboard reports. Cannon says he lost consciousness briefly and suffered injuries to his head and back, The New York Daily News says.\nCannon filed a Cleveland police report detailing the incident in February 2017, even though the fight happened after a June 2016 NBA Finals game.\nCannon told police that he met Bieber as he walked into his hotel after the game. The duo shared a drink at the bar, and Bieber grabbed Cannon’s sunglasses as they were leaving, the report says.\nCannon then took a photo of Bieber, which angered the singer, the report states. Cannon said he’d delete the picture if Bieber gave the sunglasses back.\nThe scuffle ensued when Bieber started deleting pictures off of Cannon’s phone, but did not return the sunglasses. Bieber punched Cannon in the face several times, the report says.\nVideo of the fight was released to TMZ shortly after it happened. Bieber has not been criminally charged in connection with the fight.\nBieber’s representatives did not reply to several outlets’ request for comment.\nIf you’d like to comment on this post, please visit the cleveland.com crime and courts comments section.", "url": "https://apnews.com/525776e572d14156ab183308a2a3ba8c"}