{"authors": ["E.J. Dionne Jr."], "date_download": "2020-05-04 20:08:54", "date_modify": "2020-05-04 20:08:54", "date_publish": "2018-10-20 05:00:00", "description": "CAMBRIDGE, Mass. -- \"Do whatever you have to do. Just win, baby.\" Nancy Pelosi's feisty, candid and pragmatic words to Harvard students on Tuesday reflected the House Democratic leader's...", "filename": "_87ff676453394355a9dc2e569c17f4c6_1588622934.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_87ff676453394355a9dc2e569c17f4c6_1588622934.html", "title": "What Democrats say about her isn't worrying Nancy Pelosi", "title_page": "E.J. DIONNE JR.: What Democrats say about her isn't worrying Nancy Pelosi", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CAMBRIDGE, Mass. -- “Do whatever you have to do. Just win, baby.”\nNancy Pelosi’s feisty, candid and pragmatic words to Harvard students on Tuesday reflected the House Democratic leader’s full adaptation to the role of designated dart board for House Republicans. She granted full absolution to party hopefuls who think they’ll enhance their chances of winning by promising not to elect her House Speaker.\n“None of us is indispensable,” she declared amiably.\nBut then came a steely postscript: “You can’t let the opposite party choose the leader of your party.”\n“And I say this especially to women,” she added, “because they think women are going to run away from the fight. But you can’t do that. You believe in what you have to offer.”\nShe does, and her implications are clear. Republicans want to get rid of her because she’s effective. Sexism is a big reason for her starring role as an ogre in GOP advertising. And while Democrats should say what they need to say now, they’d do well to be wary of deposing her in response to pressure from the other side.\nSpeaking before a packed house at an event sponsored by the Kennedy School of Government’s Institute of Politics, Pelosi made as clear as she could that -- far from being the ultra-liberal of conservative demonology -- she is thoroughly in touch with the sensibilities of the swing voters her House candidates need to persuade.\nShe didn’t mention President Trump until well into the conversation, emphasizing instead the Democrats’ core promises: to hold down health care costs; to enact campaign-finance reform and other democratizing political changes; and to implement a big infrastructure program that Trump himself might back.\nPelosi pushes hard against the idea that a Democratic-led House would move quickly toward impeaching Trump. On the contrary. “I think using the word ‘impeachment’ is very divisive,” she said, “and that isn’t a path that I would like to go down.” She knows that Trump uses impeachment talk to fire up his own base. She is not about to feed the blaze.\nAt the same time, she stressed that she wants the “documentation” from Special Counsel Robert Mueller’s investigation to be “preserved” so Congress and the public can have “the documents and the truth.” If there is a case for impeachment, she seemed to suggest, it will emerge from what Mueller finds, not what Democrats say.\nShe is equally careful about the sorts of inquiries a Democratic House would launch into other aspects of the Trump presidency. Pelosi lists a long series of Trumpian abuses, but then adds: “I don’t think this should be scattershot. I think it should be responsible, honoring our Constitution and our responsibilities. ... I’ve asked my chairs to be prepared, but not everything is on par with everything else.”\nThe more militant in the party might find Pelosi a bit too deliberate. But she has a shrewd sense of what a legislative majority can -- and can’t -- accomplish. She earned a lot of the credit for the passage of the Affordable Care Act in 2010 under excruciating political circumstances.\nBut none of this reduces the pressure she might face. According to an NBC News count in August, at least 57 Democratic House candidates have said they would not support her for speaker, reflecting in part a desire for generational change. In a party that increasingly leans on younger voters, Pelosi is 78; the No. 2 Democrat, House Whip Steny Hoyer of Maryland, is 79; and the No. 3 member of the leadership, Rep. Jim Clyburn of South Carolina, is 78.\nResponding to a student questioner who complained that the House seniority system freezes out the young, Pelosi briefly mooted the possibility she might serve as a transitional speaker to new leadership. “I see myself as a bridge, really,” she said.\nBut when Mark Gearan, the director of the Institute of Politics, pressed her on the bridge she had in mind, she didn’t elaborate beyond saying that she was focused on “how we’re taking what we’re doing into the future.”\nPelosi expressed guarded confidence that the electorate would side with the Democrats in order to reintroduce “checks and balances” to Washington. But she warned that many House races are very close. And if instead, the election proved to be “a validation” of “the practices and the personal affronts of this president of the United States, I pray very hard for our country.”\nWhich is why she doesn’t much worry over what Democrats say about her between now and Election Day.", "url": "https://apnews.com/87ff676453394355a9dc2e569c17f4c6"}