{"authors": ["The Herald-Dispatch"], "date_download": "2020-05-04 20:17:07", "date_modify": "2020-05-04 20:17:07", "date_publish": "2018-04-19 04:01:00", "description": "HUNTINGTON - The Cabell County Commission and Huntington City Council approved expense and excess levy rates for the 2018-19 fiscal year during special meetings Tuesday. The rates are set...", "filename": "_fac61995a62d4b6fb424d4a9893091f6_1588623427.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fac61995a62d4b6fb424d4a9893091f6_1588623427.html", "title": "Cabell, Huntington approve levy rates, unchanged for FY 2019", "title_page": "Cabell, Huntington approve levy rates, unchanged for FY 2019", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON - The Cabell County Commission and Huntington City Council approved expense and excess levy rates for the 2018-19 fiscal year during special meetings Tuesday.\nThe rates are set every year and, by state law, must be set at a special meeting on the third Tuesday in April.\nNo one from the public made any objections to the property taxation rates at either of the meetings.\nCabell County levy rates\nCounty Administrator Beth Thompson said the county levy rates were unchanged and have remained the same for several years.\nThe rates are broken down into four categories, but only three of them affect property owners in the county. Class II properties, which are all residential units in the county, are taxed 28.60 cents per $100 assessed valuation on each property. Class III properties, which are all commercial businesses outside municipalities, and Class IV properties, which are all commercial businesses inside municipalities, are both taxed 57.20 cents.\nTotal projected property tax collection from properties inside the county are about $14.5 million, which makes up the majority of the county’s revenue.\nThe commission also laid the rates for the excess levy funds. Class II properties are taxed 13.58 cents per $100 assessed on each property. Class III and Class IV properties are taxed 27.16 cents.\nThe excess levies raise funds for Cabell County Emergency Medical Services, the Cabell-Huntington Health Department, fire protection services and training, economic development, Green Acres Regional Center and Autism Services Center, and Cabell County senior citizen projects and programs.\nThompson said the county’s regular levy has been maxed out for years; however, they still have about $300,000 in levying authority left with the excess levy before it reaches its max.\nState law requires that excess levy rates cannot be more than half of the property taxation rates.\nHuntington levy rates\nThe levy rates for the city of Huntington also remained unchanged and at their max.\nClass II properties are taxed at 22 cents per $100 assessed on each property and Class IV properties are taxed 44 cents.\nTotal projected property tax collection from properties inside Huntington is just over $5 million.\nApproved excess levy rates for Huntington are 7 cents per $100 of property tax value for Class II and 14 cents for Class IV.\nTotal projected property tax collection for the excess levies, which subsidizes operations at the Tri-State Transit Authority, is about $1.6 million.\nThe 2018-19 fiscal year begins July 1, 2018, and ends June 30, 2019.", "url": "https://apnews.com/fac61995a62d4b6fb424d4a9893091f6"}