{"authors": ["Patrick Varine"], "date_download": "2020-05-04 20:05:29", "date_modify": "2020-05-04 20:05:29", "date_publish": "2018-08-19 01:11:35", "description": "The $1 million renovation of the Westmoreland County Community College's Public Safety Training Center isn't just important for first responders. \"It's important for everyone here in...", "filename": "_cf5b3da1750b40eeaf65af87d136f78b_1588622729.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cf5b3da1750b40eeaf65af87d136f78b_1588622729.html", "title": "WCCC adds classrooms, showers and more to public safety training center in South Huntingdon", "title_page": "WCCC adds classrooms, showers and more to public safety training center in South Huntingdon", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WCCC adds classrooms, showers and more to public safety training center in South Huntingdon\nThe $1 million renovation of the Westmoreland County Community College’s Public Safety Training Center isn’t just important for first responders.\n“It’s important for everyone here in Westmoreland County,” county Commissioner Gina Cerilli said.\nCommissioner Ted Kopas agreed.\n“What the college is able to accomplish helps us all,” he said.\nRenovations at the 167-acre property, unveiled Friday, centered around additional classroom space, which is crucial in order to accommodate local, state and federal agencies that train there, according to director Marc Jackson.\n“It provides us with the ability to run multiple classes at the same time. Now we can have four or five departments here training, and be running four or five classes at the same time,” Jackson said. “In addition, in the evenings, we can also do that, as opposed to having only one or two at a time previously.”\nIn addition to classroom space, the renovation added break rooms, showers, equipment for advanced training classes and a new building to house a training fire engine. It allows local departments to do multiple training sessions annually, instead of only being able to schedule one class per year, or having to go elsewhere for a particular type of training.\nMark Penska, first assistant chief at Turkeytown Volunteer Fire Department, said his crews use the center frequently.\n“Our younger guys just went through (basic firefighter training) a year ago, and they went through vehicle rescue training here recently,” Penska said. “We come down here quite a bit.”\nKopas said the renovations are the least the county can do for its emergency responders.\n“The demands on you guys grow every day, but your numbers keep shrinking,” he said. “We ask a lot of you, and this is a chance for us to put some of our money back into what you do and help you out.”\nHempfield Supervisor Doug Weimer said a township fire department recently donated a fire truck to the center.\n“We know that it’s essential for the training of our volunteers,” Weimer said.\nIn 2017, more than 2,800 public safety workers trained at the facility, according to WCCC officials. This spring, more then 2,000 attended training seminars.\nThe public safety center is part of a school-wide capital improvement plan WCCC is undergoing between now and 2020.", "url": "https://apnews.com/cf5b3da1750b40eeaf65af87d136f78b"}