{"authors": ["Keith Roach"], "date_download": "2020-05-04 20:20:01", "date_modify": "2020-05-04 20:20:01", "date_publish": "2018-12-11 21:13:30", "description": "Dear Dr. Roach: I recently have been diagnosed with early prostate cancer. My Gleason score is 7. My urologist has informed me that he doesn't think I am a good candidate for surgery, due to...", "filename": "_880879bbbf5d41e2a6e43fe829726e68_1588623601.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_880879bbbf5d41e2a6e43fe829726e68_1588623601.html", "title": "Doc: Comparing array of treatments for prostate cancer", "title_page": "Doc: Comparing array of treatments for prostate cancer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dear Dr. Roach: I recently have been diagnosed with early prostate cancer. My Gleason score is 7. My urologist has informed me that he doesn’t think I am a good candidate for surgery, due to having atrial fibrillation. My radiation oncologist has recommended traditional radiation therapy. However, I am worried about the possible side effects. I am 72 and in otherwise good health.\nI am considering proton therapy and wonder if you have any thoughts. My research indicates that this has far lower risk of incontinence and impotence.\nR.O.B.\nDear R.O.B.: Prostate cancer can be a challenging diagnosis, and I hope I can help clarify things a bit.\nYou have what would be termed intermediate-risk prostate cancer, based on your Gleason score, a measure of how aggressive the cancer appears on pathological slides. Most experts would recommend radiation or surgery. Atrial fibrillation itself is not necessarily a reason NOT to get surgery; however, the side effects probably are less with radiation compared with surgery. Depending on the exact findings of your cancer, experts would recommend radiation in addition to surgery in some cases similar to yours. The radiation is combined with hormone treatment in some people.\nRadiation may be delivered from the outside, either with X-rays (traditional) or protons, or from the inside via internal radiation “seeds” implanted surgically, called brachytherapy. Cancer cells are more sensitive to radiation than surrounding healthy cells, so radiation has been an effective treatment for prostate cancer for decades. Unfortunately, healthy cells of the bladder and rectum still can be affected by radiation, so side effects of radiation include urinary complaints and rectal bleeding, pain and urgency. Sexual function also may be affected; however, modern X-ray radiation techniques (called intensity-modulated radiation therapy) are much better at avoiding the structures that can lead to these complications.\nThe research data has shown that there is not a survival difference comparing radiation and surgery. When comparing IMRT and proton beam treatment, there is no convincing evidence that proton beam therapy is more effective, but there is weak-to-moderate evidence of MORE side effects with proton beam, especially more GI symptoms (34 percent higher in the proton beam group). A head-to-head trial would be needed for definitive data. Proton beam is much more expensive. Brachytherapy, on the other hand, seems to have similar side effects and at least as good outcomes; again, there are not head-to-head trials to confirm this. Decreased sexual function is common in all treatment modalities.\nAll three options (X-ray, proton beam and brachytherapy) are reasonable, have similar effectiveness and relatively low side effect rates in the bladder and bowel, and higher in sexual function. However, I don’t see a reason to prefer proton treatment at the present time over IMRT.\nDear Dr. Roach: I had a terrible reaction to a tetanus shot 30 years ago — arm swollen, fever, body aches. Now I need the Tdap vaccine to protect a future grandchild. Can I get just a pertussis vaccine?\nK.M.\nDear K.M.: There is not a vaccine only for pertussis, and it’s worthwhile to get the booster for tetanus and diphtheria if you haven’t had one in 30 years.\nThe vaccine is different now from the one you had 30 years ago, and you are less likely to get a reaction. Some people do get a sore or swollen arm, low-grade fever and aches that generally last less than 24 hours. While I hope you don’t get a reaction, I do want to stress that it is certainly safest for your new grandchild and for yourself.\nEmail questions to ToYourGoodHealth@med.cornell.edu.", "url": "https://apnews.com/880879bbbf5d41e2a6e43fe829726e68"}