{"authors": ["Nuno Teles", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Catarina Príncipe", "Various Authors", "Francisco Louçã"], "date_download": "2020-05-04 19:57:58", "date_modify": "2020-05-04 19:57:58", "date_publish": "2018-06-29 00:00:00", "description": null, "filename": "2018_07_portugal-left-bloc-eurozone-austerity-eu_1588622278.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/06/29175946/portugal.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_07_portugal-left-bloc-eurozone-austerity-eu_1588622278.html", "title": "The Portuguese Illusion", "title_page": "The Portuguese Illusion", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn 2015, Portugal’s euroskeptic Left Bloc and the Communist Party (PCP) agreed to support a government led by the pro-European Socialist Party (PS) on a platform to end austerity and reverse many of the measures imposed by the 2011 EU-IMF bailout. The coalition reversed pension and public-sector wage cuts, halted planned privatizations, and raised the minimum wage well above inflation. Almost three years into the government, the economy has bounced back and unemployment has dropped to less than half of its peak. This success story has been repeated ad nauseam in press around the world: how a fractious left overcame its historical differences to reach a progressive agreement within the Eurozone’s tight constraints. At last, we are told, a left-wing government accomplished its anti-austerity program, offering hope to a European left still traumatized by Syriza’s spectacular failure in Greece. The cherry on top: while the government was at first only critically tolerated by the European Union, it is now widely commended in Brussels for hitting, and even surpassing, its fiscal targets. Portuguese finance minister Mario Centeno has even been elected as the head of the Eurogroup. To many observers, Portugal is a case study in the compatibility of anti-austerity policies and European fiscal targets — a fresh argument against any break with the Eurozone. But this story is far from the Portuguese people’s everyday experience. A different situation lies beneath the appearance of economic success.\nAnti-Austerity? One of the coalition government’s frequently cited achievements is the reduction of public deficits to historic lows — from 3 percent of GDP in 2015 (4.4 percent if the bailout of the private bank Banif is taken into account), to 0.9 percent, in 2017 (or 3 percent if the recapitalization of the public bank CGD is included). Meanwhile, the economy is growing — at 1.6 percent in 2016, and 2.7 percent in 2017. Most commentators have associated this impressive record with a boost in domestic consumption driven by the reversal of wage and pensions cuts. These measures, it goes, resulted in economic growth, in turn raising tax revenue and decreasing social spending on things like unemployment insurance. It is undeniable that the economic recovery of the last two years has played a central role in raising tax revenue. But beyond the planned reversals to wage and pension cuts, this has not translated into more investment in the public sector. In fact, public spending was one of the key blind spots of the coalition government’s agreement. Portugal has the lowest public investment relative to GDP in the whole European Union. Public investment dropped from 2.2 percent of GDP in 2015 to 1.5 percent in 2016, before then reaching 1.8 percent in 2017. According to the latest Eurostat data (for 2016), despite the raising of wages, public service spending remained at the same record lows seen during the EU-IMF bailout. Public health spending was actually higher during the previous right-wing government, and declined to 5.9 percent of GDP in 2016 from a peak of 6.9 percent in 2009. While the student population has declined, there has also been a fall in education spending, to 4.9 percent of GDP (a 0.2 percent drop). Public services are still subject to the norms of austerity, remaining chronically understaffed and underfunded. It’s significant that there have been no new public-spending cuts when the Right’s election campaign hinged on dramatic ones. But it’s difficult to see any aggregate public spending boost that could drive economic growth, even taking into account higher wages and pensions. A third, paramount factor in deficit reduction, affecting both public (and private) finances, is the sudden change of international financial conditions for the Portuguese economy. This change owes to the ECB’s bond buying Quantitative Easing (QE) program, only available for Eurozone rule-abiding countries, and the consequent drop in interest rates (reaching negative levels on short-term issuances of public debt) and of debt service on a public debt amounting to 126 percent of GDP. According to Eurostat, the interest payable by the government has fallen from 4.6 percent of GDP in 2015 to 3.9 percent in 2017. Equally important, on the revenue side, the 25 billion Euros of public debt bonds bought by the Bank of Portugal under QE have meant that the interest paid on these bonds is to be returned to the Treasury as Bank of Portugal dividends (525 million Euros in 2017, nearly 0.3 percent of GDP). Thus, the reduction in fiscal deficits can be explained by a combination of rising tax revenue, financial windfalls, and public spending constraints.\nThe Economic Recovery It’s also important to understand why the unemployment rate has fallen from a peak of around 17 percent in 2013 to 8 percent today. Leaving aside the role of emigration (net migration figures show more people leaving than arriving), lower unemployment was mostly the result of new jobs in labor-intensive services like retail, hotels, and restaurants. These services grew because of the rise in domestic consumption. More robust wages and pensions may have also played a role here, along with the fall in the interest payments that heavily indebted Portuguese households have to pay. However, it’s tourism, growing at 10 percent a year, according to the National Statistics Institute, that’s been the main engine of Portuguese economic growth. Political turmoil in regions that compete with Portugal — like North Africa and the Middle East — the rise of low-cost air travel, and hype in the international press have all brought tourists to Portugal in droves, transforming the major urban centers of Lisbon and Porto. This tourist boom has, in turn, led to rampant real-estate speculation. Coupled with the airbnbization led by local owners (60 percent annual growth in 2017), foreign real estate funds have bought up masses of real estate in the city centres (80 percent of all commercial real estate sales in 2017 had non-residents as buyers). This has increased the price of housing and driven locals away to the suburbs. While these changes are concentrated in the tourist destinations of Porto, Lisbon and the southern Algarve region, average Portuguese house prices rose 27 percent in real terms between the second quarter of 2013 and the end of 2017, according to the Bank of Portugal. Real estate and construction should thus be considered sources of recent economic growth. Employment in these sectors is precarious, badly paid, and defined by high employee turnover. Between 2013 and the end of 2017, 3.8 million new worker contracts were signed, of which 2.6 million were terminated during the same period. Only about a third of these new contracts are permanent, with the remaining two-thirds being either atypical (e.g. agency work) or limited-term contracts. Even with the higher minimum wage, these jobs provide wages well below the national average. According to the Portuguese Observatório das Crises e das Alternativas, the average monthly wage in new permanent contracts declined from 961 euros in mid-2014 to 837 Euros at the end of 2017. The growth of these precarious, low-paid sectors partly explains this situation. But it’s also due to the current government’s reluctance to reverse the neoliberal labor market reforms imposed in 2012, which attacked all aspects of labor rights (types of contracts, working hours, overpay, holidays, collective bargaining, etc.). The current recovery and restructuring of the Portuguese economy is thus centered on low productivity sectors, plagued by precarity and with little need for new investment. Aggregate (public and private) investment remains at low levels; this figure is projected at 16.1 percent of GDP for 2017, still well below the 2008, pre-crisis level, of 22.8 percent. Though there has been some recent recovery, private investment is still 11 percent below the 2005-2008 average. This seems unlikely to change any time soon, since the Portuguese banking sector is still in a perilous position. The ECB’s low interest rates and long-term lending have prevented a systemic banking crisis, but banks’ balance sheets are still plagued with high levels of non-performing loans — a 13.3 percent ratio, placing Portugal only behind Greece and Cyprus among all Eurozone countries. Credit demand has slowly picked up during the last two years but, at the aggregate level, Portuguese banks, companies and households are still working to reducing their debts. Meanwhile, the ECB is pushing a takeover by big Spanish banks like Santander and La Caixa as part of its vision of a Banking Union fortressed by pan-European banks. Leaked emails show, for instance, that the bankrupted BANIF’s fire sale to Santander in 2016 was orchestrated by the Portuguese Treasury and the ECB using the threat of cutting liquidity to the failing bank.", "url": "https://jacobinmag.com/2018/07/portugal-left-bloc-eurozone-austerity-eu"}