{"authors": ["Wayne Au", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:44", "date_modify": "2020-05-04 19:54:44", "date_publish": "2018-04-09 00:00:00", "description": null, "filename": "2018_04_against-the-sat-testing-meritocracy-race-class_1588622084.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/04/09163008/SAT.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_04_against-the-sat-testing-meritocracy-race-class_1588622084.html", "title": "The Socialist Case Against the SAT", "title_page": "The Socialist Case Against the SAT", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "“If you believe in equality, you should defend the SAT,” argues Freddie deBoer in “The Progressive Case for the SAT.” He contends that SAT scores merely reflect larger race and class inequalities. However, given that holistic college admissions are flawed due to those same race and class inequalities in GPAs and grade inflation, he reasons that it is more equitable to keep using the SAT for college entrance than to scrap it. To support his argument, deBoer then draws on research claiming that bias in SAT performance due to increased tutoring and resources is negligible, and that there is no race or class bias in the exam itself. Along the way, deBoer suggests that, while well-meaning, progressive criticisms of the SAT simply amount to “folk wisdom” and are wrong. As a Marxist who researches, writes, and speaks extensively about high-stakes, standardized testing, I found deBoer’s argument to be puzzling. It was almost as if he hadn’t actually investigated the history of the SAT, engaged with the extensive body of research about the exam, thought through the political implications of his own argument, or taken the time to analyze the capitalist ideology that lays at the SAT’s foundation. Understanding the shortcomings of deBoer’s position is important for radicals and socialists because it is shared by many parents trying to navigate our system of education — and it is these parents we want to better organize to fundamentally reshape the entire system.\nThe Racist Past of the SAT Anyone advocating for the SAT as a tool of educational justice cannot ignore the test’s detestable past. The SAT was created by Carl Campbell Brigham, a Princeton professor who analyzed army testing results from over one hundred thousand World War I army recruits in his most famous book, A Study of American Intelligence. At the time, Brigham was an enthusiastic eugenicist who believed intelligence was genetic and that different races and ethnicities were biologically more intelligent than others. Brigham’s analysis of the army test data reflected the eugenicist thinking of his day: he was concerned that, while the United States had been established by the superior “Nordic” peoples, the “Alpines” and “Mediterraneans” of southern and eastern Europe were diluting the white gene pool with their inferior stock. Writing in A Study of American Intelligence, he summarized that: The army mental tests had proven beyond any scientific doubt that, like the American Negroes, the Italians and Jews were genetically ineducable. It would be a waste of good money to even attempt to try and give these born morons and imbeciles a good Anglo-Saxon education, let alone admit them into our fine medical, law, and engineering graduate schools. In 1926, Brigham used this work to develop the Scholastic Aptitude Test, or SAT, for the College Board. The first SAT was administered to high-school students that year. To be fair, Brigham recanted his racist, eugenics-based findings four years later. He even went so far as to publish a formal retraction of A Study of American Intelligence, saying that the findings were, “without foundation,” and that the “study with its entire hypothetical superstructure of racial differences collapses completely.” But while the SAT has tried to break from its eugenic roots, it still serves the same purpose across time and ideology: to sort human populations by deeming high-scorers as valued and deserving of opportunity, and by deeming low-scorers as unvalued and undeserving of opportunity. This is as true of the SAT now as it was almost a hundred years ago.\nThe Racist Present of the SAT In addition to ignoring its racist past, deBoer’s argument for the SAT and his dismissal of critiques as “folk wisdom” miss some important empirical research challenging the idea that the exam can be a tool for educational equity. These lines of research investigate whether the SAT does what it is designed to do and how the SAT’s design builds inequality into its very DNA. The College Board, which administers the SAT, has asserted that the SAT is a strong predictor of first-year grades in college. The problem is, the SAT is not very good at making this prediction. For instance, a 2016 study published in the Journal of Educational Psychology used the College Board’s own SAT data from 475,000 test-takers to see how predictive the SAT was of students’ first year grades. They found that: When analyzed by gender, the SAT inaccurately predicted first-year mathematics grades for eighty thousand male and female identified students.\nWhen comparing white and Latino mathematics scores, the SAT either overpredicted or underpredicted first-year college grades for sixty-five thousand students.\nWhen comparing critical reading scores of black and white students, the SAT either overpredicted or underpredicted first-year college grades for sixty-five thousand students. Additionally, a 2014 study released by the national Association for College Admissions Counseling analyzed data from 123,000 college students and found that there were trivial differences in the GPAs and graduation rates of those who submitted SAT and ACT scores and those who didn’t. Basically, SAT scores produce large amounts of error, and they don’t correlate with college success in comparison to students who don’t take the SAT. It also turns out that the process of SAT test-question selection is flawed in racially biased ways. When the SAT tries out new questions, unbeknownst to students, they put these questions in a special trial section of the test. If a test-taker gets the trial test question correct and goes on to score high on the SAT overall, then the question is deemed a valid and good question and gets included in a future test — all because it is the kind of question that a high SAT test-scorer gets correct. This means that the SAT is populated by questions that high-scoring SAT takers answer correctly. The problem is that this process creates a self-reinforcing cycle of race and class inequality. A 2003 study by Kidder and Rosner published in the Santa Clara Law Review found racist outcomes in the SAT test-question selection: there were trial SAT questions where blacks got the right answer more often than whites, and where Latinos got the right answer more often than whites. However, these questions, where the typical racial outcomes of the SAT were inverted, were deemed invalid as real questions for use of future tests. Why? Their pattern of correct responses didn’t match the overall patterns among individual SAT test-takers. The black and Latino students who got those trial questions right more often than the white students, didn’t outscore the white students overall. Writing in the Nation, Rosner explained: Each individual SAT question ETS chooses is required to parallel outcomes of the test overall. So, if high-scoring test-takers — who are more likely to be white — tend to answer the question correctly in [experimental] pretesting, it’s a worthy SAT question; if not, it’s thrown out. Race and ethnicity are not considered explicitly, but racially disparate scores drive question selection, which in turn reproduces racially disparate test results in an internally reinforcing cycle. In this sense the SAT is a textbook example of what race scholar Eduardo Bonilla-Silva calls colorblind racism. Officially it is race neutral, but empirically it produces and reproduces racialized outcomes. In this context it is important to remember that the SAT is designed to sort and stratify human populations. The SAT is a norm-referenced test. This means its primary purpose is to sort and rank students in comparison to each other — establishing a “norm” for performance and demarcating who is above and below this norm. Consequently, the SAT is designed to produce a “bell curve” of test scores, where some score high, a bunch land in the middle, and some score low. The bell-curve assumption built into the SAT extends directly from the eugenics movement: It presumes that intelligence is naturally distributed across human populations unequally. Within this frame a good test not only requires that a portion of students to fail, it also mirrors this presumed “natural” distribution of human intelligence. In this way, the SAT is required to produce inequality, not equality. In a racist, capitalist system, that the SAT unequally stratifies human populations by race and class should come as no surprise.\nThe SAT and Meritocracy To make his argument that there is no real race and class bias in the SAT, deBoer draws on research to assert that, “Once overall ability is controlled for, black students do just as well as white on the same items, as do poor students and wealthier ones.” DeBoer’s point highlights two deeply problematic assumptions. First, in making this argument he casually throws out the idea that something mysterious called “ability” can be controlled for in testing research, and once we deal with that difference (whatever that is), there actually is no inequality in the SAT. DeBoer’s assumption of the existence of “ability” in this way is vague enough to open the door to all kinds of interpretations. Do black and white or rich and poor students have different abilities? Are those different abilities based on being black or white or rich or poor? If not, what are they based on? Either these abilities are innately connected to one’s race or class position or these differing abilities are a reflection of broader race and class differences that exist in society. Regardless of which way he goes, deBoer’s argument is circular: race and class don’t really impact SAT scores as long as we just ignore impact of race and class on SAT scores. In order to work through these logical gymnastics, DeBoer has to rely on a second problematic assumption — that SAT scores are a valid, bias-free, and objective measurement of students for college admissions. Indeed, this core belief in the objective measurement by the SAT is a problem that lurks throughout his essay, since for deBoer it is this kind of validity that makes the SAT a progressive tool that can slice through the vagaries of holistic admissions, GPA, and grade inflation. By arguing for the SAT as a valid and objective measurement of students, class and race be damned, deBoer’s argument is fundamentally individualist. That is, he is suggesting that test scores aren’t a product of structural inequalities like racism and class differences. At that point, all deBoer is left with is the idea that SAT scores, as valid measurements of college worthiness, are in fact the product of individual merit and effort. In this way, deBoer’s “progressive case for the SAT” is not so progressive at all. Obviously, seeing standardized-test scores as objectively valid, and therefore useful for measuring students, is not particularly new. As I noted above, almost a century ago Carl Brigham believed the World War I army testing was objective, bias-free, and therefore valid for measuring human populations. In fact, many originally saw the SAT as a way to challenge elitism in college admissions. Using SAT scores, colleges could admit students based on their individual merit instead of based on their family background or class position as legacy admissions, which was common at the time. Similarly, most true-believers in today’s high-stakes, standardized tests ultimately share this belief in test score validity, and based on that belief, also believe we can test our way to race and class equality. This myth of meritocracy serves a dual ideological purpose for capitalism. It denies the existence of structural issues like racism, economic exploitation, or patriarchy as sources of inequality, and instead posits that the issue is about individual effort. In turn, the myth then gets used to justify existing socioeconomic inequalities. Within the myth of meritocracy, institutionalized oppression is nonexistent. Issues like the disparate incarceration rates for black men and women, race-, class-, and gender-based differences in wages, the disproportionate killing of unarmed black men and women by police, the lack of accountability for sexual harassment and rape of women, disparities in discipline rates of black and Latino children in schools — none of these is systemic. Instead, the problem is that individuals are making poor individual choices and just not working hard enough to get ahead. This ideology is rampant in education. Right now, the current favorite remedies for educational inequality being pushed by the neoliberal, corporate education reformers are “grit” and “resilience.” For them, all that working class-students and kids of color need to be successful in schools and overcome any of the obstacles that they might face is discipline, focus, and hard work. Built into this narrative, and often unspoken, is the idea that working-class students and kids of color are deficient — either culturally, racially, individually, or as a class. They are told, “There is something wrong with you (or your family or your people) that you need to fix. You need more grit.” DeBoer doubles down on these arguments in his final paragraph, where he writes, “Unlike their rich peers, students who labor under racial and economic disadvantage have very few ways to distinguish themselves from the rest of the pack. A stellar SAT score is potentially one of the most powerful. We should take care not to rob them of that tool in a misguided push for equality.” Here deBoer not only embraces the elitist sorting built into the SAT, he endorses a system of educational testing built upon capitalist, individual competition.", "url": "https://www.jacobinmag.com/2018/04/against-the-sat-testing-meritocracy-race-class"}