{"authors": ["Ayana Jones Tribune Staff Writer"], "date_download": "2020-05-04 20:15:58", "date_modify": "2020-05-04 20:15:58", "date_publish": "2018-03-20 04:00:00", "description": "AJ Moore thrives on helping community members in need of assistance. Moore is the executive director of the Philadelphia Neighborhood Housing Services (PNHS) Inc., a community development...", "filename": "_30e598b44c7242908fc5677276144577_1588623358.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_30e598b44c7242908fc5677276144577_1588623358.html", "title": "Nonprofit executive focuses on serving the community", "title_page": "Nonprofit executive focuses on serving the community", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "AJ Moore thrives on helping community members in need of assistance.\nMoore is the executive director of the Philadelphia Neighborhood Housing Services (PNHS) Inc., a community development financial institution. The nonprofit organization focuses on quality affordable housing and neighborhood revitalization in low-income communities.\nMoore leads a 40-year old organization that provides a range of services including housing counseling for prospective homebuyers, vacant property rehabilitation loans and mortgages and landlord education classes.\nThe mother of two is also the founder of Financialcation, a program that provides financial literacy and life skills education and president of AJ Moore Consulting Corporation, an accounting and business consulting firm. However, she spends most of her time focusing on running PNHS.\nMoore uses her harrowing life experiences to relate to her clients and their respective challenges when they visit the West Philadelphia-based organization. She dealt with the trauma of being raped at the age of 14 and faced drug addiction and homelessness.\nWhen she decided to take the helm of PNHS in 2017, Moore knew she was ideally suited to help others.\n“I knew what brought me down and what brought me up, so I use that knowledge to help everybody that walks through the door,” said Moore, who grew up in West Philadelphia.\n“People don’t tell you everything, when they come looking for help. They think you’re a director, you can’t possibly know what their life is like. I always shed that light that I understand and that this is what we need to do. So we’re not going to give you another handout – what we are going to do is help transform you and transform your thinking.”\n“Not everyone can be helped, but some people just need someone like I did — some kind of motivation, some spark and I try to spark everyone who comes through that door – whether it takes and it lights — that’s still up to the person,” she said.\nCouncilman Derek Green will be hosting the organization’s first open house on March 21 at 2 p.m. at 5234 Chestnut St. The focus of the event will be on stable housing, an issue that is being highlighted at a time when many face housing insecurity, as Philadelphia has a poverty rate of nearly 26 percent.\nAs someone who faced homelessness, Moore appreciates the value of stable housing.\n“It gave me the leverage I needed to stabilize my business, to stabilize my child — to go back to school,” she added.\n“Without stable housing I could not have had the mindset to focus on things. That foundation is important whether its rental housing or your own home, you need to be comfortable to sit down and not worry.”", "url": "https://apnews.com/30e598b44c7242908fc5677276144577"}