{"authors": ["Sentinel"], "date_download": "2020-05-04 20:06:25", "date_modify": "2020-05-04 20:06:25", "date_publish": "2018-10-07 10:33:36", "description": "By Amanda Burke aburke@sentineland enterprise.com FITCHBURG -- Mayor Stephen DiNatale said he will appoint \"a representative group\" to fill three slots on the six-member boards tasked...", "filename": "_9edf6c71a7d942f99c6cb70be2066326_1588622785.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9edf6c71a7d942f99c6cb70be2066326_1588622785.html", "title": "Boards Will Be Diverse", "title_page": "Boards Will Be Diverse", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Amanda Burke\naburke@sentineland enterprise.com\nFITCHBURG -- Mayor Stephen DiNatale said he will appoint “a representative group” to fill three slots on the six-member boards tasked with determining how voluntary donations cannabis companies agreed to give local charities will be spent.\nFitchburg\n“You want the board to represent the community,” DiNatale said. “Almost one-fourth of our population is Hispanic; hopefully we have a representative from the African-American community also.”\nIn Fitchburg, at least eight cannabis companies have entered into “host community agreements” with the city, which are negotiated contracts that stipulate payments businesses must make in order to compensate the city for any costs associated with having the businesses operate operate here.\nThe Cannabis Control Commission requires companies enter into these agreements before considering its license application. Companies that have applied to locate here have agreed to donate up to $75,000 to local charities in addition to paying the city “impact fees” of up to three percent of gross sales.\nAccording to the host-community agreements, three representatives from the cannabis company and three mayoral appointees will sit on the community-relations boards.\nDiNatale said this week he has not yet made the three appointments, but he does plans to appoint at least one person from the city’s Hispanic community and person from the African-American community.\nThe commitment came after the mayor, his chief of staff A.J. Tourigny and Fitchburg Democratic state Rep. Stephan Hay met with Adrian Ford, chief executive of the Three Pyramids and co-founder of the North Central Massachusetts Minority Commission, last month.\nIn a subsequent interview, Ford said it is important the mayor’s community relations board appointees mirror the city’s population.\n“We’re looking for a person of color or a woman who’s going to represent the community,” he said.\nThe donations should be pledged to organizations and programs that work to mitigate the disproportionate harms done communities of color by the criminalization of marijuana, said Ford.\nHe noted that Fitchburg is one of 26 cities and towns across the commonwealth that the CCC has designated an area of “disproportionate impact” -- communities that have been “disproportionately harmed” by the criminalization of marijuana.\nAccording to a 2016 study from the American Civil Liberties Union, the arrest rate of black people for marijuana possession was 3.3 times higher than the rate for white people, despite how black and white people consume the substance at similar rates.\nWhile the designation does not require those 29 cities and towns to pledge funds reaped from the cannabis industry to any particular initiatives, Ford said these donations should be spent in the “spirit” of the social equity program rolled out by the commission.\n“This is a major new source of revenue, so the issue is how is that new revenue going to be spent, and is it going to be spent in the good faith and context of the intention of trying to address the harm that’s been had on, particularly communities of color,” he said.\nFord said groups such as the Minority Coalition are pushing to promote woman and minority entrepreneurship in the cannabis industry, but must first fight for inclusion on the community relations boards.\n“I’m just talking about some basic things when I say we want to be included in the policy decision-making process,” he said.\nThe community relations board will eventually decide how the donations are spent by a majority vote of the six-member body. DiNatale said it is “likely” that he will have tie-breaking vote.\nOnce the boards are assembled, Ford hopes the donations are given to various programs, including those that work to counteract the school-to-prison pipeline and keep children in school.\nAccording to Ford, people of color are vastly underrepresented on city boards and committees.\n“It’s nice that you set (community relations boards) up, but if you set that up just like any other (city) board, to funnel municipal revenues through, that’s not going to work for us, we don’t even sit on your boards in your city, we’re fighting to sit on boards and commissions,” he said.", "url": "https://apnews.com/9edf6c71a7d942f99c6cb70be2066326"}