{"authors": ["Dave Gong"], "date_download": "2020-05-04 20:26:40", "date_modify": "2020-05-04 20:26:40", "date_publish": "2018-05-12 05:00:01", "description": "Two rezoning petitions for a planned development along Schwartz Road failed Friday as the Allen County commissioners denied one request and failed to vote on another.  The rezoning petitions...", "filename": "_65f6f11e881041dfa475042d2a370843_1588624000.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_65f6f11e881041dfa475042d2a370843_1588624000.html", "title": "Schwartz Road rezoning rejected", "title_page": "Schwartz Road rezoning rejected", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Two rezoning petitions for a planned development along Schwartz Road failed Friday as the Allen County commissioners denied one request and failed to vote on another.\nThe rezoning petitions up for consideration Friday would have changed more than 40 acres of farmland on Schwartz road from an agricultural designation to single-family and multiple-family residential zoning. Plans for the development called or 89 single-family homes, as well as a 65-lot duplex development.\nA motion to approve the rezoning for the single-family development failed for lack of a second. The other rezoning for the duplexes failed in a 2-1 vote. Commissioner Nelson Peters was the sole vote in favor of that petition. Commissioners Linda Bloom and Therese Brown voted against it.\n“We’re so happy the commissioners did their due diligence and they saw and heard the voice of the community,” said Janese Latimer-Pierson, who lives near the proposed development. “It’s been a long journey, but we’re so grateful.”\nThe Allen County Plan Commission approved both rezoning petitions last month, despite intense opposition from nearby residents who contended the development didn’t fit with the surrounding homes, which are mostly larger executive-style houses and Amish farms.\nAlthough the rezoning for the single-family development did not receive a vote Friday, if no action is taken within 90 days, the Plan Commission’s prior approval would stand. Speaking with reporters following the meeting, Brown said she believes residents were more concerned over the duplex development than they were with the single-family-home proposal.\nBrown said the area should expect growth regardless of Friday’s decision, but the Schwartz Road project was not appropriate for the rezoning requested.\n“The potential is high, clearly, that development is going to be pushing outside the bounds of I-469,” Brown said.\nPeters said he struggled with his decision to support the proposal because many of the residents with concerns are his neighbors. But Peters said the proposals up for consideration Friday were similar to others he’d supported in the past. He said it was probably one of the most difficult rezoning votes he’s ever taken.\n“I definitely struggled, but at the end of the day, I had to stay true to myself,” Peters said.\ndgong@jg.net", "url": "https://apnews.com/65f6f11e881041dfa475042d2a370843"}