{"authors": ["Ryan Cooper", "Peter Gowan", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Tanner Howard", "Jennifer Baum", "David Madden", "Peter Marcuse"], "date_download": "2020-05-04 19:49:45", "date_modify": "2020-05-04 19:49:45", "date_publish": "2018-04-05 00:00:00", "description": null, "filename": "2018_04_affordable-housing-crisis-peoples-policy-project_1588621785.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/04/05120131/Vienna.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_04_affordable-housing-crisis-peoples-policy-project_1588621785.html", "title": "The Solution Is Social Housing", "title_page": "The Solution Is Social Housing", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The following essay is adapted from “ Social Housing in the United States ,” a report out today from our friends at the People’s Policy Project .\nMany American cities face a severe shortage of affordable housing — and not just for the poor, but well up into the upper-middle class. A recent report from Harvard’s Joint Center for Housing Studies concluded: “The rental market thus appears to be settling into a new normal where nearly half of renter households are cost burdened,” or paying more than 30 percent of their income in rent.\nWhat these cities need is a dramatic increase in the number of mid-range and affordable dwellings to ease the price pressure on their rental markets. They should address the problem directly: by constructing a large number of government-owned municipal housing developments. Unlike traditional American public housing, all city residents will be eligible to live there.\nThere are two major benefits to this approach. First, it adds new rental capacity in the housing market directly where it is needed. By greatly expanding the supply of mid-range and affordable units, it will both accommodate more residents and make existing privately owned apartments cheaper. (New developments should never destroy existing functional housing through “slum clearance”; instead the objective should be to expand supply by building on existing city-owned land.)\nPrivate developers, by contrast, have recently built almost exclusively high-end apartments. In 2016, 40 percent of new construction consisted of units costing $1,500 per month and up, while a further 25 percent consisted of $1,100 to $1,499 units. Free-market economists sometimes argue that new buildings will eventually “filter” down to lower market segments as they age, but not only is that an unreliable procedure (many very old buildings remain expensive), it will take decades to happen. By adding new supply where it is most socially needed — instead of where it is most profitable — cities can attack their housing affordability problems directly.\nSecond, by allowing people of all incomes to apply to live in these new developments, local governments will be able to charge higher rents to higher-income residents, and thus capture a great deal of capital income. Instead of being a large budgetary burden on cities and the federal government, they could be mostly self-sustaining. (Indeed, in very expensive cities they could become a significant revenue source.) Poorer residents could be subsidized to some extent by the “solidarity rents” of the middle-class residents — who would still be paying less than they do now. Ultimately, this will enable the creation of many more deeply affordable units than a strictly means-tested approach would allow.\nIn addition, income diversity by definition prevents the concentration of poverty, which is associated with all manner of severe social ills. It will likely also improve management of the units, as non-poor people have a greater political voice and can better demand effective administration.\nThis is not a remotely innovative approach to housing policy. On the contrary, European cities and countries have been following this general scheme for decades. In Finland, nearly three-quarters of residents are eligible for publicly financed social housing, and the housing authority has had marked success in ratcheting down homelessness. In Vienna, fully three in five residents live in municipal and cooperative social housing.\nSo how many units should be built? Sweden, which undertook perhaps the most aggressive public housing plan of any country relative to its size, provides one high-water mark. The Swedish government set a goal of building 1 million new units in the mid-1960s when the population was only 8 million (or about the same size as New York City). Despite a few setbacks and problems, this goal was achieved in less than a decade — indeed, it was so successful that Sweden had an oversupply of affordable housing for decades afterward.\nWe suggest that 10 million new municipal housing units would be a viable ten-year goal. That is well short of a scaled-up version of the Swedish program, but still quite aggressive. We do not anticipate a US affordable housing oversupply being a significant risk in the medium term.\nHow would it work? Municipalities would borrow money, use the money to build housing, and then rent out the resulting units. The money could be borrowed from municipal bond markets or from the federal government at the Treasury rate. Additional funds could be secured through capital grants from the federal government that mirror the outlays of the Low-Income Housing Tax Credit (LIHTC) program. The housing would mostly be built by construction companies, just as public buildings like libraries already are. The management of the building could be done in-house or through contracts with building management companies. Rents would be set high enough to at least cover costs, with some units rented at higher amounts than others based on income. Empty government-owned land should be used first, followed by redevelopment of blighted or abandoned buildings.\nOur paper argues that prior public housing policies have promoted displacement and segregation. Therefore, governments must combat housing discrimination and avoid displacing tenants in existing public housing communities. Unlike previous “mixed-income” strategies like HOPE VI, we support a massive expansion of the publicly owned housing stock for all income groups, not evicting poor people to make way for middle-class people.\nFederal support will probably be necessary to get large-scale developments off the ground in some cities. But cities with pressing housing needs like New York — which spends $1.4 billion out of local funds per year on tax subsidies for private affordable development — could start building this “public housing option” on their own.\nIn the age of neoliberalism, far too much time and money has been spent on trying to coax private markets into accomplishing policy objectives. In housing provision as with health insurance, direct state action can get the job done better, faster, and cheaper.", "url": "https://jacobinmag.com/2018/04/affordable-housing-crisis-peoples-policy-project"}