{"authors": ["Jon O'Connell", "Staff Writer"], "date_download": "2020-05-04 20:06:59", "date_modify": "2020-05-04 20:06:59", "date_publish": "2018-01-28 00:00:00", "description": "It’s easier for Chris Hacken to give his high-speed internet customers unfettered access. In fact, he says, the Federal Communication Commission’s recent decision to roll back open internet...", "filename": "_c1515497fb44449f9608ea0ec410702e_1588622819.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c1515497fb44449f9608ea0ec410702e_1588622819.html", "title": "Providers Say Service Won’t Change After Net Neutrality Rules Lifted", "title_page": "Providers Say Service Won’t Change After Net Neutrality Rules Lifted", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s easier for Chris Hacken to give his high-speed internet customers unfettered access.\nIn fact, he says, the Federal Communication Commission’s recent decision to roll back open internet rules has little bearing on his business at all.\n“It’s more work for us to throttle people. It’s a lot easier for us to just open up everything,” said the founder of NEPA Fiber, a small Wilkes-Barre-based broadband provider. As head of a young company, he’s mostly concerned with growing his client base.\n“We’re not going to change anything that we’ve done. Going forward it doesn’t really affect us,” he said.\nThe FCC’s December vote reversed the 2015 Obama era order establishing guidelines for an open internet, or net neutrality rules.\nAs part of the decision, the FCC reclassified the internet as an “information service” under communications law instead of a Title II utility with the same restrictions as, for example, telephone and electricity utilities.\nNet neutrality advocates say the absence of rules creates a Wild West environment among powerful ISPs who sell a service that’s become essential to daily life.\nBut increasingly, the lines are blurred between companies that create content and those that deliver it. Neutrality advocates say ISPs have a great incentive to prioritize content made by their affiliates.\nOne example: Comcast, which acquired television network NBC in 2009, could deliver the network’s online content faster to customers and throttle competitors.\nNet neutrality opponents say heavy restrictions limit innovation and investment.\nLike Hacken at NEPA Fiber, even the largest internet service providers, or ISPs, say customers won’t see their service affected because of the rule change.\nComcast will not “block, throttle, or discriminate against lawful content on the Internet; we will be fully transparent with respect to our practices; and we have not entered into any paid prioritization arrangements, and we have no plans to do so,” David Cohen, senior executive vice president at Comcast, wrote in a blog post the day the FCC rescinded the rules.\nOn Jan. 16, as the rollback went into effect, 22 attorneys general from around the country, including Pennsylvania Attorney General Josh Shapiro, sued the FCC to block it.\n“The FCC’s action undermines free speech and is bad for consumers and business — especially startups and small businesses,” he said in a statement.\nThe idea that service providers would divide up the internet, similar to what cable companies do with TV channel packages, seems preposterous to Hacken.\nThe notion made its rounds on social media websites, but limited plans that deliver only, for example, social media, shopping or news websites would never fly with consumers, he said.\n“I don’t think that’s very likely at all to happen. There would be ridiculous outrage,” he said.\nLike Cohen, major ISPs came out strong in their commitment to maintain a free-flowing information highway, despite the absence of guide rails.\n“Let us be clear: The internet was free and open before the FCC imposed more onerous, one-size-fits-all rules in 2015, and it will be free and open when we return to a lighter-touch regulatory framework,” said Chuck Hogg, chairman of the Wireless Internet Service Provider Association, in a statement following the FCC’s Dec. 14 vote.\nHe pledged that the organization’s members do not accept payments to prioritize content, nor do they block or throttle internet traffic.\n“That’s great that that’s what they’re saying now, but they’re not bound to that,” said Frank Suraci, co-founder of Bedrock Technology in Jessup, an information technology and business solutions company. He went on to say the executives making promises today won’t be in power forever.\n“What happens when the people in those seats change?” he said. “I think you’re just putting a lot of trust in people that are, at the end of the day, trying to make a profit.”\nContact the writer: joconnell@timesshamrock.com; 570-348-9131; @jon_oc on Twitter", "url": "https://apnews.com/c1515497fb44449f9608ea0ec410702e"}