{"authors": ["Terry Blain"], "date_download": "2020-05-04 20:10:44", "date_modify": "2020-05-04 20:10:44", "date_publish": "2018-11-28 11:50:20", "description": "Sometimes sparks fly in a new relationship. Take, for example, the St. Paul Chamber Orchestras March 2017 concerts with keyboard player and conductor Richard Egarr, its first ever with the...", "filename": "_39c8462c7d804a89b60c703e713b1679_1588623044.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_39c8462c7d804a89b60c703e713b1679_1588623044.html", "title": "Meet the SPCO's newest artistic partner, a baroque expert who embraces music from every era", "title_page": "Meet the SPCO's newest artistic partner, a baroque expert who embraces music from every era", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sometimes sparks fly in a new relationship.\nTake, for example, the St. Paul Chamber Orchestras March 2017 concerts with keyboard player and conductor Richard Egarr, its first ever with the British baroque specialist. Richard made one of the most exciting SPCO debuts in recent memory, said SPCO Artistic Director Kyu-Young Kim. He led a revelatory performance of a Mozart concerto on pianoforte, and a Haydn symphony that made the orchestra want to jump out of our seats.\nThe SPCO wanted more from this galvanizing musician. This week the orchestra named Egarr its newest artistic partner, beginning with the 2019-20 season.\nThe SPCO currently has a team of five artistic partners, musicians specially chosen for their charisma and expertise in key areas of the classical repertoire. They include baroque specialist Jonathan Cohen, pianist Jeremy Denk, clarinetist Martin Frst, Grammy-winning violinist Patricia Kopatchinskaja and the iconoclastic violinist Pekka Kuusisto.\nEgarr lends even more experience to this crew, especially in music of the baroque period. He currently serves as music director of the Academy of Ancient Music, one of Englands leading period instrument orchestras. Here in America, he has worked with the Handel and Haydn Society (Boston), Philharmonia Baroque (San Francisco) and the Philadelphia Orchestra.\nEgarr is back in the Twin Cities this week for an SPCO program featuring music by English baroque composers. Reached by phone in Holland, Egarr spoke about his new post and his fascination with a certain Minnesota superstar. The conversation has been lightly edited.\nQ: You are often described as an early music expert, specializing in composers like Bach and Handel. Is that accurate?\nA: Ive always been irritated by it. Ever since I started playing early music at Cambridge University, I was always interested in other music, too. Ive never stopped playing and conducting later music, including contemporary pieces. But people do like to pigeonhole you.\nQ: Why is that?\nA: Well, it doesnt seem to be fashionable to allow someone in more than one field. That seems ridiculous to me. My great conducting heroes are Leonard Bernstein and Leopold Stokowski, and they were both multisided. Particularly Bernstein he could pretty much do anything.\nQ: So how do you approach the music you perform, regardless of its period?\nA: I do pretty much the same with all types of music. I go into the background of when it was written, what was going on at the time, what kind of instruments were being used, and what are the performance practice issues. Three years ago at the Edinburgh Festival I conducted Gilbert and Sullivans HMS Pinafore. I prepared in the same way I would a piece of unknown 17th-century music.\nQ: Can we expect an HMS Pinafore with the SPCO?\nA: Id love to do it! Sullivan was a really great composer. For me, good music is good music, whether thats Castello, Monteverdi or Mozart. But doing Pinafore in Minnesota? Id have to talk to the SPCO about that.\nQ: Speaking of English composers, three are featured in your program with the SCPO this week: Henry Purcell, Matthew Locke and Charles Avison. Do you think the English baroque period is underrated?\nA: I think its underrepresented. I suspect a lot of people havent heard of Matthew Locke. And maybe not of Avison, though he was just as famous as Handel in his time. And Locke is twice as kinky as Purcell full of saucy harmonies, very individual. This music is full of a very particular English kind of wit. And its really skillful. People should get to know it.\nQ: Youve performed with the SPCO a couple of times already. What are your impressions of the orchestra?\nA: When you go to a new orchestra you get a pretty fast idea of whether theres an immediate rapport or not. And I just think this is a great bunch of musicians who are searching for the new in whichever music theyre playing. I love the challenging programming the SPCO does, mixing works and periods. Theyre hugely intelligent, flexible and passionate players. And thats absolutely the kind I love working with.\nQ: Are there particular pieces that you want to do as an SPCO artistic partner?\nA: I will probably be doing some baroque warhorses like Bachs Brandenburg Concertos and Handels Messiah. I would also love to do some Corelli. But the programs wont be confined to baroque repertoire. One theme I would like to develop is minimalist music through the centuries. Minimalism did not start in the 20th century by any means. You can trace it back to 12th-century music by Protin. There are wonderful programs to be looked at there.\nQ: You are both a conductor and a keyboard player. How do you decide which works need a conductor and which dont?\nA: There is no baroque orchestral repertoire that needs conducting. Its just deeply inappropriate, because its basically collaborative chamber music. I get really pissed off at people who conduct Bachs Brandenburg Concertos. It is just nonsense, and they probably do it because they cant play anything themselves. Things start to change with Beethoven symphonies, and you begin needing a conductor to hold it all together.\nQ: You have a reputation for doing a lot of talking with audiences at your concerts. Will you be doing that at the SPCO?\nA: Absolutely. I think its essential. Especially in repertoire like Matthew Locke, which is pretty out there music. Audiences need that barrier-breaking, where you give them a bit of information. It gives them an in to the music.\nQ: Have you seen much of the Twin Cities on your visits so far?\nA: A little bit. What Im desperate to do this time is get out to Paisley Park. Im a huge Prince fan. I was lucky enough to see him the last time he came to Amsterdam, and it was a mind-boggling concert. Hes one of the greatest musicians Ive ever seen.\nTerry Blain is a freelance classical music critic for the Star Tribune. Reach him at artsblain@gmail.com.", "url": "https://apnews.com/39c8462c7d804a89b60c703e713b1679"}