{"authors": ["Randy Petersen"], "date_download": "2020-05-04 20:27:53", "date_modify": "2020-05-04 20:27:53", "date_publish": "2018-10-30 08:30:00", "description": "A consultant working to update portions of Rochester’s Land Development Manual says the city needs to consider ending routine hearings on development if it wants to increase housing density...", "filename": "_5958fc5ea8ca4a25879edcb9f70cf720_1588624073.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5958fc5ea8ca4a25879edcb9f70cf720_1588624073.html", "title": "Zoning proposal seeks to add density near downtown", "title_page": "Zoning proposal seeks to add density near downtown", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A consultant working to update portions of Rochester’s Land Development Manual says the city needs to consider ending routine hearings on development if it wants to increase housing density surrounding downtown.\n“If you really want this to happen, then in addition to the physical types of housing you allow, you try to allow more of it to happen without having a debate on each individual property,” said Don Elliot, a director with Denver-based Clarion Associates.\nTo bypass the need for some hearings, Elliot is suggesting a hybrid residential zone be created to allow different types of housing with more density in areas deemed walkable from downtown. He said it would give developers improved direction and set guidelines that could be followed without seeking special permission.\nHe presented the proposal Monday to the Rochester City Council.\nIn addition to allowing smaller lot sizes for single-family homes, the proposal would allow three-story multifamily housing complexes in areas where only two stories currently are allowed. Elliot said the proposal seeks a gradual change under the city’s new comprehensive plan , which seeks to add housing in areas surrounding the city’s core.\n“That’s one more floor than you get today,” he said. “I don’t know how to be more reasonable than that.”\nCouncil Member Mark Hickey raised concerns about housing in the neighborhood north of downtown and west of Silver Lake, noting the proposal seemed to add incentives for tearing down existing single-family homes and building new housing.\n“It sounds good philosophically to say we want to encourage density, but if you tell people they can put up three-story apartment buildings — right now, we have naturally occurring affordable housing there — they are just going to go in and wipe out all those single-family homes and put up apartment buildings because we are creating financial incentives,” he said.\nCouncil Member Nick Campion said that’s not the goal.\n“The goal isn’t to tear down any naturally occurring affordable housing, but we’ve identified these areas as areas where having additional people live is beneficial to our community,” he said. “It’s about balancing all the different needs we have; it’s not about overrunning the neighborhood.”\nOther council members noted residents in neighborhoods around the downtown core are nervous.\nElliot said that’s expected.\n“Near downtown and in residential neighborhoods, it’s a balancing act between what’s a big enough change to make a difference and what is too big of a change and it scares the neighborhood to the point to where people are not comfortable with this being a reasonable evolution of the city,” he said.\nAs a result, he said it’s impossible to discuss changes without also talking about how nearby residential neighborhoods will be protected.\nElliot said none of the proposed changes are set in stone, or even ready for a review by the city’s Planning and Zoning Commission. Rather, they are being presented to spark conversations and perhaps generate alternatives.\nThe goal, he said, is to work toward setting policy and expectations, not to avoid hearings and debates in the future.\nElliot and staff from the Rochester-Olmsted Planning Department met with developers and others Monday and plan to present proposed zoning changes at 5:30 p.m. tonight during the RNeighbors Council of Neighborhoods meeting at 125 Live.\nIn addition to a zoning change for select residential neighborhoods outside the downtown, a new Transit-Oriented Development District is being proposed with the hope of spurring growth along proposed transit routes.\nThe proposals also will be available for review at an open house from 5:30 p.m. to 7:30 p.m. Nov. 8 at 125 Live.\nElliot said input from the upcoming discussions will be used to tweak plans to best fit Rochester.\nAssistant City Administrator Aaron Parrish said he expects more open house events to be held to discuss proposed changes before the Planning and Zoning Commission holds a public hearing on the topic.", "url": "https://apnews.com/5958fc5ea8ca4a25879edcb9f70cf720"}