{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:09:24", "date_modify": "2020-05-04 20:09:24", "date_publish": "2018-12-18 12:48:22", "description": "( NewsUSA ) - In the U.S. alone, there are 10 million car accidents every year, and the tense moments following a car accident, even a minor one, can be scary and stressful for everyone...", "filename": "_c3674259b26f478c9a6dbb83e010cd68_1588622964.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c3674259b26f478c9a6dbb83e010cd68_1588622964.html", "title": "Don't Make These Mistakes after A Collision", "title_page": "Don't Make These Mistakes after A Collision", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "( NewsUSA ) - In the U.S. alone, there are 10 million car accidents every year, and the tense moments following a car accident, even a minor one, can be scary and stressful for everyone involved.\nDrivers and passengers can feel confused and unsure of what to do. Even the most experienced and seasoned drivers can make basic mistakes after they have been involved in a traumatic event.\nSimple, avoidable mistakes could cost you time and money, or lead to personal, medical and legal issues.\nHere are some of the most common mistakes to avoid after a collision:\n* Fleeing the scene: Leaving the scene of an accident could land you in serious legal trouble. You may be in shock, but the most important thing to do is stay where you are.\nCheck on your passengers, and once you exit your vehicle, check with the other driver involved in the accident.\nTry to remain calm and wait for law enforcement to arrive on the scene. If it is safe to do so, use your cell phone to take photos of your vehicle to document the damage that resulted from the accident while you wait for police.\n* Not reporting the accident:\nEven if it’s just a minor collision, always report the accident to the police. Never let someone convince you to avoid calling the police.\nIf you decide to make a claim with your insurance company later on, or if you decide to pursue a legal claim, not reporting the accident could hurt your case.\n* Exchanging too much information: Do not share your driver’s license or who was at fault with the other driver; however, share this information with the police along with your current insurance.\nAlways exchange contact information with the other driver, get contact info from any witnesses, and obtain full insurance details from other drivers involved in the accident.\nMake sure accurate information is included in the police report, and ask for a copy of the report to edit any incorrect information.\n* Failing to get medical advice: You may think that you were lucky enough to escape injury, but you should always get a medical checkup after a car accident, especially if you hit your head.\nRemember, only a medical professional can rule out possible head trauma and other serious injuries.\n* Having your vehicle repaired at just any shop: You might have to make a decision on-the-spot as to where to have your vehicle repaired. Don’t make a panicked decision when it comes to your safety.\nVisit www.goldclass.com to find a Gold Class shop that has collision repair professionals with up-to-date training contributing to complete, safe and quality repairs.", "url": "https://apnews.com/c3674259b26f478c9a6dbb83e010cd68"}