{"authors": ["Bill Beckner Jr."], "date_download": "2020-05-04 20:24:36", "date_modify": "2020-05-04 20:24:36", "date_publish": "2018-01-18 11:13:41", "description": "Penn-Trafford girls basketball coaches and players have to shake their heads and wonder, \"What did we do to deserve this?\" The team has been decimated by injuries this season. Three...", "filename": "_b5aba0d9b4b140b3b5a3340ebd3c740d_1588623876.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b5aba0d9b4b140b3b5a3340ebd3c740d_1588623876.html", "title": "Injuries force Penn-Trafford girls to adjust to adversity", "title_page": "Injuries force Penn-Trafford girls to adjust to adversity", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Penn-Trafford girls basketball coaches and players have to shake their heads and wonder, “What did we do to deserve this?”\nThe team has been decimated by injuries this season.\nThree starters have been sidelined with long-term ailments, disrupting the chemistry of a team that was just merging into the section race.\n“Every time we got momentum, there was another setback,” sophomore guard Bella Long said.\nHands, wrists, knees and even noses have not been immune. The hits kept coming last week with the loss of star point guard Mackenzie Aunkst to a torn ACL, the most crushing blow yet and a season-changer.\nThe backcourt is in disarray.\n“Injuries are part of the game, and nobody is going to feel sorry for us,” Warriors coach John Giannikas said. “That’s sports. It can be humbling. It’s just really tough because we were just getting into a groove.”\nBut the season isn’t over yet. The team’s plans have not been totally foiled.\nPenn-Trafford is 6-7 overall and 2-3 in Section 2-6A, still in the thick of the WPIAL playoff chase. The Warriors are seeking a 10th consecutive trip to the postseason, but it obviously will take a little extra.\nSenior guard Rachel Casper was lost to a broken hand four games in. Junior guard Raeghan Panza hurt her wrist in the sixth game. Junior forward Stephanie O’Donnell broke her nose in the fourth game against Franklin Regional, but despite missing the next game, returned to play while wearing a protective mask.\nAunkst’s knee injury came against Fox Chapel, just after the Warriors picked up wins over McKeesport (53-43) and Penn Hills (51-36). The Warriors still beat Fox Chapel, 39-36, but have dropped two in a row since Aunkst went down.\nStill, they are tied for third in the section with Penn Hills, another team rattled by injuries to key players. Starters Diamond-Jay Whittington and Tayonna Robertson are out with knee injuries.\nThe top four teams make the playoffs.\n“We have other girls who need to step up,” Giannikas said. “It might be a baptism by fire for some of them. We have to find new rotations and find that continuity again. That’s my job: to fill the spots to help us be successful.”\nAunkst is one of those top-flight athletes — she is headed to West Virginia on a soccer scholarship — who can’t be replaced.\nIf the playbook had a “break glass in case of emergency” label on it, Giannikas probably would have taken a hammer to it as soon as Aunkst left the floor.\n“You don’t replace her with one kid,” Giannikas said. “Her scoring, her quickness, her passing is tremendous. We may not see another player like that here.”\nGiannikas said sophomore Sarah Nguyen and freshman Mackenzie Powell have filled in at the point. Freshman Allie Prady and senior Morgan Llewellyn have seen increased roles.\n“We’re adjusting to things,” Giannikas said. “We’re adapting the system to fit them.”\nPenn-Trafford only had eight turnovers against a strong Altoona team that has wins over Chartiers Valley, Latrobe and Norwin.\nLong has seen an increased scoring role. Already a talented shooter, she has scored in double figures in three straight games.\n“I started out playing forward but have been in more of a guard position now,” Long said. “That changed my whole game. I am scoring from outside-in, instead of inside-out.”\nO’Donnell said her doctor gave her the choice whether to play with the broken nose, or to sit out.\nShe said the decision was simple.\n“It was just a bump in the road,” said the 6-foot-1 forward. “It could have been worse. I knew I had to keep playing for my teammates. We play for each other. We’re keeping our heads up despite everything.”\nO’Donnell said the team remains upbeat despite the setbacks and lineup changes.\nThe focus has shifted to who is there rather than who is not.\n“We’re excited to play Norwin,” she said. “We have adrenalin to win. It’s motivation.”\nPenn-Trafford hosts Norwin (6-7, 4-1) on Friday night.\nBill Beckner Jr. is a Tribune-Review staff writer. Reach him at bbeckner@tribweb.com or via Twitter @BillBeckner.", "url": "https://apnews.com/b5aba0d9b4b140b3b5a3340ebd3c740d"}