{"authors": ["Aaron Yost"], "date_download": "2020-05-04 20:31:31", "date_modify": "2020-05-04 20:31:31", "date_publish": "2018-07-03 14:15:00", "description": "Dr. Stewart’s enter the Fourth of July break with a limp rather than a swagger after the Portland Barbers roughed up five Docs pitchers in a 9-2 and 10-1 nonleague American Legion baseball sweep...", "filename": "_f9fe8ecd32fd4b50b0f1048ff5d8dd2c_1588624291.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f9fe8ecd32fd4b50b0f1048ff5d8dd2c_1588624291.html", "title": "Barbers trim Dr. Stewart's, sweep nonleague doubleheader", "title_page": "Barbers trim Dr. Stewart's, sweep nonleague doubleheader", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dr. Stewart’s enter the Fourth of July break with a limp rather than a swagger after the Portland Barbers roughed up five Docs pitchers in a 9-2 and 10-1 nonleague American Legion baseball sweep on Monday at Liberty High School in Hillsboro.\nWith 22 games remaining in the regular season, the Docs are 11-11 overall and 2-2 in Area 4 play. They will be off today and on the Fourth before returning to practice Thursday in preparation for Friday’s Area 4 doubleheader against the Eugene Challengers at Legion Field. The same two teams will meet Saturday at Swede Johnson Stadium in Eugene.\nDoran Gillespie got the Docs started with a big swing in the first game of Monday’s doubleheader, hitting a one-out solo home run in the first inning, but the Barbers’ bats proved to be stronger.\nPortland had 11 hits — including three homers, two by Rowan Ramsay — in the first game. The Barbers scored seven runs through two innings against Dr. Stewart’s starter Jace Stoffal.\nThe Docs got one run back in the third on a bases-loaded single by Luke Lucido, but the frame ended with a lineout and a fielder’s choice. The Docs put four more runners in scoring position the rest of the way, but couldn’t get the run home.\nGillespie also had a double in the contest, but he was the only Docs player with more than one hit in the game.\nIn the second contest, Garrett Russell reached on an error to start the game and scored from second on Lucido’s single, but the Docs managed three more base runners to second base in the game.\nJonathan Stone managed a single in each game, ending a brief slump for the 6-foot-7 first baseman.\nRussell, the Docs’ leadoff man and centerfielder, did not have a hit while scoring two runs in the doubleheader. He had gone 3-for-4 in a 12-7 victory over Corvallis in a wood bat game on Saturday.\nDr. Stewart’s has now lost three of four. That won’t harm its postseason hopes, though, as it’s the first qualifier for the American Legion State Tournament as the host team.\nHaving the Docs ready for the postseason is coach Scott Shaver’s first priority, and they have the opportunity for a measure of revenge against the Barbers when they host Portland on Sunday in a doubleheader.\nFirst Game\nDrStewarts 101 000 0 — 2 9 2\nPortland 250 110 x — 9 11 0\nStoffal, Meisner (6) and Leischner; Blair, Bennett (4) and McNeill. WP — Bennett. LP — Stoffal. 2B — Gillespie (DS), Herzog (P), McNeill (P). 3B — Curran Mitzel (P). HR — Gillespie (DS), Rowan Ramsay 2 (P), McNeill (P).\nHits — DS 9 (Russell 0-3, Gillespie 2-3, Stone 1-3, Lucido 1-4, Mandera 1-4, Co. Johnson 1-3, Leichner 1-3, Ca. Johnson 1-3, J. Black 1-3), Por. 11 (Mitzel 2-3, Ramsay 3-4, Herzog 1-4, Bafaro 0-3, Muskat 1-3, Thompson 0-3, Garcia 0-1, McNeill 3-3, Gordon 1-3, Crippen 0-2, Baccay 0-1). RBIs — DS 2 (Gillespie, Lucido), Por. 6 (Ramsay 4, Herzog, McNeill).\nSecond Game\nDrStewarts 100 000 0 — 1 5 2\nPortland 101 143 x — 10 12 2\nCo. Johnson, Meisner (5), N. Burke (6) and G. Burke; Crippen, Mitzel (6) and Garcia. WP — Crippen. LP — Co. Johnson. 2B — Bafaro (P), Muskat (P), Gordon (P). 3B — Thompson (P), Mitzel (P).\nHits — DS 5 (Russell 0-2, Gillespie 1-2, Stone 1-3, Lucido 1-3, Mandera 0-2, Luther 1-3, Ca. Johnson 0-3, G. Burke 0-3, J. Black 1-3), Por. 12 (Baccay 2-3, Bertrand 0-1, Ramsay 0-3, Thompson 1-2, Crippen 0-0, Bafaro 1-3, Muskat 1-1, Antich 1-2, McNeill 1-2, Herzog 0-2, Hoskins 0-1, Mitzel 1-2, Garcia 2-3, Bennett 0-2, Gordon 2-2). RBIs — DS 1 (Lucido), Por. 9 (Baccay, Bafaro, Muskat, Antich 2, Mitzel, Garcia, Gordon 2).", "url": "https://apnews.com/f9fe8ecd32fd4b50b0f1048ff5d8dd2c"}