{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:21:10", "date_modify": "2020-05-04 20:21:10", "date_publish": "2018-08-31 13:25:39", "description": "Recent letters in The Sun say that the two projects on the Tuesday debt exclusion ballot in Dracut (Questions 1 and 2) are necessary, but then say that voters should oppose them because they may...", "filename": "_61a8ebfcd8d94cd1b4b7e501bca6f5ea_1588623670.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_61a8ebfcd8d94cd1b4b7e501bca6f5ea_1588623670.html", "title": "Fire, School Projects in Dracut Are Modest, Needed", "title_page": "Fire, School Projects in Dracut Are Modest, Needed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Recent letters in The Sun say that the two projects on the Tuesday debt exclusion ballot in Dracut (Questions 1 and 2) are necessary, but then say that voters should oppose them because they may cost something. This makes no sense. If you want these two projects, please vote Yes on Tuesday to ensure that they happen.\nThese projects are extremely modest: the fire station proposal is one-sixth the cost of the 2011 Dracut High project. the projects combined are, at peak, one-ninth of the proposed annual cost of school override which was voted down. Dracut’s median single-family tax bill will remain $300 to $3,000 less than the tax bill of surrounding Merrimack Valley towns (including Tyngsboro, Tewksbury, Chelmsford, North Andover, Billerica) if both questions are passed.\nThe school security project and the fire station project had been sitting as part of the town’s capital plan for almost 10 years. If there was room to put them in the budget it would have been done long ago.\nWith the urgency created by recent school shootings and the potential legal liability that could result from an unsafe fire station, the time to advance these projects is now.\nWhile Dracut may lack the tax revenues enjoyed by neighboring towns that have major highway exits, the town is extremely frugal managing the revenues we do have. Town managers have done an excellent job providing services on a budget $20 to $40 million less than those surrounding towns. We should be grateful that the administration has listened and that we are talking about a potential temporary increase in taxes well under 1 percent. The manager did fund almost $2 million in recent capital projects through economic development (replacing old police/fire vehicles and installing fast internet in the schools), but there is not enough new revenue to fund every capital project this way.\nThe benefits residents will see from these projects include an increase in safety -- having a station big enough to accommodate the town’s ladder trucks within reach of homes near Collinsville, Long Pond, and Lake Mascuppic -- and the peace of mind of knowing that all of the schools our children attend are well secured.\nVote Yes for continued progress in Dracut on Sept. 4.\nRIch Cowan\nDracut", "url": "https://apnews.com/61a8ebfcd8d94cd1b4b7e501bca6f5ea"}