{"authors": ["Rich Cholodofsky"], "date_download": "2020-05-04 20:06:51", "date_modify": "2020-05-04 20:06:51", "date_publish": "2018-04-18 22:55:53", "description": "The trial of a Penn Hills man charged with murder last year in Jeannette will begin in July. Westmoreland County Common Pleas Court Judge Megan Bilik-DeFazio scheduled jury selection in the...", "filename": "_7fcf58742c2a49daaccf69a8a1b60d77_1588622811.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7fcf58742c2a49daaccf69a8a1b60d77_1588622811.html", "title": "Penn Hills man to stand trial in July for Jeannette murder", "title_page": "Penn Hills man to stand trial in July for Jeannette murder", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Penn Hills man to stand trial in July for Jeannette murder\nThe trial of a Penn Hills man charged with murder last year in Jeannette will begin in July.\nWestmoreland County Common Pleas Court Judge Megan Bilik-DeFazio scheduled jury selection in the case against Darrelle Tolbert-McGhee for the criminal trial term that starts July 9.\nTolbert-McGhee, 29, is awaiting trial for the April 13, 2017, shooting death of 32-year-old Michael Wilson, who police said was shot several times in front of the Dollar General store on Clay Avenue.\nAfter a brief hearing Tuesday, the judge ordered attorneys in the case to meet again in June to discuss final trial preparations.\nWilson, of West Mifflin, died from multiple gunshot wounds to his chest, hand, arms, thigh and genitals, detectives said.\nTolbert-McGhee’s lawyer previously suggested that eyewitnesses misidentified Wilson’s killer as his client. Defense attorney Jack Manderino in a December court hearing said the man who fired the fatal shoots could have been Tolbert-McGhee’s twin brother.\nManderino claimed that during a drug bust in Jeannette in December, Dwayne Tolbert-McGhee originally tried to pass himself off to police as his twin brother.\nDuring a preliminary hearing last year, witnesses testified that Wilson and Dwayne Tolbert-McGhee were at odds but did not know the reasons for the dispute.\nProsecutors have said there is surveillance video footage showing Darrelle Tolbert-McGhee shoot Wilson.", "url": "https://apnews.com/7fcf58742c2a49daaccf69a8a1b60d77"}