{"authors": ["Pam Ashley Pashley Havasunews.Com"], "date_download": "2020-05-04 20:11:21", "date_modify": "2020-05-04 20:11:21", "date_publish": "2018-12-05 06:20:00", "description": "Mohave Community College will host a free, hour-long lecture Dec. 13 at its Lake Havasu City campus. The event is in Building 600 at 1977 W. Acoma Blvd. Gregory McNamee will discuss Arizona...", "filename": "_c163e1a4a6e741f4b44469f42f02edd3_1588623081.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c163e1a4a6e741f4b44469f42f02edd3_1588623081.html", "title": "Arizona in the movies: MCC to host lecture on Grand Canyon State’s history on the silver screen", "title_page": "Arizona in the movies: MCC to host lecture on Grand Canyon State’s history on the silver screen", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Arizona in the movies: MCC to host lecture on Grand Canyon State’s history on the silver screen\nMohave Community College will host a free, hour-long lecture Dec. 13 at its Lake Havasu City campus. The event is in Building 600 at 1977 W. Acoma Blvd.\nGregory McNamee will discuss Arizona in the movies plus provide details about film stars Andy Devine, Tyrone Power, Katy Jurado, Steve McQueen and, of course, John Wayne. From the earliest days of film, Arizona has been a setting and subject for hundreds of films.\nSome, like “Junior Bonner” and “Red River,” are considered classics. Others, such as “Billy Jack” and “Evolution,” surely less so. Some may even be classics in the making, from “Tombstone” to “Near Dark.” In his entertaining talk, McNamee, a frequent contributor on film to the Encyclopedia Britannica and former columnist for the Hollywood Reporter, looks at the Grand Canyon State on the silver screen.\nMcNamee is a writer, editor, photographer, and publisher. He is the author of 40 books and of more than 5,000 articles and other publications. He is a research fellow at the Southwest Center of the University of Arizona.", "url": "https://apnews.com/c163e1a4a6e741f4b44469f42f02edd3"}