{"authors": ["Flynn Murray", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Joe Allen", "Micah Uetricht"], "date_download": "2020-05-04 19:59:56", "date_modify": "2020-05-04 19:59:56", "date_publish": "2018-11-02 00:00:00", "description": null, "filename": "2018_11_ups-contract-bargaining-strike-authorization-hoffa_1588622396.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/11/02235404/GettyImages-86182970.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_11_ups-contract-bargaining-strike-authorization-hoffa_1588622396.html", "title": "Local 804 Says No", "title_page": "Local 804 Says No", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nAfter months of contract negotiations between UPS and the International Brotherhood of Teamsters, the union’s chief negotiator announced that the union had reached a preliminary agreement. But as soon as the details of the contract were released, Hoffa and his negotiating team faced scrutiny: the reform caucus Teamsters United (TU) and the longstanding union reform organization Teamsters for a Democratic Union (TDU) were not happy. TDU argued that workers wanted stronger wage increases, more full-time jobs, clear language around managerial harassment, and an end to forced overtime that currently has many employees working up to seventy hours a week during peak season, the period between November and January when UPS experiences the highest shipping volume. Instead, the proposed agreement included a new two-tier wage system for drivers, effectively paying one classification of workers less to perform the same job tasks as their full-time counterparts. The agreement also included a starting wage that falls $2 short of the union’s proposed $15 per hour rate, no clear penalties for managers harassing workers on the job, and language that makes it harder for new workers to join “the 9.5 list,” a classification which protects them from being forced to accept overtime. Once the contract details were released, a number of union locals began using TDU and TU materials to form “vote no” contract campaigns that were aimed at keeping the preliminary contract agreement from being ratified. Nowhere was this campaign more successful than Local 804 in New York, where 95 percent of workers voted down the contract. This vote of no confidence was achieved by rank-and-file UPS workers convincing their coworkers that this contract did not deliver the goods. Prior to the vote results, Local 804’s leadership had largely remained quiet about the preliminary agreement. The success achieved by the “vote no” campaign resulted in the contract committee refusing to accept any of UPS’s proposed concessions during a three-day-long negotiation session over their contract supplement, which covers regional contract issues and additional provisions around pay and benefits. Negotiations over the supplement are still ongoing. But this show of force is a significant step forward for the workers, whose aim is to win better wages and working conditions for the entire membership by rejecting what they consider a concessionary contract.\nThe National Context UPS is the largest unionized private-sector employer in the US; its contract will cover over a quarter of a million workers. For the past few years, it has seen massive growth and record profits. As volume continues to rise, employees are working at a faster pace and for longer hours than ever before. The June strike vote was a show of force, with members voting 93 to 7 percent in favor of authorizing a strike. Yet the union leadership, headed by James Hoffa Jr, was not only reticent to push the company to deliver a strong contract, but willingly offered them concessions, suggesting the addition of a new, lower-paid classification of drivers, known as “hybrid drivers,” as a solution to relieving the amount of overtime that UPS workers are forced to incur. Rather than use the strike vote as leverage to extract concessions from the company, Hoffa actually came up with new concessions to offer the company himself. One such proposal is for hybrid drivers, also known as “22.4s” (named for the section of the contract where the classification would appear). This job classification combines a variety of part-time jobs for the company into one forty-hour position. The flexibility of the classification allows the company to assign these workers to jobs as needed. The downside for the employees is that they would be working a variety of low- and higher-paying jobs for the company, bringing their pay scale down below what the full-time package car drivers make — even if they are doing the same work. Hybrid drivers will work either Tuesday through Saturday or Sunday through Thursday. This allows UPS to expand out a Sunday delivery service without having to pay their full-time drivers overtime for weekend work. Once it became clear that Hoffa was pushing such a concessionary contract, UPS workers around the country began building a “vote no” campaign. A package-car driver from Wisconsin named Tyler Binder became something of an internet sensation by creating a YouTube video that walked members through “Why the UPS 2018 contract sucks.” The video aimed to unite the union membership against the contract down in order to force the union leadership and the company back to the bargaining table. Three days before the deadline, news broke that Amazon would implement a $15 minimum wage including catch-up raises for existing part-time workers starting November 1, meaning that existing Amazon workers would receive additional pay bumps based on how long they had worked for the company. Many Teamsters were incensed: under their proposed agreement, part-time unionized drivers would earn $2 less in starting pay than their nonunionized counterparts at Amazon. The pay gap widens even further for part-time UPS workers with a few years on the job, who were not offered catch-up raises and will also be making $13 an hour under the new contract. Union leaders all but giving away the farm is an all-too-frequent occurrence in contract negotiations, but Hoffa’s lead negotiator Denis Taylor took things a step further at a national grievance panel two days before the end of voting. He reminded members that the union could still implement the contract if less than half of the membership voted and less than two-thirds of those voting voted it down. Even though this rule has been on the books for decades, Taylor’s threat came as a surprise. As TDU points out, “No national contract has ever been ratified after a majority of members Voted No since the revised two-thirds rule went into effect in 1987.” Both of these developments spurred one last “vote no” push by the rank and file, TU, and TDU. By the evening of October 5, the tally was in. A little under half of the membership voted; the “no” vote was 54 percent — a clear majority, but the total number of votes fell short of the two-thirds rule. Despite the union using this rule to ratify the national master agreement, the contract cannot be put into effect until all of the local supplements are ratified. The master agreement provides overarching basic provisions for all of the locals covered by the contract, but the supplements cover both the issues specific to work in each geographic region and in some cases include language around increased pension contributions, managerial harassment, paid sick days, and more that go beyond what is laid out in the national contract. After the vote on October 5, the question became which locals were able to vote the contract down, and would these locals mobilize against Hoffa if he tried to implement the national contract over the objections of a majority of voting UPS members? In the end, ten of the local and regional supplements were voted down, but only five were voted down by a high enough margin to meet the quorum rule. The local with the highest “no” percentage was 804, with 95.34 percent. This is not the first time that Local 804 has been at the forefront of a struggle inside the Teamsters. For decades, it was at the center of national reform efforts aimed at winning power away from union leaders with ties to the mafia and restoring democratic power to the membership.", "url": "https://www.jacobinmag.com/2018/11/ups-contract-bargaining-strike-authorization-hoffa"}