{"authors": ["John Dixson"], "date_download": "2020-05-04 20:26:25", "date_modify": "2020-05-04 20:26:25", "date_publish": "2018-10-27 07:47:00", "description": "Once again, the Blackfoot City Council has elected to proceed with a bond issues to cover the estimated, and I emphasize estimated, costs to repair, remodel, renovate and basically rehabilitate...", "filename": "_68af47ac28c246b8b2f4c503ee6414d5_1588623985.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_68af47ac28c246b8b2f4c503ee6414d5_1588623985.html", "title": "Blackfoot municipal swimming pool issue", "title_page": "Blackfoot municipal swimming pool issue", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Once again, the Blackfoot City Council has elected to proceed with a bond issues to cover the estimated, and I emphasize estimated, costs to repair, remodel, renovate and basically rehabilitate the existing 50-year-old Blackfoot swimming pool facility.\nThe required and necessary work to extend the life of the existing facility for a minimum of approximately 20 more years based on the current estimated cost of $3.9 million is still far beyond what is, by any measure of consideration, unrealistic and without merit, foundation or justification.\nWhat has changed from the previous “estimated” costs to cover the required repairs, remodeling, renovation and upgrading of the existing facility as identified in the engineering and architectural reports that was previously estimated at $5.7 million and was the basis of the previous bond issue amount?\nI previously stated that, based upon my knowledge and experience over the past 50 years as a professional architect — and having been involved in numerous renovation projects — that due to the costs to address the unknown, deteriorating and failing conditions that will be discovered and will require correction, the final costs cannot be accurately determined.\nThat final cost can very easily and will very likely increase the current estimated remodeling, renovation and rehabilitation costs of $3.9 million by 35 percent to 40 percent of the original estimated costs and will still only provide a facility that is estimated to last an additional 20 years.\nThe remodeling, renovating and rehabilitation of the existing Blackfoot swimming pool facility requires the extensive demolition and undoing of virtually every element and system of the existing facility that are failing and to comply with current building codes.\nThe monies required to complete that preparatory work would be more wisely spent building a totally new swimming pool facility.\nThe original reports that were prepared by the various engineering and architectural firms were extensive and very well prepared. I did not interpret or find a recommendation in the reports that the identified and required repairs, remodeling, renovation and upgrading of the facility should be or is the correct approach to resolving the issue.\nThe report simply identified the issues, estimated costs and other options to be considered. It appears, and the question is why, the current estimated costs and bond issue amount is different and in conflict with the original estimated costs and bond issue to remodel, renovate and rehabilitate the existing facility as may be necessary and required?\nIt is still my opinion that the cost to provide a completely new swimming pool facility, based on a properly prepared facility design program that identifies the specific needs, requirements and desires of the city would be a more realistic and correct approach to providing a swimming pool facility for the city.\nThe cost for a totally new facility, as an end result, may not be any more expensive than what the current estimated costs to remodel, renovate and rehabilitate the existing facility will end up being.\nIt is more probable that the costs of a totally new facility would be less than the estimated and resulting final (and unknown) costs of the current proposal to repair, remodel, renovate and rejuvenate the existing facility and would provide a facility that would last for the next 50 years!\nIf the citizens of city of Blackfoot are willing to support the costs, including the yearly operation and maintenance expense to the city, that is associated with having a swimming pool facility, then a properly prepared building program should be developed, a conceptual design completed based on a legitimate and realistic building program, and time and cost estimates specifically and accurately prepared.\nOnce that building program has been completed and is available it should be presented to the citizens of Blackfoot for consideration pursuant to the funding liabilities that are imposed on the taxpayers in order to fund, operate, maintain and complete the project. Additionally, the correct method to fund an appropriate facility would be to create a recreational district that would involve all of Bingham County.\nThe Band-Aid, patch and repair approach to maintain the existing worn out swimming pool facility is simply and plainly incorrect. There is no merit, foundation or justification in the proposal to remodel, renovate and rejuvenate the existing and deteriorating 50-year-old facility.\nJohn Dixson is a retired architect in Blackfoot.", "url": "https://apnews.com/68af47ac28c246b8b2f4c503ee6414d5"}