{"authors": ["Brandpoint", "Bpt"], "date_download": "2020-05-04 20:07:01", "date_modify": "2020-05-04 20:07:01", "date_publish": "2018-11-07 21:30:00", "description": "(BPT) - The perfect fall foods are hearty, nutrient-dense and packed with flavor. And while there is no shortage of savory sustenance this time of year, no other food captures the essence of the...", "filename": "_906785330fab4de0a1664ab16af94cf5_1588622821.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_906785330fab4de0a1664ab16af94cf5_1588622821.html", "title": "Pumpkin: The ultimate fall superfood", "title_page": "Pumpkin: The ultimate fall superfood", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "(BPT) - The perfect fall foods are hearty, nutrient-dense and packed with flavor. And while there is no shortage of savory sustenance this time of year, no other food captures the essence of the season quite like pumpkin. Brimming with nutrients and boasting a rich taste, it’s a nourishing food the whole family enjoys — from picky toddlers to even your dog! Here are five flavorful ways to incorporate pumpkin into your entire family’s meals this season.\nThe perfect pasta\nA go-to dish any time of year, creamy ravioli is especially enticing during the autumn months when comfort food cravings are at an all-time high. For an ultra-rich flavor, farm-fresh pumpkin and browned butter make for the perfect pair. Pumpkin sourced from your local farmers market will ensure an authentic flavor, while also seeing to it that your meal is optimally fresh. Stuffed with grated nutmeg and topped with garden-picked sage leaves, shaved Parmesan cheese and toasted pine nuts, this decadent dish is the ultimate way to wind down on an autumn evening.\nLight bites\nFor a bite on the lighter side, pumpkin and white-bean hummus is a perfect starter snack for any fall get-together. Sweet, smoky and savory, this nutrient-rich appetizer packs a flavorful punch and is loaded with fiber and a host of essential vitamins and minerals. To whip up this delicious dip, combine fresh pumpkin puree with white beans and garlic, and mix in a food processor until smooth. Enjoy with a side of homemade pita chips lightly brushed with olive oil and sea salt. You’ll have a delightful bite that’s tasty and richly nourishing.\nThe dog-friendly dish\nWhile pumpkin is a seasonal staple in homes across the country, this fall superfood is also one of the most family-friendly. With the ACANA Singles Beef & Pumpkin formula, you can nourish your four-legged family member so he can join in on all the fall fun. Made from a hearty 60 percent meat — half of which is fresh — 31 percent protein and no more than 25 percent carbohydrates, ACANA Singles Beef & Pumpkin contains a single protein and is specially formulated to support healthy digestion. Ideal for dogs with food sensitivities, the limited ingredient, nutrient-rich formula is delivered in WholePrey ratios and includes meat, organs and cartilage — just the way your dog would eat in the wild. A tasty solution for dogs who crave both meat and variety, it’s the perfect way to include your furry family member in your autumn meals.\nA cold weather classic\nAn all-time autumn favorite, nothing says fall like a soothing bowl of pumpkin soup. Combine freshly scooped pumpkin with a delicious mix of crème fraîche and locally grown herbs — rosemary, bay leaf and thyme make for savory selections. Festive fall seasonings such as cinnamon and nutmeg add just the right amount of sweetness, and don’t forget to sprinkle in grated garlic and a pinch of cayenne pepper for a bit of a kick. For a protein-packed version, add fresh lobster gently coated in a spicy butter. The natural freshwater flavor of the lobster helps to bring out the richness of the stock and provides the added nutrients to keep you feeling satisfied.\nSweet eats\nIt wouldn’t be fall without a sweet pumpkin treat. While traditional pumpkin pie is almost always a fixture at the autumn dessert table, a delicious variation is a flavorful pumpkin cake, complete with rich caramel and cream cheese frosting. Made from garden-fresh pureed pumpkin and spiced with ginger, cinnamon, nutmeg and cloves, this mouthwatering recipe can be served hot or cold and is the perfect complement to a post-dinner pumpkin-spiced latte. Irresistibly delicious, this is one dish that will take you through the fall season and beyond.", "url": "https://apnews.com/906785330fab4de0a1664ab16af94cf5"}