{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:15:47", "date_modify": "2020-05-04 20:15:47", "date_publish": "2018-03-30 05:00:00", "description": "Gibson, what happened? There’s been talk of bankruptcy swirling around Gibson, the venerated Nashville-based guitar company, which takes in more than $1.2 billion in annual revenue but is...", "filename": "_128895d887e14d26a536668fbe07432b_1588623347.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_128895d887e14d26a536668fbe07432b_1588623347.html", "title": "Is guitar company Gibson headed for Chapter 11?", "title_page": "Is guitar company Gibson headed for Chapter 11?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Gibson, what happened?\nThere’s been talk of bankruptcy swirling around Gibson, the venerated Nashville-based guitar company, which takes in more than $1.2 billion in annual revenue but is more than $500 million in debt. Buzzards are circling. Kohlberg Kravis Roberts, the private equity giant, is a bondholder. Blackstone is also a major lender.\nGibson’s problems are not hard to diagnose. The company’s longtime chief executive, Henry Juszkiewicz, wanted to diversify by turning Gibson into what he has called a “music lifestyle company” — basically a consumer electronics business that sells headphones and hi-fis as well as guitars. He made a splashy purchase of the audio and home entertainment division of Netherlands-based Royal Philips in 2014, and then ran headlong into the collapse of the euro.\nIt was a disaster. Juszkiewicz, in an interview, didn’t sugarcoat it.\n“No, it wasn’t a great decision,” he said. “It didn’t work out very well. I think it was a rational decision, but it turned out to be a very poor decision, and it’s a decision I made. It is what it is.”\nBefore we go further, we need to step back and take stock. Much is at stake.\nChuck Berry’s “Maybellene,” which is now in the Smithsonian, is a Gibson. Tony Iommi of Black Sabbath wields a Gibson SG. Slash, of Guns N’ Roses? The company calls him its global brand ambassador.\nYou once got the feeling that Carlos Santana could take an entire smoke break while he held a single note on one of his Gibsons, in the days before he switched to Paul Reed Smith guitars. Jimmy Page bought a Gibson off Joe Walsh and called his Les Paul “my mistress and my wife.” His double-necked Gibsons looked so heavy they might topple his spindly frame. Hendrix was really more of an upside down Stratocaster guy, but he had a Gibson Flying V, one of the most distinctive guitars ever made. So, of course, did Eddie Van Halen.\nAnd then there is Nigel Tufnel.\nNo veneration of Gibson was greater than the scene in the movie “Spinal Tap” in which Nigel, played by Christopher Guest, took filmmaker Marty DiBergi, played by Rob Reiner, around his voluminous guitar collection.\nNigel, wearing a skintight T-shirt with a life-size drawing of a rib cage, starts the tour by lifting up a 1959 sunburst Gibson Les Paul Standard.\n“This is the top of the heap right here, there’s no question about it,” Nigel says, deadly earnest. He points to the body of the guitar. “Look at the flame on that one. It’s quite unbelievable. This one is just” — he shakes his head — “it’s perfect. Nineteen fifty-nine.”\nI could keep going with “Spinal Tap” dialogue, and I actually tried to before my editor wisely intervened. But I think I’ve made my point. Gibson is more than just a company, it’s a public trust.\nJuszkiewicz was part of an investor group that bought the company in 1986, the last time it was on the verge of bankruptcy. He was a turnaround guy who had been an engineer at General Motors and played guitar in a band at Harvard Business School. (“It was mostly rock ‘n’ roll, we did a lot of parties. Think ‘Animal House.’”)\nHe righted the ship, but in recent years has had a series of struggles. The Justice Department raided the Gibson factories and offices in 2011, accusing it of importing banned woods from India and Madagascar. Juszkiewicz railed against government overreach, became a right-wing darling and got invited to Congress for a speech by President Barack Obama, in an act of defiance. The next year, Gibson agreed to pay a penalty of $300,000 and $50,000 more to promote conservation.\nJuszkiewicz also wanted to make Gibson guitars more techno-whizzy, so they could even tune themselves. Purists were horrified. Neal Schon of Journey once referred to it as “all this electronical, robot crap.”\nJuszkiewicz called it “great technology” and said he believed all guitars will eventually have it. But auto-tuning has been scaled back after, he said, “the trolls took over the dialogue.”\n“My regret is we probably pushed a little too fast,” he added.\nStill, Juszkiewicz sticks to his broader vision for Gibson, which includes lower-priced brands such as Epiphone and Kramer. Nike has been his model. He said he realized that, “like Nike, you couldn’t just sell to track guys, you had to sell to regular consumers.”\nCertainly, one can make an argument to diversify. Guitar sales are still below the peak they reached in the years before the financial crisis, though they have been recovering, according to data from The Music Trades, a magazine.\nGibson’s future will be much clearer by Aug. 1, when much of its debt comes due.\nWhatever happens, Juszkiewicz is 65 and his future with Gibson is winding down. For his long-term vision to succeed, he said, he will eventually “have to pass the baton to someone who also has that dream.”\nHe added, “Part of this is evaluating financing options, and I have to look at what is best for the company, all of the stakeholders and myself.”", "url": "https://apnews.com/128895d887e14d26a536668fbe07432b"}