{"authors": ["James Quintero", "Rachel Freeman"], "date_download": "2020-05-04 20:20:44", "date_modify": "2020-05-04 20:20:44", "date_publish": "2018-03-28 21:33:58", "description": "Even though the historic tax reform took effect only recently, almost 450 businesses nationwide have announced “pay raises, bonuses, utility rate cuts, or 401(k) hikes,” according to a detailed...", "filename": "_d604174b49984349852d14e4313ddf91_1588623644.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d604174b49984349852d14e4313ddf91_1588623644.html", "title": "Federal tax reform is making people’s lives better", "title_page": "Federal tax reform is making people’s lives better", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Even though the historic tax reform took effect only recently, almost 450 businesses nationwide have announced “pay raises, bonuses, utility rate cuts, or 401(k) hikes,” according to a detailed list maintained by Americans for Tax Reform. The pay and benefit increases have helped pad the pocketbooks of an estimated 4.2 million working Americans — and that number continues to grow.\nHappier employers and employees are making people more optimistic about the future too. A new University of Michigan survey shows that consumer confidence is at “its highest level since 2004 due to a new all-time record favorable assessment of current economic conditions.” Amazingly, all of the survey’s gains came from lower-income households.\nNot surprisingly, all of these positive elements are combining to create an awful lot of jobs. A recent Labor Department report shows the U.S. economy added 313,000 new jobs in February, smashing most analysts’ expectations.\nIt’s not difficult to grasp that cutting taxes can help people prosper, but it is important to remember — especially if you are a Texas lawmaker.\nWhen the next Texas Legislature convenes in January, lawmakers are expected to wrestle with a broken property tax system that is, quite literally, taxing Texans out of their homes and businesses. The situation is nearing crisis levels.\nTo understand the weight of Texas’ property tax problem, consider how much was taken from property owners. In 2016, more than 4,000 local governments socked homeowners and businesses with property tax bills totaling $56 billion. That’s a large enough tax levy to take $2,000 from every man, woman and child in Texas, or $8,000 from a family of four.\nNow consider how fast those tax bills grew. In the past 10 years alone, property taxes levied statewide have increased by 60 percent. Over the same period, the state’s population grew by only 19 percent. That’s a big delta between property taxes paid and possible property taxpayers.\nIt’s obvious that taxes are too high and growing too fast. It’s also obvious that, much as Congress tackled federal tax reform, it’s time for the Texas Legislature to act on state tax reform.\nA good place for lawmakers to start is to contain the problem. One way to do this is by creating a property tax trigger.\nThe idea behind a trigger is simple: Allow property taxes to increase by only a certain amount every year. If a local government needs more than the limit provides, then an election is triggered and voters can decide whether to approve the increase or not.\nMaking this kind of change would encourage greater government efficiency and give voters more opportunities to have a voice in the conversation. Over time, it might also help to substantially lower your tax bill as compared to the status quo. Of course, that depends somewhat on where lawmakers set the trigger. The lower the threshold, the better the likely outcome is for taxpayers.\nWhether lawmakers move forward with this particular proposal or something else, there’s no question that broad-based property tax reform is a must next session. The current situation is simply not sustainable nor is it in Texas’ best interests.\nThat is to say, Texas tax reform done right can spur economic opportunities that benefit businesses, workers and the state economy in some amazing ways — much like what has already happened nationally as a result of federal tax reform.\nWith the right tax policy changes made, lawmakers can ensure that Texas remains the nation’s economic powerhouse and, more important, dramatically improves people’s lives.\nJames Quintero leads the Think Local Liberty project at the Texas Public Policy Foundation. He can be reached at jquintero@texaspolicy.com. Rachel Freeman is a research associate at the Texas Public Policy Foundation. She may be reached at rfreeman@texaspolicy.com.", "url": "https://apnews.com/d604174b49984349852d14e4313ddf91"}