{"authors": ["Branko Marcetic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Bhaskar Sunkara", "Jedediah Britton-Purdy"], "date_download": "2020-05-04 19:55:00", "date_modify": "2020-05-04 19:55:00", "date_publish": "2018-07-31 00:00:00", "description": null, "filename": "2018_08_joe-biden-president-busing-racism_1588622100.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/07/31192158/GettyImages-956048442.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_08_joe-biden-president-busing-racism_1588622100.html", "title": "Joe Biden, the Anti-Busing Democrat", "title_page": "Joe Biden, the Anti-Busing Democrat", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Apart from Clinton’s inept campaigning and inability to connect with voters, Biden shares many of the same red flags that led a large share of the Democratic base to look with suspicion on the former secretary of state.\nThe only problem is, it’s Joe Biden. If you thought Hillary Clinton was a weak candidate, with her transactional style and triangulating policy stances, then you probably won’t be excited by Biden’s multi-decade history in the Senate.\nIt looks like Joe Biden is running. With Beltway insiders and Democratic bigwigs talking up his presidential chances, the former vice-president looks to be the candidate to beat in the 2020 primaries.\nBiden’s time as a suburban public housing advocate before entering politics led him to claim he was strongly backed by his local black community. “I still walk down the street in the black side of town,” he told the Washington Post in 1975. “Mousey and Chops and all the boys at 13th, and — I can walk in those pool halls, and quite frankly don’t know another white man involved in Delaware politics who can do that kind of thing.”\nThere’s a good reason Biden felt the need to boast about his supposed closeness with Delaware’s black community at this time. In an attempt to remedy pervasive racial segregation, that decade saw cities start to bus black students into suburban schools and white students into inner city schools. Biden earned controversy by becoming one of the program’s fiercest opponents.\nBiden called busing “the atom bomb of anti-discrimination weapons,” and worked to stop busing in his home state, calling it “the single most devastating issue that could occur to Delaware.” In 1975, he put forward an anti-busing provision that barred the Department of Health, Education and Welfare from using federal funds “to assign students or teachers by race,” broad language that actually barred the department from taking anti-segregation actions beyond just busing.\nThe amendment was meant to be a “softer” alternative to one put forward by hall-of-fame racist and Biden friend Jesse Helms, a version Biden had actually initially supported. Still, the New York Times at the time charged that Biden’s supposedly more moderate alternative would “signal a major crumbling of federal determination to achieve equal justice,” and called it “a real threat not only to the gains of the sixties, but to decency in this society.” The Washington Post was equally disapproving.\nThe fact that the measure started getting vocal support from various bigots quickly became embarrassing for Biden. Yet it didn’t stop him from using rhetoric that could best be described as politely racist. Biden claimed that legitimate desegregation was only supposed to cure de jure — or explicitly racist — segregation, and that in some of its forms, it was integration that was actually “racist and insulting.” Anti-segregationists, he charged were saying “that your black, curly-haired son has to be in the class with my white, straight-haired one before he can get a decent education,” adding that “I don’t feel responsible for my father’s sins — only for my sins.”\nBy 1975, Biden was boasting that he had “made it—if not respectable—I’ve made it reasonable for longstanding liberals to begin to raise the questions I’ve been the first to raise in the liberal community” regarding busing. He predicted that liberal holdouts would “see the light and switch sides on busing too.”\nDespite Biden’s claims that he was still cool with “Mousey and Chops and all the boys at 13th,” other African Americans didn’t seem so sold on the senator. One longtime civil rights activist criticized Biden’s attempt to make a distinction between de jure and other kinds of segregation, and called his rhetoric “glib” and “drivel,” explaining that busing was about getting black kids the educational resources that only flowed to white schools. A coalition of civil rights organizations, including the NAACP, later sued over Biden’s amendment.\nOne year after this, Biden put forward another bill, this one barring federal judges from ordering busing unless they could prove there was intentional discrimination going on. According to the Post, at the time, both pro- and anti-busing forces considered it “the most far-reaching anti-busing measure to receive serious consideration in the Senate.” Though it was voted down, Biden celebrated that the close vote signalled the “death toll” for Senate support of busing.\nIt’s hard to know how much of Biden’s anti-busing crusade reflected his personal views. After all, around this same time, he was in the midst of a re-election campaign that saw his opponent charge that Biden was “too liberal for Delaware.” And it was far from the last time. In the lead-up to his 2008 campaign, Biden repeatedly invoked Delaware’s history as a slave state to appeal to southern conservatives, telling a Republican Rotary Club that Delaware only fought with the Union because “we couldn’t figure out how to get to the South.”\nBiden’s strategy of race-baiting to win over Republican voters bodes poorly if he’s going to be running against Trump in 2020. There’s also the fact that Biden voted again and again for the unsuccessful Helms-Collins amendment, which would have stopped the Justice Department from defending busing in court. The vote came in 1980, well after he had won re-election.\nAs late as 2007, Biden called busing a “liberal train wreck.” Yet, as Asher Smith has pointed out, this year, sensing which way the winds have blown, Biden had the gall to claim that he “cast the deciding vote to allow courts to keep busing as a remedy,” because “there are some things that are worth losing over.”\nBiden’s actions on busing might at least be partly mitigated by his personal activism. As Biden was fond of telling the public, he “participated in sit-ins to desegregate restaurants and movie houses,” and his “soul raged on seeing Bull Connor and his dogs.”\nExcept Biden later admitted that he “was not an activist” and that he had simply “worked at an all-black swimming pool in the east side of Wilmington” during the civil rights movement. “I was involved in what they were thinking, what they were feeling,” he said. “But I was not out marching … I was not down in Selma. I was not anywhere else. I was a suburbanite kid who got a dose of exposure to what was happening to black Americans.” (Biden also explained that he didn’t join the antiwar movement because “I’m not big on flak jackets and tie-dyed shirts”).\nWhile Biden’s time at the swimming pool may not have contributed anything tangible to the civil rights movement, his anti-busing work had a far-reaching legacy. His relentless campaign against busing helped contribute to today’s untenable situation, where school segregation is worse than at any point since the Brown v. Board of Education ruling.", "url": "https://jacobinmag.com/2018/08/joe-biden-president-busing-racism"}