{"authors": ["Max Elbaum", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Aaron J. Leonard", "Ethan Young", "Kim Moody", "Robert Greene Ii", "An Interview With"], "date_download": "2020-05-04 19:59:38", "date_modify": "2020-05-04 19:59:38", "date_publish": "2018-09-21 00:00:00", "description": null, "filename": "2018_09_max-elbaum-new-communist-movement-socialism-organizing_1588622378.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/09/21123313/rsz_gettyimages-515574716.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_09_max-elbaum-new-communist-movement-socialism-organizing_1588622378.html", "title": "Learning from the New Communist Movement", "title_page": "Learning from the New Communist Movement", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Interview by Micah Uetricht\nWith the popularity of politicians like Bernie Sanders and Alexandria Ocasio-Cortez and the explosion in membership in the Democratic Socialists of America (DSA), socialism is suddenly central to the national political conversation. And it’s happening in the United States. Despite being a country long argued to be uniquely allergic to all talk of class conflict and any alternative to capitalism, here we are, watching many Americans question whether we should remake our political and economic systems from top to bottom.\nBut this isn’t the first time mass numbers of people in the United States have considered socialism. It also happened half a century ago, when the New Left raised questions about capitalism, imperialism, racism, sexism, and much more. At the end of the 1960s, those questions were taken up by the New Communist Movement (NCM), a collection of groups in the Marxist-Leninist tradition. While the movement was made up of organizations that had different answers to burning political questions, on the whole, these groups were inspired by the left-nationalist projects of the day, including domestic movements like the Black Panthers and Puerto Rican nationalist groups, and international communist movements in Cuba, Vietnam, and especially China.\nMax Elbaum was deeply involved in that movement. After joining Students for a Democratic Society (SDS) as a college student in Madison, Wisconsin, Elbaum co-founded the NCM group Line of March. He ended up devoting his life to various movements against war and racism and served as the editor of the leftist magazine CrossRoads throughout the 1990s.\nElbaum is the author of Revolution in the Air: Sixties Radicals Turn to Lenin, Che, and Mao, reissued in April by Verso Books with a new foreword by Alicia Garza, co-founder of Black Lives Matter. Though he was a participant in some of the organizations and campaigns and the overall movement that he chronicles in the book, Revolution in the Air takes a more dispassionate look at the NCM, fairly weighing its achievements and missteps.\nIt’s hard to come away from reading Elbaum’s book without thinking that the movement had far more missteps than achievements. As we explore in our conversation below, the movement’s orientation towards what was then called “Third-World Marxism” and left nationalism gave it some redeeming characteristics, like its steadfast commitment to anti-racism and creating a multiracial movement. But it also quickly became a movement rife with undemocratic behavior, obsessed with doctrinal purity, and oriented towards regimes like China that radicals later realized were far from successful democratic, socialist societies.\nThis is a history that’s worth excavating in its own right, given how significant the NCM was at the tail end of the New Left. But it is also history that radicals today would do well to wrestle with. Socialists in the twenty-first century don’t have to completely reinvent the wheel — they can learn from the often-heroic efforts of radicals several decades ago. Revolution in the Air is essential reading for the new generation of radicals that wants to get anti-capitalism right this time, avoiding the same sectarian, undemocratic mistakes that the past generation of Marxist-Leninists did.\nI recently interviewed Elbaum about his book. Our conversation focused on the history of the NCM and — especially — what it can teach members of the DSA.", "url": "https://jacobinmag.com/2018/09/max-elbaum-new-communist-movement-socialism-organizing"}