{"authors": ["Dug Begley"], "date_download": "2020-05-04 20:06:45", "date_modify": "2020-05-04 20:06:45", "date_publish": "2018-11-26 06:00:00", "description": "The end is near for construction that has clogged Post Oak and delayed drivers, but the buses at the center of the project will not start rolling for at least another year as officials grapple...", "filename": "_132343e8d27b4fd28cbd94fed8c37d9b_1588622805.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_132343e8d27b4fd28cbd94fed8c37d9b_1588622805.html", "title": "Post Oak rebuild nears finish, but buses won’t roll before 2020", "title_page": "Post Oak rebuild nears finish, but buses won’t roll before 2020", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The end is near for construction that has clogged Post Oak and delayed drivers, but the buses at the center of the project will not start rolling for at least another year as officials grapple with roadblocks threatening to push the final route three years past its original completion date.\nMonths of additional work lies ahead on the dedicated bus lanes in the middle of the street as crews complete the stations that will connect passengers to the rapid transit line. Though once on target to ferry passengers this holiday season, workers still are installing electrical and fiber optics systems so the buses can operate, as they pour the last segments of concrete along the widened roads from Loop 610 south to Richmond.\nAs a result the buses, which officials at one point had hoped would ferry visitors for the 2017 Super Bowl, will not carry passengers until 2020.\nEven when Metropolitan Transit Authority begins operating the buses along dedicated lanes in the center of the street, riders and operators face months, perhaps years of detours at both ends of the project as two Texas Department of Transportation projects take shape.\n“It will operate. It just may not be the guideways we want eventually,” Metro board member Sanjay Ramabhadran said.\nDrivers along Post Oak, meanwhile, will toast 2019 with most, if not all, the construction along their commute completed, said John Breeding, president of the Uptown Houston Management District that is overseeing the work. Along Post Oak the road should be returned to three lanes in each direction with most turn lanes by Jan. 1, Breeding said. The final concrete south of Hidalgo was poured earlier this month.\n“From a key user point of view, the automobiles in the area, most of the construction will be done,” Breeding said.\nProperty tax money captured by the management district and approved by the city through its capital program is paying for most of the project, along with federal and state funds.\nSince 2016, commuters and other motorists in the busy shopping corridor have faced lane closings, shifting paths and pocked roads. While keeping a positive spin on the progress, Breeding said officials are aware of the problems businesses have faced as the road slowed and shoppers and diners stayed away.\n“It is our feeling that the very best thing we can do for retail in that area is to get done,” he said.\nPost Oak is only one piece\nOutside of the actual construction, revamping the street did not reduce any driving capacity, supporters stressed.\nThe changes, at a cost of at least $192.5 million, come at the center, the edges and below-ground: Crews upgraded sewers and widened the street to include bus-only lanes in the center with passenger stations, similar to rail stops. The project also adds mature trees and wide sidewalks of paving stones, in an effort to make the road more attractive to pedestrians — and by extension — transit travelers.\nWork came, however, with heavy opposition to the merits of bigger buses and the taxpayer cost. Some nearby residents and business owners unsuccessfully sued to stop the project, and opposed it at every turn as it sought city and regional transportation funding.\nOn HoustonChronicle.com: Construction doesn’t dampen controversy over Uptown bus lanes\n“Our argument was dedicated bus lanes down the middle of the boulevard would destroy retail,” said Jim Scarborough, an Uptown resident who led some of the opposition. “Time will tell on that.”\nThe dedicated bus lanes along Post Oak are intended to add speedier transit to one of the city’s busiest streets, where service has been slowed by heavy traffic.\nConstruction of the transit lanes, however, also has been slower than predicted. Delays already had pushed estimates of an opening in 2018 to mid-2019. Now, with so much work remaining, Metro officials said they expect testing and other preliminary work to happen in late 2019, a few months after the 14 new 60-foot buses start arriving.\nMaking the trip between Metro’s northwest transit center near Interstate 10 and a future Bellaire transit center near Westpark and Loop 610, however, includes other nearby projects. Including the new Bellaire bus depot along Westpark Drive, which will not be finished for another 13 months.\nAs Post Oak proceeds, TxDOT is building an elevated busway along Loop 610 so the large vehicles will move from their Post Oak lanes to an overpass that takes them directly to the transit center. Construction, estimated to cost $57.2 million, started earlier this year. Completion is set for late summer 2020, meaning a few months of the large buses slogging north to the transit center.\nOn the southern side of the bus project, another challenge looms. A massive rebuild of the Loop 610 interchange with Interstate 69, already a year into construction, will worsen as the project moves toward its 2023 completion.\nPortal problem\nOf particular concern is the timing of work south of Richmond, where Post Oak morphs into the southbound Loop 610 frontage road and goes under I-69 before re-emerging at Westpark Drive. Referred to by transportation officials as the “portal” along with the underpass that carries northbound frontage traffic beneath the interchange, it is the critical link for Post Oak buses headed to the new Bellaire transit center.\nBecause the enormous interchange project — estimated to cost $259 million — was bid without specifics and incentives to keep the portal open to buses, Metro may need a workaround.\nOn HoustonChronicle.com: Six years of work lies ahead for 610/69 interchange\nThe nightmare scenario would be if the interchange construction complicates the bus route so severely that its benefits are significantly eroded. Metro, TxDOT, city officials and the Uptown Houston Management District are meeting weekly to see how all of the construction projects interact and what can be done to minimize disruptions.\nWhile optimistic the issues can be resolved, transit officials said it was an alarming prospect.\n“We went from sometime in ’19 to ‘20,” Ramabhadran said. “That is quite a bit different from going from sometime in ‘19 to the fall of ’22… We will have our buses here in August 2019, and it’ll be (another) three years.”\nBreeding said the hope is that service can start and then trips become quicker and less of a hassle as construction projects are completed. Finding the balance, however, between starting sooner and diminishing quality with detours or half-finished transit centers is tricky.\n“I think there is a general sense ‘Let’s do this right,’” he said. “You could operate something, but it wouldn’t be the level of service that we all hope to be able to provide.”\nMeanwhile, Breeding said people already are seeing what the street will become, especially along the northern third where trees and sidewalks are in place. That has eased some tension, he said, as people get past the construction.\n“We planned for it to look great, but I still kind of went, ‘Wow,’” he said, recalling seeing the first mostly-finished segment.\nStill, not everyone is swayed, Scarborough said.\n“It was a colossal waste of taxpayer money,” he said. “We stand by that. We never said the project was not going to be beautiful.”\ndug.begley@chron.com\ntwitter.com/DugBegley", "url": "https://apnews.com/132343e8d27b4fd28cbd94fed8c37d9b"}