{"authors": ["Marcus Reynolds"], "date_download": "2020-05-04 20:10:39", "date_modify": "2020-05-04 20:10:39", "date_publish": "2018-08-31 08:35:55", "description": "Teays Physical Therapy Center, Inc. & the Putnam Herald are pleased to present this week's male Gamer of the Week to sophomore Ethan Payne of Poca High School. The Poca High School Dots...", "filename": "_caa97768b9984a67983ac00699a261ec_1588623039.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_caa97768b9984a67983ac00699a261ec_1588623039.html", "title": "Poca's Ethan Payne earns gamer honors", "title_page": "Poca's Ethan Payne earns gamer honors", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Teays Physical Therapy Center, Inc. & the Putnam Herald are pleased to present this week’s male Gamer of the Week to sophomore Ethan Payne of Poca High School.\nThe Poca High School Dots football team opened its season with a big win over rival Nitro High School, 46-8, in the Battle for the Barrel.\nThe Dots offense sparked fireworks as they amassed 434 total yards while the defense held strong, only allowing 8 points. One standout player that helped the Dots lead the charge to victory was sophomore tailback Ethan Payne.\nPayne was the workhorse for the Dots as he scored in nearly every possible way on offense. Scoring two rushing touchdowns, one catching and one passing, Payne continues to be a jack-of-alltrades as he single handedly had 367 total yards of offense. On the defensive side, he locked down the Wildcats best receiver.\nThe Dots dominated the game on all three sides of the ball and sent a message to other AA teams around the state the Dots are back. When asked about who inspires him Ethan said, “My older brother Jake inspired me because I grew up watching him play sports and I always looked up to him. I want to be a leader just like he was when he was the quarterback on the football team.”\nWhen asked about what his personal goals for the season are Ethan said, “I would like to help my team get to a playoff game first and foremost. It’s been a long time since Poca has made the playoffs and I know it would mean a lot to the people of this town. Last year when we won back-to-back games for the first time in over four years, I think it helped to bring our Mojo back.”\nThe Dots are a new team this year and they hope to start a new streak with head coach Seth Ramsey at the helm. When coach Ramsey was asked about what this win means going forward he replied,\n“The guys played great all around. They have a greater sense of focus and determination this year and it was shown on the field our opening game. We just have to improve upon the fundamentals and stay dedicated to becoming better every practice.″\nWhen asked about his star running back’s play coach Ramsey said,\n“Ethan is the kind of guy to be the first one in the gym and the last one to leave. He is very mature for his age and leads by example to the older and younger guys. Ethan will step up to any challenge and excels. He is an extension of the coaching staff on the field\nand the team has benefited on all sides of the ball.”\nCoach Ramsey and the Dots are looking to get back to the success of years past but know they have to focus one game at a time. The town of Poca has instilled grit and dedication in these men and it has carried over to their play on the field. With the return of the Dots, the AA ranks will have a new contender knocking on the door against north central West Virginia’s best. Ethan currently has a 4.0 GPA and is the son of Sherry and Brent Payne. Payne a member on Poca’s boy’s basketball and baseball teams. Ethan says he would like to continue playing football on the collegiate level at West Virginia University and study exercise physiology in pursuit of becoming a physical therapist.\nLook for more Gamers of the Week presented by the Putnam Herald and Teays Physical Therapy Center, Inc. every Friday. If you would like to nominate a Gamer of the Week please have a coach or athletic director contact Anna Davis, ATC, at Teays Physical Therapy Center, Inc., 304-757-7293.\nMarcus Reynolds PT, DPT, CSCS is a Doctor of Physical Therapy at the Teays Physical Therapy Center and assists with the Potential Plus Program.", "url": "https://apnews.com/caa97768b9984a67983ac00699a261ec"}