{"authors": ["Standard-Examiner Editorial Board"], "date_download": "2020-05-04 20:15:19", "date_modify": "2020-05-04 20:15:19", "date_publish": "2018-05-11 22:25:44", "description": "First lady Melania Trump has an excellent idea with her “Be Best” campaign to help children. Too bad so many in the media, after listening to her unveil it Monday, focused most of their reporting...", "filename": "_107f03cb40fe4dcb9c3ee37864c93a71_1588623319.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_107f03cb40fe4dcb9c3ee37864c93a71_1588623319.html", "title": "Missing the Point With the First Lady", "title_page": "Missing the Point With the First Lady", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "First lady Melania Trump has an excellent idea with her “Be Best” campaign to help children. Too bad so many in the media, after listening to her unveil it Monday, focused most of their reporting on her relationship with her husband, President Donald Trump.\nIt is true. Approximately half of one major news organization’s story about Mrs. Trump’s announcement wandered about from speculation regarding how she is handling the Stormy Daniels episode to noting that during the first few months of her husband’s presidency, she lived not in the White House, but in New York City. She did that so their son, 12-year-old Barron, would not have to switch schools in the middle of the year.\nWhat Mrs. Trump had to say during her press conference was much more important than gossip about her relationship with the president. More attention needs to be focused on Be Best.\nAs Mrs. Trump noted, modern life is challenging for our children in many ways. Technology, including social media, can have many downsides. The nationwide drug abuse epidemic affects children both directly and indirectly through destruction of families.\nWhat does Mrs. Trump propose to do about all that? How much taxpayers’ money does she want to spend? How many new directives will be issued to schools on matters such as what they serve at lunch?\nDuring her press conference, Mrs. Trump didn’t suggest a massive new government program. One detail she offered was that she plans to discuss online safety with social media leaders.\nHer basic platform is that adults — all of us — need to “be best at educating our children about the importance of a healthy and balanced life.”\nHow refreshing — and realistic. Mrs. Trump may need a few dollars to get the word out. Congress should provide it, cheerfully. Her campaign for adults to take more responsibility for children, is long overdue.", "url": "https://apnews.com/107f03cb40fe4dcb9c3ee37864c93a71"}