{"authors": ["Molly Smith", "Staff Writer"], "date_download": "2020-05-04 20:15:17", "date_modify": "2020-05-04 20:15:17", "date_publish": "2018-03-22 12:23:00", "description": "Editor’s Note: In observance of Women’s History Month, The Monitor is recognizing local women who inspire us. This is the sixth of eight profiles on those who made our 2018 list of “Women We...", "filename": "_b910c810ce4b40bc89eddfea0922b064_1588623317.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b910c810ce4b40bc89eddfea0922b064_1588623317.html", "title": "Women We Love: Edinburg substitute an encouraging presence in classroom well after retirement", "title_page": "Women We Love: Edinburg substitute an encouraging presence in classroom well after retirement", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Editor’s Note: In observance of Women’s History Month, The Monitor is recognizing local women who inspire us. This is the sixth of eight profiles on those who made our 2018 list of “Women We Love,” a series we’ll publish every Monday and Thursday in March.\nEDINBURG — When Consuelo Carrales graduated from college more than four decades ago, she shared her graduation party with her daughter who was marking a milestone of her own, the end of high school.\nCarrales decided to pursue a college degree in her early 30s after giving birth to five children so she could move from working as a school secretary to a social studies teacher. She was pregnant with her sixth the year she graduated.\n“There was not enough (money) for all of us to do the things we wanted to do,” she said. “I always tried to do the best for my kids.”\nNow 82-years-old, Carrales still remembers waking up before sunrise to study for exams before heading to a full day of work followed by night classes at Pan American University — now the UTRGV Edinburg campus.\nShe graduated in 1972 and was hired as a history teacher, working for the Pharr-San Juan-Alamo School District for a year before moving to Edinburg CISD, where she taught for three decades before retiring in 2007 following her husband’s death.\nAlthough technically retired, Carrales has worked as a substitute teacher at Edinburg High School since 2007. Martha Robledo, who oversees substitutes for the school, said Carrales is a “regular,” frequently working at least two days a week.\nCarrales’ hard work has not gone unnoticed by her children. Her daughter Imelda Garcia nominated her mother for consideration in The Monitor’s “Women We Love” series.\n“My mother had like many others a poor upbringing,” Garcia wrote in her nomination. “On a daily basis she dealt with the challenges that come with being married, and they were many, while working long hours and attending college.”\n“What keeps me going is that in the morning and throughout the day I’m going to talk to different people,” Carrales said. “I really feel like I help the students, even if it’s advice or a story I tell them. I always try to encourage them.”\nShe particularly enjoys working with the seniors, reminding them that “the best is about to come” once they graduate, and motivating them to attend college.\n“When I go to work, I feel like I’ve accomplished something, so when I get back (home) I say, ‘Well, I deserve to watch TV or go out to eat,’ and things like that,” Carrales said with a laugh.\nAnd despite her busy schedule, she still manages to find time to volunteer at a local nursing home — something she recommends everyone do — and attend exercise classes with friends. She is also an active member of the Catholic Daughters of America and the Pan American Round Table, two women’s service groups.\n“What stands out in my mom is her honesty, her integrity and her love for humanity,” Garcia wrote in her nomination.\nCarrales said she lives her life based on a simple philosophy: “Continue (your) dreams, everything is possible and don’t look back; continue (forward) and you’ll be satisfied.”\nmsmith@themonitor.com", "url": "https://apnews.com/b910c810ce4b40bc89eddfea0922b064"}