{"authors": ["Dk Mcdonald The Daily News"], "date_download": "2020-05-04 20:04:58", "date_modify": "2020-05-04 20:04:58", "date_publish": "2018-08-03 06:12:00", "description": "BULLHEAD CITY — Five people died and 148 were injured in 502 motor vehicle crashes last year in Bullhead City, according to a report released Tuesday by Arizona Department of...", "filename": "_7f7c2bc15e4b4125a8854469ea2a2ba0_1588622698.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7f7c2bc15e4b4125a8854469ea2a2ba0_1588622698.html", "title": "Arizona traffic deaths continue to rise", "title_page": "Arizona traffic deaths continue to rise", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BULLHEAD CITY — Five people died and 148 were injured in 502 motor vehicle crashes last year in Bullhead City, according to a report released Tuesday by Arizona Department of Transportation.\nADOT produces the annual Crash Facts Report, which is a compilation of traffic crash reports provided to ADOT by law enforcement agencies around the state. The report reflects crash data for all Arizona roadways, including city streets, county roads and state highways.\nTraffic deaths in Arizona rose for the third straight year, climbing to 1,000 in 2017. As in the previous year’s report, impairment, speeding, reckless driving and failure to wear a seat belt were leading factors in traffic fatalities. Alcohol, prescription medication or illegal drugs played a role in 43 percent of traffic deaths in Arizona last year.\n“These are people — 1,000 people who are no longer with us — that will be missed by mothers, fathers, sisters and brothers. Missed by family, friends and those who love them,” said John Halikowski, Arizona Department of Transportation director. “Every driver holds the key in their hand that can save a life if they make the right choices. Choose not to speed. Choose not to drive drunk or on drugs. Choose life for yourself and others sharing the road with you. Make a promise to yourself to be a safer driver. Save a life and make someone’s day!”\nThough traffic fatalities increased from 2016 to 2017, which follows a national trend, the total number of people injured in crashes, 55,474, decreased from last year and the total number of crashes, statistically, stayed flat — in Arizona there were 127,064 crashes in 2017 and 127,039 in 2016. According to the data, speeding and reckless driving was the most common driver violation in all collisions and 285 people were killed in speed-related crashes.\nPedestrians account for nearly a quarter of the 1,000 killed in vehicle crashes. Pedestrian-related fatalities have climbed from 155 in 2014 to 226 in 2017.\nMost pedestrian fatalities occur in urban areas on city streets and county roads, officials said. Pedestrians should cross streets only at marked crosswalks where drivers expect to see them.\nThroughout Mohave County, 43 people died and 1,417 people were injured in 3,107 crashes, according to the report. Thirty-nine of the crashes resulted in fatalities.\nWhile the number of rural crashes — 22,254 — accounted for 17.51 percent of all Arizona crashes, they accounted for 45.05 percent of all fatal crashes occurring in 2017.\nOfficials noted the rising number of traffic fatalities can’t be solved by state agencies alone: 69 percent of crashes occur on roads other than state highways and that driver behavior is a factor in more than 90 percent of crashes.\n“As the data shows, traffic fatalities are largely a driver issue,” said Alberto Gutier, director of the Arizona Governor’s Office of Highway Safety. “The rising number of fatalities is not a highway issue or a vehicle issue. It is a driver issue caused by impairment, speeding and reckless driving, and a number of factors, including inattention. Even with some of the toughest DUI laws in the country, drunk driving still happens in Arizona. Impaired driving must become socially unacceptable.”\nThe number of people killed not wearing seat belts fell for the third year in a row – from 258 in 2015, 250 in 2016 and 230 in 2017 – but unbuckled occupants still account for nearly a quarter of all traffic fatalities.\nOfficially, there were 9,693 drivers involved in “distracted driving behavior” that were involved in collisions, including 33 fatal crashes. The report notes it is widely accepted that number of crashes caused by distracted drivers is much higher than reported because distracted drivers that cause crashes typically don’t admit to the act or died in the crash.\n“The rise in fatalities on Arizona roads is an ongoing trend that should concern everyone,” said Col. Frank Milstead, director of the Arizona Department of Public Safety. “Decisions made by drivers to get behind the wheel impaired, drive distracted and failure to buckle up are plaguing Arizona roadways and took the lives of 1,000 people last year alone. Law enforcement continues to target distracted and impaired drivers, but, frankly, we cannot be everywhere. Highway safety is everyone’s responsibility and the message is clear: if drivers put their complete focus on driving the life they save could be their own.”\nThe 2017 Arizona Motor Vehicle Crash Facts report is available online at azdot.gov/CrashFacts.", "url": "https://apnews.com/7f7c2bc15e4b4125a8854469ea2a2ba0"}