{"authors": ["Gary Long Staff Writer"], "date_download": "2020-05-04 20:13:58", "date_modify": "2020-05-04 20:13:58", "date_publish": "2018-12-08 04:30:00", "description": "The Brownsville Independent School District has started the conversation on renovations to Sams Memorial Stadium, the iconic venue for all BISD home football games and virtually every high school...", "filename": "_2143c1dbb1394c49a789072a2cbc9599_1588623238.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2143c1dbb1394c49a789072a2cbc9599_1588623238.html", "title": "Sams Stadium upgrades under consideration", "title_page": "Sams Stadium upgrades under consideration", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Brownsville Independent School District has started the conversation on renovations to Sams Memorial Stadium, the iconic venue for all BISD home football games and virtually every high school graduation.\nThe stadium at West Jefferson Street and Palm Boulevard was last upgraded in 1997. A Tax Ratification Election in 2015 earmarked $10 million for Sams Stadium upgrades, about $3 million of which has been spent for property acquisition around the stadium for parking and a state-of-the-art $1.4 million digital scoreboard, board member Philip Cowen said.\nThe TRE allowed the district to reconfigure its tax levy to access about $6 million in additional state funds, which are being used exclusively for school and facility improvements, among them Sams Stadium. Later BISD approved a tax increase of 11 1/4 cents per $100 valuation. The increase generates about $25 million a year in additional revenue, which is being used for lighting, roofing, HVAC and other improvements to all BISD schools.\nAt a facilities committee meeting last week, Manuel Hinojosa of McAllen-based ROFA Architects presented preliminary ideas about the renovation for committee discussion. Hinojosa, who grew up in Brownsville, called the project iconic and said he has a special place in his heart for Sams Stadium.\nThe stadium has several widely recognized problems: compliance with the Americans with Disabilities Act, shortage of restroom facilities, lack of adequate parking, drainage and the fact it takes a nearly constant direct hit from the hot South Texas sun.\nHinojosa said the stadium has about 11,200 seats. To meet building code it must have three parking spaces for every four seats. Currently the parking lot at Sams has about 340 spaces and also serves BISD’s Central Administrative Building on Palm Boulevard, the original Brownsville High School. The property BISD has acquired around the stadium will meet part but not all of the requirement.\nThe sun problem could be addressed with a massive sun shade, but Hinojosa conceded such a structure is not really feasible because of the cost and because it likely wouldn’t work that well. Another option is moving the home stands to the other side of the field where there is more shade.\nMeanwhile the stadium has 15-20 restroom fixtures on each side when about 100 per side are needed to meet code, Hinojosa said.\nHe also discussed the possibility of incorporating a regulation soccer field into the design. A high school soccer field can be between 55 and 80 yards wide and 80 to 120 yards long, meaning that the track around the current football field likely would have to be eliminated.\nTo achieve ADA compliance, the most feasible option is having the front row of seats serve as a handicapped area, the other option being an elevator to the top of the stands. Accommodating the soccer field in addition to ground-level handicapped seating would be an extremely tight fit, Hinojosa said.\nThe elevator would serve an expanded press box and handicapped patrons. The idea was met with skepticism.\nBoard member Prisci Roca Tipton urged the committee to consider wants versus needs, while Superintendent Esperanza Zendejas said the Board of Trustees needs to consider what is really required. ADA compliance kicks in once construction starts, discussion indicated.\nCowen said the meeting was the first time since the TRE funds became available that trustees have “discussed the scope of what we really want to do.”\nTrustee Sylvia Atkinson said it was worth considering that “we represent 45,000 kids and their families.”\nThe meeting ended with trustees agreeing to table the matter for further discussion.\nglong@brownsvilleherald.com", "url": "https://apnews.com/2143c1dbb1394c49a789072a2cbc9599"}