{"authors": ["Jeanne Jakle"], "date_download": "2020-05-04 20:28:39", "date_modify": "2020-05-04 20:28:39", "date_publish": "2018-04-24 19:22:35", "description": "San Antonio TV viewers are getting a new 10 p.m. anchorwoman, but she’s far from a stranger to this market. Today, KENS announced the successor to station vet Sarah Lucero, who left the...", "filename": "_575343dba4bb490e8b564e2b2687924b_1588624119.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_575343dba4bb490e8b564e2b2687924b_1588624119.html", "title": "KENS-TV promotes Deborah Knapp to 10 p.m. anchorwoman", "title_page": "KENS-TV promotes Deborah Knapp to 10 p.m. anchorwoman", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "San Antonio TV viewers are getting a new 10 p.m. anchorwoman, but she’s far from a stranger to this market.\nToday, KENS announced the successor to station vet Sarah Lucero, who left the chief anchor job in late November.\nIt’s Deborah Knapp, 63, a seasoned anchor of more than three decades in San Antonio and Philadelphia. She has co-anchored KENS’ signature late news many times since Lucero’s exit, but always on an unoffical basis.\nRELATED: Photos: Former San Antonio anchor Sarah Lucero begins second act\nNow, the CBS affiliate has made it official. Knapp is the new 10 p.m. co-anchor next to Jeff Brady. She’s joined by chief weather forecaster Bill Taylor and sportscaster Joe Reinagel.\nAccording to a statement from KENS announcing the move, the team now has more than 85 years of combined experience covering San Antonio.\n“I’m thrilled to make the move permanent,” Knapp said in the release. “I enjoy working with Jeff, Bill, Joe and our terrific reporters each night. After talking it over with my husband, we felt this was a great move for me and our family.”\nGeneral Manager Tom Cury made it clear it’s a great move for KENS, too.\n“We always knew Deborah was the right fit,” Cury said. “We’re thrilled to have Deborah’s professionalism and experience joining us permanently at 10 p.m.”\nKnapp will continue to anchor KENS’ 4 p.m. news, which has been a consistent ratings winner for many years, as well as the station’s 5 p.m. newscast, which wrested No. 1 from KSAT — the station that’s usually in first place in that time slot — in the February Nielsens.\nShe’s also a big help to the younger reporters and new hires when they need her.\nRELATED: KENS-TV traffic anchor Niku Kazori’s secret sides may startle you\n“Deborah is a mentor to many in our newsroom and a leader for our station and community,” said Jack Acosta, KENS executive news director. “We are lucky to have her.”\nThis isn’t the first time she’s been offered the 10 p.m. broadcast, but it’s the first time she has accepted.\nWhen her two kids, Alicia and Austin, were small, she was told the 10 p.m. co-anchor position next to Chris Marrou, KENS’ star anchorman at the time, was hers if she wanted it.\nShe turned it down and, as she said in a recent interview, never regretted the decision. She preferred to do the earlier evening newscasts so she could be home nights to tuck her children in bed.\n“You can’t get those years with your kids back,” she said.\nKnapp now has three grandchildren and visits them and their mom in Hong Kong, where Alicia lives, whenever possible. Son Austin is much easier to see these days. He recently moved back to San Antonio from New York.\nThough she considers San Antonio her hometown, she was born in Japan. Knapp’s dad was in the Air Force, so her family moved numerous times before settling in the Alamo City in the ’60s, when she entered Garner Middle School.\nBefore starting in the world of news, Knapp was cast in a movie in 1975 opposite Robert Redford. She played a farmer’s daughter in “The Great Waldo Pepper,” the brief love interest of Redford’s dashing pilot.\n“When we did the film,” she said, “Robert Redford told me, ‘I guess you want to go to Hollywood now and be a movie star.’ I told him, ‘No, I want to be a reporter.’”\nKnapp said that was her dream ever since she was 14 at MacArthur High School.\nRight out of college at the University of Texas at Austin, Knapp got her start — not on KENS, but competitor KSAT, as the station’s “weekend weather girl.”\nNot long after, she was hired by KENS as a weekday anchor.\nHowever, an opportunity in a bigger city — the CBS station in the top-5 market of Philadelphia — soon beckoned, and she answered the call. She anchored the news there for six years but left in 1986 to return to KENS.\n“This is home. My family was here,” she said. “I wanted to raise my kids here. I feel close to the people. It makes me feel so good when a waiter or someone else tells me, ‘I’ve been watching you since I was little.’”\nJeanne Jakle’s column appears Thursdays and Sundays in mySA. Read more of her columns here. | jjakle@express-news.net | @JakleJ", "url": "https://apnews.com/575343dba4bb490e8b564e2b2687924b"}