{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:16:39", "date_modify": "2020-05-04 20:16:39", "date_publish": "2018-12-25 05:01:00", "description": "WASHINGTON — 'Tis not the season to be jolly, thanks to Donald Trump. His sudden, unilateral decision to withdraw troops from Syria, forcing the resignation of Secretary of Defense Jim...", "filename": "_abe78b6edfe54b479b637138e889e070_1588623399.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_abe78b6edfe54b479b637138e889e070_1588623399.html", "title": "Trump's absurdity has cast a pall over the holidays", "title_page": "Kathleen Parker: Trump's absurdity has cast a pall over the holidays", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WASHINGTON — ’Tis not the season to be jolly, thanks to Donald Trump.\nHis sudden, unilateral decision to withdraw troops from Syria, forcing the resignation of Secretary of Defense Jim Mattis — one of the last bulwarks against the president’s impulsivity — has cast a pall on the holidays and, perhaps, the future.\nIn his letter of resignation, Mattis said the president deserves a defense secretary who is “better aligned” with his worldview. This alone is a terrifying thought - what madman (or woman) would fit that description? There can’t be many generals left who would want the task of taking orders from a commander-in-chief who developed his military strategy playing Monopoly.\nHaving lost his battle to keep the president away from making stupid decisions that will backfire, he surrendered to what he apparently saw as his only option - abandoning ship. Whether this was strictly voluntary is unclear, but Mattis has publicly disagreed with the president on multiple issues. Not without cause.\nFrom this president’s bizarre flirtation with North Korea’s Kim Jong Un - declaring without basis the end of Pyongyang’s nuclear aspirations - to his on-again-off-again romance with Russian President Vladimir Putin and a problematic trade war with China, Trump has behaved more like a casino goer playing roulette than the leader of the world’s most stabilizing force.\nTo put it bluntly, not that this is news: The man knows nothing of which he speaks; he ignores expert advice (see Mattis and, concerning Syria, national security adviser John Bolton); he doesn’t bother himself with written reports, which he seems either unable to read or to comprehend; and relies on Fox News for information and Twitter for communication. He announced his Syria decision via tweet.\nAs you ponder the absurdity of Trump deploying and withdrawing troops around the globe, try to imagine a combat veteran like Mattis tweeting his orders to his fighting men and women in the trenches or the deserts. There’s something so utterly unpresidential about tweeting matters of import - and, frankly, so unmanly - one wonders why Mattis remained as long as he did.\nThe answer is duty, a word too good to share a paragraph with the president’s name.\nAt this hingepoint, when Trump has thrown the Middle East into uncertainty and peril, Mattis’ duty was to turn his back to the commander-in-chief, and he did just that.\nMattis also expressed in his letter that the U.S. needs to be “unambiguous” with Russia and China. It may be that Trump was being just that by pulling out of Syria, which Putin praised as “correct.” China has thought Trump a fool for so long, little he does bestirs the giant from its machinations.\nMeanwhile, the Kurds will be left to fend for themselves against Syrian President Bashar al-Assad, Turkey and the Islamic State, while Israel is left in limbo. The editorial board of Israel’s Haaretz newspaper called Trump’s decision a “slap in the face to Benjamin Netanyahu” and said that U.S. involvement was “an important counterweight to the Russians in establishing the rules of the game in the region.”\nHaaretz writer Amos Harel wrote what many in the U.S. have noted: “Trump is in such big trouble and acts in such an erratic manner that the Israeli government cannot be certain of his support over the long term.”\nThe “trouble” is of course special counsel Robert Mueller’s investigation, predicted by some to be completed by February. Whether Trump’s decision to pull out of Syria was a wag-the-dog maneuver to shift public attention from his miseries can be debated, though nothing about his personality or record would cause one to strenuously protest such an assertion.\nIn his tweets, Trump boasted that the Islamic State is finished in Syria and, therefore, the U.S. need not stay. Even if this were so, our presence in Syria was about more than killing terrorists, who are eternity’s whack-a-moles - limited by neither geography or time. It was also about making sure they would not sprout again.\nThis is the essence of what Mattis has said about Afghanistan as well, warning that a significant troop withdrawal would threaten American security at home. Terrorist groups across the Middle East have been waiting us out, as they’ve always done and will do - for all of time, if that’s what it takes to end us.\nThat is, if President Trump doesn’t beat them to the punch.\nKathleen Parker is a syndicated columnist. Her email address is kathleenparker@washpost.com.", "url": "https://apnews.com/abe78b6edfe54b479b637138e889e070"}