{"authors": ["The Herald-Dispatch"], "date_download": "2020-05-04 20:26:32", "date_modify": "2020-05-04 20:26:32", "date_publish": "2018-05-05 07:45:59", "description": "That warm, breezy blast of sun is making it prime time for some good craft brew festivals. Here's a look at some upcoming May craft brew fests as well as some other regional craft beer...", "filename": "_b5550a8e8f9a46b7807e8b6b7de9b361_1588623992.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b5550a8e8f9a46b7807e8b6b7de9b361_1588623992.html", "title": "BOTTLES, BREWS AND MORE", "title_page": "BOTTLES, BREWS AND MORE", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "That warm, breezy blast of sun is making it prime time for some good craft brew festivals.\nHere’s a look at some upcoming May craft brew fests as well as some other regional craft beer news.\nNew craft beer and wine store opens\nNestled beneath Navarino Bay and beside Austin’s Ice Cream is the latest new shop to go into The Market, 809 3rd Ave., Huntington.\nBottled Up, a new craft beer and wine shop, had a soft opening Thursday, May 3, and then opened for business at 11 a.m. Friday, May 4.\nOwned by Michael Foust and his fiancee, Carmen De La Rosa, Bottled Up is a retail craft beer and wine shop that will specialize in gift baskets as well as create-your-own mix-and-match six packs, wine tastings and more.\nFoust, a Philadelphia native, said when he heard Phil Nelson and Jim Weiler were going to create The Market, a space with a similar vibe to Reading Terminal Market in Philly, he wanted to be a part of it.\n“I was talking about doing a shop in Teays Valley where I live, but when Ian Patrick told me they were looking for someone to do a shop in The Market, we jumped in and started that process last year to make this happen,” Foust said.\nFoust said one cool thing about the new shop is that Bottled Up has a license that allows customers to buy beer or wine at\nthe shop and to carry it on premise which means both the indoor market section and the walk-through that connects 3rd and 4th Avenues.\nFoust said they are excited to open and to join the renaissance happening in downtown Huntington.\n“That whole downtown Huntington with The Peddler and Backyard and Black Sheep is all just crazy right now, and with The Market addition it is going to be spectacular,” Foust said. “I think we are going to turn Huntington back into the city it was or make it the city everyone wants it to be.”\nGo online at http://www.bottledup.market and and https://www.facebook.com/bottledupwv/ for more information and to keep up with events at Bottled Up.\nA communion brew\nFrom 5 to 7 p.m. Sunday, May 6, Oscar’s Breakfast, Burgers & Brews, 6007 U.S. 60, Suite 314, Barboursville, hosts the traveling event Orthodoxy on Tap, which is described as a fun and relaxed evening gathering in which folks discuss the Orthodox faith as well as enjoy food, drink and each other’s company. Whether you’re Orthodox or just curious about the faith, the organizers encourage you to stop in and see what it’s all about.\nHuntington brewery now filling growlers\nHuntington’s only in-city brewery, The Peddler, 835 3rd Ave., is now filling growlers and howlers.\nThe brewery is only accepting their own growlers and howlers, to ensure quality. The Peddler vessels are emblazoned with The Collis P. Huntington logo. Empty growlers are $7; howlers are $6; and fillups are $14 and $8 respectively.\nGo online at https://www.facebook.com/The-Peddler-389850314486735/ for more info.\nBeer and cheese pairing\nMove over vino, there’s a beer in the house. Summit Beer Station, 321 9th St., Huntington, hosts a beer and cheese pairing as part of its Beer 101 series at 4 p.m. Sunday, May 6.\nIt will feature three Chimay monastic cheese with three paired beers. The class will cover the process of pairing and tasting cheese with beers. This will be limited to 12 seats. Reservations, $20, can be made in person at Summit Beer Station or by calling 681-378-0468.\nBeer 101 is a weekly Sunday class that focuses on a particular style or type of beer. The class aims to cover everything from history and brewing processes to tasting notes and terminology.\nGo online at https://www.facebook.com/summitbeerstation/ for more info.\nFoam at the Dome\nFeaturing 200 craft brews from 70 breweries as well as 20 artisans and eight food vendors, the capitol is indeed calling beer lovers with its third annual Foam at the Dome.\nCharleston Main Streets’ largest fundraiser will move to a new location on Kanawha Boulevard in front of the West Virginia state Capitol from 4 to 7 p.m. Saturday, May 12.\nAll money raised from the event goes back into the community to continue the development and revitalization of the East End and West Side districts.\nMusic will be by Porch 40, The Kind Thieves and Peddlers Glory.\nSome tickets remain at $35 for general admission, $60 for VIP (3 p.m. access) and $20 for a DD ticket that includes free water and access to Foam at the Dome live music, art and food vendors.\nIf you are feeling lucky, Charleston Main Streets, Team Trivia of WV Inc. and Bricks & Barrels will host Foam at the Dome Trivia Night from 7 to 9 p.m. Monday, May 7. Trivia players will have a chance to purchase discounted tickets to Foam at the Dome 2018, and first, second and third places will all win prizes.\nGo online at www.foamcwv.com for more info.\nHead to Weathered Ground\nThe farmhouse brewery that is Weathered Ground is making a splash on the West Virginia craft beer scene. You can get a taste of its brews in Huntington at such places as Black Sheep, which has its Little Grazer (Grisette), a Belgium coal miner’s beer, on tap as well as some of its Imperial Stout. Weathered Ground is also on tap at Bahnhof WVrsthaus and Biergarten.\nFor craft beer lovers, it’s always fun to go check out the actual brewery, and if you want a road trip this weekend it’s a great time to do it.\nFrom 10 a.m. to 10 p.m. Saturday, May 5, Weathered Ground Brewery, 2027 Flat Top Road, Cool Ridge, West Virginia, will host the inaugural West Virginia Pub Fest with 22 bands as well as craft beer, food, arts and vendors. Funds will go to help raise money for West Virginia Public Broadcasting.\nMusical performers The Kind Thieves, William Matheny, Matt Mullins & The Bringdowns, Long Point String Band, Culture Thief, The Fabulous Brothers Steele, Spencer Elliott, Black Garlic, Groundhog Gravy, Blue Yonder, 18 Strings, Corey Shields, Flat Tracker, Leeroy Greene & The Meanies, Clinton Scott, Corey Lee McQuade, Tim Lancaster, Andrew Adkins, Poor Taters, Jean Hanna Davis and Matt Deal. Tickets are $20. Go online at www.wvpubfest.com.\nDinosaur-themed brew\nThe Cincinnati Museum Center and Rhinegeist Brewery are working on a spectacle 150 million years in the making. The center will unveil a display of prehistoric proportions on the taproom floor of Rhinegeist during Jurassic Geist on National Dinosaur Day, May 15.\nThroughout the restoration of Union Terminal, the center has taken its objects, artifacts and programs into the community. Until now, almost every object has been seen by guests before. The partnership with Rhinegeist will unveil a new object in CMC’s collections on display for the first time.\nAs the center readies for the reopening of Union Terminal and re-imagined museum spaces in the coming years, it’s giving people a taste of what they can expect. Rhinegeist is also giving guests a literal taste.\nTo celebrate the partnership, Rhinegeist is brewing a special beer called Brittlebrain. The beer is an effervescent, fruity and slightly spicy Belgian Style Golden Ale clocking in at 8.6 percent ABV. Guests can get their first sip of the limited-edition beer during the unveiling. The event is free, and a portion of Brittlebrain sales will go toward CMC.", "url": "https://apnews.com/b5550a8e8f9a46b7807e8b6b7de9b361"}