{"authors": ["Tribune Staff Report"], "date_download": "2020-05-04 20:14:50", "date_modify": "2020-05-04 20:14:50", "date_publish": "2018-02-20 05:00:00", "description": "The Beech Companies, a leader in community economic development, is encouraging local Black business owners to list their businesses in a new directory. Beech Companies, produced the North...", "filename": "_b71827e099304fdd8a14e22b6b92ee10_1588623290.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b71827e099304fdd8a14e22b6b92ee10_1588623290.html", "title": "Beech launches directory for Black-owned businesses", "title_page": "Beech launches directory for Black-owned businesses", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Beech Companies, a leader in community economic development, is encouraging local Black business owners to list their businesses in a new directory.\nBeech Companies, produced the North Philadelphia Black Biz Directory in 2017 and is now producing the 2018 Philadelphia Black Biz Directory in an effort to identify and promote Black-owned businesses citywide.\n“Promoting Black-owned businesses in Philadelphia is an ongoing effort to harness the economic power of its Black residents,” said Beech Companies CEO Ken Scott.\n“There was an overwhelming response from businesses from throughout the Delaware Valley and beyond interested in inclusion in the 2017 North Philadelphia Black Biz Directory, which is why it was decided to expand to include the entire city in 2018,” he said.\n“Primary to the support of Black-owned business is identifying them — where they are and what they offer. Community development organizations like Beech Community Services can lead the way in organizing the community around Black economic empowerment.”\nMarilyn Kai Jewett, project director, said the directory is an important component of the national and local movement to support Black-owned businesses.\n“The North Philadelphia Black Biz Directory includes businesses owned by African-American, Caribbean and African entrepreneurs,” she said.\n“It’s being used not only by individuals, but also by elected officials and corporations to provide business information and opportunities to the businesses listed. We want to offer that opportunity to Black-owned businesses throughout the city.”\nThere is no charge to be listed. However, businesses must be located in Philadelphia. Jewett said they are seeking Black-owned retail, wholesale, service and professional businesses for inclusion in the directory.\n“We’re especially looking for Black contractors, medical and legal professionals who have their own practices and consultants of all types,” Jewett said.\n“We have a lot of Black-owned pharmacies, restaurants and hair salons. But, we also need the cultural artists, entertainers, designers and venues. You don’t have to join anything, buy anything or give a discount to be included. Don’t miss this opportunity.”\nThe directory will be available in hard copy and can be downloaded in PDF and app form.\nTo get your free listing, email northphillybiz@outlook.\nThe deadline to submit information for inclusion is March 31.", "url": "https://apnews.com/b71827e099304fdd8a14e22b6b92ee10"}