{"authors": ["Bill Novak", "Wisconsin State Journal"], "date_download": "2020-05-04 20:16:17", "date_modify": "2020-05-04 20:16:17", "date_publish": "2018-12-14 16:45:00", "description": "Bridge and pavement improvements on Interstate 94 in Dane and Jefferson counties won't happen for several years, but the state wants public input now on the projects. The Wisconsin...", "filename": "_913ad75e39ed4e04b51fd4a1aefa5270_1588623377.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_913ad75e39ed4e04b51fd4a1aefa5270_1588623377.html", "title": "Bridge, pavement work on tap for I-94 in Dane, Jefferson counties", "title_page": "Bridge, pavement work on tap for I-94 in Dane, Jefferson counties", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Bridge and pavement improvements on Interstate 94 in Dane and Jefferson counties won’t happen for several years, but the state wants public input now on the projects.\nThe Wisconsin Department of Transportation will conduct a public involvement meeting Monday from 4 to 6 p.m. at the Johnson Creek Community Center, 417 Union Street, to get input on a half-dozen bridge improvements and the resurfacing of most of the highway in Jefferson County.\n“The project team is seeking input from the public on the potential improvement alternatives to address identified needs,” said DOT design project manager James Buschkopf.\nBridge improvements on I-94, going from west to east in the two counties, include Ridge Road, Oak Park Road, Highway O, the railroad bridge west of Highway 26 in Johnson Creek, Highway F and Willow Glen Road.\nThe improvements are scheduled for 2025 and 2026, but could be moved up to 2021 and 2022.\nThe meeting will have an open house format with no formal presentation. There will be exhibits and maps for viewing, and DOT staff will be on hand to answer questions and discuss the project.\nThose unable to attend who would like more information can contact Buschkopf at 884-7133, or by email at james.buschkopf@dot.wi.gov.", "url": "https://apnews.com/913ad75e39ed4e04b51fd4a1aefa5270"}