{"authors": ["The Detroit News"], "date_download": "2020-05-04 20:08:32", "date_modify": "2020-05-04 20:08:32", "date_publish": "2018-05-16 20:37:52", "description": "The Michigan football and men's basketball teams were among 10 of the university's athletic programs to receive Division I Academic Progress Rate Public Recognition Awards from the NCAA on...", "filename": "_ea7c398c64264ccdba8babc13ad5c7e4_1588622912.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ea7c398c64264ccdba8babc13ad5c7e4_1588622912.html", "title": "UM leads state DI schools in NCAA academic awards", "title_page": "UM leads state DI schools in NCAA academic awards", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Michigan football and men’s basketball teams were among 10 of the university’s athletic programs to receive Division I Academic Progress Rate Public Recognition Awards from the NCAA on Wednesday.\nThe recognition award goes to teams who posted APR scores in the top 10 percent of all members in their respective sports.\nThis is the fourth straight year Michigan football has won the award and seventh consecutive year the men’s basketball team has earned the honor. Michigan is the only Big Ten school to receive the award in both football and men’s basketball.\nIn addition to Michigan football, women’s golf, men’s gymnastics and softball have also earned honors for a fourth straight year. Baseball and women’s cross country have won back-to-back awards, while women’s basketball and men’s and women’s tennis also received the honor.\nAPR is a measurement that tracks the academic progress of each student-athlete in real time. Eligibility, retention and graduation are used in the calculation, and high-performing teams receiving awards posted APR scores ranging from 977 to a perfect 1,000.\nOther state programs to receive the award, which recognizes the 2016-17 academic year:\nMichigan State: men’s basketball, men’s cross country, men’s swimming and diving.\nCentral Michigan: women’s golf.\nDetroit Mercy: men’s fencing.\nEastern Michigan: men’s cross country, volleyball.\nOakland: men’s cross country, women’s cross country, women’s golf, men’s swimming and diving, volleyball.\nWestern Michigan: men’s tennis.\nMulti-year APRs will be announced next week.", "url": "https://apnews.com/ea7c398c64264ccdba8babc13ad5c7e4"}