{"authors": ["Deron Snyder The Washington Times"], "date_download": "2020-05-04 20:06:21", "date_modify": "2020-05-04 20:06:21", "date_publish": "2018-03-20 10:34:50", "description": "The NCAA men's basketball tournament got exactly what it needed from the opening rounds. Bizarre blowouts. Crazy comebacks. Fantastic finishes. Sensational stories. Unbelievable...", "filename": "_31e6093f0ed62e267b8cefbf046e4d36_1588622781.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_31e6093f0ed62e267b8cefbf046e4d36_1588622781.html", "title": "SNYDER: Hoops fun unsullied, for now, by FBI probe", "title_page": "SNYDER: Hoops fun unsullied, for now, by FBI probe", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The NCAA men’s basketball tournament got exactly what it needed from the opening rounds.\nBizarre blowouts. Crazy comebacks. Fantastic finishes. Sensational stories. Unbelievable upsets.\nFor 96 hours, the federal probe faded into the background, joining the so-called criminal offenses at its core. Instead of focusing on impermissible benefits, we feasted on unadulterated basketball, where names on the front or back of jerseys didn’t matter.\nMind you, nothing about the sport’s underbelly has changed. The same infrastructure, abuses and economic forces remain in play. The number of teams have been whittled from 68 to 16, but the NCAA’s issues haven’t undergone a similar reduction.\nBut no one wants to think about such problems at these moments, not after a region’s top four seeds failed to reach the Sweet 16. That’s an unprecedented occurrence.\nConcerns also can wait when an UMBC beats a Virginia, becoming the first No. 16-seed to topple a No.1.\nThe Retrievers would’ve shocked the world with a halfcourt heave at the buzzer to beat the Cavaliers. Notching a 20-point blowout against the country’s top-ranked team still seems incomprehensible.\nDisbelief was in full effect as UMBC slowly pulled away after forging a tie at halftime. Surely Virginia would come to itself and restore order. Except it didn’t.\n“Unbelievable,” UMBC coach Ryan Odom told reporters. “It’s really you can say.”\nSpeaking of Odom, the business of basketball lurks, even amidst copious amounts of feel-good.\nThe coach was hired in 2016 and signed a seven-year contract for $230,000 per season. The school opened an $85 million arena in February. But Odom has soared on the hot-candidates list and faced questions about staying after UMBC’s loss against Kansas State. “I haven’t even thought about it right now,” he told reporters.\nHe’ll have no choice this week when brand-name programs start feeling him out.\nVirginia’s run ended early but so did other schools with high Q-Ratings. Fellow No. 1 seed Xavier was bumped Sunday by Florida State.\nA pair of No. 2s North Carolina and Cincinnati were ousted in the second round by Texas AM and Nevada, respectively. The latter pulled off an improbable comeback after trailing by 22 points with about 11 minutes left in the game.\n“It’s just unheard of what’s going on,” Nevada coach Eric Musselman told reporters.\nA-listers Michigan State and Tennessee, No. 3 seeds, were sent home by 11-seeds. The Spartans lost to a fellow blue-blood program, Syracuse. But the Volunteers were knocked off by Loyola-Chicago, making its first tourney appearance since 1985.\nTeam chaplain Sister Jean Dolores-Schmidt has been the second-biggest story behind UMBC; she predicted the Ramblers would advance, but her bracket has them losing in the Sweet 16.\n“I think what you see happening in college basketball, it’s almost like a revolution,” Florida State coach Leonard Hamilton told reporters Sunday after his Seminoles advanced.\n“What happens is, you start categorizing people by the reputation that their players get going into college. But in reality, kids are playing basketball all over the country and teams are getting better. Just because maybe they might not be in one particular conference or maybe they’re not considered to be one of the more traditional rich schools, people are playing basketball.”\nHamilton pointed out an obvious-but-often-forgotten fact: “See, sometimes the team that’s the most talented might not necessarily win the game. It’s the team that’s playing well at that particular time.”\nThe opening rounds make the argument for inviting more mid-majors to the big dance.\nPete Thamel of Yahoo Sports points out that in 2012 through 2014, at-large bids went to 28 teams outside the seven most prominent conferences.\nBut during the last three years, only nine teams in that category were selected. Other candidates were passed over in favor of low-finishing also-rans from power leagues.\nWhy not include more squads like Saint Mary’s and Middle Tennessee State, currently toiling in the NIT? Perhaps a few more schools that aren’t on TV all the time could treat the nation to tasty treats like UMBC, Loyola-Chicago and Nevada delivered. Such teams almost certainly will be gone by the Elite Eight and definitely fall short of the championship game, so what’s the harm?\nBesides, it would create an extra benefit for the NCAA: Including more little guys helps distract folks from the sordidness of Division I men’s basketball.\nThe tournament’s opening rounds did an excellent job in that regard.\nBut it won’t last.\nDeron Snyder writes his award-winning column for The Washington Times on Tuesdays and Thursdays. Follow him on Twitter @DeronSnyder.", "url": "https://apnews.com/31e6093f0ed62e267b8cefbf046e4d36"}