{"authors": ["Allen Trieu", "Special To The Detroit News"], "date_download": "2020-05-04 20:23:29", "date_modify": "2020-05-04 20:23:29", "date_publish": "2018-01-25 18:05:33", "description": "Las Vegas (Nev.) Bishop Gorman wide receiver Jalen Nailor is one of Michigan State's few remaining targets in the 2018 class. Nailor (5-11, 170 pounds) took an official visit to Michigan...", "filename": "_e6d5f947dfd944548f489f26740e5fe1_1588623809.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e6d5f947dfd944548f489f26740e5fe1_1588623809.html", "title": "MSU leader for WR Nailor; 'Huskers make push", "title_page": "Trieu: MSU leader for WR Nailor; 'Huskers make push", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Las Vegas (Nev.) Bishop Gorman wide receiver Jalen Nailor is one of Michigan State’s few remaining targets in the 2018 class.\nNailor (5-11, 170 pounds) took an official visit to Michigan State last weekend. Following that trip, he told 247Sports director of recruiting Steve Wiltfong that the Spartans were “absolutely” his leader.\nTwo days after he returned from East Lansing, however, Nebraska had wide receivers coach Troy Walters at his school and the Cornhuskers offered him a scholarship. Now Nailor is considering an official visit to Lincoln, but the Spartans remain the team to beat.\n“It was a great experience,” he said. “The highlights were hanging out with the players and coaches. Family atmosphere — also, the fans were great.”\nThe Spartans are continuing to recruit Nailor and another wide receiver, Tommy Bush out of Texas.\nBush figures to be an outside receiver, but Nailor could play outside or in the slot. The finer points of the position and where he may line up were discussed with wide receivers coach Terrence Samuel on his visit.\n“We actually did some chalk talk, so that was really a great learning experience for me,” Nailor said. “We also talked about what he expects out of each receiver that he’s coaching. He also told me what I could possibly bring to the offense because of what kind of a player I am and could become.”\nNailor, who had 41 receptions for 807 yards and 12 touchdowns as a senior, has ties to both Michigan State and Nebraska. The Cornhuskers have former Bishop Gorman standout Tyjon Lindsey on their roster. Lindsey and Nailor played youth ball together even before they played on the same high school team.\nMichigan State signed his teammate Jacob Isaia, an offensive lineman, during the early signing period for the 2018 class.\nNailor already has taken an additional official visit to Arizona State, where he was once committed. Nebraska and Utah are the schools he is considering taking his final officials to before making a decision.\nHe plans to make a decision “in the next couple weeks or so.”\nThat wait is likely to be worth it for Michigan State faithful, and the Spartans set the bar high.\n“I can definitely see myself here (at MSU),” Nailor said.\nNailor plans to study sports management in college.\nMSU offers 2 juniors\nOn Wednesday, Michigan State offered a scholarship to Mineral (Va.) Louisa County linebacker Brandon Smith, a 6-foot-5, 215-pound junior. Smith played middle linebacker for his school, but his size and athleticism has many schools thinking defensive end.\nThe Spartans join Alabama, Penn State, Ohio State, Notre Dame and others on Smith’s offer list. He is ranked as the No. 39 overall prospect in the country by the 247Sports Composite.\nMichigan State also offered Dallas (Texas) Bishop Dunne cornerback Marquez Beason. Beason (5-11, 173 pounds) could project to wide receiver as well, but is an exciting, big-play performer on both sides of the ball. He has offers from Nebraska, Arkansas, Illinois, Oklahoma, Texas and many more.\nMassive sophomore has MSU in school\nMichigan State assistant coach Brad Salem was on the recruiting trail in Wales, Wisc., where he checked in on Kettle Moraine High School’s 6-foot-7, 285-pound sophomore Trey Wedig. Wedig is considered among the top prospects in the Midwest in his class. Iowa State and Syracuse already have offered.\nMore information\nJalen Nailor profile\nBrandon Smith profile\nMarquez Beason profile\nAllen Trieu began covering the state of Michigan for Scout.com in 2005 and began managing the entire Midwest in 2009. He has been featured on the Big Ten Network on its annual Signing Day Show. His Michigan and Michigan State recruiting columns appear weekly at detroitnews.com.", "url": "https://apnews.com/e6d5f947dfd944548f489f26740e5fe1"}