{"authors": ["Will Webber"], "date_download": "2020-05-04 20:11:53", "date_modify": "2020-05-04 20:11:53", "date_publish": "2018-08-11 05:40:00", "description": "University of New Mexico President Garnett Stokes acknowledged the state attorney general’s request that the school’s board of regents hold a second meeting regarding cuts in UNM’s athletic...", "filename": "_fe5100871b404ca7abd493209f1043da_1588623113.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fe5100871b404ca7abd493209f1043da_1588623113.html", "title": "University of New Mexico president stands by decision to cut sports", "title_page": "University of New Mexico president stands by decision to cut sports", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "University of New Mexico President Garnett Stokes acknowledged the state attorney general’s request that the school’s board of regents hold a second meeting regarding cuts in UNM’s athletic department, but she said neither she nor the department will change their recommendation to eliminate sports by the end of the school year.\nAttorney General Hector Balderas this week said the regents violated the state’s Open Meetings Act during their July 19 special session to consider the cuts to several sports and must hold a second public forum following proper codes of conduct.\nBalderas said the university violated state law by issuing a vague agenda prior to the meeting, which kept the public ill-informed about the action the regents were about to take. He threatened to sue UNM if the regents did not agree to re-convene.\nOn Friday, a complaint outlining UNM’s violations of state law and calling for the regents to act was filed in the 2nd Judicial District by Albuquerque attorney Maria Touchet.\nIn an interview Friday, Stokes said UNM has been prepared for potential litigation since the announcement it plans to eliminate men’s soccer, men’s and women’s skiing, beach volleyball and the women’s diving team. The teams will compete this coming school year but will officially disband by next summer.\nA total of 63 student-athletes and four full-time coaches have been directly affected through loss of scholarships or jobs. The announcement was at the core of an aggressive move by UNM athletic director Eddie Nuñez to trim $1.2 million from his department’s annual budget for the next fiscal year.\n“[Litigation] has happened at other universities that have made decisions to cut sports,” Stokes said. “So it’s not unexpected that people might pursue that as a way of dealing with it.”\nStokes said the university will comply with Balderas’ demand for another regents meeting. On Friday, a representative for the regents said an official announcement about the time and place for that meeting will be posted as early as Monday.\nAt issue, Balderas has said, is the agenda item for the July 19 meeting. A five-word line mentioning athletics was the only indication of what was to come. The complaint filed by Touchet claims the regents had already met in secret to reach their decision, which would be a direct violation of the Open Meetings Act.\nOther issues, such as student regent Garrett Adcock no longer being a UNM student at the time of the meeting, were mentioned. The complaint says he graduated from law school in May and his vote, therefore, should be invalidated.\nThe regents voted 6-0 in favor of Nuñez’s plan.\n“Eddie’s report is final,” Stokes said. “I accepted that recommendation. What we’ve been doing since is gathering all of the backup information that could potentially enrich the public understanding of how we got to where we are.”\nMuch of that information has already been made public over the past few weeks and months, including a detailed report on UNM’s lack of Title IX compliance and a 24-page document Nuñez presented to the regents July 19 outlining his rationale for cutting sports.\n“I don’t yet know how we will take all that information and provide it to the public, but I think Eddie’s report, the Title IX report that we issued to the public back in May — they’re lengthy reports, and not everybody takes the time to digest all the information that’s in them,” Stokes said.\nBalderas ordered the regents to hold a second meeting within 15 days of his original correspondence, meaning the latest UNM can go before convening again is Aug. 23. The regents are scheduled to have a regularly scheduled meeting Tuesday, but that meeting likely will have nothing to do with the cuts to athletics.\n“Certainly I came in the door knowing that we had challenges with athletics,” Stokes said. “Neither Eddie Nuñez or I have hidden the fact that we wished that we — that some of the issues surrounding our athletics programs at UNM had been resolved prior to our arrival. The reason they aren’t is because they’re very difficult issues for us to manage, for people to manage. So how do we turn the corner? I think it’s one day at a time.”", "url": "https://apnews.com/fe5100871b404ca7abd493209f1043da"}