{"authors": ["Mark Moreno Staff Writer"], "date_download": "2020-05-04 20:05:55", "date_modify": "2020-05-04 20:05:55", "date_publish": "2018-01-16 04:16:00", "description": "McALLEN — More than 100 people from the community congregated Monday in downtown for the eighth annual MLK Day at Cine El Rey. Celebrated on the third Monday in January, Dr. King was a man...", "filename": "_1789da8e69984467adae0af916aafc67_1588622755.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1789da8e69984467adae0af916aafc67_1588622755.html", "title": "MLK Day at Cine El Rey", "title_page": "MLK Day at Cine El Rey", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "McALLEN — More than 100 people from the community congregated Monday in downtown for the eighth annual MLK Day at Cine El Rey.\nCelebrated on the third Monday in January, Dr. King was a man who brought hope and healing to America. The holiday also marks the life and contributions of America’s greatest champion of racial justice and equality, who not only dreamed of a color-blind society, but led a movement that achieved historic reforms to help make it a reality.\nLebby Salinas, President of The Historic Cine El Rey Theatre Foundation, said the celebration is to honor the life and legacy of Dr. Martin Luther King Jr. and to promote a National Day of Service.\n“Our aim is to help citizens learn about regional non-profit organizations by recognizing the services they provide throughout the year and to encourage members of our community to participate in volunteer opportunities,” Salinas said.\nThe occasion also included a symbolic walk stretching three blocks; beginning and ending at Cine El Rey on 17th street and was led by Rebecca Flores. Before the walk, Bert Guerra, co-owner and manager took to the podium at Cine El Rey and spoke about Flores to the people sitting in the audience.\n“Everybody in this room stands on her shoulders. You may not know her, but she dedicated her life to civil rights here in South Texas; to me she’s our Delores Huerta,” Guerra said.\nFlores, who now lives in San Antonio, was a former director of the Texas United Farm Workers. She first worked in San Juan, then moved and retired in Austin.\nDuring her tenure as director, she saw that farm workers lived in colonias because it was inexpensive.\n“In the 70s, they had no sewage, no running water, but it was their house,” Flores said. “What we do, is we would find leaders in each colonia and go to them and have a house meeting.”\nSimilar to LUPE, Texas UFW assists residents who live in poor living conditions and aim to better satisfy the way of living by providing utility services, such as light and water.\n“One of things that we hammered into everyone’s head was that the union was them and then when they decided that workers’ compensation was going to be the important issue for them, they were going to do all the work for it to pass,” Flores added.\nDuring her 30 years as director, she said, the legislation didn’t occur overnight, it took time to process and become a law.\n“I think it’s always good to tell people about what we did here and what the potential is for people when they get together to do stuff together and follow the examples of what we have before us of Martin Luther King Jr. and Cesar Chavez and what they showed us to work,” the 75-year-old said. “I think a lot of the times, people don’t think they have the power to do things, I think we gotta learn that in-fact we do have power.”\n“The thing is we can do it, we just need to set our mind, have our courage and be determined and not give up, but we can do it,” Flores said about fighting for beliefs.\nWith the day also being known as National Day of Service, approximately 15 local non-profits were in attendance asking for volunteers like La Unión Del Pueblo Entero, Donate Life Texas and The Homeless Period Project RGV.\nThe community engagement celebration was sponsored by The Historic Cine El Rey Theatre Foundation and community citizen volunteers.", "url": "https://apnews.com/1789da8e69984467adae0af916aafc67"}