{"authors": ["Lee Provostlprovost"], "date_download": "2020-05-04 20:20:48", "date_modify": "2020-05-04 20:20:48", "date_publish": "2018-02-08 16:18:20", "description": "WATSEKA — A special closed-session Watseka City Council meeting has been set for 9 a.m. Saturday at city hall for the purpose of discussing the current state of its water and sewer system and the...", "filename": "_9793ccc8552a4828a11fd4d4b93f109a_1588623648.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9793ccc8552a4828a11fd4d4b93f109a_1588623648.html", "title": "Special meeting for Watseka water system Saturday", "title_page": "Special meeting for Watseka water system Saturday", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WATSEKA — A special closed-session Watseka City Council meeting has been set for 9 a.m. Saturday at city hall for the purpose of discussing the current state of its water and sewer system and the future operations of these systems.\nMayor John Allhands said the meeting is not about any offer or sale of the system.\nThe city has contracted with ERH Enterprises, of Westville, a private firm which has managed the water and sewer system for the past 15 years. ERH have about 18 months remaining on its contract with the city.\nAll eight members of the Watseka City Council, Mayor Allhands and the city’s public works director are expected to attend Saturday’s meeting.\nThe system serves about 2,300 city accounts.\nThe aging system is in need of a substantial number of upgrades, officials note.\n“We need to educate ourselves first before we can present anything to the public and determine our options,” Allhands said.\nIn 2016, Aqua Illinois sought to buy the city’s water system and wastewater treatment plant for $10.5 million. The city did not move on the offer.\nAt the time of the Aqua discussions, it was noted there were an estimated $7.5 million of upgrades which needed to be completed within the next five years.", "url": "https://apnews.com/9793ccc8552a4828a11fd4d4b93f109a"}