{"authors": ["Emma Nelson"], "date_download": "2020-05-04 20:10:55", "date_modify": "2020-05-04 20:10:55", "date_publish": "2018-07-30 20:11:07", "description": "Housing, potholes, neighborhoods and trash collection took center stage at a City Council debate as St. Pauls Fourth Ward race got back on track Monday night after a tumultuous few...", "filename": "_bcd7b40c8f7746439d2bffa667d81e0f_1588623055.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bcd7b40c8f7746439d2bffa667d81e0f_1588623055.html", "title": "St. Paul Fourth Ward forum stays on track after tumultuous few weeks", "title_page": "St. Paul Fourth Ward forum stays on track after tumultuous few weeks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Housing, potholes, neighborhoods and trash collection took center stage at a City Council debate as St. Pauls Fourth Ward race got back on track Monday night after a tumultuous few weeks.\nCandidates Shirley Erstad and Mitra Jalali Nelson, the two front-runners, stuck to their campaign messages and expressed similar views about the need to build more affordable housing, improve police-community relations and for the City Council to support the citys district councils.\nThey differed on the idea of a $15 minimum wage Nelson has supported it from the start of her campaign, while Erstad said shes waiting for the city to finish studying the issue before delving into the details.\nThis is a very complicated issue that we need to get right for our city, said Erstad, 51, executive director of a parks nonprofit.\nTheir wards race has been roiled in recent weeks by the personal behavior of fellow candidate David Martinez. He asked that the audience not view him through the lens of the past few weeks a series of incidents that represent a small fraction of his life, he said.\nPlease, dont judge me on eight one-millionths of my existence on this planet, he said. Ive spent more time doing, like, everything else than what youve seen in the news over the last three weeks.\nThe three are vying for the City Council seat representing St. Pauls Fourth Ward, which former Council President Russ Stark left this year after a decade in office. The special election will be held Aug. 14.\nThe Fourth Ward includes Hamline-Midway, Merriam Park, St. Anthony Park and parts of the Mac-Groveland and Como neighborhoods.\nAbout 100 people packed into the candidate forum hosted by the St. Paul League of Women Voters at the St. Paul Neighborhood Network television studio. Sarah Risser of the voters league moderated the debate.\nErstad and Nelson, 32, a staffer for U.S. Rep. Keith Ellison, also differed on ideas about development on University Avenue, near Allianz Field. While Erstad said she wants a balanced approach to development that keeps in mind the surrounding residential neighborhood, Nelson said shes ready for more vibrant nightlife.\nIm running because I want to help us grow our city and be a leader for a future where we have that variety of things that we can do, she said.\nMeanwhile, Martinez, 38, who has no political experience, gave increasingly combative responses to questions, including repeated attacks on Starks record.\nDuring the first week of July, Martinez was banned from the St. Paul library system and Target Field after altercations with security officers. Two weeks ago, he was arrested and held in Ramsey County jail after a seminude photo of his estranged wife appeared on his campaign website, along with a link to a restraining order she filed against him. Martinez told the Star Tribune he believes his website was hacked. Charges have not been filed.\nFollowing that incident, the University of St. Thomas canceled a candidate forum scheduled for the evening of July 18. Martinez has said he plans to stay in the race and he continues to campaign, despite calls from Erstad, Nelson and Mayor Melvin Carter that he drop out.\nMany of Martinezs answers to questions Monday evening referred back to the recent incidents, sometimes drawing uncomfortable murmurs from the crowd. When asked about affordable housing, he said there is no crisis in St. Paul, saying he was recently able to find an apartment within 24 hours.\nWhen asked about police-community relations, he spoke about his time in the Ramsey County jail, saying they treat you like an animal.\nWhile Erstad and Nelson arrived to the forum early to chat with constituents, Martinez walked in shortly before the forum began. Outside, Erstads bright blue lawn signs and Nelsons hot pink ones stood on every spare bit of lawn.\nErstad and Nelson are DFLers with backgrounds tied to the partys old and new guard. Erstad is a longtime St. Paul resident and homeowner whose endorsements include former St. Paul Mayor George Latimer and City Council Member Jane Prince. Nelson is a two-year resident and a renter endorsed by the DFL and Carter.\nEmma Nelson 612-673-4509", "url": "https://apnews.com/bcd7b40c8f7746439d2bffa667d81e0f"}