{"authors": ["Dave Mackall"], "date_download": "2020-05-04 20:28:19", "date_modify": "2020-05-04 20:28:19", "date_publish": "2018-03-08 09:10:40", "description": "With his father — former Steelers quarterback Mike Tomczak — watching from a station as operator of the penalty box at Nevin Arena, Beau Tomczak put an end to a marathon, scoreless playoff...", "filename": "_278f39624c5040d4b62af83744d09dc0_1588624099.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_278f39624c5040d4b62af83744d09dc0_1588624099.html", "title": "Tomczak nets overtime winner to lead Quaker Valley past Latrobe", "title_page": "Tomczak nets overtime winner to lead Quaker Valley past Latrobe", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With his father — former Steelers quarterback Mike Tomczak — watching from a station as operator of the penalty box at Nevin Arena, Beau Tomczak put an end to a marathon, scoreless playoff game.\nTomczak’s overtime goal Wednesday night at 2 minutes, 20 seconds sent Quaker Valley past Latrobe, 1-0, and into the semifinals of the of the PIHL Class 2A Penguins Cup playoffs.\nIt was the second OT result in as many playoff games for the Quakers (10-10), who will face Pine-Richland in the semis next Wednesday at RMU Island Sports Center.\nTomczak’s goal, a wrist shot from an awkward angle, snuck through the short side of the net past Latrobe goaltender Gage Handwork. The puck clanged the post before entering the goal and bouncing back out.\nLatrobe briefly disputed the goal, but both teams then headed to the postgame handshakes.\n“That goal was definitely in. The ref made a good call,” Latrobe coach Josh Werner said. “He was in perfect position, and we had a picture of it from someone who was behind the net. He’s a great ref, and he made the right call.”\nThe victory avenged a 7-0 loss in the regular season to Latrobe (13-7) and got the Quakers even with the Wildcats in the postseason the past two years after Latrobe got the best of Quaker Valley in a playoff game last year.\n“It was a big goal for a player who missed two months of the season,” Quaker Valley coach Kevin Quinn said. “We’ve had a ton of injuries this season. We played the last regular-season game with nine skaters and finished with eight.”\nTomczak, who was sidelined with a broken collarbone, returned to the Quakers lineup on Monday to score a goal and assist on another in a 4-3 first-round, overtime victory over Shaler.\n“It’s a great feeling to score this goal in such a dramatic way tonight, especially after missing two months,” Tomczak said.\nIt didn’t hurt that his dad witnessed it, either.\n“You bet,” Tomczak said with a smile at the mention of his father, who played for the Steelers from 1993-99.\nBoth goalies — Handwork and Quaker Valley’s Philip Gagne — played superbly, each facing 22 shots. Gagne turned aside a number of quality Latrobe scoring opportunities, particularly early in the game.\n“We had a plan,” Quinn said. “We gave up so many goals during the season. We’ve wanted to correct that, and having some of our big guys back who weren’t with us for so long really gave us a lift. That is a good team over on that side. We didn’t score much — their goalie is really good — but we didn’t give up much, either.”\nQuaker Valley’s Josh Bemis nearly scored twice late in the third period and once in overtime, but Handwork was up to the challenge both times.\n“Both goaltenders are excellent and played excellent tonight,” Werner said. “It’s sad to go out that way, but both teams played a great game.”\nDave Mackall is a freelance writer.", "url": "https://apnews.com/278f39624c5040d4b62af83744d09dc0"}