{"authors": ["Jeff Himler"], "date_download": "2020-05-04 20:13:52", "date_modify": "2020-05-04 20:13:52", "date_publish": "2018-03-29 00:23:21", "description": "Westmoreland County Industrial Development Corp. has been awarded $1.7 million in state transportation funding to improve about 3 miles of track at the northern end of the rail system it owns...", "filename": "_652f125ad98d4d208ab27bd6669d1cc4_1588623232.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_652f125ad98d4d208ab27bd6669d1cc4_1588623232.html", "title": "Westmoreland County Industrial Development Corp. awarded $1.7M for rail work", "title_page": "Westmoreland County Industrial Development Corp. awarded $1.7M for rail work", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Westmoreland County Industrial Development Corp. has been awarded $1.7 million in state transportation funding to improve about 3 miles of track at the northern end of the rail system it owns serving businesses between Hempfield and Connellsville.\nIt is among 27 rail freight improvement projects across the state that collectively will receive $32 million through the Rail Transportation Assistance Program and the Rail Freight Assistance Program, Gov. Tom Wolf announced Tuesday.\nThe local rail line, which is owned by WCIDC and operated by Southwest Pennsylvania Railroad, will be improved along a portion of the Radebaugh subdivision — between the junction with the Norfolk Southern Railroad at Radebaugh, in Hempfield, and Southwest Greensburg — according to PennDOT spokesman Rich Kirkpatrick. Jointed rail will be replaced with continuous welded rail as part of replacement of the line’s rail and steel components.\n“The age and condition of the existing (rail) infrastructure is such that it needs (to be) replaced,” said Jason Rigone, executive director of WCIDC. “It’s limited in weight capacity, and it certainly has deteriorated.”\nThe pending work represents the fourth phase of improvements that have been made along the main line with the assistance of state funding. About 8 miles of track were updated in the previous phases, Rigone said.\n“Making these upgrades along the main line in different sections is a strategy we’ve incorporated over the last four or five years,” he said. “The result is a safer, more reliable system.”\nHe said WCIDC will work with the rail operator to identify other sections of track that may need to be addressed.\n“Keeping our extensive rail freight system in good shape is a vital component of creating a sound foundation for Pennsylvania’s economy,” Wolf said in his announcement.\nPennDOT notes it works with private rail operators to help maintain and improve the roughly 5,600 miles of freight lines in the state. Pennsylvania has 67 operating railroads, more than any other state.\nJeff Himler is a Tribune-Review staff writer. Reach him at 724-836-6622, jhimler@tribweb.com or via Twitter @jhimler_news.", "url": "https://apnews.com/652f125ad98d4d208ab27bd6669d1cc4"}