{"authors": ["Staff Reports Editorial Aikenstandard.Com"], "date_download": "2020-05-04 20:08:29", "date_modify": "2020-05-04 20:08:29", "date_publish": "2018-05-04 20:30:00", "description": "The registration deadline for the Aiken-Augusta Wounded Warrior Charity Golf Classic is coming up soon. The ninth annual Aiken-Augusta Wounded Warrior Charity Golf Classic will be held...", "filename": "_f4dc9fbe4c5b440eaa04d14daf039ff6_1588622909.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f4dc9fbe4c5b440eaa04d14daf039ff6_1588622909.html", "title": "Registration deadline approaching for Aiken-Augusta Wounded Warrior Charity Golf Classic", "title_page": "Registration deadline approaching for Aiken-Augusta Wounded Warrior Charity Golf Classic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The registration deadline for the Aiken-Augusta Wounded Warrior Charity Golf Classic is coming up soon.\nThe ninth annual Aiken-Augusta Wounded Warrior Charity Golf Classic will be held Monday, May 14, at Woodside Plantation Country Club, 1000 Woodside Plantation Drive.\nJack Morrison, chairperson of the tournament, said the tournament is now open for player registration and sponsorships. The deadline for golfer registration is Monday, May 7.\nMore than $38,000 was raised to assist local veterans in need through last year’s efforts, including green/cart fees, sponsorships, other smaller events and individual donations, according to a news release.\nThis annual, all-volunteer event was founded by local alumni of the nation’s service academies and is now organized and run by service academy alumni and other community spirited volunteers, according to the release.\n“This is a local event, and we are an independent 501-3c nonprofit that is not associated with the national or other local Wounded Warrior Projects,” Morrison said in the release. “All staffers are volunteers and work on an unpaid basis that permits all net proceeds of the event go directly to support wounded warriors in the Aiken-Augusta area and their families.\n“Since inception, we have raised approximately $300,000 for wounded warriors and other veteran initiatives right here in the CSRA. Our goal for 2018 is to match the number of golfers (240 is max) and substantially increase the total dollars raised in 2017.”\nJanney Financial is the Presenting Sponsor of this event for the fifth consecutive year.\nA recent letter from USC Aiken’s Vice Chancellor for Advancement and External Affairs Mary Driscoll, is an example of the tournament’s results.\nShe wrote, “On behalf of USC Aiken, we want to thank the Aiken-Augusta Wounded Warriors for your generous gift to our Veteran and Military Success Center. This year, $16,500 will be credited to the Wounded Warrior Golf Classic Bridge the Gap Veteran Scholarship. We appreciate your generosity. You are making a difference in the lives of our military, veterans and dependents, who now represent approximately 436 students, or over 12 percent of our student body.”\nIn addition, the committee was a major scholarship donor at Aiken Technical College’s 2018 spring awards evening by providing $7,500 in aid to veteran students and is the presenting sponsor to the Camp Gravatt’s Christmas Family Retreat for at risk service families.\nInterested sponsors for this year’s tournament should email info@AAWWGolf.com for additional information and forms.\nTo register for the tournament, call Jack Morrison at 803-295-2614 or email jackmorrison59@outlook.com .", "url": "https://apnews.com/f4dc9fbe4c5b440eaa04d14daf039ff6"}