{"authors": ["Matthew Whoolery"], "date_download": "2020-05-04 20:31:57", "date_modify": "2020-05-04 20:31:57", "date_publish": "2018-07-08 11:31:00", "description": "Placebos have probably been around for about as long as humans have had the capacity for thought and belief. Placebo research in medicine has also been around for decades, surprising us all with...", "filename": "_fddd77455a9249b98acc30ab568a72cd_1588624317.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fddd77455a9249b98acc30ab568a72cd_1588624317.html", "title": "Placebo Power!", "title_page": "Placebo Power!", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Placebos have probably been around for about as long as humans have had the capacity for thought and belief. Placebo research in medicine has also been around for decades, surprising us all with the power of our beliefs that something can help us feel happier, healthier, or more energetic. But some recent research in psychology and medicine have produced some very surprising results.\nA placebo is defined as a treatment or procedure that has no direct psychological or health benefits. The most commonly used placebo is an inert pill, usually made of cellulose and other ingredients that have no effect on the body. We know that these pills can work for a surprising number of ailments, including psychological problems and pain.\nThe decades-long research on the power of placebos in treating depression and anxiety, for example, has shown that in most cases an inert pill believed to be a drug is as effective as the drug itself. To put it more simply, believing you are taking an anti-anxiety pill seems to be as effective as taking the actual drug.\nThe research on the power of placebos in the treatment of pain or depression has been around a long time and is increasingly unsurprising. But a some new paths of research have been eye-opening if not shocking. One of these is the fact that the placebo effect is more widespread than we have previously thought, and effective for more things than we anticipated.\nFor example, there has been a lot of research on the use of placebo surgeries for certain kinds of knee pain or back pain. The BBC documentary, Placebo: Cracking the Code, follows the research on so-called “sham surgeries” for certain kinds of knee pain.\nThe patients know that the surgery they receive might be a placebo, but they are treated in all ways the same as a normal patient. The rituals of showing up at the hospital, putting on a gown, getting an IV, receiving anesthesia, incisions, and stitches all stay the same. The only thing they don’t get is the actual surgical procedure. Amazingly, the sham surgery for particular kinds of knee pain, particularly on the meniscus, works just as well as the actual surgery!\nThis means that the placebo effect is not only effective for things that are all, or primarily, “in your head.” Believing that you got surgery seems to be just as effective as surgery itself for certain ailments. This sham surgery placebo effect also seems to be effective for certain kinds of back surgery as well. The rituals seem to be important, setting up the mind for the belief that the treatment is actually taking place. In some of the placebo surgery studies, they even show the patient videos of the surgery being done, but it is a film of the surgery being done on someone else’s knee!\nThe placebo effect actually seems to get stronger the more invasive the procedure. A pill works well, injections work even better, incisions and surgery even more than that. The placebo effect also seems to be getting more powerful, particularly for Americans. People taking pain-relief placebos are getting greater and greater relief over the years. According to research published in The Journal of the International Association for the Study of Pain in 2015, people taking placebos for pain now receive a significantly greater benefit than people taking placebos even as recently as the late 1990s.\nAll of the research I have cited so far assumes that we fool the patient. While they may know that they are in a study that may give them a placebo, we have often assumed that fooling a patient is part of how placebos work—that they “think” that they are taking a real drug or getting a real surgery. However, more recent research even challenges this part of the placebo effect. These studies are called “open label placebo” (OLP) research. This means that the patient is told that they are taking a placebo. It is even put on the label of the pill bottle.\nThe largest OLP study was on Irritable Bowel Syndrome at Harvard Medical School in 2010. The patients were given placebo pills that were clearly labeled as such. The patients in this study experienced a decrease in pain, less severe IBS symptoms, and a higher quality of life. Another major study done in Portugal in 2016 found that OLP worked effectively for patients with lower back pain. They experienced a significant reduction in pain, higher overall quality of life, and a very large reduction in disability (more of them were able to return to work and a normal life). Other studies have shown the OLP procedure to work for psychological problems as well.\nWhat does all this mean? It means that we have an enormous belief in medicine to help us in our lives. We have a powerful faith that medical treatments, including pills and surgeries, will help us to feel better. Next week I will write about how you might apply this research on placebos to your own life. Placebo Power!\nMatthew Whoolery holds a doctorate in psychology and is an instructor at Brigham Young University-Idaho. He can be reached by email at drwhoolery@gmail.com.", "url": "https://apnews.com/fddd77455a9249b98acc30ab568a72cd"}