{"authors": ["Deron Snyder The Washington Times"], "date_download": "2020-05-04 20:17:30", "date_modify": "2020-05-04 20:17:30", "date_publish": "2018-01-22 16:30:17", "description": "Baseball's hot stove might as well be a deep freezer this offseason. Based on CBS Sports' ranking, eight of the top 10 and 12 of the top 20 free agents remain unsigned with spring training a...", "filename": "_cf0e83dd80cd0fa8745f8d6bc0b27f5b_1588623450.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cf0e83dd80cd0fa8745f8d6bc0b27f5b_1588623450.html", "title": "Mike Rizzo's wait could end up costing Nationals", "title_page": "Mike Rizzo's wait could end up costing Nationals", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Baseball’s hot stove might as well be a deep freezer this offseason.\nBased on CBS Sports’ ranking, eight of the top 10 and 12 of the top 20 free agents remain unsigned with spring training a few weeks away. The word “collusion” has reared its ugly head as players who expected to break the bank J.D. Martinez, Yu Darvish and Eric Hosmer among them wait impatiently by the phone.\nThe calls will come, eventually, though for a variety of reasons, the dollars could be fewer than expected.\nMany of the top free agents are older with worrisome injury histories. Agent Scott Boras controls an inordinate slice of the top tier. Additionally, lots of teams are either tanking/rebuilding, enjoying their revenue-sharing profits without trying to compete, or waiting for next year’s mind-boggling free-agent class.\nThose factors undoubtedly contribute to the slow pace of signings. Another is front offices’ growing reliance on analytics, which are less-than-flattering when applied to several of this crop’s leading names. So instead of prices continuing to rise unabated, regardless of who’s available, the market is undergoing a slight correction.\nIn short, teams appear to be wising up.\nUnless we’re talking about the Washington Nationals.\nBryce Harper could sign the largest contract in MLB history next year, with the deep-pocketed Dodgers, Cubs and Yankees on the list of possible suitors. A 25-year-old with Harper’s hardware (NL Rookie of the Year and MVP trophies) and still-untapped potential has never hit the market.\nBut the right fielder might not be Washington’s most important free agent.\nThat distinction could fall on the team’s architect, general manager Mike Rizzo, whose contract also expires in 2018. The Nationals have yet to discuss an extension.\n“Mike has been an integral member of our organization for the last decade and we feel fortunate to have him leading our baseball operations,″ owner Mark Lerner said last week in a written statement to USA Today. “He and his staff have worked diligently to build our organization into one of Major League Baseball’s perennially elite clubs.\n“Mike’s contract will be addressed in the normal course of business as we have done in the past.”\nThat’s great.\nBut it doesn’t change the fact that Washington’s “normal course of business” is a bit wacky, maybe enough to understand if Rizzo wants to test the waters instead of re-upping. For a change, he could leave ownership dangling like the Lerners have done to him.\nThe 2015 season was underway before the team finally picked up Rizzo’s two-year option. The wait defied explanation.\nHe certainly earned his keep by building a squad that won two NL East crowns in three years. He had proven to be a shrewd dealmaker, fleecing his peers in moves that landed Wilson Ramos, Gio Gonzales, Denard Span, Joe Ross and Trea Turner. Rizzo’s draft picks fortified the roster, either on the field or via trades.\nHowever, there was no pay raise for his good work. There was no decline in ownership’s interference. And now, three years later, there’s still no job security, despite Washington owning the second-most wins in MLB since 2012.\nGranted, the four division titles haven’t translated to postseason success. And the next playoff series victory will be the first. But several clubs gladly would sign up for Washington’s “failure” under Rizzo.\n“I’m so proud of what we’ve accomplished here,” he told USA Today. “I like it here. I love the city. I love the team I put together. I like being a GM in the NL East. And I want to stay here. I just think I deserve to be treated like some of the best GMs in the game are, too.\n“No, we haven’t won a World Series, and in the real world regular-season stats don’t mean [expletive]. But you look at our consistency of excellence, knowing what it takes to win, and I think we’ve exemplified that.\n“We’re pretty damn good at what we do.″\nCan’t argue with that assessment. The World Series is a goal, not a guarantee, though the Lerners pressured rookie manager Dave Martinez to deliver one.\n“We have something in common and that is the desire and passion to bring a world championship to Washington,” Martinez said at his introductory news conference in October. “We’re going to get it done.”\nNext season might be Washington’s best chance yet with the cooperation of health and luck.\nBut moving forward, if 2018 is Rizzo’s final season here, the Nats will have a bigger problem than Harper’s possible departure.\nBrooklyn-born and Howard-educated, Deron Snyder writes his award-winning column for The Washington Times on Tuesdays and Thursdays. Follow him on Twitter @DeronSnyder.", "url": "https://apnews.com/cf0e83dd80cd0fa8745f8d6bc0b27f5b"}