{"authors": ["Tom Davidson"], "date_download": "2020-05-04 20:16:37", "date_modify": "2020-05-04 20:16:37", "date_publish": "2018-09-01 06:55:55", "description": "A scathing grand jury report released Aug. 14 on child sex abuse by clergy in six Pennsylvania Roman Catholic dioceses included 99 priests in the Pittsburgh diocese. Six of the priests named...", "filename": "_ac58220823bb4bf6953eb3c6d950caf5_1588623397.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ac58220823bb4bf6953eb3c6d950caf5_1588623397.html", "title": "Six priests named in grand jury report served in Sewickley; eight more served in Ambridge", "title_page": "Six priests named in grand jury report served in Sewickley; eight more served in Ambridge", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Six priests named in grand jury report served in Sewickley; eight more served in Ambridge\nA scathing grand jury report released Aug. 14 on child sex abuse by clergy in six Pennsylvania Roman Catholic dioceses included 99 priests in the Pittsburgh diocese.\nSix of the priests named report served in Sewickley and another eight served in Ambridge. It is unclear from the report if the allegations of abuse occurred during their time here.\nThe priests who served in Sewickley:\nBURCHIANTI, LEO - (deceased; 1939-2013)\nAlleged to have had inappropriate contact with at least eight boys between 1967 and 1993. The allegations ranged from providing boys with alcohol or allowing them to use drugs in the rectory to having sex with them. He also admitted to having sex with the mother of at least one of the victims. The diocese provided $24,000 to cover counseling costs of one victim and a $15,000 settlement to another. He retired in 1995 and withdrew from ministry in 2013.\nBurchianti served at St. James from May 1973 through December 1978.\nCAUTELA, MAURO JAMES - (deceased; 1948-2005)\nAlleged to have inappropriately touched three young and used church donations and other funds to further some of his relationships with young boys and purchase homosexual pornography on church computers.\nOne victim said Cautela sexually abused him between 1998 and 2005 when he was between 12 and 19 years old. He said Cautela had befriended him during a very difficult time in his life. There was a state police investigation and the FBI had prepared to file charges but Cautela died of a heart attack in 2005.\nCautela served at St. James from August 1983 throguh April 1984.\nHUBER, JOHN J. (deceased; 1942-1998) - Alleged to have sexually assaulted a boy in the late 1960s or early 1970s. Allegations referred to the District Attorney.\nSummary: In March 2009, a man reported to the Diocese of Pittsburgh that he’d been abused by Huber when he served at St. Canice Church. When the man was in fourth or fifth grade, he told Huber during confession that another priest had touched his genitals. Huber suggested one-on-one counseling during which he allegedly performed oral sex on the boy and gave him $20. Allegedly happened multiple times.\nDiocese sent a letter to the Allegheny County District Attorney’s Office on March 30, 2009.\nHuber served at St. James from May 1979 through May 1983.\nMCKENNA, THOMAS - (deceased: 1935-unknown)\nDiagnosed with an attraction to teenagers, McKenna was accused of sexually assaulting at least four people, including an inmate at SCI Pittsburgh while the inmate was incarcerated. A lawsuit was filed against McKenna in that case in October 1999.\nRecords contain a July 1992 letter written by an unidentified priest about sexual allegations made against McKenna, which noted that two teenage brothers claimed to have been sexually assaulted by him in the 1970s. An October 1996 Diocesan memorandum documented the fact that McKenna was confronted with several allegations of improper sexual activity. In May 2002, the Diocese received a report from a woman who stated that McKenna had sexually abused her son in 1975.\nMcKenna served at Sewickley Valley Hospital from September 1986 though June 1987.\nRHODEN, RAYMOND R. - (deceased; 1950-2006)\nAlleged to have sexually abused a boy multiple times at his home between 1976-77.\nThe parents reported the abuse to diocese officials in 2002. They said they previously reported the allegations to Bishop John McDowell, but never heard from him. Rhoden admitted to diocesan officials that he sexually abused the boy.\nMcKenna served at St. James from June 1997 through May 2002.\nSORENSON, BARTLEY A. (deceased; 1949- unknown) -- Serving a 97 month federal prison term after pleading guilty to child pornography charges in 2012.\nSummary: A woman caught Sorenson viewing child pornography on his office computer and made a report to the diocese, which placed him on administrative leave and removed his priestly faculties.\nSorenson served at St. James from June 1983 through January 1985.\nServing in Ambridge were:\nBAUER, JOHN M. - (born 1953)\nAllegedly provided boys of unspecified age with alcohol, wrestled with them and talked about masturbation around them. Bauer denied providing the boys with alcohol. The allegation was forwarded to the Washington County District Attorney’s Office.\nBauer served at Good Samaritan from June 1994 until February 1998.\nDEMSHER, FERDINAND B. - (deceased; 1914-1983)\nAlleged to have abused five children in the 1960s and 1970s while he served at St. Mary of the Assumption, Catholic Central High School, Resurrection and on a trip to Wildwood, New Jersey.\nSummary: Demsher is accused of having the children take off their clothes, fondling them and having them touch him. The diocese notified the Allegheny County District Attorney’s Office of the two of the allegations and provided financial assistance to two of the victims.\nDemsher served at Christ the King from June 1947 through May 1949.\nJUSTI, MARVIN (deceased; 1933-2009) - Allegedly sexually harassed a woman from her teenage years until the 1980s.\nIn August 2016, a woman said that she cared for Justi at Sewickley Valley Hospital as a teenage nursing student, indicating he became aroused during a sponge bath and insisted she wash his genitals. In 1982, Justi sought physical therapy at an Ambridge facility where the woman worked. Allegedly undressed and refused to put his clothes on. In 1985, he went to her house unannounced and she allowed him inside. Allegedly went to the restroom and came out naked and freshly shaven. Records contained little to no documentation of an investigation.\nJustic served at St. Cecilia from 1980 through 2002.\nKACZMARCZYK, BERNARD (deceased; 1929-unknown) - Abused three brothers in the early 1990s at a Donora rectory and at his Florida home where they lived for several years. Suspended in 1998.\nA woman reported in 1994 reported that Kaczmarczyk sexually abused her three nephews beginning in at least 1992, and he had been a lifelong family friend. One boy once awoke to find Kaczmarczyk performing oral sex on him. The children and their mother moved to Florida with him, and the mother left the two oldest with him when she moved home. He made one boy make a “Consecration to the Mystical Rose” and had him wear a rosary ring on his left hand. Wanted the boy to renew vows every year, gave him wine to help him sleep and did not want him looking at girls.\nKaczmarczyk served at St. Stanislaus from September 1967 through August 1968.\nPINDEL, PAUL E.- (deceased; 1924-1991): Alleged to have sexually abused multiple children from the late 1950s to the 1980s.\nThe Diocese received multiple reports of the abuse over several years. The Diocese offered one victim who came forward in 2011 assistance in finding counseling services and provided reimbursement for treatment.\nPindel served at St. Stanislaus from June 1951 to November 1952.\nREBEL, JOHN W. - (deceased; 1937-2013)\nAlleged to have sexually assaulted a boy in the 1970s at the boy’s home after a “home mass.”\nParents of the boy met with diocese officials in 2009 after their son had died and reported their son told them about the abuse years after it happened. Rebel denied the allegations. The diocese in 2009 gave the Allegheny County District Attorney’s Office information about allegations made against priests and included those against Rebel.\nRebel served at St. Veronica from June through August 1967.\nROMERO, MICHAEL C. - (deceased; 1937-2000)\nAlleged to have abused a minor at Immaculate Conception church and school.\nThe victim reported Romero abused him through grade school and his freshman year at high school, encouraging him to drink alcohol and giving him gifts that included a ski jacket and sweat suit. At one point Romaro allegedly took him to Cleveland and got him so drunk that he couldn’t remember what happened. Another time, Romaro allegedly took him to a racetrack and bought him alcohol. The victim said he’s struggled with alcohol and drug addiction throughout his life.\nRomero served at St. Veronica from July 1982 through May 1985.\nWICHMANOWSKI, JOSEPH S. (deceased, 1919-1977)\nWhile at St. Stanislaus Parish in Ambridge, Wichmanowski allegedly provided a girl, starting at the age 12, with church wine and forced her to perform sexual acts on him and made her dress provocatively. The victim alleged that he invited her to New York where he wanted to impregnate her. The victim and 31 other victims of alleged abuse were part of a settlement with the church for payments totaling $1.2 million.\nService history:\nWichmanowski served at St. Stanislaus from December 1952 through May 1957 and again in 1969.\nThe Pennsylvania Attorney General has a hotline for victims: 888-538-8541 and a website for the report: https://www.attorneygeneral.gov/report/\nThe Pennsylvania Department of Human Services also has ChildLine to report suspected child abuse by phone at 800-932-0313.\nOther resources for people who have been victims of sex abuse are available from the.\nDiocese of Pittsburgh: website or hotline: 888-808-1235.", "url": "https://apnews.com/ac58220823bb4bf6953eb3c6d950caf5"}