{"authors": ["Jacky Davis", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Rebecca Kolins Givan", "Adam Gaffney"], "date_download": "2020-05-04 19:56:04", "date_modify": "2020-05-04 19:56:04", "date_publish": "2018-01-23 00:00:00", "description": null, "filename": "2018_01_uk-national-health-service-privatization-austerity_1588622164.html", "image_url": "https://images.jacobinmag.com/2018/01/23101219/nhs.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_01_uk-national-health-service-privatization-austerity_1588622164.html", "title": "Disaster Capitalism in the NHS", "title_page": "Disaster Capitalism in the NHS", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "When news of the current crisis in the English National Health Service (NHS) reached the United States, the New York Times asked its readers about their experiences with the British health system. The answers from the UK poured in via social media: “The NHS saved my sight and gave me everything I have today.” . . . “My mum had the best critical care, we never once needed to worry if we could afford it” . . . “It’s an incredible service” . . . “The best thing the UK government has ever done.”\nDespite the current crisis, the British love the NHS. It’s our most popular institution, more popular even than the royal family. But it wasn’t always like this. In prewar Britain, health care was provided by a patchwork of private insurance schemes, voluntary hospitals, or by charities. I’ve heard heart-breaking stories firsthand of women dying in childbirth and children dying of preventable diseases, simply for lack of money. Illness caused major financial problems for many families, some of whom simply couldn’t afford any care at all.\nIn the aftermath of World War II, there was a strong feeling in the UK that, having won the war, the population was not going to lose the peace — a mood conveyed beautifully in Ken Loach’s 2013 documentary The Spirit of ‘45. When it came to health care, Britons weren’t prepared to return to the bad old ways, and the stage was set for the postwar Labour government to introduce a national health service in 1948.\nIn 2018, it will be seventy years since the NHS was introduced, and while it has gone through many changes it still by and large lives up to its original aims — a health service available to all regardless of wealth, comprehensive, universal and free at the point of delivery, financed from taxation. People pay in according to their means and use it according to their clinical need.\nSo why is the NHS now faced with such severe problems that the Red Cross recently declared that the service was facing “a humanitarian crisis”? As Colin Leys and Stewart Player wrote in their 2011 book The Plot against the NHS, the roots of the crisis lie in the past two decades: “Since 2000, governments have pursued a policy for the NHS that the electorate hasn’t voted for and doesn’t want.” Politicians and private interests worked patiently behind closed doors to transform the NHS from an integrated public service into a mere branding device attached to a series of competing providers.\nPoliticians increasingly made cause with the private sector, opening the door to commercial interests through step-by-step reforms, each of which concealed its true purpose in language with which we have become only too familiar — patient choice, modernization, contestability and plurality of providers. Politicians hardly ever use the word “market” and have always denied their intention to privatize. When the jigsaw pieces are fit together, the picture that emerges is of a popular and effective public service betrayed by corporate greed and political dishonesty.\nBoth Conservative and Labour governments have pursued market-based reforms, including the widespread use of public-private building partnerships — known as Private Finance Initiative (PFI) programs (now exposed as a very costly mistake) — and an expansion of private-sector involvement in delivering NHS care. The numerous “reforms” needed to bring about these changes have resulted in the NHS undergoing a “redisorganization” almost every two years. There has been no time to allow reforms to bed down or for staff to adapt before the next reform is imposed. The irony is that the reorganizations often seek to deal with problems arising from the last ill-thought-through changes.\nUntil recently, the biggest challenge the NHS faced was the ideological position, embraced by both political parties, that the private sector would deliver care more cheaply and more efficiently than the public sector, and that competition with the private sector would improve the NHS. As a result, governments introduced a “market” into the NHS, with compulsory tendering of contracts to competing providers (including the NHS itself). The private sector’s deep pockets and experienced lawyers meant that last year they were awarded 70 percent of tendered contracts. But while they’re expert at winning government contracts, they are not so good at delivering them. Since it’s the first legal duty of private companies to make a profit, we shouldn’t be surprised when they are discovered putting profits before patients.\nThe recent spectacular collapse of Carillion, a huge private company responsible for delivering many public service contracts, has illustrated the dangers of outsourcing vital public services to the private sector. Public services such as health care and prisons cannot be allowed to fail — if the private company contracted to deliver them goes under then the state has to step in. The Conservatives have still not admitted how much the Carillion debacle will cost the taxpayer, but the figure of “hundreds of millions” is being quoted.\nThe truth about these companies is that they privatize the profit and socialize the risk, leaving the taxpayer with the bill when they go under but ensuring that senior staff will look after themselves even while their workers’ pensions are threatened: when Carillion’s collapse was first reported, the former chief executive, the finance chief, and the directors had arranged to be paid huge salaries and benefits for months to come, although public outcry has now put a halt to that.\nFor reasons of ideological purity (and the desire to keep big donors on side) the Conservative government continues to award large NHS contracts to the private sector. Indeed, they may be nervous about not awarding them contracts: Virgin, which recently lost a contract to deliver care in Surrey, successfully sued the NHS for an undisclosed sum (rumored to be over £2 million), payable once again by the long suffering taxpayer.", "url": "https://www.jacobinmag.com/2018/01/uk-national-health-service-privatization-austerity"}