{"authors": ["Erica Moser"], "date_download": "2020-05-04 20:06:45", "date_modify": "2020-05-04 20:06:45", "date_publish": "2018-12-17 05:00:01", "description": "In a recent survey KeyBank conducted of 300 middle-market companies, 24 percent of respondents said they are experiencing a positive impact from federal tariffs while 34 percent have felt a...", "filename": "_90c564571e0244dd8664c09ced8166dd_1588622805.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_90c564571e0244dd8664c09ced8166dd_1588622805.html", "title": "KeyBank survey of middle-market companies shows more negative impact from tariffs than positive", "title_page": "KeyBank survey of middle-market companies shows more negative impact from tariffs than positive", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In a recent survey KeyBank conducted of 300 middle-market companies, 24 percent of respondents said they are experiencing a positive impact from federal tariffs while 34 percent have felt a negative impact, with the remainder seeing no impact.\n“It just causes a little bit of turmoil, a little bit of uncertainty, a little bit of planning,” said the bank’s Connecticut/Western Massachusetts Market President Jeff Hubbard in a phone interview with The Day.\nHe added that with lots of job openings and “tremendous opportunities” in southeastern Connecticut, “we need to have the most confidence we can.”\nKeyBank has branches in 15 states, including Connecticut, and the survey garnered responses from middle-market businesses — 4 billion companies — across the country.\nOf the third that indicated a negative impact, half said they intend to raise prices on their products over the next six months, while 36 percent plan to reduce profit margins and 33 percent will find alternative suppliers. The report noted that “fierce competition” prohibits some companies from increasing prices.\nOf those who expressed a negative impact, 68 percent reported seeing an increased cost of raw materials, 26 percent experienced longer order fulfillment times for raw materials and 29 percent found less demand for exporting.\nThose who experienced a positive impact mainly point to higher revenues/profits, and 54 percent said they will therefore increase capital/growth investments. Mike McKay of KeyBank Agribusiness said the tariffs have created some new markets.\nThe report stated, “Because of these tariffs, U.S. steel makers will benefit from being able to raise their prices/margins, but other companies using these imported metals will, in the short term, face higher costs and potentially lower profits.”\nAs other countries have retaliated against President Donald Trump’s tariffs on steel and aluminum with agricultural tariffs, there is less demand for some commodities, the report noted.\nThis has forced U.S. suppliers to find other buyers, who may be purchasing at lower prices. McKay noted that soybeans and pork have been particularly hard-hit, because of the large export volume to China.\nStill, the companies surveyed expressed a positive outlook on the economy, with 63 percent expecting the national economy to be excellent or very good, and 68 percent saying they plan to expand in the next six months.\nHubbard said KeyBank did the survey because it is “constantly trying to educate our customer base, [to] get our fingers on the pulse of what’s happening in various markets.” For example, he said, people at KeyBank consider themselves to be experts in industries such as solar energy, chemicals and food processing.\n“I think our customers are always starving for information on a national scale,” he said. The bank also wants to demonstrate that it understands the issues businesses face.\nThe survey came from 300 six-minute online interviews conducted between Sept. 4 and Sept. 12. All of the respondents have an executive or senior management role, and are involved in financial decision-making.\ne.moser@theday.com", "url": "https://apnews.com/90c564571e0244dd8664c09ced8166dd"}