{"authors": ["Chris Drosner For The State Journal"], "date_download": "2020-05-04 20:17:09", "date_modify": "2020-05-04 20:17:09", "date_publish": "2018-01-17 15:00:00", "description": "The cold snap that rang in the new year may not have been ultra-cold, but it was demoralizingly, ear-tinglingly long. At least I emerged from it with some important information: imperial stouts...", "filename": "_fa4234a237b44065b335df02924c5cf3_1588623429.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fa4234a237b44065b335df02924c5cf3_1588623429.html", "title": "Beer Baron: Imperial stouts perfect for cold weather", "title_page": "Beer Baron: Imperial stouts perfect for cold weather", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The cold snap that rang in the new year may not have been ultra-cold, but it was demoralizingly, ear-tinglingly long. At least I emerged from it with some important information: imperial stouts are good.\nThis may sound obvious to fans of the gothest of beer styles, but truth has a way of getting hammered home when you spend night after dark, early night avoiding the cold outside by staying cooped up in the bone-dry house and dodging the drafts inside with wool sweaters, blankets and extra socks.\nThere is a coziness to such a scene, however, and its perfect liquid companion is the hearty, dark imperial stout. Replete with flavors and aromas of their signature dark malts — chocolate, coffee and “dark fruit” like raisin, date, black cherry and berry — and usually packing well north of 8 percent ABVs, these beers were made for winter in cold places.\nFittingly, the first imperial stouts — it’s the origin of today’s common usage of “imperial,” meaning bold or robust — were brewed in late 19th century England for export to the Russian empire. Catherine the Great was a particular fan of these beers, and this royal heritage is often alluded to in the names of the many modern craft interpretations of the style, including Avery’s Czar and Sprecher’s Czar Brew, which is aged in bourbon barrels.\nWhether of the Russian or American variants, these beers are usually inky black and among the richest in any brewery’s lineup. Some are treated as such with once-a-year releases and signature parties to celebrate them, a la Three Floyds’ Dark Lord Day and Surly’s Darkness Day.\nWhile those special releases are worthy of such elevation, there are plenty of imperial stouts on shelves right now — or even year round — that are, too. The Upper Midwest, it would seem, is a particularly good place to partake in the style, with well-respected to acclaimed imperial stouts easy to find.\nAdulterating imperial stouts with vanilla, cocoa, coffee, nuts, spices or fruit — not to mention aging in spirits barrels — is all the rage right now, and such treatment can yield delicious results. But that — and beer geeks’ comical instinct to chase scarcity — often leads to “clean” imperial stouts being criminally overlooked.\nSo let’s drink some, yeah? I picked five of my favorite unadorned imperial stouts — really, they’re five of my favorite beers, period — for short reviews. They’re all easy to find, either on shelves year-round, virtually year-round or currently in season.\nThe beers featured below generate all their complex flavors and aromas through the traditional four ingredients: malt, hops, water and yeast. Barrels are fine, but they don’t apply here.\nImperial stout is also a stellar candidate for cellar-aging, both to allow the beer to develop in the bottle but also to stretch often seasonally limited supplies year-round. Most of the bottles I sampled below were aged for one to two years, which is about as long as I want to let stouts go. Bell’s Brewery, however, enables beer hoarders by advising that its Expedition Stout is suitable for “unlimited” aging, an unusual green light from brewers who almost always suggest their beer be drunk quickly.\nA couple of caveats on drinking imperial stouts: These are enormous beers, and they’ll leave quite a mark on your sobriety — and eventually your waistline — if you have more than one or maybe two a night. So, enjoy responsibly. Drinking slowly so the glass warms (PLEASE USE A GLASS) also allows the beer’s true flavors and aromas to shine. The Goldilocks zone here is mid-50s to even 60 degrees — practically room temperature in my house in January.\nPlead the 5th Imperial Stout\nBrewed by: Dark Horse Brewing, Marshall, Mich.\nVital stats: 11% ABV, seasonal four-pack of bottles.\nThe capstone of Dark Horse’s excellent numbered stout series, Plead the 5th is a regular in my cellar. A bottle packaged in late fall 2015 had a rich, almost fudgy, dark chocolate character with a molasses note and a modest alcohol bite. All imperial stouts are relatively viscous, but this one is only moderately big-bodied, and silky-smooth to boot.\nBlackout Stout\nBrewed by: Great Lakes Brewing, Cleveland\nVital stats: 9.9% ABV, seasonal four-pack bottles.\nThis beer commemorates the 2003 power grid failure that left 55 million people across the Northeast in the dark. My 2015 bottle poured an aroma distinct from the others featured here in its robust dark fruit character, notably plum and cherry. Combined with the chocolatey malt, it had almost a Black Forest cake effect, though with a moderated sweetness and a touch of molasses.\nE\nxpedition Stout\nBrewed by: Bell’s Brewery, Kalamazoo-Comstock, Mich.\nVital stats: 10.5% ABV, seasonal six-pack bottles, though they’re often available for most of the year.\nExpedition is widely regarded as one of the best imperial stouts, period, and it’s my favorite for the cellar because of its immense complexity. It’s got it all: coffee, chocolate chip, molasses, even a little leathery note and a kind of almost-burnt toffee note, like someone left a pot of homemade caramel on the stove just a little too long. Then there’s the dark fruit: raisin, black cherry, I guess a little bit of fig. And the hop character on the finish is more distinct than the other beers here: a slightly piney bitterness that melds seamlessly with the malt’s roast bitterness. That’s a lot going on, and I think my glass bottled in August 2016 was at a sweet spot for its age.\nSatin Solitude\nBrewed by: Central Waters Brewing, Amherst\nVital stats: 8.5% ABV, Year-round six-packs bottles.\nCentral Waters is renowned for its barrel-aged stouts, but Satin Solitude is no slouch either—especially for its $10-per-sixer price point. It’s a beer I don’t buy as often as I should, and my fresh bottle was a case for picking it up more often. It’s the most coffee-forward of the beers here, with a very roasty aroma cut with lots of cereal-like malt sweetness. On the palate it’s less sweet than it smells, with the malt doing double duty, bringing a chocolatey sweet yin but also that sharp roast yang that works with the hops to run the moderately bitter finish. It’s by far the lowest ABV of these beers and has a somewhat lighter body to match.\nImperial Stout\nBrewed by: Founders Brewing, Grand Rapids, Mich.\nVital stats: 10.5% ABV, once-seasonal four-packs of bottles.\nThis is probably my No. 2 favorite of this style, but I’ll have to get by on the dregs left in my cellar for a while as the simply named Imperial Stout is not on Founders’ (extensive) release calendar for 2018. It’s a shame, because this one from 2015 is a beast: motor-oil thick, with deep roast character and an almost vinous dark fruit character and dark, dark chocolate flavor that’s sweet and bitter at the same time. Some slower-moving bottle shops may have some dusty four-packs lying around — ask a clerk who looks like she might not be easily annoyed. In the long term? “I’m confident that we will see this beer again in the future,” Founders Wisconsin market manager Hank Olsen said. “Imperial Stout is just sitting on the bench this year to make room for a new lineup.”\nHonorable mentions\nAs an imperial stout junkie, I cannot let this column pass without at least a mention of a few others of the style that are pretty darn good. Sierra Nevada Narwal is reliable, easy to find and a great value. Summit Russian Imperial Stout just dropped this month and I’ve only had one bottle but it’s delicious. Among year-rounders, North Coast Old Rasputin is a worthy icon of the style, Lagunitas Imperial Stout is a crazy value at $5 a bomber, and beer geeks would chase the truck carrying Oskar Blues Ten Fidy if only it weren’t so plentiful.", "url": "https://apnews.com/fa4234a237b44065b335df02924c5cf3"}