{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:05:37", "date_modify": "2020-05-04 20:05:37", "date_publish": "2018-02-07 05:30:00", "description": "Louis “Louie” Edward Leizinger Jr., 74, Fox Lake, passed away Tuesday, Jan. 30, 2018, at his home in Fox Lake. Louie was born Oct. 6, 1943, in Milwaukee, a son of Louis and Mabel (Kanitz)...", "filename": "_2e3bba0df0b14113b23d263daa6e6a84_1588622737.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2e3bba0df0b14113b23d263daa6e6a84_1588622737.html", "title": "Louis Leizinger Jr., 74, Fox Lake", "title_page": "Louis Leizinger Jr., 74, Fox Lake", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Louis “Louie” Edward Leizinger Jr., 74, Fox Lake, passed away Tuesday, Jan. 30, 2018, at his home in Fox Lake.\nLouie was born Oct. 6, 1943, in Milwaukee, a son of Louis and Mabel (Kanitz) Leizinger. He was employed at Milwaukee Post Office until he retired at age 55 and moved to Fox Lake. Louie loved to fish, hunt and play cards. He was past president of the Fox Lake property owners, head of the fish stocking committee and the handicap fishing outing. He loved Fox Lake.\nLouis is survived by a sister, Nancy (Tom) Mueller of Fox Lake; two nephews, Mark (Diane) Mueller and Mike (Carolyn) Mueller; four grandnieces; three grandnephews; one great-grandnephew; one great-grandniece; dear friends, Glenn Wiesmueller, Tom Larson and Denise.\nHe was preceded in death by his parents.\nVisitation will be held Saturday, Feb. 10, from 9 a.m. until the hour of service at Annunciation Catholic Parish, 305 West Green Street, Fox Lake.\nA funeral Mass will be held at 11 a.m. on Saturday, Feb. 10, at church with the Rev. John Radetski officiating.\nMemorials will be donated to fish stocking in Fox Lake in Louie’s name.\nKohls Community Funeral Home is assisting the family. Visit kohlsfh.com.", "url": "https://apnews.com/2e3bba0df0b14113b23d263daa6e6a84"}