{"authors": ["James Hawkins", "The Detroit News"], "date_download": "2020-05-04 20:09:22", "date_modify": "2020-05-04 20:09:22", "date_publish": "2018-02-23 20:05:23", "description": "Ann Arbor — As the dark clouds hanging over the college-basketball corruption scandal continue to spread, Michigan coach John Beilein remains disheartened. A report by Yahoo! Sports released...", "filename": "_174b37005f05401ab31f75a34cf2e1e9_1588622962.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_174b37005f05401ab31f75a34cf2e1e9_1588622962.html", "title": "UM's Beilein disheartened by latest corruption reports", "title_page": "UM's Beilein disheartened by latest corruption reports", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ann Arbor — As the dark clouds hanging over the college-basketball corruption scandal continue to spread, Michigan coach John Beilein remains disheartened.\nA report by Yahoo! Sports released on Friday implicated several top players and programs, shining a brighter light on the shady underbelly and behind-the-scenes dealings in the sport.\nWhile Beilein didn’t have much to say on the latest report, he’s at least assured his program continues to play by the rules.\n“I can’t even begin to speak about other schools,” Beilein said Friday. “All I know is we try to do everything within the spirit of the NCAA rule and just do your best. I’m not happy that this has all come about, but if people are not doing the right thing then they shouldn’t be doing it, they shouldn’t be involved in this thing.\n“But there’s a lot of quick evolving things we have to make quick decisions on. I’m very confident we’re doing the right thing every day and just keep us within the spirit of the rules. Whether they’re NCAA rules, whether they’re state of Michigan rules or federal rules, we’re doing what the spirit says.”\nMore: Expert: It’d be ‘silly’ for MSU not to sit Miles Bridges\nMore: Michigan State’s Tom Izzo denies NCAA violations\nYahoo’s report included FBI documents that showed loans former agents made to players and their families, some for as much as tens of thousands of dollars.\nBeilein said Michigan’s compliance department does a “tremendous job” working with the program and informing the players about what’s acceptable when it comes to dealing with agents.\n“It’s not illegal to talk with agents and we think we’ve done a really good job of trying to educate our kids in this. We’ll educate them more through this today,” Beilein said. “But it comes down to in the end – first of all, do they know the rule? Our guys know the rule. And now do people have the need or the want or do they understand the spirit of the rule that they can’t take anything? Can’t even buy them a Coca Cola.”\nBeilein compared the entire situation to a speed limit. If the speed limit is posted at 55 mph, some people may think it actually means 60 mph. But when it comes to the NCAA’s rules, there’s no such lenience.\n“People have to understand that and hopefully everybody is going to continue to evolve to go to that end of the spectrum,” Beilein said. “In the NCAA, that’s what we’re supposed to do. And we’re going to (report it) if it ever happens to us.”\nJunior center Moritz Wagner said he gave himself two options when he heard about Friday’s report: either immerse himself in it or leave all the drama aside and focus on basketball. He chose the latter.\n“It’ll figure out itself,” Wagner said. “It’s a little unfortunate because it gives a bad taste with the whole March Madness coming up I think. That’s my opinion about it that the NCAA gets connected to those things instead of March Madness.”\njhawkins@detroitnews.com\ntwitter.com/jamesbhawkins", "url": "https://apnews.com/174b37005f05401ab31f75a34cf2e1e9"}