{"authors": ["Mary Carol Garrity Tribune News Service"], "date_download": "2020-05-04 20:11:30", "date_modify": "2020-05-04 20:11:30", "date_publish": "2018-11-17 06:00:00", "description": "When Leslie walked through the long-neglected house that was to become her family's home, it was the kitchen that tugged at her heart the most. The house, originally scheduled for the wrecking...", "filename": "_1749cf08054b45d0997c6c87c37f566c_1588623090.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1749cf08054b45d0997c6c87c37f566c_1588623090.html", "title": "Style at Home: Happiness is on the menu in this colorful kitchen", "title_page": "Style at Home: Happiness is on the menu in this colorful kitchen", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When Leslie walked through the long-neglected house that was to become her family’s home, it was the kitchen that tugged at her heart the most. The house, originally scheduled for the wrecking ball, had stood empty for years and was in bad shape by the time Leslie and her husband, Dan, discovered it. As they walked through the house, Leslie flipped when she saw the open-concept kitchen. She could picture it filled with light and color, and all the energy and joy of her family of six.\nIt took 11 months to bring this neglected home back to life. And each room has Leslie’s bright personality stamped upon it. Today, we’re spending some time in her absolute favorite space: the kitchen and adjoining hearth room.\nAfter they knocked out a fireplace that divided the kitchen space from the family room, Leslie now had a very large room to work with. She divided it into three separate spaces, the kitchen at one end, the hearth room and the other and a casual dining space at the center. (We’ll look at her dining space in a future blog.)\nThis welcoming hang-out spot shows off some of the things Leslie loves most: chinoiserie, wallpaper, the color pink and bold patterns. Leslie laughs that her oldest daughter told her, “OK, Mom. You have enough pink!” Leslie’s response? “You can NEVER have enough pink!”\nAnne, a Nell Hill’s designer, worked very closely with Leslie to help bring her vision for the space to life. Leslie had a great sectional sofa she wanted to dress up with pillows. And, there was a dreamy window seat, just dying for the right mix of textiles to make it even more inviting. She and Anne had fun wandering through bolts of fabric, looking for a happy, playful mix of chinoiserie patterns and other fabrics in Leslie’s favorite color palette of pinks, greens and teals.\nLeslie’s mom owned a wallpaper and decorating store for 26 years, and that is where Leslie developed her deep abiding love for wallpaper. While she keeps most of the walls in her home a light gray - a perfect neutral backdrop that balances her daring choices in color and pattern - she showcases wallpaper in interesting places. In her hearth room, she used a funky zebra pattern wallpaper to back her built-in bookcases. It’s lively enough to provide some visual interest, but muted enough to play second fiddle to the accents that fill the bookcase’s shelves.\nThis bookcase, to the side of the kitchen, doubles as a home office. One of Leslie’s favorite hobbies is scouring the local antique mall, looking for diamonds in the rough she can salvage and restore, bargain finds that become beautiful additions to her decor. All the built in bookcases give her ample space to showcase her treasures.\nIt’s a rare day when Leslie’s house isn’t filled with guests, whether it’s a pack of teens raiding the fridge after school, or a party of friends and family. The expansive kitchen island is the perfect space to gather for a snack or a glass of wine. This happy, welcoming kitchen area has turned out exactly as Leslie pictured it that first day when she walked through the empty, neglected house. It has taken on the welcoming spirit of these gracious homeowners, a wonderful example of how to design your home so it’s a reflection of you.\nThis column was adapted from Mary Carol Garrity’s blog at www.nellhills.com. She can be reached at marycarol@nellhills.com.\n(c)2018 Tribune Content Agency, LLC\nDistributed by Tribune Content Agency, LLC.", "url": "https://apnews.com/1749cf08054b45d0997c6c87c37f566c"}