{"authors": ["Rex Rutkoski"], "date_download": "2020-05-04 20:10:40", "date_modify": "2020-05-04 20:10:40", "date_publish": "2018-11-08 17:54:03", "description": "The Doobie Brothers' invitation to \"Listen to the Music\" is still standing. Arriving in the early '70s, capturing our collective ears with their harmonies and fresh approach to group...", "filename": "_d89880165e8249f59d64663703f6624a_1588623040.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d89880165e8249f59d64663703f6624a_1588623040.html", "title": "The Doobie Brothers rock into The Palace Theatre", "title_page": "The Doobie Brothers rock into The Palace Theatre", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Doobie Brothers’ invitation to “Listen to the Music” is still standing.\nArriving in the early ’70s, capturing our collective ears with their harmonies and fresh approach to group dynamics, they remain one of the “Long Train(s) Runnin’ ” of rock.\nAnd they are still winning new fans along the way, many who weren’t even born when their music was.\n“Good music, and I hope that includes us, has no shelf life, and is relevant in any age,” says singer-guitarist Patrick Simmons, one of the veteran members leading the group into The Palace Theatre, Greensburg, at 7:30 p.m. Nov. 7.\nFans getting younger\n“We certainly are gaining younger fans. Often it’s the offspring of our older core fans, but with all the access to music of all kinds, and all ages these days, people randomly pick up on our stuff and end up as fans.”\nThere is a lot of “stuff” on which to pick up, what with five Top 10 singles and 16 Top 40 hits, selling over 48 million albums, receiving four Grammy awards and earning seven multi-platinum, six platinum and 11 gold albums.\nHall of Famers\nThe artists were inducted into the Vocal Group Hall of Fame in 2004.\n“Best of the Doobies” has sold more than 12 million copies, receiving a rare recording industry “diamond” record.\nThe familiar songs just keep on coming with “Listen to the Music,” “Jesus is Just All Right,” “China Grove,” “Black Water,” “Rockin’ Down the Highway,” “What a Fool Believes,” “The Doctor,” “Take Me In Your Arms,” “Takin’ it to the Streets,” “Minute by Minute,” “You Belong to Me” and “Long Train Runnin’ ” among others.\nWhy they strike a chord\n“Perhaps our songs have ideas, and stories, that speak to experiences that everyday people can relate to,” Simmons says. “In many ways, I think that is the secret to the success of a good song. It touches a chord in the listener that resonates in their own lives. We just want people to listen, and be lifted to feel better in that moment.”\nSimmons says he always just has enjoyed playing music: rock, traditional, ballads, rhythm and blues, jazz, electric, acoustic, “you name it.”\n“I don’t think I ever had a concept of legacy,” he says. “I’ve always lived in the moment, and enjoyed what I’ve been able to do. I suppose I would leave it to others to quantify our contributions. I would hope we’re remembered as a good band that wrote and performed great songs.”\nMusical confluence\nThe Doobie Brothers are, and always have been, a confluence of musical styles which gives the band a unique sound, says singer-songwriter and guitarist Tom Johnston.\n“Everyone adds something different to the mix and it just seems to work,” he explains.\nKeeping it fresh after all these years isn’t difficult, he adds.\n“Continuing to write songs and push yourself to try different things musically, while staying true to what you are musically, has been key to keeping involved and engaged,” he explains. “Also it’s working with the guys to create the best shows we can live, that the audiences will respond to, feel involved in, and be entertained by.”\nNothing like live\nGuitarist and vocalist Tom Johnston says interacting with the live audience is one of the high points of being a musician.\n“When you put out the best performance you can each night, and the crowd gives the energy back, it’s an exhilarating high that’s hard to match on any level,” he says. “It makes each show different than the last one, and it’s one of the main reasons we continue to tour regularly every year.”\nWorkman-like approach\nMulti-instrumentalist John McFee says he would like to think that one of the greatest strengths that the Doobie Brothers have, and have always had, is a workman-like attitude toward music.\n“That is, put in the time, effort and focus on developing the skills and being creative that it takes to make the best music that you can,” explains McFee, who also has recorded with Van Morrison, Steve Miller, Elvis Costello and the Grateful Dead.\n“I believe that doing that plus being open to exploring all types of music and allowing the influences in would be good things for aspiring artists to embrace, and I believe that they are important reasons why people still value the music of the Doobie Brothers.”", "url": "https://apnews.com/d89880165e8249f59d64663703f6624a"}