{"authors": ["Steve Jordon World-Herald Bureau"], "date_download": "2020-05-04 20:14:46", "date_modify": "2020-05-04 20:14:46", "date_publish": "2018-02-02 06:00:00", "description": "LINCOLN — With 53,000 open jobs, you’d think Nebraska would be a worker magnet. Not so, business leaders were told Thursday, and that’s why the state wants you to become a “Good Life...", "filename": "_0b8c0cee85f1479ebbb3e9f09572d85d_1588623286.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0b8c0cee85f1479ebbb3e9f09572d85d_1588623286.html", "title": "Nebraska wants 'Good Life Ambassadors' to entice workers to the state", "title_page": "Nebraska wants 'Good Life Ambassadors' to entice workers to the state", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Nebraska wants ‘Good Life Ambassadors’ to entice workers to the state\nLINCOLN — With 53,000 open jobs, you’d think Nebraska would be a worker magnet.\nNot so, business leaders were told Thursday, and that’s why the state wants you to become a “Good Life Ambassador,” one of several efforts to attract people to the state, to train young people for the right occupations and to keep people here.\n“We’re doing what we can,” said Greg Adams, executive director of the Nebraska Community College Association, representing the five two-year state colleges.\nFor too long, schools and parents have emphasized sending people to four-year colleges rather than at least exposing students to the possibility of good-paying vocational jobs, Adams told about 125 people attending the annual meeting of the Nebraska Chamber of Commerce and Industry, held at the Cornhusker Marriott Hotel.\nEmployers are looking for people in a wide range of non-four-year-college occupations, he said, and community colleges are starting to partner with school districts to give young people an idea of what’s out there.\nA project by West Point schools and Northeast Community College shows promise of being adaptable to other rural communities, Adams said.\nDan Hohensee, director of the Lincoln Public Schools’ Career Academy, said the program that started in 2015 is having success acquainting students with health sciences, criminal justice, engineering, education, welding, auto repair and a “broad spectrum” of other occupations.\n“We’re letting them test-drive their future,” he said, and teaching “soft skills” such as time management, self-advocacy and professionalism.\nAllison Hatch, a talent recruiter for the State Department of Economic Development, said the Good Life Ambassador program lets anyone sign up at nebraska.socialtoaster.com and provides material people can use to persuade others to move to Nebraska or stay here.\n“We need to keep our youth here,” she said. This year the department also is helping sponsor a youth summit in 15 Nebraska communities to tackle the problem.\nThe problem is that every state is facing shortages of workers who qualify for job openings, said John Kirchner, a regional executive for the U.S. Chamber of Commerce.\nHe said expanding the workforce is a priority for the U.S. chamber, and the chamber supports retaining young immigrants whose parents brought them illegally to the United States.\nBut that’s not enough, Kirchner said, and government jobs programs are too slow, lack funds and aren’t big enough to have a significant impact. “The solutions are going to fall on the business community.”\nGov. Pete Ricketts told the chamber group that his budget proposal has money for job training and internship programs, which are popular with businesses but which quickly run out of state funds.", "url": "https://apnews.com/0b8c0cee85f1479ebbb3e9f09572d85d"}