{"authors": ["Carmine Frongillo", "Cfrongillo Lowellsun.Com"], "date_download": "2020-05-04 20:13:51", "date_modify": "2020-05-04 20:13:51", "date_publish": "2018-03-01 12:26:00", "description": "METHUEN -- Winning in the postseason is all about seizing the moment. And eighth-grader Jessica Driscoll not only rose to the occasion when it mattered most, she lifted the fortunes of her...", "filename": "_b2146218d00b43fab634cae68268b20a_1588623231.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b2146218d00b43fab634cae68268b20a_1588623231.html", "title": "8th-grader Lifts Red Rangers", "title_page": "8th-grader Lifts Red Rangers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "METHUEN -- Winning in the postseason is all about seizing the moment.\nAnd eighth-grader Jessica Driscoll not only rose to the occasion when it mattered most, she lifted the fortunes of her Methuen-Tewksbury teammates with her.\nDriscoll, who attends the Wynn Middle School in Tewksbury, scored the winning goal with 8:13 left to play in the third period as fourth-seeded Methuen-Tewksbury came-from-behind to edge 29th-seeded Reading, 3-2, in an MIAA Division 1 girls hockey preliminary round game.\n“It was a lot closer than we would have liked,” said Methuen-Tewksbury coach Sarah Oteri. “But we knew they were a good team. In this 31-team bracket, you really can’t underestimate anyone.\n“Teams play really tough schedules. They’re a team that played a tough schedule. They tied Woburn, which is really talented. They’ve had a couple of other close games (against good teams). We didn’t think it would be easy, but we didn’t know it would be this tough.”\nThe Red Rangers (18-1-2) will play 13th-seeded Franklin (14-3-4) in a first-round game Saturday at the Methuen High rink at 7 p.m. Reading finished 8-9-3.\nMethuen-Tewksbury trailed 2-1 late in the second period. But the Red Rangers evened the score when junior forward Carolyn Curley of Tewksbury scored with only 10 seconds remaining in the middle period. Curley’s goal gave Methuen-Tewksbury a momentum boost.\n“That goal was huge,” said Oteri. “I can tell you it changed my between periods speech a little bit. (Curley) is that type of player who when you are down she says, ‘I’ll go get one for us.’ She leads by example.”\nIn the third period, the Red Rangers continually pressed for the go-ahead goal until Driscoll finally scored from a scrum in front of the Reading net.\n“It was a scramble and I was thinking please, please make that go in,” said Driscoll. “It was halfway under (Reading goalie Maggie Fennelly’s) glove and then it popped out. I just kind of saw it and went for it. I’ve never scored a bigger goal.”\nMethuen-Tewksbury took a 1-0 lead with 9:24 left to play in the first period on a goal by Brenna Greene.\nRiley Cote, Madi Sjostedt, Kelly Golini, Greene, Ryan Quinn and Tori Schille notched one assist each for Methuen-Tewksbury. Sophomore Kaia Hollingsworth had a strong game with 20 saves.\nReading got second-period goals from Katie Costello and Chloe Doherty.\n“The first (tourney) game is always our toughest, which is for most teams,” said Oteri. “You are nervous, you are excited, you want to do well. There is a lot of pressure. Once you get that first one under your belt, I think you can start playing hockey again.”\nFollow Carmine Frongillo on Twitter @cwfrongi", "url": "https://apnews.com/b2146218d00b43fab634cae68268b20a"}