{"authors": ["The Detroit News"], "date_download": "2020-05-04 20:13:42", "date_modify": "2020-05-04 20:13:42", "date_publish": "2018-02-03 03:05:46", "description": "The Michigan Attorney General's Office executed search warrants Friday at Michigan State University amid its probe into the Larry Nassar scandal, which a representative for the interim MSU...", "filename": "_c3add30593dc4f43a9884f1b53a6d4d1_1588623222.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c3add30593dc4f43a9884f1b53a6d4d1_1588623222.html", "title": "Investigators execute search warrant at MSU", "title_page": "Investigators execute search warrant at MSU", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Michigan Attorney General’s Office executed search warrants Friday at Michigan State University amid its probe into the Larry Nassar scandal, which a representative for the interim MSU president called a “cheap political stunt.”\nA request from Michigan Attorney General Bill Schuette last month sought every record from MSU related to its former women’s gymnastics coach Kathie Klages, the former College of Osteopathic Medicine dean William Strampel, as well as emails and text messages sent to or from former MSU President Lou Anna Simon regarding the convicted sports doctor.\nSchuette spokeswoman Andrea Bitely said the special counsel had requested “the immediate production of physical items assigned” to Strampel, Nassar’s former boss, who recently stepped down from his position and was on medical leave.\n“This has not occurred. We are continuing to investigate with our partners at the Michigan State Police and will not be providing further comment,” Bitely said.\nThe Department of Attorney General Special Agents and Michigan State Police removed records and what appeared to be a flash drive from the Hannah Administration Building and Fee Hall, the Lansing State Journal reported Friday.\nThe investigators made several stops, including the Office of the Provost; while at the second-floor office of Kristine Moore, assistant general counsel at the university, officials appeared to receive a flash drive from a university official, LSJ reported. Moore led a Title IX investigation into Nassar’s conduct.\nJohn Truscott, a spokesman for interim MSU President John Engler, said lawyers from the Miller Canfield law firm representing the university had been talking with Schuette’s office this week about following through on the request for records, which the university said would take time to collect.\n“They had no objection to the timing or anything,” he said. “Everybody knew this evidence would be provided. So I think this was nothing more than a cheap political stunt for the media because they knew we were working on the material.”\nMeanwhile, a new vice president and special counsel has been appointed at Michigan State University in the wake of the Nassar scandal, officials announced Friday.\nCarol Morey Viventi, an MSU graduate who was most recently the deputy director at the Michigan Department of Civil Rights, starts her role on Monday, according to a statement from the school.\nViventi’s appointment comes after MSU Trustee Brian Mosallam called for the resignation of Bob Noto, who was then the vice president for legal affairs and general counsel.\nReached Friday, school representatives said Noto remains in his position.\nEngler praised Viventi as an ideal leader to help MSU move forward.\n“Carol has the depth of experience, cultural sensitivity and ability to manage complex operations that will be invaluable to the difficult task ahead,” Engler said. “Today is a new day at MSU, and she will help us move swiftly and decisively to implement changes to protect everyone affiliated with our campus. I am grateful she has agreed to take on this new role as the MSU community moves forward together.”\nAs the first woman and ethnic minority to serve as secretary of the Michigan Senate, Viventi oversaw sexual harassment policy and training and led the 75-member staff, MSU officials said Friday.\nShe also was legal counsel to the nonpartisan Joint Committee on Administrative Rules and became deputy chief of staff and counsel to the Cabinet under Engler, according to the university.\nIn describing her goals in the new vice president role, Viventi said Friday: “MSU is at a pivotal moment in its history. We will do everything in our power to create a culture of accountability to ensure the safety and well-being of all students, faculty and staff. Together, as a team, I hope we can renew the trust and pride in our great university, and do whatever I can to help the community begin a new day at MSU.”\nViventi also received her bachelor’s in divisional Social Science from MSU and earned a juris doctorate from Thomas M. Cooley Law School. She has been an adjunct professor at Western Michigan University and served on the board of governors of the Japanese American National Museum.\nWhile at the Michigan Department of Civil Rights, she oversaw community engagement, communications and strategic operations.\n“I’ve worked with her in several different roles, and I have a deep respect for her abilities and intellect,” said Mark Murray, Meijer vice chairman and Grand Valley State University’s former president. “The entire MSU community will benefit from her presence. As a former university president myself, I know she has the skills to excel in this role. And as a Spartan alum, I am proud and confident to have her and President Engler leading our efforts during this challenging time.”", "url": "https://apnews.com/c3add30593dc4f43a9884f1b53a6d4d1"}