{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:53:19", "date_modify": "2020-05-04 19:53:19", "date_publish": "2018-05-14 00:00:00", "description": null, "filename": "2018_05_bernie-sanders-workplace-democracy-unions-legislation_1588621999.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/05/14111950/workplace-democracy.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_05_bernie-sanders-workplace-democracy-unions-legislation_1588621999.html", "title": "A Line in the Sand", "title_page": "A Line in the Sand", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "This month, American unemployment dropped to its lowest rate in seventeen years — but wages haven’t caught up. It’s not difficult to divine the meaning of this disparity. Productivity has soared since the seventies, as has the wealth of the top 1 percent, while the income of average workers has stalled out. That means that despite producing more surplus value than ever, American workers are taking home a smaller share of the proceeds. The trend is not driven simply by abstract economic forces but by politics, as the capitalist class successfully pushes for policies that disempower workers and redistribute wealth to the top.\nIt’s no coincidence that this trend in wage stagnation has occurred over the same period that neoliberal government and corporate policies have frontally attacked unions. Unions are agents of collective bargaining, a way for individually weak workers to exert power together that they wouldn’t have on their own, and they’re effective: on average union employees’ paychecks (or market wages) are 27 percent higher than nonunion employees, and they get better benefits (or social wages) too. The bipartisan neoliberal attack on unions, which began in earnest in the 1970s, has been enormously effective in undermining the power of the United States labor movement. As a result, the percentage of US workers who currently belong to a union is about 10 percent, down from its peak of nearly 28 percent in 1970.\nAgain this problem is fundamentally political, stemming from the balance of power in our society and not from a natural or inevitable economic process. The solution, too, has to be political — and it’s in that spirit that Bernie Sanders has introduced a new bill called the Workplace Democracy Act, which aims to clear obstacles to the labor movement’s growth, and ultimately increase collective worker control over the economy. The chances of such a bill passing in a GOP-controlled legislature (or even in a Democrat-controlled legislature; a weaker bill was opposed by moderate Democrats during the Obama administration) are basically nil, but Sanders’s bill is a strong political move anyway. It signals an uncompromising commitment to unions and invites other politicians to support an ambitious vision of a revitalized movement for worker power — or oppose that vision at their own risk.\nThe Workplace Democracy Act makes three crucial interventions. First, it would overturn a provision in the 1947 Taft-Hartley law that replaced card check — a system where employers have to recognize a union if more than 50 percent of employees in a particular bargaining unit say they want one — with an elaborate secret-ballot election process overseen by the National Labor Relations Board. The election process is extremely vulnerable to corporate interference and delay, with big companies often hiring expensive consultants to run protracted anti-union campaigns that use scare tactics and disingenuous smears to dissuade workers out of voting for a union — as well as outright harassment and intimidation. As Sanders writes in his summary of the bill: “92 percent of private-sector employers force employees to attend closed-door meetings to hear anti-union propaganda; 80 percent require supervisors to attend training sessions on attacking unions; 78 percent require that supervisors deliver anti-union messages to workers they oversee.” A national card check system would allow workers to unionize by simple majority, avoiding the messy electioneering process that’s tilted in favor of employers, who inevitably have more resources.\nSecond, Sanders’s bill would repeal so-called “right to work.” Also a legacy of the Taft-Hartley Act, right to work prevents unions from negotiating contracts with employers that require all employees to join or pay a bargaining fee to the union. Martin Luther King, Jr recognized right to work for what it is: “It is an anti-union law. Its purpose is to destroy the labor unions and the freedom of collective bargaining by which the unions have improved the wages and working conditions of everyone,” he wrote. “It is a whip to preserve the sharecropper wages and poverty system that has been used to ‘keep working people in their place’ for so many years.” A majority of states now have right-to-work laws, many enacted in just the last decade. Unsurprisingly, right-to-work states also have chronically low wages.\nThird, according to some reports, Sanders will seek to increase financial penalties on employers who fire workers for union organizing, a practice that is illegal but ubiquitous, due in part to the lack of consequences. The Center for Economic and Policy Research estimates that “one-in-five union organizers or activists can expect to be fired as a result of their activities in a union election campaign.” The share of union drives that saw illegal firings of workplace activists rose steadily from the the mid-seventies to the mid-2000s. The paper’s authors note that employers “are unlikely to fire workers randomly, or simply for expressing pro-union views. Employers maximize the return to illegal firing by focusing on union activists.” The result is a climate of fear and a chilling effect on union activism, especially organic leadership among the rank-and-file, who are the least likely to take risks regarding their job security. Corporations are not currently forced to pay penalties when they’re caught retaliating against labor activists — all they need to do is make up lost income, which is not sufficient to distance them from the practice.\nThe Workplace Democracy Act is not exactly a shoo-in. The GOP controls both houses of Congress, and if the party is fiercely anti-union on principle, the wing that presently reigns supreme is even more so. But politics is not merely a game of passing incremental reforms when possible and otherwise laying low. Politics is about pushing necessary issues beyond what present political circumstances allow. And on the question of workers’ rights, a golden opportunity has arisen: with the Janus v. AFSCME Supreme Court decision looming, imperiled public-sector unions have recently engaged in unprecedented displays of militant strike action. These include the historic teacher strikes in West Virginia, Oklahoma, Arizona and elsewhere, as well as the recent University of California worker strike — the largest strike in the history of the biggest employer in California, which is itself the fifth largest economy in the world. Not only is labor agitation on the rise, but popular support is surging. Recent polls demonstrate that 78 percent of Americans think teachers should be paid more, while more than half support the recent teacher strikes — a huge departure from popular cynicism that greeted similar strikes in years past. Meanwhile, public support for unions is at 61 percent, the highest in fifteen years.\nThis dissonance between politicians’ attitudes and popular attitudes is fertile ground for ambitious pro-labor political action, which may not pay off immediately but has the potential to redraw political lines, shake up alliances, and create new litmus tests for politicians who’ve written off labor as irrelevant. Now is a timely moment to articulate a new political orientation toward working people’s right to organize against their bosses for a decent standard of living and a say in their job. Sanders has drawn a line in the sand, and millions of people who are freshly aware of the power and necessity of unions are watching to see who steps across it, and who stays behind.", "url": "https://www.jacobinmag.com/2018/05/bernie-sanders-workplace-democracy-unions-legislation"}