{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:08:29", "date_modify": "2020-05-04 20:08:29", "date_publish": "2018-03-23 17:00:00", "description": "The high honor roll and regular honor roll for the second trimester of the 2017-18 academic year have been announced at Watertown High School. A student must be enrolled in a minimum of four...", "filename": "_29d4302457134913b2705c16cb98cafd_1588622909.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_29d4302457134913b2705c16cb98cafd_1588622909.html", "title": "WHS announces second trimester honor rolls", "title_page": "WHS announces second trimester honor rolls", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The high honor roll and regular honor roll for the second trimester of the 2017-18 academic year have been announced at Watertown High School.\nA student must be enrolled in a minimum of four (class of 2018, 2019, 2020) or five (class of 2021) classes to qualify for high honor roll of 3.67 and higher and at least a 3.2-3.669 for honors.\nHIGH HONORS\nSeniors\nRaven Balistreire, Megan Beine, Zachary Beine, Courtney Boeder, Haven Bridwell, Ricki Budewitz, Lauren Burd, Crystal Burke, Jonathan Burke, Quade Buska, Daniela Castellon, Sydney Cooper, Jillian Degrandt, Alyssa Denault, Nathan Fairall, Kalin Fischer, Leonel Gallegos, Lauren Gapinski, Mia Haines, David Hammann, Kaavisej Hang, Kennedy Hansen, Griffin Harris, Caitlin Hielsberg, Emily Huber, Lauryn Jacobs, William Kitzhaber, Hannah Kuehl, Sara Lemminger, Aaron Lewis. Gabriela Mares, Stephen Maule, Jacqueline McNutt, Olivia Mendoza, Tram Anh Ngo, Austin Otto, Darian Renier, Courtney Rex, Alexander Roberts, Marissa Roberts, Ana Ruiz Cardenas, James Sippel, Benjamin Smith, Kristin Stair, Sunphop Suntichottrakul, Michaela Suski, Colin Uecker, Claire Vitale, Nathan Volgmann, Ethan Walter, Hannah Wickert, Abigail Wilkey, Madlyn Zingler.\nJuniors\nTaylor Adams, Roxanne Aquino, Elyse Asmus, Tyler Bartz, Carly. Bast, Evan Berth, Marcus Bird, Cloey Braatz, Matthew Brewster, Cassidy Brodeske, Taryn Christian, Bailey Coughlin, Sheridan Dettmann, Shaylyn Dunn, Matthew Engel, Nia Fredrich, Hanna Gilbert, Clayton Haase, Fouantxhee Hang, Aubrey Hanson, Mary Harrison, Cecelia Hickey, Tristan Kaufmann, Jenna Koepp, Kirsten Kruesel, Paul Kujawski, Nathan Lampe, Matthew Loper, Calvin Marks, Jack Mattke, Josephine Meloy, Connor Meyer, Jadyn Meyer, Vanessa Montenegro.\nAlex Nachtigall, Kylie Nickels, Angela Ortega, Kyle Othmer, Phoebe Poff, Devon Rasch, Hallie Reeve, Claire Reichardt, Cora Roost, Kaitlynn Rowley, Kathleen Schleicher, Joshua Sokovich, Karl Stadler, Sarah Taugher, Kayla Thrane, Marissa Wackett, Hannah Walker, Jada Wegner, Krista Wenninger, Samuel Will, Brendan Williams, Destiney Wruck, Jillian Yanick, Taylor Zache, Olivia Zimmermann.\nSophomores\nRebecca Anderson, Mia Ashenfelter, Hannah Baneck, Serina Blase, Alana Bruske, Alayna Clark, Alexander Coughlin, Isabelle Day, Daniel Denault, Bruce Doughty, Morgan Ellsworth, Erik Finman, Jacob Fischer, Brian Frank, Marissa Haines, Madeline Hammond, Yeejpitaxai Hang, Caitlin Hanley, Izak Jensen.\nKaleb Kaulback, Katie Kessenich, Faith Klein, Austin Klug, Julie Koch, Andrew Lewis, Allison Maas, Evelyn Marchant, Brianna McLatchie, Ryan Mitchell, Rachel Moldenhauer, Yoshka Munyon, Olivia Otto, Kayden Parpart, Madysyn Randall, Sydney Rodriguez, Anna Schroeder, Madyson Sloan, Anthony Smith, Cara Smith, Allison Stair, Sofia Stephens. Briana Tester, Christian Tietz, Sabrina Timm, Charles Van Norman, Danielle Weissenrieder, Whitney Wichman, Marni Wickert, Megan Woodward, Wilhelmina Zastrow, Ashley Zietlow, Emma Zwieg.\nFreshman\nElias Adrian, Kaelyn Bingen, Myranda Bischoff, Joshua Borchardt, Lindsey Braatz, Jacob Christian, Faith Elertson, Hannah Frank, Riley Fredrick, Suabci Hang, Peter Hansen III, Jared Harmon, Elise Hickey, Colby Hielsberg, Kathryn Johnson, Liana Jones, Cassandra Kaphingst, Jonathon Kilps, Christopher Kitzhaber, Ethan Kratzer, Joshua Krueger.\nRiley Lang, Olivia Leu, Grace Mankins, Benjamin Novotny, Joshua O’Brien, Trevor Olson, Evan Pauly, Jason Peter, Maggie Piel, Makena Pulver, Haven Reeve, Hannah Roberts, Gretchen Roost, Isaac Ruder, Brody Schadt, Aubrey Schmutzler, Dylan Sippel, Kaelen Smith, Samantha Suski, Holden Thielke, Naomi Vana, Malee Walker, Nathan Williams, Alexander Zache, Tia Zimmermann, Macy Zubke.\nHONORS\nSeniors\nJailine Acosta, Saleh Ahmed, Alexandra Blank, Mason Borchardt, Ashley Braatz, Bailey Bratz, Laurence Byrne, Carlee Cantrall, Alexis Carpenter, Alexis Christian, Mariam Cruz-Oliva, Katherine Curtis, Fleur de Court Onderwater, Michael DeGrave, Kyle Doering, Destyni Drebenstedt, Patience Drebenstedt.\nJared Ellias, Cody Else, Katelyn Esmeier, Amanda Feder, Maisy Flegel, Cailee Franks, Morgan Frohmader, Kayla Goodman, Joseph Gross, Marlene Guzman, Sierra Harper, Tiffany Hartline, Ryan Hayden, Alexis Hernandez, Jordan Hernandez, Vanessa Iadicicco, Kylie Jacobs, John Jagler, Zachary Jonas, Emma Keeser, Thomas Koch, Jonathan Lehman, Kaitlyn Linskens, Keefe Little. Ryan May, Nicole McConville, John Metzger, Michael Meyer, Marisela Montenegro, Jonathan Nico, Tyler Nico, Breeanna Norris, Molly O’Driscoll, Ethan Pawlik, Nathan Peter, Ryan Peters, Meghan Petroski, Madylynn Phillips, Amanda Piel, Chase Polinsky, Garrett Pritchard, Amber Pugh, Garrett Radtke, Alexis Rasch, Angel Reed, Natalie Rice, Alyssa Rivest, Evan Rocha, Julian Ruiz, Lucas Schramm, Alexis Schwantes, Raymond Scott, Taedra Thrams, Dominick Thrane, Cameron Triplett, Malaynna Tuggle, Ethan Uttech.\nSolomon Vana, Alec VanderGalien, Brittany Walters, Jordan Walters, Samantha Warren, Jared Wehking, Elizabeth Wehrhahn, Steven Wenninger, Katrina Wilson, Tyler Winkelman, Morgan Wollin, Brianna Zubke.\nJuniors\nGeorgia Bailey, Bailey Basterash, Aneesh Beahlen, Stephanie Beck, Kassidee Bergdoll, Ethan Bergen, Audrey Boyd, Jared Brooks, Morgan Clifford, Hannah Dathan, Jesse Day, Kaylee Demet, Brett Faltersack, Jenna Fendt.\nKlair Fortmann, Jared Gartzke, Jason Grabow, Sophia Gratz, Adrianna Hady, Lauren Harshbarger, Brianna Hendricks, Alaric Hinchcliffe, Emma Iverson, Alex Jaeger, Ty Jahnke, Noah Jeseritz, Breann Johnson, Grace Kehl, McKenna Knutson, Brianne Korducki, Bryndle Kusel, Alek Lapp, Kammren Lind, Zachary Loeber, Nicholas Logan, Kaelene Lohneis.\nNayeli Mares, August Matson, Hayley McCabe, Griffin Meyer, Jasmine Miller, Ashley Morales, Deyanira Moreno, Alan Moulster, Mason Oaks, Vanessa Oschmann, Cameron Parrish, Mikayla Peirick, Shyanna Powell, Madeline Preston, Cora Pugh, Allison Rein, Ben Rothweiler, Mikaela Schneider, Hayden Schultz, Haley Seager, Elizabeth Spann-VanLanen. Hannah St. Louis, Michelle Stangler, Ashley Stas, Taylor Staude, Samantha Steffanus, Samantha Tavernier, Julien Trujillo, Allison Wanke, Emma Wollenberg, Micah Yaeggi, Lauren Zautner, Payton Zubke.\nSophomores\nPaige Bacchi, Gaven Balistreire, Eva Barraza Schweitzer, Samantha Birkholz, Jayden Blasing, Lance Blasing, Jacobi Bowling, Grace Bowman, Jason Burgett, Emmaleah Buska, Brysen Clark, Bryce Cooper, Jacob Crogan, Joshua DeGrave, Paige Devers, Hunter Dickhut, Logan Dickhut, Nathan Doherty, Angelo Dominguez. Casandra Frentzel, Alex Frommgen, Austin Fuchs, Samantha Gray, Quinten Gromowski, Amanda Grotelueschen, Lindsey Grotelueschen, Rylee Haasch, Leeanne Harshbarger, Carly Heiman, Jillian Hesse, Madison Holder, Jacob Keller, Briaunna Konz, William Kopp, Miranda Krakow, Tyler Krakow, Michael Kuckkan, Kayla Langner, Abigail Leinstock, Jeremy Libick, Taylor Lohneis, Beatriz Lopez, Abbey Luedtke.\nMary-Theresa Magnan, Grace Matson, Olivia Mattke, Emma Mertz, Olyvea Meyer, Namya Moffett, Nathan Neder, Patrick O’Connor, Caden Oiler, Vanessa Olson, Gus Pedersen, Samantha Pitterle, Rebecca Portman, Sydney Pritchard, Sarah Radloff, Griffin Radtke, Joseph Raue, Brooklynn Ristow, Jozelle Roberts, Ian Row, Derek Rowedder, Maria Ruiz Cardenas.\nIsabelle Schauer, Allayah Schlender, Lilian Schwartz, Hannah Sevenz, Joshua Slayton, Trevor Stanton, Hannah Stubblefield, Ray Tobias, Carson Uecke, Autumn Verfuerth, Justyce Wandersee, Morgan Wenninger, Jaedan Westenberg, Amadeus Winchell, Zachary Zubke.\nFreshman\nBraedon Bear, Brianna Berth, Leah Berth, Brayden Boldt, Joshua Brennan, Kaylin Busshardt, Ashley Campbell, Jared Eckes, Emilee Feder, Kaden Fortmann, Dale Frye, MaKayla Galecki, Jonah Gibson, Emma Gilbertsen, Ravyn Grosse, Luis Guadalupe, Kirsten Gutkowski.\nMorgan Heller, Karleigh Jacobs, Alyssa Jakubiak, Morgan Jameson, Zachary Jaworski, Olivia Kuehl, Patrick Lampe, Jeremy Linskens, Sydney Linskens, Lauren Marks, Abigail Marr, Averie McVeigh, Joshua Meloy, Tyler Merkt, Daisy Mora-Lopez, Adelle Mulligan, Andrew Nell, Marco Ortiz, Noah Othmer, Logan Peirick, Elijah Piasecki, Logan Pitterle.\nSamantha Ritschke, Jeannette Rodrigues, Mitchell Roeglin, Jadon Schneider, Lauren Scholze, Mackenzie Schreiner, Darren Schwantes, Jonah Seibel, Arianna Soto, Calista Soto, Rachael Sprenger, Abigail Stas, Joshua Stetzer, David Stubblefield, Rachel Taylor, Hailee Tomten, Avalon Uecke, Mya Werning, Cassidy Wesemann, Alayna Westenberg, Bastien Wolfe, Vanessa Yenor, Michaela Zeck, Anthony Zinda.", "url": "https://apnews.com/29d4302457134913b2705c16cb98cafd"}