{"authors": ["Colleen Brunner Black Hills Pioneer"], "date_download": "2020-05-04 20:13:22", "date_modify": "2020-05-04 20:13:22", "date_publish": "2018-01-12 18:30:00", "description": "NEWELL — The sub zero temperatures experienced by those in the Northern Hills was not kind to water meters in Newell. “We had some issues during the very cold weather,” said Foreman Larry...", "filename": "_8065a7f182f3483ca571d850ed51453f_1588623202.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8065a7f182f3483ca571d850ed51453f_1588623202.html", "title": "Broken water meter floods Newell library", "title_page": "Broken water meter floods Newell library", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEWELL — The sub zero temperatures experienced by those in the Northern Hills was not kind to water meters in Newell.\n“We had some issues during the very cold weather,” said Foreman Larry Parker of the town of Newell. “We had multiple meters all over town freezing up. People need to understand that it is their responsibility to keep the meters from freezing.”\nOne meter next to the city library froze and broke and caused six inches of water to pour into the basement of the library.\n“Thankfully, I don’t think it caused any permanent damage and the furnace is pulling the moisture out of the air, but we may have to treat for mold,” Parker shared with commissioners.\nThe meeting, Monday, went fairly smooth until it was time for Ordinance Officer John Perry’s report during the department reports.\n“There were three issues,” said Perry.\nNewell resident Ryan Klima spoke up.\n“Am I one of the issues?” he questioned.\nPerry responded that he was. Klima asked the names of the two others deemed to be in ordinance violations. When Mayor Mike Keolker declined to share names and addresses, Klima said he would be in (the office) the next day to find out who the other complaints were against.\n“I want to know if I’m being singled out,” Klima said.\nPerry said that Klima needed to respond to the request for a schedule of repairs if he wanted extra time to fix things.\n“It’s just a matter of taking the next step,” said Perry. Another person in attendance stated that people in the trailer park were ‘poor’ and couldn’t afford to fix roofs and replace windows.\nFinance Officer Jennifer Parrow was appointed for another year, but Commissioner Andy Howie wants a possible ordinance change in the way the finance officer may, in the future, be terminated.\nCurrently the mayor has the authority to fire employees who are appointed by the city commission, which includes the finance officer. Howie was concerned about that aspect. He said other communities have had their mayor fire finance officers, and he wanted the commission to have more say in the matter.\nKeolker asked Howie if he would like to pursue this, to which Howie said yes.\nParrow reported that the local school district would join the city for the elections in April, sharing expenses for election officials. Each entity would do its own advertising and legal publications.\nBar Manager Lorri Olson said that she has two events coming up soon, a sip-n-paint activity on Jan. 13 and karaoke on Jan. 20.\nMuseum Curator Linda Velder said that she is continuing to work on putting inventory in the new program.\nLibrarian Lisa Wonderly said she has been dealing with many maintenance issues this month with lighting being the major concern.\n“The bulbs needed to be replaced, and when we tried to do that we found that the fixtures are so old it is hard to get bulbs,” said Wonderly. “Replacing the number of fixtures we have would be a major expense.”\nCommissioner Allen Youngberg questioned a $28,500 expenditure to All American Roofing, the company that has done some of the repairs on buildings after the summer of 2017 hailstorm. Later in the agenda the board discussed the fact that there still aren’t concrete figures for adjusters’ amounts and how they compare with the amounts paid to the city from the insurance company.\nThe board adjourned to executive session with the city attorney for personnel issues.\nTo read all of today’s stories, Click here or call 642-2761 to subscribe to our e-edition or home delivery.", "url": "https://apnews.com/8065a7f182f3483ca571d850ed51453f"}