{"authors": ["Dave Peyton"], "date_download": "2020-05-04 20:21:35", "date_modify": "2020-05-04 20:21:35", "date_publish": "2018-09-23 08:31:38", "description": "Mary Ellen Wolfe? Sure, I know her. She's \"Chicken\" Wolfe's granddaughter and Kim and Debbie Wolfe's kid. She married that Tyce Nielson boy and they became iconic acrobats. They scared me to...", "filename": "_cd86c989d9934778a45277222f63aff6_1588623695.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cd86c989d9934778a45277222f63aff6_1588623695.html", "title": "Mary Ellen shows 'never' is not in family's vocabulary", "title_page": "Mary Ellen shows 'never' is not in family's vocabulary", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mary Ellen Wolfe? Sure, I know her. She’s “Chicken” Wolfe’s granddaughter and Kim and Debbie Wolfe’s kid.\nShe married that Tyce Nielson boy and they became iconic acrobats. They scared me to death every time they did their act on “America’s Got Talent.” They should have won the million dollars.\nI grew up a stone’s throw from the Wolfe family. I lived in the hollow and the Wolfe family lived on the hill.\nI’ve known Kim, Mary Ellen’s dad, since he was about 12 years old. Even at 12 he was a serious young man. We went to the same church — Mount Union United Methodist. He became a Mormon — a local Mormon bishop, in fact — and I became, well, I became a non-Methodist.\nI remember the few times Mother Debbie loaded up her gaggle of kids and came down to see the Peytons.\nMary Ellen was one of them. Debbie and Susie and I would talk while the kids, including Mary Ellen, ran hither and yon through the yard. Good kids. Every one of them.\nThe only definition I give to the Wolfe family is “solid.”\nWhen Kim ran for Cabell County sheriff, I told him he would be the only county sheriff I had ever completely trusted if he won.\nHe won. He and I didn’t see eye to eye on politics, but I voted for him because I trusted him. Still do.\nWhen Kim became Huntington’s mayor, it was the only time he and I lived more than a couple miles apart. He moved to the city but returned to the hill when he was no longer mayor.\nToday Kim lives on the farm where “Chicken” lived.\nThe first I heard of Mary Ellen as an adult, I learned she wanted to be an acrobat and they said she was pretty good. Then the bad news drifted over Facebook that she had badly injured her foot and doctors said she’d never walk without a limp again — and acrobatics was out of the question.\nLittle did they know...\nMary Ellen is a Wolfe and “never” is not in that family’s vocabulary.\nKim and Debbie were in Los Angeles when Mary Ellen and Tyce did their acrobatic magic. They wanted to win the top honor, not only for the million dollars but for the opportunity to live in Las Vegas with their young son instead of dragging him half way around the world to perform.\nThe latest word is that the acrobats will spend at least six weeks performing in Reno and then a show or two in Las Vegas.\nI’ll betcha they’ll wind up with a long-term show of their own in the west, probably Las Vegas.\nAfter all, Mary Ellen is “Chicken’s” granddaughter and Kim and Debbie’s daughter.\nDave Peyton Is on Facebook. His email address Is davepey-ton@comcast.net.", "url": "https://apnews.com/cd86c989d9934778a45277222f63aff6"}