{"authors": ["Tony Paul", "The Detroit News"], "date_download": "2020-05-04 20:21:11", "date_modify": "2020-05-04 20:21:11", "date_publish": "2018-03-24 21:51:44", "description": "Tested like it rarely has been all season, the Ferris State men's basketball team won the Division II national championship, 71-69, over Northern State (S.D.) in Sioux Falls, S.D., on Saturday...", "filename": "_aceedef3501c4a49bea898af1b88eff2_1588623671.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aceedef3501c4a49bea898af1b88eff2_1588623671.html", "title": "Ferris State basketball wins Division II national championship", "title_page": "'Unbelievable': Ferris State basketball wins Division II national championship", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tested like it rarely has been all season, the Ferris State men’s basketball team won the Division II national championship, 71-69, over Northern State (S.D.) in Sioux Falls, S.D., on Saturday afternoon.\nIt marks the first national championship in any sport for Ferris State, which finished 38-1, and with 26 consecutive wins.\n“I’ve been dreaming about this kind of stuff since I was young,” Ferris State head coach Andy Bronkema told CBS moments following the game, confetti still falling.\nFerris State hadn’t trailed in either of its Elite Eight of Final Four victories, but was down early to the crowd favorite, Northern State, before rallying to take a slim lead at halftime, 39-37.\nThe second half was more of the same, with neither team ever leading by more than three points.\nAnd the finish was just as frantic.\nBOX SCORE: Ferris State 71, Northern State 69\nAfter senior center Zach Hankins’ defense stifled a shot by Northern State’s DJ Pollard with 10 seconds remaining, junior wing Markese Mayfield grabbed the rebound, was fouled and went to the line. He made the first, but refs waved it off because his foot was on the line. He then composed himself, made the second and got back on defense.\nNorthern State, opting not to call a timeout, raced down the court and Darin Peterka got off one last deep – albeit, open – 3 for the win, but it came up well short, and the celebration was on for the hundreds of Ferris State students and officials who made the 12-hour drive from Big Rapids to the Sanford Pentagon.\n“One shot,” Bronkema said. “One shot that looked good from my angle. It was right on track, but it was short, we came up with the rebound and we won it.”\nNorthern State had three turnovers and no points in the final 2 minutes, 55 seconds after taking a 69-66 lead.\nA pair of free throws tightened things, and then Hankins, the 6-foot-10, 255-pound Division II Midwest Region player of the year from Charlevoix, made a layup with 1:31 left for a 70-69 lead.\nThen, with 1:07 left, senior wing Noah King out of U-D Jesuit picked up a steal and had a clean, fastbreak look at a layup, but he missed – and officials said the ball went out of bounds off him. A review reversed that and Ferris State kept it.\nMayfield missed a 3, though, allowing Northern State potentially the final shot, with just a couple seconds difference between the shot and game clocks. That shot, by Pollard, was heavily contested by the much-taller and beefier Hankins, who finished with team-highs of 19 points and five rebounds.\nAfterward, during a postgame interview, Hankins wiped away tears.\n“Unbelievable,” he said. “We’ve been working so long for this.”\nSenior wing Peter Firlik had 12 points and Mayfield 11 for Ferris State, whose 38 wins tied the Division II record, previously set by Winona State (Minn.). Ferris State is the second DII national champion out of the Great Lakes Intercollegiate Athletic Conference, joining Findlay (2009), and the first ever DII national champion from Michigan.\nFor Northern State (36-3) – whose campus in Aberdeen is about 200 miles from Sioux Falls – Carter Evans led with 20 points, and Peterka and Logan Doyle each scored 14.\ntpaul@detroitnews.com\ntwitter.com/tonypaul1984", "url": "https://apnews.com/aceedef3501c4a49bea898af1b88eff2"}