{"authors": ["Sentinel"], "date_download": "2020-05-04 20:18:12", "date_modify": "2020-05-04 20:18:12", "date_publish": "2018-08-12 10:37:59", "description": "By Hank Stuever The Washington Post Weirdness runs through television's more daring shows. It's a predictably outré mood that shades some of the best crime sagas (Breaking Bad),...", "filename": "_07ffed8e49734c4c837ef47dfa721372_1588623492.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_07ffed8e49734c4c837ef47dfa721372_1588623492.html", "title": "In Lodge 49, a Pleasingly Odd Place", "title_page": "In Lodge 49, a Pleasingly Odd Place", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Hank Stuever\nThe Washington Post\nWeirdness runs through television’s more daring shows. It’s a predictably outré mood that shades some of the best crime sagas (Breaking Bad), complex dramas (The Leftovers) and half-hour hipster comedies (Atlanta), yet it’s the kind of weirdness that usually serves as a backdrop to a larger through line. We don’t have enough shows that are just casually and pleasingly odd for the sake of being so.\nLodge 49, on AMC, is exactly the right kind of weird. Without ever becoming a violent criminal spree or a baffling head-scratcher, it’s simply a melancholy, 10-episode rumination on loss and friendship.\nThe series, created by Jim Gavin, is about an unemployed, millennial surf bum, Dud (Wyatt Russell), who finds a new purpose by joining the Ancient and Benevolent Order of the Lynx -- a fading, Long Beach, California, social club populated by late-middle-age baby boomers (men and women), who all feel some degree of sorrow about the way things used to be.\nBright-eyed and shaggy, Dud’s eternal optimism has been tested in the past year or so. On a surfing trip to Nicaragua, a poisonous jungle snake bit him, which left him with a permanent limp. After Dud returned home, his father disappeared while swimming at a nearby beach; his body was never found. Dud and his twin sister, Liz (Sonya Cassidy), discovered that their father’s pool-supply shop was gravely in debt. They lost both the business and the family home.\nLiz works at an Irish-themed chain restaurant (called Shamroxx), counting her tips and obsessing over the $80,000 bank loan she unwittingly co-signed for her father.\nDud, who often sleeps in his beat-up VW Thing or on his sister’s sofa, is in deep hock to the pawnshop that sits a couple of strip-mall spaces from his father’s vacant storefront. Caught lingering -- and trespassing -- at his father’s old house, he’s clearly a lost soul in a suspended state of grief. Russell (the son of Goldie Hawn and Kurt Russell) gives an instinctively laid-back and exquisitely wounded performance throughout the series -- a Spicoli-esque boy interrupted, facing hopelessness where he once only saw sunshine.\nOne morning, while hunting for valuables along the beach with a metal detector, Dud finds a ring with the Lynx insignia. Through coinkydinks (and an empty gas tank), he knocks on the door of Lodge 49 and the show more or less begins.\nDud is enchanted by the idea of the musty club, with its lingering air of secrets and rituals once kept by its members -- throne rooms, inner sanctums, alchemy and pseudoscience. Now it’s mainly a tavern for people who used to work at the nearby aerospace manufacturer, which is in its final stages of shutting down.\nThe chapter’s grand poobah, Larry (Kenneth Welsh), has been acting strangely, preparing his likely successor, Ernie (Brent Jennings), a plumbing-supply salesman, to take over. This necessitates an emissary from the Order of the Lynx’s London headquarters to visit Lodge 49 and reassess its status.\nAs Lodge 49 sets up, viewers may find themselves anticipating more action. There are plenty of characters here so desperate for money that you half expect the lodge to start laundering cash or some other dangerous scheme. Where’s the hit man? The crime boss? The heist? That’s where most shows take their weirdness; we’ve been trained to expect a bigger hook.\nLodge 49, on the other hand, remains utterly human in scope and ambition -- funny and meandering. There’s a whiff of the supernatural in the lore of Order of the Lynx, involving secret scrolls and the mystic belief in a “true lodge.” But these things never get in the way of the show’s essential and delightful magic, which is about a dude who is learning to abide.\nLodge 49 shows on AMC on Mondays at 10 p.m.", "url": "https://apnews.com/07ffed8e49734c4c837ef47dfa721372"}