{"authors": ["John Niyo", "The Detroit News"], "date_download": "2020-05-04 20:05:48", "date_modify": "2020-05-04 20:05:48", "date_publish": "2018-01-25 01:53:59", "description": "Detroit — As marketing pitches go, Al Avila knows this one is a tough sell. \"Everybody talks about this season as, 'Are the Tigers gonna be that bad?',\" the Tigers' general manager said at a...", "filename": "_7d9ff3e30c6546c389bc1e1230d9501a_1588622748.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7d9ff3e30c6546c389bc1e1230d9501a_1588622748.html", "title": "Avila's sales pitch for Tigers a big challenge", "title_page": "Niyo: Avila's sales pitch for Tigers a big challenge", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Detroit — As marketing pitches go, Al Avila knows this one is a tough sell.\n“Everybody talks about this season as, ‘Are the Tigers gonna be that bad?‘,” the Tigers’ general manager said at a Detroit Sports Media luncheon Wednesday, a day before his team rolls out its annual winter caravan ahead of spring training.\nBut the truth is, they just might be. Probably not bad enough to give the 119-loss Tigers of 2003 a run for their money. But bad enough that the unsold tickets to this weekend’s TigerFest certainly won’t be the only ones the team is scrambling to unload this year.\nSo if honesty is the best policy, this is a start, at least. After doling out more than $400 million in payroll for a combined 150 wins the last two seasons, the spendthrift days are over in Detroit. And while some other franchises aren’t ready to cash out just yet — Seattle, San Francisco, and so on — the Tigers aren’t hiding their intentions.\nMore:Tigers’ Avila not enticed by possible free-agent bargains\n“Now we’ve come out and told our fans, ‘We’re rebuilding,’” Avila said. “And you can see it by our actions. We’ve traded all the big-name players, we’ve acquired young players, we’re gonna go with young players on the field. We’re in a full rebuild. ...\n“It’s hard to play the middle game when you have that kind of payroll. And for us ... we just felt we couldn’t play the middle game anymore. We had to go all-in with a full rebuild. I think the majority of people understood that. I think the majority of people wanted to see that. I think the shock came when it became true. And it was like, ‘Oh, my God!’ Now we’re in a full rebuild.”\nExcused absence\nWhether most fans really wanted to see that or not — attendance figures no doubt will suggest otherwise in 2018 — they’re about to get their first glimpse at what that really means. First at TigerFest, where in addition to all the subtracted stars — Justin Verlander and J.D. Martinez and Ian Kinsler and Justin Upton – veterans like Miguel Cabrera, Victor Martinez and Jose Iglesias also will be missing for personal reasons this weekend. And then once the voice of the turtle is heard and even diehard fans go searching for a lineup card.\nAs Avila began talking Wednesday about the Tigers’ offseason additions, he wasn’t talking about the kind of big-name free agents signed in years past. Instead, he was talking about middle infielders signed to minor-league contracts — players like Alexi Amarista, Niko Goodrum, Pete Kozma, Ronny Rodriguez.\nMore:Mensching: Step up, Tigers: Retire Whitaker’s number\nDon’t laugh: One of them could be your starting second baseman this summer, if not sooner.\nAnd yet that’s also why Avila, the GM with rich scouting bloodlines, sounds so energized by what he calls “the biggest challenge of our careers.” He’s been through similar trials in Florida and here in Detroit more than a decade ago as Dave Dombrowski’s chief lieutenant. But now he’s in control.\n“So we’re embracing this,” he said. “Because this is what baseball people dream about, is to get a club like this and turn it around and make it a champion.”\nChip off the block\nAvila also lit up when asked Wednesday whether owner Chris Ilitch had the same passion as his father, Mike, who spared no expense in chasing an elusive World Series title until his passing last February.\nMore:Tigers land 3 prospects in Baseball America’s top 100\nAvila knows what people think when they see the payroll slashed after years of the opposite. But he points to new investments “in the infrastructure of our organization” as evidence that this isn’t simply a cut-and-run operation. He cites the more than $2 million invested in developing the team’s analytics department, now 10 members “and counting.” And then mentions other bigger expenditures to bolster the Tigers’ international pipeline — including a new team — as well as the scouting staff and player development system, from coaches to facilities and more.\nHe says one of Chris Ilitch’s first endeavors when he officially took the reins last winter was to join Avila on a trip to visit the Tigers’ Dominican League team as well as MLB’s Latin American headquarters in Santo Domingo. And next week, the owner will join Avila and his amateur scouting staff for their annual winter meetings in Lakeland, where they’ll all get a crash course in using “Caesar,” the Tigers’ new central data system. Avila also said he anticipates Ilitch joining him on scouting trips to the Tigers’ minor-league affiliates and elsewhere.\n“So he’s expressing his passion in a whole different way,” Avila said.\nSo is Avila, of course. At least when compared to his buttoned-up predecessor, Dave Dombrowski. Avila has a tendency to speak off the cuff, and did so again at times Wednesday. He has bristled at some of the criticism he has heard, as the Tigers’ last-ditch attempt at contending fell flat and the second-guessing began almost immediately with a pre-deadline deal — J.D. Martinez to the Diamondbacks for a trio of prospects — that was widely panned. And then there was the flak the Tigers took for signing catcher Derek Norris, who is coming off a Major League Baseball suspension resulting from domestic-abuse allegations.\n“It insulted the crap out of me,” Avila said, though he declined to specify what “it” was, exactly. “There’s certain people that thought we didn’t think things through.”\nThat’s not the case, he insisted, pointing to a table of some of his front-office staff seated nearby.\n“The effort is there; the expertise is there,” Avila said. “I guarantee you, at the end of the day, when it’s all said and done, this group right here, we’re going to be successful and take the Tigers to a championship in the near future.”\nThat last part — near future? — is obviously a stretch, and it contradicts much of what he has said the last six months about the painful rebuilding effort ahead. When I asked Avila back in October, the day the Tigers introduced Ron Gardenhire as their new manager, what a realistic timetable for this reconstruction era was, Avila offered a frank reply.\nHe wasn’t going to suggest a 10-year plan, he said. (Red Wings GM Ken Holland knows how well that plays with a fan base accustomed to winning.) But Avila wouldn’t offer a three-year plan, either, even though that’s the length of his current contract as GM. Why? Because “I don’t know if that’s realistic.”\n“Anywhere in between is the hope,” he added.\nAnd therein lies the problem, I suppose. The Tigers are no longer stuck in the middle. No, they’ve got a ways to go before they get back there.\njohn.niyo@detroitnews.com\ntwitter.com/JohnNiyo", "url": "https://apnews.com/7d9ff3e30c6546c389bc1e1230d9501a"}