{"authors": ["Kent Youngblood"], "date_download": "2020-05-04 20:27:48", "date_modify": "2020-05-04 20:27:48", "date_publish": "2018-08-21 19:56:43", "description": "The Associated Press WNBA awards were announced Tuesday, and there weren’t a lot of surprises. Breanna Stewart of Seattle was named the Player of the Year, A’ja Wilson of Las Vegas the unanimous...", "filename": "_f46082dced1247f1a494b66622c13d47_1588624068.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f46082dced1247f1a494b66622c13d47_1588624068.html", "title": "Sylvia Fowles of Lynx named Defensive Player of Year", "title_page": "Sylvia Fowles of Lynx named Defensive Player of Year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Associated Press WNBA awards were announced Tuesday, and there weren’t a lot of surprises. Breanna Stewart of Seattle was named the Player of the Year, A’ja Wilson of Las Vegas the unanimous Rookie of the Year, and Natasha Howard of the Storm the most improved.\nAnd while the Lynx — who played Los Angeles in a first-round, single-elimination game Tuesday night at Staples Center — didn’t have the season they’d hoped, a couple of their players were honored.\nCenter Sylvia Fowles was named Defensive Player of the Year for the fourth time in her career and for the second time with the Lynx. She led the league in rebounding, setting a single-season league record with 404. She was also in the top 10 in steals and blocks.\nFowles, who led the league in field goal percentage (61.9), and Maya Moore were named to the second-team All-WNBA team.\nStewart averaged 21.8 points, 8.4 rebounds and shot 52.9 percent from the field this season to help the Storm earn a bye until the semifinals of the playoffs. She received 12 of the 14 votes with Liz Cambage of Dallas earning the other two.\n“The biggest change I made besides improving on the court was preparing myself off the court,” Stewart said in a phone interview with the Associated Press. “Make myself strong and take care of my body nutritionally.”\nHere are the other award winners:\n• Atlanta’s Nicki Collen, Coach of the Year.\n• Connecticut’s Jonquel Jones, Sixth Player of the Year.\n• Phoenix Mercury forward DeWanna Bonner, Comeback Player of the Year.\n• First-team All-WNBA: Stewart, Cambage, Elena Delle Donne, Washington; Diana Taurasi, Phoenix; Tiffany Hayes, Atlanta\n• Second-team: Candace Parker, Los Angeles; Moore, Fowles, Brittney Griner, Phoenix; Skylar Diggins-Smith, Dallas\n• All-rookie team: Wilson, Azura Stevens, Dallas; Kia Nurse, New York; Kelsey Mitchell, Indiana; Ariel Atkins, Washington; Diamond De Shields, Chicago.", "url": "https://apnews.com/f46082dced1247f1a494b66622c13d47"}