{"authors": ["Jackie Crosby"], "date_download": "2020-05-04 20:15:22", "date_modify": "2020-05-04 20:15:22", "date_publish": "2018-01-30 19:37:13", "description": "The morning commute so far this week has been pretty sweet for workers venturing to jobs in downtown Minneapolis amid Super Bowl LII festivities. Many businesses have encouraged their...", "filename": "_29f072ab81ec4fd2be13ed228565a20c_1588623322.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_29f072ab81ec4fd2be13ed228565a20c_1588623322.html", "title": "Morning commute OK, but Super Bowl activities disrupting afternoon traffic", "title_page": "Morning commute OK, but Super Bowl activities disrupting afternoon traffic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The morning commute so far this week has been pretty sweet for workers venturing to jobs in downtown Minneapolis amid Super Bowl LII festivities.\nMany businesses have encouraged their workers to telecommute or use public transit, which means the early birds are finding spaces aplenty in downtown parking ramps.\nWeve been pushing out the message to downtown employers and commuters: Get to work on time, be productive and stay for the celebrations, said John Barobs, a spokesman for Move Minneapolis.\nThe transportation management organization, which promotes mass transit, carpooling, biking and walking, has been juggling priorities as it works to keep downtown lively but not congested.\nThe organization has been trying to get the word out on social media and has distributed 10,000 of Metro Transits Super Bowl Service guides to downtown employers.\nRestaurants and other businesses that depend on downtown workers are feeling the pinch.\nMax Broich, owner of Maxs Cafe at the skyway level at Second and Washington avenues, said business has been down 20 percent because workers are telecommuting.\nIts been a ghost town, agreed Alen Wong of So Good Asian, a restaurant in U.S. Bank Plaza overlooking Fifth Street. Nobodys coming here. Theyre all working from home.\nIts difficult to quantify how many workers are staying away.\nWells Fargo, with 11,000 employees downtown, encouraged workers to telecommute this week, and made alternative site arrangements for others where necessary and possible, said spokesman John Hobot.\nHobot said the companys East Town campus near the stadium is already quieter, and he predicts it will be even more sparse Thursday and Friday.\nThe 13,000 employees at U.S. Banks headquarters are being encouraged to participate in all downtown activities, and the company is sharing messages about street closures, security changes and other issues affecting the workforce.\nThe idea is to run our business as normal, said spokeswoman Susan Beatty.\nWork-from-home arrangements are an option for downtown employees, but we recognize that some employees are not able to work remotely, so we are encouraging managers to be flexible, she said.\nAt Target Corp., with nearly 9,000 downtown workers at its headquarters and store, spokesman Joshua Thomas said he hasnt seen a big drop-off.\nAnecdotally, I havent noticed a difference. The Starbucks line is just as long as a typical morning at 8 oclock, he said. Team members are excited and curious about what Nicollet Avenue looks like with all these activations.\nInstagramming from home\nFrom its perch on the third floor of the IDS Tower, the architecture and design firm Perkins + Will is in the thick of Super Bowl LII activities, overlooking Crystal Court and Nicollet Mall.\nAll 72 employees at Perkins + Will were told to work remotely or from home this week, and were encouraged to post their experiences on Instagram and Twitter as a marketing strategy.\nWorking mobile, working from different locations is something that we promote, said landscape architect and urban designer John Slack, one of the principals.\nThe company already has a fully mobile office, Slack said. No one has assigned seats.\nPart of the work we do is workplace strategy and helping people design how theyll work in the future, he said. This is just another way of getting it out there on social media.\nThe 6,500 Hennepin County employees are responding to the expected crush in various ways, depending on their job duties.\nThe biggest impact has been felt by social service workers, said Michael Rossman, the countys chief human resources officer. Teams of employees have spent months planning ahead to reschedule appointments outside of the downtown core to ensure those who need services can get them.\nEvery part of county has made an assessment about who needs to be here and who doesnt, Rossman said. We dont want to contribute downtown traffic; we want to make sure this is successful.\nThe real crush is expected to come later this week, when those 65,000 downtown parking spaces will be at a premium.\nMetro Transit officials have added bus service and amped up communication through the agencys website and social media to warn people of expected delays. With roads closed, drivers will see a more hectic rush hour.\nIts all about patience and making sure to partake in the fun, said Move Minnesotas Barobs.\nThe best commute is no commute, Barobs said. We do, however, want downtown commuters to take part and enjoy the Super Bowl festivities that are happening right at their office doorstep.\nJackie Crosby 612-673-7335", "url": "https://apnews.com/29f072ab81ec4fd2be13ed228565a20c"}