{"authors": ["Robert Nott"], "date_download": "2020-05-04 20:28:00", "date_modify": "2020-05-04 20:28:00", "date_publish": "2018-09-16 05:30:00", "description": "U.S. Army veteran Brian Ray was sitting tall in the saddle of a palomino quarter horse at the Crossed Arrows Ranch south of Santa Fe. The combat vet, who had spent three decades in the military,...", "filename": "_314cc2e4909b40cea71d38d4f6ebb9bc_1588624080.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_314cc2e4909b40cea71d38d4f6ebb9bc_1588624080.html", "title": "Horses for Heroes program gives veterans, active-duty military personnel chance to cowboy up", "title_page": "Horses for Heroes program gives veterans, active-duty military personnel chance to cowboy up", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "U.S. Army veteran Brian Ray was sitting tall in the saddle of a palomino quarter horse at the Crossed Arrows Ranch south of Santa Fe. The combat vet, who had spent three decades in the military, including two tours in Iraq as an adviser, focused his heart, mind and body on his connection with the horse.\n“We both have that same mindset,” Ray said. “Training to trust. We [combat veterans] don’t want to be psychoanalyzed by experts. We don’t want somebody sitting there listening to us and taking notes. Horses don’t take notes. They don’t judge. And they learn to trust.”\nRay is both a student and trainer-in-training in the Horses for Heroes Cowboy Up! program headquartered at the ranch. This 10-year-old nonprofit offers a free horsemanship program to all post-9/11 combat veterans and active-duty military personnel, especially those dealing with combat trauma or physical injuries sustained during their service.\nThe goal, co-founder and Executive Director Rick Iannucci said, is to let the participants adapt the skills they learned in the military to the cowboy way of life — it gives them purpose and a chance to bond with others who have similar military backgrounds.\n“Two things we don’t do here: We don’t do horse therapy and we don’t sing ‘Kumbaya,’ ” he said. “It’s Cowboy 101.”\nThe vets who apply and are accepted to the program come to the ranch for 10 days and start learning about horses within a day. Some may find themselves working as cowboys on neighboring ranches during the training. They ride, rope, groom the horses, clean out the barn and shovel manure.\nCo-founder Nancy De Santis leads the veterans in a morning round of Cowboy Yoga to ground them.\nThe veterans — about half of whom are women — sleep in a bunkhouse similar to a military barracks and sit on the porch at night to share war stories and express their feelings about guilt, despair, hope and even suicide.\n“What happened [in combat] disconnects us from the normal way of living,” said Ray, a Los Alamos native who served in the U.S. Army from 1985 to 2015.\n“What we saw, what we did, what we didn’t do, what we should have done” — that stays with you, he said. Working with horses makes it go away, even if for just a while.\nHe began volunteering at the Horses for Heroes program after retiring in 2015, prompted by his wife, who was getting tired of him sitting around the house in his underwear, watching television. He began working directly with the horses recently and wants to learn how to be a trainer “because I want to help.”\nThe program is not intended as a cure-all for post-traumatic stress disorder or a sure way for participants to get jobs as cowboys — although some do. Rather, Iannucci said, it helps the veterans understand they can apply what they once knew to any aspect of life.\nThey leave the Horses for Heroes program “with a multi-tool case of skill sets, understanding how to rework their military skills to make them applicable to anything,” he said.\nDr. Gerry Valentine, a consulting psychiatrist for Horses for Heroes and a former Veterans Affairs Department research psychiatrist, said a number of components in the program play a role in helping veterans.\n“It’s intensive; it has an immersive spirit to it,” he said. “There’s the openness of the setting and the horses.”\nHorses can easily read the energy and behavior of their human companions and be “very unforgiving” if the proper connection is not built between the two, Valentine said.\nWhat the horses do, he said, “is nudge the veterans toward engagement in a social interaction that is safe and positive, a nudge toward creating a trust system that can address the core symptoms of PTSD — a lack of trust, a lack of meaning, withdrawal. Horses nudge toward coming back into a full social world.”\nIannucci, a former Green Beret, retired U.S. marshal and ordained minister, started the program 10 years ago as an extension of other horse-related programs he was running that focused on post-9/11 vets and military personnel. “We saw a need to pay attention to them,” he said.\nHe prefers to call symptoms enveloping combat veterans “post-traumatic spiritual dissonance.” He hopes the program helps participants “get down to the core of what happened during war that impacted their spirit as well as mind and body,” Iannucci said.\nRay gets that. In talking to other veterans about the impact of the program, he tells them, “If you’re worrying, you’re living in the future. If you are sad or angry, you are living in the past. But if you are calm, you are living in the present. And a horse makes you live in the present. Because of their ability to read our moods, they’ll only work well with you if you are in the present.”", "url": "https://apnews.com/314cc2e4909b40cea71d38d4f6ebb9bc"}