{"authors": ["Theresa Clift"], "date_download": "2020-05-04 20:11:04", "date_modify": "2020-05-04 20:11:04", "date_publish": "2018-04-11 21:05:19", "description": "Temperatures in the 30s and some snow on the ground didn't keep hungry people from the first weekend of the Pittsburgh Food Truck Park. Ray Apryasz, owner of Evil Swine BBQ, wasn't sure how...", "filename": "_52ad29ed5b1a48aabc1dd6846f4bac3c_1588623064.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_52ad29ed5b1a48aabc1dd6846f4bac3c_1588623064.html", "title": "Pittsburgh Food Truck Park open for business", "title_page": "Pittsburgh Food Truck Park open for business", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Temperatures in the 30s and some snow on the ground didn’t keep hungry people from the first weekend of the Pittsburgh Food Truck Park.\nRay Apryasz, owner of Evil Swine BBQ, wasn’t sure how the park would be received. But when he saw a crowd at 11 a.m. Saturday, right as the Millvale attraction opened, he was encouraged.\n“That says a lot,” Apryasz said. “It’s a great concept.”\nApryasz has operated his food truck for more than three years, mostly in office parks around Moon, where he is from.\nThese days, he’s well connected in the food truck scene and finds out when there are events. But for those just starting out, it can be difficult. The park will help them, especially, he said.\nApryasz likes that the park is a designated place where he is always welcome, unlike Downtown Pittsburgh, he said.\n“It’s hard to get in the ‘Golden Triangle,’” Apryasz said. “I won’t try going Downtown unless I’m invited.”\nJamie Tinstman, owner of Sinkers & Suds, a dessert truck, agreed.\n“There are a lot of rules and regulations so having the park is easier,” said Tinstman, who operates the truck with her husband as a full-time job. “For us, being a dessert truck, it’s nice when we’re paired up with lunch or dinner trucks. It’s kind of the perfect situation for us.”\nThe park is in preview season right now. Vendors won’t start paying a fee until May, Apryasz said.\nMore than a dozen food trucks have signed up to participate on a rotating basis.\nThe park sits near the Allegheny River and features a beer garden, yard games and a performance stage.\nDominic Richards, of Gibsonia, ate something at every truck at the park — a burger from Michele’s Mobile Meals, nachos from Evil Swine BBQ, and doughnuts from Sinkers & Suds.\n“I’ll be back in the summer with a bunch of friends,” he said.\nZach and Karen Braden of Avalon had been waiting for the park to open for months.\n“We wanted to support local businesses, and I think this is a great way to do that,” Karen Braden said.\nZach Braden hopes people can find the park since it is separated by the railroad tracks from the other breweries in Millvale, he said.\nKaylee and Martin Morgan of Castle Shannon were looking for a fun father-daughter activity when they found the park.\n“You don’t have to worry about stuff you have to at bigger events, like parking, and it’s only Pittsburgh products,” said Martin Morgan as he waited for a Cuban sandwich from Michele’s to arrive.\n“The vibe here is really nice and friendly,” Kaylee Morgan added, while enjoying a pulled pork sandwich and mac and cheese from Michele’s.\nTheresa Clift is a Tribune-Review staff writer. Reach her at 412-380-5669, tclift@tribweb.com or via Twitter @tclift.", "url": "https://apnews.com/52ad29ed5b1a48aabc1dd6846f4bac3c"}