{"authors": ["Tom Eggers"], "date_download": "2020-05-04 20:13:47", "date_modify": "2020-05-04 20:13:47", "date_publish": "2018-04-22 00:15:00", "description": "DRAIN — It was nice to see that smile of Nicki Derrick's again. I visited a North Douglas High softball practice on Tuesday to interview the sophomore pitcher, who's missing this season with...", "filename": "_08fc4a56651d44299c5d81d2be59abfa_1588623227.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_08fc4a56651d44299c5d81d2be59abfa_1588623227.html", "title": "North Douglas' Nicki Derrick deals with missing softball season due to injury", "title_page": "Commentary: North Douglas' Nicki Derrick deals with missing softball season due to injury", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DRAIN — It was nice to see that smile of Nicki Derrick’s again.\nI visited a North Douglas High softball practice on Tuesday to interview the sophomore pitcher, who’s missing this season with a torn ACL and meniscus in her left knee.\nA three-sport athlete for the Class 1A Warriors, the 15-year-old Derrick suffered the injury during North Douglas’ last basketball game of the winter season — a 35-31 overtime loss to Elkton at the Skyline League district tournament in Sutherlin on Feb. 17. The all-Skyline second-team guard got hurt in the extra session.\nThe 5-foot-5 Derrick underwent surgery on March 26 and is rehabbing the knee, hoping to return to competition in late October — which would be near the end of volleyball season. Derrick, a setter, overcame an injury early in the season and played a key role in the Warriors’ fourth-place finish at the 1A volleyball tournament last November.\n“It was really emotional (after the latest injury),” admitted Derrick, who’s the daughter of Jeff and Sheri. “The first month we were being bounced around doctors, not knowing If I was going to have the surgery or not, or how long I could go without having it.\n“Lots of ups and downs ... some days we’d get good news and some days I’d just come back and be heartbroken. When we scheduled the surgery that was one of the hardest days. I’ve had injuries, but this is definitely the one that got me. But it’s also the one I think I’m going to grow from.”\nIt’s a tough blow for Derrick — who was honored as the Class 2A/1A softball player and pitcher of the year as a freshman in 2017 — to be on the sidelines during her favorite sports season. She seems to be handling it well, though, attending practices and games and helping out the other pitchers.\n“You kind of realize how lucky you are to have the opportunities you have,” said Derrick. “High school sports are an opportunity, not a privilege. You don’t realize that until something like this happens to you. It’s made me do other things; I’ve really enjoyed working with the younger pitchers and getting involved with the community. I just have to stay busy and know there’s a bigger plan for me.”\nThe Warriors, guided by Jesse Rice, won their first state softball championship last year with a 3-1 upset of Pilot Rock at the OSU Softball Complex in Corvalils. Derrick was brilliant in the playoffs, starting with a five-inning no-hitter against Waldport in the first round and concluding with a four-hitter versus the two-time defending champion Rockets in the final.\nDerrick struck out 10 and walked two in the championship game, and also delivered some big hits at the plate in the postseason. The Warriors defeated three higher seeds in the playoffs.\nShe was a force at the plate, leading the Warriors with 14 home runs and was first in RBIs.\nDerrick’s year got even better in the summer. She was a member of the Indian Fastpitch 16U team that won the ASA Western Nationals.\nNorth Douglas isn’t as good this season without Derrick, but it’s still a state contender. The Warriors improved to 11-3 overall after Thursday’s road win at Oakridge. They lead Special District 3 at 6-0 and are No. 5 in the OSAA 2A/1A power rankings.\nWith the likes of all-state players Payton Black, Riley Black and Sofia Alcantar around, and Crow’s Whitney Anderson joining the team this season, the Warriors look capable of making another postseason run.\n“Nicki was a tremendous factor. She was a big part in the championship (last year),” said Alcantar, the centerfielder. “I think we’re pretty strong this year, too. Yes, it’s a big difference without Nicki, but I think we can make it through. We have a strong bond like last year.”\nRice agrees.\n“We had really high expectations with Nicki coming back,” the coach said. “It was just kind of a shock when we learned we wouldn’t have her, but the senior girls (Amy Dooley, Payton Black, Lilly Downie and Anderson) walked up to me and said, ‘we got this coach.’ And we haven’t looked back.\n“We have an inexperienced pitcher (sophomore Hope Morgan) coming up, and she’s trying hard and getting better every day. We’re going to be all right ... at the end of the season we’ll be in the hunt.”\nDerrick has gained a new outlook of the game from the dugout.\n“It definitely gives you a different learning experience,” she said. “You see the game from a different perspective that you wouldn’t see if you were out there. You can be a great player and you just don’t see some of the stuff that you see when you’re out. You mentally look at the game. As a player you warm up and don’t really look at the other team mentally, you look at them physically. I’ve been able to see that.”\nDerrick’s teammates like having her around, even if it’s not in a playing capacity.\n“It’s her leadership. Last year her leadership was really strong,” said Alcantar. “She sits in the dugout with us and pats our backs. She supports us. She can’t do anything, but she’s there with us and it feels good.”\nWe’ll be looking forward to Nicki Derrick’s return to the court and diamond, whenever that may be.", "url": "https://apnews.com/08fc4a56651d44299c5d81d2be59abfa"}