{"authors": ["Tara O'Neill"], "date_download": "2020-05-04 20:15:30", "date_modify": "2020-05-04 20:15:30", "date_publish": "2018-03-09 22:53:24", "description": "STAMFORD — A former Stamford resident will serve half a year in prison and pay a fine for operating an immigration fraud scheme, the Department of Justice said Friday. David Nikolashvili,...", "filename": "_0282ede2433e4b91a569dbfc940f8cc9_1588623330.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0282ede2433e4b91a569dbfc940f8cc9_1588623330.html", "title": "DOJ: Former Stamford man to serve 6 months for immigration fraud scheme", "title_page": "DOJ: Former Stamford man to serve 6 months for immigration fraud scheme", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STAMFORD — A former Stamford resident will serve half a year in prison and pay a fine for operating an immigration fraud scheme, the Department of Justice said Friday.\nDavid Nikolashvili, 52, a citizen of the Republic of Georgia and residing in Queens, New York, was sentenced to six months imprisonment, followed by two years of supervised release for operating an immigration fraud scheme, the DOJ said.\nThe judge also ordered Nikolashvili to pay a $12,000 fine.\nNikolashvili, formerly of Stamford, operated an immigration fraud scheme during which time, the DOJ said, he tried to get false immigration status from the U.S. Citizenship and Immigration Services for at least 60 citizens from European countries.\nThe DOJ said after the European citizens paid Nikolashvili between $12,000 and $20,000, he would arrange fake marriages between the European citizens and U.S. citizens to get immigration benefits. The U.S. citizens were also paid to participate in the sham marriages, the DOJ said.\nNikolashvili was arrested on June 21, 2016. On July 26, 2017, he pleaded guilty to one count of making a false swearing in an immigration matter.\nHe was released on a $75,000 bond and was ordered to report to prison on April 27.\nAll the citizenship cases connected to this scheme were reviewed by the USCIS Fraud Detection and National Security and proper action was taken, the DOJ said.\nAfter he is released from prison, Nikolashvili faces immigration proceedings.", "url": "https://apnews.com/0282ede2433e4b91a569dbfc940f8cc9"}