{"authors": ["Tony Larussa"], "date_download": "2020-05-04 20:08:41", "date_modify": "2020-05-04 20:08:41", "date_publish": "2018-08-23 00:57:51", "description": "The 18th annual Town of McCandless Community Day is scheduled to kick off at 12:15 p.m. on Saturday, Sept. 8, with a parade. The parade will run along Ingomar Road and conclude with an...", "filename": "_7d0cf4ac53c24c72a041dacae8aaf17c_1588622921.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7d0cf4ac53c24c72a041dacae8aaf17c_1588622921.html", "title": "Food, fun, fireworks featured at 18th McCandless Community Day on Sept. 8", "title_page": "Food, fun, fireworks featured at 18th McCandless Community Day on Sept. 8", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The 18th annual Town of McCandless Community Day is scheduled to kick off at 12:15 p.m. on Saturday, Sept. 8, with a parade.\nThe parade will run along Ingomar Road and conclude with an opening ceremony at the Town Hall on Grubbs Road. The annual event features rides, food, entertainment and activities for kids.\nLive performers will include the InTransit Band, the Allegheny Brass Band, Kardaz, the Red Hot Ramblers, Pittsburgh Puppet Works, Center Stage Dance Academy, Michele’s Dance Center and Allegro Ballet Academy.\nThe Frank J. Farina, Jr. Memorial Car Cruise will take place from 2 to 6 p.m. at the North Allegheny Intermediate High School parking lot located at 350 Cumberland Road.\nThe McCandless/Northern Allegheny Heritage Center will be open from 1 to 6 p.m. and will include a blacksmithing demonstrations at 2 p.m. and 4 p.m.\nThe day will conclude with a fireworks display at 9 p.m.\nParking will be available at the former Trader Horn lot along on Blazier Drive and at North Park Church. A shuttle will run from both locations from 11:30 a.m. to 9:45 p.m.\nThere also will be a shuttle running between Town Hall and the North Allegheny Intermediate for the car cruise.", "url": "https://apnews.com/7d0cf4ac53c24c72a041dacae8aaf17c"}