{"authors": ["Mike Kovak"], "date_download": "2020-05-04 20:24:57", "date_modify": "2020-05-04 20:24:57", "date_publish": "2018-08-25 07:06:53", "description": "Derry won 20 games the past two years by keeping things simple, executing and coming up with big plays when needed. In Friday's season opener against rival Latrobe at Memorial Stadium, Derry...", "filename": "_40ce6634f284454dbd94a96008a2d388_1588623897.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_40ce6634f284454dbd94a96008a2d388_1588623897.html", "title": "Kickoff return helps Derry pull away from Latrobe", "title_page": "Kickoff return helps Derry pull away from Latrobe", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Derry won 20 games the past two years by keeping things simple, executing and coming up with big plays when needed.\nIn Friday’s season opener against rival Latrobe at Memorial Stadium, Derry didn’t do anything to reinvent its winning formula. The Trojans attempted only five passes, put together a punishing first half and, just when they needed it, Justin Flack came up with a game-changing kickoff return after the Wildcats seized momentum.\nFlack’s 66-yard kickoff return early in the fourth quarter put a screeching halt to Latrobe’s momentum and set up a key Derry touchdown that led to a 45-15 nonconference win for the Trojans.\n“I just saw green, and I hit it,” Flack said. “We had to keep battling and keep playing.”\nFlack fielded the kickoff after Latrobe pulled within 21-15 with a spirited third-quarter defensive effort led by Trent Holler, who had a strip sack that was recovered and returned for a touchdown by Paul Simonovitch for the Wildcats’ first score. Holler also had a hand in another third-quarter turnover when he tipped a pass that was intercepted by Brady Johnson that resulted in Latrobe’s second touchdown.\nFlack, however, immediately found room to run on the ensuing kickoff and sprinted down the Latrobe sideline before being tackled at the Latrobe 16. Onreey Stewart, who finished with 150 yards and two touchdowns on 24 carries, scored on a 6-yard run, and Derry was on its way to its 21st win in 24 games.\n″(Flack) is a senior captain, and when we needed a play the most he made it,” Derry coach Tim Sweeney said. “They were pretty much on us at that point, and Flack answered the bell.”\nOn the night Latrobe honored its 1968 WPIAL championship team, the only title winner in program history, Derry did most of the celebrating in the first half.\nThe Trojans, who have won three consecutive games in this rivalry for the first time since 1985-87, weren’t shy about running right at Latrobe’s bigger and deeper defensive line led by the Division-I prospect Holler. On its second offensive series, Derry went 93 yards -- all rushing -- highlighted by a 25-yard burst by Stewart and a 51-yard romp by Flack, who capped the six-play drive with a 1-yard score.\nOn the ensuing point-after conversion, Latrobe was called for running into the kicker. Derry decided to go for two, and Flack successfully converted the attempt for an 8-0 lead. Special teams proved problematic for Latrobe, and Derry took advantage.\nA low punt snap and kickoff return fumble set up the Trojans inside Wildcats area twice late in the second quarter.\n“We didn’t execute and play with the effort and intensity that we needed to for 48 minutes,” Latrobe coach Jason Marucco said. “We responded well in the third quarter, but it was too little, too late.”\nDom DeLuca, who bullied his way through the middle of Latrobe’s defense on rushing attempts and disrupted things defensively with three sacks, scored the Trojans’ second touchdown with an 8-yard run up the middle. Derry led 14-0, but it was far from done.\n“No. 12 (DeLuca) was the best player on the football field. Period,” Sweeney said.\nWith 5:29 remaining in the second, Derry got the ball at its own 20. A 16-yard pass from Paul Koontz -- a sophomore making his first start -- to DeLuca got the drive going. A 24-yard run by Stewart kept it rolling, and an improbable strike from Koontz to Jason Geary for an 8-yard touchdown on a fourth-and-goal with 45 seconds left put the Trojans ahead 21-0.\nLatrobe’s miscues weren’t limited to special teams. A couple of costly penalties in the first quarter, dropped passes and missed opportunities on offense also contributed to their deficit.\nDerry, however, deserves most of the credit. The Trojans had eight runs of 10 yards or more in the first half -- 209 rushing yards total -- as they showed no signs of being intimidated by their rival despite injuries to Colton Nemcheck and Justin Huss, who figure prominently into their plans this season.", "url": "https://apnews.com/40ce6634f284454dbd94a96008a2d388"}