{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:24:22", "date_modify": "2020-05-04 20:24:22", "date_publish": "2018-01-10 11:37:48", "description": "By Gary Abernathy Special To The Washington Post In recent years, anti-bullying campaigns have become standard fare in high school and college. Our society has decided, rightly, that...", "filename": "_d0b999948c614f4db0165a74bf749e2e_1588623862.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d0b999948c614f4db0165a74bf749e2e_1588623862.html", "title": "President Trump is Right to Bully America's Enemies", "title_page": "President Trump is Right to Bully America's Enemies", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Gary Abernathy\nSpecial To The Washington Post\nIn recent years, anti-bullying campaigns have become standard fare in high school and college. Our society has decided, rightly, that bullies should no longer be tolerated because their hurtful attacks can lead to lifelong scars and even, in extreme cases, suicide by the victims.\nLikewise, Donald Trump, as both a candidate and president, has been accused of being a bully, his critics attacking him for his bluster and insensitivity.\nIt seems the only bullies who remain off limits -- in the eyes of media critics, numerous politicians and many other Americans -- are rogue-nation dictators and terrorist organizations. We should treat those bullies with kid gloves, many say.\nThe latest example of this appeasing belief came in the first week of the new year, when North Korean leader Kim Jong Un boasted, “I have a nuclear button on the desk in my office. All of the mainland United States is within the range of our nuclear strike.”\nFor several decades, and with various White House occupants, the U.S. response to such provocations has been one that could generously be called “restraint” but more accurately called “spinelessness.”\nInstead, Trump tweeted, “North Korean Leader Kim Jong Un just stated that the ‘Nuclear Button is on his desk at all times.’ Will someone from his depleted and food starved regime please inform him that I too have a Nuclear Button, but it is a much bigger & more powerful one than his, and my Button works!”\nA typical round of outrage ensued, directed not at the North Korean dictator but at the president of the United States. How dare he respond in such a careless, juvenile and irresponsible way?\n“Spoken like a petulant 10 year old,” Eliot Cohen, former counselor to Condoleezza Rice, wrote on Twitter, summing up the general reaction from many. “But one with nuclear weapons -- for real -- at his disposal. How responsible people around him, or supporting him, can dismiss this or laugh it off is beyond me.”\nIn fact, how to successfully deal with threats from abroad has been beyond many past administrations. It has long appeared to be U.S. policy to live in fear of upsetting our enemies.\nTrump’s approach -- one for which millions of Americans have longed -- is to treat them like the sniveling bullies they are. From his description of Kim as “Little Rocket Man” to his retorts to the dictator’s nuclear threats, Trump refuses to feign respect.\nTrump has been admirably consistent in his approach to America’s enemies, and his critics just as reliable in expressing their alarm. During the 2016 campaign, Hillary Clinton and many others claimed that Trump’s blunt rhetoric on Islamist extremism was helping the terrorist Islamic State recruit new members.\nIn May 2016, Clinton echoed what many others had said and would continue to claim: “I said months ago, what Donald Trump said is going to be used to recruit terrorists by ISIS. . . . Now just recently we have absolute evidence, yes it is. They’re taking his words, out of his mouth, denigrating Muslims and putting them into propaganda videos. Why are we making the world more dangerous for Americans?”\nIn other words, don’t make Islamic State leaders mad. Don’t insult them -- they’ll hate us even more!\nThe terrorists may have used Trump’s words as a recruitment tool -- and yes, he could have done better differentiating between the Muslim religion and Islamist terrorism -- but in recent months, according to multiple accounts, the Islamic State has been effectively vanquished in its former strongholds in Iraq and Syria. The claim that Trump’s rhetoric would make the group stronger was off base.\nWhile many accuse the president of engaging in playground taunts, Trump speaks to rogue dictators and terrorists in the language they understand. He demonstrates a stark shift in U.S. policy from one of fear and appeasement to treating such bullies in the fashion they deserve -- with contempt and derision.\nTrump’s critics will wonder why the president seems to take a softer approach with Russian President Vladimir Putin, but Putin does not claim his goal is to obliterate the U.S. militarily or via terrorist attacks. The response the United States has employed for years with those who do -- and the one preferred by Trump’s critics -- led to a far-reaching Islamic State, a North Korea that is armed with long-range missiles and a more dangerous world overall. A radically different response has been long overdue.\nWe claim to want our children to understand that bullies should not be tolerated or respected. That philosophy should not include an exemption for dictators and terrorists.\nAbernathy, a contributing columnist for The Post, is publisher and editor of the Hillsboro (Ohio) Times-Gazette.", "url": "https://apnews.com/d0b999948c614f4db0165a74bf749e2e"}