{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:12:16", "date_modify": "2020-05-04 20:12:16", "date_publish": "2018-03-22 01:05:00", "description": "An internationally known soil expert is coming to Lewiston next week to hold a workshop for local farmers. Ray Archuleta, a soil health specialist and speaker, will host “Maximizing Soil...", "filename": "_773a0cbc0e374c36aa4f5814293843f9_1588623136.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_773a0cbc0e374c36aa4f5814293843f9_1588623136.html", "title": "Ray Archuleta, aka the 'Soil Guy' to present a workshop for area farmers in Lewiston", "title_page": "Ray Archuleta, aka the 'Soil Guy' to present a workshop for area farmers in Lewiston", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "An internationally known soil expert is coming to Lewiston next week to hold a workshop for local farmers.\nRay Archuleta, a soil health specialist and speaker, will host “Maximizing Soil Health,” from 10 a.m. to 3 p.m. Tuesday, March 27 at the Lewiston Community Center, 75 Rice St. This Land Stewardship Project (LSP) workshop is for farmers interested in how soil-building methods, like cover cropping, reduced tillage and livestock integration, can boost the health and resiliency of our farms. The cost is $20 and covers a noon meal ($10 for students and additional family members). To register, contact LSP’s Sarah Fillius at 507-523-3366 or sfillius@landstewardshipproject.org.\nThere are few soil health presenters traveling across the country that are as dynamic as Archuleta. After 30 years as a USDA-Natural Resources Conservation Service soil conservationist, conservation agronomist, and water quality specialist in New Mexico, Missouri, Oregon and North Carolina, Archuleta, who is also known as the “Soil Guy,” retired in 2017 and founded Soil Health Consultants and the Soil Health Academy. In his workshops for farmers, Archuleta addresses concerns about weather extremes and growing financial pressures and how we can use the principles of soil health to take part in the soil health revolution now emerging in the farming community.\nThe workshop includes a local farmer panel featuring Everett Rolfing of Lewiston, Willie Erdmann of Ridgeway and Chuck Henry of Dover. Rolfing farms row crops and hay, and uses vertical-till, no-till and cover crops. Erdmann farms cattle, row crops, hay, small grains and cover crop mixes. Henry has an all-grass organic dairy, and does double cropping of small grains with sorghum Sudan and other forage/cover crop options.\n“Ray Archuleta is a great motivator,” said Spring Grove no-till cash grain and cover crop farmer Myron Sylling. “He’s the highest energy and most passionate presenter on soil health that I’ve seen. If you’re interested in planting cover crops, Ray will fire you up and make you want to do it.”\n“We’re going to hit a tipping point where we’ll see a massive following in soil health,” Archuleta told Successful Farming magazine in November. “Between the mass education going on ... the success that some farmers and ranchers are having, and the always-increasing price of inputs, there’s going to be a fundamental shift. People want to see something different. They see something is intrinsically wrong. Why do we put in so many resources and, yet, a son or daughter can’t come into the operation?”", "url": "https://apnews.com/773a0cbc0e374c36aa4f5814293843f9"}