{"authors": ["Barry Adams", "Wisconsin State Journal"], "date_download": "2020-05-04 20:26:39", "date_modify": "2020-05-04 20:26:39", "date_publish": "2018-03-07 10:15:00", "description": "Outdoor sporting goods are scheduled to return this week to the intersection of Highway 51 and Interstate 39-90-94, in the town of Windsor, near DeForest. Gander Outdoors, formerly known as...", "filename": "_9923e89e563f425e91963df2fa28d80b_1588623999.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9923e89e563f425e91963df2fa28d80b_1588623999.html", "title": "Gander Outdoors to open Saturday north of Madison", "title_page": "Gander Outdoors to open Saturday north of Madison", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Outdoor sporting goods are scheduled to return this week to the intersection of Highway 51 and Interstate 39-90-94, in the town of Windsor, near DeForest.\nGander Outdoors, formerly known as Gander Mountain, has announced that a grand opening event is set for Saturday at the 91,000-square-foot store.\nMarcus Lemonis, the star of CNBC’s “The Profit” and owner of Camping World Holdings, bought Gander Mountain assets in bankruptcy court in May 2017 and, after closing the stores last summer, has been slowly reopening locations.\nThe Janseville store opened in late January, while La Crosse and Wausau stores have also opened. Other stores scheduled to open are in Kenosha, Appleton, Baraboo, Eau Claire, Sheboygan, Green Bay and Waukesha.\nBranded areas\nThe green color schemes familiar to Gander Mountain shoppers have been replaced with blue and brown patterns, while the store, next door to Camping World, is expected to have individually branded departments. The Legend department, for example, will hold hunting, firearms and shooting products, and Overton’s will display marine and fishing products. Erehwon, an outdoor retailer bought by Lemonis in January, will be a department home to camping and active outdoor sports such as hiking, paddle boarding and kayaking.\nThe Gander Outdoors store has 70 full- and part-time employees and fills a void left by Gander Mountain closing in August. That store had opened in 2008 after closing its two smaller stores in the city of Madison.\n“We are excited to continue expanding our outdoor industry footprint and reinforce our brand’s presence, while supporting economic growth across the country,” Lemonis said in a statement.\nGander Outdoors stores feature a full line of products for hunting, camping, fishing, shooting and other outdoor sports. Gander Mountain was founded in the Kenosha County community of Wilmot in 1960 as a catalog retailer and filed for bankruptcy in March 2017 after facing increased pressure from Cabela’s.", "url": "https://apnews.com/9923e89e563f425e91963df2fa28d80b"}