{"authors": ["Branko Marcetic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "John Patrick Leary"], "date_download": "2020-05-04 19:55:02", "date_modify": "2020-05-04 19:55:02", "date_publish": "2018-08-06 00:00:00", "description": null, "filename": "2018_08_joe-biden-neoliberal-democrat-conservative-lobbying_1588622102.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/08/06132751/rsz_gettyimages-141313646.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_08_joe-biden-neoliberal-democrat-conservative-lobbying_1588622102.html", "title": "Joe Biden, Neoliberal", "title_page": "Joe Biden, Neoliberal", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIt looks like Joe Biden is running. With Beltway insiders and Democratic bigwigs talking up his presidential chances, the former vice-president looks to be the candidate to beat in the 2020 primaries. The only problem is, it’s Joe Biden. If you thought Hillary Clinton was a weak candidate, with her transactional style and triangulating policy stances, then you probably won’t be excited by Biden’s multi-decade history in the Senate. Apart from Clinton’s inept campaigning and inability to connect with voters, Biden shares many of the same red flags that led a large share of the Democratic base to look with suspicion on the former secretary of state. In this series, Jacobin’s Branko Marcetic takes a look back at the career of Delaware’s longtime senior senator. Below is Part III: Joe Biden, Neoliberal.\nOne of Joe Biden’s selling points is that he’s “good old Joe,” the affable, ordinary guy from hardscrabble Scranton, Pennsylvania, who, gee-whiz, found himself in the seat of global power and stayed there for five decades. He’s a “liberal everyman” who still has the common touch and will win back the working class with his “blue-collar roots.” It’s the basis for the hilarious series of Onion articles from the Obama years that portrayed Biden as a kind of aging Dukes of Hazzard character. In fact, Biden’s portrayal by much of the media has a lot in common with the Onion’s “Diamond Joe” character in that neither is actually real. Biden’s blue-collar roots are genuine enough, but it’s been a long time since he was anything close to blue collar, even if his net worth pales in comparison to the ludicrous levels of wealth accrued by most other politicians. More pertinently, during his career, Biden’s political work and the business ventures of his family have intersected more times than anyone who watched Hillary Clinton’s candidacy flame out over similar accusations should feel comfortable with. And for all his working-class affectations, Biden is exactly the kind of transactional, Third Way centrist the Clintons faced withering attacks for being, spending years attacking progressive “special interests” while crossing the aisle to vote with Republicans in major instances that were decidedly unhelpful to the working class. In other words, at a time when both the Democratic party and the country are moving left — particularly on economic issues — Biden is a lingering fragment of the triangulating liberalism that was shattered by the 2016 election, and which helped bring us Trump in the first place.\nWaist-Deep in the Swamp Biden hasn’t (yet) made the mistake of setting up a global foundation that serves as the conduit for mountains of corporate and foreign-government cash in advance of his presidential run. But that doesn’t mean he hasn’t had a history as a transactional politician. The most well-known case is Biden’s relationship with MBNA, a major credit card company based in his home state that was his largest single donor between 1989 and 2000. By sheer coincidence, Biden voted against a measure requiring credit card companies to warn consumers of the consequences of making only minimum payments and voted four times for an industry-supported bankruptcy bill that made it harder for financially strained borrowers to get protection from creditors. Another coincidence: MBNA hired Biden’s son, Hunter, as a lobbyist straight out of law school, and later hired him as a consultant from 2001 to 2005 — the same years Biden was helping to pass the bill. Biden’s son, incidentally, is the embodiment of the “swamp” that Trump spent 2016 bashing and subsequent years shamelessly wallowing in. After joining MBNA in 1996 and becoming its senior vice president two years later, Hunter started a lobbying firm with William Oldaker, who had worked as the elder Biden’s campaign treasurer and adviser. Along with Biden’s brother, Hunter was later accused in a lawsuit of defrauding a business partner in a hedge fund deal worth millions — a deal, the partner alleged, that only existed to get Hunter out of the lobbying industry so as not to cause headaches for Biden during his 2008 presidential campaign. More recently, Ukraine’s biggest private gas producer hired Hunter to serve on its board at the same time his father was acting as the Obama administration’s point man on Ukraine policy. There were several other reasons it wasn’t a great look. For one, the company’s owner was under investigation for corruption at just the same time Biden was traveling to Ukraine to urge a more aggressive stance toward corruption. Hunter’s hiring also mysteriously coincided with a lobbying campaign by the firm aimed at members of Congress. Nor is Hunter’s case unique in the Biden family. According to a 2012 story that was curiously ignored by anyone other than conservative outlets, a mid-sized construction firm Hill International that won a $1.5 billion contract to build 100,000 homes in Iraq just happened to have Biden’s brother, James, as its executive vice president, despite his seemingly lacking any experience in residential construction prior to joining the firm. How did the company get the contract? It helped to have “the brother of the vice president as a partner,” the company’s president allegedly told a group of investors. When Trump and the Right inevitably make hypocritical hay of these incidents, they’ll have plenty of other material to work with. Biden has long been prolific on the speaking circuit. By 1979, he was one of the Senate’s top twenty-five earners of outside income — and, along with twenty-two others on that list, voted against a bill to limit such earnings. As early as 1977, his speaking-fee income was among the highest in the Senate, totaling $22,596 that year (almost $94,000 in today’s dollars) for a practice that even then was controversial. And while he did sponsor a bill that year to bar senators from taking such fees, he clearly wasn’t bothered by its failure, continuing to rack up thousands of dollars in fees from pro-Israel groups and others in the ensuing years, and commanding $100,000–$200,000 per speech today. In 1985, Biden spoke to a gathering of the Democratic Business Council, a group of more than two hundred business executives who had given $10,000–$15,000 each to the Democratic National Committee. Because of the Vietnam War and the environmental movement, Biden told them, the Democrats “became basically a parched, fossilized version of what we were,” not “the party of the people, but the party of government.” But he assured the executives: “The good times are coming, and I mean that sincerely.” And Biden wasn’t above providing those good times. In 1979, after receiving donations from Coca-Cola, Biden cosponsored and voted for legislation that let the soft-drink industry get around antitrust laws. The same year, he voted against a measure before the Judiciary Committee to expand consumers’ rights to sue over price-fixing — one of only two Democrats to do so. As the Wall Street Journal reported, one of the companies lobbying against the bill, DuPont, was based in Biden’s home state. Biden also spent years fighting off attempts to prohibit companies from filing for bankruptcy in states where they were incorporated but didn’t do business — a measure that would have hit the big fees racked up by law firms in Delaware, where many major companies are incorporated. There’s also Biden’s history of close relationships to lobbyists. A number of Biden’s longtime staffers passed through the revolving door that led from Biden’s office to the lobbying industry — and back. He’s been known to attend weekend retreats with lobbyists, and from 1989 to 2008 the industry donated $344,400 to him, a little more than the $300,000 given by finance and credit card companies. Mega-lobbyist Gerald Cassidy says he and Biden are “good friends.” In other words, Biden will be a sitting duck for exactly the sort of Republican attacks (however hypocritical) that helped sink Clinton’s campaign. More importantly, he would be just as compromised once in power.", "url": "https://jacobinmag.com/2018/08/joe-biden-neoliberal-democrat-conservative-lobbying"}