{"authors": ["Kevin Damask Kdamask Wiscnews.Com"], "date_download": "2020-05-04 20:21:32", "date_modify": "2020-05-04 20:21:32", "date_publish": "2018-02-23 14:00:00", "description": "Madison’s loss appears to be Columbus’ gain. Sprecher’s Restaurant and Pub, a Wisconsin-based eatery, announced earlier this week it’s closing its location on the west side of Madison, but...", "filename": "_eff25befcef349a0b567191ae5daf0d1_1588623692.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eff25befcef349a0b567191ae5daf0d1_1588623692.html", "title": "Sprecher's has plans for Columbus", "title_page": "Sprecher's has plans for Columbus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Madison’s loss appears to be Columbus’ gain.\nSprecher’s Restaurant and Pub, a Wisconsin-based eatery, announced earlier this week it’s closing its location on the west side of Madison, but plans to open in Columbus. The Madison pub’s final day of business was scheduled for Feb. 23.\nA representative from Sprecher’s said specific details of the future Columbus location haven’t been formalized but the company did confirm on its Facebook page it will open a “new concept” pub and restaurant in Columbus. Attempts to reach Operations Director Sue Getgen for comments were unsuccessful.\nThe company said closing the Madison location would not affect Sprecher’s other five restaurants across Wisconsin. In a statement on its Facebook page, the company said, “We would like to take this moment to clarify that the closing of the Madison location revolves around a redevelopment of the property. It has no bearing on any of our other location’s operations or company growth as evidenced by the recent opening of our newest location in Watertown, and future new concept location in Columbus.”\nEarlier this week, District Manager Rodney Jayroe told the State Journal the company is “still strong and growing.” He wouldn’t specify if it will open another location in Madison.\nColumbus City Administrator Patrick Vander Sanden said the city hasn’t heard any recent plans from Sprecher’s on a development.\n“I recall a couple of years ago when the old Cardinal Ale House was sold, the new owner of the building came in to talk to me and the former economic development director,” Vander Sanden said. “He stated at the time he was connected to the Sprecher company. He said that they didn’t have any immediate plans for the building but thought they would see if another business would be interested in doing something there, but if nothing materialized, it was possible that they could bring a Sprecher to the property. The city hasn’t heard anything from them recently but we stand ready to assist them if they propose changes that require review or need permitting.”\nSprecher’s, known for its craft beers, sodas and German-style food menu, came to Madison eight years ago. The Sprecher’s Brewery opened in Milwaukee in 1985. The brewery does not own the restaurants, but its beer and soda are featured on the menu.", "url": "https://apnews.com/eff25befcef349a0b567191ae5daf0d1"}