{"authors": ["Bob Bauder"], "date_download": "2020-05-04 20:04:31", "date_modify": "2020-05-04 20:04:31", "date_publish": "2018-06-06 14:22:58", "description": "Pittsburgh and Ford Motor Company are partnering with local foundations in a program designed to enhance the city's transportation and mobility needs, officials said Tuesday. The eight-month...", "filename": "_16bc7b2380324d49b063cd047cb67080_1588622671.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_16bc7b2380324d49b063cd047cb67080_1588622671.html", "title": "Pittsburgh seeks futuristic options for moving people around the city", "title_page": "Pittsburgh seeks futuristic options for moving people around the city", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pittsburgh and Ford Motor Company are partnering with local foundations in a program designed to enhance the city’s transportation and mobility needs, officials said Tuesday.\nThe eight-month Pittsburgh City of Tomorrow Challenge, which began with the launch of a website Tuesday, will seek input from residents on problems they face moving around the city and suggestions for resolving those problems. People can sign up to participate through the website.\nParticipants who generate the best ideas for improvements will be eligible for grants to test their plans through pilot projects. The Heinz Endowments, Benter Foundation, Pittsburgh Foundation, Pittsburgh Parking Authority and the city have pledged a total of $250,000 to fund the program. They earmarked $100,000 of that for grants.\nFord is providing data analysis, technical mentoring, community outreach and setting up workshop meetings with residents.\n“We want to find out where there are areas in our city that are transportation deserts,” Mayor Bill Peduto said. “We know that nearly 40 percent of city residents don’t have a car. With those 40 percent, how are they able to get to the doctor? How are they able to get to food? What are the places and what do we need to do to enhance opportunity for them?”\nHe said a majority of people who work Downtown don’t drive to work.\n“What are the mobile options and what do we do to enhance them so that other people won’t have to rely on a car in order to get Downtown and Downtown won’t have to be congested,” Peduto said.\nFord’s in it to determine what the future holds for transportation and how the company can be involved, according to John Kwant, the company’s vice president of City Solutions.\n“Ford has always been in the business of moving people and goods, and until we invent a form of Star Trek-like teleportation we’re going to have to physically move people and goods,” he said. “That will change in the future ... and that’s what we intend to be part of as this future evolves.”\nKarina Ricks, Pittsburgh’s director of mobility and infrastructure, said about 40 percent of trips Americans take each year from home to places such as a grocery store are less than a mile. She said 60 percent of the time, Americans use a vehicle for those trips.\n“What we really want to do is promote the options to take those very short-distance trips, the trips of less than a mile, and make the ability to get those trips accomplished by non-motorized means,” she said. “If we can eliminate very short-distance trips being taken by automobile, it will solve traffic congestion, including the tunnels in Pittsburgh.”\nBob Bauder is a Tribune-Review staff writer. Reach him at 412-765-2312, bbauder@tribweb.com or via Twitter @bobbauder.", "url": "https://apnews.com/16bc7b2380324d49b063cd047cb67080"}