{"authors": ["Mary Kilpatrick"], "date_download": "2020-05-04 20:23:09", "date_modify": "2020-05-04 20:23:09", "date_publish": "2018-09-26 17:46:00", "description": "Christine Blasey Ford to testify about alleged Kavanaugh sexual assault: Will you be watching? CLEVELAND, Ohio — Christine Blasey Ford — the California university professor who accused...", "filename": "_d6f741b57d1943cc8919e88763058af3_1588623789.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d6f741b57d1943cc8919e88763058af3_1588623789.html", "title": "Christine Blasey Ford to testify about alleged Kavanaugh sexual assault: Will you be watching?", "title_page": "Christine Blasey Ford to testify about alleged Kavanaugh sexual assault: Will you be watching?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Christine Blasey Ford to testify about alleged Kavanaugh sexual assault: Will you be watching?\nChristine Blasey Ford to testify about alleged Kavanaugh sexual assault: Will you be watching?\nCLEVELAND, Ohio — Christine Blasey Ford — the California university professor who accused Supreme Court nominee Brett Kavanaugh of sexual assaulting her decades ago — is expected to testify Thursday before Congress about her recollection of the alleged incident.\nKavanaugh, who has denied Ford’s accusations, is also expected to testify.\nThe balance of the Supreme Court could hang on their accounts of what happened at a high school party in 1982.\nWill you be watching?\nThe hearing is scheduled to begin at 10 a.m., and will be available on C-SPAN, and likely other news networks. The public’s interest in Ford’s accusations is an echo of the fervor surrounding Anita Hill, who in 1991 accused then-Supreme Court nominee Clarence Thomas of sexual harassment. Hill testified about her accusations before Congress.\nThough her testimony ultimately did not stop Thomas from becoming a member of the nation’s highest court, it sparked a national conversation about sexual harassment in the workplace.\nIn the age of #MeToo, will the outcome be different for Kavanaugh?\nCleveland.com plans to host a Twitter conversation of a closed group of women during the testimony. Only Tweets from members of the group will be displayed, although the Tweets will be public so others may reply to messages. Cleveland.com will feature tweets from the group during our live coverage. If you’d like to be involved, email Mary Kilpatrick at mkilpatrick@cleveland.com with your name and Twitter handle.", "url": "https://apnews.com/d6f741b57d1943cc8919e88763058af3"}