{"authors": ["Washington Times Staff The Washington Times"], "date_download": "2020-05-04 20:16:13", "date_modify": "2020-05-04 20:16:13", "date_publish": "2018-04-26 16:39:45", "description": "The Washington Times' Thom Loverro is adding to his trophy case. The longtime Times columnist, one of the deans of D.C. sports journalism, has picked up a third place for column writing in...", "filename": "_4bdc2ac11dfc291a019e108a4ec34bbb_1588623373.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4bdc2ac11dfc291a019e108a4ec34bbb_1588623373.html", "title": "Thom Loverro takes third place in BWAA contest for Floyd Mayweather-Conor McGregor column", "title_page": "Thom Loverro takes third place in BWAA contest for Floyd Mayweather-Conor McGregor column", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Washington Times’ Thom Loverro is adding to his trophy case.\nThe longtime Times columnist, one of the deans of D.C. sports journalism, has picked up a third place for column writing in the annual Boxing Writers Association of America contest, the organization announced.\nLoverro and other boxing writers will be honored May 11 at the 93rd annual BWAA Awards Dinner at the Copacabana Times Square in New York City, at which Vasiliy Lomachenko will receive the Sugar Ray Robinson Fighter of the Year Award and his father comes away with the Eddie Futch Trainer of the Year Award, the night before Vasiliy challenges WBA lightweight champion Jorge Linares in Madison Square Garden.\nLoverro won for an Aug. 27, 2017, column on the sporting world’s reaction to mixed-martial arts fighter Conor McGregor’s unsuccessful bid to take down boxer Floyd Mayweather.\n“Mayweather-McGregor was hailed by many as a “great” fight,” Loverro wrote. “Perhaps the worst indictment yet for how far boxing’s credibility has fallen, when a glorified Mayweather sparring session against someone making his “pro boxing debut” passes for a “great fight.”\nWashington Times sports editor David Eldridge called Loverro “a sportswriter’s sportswriter.\n“He’s always been one of the Washington Times’ lions, and all these years in, he’s lost none of his bite,” Eldridge said.", "url": "https://apnews.com/4bdc2ac11dfc291a019e108a4ec34bbb"}