{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:06:14", "date_modify": "2020-05-04 20:06:14", "date_publish": "2018-10-10 04:01:01", "description": "DINNER: Westmoreland Woman's Club hosts a baked steak dinner from noon until food is gone Sunday, Oct. 14, at the clubhouse. The menu includes salad; baked steak; mashed potatoes and gravy; green...", "filename": "_1e9291667f754e9ba699783ad434fe56_1588622774.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1e9291667f754e9ba699783ad434fe56_1588622774.html", "title": "Brenda Lucas: Community news for Wednesday, Oct. 10", "title_page": "Brenda Lucas: Community news for Wednesday, Oct. 10", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DINNER: Westmoreland Woman’s Club hosts a baked steak dinner from noon until food is gone Sunday, Oct. 14, at the clubhouse. The menu includes salad; baked steak; mashed potatoes and gravy; green beans; dessert and drink. The cost is $10; $5 ages 10 and under. Proceeds fund two annual $1,000 college scholarships for Spring Valley graduating seniors and community projects. For to-go orders, call Marlene Thacker, 304-429-1816.\nWISHES: Thursday, Oct. 11, may be the first birthday celebration since retiring from Marshall University’s director of communications. David, better known as “Dude” to colleagues and family members, was a former Herald-Dispatch sportswriter and editor, and a very good one, I might add. May Dave’s special day be one with better health, happiness, fond memories and surprises.\nNOODLES: Oodles of noodles are available during the Woman’s Club of Huntington’s spaghetti dinner from 4 to 7 p.m. Friday, Oct. 12, at New Baptist Church. The menu includes spaghetti, cole slaw, bread, dessert and drink for $10. Proceeds benefit Hoops Family Children’s Hospital.\nMEMBERS: Joe and Valerie McMillion were received into full membership at Hurricane’s Forrest Burdette Memorial United Methodist Church in early September. May they be warmly welcomed into the ‘family’ and continue to work for the Lord.\nHOMECOMING: Bishop Sandra Steiner Ball speaks during the 124th anniversary celebration Sunday, Oct. 14, at Kenova United Methodist Church. Lunch follows in fellowship hall.\nBELTED: Brenda Brown of Madison Avenue Christian Church recently received her PhD in humanities - her 7th degree in Black Belt. She helped open a 56-bed hospital in Cherokee, N.C. Congratulations Brenda on a job well done.\nREVIVAL: Pastor C.J. Adkins is evangelist for revival services at 7 p.m. Sunday-Friday, Oct. 14-19, at Ona’s Beulah Ann Missionary Baptist Church.\nCANDLELIGHT: Blennerhassett Island Historical Park is transformed into a flame-lit world of the 18th Century for the annual Mansion by Candlelight Friday-Saturday, Oct. 12-13. Reservations are required. Contact 304-420-4800 or 800-CALLWVA.\nLAUNCHING: S.D. Thomas hosts a book launch party celebrating the release of her second novel YA/NA Christian novel, “Proclamation,” from 6:30 to 8:30 p.m. Saturday, Oct. 3, in the Copper Room at Hidden Creek Mercantile, Hurricane, W.Va. A reading from the author, question-and-answer session and book signing are also available.\nGOLF: Bring out the golf clubs for the fall fellowship golf outing sponsored by Central United Methodist Church beginning at 2 p.m. Sunday, Oct. 14, at Sugarwood Golf Course, Lavalette. The cost is $160 for a team of four. Make checks payable to Michael Rexroad, and mail to PO Box 6487, Huntington, WV 25772.\nOUTING: Bride of Christ United Baptist Church hosts a community outing at 5 p.m. Saturday, Oct. 13, at the church, Buffalo Creek\nRoad, Chesapeake, Ohio. A hayride and cookout are available for all youth.\nLATE ANNIVERSARIES: Fred and Vickie Delph, Oct. 5; Ted and Jamie Henry, Oct. 6.\nTODAY’S BIRTHDAYS: Shawn Persinger, Kristin Holley, Benjamin Oxley, Kennedi McCormick, Kip Smith, Dan Bierne, Debbie Conley, Artemis McKena, Otto McKenna, Alice Jones, Savannah Smith, Austin Mayer, Till Curry, Ron Cyrus, Rebecca Power, Sylvia Opimo, Mike Muth, Janet Nicol, Heather Brent, Timothy Combs, Fred Lunsford begins his fourth of the 80s (84).\nTODAY’S ANNIVERSARIES: Scott and Courtney McLean (2015), Mike and Kathy Via, Chris and Jessica Chaney, Ramona and Carl Walker, Glenn Bailey.\nTHURSDAY’S BIRTHDAYS: Jack Stevens, Seth Napier is legal at 21, Scott Revely, Campbell Bartkowski, Andy Cunningham, Rick Estep, Jackie Ballard, Tori Nesmith, Jerry Johnson, Keith Ross, Skylar Reizman, W. Kraig Hunter, Kathleen Gue, Bonnie Atkisson is 85 years young, Leo Shannon turns 87.\nTHURSDAY’S ANNIVERSARY: Rob and Becky Millne (2000).\nFRIDAY’S BIRTHDAYS: Sarah Dial, Brian Faulknier, Reg Hart, Megan Berlin, Megan Hardy, Tina Fulks, Maxine Brammer, Brooke Neal, Cody Rohrig, Daryl Cline, Todd Caldwell, Frances Adams, Tina Caldwell, Devon Hill, Jessie Hayes, Santana Smith, Jon Cain, Brooke Neal, Cody Rohrig, Ernie Thompson, Coby Roland, Trevor Wilson, Frank Chandler, Geoff Mohn, Annette Black\nFRIDAY’S ANNIVERSARY: Charles and Becky Morris.\nCHUCKLE: Sardar was given the job of painting the white lines down the middle of a highway. On his first day he painted six miles; the next day three miles; the following day less than a mile. Then the foreman asked Sardar why he kept painting less each day? He replied, “I just can’t do any better. Each day I keep getting farther away from the paint can.”\nSend items to Brenda Lucas, P.O. Box 596, Ona, WV 25545; fax to 304-526-2857; or email to bklucas53@aol.com.", "url": "https://apnews.com/1e9291667f754e9ba699783ad434fe56"}