{"authors": ["Ronan Burtenshaw", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:55:54", "date_modify": "2020-05-04 19:55:54", "date_publish": "2018-06-05 00:00:00", "description": null, "filename": "2018_06_james-connolly-ireland-socialism-iww-labor_1588622154.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/06/05145951/connolly.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_06_james-connolly-ireland-socialism-iww-labor_1588622154.html", "title": "Connolly at 150", "title_page": "Connolly at 150", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "James Connolly was born on June 5, 1868, to a working-class family in the Cowgate ghetto of Edinburgh. His father John was an unskilled laborer, working first collecting manure and then managing public toilets in the city. He and his wife Mary were Irish famine emigrants from Monaghan, moving to Scotland at a time when its slums were among the poorest and most destitute places on the island. The Connollys were a political family. James’ father John was a labor militant, involved in numerous strike actions during his childrens’ youth. But perhaps more importantly, letters discovered in the Marx Memorial Library in London in recent years have established that James’s uncles were Fenians, revolutionary nationalists and supporters of the uprising that had taken place in Ireland a year before his birth. Life was not easy for the young James Connolly. He started work at age nine, first in a bakery then as a courier for the local newspaper and finally in a tile factory. After this came a chapter that largely disappeared from later republican hagiographies: in 1882, aged fourteen, he followed his brother John into the British Army. The circumstances surrounding his enlistment are teased out in historian Donal Nevin’s biography, but much debate still remains as to his motivations. To some he was a young worker with limited job prospects trying to earn a wage, to others his possible presence in a regiment — the King’s Liverpool — that had been infiltrated by the Fenians less than two decades earlier suggested political aims. Whatever the case, in a fine irony of history, it was the British Army that first brought James Connolly to Ireland. In truth, very little is known about his first spell in the country, with even the regiment with which he served being disputed. We do know that it was a turbulent time, with the British Army participating in evictions during the Land War, putting down of sectarian strife, and quelling prison rebellions. It seems unlikely that the young Connolly was not involved in some of this repression. One thing we do know is that, while in Ireland, Connolly fell in love with a young Protestant girl named Lillie Reynolds. Whether it was for the former or latter reason, James Connolly grew weary of the British Army and deserted when he learned he was to be stationed in India, instead moving with Lillie back to Scotland.\nPath to Socialism After leaving the army James Connolly followed his brother to Dundee, where the latter was already established not only as a laborer but as a member of the Socialist League. From there he moved back to Edinburgh in 1890, by then a fully committed socialist, throwing himself into trade union agitation and socialist organizing with the Scottish Socialist Federation. A young, self-taught, working-class intellectual James Connolly was at that time one of the leading figures in a generation that founded the socialist movement in Scotland, and was active in the Independent Labour Party milieu alongside Keir Hardie. He read voraciously, studying history and literature, even managing to teach himself some German and French to read Marxist classics in their original languages. By 1894 Connolly was standing in local elections in Edinburgh and, shortly thereafter, his militancy ran afoul of his employers in the city council. Blacklisted from work, he briefly opened a cobblers’ shop before, in 1896, leaving Scotland to take up a post in Dublin as organizer for the Socialist Clubs, which he would later rename the Irish Socialist Republican Party (ISRP). With the ISRP Connolly set out for the first time to undertake the political project which would define his life, synthesizing the national and social struggles in Ireland. His first major work, Erin’s Hope, published in 1897, evidenced this path, comprising essays he had written in conversation with Irish nationalist publication Shan Van Vocht and Keir Hardie’s British socialist magazine Labour Leader, explaining to each the necessity of the other’s cause. Thirty years earlier the Fenian Proclamation, likely written by James Stephens of Karl Marx’s First International, had appealed to “the workmen of England” to “remember the starvation and degradation brought to your firesides by the oppression of labour” and lend their support to the Irish republic. In Erin’s Hope Connolly would pick up this standard again, proclaiming that: No Irish revolutionist worth his salt would refuse to lend a hand to the Social Democracy of England in the effort to uproot the social system of which the British Empire is the crown and apex, and in like manner no English Social Democrat fails to recognize clearly that the crash which would betoken the fall of the ruling classes in Ireland would sound the tocsin for the revolt of the disinherited in England. As organizer for the Irish Socialist Republican Party, Connolly led the movement in Ireland towards a revolutionary platform and campaigned against British imperial interests. In 1897 he organized a demonstration against the Jubilee celebrations in Dublin, urging Irish people to “protest against the base assumption that we owe to this empire any other debt than that of hatred of all its plundering institutions.” As part of the events he marched down the main thoroughfare, Sackville Street, carrying a coffin emblazoned with the words “British Empire.” His decision to finish this spectacle by tossing the coffin in the River Liffey ultimately resulted in his first stint in an Irish prison. In 1898 Connolly began writing, printing, and distributing his own newspaper, The Workers’ Republic. He used its pages to bitterly condemn the moderate Home Rule movement — “a plot to delude the Irish worker in the interest of his Irish master” — and outline the necessity for a revolutionary break with the British Empire. It also challenged the Catholic clergy, by now the most vocal opponents of socialism in Ireland, responding to sermons and outlining a bold, non-sectarian vision of left-wing politics. By 1899 The Workers’ Republic was home to some of Connolly’s most important theoretical interventions about the nature of socialism. First, in an article titled “State Monopoly versus Socialism,” he challenged the idea that nationalization in itself was socialist. While recognizing that state ownership had improved workers’ lot, he pointed out that the nationalization of infrastructure and state aid to industries had often been used as a means of propping up the private ownership of the means of production rather than undermining it. Socialists needed to fight not just for more state ownership, but for a different kind of state, one where the workers collectively controlled production. “To the cry of the middle class reformers, ‘make this or that the property of the government,’ we reply, ‘yes, in proportion as the workers are ready to make the government their property,’” he concluded. Connolly marched down the main thoroughfare, carrying a coffin emblazoned with the words ‘British Empire.’ His decision to finish this spectacle by tossing the coffin in the River Liffey ultimately resulted in his first stint in an Irish prison. Later that year Connolly would set forth a materialist case for socialism in an article entitled “The Economic Basis of Politics.” In it he derided the notion that ideas alone were the motor force of history, arguing that “an effective political force” had to have its origins “deep down in the daily life of the people, [not] in the brains of some half dozen gentlemen in parliament.” Mocking the “great man” theory of history, he said that it was always easy to persuade “the minds of the superficial middle class thinkers” that “the world turned around their heroes and successful persons as upon its axis.” Instead, he argued, “the social condition of the mass of the people was the determining factor in political activity,” memorably concluding that “the seat of progress and source of revolution is not in the brain, but in the stomach.” Connolly would continue his anti-imperial agitation during these years, organizing rallies against the Boer War and campaigning against enlistment in the same British Army in which he’d served only years earlier. The British Empire was by now the firm focus of his energies, so much so that he often afforded its enemies charity they barely deserved. In the case of the Boer War, his framing of the South African republics as representing proletarian interests was clearly wide of the mark, although his committed antiwar stance contrasted notably with British socialist organs like The Clarion and the Fabians who weighed in behind their government. If his writing on international politics lacked for some depth at that time, the quality of his prose on Ireland was only improving. In 1900, in response to a nationalist children’s parade, Connolly took the separatist movement to task for its lack of commitment to improving social conditions. Quoting socialist poet Fred Henderson, he urged those fighting for Irish freedom to “Think of the children who swarm and die / In loathsome dens where despair is king.” The article is defined by one of Connolly’s most lyrical passages: Ireland without her people is nothing to me, and the man who is bubbling over with love and enthusiasm for “Ireland,” and can yet pass unmoved through our streets and witness all the wrong and the suffering, the shame and the degradation wrought upon the people of Ireland, aye, wrought by Irishmen upon Irishmen and women, without burning to end it, is, in my opinion, a fraud and a liar in his heart, no matter how much he loves that combination of chemical elements which he is pleased to call “Ireland.” But his political career in Ireland was not reaching the heights of his writing. Connolly stood unsuccessfully in municipal elections in 1900, 1902, and 1903, and was particularly stung by his failures in light of the success of other Labour representatives who broke through on more moderate tickets at the same time. In truth, Connolly’s Irish Socialist Republican Party hadn’t been much involved in the trade union movement in these years, despite he himself becoming a delegate to the trades council in 1901. The party had largely ignored significant disputes involving the builders, tailors, and engineers during his time as its organizer. It wasn’t until Connolly left Ireland for America, in 1903, that he came to see the importance of radical trade unionism.\nConnolly in America Connolly had first been invited to tour America in 1902 by Daniel De Leon’s Socialist Labor Party (SLP), then at the forefront of a resurgence of industrial unionism in the country. The SLP had reprinted Connolly’s pamphlet Erin’s Hope in an attempt to appeal to the huge numbers of Irish migrant workers in America’s cities. His speaking engagements during the trip took Connolly to the prestigious Cooper Union Hall, where eminent American political figures from Abraham Lincoln to Frederick Douglass and Susan B. Anthony had spoken in years prior. The acclaim with which his words were received by Irish workers convinced the SLP to bring Connolly to America full-time and he emigrated the next year. But Connolly’s introduction to socialism in America wasn’t smooth. Within six months of his arrival, he was engaged in a bitter dispute with De Leon over SLP policy. Connolly wrote a letter to party organ The People criticizing an SLP organizer in New York for arguing that any wage increase workers won under capitalism would inevitably be offset by price hikes. This, Connolly said, might “sound very revolutionary,” but it wasn’t true and led the party to a policy of not fighting for the betterment of workers’ lives. In addition, he took umbridge at the SLP’s engagement in religious affairs, arguing that these should remain private in the socialist movement and that clergy should only be engaged on political and economic matters, not on questions of theology. Connolly also took issue with the syndicated publication in The People of German socialist August Bebel’s book Women Under Socialism. The book’s attacks on the institution of marriage and its “quasi-prurient” fascination with sexual matters were, in Connolly’s opinion, likely to drive workers away from the socialist movement. Although Connolly agreed that women were particularly oppressed by capitalism, he made clear in this debate that he believed socialism was only capable of solving the economic aspect of this question, and that arguments over sexual relations would still be “hotly contested” after the revolution. De Leon’s conduct during the dispute — censoring Connolly from The People and forcing him to respond in the British press while running countless articles criticizing his positions — led to a lasting rift between the men. But in 1905 they came together, along with other luminaries of the American socialist movement such as Eugene Debs, Mother Jones, Big Bill Haywood, and Lucy Parsons to found the Industrial Workers of the World (IWW). The IWW advocated for “one big union” representing the entire working class and against the sectionalism promoted by the American Federation of Labor, which had until then excluded unskilled workers from its ranks. It was in this milieu that Connolly learned of radical syndicalism and developed his belief in a “co-operative commonwealth” that was to shape his later life. Connolly threw himself into the IWW, first in the defense committee for Bill Haywood, Charles Moyer, and George Pettibone, industrial militants falsely accused of murder, and then, in 1907, as an organizer on the east coast. This role took Connolly into the heart of the workers’ movement for the first time, exposing him to mass organization and strike tactics. Although he failed in his attempts to conduct one in America — finding non-unionized trolley workers unwilling to align with electricians and engineers — he learned most from the Wobblies’ practice of the sympathetic strike, believing its approach to uniting workers across sectors at key nodal points of the capitalist economy stood the greatest chance at turning unionism from something reformist into a revolutionary politics. Although he would side with the anarchists against De Leon in 1908 — breaking from the SLP over its dogmatism — he never gave up his belief in the need for a socialist party, or that its participation in elections was integral to advancing the cause. He went on to take up a role as national organizer with Eugene Debs’ Socialist Party of America in 1909 and 1910 but never forgot the role of industrial unionism in his vision, saying that “without the power of the industrial union behind it, democracy can only enter the state as the victim enters the gullet of the serpent.” But throughout all of his time in America, Connolly never lost his connection with Ireland. He wrote his most important work Labour in Irish History during his time in the States from notes collected while studying at the National Library in Dublin. The book was an attempt to reassess Irish history from a socialist standpoint, something Friedrich Engels had once aspired to do himself during his voyages around the country. The scope of the work was ambitious — with Connolly delving back into ancient Gaelic societies to find remnants of communism, an approach he likely learned from Scottish socialist John Leslie’s treatment of clan societies. But it also dealt with more contemporary concerns, from the peasant rebellions to “the first Irish socialist” William Thompson’s Ralahine commune, and from the United Irishmen to the republican struggles of the nineteenth century. Probably its most famous chapter is entitled “A Chapter of Horrors: Daniel O’Connell and the Working Class,” in which Connolly eviscerates one of the most popular figures in Irish history for leading a Catholic emancipation that benefitted the propertied at the expense of the proletariat. In his final years in America Connolly founded the Irish Socialist Federation (ISF) along with other prominent Irish socialists including Elizabeth Gurley Flynn. Its motto “Fag a’Bealac,” meaning “Clear the Way,” was taken from a slogan featured on the flags of Irish battalions which fought against slavery during the American Civil War. But despite the promises of that period, Connolly found twentieth-century America a hostile ground for progressive politics. He would write of the Statue of Liberty in The Harp, the ISF’s publication: It is placed on a pedestal out of the reach of the multitudes; it can only be approached by those who have the money to pay the expense; it has a lamp to enlighten the world, but the lamp is never lit, and it smiles upon us as we approach America, but when we are once in the country, we never see anything but its back.\nThe Return to Ireland The foundation of the Irish Transport and General Workers’ Union (ITGWU) in 1909 was the trigger for Connolly’s decision to return to Ireland. Two years earlier a massive dock strike in Belfast had seen syndicalist tactics employed with some success in Ireland for the first time, bringing not only unionized dock workers but also carters, shipyard workers, sailors, firemen, boilermakers, coal heavers, transport workers, and women from the city’s largest tobacco factory out on strike simultaneously to shut down the island’s second city. That strike had been organized by Jim Larkin, a Liverpool-born Irish trade unionist who would go on to be Connolly’s most important associate. After the failure of the Belfast strike to win union recognition, Larkin moved south, organizing workers in Dublin, Cork, and Waterford and winning significant pay increases. He followed this by founding The Irish Worker newspaper in 1911, a publication which took up the role of Connolly’s now-defunct Workers’ Republic. Connolly became a regular columnist, writing in his first article that the Belfast dock strike was only an opening “to future successes under the banner of the Irish branch of that great onward moving, conquering army of toil, which is destined, I believe in our own time, to conquer and to own the world.” Connolly and Larkin complimented each other well as leaders of a growing Irish labor movement. American writer James T. Farrell summed up the conventional view of the pair: Connolly was precise, methodical. He thought and planned ceaselessly. He tried to take everything into account in advance. He studied the revolutions of the past in order to draw lessons which he might apply in the Irish struggles which he anticipated. He had deep indignations, but he was usually controlled. Larkin was more emotional, impetuous, violent, extravagant. In his speeches and in his actions, he was an improviser. He did not stop to reason or to plan. He spoke with a rapid flow, with sweeping gestures. His speeches were filled with hyperbole, with castigation, with acidity, with sentimentality, and with rousing appeals. But Connolly, perhaps more than anything else, was a man of ferocious conviction, and any idea that he represented only the steely calculations of militant action would be wrong. In an obituary his comrade Cathal O’Shannon would write that although Connolly’s words did not “arouse the wild and whirling enthusiasm evoked by the outburst of a demagogue,” it produced a more lasting engagement which “forced the hearer to act on Connolly’s side rather than just cheer his words.” “From Connolly,” O’Shannon said, “you got a cogent, coherent and reasoned statement of a case, presented in the clearest manner, illustrated by the most telling allusions, with the argument marshaled in the coldest and calmest fashion, yet warmed with the burning fire of sympathy and sincerity.” Together Connolly and Larkin waged war on Ireland’s bosses and, in early 1913, scored a landmark victory in defeating a lockout in Sligo. Their next task was to conquer the industrial field in Dublin — but this was to prove a tough ask. Having seen the syndicalist wave sweeping the country in previous years, the employers in the capital city were well organized to meet the demands for union recognition and, led by William Martin Murphy, locked out twenty thousand workers for months on end. Connolly and Larkin travelled to Britain to try to raise funds to support the strike — which, taking place in a city whose slums were poorer than Calcutta’s, was leading to excruciating levels of hardship for the workers’ families. In the end, their efforts failed and the Dublin Lockout was defeated. But not before Connolly was involved in the foundation of the Irish Citizen Army (ICA), a workers’ militia established to protect strikers from the police and probably the first “red” army in the world. The establishment of the ICA, and Larkin’s departure in defeat to America, were to prove fateful, shaping Connolly’s path in the years to come as he focused his attentions on the national revolution.\nThe National Struggle There is much debate about Connolly’s pivot toward the national cause in the wake of the 1913 Lockout defeat. For Citizen Army veterans like the writer Seán O’Casey it was a retreat into nationalism that threatened the socialist movement in Ireland, for others like the historian Desmond Greaves it was a revelation that British imperialism was the primary obstacle to socialism in Ireland. Whatever the case, in both writing and practical activity, Connolly began to focus more on the national question. One factor undoubtedly influencing this pivot was the descent towards World War I in continental Europe. Connolly was a committed supporter of the Second International and firmly believed that the international workers’ movement would prevent the onset of imperial slaughter. Seeing his comrades in numerous European social democratic parties break from the internationalist cause and back their ruling classes in the war was a shock. Connolly was a key figure in the foundation of the Irish Neutrality League in October 1914. That month the Irish Worker carried the slogan “We Serve Neither King nor Kaiser,” and a banner reading the same was hung from the ITGWU’s Liberty Hall. It was this movement that brought Connolly together with Arthur Griffith, the founder of Sinn Féin, who had just months earlier demonized the striking workers during the Lockout and called Jim Larkin “an English agitator spreading an alien doctrine.” But Connolly had by this time decided that such alliances were necessary for his next course of action. Following a 1907 Second International instruction that workers should rebel if war broke out and seek to use the crisis to bring down capitalism, Connolly set about plotting an insurrection and met with Griffith as well as senior members of the Irish Republican Brotherhood (IRB) in 1914 to that end. But even in alliance with reactionaries like Griffith, Connolly did not sacrifice his progressive politics. In 1915 he published a pamphlet entitled The Reconquest of Ireland, which laid out the case for socialist transformation in the country. One of its chapters dealt with women’s liberation and was by far the most advanced thinking produced on these lines by any Irish socialist. So much so, in fact, that it would influence a generation of Irish socialist feminists including Constance Markievicz, Helena Molony, and Kathleen Lynn. An early suffragist praised by Francis Sheehy-Skeffington as “the soundest and most thorough-going feminist among all the Irish labour men,” Connolly was unequivocal in his pamphlet: None so fitted to break their chains as those who wear them, none so well equipped to decide what is a fetter. In its march towards freedom, the working class of Ireland must cheer on the efforts of those women who, feeling on their souls and bodies the fetters of the ages, have arisen to strike them off, and cheer all the louder if in its hatred of thraldom and passion for freedom the women’s army forges ahead of the militant army of Labour. Connolly did, however, make major concessions during this period. His coverage of the German empire grew increasingly favorable. It was, he said, “a homogenous empire of self-governing peoples.” Kaiser Wilhelm, he wrote, “understands the aims of the radical left in parliament and has more sympathies for them than the world knows.” And finally, “should a German army land in Ireland tomorrow we should be perfectly justified in joining it,” if doing so helped to end the British imperial presence on the island. Clearly, these comments place Connolly closer to the right wing of the German SPD than to Rosa Luxemburg. Likewise Connolly’s analysis of Orange politics in the north of Ireland was distorted by his national lens. Perhaps nostalgic for an earlier era when Catholic, Protestant, and Dissenter could unite behind a republican banner, Connolly framed Orangeism as rooted in an outdated landlordism that could be swept away by progressive national struggle. “There is no economic class in Ireland whose interests as a class are bound up with the Union,” he wrote, ignoring the reality of a developing industrial triangle between Belfast, Glasgow, and Manchester which provided the material underpinnings to Ulster unionism. But Connolly was doubtless correct that socialism in Ireland was impossible under the British Empire. Britain’s decision, after the 1798 uprising, to decimate the Irish economy by removing all sovereignty over economic decision-making from the island had resulted in chronic underdevelopment, two desperate famines, and mass emigration. Ireland’s moderate Home Rule nationalists would never demand the kind of autonomy over Irish affairs necessary to break this relationship, let alone to lead a socialist transformation. With the workers’ movement on the continent wilting under the pressures of war, insurrection against imperialism at home was the justified course of action. And so James Connolly led the Irish Citizen Army into the General Post Office in Easter 1916. The proclamation, which he largely wrote, hinted just enough at progressive aims to justify their involvement. In participating they wrote labor’s page in the struggle for Irish freedom. But many years later, an anecdote from the day remains disputed. Historian Desmond Greaves alleged that on his way into the GPO that day Connolly had turned to his men and said, “In the event of victory hold onto your rifles as those with whom we are fighting may stop before our goal is reached.” If he didn’t say it, he certainly should have — as the followers of Collins and De Valera have demonstrated in the decades since.", "url": "https://jacobinmag.com/2018/06/james-connolly-ireland-socialism-iww-labor"}