{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:12:31", "date_modify": "2020-05-04 20:12:31", "date_publish": "2018-12-12 23:11:00", "description": "If revenge truly is a dish best served cold, then Soldier Field is the perfect setting for the Bears to inflict some payback on the Packers Sunday afternoon, when they can clinch the NFC North...", "filename": "_38799821f6264255aa764e974bf484c1_1588623151.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_38799821f6264255aa764e974bf484c1_1588623151.html", "title": "Chicago Bears seeking revenge vs. Packers", "title_page": "Chicago Bears seeking revenge vs. Packers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "If revenge truly is a dish best served cold, then Soldier Field is the perfect setting for the Bears to inflict some payback on the Packers Sunday afternoon, when they can clinch the NFC North title at home.\nEven a casual Bears fans, if there is such a thing, is well aware of the beatdowns their rivals to the north have inflicted over the past 25 years of the series, during which the Packers have a 38-12 record. Most recently, it was the season-opening gut-wrencher, in which the Bears practically blew the Packers out of Lambeau Field early, building a 20-0 lead, only to collapse in the fourth quarter under the weight of an Aaron Rodgers-led rally.\n“We came out strong in the first half on offense and then in the second half, we didn’t come out as aggressive and didn’t finish,” said QB Mitch Trubisky, who had a 99.1 passer rating in the first half but just 62.2 after that. “So the theme this week is just finish as a team.”\nRodgers threw three TD passes covering 39, 12 and finally 75 yards to Randall Cobb in the final 14 minutes to steal a 24-23 victory in Week One. But the Packers have gone 4-7-1 since then, while the Bears have won nine of 12.\nThe Bears can also clinch their first division title since 2010 if the 6-6-1 Vikings lose at home to the 7-6 Dolphins, but what kind of hollow accomplishment would that be? Stomping the Packers in the 199th meeting of the most-played rivalry in NFL history is the ultimate revenge.\nSherrick McManis, the replacement for injured nickel CB Bryce Callahan (broken foot), is the longest tenured Bear on the roster. But, in his seventh season in Chicago, McManis has never experienced a victory over the Packers at Soldier Field. He’s also never played on a division champion, so a victory Sunday would be monumental.\n“It’d mean a lot,” said McManis, who turns 31 next week. “It’s something I haven’t done since I’ve been here, so it’d be a tribute to the hard work and the coaching.”\nThe bitterness of the season-opening loss hasn’t faded for McManis.\n“It’s definitely something we remember and we want to make better,” he said. “Right now, honestly, I’m just focused on doing my job, taking care of my business and helping this squad win this game.”\nBears coach Matt Nagy normally has a 24-hour rule after games, during which victories can be celebrated and defeats mourned before it’s time to move on to the next opponent. But in the case of the loss to the Packers, there’s something to be gained from that experience 14 weeks later.\n“You always remember all your losses way more than you remember your wins,” the Bears’ coach said. “And they sting. Especially when you have the lead like we did, and we didn’t finish l like we needed to. They remember that, they feel it. And I want them to remember that.\n“Because, sometimes when you go on through the season and you have success like we’ve had, you can forget that sting. And I don’t want them to forget that sting because we’ve got a ways to go yet. I think they’ll do a good job of realizing what we had, even that first game, and where we’re at now. And now (we’ll) see if we grew from it.”\nLess than five years before the 2018 season opener, the Packers dealt the Bears another bitter defeat, and fortunately only McManis was around for that one.\nIn the 2013 regular-season finale, it was Bears-Packers in a winner-take-all showdown for the NFC North crown, with the loser going home empty-handed, without even a wild-card berth. This time nobody crowned the Bears. They lost 33-28.\nThe Bears led in that one as well, 28-20 early in the fourth quarter, when the Packers closed to within a point. Then, with just 48 seconds remaining, the dastardly duo of Rodgers and Cobb hooked up for a 48-yard TD to drop the Bears to 8-8 and spoil Marc Trestman’s first year as head coach.\nThree years before that, the Packers ended the Bears’ last trip to the playoffs with a 21-14 victory at Soldier Field. The Bears’ lost the services of QB Jay Cutler late in the second quarter with a sprained knee and finished with Caleb Hanie at quarterback.\nA victory Sunday would help push all three of those losses further into the past.\n“We watched some clips (from Week One) about getting that sick feeling back, that sting,” Trubisky said. “We want to finish, so we don’t have that feeling again.”\nIt’s a feeling that has come far too often for the Bears when they face the Packers.\nVisit ProFootballWeekly.com | View Latest E-Edition", "url": "https://apnews.com/38799821f6264255aa764e974bf484c1"}