{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:05:46", "date_modify": "2020-05-04 20:05:46", "date_publish": "2018-05-17 15:45:00", "description": "Perry Farm cleanup Jeffery Hudson, of Bradley, and friends are organizing a cleanup of Perry Farm areas from the Coyne Street Park to the Indian Cave trails and creek beginning at 9 a.m....", "filename": "_bf19bd06b55f4d53ac8234d8d6e2b373_1588622746.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bf19bd06b55f4d53ac8234d8d6e2b373_1588622746.html", "title": "Outdoors Glance2", "title_page": "Outdoors Glance2", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Perry Farm cleanup\nJeffery Hudson, of Bradley, and friends are organizing a cleanup of Perry Farm areas from the Coyne Street Park to the Indian Cave trails and creek beginning at 9 a.m. Saturday.\nBourbonnais Township Park District is cooperating with the cleanup and will provide nonlatex gloves and trash bags for the project, and district staff members will pick up the filled bags, Hudson said.The condition of that area of the park is distressing, he said. “There’s trash everywhere ... along the trails, in the creek. You can’t walk more than 10 feet without seeing garbage. It’s really gross, not like it was when I was a kid. In one area, it seems people just break glass bottles for fun. Someone even dumped a couch there.”\nFishing for Trash\nFishing line and other debris pose serious threats to wildlife when they become entangled or swallow hooks or bits of plastic.\nVolunteers will be encouraged to do something about that during the “Fishing for Trash” program at Monee Reservoir, which runs 6 a.m. to 5 p.m. daily today through Sunday.\nTo participate, just stop by the concessions window, pick up a trash bag and gloves and fill the bag with any trash you collect. Bring it back to the visitor center and receive a free gift.\nSidewalks are easily accessible; however, trails are on natural, uneven terrain. Anyone who requires an auxiliary aid or service to participate in this program should call 708-534-8499 or submit a request online no later than 48 hours before the program.Morning bird hike\nA naturalist-led morning bird hike at Goodenow Grove Nature Preserve for ages 18 and older will be held from 8 to 10 a.m. Saturday, starting at the Plum Creek Nature Center, off Goodenow Road, between Beecher and Crete.\nThe hike will start with a quick presentation on what species to expect to find. All participants are automatically entered into the “Big Day — Bird Hike Challenge” drawing. Bring your binoculars and favorite bird field guide.\nThe hike will be between 1 and 1.5 miles over uneven terrain. Anyone who requires an auxiliary aid or service to participate in this program should submit a request online no later than 48 hours before the program. Call 708-946-2216.Pond exploration\nScoop up some knowledge during a “Pond Safari” set for 1 to 2:30 p.m. May 26 at the Forest Preserve District of Will County’s Isle a la Cache Museum in Romeoville.\nGrab a net and magnifying glass to discover animals underwater. Dipping nets and viewing containers will be provided. Dress in clothes and shoes that can get wet or dirty. All animals will be released back into the pond.\nThe free program is for ages 5 and older. Register by May 24 at ReconnectWithNature.org or by phone at 815-886-1467.Monee fishing derby\nReel in some fun during an “Adult Fishing Derby” scheduled for 7 a.m. to 1 p.m. June 2 at the Forest Preserve District of Will County’s Monee Reservoir.\nThe derby is for ages 16 and older, with a $10 entry fee.\nSponsored by Cabela’s, this event features prizes valued at hundreds of dollars for the most panfish, biggest bass and the biggest catfish.\nPack a lunch, bring your favorite fishing pole and find a spot along the shore. The district will provide one container of bait, and the first 25 registrants receive a free giveaway.\nRegistration is from 7 to 8 a.m. June 2. Awards will be announced at noon.\nRegister online at ReconnectWithNature.org or call 708-534-8499.Nature photography\nMove beyond shooting in automatic: Learn how to adjust your camera’s manual settings to get the shot you want. Apply your new skills on the grounds of Shannon Bayou, where there is no shortage of natural beauty to capture.\nBasic Nature Photography will be held on June 5 at 10 a.m. The program will be presented at the bayou, 3301 Waldron Road, Aroma Park. The course will include classroom instructions, in-field shooting and a critique session. Bring your camera!\nMandatory preregistration is required by May 29. Please call the University of Illinois Extension Office at 815-933-8337 to register. There is no fee for this event. Space is limited to 20 attendees for this presentation.\nThis is co-sponsored by the Kankakee River Valley Forest Preserve District and the University of Illinois Extension, Kankakee CountyFree fishing days\nIllinois Free Fishing Days are scheduled for June 15-18. For more information on fishing in Illinois, visit ifishillinois.org.Take Me Fishing\nPiggybacking on Illinois Free Fishing Days, the Forest Preserve District of Will County will sponsor its “Take Me Fishing Promotion” from 6 a.m. to 7 p.m. June 15-17 at Monee Reservoir.\nEnjoy a weekend designated for free fishing by the Illinois Department of Natural Resources; no license is required. The district has added its own incentives: Friday, a free one-hour kayak or canoe rental; Saturday, a box of night crawlers; and Sunday, one free fishing pole rental. Cash deposits and valid driver’s licenses are needed for the rentals. Registration is not required.\nAdler online\nThe Adler Planetarium, home to one of the largest and most significant collections of historic scientific instruments in the world, this week joined Google Cultural Institute with three introductory exhibits.\nThe online exhibits will showcase highlights of the Adler’s scientific instruments and its archival and rare book collections covering nine centuries of human effort to understand and represent the cosmos.\nThe Adler will continue to post themed narrative exhibitions to Google Cultural Institute to expand the reach of their world-class collections and to share untold stories of their unique artifacts, rare books and historical documents.\nTo participate, visit artsandculture.google.com/partner/adler-planetarium.", "url": "https://apnews.com/bf19bd06b55f4d53ac8234d8d6e2b373"}