{"authors": ["Chad Sokol"], "date_download": "2020-05-04 20:20:52", "date_modify": "2020-05-04 20:20:52", "date_publish": "2018-01-11 00:00:00", "description": "As Chinook salmon populations declined across the Pacific Northwest, scientists suspected the fish lost a great deal of genetic diversity, too. But until recently, the theory hadn’t been...", "filename": "_4c3325a6c96244e19a26cda96b816ec0_1588623652.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4c3325a6c96244e19a26cda96b816ec0_1588623652.html", "title": "WSU researchers discover shrinking gene pool among Chinook salmon populations", "title_page": "WSU researchers discover shrinking gene pool among Chinook salmon populations", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As Chinook salmon populations declined across the Pacific Northwest, scientists suspected the fish lost a great deal of genetic diversity, too.\nBut until recently, the theory hadn’t been tested. Ancient salmon bones are hard to come by, and it’s even harder to extract workable DNA samples from them.\n“Science finally caught up with what we already believed and allowed us to test it,” said Bobbi Johnson, the lead author of a new Washington State University study that raises concerns about the Chinooks’ ability to respond to environmental change.\nStarting in 2010, Johnson’s team collected hundreds of salmon bones from Native American archeological sites – some more than twice as old as the first Egyptian pyramid – and compared their DNA with modern samples from the same areas.\nThe researchers found that Chinook in the upper Columbia River – where the Grand Coulee Dam cut off about 40 percent of the species’ historic habitat – have lost about two-thirds of their genetic diversity. In the Snake River, they lost about one-third, a difference that surprised the researchers.\nThat basically supports the longstanding assumption that the Chinook gene pool was much larger before European settlement in the Pacific Northwest.\nThe researchers also analyzed ancient samples from Spokane River Chinook, finding that population had a large gene pool and at least six lineages. They had no modern samples for comparison. The Little Falls Dam has blocked salmon migration on the Spokane River since it was built in 1911.\nGenetic variation is critical for the survival of any species. It would enable salmon to pass on needed traits if disease strikes, water levels drop or temperatures rise.\n“You want there to be differences between individuals, so that when change does happen, there’s room for adaptation and natural selection,” Johnson said.\nIn a population with low genetic diversity, she added, “If something comes in that’s bad for anybody, that’s bad for everybody.”\nThe study, part of Johnson’s doctoral dissertation, was published this week in the journal PLOS One. Her coauthors are Gary Thorgaard, a WSU emeritus professor of biological sciences, and Brian Kemp, a former WSU molecular anthropologist now at the University of Oklahoma.\nThey wrote that Chinook research and management practices have mostly focused on “the four H’s” – habitat, harvest, hatcheries and hydropower.\nJohnson said they have now considered a fifth H, history. The study reflects millennia of dramatic changes to the Chinook’s habitat, both natural and man-made, from glacial floods to commercial fishing to the construction of giant dams.\nThe ancient bone samples, Johnson said, “just track that story so nicely.”\nThe 346 vertebrae samples were part of collections held by the Spokane and Colville tribes and the U.S. Bureau of Reclamation, among other entities. Johnson said many of the bones were retrieved from ancient Native American garbage heaps, called middens, in archeological digs beginning in the 1940s.\nSome of the samples dated back about 7,000 years. Many were about 3,000 years old. The youngest ancient sample came from a Chinook caught 150 years ago near Fort Colville.\nJohnson said the samples were immensely challenging to work with, and she credited Kemp, an ancient DNA expert, for overseeing the extraction process. Researchers wore face masks, hairnets and double sets of latex gloves to avoid contamination, and they were able to tease out sequences of mitochondrial DNA, the kind passed down only from mothers.\nJohnson said the Colville Tribe “definitely took a risk” by providing the first samples for preliminary testing. Samples are largely destroyed in the process, and there’s no guarantee it will yield useful data.\n“They gave us samples before we could prove that we could do something like this,” Johnson said.\nNative Americans in the Pacific Northwest have caught Chinook for more than 9,000 years, often near waterfalls and other natural bottlenecks along the region’s river network.\nEuropeans introduced commercial fisheries after arriving in the 1860s, and, from 1889 to 1922, they harvested more than 24 million pounds of Chinook each year, according to the researchers. That fell to about 15 million pounds a year by the late 1950s, and annual harvests now stand at less than 5 million pounds.\nThe first dam on the main stem of the Columbia, the Rock Island Dam in Chelan County, was built in 1933. The Bonneville and Grand Coulee dams were built in 1941, blocking ocean-going salmon from more than 1,000 miles of the upper part of the river. Dams on the Snake came more than a decade later.\nToday there are more than 400 dams in the Columbia River Basin, blocking more than half of the river system’s spawning habitat, according to the researchers.\nJohnson said her team can’t conclude if commercial fishing or the dams are to blame for the declining genetic diversity of the Chinook. To make that connection, the researchers would need samples from the late 19th and early 20th centuries.\nThe researchers did acquire some tissue samples from that period from the University of Washington, but they were stored in formaldehyde, Johnson said.\n“Formaldehyde is like cement for DNA,” she said. “You just can’t get DNA after that.”\nJohnson said her team’s findings have few applications on their own, but she hopes they will inform future discussions about Chinook conservation as the effects of climate change come into focus.", "url": "https://apnews.com/4c3325a6c96244e19a26cda96b816ec0"}