{"authors": ["Matt Bufano"], "date_download": "2020-05-04 20:11:40", "date_modify": "2020-05-04 20:11:40", "date_publish": "2018-04-12 00:00:00", "description": "Alexis Lewis is on the move. The all-time leading scorer in Wyoming Valley Conference girls basketball, Lewis will transfer from Iona to Seton Hall. Currently a junior, Lewis said she...", "filename": "_e7a305c025814d32b4cc3e91dc0d60c8_1588623100.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e7a305c025814d32b4cc3e91dc0d60c8_1588623100.html", "title": "Former WVC Standout Alexis Lewis Transferring To Seton Hall", "title_page": "Former WVC Standout Alexis Lewis Transferring To Seton Hall", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Alexis Lewis is on the move.\nThe all-time leading scorer in Wyoming Valley Conference girls basketball, Lewis will transfer from Iona to Seton Hall.\nCurrently a junior, Lewis said she will sit out next season due to standard NCAA transfer rules before returning to the hardcourt in the 2019-20 season.\n“We’ve been through a lot of ups and downs,” Lewis said of Iona. “I’m very grateful for the opportunity, very grateful for the relationships I made from my time here. But ups and downs come, and you have to make decisions for yourself.”\nLewis, who is studying toward a degree in social work, said she believes Seton Hall offers the most exposure and opportunity for her to develop as a basketball player.\nLewis, a 5-foot-10 guard, said she hopes to graduate then play professionally in the WNBA or overseas.\n“It came to a point where I had to start thinking about my future in ways that would benefit me the best way possible,” she said. “So I came to this decision ... the best decision.”\nLewis was a three-time Citizens’ Voice Player of the Year at Holy Redeemer, from where she graduated in 2015 with 2,393 career points.\nLewis said she was not recruited by Seton Hall coming out of high school, instead choosing Iona, an NCAA Division I program in New Rochelle, New York.\nLewis played 96 games and scored 1,227 points (12.8 ppg) in three seasons at Iona.\nIn Lewis’ freshman year, the Gaels won their first Metro Atlantic Athletic Conference (MAAC) championship and made the NCAA tournament.\nAs a sophomore, Lewis scored 15.9 ppg and started all 31 games as Iona went 18-13.\nBut on the spectrum of “ups and downs” Lewis talks about, this past season easily qualifies on the down-side.\nLewis’ stats were down across the board, as she averaged 14.1 ppg and started in only eight games. Iona struggled to a 2-28 record.\nMeanwhile, Seton Hall is coming off a 16-16 season that it capped with a WNIT appearance.\nA New Jersey-based school and member of the Big East, Seton Hall plays a “power five” schedule and had a few games this past season appear on television networks like YES, FSN, FS2 and BNT Plus.\nLewis said her older brother, Eugene Lewis, a Montreal Alouettes football player whose own college career included a graduate transfer from Penn State to Oklahoma, was one of the people she consulted when making the decision.\n“Of course,” she said. “Since he’s been through the process, going through it a second time, you want to make sure you end up in the right spot.”\nContact the writer:\nmbufano@citizensvoice.com;\n570-821-2060;\n@CVBufano on Twitter", "url": "https://apnews.com/e7a305c025814d32b4cc3e91dc0d60c8"}