{"authors": ["Cody Mcdevitt Codym Dailyamerican.Com"], "date_download": "2020-05-04 20:12:47", "date_modify": "2020-05-04 20:12:47", "date_publish": "2018-10-01 00:46:00", "description": "(This is part of an ongoing series about World War II veterans from Somerset County. Close to 500 veterans from that war die daily, according to the Department of Veterans Affairs. The newspaper...", "filename": "_c5229045719544bea0f619faaa23aca8_1588623167.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c5229045719544bea0f619faaa23aca8_1588623167.html", "title": "Glencoe man witnessed Nuremburg trials", "title_page": "Glencoe man witnessed Nuremburg trials", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "(This is part of an ongoing series about World War II veterans from Somerset County. Close to 500 veterans from that war die daily, according to the Department of Veterans Affairs. The newspaper will tell the stories of those who remain and of those who have died as they and their families come forward. It’s the Daily American’s effort to document an important part of the nation’s history.)\nRalph Leister remembered American intelligence officers secretly mixed in with SS prisoners at the prison camps the allied soldiers had for Nazi soldiers and operatives. They wanted to find out who committed atrocities. Many of the people who had been killed were just thrown into brush piles.\n“We’d take the prisoners out and make them bury those bodies and we guarded them while they did it,” he later said in an account of his wartime service. “Such an odor you never smelled before. The bodies were all decayed and the flesh would just drop off the bones.”\nLeister, of Glencoe, was drafted in 1944 and assigned to the 79th Infantry Division as a replacement in March of 1945. During his time in the war and immediately after, he crossed the Rhine River, served as an honor guard for General George Patton’s funeral and personally escorted Hermann Goering and Rudolph Hess to and from their cells during the Nuremburg trials.\nLeister recounted his time in the service in “Victorious! From Hometown America to Tokyo Bay,” which was a history compiled by students and staff at St. Vincent College.\nAt the Rhine River, his unit shelled the Germans. They waited for about two to three hours.\n“It was pretty near hell,” he wrote. “Then we took our boats across and found out the Germans were dug in but they didn’t give us any resistance. They were just pulverized and shocked because of the shelling.”\nLater on as they traveled through the countryside, he witnessed a Nazi soldier with a bazooka blow up an American tank. He saw a number of his fellow soldiers die during the ensuing battle.\nLeister saw up close the perpetrators and punishment of the Holocaust, which was the systematic, bureaucratic, state-sponsored persecution and murder of six million Jews by the Nazi regime and its collaborators. The Nazis, who came to power in Germany in January 1933, believed that Germans were “racially superior” and that the Jews, deemed “inferior,” were an alien threat to the so-called German racial community, according to the United States Holocaust Memorial Museum.\nThe soldiers he guarded, which were known as SS, an abbreviation of Schutzstaffel, German for “Protective Echelon,” according to Encyclopedia Brittanica. The SS was headed by Heinrich Himmler, who built up the SS from fewer than 300 members to more than 50,000 by the time the Nazis came to power in 1933. SS men were schooled in racial hatred and admonished to harden their hearts to human suffering.\nLeister went from guarding SS prisoners to the Palace of Justice grounds in Nuremburg, the site of the post-war trials of Nazis who were involved in the Holocaust.\n“I remember there was a series of doors they had to pass through to go to different places and we’d open the doors and let them through,” he said. “They wore big leather boots and Nazi-style breeches but they just walked through as they were told, like anyone else. I was close enough to Goering, Hess and many of the other Nazi big shots to spit on them if I had wanted to.”\nHess and Goering were two of the most prominent people within the Nazi party’s rule.\nAfter Leister’s time in the service, he went back to work for the railroad section gang until 1950. He later went over to the bridge gang and stayed there until he retired in 1987. His marriage to his wife Mae produced four children.\nIn the historical account he gave the students, Leister said he led a good life.\n“I’m glad I was able to serve my country,” he said. “Had it not been for the Army I never would have seen anything of the world, but it’s sad that it took a war for that to happen.”", "url": "https://apnews.com/c5229045719544bea0f619faaa23aca8"}