{"authors": ["Douglas Massey", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Barbara J. Fields", "Karen E. Fields", "Sidney Rittenberg", "Robert Greene Ii", "Howard Brick"], "date_download": "2020-05-04 19:49:58", "date_modify": "2020-05-04 19:49:58", "date_publish": "2018-02-16 00:00:00", "description": null, "filename": "2018_02_cycle-of-segregation-review-krysan-crowder-racism_1588621798.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/02/16170329/38433125321_30e35d3904_k.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_02_cycle-of-segregation-review-krysan-crowder-racism_1588621798.html", "title": "How Segregation Persists", "title_page": "How Segregation Persists", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nReview of Cycle of Segregation: Social Processes and Residential Stratification (New York: Russell Sage Foundation, 2017).\nDespite rising minority socioeconomic status, declining levels of discrimination, and growing tolerance for other-race neighbors, residential segregation persists in the United States, and for African Americans remains as high as ever in several large metropolitan areas. In Cycle of Segregation , Maria Krysan and Kyle Crowder make a major contribution to our understanding of how and why residential segregation persists. The authors critique the theoretical and methodological models commonly used by social scientists to conceptualize and study residential segregation in the United States: the spatial assimilation model (which attributes segregation to socioeconomic differences between groups), the place stratification model (which attributes segregation to discrimination in housing and lending markets), and the group preferences model (which attributes segregation to widespread preference for same-race neighbors). As an alternative, Krysan and Crowder offer a new conceptual framework, the “social structural sorting perspective,” which argues that segregation persists because residential decision-making is embedded within racialized social, economic, cognitive, and spatial structures and that these structures constrain locational behavior to replicate existing levels and patterns of segregation through a variety of self-perpetuating processes that yield urban landscapes that are systematically stratified by race and class.\nSegregation and House Hunting The book begins by reviewing trends in black, Hispanic, and Asian segregation from non-Hispanic whites over the period from 1970 to 2010. Although on average black-white segregation has slowly declined, the shifts toward desegregation have been highly uneven. Significant declines have been confined mainly to small metro areas with small black populations, while metropolitan areas with sizable black communities continue to be very highly segregated. Levels of segregation for Hispanics and Asians have remained relatively stable over time, despite rapid population growth through immigration. Whereas levels of Hispanic segregation vary from moderate to high, however, levels of Asian segregation vary from low to moderate. Moreover, although it is not mentioned in the book, the rapid increase in the proportion of Hispanics living in US metropolitan areas has produced a substantial increase in the degree of neighborhood isolation they experience. Like African Americans, Hispanics increasingly occupy neighborhoods composed of same-race others. Once solidly white neighborhoods have diversified over time, of course, but Krysan and Crowder show that this diversification has occurred more through the entry of Hispanics and Asians into white neighborhoods than of African Americans. In fact, the composition of American neighborhoods has changed rather slowly despite the diversification of American society generally. For African Americans, especially, black-white segregation levels in 1980 strongly predict those in 2010, suggesting continuity rather than change in the degree of black residential segregation. Having established the inertia inherent in US segregation patterns, the authors begin to make their case by citing research showing that people search for housing in two phases. First they decide in which areas to search, and then they decide which units in those areas to consider. The first stage is the most critical in determining patterns of segregation, since it limits the search to specific neighborhoods. Krysan and Crowder creatively draw on the psychology of judgment and decision-making to explain that people fall back on “heuristics” to simplify complicated choices. One heuristic in particular, they suggest — the “correlated characteristics heuristic” — comes into play in residential decisions because the characteristics of neighborhoods are highly intercorrelated, such that one salient characteristics can conveniently be used to stand for others. The authors cite evidence that home seekers tend to pick a single cue which they use to stand in for the full set of features they seek in a neighborhood, and that often this cue is racial composition. In white social cognition, a high percentage of blacks is strongly associated with high rates of crime, low property values, and poorly performing schools. Only in the second stage do actors turn to specific tools such as newspapers, real estate agents, or the internet; but they also rely heavily on “word of mouth” and other informal sources. At both stages, however, the search process is dynamic and interactive, with information gleaned from different sources feeding back on decision-making to narrow or expand the search — usually the former. In addition to imperfect information, housing searches are constrained by limits of time and money, resources that are scarce for poor households. The supply of affordable housing is quite restricted, budgets are tight, and unplanned emergencies are common, factors that, as sociologist Matthew Desmond has shown, all too often culminate in eviction. Krysan and Crowder present data to show that the probability of moving rises with income among those who expect to move but falls among those who do not expect to relocate and that the percentage of people who stop searching because they are satisfied with a housing unit rises with income.\nSearching Under Constraint Thus, poor people move because they have to and not because they want to, and the need to find housing is often pressing and immediate. Under these circumstances, they typically search in a limited set of neighborhoods and settle for an acceptable unit, rather than taking their time to find the best unit in the most suitable neighborhood. For African Americans, the search for housing is additionally constrained by racial steering and discrimination, actions that have declined in frequency but not disappeared. As a result, minorities begin their search in neighborhoods that match their preferences for more white residents but end up in neighborhoods with fewer whites than they prefer. In contrast, whites search in neighborhoods with a higher percentage of whites than they say they prefer, and end up in neighborhoods that are overwhelmingly white. Krysan and Crowder present data to show that the neighborhoods whites say they would “seriously consider” invariably contain a large majority of white residents. Moreover, controlling for an array of individual and community characteristics, the white percentage strongly predicts whether whites choose a neighborhood to live in at all. In contrast, the white percentage does not influence the likelihood that minorities would select a neighborhood as a place to live. Race, in other words, tends to swamp the decision process of white home seekers to the exclusion of other factors. Indeed, studies indicate that racial composition is commonly used by whites as a proxy for other neighborhood circumstances such as crime rates, home values, and school quality; and whites evaluate black and racially mixed neighborhoods more negatively than white neighborhoods irrespective of their actual characteristics. People mainly learn about neighborhoods through their own residential experiences, daily activities, and interactions with other people, but these typically occur within residentially segregated environments that naturally produce racially segmented perceptions that lead to “racial blind spots” in decision-making. People know more about places where their racial group dominates, and these blind spots are stronger and more prevalent among whites than among African Americans or Hispanics. Members of different racial groups are thus likely to be selecting places to live from completely different choice sets, in violation of the assumptions underlying most rational choice models.", "url": "https://jacobinmag.com/2018/02/cycle-of-segregation-review-krysan-crowder-racism"}