{"authors": ["Christopher Jardine"], "date_download": "2020-05-04 21:07:18", "date_modify": "2020-05-04 21:07:18", "date_publish": "2018-11-07 07:15:00", "description": "ADAMS COUNTY — Republican challenger Brent York was elected Adams County Sheriff in the race against Democratic incumbent Sam Wollin on election night Nov. 6. With all precincts reporting, York...", "filename": "_d24a795ea5e141be8ae9f24e0ce9cf44_1588626438.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d24a795ea5e141be8ae9f24e0ce9cf44_1588626438.html", "title": "York ousts Wollin in Adams County Sheriff race", "title_page": "York ousts Wollin in Adams County Sheriff race", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ADAMS COUNTY — Republican challenger Brent York was elected Adams County Sheriff in the race against Democratic incumbent Sam Wollin on election night Nov. 6. With all precincts reporting, York led Wollin by a margin of 4,860 to 4,472.\nWollin has served as Adams County Sheriff for the previous eight years, while York has worked in the department since 1995. York is currently serving as an investigator.\nThe race has proven controversial, with Wollin placing York on paid administrative leave Oct. 10 amid concerns over York’s truthfulness. The suspension happened hours before the only debate between the candidates.\nThe suspension stemmed from an incident involving York and Steven Vosen, who was in department custody at the Adams County Jail on Feb. 11, 2001 when he was allegedly assaulted by then Undersheriff Kenneth Bitsky and York. Vosen suffered a broken arm in the incident, among other injuries. Vosen also alleged that Bitsky and York engaged in a cover-up of the assault.\nYork’s various accounts of the incident were fully uncovered in September, while the Adams County personnel office digitized files, with the discovery of a deposition York gave in 2004. That deposition provided an account of the incident that was at odds with York’s initial report of the incident, and with York’s description of events to outside investigators.\nThe numerous different accounts of the incident by York led District Attorney Tania Bonnett to consult the Wisconsin Department of Justice on the potential consequences of York’s actions. The Department of Justice responded on Oct. 8 with a letter laying out concerns about York under the United State Supreme Court’s Brady/Giglio decisions. York received a letter conveying those concerns Oct. 9, and was placed on leave Oct. 10.\nYork has since claimed that the suspension was politically motivated. Wollin denied those claims.\nA court case in which York testified was overturned on appeal Oct. 8, with the state conceding that the appellant was entitled to post-conviction relief in part because of Brady/Giglio concerns about York’s testimony in the case. York was also pulled from testifying in at least one known case prosecuted by the Wisconsin Attorney General’s office over concerns about his testimony regarding the Vosen incident.\nAs part of his plans for the office, York has claimed that he will work minimize staff turnover and reduce the amount of overtime officers are currently working. He has blamed Wollin throughout the campaign for creating a work environment that lacked a sense of community.\nYork has stated that he plans on moving the Adams County Sheriff’s Department from a “reactive policing model” to a more proactive model, with an increased focus on drug related crimes before they lead to property and other crimes. York has also stated an openness to re-tooling the Adams County Treatment Court to fit his vision of a proactive model.", "url": "https://apnews.com/d24a795ea5e141be8ae9f24e0ce9cf44"}