{"authors": ["Andrea Larson Alarson Norfolkdailynews.Com"], "date_download": "2020-05-04 20:09:50", "date_modify": "2020-05-04 20:09:50", "date_publish": "2018-05-03 14:10:00", "description": "For a highly-contested race that will be decided in the May 15 primary, the four men campaigning for Madison County sheriff have a great deal of respect for and trust in each other. As...", "filename": "_2b1f9d209a9c4669a6ee94d96f3db451_1588622990.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2b1f9d209a9c4669a6ee94d96f3db451_1588622990.html", "title": "Sheriff candidates agree on most issues, complimentary of each other", "title_page": "Sheriff candidates agree on most issues, complimentary of each other", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sheriff candidates agree on most issues, complimentary of each other\nFor a highly-contested race that will be decided in the May 15 primary, the four men campaigning for Madison County sheriff have a great deal of respect for and trust in each other.\nAs current co-workers in the sheriff’s office, they also recognize a lot of the same issues as important in the race — and give similar solutions on how to address challenges.\nEach of the four Republican candidates — Jon Downey, Todd Volk, Christian Hjorth and Dave Unger — have decades of law enforcement experience and has worked in a variety of positions under current Sheriff Vern Hjorth, who is not seeking re-election.\nThe sheriff-hopefuls participated in a candidates’ forum Wednesday evening at the Norfolk City Council chambers, during which a media panel asked prepared questions as well as some from the audience in attendance.\nNearly 100 people, including Mayor Josh Moenning and other elected officials, attended the hour-long forum sponsored by the Norfolk Daily News and WJAG News Talk Radio.\nThe first question asked of the candidates was whether they have seen attitudes toward law enforcement officers change and become more negative over time.\nAll four agreed that is indeed the case.\nChris Hjorth said it is unquestionable that public opinion regarding law enforcement has changed during his 30 years of service. The solution is to hold police officers to a higher standard, a continuance of what Hjorth said already happens in Madison County.\nVolk said he noticed an attitudinal shift toward the police during the last federal administration.\nVolk said it’s important to hire proper employees and provide proper training to show the positive side of law enforcement. He said having officers work closely with the public would also provide a benefit as to how they are perceived.\nDowney said a negative perception of law enforcement can be seen in the decline in the number of men and women entering the field.\nDowney said he would address the issue by fostering a positive relationship with the media, making sure deputies are visible and a part of community events and to reach out to younger people to let them know police aren’t the enemy and through recruitment.\nUnger said the Midwestern mentality keeps law enforcement officers in Madison County from dealing with some of the issues that are present on the coasts, because “we’re basically decent people around here.”\nOfficers who are calm, take it slow and try to reason with citizens get a better reaction, he said.\nWHEN ASKED about what skills are most important in a sheriff, the candidates all agreed that communication is key.\nBeyond that, Unger said a good leader will influence others by his actions.\nDowney said working with other law enforcement agencies is important, in order to keep the sheriff’s department from “becoming an island.”\nVolk said listening to employees and knowing staying up-to-date on their lives will benefit the entire department.\nHjorth said it is “unequivocally the sheriff’s responsibility” to be a good steward of the department’s finances.\nAs for the biggest challenge that will face whomever is elected, each candidate said the recruitment and retention of good employees is an ongoing issue.\nVolk said the best way to keep good employees is to treat them right, no matter their position at the sheriff’s office.\n“We have to make sure that we keep them there by giving them a good department to work for,” Volk said.\nUnger said it’s important the sheriff be fair and not show favoritism.\n“I want to stress that with good people comes the safety of our community,” Unger said.\nCOMMUNICATION WITH the media was another discussion point, and there was a bit of divergence on the topic.\nHjorth said that matters of importance to the public — such as severe weather threats — should be communicated, but “not every DUI and fender bender” needs to be reported.\n“I don’t think citizens want to know every little thing,” Hjorth said.\nHowever, since citizens would like to see an increase in news from the sheriff’s office, they would see it, he said.\nDowney said the media is an “invaluable tool for educating the public” on what finances are being spent on as well as what officers are doing.\nDowney said he started the Madison County Sheriff’s Department Facebook page, and that alone has helped to solve major crimes. Releasing information to local media like the Daily News helped to solve a recent case within hours, Downey said.\nIN THEIR closing comments, each candidate asked for voter support.\nUnger said he would be “honored to lead Madison County for at least the next four years.”\nHjorth said he hoped his answers at the forum had allowed the voters to get to know him a little bit better. “I hope that through tonight that I’ve earned the confidence of some folks,” Hjorth said.\nVolk said his “common sense, transparency and proven ability to lead” will make him a candidate the public can trust.\nDowney closed the comments by saying he has been listening to the issues and trying to affect change for years.\n“I haven’t waited until now,” Downey said.", "url": "https://apnews.com/2b1f9d209a9c4669a6ee94d96f3db451"}