{"authors": [], "date_download": "2020-05-04 20:25:19", "date_modify": "2020-05-04 20:25:19", "date_publish": "2018-04-14 02:40:01", "description": "Not far from Michigan State University's Spartan Stadium and the bridge over the Red Cedar River is a maple tree with a teal-colored mesh bow wrapped around it. A ribbon dangles from the...", "filename": "_6d591bad4eba404e8aed2d83d6d18af6_1588623919.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6d591bad4eba404e8aed2d83d6d18af6_1588623919.html", "title": "At MSU, teal ribbons evoke Nassar's victims", "title_page": "At MSU, teal ribbons evoke Nassar's victims", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Not far from Michigan State University’s Spartan Stadium and the bridge over the Red Cedar River is a maple tree with a teal-colored mesh bow wrapped around it.\nA ribbon dangles from the bow, with a name written on it: Krista Wakeman.\nA few feet away, another tree is wrapped in a teal bow with a ribbon and a name: Jessica Chedler Rodriguez. Still another few feet away, another tree with a teal bow, ribbon and name: Kaylee McDowell.\nAs Kit Breedlove, a fifth-year senior at MSU, walked by the trees recently, he said he knows exactly what the teal ribbons mean: They represent the sexual abuse survivors of Larry Nassar, a former MSU and USA Gymnastics doctor who preyed on girls for more than two decades on campus.\n“It’s a powerful symbol,” said Breedlove, 23, of East Lansing. “It’s a way to talk about what happened. Those ribbons help people remember ... and hopefully prevent it from ever happening again.”\nMore than 200 teal mesh bows are wrapped around trees across MSU’s campus, creating a visual memorial to honor the victims of Nassar’s sexual assaults.\nThe ribbons on the trees symbolize the epic moment when more than 200 women and girls testified for nine days about Nassar’s sexual abuse disguised as medical treatments, and how it affected their lives.\nCatherine Hannum. Arianna Castillo. Taylor Stevens. Victim #186.\nMany at Michigan State have embraced teal, the color of sexual assault awareness, in the wake of Nassar’s fall from renowned osteopathic doctor to federal prison inmate.\nStudents have worn the color to sporting events. Officials have worn teal ribbons on their lapels to public meetings.\nBut among the most visible and constant reminders of the tragedy and reckoning of Nassar are the teal bows around the trees.\nAlexis Moore. Olivia Venuto. Lyndsey Garnet. Jade Capua.\nNear the front of MSU’s Hannah Administration Building is a large tree with a bow, and a ribbon with the name of the woman who inspired the project, Grace French.\nFrench, 22, was not among the women and girls who spoke before Ingham County Judge Rosemarie Aquilina and Eaton County Judge Janice Cunningham in late January and early February about Nassar’s abuse. But she watched the sentencing hearings.\nHer parents, Ron French and Valerie von Frank of Okemos, had approached her months earlier and asked how she felt about the case since she had been treated by Nassar when she was a dancer in middle school. Though Grace French had been assaulted by Nassar, she didn’t tell her parents.\n“I was avoiding the situation,” said French, a senior business major at the University of Michigan. “I wasn’t at the point that I felt that I could tell them. I knew it would have a huge impact on my family. I didn’t want them to be hurting as much as I was.”\nOn the third day of the hearing in Ingham County, French was at work when she watched some of her closest dancer friends from high school share their names and stories about Nassar. She broke down on the way home. Later, she called the women and told them how sorry she was.\nThen French called her mother.\n“She was crying pretty hard and I could barely understand her,” von Frank said. “When she told me she had been watching the testimony, that was all she needed to say. I had already asked her several times before that and she was not ready to talk about it. I knew what I had already known.”\nMelody Posthuma van der Veen. Jessica Smith.\nA few days later, von Frank was driving. It was January, and ice was glistening in the trees. It reminded her of the yellow ribbons that people tie around trees to welcome soldiers home. She thought of how trees are big and strong and resilient, like all of Nassar’s victims.\nThough von Frank was devastated about her daughter and all the other girls who Nassar had preyed upon, she felt hopeful when she imagined teal ribbons around campus trees.\n“The girls had their opportunity in court, but now there was so little talk about the survivors,” said von Frank, who works for MSU in two positions in the College of Education. “I didn’t want them to get lost. I wanted a visual reminder of every one of those girls because they deserve to have something up to remind people.”\nMarion Siebert. Jessica Thomashow. Amy Labadie.\nVon Frank went to a hobby store to buy the ribbons, and enlisted the help of a few family friends and activists from the group Reclaim MSU.\nFormer MSU President Lou Ann Simon had recently resigned amid the scandal, and trustees had appointed former Gov. John Engler as interim president. But Engler hadn’t arrived on campus yet. Von Frank worked on the weekends to get up as many teal ribbons as she could around the administration building.\n“I wanted John Engler to walk up to that administration building on his first day of work to see the effects of the situation,” von Frank said. “I wanted him to get the message that we need to start putting the survivors first.”\nAmong those who helped von Frank was Kristin Dike, an MSU junior who was a friend of French’s younger sister, Hannah.\n“It’s been (awhile) and it’s not in the forefront of people’s minds anymore,” said Dike. “Then I see the ribbons and it reminds me not to forget what happened. I hope other aren’t forgetting either. It’s a horrible thing that happened. If we don’t hold people accountable, something like that might happen again.”\nEmily Morales. Erin McCann. Victim #138.\nIt was cold and snowy outside when Frank began putting up the ribbons in early February. She had thought she could do it in one day. But she found herself on campus every weekend, sometimes twice during a weekend when the weather was too brutal to stay outside for long. She finished in March.\nSometimes, she went with the students who helped her. Sometimes she went alone, and cried as she put up another ribbon. She thought of all of them, and their families.\n“It’s small, but it gives them something, a tribute here in East Lansing where it all began,” said von Frank.\nChelsea Zerfas. Samantha Daniels. Alliree Gingerich.\nThe hardest ribbon for von Frank to put up was the one for her daughter. She fell in the snow as she wrapped it around the tree.\n“It brought me to my knees,” said von Frank, as she fought back tears.\nThere are 224 teal ribbons tied around trees on MSU’s campus. They’re near many MSU buildings, including the Beaumont Tower, IM Sports, Alfred Berkowitz Basketball Complex, Skandalaris Football Center and Fee Hall, which houses the College of Osteopathic Medicine.\nThe ribbons are also near Jenison Fieldhouse, one of the places where Nassar sexually assaulted the young women. Recently von Frank put up ribbons near the house where former President Lou Anna Simon’s new office will be when she returns to the faculty.\nRachael Denhollander. Larissa Boyce. Morgan McCaul. Sterling Riethman.\nAmong those who appreciate the ribbons is Amanda Thomashow, who filed a Title IX report with MSU against Nassar in 2014. She recently moved back to East Lansing from California after her case was reopened, and has had ups and downs since then.\n“I was so scared I would be back here and feel alone and have to deal with the pain alone,” said Thomashow. “Seeing those ribbons makes me feel so much less alone ... I know they are not just for me. But they make me feel like I am going to be OK.”\nGwen Anderson. Anna Dayton. Brooke Hylek.\nSince French is studying in Ann Arbor, she found solace among all of the survivors who created a sisterhood. She also got a new puppy, Bentley, who’s helped her on her journey.\nMany people are finding ways to channel their feelings in the aftermath of Nassar, Grace French said, including her mom, who put up the ribbons.\n“Not all of us are in Lansing,” said French. “It’s nice to be present on the campus even if we are not able to be fully part of the movement at MSU.”\nVon Frank’s project was a way of honoring all of Nassar’s victims. But it has helped her heal, too.\n“I don’t want us to forget,” von Frank said. “I don’t want anyone on the MSU campus to forget what this has meant and the extent of this.”\nLindsey Lemke. Alexis Alvarado. Makayla Thrush. Morgan Valley. Kassie Powell ...\nKKozlowski@detroitnews.com", "url": "https://apnews.com/6d591bad4eba404e8aed2d83d6d18af6"}