{"authors": ["Paul Hammel World-Herald Staff Writer"], "date_download": "2020-05-04 20:18:08", "date_modify": "2020-05-04 20:18:08", "date_publish": "2018-04-14 05:00:00", "description": "PLATTSMOUTH, Neb. — In the end, it was about the law, not “agape” love or whether a Weeping Water man was justified in assisting the suicide of a girlfriend who insisted, falsely it turns out,...", "filename": "_0c4e946c4cb4442c9dd99c9be9b13141_1588623488.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0c4e946c4cb4442c9dd99c9be9b13141_1588623488.html", "title": "Jurors put emotions aside, find man guilty of assisting in girlfriend's suicide", "title_page": "Jurors put emotions aside, find man guilty of assisting in girlfriend's suicide", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PLATTSMOUTH, Neb. — In the end, it was about the law, not “agape” love or whether a Weeping Water man was justified in assisting the suicide of a girlfriend who insisted, falsely it turns out, that she was about to die from cancer.\nOn Friday, after hearing more than two days of testimony , a jury took less than three hours to find Matthew Stubbendieck guilty of assisting in the suicide of his girlfriend last summer.\nStubbendieck, 42, betrayed no emotion as the verdict was read or when he exited the courtroom.\nHe now faces up to two years in prison for assisting in the Aug. 1 suicide of Alicia Wilemon-Sullivan, 38, whom he’d met while living in Florida for most of the past 16 years.\nAfter the verdict, one of the jurors said the others on the eight-woman, four-man jury had some empathy for Stubbendieck and his plight — a girlfriend who, by all appearances, was terminally ill and wanted to end her pain via suicide.\nWilemon-Sullivan, a divorced mother of four, had texted her boyfriend photos of supposed cancer surgery scars and claimed she had tried radiation treatments that were unsuccessful. She insisted that he give her “agape” love — the purest form — and allow her to die in his arms.\nBut juror Amanda Phillipson of Plattsmouth, whose own father died of cancer, said jurors set emotions and talk of manipulation aside and focused on the state law against assisting in suicide.\nStubbendieck, she said, admitted that Wilemon-Sullivan was coming to Nebraska to take her life, and he helped her find a secluded spot — a wooded former rock quarry near Weeping Water — to do it.\nBut when he told investigators that he had left his girlfriend, bleeding from self-inflicted slashes on the wrist, to die after lying with her for seven hours, “that was enough for me,” Phillipson said.\n“He did nothing to stop it. That was assisting (in suicide),” she said.\nProsecutions for assisted suicide are rare in Nebraska and Iowa, and going to prison for it is also not common.\nCass County District Judge Michael Smith said he will issue his sentence June 4. Under a recent state sentencing reform law designed to reduce Nebraska’s chronic prison overcrowding, there is a “presumption of probation” for such Class IV felonies.\nBut Wilemon-Sullivan’s mother and older sister both told The World-Herald that Stubbendieck deserves to be punished for what he did.\n“If you love someone, you don’t just sit there and let them die,” said Shirley Wilemon of St. Cloud, Florida. “He could have saved my daughter, and he chose to leave her out there.”\nCass County Attorney Colin Palm said there is emotion in every trial, but the jury focused on the law.\n“It was the only just verdict,” Palm said.\nStubbendieck’s attorneys did not comment as they left the courtroom. Neither did his parents, Sheri and Howard Stubbendieck. Howard Stubbendieck was a longtime mayor in Weeping Water.\nTheir son remains free on bond while awaiting sentencing. Palm said he wears an ankle monitoring device.\nDuring closing arguments Friday morning, Palm told jurors that Stubbendieck had multiple chances to thwart his troubled girlfriend’s death wish, but didn’t. He said Stubbendieck ignored warnings that what he was doing was “legally wrong.”\n“He said he didn’t care, he would do that time,” Palm said. “He wanted to help her die. He did help her die.”\nDuring the trial, jurors were shown hundreds of text messages exchanged between Wilemon-Sullivan and Stubbendieck, detailing her insistence that she was dying from cancer and wanted to end her suffering.\nHer body was found Aug. 5, four days after she told him to leave her in a secluded, wooded area where they had made love on a blanket, he said.\nShe had slashed her wrists, he said, after he had walked away to urinate. That led to a 7½-hour ordeal in which he said she slashed her wrists several more times and bled profusely. He said he twice tried to suffocate her to end her suffering but quickly gave up after she appeared scared.\nIn her closing arguments, Deputy Cass County Public Defender Angela Minahan insisted that her client had been manipulated into participating.\nShe displayed a huge poster for jurors of the “spider web of deceit” spun by Wilemon-Sullivan to pull Stubbendieck into her death wish.\nMinaha said that her client did not provide the knife Wilemon-Sullivan used to slash herself, nor was there any evidence that he provided her any narcotics, despite his comments that he was seeking morphine.\nAn autopsy was inconclusive about the cause of death because the body had begun to decompose, but there was enough morphine found to cause death. Minahan said that drug may have been the pills Stubbendieck saw his girlfriend take, which came from two Dramamine bottles Wilemon-Sullivan had brought from Florida.\nStubbendieck’s attorneys had told jurors that family members thought that Wilemon-Sullivan was addicted to drugs, and that she was being investigated for embezzling from her employer. Their client, they said, didn’t know she was going to slash herself when she did.\n“He found himself in a situation no one should be placed in,” Minahan said Friday. “His crime was that he loved her too much, and he let her manipulate him with that love.”\nShirley Wilemon choked back sobs and wiped tears from her eyes as attorneys described the bizarre death of her daughter during closing arguments.\nShe said her daughter was not the “horrible person” portrayed during the trial.\nWilemon-Sullivan was troubled, her mother said, but was loved by her family, and left behind four children.\n“The younger ones still don’t understand what happened to their mom,” Wilemon said.", "url": "https://apnews.com/0c4e946c4cb4442c9dd99c9be9b13141"}