{"authors": ["Eli Francovich"], "date_download": "2020-05-04 20:13:39", "date_modify": "2020-05-04 20:13:39", "date_publish": "2018-12-02 00:00:00", "description": "Flip through any promotional material selling the Spokane lifestyle and one theme quickly emerges. Easy access to nature. For example, Spokane’s #HackingWashington ad campaign aimed at...", "filename": "_11e267e140d741b0a404c34e159ae8b8_1588623219.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_11e267e140d741b0a404c34e159ae8b8_1588623219.html", "title": "With less than 10 percent of Spokane County designated public land, our region’s backdrop is at risk", "title_page": "With less than 10 percent of Spokane County designated public land, our region’s backdrop is at risk", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With less than 10 percent of Spokane County designated public land, our region’s backdrop is at risk\nFlip through any promotional material selling the Spokane lifestyle and one theme quickly emerges.\nEasy access to nature.\nFor example, Spokane’s #HackingWashington ad campaign aimed at luring Seattleites east, features photo after photo of exquisite natural beauty. Snow-covered slopes. Glimmering lakes. Forests exploding with color. It’s true. Spokane is still a city where it’s possible to go fishing, mountain biking or hiking during your lunch break.\nAs permanent, as baked into our civic being as that backdrop may seem, it’s not.\nLess than 10 percent of Spokane County is public land. That’s a significantly lower percentage than other counties. For example, King County is 51 percent public land. Yakima County, which has about half the population of Spokane County, is 36 percent public land. Among Washington’s 10 most populous counties, Spokane has the smallest percentage of public land.\n“I think about that when I’m out driving around our region and you look up at the forested hill sides and you kind of assume that will remain part of our region’s backdrop for years,” said Dave Schaub, the executive director of the Inland Northwest Land Conservancy. “You realize it may not. That it is privately owned land.”\nThat’s the impetus behind a new INWLC initiative, the Olmsted 2.0. Modeled after the 1907 Olmsted Plan, Schaub said the effort hopes to coordinate conservation and recreation efforts between different agencies and user groups.\n“We run the risk of seeing a lot of our current natural spaces, undeveloped view sheds and wildlife corridors as well as human use trail corridors, developed,” Schaub said.\nThe original Olmsted act gave Spokane its extensive and, for the most part, accessible network of parks. In 1907, Aubrey White the president of the city’s new park board hired the Olmsted Brothers, Landscape Architects to create a park plan for Spokane. That decision was made, in large part, because of concerns about Spokane’s rapid growth. White believed the city had to act immediately to acquire park land cheaply and avoid the mistakes of bigger Eastern cities.\nIn many ways Spokane finds itself in a similar situation, more than 100 years later. Current population projections predict that 250,000 additional people will move into the Spokane and Kootenai counties in the next 30 years.\nA recent study from the Urban Outdoor Access Analysis by the Trust for Public Land found that Spokane residents have 7.54 acres of public land within an hour drive of their home and 82 percent of residents live within a 10-minute walk of a park. That factoid was a key element of Spokane’s recent ranking as one of the 50 best U.S. cities for outdoor access.\nAs impressive as that statistic is, it’s not an immutable truth. As the area’s population grows the pressure on undeveloped land will grow.\nThe Olmsted 2.0 plan is in its infancy, Schaub said. INLWC met with area agencies and stakeholders about a year ago and presented the idea. Now, he said, INLWC has applied for a grant from Innovia Foundation and is continuing to meet with stakeholders. As with all INLWC projects, Schaub said they would work with willing and interested landowners.\n“It’s something we are talking about and trying to build some momentum around,” he said.\nThe Spokane County parks department is one of those agencies.\nSpokane county park planner Paul Knowles said vehicle counters at county trail heads have seen a “significant increase in annual use.”\nKnowles, and others, hope to avoid problems other high-density, recreation crazy areas like Seattle and Denver have experienced.\nSpokane County has started installing web cams at certain trailheads, Knowles said. That allows users to see if the trail is crowded on a particular day and plan accordingly. That helps “accommodate that growth by spreading the use out a little bit more. So not one area is hammered,” he said.\n“Luckily, we’re still in a really good position here in the county,” he said. “We’re expanding our open space network and there are relatively large pieces of property close to town that are still relatively affordable.”\nA key way the county has, and is, securing more public land is through the Conservation Futures Program. The program is funded by a 4.67-cent tax on every $1,000 of assessed property value in Spokane County. Roughly $1.5 million in annual tax revenues is accrued for acquisitions.\nBut purchasing the land is only the first step. Managing the land costs money and takes time. Knowles said any conservation purchase has to be considered over the long term.\n“There might be a perception that you purchase the land and that’s it. But that’s just really the beginning of a very long journey,” he said. “There are so many things that go into managing property that we have to expand the system responsibly.”\nSchaub is aware of that constraint. Although there are no plans in place for funding maintenance of new land, he said the Olmsted 2.0 plan will consider ways to provide funding for maintenance and management.\nA growing human population is not only a Spokane concern. And parkland, while beneficial, is only one part of the equation.\nA recent report by the Intergovernmental Platform on Biodiversity and Ecosystems Services estimated that only a quarter of Earth’s land is “substantively free of the impacts of human activities.”\nIn particular, 83 percent of all wetlands have been lost in the past 300 years, with 54 percent lost since 1900.\nThat’s part of the reason the Colville National Forests draft forest management plan, which substantially reduced the amount of eligible wilderness land, is troubling to Tim Coleman, the executive director of the Kettle Range Conservation Group and a member of the Northeast Washington Forest Coalition, or NEWFC.\nThose kinds of wild spaces are ecologically important, proving animal habitat, refreshing water and recycling the air, he said.\n“Plus they’re also refuges for the human spirit,” he said.\nLike the Olmstead 2.0 plan NEWFC considers how to make recreation more accessible and attractive. Developing and maintaining a robust trail network is a key part of NEWFC’s projects.\n“What’s happened on the Colville National Forest is that despite the fact that there are more people there are less trails,” said Mike Petersen, the executive director of the Lands Council. “Part of it is the overarching problem of more humans but also more humans that want to get away from their urban areas and recreate.”\nAs of 2013, the Colville National Forest had seen a 62 percent decrease in employees since the early 1990s with comparable reductions in the agency’s recreation budget.\nNEWFC and other groups are picking up some of that slack by advocating, purchasing and maintaining public land for recreation. Timber projects, like the Chewelah A to Z project, include recreation and management plans.\nThe perils of not anticipating the inevitable population growth are clearly illustrated elsewhere within Washington state.\nIn the 1990s, the Alpine Lakes Wilderness area was approved for an overnight permitting system which would control the amount of overnight use. While the Enchantments portion of the wilderness area implemented an overnight system, the Lake Ingalls area did not.\nThat has become a problem in recent years said Carly Reed the Okanogan-Wenatchee National Forest wilderness manager. Skyrocketing day and overnight use is stressing the alpine environment.\nWhile the specifics of that area may not apply to the Spokane region, the overall point remains.\nForested hillsides could become developments, Schaub said. Many have. The question then becomes one of priorities and desires.", "url": "https://apnews.com/11e267e140d741b0a404c34e159ae8b8"}