{"authors": ["Corey Vaughn", "The Daily Iberian"], "date_download": "2020-05-04 20:10:09", "date_modify": "2020-05-04 20:10:09", "date_publish": "2018-04-01 11:00:00", "description": "COTEAU — The Year of the Dog was kicked into full swing this weekend in Lanexang Village, a Lao community nestled right on the Iberia Parish line in Coteau. Every Easter weekend, thousands...", "filename": "_c08cadf01c1448a6bb22727bfeae9090_1588623009.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c08cadf01c1448a6bb22727bfeae9090_1588623009.html", "title": "Lao New Year draws crowd", "title_page": "Lao New Year draws crowd", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "COTEAU — The Year of the Dog was kicked into full swing this weekend in Lanexang Village, a Lao community nestled right on the Iberia Parish line in Coteau.\nEvery Easter weekend, thousands of men, women and children congregate in the neighborhood and make their way into the grounds of Wat Thammarattanaram for Lao New Year. Although the actual Lao New Year holiday begins in mid-April, the holiday is celebrated traditionally on Easter weekend.\nThe normally quiet area of Coteau had vehicles parked in every possible place, from sugar cane fields to closed businesses. Most of those going to the event, however, just find the nearest house near the village, where front yards are made into impromptu parking lots.\nEntering into Lanexang Village on Saturday made one feel like one was in Vientiane. Lao communities from all over the South make their way to Coteau for the event, with many organizing their own separate T-shirts and logos just for the weekend.\nLanexang Village is comprised of three streets; Luangphbang, Savannaket and Vientiane Street. The temple itself is located on the adjacent street, Champa Avenue.\nAn average Teche Area resident would characterize the revelry for Lao New Year on those streets as similar to a Mardi Gras.\nInstead of floats, separate groups create elaborate sets on trailers hitched to a pickup truck, playing music and singing karaoke while traditional Lao dances are performed nearby or just general partying.\nThere’s also an obvious inter-generational aspect to the new year as well. Older groups will play popular Lao tunes while younger groups blast popular American music. Traveling from one street to another can sometimes feel like completely different worlds.\nIt’s more than just Lao people at the event, too. The celebration draws a diverse crowd yearly, especially among younger people.\n“We like to come every year,” Shane Doucet of Lafayette said while he enjoyed the event Saturday afternoon. “It’s either this or Holi Fest (an Indian celebration in Lafayette) every year.”\nWat Thammarattanaram is named for the chanting the Buddhist monks perform while praying. The temple has monks living year-round with support from the Lao community.\nThere have been recent upgrades, such as a basketball court that was installed in 2016, and a restroom installed earlier this year.\nFor Lao New Year, the temple grounds are turned into a shopping center and food mart, with vendors set up all along and across from the temple itself. Barbecue chicken, pho, desserts and every type of Lao food imaginable can be found to eat, along with merchandise promoting the Lao New Year event.\nMary Phengsavath, who hails from Georgia, said she and her family had been in town since Thursday, and have been enjoying this year’s celebration as much as any other.\n“It’s a very good time. We drive over to meet family and have a lot of fun,” she said.\nThe new year festivities began Friday with the Nang Song Kran pageant, which was followed by the crowning of Ms. Nang Song Kran. The night ended with a fais-do-do style party with a cover charge of $10.\nSaturday was when the bulk of the event-goers show up, with the party beginning at noon and lasting until the end of the Nang Song Kran Parade, or Queen’s Parade.\nThe day culminated with the annual celebration of Lao New Year at 7 p.m.\nLao New Year will conclude today at Wat Thammarattanaram with the building of the sand castle and annual water fights. A sand castle ceremony is scheduled for noon.", "url": "https://apnews.com/c08cadf01c1448a6bb22727bfeae9090"}