{"authors": ["Staff Report"], "date_download": "2020-05-04 20:20:15", "date_modify": "2020-05-04 20:20:15", "date_publish": "2018-02-19 00:32:00", "description": "U.S. figure skater Adam Rippon dazzled Olympic audiences on and off the ice — and NBC took notice. The network was set to hire the 28-year-old Clarks Summit native to work as a correspondent...", "filename": "_ca4ebee8fce74e8f85cd0d971f9987db_1588623615.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ca4ebee8fce74e8f85cd0d971f9987db_1588623615.html", "title": "Adam Rippon Turns Down NBC Job", "title_page": "Adam Rippon Turns Down NBC Job", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "U.S. figure skater Adam Rippon dazzled Olympic audiences on and off the ice — and NBC took notice.\nThe network was set to hire the 28-year-old Clarks Summit native to work as a correspondent for the remainder of the Winter Games, USA Today Sports reported Sunday. But when Rippon realized he would be forced to give up some of his Olympic athlete privileges he decided against the move.\n“I am flattered that NBC wanted me to work as a correspondent for them here in Pyeongchang,” Rippon tweeted. “Doing this would require me to leave Team USA and move out of the Olympic Village. I don’t want to do that so I had to declined the opportunity.\n“I love being on Team USA and representing our country. My teammates were there for me during my events, and now I need to be there for them. I look forward to being with them, and I’m very excited for the rest of the competition. Go Team USA!!!”\nIn his Olympic debut, Rippon won a bronze medal in the team figure skating event and placed 10th in the individual competition.\nI love being on Team USA and representing our country. My teammates were there for me during my events, and now I NEED to be there for them. I look forward to being with them, and I’m very excited for the rest of the competition. Go Team USA!!! — Adam Rippon (@Adaripp) February 19, 2018", "url": "https://apnews.com/ca4ebee8fce74e8f85cd0d971f9987db"}