{"authors": ["Doug Fox"], "date_download": "2020-05-04 20:27:48", "date_modify": "2020-05-04 20:27:48", "date_publish": "2018-01-21 13:30:00", "description": "I certainly don't need any convincing, but something which happened Saturday night reminded me that pretty much everything in life can somehow be related to an episode of \"Seinfeld.\" A case...", "filename": "_0bccba4c31dc4311904a7990171d72c6_1588624068.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0bccba4c31dc4311904a7990171d72c6_1588624068.html", "title": "Sundance Notebook: A conversation about nothing", "title_page": "Sundance Notebook: A conversation about nothing", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "I certainly don’t need any convincing, but something which happened Saturday night reminded me that pretty much everything in life can somehow be related to an episode of “Seinfeld.”\nA case in point.\nThere I was standing in line outside in the windy, freezing, snowy cold for entrance into a private Joan Jett concert at the Sundance Film Festival in Park City when an excited conversation a few people away caught my ear. It seems that the place the concert was being held -- The Shop, which is on one side of The Library theater -- doesn’t have adequate restroom facilities. So a lot of people are referred to go in the Library theater building next door. Some people in line had just received a text from their friends -- who had just been in line before that themselves -- saying that they were waiting to use the facilities at The Library, when who should walk out of one of the stalls than Jett herself.\nIndeed, when the girls returned to the line several minutes later, they were still gobbsmocked over their near brush with fame.\nWhen their friends asked if they had said anything to Jett, the girls said no, they were too shellshocked. Jett just washed her hands and left, they reported.\nOf course, one of the other friends had to chime in about the old Seinfeld gag: “Can you imagine if you called out to the stall next to you, ’Can you spare a square -- and it turned out to be Joan Jett?”\nNo, no I can’t.", "url": "https://apnews.com/0bccba4c31dc4311904a7990171d72c6"}