{"authors": ["The New Mexican"], "date_download": "2020-05-04 20:06:54", "date_modify": "2020-05-04 20:06:54", "date_publish": "2018-12-26 02:00:00", "description": "A 56-year-old single working mother in Española says she is raising her grandchildren because her daughter is serving a prison sentence “for something that she regrets to this day.” She...", "filename": "_07907dfa0ed047b8a1a43e6fc1facd5a_1588622814.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_07907dfa0ed047b8a1a43e6fc1facd5a_1588622814.html", "title": "Grandma raising grandkids needs help with bills, rent", "title_page": "Grandma raising grandkids needs help with bills, rent", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Grandma raising grandkids needs help with bills, rent\nA 56-year-old single working mother in Española says she is raising her grandchildren because her daughter is serving a prison sentence “for something that she regrets to this day.”\nShe wrote in her application, “This has really affected our family drastically, but the most horrible thing of all of this is that my grandchildren are being raised without their mother and father in their lives.”\nHer struggles sometimes feel overwhelming, she says, and become more difficult in winter when bills go up. She fears becoming homeless because her landlord is threatening to evict her if she doesn’t start paying higher rent.\nThe applicant is seeking assistance with her rent and paying bills.\nShe is among hundreds of people asking for help from the Empty Stocking Fund.\n• • •\nThe Empty Stocking Fund is a project of the Santa Fe New Mexican. The Santa Fe Community Foundation, Los Alamos National Bank, the Salvation Army, Presbyterian Medical Services, the Life Link, Habitat for Humanity and the Housing Trust donate services to jointly administer the Empty Stocking Fund.\nThe newspaper is publishing stories featuring requests for assistance from local residents.\nThe information from the initial application will be verified if the applicant is selected for assistance.\nApplicants who meet the eligibility criteria are considered without regard to race, creed, place or country of origin, age, disability, ethnicity, color, gender identity, marital status or sexual orientation. They must live in Santa Fe County or Rio Arriba County and provide a Social Security number.\nThe deadline to apply for assistance has passed.\nTo donate: Make your tax-deductible donation online at www.santafenewmexican.com/empty_stocking or mail a check to The New Mexican’s Empty Stocking Fund c/o the Santa Fe Community Foundation, P.O. Box 1827, Santa Fe, NM 87504-1827.\nDonors can request to remain anonymous.\nIf you can provide a service such as roofing or home repairs, contact Habitat for Humanity at repairs@santafehabitat.org.\nIf you can contribute food, clothing, toys, housewares, furniture, firewood, or other items or services, call the Salvation Army at 505-988-8054.\nDonations\nDeborah J. Trouw CFP, on behalf of Waddell & Reed Clients: $1,500\nDeb Harris and Don Usner, in memory of Arthur Usner: $100\nDonna and Douglas Waterman, in honor Lynn Miller of Santa Fe: $150\nStephen Thompson and Anne Weaver: $100\nCharles Weber and Keller Williams, in honor of Unitarian Church: $400\nCharlotte Wright, in memory of my husband, Danny Wright: $100\nTotal: $14,847.18\nCumulative Total: $163,815.37", "url": "https://apnews.com/07907dfa0ed047b8a1a43e6fc1facd5a"}