{"authors": ["Steven Verburg", "Wisconsin State Journal"], "date_download": "2020-05-04 20:28:53", "date_modify": "2020-05-04 20:28:53", "date_publish": "2018-01-21 13:05:00", "description": "Wisconsin Attorney General Brad Schimel has appointed a former dairy industry lobbyist and lawyer to direct the Department of Justice Environmental Protection Unit. Anna J. Wildeman worked...", "filename": "_e261852b047a4622b191f5bbc5280071_1588624133.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e261852b047a4622b191f5bbc5280071_1588624133.html", "title": "Former dairy lobbyist now runs AG Brad Schimel's environmental protection unit", "title_page": "Former dairy lobbyist now runs AG Brad Schimel's environmental protection unit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Wisconsin Attorney General Brad Schimel has appointed a former dairy industry lobbyist and lawyer to direct the Department of Justice Environmental Protection Unit.\nAnna J. Wildeman worked as a Wisconsin Dairy Business Association lobbyist and represented dairy interests when they faced complaints about environmental damage from high-capacity wells and manure from 2007 through 2015.\nManure and nutrients from dairy and other agricultural businesses are the state’s most widespread water pollution problem, and they have often been the target of state enforcement efforts the environmental protection unit handles.\nUnder Schimel, a Republican elected in 2014, the Justice Department has won fewer financial penalties from polluters than his predecessors .\nWildeman isn’t the first attorney who specialized in defending industry against pollution complaints before being appointed to a prominent post by Schimel. But her appointment renews concerns about the department’s orientation, said Kimberlee Wright, the director of a law firm that has pushed for stricter limits on dairy pollution to protect drinking water and the quality of lakes and streams.\n“I’m mostly concerned with the packing of public agencies with staff that have been antagonistic at best with public health standards and environmental protections,” Wright said. “I have no doubt about Ms. Wildeman’s professional ethics, but it seems an unnecessary strain on public resources to have to build firewalls around the leader of EPU when her potential conflicts … are so extensive.”\nUnder Wisconsin ethics rules, attorneys can avoid conflicts of interest by disclosing them to clients and obtaining waivers.\nJustice Department spokesman Johnny Koremenos said the agency will continue to take precautions as it has since Wildeman was hired in 2016.\nAmong the considerations are potential conflicts that could be created by professional activities of her husband, David Crass , who is co-chairman for representation of industries including agribusiness at the Michael Best & Friedrich law firm in Madison, Koremenos said.\n“Any lawyer who transitions from private sector to the public sector will have the issue of matters in which they represented clients adverse to government agencies,” Koremenos said. “(Assistant attorney general) Wildeman’s expertise and experience with environmental matters is unquestioned and her appointment was one of the easiest for AG Schimel to make during his tenure.”\nThe lower financial penalties for polluters during Schimel’s term are at least partly because the state Department of Natural Resources has less frequently sought court actions against violators in the years since Republicans won control of state government in 2011.\nBut Schimel in one case fined a company nothing for air pollution violations , and he has at times not promptly filled environmental protection unit positions , leaving the operation short-handed. He issued an opinion in 2016 that removed restrictions on high-capacity wells sought by the agriculture industry in areas with vulnerable aquifers .\nSchimel spoke Thursday at a conference sponsored by the Wisconsin Dairy Business Association’s Dairy Strong conference in Madison and bemoaned the extent of pollution regulation faced by farmers.\n“One of the most important things in my role as attorney general is making sure there’s a stable and predictable legal and regulatory environment in Wisconsin, and nowhere is that more important than for our state’s agribusiness,” Schimel said in a video posted online by the association.\nThe industry has supported Schimel with $57,350 in large individual and PAC contributions between January 2013 and June 2017, the most recent figures available from a database maintained by the Wisconsin Democracy Campaign.\nDuring that period attorneys at the Michael Best & Friedrich law firm, where Wildeman went to work in 2007 after graduating from Vermont Law School, gave Schimel $28,168.\nWildeman was working at Michael Best in 2014 when the nomination she and Crass submitted to the International Dairy Foods Association led to one of Wisconsin’s largest operators of concentrated animal feeding operations, Milk Source LLC, being named 2014 Innovative Dairy Farmer of the Year. Milk Source owners James Ostrom, John and Keri Voster and Todd Willer were among Schimel’s largest individual donors, contributing $9,000.\nWildeman left the firm to work as counsel for environment and agriculture policy at the U.S. Chamber of Commerce in Washington, D.C., from 2015 to 2016.\nAt the state Justice Department she has been an attorney in the environmental protection unit.\nWildeman replaced David P. Ross, who also represented agricultural interests in pollution cases before Schimel put him in charge of the environmental protection unit in 2016. Ross replaced Thomas Dawson, who once worked as a state intervener for environmental protection and had directed the environmental protection unit since 2003 .\nRoss left the state for a job in President Donald Trump’s Environmental Protection Agency. Trump announced in September that Ross was appointed as assistant administrator of the EPA office of water.\nSchimel’s former deputy, Andrew Cook , had worked previously for the Great Lakes Legal Foundation, arguing in lawsuits that the DNR should have less authority to protect ground water, and intervening in opposition to DNR permit limits on dairy operations.", "url": "https://apnews.com/e261852b047a4622b191f5bbc5280071"}