{"authors": ["Sam Lounsberry Staff Writer"], "date_download": "2020-05-04 20:31:57", "date_modify": "2020-05-04 20:31:57", "date_publish": "2018-05-29 19:39:52", "description": "Demolition of an old farmhouse and barn in north Longmont began Tuesday morning, the final chapter in a 13-year-long dispute between the son of the buildings' former owners and the contractor once...", "filename": "_d56bad044502493883061ec733096856_1588624317.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d56bad044502493883061ec733096856_1588624317.html", "title": "Demolition Begins on Farmhouse, Barn That Sat on Trailers in Longmont Field for 13 Years", "title_page": "Demolition Begins on Farmhouse, Barn That Sat on Trailers in Longmont Field for 13 Years", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Demolition of an old farmhouse and barn in north Longmont began Tuesday morning, the final chapter in a 13-year-long dispute between the son of the buildings’ former owners and the contractor once hired to relocate them.\nSince 2005, the house and barn formerly owned and occupied by Ivan Erfert’s family sat on semi-trailers in the empty field owned by Walmart, north of its store at 2514 Main St.\nBackhoe operators with Mark Young Construction began tearing down the wooden dwellings Tuesday morning.\nThe barn appeared to have partially collapsed over Memorial Day weekend, with its south end having fallen to the ground. What caused the barn’s tilt was not immediately known by an employee of the contractor performing the demolition.\nThe Times-Call once dubbed the abandoned buildings “Longmont landmarks.”\nMark Powell, owner of Powell Structure Moving, which was hired by Erfert in 2005 to lift the buildings from their foundations and move them, refused to finish the job because he said he was owed payment for the rental of his equipment by Erfert’s family.\nHowever, Erfert claims to have paid Powell $75,000 for the job, only to be told to pay more than he originally agreed after the buildings already were propped up on Powell’s equipment.\nAlthough both Erfert and Powell wanted to save the structures, which had been designed in classic agricultural styles, Erfert was glad that Powell’s last-ditch efforts to sell them were unsuccessful.\n“It would have mattered to me. I would’ve fought that with my last breath,” Erfert said of any move by Powell to sell the buildings. “Once the toothpaste is out of the tube, you can’t get it back in. There’s nothing short of Mark Powell coming up with $75,000 and coming up and handing it to me that would feel like a good ending. ... He walked away with $75,000 of my money and delivered absolutely nothing for it.\n“In the old days, the community would have tarred and feathered him.”\nErfert said he was disappointed with Powell’s decision because he had promised his mother, the late Geraldine Erfert, who lived in the home into her old age, that he would save the buildings.\n“It’s very disheartening. It was one of the saddest things — I promised my mother before she died that I would do my best to move that house. She wanted to preserve that house. I think I did my best, there was no way I could get it done given the involvement of Mark Powell,” Erfert said.\nPowell, though, claims he had solid legal grounds to withhold the completion of Erfert’s relocation job.\n“They owed me rent on my equipment — still do,” he said. “I think I still had a lien position against it by statute, and I think I could have pushed the issue and got an injunction to stop the demo. ... Erfert has no position in this any longer. When he sold the property, his position was gone.”\nLongmont officials had urged Walmart, as the owner of the land on which the structures had been sitting, to start lead and asbestos abatement after the city had found them to be contaminated and residents had reported transients were using them as campsites.\nPowell, though, claimed he negotiated with Walmart to push the demolition out to a later date in hopes he would be able to sell the buildings to a local architect who was interested, but that eventually the retail giant’s legal department declined to let Powell make the transaction.\n“They didn’t want me to be able to sell it or move it. The legal department put the monkey wrench in the deal,” Powell said. “I wish we could have saved the house. It’s a shame to see that beautiful house destroyed. I was willing to take a reduced rate for moving it off of there to a new owner.”\nHis equipment already has been moved out from under the barn, and he said the house would remain on top of his steel beams while it is torn down, and then he will remove the rest of his equipment from the field.\nPrior to the dispute between he and Powell, Erfert said his family fought to save the buildings when the Colorado Department of Transportation proposed removing them to complete a widening of U.S. 287.\nAfter the Erferts successfully prevented CDOT from infringing on the their locations, Ivan Erfert’s aunts agreed to sell their family’s land to Walmart when the company wanted to build the store.\nAt his mother’s request and in an attempt to preserve the home lived in by his grandparents and parents — who ran a dairy cow farming operation on the property — Erfert solicited Powell.\n“We produced about 180 gallons of milk a day, raised our own feed. It was kind of done the old-fashioned way,” Erfert said. “The farm was an example of the demise of the small farm in America. My father had to work a full-time job eight hours a day in order to afford to farm.”\nNow a Denver resident, Erfert said he had not previously heard taht the demolition would begin this week, and added that he was not planning on making the trip to watch his family’s longtime home get torn down.\nSam Lounsberry: 303-473-1322, slounsberry@prairiemountainmedia.com and twitter.com/samlounz .", "url": "https://apnews.com/d56bad044502493883061ec733096856"}