{"authors": ["Kaila Contreras"], "date_download": "2020-05-04 20:23:11", "date_modify": "2020-05-04 20:23:11", "date_publish": "2018-09-07 05:00:00", "description": "To meet the needs of the growing population in the Summerwood and Fall Creek areas, Harris County Precinct 4 Commissioner Jack Cagle’s office is currently working on road improvements on Lockwood...", "filename": "_7387f71cbd5c4044973ffac48a0c3373_1588623791.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7387f71cbd5c4044973ffac48a0c3373_1588623791.html", "title": "Targeting growth, county plans road projects near Generation Park, Atascocita", "title_page": "Targeting growth, county plans road projects near Generation Park, Atascocita", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "To meet the needs of the growing population in the Summerwood and Fall Creek areas, Harris County Precinct 4 Commissioner Jack Cagle’s office is currently working on road improvements on Lockwood Road and Kings Park Way.\nLockwood Road\nProposed improvements for Lockwood Road start from the Union Pacific Railroad to Beltway 8. Improvements include include upgrading the existing two-lane asphalt roadway to a four-lane concrete boulevard section with improved drainage systems.\n“Traffic volumes have increased due to the addition of Humble ISD’s Summer Creek High School and development within Generation Park. Lockwood Road, south of the Union Pacific Railroad tracks, is located within Precinct 1’s jurisdiction and was previously upgraded to a 4-lane concrete boulevard section,” Pamela Rocchi, Precinct 4 Capital Improvement Project Director said.\nRocchi said the Harris County Commissioners Court approved this project in January 2015.\n“This is a joint participation project between Harris County and McCord Development. McCord Development pursued engineering design and funded the Union Pacific Railroad crossing upgrade. Harris County will bid and manage the Lockwood Road project during construction and fund the estimated $1.8 million roadway widening effort,” Rocchi said.\nAdvertisement for this project is scheduled for the fourth quarter of the 2018 and the award process will take between 90-120 days to complete.\nA date for construction will be scheduled once the bid is awarded.\nKings Park Way\nProposed improvements for Kings Park Way start from Atascocita Road to FM 1960. Improvements include widening the half boulevard section of Kings Park Way near Atasca Oaks Drive to a four-lane concrete boulevard section with improved drainage systems.\nRocchi said while the immediate area is developed, the Atascocita region continues to grow. Kings Park Way is an important north-south connection between Atascocita Road and FM 1960 and the widening improvements will ease congestion along this route.\nTraffic signal modifications will also be a part of the project.\n“Modifications will be made to the existing traffic signal on Kings Park Way at Atascocita Road to accommodate the additional travel lanes. No new traffic signal systems are included with the project,” Rocchi said.\nThe Harris County Commissioners Court approved this project in March 2016\nThe $597 million construction contract was awarded to Mar-Con Construction Services.\nAtascocita Road is the boundary line between Harris County Precinct 2 and Precinct 4 in this area. Precinct 2 funded a portion of the traffic signal modification at Atascocita Road and provided input for the intersection design.\nRocchi said construction started in early September and will be completed in November.\nWilson Road\nHarris County Precinct 4 is working on other road improvements in the area, such as the expansion of Wilson Road, which is projected to be completed October 2019.\nThe project widens Wilson to a four-lane road from Atascocita Road to right before Beltway 8.\nThe cost of construction will be approximately $9.8 million.\n“This is a larger-size project,” Cagle said in March. “We’ve been looking at it for quite a while, but we were finally able to get funding together to kick it into gear. Our contractor has mobilized already.”\nkaila.contreras@chron.com", "url": "https://apnews.com/7387f71cbd5c4044973ffac48a0c3373"}