{"authors": ["Guest Columnist Lynn Gendusa"], "date_download": "2020-05-04 20:07:03", "date_modify": "2020-05-04 20:07:03", "date_publish": "2018-11-01 05:00:00", "description": "Grandpa sat on the bank of her pond with a fishing pole in her hand, an apron around her waist, a bonnet on her head and a pail full of wiggly worms in black dirt by her side. I know you are...", "filename": "_5ddb7505a2f3425f8381395382262969_1588622823.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5ddb7505a2f3425f8381395382262969_1588622823.html", "title": "The lesson of the wiggly worm", "title_page": "The lesson of the wiggly worm", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Grandpa sat on the bank of her pond with a fishing pole in her hand, an apron around her waist, a bonnet on her head and a pail full of wiggly worms in black dirt by her side.\nI know you are confused about her name if you have not read previous columns or my book, so I will give you the short version of the story. My brother was three years old when he renamed one of his six living grandmothers and great-grandmothers “Grandpa” because he only had one living grandfather. The name stuck!\n“Grandpa!” I yelled. “Will you please put a worm on my hook?” She didn’t answer so I walked closer to her thinking she might not have heard me.\nAs I held the old cane pole with the wormless hook waiting for her to put a creepy worm on it, she replied, “Honey, how old are you?”\n“Grandpa, you know I am six!” I said laughing.\n“Well, then you are old enough to put your own worm on that hook.”\nMy eyes grew large and my mouth opened in disbelief. My favorite grandmother in the whole world was not going to help me. I was dejected and certainly was not going to dig in the dirt and put that squirmy, ugly worm on the hook by myself!\nI stomped my feet and shed a few tears, but she never looked up and never uttered a sound except when she caught a big brim and yelled, “Whoopee!”\nThen the fish kept biting and I kept on pleading, but to no avail. Finally, I knew I needed to dig in the bucket and find a worm if I was going to fish with Grandpa.\nFrom then on, I became an expert in finding worms. My skills were well known among anyone interested in knowing of them, and Grandpa was about the only one who was.\nWe would fish nearly every day when I visited her, and she would even allow me to exaggerate about the size of the fish I caught. Again, Grandpa was about the only one who believed me.\nFunny thing about the lessons I learned in life that day sitting on the bank of a pond; they have stayed with me all my life. I realized if you wanted to catch a fish, or fulfill a dream, or live your best life, you had to be brave enough to dig for it.\nLife teaches us to keep trying and digging every day. There isn’t a day that goes by that doesn’t require patience, work and understanding. There isn’t a day when we can’t learn a lesson. Sometimes we are not open to learning or we lose patience. Some days we are not the best we can be because we weren’t motivated to be. Those are the days we let the big fish swim on by to be caught by someone else.\nI recall very few days when Grandpa wasted a day. She did her chores, didn’t complain, and when the day was done, she rewarded herself by sitting in her folding chair by the pond.\nI also learned from my Grandpa on that day how to teach a child to accept responsibility. Some grown-ups obviously missed that little tidbit of information. They blame everyone else for not being able to improve their lives, or relationships, or for their inability to land a big fish.\nGrandpa knew she was not an enabler of anyone who wouldn’t try, including a six-year-old. It started early with all of her grandchildren. She was willing to listen to the crying, yelling and begging for us to learn we were not going to always get our way, especially when it was primarily the wrong way.\nThe lesson she taught me of not relying on others to do the hard work has served me well. Being a single parent of three children for much of my life required me to be self-reliant and self-sustaining. I never minded or resented doing things I did not like to do to put a fish on the table to feed my children.\nA reader of my columns and book once told me her favorite stories were about “Grandpa.” I smiled as I thought about the many lives my grandmother still inspires by the salt of the earth way she lived: A simple, rewarding life of cooking meals for her family, loving her husband, tending her garden, playing with children, laughing with her friends, adoring the Lord and teaching a six-year-old a pail of lessons by using a wiggly worm and a hook.\nLynn Walker Gendusa is a columnist from LaGrange and the author of “it’s all WRITE with me!” She will have a book signing at Dogwood Books in Rome on Nov. 17 between 1 and 3 p.m.", "url": "https://apnews.com/5ddb7505a2f3425f8381395382262969"}