{"authors": ["Steve Wheeler"], "date_download": "2020-05-04 20:07:25", "date_modify": "2020-05-04 20:07:25", "date_publish": "2018-12-22 06:00:00", "description": "Hyundai ventures deeper into the electrified car world with its new Ioniq lineup. The Ioniq now has a plug-in hybrid, bringing to three the number of electrified Ioniq powertrains. The Ioniq is...", "filename": "_81eec3e1f0ac419991cb247a7a20584e_1588622845.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_81eec3e1f0ac419991cb247a7a20584e_1588622845.html", "title": "IONIQ HYBRID", "title_page": "IONIQ HYBRID", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Hyundai ventures deeper into the electrified car world with its new Ioniq lineup. The Ioniq now has a plug-in hybrid, bringing to three the number of electrified Ioniq powertrains. The Ioniq is available as a Hybrid, Electric, and Plug-in Hybrid.\nMy test car for the week was the Hybrid version, and it proved to be a sporty and stylish ride that took me right on by my favorite gas stations. Yep, the Ioniq Hybrid was a lot more fun than I expected it would be.\nStarting at $22,400, the 2019 Ioniq Hybrid is available in three trims: Blue, SEL, and the top-end Limited. It’s also a safe car, winning a Top Safety Pick award from the Insurance Institute for Highway Safety. In fact, the Ioniq Hybrid got the top IIHS score of “good” in every crash tested category.\nThe Ioniq Hybrid is powered by a 1.6-liter direct-injected gasoline engine supplemented by a 32kW electric motor powered by a lithium-ion polymer battery positioned below the back seat. When the electric motor and gasoline engine are combined, they develop 139 horsepower.\nThe transmission on the hybrid Ioniq is a dual-clutch 6-speed automatic, which helps deliver more pronounced acceleration than CVT alternatives.\nThe Ioniq Electric boasts 118 horsepower from its 88kW lithium-ion polymer battery, and an estimated driving range of 124 miles. The Ioniq Plug-in Hybrid has an electric range of 29 miles and promises 52 mpg in hybrid mode. The gasoline engine is a 1.6-liter Atkinson-cycle four-cylinder with 104 horsepower, and the 44.5kW electric motor is good for about 60 horsepower. That’s a lot of numbers to digest, but the number that really matters is how many dollars you spend on fuel, which in the Ioniq won’t be many.\nIt takes about 8.5 hours to fully charge the battery in the Plug-In Hybrid using a 110-volt household system. That time is reduced to a little more than two hours using a 220-volt system. Using a 110-volt system for the Ioniq Electric is not recommended, and the 220v system will charge the vehicle in 4.5 hours. The Ioniq Electric can get about an 80 percent charge using a Level 3 charging system.\nMy test car for the week, the Hyundai Ioniq Hybrid in the Limited trim, requires no outside charging. It had an MSRP of $27,550 plus options and freight, for an out-the-door price of $31,560.\nIt’s not a bad-looking car either, with Bi-Xenon HID headlights surrounded by LED lamps in Hyundai’s signature grille. Wheels are either 15 or 17 inches.\nThe cabin of my Limited trim test car was exceptionally nice with leather seats and soft-touch materials in all the right places. Front-seat headroom was a generous 39.1 inches, and back seat headroom was decent at 37.4 inches. Both easily accommodated my 6-foot-1 frame. Legroom was pretty good in the back seat as well, at 35.7 inches. Cargo space was 26.5 cubic feet.\nHyundai uses recycled or ecologically sensitive materials wherever possible in the Ioniq. The interior of the doors, for example, is made of plastic combined with powdered wood and volcanic stone. Raw materials extracted from sugar cane are used in the headliner and carpet, according to Hyundai.\nOn the road, I found the Ioniq to be nimble and sure-footed. Don’t engage in red light races, though, as this car is built for economy, not speed. Steering was precise and linear, and braking was good.\nInfotainment and connectivity are excellent on the 7-inch touchscreen display with sharp, clear graphics. Apple CarPlay and Android Auto are supported, and there’s even a Qi wireless charging tray at the bottom of the center stack for enabled smartphones.\nOther standard equipment includes a tilt/telescoping steering wheel, power windows and doors, a rearview camera, and Bluetooth. I counted three USB ports, a pair of 12-volt ports, and an AUX port.\nThe Ioniq offers a long list of sophisticated safety technologies as well, including automatic emergency braking with pedestrian detection, lane departure warning, lane keep assist, blind spot detection, and rear cross-traffic alert. If you’re into hybrids and gas savers, you should check out the new Ioniq from Hyundai.", "url": "https://apnews.com/81eec3e1f0ac419991cb247a7a20584e"}