{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:27:18", "date_modify": "2020-05-04 20:27:18", "date_publish": "2018-01-28 11:37:35", "description": "A Sun Staff report STATE SEN. Linda Dorcena Forry's abrupt resignation from the Senate last week to work for Boston construction magnate John Fish is worthy of speculation on several...", "filename": "_80399551bc5744cb830a950a625104fc_1588624038.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_80399551bc5744cb830a950a625104fc_1588624038.html", "title": "Intrigue Over Senator's Departure", "title_page": "Intrigue Over Senator's Departure", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Sun Staff report\nSTATE SEN. Linda Dorcena Forry’s abrupt resignation from the Senate last week to work for Boston construction magnate John Fish is worthy of speculation on several fronts:\n* Dorcena Forry, the highest-ranking elected black official in Massachusetts, was unable to put together a coalition of 21 senators to become the next Senate president.\n* It gives more opportunity to three other senators in the president sweepstakes: Eileen Donoghue of Lowell; Karen Spilka, Ways and Means Committee chairman from Ashland; and Sal DiDomenico of Everett.\n* It could signal that Sen. Stanley Rosenberg could return from political purgatory. Rosenberg was banished to a State House basement office from the ornate president’s office late last year amid allegations his husband Bryon Hefner sexually assaulted people with business before the Legislature and claimed to hold sway over Senate business.\nUnlike some previous Senate presidents, Rosenberg has developed personal relationships with many of his 39 colleagues, a “solid bloc” of which holds hope that an independent investigation by a Boston law firm does not implicate the Northhampton Democrat.\n“They’d like to see Stan come back,” one astute Senate observer said.\nThat would explain why no one was unable to nail down 21 votes.\nOn Thursday evening, several hours after Dorcena Forry made her announcement, Donoghue was in contact with several senators, putting her best persuasive and political skills to the test.\nTHE ZORBA Room at the Olympia Restaurant in Lowell was filled with Donoghue supporters Friday afternoon, all of whom happily responded to a fundraising call by the man Donoghue replaced in the Senate, Steve Panagiotakos.\nAmong those showing their support were George Behrakis, John and Linda Chemaly, Lowell Reps Thomas Golden, Rady Mom and Dave Nangle, former Sen. Steve Baddour, developer Steve Joncas, and City Manager Kevin Murphy.\nAS REP. Niki Tsongas edges closer to retirement from Congress in November, a top staffer has resigned for another position.\nSpokesman Mike Hartigan has accepted a new job as director of public affairs for AT&T in New England.\nIn recent weeks, Tsongas staffers Ben Martello and Phil Geoffroy have left, both joining the campaign of one of the 13 Democrats hoping to replace her in the 3rd District, Rufus Gifford.\n3RD DISTRICT candidates are still pushing out the endorsements rather than how they stand on the issues. Here’s the latest:\n* The Massachusetts Nurses Association, a union that represents 23,000 members across the state, supported state Sen. Barbara L’Italien.\nThe MNA endorsed L’Italien in each of her eight campaigns for either state representative or state senator.\nIn 2017, she received the organization’s Legislative Advocacy award -- her second -- after she pushed to protect beds at Tewksbury State Hospital.\n* Building Wreckers Local 1421 endorsed Dan Koh, giving him the support of a union with about 1,000 members. Local 1421 is a part of the Laborers’ International Union of North America.\n* Westford Selectman Tom Clay, CEO of Marlboro technology company Xtalic, announced his support for Koh, whom he described as a “problem-solver.”\nCuriously, Clay endorsed Koh and not Terry Ryan, with whom he served on the Westford School Committee.\nIt’s not clear whether the two were ever particularly close, but they did work together on a few important initiatives, including the successful push for an override designed to increase teacher salaries to a more competitive level.\nTHE DECISION by the state Group Insurance Commission to reduce from six to three the number of health insurance plans available to state employees has caused quite the outcry from Cape Cod to the Berkshires.\nNow the presidents of the state’s 15 community colleges are getting involved, including James Mabry of Middlesex Community College.\nIn a Friday letter to Gov. Charlie Baker and other top state officials, the presidents “respectfully urge the Baker Administration and legislative leadership to request the Group Insurance Commission (GIC) to rescind its decision that severely limits the insurance options of our employees. This decision could harm our employees and is a setback to those who work hard every day to provide a high-quality education to the residents of the Commonwealth seeking educational and career advancement.”\nThe GIC’s rollout of the change was bungled, the presidents added, noting that CC human resources departments were not notified before the decision was released on Jan. 18.\nONE GREATER Lowell rep missed Baker’s State of the Commonwealth speech on Tuesday night, with a valid reason. Rep. Jim Arciero, D-Westford, fell on black ice and hurt his shoulder. Arciero’s right arm is in a sling for the moment.\nSTRANGE BEDFELLOWS joined to pass City Councilor Rita Mercier’s motion requesting that the city inquire if the Edge Merrimack River dormitory was for sale, and if it could be transformed into a high school building.\nThe unlikeliest of her supporters was Jim Milinazzo, with whom Mercier has had a frosty relationship over the high school matter. The two have disagreed on most issues, often publicly and loudly.\nCouncilors generally support motions requesting information that’s easy to get, but that wasn’t the case on Tuesday’s 5-4 vote. Milinazzo backed Mercier out of courtesy, and not because he wants to see the high school moved to the dorm site.\n“I will support the motion, but I will tell you that I’m still 110 percent for Option Three,” he said. ”“I can’t understand, with all due respect to Councilor Mercier, why we would spend four to five times as much to take that building.”\nSCHOOL COMMITTEE Chairman Joe Wilkie cut off School Committee member Sabrina Heisey several times during last Monday’s School Committee meeting. According to Heisey, it’s not the first time.\n“I think as a woman, we do get interrupted in the workplace by men on a regular basis, consciously or unconsciously, but I think that when it comes to being an elected official and being on a board, all board members have the right to speak and I don’t think any member should be interrupting each other mid-sentence,” Heisey said.\nWilkie said the issue has never been raised to him.\n“There’s no thought to intentionally cut Mrs. Heisey off because she’s a woman,” Wilkie said. “She was elected by the people to represent the district and I totally respect that.”\nHeisey said other town board members have brought up the interruptions to her.\n“I am not going to comment on what other people from other boards say,” Wilkie replied.\nWHAT BILLERICA School Committee members knew about a state campaign-finance violation, and when they knew it, led to a testy exchange between colleagues on the High School Building Committee Monday night.\nThe Office of Campaign & Political Finance ruled late last month that the School Department used public resources to send out information on a field maintenance ballot question.\nThat’s illegal under state law. The department was warned, but not fined.\nSuperintendent of Schools Tim Piwowar received the violation letter from OCPF before Christmas break. He and Chairman Jim Gately did not tell other members until Jan. 9 -- after a Sun reporter called members for comment about the letter.\nAt the School Committee meeting on Monday night, former Selectman Dan Burns said Piwowar should have told the entire board about the initial complaint in November, and not even waited for a ruling.\n“You’ve had multiple meetings, four meetings when this could have been brought into an executive session and discussed, and it wasn’t,” Burns said.\nBurns questioned when the public would have known about the violation -- or whether it would have ever learned -- if not for The Sun’s inquiry.\nSchool Committee member Mark Efstratiou was visibly upset that Burns questioned the board’s integrity.\n“You should know better than that, Dan,” Efstratiou said at the meeting. “You’ve worked with him (Piwowar) for several years. You’ve worked with us for several years.”\nIn response, Burns said, “Withholding information brings questions, Mark.”\nAFTER SIX years of serving on the Wilmington School Committee, Manny Mulas announced that he will not be seeking re-election this year. Mulas said he thought about it over the Christmas break.\n“I feel proud of what I’ve done, but it’s time to move on,” Mulas said. “I’m going to miss taking part in the conversation and dialogue on where the school district is going.”\nThe last day to return nomination papers for the annual town election is Friday, March 9.\nEMILY ANTUL said the Chelmsford Board of Selectmen needs some fresh blood and ideas, and it’s time for the younger generation to step up for the job.\n“I would think that Chelmsford is not going to do better if we keep the same people who keep trying the same things in office,” said Antul, 40, who has pulled nomination papers to run for selectman.\nShe’ll be going up against Vice Chairwoman Laura Merrill and Selectman George Dixon, who are both running for reelection.\nWhile the schools are not specifically under the purview of the board, the former Spanish teacher -- who has worked at a number of school districts that have had funding issues -- said selectmen must support and take school and student needs seriously when it comes to budgeting.\nIt’s an issue near to Antul, who is now a stay-at-home mom to her daughters, Catherine, 4, and Madeline, 9 months. Her husband, Keith, is co-owner of Medusa Brewing Co. in Hudson.\nAntul said she’s progressive, socially conscious and supports a split tax rate.\nShe said she believes Chelmsford can do a better job with its infrastructure and planning budgets so that the town doesn’t have to be constantly taking out loans.\nSUE CHALIFOUX Zephir will run again for state Senate.\nChalifoux Zephir, a Leominster at-large city councilor, announced her campaign in a social media post Friday.\nChalifoux Zephir lost her in a special election in December to then-Fitchburg City Councilor Dean Tran.\nThe Middlesex and Worcester seat, which stretches from Fitchburg to Townsend, was vacated by Jennifer Flanagan, who resigned to take a seat on the Cannanbis Control Commission.\nChalifoux Zephir will no doubt have to beat a handful of Democrats in the primary on Sept. 4 to win her party’s nomination.\nTran is serving out the remainder of Flanagan’s term and is expected to run again this fall.\nMSNBC POLITICAL reporter Steve Kornacki returned home to Groton on Thursday night to speak at Lawrence Academy for a Groton Historical Society fundraiser on the evolution of politics and the media.\nKornacki says he stopped at the McDonald’s at the Ayer rotary en route from New York.\nThe employee behind the counter was surprised by the celebrity in his midst.\n“TV, right?” the employee said.\nYes, Kornacki said.\n“Chris Hayes!” the employee said excitedly ... referring to Kornacki’s colleague and host of “All-In.”\nContributing to The Column this week: Todd Feathers in Lowell, Amaris Castillo in Dracut, Chris Lisinski in Westford and in the 3rd District; Alana Melanson in Chelmsford, Rick Sobey in Billerica, Kori Tuitt in Wilmington, Managing Editor/Days Tom Zuppa and Enterprise Editor Christopher Scott.", "url": "https://apnews.com/80399551bc5744cb830a950a625104fc"}