{"authors": ["Mark Dudzic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Shant Mesrobian", "Timothy Faust", "Sean Petty"], "date_download": "2020-05-04 19:53:02", "date_modify": "2020-05-04 19:53:02", "date_publish": "2018-05-31 00:00:00", "description": null, "filename": "2018_06_medicare-for-all-health-care-unions_1588621982.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/05/31220707/GettyImages-809452086.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_06_medicare-for-all-health-care-unions_1588621982.html", "title": "Time For Unions To Step Up On Medicare For All", "title_page": "Time For Unions To Step Up On Medicare For All", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "There are still those in the labor movement who believe that unionists should oppose single-payer Medicare for All because good, union-negotiated benefits strengthen member loyalty and help to organize new members. This misunderstanding persists because the provision of health care is deeply embedded in the employment relationship. More than 150 million people in the United States receive employer-provided health care insurance. This accident of history is a result of the post–WWII defeat of the Left in the US and the subsequent constraints on militant trade unionism. Unions and their allies had to construct “second-best solutions” in the face of unchallenged corporate power.\nWhile unions throughout the industrialized world led the fight to make health care a right for all, unions in the United States were instrumental in setting the terms for a “private welfare state” that organized the provision of public goods through private employers. Health care became a benefit rather than a right.\nToday, bargaining for health care has become unsustainable. Rather than being a positive perk of union membership, health care has become the biggest cause of strikes, lockouts, and concession bargaining as the costs continue to rise much faster than wages and the general rate of inflation. Workers often trade wage increases and other benefits to maintain health coverage only to be faced with the same dismal co-pays, deductibles, and limited networks that characterize all private health insurance plans.\nIn 2017, according to the Milliman Medical Index (an actuarial index) the total cost of health care for a hypothetical family of four with employer-provided benefits was $26,944 per year, with employers contributing an average of $15,259.\nUnions representing low-wage workers face the impossible task of trying to bargain for both a living wage and decent health care benefits for their members. And all unions face the competitive pressures from nonunion employers, who pay a small fraction of the costs of decent union benefits. Even higher-wage workers covered by union-sponsored health funds (so-called “Taft–Hartley plans”) feel the pain. Several years ago, for example, transit workers in the District of Columbia were forced to accept a contract that eliminated retiree health benefits for future hires. 40 percent of the membership is now no longer eligible for this benefit. This creates a deep rift in the internal solidarity that unions need in order to stand up against the power of their employers.\nNot only are good, union-negotiated health benefits economically unsustainable (at the bargaining table), they are politically unsustainable in the wider community. Unions find it hard to champion their members’ decent benefits when most other workers are losing theirs. This helps fuel a politics of resentment which undermines and divides working-class support for union struggles. As then-governor of Massachusetts Mitt Romney, famously asked, “Why should taxpayers pay for health care for public employees that we [sic] don’t have ourselves?”\nSmart, strategic unions such as the Vermont State Employees Association frame their fight for quality health care as part of a broader movement for health care for all. They’ve gone to their members to explain that, the “only way we can maintain our excellent health care is by working to expand it to every Vermonter.” And they’ve gone to the public with a promise that they will advocate for the right of “every Vermonter to have the same quality of health care that we have achieved.”\nMost national unions, as well as the AFL-CIO, have passed resolutions in support of Medicare for All. What is needed now is for unions to move beyond “resolutionary politics” to commit substantial resources and organizing capacity. If a united labor movement were to get behind the campaign, it would be a game changer. Not only would it benefit millions of people, it would revitalize a beleaguered labor movement.", "url": "https://www.jacobinmag.com/2018/06/medicare-for-all-health-care-unions"}