{"authors": ["Emily Lowe Elowe Idahopress.Com"], "date_download": "2020-05-04 20:13:06", "date_modify": "2020-05-04 20:13:06", "date_publish": "2018-11-12 18:15:00", "description": "Even while deployed in Southeast Asia two years ago, Idaho Air National Guard Master Sgt. Christina Rohrenbach was able to have dinner with her family who lives in Idaho. Enjoying “dinner”...", "filename": "_2c230cd635ff471fae782df41a6ed702_1588623186.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2c230cd635ff471fae782df41a6ed702_1588623186.html", "title": "Deployed soldiers see growing number of ways to connect with loved ones back home", "title_page": "Deployed soldiers see growing number of ways to connect with loved ones back home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Deployed soldiers see growing number of ways to connect with loved ones back home\nEven while deployed in Southeast Asia two years ago, Idaho Air National Guard Master Sgt. Christina Rohrenbach was able to have dinner with her family who lives in Idaho.\nEnjoying “dinner” with her husband and son meant waking up early in the morning to video chat with them on her iPad while they ate.\n“Even though I was deployed, and it wasn’t dinner time, it made (my son’s) day for me to be able to be there,” she said.\nThe ability to connect face to face with family even while deployed is relatively new for soldiers. For decades, soldiers like Rohrenbach would rely on phone calls, emails or letters to connect with loved ones. Advancement in technology not only altered the way people speak every day, but also changed how often and how easily deployed soldiers can communicate with family and friends.\nWhen Rohrenbach joined the Air National Guard in 2007, even speaking to family when she was stationed for training in Texas was difficult. Email was the easiest way to communicate, and that only happened on the weekends with access to only about 10 computers. She did try to call family twice a week using a flip cell phone.\nToday, Rohrenbach uses her cellphone to record good morning or good night videos to share with her husband and son via Facebook. She can even watch videos of programs her son participates in.\n“Having that human connection to be able to say good night and I love you real quick is totally night and day from when I started,” Rohrenbach said.\nThe advancement in technology has also given one former active duty member an easier way to communicate with his deployed son.\nKris Nelson served active duty in the Army and the National Guard starting in 1979. Even in 2007, when his active duty ended, the easiest way to connect with family was through letters or phone calls, he said.\n“I can tell you, we looked forward to getting those letters,” Nelson said while he was deployed in Germany in the late 1980s during the Cold War era. “It was a long time between hearing from back home.”\nPhone calls were possible, but overseas they were expensive, as soldiers had to pay the cost of contacting home, he said. He only called home about every six months.\nToday, Nelson said he hasn’t sent one letter to his son, Keaton Nelson, who has been deployed since June.\nInstead, he sends him a quick text. Depending on what his son is doing, he might get a reply as soon as a few hours later.\n“It used to be I would ask a question by letter and wait a few weeks before the reply,” Nelson said.\nTexting became a hit in the U.S. in the early 2000s, but it wasn’t until later that soldiers overseas could text back and forth with family and friends.\nNelson’s wife has also used Facebook for phone calls and video chats. It allows Nelson’s son to know what’s going on instantaneously.\nEven if something bad happens at home, having that quick communication boosts the potential that a soldier can make it, for example, to a loved one’s funeral.\n“I don’t feel as distant with the ability to call and text as much as I’m able to,” Keaton Nelson said during a phone call.\nBut Keaton Nelson said depending on what he’s called to do or whether or not Wi-Fi is down — it’s down a lot, he says — he may not get to talk with his family for awhile.\nFor Rohrenbach, her biggest downside would be getting deployed to an area where there isn’t the capability to use video. It’s become an expectation, so she said it would be hard to explain to her 6-year-old son why he can’t see her anymore.\n“I am 100 percent thankful (for the technology) because now there’s so much I can see,” she said.", "url": "https://apnews.com/2c230cd635ff471fae782df41a6ed702"}