{"authors": ["Stephen Dinan The Washington Times"], "date_download": "2020-05-04 20:31:18", "date_modify": "2020-05-04 20:31:18", "date_publish": "2018-03-01 11:27:01", "description": "Vice President Mike Pence delivered a fierce defense of federal immigration agents and officers Thursday, calling them \"heroes,\" amid a growing opposition from California officials. \"We are...", "filename": "_96ddbaa46d014e8550440c66665ba01e_1588624278.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_96ddbaa46d014e8550440c66665ba01e_1588624278.html", "title": "White House defends ICE, Border Patrol from California attacks", "title_page": "White House defends ICE, Border Patrol from California attacks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Vice President Mike Pence delivered a fierce defense of federal immigration agents and officers Thursday, calling them “heroes,” amid a growing opposition from California officials.\n“We are with you 100 percent,” Mr. Pence told Homeland Security employees gathered to commemorate the department’s 15-year anniversary.\nThe Trump administration is in an escalating battle with California, where the Oakland mayor tipped off illegal immigrants to looming sweeps by federal authorities, and where the state attorney general accused U.S. Immigration and Customs Enforcement of “terrorizing communities.”\nHomeland Security officials have pushed back, and on Thursday the White House got involved, with Mr. Pence and Chief of Staff John F. Kelly mounting a vigorous defense of the department and its employees.\n“You take the face shots every single day from people who don’t have a clue what they’re talking about,” Mr. Kelly said, adding that he wished he’d been able to do more during his six months as secretary to defend the employees against the verbal attacks.\n“You can bet in the job I’m in now I spend a great deal of my time making sure people understand who you are, what you do,” Mr. Kelly said as he joined current Secretary Kirstjen Nielsen and former secretaries Tom Ridge and Michael Chertoff for the 15th anniversary commemoration.\nThe department was started in 2003, after a bruising battle in Washington in the wake of the Sept. 11, 2001, terrorist attacks on New York and the Washington region.\nThe Bush White House had vehemently opposed a reorganization, instead naming a White House coordinator, Mr. Ridge, to act as a special presidential adviser. Mr. Bush abruptly flipped his position in June 2002, in what was seen as a way of overcoming a growing series of questions about signals missed ahead of the Sept. 11 attacks.\nWith Mr. Bush’s support, plans for the department began to move through Capitol Hill but they bogged down in a fight over the extent of organizing powers labor unions would have. Mr. Bush took the issue to voters in that year’s midterm elections and helped unseat two Democratic incumbents, delivering control of the Senate back to the GOP, and cowing Democrats into caving on the union issue.\nThe department officially stood up on March 1, 2003, covering everything from the Coast Guard and Secret Service to federal emergency response, cybersecurity, customs and immigration.\nMr. Kelly, who was secretary for six months before being brought to the White House, said the department is perhaps even more important that the Pentagon in keeping the U.S. safe at this point.\nMr. Kelly, also a former Marine general, said the military is pounding the Islamic State terror group “into dust” overseas, but they pose a growing threat here.\n“They have morphed, and they are coming,” he said.\nTo prove the point, he recalled his years as chief of Southern Command, which oversees U.S. military in Latin America south of Mexico. He said he didn’t remember any conversations with the Defense Department secretary, but he had weekly conversations with Homeland Security Secretary Jeh Johnson.\nDuring Thursday’s commemoration several secretaries stressed the importance of intelligence collection and sharing in advancing the department’s abilities.\nMr. Chertoff recalled British authorities disrupting a massive airline plot, and said it was only because of metadata collection under the Patriot Act powers that have since been severely constrained that U.S. authorities were certain the British plotters weren’t communicating with Americans.\n“If we had not been able to do that there would have been a week or two of no flying,” Mr. Chertoff said. “Being able to rule things out is as important as being able to rule things in.”", "url": "https://apnews.com/96ddbaa46d014e8550440c66665ba01e"}