{"authors": ["Matthew Medsger"], "date_download": "2020-05-04 20:16:45", "date_modify": "2020-05-04 20:16:45", "date_publish": "2018-02-24 00:38:51", "description": "Like the wheels of the shopping carts they service, business has continued to roll on for Arnold-based Zampogna Inc. Though officially founded in 1971 with \"one truck and one helper,\" the...", "filename": "_ffa2ad92d0cd4d128a6933e65464e8ab_1588623405.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ffa2ad92d0cd4d128a6933e65464e8ab_1588623405.html", "title": "Shopping cart servicer based in Arnold expands to range of fields", "title_page": "Shopping cart servicer based in Arnold expands to range of fields", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Like the wheels of the shopping carts they service, business has continued to roll on for Arnold-based Zampogna Inc.\nThough officially founded in 1971 with “one truck and one helper,” the company started unofficially years before when Sonny Zampogna went to work as a plumber with his Italian-immigrant father, Adolph.\nZampogna said his father taught him how to work, but he decided to leave plumbing and strike out on his own.\nThat decision led Zampogna to Stanley Magic Door Inc., where he learned to install and repair the box bundling machines — balers — that would prove to be just one of his company’s future endeavors.\nArmed with the knowledge of how to do the work, Zampogna eventually took a contract with Giant Eagle to repair their baling machines, and Zampogna Inc. was born.\nOver the next two decades, the company expanded its operations to include the installation of trash compactors, conveyor systems and dock equipment.\nWhen president Alex Dumot joined the team in 1989, the small business had grown to include three employees and two trucks.\nOver the next few years, Dumot said, the business recognized an opening in the Western Pennsylvania market for shopping cart service and sales and decided to move in that direction.\nBy 1992, Zampogna Carts Inc. was created and spun off to handle the huge volume of work that was coming in from as far as Philadelphia.\nExpansion required additional work space, and the company opened offices in Cleveland and Columbus.\nFor a time, those shopping carts would represent the majority of Zampogna Inc.’s work, but changes in the retail market — and the invention of internet shopping — eventually caused their business model to shift as well.\n“At one point, shopping carts were about 50 percent of our business,” Dumot said. “Now they represent about 10 percent.”\nDespite changes in the industry, Dumot said the company now owns dozens of trucks and employs about 40 people full time. Those employees deliver products and provide on-site service throughout Pennsylvania, Ohio, West Virginia and Maryland.\n“We’ve found ways to keep ourselves relevant,” he said.\nNow, their work focuses on dock equipment such as rolling steel doors, compactors and docking plates, but the company also has learned how it can participate in the online shopping world that is pulling customers from the venues where the shopping carts are found.\nZampogna’s personal day-to-day focus is now on repairing and installing the conveyor systems that move the thousands of packages shipped by parcel carriers across the nation.\nThat work takes Zampogna as far as Arizona and, because of demand for his company’s service, leaves him away from home for months at a time.\n“I just got back from three months on the road,” Zampogna said. “Shipping is a fast-paced industry, so we have to be where they need us when they need us.”\nZampogna’s “be there” attitude has been essential to the company’s survival as times have changed, Dumot said.\n“I’m of the opinion that if your business is not growing, you are dying,” he said. “So we’ve gotten our hands into a few different things so that all of our eggs aren’t in the same basket.”\nMatthew Medsger is a Tribune-Review staff writer. Reach him at 724-226-4675, mmedsger@tribweb.com or via Twitter @matthew_medsger.", "url": "https://apnews.com/ffa2ad92d0cd4d128a6933e65464e8ab"}