{"authors": ["The Washington Times The Washington Times"], "date_download": "2020-05-04 20:23:08", "date_modify": "2020-05-04 20:23:08", "date_publish": "2018-04-09 15:58:07", "description": "Patrick S. Korten, a former reporter and anchor for WTOP News Radio who left broadcast journalism to serve as a communications official in the Reagan administration, died Thursday after suffering...", "filename": "_471f37545626d21eecd7da934bec2a4d_1588623788.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_471f37545626d21eecd7da934bec2a4d_1588623788.html", "title": "Patrick Korten, former WTOP reporter, anchor, dies at age 70", "title_page": "Patrick Korten, former WTOP reporter, anchor, dies at age 70", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Patrick S. Korten, a former reporter and anchor for WTOP News Radio who left broadcast journalism to serve as a communications official in the Reagan administration, died Thursday after suffering a stroke in Fairfax, Virginia. He was 70 years old.\nBorn March 17, 1948, in Neenah, Wisconsin, Mr. Korten was the son of Margaret A. (O’Grady) and John S. Korten. He graduated from Homestead High School in Mequon, Wisconsin, in 1966, and attended the University of Wisconsin-Madison, where he majored in political science. He was a co-founder and the first editor-in-chief of the Badger Herald, an independent student newspaper.\nHe began his broadcasting career at the university radio station, then worked at a radio station in Madison, Wisconsin, before moving to Washington, D.C., where he worked on the staffs of Reps. Bob Bauman and Barry Goldwater Jr., as well as the American Conservative Union.\nFrom 1975 to 1981, Mr. Korten worked as a reporter and a desk anchor at WTOP, then the CBS News Radio affiliate in Washington.\nHe left broadcasting to serve the administration of President Ronald Reagan. Mr. Korten first served as director of policy and communications at the Office of Personnel Management under Director Donald J. Devine from 1981 to 1985. From 1985 to 1988, he was deputy director and then director of public affairs at the Department of Justice under Attorney General Edwin Meese III.\nFor 11 years, from 1989 through 2000, Mr. Korten worked as a media trainer and consultant for the management consulting firm Rowan Blewitt in Washington, D.C. He also served as deputy vice president for communications at the Pharmaceutical Research and Manufacturers of America (PhRMA) from 1995 to 1996.\nLater he served as vice president of communications for The Cato Institute, a libertarian think tank, from 1996 to 1999, and vice president for communications at The Becket Fund for Religious Liberty from 1999 to 2004.\nMr. Korten also was the senior vice president of the Supreme Council of the Knights of Columbus, a 1.9 million-member Catholic fraternal benefit society, from 2004 until 2014, when he retired.\nHe served as director of communications for the Virginia State Council of the Knights of Columbus and was a longtime member of St. Catherine of Siena Catholic Church in Great Falls, Virginia, where he was a fourth-degree knight, a lector and a tireless volunteer.\nHe also was a member of the Ancient Order of Hibernians, an avid photographer and a major fan of the Washington Nationals baseball team and the Green Bay Packers football team.\nMr. Korten is survived by his wife of 44 years, Anita (Norfolk); three sons: Sean Korten and Brian Korten, of Fairfax, and Patrick John Korten, of Great Falls, Virginia; a sister, Jean Korten, wife of Carl Moser, of Lititz, Pennsylvania; and a granddaughter, Erin.\nA viewing will be held from 5 p.m. to 8 p.m. Thursday, April 12, at Adams-Green Funeral Home, 721 Elden St., Herndon, Virginia.\nA funeral Mass will be held at noon Friday, April 13, at St. Catherine of Siena Catholic Church, 1020 Springvale Road, Great Falls, Virginia. Lunch and remembrances at the church will follow the service. Burial will be private.", "url": "https://apnews.com/471f37545626d21eecd7da934bec2a4d"}