{"authors": ["Niki Kelly"], "date_download": "2020-05-04 20:14:18", "date_modify": "2020-05-04 20:14:18", "date_publish": "2018-11-14 05:00:01", "description": "INDIANAPOLIS - Fewer Indiana schools earned a failing accountability grade under results released today.  About 29 percent of schools received an A - similar to last year and up from 24...", "filename": "_89cb028634664b7faa25d6b2aca091a9_1588623258.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_89cb028634664b7faa25d6b2aca091a9_1588623258.html", "title": "Fewer Indiana schools earned failing accountability grade", "title_page": "Fewer Indiana schools earned failing accountability grade", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS - Fewer Indiana schools earned a failing accountability grade under results released today.\nAbout 29 percent of schools received an A - similar to last year and up from 24 percent in 2015-2016.\nThirty-five percent of schools received a B; 20 percent a C; 9 percent a D and 4 percent an F. A small number of schools did not receive a grade due to having too few students.\nIn comparison to last year, 40 fewer schools ranked as failing.\nOverall 477 schools saw their grade improve while 445 saw their grade drop. The rest - 1,166 - received the same grade.\n“Our current accountability grades are an indication of the great education Indiana students are receiving,” said Dr. Jennifer McCormick, Indiana Superintendent of Public Instruction. “Our work is paying off and as a Department we will continue to partner with dedicated stakeholders to ensure every school and every student is successful.”\nIn 1999, the General Assembly created a performance-based accountability system. The formula was changed in 2015, with improvement on the ISTEP+ test counting about the same as whether a student passes it.\nMaggie Paino, director of accountability for the Indiana Department of Education, told the State Board of Education Wednesday that many schools have been helped by growth points.\nBut some members were concerned that overall proficiency has remained stagnant.\n“The whole concept is growth toward proficiency. So if we don’t have proficiency then what is the point?” asked member Tony Walker.\nPaino also showed a comparison of traditional public schools versus public charters and private schools.\nAlmost 64 percent of traditional public schools received an A or B with charters at 39 percent and private schools 71 percent. About 14 percent of traditional public schools received a D or F; 27 percent of charters and 9 percent private schools.\nDue to differences between federal and state accountability equations and standards, IDOE also released federal accountability grades for the 2017-2018 school year. Roughly 67 percent of public schools received the same letter grade for both state and federal accountability systems, with 31 percent of schools receiving a higher letter grade on the state accountability system. Differences in performance metrics between the two systems were the main factor for discrepancies for 33 percent of school letter grades.\nFor instance, students receiving a general diploma didn’t count in the federal graduation rate. And growth points are capped on the federal side.", "url": "https://apnews.com/89cb028634664b7faa25d6b2aca091a9"}