{"authors": ["Musings Of The Star'S Editorial Board"], "date_download": "2020-05-04 20:04:18", "date_modify": "2020-05-04 20:04:18", "date_publish": "2018-02-12 19:23:00", "description": "Everyone loves the Westminster Dog Show in New York City. (Well, maybe not cat people, but I'll give them a pass.) It starts tonight up in Manhattan. And yes, it's on TV. My house is...", "filename": "_1346b7b74e264fbda2dc333bee140b81_1588622658.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1346b7b74e264fbda2dc333bee140b81_1588622658.html", "title": "Get ready to watch a lot of dogs on TV", "title_page": "Get ready to watch a lot of dogs on TV", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Everyone loves the Westminster Dog Show in New York City. (Well, maybe not cat people, but I’ll give them a pass.) It starts tonight up in Manhattan.\nAnd yes, it’s on TV.\nMy house is overrun by dogs -- three of them, two rescues and one we bought from a litter of Dachshunds. (We also have a cat with a stomach ailment, which is why I’m giving cat people a pass.) That said, I’m always curious about the science behind domesticated dogs and how they came to be.\nLuckily, the fine journalists at Reuters have given us this: “Good Dogs.”\nIt starts this way:\n“Dogs have been companions to humans for thousands of years. As the relationship has developed, so have various breeds — in response to both their environment and duties. Herding, hunting and guarding were among the initial types of work, but companionship has been a durable trait in the success of all breeds.”\nHooked, aren’t ya?\nMy favorite stat is a simple one. There are 89.7 million pet dogs in the United States, some high-class dogs, others just mutts. The color-coded U.S. map that shows which breeds are most popular in certain areas (based on AKC registrations) is cool, too. Enjoy.\nOh, and if a dachshund wins Best in Show this week, I’m throwing a party. Everyone’s invited. It’s BYOD -- bring your own dog, of course.\n-- Phillip Tutor", "url": "https://apnews.com/1346b7b74e264fbda2dc333bee140b81"}