{"authors": [], "date_download": "2020-05-04 20:09:58", "date_modify": "2020-05-04 20:09:58", "date_publish": "2018-01-09 00:00:00", "description": "MARRIAGE LICENSES • Ruben A. Rosa and Danielle M. Ross, both of Jermyn. • Angelo Joseph Pettitto Jr., Madison Twp., and Mary Lou Madden, Scranton.", "filename": "_f6dc11eb0af84549934ae6b11ce601e6_1588622998.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f6dc11eb0af84549934ae6b11ce601e6_1588622998.html", "title": "Lackawanna County Court Notes 1/9/2018", "title_page": "Lackawanna County Court Notes 1/9/2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MARRIAGE LICENSES\n• Ruben A. Rosa and Danielle M. Ross, both of Jermyn.\n• Angelo Joseph Pettitto Jr., Madison Twp., and Mary Lou Madden, Scranton.\n• Jesse Warren McCabe and Alina Christine Flory, both of Greenville, Ohio.\nPROPERTY TRANSACTIONS\n• Blue Shutters Land Development LLC, Covington Twp., to Hengfu Ni and Jie Zhao, Moscow; a property at 124 Golden Oak Drive, Covington Twp., for $55,000.\n• Hay Van and Lan Le, Scranton, to Lance Jay Robbins, Lackawanna County; two parcels at 443-445 Colfax Ave., Scranton, for $100,000.\n• William Caboot and Terri Madara, now by marriage Terri Caboot, as joint tenants with rights of survivorship, to Clark C. and Sheryl Cree, Pennsylvania; a property at 8 Lily Lane, Thornhurst Twp., to $125,000.\n• Season Jackson, Lackawanna County, to Shea O’Connor and Amber Martonick, Lackawanna County, as joint tenants with rights of survivorship; a property at 301 Second St., Blakely, for $147,000.\n• Heidi C. and Richard E. Barth, Dunmore, to Jeffrey W. and Cheryl Guse, Dunmore; a property at 108 Sherwood Ave., Dunmore, for $230,000.\n• Michael Gleeson, also known as Michael Gleason, Archbald, to Christopher Ross, Dunmore; a property in Roaring Brook Twp., for $88,000.\n• Ocwen Loan Servicing LLC, attorney-in-fact for Wells Fargo Bank, West Palm Beach, Fla., to Nick Thompson, Clarks Green; a property at 203 Fairview Road, Clarks Green, for $166,000.\n• Northeast Real Estate Development Inc. to Steven W. and Vivian Krauss; a property at 113 W. Market St., Scranton, for $32,500.\n• Mariann Moran, executrix of the estate of Dorothy A. Murphy, Scranton, to James Patrick Murphy, Clarks Summit; a property in Scranton for $30,000.\n• Cloverleaf Developers LLC, Archbald, to Catherine A. Healey, Archbald; a property at 113 Forest Drive, Archbald, for $221,200.\nDIVORCES SOUGHT\n• Jeremy Lee Evans, Dickson City, v. Ashley Hope Johnson, Shelton, Wash.; married June 12, 2007, in Waverly; pro se.\n• Shraddha Rayamajhi, Scranton, v. Ashish Ojha, Randallstown; married March 23, 2016, in Scranton; Barbara J. O’Hara, attorney.\n• William Caswell, Scranton, v. Donna Caswell, Duryea; married Sept. 15, 1988, in Scranton; pro se.\nFEDERAL TAX LIEN\n• Michael V. and Francene Dudziec, 3906 Wylam Ave., Moosic; $22,160.56.\nSTATE TAX LIENS\n• Robert and Debra Faraday, 117 Decker Road, Jermyn; $5,033.01.\n• Robert Cummings, 109 Cummings Pond Road, Clarks Summit; $9,779.78.\n• John H. and Blanche Grube, 534 Gladiola Drive, Clarks Summit; $4,750.71.\n• Rick Bilach, 318 14th Ave., No. 12, Scranton; $5,833.98.\n• Thomas Hill, 1607 Route 502, Spring Brook Twp.; $18,302.44.\n• Andrew D. Walker, 306 S. State St., Clarks Summit; $5,018.26.\n• Robert Bell, 1000 Delaware St., Mayfield; $6,669.56.\n• Robert W. and Margaret M. Pettinato, 1249 December Drive, Scranton; $33,499.01.\n• Francis X. Neville, 903 Clearview Road, Moscow; $11,573.62.\n• John Lettieri III, 106 Stoney Creek Place, Roaring Brook Twp.; $6,620.31.\n• Wilkie Hayes and Michelle Cadden, 509 Clark Ave., Clarks Summit; $3,695.52.\n• Christopher L. and Alison M. Rothwell, 200 Sean Drive, South Abington Twp.; $3,103.23.\n• Juan Cervantes, 310 N. Hyde Park Ave., Scranton; $3,264.97.\n• Gene Colombo, 312 Oakford Road, Waverly Twp.; $3,207.33.\n• Edward J. Kaushas Jr., 337 N. Filmore Ave., Scranton; $4,436.78.\n• Louis and Tanya Festa, 1014 Ridge Ave., Scranton; $4,058.43.\n• Herbert L. Eiden III, 1026 Beech St., Scranton; $3,213.46.\n• Stephen T. and Melissa M. Malinchak, RR 1 Box 1324A, Carbondale; $4,873.54.\n• Albert Liberatore, 211 Arthur Ave., Apt. 2R, Scranton; $3,339.15.\n• Evans and Genevieve Lilly, 1210 Hampton St., Scranton; $3,381.90.\n• Nicholas A. Carrubba Jr., 235 Jermyn Farm Road, Scott Twp.; $3,427.83.\n• Gregg Russo, floor 2, 1309 Dorothy St., Scranton; $3,914.39.\n• Greg Gentile, 2135 Moosic Lake Road, Jefferson Twp.; $4,076.03.\n• Nicholas A. Jr. and Kelly M. Carrubba, 235 Jermyn Farm Road, Scott Twp.; $716.68.\n• Andrew Planey, 120 Burcher Ave., South Abington Twp.; $3,981.64.\n• Anthony J. and Helene E. Dale, 1020 Jackson St., Scranton; $3,023.76.\n• Joseph N. Tracewski, 135 Cottage St., Carbondale; $3,726.52.\n• Mark Wallace, 125 Olga St., Jessup; $3,406.68.\n• Satish Mallik, 205 Carpenter Hill Road, South Abington Twp.; $3,840.28.\n• Carl Weber, 401 Boulevard Ave., Dickson City; $2,929.97.\n• Robert and Kimberly D’Angelo, 401 Edgar St., Olyphant; $3,398.21.\n• Adam Guiffrida, 1115 Electric St., Scranton; $3,223.06.\n• Christopher J. Paciotti, 1924 Clearview St., Scranton; $3,920.77.\n• Scott M. Long, P.O. Box 98, Jessup; $4,302.58.\n• William Poseno, 534 Birch St., Scranton; $3,107.10.\n• John P. Gilroy, 108 Watres Drive, Scranton; $4,188.59.\n• Lois Glodzik, 16025 Hilltop Drive, Clarks Summit; $23,737.48.\n• Paul Morvan, 2225 Cherry Hill Road, Clarks Summit; $5,910.62.\n• Josh Jones, Jones Oilfield Service, 620 Layton Road, South Abington Twp.; $22,725.85.\n• Michael E. Magdon, 201 Hull Ave., Olyphant; $32,198.98.\n• Polina M. Philbin, 407 W. Elm St., No. 1, Dunmore; $5,948.85.\n• Dustin W. Holeva, 1735 Scott Road, Olyphant; $12,205.29.\n• John Robert Smith, 140 Smith Road, Moscow; $4,440.18.\n• Audra L. McCloe, 658 S. Keyser Ave., Scranton; $8,614.28.\n• Christopher M. Wartella, 12 Maple Leaf Drive, Old Forge; $20,603.74.\n• Robert A. Brown, 811 Woodmere Ave., Olyphant; $120,118.45.\n• John B. and Alison M. Skoff, 1621 Quincy Ave., Scranton; $4,391.44.\n• Timothy Aikman, P.O. Box 157, Dalton; $20,864.85.\n• Juan Perez Vazquez, 1032 Green Holly Road, South Abington Twp.; $7,497.71.\n• Kevin Napoli, 309 Franklin St., Mayfield; $5,839.36.\n• David Williams, 1010 Sterling St., Scranton; $8,044.42.\n• Jamie Spindler, 513 N. Garfield Ave., Scranton; $4,391.10.\n• James A. Kilpatrick, 2726 Ransom Road, Clarks Summit; $6,003.78.\n• John J. Lawless and Florence S. Sweeny, 1711 N. Webster Ave., Dunmore; $9,121.50.\n• Scott Lonzinski, 108 Old Orchard Road, Carbondale; $417,320.13.\n• Timothy A. Hewitt, P.O. Box 560, Clarks Summit; $7,890.22.\n• William J. and Debra Rosado, 319 Glenmaura Drive, Moosic; $19,127.27.\n• Sean P. and Jennifer E. Nolan, 204 Grassy Island Ave., Jessup; $9,379.56.\n• Edward R. Coss, 1967 Myrtle St., Scranton; $5,136.19.\n• Heath G. Goldstein, 83 Abington Gardens Drive, South Abington Twp.; $9,783.20.\n• Christopher E. White, 420 Adams Place, South Abington Twp.; $5,113.36.\n• Ronald A. and Patricia A. White, 209 Applewood Acres, South Abington Twp.; $5,414.05.\n• Jason P. and Frances R. Tayoun, 510 Brookside Road, Dalton; $5,686.10.\n• David A. Mikolon, 951 Lincoln St., Scranton; $10,384.83.\n• Timothy McAndrew, 224 S. Sherman Ave., Scranton; $1,762.63.\nESTATE FILED\n• Louis Manci, 340 Pattison Ave., Scranton, letters of administration to Joseph Manci, 1000 Windemere Circle, Dalton.\nONLINE: thetimes-tribune.com/courts", "url": "https://apnews.com/f6dc11eb0af84549934ae6b11ce601e6"}