{"authors": ["Joey Morona"], "date_download": "2020-05-04 20:17:41", "date_modify": "2020-05-04 20:17:41", "date_publish": "2018-04-21 11:28:00", "description": "Cleveland featured in premiere of Travel Channel's 'Eat, Drink, Haggle' with Lara Spencer CLEVELAND, Ohio -- We now know what \"Flea Market Flip\" and \"Good Morning America\" host Lara Spencer...", "filename": "_9c04ae8c8e674a348e46dd6603ef745d_1588623461.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9c04ae8c8e674a348e46dd6603ef745d_1588623461.html", "title": "Cleveland featured in premiere of Travel Channel's 'Eat, Drink, Haggle' with Lara Spencer", "title_page": "Cleveland featured in premiere of Travel Channel's 'Eat, Drink, Haggle' with Lara Spencer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cleveland featured in premiere of Travel Channel’s ‘Eat, Drink, Haggle’ with Lara Spencer\nCLEVELAND, Ohio -- We now know what “Flea Market Flip” and “Good Morning America” host Lara Spencer was up to when she was spotted in Cleveland last October.\nShe was filming the first episode of her new Travel Channel series, “Eat, Drink, Haggle.” On the show, premiering today, April 21 at 2 p.m., Spencer hits the road and visits one city where she sees the best sights, eats the best food and, of course, finds the best deals at flea markets.\n“The way I see it, the perfect weekend getaway combines three things: seeing new places, eating delicious local food and combing the local flea market for unique, one-of-a-kind finds,” Spencer said in a press release. “Shopping for bargains can work up quite an appetite – so I’ve got a local wingman at my side to show me the hidden gems of this city that you need to see for yourself.”\nThe Cleveland episode features stops at the Cleveland Flea, Market Garden Brewery, West Side Market, Hansa Brewery and Slyman’s. Her wingman here is Cleveland restauranteur Alan Glazen of “Cleveland Hustles” fame.\nThe episode’s premiere coincides with first Cleveland Flea of the season, happening today from 9 a.m.-4 p.m.\nIt’s almost time to EAT DRINK HAGGLE!!! That’s the name of my new special for Travel Channel, where I find the best local food, drinks and flea market finds! First stop--CLEVELAND! Tune in or set your DVR!! Saturday 2pm/1pmc on @travelchannelA post shared by Lara Spencer (@laraspencerabc) on Apr 19, 2018 at 6:00am PDT\nThe countdown is on! 5 days until @fleamarketflip_ starts shooting #Season12 baby!! AND my new show, #EatDrinkHaggle, premieres 4/21 at 2pm on @travelchannel. Come spend the weekend with me as we EAT, DRINK, and HAGGLE our way across the USA! #CLEVELAND #exploreyourworldA post shared by Lara Spencer (@laraspencerabc) on Apr 10, 2018 at 3:03pm PDT\nKeg stand not an option here. #CLEVELAND #hansahaus breweryA post shared by Lara Spencer (@laraspencerabc) on Oct 15, 2017 at 4:28pm PDT\nRemember the old Wendy’s commercial-“Where’s the beef?” Now I know. #CLEVELAND #slymans (and before you ask--no I didn’t eat it all. 2 bites and shared the rest w my crew:).A post shared by Lara Spencer (@laraspencerabc) on Oct 14, 2017 at 2:05pm PDT\nFound the flea in Cleveland!!! (Of course). Love this town. #clevelandFleaA post shared by Lara Spencer (@laraspencerabc) on Oct 14, 2017 at 11:11am PDT", "url": "https://apnews.com/9c04ae8c8e674a348e46dd6603ef745d"}