{"authors": ["Joseph Szadkowski The Washington Times"], "date_download": "2020-05-04 20:25:31", "date_modify": "2020-05-04 20:25:31", "date_publish": "2018-05-10 18:50:04", "description": "Lego celebrates the release of Disney and Lucasfilm's impending blockbuster \"Solo: A Star Wars Story\" with a new collection of constructible kits. The latest buildable toys include Han...", "filename": "_7decaab7d0314e23b749ee9302732f0f_1588623931.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7decaab7d0314e23b749ee9302732f0f_1588623931.html", "title": "A Star Wars Story\" Kessel Run Millennium Falcon Lego review", "title_page": "Zadzooks: \"Solo: A Star Wars Story\" Kessel Run Millennium Falcon Lego review", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lego celebrates the release of Disney and Lucasfilm’s impending blockbuster “Solo: A Star Wars Story” with a new collection of constructible kits.\nThe latest buildable toys include Han Solo’s Landspeeder ($29.99, 345 pieces); Moloch’s Landspeeder ($39.99, 464 pieces); 9-inch-tall, buildable figures of a Range Trooper and Han Solo ($24.99, 101 pieces each); and, the crown jewel of the series, a new version of Lando Calrissians and Han Solo’s favorite hunk of junk in the galaxy.\nFigure profile: (paraphrased from Internet descriptions) When the Millennium Falcon makes the Kessel Run, a risky hyperspace route that weaves a path surrounding the planet Kessel, it earns its reputation as one of the fastest ships in the galaxy. Only the most daring pilots risk charting shortcut paths through the run’s obstructions or even dare land on the planet to challenge the villainous spice mines overseer Quay Tolsite.\nBuildability: Assembling 1,414 blocks and pieces was a breeze for my highly intelligent, 17-year-old, Lego-building fanatic. Under my careful watch, he brought the masterpiece to three-dimensional life in less than 3.5 hours.\nThe suggested age for the kit is from 9 to 14 years old, and I would expect equal tenacity from any tween looking to add this classic vehicle to his Star Wars Lego collection.\nThe finished design is a 19-inches-long, 4-inch-tall and 12-inch-wide, mostly white and less grey Millennium Falcon with blue-and-yellow highlights loaded with interior details for the included mini-block figures to enjoy.\nAs per Zadzooks tradition, I offer a few tips and observations of the build experience.\nThe over 200-page, full-color manual was a welcomed assistant when navigating though the 10 bags of Legos and mostly, clearly explained the build process. However, some of the orientations of the images were slightly off, and it was sometimes difficult to tell how many spaces were to be left open while assembling major components. It was especially troublesome when assembling the top laser canon area. Look at the box or online videos for help.\nParents should take note that 18 stickers need to be applied to the craft, with the most challenging involving getting the sticky paper panels on straight for the onboard instrumentation.\nAccessories: The fully assembled, pristine-looking Falcon includes on its exterior two, spring-loaded launchers (with translucent red missiles); rotating top and bottom laser turrets, with a removable compartment to seat two mini-figures; a cockpit with detachable canopy; four landing gear stands; a sensor dish; and ramp.\nMost important, the front of the ship now features a removable escape pod (cargo container) with hinged door and rear propulsion (a blue translucent cylinder) wedged between the two mandibles.\nOf course, when you think about, it makes perfect sense for a smuggler to have this pod option, but that feature no longer exists in the “New Hope” and later version of Millennium Falcon, no doubt due to Han Solo’s repair issues and abuse of the ship over the years.\nBetter yet, owners can peel back the dozen hinged hull plates like a budding flower to expose the complex interior, circular living space of the craft.\nOnce opened, areas exposed include: a cargo area with two containers and access to the hyperdrive (with a few repair tools); a navigation computer with spinning chair; four yellow seats surrounding a Dejarik hologame table; a full bar with bottles and cups; a removable bunk; and a completely studded floor to attach mini-figures.\nAnd, finally, the set offers seven, roughly 2.5-inch-tall, blocky and slightly articulated mini-figures of Han Solo, Chewbacca, Qi’ra, Lando Calrissian, Quay Tolsite, a Kessel operations droid and a DD-BD droid.\nHere are a few quick thoughts on my favorites of the set.\nChewbacca: Han Solo’s trusted friend gets a new design with multiple shades of brown highlighting his furry face and torso, and a pair of bandoliers hanging over his chest. He wields a blaster rifle instead of his bowcaster.\nLando Calrissian: This exclusive younger version of Han Solo’s gambling rival wears a two-tone, black-and-blue cloth cape, a yellow torso, a black scarf painted on his torso and legs, a black Jheri-curled plastic wig, and a reversible head with two expressions (smiling and serious). He also wields a silver blaster.\nQuay Tolsite: The Pyke Syndicate administrator on Kessel gets a silver-helmeted breathing apparatus covering his golden head; an imprinted skirt and torso with orangish embers; instrumentation designs; and a pistol-sized blaster. He will be most familiar to fans of “The Clone Wars” animated series.\nOne small gripe is that the bottom of the ship looks unfinished being grey, flat and not white. I believe that was to help with the toy stability, in tandem with the sturdy horizontal block braced across the middle of the ship to help handle intense play sessions.\nAlso, trying to squeeze Han and Chewie into the cockpit was a really tight fit, especially with the walking carpet seated in the co-pilot spot. Although, I thought the coffee maker behind them (at least that’s what it looks like) was a space waster but still an amusing touch.\nPrice: $169.99.\nRead all About it: Marvel Comics offers the new five-issue series “Star Wars: Lando Double or Nothing” ($4.99 each) starting in late May. Set prior to the film, the story features the smuggler and his beloved Millennium Falcon on a mission to help rescue a crime lord’s minions enslaved by the Empire.\nWhat’s it worth: Lego delivers a well-made version of the most well-known spaceship in a galaxy far, far away, but it comes with a relatively high price.\nParents will need to monitor the commitment of junior Padawans to finish less daunting Lego sets before taking the monetary plunge into this complex kit thats equally ready for display on a bedroom shelf as well as some serious role-play action.", "url": "https://apnews.com/7decaab7d0314e23b749ee9302732f0f"}