{"authors": ["Aaron Curtis", "Acurtis Lowellsun.Com"], "date_download": "2020-05-04 20:22:22", "date_modify": "2020-05-04 20:22:22", "date_publish": "2018-12-04 11:37:37", "description": "CHELMSFORD -- Mary Ellen Morris, a resident of Amble Street in Chelmsford, has never owned chickens herself, but she has neighbors who have. \"There's never been a single issue or problem,\"...", "filename": "_bfc14980c6ac49c5910a64f19eeca9b4_1588623742.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bfc14980c6ac49c5910a64f19eeca9b4_1588623742.html", "title": "Draft Chicken Bylaw Ruffles Feathers in Chelmsford", "title_page": "Draft Chicken Bylaw Ruffles Feathers in Chelmsford", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHELMSFORD -- Mary Ellen Morris, a resident of Amble Street in Chelmsford, has never owned chickens herself, but she has neighbors who have.\n“There’s never been a single issue or problem,” Morris said Monday night during a Board of Health meeting held at the Chelmsford Senior Center.\n“We love them,” Morris continued. “They’ve always been clean, well cared for, the kids love them. We love eating fresh food and eggs. We trade different things -- we give them vegetables, they give us eggs -- it’s wonderful.”\nMorris was one of roughly 15 people -- including several who spoke multiple times -- who addressed the Board of Health, providing input on the draft regulations created to govern the ownership of animals, like chickens, within the town.\nThe 10-page draft drew criticism from the majority of speakers, who described it as too restrictive. Aspects of the draft that drew complaints included a measure limiting the number of hens on a single property to six, requiring weekly cleaning of hen houses, and that all hen houses be located no less than 50 feet from abutting property.\n“I feel we’re trying to solve a chicken problem that doesn’t exist,” Morris said. “I don’t understand, I can’t comprehend why this has come about.”\nBackyard chickens became a point of contention in Chelmsford in late summer, when concerns over a possible connection to a Westlands neighborhood rat infestation was exposed.\nResidents on Buckman Drive pointed to a neighbor’s chickens as the cause of the infestation, leading to several highly-charged discussions during Board of Selectmen, Planning Board and Board of Health meetings.\nEd Buckley, a resident of Buckman Drive who raised concern this summer about the rat problem, spoke Monday night.\n“God help you if you live next door to a negligent chicken owner,” Buckley said. “I caught 53 rats myself. ... Twenty seven years and I never saw a rat. I’m not saying the rats weren’t there. I’m sure they were -- they’re water rats. But you have a negligent chicken owner, and they come out of the wetlands, you’ll go through hell like we did as a neighborhood.”\nFollowing the Buckman Drive issue, other properties with chickens were discovered and Building Commissioner/Zoning Enforcement officer Shaun Shanahan found 11 of the approximately 20 chicken permits issued by the Board of Health were for properties smaller than the town bylaw’s required size of 40,000 square feet. Letters were submitted from the health and building departments telling those owners they must get rid of the chickens and coop by the end of the year, when their current permit expires. If not, they could be subject to fines of $25 to $100 each day the chickens stay on the property after Dec. 31.\nComing under fire by the Board of Health were Steve and Melanie Agostino. The couple had an animal permit for up to nine chickens. However, the couple had 14 chickens, in addition to rabbits, putting them in violation of their permit, said Board of Health Chairwoman Annmarie Roark.\n“Everybody else had a permit, but were not in compliance with zoning, so they were given until Dec. 31,” Roark said. “The difference is (the Agostinos) permit was revoked because they violated the permit.”\nThe couple was given until Monday to remove the animals from their property, an extension from Oct. 12.\nA public hearing on whether the Agostinos would be granted a variance to keep their animals until Dec. 31 was held Monday night.\nAttorney Doug Hausler, who represents the Agostinos on the matter, said the violation of the permit was a simple mistake.\nAfter a heated debate between Roark and Hausler, the Board of Health decided against the variance and said the couple has until Dec. 7 to reduce the number of chickens to nine -- as allowed by the permit -- or they will be fined $25 a day.\nHausler refused to comment on the Board’s decision following Monday night’s meeting.\nAlso after Monday night’s meeting, Roark said she expects there will be changes to the draft on ownership of animals before a final draft is voted on next week.\n“What we heard tonight, there were some consistencies through what was said, and a lot of people said the same thing over and over again,” Roark said. “So, I think there will be some changes. ”\nChairman of the Planning Board Mike Raisbeck, who called the draft “appalling” after Monday night’s meeting, said he has submitted an amended draft for the Board of Health to review.", "url": "https://apnews.com/bfc14980c6ac49c5910a64f19eeca9b4"}