{"authors": ["Chris Rusch Master Gardener"], "date_download": "2020-05-04 20:26:22", "date_modify": "2020-05-04 20:26:22", "date_publish": "2018-03-31 13:30:00", "description": "Question: I would like to plant a variety of summer flowers that are fragrant and beautiful for my patio and yard. Do you have any recommendations? Answer: Summertime means time outdoors in...", "filename": "_5e079f3792df469a815c413d3fa580af_1588623982.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5e079f3792df469a815c413d3fa580af_1588623982.html", "title": "Ask a Master Gardener: Summer flower recommendations", "title_page": "Ask a Master Gardener: Summer flower recommendations", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Question: I would like to plant a variety of summer flowers that are fragrant and beautiful for my patio and yard. Do you have any recommendations?\nAnswer: Summertime means time outdoors in the yard and patio, a perfect time to enjoy strongly fragrant flowers. A garden’s fragrance can be as unforgettable as its appearance. The scent of a particular flower can at once evoke memories of past times and places. You can use fragrant plants in a variety of ways. En masse, they create a bathed-in-scent garden. Set out in just a few spots, they provide a mystery perfume from who-knows-where. Plant them in containers to scent a deck or patio. Locate them beneath a window to let the fragrance waft indoors.\nHere are some recommendations:\nSweet smelling lilies (Lilium) are beloved by gardeners and send their fragrance far and wide. This is a large group of bulbs bearing trumpet-shaped flowers with an unmistakably sweet scent. It is a favorite of gardeners and floral arrangers alike. Plant some bulbs near a patio or deck, or next to a walkway. They also do well in containers. No matter the location, the effect is the same: a heavenly experience for the senses. There are all kinds of varieties available.\nSweet peas (Lathyrus odoratus) are a classic flower in English gardens since they were introduced in the 17th century from southern Italy. Shorter bush or dwarf varieties, including “Supersnoop” and “Fragrantissima” types, make a colorful hedge in a flower bed, along a walkway or in planters. Taller climbing varieties, such as “Old Spice Mix” or “Royal Family” can be trained to cover fences and trellises. Both types make wonderful cut flowers with sweet, old-fashioned fragrance with a variety of colors.\nJasmines (Jasminum) can be a versatile, trouble-free addition to your fragrant landscape. The species with the classic, freshly sweet jasmine scent is J. officinale, also called common jasmine or poet’s jasmine. It’s a fast-growing vine and sometimes needs a trellis. Once established, it can bloom from June through August with small white fragrant flowers. The popular dark green vine with the strongly nutmeg-scented flowers called star jasmine is not really jasmine. It is Trachelospermum jasminoides, also called Confederate jasmine. It grows on a trellis or can be used as a ground cover.\nSiberian wallflower (Erysimum allionii) is an easy-to-grow annual with fragrant flowers in fiery rich orange and yellow blooms. The name tells you this is a wildflower from cold climates. However, in warmer places, it grows as a perennial, returning year after year. Simply scatter the seed in spring or fall on loosened soil, and compress into the soil. Do not cover.\nSweet alyssum (Lobularia maritima) is a one-of-a-kind plant, low, branching and trailing forming a carpet of pure white flowers with a sweet honey fragrance. It blooms from spring until frost.\nSome flowers, fragrant at night only, open their blossoms after the sun starts to go down, a perfect time to enjoy strongly fragrant flowers. Here are a few recommended flowers that release their scent after hours seemingly just for human enjoyment.\nCottage pink (Dianthus plumarius) has white, pink or rose flowers with dark centers and fringed petals and a spicy fragrance. The plant is low and mounded with gray-green foliage. It is perfect for a border or as a companion for roses.\nEvening primrose (Oenothera) is a tough perennial with showy, four-petaled flowers of white, pink or bright yellow that open in the evening and give off a sweet aroma.\nFour o’clock (Mirabilis jalapa) is true to its name. This pretty plant has flowers that open in the late afternoon and a emit a sweet vanilla scent. The blossoms come in white and cheerful shades of red, pink, and yellow. Some are bi-colored.\nMoonflower (Ipomoea alba) is a relative of the morning glory. The moonflower has climbing vines that will need a fence or trellis. They produce lovely white 4-6 inch flowers that unfurl after dark, staying open until noon, and give off a powerful scent.\nFlowering tobacco (Nicotiana alata) is a fragrant annual with a jasmine-like fragrance that’s more intense at night. It has white, pink, red and green flowers.\nRemember that the amount of scent a plant carries varies between cultivars and even individual plants. It’s always best to buy plants in flower so you can choose those most wonderfully scented and confirm that you enjoy their fragrance. Individual preference varies greatly — one person’s heady perfume is another’s allergen.\nWith a little planning, you can have a parade of fragrance throughout the season.", "url": "https://apnews.com/5e079f3792df469a815c413d3fa580af"}