{"authors": ["Rachel Alexander"], "date_download": "2020-05-04 20:22:21", "date_modify": "2020-05-04 20:22:21", "date_publish": "2018-01-21 00:00:00", "description": "Washington and Idaho are in the midst of what’s likely to be the worst flu season since the 2009 swine flu pandemic. Forty Washingtonians died from the flu in the past week, according to the...", "filename": "_a42caf7a81fa43718ed4e552f2a51608_1588623741.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a42caf7a81fa43718ed4e552f2a51608_1588623741.html", "title": "Flu season worst since 2009 swine flu pandemic", "title_page": "Flu season worst since 2009 swine flu pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Washington and Idaho are in the midst of what’s likely to be the worst flu season since the 2009 swine flu pandemic.\nForty Washingtonians died from the flu in the past week, according to the Washington Department of Health, nearly doubling the total flu season count to 86 deaths.\nThat includes 15 deaths in Spokane.\nA total of 181 people have been hospitalized in Spokane County so far in January. If that trend continues, hospitalizations should easily surpass the previous record of 231 in January 2015.\nIn Idaho, the Kellogg School District on Jan. 9 closed for three days due to widespread absences from the flu.\n“We’re still in the thick of things,” said Mark Springer, an epidemiologist at the Spokane Regional Health District who has done flu surveillance since 2009.\nHere’s what you need to know about this flu season and the flu vaccine.\nWhy is the flu season so bad?\nA few things affect the severity of flu season, Springer said. Chief among them is the strain of flu that’s circulating most widely.\nFlu strains are divided into types A and B. The A strains are more common at the start of the season, and are found in animals as well as people. The B strains usually peak later in the season and only infect people.\nThis year’s dominant A strain is H3N2, and it appears to be a nastier strain than in past years. In contrast to H1N1, which affects younger and healthier people, H3N2 strains tend to be worse for older people and people with chronic conditions that make them susceptible to illness.\nThe vaccine this year is also less effective, making it somewhat easier for the flu to spread. Springer said it’s hard to tease apart whether the particular strain, the vaccine or both are contributing to the higher-than-usual number of cases.\nHow effective is this year’s flu shot?\nThe short answer: It’s too early to tell. But health officials are widely in agreement about two things. It’s less effective than in the best years, and it’s still worth getting.\nVaccines are generally less effective against H3N2 strains of flu than other types, which means any year with mostly H3N2 cases is going to have a less effective vaccine. Flu strains mutate from year to year, and the way H3N2 vaccine strains are grown in eggs may accelerate that process.\nMany media reports have focused on the vaccine’s estimated 10 percent effectiveness against H3N2 in Australia during the Southern Hemisphere’s flu season last year. But even when the effectiveness against H3N2 flu is low, the shot provides good coverage against H1N1 and influenza B strains.\nDr. Bob Lutz, the health district’s health officer, wrote a letter in December urging people to get vaccinated. Among his reasons: the first flu death in Spokane County this year was from a B strain of the flu.\nHow is flu measured and tracked?\nThe 2009 swine flu season kicked off much of today’s flu reporting network, Springer said. Before that year, health departments and districts relied mostly on testing from the Centers for Disease Control to determine which types of flu were circulating, and information from local health care providers about flu-like illness.\nThe pandemic that year kicked off more robust hospital surveillance, with many health districts tracking how many people were hospitalized, and how many people showing up in emergency rooms with flu-like symptoms actually tested positive for influenza.\nFlu is considered widespread when more than 10 percent of hospital tests in people with some type of respiratory illness are positive for flu. Springer said the number has been over 50 percent in Spokane County the past few weeks.\nThe swine flu epidemic was also when many hospitals developed the ability to do their own analysis of virus samples from patients, rather than waiting for the state health lab or CDC to determine if a sample was H1N1 or H3N2. That makes it easier to know which strains are common.\nWhat’s happening in Idaho?\nIdaho’s season is looking much like Washington’s, with an early start and higher rates of hospitalization. Twenty-five people in the Panhandle Health District area have died so far this season, said Melanie Collett, the district spokeswoman. All of those have been over the age of 50.\nBy comparison, the district saw 28 deaths total last flu season. Since a season typically peaks in February or March and can extend into May, this year’s death toll will almost certainly be higher.\nIn Kootenai County, things may be starting to wind down. Kootenai Health has seen a slight reduction in the percentage of positive flu tests among hospital patients with respiratory illness, said Amy Ward, the community health and infection prevention manager.\nThe week of Dec. 24, the hospital tested 189 people and found 34 percent had the flu. The following week, out of 217 tests, 32 percent were positive. The week of Jan. 7, that fell to 161 tests, with 28 percent positive.\n“It’s kind of normalizing now to what we’d expect,” Ward said. But she cautioned that flu is unpredictable.\n“It could peak again or it could just drop off and be nothing,” she said.\nWhat’s happening in schools?\nAside from closures in Kellogg, other schools in the region have stayed open with absentee rates that are normal or only slightly elevated for this time of year.\nCoeur d’Alene elementary schools were hovering between 6 and 7 percent absenteeism this week, district spokesman Scott Maben said, compared to 8 percent on the same dates last year. Secondary schools were slightly higher, around 8 percent.\nThe Panhandle Health District has not notified the schools of any confirmed flu cases involving students.\nSpringer said Spokane County schools haven’t hit the 10 percent absentee rate which triggers a report to the health district.\n“It has not hit the schools right now,” he said.\nWhat should I do if I’m sick?\nNot every illness during flu season is influenza. Most flu infections start with the respiratory system: the nose, throat and lungs. Symptoms include coughing, sore throats, fever and muscle aches.\nMost people with the flu will recover on their own without medical care. Because the flu is a viral infection, antibiotics will not help, but antiviral drugs for treatment are an option.\nPeople who are sick should seek emergency care if they experience serious flu symptoms. In adults, these include difficulty breathing or shortness of breath, chest pain, confusion, sudden dizziness and flu symptoms that improve but then return with fever and worse cough.\nChildren should also receive emergency care if they have a fever with rash, are not drinking enough fluids, do not wake up or interact with others, or become so irritable they don’t want to be held.", "url": "https://apnews.com/a42caf7a81fa43718ed4e552f2a51608"}