{"authors": ["Jonathan Glover"], "date_download": "2020-05-04 20:17:55", "date_modify": "2020-05-04 20:17:55", "date_publish": "2018-03-22 00:00:00", "description": "Mary Walker School District in Stevens County announced schools would be open Friday as normal. The school closed Thursday after threats of a school shooting were reported. The district,...", "filename": "_64d44d58f49343448fcf3f3f564030d9_1588623475.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_64d44d58f49343448fcf3f3f564030d9_1588623475.html", "title": "After shooting threats, Mary Walker School District in Stevens County to reopen Friday", "title_page": "After shooting threats, Mary Walker School District in Stevens County to reopen Friday", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mary Walker School District in Stevens County announced schools would be open Friday as normal.\nThe school closed Thursday after threats of a school shooting were reported. The district, located in Springdale, Washington, announced on Facebook that it “plans to have a regular school day” following the closure.\nStevens County Sheriff Kendle Allen said Thursday that the district made the decision to close for a day after several unsubstantiated threats were made within the span of about a week.\nThe first report of a shooting threat came about “nine to 10 days ago,” the sheriff said, when a female student overhead other students talking about “some type of threat.”\n“She perceived a threat, some type of hit list,” he said. “She didn’t know what the ‘hit list’ was for. It could have been a music hit list, she didn’t know.”\nAllen said administrators met and talked with the students and determined there was no credible threat to students or staff.\nBut then Wednesday night, Allen said students began posting information on Facebook that they’d received over the social media app Snapchat that there was going to be “some type of shooting at the school today.”\n“From what we understand, this led back to the conversations that were overheard from other students,” Allen said.\nThe sheriff said school administrators felt the threats were then credible enough to cancel school for the day. Representatives from the district did not return calls seeking comment Thursday.\nAfter interviewing several witness, Allen said he was confident there was “no perceivable threat from or toward anybody.”\nNo arrests were made.", "url": "https://apnews.com/64d44d58f49343448fcf3f3f564030d9"}