{"authors": ["Jennifer Harper The Washington Times"], "date_download": "2020-05-04 20:07:30", "date_modify": "2020-05-04 20:07:30", "date_publish": "2018-03-04 18:04:09", "description": "President Trump's fans have long been subject to hostility, contempt and personal attacks from the news media, assorted Democrats, entertainers and political rivals. It's almost unprecedented. Mr....", "filename": "_e1aaf87586166ea0ac5faedea9747ce4_1588622850.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e1aaf87586166ea0ac5faedea9747ce4_1588622850.html", "title": "Do you 'publicly admit' support for Trump?", "title_page": "Inside the Beltway: Do you 'publicly admit' support for Trump?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Trump’s fans have long been subject to hostility, contempt and personal attacks from the news media, assorted Democrats, entertainers and political rivals. It’s almost unprecedented. Mr. Trump himself is addressing that phenomenon in “Listening to America,” a comprehensive, 32-question voter survey being circulated by his 2020 reelection campaign.\nQuestion 24 cuts to the chase: “Do you feel that you cannot publicly admit that you support Trump?”\nIt is a canny and strategic query. Steadfast Trump fans have traditionally been enthusiastic, unwavering and unapologetic about their loyalty to the president. Their response to Question 24 will likely reveal that most can’t wait to affirm their allegiance and dampen persistent media narratives that claim Mr. Trump is losing support.\nMultiple surveys from other pollsters in recent months reveal that Trump voters remain loyal, and that the president still enjoys an 80-90 percent approval rating among those who voted for him. A new Zogby Analytics poll released Saturday found that 48 percent of all voters now support Mr. Trump, with the number reaching 87 percent among Republicans.\nOverall, the rest of the questions on the president’s new survey are not mincing words either. Along with specific policy inquiries on immigration, terrorism, the economy and other pertinent matters, the survey also asks “Do you find the news to be generally too negative/hateful?” “Do you think our country is too divided?” and “Do you trust the media?”\nOnce again, Mr. Trump and his strategists are bypassing traditional pathways and the ever-present press, and are steering an agenda as they see fit. This marks the third time the president has released such a survey, a campaign tool he deems a “huge success,” and a practical, usable gauge of sentiment.\n“Everyone in D.C. and the media have been shouting at each other, but they need to stop and listen to the only people that matter. You. Reporters don’t get to make laws, and politicians don’t get to usher in sweeping change without first consulting you. It’s time for Washington to stop bickering and listen to America,” Mr. Trump advises in his new outreach.\n“It’s our best way to hear from the real America on the big issues of the day. And every single time we learn the same thing that the mainstream media is totally out of touch with the hardworking Americans who truly run our nation,” Mr. Trump observes.\nNANCY’S GAVEL\n“Nancy Pelosi, first woman Speaker of the House, will donate a historic Speaker’s gavel to the National Museum of American History,” advise event organizers from the museum home to the American flag that flew over Baltimore’s Fort McHenry on Sept, 14, 1814, and inspired Francis Scott Key to write “The Star-Spangled Banner.”\nNow comes a gavel. Some may recall that the gavel in question is about the size of a croquet mallet and was presented to Mrs. Pelosi in 2011 by outgoing House Speaker John Boehner.\nNow House minority leader, Mrs. Pelosi will donate the distinctive ceremonial object in Flag Hall at the museum on Wednesday, flanked by Reps. Doris Matsui, California Democrat, and Cathy McMorris Rodgers, Washington Republican. Also present at the event: PBS host Judy Woodruff; David J. Skorton, Smithsonian Institution secretary; John Gray, National Museum of American History director; and Lisa Kathleen Graddy, curator of political history at the host museum.\nDEMOCRATIC PRIMARIES GET NASTY\nThe Democratic Party seems mighty frisky these days, confident that Congress is theirs for the taking. Uh, maybe not. There may be too many Dems in the race.\n“Some Democrats fear the party’s embarrassment of riches could lead to nominating the wrong candidates,” writes David Catanese, senior politics writer for U.S. News World Report. “The unprecedented bounty of candidates Democrats are drawing into political campaigns this year up and down the ballot is coming with a price: Nastier primaries. From Texas to California, a flood of Democratic aspirants are clogging primary ballots and turning their swords on each other before they can wholly focus on their Republican foes.”\nWhat? Democrats turning on each other?\n“In some cases, the crowded fleet is making it difficult for candidates to distinguish themselves in the media and among voters. In others, they’re earning attention largely because it’s getting messy. And the internecine warfare is most prevalent in congressional contests,” Mr. Catanese writes.\nWe’ll find out soon. Texas kicks off the official 2018 primary season on Tuesday, boasting such bouts as Houston’s 7th Congressional District where seven Democrats are vying to take on incumbent Rep. John Culberson, a Republican.\nOPINION ON A DIFFICULT MATTER\n“Most Americans 58 percent think the death penalty is a fair punishment if the man accused of killing 17 people during a school shooting in Florida is convicted, and nearly half don’t think, in general, that leniency should be granted to suspected criminals if they are found to be mentally ill.”\nThis according to a new Rasmussen Reports survey, referencing the school shooting in Parkland, Florida, last month. Suspected shooter Nikolas Cruz faces 17 charges of premeditated murder and is being held without bond at a Broward County jail.\nPOLL DU JOUR\n59 percent of Americans say if a president had an extramarital affair before being elected, it “should not be relevant” to how he is judged in office; 83 percent of Republicans, 65 percent of independents and 37 percent of Democrats agree.\n52 percent say a president’s moral character is important and personally matters to them; 35 percent of Republicans, 47 percent of independents and 71 percent of Democrats agree.\n46 percent say President Trump’s personal life doesn’t matter “as long as he does a good job running the country”; 63 percent of Republicans, 51 percent of independents and 27 percent of Democrats.\n38 percent thing the past affairs should be relevant in judging a president; 16 percent of Republicans, 32 percent of independents and 61 percent of Democrats agree.\nSource: A CNN/SSRS poll of 1,016 U.S. adults conducted Feb. 20-23 and released Friday.\nFollow Jennifer Harper on Twitter @HarperBulletin", "url": "https://apnews.com/e1aaf87586166ea0ac5faedea9747ce4"}