{"authors": ["Deron Snyder The Washington Times"], "date_download": "2020-05-04 20:14:00", "date_modify": "2020-05-04 20:14:00", "date_publish": "2018-08-20 18:51:45", "description": "We're getting closer to that day. It will be accompanied by a chorus of howls. Fans will decry the development and declare the situation is out-of-order. Coaches around the country will...", "filename": "_5cb866889d522e3082a4211e2a4bf145_1588623240.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5cb866889d522e3082a4211e2a4bf145_1588623240.html", "title": "SNYDER: Amateur athletes have leverage", "title_page": "SNYDER: Amateur athletes have leverage", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "We’re getting closer to that day.\nIt will be accompanied by a chorus of howls. Fans will decry the development and declare the situation is out-of-order. Coaches around the country will survey the conditions and ponder their own fate. Administrators in high places will fret about financial repercussions and contemplate contingency plans.\nWhat about you? How will you react when an amateur team perhaps your favorite or alma mater decides to sit out rather than suit up? What will you think about the players who choose to take a stand rather than take the field?\nBefore long, imagining won’t be necessary.\nWe’ve already seen it a notch below college football’s highest level and it’s just a matter of time before it rises.\nIn October 2013, the Grambling State team boycotted two practice sessions leading to the dismissal of coach George Ragsdale and then refused to play its game against Jackson State. Players, upset about substandard facilities and unhealthy conditions, said they felt neglected and disrespected by the administration after coach Doug Williams was fired. Jackson State was set to celebrate homecoming and said the forfeit cost the school and the city millions of dollars.\nA similar action in the Football Bowl Subdivision was avoided in November 2015.\nDozens of University of Missouri players opted to cease all football-related activities until the school president was removed. They were disturbed by his slow response to complaints about the campus atmosphere, which included a swastika drawn with feces on a dormitory bathroom wall. Under pressure from players, a student’s hunger strike, and Republican state lawmakers, Tim Wolfe stepped down during an emergency meeting of the university’s Board of Curators.\nThe latest instance of athletes revolting occurred last week, 40 miles east of Atlanta at one of Georgia’s top high schools.\nPlayers from Grayson High ranked No. 1 in the state’s 7A division and No. 5 in USA Today’s national poll twice walked out of practice. They were protesting conditions they deemed as dangerous and overly physical, including full-contact practices in shorts and insufficient concern about hydration and heat exposure. According to the Gwinnett Daily Post, coach Christian Hunnicutt met with the team and sorted out their differences.\n“We addressed the issue with our players and our focus is preparing for our opener,” Hunnicutt told the newspaper Thursday.\nAddressing issues is ideal, but more often they’re ignored. The powers-that-be are unaffected and full of ignorant bliss, while everyone beneath them navigates troublesome conditions. Courage is required when speaking truth to power, pointing out what’s wrong and risking loss (financially and socially).\nSuch bravery has been lacking in recent years, especially the audacity to actually boycott a game. Grambling’s instance was a fine example, but it happened at the HBCU level, in the obscure Southwestern Athletic Conference.\nWe don’t know if a team from the big, bad Southeastern Conference, like Mizzou, has the nerve to forfeit. But we know San Jose State was prepared to do it in 1967.\nThe fight for civil rights had reached the university, where black students began to protest racism in housing, athletics and campus organizations. Members of the football team joined the cause and students decided to boycott the season-opening game at Texas-El Paso unless a list of nine demands to regarding campus racism were met.\nIt should be noted that some of UTEP’s black players expressed their solidarity and there was some question whether the contest could take place. San Jose State president Robert Clark decided to avoid confrontation and canceled the game drawing the ire of Gov. Ronald Reagan.\nThe New York Times said it was the first time a college football game was canceled “because of racial unrest.”\nAlthough they rarely exert their power, college athletes have a vested interest in their conditions. They have clear issues worth fighting for, whether it’s physical safety, campus climate or economic injustice NCAA basketball players have considered boycotting the Final Four, which generates billions while they get peanuts.\nProfessional athletes mount their battles through collectively-bargained agreements with management. Only when those fail do players resort to work stoppages ... if the owners don’t lock them out first.\nI notice the hordes of fans who continue to lose their minds over NFL players’ pre-game expressions of unity with the community. I can only imagine the apoplexy that would follow if student-athletes staged an action that canceled football’s national title game, or basketball’s men’s championship.\nThe last game in a season might be safe for now. But as more athletes flex their muscles and show displeasure when the status quo grows wearisome, we move closer to the point where a high-profile “game day” will be sacrificed.\nBrace for impact.\n⦁ Deron Snyder writes his column for The Washington Times on Tuesdays and Thursdays. Follow him on Twitter @DeronSnyder.", "url": "https://apnews.com/5cb866889d522e3082a4211e2a4bf145"}