{"authors": ["Jackie Crosby"], "date_download": "2020-05-04 20:16:19", "date_modify": "2020-05-04 20:16:19", "date_publish": "2018-05-25 11:29:24", "description": "A big push by the city of Winona to bring jobs and development to its historic riverfront just got a big boost from hometown employer Fastenal Co., which on Friday announced plans to build a new...", "filename": "_4d0d3fefc59e46dea71f0af4e4f23b63_1588623379.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4d0d3fefc59e46dea71f0af4e4f23b63_1588623379.html", "title": "Fastenal plans new office park to bring 400 jobs to downtown Winona", "title_page": "Fastenal plans new office park to bring 400 jobs to downtown Winona", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A big push by the city of Winona to bring jobs and development to its historic riverfront just got a big boost from hometown employer Fastenal Co., which on Friday announced plans to build a new office complex downtown.\nThe company, which manufacturers industrial and construction supplies, said the space will be designed for 400 to 600 new employees as the company grows. Construction is expected to begin in late 2019 or early 2020.\nFastenal’s president and chief executive, Dan Florness, said the company deliberately chose to support the multi-faceted revitalization of the Mississippi River waterfront area even though it had space on its existing campus.\nOther downtown projects include a $3 million dollar development of Levee Park, intended as a gateway to downtown, as well as several new housing projects, redevelopment of the Masonic Theater, and a proposed mixed-use project that could include a hotel.\n“Our challenge is to look at all of our operations, the people we need in the future, and the kinds of work space we need to keep Fastenal strong and positioned for future growth,” Florness said in a statement. “We realize we will need more and different space for the new jobs we expect to add in the future.”\nFastenal was founded in Winona in 1967 as a seller of nuts and bolts through custom vending machines. It now is a $4.4 billion public company with 21,000 employees across the world.\nFor this project, which will not replace its headquarters operation, Fastenal purchased six properties between the Mississippi River Bridge and Second Street.\nNo public money was used in the acquisition.\nCompany officials are in the early stages of planning, but said the new office space will be designed and planned to complement the historic nature of the downtown. The project will begin a public approval process in the coming months.\nWinona Mayor Mark Peterson said Fastenal’s decision to bring hundreds of new jobs downtown will contribute to existing revitalization efforts by helping draw new housing, restaurants and retail to the area.\nThe project is part of a public-private initiative created in 2015 to encourage and coordinate investment in downtown Winona by creating new jobs, housing and commercial activity.\nJackie Crosby • 612-673-7335", "url": "https://apnews.com/4d0d3fefc59e46dea71f0af4e4f23b63"}