{"authors": ["Plain Dealer Staff"], "date_download": "2020-05-04 20:10:01", "date_modify": "2020-05-04 20:10:01", "date_publish": "2018-11-27 23:29:40", "description": "Eugene Shelton, 92, was first African American to head steelworkers local CLEVELAND, Ohio – Eugene Shelton came to Cleveland from his native Alabama in 1950, seeking work for himself and a...", "filename": "_2df3e9216fc7402eaaf88600477aade6_1588623001.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2df3e9216fc7402eaaf88600477aade6_1588623001.html", "title": "Eugene Shelton, 92, was first African American to head steelworkers local", "title_page": "Eugene Shelton, 92, was first African American to head steelworkers local", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Eugene Shelton, 92, was first African American to head steelworkers local\nCLEVELAND, Ohio – Eugene Shelton came to Cleveland from his native Alabama in 1950, seeking work for himself and a better life for his wife and two children. He found both, becoming a millwright at Jones & Laughlin Steel Corp. and winning election in 1970 as the first African American president of the 2,400-member United Steelworkers Local 185.\nHe died at age 92 in Cleveland on Thanksgiving Day.\nShelton was noteworthy in the early ’70s as the only black president of a USW local in the area, but his leadership was not a racial matter. “I was elected president with the help of both black and white members” in a majority-white local, he told The Plain Dealer, after being urged to run by a white man from Alabama.\nWhen a black employee, a member of another local, charged J&L with racial discrimination in U.S District Court, Shelton explained that his local had nothing to do with the case. More importantly, his local had an active civil rights committee that dealt with such issues.\nWhen laid-off steelworkers were denied special unemployment benefits because a winter natural gas shortage was considered an act of God, Shelton fought back. The signing of a new contract was heralded for the job security it brought union members.\nHe is survived by his wife, Elizabeth, to whom he was married for 72 years, daughter Beverly Shelton Simmons, son Eugene Jr. and brothers O’Neal and Clifford.\nFuneral services will be at 11 a.m. Friday at St. James A.M.E. Church, 8301 Cedar Ave., where the family will receive friends at 10 a.m. The E.F. Boyd & Sons Funeral Home is handling arrangements.", "url": "https://apnews.com/2df3e9216fc7402eaaf88600477aade6"}