{"authors": ["Dug Begley"], "date_download": "2020-05-04 20:12:31", "date_modify": "2020-05-04 20:12:31", "date_publish": "2018-03-12 05:00:00", "description": "Sky-high penalties for jumping on state-controlled tollways are gone, but Houston-area officials worry cheaper late fees on some toll roads creates confusion. Ignoring a toll bill along...", "filename": "_b42a24c49a5848d29f8b558cc6a98843_1588623151.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b42a24c49a5848d29f8b558cc6a98843_1588623151.html", "title": "Toll fine changes bring confusion to Houston area", "title_page": "Toll fine changes bring confusion to Houston area", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sky-high penalties for jumping on state-controlled tollways are gone, but Houston-area officials worry cheaper late fees on some toll roads creates confusion.\nIgnoring a toll bill along county-controlled tollways can cost hundreds of dollars in late fees from a single toll of less than $2. New state rules have lowered those fees substantially, but only along tollways managed by the Texas Department of Transportation.\nThe change in the law was a welcome development.\n“It’s highway robbery, literally, for them to charge hundreds of dollars in fees,” said Robert McElheny, 55, of Cinco Ranch, a frequent user of the toll lanes.\nBut the difference between state and county toll roads are creating confusion. In the Houston area, the new lower state fees would only apply along the portion of the Grand Parkway developed by TxDOT. It would not apply to Harris County Toll Road Authority and other local systems.\nAt some point, however, those changes to the state rules might have a seismic effect on use of the managed lanes along Interstate 10 — which transportation officials said will start operating with a pay-by-mail feature at some unknown date in the future.\nThe upheaval, closely watched by toll road opponents, came when lawmakers enacted SB 312 — the sunset bill for the Texas Department of Transportation. The bill set new standards for late fees and pay-by-mail rules on tollways controlled by TxDOT.\n“It is an improved customer service by lowering the fees,” state toll operations director Rick Nelson told the Texas Transportation Commission in January.\nLawmakers sought to cap what they said were rampant run-ups on late fees and handling charges levied against drivers who used state tollways without a transponder, such as HCTRA’s EZ Tag or the state-issued TxTag.\nUnder the old structure, the mail-in costs of $1.15 for toll use escalated quickly once the bill was turned over to collections after three unpaid monthly statements. At that point, a single toll, for as little as 65 cents, could incur $25 in late fees and penalties. Those fees were tacked onto every transaction, meaning multiple fees for a single trip, if someone drove through more than one tolling point.\nIf collections were unsuccessful and the matter landed in court, a driver could pay up to $350 per transaction for violations. That led to some scofflaws owing exorbitantly high fees and charges of thousands of dollars.\nThe new system keeps penalties capped, and only assess late fees monthly, not for each transaction. The $4 monthly late fees and $1.15 mail-in fee for a transaction would total $17.25 when it was turned over to collections.\nThe maximum for late fees can only reach $48, plus the mailing fee and tolls, for a year.\nConfusion Likely\nLocal toll agencies are not affected by the new rules and continue to operate under their own standards. These agencies continue turning collections over to courts. HCTRA, which also offers no pay-by-mail option, uses collection firms and tacks hundreds of dollars onto delinquent bills when they end up in arrears or in front of a judge.\nCollections and fees in 2016 netted HCTRA about $28 million, officials said last year, a fraction of the $760 million in tolls collected during the year.\nDrivers routinely complain about billing errors or simple mistakes that end up with exorbitant fees, many the result of mailing notices to where vehicles are registered rather than where billing information for toll accounts is listed.\nHCTRA officials said strict rules govern their practices, and collections are a last resort for scofflaws who ignore previous statements, something they are obligated to do to preserve the rules voters approved when they created the agency.\nStill, HCTRA was the loudest opponent of changes to the state’s late fee system.\n“Uniformity in rules is important, especially at the local level where everyday drivers may use multiple systems,” HCTRA spokeswoman Roxana Sibrian said.\nState lawmakers dismissed HCTRA’s concerns, noting their changes only applied to state-run roads. As the new rules took effect March 1, TxDOT officials said pay-by-mail options would only apply to five roads statewide, including the Grand Parkway.\nThat declaration, however, also comes with a caveat: The late fee and pay-by-mail option only applies to the portion of the Grand Parkway from I-10 in Katy to Interstate 69 near Kingwood — as the portion south of I-10 is free to the Westpark Tollway, and the segment south of the Westpark is controlled by the Fort Bend County Toll Road Authority. Fort Bend officials do not allow pay by mail.\nThat confusion is likely to again draw the focus of lawmakers in 2019, perhaps with rules covering all toll agencies, said Rep. Joe Pickett, D-El Paso.\n“I do think the driving public deserves a seamless approach,” Pickett said.\nPickett, a skeptic of some toll projects and the state’s one-time over-reliance on tolls to build highways, said he expects legislators to file bills not only curbing the late fees but that TxDOT’s rules might not be the preferred starting point.\n“We don’t know whether that is the right dollar amount,” Pickett said. “We’ll see.”\nHe said it was unlikely anyone would solve the scofflaw problem entirely, offering advice to all users of Texas tolls, if they want to avoid fees altogether.\n“Pay your bills,” he said.\nPay-by-Mail Waiting on Swap\nFor Houston-area drivers, the biggest change might be the one to come, though officials cannot say when. With state ownership of the Katy Managed Lanes along the center of Interstate 10, drivers will be able to hop into them and then be billed later by the state.\n“If and when we assume control of those, they would be subject to the new fee structure,” TxDOT spokeswoman Veronica Beyer confirmed.\nThe I-10 managed lanes, owned by HCTRA, are part of a complex reshuffling between county and state transportation officials. To resolve a dispute regarding the construction of U.S. 290 — expected to finish later this year — HCTRA has agreed to turn the lanes over to the state, in lieu of $200 million county officials pledged for the U.S. 290 project.\nFinalizing of the deal is hung up in legal wrangling between the two sides, related to the county’s use of toll funds to build the lanes.\nI-10 is not the only toll road in the region awaiting pay-by-mail as an option. A planned tollway along Texas 288 would also follow the state’s rules, along with TxDOT’s portion of a tollway along Texas 249 in Montgomery County and Grimes County.\nThe Texas 249 tollway, meanwhile, would use HCTRA rules inside Harris County. Montgomery County — where toll roads recently were a hot election topic in the county judge race — is planning a portion of the tollway from Harris County to Pinehurst. County toll officials would set policies for that segment, unless state lawmakers intervene.\ndug.begley@chron.com\ntwitter.com/DugBegley", "url": "https://apnews.com/b42a24c49a5848d29f8b558cc6a98843"}