{"authors": ["Sentinel"], "date_download": "2020-05-04 20:12:19", "date_modify": "2020-05-04 20:12:19", "date_publish": "2018-07-08 10:53:39", "description": "Last night, Steve considered getting a second air conditioner to help cool us off as we worked to complete our kitchen, but as fate would have it, it wouldn't have fit in our old convertible. It...", "filename": "_2ec72d9da94b4219921425f3b7fdd753_1588623139.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2ec72d9da94b4219921425f3b7fdd753_1588623139.html", "title": "As Temps Rise, She'll Take Her Coffee in the Rain", "title_page": "As Temps Rise, She'll Take Her Coffee in the Rain", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Last night, Steve considered getting a second air conditioner to help cool us off as we worked to complete our kitchen, but as fate would have it, it wouldn’t have fit in our old convertible. It would have to wait. God knows we’ve had more than a few days working in the chalky mess and toiling through the heat as we finish tiling our kitchen. It’s slow-going because we are doing it ourselves and especially slow with all the intricate cuts and tiny mosaics.\nAfter we’d gone to bed, a cloudburst happened as we slept off yet another hot night. As if in answer, the rain tumbled downward over the noisy bedroom air conditioner and the oscillating fan, as if Zeus himself had come to the rescue. The rain must’ve met the asphalt drive with a steaming hiss while we slumbered under our covers, greeted the hot roof valley above us, laughed open-mouthed as the roof valley seemed to cup its hands in welcome relief sending linns cascading off the eaves of our cave-like house and streamed into wet strings outside our windows. Rain tripped off the dusty porch steps, danced off the red maple whose dry leaves in the dooryard must have applauded nature’s opening day in standing ovation. Delicious droplets ran in beads from leaf tip to parched blades, the grass tippling happily in the gray light.\nI slept soundly. I never heard Steve as he filled the filter with fresh grounds and poured clean water into the pot. He tells me lately I sound like a “new little bird” and the chickens my dad used to keep in our Pepperell neighborhood when I was a child come to mind. Rhode Island Reds perched like feathery balls, air breezing in and out of their beaks in low, soft tones. I can’t believe that I snore now, but I will take his word. Age.\nIt was the rain that finally roused me, tapping fervently on the vented back of the rattling General Electric AC. Rain! Sure enough, it was plummeting through the air in tassels of silver-wet and promising relief.\nWhat a lovely sight -- all that water. It’d seemed for days, in the week-long heat wave, that the sky promised to open up and pour forth its life, water the garden, the fields, the woods, and bless the mountains to our north, but leaves hung in limp disappointment. Streambeds were dried up for weeks now, rivers seemed rockier and lower. Teasing off and on, a drop or two would squeeze out after a distant rumble, and I’d make my way outside and lift my face expectantly, only to receive a flicker of evening breeze which was tepid at best.\nThis morning the rain is all promise and grace, a break from the persistent heat. Steve checks weather as he always does and assures me it will at least stay until noon. The rain’s falling and I waste no time as I convince him to take our coffee out onto the open deck. I am compelled to be outside and in it. The saying, “they don’t know enough to come in out of the rain” comes briefly to mind and washes away just as quickly. I don’t care if it looks silly standing in the rain drinking my coffee.\nTo the north, the mountain is obscured by a spate of slate so thick it extends in a giant swath, west to east, and north to south. The sky meets the pinetops in aquarelle pillows. From the puddled deck and with cup in hand, I descend gingerly two steps down onto the stone terrace to feel more under the care of the open sky. Steve is by my side and drops plummet and land in our coffee causing minuscule teardrops of rain and coffee which arc airborne clearing the ceramic rims. Steve satisfied, settles into his Adirondack before me, pajamas, puddles and all. Hesitant, I tip my chair forward to let the water pool temporarily at my bare feet, and then I ease into the sloping seat which feels cool and familiarly comforting. The day before, it was so hot, I had lain on the kitchen floor after painting the kitchen ceiling.\n“Dogs have the right idea,” I say, as Steve slops white grout onto the wall which meets the countertop.\nTo beat the heat I hosed off three times in my T-shirt, shorts and Crocs, in between tasks to try and assuage the heat which had enveloped everything, even the humming industrial fan blowing at us couldn’t escape it’s hot breadth.\nOn the deck this cool morning, in the rain, a chuckle bubbles up as I imagine myself a picked red pepper or a head of lettuce being misted in a grocery store bin. Rivulets and tiny lakes pool on my thighs and forearms. Steve holds his mug at an angle so his brew stays in and the raindrops stay out. Content and happy, we sip. It feels good to let go without a care for a few minutes, and the rain seems to bless us in this quiet and somewhat rebellious act.\nWhat sweet, wet heaven!\nI ask Steve if he remembers us as teens swimming in the rain at Healds Pond or tubing down the Squannacook after a storm, or wading into that huge neighborhood puddle which swelled back in our hometown after a summer rainstorm. He does. We called up the image of a pond-sized aquifer where three streets met at the bottom of a big hill in the neighborhood where I grew up. The storm drain had been so inundated by the deluge it couldn’t keep up and all the neighborhood kids were splashing through it on foot, some on bikes, and having such a blast.\nAnd, here we are, drinking coffee, being spritzed like produce in our summer pajamas in the middle of the rain thinking about fun times from our youth.\nSo what prompted us to sit in the rain? Was there something more than cooling off which beckoned? Certainly, the feelings welling were pleasant. I can tell you that water, whether it’s a shower, a dash through a sprinkler, a dip in a pool, a plunge in a river, a swim in a lake, or a dive into a wave, it all seems to wash away the residual from the day which can weigh on you, whether it be physical or mental or both, and to bathe in such liquid gives us a fresh start for the next moment to come.\nWeather is an interesting phenomena when it comes to our psyche. One study found that prospective students visiting colleges on cloudy days were more apt to enroll and people’s cognitive awareness rose on rainy days. Whatever the link, I am happy for the memories and already looking forward to washing vegetables for the ones I love in a finished kitchen. Meanwhile, I’ll take my coffee in the rain.\nBonnie J. Toomey teaches at Plymouth State University, writes about writing, learning, and life in the 21st century. You can follow Parent Forward on Twitter @bonniejtoomey. Learn more at www.parentforward.blogspot.com or visit bonniejtoomey.com", "url": "https://apnews.com/2ec72d9da94b4219921425f3b7fdd753"}