{"authors": ["Carisa Cegavske"], "date_download": "2020-05-04 20:11:23", "date_modify": "2020-05-04 20:11:23", "date_publish": "2018-05-30 14:00:00", "description": "U.S. Sen. Jeff Merkley said the Republican-led Senate focused on all the wrong things in 2017, prioritizing what people in power want over the needs of the working class. Merkley, D-Oregon,...", "filename": "_fee6dd0e44824321ae49c9f85c701a77_1588623083.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fee6dd0e44824321ae49c9f85c701a77_1588623083.html", "title": "Merkley says Senate needs to prioritize working families at town hall meeting in Elkton", "title_page": "Merkley says Senate needs to prioritize working families at town hall meeting in Elkton", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "U.S. Sen. Jeff Merkley said the Republican-led Senate focused on all the wrong things in 2017, prioritizing what people in power want over the needs of the working class.\nMerkley, D-Oregon, made his comments at a town hall in Elkton Tuesday, and at a meeting with The News-Review Editorial Board in Roseburg beforehand.\nMerkley was vague when asked by The News-Review whether he might make a run at the presidency in 2020. He said he’s exploring his options.\nHe believes a Blue Wave will likely restore a Democratic majority in the House in the November election, but was less certain the same would be true in the Senate, where 26 of the 35 seats up for election are already held by Democrats.\n“Every where I go I see folks disgusted with the degradation of the office of the presidency, and very concerned about this government by and for the powerful rather than for the people. We need to push back and reclaim policy that will help ordinary families do better,” Merkley told the editorial board.\nAt the town hall, Merkley spoke to about 150 people, taking questions on a variety of topics, from climate change to trade with China.\nElkton High School Senior Brad Meador said people his age voted for Bernie Sanders. He wanted to know what steps Merkley would take to advance a progressive agenda that could win back youth support for the Democratic party.\n“Some of you may be happy to hear, and others of you may be unhappy to hear that I’m the only senator who endorsed Bernie Sanders,” Merkley answered.\nHe said he did that because of Sanders’ focus on things that would enable families to thrive—affordable housing and health care, living wage jobs and education.\n“Those things are being terribly neglected right now,” he said.\nMerkley said the institutions of Democracy are being corrupted. Last year, for example, he said the Senate only considered three basic issues, and senators weren’t allowed to bring up amendments to bills, except in the budget process.\n“That’s not the U.S. Senate, the Senate considered hundreds of amendments per year in the past, but zero last year,” he said.\nIn 2017, many senators tried to eliminate health care for between 22 and 30 million Americans, and the Senate passed a tax bill that borrows $1.5 trillion and mostly benefits the richest Americans, Merkley said.\nThe third issue involved what Merkley called the “theft” of a Supreme Court seat. In 2016, the Senate refused to debate and vote on then-President Barack Obama’s Supreme Court nominee. Instead, the senators waited until 2017 and voted on President Donald Trump’s nominee.\nThat’s never happened before in the history of the Senate, Merkley said.\nMerkley wants America to convert to 100 percent renewable energy by 2050 and pursue a Keep it in the Ground policy to end new coal and oil extraction leases on public land. He said Oregonians are feeling the impacts of climate change already.\n“The pine beetles are doing very well with warmer winters, and our trees are doing poorly. The forest fires are doing very well, and our forests not so well as a result,” he said. He said Oregon oyster growers have to artificially change seawater acidity because the Pacific Ocean “has become so acidic that it kills the baby oysters, which we’ve never had in human history before.”\nOn trade, Merkley said American companies following minimum wage laws and environmental standards can be pushed out of business when they compete against companies in countries like China, which aren’t following the same rules. Merkley has introduced legislation to require trade agreements mandate basic wage and sustainability standards.\n“China today is not recognizable from China 20 years ago. They have bullet trains spreading across the entire country. How many bullet trains does America have? They have new metro systems in city after city. How many new metro systems are there in the United States? They are eating our lunch,” Merkley said.\nMerkley also sounded an alarm about a move by some senators to give the president the power to declare war, with no sunset. Merkley said that would be a complete inversion of the duty the Founding Fathers gave Congress in the Constitution. He said he’s pushing an alternative plan including a sunset period on the authority given to the president, and requiring the president to obtain congressional approval to wage war in any country outside of Iraq or Afghanistan.\nIn his meeting with the editorial board, Merkley said the calls he’s received suggest his constituents are 99 to 1 in favor of net neutrality. He said it’s a critical issue for small businesses, which can’t compete with larger businesses if their web pages load too slowly. He said he was glad the Senate voted in favor of net neutrality, and he hopes the House follows suit.\nHe also spoke about his fight to get Oregon farmers’ priorities into the Farm Bill, and his push for more collaborative groups involving both timber industry and environmental leaders in decisions about how to thin the federal forests.\n“If we can expand that model, I think it can be one of the best antidotes to the timber wars of the past,” he said.\nMerkley was born in Myrtle Creek, the son of a millwright who worked in a Riddle lumber mill. The family later relocated to Multnomah County.", "url": "https://apnews.com/fee6dd0e44824321ae49c9f85c701a77"}