{"authors": ["David Louis Today S News-Herald"], "date_download": "2020-05-04 20:09:34", "date_modify": "2020-05-04 20:09:34", "date_publish": "2018-03-27 06:20:00", "description": "Mohave County plans to pay off a loan secured for construction of the Mohave County Adult Detention Center. Financed in 2008, construction on the $71.5 million facility was paid for through...", "filename": "_a69b0aa7dd7a4d8fa786e6c7da373568_1588622974.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a69b0aa7dd7a4d8fa786e6c7da373568_1588622974.html", "title": "Mohave County Jail construction paid off 2 years early", "title_page": "Mohave County Jail construction paid off 2 years early", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mohave County plans to pay off a loan secured for construction of the Mohave County Adult Detention Center.\nFinanced in 2008, construction on the $71.5 million facility was paid for through a $46 million lease-to-own debt service agreement and $25 million in county contributions.\nMohave County was able to retire its debt from reserves from the one-quarter cent capital projects fund. The remaining principal balance of nearly $13.5 million will be paid in early April.\nThis is the first year the county had the opportunity to pay off the loan, so it jumped at the chance, said County Manager Michael Hendrix. The action to pay off the loan two years early will save the county $582,000 in interest payments, he said.\n“It’s just good business sense to pay this off and save the interest,” Hendrix said “But there are pros and cons.”\nThe biggest con, Hendrix said, is that once the debt is resolved, the county will be responsible for ongoing facility maintenance, repair and replacement costs, which runs $800,000 annually.\nCurrently, maintenance is outsourced and paid for through the one-quarter cent sales tax. By paying the jail off early, the county – beginning in 2019 – will become responsible for the jail’s upkeep.\nCoral Loyd, Mohave County director of financial services, said there are two viable options for paying for the jail’s maintenance.\n“We’ve been talking about this for several years,” Loyd said. “The options are for another sales tax, which would require a unanimous board vote or a 5-cent increase in property tax that only requires three board members to support.”\nUntil the one-quarter cent sales tax ends in December 2019, the funds generated will help pay for construction of the Mohave County Law and Justice Center in Kingman.\nSupervisor Buster Johnson supported paying off the debt to benefit the courthouse.\n“As I’ve pointed out before, we could not have paid the jail off, but that would have affected construction on the courthouse,” Johnson said. “I am guessing we spend more than $1 million a year on the jail, so with the two-year savings in paying it off early, that’s more than $2 million that can go to the courthouse.”", "url": "https://apnews.com/a69b0aa7dd7a4d8fa786e6c7da373568"}