{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:21:46", "date_modify": "2020-05-04 20:21:46", "date_publish": "2018-05-08 16:59:00", "description": "STEM programs and project-based learning in the Watertown Unified School District are reshaping curriculum at Lincoln Elementary and Douglas Elementary schools, reports the Watertown branch of the...", "filename": "_e9802a03ed1b4695bfef77010eee1ac2_1588623706.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e9802a03ed1b4695bfef77010eee1ac2_1588623706.html", "title": "AAUW members visit local elementary schools", "title_page": "AAUW members visit local elementary schools", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STEM programs and project-based learning in the Watertown Unified School District are reshaping curriculum at Lincoln Elementary and Douglas Elementary schools, reports the Watertown branch of the American Association of University Women.\nOn April 26, members of AAUW-Watertown toured Lincoln and Douglas to see these programs in action.\nKayla Wendt, dean of students at Lincoln, along with students Rudee Kinsman and Autumn Smith shared how changes have been made in the curriculum with a STEM -- science, technology, engineering and math -- approach. The AAUW learned that classrooms are multi-age, with kindergarten and first grade and second and third grades sharing classrooms. Classrooms have an average size of 21 students.\nBlocks of time are allotted for reading/language arts and math. Students move around the classrooms to centers that include the use of iPads. Computer programming is learned with a program called Scratch Jr. Students demonstrated using this program to create games.\nWhile visiting the music room, the students were moving to centers to practice the music concepts they had been learning. In the media center, the students utilized LEGOs to build using engineering skills.\nStudents at Lincoln are working with Courtney Gonnering on social and emotional skills. A grant through the Greater Watertown Community Health Foundation has financed this program. Students work with Gonnering to learn appropriate socialization skills. Each day they practice their new skills on the playground.\nStudents were practicing for their showcase, which was held Thursday. Members were treated to sessions as students practiced for this event.\nDouglas School Principal Emily Lessner explained how project-based learning is infused into the curriculum of the school. Students in third, fourth and fifth grades were practicing for the Douglas Showcase Spectacular that was held April 26.\nStudents welcomed AAUW members into their classroom to explain their projects. Third-grade students were showcasing designing and creating amusement parks, fourth-graders discovered various cultures around the world, and fifth-graders were “supercharging their learning” by creating interactive projects based on topics they have studied throughout the year.\nFollowing the tour, members held a meeting in the media center.\nOn May 17, the AAUW will meet at 7 p.m. at Madison College in Watertown to present the 2018 high school and continuing education scholarships.\nFor more information on the AAUW or to join, contact membership chair Karen Wzorek at wzorek50@icloud.com.", "url": "https://apnews.com/e9802a03ed1b4695bfef77010eee1ac2"}