{"authors": ["Jina Moore"], "date_download": "2020-05-04 20:13:42", "date_modify": "2020-05-04 20:13:42", "date_publish": "2018-04-07 04:00:00", "description": "A dispute between the speaker of the Somali Parliament and the country’s president briefly threatened on Wednesday to turn violent, the latest development in a complex controversy over the...", "filename": "_6ea79738544d455da558f6a4043548bb_1588623222.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6ea79738544d455da558f6a4043548bb_1588623222.html", "title": "Crisis averted in Somalia’s Parliament but tensions simmer", "title_page": "Crisis averted in Somalia’s Parliament but tensions simmer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A dispute between the speaker of the Somali Parliament and the country’s president briefly threatened on Wednesday to turn violent, the latest development in a complex controversy over the proposed leasing of a major port to a company controlled by the United Arab Emirates.\nConflict was avoided, partly because of the efforts of an African Union soldier, but the dispute also highlighted the fragility of the federal government under the leadership of its new president, Mohamed Abdullahi Mohamed, known by the nickname Farmajo, who was elected last year in a process marred by corruption.\nMohamed leads a weak federal government that is trying to wield power and influence over six states, while al-Shabab, an offshoot of al-Qaida, regularly challenges its rule with acts of terrorism.\nLast year, Somaliland, a stable and semiautonomous region in the country’s north, signed a deal with DP World, a port management company based in the UAE, to operate the port of Berbera.\nSomaliland considers itself an independent country and Somaliland officials negotiated the deal directly with DP World.\nBut lawmakers in Mogadishu, Somalia’s capital, objected, saying that bypassing federal officials violated the sovereignty of Somalia.\nIn March, Parliament voted unanimously to cancel the deal, in a motion that the speaker, Mohamed Osman Jawari, presided over.\nThe bill, which included language that forbids any foreign investment contracts without approval by the Parliament, was put forward without input from the president or prime minister. Observers said the vote was a sign of the growing political strength of Jawari.\nAllies of the president and the prime minister put forward a no-confidence motion against Jawari, which has twice been delayed for security reasons. On Wednesday, Jawari’s backers accused opponents of having accepted money to vote against the speaker. “Down with bribe takers!” they chanted.\nParliamentary police officers loyal to Jawari lined up to protect the speaker’s podium.\nIn response, state security forces loyal to the president deployed outside Parliament, raising fears that tensions between the two men could lead to violence.\nSoldiers from Danab, a Somali special forces contingent trained by the United States, were also deployed to secure the Parliament.\nThe standoff ended after Paul Lokech, who leads a Ugandan contingent of the African Union peacekeeping force in Somalia, brokered a deal between Jawari and Mohamed to talk through the dispute.\n“They need to dialogue and get their problems sorted out,” Lokech said in a telephone interview. “That’s what we agreed upon.”\nThe port deal is one illustration of the growing disruption that an international dispute has created in domestic Somali politics.\nThat rift has pitted Saudi Arabia and the United Arab Emirates, which are major trading partners with Somalia, against Qatar, whose financial support was widely seen as a critical factor in Mohamed’s victory in last year’s presidential election.\nThe vote against the DP World deal further strained relations between Somalia and the UAE, which wants to see Mohamed distance himself from his Qatari patrons and their allies.\n“The Emiratis are waging a campaign against Farmajo,” said Joshua Meservey, a senior policy analyst on Africa and the Middle East at the Heritage Foundation. “Farmajo has refused to join an embargo against Qatar and that has really angered the Saudis and the Emiratis. They just don’t think Farmajo is playing ball as he should.”\n— (The New York Times)", "url": "https://apnews.com/6ea79738544d455da558f6a4043548bb"}