{"authors": ["Mila Koumpilova"], "date_download": "2020-05-04 20:03:58", "date_modify": "2020-05-04 20:03:58", "date_publish": "2018-01-26 18:54:41", "description": "Ana Blee, a Hopkins recipient of an Obama-era deportation reprieve for young immigrants, finds herself in double limbo. She is waiting to learn if the government will sign off on an...", "filename": "_00a76ee9ae894c4d8002219e0bc1b205_1588622638.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_00a76ee9ae894c4d8002219e0bc1b205_1588622638.html", "title": "After shutdown, Minnesota DACA recipients lobby, scramble to renew their permits", "title_page": "After shutdown, Minnesota DACA recipients lobby, scramble to renew their permits", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ana Blee, a Hopkins recipient of an Obama-era deportation reprieve for young immigrants, finds herself in double limbo.\nShe is waiting to learn if the government will sign off on an application to renew her Deferred Action for Childhood Arrivals, or DACA, which she scrambled to file after a court this month temporarily blocked plans to end the program. After a government shutdown ended Monday without a deal on DACA, she is also watching what Congress might do in the coming weeks.\nMinnesota immigrant advocates are rallying to keep up pressure on the states congressional delegation to extend protections for DACA recipients, known as Dreamers, including about 6,300 in the state. Some have lashed out angrily at Minnesota Democrats for backing a compromise to fund the government through Feb. 8 after a shutdown brought on largely by disagreement over immigration issues.\nBut lawmakers are also hearing from residents urging them not to grant concessions on DACA, at least not without ensuring border security investments, cuts to legal immigration and other measures. The Trump administration released a proposal Thursday that includes a path to citizenship for 1.8 million young immigrants, $25 billion for border security, new limits to family immigration and other changes.\nMeanwhile, a local volunteer effort has raised thousands of dollars for DACA renewal fees after a California judge ordered the administration to resume accepting such applications in a lawsuit by Minnesotas attorney general and others. Blee, whose fee was covered by that fund, says she feels a blend of hope and anxiety.\nIf I lose DACA, I lose everything, she said. I lose my job, the stability, the health insurance from my job.\nSince the Trump administration announced it would wind down the program for immigrants who came to the United States illegally as children, Minnesota DACA recipients and activists have lobbied to find a legislative fix.\nNavigate MN, a local advocacy group for young immigrants, called the vote to reopen the federal government without a DACA deal an outrage. In a news release singling out Democratic senators Amy Klobuchar and Tina Smith, the advocacy group MoveOn.org called the vote a shocking display of cowardice. Advocates argue that although most two-year DACA work permits are slated to start expiring after March 5, thousands of Dreamers who did not renew these permits by an October deadline have already lost their status and need swift congressional action.\nSmith and Klobuchar, one of the senators who negotiated the agreement to end the shutdown, have heralded it as a win for bipartisanship. They have noted that it secured six years of funding for the Childrens Health Insurance Program, which lapsed last year.\nIn a letter to backers, the nonprofit Immigrant Law Center of Minnesota asked them to keep calling lawmakers in support of legislation opening a path to citizenship for DACA recipients, invoking opinion polls that suggest broad public support.\nThis disaster is made by politicians, and it can be reversed by political action, Executive Director John Keller said.\nLinda Huhn, a Twin Cities member of NumbersUSA, an influential national group that advocates for reducing immigration, said Klobuchar and other lawmakers will be hearing from her as well.\nOur government shutting down because people brought their kids here illegally? It never should have happened, Huhn said. I felt angry and dismayed by our elected officials.\nShe said she favors legislation that would allow DACA recipients to stay and work in the United States. But she opposes granting any concessions to their parents. She also believes a DACA fix should be part of a larger package that curtails family-based immigration what critics call chain migration and mandates that employers use E-Verify, a now-voluntary system for ensuring new hires are allowed to work in the United States.\nBlee, the Hopkins DACA recipient, says she is disappointed congressional agreement on DACA remains elusive and grateful the issue is still in play on Capitol Hill. Blee, who came from Mexico with her family at age 14, says the program allowed her to land a better-paying, more stable job at a west metro transportation company after years of restaurant gigs. As the single mom of an 8-year-old U.S. citizen, she hopes to make her way back to college after dropping out amid financial challenges before DACA came along. For now, she said, We are still in limbo.\nBlee, who has become a news junkie amid the uncertainty, found out this month that a California judge had ordered the government to start accepting renewal DACA applications again until the court rules on the merits of a lawsuit by four states and other parties. Several days later, United States Citizenship and Immigration Services (USCIS), the agency that processes immigration applications, said it would accept DACA renewal requests. The Trump administration, meanwhile, has asked the U.S. Supreme Court to lift the federal court injunction.\nBlee asked her immigration attorney, Kara Lynum: Could she apply to renew her work permit, which expires in August? Should she?\nLynum and other Twin Cities lawyers have fielded many such inquiries in the past two weeks. The Immigrant Law Center, which has filed thousands of DACA applications since the program began in 2012, got more than 30 calls within hours of opening a hot line for DACA recipients after the USCIS announcement, Keller said.\nUSCIS advises DACA recipients to file for renewal 120 to 150 days before their permits expire and warns that applications received earlier might be rejected. Blee decided to take a chance and put in an application last week, unsure of how long the window to reapply might remain open. Then, she found out her $495 application fee would be covered out of more than $23,000 raised so far in a social media push that began after Lynum appeared on Minnesota Public Radio last week.\nI was really relieved, Blee said. Its hard to come up with this money on a short notice.\nMeanwhile, the Supreme Court said it would decide whether to take on the DACA case on Feb. 16. Lynum said that gives DACA recipients worried about an abrupt end to renewals at least three more weeks.\nWe know we dont have to keep scrambling like a mad dash to get these applications out the door, she said.\nMila Koumpilova 612-673-4781", "url": "https://apnews.com/00a76ee9ae894c4d8002219e0bc1b205"}