{"authors": ["Randy Johnson"], "date_download": "2020-05-04 20:12:12", "date_modify": "2020-05-04 20:12:12", "date_publish": "2018-03-24 22:06:00", "description": "Who will replace Don Lucia? And what kind of job will that person be accepting? The first decision rests with Minnesota athletic director Mark Coyle and his lieutenant, Tom McGinnis, the...", "filename": "_233a4ff5beb84feabfe9ef91461b21c0_1588623132.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_233a4ff5beb84feabfe9ef91461b21c0_1588623132.html", "title": "How the Gophers hockey job Don Lucia left behind has changed dramatically", "title_page": "How the Gophers hockey job Don Lucia left behind has changed dramatically", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Who will replace Don Lucia? And what kind of job will that person be accepting?\nThe first decision rests with Minnesota athletic director Mark Coyle and his lieutenant, Tom McGinnis, the senior associate AD who oversees mens hockey. Coyle on Tuesday, after listening to Lucia reflect on 19 years at the helm, spoke in general terms about the qualities he wants in someone replacing his retiring coach.\nAny AD would tell you that you always have a list of coaches youre interested in, and I wont put a number on that. Weve started to identify some people, and well be moving forward in the process, he said. We want to find the best fit for Minnesota, somebody who understands what this program means. This program in a lot of ways is the heartbeat of the state, and we need somebody whos going to embrace that and understand that.\nCoyle wouldnt say if the coach would have to have university ties, but he indicated the job and its demands arent for everyone.\nWhen I left [Minnesota] in 2005 and worked at Kentucky, I learned a very valuable lesson, he said. When Coach [Tubby] Smith left to come up here, being a young administrator, you think anybody wants that head-coaching job. But you learn real quick that theres only a handful of people who can take that job. Minnesota hockey is like Kentucky basketball.\nFour possibilities with U ties\nLucia wouldnt give a recommendation on who should succeed him, but he did credit associate head coach Mike Guentzel, a former Gophers player, for his 16 years on staff. You are Gopher hockey, Lucia said while thanking Guentzel.\nGuentzel, 55, could have the support of influential boosters who want an M man to get the job. Lucia, a Notre Dame graduate, knows how important those ties can be.\nI took a lot of grief because I wasnt an alum, Lucia said. I know [Guentzel] would do a great job. Im sure theyre looking at some others.\nOne might be 65 miles to the northwest. St. Cloud State coach Bob Motzko, a former Gophers assistant, had the Huskies as the No. 1 overall seed in the NCAA tournament, but they lost 4-1 to No. 16 seed Air Force in the West Regional semifinals Friday. Motzko declined to comment Thursday on the Gophers job.\nAnother might be 80 miles to the southwest. Minnesota State Mankato coach Mike Hastings, also a former Gophers assistant, led the Mavericks to the WCHA regular-season title and they were the No. 2 seed in the West Regional. But his team also lost Friday, 3-2 in overtime to Minnesota Duluth. Hastings declined to comment on the opening as well.\nIn his last high-profile hire, Coyle went with a young and up-and-coming coach in 36-year-old P.J. Fleck for the football program. If the AD takes that path again, a candidate could be Grant Potulny, the 38-year-old, first-year Northern Michigan coach who was a three-year captain and eight-year assistant for the Gophers.\nRolling with the changes\nThe new Gophers coach will be facing plenty of challenges. This is not the same job it was in 1999, when Lucia arrived from Colorado College.\nIn the changing landscape of college hockey, parity has taken over, especially in the Big Ten. Notre Dame and Ohio State both earned No. 1 NCAA seeds, and Michigan and Penn State also made the field while the Gophers stayed home. The Fighting Irish on Saturday advanced to the Frozen Four, and the Buckeyes and Wolverines play in separate regional finals on Sunday, so both could advance to St. Paul. The Nittany Lions lost to Denver.\nThe Gophers move to the Big Ten has not been popular with the fan base, which enjoyed the weekly regional rivalries of the WCHA. Attendance at 3M Arena at Mariucci has suffered, with an announced average of 8,724 this season and a couple thousand fewer actually attending games.\nI know theres been angst about switching to the Big Ten, but at this point our fans have embrace it for the good of the program, he said. The Big Ten today is an outstanding conference.\nParity crashed the NCAA tournament party immediately Friday. When Air Force beat St. Cloud State, it marked the 13th consecutive year that a No. 4 seed has ousted a No. 1 seed. Falcons coach Frank Serratore had advice to those who believe Minnesota can just show up and win big.\nTake the Gophers and the unrealistic expectations, thinking that the Gophers can come out and roll over everybody, he said Friday. Those days are over, theyre done.\nLucia, whose new role as a special assistant to Coyle will focus on hockey fundraising, stressed the need for unity more than anything at Minnesota on his way out.\nFor this program to be where it needs to be, the alumni have to be lock-step behind the program, he said. Thats absolutely critical. The fans have to pack the building. We need to get back to that, and if we do, then Gopher hockey is where we want it and expect it to be.", "url": "https://apnews.com/233a4ff5beb84feabfe9ef91461b21c0"}