{"authors": ["Evan Macdonald"], "date_download": "2020-05-04 20:20:16", "date_modify": "2020-05-04 20:20:16", "date_publish": "2018-08-02 16:36:00", "description": "Cleveland man charged in stabbing that led to standoff in Hough neighborhood CLEVELAND, Ohio -- A Cleveland man is charged in connection with a stabbing that led to a standoff Tuesday in the...", "filename": "_d1ffc0e14e084060a6ad7df13fad8fd2_1588623616.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d1ffc0e14e084060a6ad7df13fad8fd2_1588623616.html", "title": "Cleveland man charged in stabbing that led to standoff in Hough neighborhood", "title_page": "Cleveland man charged in stabbing that led to standoff in Hough neighborhood", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cleveland man charged in stabbing that led to standoff in Hough neighborhood\nCleveland man charged in stabbing that led to standoff in Hough neighborhood\nCLEVELAND, Ohio -- A Cleveland man is charged in connection with a stabbing that led to a standoff Tuesday in the city’s Hough neighborhood.\nDeante Benjamin, 38, is charged with felonious assault in the stabbing at a home on Addison Road near East 79th Street, according to court records.\nHe is accused of stabbing a 28-year-old woman under her left arm, according to a police report. Cleveland EMS took the woman to University Hospitals for treatment.\nA University Hospitals spokesman said Wednesday afternoon that the woman was not listed in the hospital’s census, so he could not provide an update on her condition.\nBenjamin’s sister called 911 on Tuesday to report that he stabbed the woman, and was holding the woman and a child at knifepoint, the police report says.\nOfficers arrived about 3 p.m. and learned Benjamin jumped out a bedroom window and ran from the home. They found him in some brush on Decker Avenue near Addison Road.\nCleveland police officers shot him with a beanbag round in an attempt to take him into custody, but it was ineffective, police said. Negotiators convinced Benjamin to surrender following an hour-long standoff.\nBenjamin had a pocket knife when officers arrested him. Officers also found a second knife stuck in the ground in the area, the police report says.\nCleveland EMS took him to a hospital to be treated for bruises caused by the beanbag round, police said. He was released later Tuesday and taken to the Cuyahoga County Jail.\nBenjamin requested a preliminary hearing during his arraignment Thursday in Cleveland Municipal Court, records say.\nTo comment on this story, visit Thursday’s crime and courts comments page.", "url": "https://apnews.com/d1ffc0e14e084060a6ad7df13fad8fd2"}