{"authors": ["Kevin Wilson"], "date_download": "2020-05-04 20:27:38", "date_modify": "2020-05-04 20:27:38", "date_publish": "2018-09-07 16:00:00", "description": "POYNETTE — Despite being the defending Division 3 state champions with four of five scorers returning, Dodgeland’s girls cross country team was not ranked in the state’s first cross country...", "filename": "_13a394f50407419fa017341c0d49fd8b_1588624058.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_13a394f50407419fa017341c0d49fd8b_1588624058.html", "title": "Cross country: Dodgeland girls serve notice, win small division at Poynette", "title_page": "Cross country: Dodgeland girls serve notice, win small division at Poynette", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "POYNETTE — Despite being the defending Division 3 state champions with four of five scorers returning, Dodgeland’s girls cross country team was not ranked in the state’s first cross country poll.\nThe Trojans offered a rebuttal at the Poynette Invitational on Thursday, beating third-ranked Marshall by eight points to take the small division team title with a score of 36.\n“The girls were running for some respect tonight as the first state poll came out yesterday and we were unranked,” Dodgeland cross country coach Barry Smanz said.\nSeniors Jamie Huber and Meygan Benzing served up another 1-2 finish in the girls race. Huber won in 20 minutes, 25.87 seconds to narrowly hold off Benzing (20:26.57).\n“Jamie and Meygan broke away early and had a great dual as Jamie held her off by .7 seconds,” Smanz said. “They will get some much needed competition next week as we have some of the top Division 2 girls in our meet at Marshall.”\nJunior Kaitlin Pickart placed seventh in 22:20. Freshman Miranda Firari (10th, 23:04) and junior Rachel Parbs (16th, 24:54) completed the team scoring.\n“Kaitlin gave us another solid performance which gave us three in the top seven,” Smanz said. “The difference in the meet was our top freshman, Miranda, who ran so mentally tough and just refused to let anyone pass her.”\nDodgeland’s boys fielded an incomplete team once again.\nSophomore Evan Finger (second, 18:33), senior Jacob Stuebe (ninth, 19:28) and freshman James Browning (39th, 22:49) ran for the Trojans.\n“Evan ran a great race and finished second,” Smanz said. “He was able to get out hard, stayed focused the entire race, and he just has so much speed that he can out-kick anyone.”\nWaterloo boys win, girls fifth\nWaterloo’s boys won the small division title with 58 points.\nSeniors Carlos Garcia Olvera (fourth, 18:56) and Eduardo Garcia Olversa (fifth, 19:12), sophomore Brenen Skalitzky (sixth, 19:22), senior Brandon Springer (13th, 20:09) and sophomore Andrew Battenberg (30th, 21:19) scored for the Pirates.\nWaterloo’s girls finished fifth among small division teams with 138 points. Junior Christi Forman took third in 21:08 to lead the Pirates. Senior Kaitlyn Filter (30th, 26:29), junior Lily Stonestreet (34th, 26:58), and seniors Samantha Battenberg (35th, 27:07) and Christie Hollatz (36th, 27:27) also scored for Waterloo.\nJohnson Creek boys seventh, girls incomplete\nJohnson Creek’s boys took seventh with a score of 175.\nSophomore Dylan Gruss (15th, 20:13), senior Cole Ducklow (34th, 21:49) and freshmen Jacob Constable (37th, 22:54), Joey Barganz (44th, 24:47) and Travis Christensen (45th, 24:53) scored for the Bluejays.\nJohnson Creek’s girls fielded an incomplete team.\nJuniors Hannah Constable (fifth, 21:33) and Mateah Roehl (28th, 25:46) and senior Taylor Hallam (38th, 26:41) competed for the Bluejays.\nSmall division girls: Dodgeland 36, Marshall 44, Poynette 85, Princeton-Green Lake 109, Waterloo 138, Rio/Fall River 142, Madison Country Day 169, Markesan 202.\nSmall division boys: Waterloo 58, Marshall 67, Poynette 69, Princeton-Green Lake 108, Pardeeville 138, Madison Country Day 144, Johnson Creek 175, Rio/Fall River 188, Markesan 193, Dodgeland incomplete.", "url": "https://apnews.com/13a394f50407419fa017341c0d49fd8b"}