{"authors": ["George Will"], "date_download": "2020-05-04 20:20:08", "date_modify": "2020-05-04 20:20:08", "date_publish": "2018-10-29 00:00:00", "description": "GRIFFIN, Ga. — “Life happens,” Stacey Abrams instructs a small but boisterous crowd in a sun-drenched park south of Atlanta. She says: Your car breaks down. Your child gets sick. Could happen on...", "filename": "_e19967ea5ddb4ca3a457f1ac73bf2acc_1588623608.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e19967ea5ddb4ca3a457f1ac73bf2acc_1588623608.html", "title": "Georgia On Dems’ Mind", "title_page": "Georgia On Dems’ Mind", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GRIFFIN, Ga. — “Life happens,” Stacey Abrams instructs a small but boisterous crowd in a sun-drenched park south of Atlanta. She says: Your car breaks down. Your child gets sick. Could happen on election day. So, vote early. Today. In her campaign to be the first Democrat elected Georgia’s governor since 1998, and America’s first African-American female governor, she, even more than most Democrats, is depending on “low propensity voters,” prodding to the polls many who have rarely voted in midterm elections. Chatting on her campaign bus she exudes Yale Law School and the University of Texas’ Lyndon B. Johnson School of Public Affairs, fluent about issues and droll about her mother’s reaction to “my trajectory of downward economic mobility” when she left the practice of law to enter politics, rising to be minority leader of the state House of Representatives. In front of a crowd, she is the thinking person’s Dr. Phil telling the story of one of her five siblings (the others include a U.S. district judge and an evolutionary biologist), her bipolar brother who when he left prison left health care behind. Raised in Mississippi, Abrams and her family moved to Atlanta when her parents decided to train for the Methodist ministry. When she was invited to a reception at the governor’s mansion for high school valedictorians, the guard at the gate tried to turn away her and her parents because having arrived by bus they seemed misplaced. Her father, she tells her listeners, told the guard “where he would spend eternity if he did not improve his decision-making skills.” She adds that her family resided in the least affluent neighborhood of an affluent school district in order to have access to a good school. Her crowd laughs when she says, “You should not have to have a degree in cartography to get a good education in Georgia.” Georgia is one of 17 states that rejected Medicaid expansion under Obamacare. This, she says, costs the state $8 million a day and threatens rural hospitals, eight of which have closed and 21 others are threatened. So, she fishes for votes on Christian radio stations that have mostly white rural audiences. While Abrams, 44, is toiling to create her base, her Republican opponent, Brian Kemp, is stroking the erogenous zones of his with what Abrams calls “traditional tropes.” Kemp, 54, boasts that he is “politically incorrect,” which is the politically correct thing for Republicans to say. Throwing caution to the wind, he has announced, “I say ‘Merry Christmas.’” In one primary ad he brandished a shotgun that he says “no one’s taking away” (who wants to confiscate shotguns?). Later in the ad, his prop was a Ford pickup for use “in case I need to round up criminal illegals and take them home myself.” In another ad he pointed a shotgun at a teenage boy “interested in” one of Kemp’s daughters. He wants you to know he is tough as nails, although most who actually are feel no need for such public display. As secretary of state, Kemp is the umpire of elections under Georgia’s “exact match” law, which can block a voter’s registration if even a missing initial differs from the person’s other public records. Some Republicans make a mountain out of not even a molehill of evidence of voter fraud: Orchestrating fraud on a scale necessary to turn most elections would be a hugely inefficient investment of time and energy. Some Democrats are comparably overheated about “voter suppression,” which they detect in every measure aimed at election integrity. But because substantial voter fraud is a fiction, measures like “exact match” do seem designed to sow confusion in order to discourage voters. It has delayed the registration of more than 50,000 — disproportionately African-Americans — who, with proper identification, can still vote Nov. 6. Democratic turnout in the primary was up 40 percent over 2010, the last competitive gubernatorial contest. Georgia, the eighth-most populous state, is 32 percent black (the third highest percentage, behind Mississippi and Louisiana), 10 percent Hispanic and 4 percent Asian. It has the second-lowest percentage of whites east of the Mississippi (after Maryland). Donald Trump won Georgia by only 5 points (3 fewer than Mitt Romney in 2012) and carried 23 of his 30 states by more. Abrams and Kemp are in a statistical dead heat. In Georgia. In late October. So, she probably already has given national Democrats a tantalizing sense of 2020 possibilities, particularly if she is governor. GEORGE WILL writes for The Washington Post. georgewill@washpost.com.", "url": "https://apnews.com/e19967ea5ddb4ca3a457f1ac73bf2acc"}