{"authors": ["Patrick Cooley"], "date_download": "2020-05-04 20:09:44", "date_modify": "2020-05-04 20:09:44", "date_publish": "2018-03-27 11:00:00", "description": "Nick's Sports Cafe: A portrait of a downtown sports bar CLEVELAND, Ohio - Nick's Sports Corner is easy to miss, with only a baseball and basketball-shaped sign announcing its location to...", "filename": "_53f7170d68fd472282acabe80348d46e_1588622984.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_53f7170d68fd472282acabe80348d46e_1588622984.html", "title": "A portrait of a downtown sports bar", "title_page": "Nick's Sports Cafe: A portrait of a downtown sports bar", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Nick’s Sports Cafe: A portrait of a downtown sports bar\nCLEVELAND, Ohio - Nick’s Sports Corner is easy to miss, with only a baseball and basketball-shaped sign announcing its location to anyone looking for a tavern in the Gateway District. The quaint downtown watering hole has a group of regulars chatting up the bartenders on most evenings. On slow nights, they’re lucky to have a handful of customers, bartender Mike Honaker said.\nBut when Cleveland’s sports teams play home games, the bar can get so busy that it’s hard to move once you’re inside.\nOn the Cavaliers and Indians home openers “we’ve had a line down the block just to get into this place,” Honaker said.\nThe story of Nick’s is emblematic of Gateway District bars, as it and feeds off events held at Progressive Field and Quicken Loans Arena and sees a drop in customers when the city’s sports teams struggle.\nThe corner tavern’s entrance is tucked into a storefront on Prospect Avenue just blocks from two of Cleveland’s three major sports venues. At first glance, it looks like a prototypical local dive, with an elongated counter underneath a set of flat screen TVs on one side, a line of tables on the other, and a cooler filled with craft beer bottles behind the bar.\nCurrent owner Nick Vroutos bought the bar 20 years ago and adopted the Nick’s moniker. It was previously the Loop Lounge, a jazz and blues club that hosted blues greats like B.B. King and Buddy Guy. Prior to that it was Domino Lounge\nEven two decades ago, much of the clientele came from sports venues, Vroutos said.\nCustomers tend to drift in before sporting events and concerts held at the Q and Progressive Field, leave for the venue after a few drinks, and then filter back in once the event is over.\nMany of those customers come from out of town, Vroutos said. A pair of customers wearing Milwaukee Bucks jerseys, for example, sat at the bar around an hour before a recent Cavaliers home game against Milwaukee.\nAnd the bar was packed to the gills before and after a Kid Rock Concert at the Q on Feb. 24. Customers could barely fit in the front door, said Sarah, a bartender who asked to be identified only by her first name.\nIn contrast, only a handful of regular customers show their faces on other nights. Many of the patrons on a recent Thursday were service workers finishing their shifts at nearby restaurants.\nConcerts at the Q and Progressive Field are rare, meaning most of Nick’s business comes from Cavs and Indians fans.\n“With the new Cavs, we’re getting busy,” Sarah said.\nThe Cavaliers struggled with inconsistency through the first half of the 2017-2018 season, but fans felt a burst of optimism after a series of trades rocked the team’s line-up. Interest in the Cavs spiked after the new squad won three straight games.\n“We’ve been through those years where the Indians were only getting 5,000 people (per game) and the Cavs were only getting 5,000,” Vroutos said.\nThe Indians ballpark can hold more than 35,000 people and the Cavs arena has seating for over 20,000.\n“We went through those four years when the Cavs weren’t making the playoffs” before superstar forward LeBron James returned to Cleveland, Vroutos said. “Those were rough.”\nFortunately for Nick’s, two of the city’s three major sports teams experienced winning seasons in recent years (the Browns are a different story).\nPlayoff runs mean more home games at Progressive Field and The Q, and therefore more enthusiastic fans at downtown bars like Nick’s.\n“It’s nice to have (the Cavs) season extended to June,” Vroutos said.\nThe Cavaliers reached the NBA Finals in 2017, 2016 and 2015, winning a championship in dramatic fashion over the Golden State Warriors in 2016. The Indians reached the World Series in 2016 and won 102 regular season games in 2017.\n“We’ve seen the whole loop,” Vroutos said.\nThe Cavaliers’ championship run was especially lucrative for Nick’s. Fans packed the small bar to watch the finals games. Pictures provided by a Nick’s employee show a standing room only crowd gathered in the small downtown establishment.\nThe Browns are the only local team that consistently draws fans regardless of the team’s on the field performance, Vroutos said.\nThe bar opens at 6 a.m. on the day of home games and always sees a crowd, he said.", "url": "https://apnews.com/53f7170d68fd472282acabe80348d46e"}