{"authors": ["Rosemary Feurer", "Chad Pearson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Dustin Guastella", "Jamie Mccallum", "Doug Henwood"], "date_download": "2020-05-04 20:00:04", "date_modify": "2020-05-04 20:00:04", "date_publish": "2018-05-01 00:00:00", "description": null, "filename": "2018_05_employer-business-organizing-bosses-capitalists-public-relations_1588622404.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/05/01130838/rockefeller-1140x727.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_05_employer-business-organizing-bosses-capitalists-public-relations_1588622404.html", "title": "Five Ways Bosses Fight Labor", "title_page": "Five Ways Bosses Fight Labor", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nUnion density in the United States has ebbed and flow over the past century. What hasn’t changed is employers’ opposition to trade unions. Well before the anti-union campaigns of the post-New Deal era, or the right-wing offensives of more recent vintage, employers built networks, developed alliances, and created strategies to stem labor’s rise. Together, employers helped shape a legal, social, and political environment that systematically stacks the deck against workers. Here are five ways capitalists have tried to fend off unions — often with great success.\n1 They Embraced Collectivism Most employers express disdain for working-class organization, insisting that workers should embrace individualism and reject the solidarity promoted by unions. Yet bosses understand the power of unity. Beginning in the late nineteenth century, often spurred on by a small cadre of especially class-conscious employers, business leaders connected to manufacturing, the building trades, railroads, and retail launched a series of organizing drives, often under the name “Citizens’ Alliances” (a moniker that concealed their members’ privileged class positions). These organizations broke strikes, busted unions, and blacklisted workers. By 1903, hundreds of local employers’ and citizens’ alliances counted themselves as members of the Citizens’ Industrial Association of America (CIAA). Such groups became a clearinghouse for anti-union strategies. Promoting the open-shop principle — which sought to block workers from establishing shop floors as union strongholds — employers used collective action to intimidate and cajole workers into rejecting their own forms of solidarity. They established labor bureaus to recruit scabs during strikes, held meetings with elected officials, traded legal tactics designed to enhance their power. And they ostracized those employers who refused to join the movement, calling them, in the words of a member of the union-busting National Founders’ Association in 1906, “selfish and indifferent.” In the process, employers learned to move beyond their own companies’ narrow interests to mount a broader, collective project: the defeat of unions and working-class power.\n2 They Drew on Existing American Traditions Many of the most aggressive anti-union activists of the early twentieth century invoked the memory of Abraham Lincoln and the abolitionist legacy, insisting that, as employers, they had a duty to defend the rights of the nonunion “free worker.” In their hands, emancipation wasn’t a radical doctrine that would free the oppressed from chattel slavery and then wage slavery, but cause to limit the creeping coercion of unions. “‘No man is good enough to govern another man without that other’s consent,’” an employer-friendly labor commission wrote in 1902, quoting Lincoln. “This is as true in trade unions as elsewhere.” Bosses also drew from a constellation of secretive, violent, and antidemocratic activist traditions. Some of the most prominent figures in the bosses’ secretive Citizens’ Associations borrowed strategies from the vigilante organizations that they had helped create and lead. CIAA activists like Wilber F. Sanders led the Montana Vigilantes, Hugo Donzelmann belonged to the Wyoming Stock Growers Association, and N. F. Thompson had both fought under Confederate general Nathan Bedford Forrest and collaborated with him as a Klansman during the Reconstruction period. These nineteenth-century organizations terrorized small-scale animal thieves in the West and insubordinate African-American laborers in the South while publicly presenting themselves as virtuous defenders of law and order. Many of the precise details of these organizations’ violent activities are difficult to untangle — from Brooklyn to Birmingham, members signed statements promising to “keep secret forever all that may be said or done by the alliance or any of its members.” What’s clear is that their members retained their violent impulses when, decades later, they turned to stamping out unionism.\n3 They Mixed Hard Power With Soft Power In the late nineteenth century, bosses began using public police forces and private mercenaries to shore up their base of power. They vocally supported the development of municipal police departments and National Guard units, while employing their own thugs and spies well into the 1930s. These tactics often produced deadly results — and bad press. While they didn’t dispense entirely with sanguinary strategies, employers learned to mix public relations with repression. John D. Rockefeller, for instance, engaged in an aggressive public-relations effort after the infamous 1914 Ludlow Massacre, which saw eleven children and two women lose their lives amid a union-recognition campaign. Before the bloodbath, Rockefeller admitted he was willing to sacrifice lives if it meant staying union-free. In its aftermath, thanks to his deft propaganda campaign — as well as legal repression and state persecution — Rockefeller overcame the initial bad press to keep the union out. Employers used the same approach in the tumult of the 1930s. Branding his anti-union strategy the Mohawk Valley Formula, James Rand Jr of Remington Rand Company in New York defeated strikes using a public-relations surge designed to undermine union support. His nine-point strategy began with tips like “label the union leaders as ‘agitators’ to discredit them” and “raise high the banner of ‘law and order’ and ended on this note: “Close the publicity barrage on the theme that the plant is in full operation and the strikers are merely a minority attempting to interfere with the ‘right to work.’ With this, the campaign is over — the employer has broken the strike.” The solution to labor strife, Rand and other employers had learned, wasn’t brute repression —they also needed carefully cultivated messages that obfuscated their quest for unrivaled power in the workplace.\n4 They Wooed Workers Organized employers also launched PR campaigns to win over their own employees. They portrayed unions as a threat to American society in general, not merely to the class interests of the powerful. Anti-unionism was, they insisted, a shared American value. The only option for honorable, patriotic workers was to reject organized labor. Groups like the National Association of Manufacturers and astroturf “right-to-work” committees produced and distributed short films to schools, churches, and community groups. Some, like 1958’s …And Women Must Weep, depicted unions as violent and un-American. Through the 1980s, managers showed this movie to workers in the hopes of discouraging them from joining union organizing drives. Another way employers have tried to peel off workers has been elevating anti-union employees and portraying them as the legitimate spokespeople for rank-and-file interests. Often, the process by which such workers are selected is cloaked in secrecy. Consider the group of “independent” workers at the Volkswagen plant in Chattanooga, TN, where anti-labor forces, aided by deep-pocketed outsiders, fought and ultimately prevented a successful unionization drive in 2014. Representatives announced that anti-union sentiment arose from below, citing a group of workers that had supposedly formed an organization called the American Council of Employees. Yet after doing some digging, journalists discovered that the group, like those that existed more than a century earlier, had shadowy business interests backing it. Even a couple years after the drive collapsed, it was still unclear who exactly funded the organization.", "url": "https://www.jacobinmag.com/2018/05/employer-business-organizing-bosses-capitalists-public-relations"}