{"authors": ["Marcus Fuller"], "date_download": "2020-05-04 20:28:15", "date_modify": "2020-05-04 20:28:15", "date_publish": "2018-03-26 17:08:51", "description": "Marcus Fuller bounced from state to state during the past five months listening to opinions about the uneven state of college basketball, one year ahead of the Final Four coming to...", "filename": "_d599de8c160d4b20867c9171b73fe47d_1588624095.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d599de8c160d4b20867c9171b73fe47d_1588624095.html", "title": "Can college basketball clean up its act in time for Minneapolis' 2019 Final Four?", "title_page": "Can college basketball clean up its act in time for Minneapolis' 2019 Final Four?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Can college basketball clean up its act in time for Minneapolis’ 2019 Final Four?\nMarcus Fuller bounced from state to state during the past five months listening to opinions about the uneven state of college basketball, one year ahead of the Final Four coming to Minneapolis.\nCollege basketball will set up and tear down its traveling best-in-show production one more time this week before heading north. A year from now, the 2019 Final Four will be taking over downtown Minneapolis.\nThis weekend at San Antonios Alamo Dome, and again next April at U.S. Bank Stadium, streets will fill with partyers and hoopaholics, games will make history and confetti will fly.\nThese blockbuster moments bracket-busters, buzzer-beaters and Cinderellas that take over March make for a beautiful mask. Behind it, the games foundation shakes. College basketball is not aging well.\nEven before FBI agents and university investigators dragged corruption into the spotlight and trashed the sport this winter, an identity crisis was raging.\nSome fans didnt need the FBI to chase them away they were already gone, exhausted from having to relearn rosters every fall. Call it one-and-done fatigue.\nYet in some corners of the country we have packed campus gyms, programs on the rise and extraordinary traditions and rivalries.\nWith the good and bad in tow, the big show will pull into downtown Minneapolis next April. What exactly did the city win four years ago when its bid to host the 2019 Final Four came through? Did it buy damaged goods or the brightest of all shining moments? Or both?\nMinnesotas winding road schedule this season allowed me to visit more than a dozen communities. Small college towns and the biggest of the bigs. Giant, NBA-sized arenas and high school gyms. I road-tripped from State College, Pa., to Villanova to Philly to D.C. I hit the usual Big Ten spots, and I bounced around New York City on three separate occasions during the Gophers frequent visits.\nWhats the state of college basketball? The answer depends on what state youre in when you ask.\nAmbers still glow red in the hotbeds\nBen Callahan wants to show off his Kris Dunn Wolves jersey. Its a Monday night game in mid-November, 20 minutes from tipoff, as Providence players shoot out of the tunnel for warmups to band trumpets blasting. The backwards-cap-wearing, 21-year-old basketball fanatic stands and turns for everyone to see Dunn is his guy, his favorite all-time Friar.\nThe Dunn Era was a blast for younger fans of Providence basketball. Signed jerseys and photos of the 2016 Big East MVP, and eventual Timberwolves draft pick, are still for sale here in the Providence concourse.\nSeventeen Callahans are Providence grads, starting with Bens great-grandfather, who saw the first Friars teams in 1926. Its a real family affair, said Steve Callahan, Bens dad. Bens brother is in the Air Force, but he still caught games on his laptop while stationed in Okinawa and in Korea during the Olympics.\nHe might have to stay up until 2 in the morning to watch them, Steve said, but hes had a lot of fun with it this year.\nThe Friars future is in the hands of this younger generation. Attendance has long been down from the glory days in the 1960s through 1980s, when Rick Pitino took advantage of a new element to the college game, the three-point line, and went to the Final Four with Billy Donovan in 1987.\nBut after five consecutive NCAA tournaments under Ed Cooley, Providence basketball is bouncing again. Attendance is starting to tick back up. It re-creates a lot of that excitement and brings back a lot of great memories, said Rhode Island state Sen. Bill Conley, who like the Callahans has attended games for decades. My sons are young adults now, but its exciting for us again.\nI heard nearly the same thing two months later in the nations capital, where another former Big East giant stirs.\nGeorgetowns student section is too young to remember Allen Iverson playing, let alone first-year coach Patrick Ewing, who put the program on the map with two Final Fours and a national title in 1984. But the two most popular jerseys at Capital One Arena on a Wednesday night in January are Iversons No. 3 and Ewings No. 33.\nFinance and accounting major Drew Rodriguez and economics major John Driscoll are watching their Hoyas struggle to keep up with No. 1 Villanova but pledge their support. Ewing inherited this roster, Rodriguez said, so hes doing what he can with it.\nThe guys we got coming in next year are much better than I wouldve expected under [previous coach John Thompson III], Driscoll said. I feel much more positive about whats happening.\nDriscoll, Rodriguez and the kids filling the seats in this huge arena are the new blood. They werent around for Ewing or Iverson, but they are willing to pay $20 Uber fares to get downtown to watch a program trying to reboot from many recent forgettable seasons. Next year, Rodriguez said, Im going to get season tickets.\nWe love college hoops, Driscoll said. If were ranked, then this place would fill up. D.C. is a Georgetown city over any pro team when theyre good. People are more committed to Hoyas than they would be over the Wizards and Capitols. Just give it some time.\nArkansas needed all kinds of time to coax some flames from its fan base embers. But fans are rocking again in Razorbacks Land, where 49 victories and landing top in-state recruits the past two years have this college hoops towns heart beating again.\nMore than two decades have passed in Fayetteville, Ark., since Scotty Thurmans three-pointer sank Duke in the 1994 national championship game. He told me when I visited with him in December that he gets stopped by folks several times a week about that shot. He doesnt mind.\nIn 2011, Arkansas hired legendary coach Nolan Richardsons former assistant Mike Anderson, who brought back Thurman to be his assistant five years later.\nA lot of fans from the past and fans from the present are taking heed to the fact that the style of play is similar, Thurman said of the 40 Minutes of Hell style that Richardson made famous Administration understood that our fans were hungry for that.\nA lot of wounds were healed when Anderson was rehired, reconnecting Richardson. Walking through the main entrance of Bud Walton Arena, Im greeted by a hog heaven of memorabilia, photos and trophies in glass cases. After Richardsons heated departure, the Razorbacks made the NCAA tournament only three times in 13 seasons from 2002 to 2014.\nCollege basketballs many issues didnt slow the rebirth here poor hires did. Stan Heath and John Pelphrey failed. I heard Anderson was on shaky ground, too, but his rebound has ushered in renewed passion in Fayetteville.\nThere are a lot of things that have had an impact on the college game, and the FBI investigation doesnt make it look like this sport is very clean and pure, Thurman said. I dont think the college game will be hurting here. Our fans are a lot different than other fans. Were the pro team here. Our fans will come to support us if we continue to have success and I dont think that will change.\nNo room for college ball in the big cities?\nA couple of days after Thanksgiving, the main feast for a dozen preteens gathered behind a basket at the Barclays Center in Brooklyn on a late November afternoon is Jelly!\nAs Isaiah Washington runs through a layup line, his baby baller fan club oohs and aahs with each layup and finger-roll. You see the back of my sweater, one of the boys tells me, turning around to reveal the words Jelly Fam in gold on a maroon hoodie.\nThis is what were here for, said a buddy to his left, as he showed off a blue hoodie from Washingtons middle school team, the Millbank Flyers. Were watching Isaiah play.\nWashington grew up in Harlem, a train ride from St. Johns University in Brooklyn, but he doesnt have much to say about the Red Storm. Nah, I didnt go to any college basketball games when I was younger, the Gophers freshman point guard said. [St. Johns] didnt have no good players. I knew lot of high school guys from the city I liked, but not college.\nWashingtons generation has little connection with the New York college basketball scene, if such a thing still exists. Its been three decades since Brooklyn native Chris Mullin made St. Johns a powerhouse.\nThe hiring of Mullin two years ago as coach was St. Johns attempt to stoke a dying fire. Into this NYC amateur basketball void stepped Washington and his Jelly Fam crew. They created a social media movement with their style and video clips of fancy finger-rolls that took over the New York hoops scene in 2017, his senior year at St. Raymonds in the Bronx.\nI was surrounded by more than Jelly Fam fanatics during my three visits to NYC this season a Michigan-Michigan State Big Ten tournament semifinal drew more than 19,000, the first sellout for the Big Ten tournament since 2014 but across the street from Madison Square Garden I found a more telling sign of New York City college basketball interest.\nModells is massive racks and racks of jerseys and hoodies and every other kind of sports gear for sale. Except college basketball gear. An employee told me they used to have some Duke and North Carolina garb, but not on this February day across the street from the big college basketball tournament.\nI didnt expect to see Northwestern or DePaul gear when I visited Chicago in early January. Like in New York, college basketball is lost in a sea of sports in this preps and pros town.\nThe standing-room-only crowd on a Tuesday night at Kenwood Academy on the south side came to see the biggest show in town. Simeon Career Academy, the No. 1 team in the state, draws spectators from all over. Actor/rapper Common, a Chicago native, shows up.\nOn a strong drive to the hoop, senior wing Talen Horton-Tucker slipped past a defender, took off from outside the charge circle and threw down a vicious slam. Simeons students went berserk, high-fiving and pointing their phones at the wild scene. Pretty sure a viral video was born of that moment.\nDePaul, Illinois and Northwestern cant compete with that. High school basketball is probably bigger than college basketball here, Horton-Tucker said. We take pride in our city basketball.\nThe 6-foot-5 Simeon star is arguably the best player in his class in Chicago. He grew up watching Derrick Rose and cried when the former Simeon All-America lost in the NCAA title game with Memphis.\nA decade later, theres no trace of those college-ball connections near Chicago. DePaul, Northwestern and Illinois are close by on the GPS but not on most fans radar. Its hard to know how Loyola Chicagos incredible Final Four run will impact the city beyond these magical three weeks. Do the Ramblers have staying power? Maybe only Sister Jean knows.\nHopefully, our college teams can turn it around, Simeon coach Rob Smith said. But its more about high school and the NBA right now in the state.\nA college basketball village above the fray\nCollege towns should all be as intimate as the village of Villanova, Pa. One main street connects the campus, the basketball arena and facilities, the bar and restaurant scene and a community dedicated to the Wildcats.\nIm a college basketball fan, Bobby Fritz, a bartender at Kellys Taproom, tells me in mid-January. Im from Springfield, about 25 minutes from here. Ive been watching them my whole life.\nTwo years ago, thousands of patrons in blue and white marched on the Main Line from the old home of Nova basketball, Finneran Pavilion, down Lancaster Avenue and through town in Bryn Mawr. The party peaked at Kellys.\nEvery once in a while we do get players, Fritz said. Jalen Brunson is in here. Mikal [Bridges] is in here a good amount. But its just usually the core guys are here when theyre on break. We get the bench guys in here a lot.\nDown the street from Kellys, on the opposite side of Lancaster, I find a giant painted mural of Kris Jenkins now legendary last-second shot that dropped in to beat North Carolina for the 2016 crown. College basketball owns this town.\nThe Wildcats took a 140-mile bus ride south that week to face old Big East rival Georgetown in D.C. Two hours before taking their seats, more than 100 Wildcats fans are elbow to elbow around me in a private party on the second floor of Clydes, the official Villanova alumni hangout in D.C. for years.\nI feel like with all the issues in college sports, and I hope its true, that theres a lot of integrity in our program more so than other places, Nova graduate and Navy officer Chris Nicoletti said. Thats something thats prideful to me and I think others.\nBefore Jay Wright arrived at Villanova in 2001, Kellys was shut down. Nicoletti was glad to hear its thriving with atmosphere much like the crowd we were mingling with in D.C. I lived off campus up the street from there, he said. We could just walk from our house.\nNear and far, all is well with Villanova basketball. Scandals are no match for national championships and No. 1 seeds.\nFound in any city: one-and-done fatigue\nMarch Madness for Tyus Jones these days is trying to help the Wolves finally get back into the playoffs, but this was supposed to be his senior year at Duke.\nJones spent only 10 months in the hoops hotbed of Durham, N.C. Fans will always love him for leading the Blue Devils to a national title in 2015, but it was the shortest possible college sports love affair.\nThe one-and-done route wasnt Jones plan, but the point guard told me last week after a practice that he wouldnt change a thing. He supports the current system that steers top prospects to college for at least a year.\nI think its a good thing, because college basketball is a great experience, Jones said. I do see where the frustration comes in from fans and probably even coaches, because it makes the game of college basketball a little bit different. When kids leave after one year or two years and youre trying to base your team around them, you can have significant holes.\nNearby were teammates Andrew Wiggins and Karl-Anthony Towns, two more one-and-doners. Theyve each said their chosen routes worked for them. I loved my experience playing college basketball, Jones said. At the same time, I loved being able to make my decision to fulfill my dream of playing in the NBA.\nSome college basketball die-hards say players should be required to stay in school longer. Others vote for a return to the preps-to-pros option, to eliminate some of the corruption in recruiting. Jones isnt buying that one.\nI dont think that would change anything, he said. It would still be a pretty messy deal. I dont think its fair to blame the one-and-dones on everything that is going on. Its crazy whats going on with college basketball right now.\nThe would-be college senior gets an A+ for his perfect adjective for the state of college basketball.\nCrazy is a word well hear a hundred more times this weekend, especially with the Loyola Chicago Ramblers two victories away from a national title. Now thats crazy.\nWill crazy still be the college basketball adjective we hear during Final Four week next April? If so, lets hope its the good kind of crazy.", "url": "https://apnews.com/d599de8c160d4b20867c9171b73fe47d"}