{"authors": [], "date_download": "2020-05-04 20:11:57", "date_modify": "2020-05-04 20:11:57", "date_publish": "2018-01-18 16:56:00", "description": "With North Carolina roads still coated with snow and ice, the game will go on for North Carolina State and Wake Forest Thursday night. Whether fans can make it is another story. The game...", "filename": "_838fc2ae3a4ef1aaf950e3cc6a8d748a_1588623117.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_838fc2ae3a4ef1aaf950e3cc6a8d748a_1588623117.html", "title": "NC State, Wake on despite dangerous driving conditions; Cooper urges fans to stay home", "title_page": "NC State, Wake on despite dangerous driving conditions; Cooper urges fans to stay home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With North Carolina roads still coated with snow and ice, the game will go on for North Carolina State and Wake Forest Thursday night. Whether fans can make it is another story.\nThe game will tip at 8 p.m. at PNC Arena (WRAL-TV, Mix 101.5 FM), and both teams are in Raleigh and ready to play. According to the ACC, network and officiating personnel are on hand as well.\nGov. Roy Cooper had advice for ticket-holders.\n“On a day like this, empty seats are OK,” he said during an update about road conditions after the snowstorm.\nCooper urged drivers across the state to stay off the roads to allow for the Department of Transportation to spread salt and sand and clear icy surfaces.\n“The public can help us by digging in a little bit longer and staying home,” Cooper said. “Staying off the roads right now is important.\n“The TV is a great way to watch basketball. Stay home, watch the basketball game on TV.”\nCooper appeared to believe that the game was still up in the air, but NC State confirmed at about 2:30 that the teams will play.\nThe university said fans who purchased their tickets through NC State Athletics who can’t attend the game will be offered the option to exchange unused tickets for a future game later this season.\nFor those who plan to brave the elements to attend, the school urged fans to use extreme caution. PNC Arena parking lots will open at 5:30, and doors will open at 6:30.\nParking details from NC State:", "url": "https://apnews.com/838fc2ae3a4ef1aaf950e3cc6a8d748a"}