{"authors": ["Eloy Ortiz Oakley"], "date_download": "2020-05-04 21:06:28", "date_modify": "2020-05-04 21:06:28", "date_publish": "2018-04-06 00:00:00", "description": "“I don’t know what that means, a community college,” President Donald Trump said last week during a speech in Ohio. “Call it vocational and technical. People know what that means.” The president...", "filename": "_039fb7d82fba406d882e30c80d97017b_1588626388.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_039fb7d82fba406d882e30c80d97017b_1588626388.html", "title": "Route To Middle Class", "title_page": "Route To Middle Class", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "“I don’t know what that means, a community college,” President Donald Trump said last week during a speech in Ohio. “Call it vocational and technical. People know what that means.” The president made similar remarks two months ago, and again in March. The results of the 2016 presidential election should have made one thing clear: Social and economic mobility are top of mind for Americans. So why does the president keep dumping on community colleges? His sentiments reveal a deep misunderstanding about the benefits that community colleges provide. So as our students return from spring break, perhaps Trump should come visit one of the nation’s 1,100 community colleges to see for himself the value they provide our economy and democracy. Trump repeats an anecdote about a classmate who was “not going to be Einstein academically,” but could repair a motor while blindfolded. Even his concept of career education remains stuck in the industrial age. Artificial intelligence, automation and the rise of the gig economy are changing the nature of work and the skills needed to participate in this new economy. There are still good jobs for workers without bachelor’s degrees, but those jobs are shifting from blue-collar to skilled-services industries that demand post-high-school education. Community colleges are the most affordable option for securing such good-paying jobs. In addition, we offer opportunities to transfer to four-year institutions. Make no mistake, community college is college. We educate future welders and doctors. Mechanics and architects. California Community Colleges has 114 campuses and 2.1 million students — an enrollment more than 2.5 times the size of the University of California and Cal State systems combined. Some 40 percent of our students are the first in their family to attend college. We are their path to the middle class. But we need the resources to serve all of them. Achievement gaps that fall along lines defined by race, ethnicity, age and region persist. Too many students take too long to earn their certificates or degrees, or to transfer. We also need to better serve working adults. For America to expand its economic prosperity, the White House needs to work to strengthen community colleges. Instead, the president proposed cuts to workforce training and education programs. (Congress, fortunately, rejected that.) The White House could push for more need-based financial aid, but the executive branch is trying to roll back consumer protections for students harmed by for-profit colleges. I’m optimistic about the future of community colleges and their power to transform students’ lives, and the president should be too. At Rio Hondo College in Whittier, students are enrolled in a cutting-edge certificate program to learn how to repair battery-powered Tesla cars. A team from Santa Rosa Junior College just won the National Collegiate Debate Championship, fending off UC Berkeley to become the first winners from a two-year college. And throughout our system, tens of thousands of students recently received acceptance letters for transfer to Cal State and UC schools. Spring is a nice time to visit campus, Mr. President.", "url": "https://apnews.com/039fb7d82fba406d882e30c80d97017b"}