{"authors": ["Tech. Sgt. Ryan Crane"], "date_download": "2020-05-04 20:25:55", "date_modify": "2020-05-04 20:25:55", "date_publish": "2018-01-25 16:51:56", "description": "KEESLER AIR FORCE BASE, Miss. — ‘Shut up and color.’ Sound familiar? I, like many noncommissioned officers today, came up in an Air Force that seemed to cultivate a mentality that...", "filename": "_854d32b04fe9437f92358263e98b1e5c_1588623955.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_854d32b04fe9437f92358263e98b1e5c_1588623955.html", "title": "Why is it so bad to ask ‘why?’", "title_page": "Why is it so bad to ask ‘why?’", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "KEESLER AIR FORCE BASE, Miss. — ‘Shut up and color.’\nSound familiar?\nI, like many noncommissioned officers today, came up in an Air Force that seemed to cultivate a mentality that Airmen follow orders without wasting time with unnecessary questions. After all, this is the military and lives are at stake, right?\nI learned my first assignment was like a minefield; ask the wrong question and you were liable to lose a limb. During one such encounter, my supervisor, a staff sergeant, marched up to my desk and dropped a binder in front of me.\n“Skim this,” she said. “Sign the form in the back and bring it to me when you are done.”\nThe binder contained our operational security policy and critical information list. As Airman Crane, I had never heard of OPSEC and had no idea how it pertained to me. I wanted to learn as much as possible and figured if something required my signature to prove I understood the content, I should know how it related to my job.\nNot knowing I was about to step directly on a land mine, I asked my supervisor, ‘Why?’.\nHow does this relate to my job, and why is this important to the Air Force? I wanted to read this binder with the context required to reach the proper level of understanding.\n“Did I say you could ask questions, Airman Crane? Read the binder, then sign. That is all you have to do.”\nI was shut down immediately. Dejected and disappointed that the person charged with leading me was not willing to help me to learn.\nTo this day I am not sure if she didn’t know the answer to my question or if she couldn’t be bothered to sit down and explain the importance of OPSEC to someone whose job requires them to photograph F-15E Strike Eagles.\nWhether it was intended or not, I got the message. My supervisor was not going to give me my ‘why’.\nI was upset at the time, but I am no longer bitter. I am thankful she seared this memory into my brain because now I make an effort to provide the ‘why’ to the teams I lead.\nThe mentality that my story illustrates is not extinct in today’s Air Force. We are a product of our environment after all, and if you were surrounded by that behavior, there is a good chance you chose to adopt it as well.\nI recently attended a professional development course with my peers and we had the opportunity to speak with a group of relatively new Airmen to pick their brains and to better understand how the next generation sees the Air Force. During that back and forth, the question of ‘why?’ came up.\nConsensus amongst the Airmen panel was that they love asking ‘why?’, but there are obviously right and wrong times to do so. They also conceded there are right and wrong ways to phrase the question. Overall, their answers were exactly what business consultant Simon Sinek would say makes the question so important, especially for this generation of Airmen.\n‘What’ and ‘how’ are short-sighted. They tell the Airman exactly how to get from point A to point B. ‘Why’ is inspirational. ‘Why’ gives purpose to the task; it gives them the buy into the organization and solidifies their role in the profession of arms\nWe expect our most seasoned leaders to ask ‘why’ to get to the root cause of problems. We encourage our senior NCOs to ask ‘why’ when trying to diagnose behavioral issues. Why would we not want our Airmen to take the same critical thinking approach to the tasks they perform?\nThe Secretary of the Air Force, Heather Wilson, recently sent out a call for Airmen to submit their innovative ideas in an attempt to save money and make the Air Force more efficient. The first step in finding inefficiencies is allowing our Airmen to question processes and offer opinions to optimize new solutions.\nAs an Airman, I felt like just another cog in the machine. I was trudging through the week trying to get to the weekend. After a change in office leadership, my outlook changed entirely. My questions and requests for context were met with detailed answers and information that helped me better understand our mission and where I fit into it. I had a new sense of purpose in that organization.\nToday, as a supervisor and overall team leader, I want my Airmen to hold me accountable. Ask me, “Why do we perform a task this way? Why are we prioritizing things this way?” Worst case scenario, I spend two minutes providing background and context to the things we do. Best case scenario, they help me identify inefficiencies in our process and make our unit better.\nAirmen in today’s Air Force are routinely coming in with completed college degrees and vast experience in the real world. They are fueled by a desire to be a part of something and to feel like they are making a difference. If asking ‘why?’ is their way of finding purpose in the work they do, I recommend we embrace ‘why?’ rather than vilify it.", "url": "https://apnews.com/854d32b04fe9437f92358263e98b1e5c"}