{"authors": [], "date_download": "2020-05-04 20:14:11", "date_modify": "2020-05-04 20:14:11", "date_publish": "2018-09-01 08:20:04", "description": "Here's a look at some don't-miss WPIAL high school football games for Week 1: Class 6A Seneca Valley (1-0, 0-0) vs. 3-6A Central Catholic (1-0, 0-0)", "filename": "_8a67989a3b054f04b6cf044fc7e3e170_1588623251.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8a67989a3b054f04b6cf044fc7e3e170_1588623251.html", "title": "WPIAL high school football don't-miss matchups for Week 1", "title_page": "WPIAL high school football don't-miss matchups for Week 1", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Here’s a look at some don’t-miss WPIAL high school football games for Week 1:\nClass 6A\nSeneca Valley (1-0, 0-0) vs. 3-6A Central Catholic (1-0, 0-0)\n7 p.m. Friday at at Wolvarena, Turtle Creek\nRadio/Internet: TribHSSN.triblive.com.\nLast week: Seneca Valley 30, McDowell 6; Central Catholic 24, Cathedral Prep 21\nCoaches: Ron Butschle, Seneca Valley; Terry Totten, Central Catholic\nTop players: Dom Pieto, Central Catholic (Jr., 6-0, 180, QB); Gabe Lawson, Seneca Valley (Jr., 6-2, 190, QB/DB)\nKeep an eye on: Gavin Thomson, Central Catholic (Sr., 6-0, 180, WR/DB)\nMomentum: Central Catholic is coming of a momentous Week Zero victory, taking down Erie power Cathedral Prep, and ending the Ramblers’ 28-game winning streak.\nFour downs: 1. Pieto had a solid debut for the Vikings, completing 6 of 12 passes for 122 yards and two touchdowns. 2. Lawson completed 12 of 14 passes for 188 yards and three scores, as Seneca Valley rolled to a Week Zero victory. 3. Central’s Johnathan Opalko, an all-section soccer player, is one of the area’s top kickers. He booted a 25-yarder in Week Zero. 4. The Raiders return three starters on the offensive line -- Kevin Meeder, Drew Robertson and David Tkatch, and Marcus Might returned after taking the year off to focus on basketball.\nExtra point: Seneca Valley started 1-6 last season.\nClass 5A\nAllegheny 8\nWoodland Hills (0-1, 0-0) at Bethel Park (0-0, 0-0)\n7:30 p.m. Friday at Bethel Park Stadium, Bethel Park\nRadio/Internet: TribHSSN.triblive.com.\nLast week: Woodrow Wilson, Washington, D.C. 20, Woodland Hills 7; Bethel Park was idle. The Black Hawks finished 8-2 overall and 6-0 in the Southeastern (6A) last season.\nCoaches: Tim Bostard, Woodland Hills; Jeff Metheny, Bethel Park\nTop players: Gavin Gurreri-Judson, Woodland Hills (Sr., 6-3, 196, QB/DB); Anthony Chiccitte, Bethel Park (Jr., 6-1, 180, QB)\nKeep an eye on: Jay Smith, Woodland Hills (Sr., 5-8, 151, WR/DB)\nMomentum: Bethel Park is coming off a trip to the WPIAL quarterfinals and has made the playoffs 17 straight seasons.\nFour downs: 1. Bethel Park will begin its trek in Class 5A after dropping down from the highest classification. 2. Woodland Hills, which hosted the Western Pa. vs. Everyone Showcase in Week Zero, managed just one score in the opener, a 16-yard reception for Smith, who leaped onto the pylon. 3. The Wolverines played without Toledo recruit Mike Coleman, who was injured but is expected back soon. 4. Metheny is in his 25th season as head coach at Bethel Park.\nExtra point: Bethel Park will get another test next week against Allegheny 8 foe West Allegheny.\nClass 4A\nBig 8\n5-4A West Mifflin (0-1, 0-0) at Indiana (0-1, 0-0)\n7 p.m. Friday at Andy Kuzneski Field, Indiana\nRadio/Internet: 1450 AM, 100.3 FM, TribHSSN.triblive.com.\nLast week: Mars 7, West Mifflin 6; Armstrong 26, Indiana 20\nCoaches: Ray Braszo, West Mifflin; Brandon Overdorff, Indiana\nTop players: Parrish Parker, West Mifflin (Sr., 5-10, 180, RB/DB); Grant Harkleroad, Indiana (Sr., 5-10, 180, QB/LB)\nKeep an eye on: Matt Schuster, West Mifflin (Sr., 6-3, 190, QB)\nMomentum: West Mifflin’s defense was stellar against the No. 4-ranked Planets, but the offense struggled to find the end zone.\nFour downs: 1. Parker, a Howard recruit, scored on a 5-yard run in the fourth quarter of West Mifflin’s 7-6 loss to Mars in Week Zero. The point-after attempt failed. Parker ran for 51 yards on 17 carries. 2. For Indiana, Harkleroad ran for a 3-yard touchdown and threw a 25-yard TD pass to Malik Turner last week. 3. Schuster threw just 51 times a year ago for the run-first Titans, accumulating 251 yards. 4. Overdorff, a former head coach at Purchase Line, was hired in May to replace 15-year veteran coach Mark Zilinskas.\nExtra point: West Mifflin has qualified for the WPIAL playoffs eight straight times, falling to South Fayette a year ago.\nClass 3A\nTri-County West\nCentral Valley (0-1, 0-0) at 3-3A Quaker Valley (0-0, 0-0)\n7 p.m. Friday at Chuck Knox Stadium, Leetsdale\nRadio/Internet: 1460 AM, 92.1 FM; TribHSSN.triblive.com.\nLast week: Blackhawk 21, Central Valley 7; Quaker Valley was idle. The Quakers won the WPIAL and PIAA Class 3A title in 2017.\nCoaches: Mark Lyons, Central Valley; Ron Balog, Quaker Valley\nTop players: Ameer Dudley, Central Valley (So., 5-11, 165, QB); Ethan Moore, Quaker Valley (Sr., 6-0, 175, QB)\nKeep an eye on: Ryan Jackovic, Quaker Valley (Sr., 6-5, 210, WR/S)\nMomentum: Quaker Valley is the reigning WPIAL and PIAA champion, and is still expected to contend for a title despite graduating the bulk of the starting lineup.\nFour downs: 1. Dudley scored Central Valley’s lone touchdown last week, an 8-yard run against Blackhawk. He completed just two passes for 21 yards with an interception. 2. Central Valley returns just four starters, including seniors Anthony Mendicino, a wide receiver, and lineman Joe Toth. 3. Jackovic returns for QV after shining in the WPIAL title game. He had two interceptions and seven tackles, finishing the season with 76 tackles and seven INTs. 4. Quaker Valley will take on Aliquippa in Week 2 in a rematch of the WPIAL championship game.\nExtra point: Moore is a Kent State baseball recruit.\nClass 2A\nCentury\n1-2A Washington (1-0, 0-0) at 5-2A Charleroi (0-0, 0-0)\n7 p.m. Friday at Cougar Stadium, Charleroi\nRadio/Internet: 1450 AM; TribHSSN.triblive.com.\nLast week: Washington 59, Laurel Highlands 25; Charleroi was idle.\nCoaches: Mike Bosnic, Washington; Lance Getsy, Charleroi\nTop players: Zack Swartz, Washington (Jr., 6-3, 195, QB/DB); Geno Pellegrini, Charleroi (Sr., 6-0, 165, QB/DB)\nKeep an eye on: Zahmere Robinson, Washington (Jr., 6-0, 170, WR/DB)\nMomentum: Washington looked to be in mid-season form in the opener, erupting for 59 points. Charleroi administrators chose to cancel the Cougars’ game at Monessen because of threats to the students.\nFour downs: 1. Swartz cut his arm loose in Week Zero, throwing for 379 yards and three touchdowns on 16 of 20 passing. He connected with Robinson for scores of 62 and 74 yards. 2. Washington’s Dan Walker, a Division I prospect, returned a kickoff 94 yards for a score. 3. Pellegrini threw for 2,333 yards and 24 touchdowns a year ago. 4. Also back for the Cougars are WR Dakota Romantino (1,033 yards) and RB Hunter Perry (1,060 yards).\nExtra point: Washington’s female kicker Lilly Christy is a fourth-year starter.\nClass A\nBig Seven\nSto-Rox (0-1, 0-0) at 4-A OLSH (1-0, 0-0)\n7 p.m. Friday at Moon Tiger Stadium, Moon\nRadio/Internet: TribHSSN.triblive.com.\nLast week: South Side Beaver 28, Sto-Rox 26; OLSH 41, Westinghouse 6\nCoaches: LaRoi Johnson, Sto-Rox; Dan Bradley, OLSH\nTop players: Eric Wilson, Sto-Rox (Jr., 6-3, 180, QB); Tyler Bradley, OLSH (Sr., 6-3, 195, QB)\nKeep an eye on: Noah Campalong, OLSH (Jr., 5-11, 195, RB/LB)\nMomentum: OLSH reached the WPIAL quarterfinals last season and looked strong in a Week Zero triumph.\nFour downs: 1. One of the WPIAL’s top passers last season, Tyler Bradley got off to a solid start last week, completing 11 of 18 passes for 201 yards and three touchdowns. He also ran for a 1-yard score. 2. OLSH’s Campalong caught a TD pass and ran for one last week. 3. Wilson bolstered the Sto-Rox offense last week with 395 passing yards and four touchdowns. 4. Amahd Pack was Wilson’s favorite target with four catches for 232 yards and three scores.\nExtra point: Johnson, Sto-Rox’s first-year coach, guided Imani Christian’s offense last season as the offensive coordinator, helping the Saints reach the WPIAL Class A title game.", "url": "https://apnews.com/8a67989a3b054f04b6cf044fc7e3e170"}