{"authors": ["Jason Wilde For The State Journal"], "date_download": "2020-05-04 20:12:27", "date_modify": "2020-05-04 20:12:27", "date_publish": "2018-05-23 15:30:00", "description": "GREEN BAY — Why cut Jordy Nelson and then add Dez Bryant a couple months later? That was Aaron Rodgers’ thought, too. The Green Bay Packers quarterback’s first reaction Tuesday when asked...", "filename": "_4b85b0bd9d5845b49261ea4bdcd5da0e_1588623147.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4b85b0bd9d5845b49261ea4bdcd5da0e_1588623147.html", "title": "Aaron Rodgers says Packers sticking with youth at receiver", "title_page": "Aaron Rodgers says Packers sticking with youth at receiver", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GREEN BAY — Why cut Jordy Nelson and then add Dez Bryant a couple months later? That was Aaron Rodgers’ thought, too.\nThe Green Bay Packers quarterback’s first reaction Tuesday when asked what he thought of the idea of the Packers bringing in Bryant, the ex-Dallas Cowboys star, was to deliver a variation on his I-know-my-role, players-play spiel from last month.\nRodgers hadn’t forgotten the stir he created earlier in the offseason with his comments about losing Nelson, his long-time wide receiver and close friend who was cut March 9 and signed with the Oakland Raiders, and losing confidante and quarterbacks coach Alex Van Pelt, who let his contract expire and was not retained. And the way Rodgers figures it, Bryant probably isn’t going to be his teammate anyway, so there’s no real point in even talking about the possibility.\nHaving just spent his second organized team activity practice of the offseason with a three-receiver set of Randall Cobb, Geronimo Allison and DeAngelo Yancey running with the first unit, Rodgers couldn’t stay silent.\nSo after his initial reply — “I’m paid to play quarterback, so I don’t make those decisions,” he said when first asked about the Packers adding Bryant — Rodgers did entertain the idea, unlikely though it may be.\n“We like young receivers. So I’m assuming that’s the way they’re going to keep going,” Rodgers said, referring to the three rookie wide receivers – fourth-rounder J’Mon Moore, fifth-rounder Marquez Valdes-Scantling and sixth-rounder Equanimeous St. Brown — the team drafted last month. “I don’t know why you’d cut Jordy and bring in Dez.\n“But (Bryant) is a talented player. He’s going to end up somewhere. If he ends up here, we’d obviously welcome him with open arms and get him up to speed as quick as possible.”\nThe idea of the still-unsigned Bryant landing with the Packers was fueled last week when his former Cowboys teammate, new Monday Night Football analyst Jason Witten, predicted Bryant would end up in Green Bay.\nWith No. 1 wide receiver Davante Adams not practicing because of a hamstring injury — albeit a minor one, given how Adams leap-frogged over practice referee Larry Van Alstine while Van Alstine was standing on the sideline — Rodgers was left with Cobb, Allison (who is penciled in as the No. 3 receiver after 35 receptions his first two seasons) and Yancey, a fifth-round pick a year ago who spent all of last season on the practice squad.\nWhen asked about the rookie receivers, Rodgers estimated he’d thrown “a combined one or two passes” to them in team drills through two practices, and historically, rookie receivers have not had immediate impacts in the Packers offense since Rodgers became the starting quarterback in 2008.\n“The key is — like we’ve always said with young receivers — you’ve got to put yourself in position to get reps with me, and then be very sound on your assignment and make some plays,” Rodgers said. “Then that’s how you get a chance to get out there and make some plays (with the No. 1 offense).”\nMiddle man\nIt was a different feeling to have a locker room full of players and Nelson not be one of them. Change may be constant in the NFL, but it’s not every day that a 10-year veteran and pillar of the team departs.\nThat led to Nelson being a popular topic during interviews, and Adams revealed an interesting tidbit when Nelson’s name came up: He played matchmaker with Nelson and his new quarterback in Oakland, Derek Carr. Carr was Adams’ quarterback in college at Fresno State.\n“We had a, like a 5 1/2-hour dinner in California,” Adams said. “We went to a steakhouse out there, and I was trying to get them acquainted, because I was pushing for it. Because if you are going to be anywhere, I want you to be with my old quarterback because I trust him, I know how he is.\n“Oakland is a great match for him, he was real excited about it. From what I heard from the waiter, before I got there, things were a little different – it was a little (awkward), just because they didn’t really know each other yet. Then I came in, worked my magic, and now he signed. It was good. I’m excited for him.”\nLine dancing\nWith right tackle Bryan Bulaga coming off reconstructive knee surgery, Lane Taylor having undergone offseason ankle surgery and the right guard job wide open, the No. 1 offensive line was in flux Tuesday. While left tackle David Bakhtiari and center Corey Linsley were in their usual spots, Jason Spriggs and Adam Pankey worked at right tackle, Justin McCray manned right guard and Lucas Patrick filled in for Taylor.\nMcCray and Patrick are expected to compete for the right guard spot that came open when veteran Jahri Evans didn’t come back. Spriggs, who suffered a dislocated kneecap late last season, was limited in his team reps and wore a bulky brace on his left knee. Kyle Murphy, who suffered a season-ending foot injury last year, was at practice but didn’t do any of the 11-on-11 work.\n“I think it’s a heck of an opportunity for guys to rotate in and do a lot of things,” offensive line coach James Campen said. “Obviously we’d love to have Bryan and everybody out there doing their thing, but even if everybody was there, there’d still be some rotation going on.”\nExtra points\nOnly two players were absent — cornerback Tramon Williams and safety Ha Ha Clinton-Dix. While a player can’t technically be “excused” from a voluntary practice, both players were thought to have family-related conflicts. … Players who didn’t practice for injury-related reasons included outside linebackers Clay Matthews (knee) and Nick Perry (ankle), wide receivers Trevor Davis (hamstring) and Colby Pearson (hamstring), and tight end Emanuel Byrd (hamstring). None of their injury issues are thought to be serious, and Matthews said his knee, on which he had minor surgery after last season, “feels real good.”", "url": "https://apnews.com/4b85b0bd9d5845b49261ea4bdcd5da0e"}