{"authors": ["Plain Dealer Staff"], "date_download": "2020-05-04 20:22:28", "date_modify": "2020-05-04 20:22:28", "date_publish": "2018-12-04 15:56:23", "description": "Local events assure that World War II attack on Pearl Harbor has not been forgotten CLEVELAND, Ohio – Two events will be held in Northeast Ohio to commemorate December 7, the date that the...", "filename": "_b85f669efb9e49a186b11ec11129d5f6_1588623748.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b85f669efb9e49a186b11ec11129d5f6_1588623748.html", "title": "Local events assure that World War II attack on Pearl Harbor has not been forgotten", "title_page": "Local events assure that World War II attack on Pearl Harbor has not been forgotten", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Local events assure that World War II attack on Pearl Harbor has not been forgotten\nLocal events assure that World War II attack on Pearl Harbor has not been forgotten\nCLEVELAND, Ohio – Two events will be held in Northeast Ohio to commemorate December 7, the date that the Japanese attacked Pearl Harbor, Hawaii, in 1941, prompting America’s entry into World War II.\nThe attack on the U.S. naval base and nearby military installations killed more than 2,400 Americans, including civilians, and destroyed or damaged nearly 20 American vessels, including eight battleships.\nAt 11:30 a.m. a commemoration of the attack will be held at the USS Cod Submarine Memorial, 1201 North Marginal Road.\nThe public ceremony at the World War II sub will include casting a memorial wreath on the waters of Lake Erie.\nA coffee reception will follow at the adjoining Burke Lakefront Airport concourse, Gate 5.\nA vintage military vehicle parked outside Hellriegel’s Inn in Painesville Township has been used in the past to add some authenticity to its annual Pearl Harbor remembrance dinner on December 7. Brian Albrecht/The Plain Dealer\nAnother annual tradition for nearly 50 years has been a Pearl Harbor remembrance dinner at Hellriegel’s Inn, 1840 Mentor Avenue, in Painesville Township.\nThe event was started in 1965 by Bill Kochever, owner of Hellriegel’s Inn, who had served during World War II aboard the aircraft carrier USS Enterprise.\nVeterans filled the restaurant, and guest speakers included top military officials of World War II and celebrities including sports legends Ted Williams, Otto Graham, and Woody Hayes.\nAfter Kochever’s death in 1995, the new owners – Army veterans Albert Di Iorio and Silvio Trifiletti – resumed the Pearl Harbor dinners in 2000.\nIn a hall decorated with battle flags and banners, where veterans often still come in uniform (once a requirement), guest speakers have included Indians baseball pitcher Bob Feller, Cleveland Browns head coach Sam Rutigiliano, Cleveland Browns player Dick Shaftrath, and Joe Lesniewski one of the original 101st Airborne “Band of Brothers” of World War II.\nThis year’s guest speaker will be West Point graduate and retired Army Lt. Colonel Gary Minadeo, of Cleveland.\nThe event starts with a social hour at 6 p.m. followed by a steak dinner at 7. Cost is $35 per person.\nFor more information and tickets, call (440) 354-9530.", "url": "https://apnews.com/b85f669efb9e49a186b11ec11129d5f6"}