{"authors": ["Lacie Piersonhd Media"], "date_download": "2020-05-04 20:13:59", "date_modify": "2020-05-04 20:13:59", "date_publish": "2018-08-01 07:50:33", "description": "CHARLESTON — T he founding director of the Appalachian Children's Chorus said the future of the organization has been jeopardized by a former executive director who embezzled nearly $100,000 from...", "filename": "_1316076db68245269488f8c0a62ac394_1588623239.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1316076db68245269488f8c0a62ac394_1588623239.html", "title": "Hurricane woman sentenced for embezzling from children's choir", "title_page": "Hurricane woman sentenced for embezzling from children's choir", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLESTON — T he founding director of the Appalachian Children’s Chorus said the future of the organization has been jeopardized by a former executive director who embezzled nearly $100,000 from the chorus during the course of about seven years.\nSelina Midkiff, who founded the chorus 27 years ago, said the grief caused by the actions of former executive director Jacqueline Holly Portillo has been “beyond words” for the children, staff and supporters of the chorus.\nOn Monday, Kanawha Circuit Judge Dan Greear sentenced Portillo, 51, to four concurrent terms of between one and 10 years in prison for embezzling a little more than $97,000 from the chorus between March 2010 and August 2017.\nPortillo pleaded guilty to four counts of embezzlement in June.\nDuring Portillo’s sentencing hearing, Midkiff said the chorus has let go of staff and cut programs, and the payments they make to cover the costs incurred by Portillo’s embezzlement each month are equal to tuition and costs for one child to participate in the program.\n“The future remains very uncertain,” Midkiff said. “We look to you, your honor, for justice in this matter. ... We have story after story of the children’s lives we have positively changed after 27 years of this program. She put this in jeopardy.”\nKanawha Assistant Prosecutor Rob Schulenberg noted Portillo’s embezzlement wasn’t a one-time incident, but a years-long scheme in which she used the chorus’ money to go to the beach, stay in hotels, buy meals and pay thousands of dollars in veterinarian’s bills.\n“She not only destroyed (the organization) by stealing the money, she covered it up,” Schulenberg said. “It was a willful, intentional, deliberate, malicious and evil plot that she executed.”\nChristy Deitz, an executive assistant at the chorus, said she discovered the embezzlement in 2017.\nShe said the chorus staff investigated the organization’s financial records and found Portillo forged credit card statements and went as far as to change descriptions of credit card purchases and completely eliminate charges from the card statements.\n“Because of Ms. Portillo’s actions, this beloved organization is now in survival mode,” Deitz said in court.\nPortillo’s attorney, Ben Freeman, argued for a sentence of home confinement for Portillo to allow her the opportunity to pay restitution to the chorus.\nFreeman said Portillo hadn’t been able to find a job in order to begin restitution payments to the chorus, nor had she been able to secure bank loans or other financial support to pay back the chorus.\nPortillo was taken into police custody immediately following the hearing.\nBefore she was sentenced, Portillo said she had been selfish and said she was on a journey to understand more about what caused “this problem.”\n“It’s made me also realize that my actions created so much hurt for you all, and for a while, I couldn’t even look at anything to do with ACC because every time I looked it hurt me because I knew what I did, and I couldn’t think about it,” Portillo said. “I had dreams about all of you. I had dreams thinking about what you would say or do if I looked at you face-to-face, and I couldn’t think about that because I would see the pain that I’m seeing on you right now.”\nAfter Portillo left the courtroom in handcuffs, Midkiff said her focus remained on supporting children in the choir, even if Portillo had not chosen the same path.\n“She had choices every step of the way, and she chose to steal from children,” Midkiff said.\nReach Lacie Pierson at lacie.pierson@wvgazettemail.com, 304-348-1723 or follow @laciepierson on Twitter.", "url": "https://apnews.com/1316076db68245269488f8c0a62ac394"}