{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:26:11", "date_modify": "2020-05-04 20:26:11", "date_publish": "2018-05-02 08:05:37", "description": "This is one of a series of columns written by candidates in contested races in the May 8 West Virginia primary election. Most Americans are aware that our country is not well. We know that...", "filename": "_183d5caa98d1447cb77a7482da4e124f_1588623971.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_183d5caa98d1447cb77a7482da4e124f_1588623971.html", "title": "Greatest threat to America is Congress", "title_page": "Greatest threat to America is Congress", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This is one of a series of columns written by candidates in contested races in the May 8 West Virginia primary election.\nMost Americans are aware that our country is not well. We know that the greatest country on earth, America, has a debt so large that we cannot even conceive of a path to retiring it.\nWe also know that our country is sickened by a drug addiction so out of control that an American dies of an overdose every eight minutes. We know that just last year more Americans died from a drug overdose than died in the entire 18-year Vietnam war.\nWe must reduce the number of these prescription opiate pills that find their way onto our streets.\nAnd we must drug test the leaders in our education system and our political system to make sure all of them are drug free. Every teacher, every Senator, every elected official.\nWe must Build The Wall and fiercely police our borders, to ensure that heroin or synthetic drugs from Mexico or Asia do not replace illicit prescription drugs.\nWe are aware that 12 million non-Americans live illegally in the United States and that they commit lots of crime. We know that they receive benefits at our expense that many Americans do not receive. For example, many illegal immigrants go to our taxpayer-funded universities and pay in-state tuition rates.\nFair trade under President Trump will bring more jobs here, and we will need lots more healthy and sober men and women to do those jobs.\nAmericans are aware that they fund the policing of the world even as our debt rises by hundreds of billions of dollars each year. Our Navy even runs commercials on television saying “America’s Navy: A global force for good.” Another ad proclaims “Defending democracy around the world.”\nOur government’s intentions may be good. But if we do not control government spending, stop illegal immigration, stop trying to defend countries of the world from each other, and stop feeding opiate drugs to our children, we cannot make America great again. The greatest threat to America is not a foreign power nor global warming.\nThe greatest threat to America is our government — our Congress.\nMy conservative and Republican views have been public for a long time. I am a competitionist. I want our workers and companies and even our local governments to win the battles when companies and the federal government decide where to build or move or expand.\nI’ve spent much time and many of my own dollars trying to repair our state’s unfair courts. I’ve done the same while rebuilding the West Virginia Republican Party to field candidates for every legislative office.\nMy campaign to remove the food tax on groceries in West Virginia began in 2005 and has saved taxpayers well over a billion dollars. More than $300 per West Virginia family each year.\nI’ve donated substantially to pro-life causes.\nI’ve had my 1st and 2nd amendment rights and my civil liberties attacked.\nOne man cannot do everything. But if we all do our best, West Virginia will be a place to be proud of and a place where our children can pursue their happiness throughout their childhood and their adult lives.\nMy story is unique. I grew up in a single-parent home, poor. There, for years we used an outhouse. To help pay my tuition at Marshall, I was thrilled to work at a coal mine and clean up in a warm bath house. After some success as an accountant and managing coal companies, I was invited to eat at the White House. A couple years ago, another president sent me to the Big House.\nAs your senator, my commitment to all West Virginians and all Americans is that I will put America’s house and Americans first. You can count on it.\nDon Blankenship, a resident of Sprigg, is a Republican candidate for the U.S. Senate.", "url": "https://apnews.com/183d5caa98d1447cb77a7482da4e124f"}