{"authors": ["Evan Bland", "World-Herald Service"], "date_download": "2020-05-04 20:10:15", "date_modify": "2020-05-04 20:10:15", "date_publish": "2018-11-18 18:38:00", "description": "Tracking the offense The game plan Plan A for Nebraska is always to gain yards in chunks, but no first-half play went longer than 17 yards — that was an Adrian Martinez keeper....", "filename": "_7198d5d3254b4462b5dfeccdd2fe677a_1588623015.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7198d5d3254b4462b5dfeccdd2fe677a_1588623015.html", "title": "Nebraska-Michigan State: Tracking the offense, defense", "title_page": "Nebraska-Michigan State: Tracking the offense, defense", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tracking the offense\nThe game plan\nPlan A for Nebraska is always to gain yards in chunks, but no first-half play went longer than 17 yards — that was an Adrian Martinez keeper. Sustained drives didn’t work, either, with a physical Michigan State defense bottling up the run and forcing four fumbles. The Huskers missed the injured JD Spielman, especially on the quick swing passes that are a staple of the Scott Frost offense.\nThe adjustments\nThe second-half numbers weren’t pretty: 116 total yards, 1 of 7 on third down, three punts and three field goals. But in a field-position game, the offense didn’t turn the ball over, either. With NU down 6-0 early in the fourth quarter, Frost’s decision to kick the first field goal on fourth-and-9 at the Michigan State 19 proved to be the right call.\nNebraska star\nHow about the kicker? Barret Pickering — an Alabama native who had never kicked in snow — hit all three of his fourth-quarter tries from 36, 20 and 47 yards in swirling, snowy conditions. After a shaky start to his NU career, the freshman was clutch Saturday, accounting for all the Husker scoring.\nStat of the game\n81: Years since Nebraska had won a game without scoring a touchdown (3-0 at Kansas State in 1937). The Huskers were also outgained 289-248 Saturday.\nFinal word\nThis won’t settle the debate as to whether Frost’s up-tempo offense can thrive in adverse conditions against an elite opponent. Proponents can point to the bottom line — a victory — and the fact that NU left at least one other touchdown on the field on the missed throw to Stanley Morgan. Detractors see the poor conversion rate on third and fourth downs (4 of 16) and the lowest completion percentage (43.2) of Martinez’s career. The season finale against Iowa just became even more intriguing.\nTracking the defense\nThe game plan\nThe secondary came to play, forcing backup Rocky Lombardi to throw incomplete on 13 of his 17 first-half attempts and lowering the boom on multiple hits. The Spartans broke a few long runs — two on quarterback draws — but couldn’t take advantage of two fumble recoveries and NU penalties.\nThe adjustments\nFour punts, a turnover on downs and a fumble — created after safety Antonio Reed lowered the boom on a quarterback blitz — accompanied a lone Michigan State field goal in the second half. As the snow accumulated, so did Nebraska’s pass breakups (eight) and confidence. The final stand was a cathartic moment for a unit that has endured its share of frustration this season.\nNebraska star\nReed: The senior balled out. His forced fumble set up Nebraska for the tying field goal in the fourth quarter. He also added seven tackles and two pass breakups and snagged Michigan State’s Hail Mary pass before halftime.\nStat of the game\n41: Net yards per punt by Isaac Armstrong on five attempts. The junior walk-on twice pinned Michigan State inside its own 20, including a 53-yarder that eventually led to Reed’s forced fumble.\nFinal word\nFrigid weather and an anemic MSU offense agreed with the Blackshirts. The secondary in particular seemed to have a hand on most pass plays, and the line held the Spartans to 3.8 yards per rush. While the offense struggled, the D showed for the first time under Frost that it could win a game on its own. This was a step forward — and a rare mastery of a power-running team — for the group with the most question marks coming in.", "url": "https://apnews.com/7198d5d3254b4462b5dfeccdd2fe677a"}