{"authors": ["Hilary Matheson Daily Inter Lake"], "date_download": "2020-05-04 20:10:28", "date_modify": "2020-05-04 20:10:28", "date_publish": "2018-10-06 05:00:01", "description": "On Tuesday, the windows into two neighboring preschool classrooms at Russell Elementary provided a peek at contrasting pictures. In Denice Malley's classroom preschoolers moved all around...", "filename": "_0c558688298344729eef62ee2541a474_1588623028.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0c558688298344729eef62ee2541a474_1588623028.html", "title": "Preschool grant in final year", "title_page": "Preschool grant in final year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "On Tuesday, the windows into two neighboring preschool classrooms at Russell Elementary provided a peek at contrasting pictures.\nIn Denice Malley’s classroom preschoolers moved all around the room in the thick of supervised free play. Next door, teacher Beth Lincoln led a circle of preschoolers in a song about dinosaurs, using hand motions to emphasize words.\nAlthough the activities looked different, both involved learning through play.\n“A part of early childhood education is that play is the child’s work,” said Kalispell Public Schools preschool family engagement coordinator Mary Buenz.\nFor some students, this is their first exposure to interacting and learning with their peers.\n“Some kids have never had exposure to socializing, which is such a big part of what preschool is,” she added.\nThe preschool program uses a curriculum focused on helping children develop social and emotional skills through directed instruction - such as songs - and free play. In addition to the two classrooms at Russell, Peterson Elementary also has a preschool classroom serving 54 students.\n“The core of our program is always social, emotional development, self-regulation. How we interact in this space, how we interact with one another, how we handle our own business, how we label our emotions,” Lincoln said. “And then our academic jumps off from there.”\nThe program is in its final year of receiving a Montana Preschool Development Grant through the Department of Education. Over the last two years the cost to educate a preschool student in Kalispell Public Schools has been approximately 6 million through 2020 to expand preschool opportunities for 4- to 5-year-olds. Prior to that, Montana was one six states that did not provide state funds for public preschool. Flathead Valley Community College Early Childhood Center was one of the beneficiaries to pilot the program, called STARS.\nIf federal or state funding doesn’t come through, Kalispell Public Schools clerk Gwyn Andersen said the district would likely seek out alternative funding sources or consider a two-year kindergarten model with one year designed as a transitional year as some districts have done in the state.\nMalley and Lincoln said that longitudinal studies show a lifelong impact for children who attend preschool, from higher high school graduation rates and less need for remedial programs. They also noted research has shown decreases in drug use, incarceration and teenage pregnancy.\nFor every 4 to $12 can be realized according to the University of Pennsylvania, which cited the National Forum on Early Childhood Policy and a 2009 study of Perry Preschool.\n“As Americans I think we want some immediate gratification so the idea that funding early education pays off 20 years down the road isn’t helping plan our funding now,” Malley said when asked about why there is some resistance to state-funded preschool. “We don’t necessarily always think of our children as the resource that they are and investing in that resource.”\nTeacher Jamie Congdon, with 15 years of experience in Bigfork, Columbia Falls, Polson and Kalispell schools, has seen the difference in kindergarten readiness of children who have attended high-quality preschool programs. She currently teaches at kindergarten at Rankin Elementary in Kalispell.\n“Students coming to kindergarten from a highly qualified preschool demonstrate a greater ability to share, take turns, ask for help, respond appropriately to their peers, follow directions and use their everyday tools correctly,” Congdon said. “These are all things that help them become an actively involved member of our learning family without distracting from their own learning.\n“When they come with some understanding of the importance and purpose of our written language and numbers, their learning advances significantly, even after just a few weeks of school.”\nReporter Hilary Matheson may be reached at 758-4431 or hmatheson@dailyinterlake.com.", "url": "https://apnews.com/0c558688298344729eef62ee2541a474"}