{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:10:07", "date_modify": "2020-05-04 20:10:07", "date_publish": "2018-04-20 19:16:59", "description": "A team that included Rich De Martino of Riverside reached the finals of the annual North American Open Teams championship after a weekend of qualifying rounds were held in Sturbridge, Mass., last...", "filename": "_09d23324e2cf420f8e8e13b57676613c_1588623007.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_09d23324e2cf420f8e8e13b57676613c_1588623007.html", "title": "Riverside man competes for chance at national final", "title_page": "Riverside man competes for chance at national final", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A team that included Rich De Martino of Riverside reached the finals of the annual North American Open Teams championship after a weekend of qualifying rounds were held in Sturbridge, Mass., last weekend.\nHe and his team will meet another foursome headed by Doug Doub of Hartford in early May to determine which of them will represent New England at the national final in Atlanta this summer.\nDe Martino and his teammates - Geoff Brod, Karen McCallum and Alan Rothenberg - won their semifinal match Sunday afternoon by a fairly comfortable margin over a team led by Victor King of Hartford to set up the confrontation with Doub’s group. Normally, the final match would take place immediately following the conclusion of the semifinals on Sunday, but transportation conflicts for one member of each team caused the final to be postponed to the later date.\nThe 32-board clash between De Martino and Doub will start with Doub holding a 20-IMP lead, which was attained when the two teams met during a round-robin qualifying match on Saturday.\nToday’s quiz: Here is another in the current series of quizzes on closeout bids. In the following problem, you are to decide whether the last bid made in the given auction is a genuine closeout barring partner from further action. The bidding:\nOpener-1C; Responder-1S; Opener-1NT; Responder-4S.\nAnswer: Closeout. When opener bid one club, his hand was undefined, as was responder’s when he bid one spade. But when opener rebid one notrump at his second turn, he described a hand of 12-14 points with balanced distribution and two or three spades.\nHaving heard opener thus limit his hand in points and distribution, responder is in position to set the final contract it he so wishes. In this case, obviously holding a long spade suit in a hand strong enough to warrant game, he has opted for a game in spades. If responder felt a slam was possible, or that there might be a better chance for game elsewhere, he would not have bid four spades at his second turn.\nThe week’s duplicate results:\nGreenwich YWCA weekly open duplicate: North-South, 1. Dave Babson-Dorothea Bellafiore, 2. Leia Berla-Sharon Santow, 3. Carol Cram-Penny Foote, 4. Renate Fremuth-Joyce Grieb; East-West, 1. Mary Scarfi-Lois Spagna, 2. Jay Force-Terry Lubman, 3. Grant Perkins-Bruno Schrage, 4. Lynne Rohrer-Jackie Stone.\nCentral Connecticut Bridge Club weekly duplicate, 4/13: North-South, 1. Sanjay Santhanam-Ann Scheuer. 2. Sandy and Kurt Schaffir, 3.\nKatherine Austin-Marilyn Gordon; East-West, 1. Diane De Fruscio-Debbie Trager, 2. Audrey Dorner-Regina Pitaro, 3-4. Rosemary Cronin-Hillary McGuire, Joanne Marr-Wendy Rehberger.", "url": "https://apnews.com/09d23324e2cf420f8e8e13b57676613c"}