{"authors": ["Mary Pickels"], "date_download": "2020-05-04 20:18:18", "date_modify": "2020-05-04 20:18:18", "date_publish": "2018-01-24 06:06:52", "description": "Popular downtown Pittsburgh eatery Six Penn Kitchen will close its doors in mid-February. Manager David Fortunato referred a call for comment to Eat'n Park Hospitality Group, which includes...", "filename": "_d69fbdfeb872499a84674cecb1687e09_1588623498.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d69fbdfeb872499a84674cecb1687e09_1588623498.html", "title": "Cultural District's Six Penn Kitchen closing its doors in February", "title_page": "Cultural District's Six Penn Kitchen closing its doors in February", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Popular downtown Pittsburgh eatery Six Penn Kitchen will close its doors in mid-February.\nManager David Fortunato referred a call for comment to Eat’n Park Hospitality Group, which includes Eat’n Park Restaurants and several neighborhood bistro concepts like Six Penn Kitchen.\nSpokeswoman Becky McArdle confirmed the planned closing in an email, noting that staff members will have other employment opportunities within the organization.\n“After 12 years, Six Penn Kitchen will be closing on Feb. 17. We launched Six Penn Kitchen in 2005, inspired by the chef-driven culture we had developed in our Parkhurst Dining business. We wanted to bring that food-forward focus to a restaurant concept, and we are thrilled we were able to share our culinary and cocktail creations with our many guests for more than a decade,” a release states.\nThe 146 Sixth St. site is known for its rooftop dining option, and menu items some diners might find exotic, including oxtail pasta, confit cracklin’ pork shank and bison burgers. It was a popular place for before and after-show bites, with its location in the heart of the city’s Cultural District.\nOver the years, the release says, Six Penn has faced “ever-growing competition downtown,” while the company’s newer restaurant concepts — The Porch, with locations in Oakland and Pittsburgh’s South Hills, and Hello Bistro, which has six locations in the Pittsburgh area and is opening soon in Cleveland — have continued to grow.\n“Closing Six Penn will enable us to focus more resources on the growth of these multi-location restaurant brands, as well as our core Eat’n Park Restaurants and Parkhurst Dining businesses,” it says.\n“We are especially grateful to the many team members who contributed their talents to the success of Six Penn. Our single greatest strength has always been our team members and we are offering them opportunities at our six Hello Bistro locations, The Porch at Schenley, The Porch at Siena, Eat’n Park Restaurants and Parkhurst Dining,” it says.\n“We’re also extremely proud of the hourly team members that started at Six Penn Kitchen, and have gone on to grow in their careers with many of our brands at Eat’n Park Hospitality Group. ... We are proud of Six Penn’s contributions to the burgeoning Pittsburgh restaurant scene, and we are grateful to have been a part of the careers of so many successful restaurant entrepreneurs.\n“We look forward to having one more chance to serve our guests and friends and say farewell over the next month,” the release says.\nMary Pickels is a Tribune-Review staff writer. Reach her at 724-836-5401 or mpickels@tribweb.com or via Twitter @MaryPickels.", "url": "https://apnews.com/d69fbdfeb872499a84674cecb1687e09"}