{"authors": ["Jonathan Oosting", "Mike Martindale"], "date_download": "2020-05-04 20:07:05", "date_modify": "2020-05-04 20:07:05", "date_publish": "2018-02-15 16:49:21", "description": "A radiology department chairman suspended last week by Michigan State University for allegedly failing to fully cooperate with investigations into disgraced sports doctor Larry Nassar has resigned...", "filename": "_f6a2685da85a44aaae53a2c65097e163_1588622825.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f6a2685da85a44aaae53a2c65097e163_1588622825.html", "title": "Suspended MSU doc resigns from state health care board", "title_page": "Suspended MSU doc resigns from state health care board", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A radiology department chairman suspended last week by Michigan State University for allegedly failing to fully cooperate with investigations into disgraced sports doctor Larry Nassar has resigned from a state health care commission upon request of Gov. Rick Snyder.\nA spokeswoman confirmed Thursday that Snyder had asked Dr. Suresh Mukherji to step down from the Certificate of Needs commission, which develops standards for new health care facility investments. Members are appointed by the governor.\nMSU suspended Mukherji last week and announced the move Friday. He chaired the Department of Radiology and had served as chief medical officer of the MSU HealthTeam.\nSnyder asked for Mukherji’s commission resignation Monday and received confirmation Thursday morning, said Snyder spokeswoman Anna Heaton.\n“His role on the commission was that of a physician representing a school of medicine or osteopathic medicine,” Heaton said. “With the suspension, we thought it best to find another candidate to serve in that role.”\nMukherji could not be reached for comment Thursday.\nMSU Interim President John Engler on Wednesday named Anthony Avellino, chief executive officer of OSF Healthcare Illinois Neurological Institute, as the new chief medical officer of the MSU Health Team. He’ll also assume the role of assistant provost for student health.\nEngler is also attempting to fire William Strampel, the former dean of the College of Osteopathic Medicine, who was Nassar’s boss and recently took a leave of absence.\nAlso on Thursday, a scheduled hearing to determine whether Snyder should conduct an inquiry into MSU’s Board of Trustees in the wake of the Nassar scandal was adjourned on request of Snyder’s attorney.\nSnyder’s attorney, retired Michigan Supreme Court Justice Robert P. Young, sought the adjournment, explaining he was currently in Florida and had not received sufficient notice to attend the Court of Claims hearing in Detroit.\nJudge Cynthia Diane Stephens subsequently moved the hearing to Feb. 28, according to attorney Jeffrey A. Hank, who represents Dennis Lennox, a Republican strategist from Cheboygan County who wants Snyder to do a formal inquiry into former MSU President Lou Anna Simon and the eight-member board for “gross neglect, misfeasance and or malfeasance.”\n“The governor had said he doesn’t have the power to do this (inquiry) or doesn’t want to get involved,” Hank said. “Everyone in the world has heard of the Larry Nassar scandal. This isn’t going away. It’s a novel (legal case) of what the governor’s duty is, and there are eight agencies in and outside Michigan looking into who may have had knowledge into wrongdoing and failed to safeguard people. We think it’s important for the governor of Michigan to certainly be involved with it.”\nLennox’s complaints for an inquiry — which twice went unanswered after Snyder said he had no constitutional powers or duty on the matter — alleges the MSU officials knew of at least 14 complaints regarding Nassar’s sexual abuse of patients over a 20-year period but failed to act. Nassar was ultimately convicted of multiple sexual acts and is now in prison.\nSimon subsequently resigned on Jan. 24, Engler has been named as her replacement and the trustee board remains intact but an inquiry might determine whether they should be removed, Hank said.\n“Removal may be discretionary, but let’s have an inquiry,” Hank said. “We believe the Board of Trustees have lost the public trust. The governor may not want to be involved in this, but we think it’s part of his job – not just for this situation but for future situations possibly involving other governors.”\nSeveral organizations, including the MSU faculty, have called on the trustees to step down voluntarily.\nThe Lennox complaint alleges Michigan Election law permits Snyder to remove a member off a state university board “for neglect of duty or for corrupt conduct in office or any other malfeasance.”\nWhile Snyder has said he has been told he has no such power, Richard McLellan, an MSU College of Law Board of Trustee member, told The News that Snyder has constitutional powers to remove and “shouldn’t be giving away his powers very early just because he’s got eight months left (in his term) and doesn’t want to get caught up in it.”\nYoung has also filed a legal motion seeking to have the complaint dismissed for lack of jurisdiction.\nHe noted in his filing, while the constitution “authorizes the governor to conduct an investigation of any ‘public officer’ and does so in mandatory terms, a line of Michigan Supreme Court cases dating back to 1874 has established that courts do not have jurisdiction to review the governor’s decision whether to act under a power conferred upon him by the Michigan Constitution. Few areas of law are supported by more than 100 years of solid precedent.”", "url": "https://apnews.com/f6a2685da85a44aaae53a2c65097e163"}