{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:13:02", "date_modify": "2020-05-04 20:13:02", "date_publish": "2018-12-01 15:00:00", "description": "Mark Daniel Schnell, 51, of Rochester, passed away peacefully of natural causes on Nov. 28, 2018, at Mayo Clinic Hospital-Saint Marys Campus. Mark was born on Aug. 17, 1967, in Rochester to...", "filename": "_6edaae3b07c84f24a5b450d32d480db6_1588623182.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6edaae3b07c84f24a5b450d32d480db6_1588623182.html", "title": "Mark D. Schnell -- Rochester", "title_page": "Mark D. Schnell -- Rochester", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mark Daniel Schnell, 51, of Rochester, passed away peacefully of natural causes on Nov. 28, 2018, at Mayo Clinic Hospital-Saint Marys Campus.\nMark was born on Aug. 17, 1967, in Rochester to Daniel and Diane Schnell. He graduated from Mayo High School in 1985. He attended University of Wisconsin Stevens Point for two years. Upon returning to Rochester, he worked at IBM. In 1995, he met Deanna Gosse. They were married on March 31, 2007. In 1998, Mark began working for Gopher Distributing (later Northern Distributing) in Rochester. Mark “bled purple” and was a devoted Minnesota Vikings fan. He loved spending time with family, camping, campfires, and was a true “jokester,” making many people laugh throughout his life. He will be truly missed.\nHe is survived by his wife, Deanna; two sons, Austin and Nicholas, all of Rochester; two stepdaughters, Heather and Rebecca Evenson, both of Wabasha; his brothers, Jeff Schnell and Mike (Tracy) Schnell, both of Byron; and grandchildren, Rilynn, Mackenzie, Oaklyn, August and Thomas.\nHe is preceded in death by his parents.\nThe funeral service for Mark will be held at 11 a.m. Saturday, Dec. 8, 2018, in the River Park Chapel at Macken Funeral Home. Visitation will be held from 5 p.m. to 7 p.m. on Friday, Dec. 7, 2018, in the River Park Chapel at Macken Funeral Home, and one hour prior to the service on Saturday. Burial will be in Oakwood East Cemetery in Rochester.\nIn lieu of flowers, memorials may be written to the family.\nOnline condolences are welcome at www.mackenfuneralhome.com.", "url": "https://apnews.com/6edaae3b07c84f24a5b450d32d480db6"}