{"authors": ["Aimee Blanchette"], "date_download": "2020-05-04 20:03:59", "date_modify": "2020-05-04 20:03:59", "date_publish": "2018-02-07 12:53:06", "description": "The world of local sports talk radio has been a traditionally male-dominated one, but KFAN 100.3 is mixing it up by adding its only female-hosted show to the stations lineup. Twin Cities...", "filename": "_cfa5fb8b16fb46eb8e6caa2fba49a7ab_1588622639.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cfa5fb8b16fb46eb8e6caa2fba49a7ab_1588622639.html", "title": "Carly Zucker's new KFAN show is station's first female-led program in a decade", "title_page": "Carly Zucker's new KFAN show is station's first female-led program in a decade", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The world of local sports talk radio has been a traditionally male-dominated one, but KFAN 100.3 is mixing it up by adding its only female-hosted show to the stations lineup.\nTwin Cities radio and TV personality, Carly Zucker, is joining the station as the host of a new show called Overtime that will share the personal stories and charitable endeavors of local professional athletes and how they spend their time off the field, court and rink.\nWell dive into the reason behind their philanthropic work, what makes them tick and, hopefully, just get to know them a little better, Zucker said.\nIts been about 10 years since the station has had a lead female host, said program director Chad Abbott.\nFrom professionals to Little Leagues, there are so many philanthropic stories to report that just need a platform that fits that storytelling, Abbott said. That is what I hope this show provides and Carly is the best one in town to tell it.\nZucker has been active in the local sports and philanthropic communities for years. Shes a familiar voice to KFAN fans as a regular guest on the popular Power Trip morning show. Previously, she hosted Minnesota Timberwolves Entertainment Network and reported for CBS Sports and FOX Sports North.\nIn 2016, Zucker married Minnesota Wild player Jason Zucker. Together, the couple launched the #GIVE16 campaign this winter to support the University of Minnesota Masonic Childrens Hospital. They are currently raising money for the Zucker Family Suite and Broadcast Studio, a space to serve pediatric patients and their families.\nEven after having our son, Hendrix, three months ago, she hasnt stopped thinking about how to better herself and her career while also making a difference in our community on a daily basis, said husband Jason Zucker.\nOvertime will begin Friday, Feb. 9 and air on Fridays at 6:30 p.m.\nZuckers first guest will be Vikings wide receiver Adam Thielen. Her lineup also includes Kyle Rudolph (Vikings), Ryan Dungey (Supercross champion) and of course, her husband. Zucker says she also hopes to interview players from the Minnesota Lynx.\nIts important to have a diverse group of people represented in any industry, Zucker said. I love hearing from listeners, men and women, that they appreciate hearing a female voice.", "url": "https://apnews.com/cfa5fb8b16fb46eb8e6caa2fba49a7ab"}