{"authors": ["James Walsh"], "date_download": "2020-05-04 20:08:49", "date_modify": "2020-05-04 20:08:49", "date_publish": "2018-03-03 14:47:47", "description": "Ten minutes after Listening House opened on a recent morning, 20 people already were eating doughnuts, settling into chairs and chatting with volunteers. An hour later, more than 50 filled space...", "filename": "_7b9d62767e33412f9efc97fce20ce824_1588622929.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7b9d62767e33412f9efc97fce20ce824_1588622929.html", "title": "Listening House has no plans to follow 20-person daily limit.", "title_page": "Listening House has no plans to follow 20-person daily limit.", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ten minutes after Listening House opened on a recent morning, 20 people already were eating doughnuts, settling into chairs and chatting with volunteers. An hour later, more than 50 filled space at the drop-in center that serves homeless and other needy people in the basement of a Daytons Bluff church.\nStarting April 2, by decree of the St. Paul City Council last December, Listening House is not supposed to allow any additional visitors after the first 20 arrive. Its a condition that Listening House Executive Director Cheryl Peterson has no intention of meeting.\nIm not going to close the door, she said.\nFirst Lutheran Church Pastor Chris Olson Bingea, who invited the nonprofit to her church basement last summer, has her back. Providing a place of warmth and welcome to all is part of First Lutherans mission, Olson Bingea said.\nTheyre not shutting the door and were with them in that, the pastor said. They have a lawyer and so do we.\nThe potential legal skirmish between the city and Listening House comes on the heels of complaints from church neighbors after the center moved to the East Side last year. For 22 years, Listening House had been located in the former Mary Hall at St. Josephs Hospital, but was displaced by Catholic Charities Higher Ground project.\nOlson Bingea, pastor for nearly 14 years, said inviting Listening House was a no-brainer for a church that already serves communal meals and conducts a weekly wellness center.\nThey do a lot of the same work we have been doing all along, she said. We knew what they were doing downtown and it very much makes sense for them to move here.\nBut, almost immediately, the arrival of Listening House in June 2017 and the behavior of some visitors prompted complaints. Neighbors started documenting what they saw. They photographed people napping on benches and trash left outside. They frequently called police and submitted a pile of documents to the city. They asked city officials to rethink the decision to allow the center near their homes.\nIve had people on my porch, intoxicated and in crisis, said Kristenza Nelson, who lives a few doors down from Listening House and has been in the neighborhood 19 years. I had a neighbor, going to a job, who stayed with a man who had passed out on their doorstep.\nWe are not evil homeless-haters. I think there is an absolute necessity for the type of hospitality that they provide, she said. But 15 children live within a block and a half. They deserve a safe street to live on.\nNeighbors want Listening House to screen their visitors for criminal records, provide increased security around the church and ban anyone under the influence of alcohol or other drugs, said Nelson.\nPeterson challenges some of those assertions.\nIt is not a crime to sit on a bench, she said, or to be homeless. Once, she said, a neighbor called police for a man simply sitting on the churchs steps. This area on the fringe of downtown and Swede Hollow Park has for years been challenged by crime, poverty and homelessness. Now, everything that happens is constantly attributed to Listening House, Peterson said.\nAccording to police, officers stopped in or were called to the church address 38 times between Sept. 1, 2017, and Feb. 17, 2018. Of those, 15 were proactive police visits; nine were for disturbances, several of which involved juveniles hanging around, Peterson said; one instance involved a theft; one was a report of indecent exposure; one for criminal damage to property.\nSenior Cmdr. Axel Henry, who leads the St. Paul Police Eastern District, is careful not to take sides. While the move of Listening House into the neighborhood led to an increase of some problems, he said, the wheels have not come off the cart here.\nOn the other hand, Henry and his officers can appreciate and empathize with the concerns of neighbors about Listening House.\nPeterson said she will not accede to neighbor demands to conduct criminal background checks or provide 24-hour security anathema to being a place that welcomes all in need, she said. Listening House doesnt allow visitors to use chemicals on the premises, she said, but it doesnt require them to be sober because theyre safer on the inside than outside.\nA summer and fall of complaints from neighbors led to hearings and, in December, a City Council vote that allowed Listening House to continue at the church, but added conditions such as posting clearly visible visiting hours, having staff arrive an hour early and stay an hour late and limiting the daily number of guests. Listening House will be required to come up with a plan to reduce its number of guests if it repeatedly surpasses 20 per day in a month.\nA spokesman for the St. Paul Department of Safety and Inspections said the centers permit could be revoked if the church or Listening House defy the council. Or the matter could be referred for more hearings, leading to conditions being modified or added.\nOn a day at Listening House last week, volunteers in one room washed visitors feet while staff members in another handed out toiletries and clothing. Peterson said neither the center nor the church wants to go to court. In fact, she said, the issues that have driven a wedge between neighbors and Listening House require the entire city to engage in a bigger discussion about poverty and homelessness.\nWe want to figure out with the city, how do you do this work every day in a way that works for everyone? Peterson said. But the way to do it is not to say You have to go, you have to go.andthinsp;\nJames Walsh 651-925-5041", "url": "https://apnews.com/7b9d62767e33412f9efc97fce20ce824"}