{"authors": ["Chris Quinn", "President", "Editor", "Advance Ohio Cleveland.Com"], "date_download": "2020-05-04 20:09:24", "date_modify": "2020-05-04 20:09:24", "date_publish": "2018-01-19 12:30:30", "description": "A Greater Cleveland asks you to give an hour a week to lift someone from poverty's stranglehold: Chris Quinn Imagine if you had a personal board of directors. Imagine if you had a team...", "filename": "_083a7b722446446a90fe1d32c8d85dc7_1588622964.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_083a7b722446446a90fe1d32c8d85dc7_1588622964.html", "title": "A Greater Cleveland asks you to give an hour a week to lift someone from poverty's stranglehold: Chris Quinn", "title_page": "A Greater Cleveland asks you to give an hour a week to lift someone from poverty's stranglehold: Chris Quinn", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Greater Cleveland asks you to give an hour a week to lift someone from poverty’s stranglehold: Chris Quinn\nImagine if you had a personal board of directors.\nImagine if you had a team of people who gathered each week for no other reason than to help you thrive.\nThey would advise you on having a sound financial footing, improving your healthcare and helping you find better housing. By encouraging you. By advocating for you.\nBy becoming your friends.\nThat’s what we think the answer is for the many people who have told us they want to make a difference in response to the project we call A Greater Cleveland. And, fortunately in Northeast Ohio, we have a little-known model that does exactly what I describe above. It’s called Open Table, and no, it’s not the restaurant reservation service of the same name.\nFive months after we began our storytelling for A Greater Cleveland, today we announce the call to action, which always has been the purpose of our poverty-tackling project. We ask that you consider joining Open Table and collaborate with six or seven others to help someone lift free from the stranglehold of multigenerational poverty.\nWe live in tough times. I get the sense these days that a lot decent people, turned off by the acrimony that dominates our national discussions, are searching for a way to make the kinds of personal connections that used to define this country. Open Table provides that opportunity. People get together with a single cause, to help someone, and end up becoming long-term friends. with the others on their tables and the person in need of the lift. They commit to meet face-to-face for an hour a week, and from there, the relationships bloom.\nThe stories that come from Open Table will inspire you and warm your heart, and you can find some of them in a profile of the program by reporter Emily Bamforth.\nTo help you to decide whether Open Table is right for you, Amber Donovan, a dedicated soul who organizes Open Table groups in Cleveland, will provide details and answer a questions from 6 to 8 p.m. Wednesday, Feb. 21, at our community room. You can sign up and get more information here. Amber will bring some people who participate in Open Table along with some people who have benefitted from it, so you can hear from them, too.\nWhen we started publishing A Greater Cleveland on cleveland.com and in The Plain Dealer last August, we said our goal was to spark the community to help identify and remove that barriers to success faced by children living in poverty in Cleveland.\nThe form of our storytelling has mainly been vignettes about the lives of some families living in poverty. We hoped to build empathy among our audience for people of lesser means. We thought that over months, many of you would be moved to get involved.\nWe were right about you wanting to get involved. We were, however, quite mistaken about it taking months. Your response was immediate and overwhelming, and you wanted ideas on what you could do.\nWe were not prepared with an answer. To find one, I enlisted the help of some people I met through Leadership Cleveland in 2015. These are special people who gave up a good bit of their time to help us find our way. In a series of meetings throughout the fall, two themes emerged.\nThe first was that we should find something already in existence that might scale up rather than go through the arduous task of creating something new.\nThe second was that we should aim to build relationships.\nFinding something that fit those themes was a challenge. I have to say I was pretty frustrated as the year neared its end. I had promised to come back to you with a call to action, but every time we thought we had a solution, we hit an obstacle that sent us back out to search.\nThroughout that time, I heard occasionally about Open Table, but I did not think it would be our solution because its focus is young adults who have aged out of foster care. Having no clear path to a solution, though, I arranged to meet with Amber to learn more.\nAmber floored me. Her passion for helping others and the stories she told brought tears to my eyes. And she was more than willing to collaborate with A Greater Cleveland and expand beyond foster care. I asked her what she would do if 100 people responded to our call to action, and without pause, she said she’d get them all on tables.\nOne of the reasons I love Open Table is that Amber has spent her lifetime as a social worker and makes sure the volunteers receive all needed training. She communicates regularly with each table to make sure volunteers remain collaborative and supportive. Amber heard a presentation by Open Table’s national founder four years ago and organized a couple of tables through her church. Two years later, as Cuyahoga County Executive Armond Budish’s team learned of the success, the county asked Amber to give up her regular job and become a county contractor as director for the Cleveland Open Table Initiative.\nBecause our call to action might overwhelm Amber, I spoke with Budish, and he assured me that he’s quite willing to have a conversation about providing the resources and/or coordination that might be needed to expand Open Table.\nSo please, check out Emily’s story, and consider joining. You’ll meet new friends, know that you are doing something good, and you could help someone build a better life -- for themselves, for their children and for this region.\nRelated: Open Table creates support families for former foster youth", "url": "https://apnews.com/083a7b722446446a90fe1d32c8d85dc7"}