{"authors": ["Lacie Piersonhd Media"], "date_download": "2020-05-04 20:08:43", "date_modify": "2020-05-04 20:08:43", "date_publish": "2018-06-23 09:05:42", "description": "West Virginia Supreme Court Justice Allen Loughry pleaded not guilty Friday to federal charges alleging he misused state resources to defraud higher learning institutions and tried to cover his...", "filename": "_589de76f0aaa4d319c5b490097e2f83b_1588622923.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_589de76f0aaa4d319c5b490097e2f83b_1588622923.html", "title": "Loughry pleads not guilty to charges", "title_page": "Loughry pleads not guilty to charges", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "West Virginia Supreme Court Justice Allen Loughry pleaded not guilty Friday to federal charges alleging he misused state resources to defraud higher learning institutions and tried to cover his actions by lying to federal investigators and trying to have a Supreme Court employee lie on his behalf.\nTwo hours after Loughry entered his not guilty plea, the majority party leaders of West Virginia’s two legislative bodies issued a letter to the West Virginia Legislature’s Joint Judiciary Committee directing committee members to initiate a process of reviewing information for the purpose of evaluating impeachment proceedings for “any member or members of the West Virginia Supreme Court of Appeals.”\nThe legislative letter sent by state Sen. Mitch Carmichael, R-Jackson, and Del. Tim Armstead, R-Kanawha, was addressed to Senate Judiciary Committee Chairman Charles Trump IV, R-Morgan, and House Judiciary Committee Chairman John Shott, R-Mercer, who co-chair the Joint Judiciary Committee.\nThey asked the committee members to review all available evidence, including the legislative audit reports completed regarding the Supreme Court, the Judicial Investigation Commission’s statement of charges against Loughry and the federal indictment against him.\n“While all potential parties to any matter such as an impeachment proceeding are entitled to a presumption of innocence, the serious allegations demand that we begin the process of evaluating whether formal impeachment proceedings are proper and advisable,” Carmichael and Armstead said in the letter.\nLoughry only spoke to answer questions from U.S. Magistrate Judge Dwane Tinsley in a courtroom at the Robert C. Byrd U.S. Courthouse on Friday afternoon.\nA federal grand jury on Tuesday handed up an indictment charging him with 16 counts of fraud and swindles, three counts of making false statements, two counts of fraud by wire, radio or television and one count of witness tampering, in U.S. District Court in the Southern District of West Virginia.\nLoughry’s trial was set for Aug. 28. If convicted of all of the charges against him, he faces a maximum sentence of 395 years in prison and up to $5.5 million in fines.\nThe federal indictment was unsealed Wednesday, and Loughry, 47, was arrested at 7:30 a.m. that day.\nHe had his initial court appearance Wednesday, where Tinsley released Loughry on a $10,000 personal recognizance bond, meaning Loughry would remain out of jail for the duration of his court proceedings as long as he doesn’t violate the terms and conditions of his bond.\nHe is subject to the standard terms and conditions of bail for defendants in federal criminal cases, including surrendering his passport and firearms and remaining within the geographic boundaries of the Southern District of West Virginia for the duration of proceedings in his case.\nThe federal criminal charges are separate from a 32-count statement of charges against Loughry from the West Virginia Judicial Investigation Commission issued on June 6. Those charges allege that Loughry violated the West Virginia Judicial Code of Conduct.\nTeresa Tarr, general counsel for the commission, said Loughry abused the prestige of his office and lied to the news media, state lawmakers and the public in general about his personal use of state resources, including furniture, computers and cars, all in violation of the Judicial Code of Conduct.\nTarr wrote in the statement of charges that Loughry, who was chief justice of the court between January 2017 and February 2018, was voted out of that position by the other four justices after they learned he hid from them a December 2017 federal subpoena of the Supreme Court. The court received a second subpoena in February.\nLoughry was elected to the Supreme Court in 2012.\nLoughry has been suspended from the bench without pay since June 8, per an order from a specially appointed West Virginia Supreme Court. Loughry will remain suspended without pay until the commission’s proceedings are complete.\nLoughry’s law license remains active.\nThe request from the legislative leaders further indicates the broader scope of federal and other investigations into the Supreme Court and the potential for other justices or employees to be held accountable for alleged misconduct and corruption in the highest court in the Mountain State.\nDuring a news conference about Loughry’s indictment Wednesday, U.S. Attorney Mike Stuart, per policy, would not comment on the federal investigation into the court, but he indicated that the ethical and criminal charges against Loughry alone and the public response against him may not be the resolution to any investigation or the only means to restore the public’s trust in the court.\n“For the past several weeks, public officials across West Virginia have been quick to condemn Justice Loughry, perhaps with the hope that the crisis in public confidence with the Supreme Court could be expediently resolved by lodging all culpability on just one person — Justice Loughry,” Stuart said at the Wednesday conference. “That may or may not, however, be the case. Our work continues on many fronts, including additional areas of corruption. I urge public officials and the public to respect this process and allow the process to play out.”\nCarmichael and Armstead said in their letter that impeachment proceedings can take longer than “a day or two,” and they said a review during the legislative interim session would be the most efficient and time-effective manner for joint committee members to consider evidence and determine whether they want to introduce or further consider articles of impeachment against Supreme Court members.\nThey also ask committee members to make a determination as to whether a special legislative session may be appropriate to take formal action toward impeachment.\n“In the event your interim committee does, in fact, recommend the initiation of impeachment proceedings, we will work with Gov. (Jim) Justice to request that such a session be called,” Carmichael and Arm-stead said in the letter.\nEarlier this week, legislative leaders in both parties called on Loughry to resign from office, and Democrat leaders requested Republican leaders and Justice pursue a special session to impeach Loughry if he failed to resign.\nDuring the regular legislative session earlier this year, Del. Mike Pushkin, D-Kanawha, and state Sen. Richard Ojeda, D-Lo-gan, publicly stated their desire for impeachment proceedings.\nOjeda and Pushkin each sponsored resolutions in their respective chambers to initiate an investigation into impeaching Loughry. Ojeda was the lone sponsor of the Senate resolution, and nine delegates supported Pushkin’s measure.\nNeither measure went further than being referred to their respective Judiciary Committees.\nIn the federal criminal charges, Loughry is accused of defrauding American University, in Washington, D.C., one of his alma maters, and the Pound Civil Justice Institute, in Baltimore, by accepting a total of $984.78 in reimbursement for his personal travel to those institutions even though he traveled to those places using state vehicles at no personal cost. A portion of those reimbursements also were for Loughry and his family’s hotel stays for those trips, according to the indictment.\nLoughry also allegedly used state vehicles to travel to book-signing events for his book, “Don’t Buy Another Vote, I Won’t Pay for a Landslide: The Sordid and Continuing History of Political Corruption in West Virginia.”\nHe attended at least three book-signing events at The Greenbrier resort using a state vehicle, credit card and E-ZPass transponder, according to the indictment.\nBy August 2016, U.S. Assistant Prosecuting Attorney Phillip Wright said Loughry began taking steps to cover up his fraudulent conduct, an effort Wright said lasted at least through March 2 of this year.\nThe attempts to cover up his alleged fraudulent conduct continued to fall 2017, when Wright said Loughry attempted to influence a Supreme Court employee’s potential testimony in a federal grand jury investigation about extraordinary spending on renovations at the Supreme Court, according to the indictment, which doesn’t indicate how Loughry tried to influence the person or reveal the identity of the witness.\nIn its separate investigation, the state Judicial Investigation Commission found that Loughry lied to reporters and West Virginia lawmakers who questioned him about the $3.2 million in renovations to the court’s offices, which included a customized West Virginia county map embedded in the floor of Loughry’s office, as well as a $32,000 couch for his office.\nNone of the charges in the federal indictment relate directly to the renovations, but the renovations are a catalyst for Loughry’s alleged scheme to lie to investigators.\nThe indictment also includes allegations that Loughry’s use of state-owned furniture was another catalyst for him to lie to federal investigators.\nLoughry also is accused of having state employees move state furniture, a “Cass Gilbert desk” and a leather couch, into his home in 2013, even though he was not permitted by state law to have those items in his home or use state resources to get them there.\nThe “Cass Gilbert desks” are a set of five desks that were original to the Supreme Court offices when the court’s facility was dedicated in 1932. Each Supreme Court justice in 1932 had one of the desks, and they are held in high regard throughout the court, Wright said in the indictment.\nOn Nov. 27, 2017, Loughry arranged for Supreme Court employees to remove a leather couch from his home and take it to a state warehouse after a Charleston Gazette-Mail column questioned the location of the couch and a Cass Gilbert desk.\nThree days later, Loughry arranged to have the Cass Gilbert desk removed from his home, where it had been for about four years, according to the indictment.\nLoughry told Supreme Court employees he was permitted to have the furniture, as well as computers to furnish his home office, as part of a court policy, according to the indictment.\nHowever, Wright said no such policy, written or oral, exists to allow justices to have such furnishings in their homes.\nEarlier in November 2017, Loughry met with an FBI agent and a representative from the U.S. Attorney’s Office for the Southern District of West Virginia “to report his own concerns about spending by other Justices of the Supreme Court and the former Administrative Director that he believed was unauthorized or otherwise inappropriate,” according to the indictment.\nThe subsequent federal investigation led to Loughry again talking to an FBI special agent and federal investigators, with his attorney present, on March 2 of this year.\nDuring the interview, the indictment alleges, Loughry lied about his use of state vehicles, when the Cass Gilbert desk was moved into his home and his understanding of the significance of the desk, telling investigators he didn’t know it was a Cass Gilbert desk.", "url": "https://apnews.com/589de76f0aaa4d319c5b490097e2f83b"}