{"authors": ["Jessica Bruha Jbruha Oaoa.Com"], "date_download": "2020-05-04 20:23:12", "date_modify": "2020-05-04 20:23:12", "date_publish": "2018-02-04 09:30:00", "description": "The race is on for the Ector County Commissioner Precinct 2 seat as incumbent Greg Simmons and former city councilmember Brandon Tate go back and forth on issues — real or perceived — the county...", "filename": "_d2d50199a6214c2ea9bfd7afa22b87a7_1588623792.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d2d50199a6214c2ea9bfd7afa22b87a7_1588623792.html", "title": "Commissioner candidates go head to head", "title_page": "Commissioner candidates go head to head", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The race is on for the Ector County Commissioner Precinct 2 seat as incumbent Greg Simmons and former city councilmember Brandon Tate go back and forth on issues — real or perceived — the county faces.\nResults of the March 6 primary will determine who will take the seat since Simmons and Tate, both Republicans, are the only candidates who filed.\nTate, who served on the Odessa City Council from 2001 to 2006 before terming out, has been raising issues about the county’s budget, public safety at a dangerous intersection and the precinct’s current leadership.\n“I want Odessa to be a place where our kids will come back to and we are not moving forward,” Tate said. “Our property taxes have gone up and there’s nothing to show for it. If you look at our roads, they’re falling apart. If you look at our county buildings, they’re falling apart. Our county employees haven’t had raises in two years. They’re being neglected. I think employee morale is down and for us to attract the youth back to this area, we’re gonna have to make some changes and improve Ector County.”\nSimmons has been in office for about 20 years and in that time, Tate said the county, in his opinion, hasn’t progressed. But Simmons said he’s helped Ector County became a stable government with minimal debt and good cash reserves while minimizing the tax burden to the public.\nBALANCING THE BUDGET\nWhile in recent years the county has not been able to pass a balanced budget, Simmons said just because they set a deficit budget doesn’t mean they expect to spend more money than they bring in.\n“Any prudent businessman has to have a balanced budget with their business and if not, the bank will take it back … our county does not have a balanced budget at this time, so that’s unacceptable,” Tate said.\nSimmons said counties are not required to pass a balanced budget, although he has pushed for that several times, but the consensus of the court is, in order to get a balanced budget they would either have to exceed the rollback rate of tax increase or eliminate even more positions than what they did this year.\nFor Fiscal Year 2018 the commissioners court raised the tax rate and cut about 15 positions from non-mandatory departments like the Senior Citizens Center, Ector County Library, veterans services and the health department, but still came up short on passing a balanced budget.\n“Fortunately government doesn’t have layoffs very often, but I think in the middle of a recession it was prudent to re-prioritize and say, hey, some of these areas are not a priority when you consider do you have sheriff deputies or jailers as opposed to having a different position,” Simmons said.\nCounty employees faced another year without a raise, but the commissioners’ court worked to offset some of that with a cost of living allowance.\n“I think the county judge and myself were the only two in the county that said we don’t need it, we’re not gonna take it,” Simmons said. But Simmons did approve it as part of the budget in order for the rest of the employees to get it, he added.\nIt was not a permanent salary increase. It was a one-time, 2.5 percent cost of living allowance allotted to all county employees except judges.\nTate also raised issues about the transparency of the county’s budget. Simmons said every year they meet with every department and elected official and go through every line, every expense, and the budget meetings are open to the public. For those who cannot attend the meetings, the court records them and puts them up online, he added.\nThe proposed budget is also an open record and, once approved, the final budget is posted online, as well.\n“I don’t know how much more transparent we could get because we already do everything out in public anyway and it’s line by line,” Simmons said. “I think a lot of times, since he (Tate) has a city council background I think he’s thinking in terms of what he knows from there, but that’s not the way we do it at all. And he’s never been to one of our budget meetings so he doesn’t really know that, but yeah, ours is definitely the most open and transparent of all the taxing entities because we’re doing it ourselves and not waiting for a finance officer to bring us our budget.”\nTate said while the meetings are transparent, for those who get on the website and look at the budget, it’s not transparent at all.\n“It’s very difficult to read and you almost have to have a CPA degree to navigate through and that needs to be more clear for the taxpayer to be able to see that,” he said.\nBIASED BIDDING\nTate also questioned the court’s bidding process, saying he’s heard accounts of biased bidding.\n“There are local companies that would like to bid on our health benefits and insurance and they feel like they could save the county upwards to $1 million per year and give the county employees better benefits at a lower cost and I feel that those qualified bidders need to have adequate time and the same resources to make a bid as the ones who have been here that have been getting these contracts over and over,” Tate said.\nSimmons said he fought very hard two different years in a row to get the company that Tate is talking about in to make a bid. There was some hesitancy the second time, he said, because typically the county goes three years before re-bidding that service, but the individuals were confident they could save the county money so they pushed for the county to re-bid.\n“Both times, despite what they thought they could do, they were still not the low bid,” Simmons said.\nThe bids are open records and anyone who would like to see what each company offered is welcome to do so, he said. Simmons chairs the Health Insurance Committee, which is a six-person committee, comprised of two commissioners and representatives from the HR department, purchasing department and auditor’s office, who help make that decision.\n“It was a unanimous decision that the company we went with was the lower cost than the local company,” Simmons said.\nTRAFFIC SAFETY\nA busy intersection that’s been flagged as a concern in Precinct 2 is an area of contention between the candidates.\nBoth candidates agree that multiple accidents have occurred at 56th Street and Loop 338. Photos of those accidents have been circulating on social media with victims or friends of victims giving their accounts of the dangers presented at the busy intersection.\n“Anytime that public lives are being injured and lost, anybody in a government position locally needs to get involved and help fix that and address that problem,” Tate said.\nSimmons said the intersection has always been dangerous, but with the Compass Academy Charter School near there, traffic has increased with the school opening this year and highlighted the issue even more. Simmons said the county has been working with TxDOT since learning of the school planning to locate in that area.\nTxDOT was initially expected to begin work on the project at the end of 2019, but Simmons said he is excited and glad they were able to move their timeline up a little bit.\nAnd Tate is taking credit for it.\n“Since I’ve been pushing it, now it’s got moved up to this summer. That’s odd, don’t you think?” Tate said.\nSimmons said the county will expand 56th Street to a four-lane road this summer, but TxDOT won’t get started until around September and probably start tearing up roads in January 2019.\nSimmons said he believes the project being bumped up during an election cycle is just a coincidence.\n“I mean, obviously TxDOT does pay attention to public input and I think the more people — because we had multiple people in Ponderosa call and complain and we would pass those on to TxDOT,” he said. “But the more they raise the concern, the more attention (TxDOT) pays to it.”\nSimmons also said TxDOT is a huge organization that has trouble spots like this all over the state so even when the issue is raised that it’s a major concern, they still have to put the project in their system and wait for crews to become available.\nINCUMBENT CONCERNS\nTate also said he wants to clarify potential conflicts of interest and get rid of them, adding that no employee should ever be seeking his own separate financial good from taxpayer dollars because it’s unethical and unacceptable.\n“I think that a commissioner that’s getting paid needs to be there and not have another full-time job. It seems that the commissioner just shows up for a meeting and I think that is not the correct way to run a government. It looks like they’re doing it for the wrong reasons,” Tate said.\nWhen asked to clarify any conflicts of interest Simmons has, Tate refused, saying he would release that information himself “later.”\nSimmons said he is not the only commissioner who has an additional source of income and serving as a county commissioner is not his primary source of income and he doesn’t view having another source of income as a conflict. Simmons is president of Security Bank.\n“I’m not out there trying to boost my pay because it’s not my primary income, but at the same time, I feel like I’m doing as good of a job as the rest of the commissioners so I shouldn’t be penalized just because I have another source of income,” Simmons said.\nA conflict of interest, he said, would be if he worked for a vendor that does work with the county.\nIn all of his years in banking, there was only one year the bank he worked with wound up doing a loan and during the bidding process Simmons said he left the room while the commissioners opened the bids and voted on them.\n“So there is opportunity for conflict, but it’s not based on drawing a salary or anything,” he said.\nTate also accused Simmons of not being a full-time commissioner because of Simmons’ position at the bank.\n“That position (as county commissioner) is paid a very high salary and I think it deserves a full-time commissioner,” Tate said.\nOwner of America’s Wholesale Furniture, Tate said he has been able to step away from his business because he has a whole team of people that run the business for him including a manager and a CFO.\nSimmons said he puts just as much effort into being a commissioner as he does his job at the bank. He takes phone calls throughout the days, negotiates with vendors, answers emails, takes phone calls at night when constituents are off work, has constituents pop into the bank to discuss county business and goes to meet up with people if needed during his regular work day.\n“Just being down there in that office isn’t magic,” Simmons said.\n“I used to tell people, you know, if you hire somebody to mow your yard, you want somebody who’s going to do the best job, not somebody who’s gonna be there the longest doing it. To me, there’s where I’m at. I’ve gotten to the point where I can take care of the county’s business and take care of it in a well, capable manner. But I’m not just sitting in an office waiting for something to do. I think that’s the key.”\nSimmons said his phone is listed in the phone book and the commissioners’ administrative assistant and receptionist know to give constituents his cell phone number or let him know when someone is trying to get a hold of him.\nAnother jab Tate took at Simmons was the fact that Simmons has held the office for about 20 years, saying he believes term limits makes for better government.\n“Politics is the only career that experience and longevity is a negative. Any other business would obviously want a more experienced person that already knows the ropes and already knows how to get things done,” Simmons said.", "url": "https://apnews.com/d2d50199a6214c2ea9bfd7afa22b87a7"}