{"authors": ["The Herald-Dispatch"], "date_download": "2020-05-04 20:06:06", "date_modify": "2020-05-04 20:06:06", "date_publish": "2018-12-29 08:15:25", "description": "PALM COAST, Florida — Poets & Writers, the nation's largest nonprofit organization serving creative writers, are inviting writers from West Virginia to apply for the 2019 Maureen Egen Writers...", "filename": "_7e8a6cdbf88847f59f862e801db8a754_1588622766.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7e8a6cdbf88847f59f862e801db8a754_1588622766.html", "title": "West Virginia selected for National Writers Award contest", "title_page": "West Virginia selected for National Writers Award contest", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PALM COAST, Florida — Poets & Writers, the nation’s largest nonprofit organization serving creative writers, are inviting writers from West Virginia to apply for the 2019 Maureen Egen Writers Exchange Award.\nEach year, Poets & Writers welcomes poets and fiction writers from a selected state to apply for the award. This year, the state chosen is West Virginia.\nThe prestigious award, which aims to provide promising writers a network for professional advancement, has helped to launch the careers of Sue Monk Kidd (The Invention of Wings, The Secret Life of Bees), Lidia Yuknavitch (The Book of Joan, The Chronology of Water), Bryn Chancellor (Sycamore: A Novel), David Mura (Turning Japanese: Memoirs of a Sansei) and others. Since Poets & Writers launched the Writers Exchange in 1984, one-hundred-and-one writers from thirty-nine states and the District of Columbia have participated.\nOne winner in each category will receive an all-expenses-paid trip to New York City to meet with top literary professionals, including editors, agents, publishers, and prominent writers.\nWhile in New York, winners will also give a reading hosted by Poets & Writers. In addition, each winner is invited to spend a month at the Jentel Artist Residency Program in Banner, Wyoming. To be eligible, writers must be residents of West Virginia. currently and for at least the past two years. Applicants must have published no more than one full-length book in the genre in which they are applying.\nEntries must be postmarked by January 7, 2019. Learn more at pw.org.", "url": "https://apnews.com/7e8a6cdbf88847f59f862e801db8a754"}