{"authors": ["Branko Marcetic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman"], "date_download": "2020-05-04 19:55:03", "date_modify": "2020-05-04 19:55:03", "date_publish": "2018-08-09 00:00:00", "description": null, "filename": "2018_08_biden-crime-mass-incarceration-police-prisons_1588622103.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/08/09105257/GettyImages-869035584.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_08_biden-crime-mass-incarceration-police-prisons_1588622103.html", "title": "Joe Biden, Mass Incarceration Zealot", "title_page": "Joe Biden, Mass Incarceration Zealot", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIt looks like Joe Biden is running. With Beltway insiders and Democratic bigwigs talking up his presidential chances, the former vice-president looks to be the candidate to beat in the 2020 primaries. The only problem is, it’s Joe Biden. If you thought Hillary Clinton was a weak candidate, with her transactional style and triangulating policy stances, then you probably won’t be excited by Biden’s multi-decade history in the Senate. Apart from Clinton’s inept campaigning and inability to connect with voters, Biden shares many of the same red flags that led a large share of the Democratic base to look with suspicion on the former secretary of state. In this series, Jacobin’s Branko Marcetic takes a look back at the career of Delaware’s longtime senior senator. Below is Part IV: Joe Biden, Mass Incarceration Zealot.\nPart of the reason Hillary Clinton failed in 2016 was due to the reevaluation of her and Bill Clinton’s atrocious record on criminal justice, which for decades has devastated the black communities whose votes she and the Democrats desperately want. Well, Joe Biden makes Hillary Clinton look like Michelle Alexander. Biden’s role in passing the 1994 Clinton crime bill — which became a flashpoint in the 2016 Democratic primary — is a well-known part of his legacy. But focusing exclusively on that particular triumph undercuts all the other hard work Biden did over the course of his career to make sure American prisons were well-stocked with young, often black, men. One episode in particular sums up Biden’s record. In September 1989, George H. W. Bush delivered a speech outlining his National Drug Control Strategy, in which he called for harsher punishments for drug dealers, nearly $1.5 billion toward drug-related law enforcement, and “more prisons, more jails, more courts, more prosecutors” at every level throughout the country. At the time, the Heritage Foundation gushed that it constituted “the largest increase in resources for law enforcement in the nation’s history,” and it’s now remembered as a key moment in the escalation of the “war on drugs.” For Biden, however, it was a half-measure. “Quite frankly, the President’s plan is not tough enough, bold enough, or imaginative enough to meet the crisis at hand,” Biden said in a televised response to Bush’s speech. “In a nutshell, the President’s plan does not include enough police officers to catch the violent thugs, enough prosecutors to convict them, enough judges to sentence them, or enough prison cells to put them away for a long time.” The episode set the pattern for Biden’s career through the 1990s: every time Republicans put forward a measure that escalated the carceral state beyond sense and reason, Biden would look to one-up it. Biden was already a tough-on-crime evangelist before this speech, of course. In the 1980s, Biden worked with his “old buddy,” arch-segregationist Strom Thurmond, to pass several bills that fundamentally reshaped the American criminal justice system in the direction of more incarceration. They, along with Ted Kennedy, had worked on earlier (unsuccessful) proposals that raised maximum penalties, removed a directive requiring the US Sentencing Commission to take into account prison capacity, and created the cabinet-level “drug czar” position. In 1984, they passed the Comprehensive Crime Control Act, which, among other things, abolished parole, imposed a less generous cap on “good time” sentence reductions, and allowed the Sentencing Commission to issue more punitive guidelines. Biden would later brag in the Senate that it was under his and Thurmond’s leadership that Congress passed a law sending anyone caught with a rock of cocaine the size of a quarter to jail for a minimum of five years. In the same speech Biden went on to take credit for a legislative change allowing the government to effectively rob anyone caught dealing drugs, through the policy of civil asset forfeiture, and demanded to know why the Bush administration hadn’t sentenced more drug dealers to life in prison or death once Congress had given him that power. Unlike Biden’s record on civil rights activism, these weren’t empty words: he had indeed voted for both the Anti-Drug Abuse Act of 1986 and its 1988 iteration, which together created a regime of harsh mandatory minimums for drug possession, including the “quarter” example Biden would later brag about, as well as the notoriously racist hundred-to-one sentencing disparity between crack and powder cocaine. The latter also imposed the death penalty for drug-related murders and barred both drug dealers and users from getting government benefits, an amendment Biden specifically voted for. Not long before Bush’s landmark speech on the drug war, Biden released his own drug strategy report, recommending that the government focus on “the hard-core addict” because they were “responsible for most of the drug-related crime and violence.” “Every hardcore addict must be faced with one of two stark choices: get into treatment or go to jail and get treatment in jail,” he wrote. When Bush kicked off the 1990s by putting forward a crime bill based on his National Drug Control Strategy, Biden responded with a bill of his own that was nearly identical. There were some differences: Biden’s included a ban on assault rifles, put more money toward treatment, and excised some of Bush’s worst excesses, such as extending the death penalty to “drug kingpins.” It was also $4 billion bigger, with nearly double the aid to state and local enforcement, triple the added FBI agents, and more DEA agents and prosecutors. At first glance, one could give Biden credit for reining in Bush’s worst impulses. But it quickly emerged that Biden was happy to jettison any reservations about Bush’s measures if it meant having a tough-on-crime law he and the Democrats could take credit for.\n“Hang people for jaywalking” By the time the Senate passed its version of the bill, which featured Bush’s dream of expanding the death penalty to a variety of nonviolent crimes, Biden approvingly called it “the toughest, most comprehensive crime bill in our history.” When some expressed concern about the fact that more than forty crimes would now be eligible for the death sentence, Biden claimed this was “vastly overblown in terms of significance.” No thanks to Biden, this and other items on Bush’s wishlist were ultimately stripped from the bill. A year later, however, with Bush’s approval ratings getting a bump from the Gulf War, Biden revived these measures, which also included increasing mandatory minimums, limiting the number of appeals for prisoners, and allowing the use of illegally obtained evidence in court as long as police were acting in “good faith” when they broke the law. Biden assured the president that he and the Democrats were “ready right now” to pass all of it if Bush just dropped his opposition to the gun control provisions they wanted to pass in tandem. When that bill passed the senate, it expanded the death penalty to fifty-one crimes, restricted death row inmates’ ability to appeal their executions, and increased penalties for a variety of offenses, such as dealing drugs at a truck stop. Biden insisted that his bill was “much tougher than the president’s,” with “more penalties for death for more offenses,” and boasted to right-wing critics that “we do everything but hang people for jaywalking.” A couple amendments added by Republican senator Alfonse D’Amato made the bill even worse — making all gun homicides federal crimes eligible for capital punishment (effectively forcing the death penalty on states that lacked it), and requiring a decade in prison for drug trafficking or any violent crime (including threatening force against property) committed while carrying a gun. Biden, labeled the bill’s “architect” by the Wall Street Journal, shepherded it to passage, moving several times to end debate on contentious issues and hurry the process along. “I hope the president would maybe take the politics of crime out of the upcoming elections,” he after it passed, warning Republicans that they could no longer claim they were tougher on crime. Biden “had to have more than the president,” one Democratic aide later explained, which helped propel a “bidding war” once the House went on to pass its own version. It’s not as if there weren’t voices speaking out against what Biden and the rest of the Democrats were wreaking. The NAACP and other groups lobbied against the bill. In a letter addressed to senators just a few days before the vote, three ACLU lawyers called the bill “far worse from a civil liberties perspective than any that has ever been considered by the Senate.” Lawyers and federal judges — including the latter’s official policy-making body — warned it would overwhelm the judicial system and widen its already broad inequality. As the different versions made their way to Bush’s desk, the Washington Post condemned them as “rotten” and an exercise “not so much to combat crime as to convince the public that legislators are tough on criminals.” What finally killed the bill? Just as Republicans accidentally prevented Bill Clinton from cutting Social Security by trying to impeach him, the GOP — outraged that the final version didn’t harshly restrict prisoners’ ability to appeal their executions, and reluctant to give Democrats a “win” going into the 1992 election — blocked it from going further. “I just can’t believe Republicans would kill a death penalty bill,” said Biden. The GOP’s spite only postponed Biden’s quest to out-tough the GOP on crime, however. In early 1992, Biden continued to accuse Bush of doing too little “to fight this epidemic,” insisting that “unless we embark on a major offensive against drugs, deadly weapons and violent young criminals now, the record carnage will continue to skyrocket.”", "url": "https://jacobinmag.com/2018/08/biden-crime-mass-incarceration-police-prisons"}