{"authors": ["Chris Bosak"], "date_download": "2020-05-04 21:06:33", "date_modify": "2020-05-04 21:06:33", "date_publish": "2018-02-16 18:47:37", "description": "Several state companies have been honored for “doing business the right way.” Praxair, a Danbury-based industrial gas company, is among those named to the 2018 World’s Most Ethical Company...", "filename": "_1d88737f3b7840b2b20898bacd8b196a_1588626393.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1d88737f3b7840b2b20898bacd8b196a_1588626393.html", "title": "State companies recognized for ethics, diversity", "title_page": "State companies recognized for ethics, diversity", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Several state companies have been honored for “doing business the right way.”\nPraxair, a Danbury-based industrial gas company, is among those named to the 2018 World’s Most Ethical Company list by the Ethisphere Institute, a global organization that defines and advances the standards of ethical business practices.\nIt is the second consecutive year Praxair has been named to the list.\n“Our commitment to doing business the right way is the foundation of the strong relationships we build with all Praxair stakeholders,” Steve Angel, Praxair chairman and CEO, said in a statement. “There is no substitute for having a strong culture of integrity and ethics, both core values at Praxair.”\nAmong the other companies on the list with headquarters or a strong presence in Connecticut include: Norwalk-based Xerox; The Hartford; New Haven-based Knights of Columbus; Iberdrola; Marriott; CBRE; General Electric; and Realogy.\nA total of 135 companies across 23 countries and 57 industries were recognized on the list. Praxair is one of only three companies in the chemical sector. Companies are assessed based on the Ethisphere Institute’s trademarked Ethics Quotient, which quantitatively grades on ethics and compliance, corporate citizenship and responsibility, culture of ethics, governance and leadership, innovation and reputation.\n“Over the last 12 years, we have repeatedly seen that those companies who focus on transparency and authenticity are rewarded with the trust of their employees, their customers and their investors,” Ethisphere CEO Timothy Erblich said. “While negative headlines might grab attention, the companies who support the rule of law and operate with decency and fair play around the globe will always succeed in the long term.”\nA gala for the 2018 honorees will be held on March 13 at Cipriani 42nd Street in New York City. PepsiCo chairperson and CEO Indra Nooyi will deliver the keynote address.\nGender equality\nRecognizing its transparency, diversity and inclusion, Praxair is a part of the first sector-neutral Bloomberg Gender-Equality Index. The GEI measures gender equality using of factors such as: employee policies; company statistics; community support and engagement.\nThe 2018 index is made up of 104 companies from a variety of sectors in 24 countries.\n“Being incorporated in Bloomberg’s Gender-Equality Index underscores our commitment to equality and ensuring that Praxair is an employer of choice for the diverse and vibrant workforce necessary to meet our customers’ needs,” said Vanessa Abrahams-John, director of Global Diversity, Inclusion and Talent Acquisition for Praxair.\nOther Connecticut companies on the index include Norwalk’s Diageo and The Hartford.\n“The (companies’) leadership sets an important example that will help all organizations innovate and navigate the growing demand for diverse and inclusive workplaces,” said Peter Grauer, chairman of Bloomberg.\ncbosak@hearstmediact.com; 203-731-3338", "url": "https://apnews.com/1d88737f3b7840b2b20898bacd8b196a"}