{"authors": ["Bill Biswanger", "Sun Outdoors Writer"], "date_download": "2020-05-04 20:08:32", "date_modify": "2020-05-04 20:08:32", "date_publish": "2018-09-08 23:09:39", "description": "The Squannacook River is a beautiful nine-mile long trout stream that starts in West Townsend. I don't believe you will find a stream more beautiful than this one anywhere in the...", "filename": "_a1be760809df4229993d913c000fd5e9_1588622912.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a1be760809df4229993d913c000fd5e9_1588622912.html", "title": "Squannacook River Cleanup Hits a Roadblock", "title_page": "Squannacook River Cleanup Hits a Roadblock", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Squannacook River is a beautiful nine-mile long trout stream that starts in West Townsend. I don’t believe you will find a stream more beautiful than this one anywhere in the Commonwealth.\nThe river is formed with the merging of several other trout streams. Willard Brook that starts in Ashby, and Mason and Walker Brooks that start in Mason, N.H., all flow into an area making up Ash Swamp. These become the headwaters of the Squannacook River.\nThe true beauty of this area and the streams that make it up is you really have a difficult time finding where the river really does begin, the swamp is just that big. Willard Brook does have the largest water flow and can be more easily traced, but nothing like the rest of the area. These brooks each hold native brook trout making their way to the swamp.\nOver the years the river grew and traveled all the way through the town of Townsend from one end to the other, then to West Groton and finally exiting in the town of Shirley, dumping its contents into the Nashua River.\nThis river is separated by the upper area, that area above the Harbor Pond, and the area below the pond where it finishes its journey to the Nashua River. The Harbor Pond is actually man-made with a dam in the harbor holding back about 30 acres of water making up the pond and some decent ice fishing. The pond used to be great fishing but weed growth has taken a toll.\nThe upper area for the most part is a very wadeable stretch of water. The depth of course does vary with pockets and pools of six-foot depths but much of this is 2-3 feet deep. These are great areas for trout to play hide-and-seek.\nThere have over the decades been some very heavy rains and floods have occurred, making this calm, slow body of water high, fast and tearing down trees of all sizes. The watermark in some areas is 10 feet up the embankment so you know the water was moving and tearing at the roots of those trees.\nThe rains came and trees fell. They blocked canoes from coming down the river without being pulled out and portaged around the downfall. Some areas saw 10 to 30 trees down between pullouts such as Canal to Dudley Road.\nSo the Conservation Commission did the right thing. They surveyed the property themselves. Took photos and invited the dignitaries from Mass Wildlife and the Wetlands Heritage Board to seek a permit to cut a path through the trees. This will allow for canoes to pass and fish to still have good cover.\nThat was last year and all parties signed off on the project. It was limited to one area and the work was done by volunteers who came and worked tirelessly with their own tools, sweat and blood. Bob Clark did some filming. Karen Hill who got the permit directed the project. It went very well.\nNow this year another section was to be done to extend the cleaned area. Karen Hill went to all the parties to get the permit.\nShe received the silent treatment for three months. Calls were made and emails sent until finally a meeting was held. Pat Huckery, the Manager from the Northeast District of Mass Wildlife, met Hill at the river with several other people. Her response was a flat ‘no’ to the project and she would not have allowed it last year either, she told Hill.\nThe lack of this permit will put much of the river off-limits to many fishermen who like to canoe the river or just nature folks who enjoy heading down the river for the ride or to take pictures. If you’re not strong enough to get out and carry your canoe 10 to 30 times or just once, the river is off-limits to you.\nSo the volunteers who worked so hard last year are dejected by the comments made and a river that would benefit from some good toilet flushing will not get it.\nBill Biswanger’s email is bboutdoor1@aol.com", "url": "https://apnews.com/a1be760809df4229993d913c000fd5e9"}