{"authors": ["Jon Bream"], "date_download": "2020-05-04 20:24:21", "date_modify": "2020-05-04 20:24:21", "date_publish": "2018-01-26 08:45:36", "description": "They rocked Minneapolis right before the Major League Baseball All-Star Game at Target Field in 2014. Now they will rock Minneapolis on Thursday right before next Sundays Super Bowl at U.S. Bank...", "filename": "_14d3a91a5fcc4658a7fab986133629be_1588623861.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_14d3a91a5fcc4658a7fab986133629be_1588623861.html", "title": "Imagine Dragons talk special 'relationship with sports' before Minneapolis Super Bowl gig", "title_page": "Imagine Dragons talk special 'relationship with sports' before Minneapolis Super Bowl gig", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "They rocked Minneapolis right before the Major League Baseball All-Star Game at Target Field in 2014. Now they will rock Minneapolis on Thursday right before next Sundays Super Bowl at U.S. Bank Stadium.\nHave Imagine Dragons become Minneapolis go-to jock band?\nNot really.\nBut the Las Vegas quartet has certainly become a go-to band for jock jams. First, it was Radioactive, the bands massive 2012 hit, and now its last years Believer and Thunder.\nWeve always had a relationship with sports and e-sports, said bassist/keyboardist Ben McKee. I think theres a similar vibe there whether youre playing video game football or actually working out. Theres something about our music. We have a lot of percussion and driving rhythm. That lends well to working with sports.\nBeliever has been heard on NBA slam-dunk contests, Dancing With the Stars and WWE wrestling, among other places.\nIts a song that has a lot of energy and the choruses are kind of yelling, McKee said. It gives you that feeling that you have more power within you than maybe you thought. You put that song on and youre getting into an athletic head space. You feel like you could run through a wall without feeling it.\nLead singer/songwriter Dan Reynolds told People magazine that the song was inspired by his experiences with a form of spinal arthritis called ankylosing spondylitis.\nThe meaning of the song is really reflecting on specific things in my life that were painful, whether it was anxiety and dealing with crowds, feeling overwhelmed by that or the success of the band, disease, going through depression anything that was a source of pain in my life, Reynolds told People. And just rising above that, finding a place of perspective where I could be appreciative of the pain in my life and make it my greatest strength.\nNow Thunder has taken off, too.\nImagine Dragons seem to be writing music just for arenas, Brian Campbell, Nashville Predators event presentation director, told Billboard recently.\nOr as McKee put it about last years entire Evolve album: I think the whole album has an energy to it to propel you through a pretty active day. You could probably put on the whole album and have a pretty good workout session.\nBoth Believer and Thunder have obvious rhythmic elements of hip-hop.\nWere open to experimentation, especially with the percussion side of things, to bring in electronic beats from hip-hop. That gives us a different sound than other rock bands, said McKee, pointing out that Imagine Dragons have collaborated with Kendrick Lamar and Khalid. We enjoy that music. Its bound to come out in our writing.\nVegas rebounds\nThe California-bred 32-year-old McKee divides his non-touring time between Oakland and Vegas, where the band has a house turned into a studio.\nMcKee said he has noticed a change in the mood in Vegas since a gunman killed 58 people at an outdoor country-music concert in October.\nIts driven the community together, McKee said. I think things have bounced back in a big way. I dont think people are afraid to come to Vegas. This is a safe, beautiful city. Entertainment capital of the world. Its a vibrant place to come enjoy, but it also has a core community of locals. It has a family feeling to it.\nReynolds recently premiered his documentary, Believer, at the Sundance Film Festival in Utah. Reynolds, who was once a Mormon missionary, takes a look at the views held by the Church of Jesus Christ of Latter-day Saints about gay people. The film features Neon Trees singer Tyler Glenn, who is Mormon and gay.\nMcKee said he is not concerned that the film will cause any controversy with conservative Imagine Dragons fans.\nI dont think equality and human rights are a controversial thing, he said.\nBelieving that all people should be treated fairly regardless of their sexual orientation, if somebody thinks thats controversial, thats on them.\nMcKee is more likely to find controversy when Imagine Dragons talk football in Minneapolis while eating Jucy Lucys or having breakfast at Hells Kitchen (theyve been to the Twin Cities several times).\nDrummer Daniel Platzman is an Atlanta Falcons fan. McKee is a lifelong San Francisco 49ers fan. But he said he thinks that he might have to switch loyalties when the Oakland Raiders move to Las Vegas.\nThat might give new meaning to being in a jock jam.\nTwitter: @JonBream 612-673-1719", "url": "https://apnews.com/14d3a91a5fcc4658a7fab986133629be"}