{"authors": ["Nora Naughton", "The Detroit News"], "date_download": "2020-05-04 20:09:30", "date_modify": "2020-05-04 20:09:30", "date_publish": "2018-01-15 17:46:49", "description": "Hyundai Motor Co.'s 2019 Veloster is roaring into Detroit with a meaner look and a hot-rod companion. The Korean automaker also unveiled its first-ever Veloster N high performance model,...", "filename": "_6037fe1923a24c40bf55cb9c42c479a9_1588622970.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6037fe1923a24c40bf55cb9c42c479a9_1588622970.html", "title": "Hyundai's meaner Veloster gets high-performance companion", "title_page": "Hyundai's meaner Veloster gets high-performance companion", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Hyundai Motor Co.’s 2019 Veloster is roaring into Detroit with a meaner look and a hot-rod companion.\nThe Korean automaker also unveiled its first-ever Veloster N high performance model, boasting 275 horsepower and 760 pounds-feet of torque.\nThe three-door hatchback that debuted Monday at the Detroit auto show has a more muscular appearance after a redesign, with squared-off fenders and more defined wheel arches giving the car a more planted stance. It will also have a turbo option, powered by a 201-horsepower, 1.6-liter turbocharged engine with 195 pound-feet of torque.\nThe grille of the vehicle shown at the North American International Auto Show is also a little edgier, ditching Hyundai’s cascade grille shape for a stronger three-dimensional design.\nThe base engine is a 2.0-liter 4-cylinder banger delivering 147 horsepower and 132 pound-feet of torque. It’s coupled with a six-speed transmission, available in automatic or manual. Three driver-selectable modes include Normal, Sport and Smart.\nAnd the Veloster is more than muscle. It’s also more tech-infused than ever. Equipped with a seven-inch LCD infotainment screen, the Veloster boasts a full suite of connectivity features, including standard Android Auto and Apple CarPlay. Blue Link LTE-powered connectivity is also an available option on the sporty hatchback.\nA heads-up display system also projects speed, navigation instructions, cruise control, lane departure warning and audio information. In sport mode, the system also projects more driver-focused information including RPM, MPH and transmission gear.\nHyundai will start producing the Veloster at its plant in Ulsan, Korea, in March, and it will hit the U.S. market in the second quarter of 2018.\nNNaughton@detroitnews.com", "url": "https://apnews.com/6037fe1923a24c40bf55cb9c42c479a9"}