{"authors": ["Paul Wilcoxen Sports Editor"], "date_download": "2020-05-04 20:15:40", "date_modify": "2020-05-04 20:15:40", "date_publish": "2018-04-11 01:30:40", "description": "Mount Carmel completed a comeback Tuesday with a pair of runs in the bottom of the seventh inning as the Lady Aces knocked off visiting Olney, 6-5, in high school softball action. ‘’It’s just an...", "filename": "_2506d6816a34442896e8e29d8033bdf1_1588623340.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2506d6816a34442896e8e29d8033bdf1_1588623340.html", "title": "Lady Aces walk-off against Olney", "title_page": "Lady Aces walk-off against Olney", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mount Carmel completed a comeback Tuesday with a pair of runs in the bottom of the seventh inning as the Lady Aces knocked off visiting Olney, 6-5, in high school softball action. ’’It’s just an awesome job by our girls,” said Mount Carmel coach Kyle Buss. “We had 13-team hits. I think everybody up and down the lineup either had a hit or had a sac-fly.” Mount Carmel’s Sierra Hannah drove home the game-winning run on a sacrifice fly to score Lexi Simmons. Earlier in the inning, the Lady Aces tied the game off a bloop single off the bat of Allyson Armstrong to drive home Ella Banks. “We had one out so I was just trying to get a hit to where we could score, like a pop fly or anything,” said Hannah. “Hopefully [the win] will help us get going in the Big 8 and get us moving there and get some [wins].” Olney opened with a 2-0 lead in the top half of the first, but the Lady Aces tied it with two runs of their own in their half of the first. Olney added three more runs in the third to take at 5-2 lead. The Lady Aces began their comeback with a single from Libby Schneider to start the fifth inning. She later scored to help Mount Carmel trim into Olney’s lead. Then in the sixth inning, Maddie Merritt homered as Olney continued to hang on to a 5-4 lead. “That was huge,” said Buss of the home run. “That kind of got us going. She was the first girl up that inning, and we told everyone to take a strike. She takes the first pitch for a ball. I’m thinking she’s going to take the next pitch for a strike, but sure enough, the second pitch was right down the middle, and she hit it out of here.”\nAddison Drone had two hits and scored a run. Banks finished with a pair of hits and an RBI. Simmons had two hits and a pair of RBI.\nMerritt finished with two hits, including her solo home run and two RBI. Lexi Ballard had two hits, and Schneider finished with two hits and scored a run while Faith Fuller had a hit and scored a run. Mount Carmel travels to Hamilton County today.\nMount Carmel takes fourth at Olney\nOLNEY — The Mount Carmel Lady Aces traveled to Olney on a cold spring day and finished fourth out of seven teams in a high school track and field meet.\nKami Kline finished in first-place in the 400-Meter Dash with a time of 67 seconds. Jada Smith’s time of 13:36 was good enough for second place in the 3200-Meter Run.\nMadi Piper was second in the Long Jump at 15-2. Madi Merritt was second in the Shot Put at 31-2 and third in the 4x100-Meter Relay with the foursome including Haley Wright, Haley Maguire, Kline and Piper in a time of 55.34.\nWright was third in the High Jump at 4-11. Madi Merritt was third in the Discus at 89-6. Wright was third in the 200-Meter Dash with a time of 30.34.\nThe Lady Aces will be back in action Monday at Vincennes.\nContact Register Sports Editor Paul Wilcoxen at (618) 263-1004 ext 1025, pwilcoxen@mtcarmelregister.com, or on Twitter @paulwilcoxen", "url": "https://apnews.com/2506d6816a34442896e8e29d8033bdf1"}