{"authors": ["Amelia Rayno"], "date_download": "2020-05-04 21:09:01", "date_modify": "2020-05-04 21:09:01", "date_publish": "2018-04-17 09:05:05", "description": "Even as spring proves elusive, the season for restaurant debuts has arrived with a force. Over the weekend, Spring Cafe (1360 Lexington Pkwy N., St. Paul, springcafestp.com) opened its doors...", "filename": "_f682e608ea2e4cb9b513ef0677d7e9be_1588626541.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f682e608ea2e4cb9b513ef0677d7e9be_1588626541.html", "title": "5 new Twin Cities restaurants make their debut in a busy week for openings", "title_page": "5 new Twin Cities restaurants make their debut in a busy week for openings", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Even as spring proves elusive, the season for restaurant debuts has arrived with a force.\nOver the weekend, Spring Cafe (1360 Lexington Pkwy N., St. Paul, springcafestp.com) opened its doors at the historic Como Lakeside Pavilion to a pile of snow but the weather didnt slow excitement much. The new eatery, owned by Matty OReilly of Republic, Delicata, Bar Brigade and Red River Kitchen at City House, replaces the former Como Dockside, which closed last November.\nIt feels like the opposite of spring, OReilly said. But that neighborhood is so loyal. They came out of the woodwork, and we had a pretty steady crowd of people there all weekend.\nWhen the sun does decide to show its face, there will be plenty of patio seating the space can hold up to 1,000 for hungry parkgoers to sample a menu featuring beef brisket and fried chicken sandwiches as well as hot dogs, tacos, nachos and other casual eats. The two-level indoor space, which offers counter service and grab-and-go options for sandwiches and salads, holds about 100. As with OReillys other establishments, chef J.D. Fratzke created the menu, and hired and trained the staff.\nSpring Cafe is also partnering with Sweet Science, which will run the ice cream window. And Chowgirls Killer Catering will operate the third-floor event space.\nJ.D. and I kind of came up with the phrase Americana picnic, OReilly said. A lot of these dishes are sort of Americana barbecue that people might make in a public park accessible food at friendly price points.\nWine, local ciders and beer (including a house brew, Como Sapiens IPA, from Lupulin Brewing Co., which will be on tap next week), plus kegged cocktails will be available.\nAs part of his contract with the city, OReilly has booked 100 days of programming on the adjacent outdoor stage this summer, with acts that include singer-songwriter types, a Cuban band and tap dancing. But Spring Cafe (open daily from 11 a.m. to 9 p.m.) will also anchor Como Lake year-round and OReilly expects to bring the live music vibe indoors in the colder months.\nWere just going to try to keep it vibrant and keep it fun, OReilly said. Its a 1,500-square-foot colonial promenade sitting on an urban lake. Other than City House, Ive never been so interested in the aesthetic of a place. Its so cool.\nParlour St. Paul\nOn Monday, two other high-profile restaurants welcomed customers after soft openings last weekend.\nParlour St. Paul (267 W. 7th St., St. Paul, parlourbar.com), a sequel to the Minneapolis North Loop favorite, offers the same now-famous burger and cocktail focus as the original, but expands the food menu quite a bit.\nThe large, exposed brick-laden space has three distinct areas: the bar, the diner with a kitchen counter and another small room that will eventually be filled with neons and offer pulltabs. New menu items include a handful of sandwiches, shared plates ranging from a foie gras terrine to chicken dumplings and breakfast-inspired items like scrambled eggs with king crab and hash. Theres a sundae bar as well, featuring a handful of flavors and toppings.\nGrand Catch\nAlso making its grand debut on Monday: Grand Catch (1672 Grand Av., St. Paul, grandcatchmn.com).\nThe Cajun seafood restaurant, a collaboration between World Street Kitchen/Milkjam Creamery owners Sameh and Saed Wadi and Cajun Deli owner Thien Ly, specializes in seafood boils. First, diners choose from a selection of Dungeness crab, head-on shrimp, manila clams and more, then pick a style of sauce and a heat level from mild to insane ghost. The menu also includes a modest lineup of starters such as snow-crab dip and Chinese shrimp toast and sandwiches, plus rotating soft serve flavors from Milkjam. A healthy collection of cocktails, along with beer, wine and mocktails, will be available. Grand Catch is open from 11 a.m. to 10 p.m. daily.\nBungalow Club\nIn the Longfellow neighborhood, Bungalow Club (4300 E. Lake St., Mpls., thebungalowclubmpls.com) is greeting diners beginning on Tuesday.\nThe restaurant, a product of Andrew Kraft from the last iteration of Grand Cafe, replaces the former Craftsman restaurant. A handful of house-made pastas will be the foundation of the menu, and cocktails will claim a heavy focus as well.\nMr. Stevens Snuggery\nComing Friday? A new bar from Psycho Suzis owner Leslie Bock.\nMr. Stevens Snuggery (2027 N. 2nd St., Mpls.), an edgy, off-the-wall remake of the former Donny Dirks Zombie Den in north Minneapolis (pictured above), will operate as a series of ticketed, two-hour cocktail party events, held on the weekends (6 p.m. and 8:30 p.m., every Friday and Saturday). The first party’s theme has a sultry name that can’t be repeated here. Tickets ($36.95) can be purchased in advance at http://bit.ly/MrStevens or at the door, if available, and include cocktails and hors doeuvres.", "url": "https://apnews.com/f682e608ea2e4cb9b513ef0677d7e9be"}