{"authors": ["Claire Tisne Haft"], "date_download": "2020-05-04 20:10:27", "date_modify": "2020-05-04 20:10:27", "date_publish": "2018-06-13 18:25:49", "description": "“Father’s Day? It’s a non-event,” my husband told me with a shrug when I asked him about the upcoming holiday that honors the paterfamilias. I can understand where he is coming from,...", "filename": "_80bf0639281846b1aee4381eccedd2f8_1588623027.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_80bf0639281846b1aee4381eccedd2f8_1588623027.html", "title": "Here’s one way to celebrate a Happy Father’s Day", "title_page": "Here’s one way to celebrate a Happy Father’s Day", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "“Father’s Day? It’s a non-event,” my husband told me with a shrug when I asked him about the upcoming holiday that honors the paterfamilias.\nI can understand where he is coming from, especially after experiencing all the fanfare of Mother’s Day, a holiday that I have formally renamed as “National Disappointment Day.”\nAsked to elaborate, Ian got a little melodramatic. “No one cares about us dads …” he said mournfully, looking off into the distance, or at least past the lawn that needed mowing.\nNice try. If you want to play in the major leagues of melodrama, try Mother’s Day on for size. But that was exactly Ian’s point. No matter what measure you use, Father’s Day is always an also-ran, a second place, a footnote to the Big Event for us moms. Mother’s Day even comes first on the calendar.\nIan’s lament reminded me of one of the most poignant things he said after we had our first baby. He told me he felt “left out” by all the fuss. I was so struck by the honesty of his observation — and by how annoying it was.\nLeft out? Well, go ahead pal, physically blow up in every direction, go hormonally insane for nine months while lactating like a pulsating queen bug. By all means, be my guest. Knock yourself out.\nStill, I could see his point. Fathers often feel left out of the gauzy maternal bubble — and then get blamed for everything, often at the same time. It’s part of the the classic double bind of parenting, which Ian likes to remind me causes schizophrenia.\nSurely a carefully selected Father’s Day gift could make all the difference, right?\nFor Ian’s first Father’s Day, I gave him a black T-shirt with the caption, “This dad gets up!” over an image of a giant baby bottle and an alarm clock. I thought it might inspire him vis-à-vis the 3 a.m. feeding.\nHe seemed to like it. He even wore it a few times, although never publicly, and his enthusiasm for late night feedings seemed somewhat bolstered.\nThe next year, when I was pregnant with my second child far too soon, I gave him another T-shirt for Father’s Day. “This Dad’s a Winner” was emblazoned across the front.\nHe seemed more ambivalent about that one. He was polite, but he never wore it and he finally admitted he hated that shirt. Something to do with feeling like he was in the Dad’s Special Olympics.\nSoon I was pregnant again, and suddenly our family expanded to include a newborn, a baby and a toddler. It wasn’t pretty. We were a household in perpetual chaos, and we desperately needed help. Enter Chrissi, a 21-year-old au pair from Germany who appeared like an deus ex-machina savior just when we needed her most.\nChrissi was a gift from the child care gods in every way. We even got a little German culture out of the deal, as Chrissi often wove Teutonic traditions into our roiling household with infectious enthusiasm. Still, of all we learned from Chrissi in those two years, the German take on Father’s Day was the most memorable.\nAt first Chrissi was amused by our tepid version of the holiday — the kids’ cards scribbled with crayons, my terrible T-shirts, our attempts to replicate a less intense version of a Mother’s Day celebration. But then she stunned us.\n“Do you know what we do in Germany for Father’s Day?” she asked. I was immediately suspicious.\n“Dads all get together, leave home, pull a big wagon of beer around and get completely drunk,” she told us.\nIan’s jaw hit the floor.\nShe was not kidding. Wikipedia puts it like this: “In Germany, Father’s Day (Vatertag) is celebrated differently from other parts of the world… It is tradition for groups of males to do a hiking tour with one or more smaller wagons, Bollerwagen, pulled by manpower. In the wagons are wine or beer (according to region) … Many men use this holiday as an opportunity to get drunk...”\nChrissi recounted fond memories of her father and his friends cheerfully meeting for a substantial breakfast and then hitting the trail, schlepping their wagon of pilsner behind them. They would amble along, stopping frequently to drink, eat and pee, while other fathers joined in along the route. Chrissi said it was the highlight of her father’s year.\nThis didn’t make Father’s Day any easier for Ian. Images of over-achieving and overweight fathers dragging an up-scale wagon of boutique IPA along Zaccheus Mead Lane just didn’t cut it. But the mere idea of the German Bollerwagen was enough to knock Father’s Day up a notch. At least somewhere dads were getting their due.\nSo happy Father’s Day, Greenwich. Left out, blamed, and often eclipsed by queen moms and yelping kids, I hope dads everywhere feel the love this Sunday — with or without their Bollerwagen. If all else fails, next year in Germany!\nClaire Tisne Haft is a former publishing and film executive, raising her family in Greenwich while working on a freelance basis on books and films.", "url": "https://apnews.com/80bf0639281846b1aee4381eccedd2f8"}