{"authors": ["Carmine Frongillo", "Cfrongillo Lowellsun.Com"], "date_download": "2020-05-04 20:07:35", "date_modify": "2020-05-04 20:07:35", "date_publish": "2018-04-04 10:35:58", "description": "TYNGSBORO -- It doesn't matter what type of schemes teams throw at Liam McDonough. McDonough, a senior midfielder who is practically unbeatable on faceoffs, will find a way to dissect even...", "filename": "_c841ffae093f48509ca361174faffdf6_1588622855.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c841ffae093f48509ca361174faffdf6_1588622855.html", "title": "McDonough Sets the Tone in G-D Win", "title_page": "McDonough Sets the Tone in G-D Win", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TYNGSBORO -- It doesn’t matter what type of schemes teams throw at Liam McDonough.\nMcDonough, a senior midfielder who is practically unbeatable on faceoffs, will find a way to dissect even the most air-tight defenses, and set Groton-Dunstable’s fast-break offense in motion.\nBoys lacrosse\nWith McDonough serving as the point-man, the Crusaders’ attack was off and running against Tyngsboro Tuesday afternoon.\nMcDonough scored seven goals while powering Groton-Dunstable past the Tigers, 14-5, in a Midland-Wachusett League cross-over boys lacrosse game that was played in a steady rain.\nGroton-Dunstable improved its record to 2-0. McDonough has paced the Crusaders’ offense with a two-game total of 10 goals and two assists. He will attend UMass Lowell on a partial lacrosse scholarship.\n″(McDonough) had a lot of shots and a lot of good looks,” said Groton-Dunstable head coach Rick Arena. “When he gets a good look and gets off a good shot, he’s hard to stop. He really sets the tone. Everybody looks to him to lead the way.”\nThe Crusaders certainly did a good job of following the leader, as numerous players got involved on offense.\nBrad teDuits chipped in with three goals and one assist, while Max Buhler had two goals and an assist.\nNate Townsend scored a goal and dished out two assists, while Alex Cianci tallied a goal and assist.\nAndrew Berube helped set the Crusaders’ offense in motion with four assists.\n“We try to emphasize as best we can to get a six-man offense going,” said Arena. “So everybody is responsible for that, but it’s hard early in the season while we’re all trying to jell.\n“It was good to see we were able to do that a couple of times.”\nGroton-Dunstable led 3-2 after the first quarter. But the Crusaders took charge in the second quarter, scoring seven goals to take a 10-3 halftime lead.\n“They are a good team,” said Tyngsboro coach Kyle Brady, whose Tigers were playing their season-opener. “They’re an experienced team. On top of that they have Liam McDonough, who is going to win every faceoff.\n“We’re a young team. We have a lot of freshmen and sophomores playing. I thought we played our game plan well in the first and fourth quarters and stayed tight. We got away from it in the second and third (quarters) and it showed.”\nThe Crusaders received a strong effort in goal from Nevin Tardif (8 saves). Kyle Zimmer, Drew Bernard, Connor Estes, Peter Eldredge and Gavin Lilly had strong games on defense.\n“Our defense has been coming along quicker than I anticipated,” said Arena. “They are playing well. It’s early in the season and you need to have a good defense to survive these games.\n“Give Tyngsboro credit they came out and played hard the whole game. We expected that from them. They never quit. So it’s a good lesson for us. A team like Tyngsboro keeps you honest the whole game.”\nMitch Anderson and Josh Fairbanks had a goal and assist each for Tyngsboro. Mike Scalia, Evan Robson and Jimmy Albert netted the other Tiger goals.\nRyan Hardy had strong game in goal for Tyngsboro, finishing with 16 saves. Kyle Corkum played well defensively.\n“We graduated a lot of three and four-year starters,” said Brady. “So we’re in the process of finding a new personality, a new identity. We’ll learn from games like this. Our attitude was great. That’s one of our big goals for the season, being positive. When we make mistakes, learn from them and let’s get better the next day.”\nFollow Carmine Frongillo on Twitter @cwfrongi", "url": "https://apnews.com/c841ffae093f48509ca361174faffdf6"}