{"authors": ["Mason Dockter"], "date_download": "2020-05-04 20:07:55", "date_modify": "2020-05-04 20:07:55", "date_publish": "2018-05-19 16:00:00", "description": "SIOUX CITY -- In May 1929, the Martha Washington Chapter of the Daughters of the American Revolution unveiled a monument to the Old Missouri River Trail at Sioux City's War Eagle...", "filename": "_4037973cd1814d96adccc6458d9c4cc0_1588622875.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4037973cd1814d96adccc6458d9c4cc0_1588622875.html", "title": "Another lost monument: Sioux City DAR seeks info on old trail, stone marker", "title_page": "Another lost monument: Sioux City DAR seeks info on old trail, stone marker", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SIOUX CITY -- In May 1929, the Martha Washington Chapter of the Daughters of the American Revolution unveiled a monument to the Old Missouri River Trail at Sioux City’s War Eagle Park.\nPresumably, the group’s purpose for the granite boulder monument was to ensure future generations would learn about and enjoy the centuries-old Native American and fur trappers’ trail.\nAnd here we are, in a future generation, with no idea where their monument went, or where exactly the Missouri River Trail is.\nThe hunt is on\nThe search for the Old Missouri River Trail and accompanying monument began when Marta Nelson, a DAR secretary, became the caretaker of an assortment of old Sioux City DAR archive materials.\n“We had changed officers, and we inherited a bunch of boxes of stuff,” Nelson said.\nAs Nelson sifted through the papers to see what was necessary and what wasn’t (“sometimes we had 20 copies of something we didn’t need”), she found a May 1929 handout from the dedication and unveiling of the Old Missouri River Trail Monument.\n“And I thought, ‘Hmm, what is this?’” she said.\nSo she did some research, and found that the Old Missouri River Trail was a centuries-old, possibly 100-mile-long trail once used by Native Americans and traders in the region. It skirted what is today War Eagle Park, and the monument sat somewhat north of the entrance to War Eagle Park.\nBy the 1920s, when such trails were relics of a bygone era, the DAR was encouraging its chapters to place commemorative markers at trail sites.\n“That was really popular with folks in the Midwest, because we didn’t have a lot of Revolutionary War battlefields and buildings and things like that to worry about saving,” Nelson said.\nNelson’s trail research was exhaustive -- she even found a signed, notarized, handwritten affidavit from October 1927 by early settler G.W. Kingsnorth.\nIn the single-sentence note, Kingsnorth writes: “I have lived in Sioux City since 1858 and know that the road, or trail, as we called it, leading from Council Bluffs through where Ashton, Whiting (and) Sloan now is, and thence to Sergeant Bluff by way of Thompson’s Grove along the river across the Floyd, thence along the bank of the river and skirting what is now called ‘War Eagle Park’ was and is a part of what was familiarly known as The Old Missouri River Trail up which came the Lewis & Clark Expedition.”\nKingsnorth’s recollection (along with that of settler Orville Talley) was used in part to corroborate the findings of an old survey of the trail.\nA grand unveiling, quickly forgotten\nContemporary accounts of the trail monument’s unveiling ceremony describe a grand occasion -- 300 people attended, the Central High School Band played music, Boy Scouts and dignitaries of both the DAR and Sons of the American Revolution gave addresses, and a young girl whose great-grandfather was supposedly killed by Native Americans was on hand for the festivities.\nIt’s not clear how long it took before the much-lauded granite boulder monument and trail were completely forgotten. But forgotten they became.\nNo living person in the DAR seems to have any memory of the trail, though DAR regent Elizabeth Rosenbaum said her secretary’s ex can remember the monument (or a very similar boulder bearing a plaque), which was apparently forgotten by the 1950s.\n“He remembers playing on a rock, just like this, with a plaque on it,” somewhere in the region behind the modern-day Casey’s and Dollar General along Riverside Boulevard. “And then he remembers, as a child, that somebody stole the big plaque off it. And so it was just a rock then.”\nWar Eagle Drive (the western edge of West Fourth Street) has been rerouted since the days when the monument was erected, and it’s unclear whether the road work impacted the trail or caused the monument to be removed and discarded. Likewise, the entrance to War Eagle Park has moved -- the former entrance may have been located near the intersection of Burton Street and West Fourth Street.\nA recently discovered children’s coloring map from the 1930s shows the trail, noted as “Trail used by Indians, trappers, fur traders.” In those days, the trail ran very close to the Missouri River, which has since changed course and narrowed somewhat in the Sioux City area.\nSo Nelson and Rosenbaum are left wondering two things: Could the old trail be rediscovered and re-surveyed? And could the granite monument (or even just its bronze plaque) be recovered?\n“I would love to see this re-dedicated,” Rosenbaum said.", "url": "https://apnews.com/4037973cd1814d96adccc6458d9c4cc0"}