{"authors": ["Peter Huguenin The Columbus Telegram"], "date_download": "2020-05-04 20:28:47", "date_modify": "2020-05-04 20:28:47", "date_publish": "2018-10-03 05:00:00", "description": "Columbus High tennis fell to Fremont 1-8 on Tuesday afternoon at Pawnee Park. The lone win came from Adam Kamrath who picked up the No. 1 singles win 8-2. \"Adam Kamrath continues to play at...", "filename": "_826a8c0224724ee0be6c5091a76528ac_1588624127.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_826a8c0224724ee0be6c5091a76528ac_1588624127.html", "title": "Columbus tennis wraps up home season in loss to Fremont", "title_page": "Columbus tennis wraps up home season in loss to Fremont", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Columbus High tennis fell to Fremont 1-8 on Tuesday afternoon at Pawnee Park. The lone win came from Adam Kamrath who picked up the No. 1 singles win 8-2.\n“Adam Kamrath continues to play at the top of his game picking up our lone win today,” said head coach Scott Behtune in comments sent to The Telegram. “He had a great weekend at the GNAC tournament in North Platte going 3-1 and placing 2nd. Today he continued that winning way by taking early control of the match and didn’t look back.\n“His hitting was crisp today and he was placing the ball well. He is playing at the level he needs to be at the end of the season. We have about one week left before we head to state, and if Adam continues to play at this level, he will have some success at the state tournament.”\nKamrath’s victory came over Brennan Callaham.\nOther singles action for the dual include the following results:\nJustin Pemberton def. Dawson Dreifurst;8-0\nAustin Callahan def. Colin Flyr;8-4\nShane Miller def. Conner Wiehn; 8-2\nAvery Martin def. Cole Wilcox;8-2\nJacob French def. Drew VunCannon;8-0\nColumbus didn’t have much more success in doubles action as all three teams were swept.\nThe doubles results were as follow:\nAlex Bigsby and Austin Callahan def. Adam Kamrath and Cole Wilcox;8-3\nShane Miller and Avery Martin def. Coln Flyr adn Conner Wiehn;8-0\nBrennan Callahan and Justin Pemberton def. Dawson Dreifurst and Drew VunCannon;8-0\nThe next dual for CHS is Friday on the road at Norfolk - the end the regular season.\nThe Discoverers will then gear up for the state tournament playone on Oct. 11-12 at the Koch Tennis Center in Omaha. Each day the tournament will start at 9 a.m.\nEach school is able to enter one competitor in No.1 singles, one competitor in No. 2 singles, two competitors in No. 1 doubles and two competitors in No. 2 doubles.\nIt is assumed that Kamrath will be Columbus selection to be the No.1 singles competitor.\nSo far in singles competition this year, Kamrath is 21-18 and currently riding a five-match winning streak.\nPeter Huguenin is a sports reporter for The Columbus Telegram. Reach him via email at sports@columbustelegram.com", "url": "https://apnews.com/826a8c0224724ee0be6c5091a76528ac"}