{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:17:30", "date_modify": "2020-05-04 20:17:30", "date_publish": "2018-08-27 10:35:40", "description": "LOWELL -- Junior Anouk Lalande (Brussels, Belgium) tallied three goals to lead the UMass Lowell field hockey team to a 6-0 victory against Hofstra in the inaugural River Hawk Classic championship...", "filename": "_255bda949ed0494d8d38b271150a7b16_1588623450.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_255bda949ed0494d8d38b271150a7b16_1588623450.html", "title": "UML Off to a Good Start in Field Hockey", "title_page": "UML Off to a Good Start in Field Hockey", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- Junior Anouk Lalande (Brussels, Belgium) tallied three goals to lead the UMass Lowell field hockey team to a 6-0 victory against Hofstra in the inaugural River Hawk Classic championship on Sunday.\nWith the decision, the River Hawks improve to 2-0 for the first time since 2015. The shutout marks just the second of the career of junior goalkeeper Eva Berkhout (Amersfoort, Utrecht, Netherlands), as well as the program’s first back-to-back clean sheets since 2012.\n“We haven’t won a championship on this field in quite a few years, so to do it in a 6-0, convincing fashion was awesome,” said head coach Shannon Hlebichuk. “The team has been working super hard this preseason in trying to put together a full, 70 minutes of up-tempo, high-energy field hockey. They certainly did that today.”\nSenior Torrie Huk (Milford, Del.) chipped in with four points in the contest on one goal and two assists.\nSophomore Katie Lynes (Oakville, Ontario) added her first goal of the season, while freshman Lindsey Kilpatrick (Manlius, N.Y.) logged her first collegiate goal. Fellow rookie Taryn McKinnon (Plaistow, N.H.) also notched her first career point with an assist in the outing.", "url": "https://apnews.com/255bda949ed0494d8d38b271150a7b16"}