{"authors": ["Jan Burns"], "date_download": "2020-05-04 20:19:18", "date_modify": "2020-05-04 20:19:18", "date_publish": "2018-04-19 05:00:00", "description": "Health experts say there are some things you can do if you want to lose weight. Eating healthier and becoming more active are key. These lifestyle changes can make a big difference in your weight...", "filename": "_6ba3f75d15bd4783bc79e871ba589635_1588623558.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6ba3f75d15bd4783bc79e871ba589635_1588623558.html", "title": "Weight loss can lead to healthier life", "title_page": "Weight loss can lead to healthier life", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Health experts say there are some things you can do if you want to lose weight. Eating healthier and becoming more active are key. These lifestyle changes can make a big difference in your weight over time.\nWhen the Atkins diet, which is based on low-carb eating, came out years ago some members of the medical community doubted it was a good weight-loss plan. But, in 2007, a study at the Stanford University School of Medicine showed the Atkins diet to be effective. Christopher Gardner, Ph.D., professor of medicine with the Stanford Prevention Research Center’s department of medicine at Stanford University Medical School, led the study.\n“Many health professionals, including us, have either dismissed the value of very low carb-diets for weight loss or been very skeptical of them,” he said at the time. “But it seems to be a viable alternative for dieters.”\nGardner thinks the simplicity of the diet is one reason why it is so successful. “It’s a very simple message,” he said. “Get rid of all refined carbohydrates to lose weight.”\nNow Gardner and his team are trying to find a way to determine which diet is better for whom.\n“While it would be nice to find a way to determine the best diet for an individual, from this research it is clear we aren’t there yet,” says Connie Diekman, director of university nutrition at Washington University in St. Louis, after reading the results of the recent research. “The most important aspect of weight loss is finding an eating pattern that meets nutrient needs, manages your calorie intake at a level that is lower than your calorie burn, and is enjoyable.”\nTips from weight loss experts are:\n• Try adding in healthy fruits and vegetables to your diet, instead of thinking about what you have to subtract. “Adding in really works,” says David Grotto, R.D., L.D.N., and author of 101 Optimal Life Foods. “Taking away never does.”\n• Lighten up your food. Sprinkle reduced fat cheese on your homemade pizza. Or, try a low-fat dessert, instead of the one you usually eat.\n• Increase your daily fiber. Fiber helps you feel satisfied longer.\n• Drink a cup of water before your meals. That way you won’t feel so hungry when you sit down to eat.\nIf you don’t like to think about having to work out or exercise, just think about becoming more active. Walking is a good low-stress activity. Start slow. Try walking two times a day for 10 minutes each time. Gradually increase the time you walk.", "url": "https://apnews.com/6ba3f75d15bd4783bc79e871ba589635"}