{"authors": ["Lindsay Peyton"], "date_download": "2020-05-04 20:25:46", "date_modify": "2020-05-04 20:25:46", "date_publish": "2018-05-23 05:00:00", "description": "Andree Calhoun could not sleep the night Harvey hit. While her house in Danbury was safe from the storm, her Facebook feed was buzzing with posts from friends who were stuck in high water....", "filename": "_ef77854b3cc246b785acb9424b8093fb_1588623946.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ef77854b3cc246b785acb9424b8093fb_1588623946.html", "title": "Heroes of Harvey Life boat", "title_page": "Heroes of Harvey Life boat", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Andree Calhoun could not sleep the night Harvey hit.\nWhile her house in Danbury was safe from the storm, her Facebook feed was buzzing with posts from friends who were stuck in high water. “And it just kept getting worse and worse,” she said.\nAt 5:30 a.m., she turned on the news. “It had been a rough night for thousands of people,” she said. She woke up her husband Kirby. “Hey, honey, you have a boat. You have to get out there.”\nIt turned into the beginning of a very long day for Kirby, an Army veteran who put his skills to use organizing countless rescues.\nFirst, he called his friend Colter Carpenter and headed to his house in Brazoria. “We talked over breakfast, and we came up with a game plan,” Kirby said.\nCarpenter had a boat, too. They loaded it up, drove into Dickinson, found a bridge over FM 646 and placed their boat in the water. Immediately, they were flagged down by a man who was trying to save his sister.\nHe led Carpenter and Kirby through the water to the back of the subdivision, where his sister lives. “There were three adults and two kids,” Kirby said. “They were the first ones on the boat, and I’ll never forget them.”\nAs they pushed out to head to a rescue point near the intersection of FM 646 and 517, they realized that the whole street was in dire straits.\n“We saw people waving sheets out of their windows, trying to flag boats down,” Kirby said. “We started in the back and worked our way up so we didn’t miss anybody.”\nAfter the neighborhood was evacuated, the men headed to a hotel on I-45 where they heard a number of people were trapped. “We went down there and put 16 people on the boat,” Kirby said.\nKirby and Colter were focused on the rescues, and they could not stop to take in the damage they were seeing all around. At one point, Kirby noticed something in the water beneath the boat. It was the roof of a car, so deeply submerged that they did not even graze it.\n“With all the chaos going on, we huddled together and we prayed to just get one more boatload,” Kirby said. “We asked, ‘Lord, just one more.’”\nThe following morning, Carpenter returned to his job, and Kirby called two more friends to help him out - Kyle Swaggard, who served in the Navy, and Justin Mellen, formerly with the Coast Guard. The crew scoured Facebook for people in need of help. First in Alvin, then Dickinson, then Houston after the Addicks reservoir flooded.\nOne friend asked for help for her grandparents whose neighborhood was flooded. Kirby took his canoe and paddled their way; he filled their needed prescriptions and returned the next day with a hot meal for them.\nWith his flooded office still closed, Kirby looked for other ways to help. He loaded his truck up with tools and started busting out floors and sheetrock in damaged houses. He spent weeks gutting homes for strangers in need, working nights and weekends after he was back at the office.\n“It’s his personality. When you have the ability to do a job, that’s what you go do,” Andree said. “And there was no shortage of people that needed help.”\nKirby said he was impressed with how many others did the same thing.\n“With how divided our country is right now, there was none of that after the storm,” he said. “Every single person helped someone else. Regardless of their situation, everyone that got in our boat went on to help someone else, and that was amazing to see.”\nAndree volunteered at area churches and shelters, when she was not busy taking care of the couple’s five children. Three churches in Danbury banded together to serve meals for the town.\nWendy Clark, a longtime friend of the couple, said the Calhouns truly stepped up. “Kirby and Andree are good, decent folks who are what this city is all about.”", "url": "https://apnews.com/ef77854b3cc246b785acb9424b8093fb"}