{"authors": ["Kevin Gorman"], "date_download": "2020-05-04 20:23:14", "date_modify": "2020-05-04 20:23:14", "date_publish": "2018-11-07 17:10:34", "description": "Pittsburgh Steelers coach Mike Tomlin seems to have a favorite phrase every week, so there was something \"significant\" about holding his weekly news conference on a Monday. Tomlin kept score...", "filename": "_e9420e2fd9a54d44824fe1fd2dd96223_1588623794.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e9420e2fd9a54d44824fe1fd2dd96223_1588623794.html", "title": "Steelers see ‘significance' in playing Panthers", "title_page": "Kevin Gorman's Take 5: Steelers see ‘significance' in playing Panthers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pittsburgh Steelers coach Mike Tomlin seems to have a favorite phrase every week, so there was something “significant” about holding his weekly news conference on a Monday.\nTomlin kept score of the significance of the Steelers’ performance in their 23-16 victory at Baltimore - especially in the areas in which the Ravens won the last meeting, such as third-down offense, the running game and red-zone possessions - as well as contributions from backups such as right tackle Matt Feiler and quarterback Josh Dobbs.\nThe Steelers (5-2-1) have a short week of preparation for Thursday night’s game against Carolina at Heinz Field, and the Panthers (6-2) present a “significant” way to start the second half of the season.\n“Not only is it a short week,” Tomlin said, “it’s a formidable opponent.”\n1. Tough test?: Carolina’s record might appear formidable but the Panthers share something with the Steelers in that both teams played only two teams in the first half with winning records.\nThe Steelers lost to Kansas City (8-1) and beat Cincinnati (5-3), while the Panthers beat the Bengals and lost to Washington (5-3).\nThey do share several common opponents: Both beat the Bengals, Ravens and Buccaneers. The Steelers, however, handled the Falcons, 41-17, while the Panthers lost, 31-24.\nThis game could tell the true story of their starts.\n2. Coty and Artie: When the Steelers started rotating Artie Burns and Coty Sensabaugh at cornerback opposite Joe Haden, Tomlin said one would eventually create separation.\nTomlin was asked if Sensabaugh has won the starting job.\n“You tell me, based on usage,” Tomlin said.\nGiven that Sensabaugh has started the past two games and Burns didn’t take a defensive snap for the second consecutive game, that answer would be a resounding yes.\nIf it required further clarification, Tomlin gave it in his next answer. Asked if Burns, who rolled his ankle in practice Friday, was healthy enough to play against the Ravens, this was Tomlin’s reply: “He was.”\nThere you go.\nTomlin didn’t have much to say about it, but the Steelers’ 2016 first-round pick has officially lost his starting job.\nAnd another one could do the same.\n3. Morgan and Terrell: Tomlin made it clear that the strong safety spot is up for grabs, creating a battle between free-agent signing Morgan Burnett and first-round pick Terrell Edmunds.\nTomlin also made it clear that Edmunds has been starting because Burnett has been injured, which puts the onus on Burnett to win back the starting job.\nTruth is, Tomlin said the Steelers spend so much time playing sub-package football that both will be playing plenty.\n4. On ice: The Steelers escaped Baltimore without any significant injuries, except for receivers James Washington (knee) and Ryan Switzer (ankle) and defensive tackle Daniel McCullers (ankle).\nThat could create an issue at wide receiver, if both Washington and Switzer are unable to play. It could open the door for more playing time for Darrius Heyward-Bey or Justin Tucker.\nIf Switzer’s ankle injury is, um, more significant than anticipated, that becomes more complicated because the Steelers also will have to find someone to return kicks and punts.\n5. Compared to Bears: Tomlin doesn’t typically rave about opposing players, but said he spent a large majority of his film study Sunday night on Carolina’s Nos. 59 and 58.\nThat would be linebackers Luke Kuechly and Thomas Davis.\n“That’s as formidable a tandem at the linebacker position in a 4-3 scheme since (Brian) Urlacher and (Lance) Briggsin the mid-2000s, in my opinion,” Tomlin said of the former Chicago Bears.\n“Just to look at the totality of their work over the course of their careers and just look how they’re playing here in 2018, have a lot of respect for Luke Kuechly and Thomas Davis. They are quality players at all levels. They are both good against the run. They are both very good in coverage, be it zone or man coverage. They both are very good blitzers. They are traffic cops. They are aware They get others lined up. They’re special.”\nSo are Cam Newton and Christian McCaffrey, for whom Tomlin also expressed an appreciation - even if he made no comparisons.\nThat sounds like a significant challenge for the Steelers.\nHey, Steelers Nation, get the latest news about the Pittsburgh Steelers here.", "url": "https://apnews.com/e9420e2fd9a54d44824fe1fd2dd96223"}