{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:21:40", "date_modify": "2020-05-04 20:21:40", "date_publish": "2018-02-28 19:45:00", "description": "In my career as a journalist, I have encountered many public officials who respect government openness and transparency. There was the state records custodian who turned over dozens of her...", "filename": "_0f826e1482994b189a4c1f2bf9aad936_1588623700.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0f826e1482994b189a4c1f2bf9aad936_1588623700.html", "title": "Mark Pitsch: Your police, schools, statehouse all need more sunshine", "title_page": "Mark Pitsch: Your police, schools, statehouse all need more sunshine", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In my career as a journalist, I have encountered many public officials who respect government openness and transparency.\nThere was the state records custodian who turned over dozens of her boss’s embarrassing emails after telling him that keeping them secret would violate the law. And the university staffers who pointed me to public information the school tried to keep out of the public eye. And the local elected official who told me what happened in a closed session she thought may have been illegally closed.\nAs we approach this year’s annual celebration of Sunshine Week , March 11-17, it’s worth recalling times when people entrusted with our tax dollars have stood up for our right to know. But too often government agencies and elected officials pledge fidelity to openness while acting to keep us in the dark. Some recent examples:\nThe Madison Police Department failed , for more than a year, to deliver records to the Madison weekly Isthmus — even after the newspaper paid the department its requested fee. The liberal weekly and the conservative Wisconsin Institute for Law and Liberty teamed up to sue the department for dragging its feet, and the records were belatedly released. Wisconsin law says records must be provided “as soon as practicable and without delay” but doesn’t spell out how long is too long. More than a year is too long.State lawmakers, relying on advice from the Assembly and Senate chief clerks, have refused to turn over electronic copies of emails, saying they will provide only printed copies. A judge has already ruled against one lawmaker, a Republican, who was sued over this practice, while another lawmaker, a Democrat, has just been sued .The state’s bipartisan legislative leadership has denied requests for records related to allegations of sexual harassment in the Legislature on grounds that secrecy protects the victims. Of course, they could just black out victims’ names and still let the public judge the credibility of the allegations and the adequacy of the response, but have refused.The Madison School District has been less than forthcoming about disturbing allegations against teachers. In one case, a middle school teacher was dismissed after a dispute with a student, but district officials refused to share details. It took a blog post by the Madison police chief to reveal that the teacher allegedly slapped the student. In another case, a high school has refused to share details on student allegations that led to a teacher’s sudden retirement — including whether its investigation substantiated the allegations.Officials in Sauk County have taken many steps to block the public’s right to know. The local newspaper has filed a complaint over vague meeting agenda language that failed to make clear what was going to be discussed. The county also withheld information about health insurance proposals until after a committee decided which option to pick. And it skirted a law requiring the disclosure of finalists for key public jobs, for which it is now being sued .\nTaken together, these cases provide a disturbing reminder that the public’s right to know is under constant attack — and that defending it requires constant vigilance.", "url": "https://apnews.com/0f826e1482994b189a4c1f2bf9aad936"}