{"authors": ["Seth Mclaughlin", "S.A. Miller The Washington Times"], "date_download": "2020-05-04 20:17:05", "date_modify": "2020-05-04 20:17:05", "date_publish": "2018-09-20 20:20:31", "description": "DEWEY BEACH, Delaware Christine Blasey Ford grew up in Washington's affluent Maryland suburbs, graduated from an expensive all-girls private high school and spent summers immersed in the wild...", "filename": "_8d200fe6522ff1ab2fcf3159c5becaf3_1588623425.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8d200fe6522ff1ab2fcf3159c5becaf3_1588623425.html", "title": "Christine Blasey Ford remembered in Dewey Beach bar scene", "title_page": "Christine Blasey Ford remembered in Dewey Beach bar scene", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DEWEY BEACH, Delaware Christine Blasey Ford grew up in Washington’s affluent Maryland suburbs, graduated from an expensive all-girls private high school and spent summers immersed in the wild nightlife of this Eastern Shore resort town.\nShe went on to become a clinical psychology professor at Palo Alto University in California, having earned a psych degree from University of North Carolina at Chapel Hill, master’s degrees at Pepperdine and Stanford, and a Ph.D. in educational psychology at the University of Southern California.\nBut it was those early days when she was known as Chrissy Blasey, a student at the Holton-Arms School who ran with students from a network of exclusive tony schools just across the border from Washington, D.C. that have landed her at the center of the most explosive Supreme Court confirmation battle in decades.\nFirst in a confidential letter to Senate Democrats and then in a Washington Post interview, Ms. Blasey Ford accused Judge Brett Kavanaugh, a student at another expensive private school, of sexually assaulting her at a high school party 36 years ago, when she was 15 and he was 17.\nShe said he was stumbling drunk when he forced her on to a bed, tried to strip off her clothes and stifled her cries for help all while his friend watched the struggle.\nJudge Kavanaugh vehemently denies her allegation, and his supporters say it’s completely contrary to what they know about him.\nMeanwhile Ms. Blasey Ford’s family, friends and people she’s never known but who attended her school have said they believe her, say her story is all too familiar to many other female students, and say it should disqualify the judge from elevation to the Supreme Court.\n“We believe that Chrissy has acted bravely by voicing her experiences from the past, and we know how difficult this is for her,” her husband and other close family members said in an open letter posted online Thursday. “Chrissy is not someone who chooses to be in the spotlight. We ask that her decision to share a private and difficult recollection be treated seriously and respectfully.”\nIt is plausible that Judge Kavanaugh and Ms. Blasey Ford would know each other. They traveled in the same suburban circles: He at Georgetown Prep, the Jesuit boy’s school that molds the sons of privilege, and she at the all-girls bastion for the daughters of the liberal elite.\nStudents from the two schools in Bethesda, Maryland, regularly socialized, and the families in those circles often vacationed on the beaches of Delaware and Maryland Ms. Blasey Ford among them.\nLongtime residents of Dewey Beach, a Delaware resort known in the late 1980s as a place where the college students who worked the other resorts lived and partied, still remember her nights waitressing at the Waterfront, a raucous bayside bar.\n“Things that would be considered out of hand today was OK back then. Things have changed,” said a man who encountered her during those years, speaking to The Washington Times on condition of anonymity. “That was the yuppie period of time and Dewey Beach was a yuppie town and weekend warriors were coming down from D.C. It was their Vegas.”\nMs. Blasey Ford was a popular figure on the Dewey Beach bar scene.\nShe once got caught in a romantic triangle that culminated with the two men getting into a fistfight over her, according to people familiar with the incident.\n“She enjoyed the Dewey Beach nightlife,” said another resident speaking on condition of anonymity, now a restaurant owner, adding that the town was “pretty wild” in those days.\nLisa Banks, one of Ms. Blasey Ford’s lawyers, did not answer The Washington Times’ questions about her client’s Dewey Beach past.\nHer stint at the Waterfront coincides with a time in her life when her career path was uncertain, according to her friends.\nShe struggled academically late in high school and early in college before steadying herself, Jim Gensheimer, one of her close friends in Palo Alto, told the San Jose Mercury News.\nBy 1988, Ms. Blasey Ford graduated from the University of North Carolina, headed to California and seldom looked back.\nShe spent three years at Pepperdine, earning a master’s degree in clinical psychology. She went on to earn a doctorate from the University of Southern California in educational psychology in 1996.\nThree years later, she returned to Pepperdine to work as a visiting professor and then was hired by Palo Alto University in 2012 to teach as part of a consortium with Stanford University as a research psychologist and biostatistician, where colleagues have described her to news reporters as reserved.\nHer academic writings are widely published. In 2015, Ms. Blasey Ford and Helena Chmura Kraemer co-authored the second edition of “How Many Subjects? Statistical Power Analysis in Research.”\nBut she says she kept the memories of the attempted assault to herself until 2012 when, during couples therapy with her husband Russell Ford, she brought it up.\nShe married Mr. Ford, an engineer, in 2002. The couple have two teenage sons.\nThe entire family surfs and they split their time between a beach house in Santa Cruz and a home in Palo Alto.\nFriends told the Mercury News that the family eats organically and drives hybrid vehicles that they plug into a charging station in their driveway.\nOther friends described her as liberal, chatty and dedicated to her family and her career as an educator.\nMs. Blasey Ford embraces left-wing politics and opposes President Trump. Last year, she joined a Women’s March protesting Mr. Trump.\nMr. Gensheimer, who has known Ms. Blasey Ford for more than eight years, said her story about Judge Kavanaugh rings true.\n“She clearly has nothing to gain and much to lose by going public with her story. I know from things she has told me, including her need to have more than one exit door in her bedroom to prevent her from being trapped, that this event was serious enough to have a lasting impact on her life,” he said in an email to The Times.\nMs. Blasey Ford’s allegations, which threaten to upend Judge Kavanaugh’s confirmation to the high court, have made her a celebrity on the left and of the #MeToo movement.\nHer classmates and fellow alumni from Holton-Arms singed a letter to Congress vouching for her honesty and integrity. It said she came forward as an “act of civic duty.”\nThe signatories from Holton-Arms’ class of 1984 include a senior counsel at a San Antonio law firm, a middle school Latin teacher in Bethesda, the general counsel of the Office of the Inspector General in the District of Columbia, an associate professor at Harvard Medical School, a professor of Environmental Epidemiology at the Harvard School of Public Health, and the chief financial officer of the National Business Group on Health.\nJulia Louis-Dreyfus, a graduate of the class of 1979, also signed the letter.\nThe Hollywood star’s Twitter feed has been filled this week with anti-Kavanaugh posts. It included a link to a 1998 memo that Mr. Kavanaugh, then a lawyer working for the independent counsel’s investigation of the Clintons, wrote to boss Ken Starr with a series of hard-hitting and X-rated questions he proposed asking President Clinton about his relationship with Monica Lewinsky.\n⦁ Seth McLaughlin reported from Washington.", "url": "https://apnews.com/8d200fe6522ff1ab2fcf3159c5becaf3"}