{"authors": ["Kim Palmer"], "date_download": "2020-05-04 20:09:40", "date_modify": "2020-05-04 20:09:40", "date_publish": "2018-08-23 12:38:40", "description": "Woodbury resident Tim George has breathed new life into three endangered Twin Cities properties and turned them into stylish venues for weddings and other events. Now hes hoping to do the same for...", "filename": "_eed1a2e154b241f688b8beca9bfc8822_1588622980.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eed1a2e154b241f688b8beca9bfc8822_1588622980.html", "title": "Last-minute pitch to save Lake Minnetonka's historic Pillsbury mansion", "title_page": "Last-minute pitch to save Lake Minnetonka's historic Pillsbury mansion", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Woodbury resident Tim George has breathed new life into three endangered Twin Cities properties and turned them into stylish venues for weddings and other events. Now hes hoping to do the same for Southways, the historic 1919 mansion in Orono that was once the summer home for members of the Pillsbury family and is now slated for demolition.\nId looked into this in February, he said, when the mansion was on the market, as it has been for more than a decade. But at the time, he was trying to finish another project, Bavaria Downs in Chaska, formerly the Redmond Estate.\nBavaria Downs is now complete and hosted its first wedding on Aug. 19. Soon after, George learned that the city had issued a demolition permit for Southways. An Orono native, George remembers boating on the lake and admiring Southways from the water.\nThe estate, originally built as a summer house for John S. and Eleanor Pillsbury and their six children, has seen its price slashed several times in recent years. When listed in 2007 at $53.5 million, it was the most expensive house in Minnesota. After it failed to attract a buyer, the price was reduced to $24 million. Recently, the original 13-acre site was subdivided into five homesites. The 32,461-square-foot house and its remaining 3.3 acres and 415 feet of prime shoreline on Browns Bay was relisted at $7.9 million.\nIts one of a kind, unique, and thats what brides and grooms are looking for theyre tired of hotels and country clubs, said George, who also owns the Van Dusen Mansion in Minneapolis and leases Abulae in St. Paul, as well as owning Bellagala, a wedding-services company.\nAll three of his event venues were either condemned, deserted or near demolition at one point in their history, he said.\nHe contacted an Orono City Council member to gauge city reaction to the idea.\nThe council member, Victoria Seals, was receptive. All of us are willing to listen to other options, she said. Residents are disappointed and passionate. Most think its pretty unfortunate that its set for demolition. But our hands are tied. The mansion is a private property and it does not have protected status. The current seller and proposed buyer would have to agree.\nGeorge said hes been told that the house is under contract and is set to close next week, with demolition to begin before the closing. Hes now trying to reach the owners, who live in Scottsdale, Ariz. I want them to know theres an option, he said. Its a long shot.\nFencing for the demolition is already in place, said Seals, who was recently on the lake. But as of now, the mansion is still standing.\nKim Palmer 612-673-4784\n@stribkimpalmer", "url": "https://apnews.com/eed1a2e154b241f688b8beca9bfc8822"}