{"authors": ["State Journal Wire Services"], "date_download": "2020-05-04 20:06:43", "date_modify": "2020-05-04 20:06:43", "date_publish": "2018-05-16 16:47:00", "description": "“Don’t hang up. Our records indicate you may qualify for a reduction or even forgiveness of your student loan debt.” “You have been pre-selected to receive a cellular home security system...", "filename": "_9d602bb5e02942f79ebe95beb70a1c2d_1588622803.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9d602bb5e02942f79ebe95beb70a1c2d_1588622803.html", "title": "Robocalls are out of control. Here's how to keep from getting scammed", "title_page": "Robocalls are out of control. Here's how to keep from getting scammed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Robocalls are out of control. Here’s how to keep from getting scammed\n“Don’t hang up. Our records indicate you may qualify for a reduction or even forgiveness of your student loan debt.”\n“You have been pre-selected to receive a cellular home security system absolutely free.”\n“This is your final courtesy call before we are unable to lower your credit card interest rate.”\nSound familiar? It should: The number of annoying robocalls to our mobile and landline phones are increasing month by month.\nAmericans were blasted by 3.36 billion robocalls in April — up 6.5 percent from a record set in March, and nearly a 34 percent hike over April 2017, according to the Robocall Index by YouMail, a provider of voicemail and call blocking services. It amounted to about 1,297 robocalls every second.\nIn the 608 area code, that translated to 6 million robocalls, or 5.6 calls per person affected, according to the same index.\nRobocalls are automated calls that use a computerized system to deliver recorded messages to our phones. Most of those calls were from debt collectors, according to YouMail. But robocalls are also increasingly being sent by crooks who make it look like the call is coming directly from the Internal Revenue Service, the FBI, your electric company, a bank or Microsoft.\n“Robocalls are a great annoyance for American families, especially American seniors,” said U.S. Rep. Debbie Dingell, D-Mich., in opening remarks late last month at a robocalls hearing before the Digital Commerce and Consumer Protection subcommittee.\n“One-third of calls are now unwanted robocalls,” she said.\nInternet dialing driving increase\nDemocratic lawmakers in Washington have introduced various bills to stop robocalls. One bill, called the Stopping Bad Robocalls Act, would strengthen the Telephone Consumer Protection Act and help the Federal Communications Commission take more action against robocallers.\nSenate Minority Leader Charles Schumer, D-New York, said Wednesday he would support legislation to require all phone carriers to make call-blocking tools available for free to customers. The technology prevents the automated calls from ringing through by identifying suspicious phone numbers or calls, similar to how email spam filters catch unwanted emails.\nInternet dialing via easy-to-obtain software is driving the increase in robocalls, U.S. Sen. John Thune, R-S.D., said at another hearing on robocalls last month before the Senate Committee on Commerce, Science and Transportation.\nThe high-volume calling software, which makes phone calls over the Internet rather than traditional copper-wire exchanges, has made it easy for rogue operators to route calls through overseas servers, skirting laws intended to protect consumers from robocallers, Thune said.\n“These new technologies have also made it easier for scammers to hide from law enforcement and seek to gain their victims’ trust by displaying fake caller ID information,” Thune said.\nBy generating phony caller ID numbers with the same area codes as the destination numbers, the software tricks respondents into thinking they are being dialed from a local business.\n“The simple fact is the Do Not Call’ list is totally ineffectual against them,” said Sen. Richard Blumenthal, D-Conn.\n‘Spoofing’ common tactic\nOn May 10, the Federal Communications Commission approved a $120 million fine against Adrian Abramovich, who was doing business as Marketing Strategy Leaders, which initiated 96.8 million fraudulent robocalls for vacation deals. Abramovich, who lives in Miami, has denied wrongdoing.\nThe firm used “neighborhood spoofing” technology to make it seem like calls were from local area codes, according to the FCC, even using the first three numbers of the recipient’s own phone number to encourage people to answer robocalls.\nJust last week, the Wisconsin Department of Agriculture, Trade and Consumer Protection said it has received a number of recent contacts from consumers about a robocall imposter scam that claims to come from AT&T.\nThe calls have been spoofed to show AT&T’s actual customer service phone number on recipients’ caller ID displays. The automated message in the calls warns recipients of an issue with their internet service related to a security breach. Call recipients are asked to press a button in order to speak to a representative about the situation. If you do press a button to speak with a “representative,” your number will likely be added to a future call list and you may be pressed for money or personal information from a scammer, the agency warned.\nUnwanted calls — including illegal robocalls used by criminals pretending to be from the IRS and elsewhere, spoofed calls and telemarketing — are a major source of complaints for regulators. The Federal Trade Commission estimated that fraud from unwanted calls costs consumers about $9.5 billion annually.\nIn fiscal 2017, the FTC received more than 4.5 million complaints regarding robocalls and nearly another 2.6 million complaints about live callers.", "url": "https://apnews.com/9d602bb5e02942f79ebe95beb70a1c2d"}