{"authors": ["Nick Hytrek"], "date_download": "2020-05-04 20:09:44", "date_modify": "2020-05-04 20:09:44", "date_publish": "2018-11-18 20:15:00", "description": "ANNAPOLIS, Md. -- After nearly two years spent working to give the USS Sioux City and her crew a commissioning celebration they'd never forget, members of the commissioning committee held on...", "filename": "_9c21f653791646e2b8c44e1871c296d1_1588622984.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9c21f653791646e2b8c44e1871c296d1_1588622984.html", "title": "Commissioning complete, USS Sioux City heads home", "title_page": "Commissioning complete, USS Sioux City heads home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ANNAPOLIS, Md. -- After nearly two years spent working to give the USS Sioux City and her crew a commissioning celebration they’d never forget, members of the commissioning committee held on Sunday for a long goodbye to the ship and crew they have grown to love.\nWith a long, loud blast from its horn, the USS Sioux City signaled two tugboats to pull it away from the Dewey Seawall at the U.S. Naval Academy and into deeper water in the middle of the Severn River.\nDone pulling, the tugs unhooked their lines, and an officer on board the USS Sioux City called out, “Attention to starboard.” Crew members working on the decks came to the shoreside railing, stood at attention and saluted those on shore as the warship’s engines began powering the vessel forward.\n“We did it,” retired Rear Adm. Frank Thorp, the commissioning committee’s chairman, yelled to fellow committee members, including Siouxland Chamber of Commerce president Chris McGowan, who had served as co-chairman.\nWith cellphones held high to catch a few final photos and videos, committee members and other spectators walked along the seawall, following the USS Sioux City as it picked up speed and headed down the river. Reaching the end of the seawall, everyone stopped, watching the ship grow smaller and smaller as it headed to its home port in Mayport, Florida.\nMinutes before, Thorp, McGowan and other committee members posed on shore for photos with the ship’s commanding officer Cmdr. Randy Malone, who was still beaming the day after the first Navy warship named for Sioux City had been commissioned in front of more than 6,000 people and top Navy commanders.\n“There’s no moment in my career that will ever match what we did yesterday,” said Malone, dressed in fatigues rather than the dress uniforms he’d been wearing for many of the previous days’ festivities.\nOn board the ship a couple hours before leaving, crew members were stowing red-white-and-blue bunting and other banners that had been hung on board while the ship greeted more than 9,000 visitors who had toured it since its arrival in Annapolis on Tuesday.\nOne milestone down, the next -- certification of the ship and its systems -- on the horizon, said Lt. j.g. Amaia Maldonado.\nBut first, she said, a welcomed trip home to Florida after months of training that preceded sailing the ship from a Wisconsin shipyard to Annapolis. Taking part in the commissioning was fun and an honor for the 75 crew members, now they were ready to see their families and sleep in their own beds after they dock in their home port Wednesday.\n“For us, we’ve been out of our homes since June, so we’re getting home,” Maldonado said.\nAfter arriving in Florida, the USS Sioux City will receive equipment upgrades before beginning testing in January. About a year later, the ship and its crew will begin a certification process. A deployment schedule has yet to be established, Malone said.\n“We are happy that this week of celebrations are over and that we can get back to work,” Malone said.", "url": "https://apnews.com/9c21f653791646e2b8c44e1871c296d1"}