{"authors": ["Express-News Editorial Board"], "date_download": "2020-05-04 20:17:38", "date_modify": "2020-05-04 20:17:38", "date_publish": "2018-06-12 22:37:10", "description": "A new proposal for the reimagining of Alamo Plaza promises to transform the historic site in the heart of San Antonio into a “place of reverence and learning.” Before people dig into their...", "filename": "_1c94de84a45d486c977604f63507897e_1588623458.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1c94de84a45d486c977604f63507897e_1588623458.html", "title": "A promising plan for Alamo Plaza", "title_page": "A promising plan for Alamo Plaza", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A new proposal for the reimagining of Alamo Plaza promises to transform the historic site in the heart of San Antonio into a “place of reverence and learning.”\nBefore people dig into their entrenched positions about this new plan, mulling the merits of the layers of history that have accumulated on and around the site since the 1836 battle, it’s worth remembering that the existing treatment of the Alamo hardly hits the mark when it comes to reverence or learning.\nThis needs to change.\nTraffic flows over the Alamo’s historical footprint. Jarring carnival-like businesses that have nothing to do with the Alamo assault the senses. Visitors often spend a few moments at the church of the Alamo and then move on. “Is that all there is?” That’s their mantra.\nThe new proposal put forth by the city of San Antonio, the General Land Office and the nonprofit Alamo Endowment would change all of this in positive ways. The vision for Alamo Plaza would restore reverence to this hallowed ground and transform it into a space for learning and reflection. Public events could still occur. The new plan, developed by three out-of-state consultants, is a product of compromise.\nCompromise. That’s the magic word in this process. Failure to reach it is the story behind so much that eludes this city and others.\nSuch compromise is crucial to create a site that better honors this crucial moment in Texas and American history, but also the forces and people that came before and after the battle of the Alamo. The focus must be the battle, but there is a complete story to tell.\nGone is the ghastly proposed glass wall that would have separated visitors from the site. The 1930s Cenotaph would still be moved, but just 500 feet from its location and in a prominent place, greeting visitors as they enter Alamo Plaza from the south.\nPlanners envision lowering the ground 16 inches to show the base of the church and long barracks. Archaeological remnants of historic outer walls would be revealed through translucent flooring in certain areas. To tell the complete story, a 135,000-square-foot museum complex would be built.\nTrees would provide necessary shade that would invite visitors to stay at the site.\nSuch a vision comes with tough choices including partial closures of roads, moving the Cenotaph and the possible demolition of buildings across the street from the Alamo. This includes the Woolworth Building at 518 E. Houston St., where the first lunch counter in the South was desegregated in 1960.\nBut though, as many hoped, the project won’t result in a 1836 Alamo replica being built, it does restore as much as is practical the 1836 footprint, both substantively and interpretively.\nThe roads must be closed. Alamo Plaza cannot be reimagined if cars, trucks and buses continue to blast through it. Closing Alamo, Crockett and a portion of Houston streets is crucial to any credible plan that will bring to life the Alamo’s original footprint as much as possible.\nOf course, that traffic would have to go somewhere, and we like the proposed solution. Making nearby Losoya Street open for two-way traffic would likely improve flow and create a much-needed north-south connection across downtown.\nWe understand the concerns about moving the Cenotaph because of its own historical value and the reverence it expresses for those who fought and died at the Alamo. But it was not part of the battle. An earlier proposal to move the Cenotaph to a pocket park on Market Street drew controversy, but moving it just to the south of Alamo Plaza would give it a position of prominence, highlight its importance and not distract visitors from the Alamo.\nThis is compromise.\nThe future of four buildings across the street from the Alamo remain in question. Planners have studied a range of options, including keeping their facades and razing all four buildings. We await further information, but our default position continues to be to restore the site as close to the 1836 footprint as much possible. Should the buildings be razed, planners will need to honor the historical significance of the Woolworth Building’s lunch counter.\nThis interpretive plan is a much-needed step in that direction, and while we expect more changes with greater public input, it generally merits City Council approval in the fall.", "url": "https://apnews.com/1c94de84a45d486c977604f63507897e"}