{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:17:08", "date_modify": "2020-05-04 20:17:08", "date_publish": "2018-01-26 10:26:00", "description": "When you have to get away from the books for a while, the Tri-State area has an array of must-see attractions. West Virginia Blenko Glass: Located at Blenko Glass Company off of James...", "filename": "_4b21be122e6b4a9d8663b0f9fa1d77e0_1588623428.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4b21be122e6b4a9d8663b0f9fa1d77e0_1588623428.html", "title": "AREA ATTRACTIONS", "title_page": "AREA ATTRACTIONS", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When you have to get away from the books for a while, the Tri-State area has an array of must-see attractions.\nWest Virginia\nBlenko Glass: Located at Blenko Glass Company off of James River Turnpike in Milton. Historic museum on second floor of the Visitors Center features extensive stained glass display, history of the family owned glass company, Country Music Award and U.S. Capitol lighting globe on display. Tours also available. Admission is free. Hours are: 8 a.m. to 5 p.m. Monday through Friday, 9 a.m. to 5 p.m. Saturday and noon to 4 p.m. Sunday. Call 304-743-9081.\nCamden Park: Originally developed as a picnic area by the Camden Interstate Railway in 1903, Camden Park has survived into the 21st century as a thriving traditional amusement park. Today, it is the oldest amusement park in West Virginia with about 30 rides, including the classic wooden roller coaster, The Big Dipper. Located at U.S. 60 West, Huntington. Hours vary, but the park typically is open on weekends in May, Wednesday through Sunday in June, Tuesday through Sunday in July before hours trail off through August and September. Call 304-429-4321. Go online at www.camdenpark.com.\nHeritage Farm Museum and Village: Recreates turn of the century Appalachian life in restored log buildings, including a pioneer village with blacksmith shop, antique shop, church, petting zoo, bed and breakfasts, museums, community room, old school house and more. Guided tours available all year 10 a.m. to 3 p.m. Monday through Saturday (except for Thanksgiving, Christmas and, in the winter months, weather permitting). Groups of 15 or more qualify for special group rates when making advance reservations. Located at 3350 Harvey Road, Huntington. For more information, call 304-522-1244, or visit www.heritagefarmmuseum.com.\nHuntington Museum of Art: Conservatory, silver and portraits, firearm collections, gallery, glass, museum shop and various changing exhibits. Located at 2033 McCoy Road, Huntington. Call 304-529-2701. Go online at www.hmoa.org.\nJ Taylor Auto Collection: 14th Street West, Huntington. A growing collection of cars and automobile items, geared toward the car lover. Free admission. Call 304-522-2864 for times.\nClay Center: Clay Center houses the performing arts, visual arts and the sciences under one roof. The facility is home to the Avampato Discovery Museum and the West Virginia Symphony Orchestra, the 1,883-seat Maier Foundation Performance Hall, the black-box Walker Theater, the large-format film ElectricSky Theater and more. Located at 1 Clay Square, Charleston. For information, visit www.theclaycenter.org or call 304-561-3500 or 888-241-6376.\nMothman Museum: Main Street in Point Pleasant. Located in the heart of Mothman country, this museum is the world’s only museum about the infamous Mothman. Visitors can experience multimedia presentations, rare Mothman archives and movie props. Don’t miss the gift shop. Call 304-675-6788 or log onto www.mothmanlives.com.\nWest Virginia State Museum: Located in the Cultural Center, State Capitol, Charleston. Doors are from 9 a.m. to 8 p.m. Monday through Thursday. 9 a.m. to 6 p.m. Friday and noon to 6 p.m. Sunday. Call 304-558-0220. The museum is currently under renovation. The library is open 9 a.m. to 5 p.m. Monday through Friday and the archives department is open Monday through Thursday 9 a.m. to 8 p.m. and 9 a.m. to 5 p.m. Friday and Saturday.\nMidland Trail National Scenic Byway: This award-winning tourist highway takes travelers along U.S. 60 east from Kenova, W.Va., through Huntington,\nCharleston and the New River area before ending 180 miles later at White Sulphur Springs, near the state’s border with Virginia. Highlights of the trail include historic sites such as the Toll House in Barboursville, the Wine Cellars of Dunbar, Booker T. Washington’s cabin in Maiden, the African-American Family Tree Museum in Ansted, the Carnifex Battle Museum in Summersville, and many more. The trail is also rich with outdoor adventures including Hawks Nest State Park. You’ll also find tons of restaurants, museums, galleries and crafts and specialty shops along the way. For up-to-date travel information, log on to www.mid-landtrail.com.\nOhio\nBurlington 37 Cemetery: Located on Center Street in Burlington, a memorial marker of the 37 slaves freed in 1849 by James Twyman, stands at the gates of this cemetery. All 37 names have been engraved in the marble stone to commemorate their courage. For more information, call the Lawrence County Convention and Visitors Bureau at 740-377-4550.\nThe John Campbell Home: John Campbell was the founder of Ironton who also served to help runaway slaves. The slaves traveled through tunnels into the basement, up a back staircase and hid under the eves of the roof until Campbell could finalize plans for their move further north. The historic packed area can be found at North Fifth St. in downtown Ironton. For more information, call the Lawrence County Convention and Visitors Bureau at 740-377-4550.\nKentucky\nHighlands Museum and Discovery Center: History center with hands-on interaction for children. Located at 1620 Winchester Ave., Ashland. Hours are from 10 a.m. to 4 p.m. Tuesday-Saturday. Mondays by appointment. Admission is $4 and $3.50 for children and senior citizens. Call 606-329-8888.\nParamount Arts Center: Located at 1300 Winchester Ave., Ashland. Hours are from 9 a.m. to 4 p.m. Monday-Friday and closed Saturday and Sunday. Call 606-324-3175.\nKentucky Folk Art Center: Folk art and exhibition rotated every three months along with a large permanent selection. 102 W. 1st St., Morehead, Ky. Hours are 9 a.m. to 5 p.m. Monday-Saturday and 1 to 5 p.m. Sunday. Admission is $3 for adults, free for children 12 and younger and $2 each for seniors 55 and older and groups. Call 606-783-2204 or log on to www.kyfolkart.org.\nThe Country Music Highway Museum: Located just off of U.S. 23 in Paintsville, Ky., The Country Music Highway Museum opened in spring 2005, and is already a must-stop for country music fans. Enjoy the interactive exhibits featuring the memorabilia of Eastern Kentucky born and raised stars such as Tom T. Hall, Loretta Lynn, Rebecca Lynn Howard, Billy Ray Cyrus, Ricky Skaggs and others. Call 800-542-5790 or go online at www.paintsville.org.\nHatfield-McCoy Feud Sites and Audio Driving Tour: Stop in at the Pike County Tourism Office at 781 Hambley Blvd., Pikeville, to purchase a CD that gives audio details about 12 feud sites and information about the historic conflict between the Hat-fields of West Virginia and the McCoys of eastern Kentucky. Then drive to the sites where the feud unfolded. Call 606-432-5063.", "url": "https://apnews.com/4b21be122e6b4a9d8663b0f9fa1d77e0"}