{"authors": ["Eric Blanc", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 20:00:14", "date_modify": "2020-05-04 20:00:14", "date_publish": "2018-03-30 00:00:00", "description": null, "filename": "2018_03_oklahoma-teachers-strike-west-virginia_1588622414.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/03/30103342/slack-imgs.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_03_oklahoma-teachers-strike-west-virginia_1588622414.html", "title": "It’s Oklahoma’s Turn to Strike", "title_page": "It’s Oklahoma’s Turn to Strike", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe historic victory in West Virginia has inspired teachers and staff across the United States. Marches, rallies, and sickouts in defense of public schools have spread to Kentucky, Arizona, Wisconsin, and beyond. Whether this movement becomes a bona fide strike wave will depend to a significant degree on what happens in Oklahoma over the coming days. Demanding major increases in pay and school funding, Oklahoman educators are set to strike on April 2. The similarities with West Virginia are obvious. In a Republican-dominated state with a decimated education system and a ban on public employee collective bargaining, an indignant workforce teetering on the edge of poverty has initiated a powerful rank-and-file upsurge. But history never repeats itself exactly. To strike and win, Oklahoma workers will have to overcome a range of distinct challenges and obstacles.\nA Movement Emerges On March 25, a Tulsa World editorial noted that “given the recent history of Oklahoma it isn’t remarkable that teachers are planning to strike. What’s remarkable is that it didn’t come sooner.” But bad conditions and attacks on working people never lead automatically to mass movements. Political resignation is usually more common than resistance since workers, particularly where labor organizations are weak, tend to search for individual solutions to collective problems. “Until very recently,” says Miller, “Oklahoma teachers have been going without any hope, feeling like nothing could be done to change things. People would say, ‘It is what it is; it’s out of our power.’” In recent years, union-led efforts to reverse the attacks on public services and education have yielded few results in Oklahoma. On March 31, 2014, a big rally for public education took place at the state capitol — yet that very day, a legislative committee voted to further slash taxes. In 2016 an initiative was put on the ballot to give teachers a $5,000 raise. The measure was overwhelmingly defeated, in large part because the raise would have been paid for by increasing the state’s sales tax, instead of taxing the wealthy. More recently, in February of this year, a legislative proposal called Step Up Oklahoma — jointly backed by business leaders, the governor, and the OEA teachers’ union — would have given teachers a $5,000 salary increase, primarily by levying regressive sales taxes. The proposal failed to clear the 75 percent supermajority hurdle, but the very fact that leading Republicans were now talking about modestly raising taxes testified to their growing awareness that the crisis of public education had become a political time bomb. Oklahoma unions deserve credit for helping keep the issue of teacher pay and school funding squarely in the public eye over recent years. Yet, as in West Virginia, the initiative for the current movement has mostly come from below. The first steps took place in 2017. Mickey Miller, one of the co-founders of Oklahoma Teachers’ United (OTU), described the formation’s modest beginnings: It was a night in October, I had just gotten done with my third job when I got a text, saying: “Hey, my name is Larry Cagle, I’m a teacher nearby, I heard that you’re also frustrated with what’s going on, that you’ve been talking walkout.” So we met in Starbucks and traded stories from the school trenches. When Larry suggested we actually try to get things moving, I initially said I didn’t have time to do anything. But we eventually decided to create a Facebook group. The OTU group started off slow, but eventually began to gain traction. By January, Miller recalls, OTU had thousands of Facebook followers: Many of these teachers acted on our proposal to hold sickouts that month, to energize the OEA and legislature to fix the problems of public education in Oklahoma. From day one, this has been a grassroots movement. The union has been forced to play catch up. I’m in favor of unions — but we need strong unions. Another important independent initiative came from teachers, students, and their supporters in the town of Bartlesville. In the summer of 2017, teachers started floating the idea of a walkout for public education. The day after Step Up Oklahoma failed, on February 12, 2018, Bartlesville superintendent Chuck McCauley polled superintendents statewide about the possibility of a temporary suspension of classes to put more pressure on the legislature. Bartlesville students were the first to turn from words to deeds. Incensed by a new round of school budget cuts — $22 million in total — Bartlesville High School senior Chloe Maye took the initiative to call for a student walkout on February 22. The hundreds-strong action — and a contentious Facebook exchange between Maye and a state senator she invited to the protest — garnered wide attention across the state and helped generate momentum for further bottom-up actions. By late February, protests had begun to bubble up across Oklahoma, yet they remained embryonic and localized. Then came West Virginia. The entire political dynamic changed in the course of a week, as Micky Miller recalls: Oklahoma teachers have felt hopeless and powerless for years. So when I first heard about West Virginia, I didn’t think it would spill over for us. But teachers here started closely watching the strike. They began saying, “Wait a second, they did it there, they were able to get all counties to go out. Why can’t we do that here?” People saw that West Virginian strikers were strong, that they didn’t back down. The legislature gave a little and the union leaders said to go back to work, but the teachers and staff continued to strike anyways, until they won all their demands. Inspired by West Virginia’s example, strike fever rapidly spread across Oklahoma. On March 1, Alberto Morejon — a twenty-five-year-old middle-school teacher in Stillwater — created a Facebook group titled “Oklahoma Teacher Walkout — The Time is Now!” Within two days, the group’s membership shot up to the tens of thousands. This rank-and-file explosion immediately raised a critical question: who had a legitimate mandate to speak in the name of educators? Teachers’ unions in Oklahoma are even weaker than in West Virginia — but so are the networks of the militant rank-and-file. The OEA represents only roughly twelve thousand of the state’s forty-two thousand active teachers, as well as a smaller percent of support staff. This weakness is the result not only of Oklahoma’s reactionary anti-union laws, but also the manifest ineffectiveness of the OEA’s decades-long focus on lobbying the legislature and electing Democratic Party politicians. Meanwhile, unlike West Virginia, Oklahoma lacks a militant minority of well-rooted, radical workplace activists. It has often been overlooked that many of the teachers who initiated the strike in West Virginia were respected local union representatives and activists. This allowed them to lean on their existing city, regional, and statewide union infrastructure to push for the strike at the same time as they challenged the timidity and compromises of top union officials. In Oklahoma, the main leaders of the rank-and-file upsurge are almost completely divorced from the union. This has obliged them to rely very heavily on Facebook, a useful but limited mobilizing tool. Due to the absence of strong labor organizations or traditions, Oklahoma has not experienced the school-by-school votes to strike that played such a key role in building, unifying, and legitimizing the West Virginia action. Without these site-based democratic votes, it would have been far easier for West Virginia union officials or superintendents to subsequently monopolize the leadership of the movement. The depth of privatization in Oklahoma is another divide that any effective strike will have to confront. Many school janitors and cooks work for private contractors. And David Chaney, superintendent of Epic Charter Schools, has announced that its district of fourteen thousand will refuse to close any schools. For all of these reasons, the fight for statewide labor unity faces a more uphill battle in Oklahoma than it did in West Virginia. Given the relatively fractured and amorphous nature of Oklahoma’s upsurge, it should come as no surprise that debates and tensions emerged in the first week of March. While the OTU and Alberto Morejon pushed for a walkout to begin on April 2, the OEA called for a work stoppage to start, as a last resort, on April 23. “People were infuriated with the April 23 date,” explains Mickey Miller. “We told the OEA, you’ve got to change that date.” In this first test of strength between the movement’s contending wings, the union leadership backed down. On March 7, the OEA announced that the walkout would now begin on April 2 if the workers’ demands were not met. Proposing an immediate $800 million revenue increase, the union demanded a raise of $10,000 for teachers and $5,000 for support staff, $200 million for increased school funding, $213 million for state employee raises, and a $255.9 million increase in health care funding. The public employees’ union, the Oklahoma Public Employees Association (OPEA), soon afterward joined the call for an April 2 work stoppage. To generate the necessary funds, the OEA — together with the OPEA and the small American Federation of Teachers affiliate — proposed a revenue plan that mixed regressive and progressive taxes, in which the gross production drilling tax would be raised only back to 5 percent, rather than 7 percent or higher. Momentum for the strike grew steadily over the next three weeks. With the support of the OEA, teachers began “work to rule” protests, in which they ceased all extra work that is necessary for teaching but not specified in the contract. Across the state, teachers and community members prepared food and child care services for students during the impending strike. By all accounts, the movement has the firm support of parents and students alike. At least 138 school boards passed resolutions in support of the action. And a large majority of superintendents pledged to close schools in solidarity with the teachers — at least on April 2, if not longer. Micky Miller explained the dynamic: Once the teachers took a stand, then the rest of the superintendents jumped on board. It’s like a restaurant — a manager can’t open the place without the servers and cooks. So the superintendents got spooked and said, “We’ve got to get in front of this.”", "url": "https://www.jacobinmag.com/2018/03/oklahoma-teachers-strike-west-virginia"}