{"authors": ["Emilie Munson"], "date_download": "2020-05-04 20:10:38", "date_modify": "2020-05-04 20:10:38", "date_publish": "2018-05-25 20:16:34", "description": "With the help of a federal grant, Connecticut will kick off Troops for Teachers, a program that trains veterans to become K-12 educators, Gov. Dannel P. Malloy and Connecticut congressional...", "filename": "_e66d3e523ecb4cf6968143f2fa121612_1588623038.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e66d3e523ecb4cf6968143f2fa121612_1588623038.html", "title": "Connecticut launches Troops for Teachers veteran training program", "title_page": "Connecticut launches Troops for Teachers veteran training program", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With the help of a federal grant, Connecticut will kick off Troops for Teachers, a program that trains veterans to become K-12 educators, Gov. Dannel P. Malloy and Connecticut congressional leaders announced Friday.\n“The men and women of our armed forces are a uniquely talented group of people with an exceptional skill set that undoubtedly can be beneficial in the classroom as they move into civilian life,” Governor Malloy said.\nAdministered by the state Department of Education, the program will provide returning service members and veterans training to become teachers and help them find positions at public and charter school with many low-income students after their training is complete. The program will also give vets support as they transition into their new job.\nTroops for Teachers is funded by a $1.1 million grant from a part of the U.S. Department of Defense called Defense Activity for Non-Traditional Education Support.\n“This major federal grant is a win for veterans looking to begin this exciting career transition, and also for Connecticut children who will benefit from their skills and talents,” said Sen. Richard Blumenthal, D-Conn, who attended the announcement at Middletown High School in Middletown, Conn.\nThe program will recruit a minimum of 40 teachers in its first year.\nThere are approximately 200,000 veterans now living in Connecticut, according to the governor’s office. Nearly 41,000 are between the ages of 20 to 44.\n“With Troops to Teachers, we can deploy dedicated and disciplined veterans to proudly serve again, this time in the classroom,” said U.S. Rep. Rosa DeLauro of Connecticut’s 3rd District, who is the senior Democrat on the Congressional Committee that funds social programs.\nemunson@hearstmediact.com; Twitter: @emiliemunson", "url": "https://apnews.com/e66d3e523ecb4cf6968143f2fa121612"}