{"authors": ["Amanda Burke", "Aburke Sentinelandenterprise.Com"], "date_download": "2020-05-04 20:07:15", "date_modify": "2020-05-04 20:07:15", "date_publish": "2018-01-20 11:33:47", "description": "LEOMINSTER -- Police have issued a warrant for the arrest of a city woman who is accused of leaving two children unattended in a car that was parked outside a department store on Black Friday in...", "filename": "_c705adb1be774910bcb9b1a777f1c927_1588622835.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c705adb1be774910bcb9b1a777f1c927_1588622835.html", "title": "Police: Leominster Woman Left Children in Car During Black Friday Shopping", "title_page": "Police: Leominster Woman Left Children in Car During Black Friday Shopping", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LEOMINSTER -- Police have issued a warrant for the arrest of a city woman who is accused of leaving two children unattended in a car that was parked outside a department store on Black Friday in November, according to court documents.\nPerla Duarte, 27, of 740 Central St., Apt C6, was charged with two counts of reckless endangerment of child after police responded to a report on Nov. 24 of a “baby and a small child left unattended in a car for at least an hour,” according to a police report.\nWhen an officer arrived outside the store after 10:04 a.m. Duarte had returned to her vehicle and began pulling out of the parking spot, according to the report.\nA 2-year-old baby who was not in a car seat and a 5-year-old child were in the back seat, the report states.\nDuarte told the officer she had been inside the store for about five minutes, according to the report, and that she left the children in the car “because there were too many people in the store,” according to court documents.\nA dispatcher told the officer a caller reported seeing the children alone in the car on her way inside Kohl’s and then again on her way out, according to the report.\nThe caller remained with the children for an additional 20 minutes, the report states.\nDuarte told police the baby was her child, and that she was baby-sitting the 5-year-old, according to the report.\n“Ms. Duarte was advised of the poor job she was doing,” the officer wrote in the report, adding that he advised her of the dangers of leaving two young children in a car alone in 44-degree weather on “one of the busiest shopping days of the year.”\nA report of suspected abuse or neglect was filed and the Department of Children and Families responded to the parking lot, according to the report.\nDuarte failed to appear in Leominster District Court for an arraignment hearing on Thursday, according to court documents. A warrant has been issued for her arrest.", "url": "https://apnews.com/c705adb1be774910bcb9b1a777f1c927"}