{"authors": ["Cody Ronnfeldt"], "date_download": "2020-05-04 20:12:20", "date_modify": "2020-05-04 20:12:20", "date_publish": "2018-06-28 10:09:00", "description": "NORFOLK - A Town Hall Meeting was held Wednesday night with Mayor Josh Moenning. The meeting was hosted by the Nebraska Conservation Education Fund. Moenning gave a presentation followed by...", "filename": "_2d0b75f79afb466e9e7c7d9d7906048b_1588623140.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2d0b75f79afb466e9e7c7d9d7906048b_1588623140.html", "title": "Mayor Josh Moenning addressed a number of topics at Town Hall Meeting", "title_page": "Mayor Josh Moenning addressed a number of topics at Town Hall Meeting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NORFOLK - A Town Hall Meeting was held Wednesday night with Mayor Josh Moenning.\nThe meeting was hosted by the Nebraska Conservation Education Fund. Moenning gave a presentation followed by a public question and answer period.\nSome hot topics Moenning hit on was about where Norfolk is heading in the next three years, its economy, road construction, downtown revitalization, housing, and energy production.\nMoenning says Norfolk has a lot of potential to be effective energy producers.\n“We have huge potential in renewable resources. Nebraska has the 3rd highest wind energy potential in the country. If you look at the maps the best resources are right here in Northeast and North Central Nebraska. Also, believe it or not we have the 7th or 8th highest solar energy potential in the country.”\nHousing shortages have also been an issue in Norfolk, but Moenning says there is progress being made.\nHe says in the last year the city has issued more building permit than any time since 2006. More than 900 new housing units have been proposed in the next couple of years.\nMoenning says Norfolk is in the midst of an encouraging upward trend going forward.", "url": "https://apnews.com/2d0b75f79afb466e9e7c7d9d7906048b"}