{"authors": ["Michael H. Hodges"], "date_download": "2020-05-04 21:06:23", "date_modify": "2020-05-04 21:06:23", "date_publish": "2018-01-04 01:02:24", "description": "Jenny Risher just keeps crafting love letters to Detroit. The first was the photographer's 2013 book \"Heart Soul Detroit: Conversations on the Motor City\" (Momentum Books), a series of...", "filename": "_6b3162d96b584811811b995314823ba5_1588626383.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6b3162d96b584811811b995314823ba5_1588626383.html", "title": "Photographer's new book examines Detroit hip-hop", "title_page": "Photographer's new book examines Detroit hip-hop", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jenny Risher just keeps crafting love letters to Detroit.\nThe first was the photographer’s 2013 book “Heart Soul Detroit: Conversations on the Motor City” (Momentum Books), a series of interviews and portraits of Detroit luminaries ranging from Eminem to Lily Tomlin to Al Kaline.\nWith her new book, “D-Cyphered” — just released in December — Risher opens up a window into the world of Detroit hip-hop and rap, with about 100 high-style pictures of artists famous and unknown shot in iconic locations across the city.\nEighty-three of Risher’s photographs also are on display at the Detroit Institute of Arts, where the exhibition “D-Cyphered” will be up through Feb. 28.\nHer ambition, Risher said, was to document Detroit hip-hop, much like photographer Leni Sinclair did for 1960s and ’70s rock ‘n’ roll.\n“Leni Sinclair was a hero of mine,” Risher said. “I thought it was so amazing how she captured the rock ‘n’ roll decade, and I wanted to do that with hip-hop.”\nThe 43-year-old College for Creative Studies graduate says she grew up hearing some hip-hop as a kid in Mt. Clemens, but makes no claims to expertise.\n“I really wanted people to tell their own story,” she said. “I just produced the book. I took the pictures and put the puzzle together, but I could never tell that story myself.”\nThe result is an epic visual tour through the hip-hop world, with beautifully composed portraits that alternate between the serious and the amusing. (Case in point: DJ Godfather is shot with the giant I-94 Uniroyal tire rising up around his head like a medieval halo.)\nTo give the work gravitas and a real grounding in hip-hop history, Risher turned to Hex, aka Ironside Hex, the impresario who managed some of Detroit’s key acts and wrote the lengthy essay that opens the book.\nRisher notes that Hex is paralyzed from a stroke and only has limited movement. As a result, she said, “he wrote the whole essay on his phone with his thumbs. That was just incredible.”\nThe portraits start with an image of Trick Trick & The Goon Sqwad inside the parking deck that was once the Michigan Theatre, and close with Supa Emcee in a “Big Proof Forever” T-shirt, a tribute to the “mayor of Detroit hip-hop,” rapper Proof — aka DeShaun Holton — who died in a 2006 shooting.\nRisher says she wanted to show off the city of Detroit as well, and many of the artists she shot picked famous locations for their portraits, from the Joe Louis fist on Jefferson to Baker’s Keyboard Lounge to the Michigan Central Depot.\nAdding to the Detroit ambience, classic Big Three cars populate the pictures. (Intriguingly, Risher says her next photography project will be “car-related,” though that’s as far as she’s willing to go.)\nRisher’s entree to the hip-hop world started with shooting Eminem for “Heart Soul Detroit,” and the contacts she made there helped her reach other artists.\nAll the same, breaking in was no easy task for an outsider.\nPoet Jessica Care Moore, who calls Risher’s book “gorgeous,” was reluctant at first to even return the photographer’s phone calls.\n“When you’re not from the community, and Jenny definitely wasn’t one of us,” Moore said, “there can be criticism — ‘Who is she to take pictures of us?’ ”\nBut when her good friend Khalid El-Hakim vouched for Risher, that was all the Corktown resident needed to hear.\n“Khalid said, ’She’s good and worked with Em and is a great photographer. You should do it.”\nIn some ways, Risher says, both her naivete and identity probably helped win people over.\n“Being a nerdy Asian girl helped,” she said, “as well as being open and inquisitive, and not shy about asking, ‘What does that mean?’ ”\nIn any case, the rapport she developed with her subjects is evident in the relaxed, naturalistic look of her portraits.\n“Jenny seems to really know how to collaborate with her subjects,” said DIA photography curator Nancy Barr.\nmhodges@detroitnews.com\n(313) 222-6021\n@mhodgesartguy\nHip-hop at the Detroit Institute of Arts\n“Friday Night Live! Awesome Dre”\nDetroit Film Theatre Auditorium\n7 p.m. Friday\n(313) 833-7900\ndia.org\n’D-Cyphered: Portraits\nby Jenny Risher’\n$44.95\nAvailable at dcyphered.com — as well as Book Beat, Detroit Hustles Harder, Detroit Mercantile, Foundation Hotel, Pure Detroit and The Detroit Shoppe.", "url": "https://apnews.com/6b3162d96b584811811b995314823ba5"}