{"authors": ["Times-Tribune Readers"], "date_download": "2020-05-04 20:07:21", "date_modify": "2020-05-04 20:07:21", "date_publish": "2018-04-28 00:00:00", "description": "Victim grateful for help Editor: I am the 75-year-old woman who was robbed in the Dickson City Wegmans parking lot April 12 while loading groceries into the trunk of my car. A car...", "filename": "_7f34c45b4ad64254b1216047e790b72b_1588622841.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7f34c45b4ad64254b1216047e790b72b_1588622841.html", "title": "Letters To The Editor 4/28/2018", "title_page": "Letters To The Editor 4/28/2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Victim grateful for help\nEditor: I am the 75-year-old woman who was robbed in the Dickson City Wegmans parking lot April 12 while loading groceries into the trunk of my car.\nA car drove by me, a woman jumped out , rushed toward me saying “I need to use your phone,” and grabbed my purse. My natural instinct was to try to retrieve it. I chased after the woman and reached into the car as she was jumping back in. The male driver stepped on the gas and dragged me along as I fell out of the car onto the pavement. They then raced off.\nIt was a horrible experience I won’t soon forget.\nMy purpose is to sincerely thank all those people who came to my defense – the Dickson City police who were amazing and second to none. They nabbed the suspects and before the night was over and charged them with the purse-snatching. Thanks to the crew who came and attended to my injuries, a gentleman who sped off to follow the suspects, get a picture of the car and license plate. Thanks to others who said they could positively identify the woman if necessary, along with the woman who approached me in her car as she was leaving and offered me money. I told her I didn’t want it but she insisted and stuck it in my pocket as she drove off.\nThanks to the Wegmans manager and other employees helped me any way they could. I want you all to know how very appreciative I am for your kindness and help. It’s wonderful to know there are still amazing people in this world.\nLastly, for the suspects who caused this nightmare, I hope they feel it was all worth it.\nKAREN McNICHOLS\nOLYPHANT\nGod left out of society\nEditor: In regard to “God unwelcome” (March 31), writer Dale Wilcox captured my attention, especially the part where he said people want to know, “Where is God?” in reference to school shootings.\nWell, Mr. Wilcox, you hit the nail on the head. Court rulings forbid prayers, Bible study and the Ten Commandments during class times. These rulings helped guns replace religion in our schools. So, basically, we threw God out over the last 50 years.\nI would like to add to the list how we leave God out of our society. First, churches are closing due to poor attendance. Church closings are tantamount to leaving God homeless.\nThe wedding feast at Cana, referred to in a New Testament gospel, stands in stark disapproval of same sex marriages. This is why the sacrament of matrimony is a critical part of Christian values.\nWhen our lawmakers legislated these laws, they removed God’s teachings and God.\nJOE DOMIANO\nOLD FORGE\nPerformance saluted\nEditor: Recently, my wife and I had the pleasure of attending the North Pocono High School Drama Club’s production of “West Side Story.”\nIn 1957, I saw the debut of “West Side Story” on Broadway. It was fantastic. Years later, I enjoyed a performance of the show at the Scranton Cultural Center. It also was great.\nTo think that a group of young students with great direction, fabulous music, outstanding stage settings and stage crew accomplished the same greatness that the professionals did was amazing. It was a job well done and they should be proud of themselves.\nI look forward to the club’s production next year.\nBOB JONES\nCOVINGTON TWP.\nPraise for youth theater\nEditor: Years ago when my children were little a Disney movie came to the theater, “Beauty and the Beast.”\nAs an adult I was reminded that a child’s story can teach of us the importance of love and respect. “Beauty and the Beast” became a favorite of mine and I saw it performed in New York City and when it was a Broadway Theater production at the Scranton Cultural Center. I saw it performed recently by the Scranton Cultural Center Youth Theatre Program.\nIt has a lesson people of all ages should know. We see such disrespect for people today. Children are taught by adults and pick up negative behaviors. Because the prince in the story looked down on people and did not accept them for who they are he becomes the beast. He had the opportunity to become a man again if only he learned to love and to have someone love him. In true Disney fashion the beast learns love and respect and he and all those in the castle that were under the spell become human again. Wouldn’t it be wonderful if the beasts in our society would learn to love and respect like a human again too?\nI was at the cultural center to see talented youth perform this tale as old as time. The cast deserved clapping, cheers, a standing ovation and all the compliments they were given. Director Camille Reinecke, musical director Joey James and the entire staff did an outstanding job encouraging and developing our young generation. Thanks for the investment you have made in their lives.\nHow long must we disrespect and mistreat people and live more like the unlovable Beast instead of realizing there is something there, something wonderful in everyone we meet? No matter what, please don’t be a beast.\nRENEE JOHNSON\nFACTORYVILLE\nGet on public payroll\nEditor: Did people forget what happened in the last eight years?\nThere’s no jobs. Factories were leaving and going overseas. People were forced to buy health insurance. Businesses closed because of all the new regulations. Small businesses went broke and could not expand.\nLook around you and see towns with nothing but closed businesses. If I had a job with the federal or state government, there would be nothing to complain about.\nIt seems Democrats don’t want people to work for a living. They want people to go on welfare or assistance and not pay taxes. Let other people pay your bills.\nSome people complain about all the perks the politicians have. It’s been going on with both parties. The last administration did the same thing.\nI’m 86 years old and nothing has changed. Now that Donald Trump is president all of a sudden people came out of the woodwork and blamed him for everything. Did you know that the president puts his left shoe on first? He must be crazy, let’s get rid of him.\nEvery penny you get in your paycheck means a lot. People go on strike with unions for a dime or 25 cents more an hour. This is a pittance and maybe the strikers lose weeks of work for it.\nI tell every young person to make sure to try to get a state or federal job. You can’t go wrong.\nEMIL KONZMAN\nCLIFFORD TWP.,\nSUSQUEHANNA COUNTY", "url": "https://apnews.com/7f34c45b4ad64254b1216047e790b72b"}