{"authors": ["Michelle Jarboe", "The Plain Dealer"], "date_download": "2020-05-04 20:05:05", "date_modify": "2020-05-04 20:05:05", "date_publish": "2018-02-22 17:35:00", "description": "Businessman Tony George is winning bidder for historic Euclid Avenue church, at $489,500 CLEVELAND, Ohio -- A partnership led by businessman Tony George hopes to transform the sanctuary of...", "filename": "_a373ad750ac84425b0b07667e390b6b5_1588622705.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a373ad750ac84425b0b07667e390b6b5_1588622705.html", "title": "Businessman Tony George is winning bidder for historic Euclid Avenue church, at $489,500", "title_page": "Businessman Tony George is winning bidder for historic Euclid Avenue church, at $489,500", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Businessman Tony George is winning bidder for historic Euclid Avenue church, at $489,500\nCLEVELAND, Ohio -- A partnership led by businessman Tony George hopes to transform the sanctuary of the historic First Methodist Church into a banquet facility, with offices tucked into a former school building behind it.\nGeorge emerged as the winning bidder for the property during a Thursday morning auction. The church complex will sell for $489,500 - George’s high bid of $445,000 plus a 10 percent buyer’s premium. The sale is scheduled to occur by March 29.\nDuring an interview, George said he envisions removing the pews, leveling out the main floor of the Gothic-inspired church and hosting weddings and events in the space. George, his family members and business partners already control a stable of restaurants, including Crop Bistro & Bar, an Ohio City eatery that fills a dramatic former bank lobby.\n“We turn away 100 weddings a year at Crop,” George said, adding that he believes there’s ample demand to support a venue in Midtown.\nHe wouldn’t identify his partners in the church acquisition. And he said it’s too soon to discuss potential occupants for the former school building, a three-story, 1960s addition that’s likely to be renovated as offices.\nJeff Epstein, executive director of MidTown Cleveland, Inc., said the neighborhood nonprofit organization stands ready to assist George with the project.\nIt’s unclear whether George will seek federal and state historic tax credits to help offset the costs of redeveloping the buildings. The church is designated as a city landmark and is listed on the National Register of Historic Places. “Sometimes, for the tax credits, you have to jump through so many hoops,” George said Thursday.\nDedicated in 1905, the church was home to the First United Methodist Church of Cleveland for 105 years. In early 2010, the congregation merged with the smaller Epworth-Euclid United Methodist Church in University Circle and moved services to Epworth-Euclid’s well-known building at East 107th Street and Chester Avenue.\nAfter unsuccessfully marketing the Midtown property for sale more traditionally, at higher prices, the congregation offered it up for auction. The minimum sale price was $250,000.", "url": "https://apnews.com/a373ad750ac84425b0b07667e390b6b5"}