{"authors": ["The Herald-Dispatch"], "date_download": "2020-05-04 20:21:35", "date_modify": "2020-05-04 20:21:35", "date_publish": "2018-03-25 11:02:07", "description": "ONA — On a cold, snowy day that postponed or canceled baseball and softball games throughout the Tri-State, youth sports still were played. From West Virginia, Ohio and Kentucky, 42...", "filename": "_1725bb7482b340efbadb64c5b0789856_1588623695.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1725bb7482b340efbadb64c5b0789856_1588623695.html", "title": "Tri-State hoopsters converge on CMHS", "title_page": "Tri-State hoopsters converge on CMHS", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ONA — On a cold, snowy day that postponed or canceled baseball and softball games throughout the Tri-State, youth sports still were played.\nFrom West Virginia, Ohio and Kentucky, 42 basketball teams converged on Cabell Midland High School on Saturday to participate in the North American Youth Sports Tournament.\nThe basketball event featured boys and girls players in fifth through 12th grades and was headed by Cabell Midland girls coach Matt Adkins.\nThe teams brought colorful nicknames such as the WV Rim Rockers, East Kentucky Eliminators, West Virginia Sharp Shooters, WV Xplosion, Southern Ohio Shockers, West Virginia Above the Rim, Kentucky Rage, East Kentucky Cobras, WV Pony Express, WV Dream Ballers, KY Maroon Platoon and others.\nSEND US YOUR YOUTH SPORTS SCHEDULES\nThe Herald-Dispatch would enjoy printing schedules/results and covering stories featuring your youth sports league, team and players on our Youth Sports pages.\nTo submit schedules, email them to tstephens@herald-dispatch.com. Please make sure to identify the name of your league, age group and sport.\nAlso, please include dates, times and location of all games.\nFor more information, contact Tim Stephens at 304-526-2759 or at tstephens@herald-dispatch.com.", "url": "https://apnews.com/1725bb7482b340efbadb64c5b0789856"}