{"authors": ["David R. Sands The Washington Times"], "date_download": "2020-05-04 20:08:33", "date_modify": "2020-05-04 20:08:33", "date_publish": "2018-02-13 14:21:38", "description": "It's Mardi Gras, and we're taking a little mental vacation down to the Big Easy to check out the chess scene. Of course, finding the best chess player to come for New Orleans is about as...", "filename": "_acaaa7ac576376b532bed05853dfbae3_1588622913.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_acaaa7ac576376b532bed05853dfbae3_1588622913.html", "title": "For Mardi Gras, a celebration of Paul Morphy, New Orleans' finest", "title_page": "For Mardi Gras, a celebration of Paul Morphy, New Orleans' finest", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s Mardi Gras, and we’re taking a little mental vacation down to the Big Easy to check out the chess scene.\nOf course, finding the best chess player to come for New Orleans is about as hard as naming the best writer ever from Hannibal, Missouri, or the best folk-rocker from Hibbing, Minnesota. The great 19th century American star Paul Morphy, a proud son of the city, pretty much retired the title after his meteoric rise to international stardom in just a few short years before the Civil War. Morphy and Bobby Fischer are the only two legitimate claimants to the title of greatest American chess player of all time.\nNorthern Virginia master Macon Shibut, in his excellent 1993 book “Paul Morphy and the Evolution of Chess Theory” (updated in 2004 and very much worth looking up), clears away some of the cobwebs from the Morphy legend, in which an unknown from the provinces personally discovers the principles of modern chess (rapid piece development and sound pawn structure, the importance of the initiative, the tactical possibilities of open piece play) and proceeds to flummox and defeat the most celebrated players of his day.\nAs Mr. Shibut notes, players long before Morphy understood perfectly well the need to get one’s pieces out, to control the center, to seize open lines and to avoid pawn weaknesses. Morphy, in Mr. Shibut’s view, combined a deeper appreciation of how to apply those principles at the chessboard (his greatest combinations were never showy but emerged organically from positional advantages) married to steady nerves, magnificent tactical imagination, excellent endgame skills and an underrated competitive streak.\n“At moments of crisis, he was a tougher infighter than any of his rivals,” Mr. Shibut concludes.\nBut Mardi Gras in New Orleans is a giant party, so let’s keep it light. Some of Morphy’s most attractive games came in casual play, often played at a handicap as the Louisiana prodigy soared beyond the abilities of his contemporaries. James Thompson, the London-born founder of the New York Chess Club, was a strong enough player to get an invitation to the famous 1857 1st American Chess Congress, only to get knocked out by Morphy 3-0 in the very first round.\nWithin a few years, as can be seen in today’s game, Morphy could give Thompson the odds of a full piece (remove White’s knight before playing the game) and still manage a brilliant attacking win. Black actually puts up some serious resistance before one last defensive mistake seals his doom.\nIn a Giuoco Piano, Morphy is in no big rush to generate an attack, content to build up a spatial advantage and wait for a target to present itself. After Black gives up the extra piece for a pair of pawns, Morphy rips open the center after 17. Rfe1 Qf7 18. c4 Be7 19. cxb5 Qxd5 20. Rad1! Qxb5 21. a4 Qb7 22. Nxe5! dxe5 23. Rxe5, putting the Black king squarely in the crosshairs.\nWhite ups the ante, going down a full rook to fuel his attack on 24. Qc4 Kf8 (see diagram) 25. Rxe7! Rxe7 26. Bb4, leading to some sharp tactical exchanges: 26 ... Be6! 27. Qc3 c5! 28. Qf6+ (Bxc5? Kf7 and White’s attack withers) Bf7 29. Qxh6+ Kg8 30. Qxg5+, and here Thompson misses his best drawing chance with 30 ... Bg6! 31. Qxg6+ Rg7 and White has to bail out with perpetual check as 32 ... Qxg2 mate is on tap if the White queen steps aside.\nWith 31. Rd3! Bg6 32. Rh3+ Kg7 33. Bc3+, the win is just a matter of time, as Black’s scattered pieces can’t organize a defense against White’s swarming pieces. The finale: 36. Qe6+ Qe7 37. Rh8+ Rf8 38. Qc6+, and Black resigns ahead of 38 ... Kd8 (Kf7 39. Rh7+ Kg8 40. Qg6+) 39. Ba5+ Qc7 40. Qd6+ Ke8 41. Rxf8 mate.\nMorphy-Thompson, Casual odds game (remove White’s queen knight), New York 1859\n1. e4 e5 2. Nf3 Nc6 3. Bc4 d6 4. c3 Nf6 5. Qb3 Qe7 6. O-O a6 7. d4 b6 8. Bd3 h6 9. d5 Nd8 10. Bd2 Nb7 11. Qa3 Nc5 12. Bc2 Nfxe4 13. Bxe4 Nxe4 14. Qa4+ b5 15. Qxe4 f5 16. Qc2 g5 17. Rfe1 Qf7 18. c4 Be7 19. cxb5 Qxd5 20. Rad1 Qxb5 21. a4 Qb7 22. Nxe5 dxe5 23. Rxe5 Rh7 24. Qc4 Kf8 25. Rxe7 Rxe7 26. Bb4 Be6 27. Qc3 c5 28. Qf6+ Bf7 29. Qxh6+ Kg8 30. Qxg5+ Kh7 31. Rd3 Bg6 32. Rh3+ Kg7 33. Bc3+ Kf7 34. Qf6+ Ke8 35. Qxg6+ Rf7 36. Qe6+ Qe7 37. Rh8+ Rf8 38. Qc6+ Black resigns.\nDavid R. Sands can be reached at 202/636-3178 or by email dsands@washingtontimes.com.", "url": "https://apnews.com/acaaa7ac576376b532bed05853dfbae3"}