{"authors": ["Chuck Landon"], "date_download": "2020-05-04 20:19:39", "date_modify": "2020-05-04 20:19:39", "date_publish": "2018-04-19 08:05:54", "description": "Is it basketball season yet? Wishful thinking, perhaps. But it does sort of feel that way with all the basketball news in the air.", "filename": "_bf00cb0884984d72b68a494f2129e141_1588623579.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bf00cb0884984d72b68a494f2129e141_1588623579.html", "title": "Would you like some hoops news? Here it is", "title_page": "Would you like some hoops news? Here it is", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Would you like some hoops news? Here it is\nIs it basketball season yet?\nWishful thinking, perhaps.\nBut it does sort of feel that way with all the basketball news in the air.\nIt started last week when Pittsburgh Sports Now revealed Marshall would play Duquesne in A.J. Palumbo Center at Pittsburgh during the 2018-19 season. No date has been established.\nWhat wasn’t revealed, however, is actually Marshall and Duquesne are putting together a four-year contract that could pair the two through the 2021-22 season.\nThe Dukes are 3-1 all-time against Marshall, but the two haven’t played since 1978. The four-year pact makes sense because Duquesne is led by second-year coach Keith Dambrot, who regularly played the Herd when he was Akron’s head coach.\nAn added perk is former Huntington High School star guard Tavian Dunn-Martin will be playing next season, after transferring from Akron and sitting out last year.\nBesides Duquesne, look for Marshall to play three “money” games in 2018-19. The prospective “buy” games could feature road contests at Maryland, Texas A&M, Mississippi State and, perhaps, even Gonzaga.\nKind of gets those basketball juices flowing, huh?\nATTRITION: Sometimes it is a bad thing.\nSometimes not.\nSo far, I’d say the Herd falls into the “not” category.\nForwards Dani Koljanin, 6-foot-6 junior, and Phil Bledsoe, 6-6 sophomore, have left Marshall’s program.\nKoljanin, who had been a junior college transfer, appeared in 21 games, averaging 12.1 minutes, 2.4 points and 1.7 rebounds. Bledsoe, a product of Wheeling (W.Va.) Park High School, appeared in 19 games with averages of 8.4 minutes, 3.1 points and 1.7 rebounds.\nBut considering the late-season surges shown by red shirt freshman Jannson Williams and true freshman Darius George, very few minutes appeared to be available for Koljanin or Bledsoe next season.\nIt would come as no surprise if a third scholarship player also chose to leave Marshall’s basketball program. And no one is to blame. Not everyone develops like the coaching staff hoped he would.\nBy the same token, there is no percentage in sitting on the bench game after game and never getting to play. A competitive athlete wants to be a player, not a spectator.\nThe hope is Koljanin and Bledsoe transfer to schools where they can play. They deserve that much.\nNEW RECRUIT: Marshall signed Taevion Kinsey, 6-4, 155-pound point guard, from Eastmoor Academy in Columbus on Wednesday. And, yes, obviously he is skinny. The good news, however, is his vertical leap measures much larger than his waist.\nDespite being blade-thin, Kinsey has won numerous slam dunk contests.\n“One of my best skills is probably playing above the rim,” Kinsey told Ohio Prep Hoops. “Like I jump very high. Playing above the rim, attacking the bucket. Probably one of my strengths, I play long and use my length. Any time I have a littler person on me, I like to shoot it over them.”\nKinsey led Eastmoor to a 20-6 record, averaging 19.3 points. He also has a 3.1 GPA and is fully qualified academically.\nThe best part?\nAs explosive as Kinsey is to the rim, he realizes he needs to improve his jump shot.\n“Every coach that I’ve been talking to that’s been recruiting says I need to get better at shooting the ball,” said Kinsey. “And I’ve been working on it in the gym, putting in the extra hours.”\nWhat’s not to like?\nChuck Landon is a sports columnist for The Thundering Herd. Contact him at clandon@herald-dispatch.com.", "url": "https://apnews.com/bf00cb0884984d72b68a494f2129e141"}