{"authors": ["Tom Howell Jr. The Washington Times"], "date_download": "2020-05-04 20:26:10", "date_modify": "2020-05-04 20:26:10", "date_publish": "2018-08-24 12:01:00", "description": "Senate Republicans skittish about a lawsuit that could gut Obamacare's protections for sicker Americans are pushing legislation that would enshrine those protections under a health care privacy...", "filename": "_8fac07ec03f83cc24945305cd3fbac69_1588623970.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8fac07ec03f83cc24945305cd3fbac69_1588623970.html", "title": "Senate GOP files bill to shield Americans with pre-existing conditions", "title_page": "Senate GOP files bill to shield Americans with pre-existing conditions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Senate Republicans skittish about a lawsuit that could gut Obamacare’s protections for sicker Americans are pushing legislation that would enshrine those protections under a health care privacy law signed by President Bill Clinton in the 1990s.\nThe bill from Senate Health Committee Chairman Lamar Alexander and nine others is a way to shield the GOP from mid-term attacks emanating from the pending suit, which says Congress’ decision to zero out Obamacare’s penalty for shirking insurance means the rest of the law must fall.\n“This legislation is a common-sense solution that guarantees Americans with preexisting conditions will have health care coverage, regardless of how our judicial system rules on the future of Obamacare,” said Sen. Thom Tillis, North Carolina Republican.\nUnder the bill, parts of Obamacare that require insurers to cover people with preexisting medical conditions and charge them the same as healthy people would be enshrined in the Health Insurance Portability and Accountability Act, or HIPAA.\nThe protections are wildly popular, but Democrats say the GOP has been unable to prove its serious about preserving them and should pay a price at the ballot box.\nRepublican plans to replace Obamacare, which fell apart last year, fiddled with the protections, and the Trump administration is refusing to fight the lawsuit that threatens them.\nTwenty GOP-led sates filed the suit, which points out the Supreme Court relied on Congress’ taxing authority to uphold the Obamacare’s “individual mandate” as constitutional.\nSince the GOP eliminated the mandate’s penalty as of 2019, they say Congress is no longer using that authority, so parts of the law requiring insurers to accept sicker Americans and ignore their health status in setting premiums are invalid, too.\nA federal judge in Texas has scheduled oral arguments in the case for Sept. 5.\nObamacare supporters say the lawsuit is laughable, since Congress explicitly moved to zero out the mandate penalty while leaving consumer protections alone.\nYet Senate Democrats facing tough re-elections bids in states President Trump won see it as a winning issue.\nSen. Joe Manchin III, West Virginia Democrat, tried to force a Senate vote on his resolution to let the Senate’s legal counsel intervene in the suit, but he was turned back by GOP leaders who didn’t want their members to take a tough vote.\nMr. Manchin is taking particularly interest because his opponent, West Virginia Attorney General Patrick Morrisey, is a plaintiff in the lawsuit.\nSen. Claire McCaskill, Missouri Democrat, is also highlighting it because her Republican challenger, Missouri Attorney General Josh Hawley, also signed on.\nGOP leaders haven’t signaled how they’d proceed, if the lawsuit is successful, though Republicans in general have noted they still have legislative alternatives to Obamacare kicking around.\nWith their bill, Mr. Alexander and his centrist cosponsors are trying to head off claims they’re coldhearted and pressuring Democrats to choose between their Obamacare-only approach and an alternative.\n“Support for the legislation will separate those who really want to protect people with pre-existing conditions and those who would rather have a political talking point to scare Americans who are already worried enough,” said Sen. Charles Grassley, Iowa Republican and cosponsor. “I hope the former is more important.”\nOther cosponsors include Sens. Dean Heller of Nevada, who faces a tough re-election bid, Joni Ernst of Iowa, John Barrasso of Wyoming, Lindsey Graham of South Carolina, Roger Wicker of Mississippi, Bill Cassidy of Louisiana and Lisa Murkowski of Alaska.", "url": "https://apnews.com/8fac07ec03f83cc24945305cd3fbac69"}