{"authors": ["Jessica Bruha Jbruha Oaoa.Com"], "date_download": "2020-05-04 20:13:27", "date_modify": "2020-05-04 20:13:27", "date_publish": "2018-03-10 02:45:00", "description": "A letter sent out to about 10,000 Medical Center Health System patients left some Odessans confused about whether or not they owed money on an old medical bill. Odessan Carolyn Johnson said...", "filename": "_0c238fe0a4b245d28ea4ed3dbbdaab6d_1588623207.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0c238fe0a4b245d28ea4ed3dbbdaab6d_1588623207.html", "title": "MCHS billing letter causes confusion", "title_page": "MCHS billing letter causes confusion", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A letter sent out to about 10,000 Medical Center Health System patients left some Odessans confused about whether or not they owed money on an old medical bill.\nOdessan Carolyn Johnson said when she got the letter, the last time she could remember being at the hospital was for a dislocated knee about seven years ago and she had two forms of insurance so she didn’t understand why she would owe any money.\nJohnson said she never received a call during those seven years that she even needed to make a payment, which left her even more stumped.\n“I tried to get a hold of them for like a week,” Johnson said. “You could not get through.”\nJohnson was eventually able to leave a message after a message system was set up informing her that due to the heavy call volume, someone would get back to her within three business days.\nJohnson, like many others who called the customer service number provided in the letter, or showed up at the business office at 425 N. Sam Houston, later found out it was just a mistake.\n“The lady called me back and said there was a glitch and instead of sending letters to people who actually owed money, it sent letters to everyone,” Johnson said. “I guess that stirred up quite a hornet’s nest.”\nShe said the hospital’s phone lines were “burning down” and she couldn’t image what the hospital must have paid in postage. But, she said customer service was very apologetic and helpful when they returned her call.\n“I’d hate to be answering the phones at the hospital though.”\nMCHS Chief Financial Officer Robert Abernethy said an early February mailing was sent offering patients with active accounts in the old McKesson system the opportunity to pay off their account in full and receive a 50 percent discount.\nThe hospital has offered 50 percent discounts in prior years during tax season to help get some of the older accounts that people have been paying on for a year or two, or more, off their books and help give people some relief, Abernethy said.\n“Unfortunately, there was a report writing error and the letter was sent to patients with fully-paid accounts and to patients with credit balances,” he said.\nIt was unknown how many people received the letter who did not owe money on an account, he said.\n“There should have been a checks and balances we should have had, but didn’t,” Abernethy said, chalking the mistake up to human error. “I think the silver lining was that it helped us more readily identify and more timely refund credit-balance accounts.”\n“Even though we had an error, there was one of those silver linings that you always look at.”\nAbernethy said there was some increased traffic in the business office and customer service was inundated with calls, but he thought they handled it well.\n“We’ve got a couple of open positions in customer service … so we apologize for the delay on getting back to folks,” he said, adding that the influx of calls and visits seems to be leveling off now.\nFor anyone who receive a letter and knows their account has been paid, Abernethy said they can just disregard the letter. If anyone has questions, they are encouraged to call customer service at 432-640-1000.", "url": "https://apnews.com/0c238fe0a4b245d28ea4ed3dbbdaab6d"}