{"authors": ["Madeline St. Amour Staff Writer"], "date_download": "2020-05-04 20:25:50", "date_modify": "2020-05-04 20:25:50", "date_publish": "2018-10-26 23:59:35", "description": "A Weld County District Court judge has set a deadline for the coroner to file a hearing notice in his request to seal the autopsy reports for Shanann Watts and her children. If a hearing...", "filename": "_812131d3986540fc96553e227a0749a5_1588623950.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_812131d3986540fc96553e227a0749a5_1588623950.html", "title": "Judge Asks for Filing for Hearing in Watts Autopsies Case, or Request Will Be Denied", "title_page": "Judge Asks for Filing for Hearing in Watts Autopsies Case, or Request Will Be Denied", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Judge Asks for Filing for Hearing in Watts Autopsies Case, or Request Will Be Denied\nA Weld County District Court judge has set a deadline for the coroner to file a hearing notice in his request to seal the autopsy reports for Shanann Watts and her children.\nIf a hearing notice isn’t filed by Nov. 2, Judge Todd Taylor said he would deem the request “abandoned” and subsequently deny it, according to a court order filed Friday.\nTaylor also has approved requests to intervene in the hearing from both Weld County District Attorney Michael Rourke and Watts’ defense attorneys.\nThe corner’s office filed a status report in response on Friday, saying it has found available dates and times for the court and will confer with the necessary parties to set a hearing.\nThe Weld County Coroner on Oct. 15 filed a petition to seal the autopsies of 34-year-old Shanann Watts, and her two children, 4-year-old Bella and 3-year-old Celeste, citing Rourke’s arguments that they could taint potential jurors or witnesses who have not yet been interviewed.\nChris Watts, 33, is accused of killing his wife, who was 15 weeks pregnant, and two daughters. He is charged with five counts of first-degree murder, one count of first-degree unlawful termination of pregnancy and three counts of tampering with a deceased human body.\nAround 35 parties filed Colorado Open Records Act requests for the autopsies. A number of those requests are from media organizations, including the Longmont Times-Call, which are being represented by Steven Zansberg of Ballard, Spahr, LLP in Denver.\nMadeline St. Amour: 303-684-5212, mstamour@prairiemountainmedia.com", "url": "https://apnews.com/812131d3986540fc96553e227a0749a5"}