{"authors": ["Joe Allen", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 20:00:06", "date_modify": "2020-05-04 20:00:06", "date_publish": "2018-05-16 00:00:00", "description": null, "filename": "2018_05_ups-teamsters-contract-hoffa-strike_1588622406.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/05/16123236/ups.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_05_ups-teamsters-contract-hoffa-strike_1588622406.html", "title": "Striking Big Brown", "title_page": "Striking Big Brown", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nWill the historic strike wave that began with teachers in February hit the United Parcel Service (UPS) this summer? UPS is today the largest private-sector unionized employer in the United States with nearly 280,000 Teamsters. That includes its package division — which employs nearly 260,000 workers and sports UPS’s famous chocolate brown delivery trucks — and its smaller freight division. National contracts for both divisions expire on July 31, and the Teamsters are negotiating the two simultaneously. On May 2, they called a national strike authorization vote. On Tuesday, materials for the vote reached rank-and-file members’ doors. The vote comes in the midst of negotiations which will not only impact UPS workers and their families, but also the union’s ability to organize the burgeoning nonunion logistics industry in the future.\n“Unusual Circumstances” Only recently has the media taken a breather from its obsession with Amazon’s search for a second headquarters (HQ2) to pay some attention to the UPS negotiations. This was prompted by Teamster leaders’ announcement of the strike vote. Teamster general president James P. Hoffa and Teamsters’ chief negotiator Denis Taylor informed members of the strike vote in a letter, saying, Nobody wants a strike. It hurts the company and it hurts members. However, the ability to strike is necessary in order to ensure a timely and positive conclusion to negotiations. We have to show that we’re not afraid of striking. As some local leaders pointed out, this wasn’t exactly a rousing call to action. Matt Taibi, the secretary treasurer of Rhode Island’s Local 251 complained that this note failed to provide “a message or set of issues that members should mobilize around.” As he explained, Members know how they get treated by the company on a day to day basis, so a Yes strike vote to send a message should come as a natural reaction. But the union needs to set out a clear message to inspire a real fightback. Members need to make it clear they will not accept concessions and we need to unite to include the entire membership at UPS. Fighting for $15 for part-timers and against two-tier drivers is a big part of that fight. UPS, for its part, dismissed the strike vote as “an expected action taken by most unions during contract negotiation.” Yet Hoffa and then-chief negotiator Ken Hall didn’t call for one during the last round of national and local negotiations in 2013. This was a clear signal to the company that there was little threat of a strike and that Hoffa and Hall would press hard for membership ratification of the proposed 2013 contract settlement. Much to Hoffa and Hall’s surprise, there was widespread opposition to that contract. It passed with only a bare majority vote, and eighteen local contract supplements were voted down, many of them twice, and some of them three times. The resistance was driven by Fred Zuckerman, president of Louisville’s Teamster Local 89, along with the Teamsters for a Democratic Union, who teamed up to capture members’ latent frustration and channel it into a “Vote No” movement. Eventually, a frustrated Hoffa unilaterally imposed the supplements on an unhappy membership, thus allowing the national contract to be implemented. This was a major contributing factor to Hoffa’s near-defeat in the 2016 Teamsters election to a reform slate led by Zuckerman, in coalition with Teamsters for a Democratic Union. That near-defeat is likely why Hoffa called a strike vote this time around. But the circumstances of the vote are highly unusual. As TDU argues, “Normally, a strike vote is called as a strategic move to build the union’s bargaining leverage. But Package Division Director Denis Taylor has not even been using the leverage he already has.” That is a reference to the big concessions Taylor has already made in bargaining. On issues of new technology, harassment, and excessive overtime, Taylor has either given up; agreed to weak, meaningless language; or proposed givebacks himself. For instance, Taylor proposed contract language that will create a new, inferior category of package delivery jobs at UPS. These so-called “Hybrid Drivers” would deliver ground packages — still the core of UPS’s business operation — part time and at a lower pay scale. It has been UPS’s goal for years to break up the full-time ground package delivery jobs. There are currently sixty thousand UPS full-time package car drivers in the United States, and they are among the shrinking number of driving jobs in the United States where you can still make a decent living supporting a working-class family. Teamsters United called the hybrids “the worst giveback in UPS history.” In the aftermath, Denis Taylor removed three members of the UPS national negotiating committee: Avral Thompson, John Bolton and Matt Taibi. All three are opposed to the “hydrid-driver” proposal. Taibi and Thompson ran against Hoffa on the Teamsters United slate in 2016, with Thompson elected to the union’s general executive board as one of six regional vice-presidents. As Local 25 president Sean O’Brien told the Wall Street Journal, “It’s unfortunate that these negotiations are some of the most important and it seems like this leadership is focused on [internal] adversaries.” O’Brien was himself fired by Hoffa as chief negotiator for UPS at the beginning of this year. He was a longstanding Hoffa ally who delivered a sizeable vote for the Hoffa slate in 2016. He was fired for reaching out to opposition leader Fred Zuckerman, who won 70 percent of the UPS vote in the 2016 Teamster election. O’Brien has subsequently found himself in opposition to Hoffa on a number of important issues. But Taylor and Hoffa have also proven to be sensitive to public exposure of their dirty dealings in negotiations. According to the Freightwaves website, an anonymously quoted Teamsters spokeswoman contacted them and emphasized that the two sides “had not come to any agreement about hybrid drivers.”\nThrashing Around If Taylor and Hoffa’s actions seem confusing, contradictory, and self-defeating, it’s because they are. The Teamster leadership is thrashing around responding to multiple and contradictory pressures, including mounting dissatisfaction in the membership, frustration among officers of the union, and pressure from UPS for more concessions. The future of the Teamsters is on the line here in a logistics industry that’s been transformed by the rise of Amazon. For decades, the package delivery industry was dominated by the Big Three: UPS, FedEx, and the US Post Office. Amazon has disrupted all of that and is now one of the largest nonunion employers in the country, with a vast network of warehouses (“fulfillment centers”) and delivery drivers. It took UPS ninety years for it to employ as many people as Amazon has put on its payroll in the last five years. It employs over 566,000 people worldwide, a big jump from 341,000 at the end of 2016. More people work at Amazon, for example, than live in “Albuquerque, New Mexico, (559,000) or Tucson, Arizona, (530,000) and by next quarter will likely pass Milwaukee, Wisconsin (595,000).” The quick rise of a nonunion employer in a previously union-dominated industry is reminiscent of the deregulation of the trucking industry in the early 1980s, when the Teamsters were decimated in what had previously been their stronghold. The Teamsters are in a precarious position. A bad contract will only make things worse. In the forefront of the Teamsters leaders’ minds should be not only vast improvements in wages, benefits, and working conditions at the fabulously profitable UPS, but also using this as the opportunity to forge a model contract for organizing Amazon and FedEx. Yet such a strategy seems farthest from their minds. Instead, the union is doing the dirty work for the company. UPS was one of the pioneers of part-time work and two-tier wage structures. Starting wages at UPS have gotten so low that in many parts of the United States starting wages at Amazon are actually higher. All this does is undermine the very idea of a union — workers shouldn’t compete with one another in a race to the bottom but unite to raise working conditions across the logistics industry. It has been an open secret for years that UPS wants to change the composition of their delivery work force by eliminating the highly praised but demanding full-time package car jobs. It desperately wants to create a more precarious Uber-like package workforce, delivering packages with golf carts or via part-time workers’ personal vehicles. So far, the Teamsters have resisted going that far. Still, Taylor’s proposal for hybrid drivers should be seen for what it is — acting at the behest of UPS. It alone justifies a national “Vote No” campaign. Taylor and Hoffa, however, are likely to try sell it as a “solution” to the crushing overtime suffered by the beleaguered package delivery workforce.", "url": "https://www.jacobinmag.com/2018/05/ups-teamsters-contract-hoffa-strike"}