{"authors": ["Paul Stephen"], "date_download": "2020-05-04 20:26:12", "date_modify": "2020-05-04 20:26:12", "date_publish": "2018-12-13 17:43:56", "description": "Move over Nashville, there’s a new bird in town. Restaurateur Jason Dady has unleashed San Antonio Hot Chicken with a new menu at his longstanding East Grayson Street restaurant Shuck...", "filename": "_ec9ff592794f489e85c04dca388e2188_1588623972.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ec9ff592794f489e85c04dca388e2188_1588623972.html", "title": "Dady debuts San Antonio Hot Chicken at Shuck Shack", "title_page": "Dady debuts San Antonio Hot Chicken at Shuck Shack", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Move over Nashville, there’s a new bird in town. Restaurateur Jason Dady has unleashed San Antonio Hot Chicken with a new menu at his longstanding East Grayson Street restaurant Shuck Shack.\nSo what exactly is San Antonio Hot Chicken?\n“We worked really hard taking inspiration from Nashville hot chicken, but I wanted to do something that more signals the flavor of San Antonio,” Dady said. “It’s got great flavor and amazing spice. It’s heavier on the cumin, dried jalapeño and chipotle. I’m pretty stoked about this.”\nWhile Nashville-style hot chicken has undoubtedly taken America by storm — KFC added a version to their menu last year — the dish of crispy yardbird doused in a fiery paste of cayenne pepper is still a rare find in the Alamo City. It occasionally makes an appearance at pop-up events, and is one of several chicken options on the menus at Cullum’s Attagirl and The Rustic, but it is far from widespread.\nThe new Shuck Shack menu still features the restaurant’s most popular seafood dishes including a lobster roll, fried catfish and fresh oysters, but others have fallen off to make room for the San Antonio Hot Chicken. That side of the menu boasts chicken from whole to legs doused in his newly developed spice blend, a hot chicken sandwich and hot chicken nuggets served with a side of enchilada gravy for dipping.\nThe chicken dishes also offer a considerably more affordable price point: a lobster roll at Shuck Shack rings up at $22, while a half chicken with a side dish costs $13.\nFor Dady, hot chicken is just the latest vehicle driving his ongoing ability to reinvent as a restaurateur. He swapped tapas for brisket by transforming his other East Grayson property The Bin Tapas Bar into Alamo BBQ Co. earlier this year, a move he said has proven successful.\nThe new menu at Shuck Shack is a continued effort to enliven the dining scene on a Pearl-adjacent stretch of pavement Dady hopes to see grow.\n“We always try to stay at the forefront of what people want,” Dady said. “I’m very comfortable making adjustments and adapting.”\nPaul Stephen is a staff writer in the San Antonio and Bexar County area. Read him on our free site, mySA.com, and on our subscriber site, ExpressNews.com. | pstephen@express-news.net | Twitter: @pjbites | Instagram: @pjstephen", "url": "https://apnews.com/ec9ff592794f489e85c04dca388e2188"}