{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:16:32", "date_modify": "2020-05-04 20:16:32", "date_publish": "2018-03-09 05:01:01", "description": "Teays Physical Therapy Center, Inc. & the Putnam Herald are pleased to present this week's male Gamer of the Week to sophomore Austin Dearing of Hurricane High School. The Redskin's boy's...", "filename": "_720f02b2a8594eb98b89a1ef0b99f01d_1588623392.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_720f02b2a8594eb98b89a1ef0b99f01d_1588623392.html", "title": "Hurricane's Austin Dearing is Gamer of the Week", "title_page": "Hurricane's Austin Dearing is Gamer of the Week", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Teays Physical Therapy Center, Inc. & the Putnam Herald are pleased to present this week’s male Gamer of the Week to sophomore Austin Dearing of Hurricane High School.\nThe Redskin’s boy’s basketball team played two very important games last week that helped move them toward the final steps before the state tournament. The Redskins were able to handle AAA foe Spring Valley 62-50 in the Region 4 Section 2, but dropped their second contest to powerhouse Huntington High 63-57 in the sectional final.\nOne standout player for the Redskins was sophomore point guard Austin Dearing. The physical and cerebral point guard scored 19 points in the win over Spring Valley and 16 points in the loss to Huntington. On the year, Dearing is averaging over 13 points per game in his first year starting for the Redskins.\nWhen Austin was asked what motivates him he responded, ″Proving that just because I come from a small town doesn’t mean I can’t make it at a big-time school. One of my close family friends, Trey Dawson, earned a scholarship to LSU and proved that it doesn’t matter where you come from. I use that motivation toward sports because I want to follow in the footsteps he has laid for others like me.″\nWhen Austin was asked from where he draws his inspiration he replied, ″my parents and training with Matt Downey have helped me along the way. Downey has worked really hard with me to get my body able to physically compete on the varsity level.″\nHurricane has tried to throw teams off of rhythm by switching up their defenses, all the while being highly productive on the offensive end. Hurricane has had the ability to get offensive production from a number of players, but sometimes it seems that Hurricane has not been able to catch breaks they needed to come out on top. The Redskins have competed very well against some of the better AAA teams in the state, but came up just a couple plays away from coming out on top. The Redskin’s ended their season with a final record of 11-13 with their latest loss in the Region 4 AAA regional final versus Parkersburg South 67-58.\nLooking back at they way the season panned out for Hurricane, it’s hard to say that the Redskins are not better than what their final record shows. Sometimes the truth is in the statistics and sometimes it’s not. Normally fans like to watch high scoring or teams that play physical defense, but every team has its flaws.\nThis year, Hurricane’s main flaw may have been what they didn’t do well, which was finish the little things. Things like boxing out, limiting self-turnovers, making free throws, and limiting the opposing teams’ offensive rebounds many have been the Achilles heel. At the conclusion of the season, the Redskins will have to replace some solid senior leadership and look forward to the future. Hurricane will look for growth over the offseason and they plan to further strengthen their continuity. Head Coach Lance Sutherland will have to further stress how important the little things, such as rebounding and defensive deflections, can win or lose ball games. Coach Sutherland will most certainly continue his fun style of basketball and bring more excitement to the hardwood next year.\nAustin currently has a 3.8 GPA and is the son of Rob and Deb Dearing. He also plays on the baseball team and is a member of DECA. He would like to continue playing sports in college and plans to study business or finance.\nPlease look for other local high school athletes to be named in next week’s Male Gamer of the Week Sponsored by Teays Physical Therapy Center, Inc. & The Putnam Herald.\nMarcus Reynolds PT, DPT, CSCS is a Doctor of Physical Therapy at the Teays Physical Therapy Center and assists with the Potential Plus Program.", "url": "https://apnews.com/720f02b2a8594eb98b89a1ef0b99f01d"}