{"authors": ["James Halpin"], "date_download": "2020-05-04 20:11:08", "date_modify": "2020-05-04 20:11:08", "date_publish": "2018-04-05 00:00:00", "description": "WILKES-BARRE — A registered nurse whose patient died under her care waived her right to a preliminary hearing Wednesday, allowing a felony count of neglect of care to move forward to county court....", "filename": "_1a457d85371b4ffdb31f3b0132b44e60_1588623068.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1a457d85371b4ffdb31f3b0132b44e60_1588623068.html", "title": "Nurse To Stand Trial Over Patient Death", "title_page": "Nurse To Stand Trial Over Patient Death", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WILKES-BARRE — A registered nurse whose patient died under her care waived her right to a preliminary hearing Wednesday, allowing a felony count of neglect of care to move forward to county court. Kelly E. Levandowski, 39, of Nanticoke, is accused of “intentionally, knowingly or negligently” failing to provide sufficient care to Melvin Johnson, 72, who died after going into cardiac arrest at the Guardian Healthcare and Rehabilitation Center at 147 Old Newport St., on June 20, 2013. As she left central court Wednesday morning, Levandowski declined to comment. Waiving the charge forward will allow the defense to get discovery in the case and determine how to proceed, defense attorney John Pike said. In a prepared statement, Attorney General Josh Shapiro said his office intends to “hold this nurse accountable” for failing to follow life-saving protocols. “This defendant could have saved a woman’s life by simply following the protocols of her employer,” Shapiro said. “Instead, she neglected a patient entrusted to her care, ultimately leading to the patient’s death.” According to charges the state Attorney General’s Office filed against Levandowski, the criminal investigation began after the state Department of Health cited Guardian in 2013 for failing to provide adequate monitoring over the incident. The charges say Johnson had suffered from a ruptured aneurism and subsequent bleeding of the brain prior to being admitted at Guardian on the day of her death. She had been on a ventilator, but was weened off of it prior to admission, according to the charges. According to prosecutors, at least four staff members told Levandowski, a shift supervisor, that they were concerned about Johnson pulling on a breathing tube. Levandowski, however, stayed seated at the nursing station, according to the charges. Shortly after 7 p.m., Johnson pulled the tube out and Levandowski reinserted it herself, but did not call 911 as required by facility policy, the complaint says. Levandowski also wrote in her notes that 15-minute checks were to continue, although prosecutors say there is no evidence that they had started previously. About a half-hour later, another nurse discovered that Johnson had again removed the tube and was unresponsive, prosecutors said. Levandowski claimed to have performed CPR until medics arrived on scene, but no other staff members were able to vouch for her life-saving efforts, according to prosecutors. In fact, one nurse aide told investigators that after Johnson died, Levandowski directed her to fill out a form indicating 15-minute checks had been performed on Johnson since 3 p.m., even though they hadn’t been conducted. Levandowski has been free on $25,000 unsecured bail since her arrest in January. She is due back in court for a dispositional hearing on May 24. Pennsylvania Department of State records show Levandowski remains a registered nurse with a license that expires Oct. 31. Online records show no disciplinary actions against her. Contact the writer: jhalpin@citizensvoice.com 570-821-2058", "url": "https://apnews.com/1a457d85371b4ffdb31f3b0132b44e60"}