{"authors": ["Daily News Staff"], "date_download": "2020-05-04 20:09:47", "date_modify": "2020-05-04 20:09:47", "date_publish": "2018-01-05 05:34:00", "description": "BULLHEAD CITY — Last week was all about a big striper. This week, it’s the trout that are front and center. “With our weather co-operating, some anglers are able to get in on the rainbow...", "filename": "_122479852c0f4b06b08c8ab47bf91e2a_1588622987.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_122479852c0f4b06b08c8ab47bf91e2a_1588622987.html", "title": "Trout stocking location will change soon", "title_page": "Trout stocking location will change soon", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BULLHEAD CITY — Last week was all about a big striper. This week, it’s the trout that are front and center.\n“With our weather co-operating, some anglers are able to get in on the rainbow trout fishing,” said Rusty Braun, proprietor of Rusty’s Riviera Marina and provider of area fishing reports for the Mohave Valley Daily News, and Arizona Game and Fish.\n“Our local angler Jerry Ward is showing off a recent limit of trout,” Braun said. “The larger one’s at 163/8 inches and weighed in at 1.56 pounds, and a 141/2 inch trout was 1.2 pounds.”\nWard landed his trout from the shoreline “and the Berkley mice tails proved to work the best for this limit of five trouth,” Braun added.\nWard’s trout were a little bigger than normal, but not by much.\n“The rainbows that have been arriving at Rotary Park have been at least in the 12-inch range,” Braun said. “The Willow Beach hatchery has been supplying us with some great fish.\n“The stocking at Rotary Park will be changed to Community Park for a couple of months,” as the endangered razorback suckerfish is in spawning season. Trout may eat the suckerfish larvae, according to federal wildlife officials, prompting the shift in stocking locations.\nStocking will resume at Rotary Park after suckerfish are out of their spawning period, Braun reported.\n“I am working on getting the dates and will post them as soon as they are available,” he said.\nIn the meantime, Braun said he’s heard rumors that the striper bite is picking up on Lake Mohave.\nIf you’ve pulled in a striper from Lake Mohave, or a fish from anywhere else, contact Braun by visiting Riviera Marina, 520 Riviera Blvd. in Bullhead City, or give him a call at 928-763-8550.", "url": "https://apnews.com/122479852c0f4b06b08c8ab47bf91e2a"}