{"authors": ["Casey Kuhn Kjzz Via Cronkite News"], "date_download": "2020-05-04 20:07:59", "date_modify": "2020-05-04 20:07:59", "date_publish": "2018-10-19 07:03:00", "description": "FLAGSTAFF — On public land south of Mountainaire, Arizona, nature lovers can enjoy a vista of thousands of lush ponderosa pines blanketing the base of the San Francisco Peaks. The dense...", "filename": "_d50ccb25ea664e20979c2b285f21f5ee_1588622879.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d50ccb25ea664e20979c2b285f21f5ee_1588622879.html", "title": "Effort to thin ponderosa forests inches forward", "title_page": "Effort to thin ponderosa forests inches forward", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FLAGSTAFF — On public land south of Mountainaire, Arizona, nature lovers can enjoy a vista of thousands of lush ponderosa pines blanketing the base of the San Francisco Peaks.\nThe dense forest is beautiful — and unnatural. It was sparse until humans changed the landscape in the late 19th century.\nAnd now, humans are trying to change it again. One way is through the Four Forest Restoration Initiative (4FRI), a partnership that includes the U.S. Forest Service, Arizona Game and Fish Department and the Grand Canyon Trust. The goal is to restore 2.4 million acres of pine stretching across northern Arizona from the Grand Canyon to the New Mexico line, but progress has been slow and costly.\nThe program, which is being managed by a wealth of agencies, involves the Coconino, Tonto, Apache-Sitgreaves and Kaibab national forests.\n“What we want to try and do is restore the structure, pattern and composition of the forest to restore the function of the forest,” said Dick Fleishman, 4FRI’s operations coordinator, who was part of a recent tour of a section of the Coconino National Forest near Mountainaire.\nThat function includes fire, which, if a forest is thinned of excess trees, will burn low and slow through the underbrush. Older ponderosa pines have evolved to survive that kind of fire, not the hot and fast flames that come with something like the immense Wallow and Rodeo-Chediski fires — the largest in state history.\n4FRI also is designed to provide for wildlife and plant diversity.\nThe restoration effort aims first for areas around Mountainaire and other communities within the forests.\n“A fire can come through but does not set the entire stand of trees on fire and doesn’t threaten homes because there’s a barrier there where the forest is more open and fire can burn on the ground, lower to the ground in some of the smaller trees in a non-threatening way,” said Travis Bruner, interim conservation director at the Grand Canyon Trust.\nIf a wildfire ripped through an overcrowded forest near communities, it could throw embers onto the land and be very destructive.\nFleishman said the major wildfires create hundreds of millions of dollars of damage and years of consequences.\nFlood after fire\n“It’s the post-fire flooding, which can happen for several years afterward; it’s not just one-and-done,” Fleishman said. “The fire is one-and-done, but the post-fire flooding is a couple years’ worth of flood.”\nThat’s because the embers bake the soil and leave a hard surface for monsoon rains to wash off. That runoff ends up in the chain of reservoirs that supplies about 60 percent of metro Phoenix’s water.\n“You have this vast amount of water that has all this energy and it just rushes across the landscape and it basically peels the soil and everything attached to it,” said Charlie Ester, surface water manager for Salt River Project.\nThat nasty runoff after a large wildfire up north ultimately will affect cities downstream that have to treat this contaminated water for years.\n“Not to mention all the ash that’s left over and other harmful chemicals as a result of the combustion of the trees,” Ester said. “It really can result in poor water quality of our entire reservoir system.”\nThe watershed’s natural cycle has changed thanks to human logging and ranching starting in the late 1800s.\nSo far, the U.S. Forest Service has restored 186,000 acres of forest. But the 4FRI effort to thin those forests to their natural condition has been a bumpy road.\nSteve Rosenstock, Arizona Game and Fish Department’s statewide coordinator for habitat enhancement, said Flagstaff passed a $10 million bond to help fund the effort.\n“That’s a very, very unique thing,” he said. “In these times when budgets are tight, having that other source of funding can make the difference between a project happening or not.”\nThe problem is that the Forest Service doesn’t have the resources to complete the giant task alone and in a timely manner, but attempts to enlist the timber industry’s help haven’t been easy.\nThere aren’t many economically viable ways to use the young trees, and there aren’t any lumber mills in Flagstaff.\nThe partnership still is working to entice more businesses to help manage parts of the public land.\nSustaining environment\nRosenstock said the value of a thinned forest is in its sustainability.\n“Mother Nature ultimately has the control over things, she holds the big levers,” he said. “But we’re doing all we can, particularly in these kind of restoration efforts to get these systems back into balance, so they’ll be more capable of weathering those droughts when they do occur.”\nAfter the driest winter on record, and a normal monsoon season, the 2018 wildfire season was mild.\nBut if more dry winters come as predicted, Arizona’s ponderosa pine forests could be a tinderbox waiting for an errant spark.\nThis story is part of Elemental: Covering Sustainability, a multimedia collaboration between Cronkite News, Arizona PBS, KJZZ, KPCC, Rocky Mountain PBS and PBS SoCal.", "url": "https://apnews.com/d50ccb25ea664e20979c2b285f21f5ee"}