{"authors": ["Ben Tarnoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paolo Gerbaudo", "Ralph Miliband", "Marcel Liebman", "Elizabeth Humphrys"], "date_download": "2020-05-04 19:55:07", "date_modify": "2020-05-04 19:55:07", "date_publish": "2018-12-21 00:00:00", "description": null, "filename": "2018_12_nicos-poulantzas-socialism-from-below-democratic-power_1588622107.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/12/21135715/GettyImages-941947916.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_12_nicos-poulantzas-socialism-from-below-democratic-power_1588622107.html", "title": "Building Socialism From Below", "title_page": "Building Socialism From Below", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Capitalism keeps creating socialists, despite its best efforts. When people are dominated, they tend to resist: they build networks of mutual aid and find power in collective action. They begin to imagine a world organized along different lines, one where the wealth they make in common is held in common rather than hoarded by the few. This is why you can’t kill socialism: because it’s not just a set of ideas about how to interpret and change the world but a tendency produced by the very system it seeks to replace. When Marx and Engels called communism a specter, they captured this undead quality. Socialism is the ghost in the machine, haunting capital wherever its circuits appear. If socialism can’t be killed, however, it can be suppressed. And few countries had suppressed it more successfully than the US at the turn of the twenty-first century. American socialism, never as strong as its counterparts in other parts of the world, had become nearly invisible by the end of the 1990s. Its traditional sources of strength — the labor movement and the black liberation struggle, to name the two most important — had been eroded by economic restructuring and state repression. The collapse of Communist regimes abroad inspired a tone of capitalist triumphalism at home. US politics, finally safe from the long shadow of October 1917, became a contest between different flavors of neoliberalism — now hailed as the highest, and final, form of human civilization. US workers were in no shape to put up a fight: deindustrialization, mass incarceration, the attack on the welfare state, and the war on unions had left them disorganized and disempowered. But capital can’t help itself. Sooner or later, it summons its ghost. In 2008, the financial crisis opened a crack in the neoliberal consensus, offering a painful lesson in capitalism’s failures. The decade that followed brought Occupy, Black Lives Matter, and the Bernie Sanders campaign. More recently, a wave of teacher strikes and actions against ICE have rattled the status quo. It’s clear that we’ve entered a moment of rising militancy and mobilization. A new US left — more radical, more combative — is taking shape. This left is not monolithic, of course: it has distinct currents, and the relationship among them is complex. Still, socialism increasingly acts as the umbrella under which these different currents are organizing. Poll after poll confirms the term is growing in popularity among millennials. Socialist organizations like Democratic Socialists of America (DSA) have seen a surge in membership, and DSA-backed candidates like Alexandria Ocasio-Cortez have won elections against difficult odds. Meanwhile, the fact that Sanders is currently the country’s most popular politician suggests that a social-democratic program, paired with a basic class analysis that blames billionaires for the struggles of working people, enjoys broad support. For the first time in decades, socialism is something more than a subculture. The withering of the political center, exemplified and aggravated by the election of Trump, has amplified formerly marginal voices. At a time when the ruling classes seem unwilling or unable to address the long crisis of working-class life — a legacy not only of the Great Recession but of the slowdown in growth and productivity since the 1970s — socialism is finding an audience. But it’s important to put things in perspective. Socialism is now more than a subculture, but it still lacks a mass base. As the largest socialist organization in the country, DSA has grown rapidly in the past two years to roughly 50,000 members. Yet it remains orders of magnitude smaller than right-wing groups like Americans for Prosperity and the National Rifle Association, which boast millions of members. And if the collapse of the political center has created space for socialism, it has also created space for capitalism’s other ghost: fascism. In fact, the far right has been the biggest beneficiary of declining ruling-class legitimacy, not only in the US but throughout the West.\nExceptional Situations How should socialists respond? It’s a difficult question. But posing it, and debating the different answers, is essential. The US left’s history of anti-intellectualism, its impulse to just do something, anything, has been one of its greatest weaknesses. What’s needed is not just action but theory, analysis, strategy, tactics. We need to try to see our situation as clearly as possible, so that we can make intelligent choices about how best to navigate the obstacles and opportunities that it presents. This is always hard, because the historical moment is always new. As Louis Althusser said, we are always in “exceptional situations.” Marxist theory is indispensable for analyzing these situations — but only if it pays close attention to what makes them exceptional. Nothing is less Marxist than forcing a complex and fluid social reality into a simple and static schema. Marxism is above all a theory of change, and so has to keep adapting itself to the changes it hopes to describe. Because its ideas are permanently unfinished, they require continuous revision. The challenge is staying faithful to the core insights of the tradition, while extending them to fit new situations. When it comes to our own situation, the insights of Nicos Poulantzas are especially useful. A Greek sociologist who taught in France from 1968 until his suicide in 1979, Poulantzas wrote on class, fascism, and the state. But the work of his that bears most directly on the question of US socialist strategy today is “Towards a Democratic Socialism,” a remarkable essay published one year before his death. The immediate context for the essay was the rise of Eurocommunism. This referred to a tendency among some Communist parties in Western Europe — namely in Italy, Spain, and France — to distance themselves from the Soviet Union, to express a stronger loyalty to representative democracy, and to form relationships with new social movements like feminism, ecology, and gay liberation. Eurocommunism might seem like a remote artifact of socialist history, but the debates it inspired continue to feel quite contemporary. How should socialists think about the state? What is the role of representative democracy? Where do social movements fit in? Poulantzas supported the Eurocommunist turn, but staked out a position on its left. A critic of Soviet authoritarianism, he wanted socialists to embrace representative institutions and the political liberties they embody. But he didn’t want them to stop there: he insisted on the need for a more radical model that, while avoiding the nightmare of Stalinism, also sidestepped the pitfalls of social democracy. What Poulantzas came up with was a two-pronged approach. Building socialism would require waging one struggle inside the state and one struggle outside of it. The former would involve transforming the state by shifting the relationship of class forces within it — not simply by occupying its representative institutions, but by radically altering them. The latter would involve cultivating another form of power — popular power — by assembling new institutions of direct democracy and self-management at the base. Both processes had to be pursued together, he argued, since either pursued in isolation would cause the socialist project to collapse. Working solely within representative democracy in its existing form left socialists powerless to push the kind of transformations that would be needed to break the power of capital and construct a new social order — the fate of many social-democratic parties. On the other hand, relying exclusively on direct democracy and eliminating representative democracy — as Lenin did in the aftermath of the October Revolution — presented serious dangers of its own. It opened the door to authoritarianism, as Rosa Luxemburg presciently warned in 1918. Representative democracy underpins pluralism and the freedoms that are required for pluralism to function. Representative institutions offer a framework for multiple parties to present political alternatives, and then compete for a democratic mandate on the basis of people’s ability to choose freely among them. Without such institutions, Poulantzas believed, direct democracy would deteriorate into despotism. This is what happened in Russia: a single party came to dominate the soviets, and eventually substituted itself for them. If sole reliance on representative democracy leads to one dead end in the form of social-democratization, then sole reliance on direct democracy leads to another dead end in the form of bureaucratic dictatorship. These are very different outcomes, but they share a common theme. Both are “marked by statism and profound distrust of mass initiatives,” wrote Poulantzas. Both end up elevating an elite that claims to speak for the masses — whether social-democratic politicians or Soviet apparatchiks — while actually depriving the masses of any meaningful opportunity for self-rule. Thus the importance of developing state power and popular power at the same time. In combination, Poulantzas believed, the two could inhibit one another’s worst tendencies and bring out their shared democratic potential. Poulantzas’s essay is a thoughtful attempt to learn from the mistakes made by socialists in the twentieth century, and to propose a better way forward. But it also offers something more specific: a path for socialist advance that is particularly well-suited to our exceptional situation.\nA Field of Struggle One of the more exceptional things about our situation is the fact that socialists are winning elections. In 2017, DSA-backed candidates won twenty-one of the thirty-two races they contested, including Lee Carter, who took the Republican House Majority Whip’s seat in the Virginia House of Delegates. So far, 2018 has brought a series of high-profile victories in Democratic primaries. In Pennsylvania, Summer Lee and Sara Innamorato beat a pair of incumbents from a powerful political family, while in New York, Alexandria Ocasio-Cortez defeated Jim Crowley, the fourth-ranking Democrat in the House of Representatives. In Michigan, DSA member Rashida Tlaib won her Congressional primary and will go to the general election unopposed. And in Brooklyn, Julia Salazar won her State Senate primary and will soon be heading to Albany. Beyond running and winning as open socialists, socialists are also pulling the liberal center further left. This is perhaps best demonstrated by the growing embrace of Medicare for All by Congressional Democrats — a demand that was considered fringe when Sanders put it at the center of his presidential run in 2016. Another demand making inroads with the Democratic mainstream is the abolition of ICE and the need for immigration justice, which Ocasio-Cortez made a major part of her campaign. These are encouraging trends. Yet as socialists continue to win elections, and enter government in greater numbers, they will run into resistance. The US state places significant constraints on what socialists can achieve within it. That doesn’t mean socialists shouldn’t try to influence the state as much as they can, either by winning elections or organizing public sector workers or putting pressure on elected officials. But it’s important to keep in mind the key Marxist insight that the state is always a class state — that it remains above all “a committee for managing the common affairs of the whole bourgeoisie,” in Marx and Engels’s words. In the past, this phrase and others like it have led some Marxists to take too simplistic a view of the state. Poulantzas blamed Lenin in particular for seeing the state as monolithic — as a fortress to be encircled, attacked, and demolished. By contrast, social democrats have often suffered from the opposite temptation: seeing the state as a neutral apparatus that a working-class party, if it wins enough votes, can wield for whatever purposes it wants. Both analyses are wrong, argued Poulantzas. The state is neither neutral nor monolithic. Rather, it is an instrument of class power and a site of class struggle. While on the whole the state acts to reproduce capitalist class rule, it is complex and contradictory. Fights between classes and fractions of classes are constantly erupting across it. The victory of Ocasio-Cortez is one example; the recent uprisings by public school teachers — who are state workers, after all — is another. The state is less a fortress than a field of struggle. Still, it is a field that remains heavily tilted in capital’s favor. The US state is a stark case. The Founders engineered a form of government that would preserve the rule of property owners like themselves and suppress popular energies bubbling up from below. From the Senate to the Supreme Court to the logic of federalism itself, it’s hard to think of another advanced “democracy” more antagonistic to the basic principle of popular sovereignty. And the rightward march of US politics over the past several decades has only made things worse. Voter suppression, the growth of money in politics, and an increasingly reactionary judiciary are just a few of the mechanisms employed for making the country’s representative institutions even less representative than they already are. No wonder, then, that the political scientists Martin Gilens and Benjamin I. Page, after examining decades of data, concluded that “majorities of the American public actually have little influence over the policies our government adopts.” That privilege is held by the wealthy — a feature, not a bug, of the US state in particular and capitalist states in general. As a result, the goal for socialists can’t just be to infiltrate or influence the state, but to transform it. Reforms that improve the lives of working people can and should be won within the confines of the current system. And by sharpening the conflicts and contradictions that crisscross the state, socialists can carve out space for more radical reforms. Sooner or later, though, the class nature of the state asserts itself. The state is territory worth fighting over, but it is always enemy territory. This is an important point for socialists to make as they participate in the various struggles being waged by the new US left. Beyond the many specific demands, the deeper demand at the heart of these struggles is for dignity and self-determination, for a world where everyone has the resources they need to lead a non-miserable life and the power to participate in the decisions that affect them. The capitalist state cannot possibly help create such a world, since the mode of production it exists to preserve is premised on the domination of the many by the few. What kind of state could? In the US context, the socialist transformation of the state would involve, at minimum, making our representative institutions more representative. Abolishing the Senate, one of the world’s most undemocratic legislatures, would be a good start. Yet even the most representative capitalist state would remain profoundly undemocratic, because it cannot meaningfully represent people’s interests in the parts of their life that are most critical to their survival and flourishing. The capitalist state, like capitalism as a whole, divides power into two spheres: the political and the economic. Capitalist states have conceded a degree of democracy in the political sphere, but only on the condition that the economic sphere continues to be a dictatorship of capital. To be truly representative, a socialist state would have to dismantle this dictatorship. It would have to both deepen and extend its powers of representation, and treat democracy as the supreme organizing principle for all of society. Poulantzas is right to describe representative democracy as “an essential condition of democratic socialism.” But representative democracy isn’t an element of the capitalist state to be conserved during a socialist transition. It’s an idea that can only be fulfilled by a socialist transition — it is one of many promises that liberalism can’t keep.\nSocialism From Below Even the best socialist state would still be a state, however. This makes it prone to the pitfalls of what Hal Draper called “socialism from above”: the notion that a set of self-appointed saviors can liberate the working class on its behalf, from a great height. Historically, this has proven to be an easy trap for socialists to fall into, whether it comes in the form of social-democratic technocracy or Stalinist authoritarianism. The alternative is “socialism from below” — which is also the socialism of Marx. In Draper’s words, this is “the view that socialism can be realized only through the self-emancipation of activized masses in motion, reaching out for freedom with their own hands.” Or, as Stuart Hall wrote in a similar vein, the goal is “the real passage of power to the powerless.” “They have to do it for themselves,” Hall continued, “by finding the forms in which they can take on the control over an increasingly complex society.” The state has an important enabling role to play in this process — but it can also strangle this process. That’s because states tend to concentrate power, distributing decision-making authority upwards. Socialism, by contrast, needs power to flow in the opposite direction: downwards and outwards. Socialists can’t ignore or abandon the state — as the machinery of class rule, it forms an essential terrain of class struggle. But “the self-emancipation of activized masses in motion” is impossible without pushing power out of the corridors of the state and into the wider society. The kind of power that grows in the soil of that wider society is popular power, Poulantzas’s other essential ingredient of socialist transformation. Society isn’t one thing, of course. It’s multiple and varied — and this informs the diversity of forms that popular power can take. Popular power is the power that people exercise when they come together to democratically determine the conditions of their common life in all of the spaces they share, from the factory to the school, the housing complex to the nursing home. Popular power is a perpetual feature of working-class life. As long as capitalism has existed, the people it has exploited have tried to claw back control over their lives by building structures of collective self-determination. They have formed councils and committees, founded unions and cooperatives. They have organized as workers and tenants, staged rent strikes and bread riots. While these are strategies for surviving capitalism, they also contain the seeds of a world beyond capitalism. By carving out the islands of cooperation and solidarity and democracy necessary for their survival, the working class makes the silhouette of a different system visible. Hall once described the “points of recognition” that develop between socialist ideas and working-class life. He believed that socialism’s validity, and much of its content, derives from the practices that communities have created to resist domination. “We are making the socialism of tomorrow today,” he wrote.\nThe Autonomous Layer But if the struggle for popular power is constant, it escalates in certain moments. We are in one of those moments now, with new fronts and new flash points quickly proliferating. Take the example of the recent teacher strikes. They began in West Virginia, where militants built a mass movement through a commitment to rank-and-file democracy, deep links to local communities, and an industrial model of organizing that engaged not just teachers but all school workers, from bus drivers to cooks. The strikers defended the right to a public education, against efforts by state governments to privatize it. As a result, they also belong to a broader movement for decommodification — for taking certain essential goods and services off the market to ensure that everyone has access to them. The campaign for Medicare for All is currently the vanguard of this movement, and has built on the groundwork laid by Sanders to become a major political force. But it can also be seen in other areas like housing, where tenant organizers are resisting the rule of the market by fighting for universal rent control and city-funded legal counsel for tenants facing eviction — or trying to roll back the rule of the market with social housing and community land trusts. These initiatives clearly reflect an effort to influence the state by altering the balance of class forces within it. But they also reflect an effort to develop a layer of popular power that is autonomous of the state, a layer that cultivates the capacity for self-determination from below. This is achieved through what Poulantzas describes as the “flowering” and “mushrooming” of self-management nodes and networks, which eventually take on the coordination of various spheres of social life. Popular power is about self-rule. It involves giving people a say over how they work, how they live, and how they spend society’s wealth. But it is also about self-defense. It involves protecting people from the state violence that remains the backstop of any capitalist order — violence that, particularly in the American context, remains deeply interwoven with white supremacy. The recent occupations aimed at shutting down ICE offices around the country are what popular power as self-defense looks like. In Portland, occupiers held the property surrounding ICE’s Southwest Portland headquarters for thirty-eight days, drawing on support from city residents who helped keep the camp supplied with food and other necessities. The occupations in Portland and elsewhere have obstructed ICE operations and strengthened the growing movement to abolish the agency. A related horizon is the anti-police and anti-carceral organizing that has surged in recent years. This energy has manifested in many ways, but one of its most important expressions is the new cycle of prisoner militancy. September 2016 saw the largest prison strike in US history, as tens of thousands of prisoners in twenty-four states staged a nationally coordinated action timed for the forty-fifth anniversary of the Attica uprising. And on August 21, 2018, organizers launched another major prison strike, with actions reported across the US and Canada. Their demands include better living conditions, an end to forced labor, and the restoration of voting rights. This map is necessarily incomplete, but it gives some sense of the range of movements currently underway. Socialists are involved in all of them, often in a leading capacity — and only socialists, or more specifically socialist feminists, have the analysis that explains how they are all connected. The common thread is the crisis of social reproduction that, as Nancy Fraser has argued, lies at the root of the crisis of working-class life. Social reproduction refers to the wide orbit of activities that make capitalism possible by reproducing the labor power it runs on. The question is not only how goods and services are produced but how “the people who produce such things are themselves produced,” in the words of Tithi Bhattacharya — how they are raised, socialized, educated, healed, housed, loved, and otherwise sustained. Today’s struggles have sprung up in response to capitalism’s tendency to undermine and exhaust the social-reproductive resources on which it depends — a tendency accelerated in recent decades by neoliberal policies and climate change. Poisoned water in Flint, wildfires in California, racist police killings everywhere, the upwardly spiraling cost of health care and housing: capitalism is making it harder for people to live. Exploitation at the point of production continues, but it’s the intensifying deprivation and dispossession at the many sites of social reproduction that feel most characteristic of our moment, and feed much of its radical potential.", "url": "https://www.jacobinmag.com/2018/12/nicos-poulantzas-socialism-from-below-democratic-power"}