{"authors": ["Journal Editorial Board"], "date_download": "2020-05-04 20:15:12", "date_modify": "2020-05-04 20:15:12", "date_publish": "2018-01-16 06:00:00", "description": "As Americans, we recognize and support - indeed, celebrate - the right of protesters to speak their minds and make their voices heard in peaceful fashion. Our Constitution protects the...", "filename": "_29c1745e7c0948f19d7ccf79c495cb3c_1588623312.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_29c1745e7c0948f19d7ccf79c495cb3c_1588623312.html", "title": "Don't protest outside a lawmaker's home", "title_page": "OUR OPINION: Don't protest outside a lawmaker's home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As Americans, we recognize and support - indeed, celebrate - the right of protesters to speak their minds and make their voices heard in peaceful fashion.\nOur Constitution protects the rights to freedom of speech, to peaceably assemble and to petition the government for a redress of grievances.\nHowever ...\nIn our view, a protest organized by Democrats outside the Shell Rock, Iowa, home of Republican Senate Majority Leader Bill Dix on Saturday crossed a line we hope isn’t crossed again.\nWe understand the 100 or so men and women who picketed Dix’s residence acted within their rights and violated no laws, but we believe the private home of any elected officeholder at any level of government should be respected by protesters as off limits.\nBoth sides, Democrats and Republicans, should embrace this principle as an unwritten rule.\nIf the shoe was on the other foot and Republican activists carried signs, banged on drums, made speeches and conducted media interviews in front of a Democratic majority leader’s house, Democrats would howl with indignation. And we would howl with them.\nMoving forward, we make this suggestion to activists in Iowa:\nIf you want to protest a Republican or Democratic legislative leader or rank-and-file lawmaker over votes and positions on issues, protest away - outside and inside the Capitol and public events at which they appear (a public speech, for example).\nBut leave them, their families and their neighbors alone when they’re at home.", "url": "https://apnews.com/29c1745e7c0948f19d7ccf79c495cb3c"}