{"authors": ["Ron Shawgo"], "date_download": "2020-05-04 20:06:57", "date_modify": "2020-05-04 20:06:57", "date_publish": "2018-02-18 05:00:01", "description": "In a year that saw natural disasters, mass shootings and political upheaval, a healthy economy didn't seem to improve Americans' dispositions. Many states witnessed declines in the 2017...", "filename": "_39ee15bc2569450b880036fcfbbbea6f_1588622817.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_39ee15bc2569450b880036fcfbbbea6f_1588622817.html", "title": "Sense of well-being falls", "title_page": "Sense of well-being falls", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In a year that saw natural disasters, mass shootings and political upheaval, a healthy economy didn’t seem to improve Americans’ dispositions.\nMany states witnessed declines in the 2017 Gallup-Sharecare Well-Being Index, which measures how people feel about themselves. As a result, there was an overall national decline for the first time in the index’s 10-year history, according to the survey, released last week.\nIndiana’s ranking improved, though it’s still near the bottom.\nUsing measures of purpose, social interaction, financial security, community pride and health, the index attempts to help communities and businesses make decisions on health care and job productivity. The 2017 report is based on cellphone and landline interviews with a random sampling of 160,498 adults.\nOn a positive note, measures of physical health, such as increased exercise and decreased smoking, reached their highest levels last year, the survey found. And Americans who described themselves as thriving continues to grow, reaching 56.3 percent from 55.4 percent in 2016.\nStill, the report calls 2017 “a challenging year for Americans’ well-being.” The index is calculated on a scale of zero to 100, where zero represents the lowest well-being and 100 the highest. Last year’s national score was 61.5, down from 62.1 in 2016. No state showed a statistically significant improvement from 2016, and 21 states declined.\nIndiana rose in rank from 47th in 2016 to 42nd last year, though its overall well-being score remained virtually the same. The state’s physical ranking increased slightly. Most notable, the state’s purpose and social rankings improved several spots. Purpose is liking what you do, and social is having supportive relationships.\nThat purpose and social metrics increased indicates “we’ll continue to see improvement in the physical well-being of our communities,” said Jennifer Pferrer, executive direct of the nonprofit Wellness Council of Indiana. The group is part of the Indiana Chamber of Commerce. The results, she added, give her hope the state is making small steps in the right direction.\nAlaska took a big hit, dropping from second to 25th, largely because its residents reported declines in purpose, social and community well-being, or liking where they live. West Virginians reported the lowest levels of well-being for the ninth consecutive year. South Dakota, ranked third in 2016, pushed Hawaii out of the top spot.\nThe study does not attempt to explain the states’ declines. But it notes that they came “despite improvement in key economic metrics, including unemployment, perceptions of standard of living, confidence in the economy and optimism about spending.”\n“Somewhere in the mix, I believe security and safety are a component, and I am not sure when there has been a period in my life where the natural and man-made disasters/events have come with such frequency and regularity,” Dr. Deborah McMahan, Allen County health commissioner, said in an email response.\n“I also am not sure I have experienced such a level of discord and negativity at the national level : it is just my opinion, but I believe those things factor in our sense of well-being, independent of our own sense of purpose and financial security.”\nAmericans were hammered with turmoil last year: Russian meddling in U.S. elections, executive branch investigations, political wrangling, sexual harassment allegations against prominent men, tensions with North Korea, two mass shootings and three destructive hurricanes.\nUSA Today quoted Dan Witters, Gallup-Sharecare Well-Being Index research director, as saying researchers took caution aligning results with the presidential election, but they believe it played a role.\nStates with declines in well-being scores shared some common traits, with more people reporting increased worry, little interest in doing things, increased depression, elevated physical pain, a decline in perceived “positive energy” from family and friends, and a drop in the percentage of those reaching their goals.\nWith the exception of community well-being, all of the national well-being elements suffered declines in 2017, according to the report. The social and purpose elements declined particularly sharply.\nThe current political environment has everyone a bit more cautious, which affects financial well-being, personal stress and conversations in the community, Pferrer said.\n“I believe that the societal things that have happened over the last couple of years are definitely impacting those scores” in the report, she said.\nWhile related to financial security and other issues that were measured, well-being is also dependent on things that are harder to describe and therefore measure, McMahan said.\n“Well-being seems to be the indicator that reflects the tension between our independent nature and our interdependent needs,” McMahan wrote. “I am sure open to hearing from others, because what we are doing now sure isn’t working.”\nrshawgo@jg.net", "url": "https://apnews.com/39ee15bc2569450b880036fcfbbbea6f"}