{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:08:57", "date_modify": "2020-05-04 20:08:57", "date_publish": "2018-09-12 17:41:00", "description": "Dear Annie: My husband of over 30 years is a great person, successful and well-educated. I love him dearly except for one annoying thing. He draws on people's photos in magazines and...", "filename": "_d51c043f8e0843ee818eb656d2ba02c8_1588622937.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d51c043f8e0843ee818eb656d2ba02c8_1588622937.html", "title": "Husband is no Picasso", "title_page": "Husband is no Picasso", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dear Annie: My husband of over 30 years is a great person, successful and well-educated. I love him dearly except for one annoying thing.\nHe draws on people’s photos in magazines and newspapers.\nAlmost daily, for a few minutes after breakfast or dinner, he’ll draw mustaches, knocked-out teeth, facial hair and blemishes on the faces of people in the photos. Most of the time, these are models or unknown people, both male and female. He only does this at the table and throws the photos away right away.\nI’ve asked and asked why he does such a childish and immature thing. He says that it’s funny but that more so, it releases stress. And he does have a very stressful job.\nDon’t suggest adult coloring books, professional drawing supplies, paint or charcoal. I’ve suggested all that to him. Don’t suggest a hobby, yoga or meditating; he already does that stuff.\nWhat I want to know is: Am I being overly critical, or is this just stupid? -- He’s No Picasso\nDear He’s No Picasso: Doodling is actually very smart. According to a 2017 study by researchers at Drexel University, doodling “helps with attention and improves health and well-being.” You don’t have to be Picasso to reap the benefits, because it’s not about the end result; it’s about the act of doodling itself. So it sounds as though your husband is just having a bit of fun and blowing off some steam. If such a harmless activity stresses you out so much, perhaps you should give doodling a try.\nDear Annie: I’m writing to you not about a problem but about your responses to others’ problems. You always seem to recommend seeking therapy. Therapists are sometimes expensive. Waiting lists are long and often even longer for specific things. You have many readers. If all those who have problems sought out therapists, the wait would be even longer. Surely, you have a recommendation besides seeking therapy when people have problems that need to be fixed in a timely fashion and they do not have a month or more to seek help. -- Wondering in Massachusetts\nDear Wondering: I’m glad you raised this topic, as it’s a fair point and something I’ve given a great deal of consideration to. Whenever possible, I try to offer direct, practical advice that I believe would better the letter writer’s situation or state of mind, as opposed to just recommending therapy. I recognize that if someone is deeply troubled by something and is bringing the issue to me, it’s usually because the person can’t go to therapy or doesn’t want to. But there are times when people so clearly need professional help that it would be just plain reckless not to recommend that they seek it.\nFor people who are unable to access a therapist because of limitations of finance or mobility, I suggest trying Talkspace, BetterHelp or another e-counseling service that employs licensed professionals. These are more affordable options than traditional therapy.", "url": "https://apnews.com/d51c043f8e0843ee818eb656d2ba02c8"}