{"authors": ["Everybody Adventures"], "date_download": "2020-05-04 20:04:02", "date_modify": "2020-05-04 20:04:02", "date_publish": "2018-06-30 23:24:56", "description": "A failed experiment decades old is, potentially, returning to Pennsylvania's hunting scene. Say hello to the Hungarian partridge. The birds — also called Huns or gray partridges — are...", "filename": "_ec0a0f098ef84078b9717d5dbf196c41_1588622642.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ec0a0f098ef84078b9717d5dbf196c41_1588622642.html", "title": "Hungarian partridges might return to Pennsylvania's hunting scene", "title_page": "Hungarian partridges might return to Pennsylvania's hunting scene", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A failed experiment decades old is, potentially, returning to Pennsylvania’s hunting scene.\nSay hello to the Hungarian partridge.\nThe birds — also called Huns or gray partridges — are native to Europe. They were brought to the United States in the early 1900s and released in states all around the country in an attempt to create huntable populations.\nHuns are a relatively small bird — about a foot long and weighing three quarters of a pound —– that live in coveys, like quail. They are not particularly hard to kill, so long as you can get close enough.\nThey’re notoriously wild flushers, though, often taking wing far from hunters and dogs.\n“The Game Commission specifically made efforts to stock Hungarian partridges within the state in the 1920s and 1930s to increase small game populations,” said Randy Shoup, chief of the agency’s bureau of wildlife protection. “But those were unsuccessful.”\nThe birds did take root elsewhere. A dozen or so western states hold seasons on them.\nBut there are no Hungarian partridges in Pennsylvania any more.\n“And there haven’t been for a long time,” Shoup said.\nSome bird dog owners would like to change that.\nThe commission recently received a request from the public, seeking permission to release the birds for hunting and dog training purposes.\nGame Commissioners seem inclined to grant that request.\nBut two things must occur.\nFirst, Shoup said, Hungarian partridges are still officially classified as a game bird in Pennsylvania. Commissioners need to take them off that list.\nSecond, they need to add them to a second list, one specifying which birds are OK to release for hunting and dog training. Right now, it includes only ringneck pheasants, bobwhite quail, mallards and chukkar partridges.\n“Essentially, (Huns) would no longer be a game bird and people who wished to utilize it for dog training purposes or hunting could do that,” Shoup said.\nBiologists in the agency’s bureau of wildlife management have no problem with that, nor do game bird breeders, Shoup said.\n“It’s kind of a no brainer, right?” said commission president Tim Layton of Somerset County. “It’s along the lines of a chukkar. They’re not going to establish populations on the game lands.”\nIt’s unlikely dog trainers and bird hunters will be turning Huns out all over, added Rich Palmer, deputy director for field operations for the commission and a bird dog owner.\n“I actually wouldn’t expect them to be used too heavily because they’re harder to raise. So they’re actually more expensive than a chukkar,” he said.\n“They’re approaching pheasant prices.”\nStill, expect commissioners to address the issue at their next meeting, set for July 30 and 31.\n“We have no thought of, 20 years from now, getting into the Hungarian partridge business to replace something else,” said commissioner Brian Hoover of Chester County. “I have no problem with it.”\nBob Frye is the everybodyadventures.com editor. Reach him at 412-216-0193 or bfrye@535mediallc.com. See other stories, blogs, videos and more at everybodyadventures.com.", "url": "https://apnews.com/ec0a0f098ef84078b9717d5dbf196c41"}