{"authors": ["David Taylor"], "date_download": "2020-05-04 20:18:10", "date_modify": "2020-05-04 20:18:10", "date_publish": "2018-06-17 05:00:00", "description": "The normally business-like Liberty Rotary Club meeting Tuesday, June 12, at noon nearly turned into a pep rally of sorts for the Liberty High School Girls State Champion Softball team as they...", "filename": "_7e3b42474fd24effa48fea0a919b75d9_1588623490.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7e3b42474fd24effa48fea0a919b75d9_1588623490.html", "title": "Lady Panthers named KUBE ‘Team of the Week’", "title_page": "Lady Panthers named KUBE ‘Team of the Week’", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The normally business-like Liberty Rotary Club meeting Tuesday, June 12, at noon nearly turned into a pep rally of sorts for the Liberty High School Girls State Champion Softball team as they received more honors for their accomplishment.\nLHS head softball coach Karen Slack, in her 18th year of coaching, was the guest speaker and Rotarians were enthralled as she talked in detail about the ride to the state title.\n“I tell anyone who will listen that I’ve never worked a day because I love what I do,” Slack said. “This year was really special for us. The fact that the community keeps asking us to talk about it is very humbling, but it is a neat experience for us all.”\nShe reminded Rotarians that this was a young team with seven freshmen, three sophomores, two juniors, and three seniors.\n“You can’t buy experience in the playoffs. It’s always been a rule of thumb that the more seniors you have on a playoff squad, the more wins you’re going to get,” she said.\nThis was an atypical year. Slack said she felt like the skill was there, the work was there, the dedication was there, but that experience goes a long way.\n“To do what these young women did and the season that they had really, really is a remarkable achievement. I hope that when this is all done with we have many more to come and we’re on the right track for that,” she said.\nThe season wasn’t so bright with a 1-7 start. There was a lot of doubt.\n“I want that to be the statement of the season. These kids kept getting knocked down. We had some rough spots and we were not a team in the very beginning. We were 15 young women with very individualistic mentality,” the coach said.\n“With softball, you just don’t win with that. There has to be a team mentality,” she said.\nThe veteran coach said softball is like a failure sport and to teach young women to learn how to fail and to get back up again and do it better the next time should be the theme of every life.\n“They did that,” she said emphatically.\nThe championship run had a lot to do with timing.\n“Thank God that was in our favor a lot of time. We snuck in the back door. A lot of people took us for granted because we were so young,” she explained.\nThat made the playoff experience so special to the coaching staff because the kids just kept coming.\n“In the beginning of the season, we had planned on our district championship. That was a goal but after 13 losses you go, ‘Wait that may be next year,’” she said.\nBut when the playoffs started, there was a change — they came together at the right time.\nIn the first round of the playoffs against Yates, the Lady Panthers waltzed through it.\nBut in the second round, they met the team that spanked them pretty good last year with a pitcher who was committed to Stephen F. Austin University.\n“By herself, she beat us twice last year,” Slack said.\nThe Lady Panthers, however, won that series 2-0 and moved on to Lufkin Hudson, another heavy junior-senior laden team that the Lady Panthers dispatched in two games.\nFor better or worse, that propelled them into the next round against No. 1 state-ranked Waco Robinson who was touting five previous state championships and a coach that has been there for 44 years.\n“Experience is not something they worry about. They just keep rebuilding and reloading,” Slack said.\nThe Lady Panthers won the first game but lost the second game decisively, 4-0. Slack knew if they pitched the same girl, they could hit her and that’s exactly what happened. The Lady Panthers stole that game and advanced.\n“I promise you, the look on their faces when we beat them the third game was one of the most amazing memories I’ll have etched in my mind,” the coach remembered. “They had no idea that was going to happen and for young women to do that is a crowning achievement in itself.”\nThen the Lady Panthers faced Lorena.\nThey had to come from behind the first game, down 3-0, but won the game 4-3.\n“I told the TV crew at state that the only reason we won that game is because we’d been beaten so many times and we knew how that felt. We didn’t panic, and we knew the worst that could happen to us is lose,” she said.\nThey won the second game and the Lady Panthers kept that mentality as they rolled into the state tournament for the first time in school history.\n“I felt good about our chances and they [the girls] did too,” she said.\nMany of the leaders on the team told Slack that the state semi-final just felt like another game.\n“I don’t know how many of you have been around teenage girls on that big of a stage, it is never just a game,” she said with a laugh.\n“It’s always more about who’s looking at me, who’s taking my picture, who’s boyfriend is in the stands,” she laughed. “But that was not the case with these girls. It was never about that. It was always about the next game,” coach said.\nThey beat Vernon 3-1 for the title, another senior-laden experienced team.\n“Vernon was shocked. We were shocked. We’re [coaches] still in a dream state. The girls aren’t. They felt like they owed this to their community,” she said. “I’ll never forget Austin. There were so many people there from Liberty to support us.”\nThe Lady Panthers returned to a throng of supporters eager to celebrate. They pre-sold 500 state championship T-shirts, an unrivaled mark.\n“For our summer workouts, we had 250 kids show up. I haven’t been a part of that before,” she said.\nSlack said there’s been a small group of young women and young athletes really working hard when no one else was and they set the standard.\n“Now we have people coming out to find out what it takes just to be that way,” she said. “Y’all did that,” she said as she looked to her players.\nThe district will be much tougher and the repeat for a state title much more difficult since none of the teams that underestimated them will make that same mistake.\nAt the conclusion of the meeting, KUBE, Channel 57 sports director and host of High School Sports Zone Todd Freed recorded an interview with the girls and coach, and the presentation of the Allegiance Bank Team of the Week Award presented by President and COO Ray Vitulli of Allegiance Bank and Post Oak Bank.\ndtaylor@hcnonline.com", "url": "https://apnews.com/7e3b42474fd24effa48fea0a919b75d9"}