{"authors": ["Staff Report"], "date_download": "2020-05-04 20:11:54", "date_modify": "2020-05-04 20:11:54", "date_publish": "2018-08-24 00:00:00", "description": "MMI Prep 166, Wyoming Seminary 172 At Valley Country Club, medalist Morgan Long shot a 4-over-par 39 and helped MMI Prep sneak past Wyoming Seminary. Jessica McClellan (41), Noah Long...", "filename": "_7b543554da47411cb2db0c42280e14d4_1588623114.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7b543554da47411cb2db0c42280e14d4_1588623114.html", "title": "Golf: Long Leads MMI Prep To Win", "title_page": "Golf: Long Leads MMI Prep To Win", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MMI Prep 166, Wyoming Seminary 172\nAt Valley Country Club, medalist Morgan Long shot a 4-over-par 39 and helped MMI Prep sneak past Wyoming Seminary.\nJessica McClellan (41), Noah Long (42) and Zack Young (44) each fired solid rounds for MMI Prep, as well.\nJeremy Callahan and Bobby Wilson each shot 40s to lead Sem.\nMMI Prep: Morgan Long 39, Jessica McClellan 41, Noah Long 42, Zack Young 44.\nWyoming Seminary: Jeremy Callahan 40, Bobby Wilson 40, Greg Godlewski 44, Andrew Maddock 48\nTunkhannock 169, Coughlin 180\nAt Wilkes-Barre Municipal, Evan Serafin shot a 1-over 37 for Coughlin, though it came in a losing effort.\nTunkhannock overcame Serafin’s performance as medalist with Nick Budner shooting a 40 and Tyler Faux adding a 42 for the Tigers. Coby Gilpin’s 43 and Dylan Mislevy’s 44 helped, as well.\nTunkhannock: Nick Budner 40, Tyler Faux 42, Coby Gilpin 43, Dylan Mislevy 44.\nCoughlin: Evan Serafin 37, Ian Gartley 45, Noah Stankinas 48, Darren Clarke 50.\nLake-Lehman 151, GAR 240\nAt Hollenback, Bobby Lugiano fired a 2-under 30 and was the medalist in a Lake-Lehman win.\nMichael Sholtis followed Lugiano with a 38 for the victors. GAR was led by Alfonso Francisco, who carded a 51.\nLake-Lehman: Bobby Lugiano 30, Michael Sholtis 38, Zack Aben 41, Ethan Leone 42.\nGAR: Alfonso Francisco 51, Van Bui 61, Juan Rojas 63, Daniel Perez 65.", "url": "https://apnews.com/7b543554da47411cb2db0c42280e14d4"}