{"authors": ["Stephen Bailey", "Sbailey Syracuse.Com"], "date_download": "2020-05-04 20:04:35", "date_modify": "2020-05-04 20:04:35", "date_publish": "2018-02-07 16:38:00", "description": "3-star DE Caleb Okechukwu signs with Syracuse football over Texas, Arkansas Syracuse, N.Y. -- Class of 2018 defensive end Caleb Okechukwu has signed with Syracuse football, the school...", "filename": "_faf54153c2914a298dfeeebfacd15fda_1588622675.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_faf54153c2914a298dfeeebfacd15fda_1588622675.html", "title": "3-star DE Caleb Okechukwu signs with Syracuse football over Texas, Arkansas", "title_page": "3-star DE Caleb Okechukwu signs with Syracuse football over Texas, Arkansas", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "3-star DE Caleb Okechukwu signs with Syracuse football over Texas, Arkansas\nSyracuse, N.Y. -- Class of 2018 defensive end Caleb Okechukwu has signed with Syracuse football, the school announced on Wednesday.\nOkechukwu, a standout pass-rusher for St. John’s (Washington, D.C.) College High School, chose the Orange over other finalists Texas and Arkansas.\nFirst I just want to thank everyone who has help from my coaches to my Family and most Importantly God. This journey hasn’t been easy but I’m glad we got through it. I say We because it’s a team effort I’m truly thankful. I’m glad to announce that I be attending..... pic.twitter.com/zaMCxjZcmj— Caleb Okechukwu (@IamCaleb_18) February 7, 2018\nThe 6-foot-4, 240-pound Okechukwu is rated three stars and the No. 74 strong-side defensive end in the Class of 2018 by 247Sports.com’s composite rankings. In addition to his three finalists, the Under Armour All-American was offered by Tennessee and Arizona, among others.\nOkechukwu recorded 80 tackles, including 38 for loss, and 15 sacks during his senior season -- his first as a starter. St. John’s head coach Joe Casamento spoke highly of Okechukwu’s potential and versatility; he played behind high-Power-5 prospects each of the last two seasons.\n“He’s one of those kids who could be 290 (pounds) if they wanted him to play inside or stay outside at 250, 260,” Casamento said previously.\nOkechukwu, who took an official visit to SU two weekends ago, is the first defensive lineman to sign with the Orange this cycle. He joins running backs Akeem Dixon and Jarveon Howard as prospects to ink with SU on National Signing Day.\nSyracuse football hires Kirk Martin as QBs coach: Dino Babers’ in-law from Texas\nStephen Bailey covers Syracuse football for The Post-Standard/Syracuse.com. You can follow him on Twitter and Facebook. He can also be reached anytime via email or phone (315-427-2168).", "url": "https://apnews.com/faf54153c2914a298dfeeebfacd15fda"}