{"authors": ["Jon Gard Staff Writer", "Jgard Heraldargus.Com"], "date_download": "2020-05-04 20:27:38", "date_modify": "2020-05-04 20:27:38", "date_publish": "2018-02-14 20:00:17", "description": "La PORTE — Gideon Rosa, a middle-schooler with the La Porte County Christian Homeschool Association, was named the best speller in the county Tuesday night after chewing through words such as...", "filename": "_cb4d9af8a5bf461dacae72b3222b0c51_1588624058.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cb4d9af8a5bf461dacae72b3222b0c51_1588624058.html", "title": "Students spell their way to regional bee", "title_page": "Students spell their way to regional bee", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "La PORTE — Gideon Rosa, a middle-schooler with the La Porte County Christian Homeschool Association, was named the best speller in the county Tuesday night after chewing through words such as “nebbish” and “macadamia.”\nIt was the second consecutive year he won the title.\nTwenty-five students representing schools from across the county competed in the District Spelling Bee at Kesling Middle School.\nThe top 10 spellers will advance to the Regional Bee on March 14 at Wheeler High School, where they compete against finalists from the Lake/Porter County District Bee.\nOne winner at the Regional Bee will advance to the Scripps National Spelling Bee in Washington, D.C., an expense-paid trip sponsored by Kankakee Valley REMC.\nSeveral rounds were required to determine placement among the final three spellers.\nGrace Jones, of New Prairie Middle School, finally tripped on “seamless” and placed second. Jones won the county title in 2015.\nPorter Ivankovig, of Indian Trail Elementary School, took home a third-place trophy after missing on “barrage.”\nEight students were called back to the stage to break a tie for the final two spots.\nScott L. Simerlein, a professor at Purdue University Northwest, enunciated each of hundreds of words during the competition, often providing definitions and word origins, or using words in a sentence at the request of competitors.\nA team of judges only once had to listen to a recording of a spelling — to determine whether a boy had pronounced the “h” in “handsome” or uttered a nonsensical sound at the beginning, which would eliminate him from the round.\nThe boy laughed at himself, even with his eligibility hanging in the balance, as he confessed he initially blurted out nonsense, an error attributed to his nervousness. The judges later concurred.\nOthers left the stage in tears or expressed surprise when their spellings were deemed correct.\nAmong tougher words were “Permian,” the last period of the Paleozoic era or the corresponding system of rocks; “mizzle,” to rain in very fine drops; “chintz,” a printed cotton fabric from India; and “Kabuki,” a traditional Japanese drama performed with highly stylized singing and dancing.\nOthers students advancing to the Regional Bee are Taylor Denvit of Krueger Middle School, Alexis Bailey of Wanatah Middle School, Alaina Brown of South Central Junior High School, Ella Pytynia of Crichfield Elementary School, Emma Mitschelen of Boston Middle School, Emily Kolacz of Olive Township Elementary School and Kenadie Quirk of Prairie View Elementary School.", "url": "https://apnews.com/cb4d9af8a5bf461dacae72b3222b0c51"}