{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:12:41", "date_modify": "2020-05-04 20:12:41", "date_publish": "2018-07-01 10:39:36", "description": "By Rebecca Spalding Bloomberg Genetic engineering could help produce more resilient crops and more effective vaccines. Some fear that it could also be used to make a biological...", "filename": "_f5df84e868c24ebab89b11e033cf3a5c_1588623161.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f5df84e868c24ebab89b11e033cf3a5c_1588623161.html", "title": "DNA Cops Make Sure Deadly Viruses Don't Get Rebuilt", "title_page": "DNA Cops Make Sure Deadly Viruses Don't Get Rebuilt", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Rebecca Spalding\nBloomberg\nGenetic engineering could help produce more resilient crops and more effective vaccines. Some fear that it could also be used to make a biological weapon.\nIn January, a small research team at the University of Alberta engineered a cousin of the lethal smallpox virus called horsepox, using strands of DNA they received in the mail. The organism that they built wasn’t a threat to humans.\nBut when the scientists published their findings in scientific journal PLOS ONE, an uproar ensued.\nThe study’s publication “crosses a red line in the field of biosecurity,” wrote Gregory Koblentz, a professor in the biodefense department at George Mason University, in a public comment to the journal. “The synthesis of horsepox virus takes the world one step closer to the reemergence of smallpox as a threat to global health security.”\nSmallpox was eradicated by 1980, after generations of research and immunization; many Americans born before 1972 have smallpox vaccination scars. The disease, which once killed about a third of the people it infected, is considered so dangerous that only two laboratories in the world-one at the Centers for Disease Control in Atlanta and one in Siberia-are permitted by the World Health Organization to store samples of it.\nFor years, bioethicists and security experts have debated whether those closely guarded samples should be destroyed. But the widespread availability of the basic building blocks of life online means bad actors may not have to break into a remote lab and steal a smallpox virus sample to unleash a devastating act of biological terrorism. They may be able to assemble it themselves.\nTo help curtail the threat, the U.S. intelligence community, which has been tracking the potential for new biological technology to be used for nefarious ends for years, is working with a Boston-based company, Ginkgo Bioworks, that makes some of the most innovative genetic products in the world to help prevent a new class of dangerous biological weapons from ever being built.\n“We became concerned about engineered pathogens in the 1990s,” said Andy Weber, a former assistant secretary of defense for nuclear, chemical and biological defense programs in the Obama administration. He now advises the private sector, including Ginkgo. “Frankly the science has caught up to these concepts.”\nUsing a technology called synthetic biology, a marriage of biology and engineering that allows researchers to construct genes in a lab, a scientist could theoretically make present-day illnesses more virulent or drug-resistant, or revive long-eradicated ailments such as bubonic plague or the Spanish flu. The fear is, without proper oversight, this could be done using genetic material acquired online. That possibility has made people who track emerging security threats sit up and take notice. They worry that such innovations could be used to make a biological weapon.\nTo be sure, reawakening dormant diseases currently requires significant scientific expertise and laboratory resources. Only state actors have been thought to use such techniques, according to security experts. However, the pace of innovation is quickening: Several companies can now tailor strands of DNA in ways that could revolutionize fields from agriculture to fragrances to medicine-and be profoundly dangerous in the wrong hands.\nIn June 2017, the Intelligence Advanced Research Projects Activity (Iarpa), a technology-research agency within the Office of the Director of National Intelligence, launched a program that it hopes will help keep cutting-edge biological technology away from bad actors.\nPreventing a potential attack isn’t as simple as monitoring a list of outlawed pathogens, which would be flagged under current screening methods. It’s possible to order smaller components of a longer genetic sequence and then reassemble them in a lab to build a harmful biological agent, whether by design or by accident. There is also a fear that novel sequences could be created that would mimic the functions of harmful pathogens, but that could evade current methods.\nThe horsepox episode “suggests that there are risks that are present today,” said Jason Matheny, Iarpa’s director. “If someone is technically sophisticated and dedicated, someone could do a lot of damage.”\nTo improve screening, Iarpa officials started a program that contracted with researchers from the Battelle Memorial Institute, a Columbus, Ohio-based research group, Harvard University, Virginia Tech and others to create advanced algorithms that could flag and prevent harmful DNA orders from being completed.\nIn order to understand which genetic combinations might be harmful before they’re ever made in a laboratory, the Iarpa-led program brought in Ginkgo, which will develop algorithms that can predict which genetic sequences, even unknown ones, could potentially cause harm. Called Fun GCAT, an acronym for Functional Genomic and Computational Assessment of Threats, the program is seeking to create algorithms that would predict how genetic sequences are meant to function before they’re ordered, even if the combination being studied is new and not seen in nature.\nGinkgo designs organisms using genetic data, coding them in much the same way computers are programmed. The company is designing microbes that can live on the roots of plants and produce nitrogen, reducing the need for chemical fertilizer in some farming. It’s also working on coding microbes that produce rose oils for perfumes, no roses required.\nWorking from a large, loft-like office overlooking Boston Harbor, Ginkgo says it performs about 40 percent of the world’s gene printing, a form of synthetic biology that makes it possible to engineer organisms that produce compounds used in common manufacturing processes. The compounds include rose oil or nitrogen fertilizer.\nSynthetic biology has advanced rapidly. Ginkgo Chief Executive Officer Jason Kelly, 37, said that when he was a graduate student studying biological engineering at the Massachusetts Institute of Technology in the mid-2000s, he designed about 50,000 base pairs-the term for the two corresponding units of DNA that make up a rung of the genetic ladder.\nNow, Kelly says, his company can design roughly 50 million pairs a month, thanks to faster and cheaper sequencing techniques. Being able to generate so much genetic material may mean being able to rapidly develop vaccines to respond to new pathogens or prototype experimental medications more quickly, according to the company.\n“The rate that you can learn is just dramatically higher. There’s just no comparison,” he said.\nGingko quickly saw the potential security risks in its work. It began working with Weber, the former Obama administration official, in 2016 to get advice on how to best preserve national security.\n“We are doing more of this genetic engineering than anybody, we think we’re going to get better at it than anybody, so we have a responsibility to be keeping our eye on both sides of that coin,” Kelly said. “How do we protect and defend against that while protecting our ability to get all the positive outputs of biotechnology?”\nAsha George, executive director of the Blue Ribbon Study Panel on Biodefense, said it’s a good sign that Iarpa is getting involved before synthetic-biology technology becomes more widespread. She said biosecurity issues don’t receive the attention and resources they merit.\n“The amount of effort we’re still putting toward the nuclear threat, the chemical threat, the incendiary threat is so much more than the United States government-or any government, for that matter-is putting towards bio-preparedness, that’s just a fact,” she said. “The biological threats do not receive the same level of attention as other threats.”\nGeorge said it’s not possible or desirable to turn back the clock. To do so, she says, would be akin to calling to outlaw computers because of the risks that viruses pose.\n“It would be like saying the industrial revolution could make machines that would produce a lot of pollution, so we’re not going to engage,” she said. “Can you imagine how far behind we would be as a country if we did that?”\nSecurity experts hope synthetic biology could also counter threats from emerging diseases by offering a faster way to find and produce vaccines. Drugmakers generally do less research in infectious diseases, compared with other areas, and even in the areas for which there are vaccines, some strains, like last winter’s flu, can prove resistant to treatment.\nWeber hopes such vaccine research could ultimately take months, rather than decades, with the help of synthetic biology. But while he sees the Iarpa program as a step forward in general, he believes that overall, the country is unprepared.\n″(Are) the U.S. government and other governments investing sufficiently against this threat? I think the answer is a resounding no,” he said. “Whether that’s preparedness against the next Spanish flu pandemic or against bioweapons, we’re under-invested as a country in terms of countering these threats.”", "url": "https://apnews.com/f5df84e868c24ebab89b11e033cf3a5c"}