{"authors": ["Robert Marchant"], "date_download": "2020-05-04 20:15:03", "date_modify": "2020-05-04 20:15:03", "date_publish": "2018-06-19 22:03:50", "description": "GREENWICH — Workers are continuing to remove motor oil that spilled into Horseneck Brook after an accidental discharge from a truck last week, while state regulators said the spill had a minimal...", "filename": "_10cef6f6b31149a087d9cc37a2ac6c72_1588623303.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_10cef6f6b31149a087d9cc37a2ac6c72_1588623303.html", "title": "Cleanup of oil spill continues in Horseneck Brook", "title_page": "Cleanup of oil spill continues in Horseneck Brook", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GREENWICH — Workers are continuing to remove motor oil that spilled into Horseneck Brook after an accidental discharge from a truck last week, while state regulators said the spill had a minimal impact on wildlife and the nearby ecosystem.\nOne bird was fouled with the oil after the spill last Tuesday from the New Country Audi dealership, but there have been no other signs of environmental damage since then. The bird, an egret, was cleaned off by Greenwich firefighters and released.\n“We didn’t observe any other wildlife impacted in the river (Horseneck Brook) or in the Long Island Sound,” Chris Collibee, a spokesman for the state Department of Energy and Environmental Protection, said Tuesday.\nAbout 350 gallons of used motor oil ran into the brook, and it is estimated that 75 gallons have been recovered.\nAbsorbent booms are still in place — and will be in place for the near future — to recover the rest of the oil, Collibee said. Rainwater will loosen the oil from rocks and crevasses in the brook, eventually flushing the motor lubricants into the absorbent material. “Any oil will be caught by the absorbent booms during rain events,” Collibee said.\nThe spill occurred when a contractor, Safety-Kleen Waste Management, came to pick up used oil from the Audi dealership on West Putnam Avenue, according to DEEP. Through a miscommunication or misunderstanding, the used oil was pumped into the wrong container on the truck, causing a spillover, he said.\nIt was unclear at this point if any disciplinary action, such as fines, would be taken. “It’s a little bit early to say,” Collibee said.\nFire officials in Greenwich said the responsible parties were cooperating with the remediation efforts.\nAn attorney for New Country Audi, Tom Heagney, said, “It was from a truck that overflowed,” and said the spill was not caused by any leaks from the auto shop.\nThe discharge was relatively minor, according to DEEP.\n“It’s never good when something like this happens. But 350 gallons, compared to the other things we deal with regularly, is on the low end,” Collibee said.\nrmarchant@greenwichtime.com", "url": "https://apnews.com/10cef6f6b31149a087d9cc37a2ac6c72"}