{"authors": ["Daily Inter Lake"], "date_download": "2020-05-04 20:18:25", "date_modify": "2020-05-04 20:18:25", "date_publish": "2018-10-26 05:00:01", "description": "Montana Fish, Wildlife & Parks staff captured and euthanized two yearling grizzly bears north of Polebridge on Sunday. Landowners reported the yearlings were ripping into a yurt, broke...", "filename": "_e2b9280601574b45a163fe52ba20c5fd_1588623505.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e2b9280601574b45a163fe52ba20c5fd_1588623505.html", "title": "2 yearling grizzlies euthanized; another bear relocated", "title_page": "2 yearling grizzlies euthanized; another bear relocated", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Montana Fish, Wildlife & Parks staff captured and euthanized two yearling grizzly bears north of Polebridge on Sunday.\nLandowners reported the yearlings were ripping into a yurt, broke into a cooler, got into garbage, tried to get into bear-resistant garbage containers and attempted to break into cars and trailers.\nAn adult female was observed with the yearlings, but mostly stayed in the background. The yearlings were very food-conditioned and habituated to human presence. Attempts to haze the bears were unsuccessful, according to the state agency.\nDue to the bears’ food conditioning, the agency made the decision to euthanize the animals in consultation with the U.S. Fish and Wildlife Service and in accordance with Interagency Grizzly Bear Committee guidelines.\nA food-conditioned animal actively seeks food rewards from humans, has lost its natural foraging behavior, may cause property damage and can be dangerous.\nThe decision was made to leave the adult female in the wild and monitor her activity. The adult female is radio-collared as part of Fish, Wildlife and Park’s population monitoring program. The male yearling weighed 213 pounds and the female yearling was 198 pounds.\nAnother grizzly that was frequenting the Polebridge area and had been photographed by several people on the North Fork Road was captured Sunday and moved into the interior of Glacier National Park at the Packers Roost area.\nOfficials captured the subadult male grizzly bear that weighed 224 pounds just south of Polebridge. The bear had been in the area for at least one month feeding in a field of oats that was cut for hay.\nGroups of people were frequently stopping to photograph the bear and it was becoming habituated, which created a dangerous situation because the animal no longer feared or reacted to humans. The bear was spending more time close to the road and people were seen climbing the fence and going through the gate to get closer for photographs. Some people were observed within 20 feet of the bear. The agency will work with the absentee landowner to encourage them to not plant oats in that field in the future. In addition to the subadult male, the family group mentioned above also was observed in the oat field.\nOfficials also have worked with residents in the Polebridge area to make sure food attractants are secured. FWP staff assisted in putting up electric fencing to keep bears from accessing oat hay that was being stored in an open barn. Electric fencing is an effective tool for protecting and securing livestock and other attractants.\nAnother male grizzly was captured near Whitefish Oct. 8 and moved into Coal Creek in the North Fork of the Flathead River area.\nThe bear weighed 346 pounds. The agency had attempted to capture a sow with two cubs, but incidentally captured the male grizzly bear off KM Ranch Road. Officials attached a GPS radio collar onto the animal and released the bear Oct. 9.\nRecent sightings have ranged across the region at lower elevations, including the Stillwater River drainage in and around Ray Kuhns Wildlife Management Area and the lower Flathead River.\nBears are actively seeking food before winter, and residents are advised to clean up or secure food attractants, such as garbage, dog food, and livestock. Residents are advised to pick any domestic fruit from their property.\nFWP recommends chicken and livestock be properly secured with electric fencing or inside a closed shed with a door. Recreationists are urged to “Be Bear Aware” and follow precautionary steps and tips to prevent conflicts, such as traveling in groups and making noise.\nHunters should always remain vigilant and remember that moving slowly and quietly increases your chances of surprise encounters and game-calling mimics prey. Bear spray is an effective deterrent and everyone, especially hunters, is encouraged to carry it in the outdoors.\nMore safety information is available at fwp.mt.gov. To learn more about bears or to report bear activity in Northwest Montana call 406-752-5501.", "url": "https://apnews.com/e2b9280601574b45a163fe52ba20c5fd"}