{"authors": ["Greg Stanley"], "date_download": "2020-05-04 20:07:38", "date_modify": "2020-05-04 20:07:38", "date_publish": "2018-10-17 16:35:53", "description": "The amount of groundwater near White Bear Lake that the Department of Natural Resources has allowed cities and well owners to pump is sustainable and will be for years to come, according to a...", "filename": "_7ac5407ce2a44d40b649ee3ed7b4fd69_1588622858.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7ac5407ce2a44d40b649ee3ed7b4fd69_1588622858.html", "title": "Minnesota DNR: White Bear Lake groundwater pumping sustainable", "title_page": "Minnesota DNR: White Bear Lake groundwater pumping sustainable", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The amount of groundwater near White Bear Lake that the Department of Natural Resources has allowed cities and well owners to pump is sustainable and will be for years to come, according to a court-ordered study released Tuesday by the DNR.\nThe $250,000 study found that a district court judges controversial irrigation ban, which would automatically trigger when the lake drops below a certain level, will have little noticeable effect on water levels since the lake naturally rises and falls.\nThe study shows that groundwater pumping has lowered White Bear Lakes levels by up to 4 feet during some of the lakes driest periods of the last 20 years. That drop has affected recreational use of the lake, forcing the closing of beaches and extension of boat docks.\nBarb Naramore, assistant DNR commissioner, said the impact on recreation is of concern to the department and is something we do seek to support. We will continue working with permit holders to evaluate ways we may be able to address it.\nBut it isnt a threat to the lakes ecological health or its future as a water supply, she said.\nThe DNR said the study shows that the well permits it issued have met the states four standards of sustainability: That the maximum permitted groundwater use in White Bear Lake not jeopardize future groundwater supply, harm the ecosystem, degrade the quality of water or lower groundwater levels beyond the reach of public water supplies or private wells.\nGreg McNeely, chairman of the restoration association whose suit against the DNR resulted in the judges order, said the studys sustainability conclusions are a continuation of the DNRs same arguments that were rejected in court.\nThe studies and evidence brought forward by experts, including the [U.S. Geological Survey], were overwhelming, McNeely said. The lake is not sustainable.\nAppeal decision expected\nWater levels in White Bear Lake have been crawling back toward normal over the past five years, thanks in part to record rainfall. The lake this year has hovered around 924 feet above sea level, about five feet higher than the low point of just under 919 feet in 2013.\nThe lake is shallow enough around the shoreline that a drop of a few feet in the water level causes the waterline to recede at some points more than 100 feet from shore, leaving behind a layer of muck and making much of the lake unusable for swimmers, anglers and boaters.\nAfter a sustained down period turned the lake into a virtual mudpit in 2013, homeowners sued the DNR claiming that it had failed to take care of the lake. District Judge Margaret Marrinan ruled in favor of the homeowners in 2017, saying the DNR had mismanaged the lake for more than a decade.\nThe judge ordered the DNR to study all the well permits it had issued within five miles of the lake and to require nearby cities and water districts, which serve about 500,000 customers, to shift from groundwater as the source of their water supply to the Mississippi River or other surface water.\nMarrinans order also required permitted water users within five miles of White Bear Lakes shoreline to impose residential irrigation bans if the lakes level fell below below 923.5 feet above sea level. The lakes long-term median level is 923.3 feet, according to the study.\nThe judges order covered a number of private wells used for golf course and agricultural irrigation and food processing, among other things.\nState lawmakers stepped in to postpone the rulings effective date until July 2019. The DNR has appealed the ruling and expects a decision by spring, but in the meantime chose to complete the well study.\nThe DNR believes a residential irrigation ban would affect lake levels by only a few inches over a period of 10 years. Thats largely because the neighborhoods and cities closest to White Bear Lake, which have the greatest effect on water levels, dont irrigate as much as those farther away, Naramore said.\nWithout an irrigation ban, Naramore said, the DNR will work with cities to explore other options for conservation or to supplement their water supply with other sources when the lake drops again.\nNearly a quarter of the water used by Twin Cities residents is spent outdoors, largely for irrigation, according to the Metropolitan Council.\nThe data is completely consistent with our analysis and legal interpretations throughout the trial, Naramore said. This [study] will be an incredibly valuable tool for us. Its something we said during the trial that we needed.\nJim Markoe, president of the White Bear Lake Homeowners Association, was skeptical. Trees have taken root in the lake where once there was navigable water, he said.\nIt seems to me that the DNR is fully acknowledging that the lake went down as much as it did because of how much water is being pumped, Markoe said. Between 2003 and 2013 we only had one statistically dry year. So when rainfall is average, the water level is down 4 feet.\nGreg Stanley 612-673-4882", "url": "https://apnews.com/7ac5407ce2a44d40b649ee3ed7b4fd69"}