{"authors": ["Steve Terrell", "The New Mexican"], "date_download": "2020-05-04 20:28:00", "date_modify": "2020-05-04 20:28:00", "date_publish": "2018-03-03 05:12:00", "description": "People buying toys, games, furniture, musical instruments and other items at small businesses in New Mexico the Saturday after Thanksgiving won’t have to pay state gross receipts taxes, thanks to...", "filename": "_a067ba24bb0f430ca8296ef1eb6a1c0f_1588624080.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a067ba24bb0f430ca8296ef1eb6a1c0f_1588624080.html", "title": "Governor signs off on post-Thanksgiving tax holiday", "title_page": "Governor signs off on post-Thanksgiving tax holiday", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People buying toys, games, furniture, musical instruments and other items at small businesses in New Mexico the Saturday after Thanksgiving won’t have to pay state gross receipts taxes, thanks to a bill signed into law Friday by Gov. Susana Martinez.\nMartinez signed House Bill 79, which provides for a small-business tax holiday on one of the busiest retail shopping days of the year.\nThe bill’s sponsor, Rep. Doreen Gallegos, D-Las Cruces, praised Martinez for signing it. “Creating incentives for consumers to shop at small businesses in our state is an important step toward promoting economic security in our communities and ensuring small businesses can thrive,” Gallegos said.\nMartinez said in a news release that while she’s disappointed the Legislature didn’t tackle comprehensive tax reform during this year’s session, “this legislation has the potential to put millions of dollars back into the pockets of our families and small businesses.”\nSmall retail businesses in the state with no more than 10 employees will be allowed to participate in the new tax holiday. Franchise businesses, even ones with 10 employees or less, would be excluded, however.\nGross receipts taxes vary in cities and counties around the state. Within the Santa Fe city limits, it’s 8.4375 percent.\nThe bill squeaked by the Senate on a 21-20 vote. Some of the most liberal senators joined with some of the most conservative members in opposing it.\nThe House passed it by a wider margin, 43-20. All but three of the House opponents were Republicans.\nA fiscal impact report on the bill by the Legislative Finance Committee estimated the bill would cost the state about $1.7 million this year and gradually increase over time. The bill also will reduce local government revenues by about $1.2 million annually, the report says.\nThe report also notes that HB 79 fails to meet all five of the Legislative Finance Committee’s tax policy principles.\nThose principles, as stated in the report, are:\n• Adequacy: Revenue should be adequate to fund needed government services.\n• Efficiency: The tax base should be as broad as possible and avoid excess reliance on one tax.\n• Equity: Different taxpayers should be treated fairly.\n• Simplicity: Collection should be simple and easily understood.\n• Accountability: Preferences should be easy to monitor and evaluate\nEligible purchases for the deduction include a range of items, such as jewelry, sporting goods, gardening and automotive tools, cookware and electronics.\nThe state has another annual tax holiday, a three-day back-to-school program in August. Retailers of all sizes can participate in that, but the type of items that may be purchased tax-free are limited to clothing, shoes, school supplies and computer equipment.\nOther bills the governor signed Friday include:\n• Senate Bill 217, sponsored by Sen. Cliff Pirtle, R-Roswell, which will require licensing of pecan buyers. The bill is an attempt to protect the $200 million-a-year pecan industry in the state by reducing the theft of pecans and the spread of the pecan weevil.\n• HB 49, sponsored by Rep. Dennis Roch, R-Logan, which makes clear that any municipality with a commission-manager government is subject to a recall election for malfeasance or misfeasance in office, or a violation of the oath of office. Prior to the circulation of a recall petition, a determination of probable cause has to be made by a state District Court.\n• HB 88, sponsored by Rep. Kelly Fajardo, R-Los Lunas, which establishes new procedures to deal with the inventory of unsold property with delinquent taxes.", "url": "https://apnews.com/a067ba24bb0f430ca8296ef1eb6a1c0f"}