{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:09:50", "date_modify": "2020-05-04 20:09:50", "date_publish": "2018-07-25 13:41:00", "description": "Genevieve M. \"Gen\" Miller, 99, of Dalton/Markesan, passed away Monday, July 23, 2018, at The Barrett House in Markesan. She was born Nov. 10, 1918, in the town of Kingston, to Earl and...", "filename": "_cbfea83406944fc3a2de4666b1847c06_1588622990.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cbfea83406944fc3a2de4666b1847c06_1588622990.html", "title": "Genevieve M. \"Gen\" Miller, 99, Dalton/Markesan", "title_page": "Genevieve M. \"Gen\" Miller, 99, Dalton/Markesan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Genevieve M. “Gen” Miller, 99, of Dalton/Markesan, passed away Monday, July 23, 2018, at The Barrett House in Markesan.\nShe was born Nov. 10, 1918, in the town of Kingston, to Earl and Rosella (Baillies) Dalton. After graduation from high school in 1936, Genevieve graduated from County Normal Teachers College in Green Lake, and continued her education at the University of Wisconsin-Oshkosh where she earned a B.S. degree in 1959. Her first teaching position was at Bell Fountain School in the town of Scott in 1939. She taught 5th through 8th grades in Dalton, and 4th through 6th grades in Markesan for 17 years. Gen was a member of the Green Lake Area Educators Association and was an active member of the Kingston Historical Society. She loved to work in her garden and enjoyed playing a round of golf. Gen was an avid Badgers football and basketball fan and attended many games. She was an active member of the First Congregational Church of Dalton.\nSurvivors include a nephew, Gary (Susan) Dalton of Georgia; two nieces, Debbie (Donald) Mitchell of Alabama and Vicki Bauer of Coon Rapids Minnesota; special nephews, Dale Bauer and Donald Vick; nephews, Jonathan Kutzke of Wisconsin, Joel (Dianne) Kutzke of Washington, James Kutzke of Wisconsin, Jerold (Lisa) Kutzke of Washington, Jason (Kimberly) Kutzke of Washington; great-nieces and great-nephews, Robert (Shari) Vick of Oklahoma, Randy (Ginny) Vick, Robin Vick and Ryan Vick, all of Wisconsin, Dawn (Ken) Wermuth of Texas, Trina (Eric) Hutchison of Georgia, Jason Larrabee, Lisa Larrabee and Sean Larrabee, all of Georgia, Nic Bauer and Shelby Bauer, both of Wisconsin; great-great-grandnieces and great-great-grandnephews; and other relatives. She was preceded in death by her parents; husband, Norm; brother and sister-in-law, Robert and Betty Dalton; niece, Florence Vick; and two great-nephews, Tom Dalton and Brian Vick.\nFuneral services will be at 2 p.m., with visitation beginning at 11 a.m., on Saturday, July 28, at First Congregational Church in Dalton. The Rev. Brenda Grams will officiate. Interment will be in Greenwood Cemetery, Dalton. Memorials may be directed to the Kingston Historical Society or First Congregational Church of Dalton.\nJensen Funeral and Cremation, Columbus (jensenfuneralandcremation.com).", "url": "https://apnews.com/cbfea83406944fc3a2de4666b1847c06"}