{"authors": ["Bill Bengtson Bbengtson Aikenstandard.Com"], "date_download": "2020-05-04 20:18:51", "date_modify": "2020-05-04 20:18:51", "date_publish": "2018-03-11 02:15:00", "description": "The past two weeks around Edgefield and Saluda counties have seen the annual resurgence of pink and purple shades on thousands of acres, with peach trees going into bloom, and the next couple of...", "filename": "_51f5f53777304de9a16700f57802eef7_1588623531.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_51f5f53777304de9a16700f57802eef7_1588623531.html", "title": "Bitter or sweet? Assessing peach outlook", "title_page": "Bitter or sweet? Assessing peach outlook", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The past two weeks around Edgefield and Saluda counties have seen the annual resurgence of pink and purple shades on thousands of acres, with peach trees going into bloom, and the next couple of weeks could have a tremendous impact on this year’s peach prospects, according to some authorities.\n“We are a little bit early, and … we’ve still got a long way to go, but we are anticipating everything being OK,” said Chris Yonce, with Johnston-based J.W. Yonce and Sons, an operation with about 3,700 acres of peaches. Yonce said the stretch from 2017 to now represented “a good winter.”\n“We are a lot better off than the past two years,” he said. “The peaches require a certain amount of cold hours – dormancy – so they got the required amount, so they’re ready to go, as you can see by the early bloom.”\nGreg Henderson, a commercial horticulture agent with Clemson University Extension Service, confirmed that the Wednesday-Thursday overnight hours included some tension and “28 degrees can be kind of dicey.”\nHe added, “We got down near some critical temperatures last night … I’d say we’re three weeks ahead of normal, probably ahead of last year, based on the fact that everything seemed to bloom at a normal pace, where last year we were strung out because we did not get enough cold weather.”\nThe 2017 crop in South Carolina was a disaster, as a hard freeze in the second week of March slapped back fruit that had already begun to emerge. Yonce said 2015 may have been the most recent year that was reasonably good for local growers.\nSouth Carolina’s growers, in an average year, ship about 2,600 loads (40,000 pounds of peaches) – a number that “does not figure in baskets and locally sold fruit,” according to Matt Cornwell, a marketing specialist with the South Carolina Department of Agriculture.\nEdgefield County is the leader, with more than 6,600 acres in peach production. Next, in order, are Saluda and Aiken counties.\n“We had a really good winter, and any time you have a good winter, that makes a good crop,” said Jason Rodgers, vice president of operations for Titan Farms, the largest peach producer in the eastern United States. Titan is based in Ridge Spring and has peach acreage in Edgefield, Saluda, Aiken, Orangeburg and Berkeley counties.\n“We’re excited. We’ve already bloomed a little bit, so we’re almost in full bloom, so barring any major cold events, we’re going to be fine,” Rodgers said.\nTitan has 6,400 acres dedicated to peach production, and 5,000 of them will be harvested this season, he added.\n“We’re in the process of letting the blooms do their thing. In the next two weeks, we’ll have baby peaches on the trees. Spring will be here, and we’ll be having peaches in early May, so we’re excited. We’re glad we’ve got good peaches to offer.” Rodgers, like Yonce, recalled 2015 as being the most recent year with a relatively strong peach crop. Henderson, with regard to 2018, said, “It’s just too early to tell. It was cold last night … We really need some time and warm weather to see what’s going to happen. The flowers are beautiful. If we can sell that, we’d be millionaires already. We’re on track to have a normal crop this year, as compared to last year, when we were all messed up. We’ve just got to get through the next few weeks.” Cornwell said South Carolina probably has about 13,000 total acres in peach production, and he estimated the crop’s value at $65 million, plus $35 million for allied industry. “We had a great winter and got all the chill hours we needed. If we clear any weather issues from now on we’re looking at a very early season with some growers picking as early as the end of April,” he added.\n“It’s our critical time,” Yonce said. “Normally if you make it through Easter, you make it through your critical time, which is your cold weather. Then, it’s on to the next weather problems, which could be hailstorms or that type of thing … but normally, if you make it through Easter … you’ve made it through the woods.”\n“We’re optimistic,” Henderson commented.\nCalifornia dominates among peach-producing states, and South Carolina is second. Georgia is third, and other major producers include New Jersey, Pennsylvania and Michigan.", "url": "https://apnews.com/51f5f53777304de9a16700f57802eef7"}