{"authors": ["Shay Castle Staff Writer"], "date_download": "2020-05-04 20:08:03", "date_modify": "2020-05-04 20:08:03", "date_publish": "2018-04-26 23:01:59", "description": "Plans by Denver-based Crestone Peak Resources to drill for oil and gas in Boulder County have been delayed yet again, this time by a change in the definition of what land is at risk for...", "filename": "_b8fc0bf7d61c4f4b93f90f584d63bdd2_1588622883.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b8fc0bf7d61c4f4b93f90f584d63bdd2_1588622883.html", "title": "Flood Concerns Delay Crestone's Boulder County Oil, Gas Drilling Plans", "title_page": "Flood Concerns Delay Crestone's Boulder County Oil, Gas Drilling Plans", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Plans by Denver-based Crestone Peak Resources to drill for oil and gas in Boulder County have been delayed yet again, this time by a change in the definition of what land is at risk for flooding.\nIt is the third such delay of Crestone’s Comprehensive Drilling Plan (CDP) on 10 square miles between Longmont and Lafayette.\nThe Colorado Oil and Gas Conservation Commission (COGCC) on Wednesday posted an update to its site that it was extending the timeline for Crestone to submit its fourth draft, originally due on April 30. A new date was not specified; “a new timeline and additional details will be posted shortly,” the update read.\nSpeaking for the COGCC, Todd Hartman said, “COGCC wants to see the best possible surface locations included in the CDP, so the agency agrees that it is wise to delay further submittals until we can fully evaluate the impact of the new floodplain classification.”\nAdditional time will allow Crestone to “conduct a further evaluation of the location proposed in Section 1” of the proposed development area.\nThe wellpad on Section 1, situated on an area referred to as Wheeler Open Space, also sits within a designated 100-year floodplain. The southeast corner of the potentially 56-well site overlaps a floodway.\nA floodway is a narrow channel where, in the event of a flood, water will be flowing. A floodplain is where shallow water is likely to be during the event of a flood, though shallower and flowing at a lower volume, if at all, than water in a floodway.\nThe Colorado Water Conservation Board (CWCB) in 2015 changed the definition of a floodway, triggering a review of flood-hazard areas across the state. Wheeler Open Space, however, was not reassessed, given the lack of residential buildings on the land, according to Boulder County Senior Assistant Attorney Kate Burke.\nIn light of the planned oil and gas development on the site, a modeling with the new standards was performed. Under the new guidelines, the entirety of Section 1 is within a floodway, according to documents Boulder County submitted with its formal comments to the COGCC in mid-April.\n“The floodway issue is critically important to the County because of the public health and safety risks that stem from development in the floodway,” the county said in its comments, noting that during the 2013 floods, an existing well was “notably damaged” by water.\nThe county also argued in its comments that a fifth draft was necessitated by this new information. Jason Oates, a spokesperson for Crestone, said any changes would be made within the current draft.\nOptions for relocation are limited, he said, due to a bevy of other conflicts, including nearby bald eagle habitats and the proximity to residences. In its last draft, Crestone relocated a wellpad further away from homes, to the north side of Colo. 52.\nOates said there was no more information to share at the current time. The company will continue to work with the COGCC and relevant water authorities, which could include the CWCB and FEMA, and a hearing on the CDP could take place in September. It was originally, though tentatively, scheduled for July 30.\nShay Castle: 303-473-1626, castles@dailycamera.com or twitter.com/shayshinecastle", "url": "https://apnews.com/b8fc0bf7d61c4f4b93f90f584d63bdd2"}