{"authors": ["Chris Klingenberg"], "date_download": "2020-05-04 20:09:43", "date_modify": "2020-05-04 20:09:43", "date_publish": "2018-11-05 11:33:38", "description": "BOLTON -- Another classic game is in the books between a pair of gridiron rivals. Division 4 Central football Earlier in the year, the Nashoba Regional football team held off a late...", "filename": "_00b24be01f514090b3ede23b5d9c649c_1588622983.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_00b24be01f514090b3ede23b5d9c649c_1588622983.html", "title": "Nashoba Survives Another Classic", "title_page": "Nashoba Survives Another Classic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BOLTON -- Another classic game is in the books between a pair of gridiron rivals.\nDivision 4 Central football\nEarlier in the year, the Nashoba Regional football team held off a late rally by the visiting Marlboro Panthers to hold on for a 16-13 victory.\nSo when the two teams got together on Saturday night in the Central Mass. Division 4 semifinals, you had to expect it to be another nail-biter until the very end.\nAnd that is exactly what fans were treated to as the top-seeded Chieftains again held off the fourth-seeded Panthers late in the fourth quarter to advance to the sectional semifinals with another 16-13 victory over Marlboro.\n“It’s like this every time we play,” said Nashoba head coach Jamie Tucker, whose team will face third-seeded Tantasqua in the sectional final next weekend. “It is just a great rivalry, and this was another crazy game. I am just really proud of our guys again tonight.”\nAfter Marlboro’s Brandon Cavicchio blocked a punt to give his team the ball at the Nashoba 45-yard line, the visitors had a minute to either get into range for a game-tying field goal or punch in the winning touchdown. But the Panthers -- primarily a running team -- saw their last two throws come up short of the end zone, sending the Nashoba faithful into frenzy.\nNeither team was able to get on the board in the opening quarter. Nashoba struck first with 4:47 left in the half when Alex Childs booted through a 29-yard field goal attempt. The Panthers responded with 1:07 left in the half when Cavicchio scored on a 7-yard touchdown run. The extra point was no good and the Chieftains held a 6-3 lead.\nSam Bolinsky wasted little time responding as he threw a screen pass to Danny McNulty, who raced 40 yards for a touchdown just 23 seconds after the Marlboro score. The extra-point attempt by Childs was no good as the Chieftains held a 9-6 halftime lead.\n“Danny (McNulty) had some big plays for us,” Tucker said. “He is a good player. We have four or five different guys who I have no problem giving the ball to. I think we have a versatile group.”\nNashoba extended its lead to 16-6 when Bolinsky threw a missile to John Foney for a 22-yard touchdown on fourth-and-12. Childs booted through the extra point.", "url": "https://apnews.com/00b24be01f514090b3ede23b5d9c649c"}