{"authors": ["Brandpoint", "Bpt"], "date_download": "2020-05-04 20:06:52", "date_modify": "2020-05-04 20:06:52", "date_publish": "2018-01-04 18:01:01", "description": "(BPT) - We wait all year for activities that come along with winter, like sipping hot cocoa by the fire or staying in to snuggle up under cozy blankets while re-watching our favorite...", "filename": "_8cffa12c35ab44ce9794ca7c9d6f706b_1588622812.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8cffa12c35ab44ce9794ca7c9d6f706b_1588622812.html", "title": "The truth about what makes your skin dry and itchy in the winter", "title_page": "The truth about what makes your skin dry and itchy in the winter", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The truth about what makes your skin dry and itchy in the winter\n(BPT) - We wait all year for activities that come along with winter, like sipping hot cocoa by the fire or staying in to snuggle up under cozy blankets while re-watching our favorite movies.\nThe winter season also brings some less-than-desirable side effects, though. An all-too-common winter woe is dry, flaky skin that can feel itchy, tight or painful.\nIn fact, a recent survey conducted online by Harris Poll on behalf of CeraVe among more than 2,000 U.S. adults revealed that 55 percent of Americans feel having dry skin in the winter and having chapped lips are among the things they dislike most. Moreover, 57 percent of Americans said having healthy skin is more important than staying up-to-date on social media, 23 percent would move to another climate if it promised healthier skin and 18 percent would give up their favorite food for the duration of winter if it meant not having dry skin for the season.\nThe good news is that none of those trade-offs are necessary, because treating and preventing this wintertime discomfort can be helped with a simple change, says Dr. Michelle Henry, a board-certified dermatologist and cosmetic surgeon based in New York City.\n“In the winter, the conditions are much harsher on the skin, which means your skin has different needs,” Henry says. “So when the seasons change, that just means it’s time to switch up your skincare routine, just like you change the way you dress and how you spend time outdoors.”\nHenry shares some of the common causes of dry winter skin, along with her expert tips for cold-weather skincare so you can start feeling better all over.\n1. Dry air is everywhere\nYou may think that the outside air is to blame for your dry skin. While this may hold some truth, heated indoor air also has very little humidity. When you spend your life basking in this dry environment, your skin eventually pays the price.\n“During the winter months, the skin contains more moisture than the air,” Henry says. “What happens is the dry environment leeches the moisture from the skin, leaving it looking and feeling dry and dull.”\nMoisture loss, dryness and cracking comes as a result of damage to the skin barrier. To replenish your taxed skin, slather on a rich emollient that contains ceramides daily. Ceramides are like the mortar that holds the bricks of your skin together and are essential to healthy skin. For on-the-go relief, tote along small containers of moisturizer wherever you go.\n2. Too much (or not enough) exfoliation\nMake no mistake, exfoliation is important to year-round skincare, but adding it in the winter is essential. This process clears away dead skin cells and product residue, letting your winter moisturizers penetrate the skin and work more effectively, Henry says. Steer clear of products with beads and grains that strip and irritate the skin, especially in the winter. Instead, choose formulas designed to be gentle on sensitive complexions.\n3. Too many long, hot showers\nOn a cold winter morning, a long shower that really steams up the mirror is relaxing and feels great. However, Dr. Henry says these long sessions are drying for the skin (and don’t get you any cleaner).\n“I recommend that my patients keep showers under 10 minutes in lukewarm water,” Henry says.\nAfterwards, she says, pat yourself with a towel so some moisture is left behind on the skin, and then seal it in by applying lotion all over.\n4. Excessive hand washing\nHands can take a beating during the winter months. With germs running rampant all season, hand -washing is important to stay healthy, but those who wash their hands frequently tend to suffer more from dry skin, she says. Give hands some extra TLC this time of year. After washing, always apply a thick lotion to protect against and heal dry, cracked hands. Henry recommends CeraVe Healing Ointment , a gentle formula that contains three essential ceramides to provide intense, long-lasting moisturization, while soothing dry, chapped skin.\n5. Your products are too harsh\nYour winter skin care regimen should be different from your summer routine. Many summertime products are designed to remove dirt, oil and sweat, but when it gets colder and dryer, these products may become drying and irritating. Henry recommends switching your facial cleanser or body wash from a foam or gel to a cream-based moisturizing formula.\nFor more ideas on how to get soothing relief and protection for your sensitive winter skin, visit cerave.com .", "url": "https://apnews.com/8cffa12c35ab44ce9794ca7c9d6f706b"}