{"authors": ["Elliott Lapin"], "date_download": "2020-05-04 20:06:31", "date_modify": "2020-05-04 20:06:31", "date_publish": "2018-10-10 05:00:00", "description": "When the Crosby and the Port Neches-Groves met on November 17, 2017 in the first round of the 2017 5A Division II football playoffs the game came down to the last minute. Then junior PNG...", "filename": "_451f4689cb704bfb976c9540c2d25c4c_1588622791.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_451f4689cb704bfb976c9540c2d25c4c_1588622791.html", "title": "Rematch: Crosby gets another shot at Port Neches-Groves after last year’s epic playoff game", "title_page": "Rematch: Crosby gets another shot at Port Neches-Groves after last year’s epic playoff game", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When the Crosby and the Port Neches-Groves met on November 17, 2017 in the first round of the 2017 5A Division II football playoffs the game came down to the last minute.\nThen junior PNG quarterback Roschon Johnson scored the game-winning touchdown on a two-yard run with 25 seconds left to give the Indians a 72-69 victory.\nThe two schools were placed in the same district after district realignment for the 2018-2019 and 2019-2020 school years, and the two football teams will meet up again on Friday, Oct. 12 at Cougar Stadium in Crosby for a 7:30 P.M. kickoff.\nDuring the summer, Crosby coach Jeff Riordan admitted to occasionally playing the PNG fight song in the weight room during spring workouts.\n“That game left a bad taste in our mouth,” Riordan said. “It definitely motivated us through the offseason. “When that fight song came on, you could see it in their eyes. Our expectation here in Crosby and the standard we set is extremely high, and a first round exit is not our standard.”\nBoth teams come into the game 2-0 in district play (Crosby is 5-0 overall, and PNG is 3-2 overall).\nCrosby is averaging 42 points per game and giving up 32 points per game while PNG is averaging 34 points per game and giving up 27 per game in 2018.\nTheir only common opponent is Vidor, whom both teams beat by six points.\nJohnson, a four-star University of Texas commit and last year’s District 22-5A MVP, threw for 326 yards and ran for 272 in the Indians’ 2017 playoff win over the Cougars, accounting for ten touchdowns.\nHe played a limited amount of snaps after spraining his ankle in the Indians’ loss against Huntsville on Sept. 7, but he returned for the 38-32 win over Vidor on Oct. 5 where he threw for 196 yards and a touchdown and ran for 112 yards and four touchdowns, including the game winning three-yard touchdown run with 1:28 left in the contest.\nCrosby comes into the game averaging 270 rushing yards per game. It’s leading rusher, senior Zach Simon, has rushed for over 100 yards in each of the Cougars’ first five games and has 634 rushing yards and five rushing touchdowns on the season.\n“Every week we try to go 1-0; it’s no different here,” Riordan said after Crosby’s 56-41 victory over Dayton on Oct. 5. “PNG beat us last year, and they are loaded and well-coached. If we don’t right some wrongs, they can blow us out. But if we fix some of the stuff we need fixed, we will be in the game.”\nelliott.lapin@hearst.com", "url": "https://apnews.com/451f4689cb704bfb976c9540c2d25c4c"}