{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:12:44", "date_modify": "2020-05-04 20:12:44", "date_publish": "2018-02-28 17:09:00", "description": "Unethical and immoral behaviors abound in our society and throughout organizations. Every day we are inundated with unseemly, unethical and even illegal behavior as reported in the media. How then...", "filename": "_cfc718dc53f44f1fb5e2bba52f2747fa_1588623164.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cfc718dc53f44f1fb5e2bba52f2747fa_1588623164.html", "title": "Main Street: How to build ethical behavior into organizations", "title_page": "Main Street: How to build ethical behavior into organizations", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Unethical and immoral behaviors abound in our society and throughout organizations. Every day we are inundated with unseemly, unethical and even illegal behavior as reported in the media. How then do we implement ethical behavior in the organization, and, more importantly, into our everyday decision-making processes?\nIllustrating moral decision-making, Dr. Albert Einstein said, “The most important human endeavor is the striving for morality in our actions. Our inner balance and even our very existence depend on it. Only morality in our actions can give beauty and dignity to life.”\nBuilding upon the need for implementing moral and ethical behavior into the organization, as well as our personal lives, and interesting article was written by Kathleen Vangronsvelt and Koen Marichal, “Facing Moral Dilemmas.” I will highlight their salient points and then make my comments in parentheses on how to add this to your leadership domain.\n1. What’s the point of ethics in the workplace: Business ethics is beneficial for organizations as it has a positive impact on 6 different determinants of competitiveness: cost structure, human resources, customers, innovation capacity, risk en reputation management and financial performance. (Understanding that ethics is doing the right things for the right reasons, allows the leader to pursue the six different determinants to propel the organization in the right direction. Ethical behavior always has a cost in the short-run, but in the long-run it sustains the organization.)\n2. The art of ethical decision making: Ethicist use the term “moral” categorically, to describe a particular type of decision. Components of ethical decision-making include: recognizing the moral issue; making a moral judgment; establishing moral intent; and engaging in moral behavior. (Moral decision-making and moral reasoning are predicated on moral justification, displacement of responsibility, and distortion of consequences. In other words, psychologically we can justify any decision by relativism – what is right for me, rather than what is right for others.)\n3. Where does it go wrong: Utilizing Kohlberg’s Theory of Cognitive Moral Development there are three stages where ethical behavior or moral reasoning can go awry: self- interest and avoiding punishment; policies and rules; and sophisticated reasoning. As Vangronsvelt and Marichal argue, not surprisingly, people who easily manipulate others for personal gain (Machiavellianism) and those who don’t see the connection between their actions and outcomes (locus of control), or believe that ethical choices are driven by circumstance (relativism), are more likely to engage in unethical choices. (Therefore, understanding the reasoning for your behavior and thinking out the consequences of short-term gains versus long-term consequences.)\nConsequently, Vangronsvelt and Marichal articulated that we need to reinforce as a culture, one which clearly communicates the range of acceptable behavior (by role-modeling, rewards, systems, a code of conduct, informal norms) leads to fewer unethical decisions. The mere existence of a code of conduct has no effect on ethical decision making when enforced, however the influence is powerful.\nGoal setting, although often used by organizations to translate and communicate the desired direction, can encourage unethical behavior. Especially when goals are imposed, nearly-met or performance-based, people are more likely to cheat.\nAdditionally, “Aligning self-interest to social responsibility is the most powerful way to sustaining a company’s success,” says Starbucks’ CEO Orin Smith. A larger notion of responsibility is moving to the center of business leadership in the 21st Century. We’re moving away from the Milton Friedman adagio “live up to the law and maximize shareholder wealth.”\nBut to the degree of insulating ethical behavior, we need to reestablish our vision, purpose, mission and intent of why we exist. We exist to serve others. The rallying cry must be, “We serve others honestly and ethically and we do not take short-cuts. Our purpose is to serve others with character (what we do when no one else is looking) and with integrity (consistent character).\nConsequently, Vangronsvelt and Marichal assert, “Ethical decision-making can be improved in a rational and formal way e.g. assess, attract and develop moral reasoning competencies, enforcing an ethical code of conduct, installing moral decision making tools and procedures. This helps to counter less-conscious social and cognitive processes that make people blind and numb for the ethical consequences of their choices and behavior.\nBut because ethical decision making is also an emotional and intuitive process, organizational ethical progress will also depend on empowerment and viral change.”\nAs further illustrated and stated by Albert Camus, French author, philosopher and journalist, “A man without ethics is a wild beast loosed upon this world.”\nIf we truly wish to become more ethical and improve our moral reasoning, we need to endeavor to understand the rules that govern our behavior and attitudes in a civil society. Practicing the notion that being ethical is doing the right things for the right reasons, we would be wise to heed Vangronsvelt and Marichal words of wisdom.", "url": "https://apnews.com/cfc718dc53f44f1fb5e2bba52f2747fa"}