{"authors": ["Lisa Green"], "date_download": "2020-05-04 20:14:57", "date_modify": "2020-05-04 20:14:57", "date_publish": "2018-06-29 05:00:01", "description": "Temperatures projected to reach the low-to-mid 90s the next three days prompted several advisories Thursday.  The one from OSHA said the message is simple: Water. Rest. Shade. Heat...", "filename": "_3cb7fa859311427385a0660a1f394b19_1588623297.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3cb7fa859311427385a0660a1f394b19_1588623297.html", "title": "Heat going up: Take precautions", "title_page": "Heat going up: Take precautions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Temperatures projected to reach the low-to-mid 90s the next three days prompted several advisories Thursday.\nThe one from OSHA said the message is simple: Water. Rest. Shade.\nHeat advisories for the Midwest this week may cause potentially dangerous work conditions, the Occupational Safety and Health division of the U.S. Department of Labor said in a news release. That is especially true for those working outside and in hot interior spaces.\n“On hot days, the agency recommends frequent breaks in a cool or shady environment, and drinking water every 15 minutes,” the news release said. “OSHA also urges employers to allow new workers to acclimate and build up resistance to the increased temperatures. Full acclimatization may take up to 14 days depending on individual risk factors such as medication use or preexisting medical conditions.”\nOSHA said a recent study of heat-related workplace fatalities found that most occurred during the worker’s first week on the job.\nThe Indiana Department of Environmental Management designated today an “Air Quality Action Day,” forecasting high ozone levels for Allen and Huntington counties in northeast Indiana.\nOther areas affected include Lake and Elkhart counties and in north central Indiana, Marion, Boone, Hamilton, Hendricks and Madison counties.\nIDEM said residents can help reduce ozone by carpooling or using public transportation, avoid using drive-thrus and combining errands into one trip.\nIt’s best to wait until after 7 p.m. to put fuel in your vehicle or use gasoline-powered lawn equipment.\nAt homes and businesses, people can conserve energy by turning off lights or setting the air conditioner to 75 degrees or above.\nFor those without air, the city of Fort Wayne announced the lobby of the Foellinger-Freimann Botanical Conservatory, 1100 S. Calhoun St., will serve as an additional cooling station. It will be available from 10 a.m. to 5 p.m. today and Saturday and from noon to 4 p.m. Sunday.\nThe Rescue Mission, which is also downtown, is the primary cooling station location in Fort Wayne. The Rescue Mission opens as a cooling station for men, women and families when temperatures reach 80 degrees. Hours are 7 a.m. to 6 p.m.\nEven pets will need a reprieve from the heat.\n“Unlike humans, dogs can sweat only through their footpads and cool themselves by panting, so even brief sun exposure can have life-threatening consequences,” the organization PETA said in a news release.\nTaking a run with a pet is a bad idea. When outdoor temperatures reach the 80s, asphalt temperatures can climb to 140 degrees, causing pain, burns and permanent damage to dogs’ paws “after just a few minutes of contact.”\nAnd leaving animals in a car could cause heatstroke within minutes : even if the car is in the shade and the windows are slightly open, PETA said. The organization noted the same concerns and care be taken for children.\nlisagreen@jg.net", "url": "https://apnews.com/3cb7fa859311427385a0660a1f394b19"}