{"authors": ["Times-Tribune Readers"], "date_download": "2020-05-04 20:20:08", "date_modify": "2020-05-04 20:20:08", "date_publish": "2018-01-18 00:00:00", "description": "Verdict still out Editor: What I thought about privately for months may have happened. The most stunned person after the 2016 presidential election might have been Donald J. Trump. Now...", "filename": "_63daa2b3f0524552a7dea3adbded91b6_1588623608.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_63daa2b3f0524552a7dea3adbded91b6_1588623608.html", "title": "Letters To The Editor 1/18/2018", "title_page": "Letters To The Editor 1/18/2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Verdict still out\nEditor: What I thought about privately for months may have happened. The most stunned person after the 2016 presidential election might have been Donald J. Trump.\nNow that Trump has the job, he does it his way. Unlike other CEOs, he never had to answer to a board of directors, other senior executives who dared to disagree, or arguably empowered constituencies. He enlisted attorneys to tidy up or sue when things went awry.\nThere is also a bottom line that business leaders accommodate. But without knowing more about Trump’s stewardship — including finances, taxes owed and paid and bankruptcies endured and ended with bailout benefactors, informed judgments are elusive.\nWhat Trump said, needed and ordered in business was what mattered. The problem is, the presidency doesn’t work that way. There are the Constitution, Congress, we the people and world leaders who may agree with or reject what he says via tweet or taunt.\nThere is also idealism and trust that a person elected president, by judgment informed by history and by intellect, grace and example, will represent what America stands for at home and beyond.\nWhen he became president, I hoped Trump would succeed for the country’s sake and not make a mess of things. The verdict is still out a year later.\nHERB LINNEN\nWASHINGTON, D.C.\nLeaker at fault\nEditor: Words that President Trump uttered at the meeting on immigration reform with a bipartisan group of Republicans and Democrats were inexcusable. He should apologize.\nMuch more inexcusable, however, was that the remarks were leaked to the press.\nWhoever leaked the remarks knew that they would prove incendiary — and seriously damage the negotiation process. This was a private, behind-closed-door meeting.\nThere was no cause for the president’s remarks to be released to the press — that is, unless the individual had an agenda that he believed was far more important than immigration reform and protecting our borders — namely, discrediting the president.\nShame on him for damaging a bipartisan negotiation sorely needed to move our country forward and make America a safer place. Shame on him for placing political gain — his party’s and his own — ahead of the welfare of the American people.\nIf the main goal of the Democrats remains to discredit the president, there will be little accomplished in a nonpartisan effort to solve the problems we face abroad and at home.\nANTHONY BATTAGLIA SR.\nDUNMORE\nUnderclass needed\nEditor: The Center For American Progress circulated a memo recently calling\nthe “Dreamers” a critical component of the Democratic Party’s future electoral success.\nJennifer Palmieri, a former communication director for Hillary Clinton, stated, “The fight is to protect Dreamers is not only a moral imperative, it is also a critical component of the Democratic Party’s future electoral success.”\nThe Democratic Party admits it needs a permanent voting underclass. By admitting it is a moral imperative to survive as a party, border security can not be tolerated.\nI truly find this stunning: Illegal immigrants brought here at a young age called “Dreamers” have become a concern of the party, not American children\nwho are dreamers, too.\nAs the Deferred Action on Childhood Arrivals date comes closer to an end, the coming months will teach us a lot about Democrats. It is time to stop chain migration and secure the border with a physical barrier. This great country paid the price for its open borders; time has come to take care of our own citizens.\nWILLIAM TORBECK\nDUNMORE\nCasinos win again\nEditor: Last spring, the Pennsylvania House passed a bill allowing liquor license holders the opportunity to install up to five video gambling terminals in their places of business. This could have afforded bars, taverns, fraternal clubs and bowling centers an opportunity to add revenue, but instead it was altered to play into the hands of casinos.\nWhen the bill was finalized, the beneficiary was the casino industry. Liquor-licensed locations were denied any benefit from the gambling expansion lawmakers ultimately passed. The commonwealth instead will allow small, satellite casinos to open potentially in every county, which would siphon entertainment dollars away from local, often family-owned businesses.\nThis type of gambling expansion was a grave error. Many Pennsylvania municipalities have opted out of hosting a satellite casino.\nLook at the reality. In 2016, Illinois brought in $300 million for the state from legalized video gambling terminals. This is a significant opportunity for recurring revenue that we have rejected. The reality is, there are thousands of illegal gambling terminals in operation, with no money going to the state or local communities.\nThe issue is not about gambling expansion. It’s about taking responsibility to legalize and regulate an industry that already exists — and to finally make it work for our governments and business owners.\nSmall-business owners and veterans and service organization clubs who will be hurt by satellite casinos must continue to speak up. It’s important to tell lawmakers what it’s really like to be in the trenches, struggling to stay in business and to be further hurt by the commonwealth. For far too long casinos have controlled the rhetoric of gambling expansion. If we let them continue to win, everyone in Pennsylvania will lose.\nAL BLOUGH\nBERKS COUNTY,\nPRESIDENT,\nBOWLING PROPRIETORS’ ASSOCIATION OF PENNSYLVANIA", "url": "https://apnews.com/63daa2b3f0524552a7dea3adbded91b6"}