{"authors": ["Sarah Mcgregor"], "date_download": "2020-05-04 20:17:31", "date_modify": "2020-05-04 20:17:31", "date_publish": "2018-04-16 20:50:02", "description": "China's holdings of Treasuries rose by the most in six months, underscoring the attractiveness of U.S. assets even amid trade tensions between the world's two largest economies. China's...", "filename": "_de4b4a59e8124166a79cc6a43b4cdd55_1588623451.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_de4b4a59e8124166a79cc6a43b4cdd55_1588623451.html", "title": "China boosts Treasuries holdings by most in 6 months", "title_page": "China boosts Treasuries holdings by most in 6 months", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "China’s holdings of Treasuries rose by the most in six months, underscoring the attractiveness of U.S. assets even amid trade tensions between the world’s two largest economies.\nChina’s ownership of U.S. bonds, bills and notes increased by $8.5 billion to $1.18 trillion in February, according to data released by the U.S. Treasury department on Monday. China remained the largest foreign creditor to the U.S., followed by Japan whose holdings dropped to $1.06 trillion, from $1.07 trillion in January.\nSpeculation is growing about whether China could use its vast Treasury holdings as a bargaining chip in a trade dispute with the U.S. While Chinese ambassador to the U.S. Cui Tiankai didn’t rule out the possibility of the Asian nation scaling back Treasury purchases in response to tariffs proposed by the Trump administration in March, some observers have said a wide-scale sell-off is unlikely given that China has few alternatives to invest in.\nStill, China is evaluating the impact of a gradual yuan depreciation as the country’s leaders mull their options in the trade spat with the U.S., according to people familiar with the matter. The world’s two largest economies are threatening to impose tariffs on tens of billions of dollars of goods, fueling worries of a trade war that could roil financial markets.\nPresident Donald Trump weighed into the currency-market debate on Monday, accusing China and Russia of devaluing their currencies. His comments on Twitter contradicted the findings of his Treasury Department, which said in its semi-annual foreign-currency report on Friday that no major trading partners are currency manipulators.\nChina’s stockpile of foreign-exchange dipped in February, marking the first decline in more than a year amid volatility in the global financial markets. The yuan has gained almost 10 percent over the past year as stricter capital controls have kept money from flowing out.\nThe Treasury data released Monday also reflected some of the commotion in the financial markets in February. Net foreign sales of U.S. equities totaled $1.2 billion in February, the first outflows since August and compared with $34.5 billion in purchases in January.", "url": "https://apnews.com/de4b4a59e8124166a79cc6a43b4cdd55"}