{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:26:16", "date_modify": "2020-05-04 20:26:16", "date_publish": "2018-03-06 16:26:00", "description": "Miami Dolphins owner Stephen Ross told the New York Daily News on Monday that his players \" will all be standing \" during the national anthem this season. However, Ross told the South...", "filename": "_a586d233caad42769838ce5fccf56715_1588623976.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a586d233caad42769838ce5fccf56715_1588623976.html", "title": "Miami Dolphins owner clarifies national anthem demonstration stance", "title_page": "Miami Dolphins owner clarifies national anthem demonstration stance", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Miami Dolphins owner Stephen Ross told the New York Daily News on Monday that his players ” will all be standing ” during the national anthem this season.\nHowever, Ross told the South Florida Sun-Sentinel on Tuesday that his message was “misconstrued.”\n“I have no intention of forcing our players to stand during the anthem and I regret that my comments have been misconstrued,” Ross said in a statement to the South Florida Sun Sentinel. “I’ve shared my opinion with all our players: I’m passionate about the cause of social justice and I feel that kneeling is an ineffective tactic that alienates more people than it enlists.\n“I know our players care about the military and law enforcement too because I’ve seen the same players who are fighting for social justice engaging positively with law enforcement and the military. I care passionately that the message of social justice resonates far and wide and I will continue to support and fund efforts for those who fight for equality for all.”\nRoss, who, as the Sun-Sentinel points out, has raised more than $7 million for his RISE (Ross Initiative for Sports Equality) movement and is heavily involved in social activism, issued a statement last September on the heels of president Donald Trump’s tweet storm inciting the anthem controversy.\n“Our country needs unifying leadership right now, not more divisiveness,” Ross said then. “We need to seek to understand each other and have civil discourse instead of condemnation and sound bites. I know our players who knelt for the anthem and these are smart young men of character who want to make our world a better place for everyone.”\nDolphins coach Adam Gase instructed his players to stand for the anthem or remain in the locker room to protest last season. Three players — S Michael Thomas, WR Kenny Stills and TE Julius Thomas — opted to protest peacefully social inequality and police brutality, joining the movement started by former San Francisco 49ers QB Colin Kaepernick in 2016.\nVisit ProFootballWeekly.com | View Latest E-Edition", "url": "https://apnews.com/a586d233caad42769838ce5fccf56715"}