{"authors": ["Dennis Kolar"], "date_download": "2020-05-04 20:25:11", "date_modify": "2020-05-04 20:25:11", "date_publish": "2018-02-06 04:21:25", "description": "There is a piece of legislation weaving its way unnoticed through the Legislature that gives a sweetheart deal to just one company in Michigan to bid on the state's annual $56 million road salt...", "filename": "_8f0fe071b7bf4939a7c4337d2d2bdd8a_1588623911.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8f0fe071b7bf4939a7c4337d2d2bdd8a_1588623911.html", "title": "Column: Salt bill is a sweetheart deal", "title_page": "Column: Salt bill is a sweetheart deal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "There is a piece of legislation weaving its way unnoticed through the Legislature that gives a sweetheart deal to just one company in Michigan to bid on the state’s annual $56 million road salt contract.\nSenate Bill 363 gives a 6 percent special price preference to the Detroit Salt Company, owned by a Canadian manufacturing group, which will result in job losses, strained local budgets, less-safe roads and a more polluted environment.\nNot only does SB363 kill what is now a level playing field in a very competitive bid process — there are currently four qualified companies competing against each other in Michigan — but it also jeopardizes the jobs of the many small businesses who depend on road salt coming from the three other competitive companies into Michigan through ports, docks and trucking companies.\nThis road salt bill should be iced.\nMichigan’s county road commissions, as well as many other local units of government, take advantage of the state’s ability to buy the needed road salt in bulk. This system has worked well.\nBut if we are forced to give Detroit Salt a 6 percent advantage, this year alone it would have cost us $120,000-$140,000 to date. While that may not seem like a significant amount to some, that’s only the beginning. The shipment and transportation of that salt is a significant part of the revenue of hundreds of small businesses across the state.\nBy picking winners and losers, Michigan’s legislature is putting hundreds of Michigan jobs in jeopardy. Some businesses could see up to 50 percent of jobs lost if their work with the other three competitive salt companies goes away.\nAs is always the case with monopolies, SB363 will result in higher prices, which will result in more dangerous roads. Michigan’s local governments and road commissions do excellent work all winter long to stay ahead of icy roadways and keeping the people of Michigan safe. That critical work, as well as their many other endeavors, is because they work hard to control costs. Passage of SB363 will make that impossible.\nWe have enough problems to worry about when it comes to Michigan’s roads, Michigan’s environment and Michigan’s tax rates. We don’t need our legislature to willingly pass an unnecessary bill — a sweetheart deal for one company — that will make our roads less safe, our environment more polluted, and put even more financial strain on the lean budgets of cities, towns and counties.\nWe join the voices of the many member companies of the Michigan Aggregates Association; NFIB — The Voice of Small Business; County Road Association; Michigan Association of Counties; Michigan Municipal League; Saginaw Chamber; Grand Rapids Chamber; and Northern Michigan Chamber Alliance, among others, to telling our elected officials in the House: SB363 is bad for Michigan and should not be passed.\nDennis Kolar is managing director of the Road Commission for Oakland County.", "url": "https://apnews.com/8f0fe071b7bf4939a7c4337d2d2bdd8a"}