{"authors": ["Karissa Neely"], "date_download": "2020-05-04 20:04:16", "date_modify": "2020-05-04 20:04:16", "date_publish": "2018-02-08 17:00:00", "description": "Purple completes business combination with GPAC Global Partner Acquisition Corp., a special purpose acquisition company, and Purple Innovation, a comfort technology company known for its...", "filename": "_23e55323e07c43c399ad45361228fbad_1588622656.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_23e55323e07c43c399ad45361228fbad_1588622656.html", "title": "Purple completes business combination, Solutionreach partnership, Ivanti partnership", "title_page": "Purple completes business combination, Solutionreach partnership, Ivanti partnership", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Purple completes business combination with GPAC\nGlobal Partner Acquisition Corp., a special purpose acquisition company, and Purple Innovation , a comfort technology company known for its mattresses and pillows, announced they have completed their business combination, pursuant to which Purple has become a wholly owned subsidiary of GPAC. The transaction was approved at a special meeting Friday, Feb. 2.\nUnder the terms of the merger agreement, GPAC has changed its corporate name to Purple Innovation, Inc. The company’s common stock and warrants are listed on NASDAQ under the symbols “PRPL” and “PRPLW.” GPAC’s common stock has been renamed “Class A” common stock. Upon the merger, the previously trading units of GPAC, which consisted of one share of common stock and one warrant, will no longer trade as a unit, but will trade separately as stock and warrants.\n“In just two years, Purple has developed one-of-a-kind products, improved the lives of millions, and delivered exceptional growth,” said Terry Pearce, Purple co-owner, in a press release. “We believe our partnership with GPAC and entry into the public markets will allow us greater financial flexibility to take advantage of the massive opportunity that lies before us — including continued direct-to-consumer penetration, product innovations and category extensions, brick-and mortar partnerships, and expansion beyond the U.S. We are more confident than ever in Purple’s future as a public company and our ability to create shareholder value — all while making people feel better.”\nSolutionreach partners\nwith cloud9software\nSolutionreach , the Lehi business focused on patient relationship management solutions, announced its status as a preferred partner for patient relationship management services for cloud9software.\ncloud9software is a browser-based practice management and imaging system for orthodontists, pediatric dentists, dental service organizations, and group practices. This enhanced partnership will allow these cloud9software users to easily implement Solutionreach capabilities and access patient relationship management tools.\n“Solutionreach has long been a leader in providing patient collaboration solutions to dental practices of all kinds,” said Jim Higgins, founder and chief executive officer of Solutionreach. “This partnership with cloud9software highlights our ongoing commitment to continuing to provide the best tools for dental practices to engage with their patients.”\nSince its founding in 2000, Solutionreach has pioneered the industry’s patient relationship management platform. Solutionreach currently supports more than 100,000 healthcare professionals at approximately 25,000 practices, reaching over 80 million patients nationwide.\nIvanti and CrowdStrike partner on cybersecurity\nIvanti , the Utah company that unifies information technology to better manage and secure the digital workplace, has partnered with CrowdStrike, a company focused on cloud-delivered endpoint protection. The partnership will converge endpoint management and endpoint security, helping companies that possess limited resources combat cyber threats efficiently and in real time.\n“It’s vital to leverage advanced technologies to prevent and detect threats and provide insight, control and visibility into endpoints in real time,” said Matthew Polly, vice president of worldwide business development and channels at CrowdStrike. “The partnership between CrowdStrike and Ivanti will help our customers pinpoint and remediate threats while improving both management and automation, so security teams can work in a more efficient and effective manner.”", "url": "https://apnews.com/23e55323e07c43c399ad45361228fbad"}