{"authors": ["Steve Mims"], "date_download": "2020-05-04 20:20:41", "date_modify": "2020-05-04 20:20:41", "date_publish": "2018-03-15 07:00:00", "description": "Dana Altman didn’t think about the wider free-throw lane in the National Invitation Tournament until he looked at the stat sheet following a 99-86 win over Rider on Tuesday and saw Oregon was...", "filename": "_882663ae29314d0bbfafae78b4417967_1588623641.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_882663ae29314d0bbfafae78b4417967_1588623641.html", "title": "NIT’s new rules play role in opener", "title_page": "NIT’s new rules play role in opener", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dana Altman didn’t think about the wider free-throw lane in the National Invitation Tournament until he looked at the stat sheet following a 99-86 win over Rider on Tuesday and saw Oregon was outscored 50-34 in the paint.\n“We didn’t get any stops in there, maybe that’s because the paint was wider,” the Oregon coach said.\nAltman did notice the timeouts were extended to three minutes as part of the experimental rules in the tournament.\n“The TV timeouts were long, I don’t have that much to say,” he joked.\nAnother rule change was playing four quarters instead of two halves and eliminating one-and-one opportunities at the line following the seventh foul of a half. Instead, players got two shots after the fifth foul of each quarter.\n“We are a good free-throw shooting team, but on a night when we did not shoot them as well, maybe it didn’t hurt us as much,” Altman said, noting the Ducks shot 70.4 percent at the line, six below their average.\nThe change that was expected to bother teams most turned into an advantage for the Ducks, who shot 14-for-26 behind the three-point line that was moved back nearly two feet to the FIBA distance.\n“It’s just basketball, just shooting,” freshman guard Victor Bailey said after making 7-of-8 three-pointers en route to a career-high 23 points.\nAltman noted that with Keith Smith out due to a hip injury, the longer timeouts and quarter breaks gave the seven players who were on the court for at least 23 minutes more rest.\n“When we were pressing, it helped us because guys were out there for a long time,” he said.\nBailey played 25 minutes, which matched his third-most in a game all season.\n“VJ got a lot more minutes because he gave up a couple easy baskets in the first half and then he got it going,” Altman said. “In the second half, he didn’t give up any baskets. He did a much better job defensively. When your shot goes in, the energy level goes up and you guard better. That is human nature. Freshmen usually have a bigger problem with that.\n“The ball will not go in every night so you have to help the team in other ways. Really guard or turn it up in other areas, don’t feel sorry for yourself. If the ball is not going in, find a way to help the team. Freshmen usually fight that the most and as they go on, they find out.”\nThird-seeded Oregon will go on to visit second-seeded Marquette at 1:30 p.m. Sunday in Milwaukee on ESPN2. Marquette beat seventh-seeded Harvard, 67-60, on Wednesday.\nInjury update\nSmith injured his hip during Thursday’s quarterfinal win over Utah in the Pac-12 Conference Tournament and then played nine minutes the next night against USC before sitting out Tuesday.\n“He tried to go against USC, but he was not able to move,” Altman said. “He tried to rehab it the last couple days to be ready to go and tried at shootaround, but he just couldn’t go.”\nAltman said he was unsure if Smith would return in the second round.\n“Those hips are tricky,” Altman said. “It is really hard to move if it hurts. I hope he is ready to go.”\nFamiliar matchup\nTwo of the schools where Altman coached before arriving at Oregon will meet in the first round of the NCAA Tournament when Kansas State faces Creighton at 3:50 p.m. on Friday. Altman coached the Wildcats from 1990-94 before leaving for Creighton.\n“I spent 16 years at Creighton, so that is who I am pulling for,” he said. “I like Kansas State, I really like Bill Snyder and the football team. I follow that really close, but I am pulling for Creighton.”", "url": "https://apnews.com/882663ae29314d0bbfafae78b4417967"}