{"authors": ["Neal Meyer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "David Harvey", "Vivek Chibber", "Nivedita Majumdar"], "date_download": "2020-05-04 19:50:06", "date_modify": "2020-05-04 19:50:06", "date_publish": "2018-07-20 00:00:00", "description": null, "filename": "2018_07_democratic-socialism-bernie-sanders-social-democracy-alexandria-ocasio-cortez_1588621806.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/07/20092113/m4a.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_07_democratic-socialism-bernie-sanders-social-democracy-alexandria-ocasio-cortez_1588621806.html", "title": "What Is Democratic Socialism?", "title_page": "What Is Democratic Socialism?", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nAlexandria Ocasio-Cortez’s upset victory in New York City in June added fuel to the fire that Bernie Sanders started in 2016: a resurgence of interest in democratic socialism. And there is no strand of left politics that provokes more confusion than democratic socialism. All of a sudden, it seems everybody wants to know what democratic socialism is. Here’s what you need to know.\nFor a Better World Some commentators have tried to invent differences between the kind of society “democratic socialists” fight for and the kind envisioned by so-called “traditional socialists.” On MSNBC, Stephanie Ruhle confidently declared that democratic socialists make “no call for communal ownership of production.” According to Ruhle, the excitement around the emerging socialist movement is much ado about nothing: democratic socialists want good things like free college and public libraries — and that’s pretty much it. While we definitely support good library systems, democratic socialists’ vision of a better society and how to achieve it goes much further. The world we live in now is called a democracy; the United States is the wealthiest country in all of human history, and we all learn about how important of an American value “freedom” is. But the United States today is defined not by freedom and abundance, but exploitation and oppression. A tiny number of rich and powerful families lives off of the profits they make from trashing the environment and underpaying, overworking, and cheating the vast majority of society — the working class. They get richer precisely because the poor and working class get poorer. This capitalist class turns workplaces into mini-authoritarian regimes, where bosses have the power to harass and abuse workers. And they protect their power in all corners of society by fanning the flames of racial, national, and gender conflict and prejudice in order to divide working people and stop us from organizing. Democratic socialists want to end all of that. Like many progressives, we want to build a world where everyone has a right to food, healthcare, a good home, an enriching education, and a union job that pays well. We think this kind of economic security is necessary for people to live rich and creative lives — and to be truly free. We want to guarantee all of this while stopping climate change and building an economy that’s ecologically sustainable. We want to build a world without war, where people in other countries are free from the fear of US military intervention and economic exploitation. And we want to end mass incarceration and police brutality, gender violence, intolerance towards queer people, job and housing discrimination, deportations, and all other forms of oppression. Unlike many progressives however, we’ve come to the conclusion that to build this better world it’s going to take a lot more work than winning an election and passing incremental reforms.\nWhat We’re Up Against The democracy we live in falls far short of what we’re taught to believe it should be. In our society, normal people — when they’re not organized — have next to no power. Instead, power is determined by what political scientist Thomas Ferguson calls the “golden rule”: those with the gold rule. Capitalists use their wealth to buy politicians from both parties and their lobbying power to kill progressive legislation that threatens their profits. And even if we could elect a well-meaning government that could withstand the pressure of lobbyists, chances are they would eventually cave under the capitalists’ trump card: a capital strike. To oppose new social programs and redistribution, the capitalist class can, as a last resort, withhold their investments and provoke a recession, undermining the social support of a progressive government. This reflects another key problem under capitalism: not only do capitalists exploit workers on the job and hoard all the wealth they steal from us, but they have the power to determine whether or not we have jobs and thus the ability to provide for ourselves. If capitalists don’t like our democratic demands to, say, stop polluting the planet or pay workers a living wage, they can simply pull their investments and move their jobs to another state or country — and we have little recourse to stop them. In rare instances — usually following massive wars and economic crises — progressive governments have been able to win victories. The Scandinavian countries are what we call “social democracies,” societies with robust social safety nets and labor movements that check the worst tendencies of capitalism and limit the power of the wealthy in key ways. Over the course of the twentieth century, workers in these countries won full employment, a strong welfare state, and high levels of unionization. But they never successfully challenged the source of capitalist class power: their ownership rights over the major national corporations. As a result, in the last thirty or so years, a reinvigorated capitalist class in these countries has led a persistent and successful campaign to roll back these progressive achievements. These failed progressive experiments show that our democratic socialist vision has to go far beyond the narrow limits that today’s newly minted socialism experts on cable news will allow. That’s not because we are gluttons for politically difficult tasks, or because we are political purists. If we could win the better world that progressives, social democrats, and democratic socialists all want without challenging and eventually eliminating the power of capitalists, we’d happily take the easier route. It’s precisely because it’s not so easy to change the world under capitalism that we are socialists.\nThe Democratic Road to Socialism It’s one thing to know what democratic socialists fight for, and another to lay out a convincing path to realizing it. This is where democratic socialists truly differ with some of our friends on the socialist left. We reject strategies that transplant paths from Russia in 1917 or Cuba in 1959 to the United States today, as if we could win socialism by storming the White House and tossing Donald Trump out on the front lawn. What’s needed is a strategy that takes seriously the particular challenges and opportunities that come with organizing in a liberal democracy. It’s why we focus on uniting all working-class people. Workers — everyone who makes their way in the world by working rather than skimming off the profits generated by other people, from factory and construction workers to teachers and nurses and white-collar office workers — have the strongest material interests in fighting capitalism, the power to stop production in workplaces and bring the capitalist system to a halt, and (as the vast majority of society) the potential power in numbers to overturn the political system. And it’s why we believe in a democratic road to socialism — one that builds movements and contests elections. Bernie Sanders made a point endlessly in 2016: a “political revolution” in the United States will only happen if we can build mass movements, especially the labor movement. These movements have the potential to win concessions from capitalists and politicians. And through struggle, we can begin to transform people’s consciousness — by spreading an awareness that we can win if we organize together. New possibilities that seem fantastic now will become real in the process. As people’s expectations rise, they will realize what it will take to win a better life. And as the capacity of our movements grows, people will realize that they actually have the power to make those changes. Alongside this movement work, we have to start contesting elections as insurgents who challenge the political leadership of both major parties. This work will lay the foundation for building a political party of our own, one with a mass social base that eventually can fight to elect a socialist government. But because of the capitalist’s class’s immense power, we know that electing a socialist government alone won’t be the same as winning the power needed to transform society. A socialist government would have to see its primary task as taking away the power of the capitalist class. That will mean nationalizing the financial sector so that major investment decisions are made by democratically elected governments and removing hostile elements in the military and police. It will mean introducing democratic planning and social ownership over corporations (though the correct mix of state-led planning and “market socialism,” a mix of publicly-owned firms, small privately-owned businesses, and worker cooperatives, is a matter of some debate in our movement). And it will mean rebuilding our democracy by instituting public financing of elections, a ban on corporate lobbying and private campaign donations, and even more radical demands like writing a new constitution. Even with such an ambitious agenda, a socialist government will come under immense pressure from the capitalist class to back off. Bold twentieth-century attempts to check corporate power and redistribute wealth, as in countries like France, Jamaica, and Sweden, all came up against that pressure, often in ways that severely weakened or sank reform efforts. We know that in some cases, like when Salvador Allende tried to put Chile on a democratic road to socialism in the early 1970s, the ruling class has even stopped tolerating the norms of liberal democracy. At that moment, it will be the job of democratic socialists in movements and in government to do everything necessary to defend the democratic mandate they won. This brings us back to the critical importance of building the power of working-class movements, the all-important complement to the state power exercised by a socialist government. Such movements can hold socialist governments accountable, helping them resist the pressure to give in to capital. But those movements also have to act on their own initiative in a transitional period to democratize workplaces and communities. Through building bottom-up, democratic social movements, we can not only build the power we need to defeat the wealthy, but build the kind of democratic institutions that would be central to the future socialist society we want to live in. Only by combining a committed socialist government and a powerful, self-organized working class can we take on the capitalist class from above and below.", "url": "https://jacobinmag.com/2018/07/democratic-socialism-bernie-sanders-social-democracy-alexandria-ocasio-cortez"}