{"authors": ["Dave Gong"], "date_download": "2020-05-04 20:17:04", "date_modify": "2020-05-04 20:17:04", "date_publish": "2018-03-28 05:00:01", "description": "Fifteen of 19 single-family homes associated with the Bottle Works Lofts project in southeast Fort Wayne have been pre-leased, officials announced Tuesday.  The $14.5 million...", "filename": "_c67e9d370e5a49fa95dc44ea0c9f8003_1588623424.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c67e9d370e5a49fa95dc44ea0c9f8003_1588623424.html", "title": "Affordable housing going fast", "title_page": "Affordable housing going fast", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Fifteen of 19 single-family homes associated with the Bottle Works Lofts project in southeast Fort Wayne have been pre-leased, officials announced Tuesday.\nThe $14.5 million affordable-housing development will also feature 31 rental apartments inside the former Coca-Cola bottling plant at 1631 E. Pontiac St. The facility will feature an on-site management office, community room, business center, media room, fitness center, outdoor shelter and indoor and outdoor playgrounds.\nMayor Tom Henry and city officials toured two recently completed single-family houses on Winter Street on Tuesday. All of the houses are being built on vacant lots previously owned by the city.\nCoca-Cola’s former plant was built in 1943. It was bought by the city in 2012, and plans to redevelop the site were announced in early 2016. The Miller-Valentine Group and Vincent Village have partnered on the project, with Vincent Village providing supportive service to help link tenants to area services and programs.\nFunding for the project came from the U.S. Department of Housing and Urban Development; federal low-income housing tax credits issued by the Indiana Housing and Community Development Authority; and federal historic tax credits issued through PNC Bank by the National Park Service. Financing was also provided by Federal Home Loan Bank of Indianapolis and Old National Bank.\nThe single-family homes are expected to be done by the end of the summer. The apartments in the Bottle Works building will be finished by the end of the year.\ndgong@jg.net", "url": "https://apnews.com/c67e9d370e5a49fa95dc44ea0c9f8003"}