{"authors": [], "date_download": "2020-05-04 20:07:23", "date_modify": "2020-05-04 20:07:23", "date_publish": "2018-07-22 22:34:00", "description": "Charlie Engle, who calls himself \"Running Man\" in his memoir of overcoming addiction, is running for 26 hours straight Sunday into Monday to draw attention to the national opioid crisis and to...", "filename": "_f347e709172afe86ae683c59f496432c_1588622843.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f347e709172afe86ae683c59f496432c_1588622843.html", "title": "Running through the night in Raleigh to offer light of hope to others", "title_page": "Running through the night in Raleigh to offer light of hope to others", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Running through the night in Raleigh to offer light of hope to others\nCharlie Engle, who calls himself “Running Man” in his memoir of overcoming addiction, is running for 26 hours straight Sunday into Monday to draw attention to the national opioid crisis and to raise awareness for a Raleigh-area treatment group.\nHe started before the heat of the day – at Healing Transitions, a year-long recovery treatment center at 1251 Goode St. in Raleigh, at 8 a.m. Sunday.\nHe’ll run a 3-mile circuit through nearby Dorothea Dix Park for 26 hours in honor of his personal 26 years of sobriety.\nAfter the sun set Sunday, he was still keeping pace. Engle is expected to finish around 10 a.m. on Monday.\nEngle said he started drinking and doing drugs in college, and, more than a decade later, he hit rock bottom after years of cocaine and alcohol abuse.\n“Someone shot at me, and the police were going through my car, and I just had a moment where I realized I had to make a choice between, really, between life and death,” Engle said.\n“That night I went to an AA meeting, and the next morning I put on my running shoes. For three straight years, I did that exact routine every day and slowly started to actually build a life for myself.”\nHe hopes his story and his run will inspire others to seek help and to know that recovery is possible. Some may consider Healing Transitions.\n“Anybody can come here no matter your ability to pay and you get help,” Engle said. “I didn’t have a place like this when I was getting clean and sober.”\nAsked whether he simply traded substance abuse for running, Engle draws a clear difference.\n“Addiction is all about hiding about being invisible and about hiding and having no feelings at all,” he said. “With running, you feel. I feel everything.”", "url": "https://apnews.com/f347e709172afe86ae683c59f496432c"}