{"authors": [], "date_download": "2020-05-04 20:06:44", "date_modify": "2020-05-04 20:06:44", "date_publish": "2018-03-23 22:44:40", "description": "Pontiac – The former leader of Oakland Community College has filed a lawsuit against the school's board of trustees, alleging he was fired last year from his $290,000-a-year job in violation of...", "filename": "_a3dfc404a2384969907db93503fafd26_1588622804.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a3dfc404a2384969907db93503fafd26_1588622804.html", "title": "Ex-Oakland Community College chief sues over ouster", "title_page": "Ex-Oakland Community College chief sues over ouster", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pontiac – The former leader of Oakland Community College has filed a lawsuit against the school’s board of trustees, alleging he was fired last year from his $290,000-a-year job in violation of his contract and the state’s Open Meetings Act.\nDr. Timothy Meyer’s suit, filed in Oakland County Circuit Court, says the school’s trustees – specifically board Chairman John McCulloch, Susan Anderson, Shirley Bryant, Pamala Davis and Pamela Jackson – made the termination decision at a meeting May 16, 2017, after holding a closed door session for the purpose of discussing labor negotiations and to receive a written opinion from their lawyer.\nAt some point in the board’s subsequent open session, trustees excused Meyer and voted 5-1 to approve a plan presented in closed session, the suit says. According to the lawsuit, the only “nay” vote came from trustee Kathleen Bertolini.\nAfterwards in a hallway, the lawsuit alleges that “Dr. Meyer was orally informed that his contract had been terminated by a two-thirds majority of the Board.” He was handed a letter that he was “on paid administrative leave pending further notification from the Board.”\nMeyer, chancellor and CEO of the school from 2008 to 2017, began a new job this month as deputy Oakland County executive in charge of economic development.\nMeyer referred all questions to his attorney, Nicholas Roumel, who said his client’s contract with the school stated he served at the pleasure of the board and could be discharged with or without cause.\n“But they never gave cause – any wrongdoing – for terminating his contract and so you have to play by the rules of contract, which when done without cause, provides him with certain rights, like 45 days’ notice so he can look for work,” said Roumel. “They didn’t do that. And we believe the lawsuit will show they also played loose with the state’s Open Meetings Act, which governs what a public body can and can’t do.”\nEfforts to reach the trustees named in the lawsuit were unsuccessful. Current OCC Chancellor Peter Provenzano did not return a voice mail message seeking comment.\n“We cannot comment on either personnel matters or legal matters,” college spokeswoman Janet Roberts said when asked to discuss the allegations in the lawsuit.\nWhen asked what explanation was given for Meyer’s contract being terminated, Roberts said there has never been a formal reason from the school, which has about 40,000 students over five campuses.\nMeyer’s lawsuit says he should be entitled to up to 18 months’ severance pay and benefits – amounting to about $435,000.\nPublic bodies can elect to meet in closed session to discuss labor negotiations, personnel and legal matters but all decisions – all votes – must be made in open session as required by the Open Meetings Act. The lawsuit contends:\n--It is not permissible to “stretch” a proper closed session after discussion of specified topics was concluded.\n--There was no fair notice to the public of what was to be deliberated or voted upon.\n--Explanations were so nondescript that the votes to remove Meyer were tantamount to a “secret ballot.”\nThe lawsuit alleges the board “by failing to give proper notice and otherwise violating the OMA ... has impaired the rights of the public and further damaged Dr. Meyer....”\nThe lawsuit, assigned to Judge Rae Lee Chabot, seeks in excess of $25,000 in damages, injunctive and declaratory relief under the Open Meetings Act, all court costs and attorney fees.\nmmartindale@detroitnews.com\n(248) 338-0319", "url": "https://apnews.com/a3dfc404a2384969907db93503fafd26"}