{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:06:03", "date_modify": "2020-05-04 20:06:03", "date_publish": "2018-02-13 11:35:38", "description": "Former All-Star pitcher Esteban Loaiza has been arrested on suspicion of trafficking drugs after packages containing a white powder believed to be cocaine were found at a home he rented in...", "filename": "_9a5b2ff66f494286a25951c72efa003a_1588622763.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9a5b2ff66f494286a25951c72efa003a_1588622763.html", "title": "Loaiza Arrested on Coke Charges", "title_page": "Loaiza Arrested on Coke Charges", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Former All-Star pitcher Esteban Loaiza has been arrested on suspicion of trafficking drugs after packages containing a white powder believed to be cocaine were found at a home he rented in Southern California, officials said Monday.\nThe 46-year-old former Major League Baseball player was booked Friday on charges involving the possession, transport and sale of 20 kilograms (44 pounds) of suspected cocaine worth an estimated $500,000, according to the San Diego Sheriff’s Department.\nLoaiza played for numerous teams between 1995 and 2008, starting with the Pittsburgh Pirates and concluding with his second stint with the Chicago White Sox. He had a 21-9 record with the Chicago White Sox in 2003 and started in the All-Star Game that year.\nFormer National League Rookie of the Year Wally Moon, who played on three World Series-winning teams with the Los Angeles Dodgers, has died. He was 87. Moon played for the St. Louis Cardinals from 1954-58 and was named NL Rookie of the Year in 1954, when he batted .304 with 12 homers and 76 RBI. ... Roy Halladay’s No. 32 will be retired by the Toronto Blue Jays before their opener against the New York Yankees on March 29. Halladay died at age 40 on Nov. 7 when the plane he was piloting crashed into the Gulf of Mexico. ... Free agent Ryan Hanigan has agreed to a minor league contract with the Cleveland Indians, a deal contingent on the catcher passing a physical. The 37-year-old played 33 games last season for the Colorado Rockies, batting .267 with two homers and 12 RBIs. He is a native of Andover.\nPRO BASKETBALL\nBelinelli joins 76ers\nThe 76ers have signed veteran 3-point specialist Marco Belinelli, whose contract was bought out by the Atlanta Hawks.\nPhiladelphia announced the move on Monday ahead of the Sixers’ matchup with the Knicks. Belinelli was averaging 11.4 points in 23.3 minutes per game with the Hawks, who bought him out to allow him to join a contending team.\nFormer No. 1 NBA draft pick Greg Oden will attempt a comeback this summer in the Big3. The 3-on-3 league says Oden will be part of this year’s draft pool and take part in the draft combine.\nOden was picked first in 2007 by Portland, which selected him over Kevin Durant. But the 7-footer battled injuries throughout his career and played in just 105 games, averaging 8.0 points. His last NBA season was in 2013-14 with Miami. ... New Orleans star Anthony Davis dominated Detroit as he usually does, scoring all over the court no matter who was trying to defend him in a red, white and blue uniform. In another one of his strong performances against the Pistons, Davis had 38 points and 10 rebounds to lead the Pelicans to a 118-103 victory.\nPRO FOOTBALL\nEx-Browns WR injured\nFormer Browns wide receiver Mohamed Massaquoi has divulged that he lost most of his left hand in an all-terrain vehicle crash last April.\nMassaquoi, who starred at Georgia before he was drafted by Cleveland in the second round in 2009, revealed his prosthetic and details of his misfortune in a video posted Monday on The Players Tribune. Massaquoi was riding ATVs with friends when he said he took a turn too sharply and crashed.\nThe 31-year-old said it felt as if an explosion had gone off in his hand, and he was initially unaware of the severity of his injury.", "url": "https://apnews.com/9a5b2ff66f494286a25951c72efa003a"}