{"authors": ["Chip Scoggins"], "date_download": "2020-05-04 20:20:09", "date_modify": "2020-05-04 20:20:09", "date_publish": "2018-03-17 17:27:25", "description": "Minnesota United FCs home opener Saturday was played under clear skies and an abundance of sunshine. The soccer ball was white, the play was competitive, and the final score mattered. In...", "filename": "_1272351db9b042d4907163634c087866_1588623609.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1272351db9b042d4907163634c087866_1588623609.html", "title": "This year's Loons' opener, team way different", "title_page": "This year's Loons' opener, team way different", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Minnesota United FCs home opener Saturday was played under clear skies and an abundance of sunshine. The soccer ball was white, the play was competitive, and the final score mattered.\nIn other words, a 180-degree change from the teams inaugural home opener last season.\nThe product means as much as the party now. And the Loons look markedly improved and better equipped to compete in Major League Soccer in Act II.\nA 2-1 victory over the Chicago Fire gave United its second win in three games. The Loons didnt win their second game in their inaugural MLS season until April 23 in what often looked like a soft launch.\nIn their debut at TCF Bank Stadium last season, wintry conditions created a snow globe effect that required an orange ball to be used so that players could see what to kick.\nUnited lost 6-1 to Atlanta United that day with a defense that was leakier than a 40-year-old faucet. Nobody in the stands seemed to care, or even notice. The festive vibe surrounding the return of big-league soccer to the Twin Cities rendered the final score largely irrelevant.\nHoneymoons dont last forever, though, and United officials arent treating this season as a free pass while their permanent home, Allianz Field, continues to rise from the ground along I-94 in St. Paul.\nExpectations are completely different from this time last year, coach Adrian Heath said.\nHeath made that observation even after losing his best player, Kevin Molino, to a season-ending knee injury last week. United didnt skip a beat in his absence against Chicago. The Loons were the superior team, start to finish.\nIt was a good day, Heath said.\nHe endured some difficult days this time last year. Everything felt so rushed in the organizations first season of MLS, particularly in constructing a roster, that expectations were minimal. Their talent represented a starting point, not a finished product.\nThe team tweaked the roster in the offseason, and that process remains ongoing. Heath said the club intends to keep looking outside for better players, and he hopes to sign two or three additions in the next few weeks who will create competition and keep everybody on their toes.\nWe know that were nowhere near the finished article, he said. Weve got to bring people in that are going to challenge to be in the starting 11.\nThe organization made a strategic hire last fall in naming former Timberwolves President Chris Wright as its CEO. Wright not only has deep knowledge of the business community, but he also played and coached semipro soccer in England.\nWright said United executives are formulating a plan for how to supplement the roster with better talent as the organization matures.\nA lot of teams go out and spend a tremendous amount of their resources on bringing over what is arguably a big-name player that they hope will [excite] the fan base, Wright said. We dont need that here. We have an incredible base here. Were not going to have any problem selling out every single game next year.\nWright said his preference is to sign young players who fit a very distinctive style thats inside the MLS. We have to decide what we want to be from a style standpoint.\nAn exciting style that puts a premium on attacking always is attractive to fans, but winning ultimately is what matters. Based on their start to this season, the Loons are moving in the right direction.\nHeath asked his players for their input in establishing goals before the season. He appreciated what he heard.\nThey are really confident that they can make an impression in this league this year, he said.\nSo far, so good.\nHeath seems optimistic his team will sign a few more players soon to improve his roster. And he sounded downright giddy in describing his teams performance Saturday as magnificent. Both things are encouraging.\nUnlike last home opener, Heath wasnt forced to reflect on blizzard-like conditions, an orange soccer ball and his teams woeful defense. It was nothing but blue skies and smiles after this one.\nChip Scoggins chip.scoggins@startribune.com", "url": "https://apnews.com/1272351db9b042d4907163634c087866"}