{"authors": ["Shelbie Harris Sharris Journalnet.Com"], "date_download": "2020-05-04 20:11:32", "date_modify": "2020-05-04 20:11:32", "date_publish": "2018-08-29 07:30:00", "description": "POCATELLO — Not one student in Pocatello-Chubbuck School District 25 left for school and never returned home last year, and with Tuesday marking the the first day of the 2018-2019 school year, the...", "filename": "_4cd4c9c9c37b47b384cc24a6eb7070e1_1588623092.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4cd4c9c9c37b47b384cc24a6eb7070e1_1588623092.html", "title": "Century resource officer talks school safety, his role as new academic year begins", "title_page": "Century resource officer talks school safety, his role as new academic year begins", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "POCATELLO — Not one student in Pocatello-Chubbuck School District 25 left for school and never returned home last year, and with Tuesday marking the the first day of the 2018-2019 school year, the resource officer at Century High School aims to keep it that way.\nZac Bartschi joined the Pocatello Police Department in 2007 and for the last four years has patrolled the hallways, fields and parking lots of Century High School.\nAnd While Bartschi was at the school last year when officers investigated a potential school shooting threat that was actually made in a separate state at a separate school, he wants parents, students and faculty to know that his primary responsibility is to ensure everyone remains safe and secure.\n“Last year, someone posted about a CHS saying they had a gun and to not come to school today because they were going out with a bang. We secured the school and ensured everyone was safe and protected,” Bartschi said. “We were able to track that down to out-of-state. But when things like that happen it’s still a training opportunity for us to ensure we are keeping everyone as safe as possible.”\nWhen asked how he would directly respond to an active shooter scenario or a situation of extreme danger, Bartschi continued, “As police officers, we train very vigorously and actively to make sure that we are running into the battlefield. The reason I put a vest on every day is to make sure that, first, I come home every night. But second, that I keep those in the community and specifically the school as safe as possible.”\nEnsuring that not only himself, but all of Century community gets to go home every day is something that Bartschi said he trains for mentally as much as physically.\nBartschi said he and the Pocatello Police Department support recent District 25 security initiatives regarding entering buildings 110 percent. And this focus on school safety will remain as strong at the end of the school year as it was on day one, he added.\n“In terms of security, the first day is no different than the last day,” Bartschi said. “We want to make sure that things are addressed and taken care of and that people are safe every day of the year. We want to remain steady and consistent.”\nAnd while school safety is a high-priority focus this year, Bartschi’s job as a school resource officer encompasses several other dynamics.\n“The great thing about law enforcement is that there are many different things you can do,” Bartschi said. “I’ve worked in patrol and on the traffic team, but I became a school resource officer because I really enjoy the prosocial, or the positive interaction with the youth.”\nIn addition to securing the school and all its occupants, Bartschi also spends a decent amount of time teaching something related to law enforcement inside the classrooms.\n“I might go to a history class and we’ll talk about the Fourth Amendment or search and seizure,” Bartschi said. “I’ve taught about first aid safety and applying tourniquets. I’ve even talked about alcohol and drug use in chemistry classes, with the chemistry teacher talking about how the body breaks down substances like alcohol.”\nBartschi said he appreciates this experience because the students get to learn about something new, but “they also realize that I’m not a robot so that if they need to see me or meet with me they know I’ll be there.”\n“Then, when they leave the school they know that officers are humans, too, and that it’s OK to speak with them,” Bartschi said.\nLastly, one of the most important aspects of Bartschi’s job, he said, is frequently meeting with school counselors to discuss any potential opportunities to proactively talk to students dealing with crises or other concerning situations in their personal lives.\n“If people see something out of the ordinary we want them to say something,” Bartschi said. “We are working with youth who might be depressed or suicidal. We want to make sure that everyone is getting the services and care they need in regards to mental well-being.”\nWhile Bartschi is excited for the new school year to kick off, he also spent some time on Tuesday reflecting on some of the more awesome experiences of his summer. One such experience was hosting what he called the Bannock County D.A.R.E. Summer Program. Fifteen kids worked over 500 community service hours during the summer, and had some fun doing it, too.\n“Another officer and I took youth that normally wouldn’t have the opportunity to get out into the community and we completed service-related activities and a few fun days,” Bartschi said. “We built Frisbee golf pads or spread bark for Parks and Recreation. And one day we traveled up to Idaho State University, went rock climbing, ate in their cafeteria, met with some professors and just showed them what it was like for a college student on the ISU campus.”\nBartschi continued, “It was nice seeing these kids over and over and getting to know them because some of these youth have a hard time or go through things that I could never imagine going through. We wanted to challenge these young-adults to become citizens of the community and to provide career-oriented experiences and leadership opportunities.”\nAnd while Bartschi has spent time on both patrol and out in the field, he said he really feels like being a school resource officer was his calling — the job he really loves to do — because it’s much more rewarding when you know you’ve made an impact on a particular student and can see it in the flesh.\n“Most people when they get into law enforcement say that they wanted to make a difference,” Bartschi said. “In patrol I do think you make a difference but it’s harder to see and I think it’s in a little bit of a different way. The difference you’re making is often seeing people on their worst day whether it’s a traffic incident or something else. In regards to a school resource officer, I’m able to have that positive interaction on a daily basis. Here at the school, it’s almost like we are in our own little town so I see the same students all year long and am able to build relationships and rapport with them.”\nBartschi added, “I’m just hopeful that the positive interaction really does make a difference for these kids.”", "url": "https://apnews.com/4cd4c9c9c37b47b384cc24a6eb7070e1"}