{"authors": ["Robert Pollin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:56:53", "date_modify": "2020-05-04 19:56:53", "date_publish": "2018-12-23 00:00:00", "description": null, "filename": "2018_12_medicare-will-be-good-for-everyone-except-ceos_1588622213.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/12/23114946/GettyImages-851701896.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_12_medicare-will-be-good-for-everyone-except-ceos_1588622213.html", "title": "Medicare Will Be Good for Everyone - Except CEOs", "title_page": "Medicare Will Be Good for Everyone — Except CEOs", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "RP\nWe are assuming that we have full coverage for everybody with no copayments of any kind, so we will see the system be used more. We want people to use the system more, especially those that have been uninsured or underinsured.\nSo we estimate at the high end figure that use will go up by 12 percent relative to what it is now. (That number, by the way, is higher than the Koch Brother-funded study, which was, their estimate for utilization increase was 11.3 percent).\nWhere do we get savings? There are three main sources. The biggest single one is administration. We save a huge amount on administration, because the private insurance system now spends about 12 percent on administration, whereas our Medicare system spends about 2 percent on administration. We assumed that Medicare for All wouldn’t get administrative costs down to 2 percent, though we might have assumed that. We said administrative costs would get down to 3.5 percent.\nThat means you save about 9 percent of total system costs through reducing the administrative burden. That is the biggest single source of savings.\nThe second biggest is lowering pharmaceutical prices. That’s going to be about a 6 percent reduction in total system costs. Because in the United States today we pay roughly 50 percent more for prescription drugs than Canada, Germany, France, and the United Kingdom. Because those countries bargain as a bloc, their health care systems bargain against the pharmaceutical companies, so they get much better prices. We’ve got about 6 percent system savings there.\nThe third biggest one: it’s built in that all providers — meaning doctors, hospitals, dentists — will get Medicare rates for their billable hours. Right now, they get higher rates when they are charging private insurance companies, though they have lower rates with Medicaid. On balance, we end up at about 3 percent savings from that.\nThere are other, smaller sources, but administration, pharmaceutical pricing, and Medicare rates for providers are the biggest. That gets you to 19 percent total savings to operate Medicare for All compared to our existing system.", "url": "https://jacobinmag.com/2018/12/medicare-will-be-good-for-everyone-except-ceos"}