{"authors": [], "date_download": "2020-05-04 20:08:55", "date_modify": "2020-05-04 20:08:55", "date_publish": "2018-03-04 07:00:00", "description": "Jack White doesn't \"feel male or female\". The former White Stripes frontman feels a lot of \"ambiguity\" about himself when he's working, but he's never felt particularly masculine. He...", "filename": "_51d515572cdd4b839eb2e74d8a46d9eb_1588622935.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_51d515572cdd4b839eb2e74d8a46d9eb_1588622935.html", "title": "Jack White doesn't feel male or female", "title_page": "Jack White doesn't feel male or female", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jack White doesn’t “feel male or female”.\nThe former White Stripes frontman feels a lot of “ambiguity” about himself when he’s working, but he’s never felt particularly masculine.\nHe said: “I have an overall sense of ambiguity within myself whenever I’m creating. I don’t really think too much of myself being ‘male’ - the pronouns have never meant too much to me.\n“The world reminds you who you are.\n“Like, when I’m writing, I feel like I’m 19 years old - and I’m not anymore, I’m 42 - and I don’t feel male or female or that I’m a Detroiter or a Nashvillian or anything. I just feel like some young... entity.\n“But the world quickly reminds you, puts you back in the boxes they made up to label people.\n“It’s funny how your spirit feels, compared to how you look in the mirror.”\nJack - who has two children with ex-wife Karen Elson - finds it far more “interesting” to write songs about imaginary characters than pour his own life and feelings into his music.\nHe told MOJO magazine: “I wish I could just sit and write about things that happen to me and straight-up tell people that’s what it is. It doesn’t happen very often to me.\n“I like to write about imaginary characters, about other people - it’s just a lot more interesting.\n“When I think about my own problems, I’m just like, ’Eh, what do I want to think about that for the next 20 years for every time I sing this song?\n“It’s way more interesting for me to push myself out of my own scenario.”", "url": "https://apnews.com/51d515572cdd4b839eb2e74d8a46d9eb"}