{"authors": ["Diana Roose", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Viet Thanh Nguyen", "Derek Seidman", "Jason Stahl", "An Interview With"], "date_download": "2020-05-04 19:52:13", "date_modify": "2020-05-04 19:52:13", "date_publish": "2018-05-31 00:00:00", "description": null, "filename": "2018_06_namric-antiwar-research-vietnam-war_1588621933.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/05/31233738/ma.v2.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_06_namric-antiwar-research-vietnam-war_1588621933.html", "title": "Understanding the Vietnam War Machine", "title_page": "Understanding the Vietnam War Machine", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "DR\nThe war ends. Then, NARMIC branched into a few other areas. One was a report that we called “Police on the Homefront.” It was a collection of essays looked at how the weapons and equipment from the war were being brought home to be used by the police in counterinsurgency here.\nAgain, we looked at the companies that had contracts for these weapons, what were they using, and what cities had these contracts to use weapons for surveillance training and counterinsurgency. And we got a whole list, that not only explained what was happening, but how this was getting past Congress — because they had different names for these things. They were the same weapons, same ordinances, but they ended with different kinds of names. They were camouflaged. We looked at various places, including campuses that were using this kind of training to basically control Americans on the home front.\nThere was an organization at the federal level called the LEAA — the Law Enforcement Assistance Agency. It was actually delivering tanks and various other weapons to cities — and even campuses — that wanted that kind of help. So this was another piece of counterinsurgency research that we did for a while.\nShortly after the war ended, we had an advisory-board meeting and talked about what to do now that the war was over. Some of the scientists on it said they needed us to start looking into nuclear weapons because the military was developing all these new kinds of nuclear weapons under Reagan. They were funding them and nobody knew what they were. So we started looking at contracts, trying to see what was going, and again put out some pamphlets.\nThe cruise missile was brand new, and there were lots of other pieces of artillery and other military weaponry that had been adapted for nuclear weapons, including trident submarines. It took a long time to figure out what all these things were. Reagan had really ramped things up by this time — the early 1980s — and from reading some of the military magazines and from looking at the contracts to companies we gradually put together not only the lists of the nuclear weapons being developed but what they did, how they were to be used, and how they fit into the philosophy of fighting a new nuclear war in the late twentieth century or in the early twenty-first century. Nobody had done this before, not even the scientists.\nSo, again, we started putting out pamphlets. We worked with some of the groups in Europe to come up with some easily understandable descriptions of what these new nuclear armaments in this new arms race were, what they were designed to do, and who was getting the money to design them.\nAll this, again, went back into the hands of antiwar organizers who were turning to different subjects after the war. Some of them were working on local issues, like police issues, and some of them ended up working on the antinuclear movement, including the Berrigans. We worked with them again to get them information so they would know which military bases to go into and which weapons to pour blood on — so that they knew what they were doing instead of just being antiwar.\nThat wasn’t as popular a movement as the Vietnam antiwar movement, but it was a pretty strong movement that lead to some of the largest protests, around nuclear freeze activities, in the history of the country. We did a lot of the research they used.\nThe Pentagon was not happy with this. We had some moles coming into NARMIC and trying to figure out what we were doing, but we could usually spot them pretty easily and neutralize them. They had us in their sights.\nOnce, the FBI office in Media, Pennsylvania was raided, and the draft files and long FBI files were stolen. That produced a whole host of publications about how the FBI was trying to subvert and directly hinder movement groups. We weren’t the people doing that, but we helped them with interpreting some of the documents to see what all this gobbledygook really meant — to help them understand the role of the FBI in suppressing dissent. Because we were the ones doing the research and looking up the background of some of these things, we could help put it into political context, as well as translate all the acronyms.", "url": "https://www.jacobinmag.com/2018/06/namric-antiwar-research-vietnam-war"}