{"authors": ["Jennifer Rios Staff Writer"], "date_download": "2020-05-04 20:13:46", "date_modify": "2020-05-04 20:13:46", "date_publish": "2018-02-19 17:27:34", "description": "Daniel Casey, who has 20 years of experience in several roles at the Colorado Department of Human Services, has accepted the position of Broomfield's Director of Health and Human...", "filename": "_72608dce57444faf916875d3fa9c3a81_1588623226.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_72608dce57444faf916875d3fa9c3a81_1588623226.html", "title": "New Director of Broomfield's Health and Human Services Named", "title_page": "New Director of Broomfield's Health and Human Services Named", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Daniel Casey, who has 20 years of experience in several roles at the Colorado Department of Human Services, has accepted the position of Broomfield’s Director of Health and Human Services.\nHe starts the new role March 1.\nThe position became open Nov. 17 after former HHS director Debra Oldenettel took a position with the Colorado Department of Safety as Deputy Director for the Division of Criminal Justice.\nBroomfield officials received 66 applications for the HHS director position and conducted several extensive panel interviews, numerous reference checks, and a community forum on Jan. 30.\nAt that forum, Casey and Ron Mitchell, Deputy Director for Denver Human Services Business Management Division, were given time to introduce themselves and then were asked questions both from staff and members of the audience.\nPublic comment was collected at the forum, which included questions from management style to opioid use, as well as visions for the department and care of specific demographic groups.\nFinal interviews were conducted following the following week by City and County Manager Charles Ozaki.\n“Dan possesses a big picture view of Health and Human Services and has a great deal of knowledge relating to best practices and state requirements,” Ozaki said Friday. “He has shown himself to be a strategic, agile and effective leader.”\nCasey, Director of the Division of Quality Assurance with the Colorado Department of Human Services, has experience overseeing the review of a variety of service programs, including child and family welfare, self-sufficiency and workforce.\nHe began his CDHS career in 1995 as a Youth Services Officer in the Division of Youth Services (DYS). He then worked in Quality Assurance on programmatic, safety, and risk management issues for DYS before advancing to the role of Assistant Director of the Platte Valley Youth Services Center.\nCasey was promoted in 2009 to manager of Child Welfare’s 24-Hour Licensing and Monitoring Unit that licenses and inspects residential child care facilities throughout the state. In 2012, he was named CDHS Social Worker of the year for his work on a statewide task group to eliminate the use of prone restraints in all CDHS programs.\nA few years later, the CDHS Executive Management team selected him to lead the creation of, and strategically manage, the Division of Quality Assurance and Quality Improvement, which provides and evaluates department-wide quality assurance efforts, including monitoring, reviewing, analyzing and recommending program improvements.\n“While Dan understands the importance of quality control and quality assurance, he is personable, has a sense of humor and has the experience to be an effective coach and mentor for staff,” Ozaki said.\nJennifer Rios: 303-473-1361, riosj@broomfieldenterprise.com or Twitter.com/Jennifer_Rios", "url": "https://apnews.com/72608dce57444faf916875d3fa9c3a81"}