{"authors": ["David Goricki", "The Detroit News"], "date_download": "2020-05-04 20:08:14", "date_modify": "2020-05-04 20:08:14", "date_publish": "2018-05-24 00:57:25", "description": "Graham Rahal would love nothing more than to win the Indianapolis 500 Sunday, a feat which would help him join his father, Bobby Rahal, as champions of IndyCar's most prestigious race in the same...", "filename": "_37b3d46be379417abfa3b910ff019192_1588622894.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_37b3d46be379417abfa3b910ff019192_1588622894.html", "title": "Graham Rahal revved for Indy race", "title_page": "Graham Rahal revved for Indy race", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Graham Rahal would love nothing more than to win the Indianapolis 500 Sunday, a feat which would help him join his father, Bobby Rahal, as champions of IndyCar’s most prestigious race in the same way Al Unser and his son Al Unser Jr. accomplished decades ago.\nRahal, 29, knows he will have his work cut out, having to start from the 30th spot in the 33-car field in his No. 15 United Rentals Honda at the 21/2 mile superspeedway.\nRahal finished third in the Indy 500 in 2011 while competing for Chip Ganassi and fifth in 2015 while driving for his father’s team, which includes former talk show host David Letterman and Mike Lanigan.\nRahal is among a three-car team this month at Indianapolis, with defending Indy 500 Takuma Sato joining the team this season. Oriol Servia will also be running Sunday for Rahal/Letterman/Lanigan.\n“I can’t wait to get going,” said Rahal of Sunday’s race. “There’s been a lot of buildup, just been a busy, busy month for me and I’m just looking forward to just getting in there and get going, to be honest with you.\n“Takuma is a great addition to our program and obviously he knows what it takes to win this thing and so I’m definitely happy to have him on board with us. He’s been a good asset for this whole month where things haven’t been going silky smooth. I’m excited for the opportunity we have together and Oriol has a lot of experience and is a great driver on his own so all of us together is a pretty strong lineup.”\nDrivers competing with Honda power have won three of the last four Indy 500s, but will the starting position hamper him?\n“Not really,” explained Rahal who said that his wife, NHRA Funny Car driver Courtney Force will be attending the Indy 500. “I think ultimately if we have a good race car we’ll have plenty of time to get ourselves to the front so I’m not too worried about it.”\nRahal sits sixth in points, owning top-10 finishes in all five races including a season’s best second place showing in the opener at St. Petersburg.\nRahal finished fourth in points in 2015 with a pair of wins, including one at the two-mile superspeedway at Fontana, California; finished fifth in ’16 with a win at Texas Motor Speedway and sixth last season when he became just the second driver to sweep both races of a weekend doubleheader, getting the job done at Belle Isle in the Chevrolet Detroit Grand Prix presented by Lear Corporation.\nThe doubleheader on Belle Isle is set for June 1-3\nBobby Rahal won the 1986 Indianapolis 500 and went on to earn the first of his three series championships that season at age 33, so Graham has plenty of time to claim the top prizes of the series.\n“I certainly feel like I’m driving some of my best that I ever have,” Rahal said. “I can’t really put it into words (what winning Indy 500 would be like) because I’ve seen the effect that it has on my Dad’s life, seen the effect that it has on the Rahal name and I think it’s something we’ve all dreamed about and it just something that I’d more than love to see happen.\n“It would give me a great platform to go out and help my sport grow which is one of things I like the most about my job. I think it would just be great to be the second father-son combination to ever accomplish this goal behind the Unsers, a family which my Dad has so much respect and love for.”\nRahal says to expect the unexpected Sunday with the new car — less downforce — in play.\n“It’s definitely giving us fits over the last couple of weeks just to figure out how this thing wants to be manhandled around the oval,” Rahal said. “The dynamic is very different than what all of us are used to so I think it’s going to make for a very exciting show for the fans who are here or watching at home. I think there’s a lot of reasons to believe that this race will be very unpredictable so from a fan perspective it should be exciting.\n“We need to be right there, in the top five with 50 laps to go to be in position to win.”\nRahal is an Ohio State football fan, so he has enjoyed the Michigan-Ohio State rivalry with the Buckeyes winning six straight and 13 of the last 14 games in the series.\n“I try as much as I can to get to Ohio State games, obviously it makes life easy to watch them in the Big Ten championship game since my residence is Indy,” noted Rahal. “As a Columbus boy I try to get back there as much as I can since I definitely miss home.\n“I think Ohio State is looking really, really, really strong. They have a lot of great players. (Detroit Cass Tech’s Mike) Weber’s a beast and they have a huge amount of talent. From what I hear, a couple of close buddies of mine work there and I think they’re feeling better than ever about their chances, so we’ll see.”\ndavid.goricki@detroitnews.com\ntwitter/DavidGoricki", "url": "https://apnews.com/37b3d46be379417abfa3b910ff019192"}