{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:08:04", "date_modify": "2020-05-04 20:08:04", "date_publish": "2018-03-28 15:13:00", "description": "NASHVILLE - This fall, a bronze plaque depicting 15-time Grammy-Award-winning singer and musician Ricky Skaggs will be added to the Rotunda wall at the Country Music Hall of Fame and Museum in...", "filename": "_283da76e7a3746e3bc6e16659a0e1abc_1588622884.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_283da76e7a3746e3bc6e16659a0e1abc_1588622884.html", "title": "Lawrence County, Ky., native Ricky Skaggs to be inducted into Country Music HoF", "title_page": "Lawrence County, Ky., native Ricky Skaggs to be inducted into Country Music HoF", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NASHVILLE - This fall, a bronze plaque depicting 15-time Grammy-Award-winning singer and musician Ricky Skaggs will be added to the Rotunda wall at the Country Music Hall of Fame and Museum in Nashville.\nAt a CMA-hosted press conference held Tuesday at the famed institution, Garth Brooks and Trisha Yearwood announced Skaggs, who is a native of Lawrence County, Ky., as one of three inductees for the Country Music Hall of Fame Class of 2018.\nLater this year, Skaggs will be inducted in the “Modern Era Artist” category, along with the late Dottie West in the “Veterans Era Artist” category and the late Johnny Gimble in the “Recording and/or Touring Musician” category.\n“I was totally shocked, and I burst into tears when I heard that I was gonna be the newest inductee into the Country Music Hall of Fame,” said Skaggs. “When I came to Nashville in 1980, I came to play music and hopefully get a record deal. All of that happened, but I never dreamed that I’d ever be a member of this hallowed Hall. Why me, and why now was going through my mind.”\nFormal induction ceremonies for Skaggs, West, and Gimble will take place at the Country Music Hall of Fame® and Museum in the CMA Theater in the fall. Since 2007, the Museum’s Medallion Ceremony, an annual reunion of the Hall of Fame membership, has served as the official rite of induction for new members.\nCMA created the Country Music Hall of Fame in 1961 to recognize noteworthy individuals for their outstanding contributions to the format with Country music’s highest honor.\n“There are so many others that have inspired me, encouraged me, ones that I’ve truly learned from, and ones that have made such great contributions to Country and Bluegrass music,” notes Skaggs. “I’m humbled and very grateful to soon be listed among my many heroes in this great Country Music Hall of Fame. What an incredible honor. Thank you Jesus, and thank you CMA.”\nTri-State fans will have a chance to see Skaggs in concert soon. Skaggs and Kentucky Thunder will be in concert with fellow Country Music Hall of Fame member, and Tri-State native Bobby Bare, who hails from Pedro, Ohio, just north of Ironton.\nThe Glockner Family of Dealerships and WNXT Radio present a Country Music Highway Live concert at 7 p.m. Friday, April 27, featuring Country Music Hall of Fame member Bobby Bare Sr., as well as 15-time Grammy Award-winner Ricky Skaggs and Kentucky Thunder, Nashville songwriter Rick Ferrell and pianist Jacob Tolliver, who was selected to be the understudy for the role of Jerry Lee Lewis in the Las Vegas production of “Million Dollar Quartet” and who most recently was on Season 14 of “American Idol.”\nTickets range from $35 to $85 for the concert at the Vern Riffe Center for the Arts, 940 2nd St, Portsmouth, Ohio. Contact the McKinley Box Office for seating and ticket information at 740-351-3600 or info@vrcfa.com.", "url": "https://apnews.com/283da76e7a3746e3bc6e16659a0e1abc"}