{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:58:58", "date_modify": "2020-05-04 19:58:58", "date_publish": "2018-08-15 00:00:00", "description": null, "filename": "2018_08__1588622338.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/08/15105925/48895-636132468306161250.gif", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_08__1588622338.html", "title": "The Spoils of War", "title_page": "The Spoils of War", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In a research paper titled “Trophies, Triumphs and Tears,” Harvard sociologist Hilary Levey observed a distinction between how kids and parents view participation trophies. The parents she interviewed often felt that awards for effort devalued awards for achievement, while kids were unlikely to reach that conclusion. It’s not that the children didn’t grasp the difference between participation and placement trophies. But only the adults believed that a scenario in which nobody walked away empty-handed made victory awards less meaningful.\nWhere along the trail from childhood to adulthood might people encounter this idea that the sweet-ness of triumph is proportional to the devastation of defeat? The answer is: everywhere. The notions that individuals are naturally locked into competition over scarce resources, that contests must have unqualified losers in order to also have genuine winners, that paltry compensation for losers incentivizes all competitors to perform better, and that safety nets of any kind undermine the will to compete — these are corner-stones of capitalist ideology. They manifest all around us in market society. And the participation trophy debate is no exception.\nIt’s no surprise that the people angriest about participation trophies also tend to cherish the idea that society is naturally unequal, and to disapprove of any collective attempt to “artificially” reduce material disparities. “‘Oh gee, everyone gets a ‘trophy’ isn’t healthy for society,” pronounced right-wing media personality Glenn Beck. “The world doesn’t shape-shift for you, you have to find your way in.” Beck has relied on similar reasoning to disparage welfare programs, saying, “The more you make people comfortable in their poverty, the more you strip them of the reasons of standing up on their own again.” In Beck’s view, the only way to incentivize a young athlete to play hard, or to compel a poor person to make some money, is to ensure that the consequences of losing are as humiliating as possible.\nAccording to the Paul Ryans of the world and various cottage-industry snowflake scolds, the root cause of poverty is an epidemic of unearned handouts — or, by another name, participation trophies. But for many conservatives, it’s more than just a comparison: participation trophies actually teach kids left-wing political values, like taxing the rich to pay for social programs. Right-wing radio personality Adam Carolla made this point, seamlessly trashing downwardly mobile left-leaning millennials in the process:\nYou get out into the real world and you realize, “I’m a fucking loser.” You’re not doing that well, you’re not making that much money. There’s no more participation trophies.… Instead of looking in the mirror and going, “Why am I not doing better?” you just find some guy who’s got more shit than you and go ‘Hey man, what do you need all that shit for?’ It’s the same as, “Hey man, what do you need an MVP trophy for?” Because I busted my ass, that’s why.\nMany liberals instinctively like the idea of participation trophies because they seem right and fair. They’re inclined to defend them, though they typically shift the debate to different terrain, retreating from political ideology into the realm of childhood development and self-esteem. They’re not terribly misguided: self-esteem is important, and we should structure childhood recreation in ways that foster a sense of belonging and confidence.\nHowever, there is an ideological component to the participation trophy debate. The notion that some people naturally have to lose everything in order to make high achievement possible is a fiction. All people deserve a decent and dignified life, for no other reason than because they are human beings. It’s completely possible for society to give it to them. That’s not a threat to individual accomplishment — it’s a precondition of individual flourishment for the majority of people.\nBeyond allegory, we want actual kids growing up to believe that prosperity is not a zero-sum game. It’s possible that participation trophies bring us a tiny bit closer to that vision. Perhaps, in a small way, they meaningfully assert the value of cooperation against the stream of alienating messages we receive about our place in the world under capitalism. When neighbors and fellow workers perceive each other as natural adversaries in a winner-take-all contest for a decent standard of living, unity becomes impossible and capitalists reap the rewards.\nIn 2016, Pittsburgh Steelers line-backer James Harrison announced on social media that he was returning his sons’ participation trophies. Children shouldn’t be awarded at all, he said, “until they earn a real trophy.” He added, “I’m not about to raise two boys to be men by making them believe they are entitled to something just because they tried their best.”\nWhy not? They may not be entitled to a placement trophy without actually placing, but aren’t they entitled to anything at all, any acknowledgment that they too put in time, training, energy, and ambition into making the game possible — that they too were citizens of the game?", "url": "https://jacobinmag.com/2018/08/the-spoils-of-war/"}