{"authors": ["Liza Featherstone", "Mike Davis", "Peter Frase", "Seth Ackerman", "Kristen R. Ghodsee", "Barbara Ehrenreich"], "date_download": "2020-05-04 19:59:10", "date_modify": "2020-05-04 19:59:10", "date_publish": "2018-11-29 00:00:00", "description": null, "filename": "2018_11_women-better-sex-under-socialism-review_1588622350.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/11/29185917/RIAN_archive_535377_Dancing_during_break_between_sessions_of_19th_Komsomol_congress.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_11_women-better-sex-under-socialism-review_1588622350.html", "title": "Bad Romance", "title_page": "Bad Romance", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Review of Why Women Have Better Sex Under Socialism (Nation Books, 2018).\nAmericans, or perhaps mostly those who are young and heterosexual, are suffering a sex drought. The reasons are complicated, but according to an exhaustive and copiously well-researched article by the Atlantic’s Kate Julian, the problem is a queasy cocktail of social alienation, technology, anxiety, depression and neoliberal pressure to succeed. And the Wall Street Journal reports that lingerie retailer Victoria’s Secret is struggling because “Sex Isn’t Selling.” Capitalism has been trying to sell sex since its beginnings. Now we’re not buying. Julian quotes the Swedish health minister after a recent study found a similar problem in that country: “If the social conditions for a good sex life — for example through stress or other unhealthy factors — have deteriorated… it’s a political problem.” In this context, Why Women Have Better Sex Under Socialism: And Other Arguments for Economic Independence, anthropologist Kristen Ghodsee’s short, crisp and wonderfully engaging polemic, couldn’t be more urgent. “Unregulated capitalism is bad for women,” Ghodsee argues, “and if we adopt some ideas from socialism, women will have better lives… yes, even better sex.” It’s a historically grounded argument, based on her extensive scholarship on the former USSR and Eastern bloc countries. Convincingly, Ghodsee makes the case that through publicly available childcare, full participation in the workforce, investment in women’s education, and robust feminist propaganda, socialist states made tremendous advances, even in quite patriarchal cultures, toward women’s equality. They also greatly improved the material quality of women’s lives. Maternal and infant mortality dropped and illiteracy essentially vanished. All this had tremendous implications for heterosexual sex: with men and women benefiting equally from public services like education and healthcare and from access to stable, decently paid work, women ceased to be dependent on men. Sex and love could be considered on their own terms, free from economic incentives. As Ghodsee bluntly puts it, “Women didn’t have to marry for money.” It’s easy to imagine that such conditions might improve women’s lives. Yet, does it go without saying that decommodified sex is necessarily better sex? After all, some sex workers and customers enjoy their encounters; some kept men and women probably do as well. I do not enjoy sex less if a man picks up the check (complicatedly, I might enjoy it more). So, luckily for those of us who need convincing, Ghodsee has strong evidence to support her claim that women had better sex under socialism. Of all the residents of the former Soviet bloc, it is East German women’s sex lives that have been the most robustly researched, and informatively contrasted with those of their less fortunate West German counterparts, who lived under capitalism (plus religiosity, an additional libidinal drag). In addition to policies like universal child care and female employment, the government did strong feminist ideological work, promoting gender equality and women’s independence as specific benefits of socialism, even propagandizing on the importance of men sharing domestic labor. Because East German women became economically independent of men, men were more sexually attentive and generous than men in the West. By contrast, with women depending on them for survival, West German men had little incentive to improve their bedroom game. In addition, life in the GDR was more relaxing than in the West, with little economic stress and an abundance of leisure time. This difference had clear and measurable results. Researchers found much higher rates of sexual satisfaction among women in the East than in the West. One survey found that 80 percent of East German women always experienced orgasm, compared to 63 percent in the West. In a particularly poignant divide, 82 percent of East German women in one study felt “happy” after sex, compared to just a little over half in the West. These statistics were (charmingly) used by the East German state to argue for the superiority of communism, and were received with defensive skepticism by the West German media. Ghodsee, no propagandist, repeatedly makes clear that even on the narrow terrain of this book, socialism wasn’t perfect. She admits that “Soviet sex sucked” under Stalin, with abortion illegal from from 1936 to 1955 and women’s equality a low priority. Ghodsee recounts the Soviet Union’s idealistic feminist beginnings, with Alexandra Kollontai’s vision of the comradely romantic love that the liberated socialist woman would enjoy, and how Stalin abandoned these these ideals in the face of economic constraints. And like most of the world for most of the twentieth century, the Soviet bloc wasn’t a great place to be LGBTQ, which must have significantly affected sex for millions. Except perhaps as a notional kink, totalitarianism is not hot. Ghodsee’s account of the repressive aspects of these regimes is a bracing reminder that sex needs libertarianism as well as socialism. The free-market libertarianism of the Koch brothers is, of course, deeply at odds with both socialism and good sex. But a social-libertarian commitment to letting consenting adults do as they please is vital. Patriarchal authoritarians who seek to control our sexuality and reproduction, whether Stalinists or contemporary Republicans, are the enemies of sex. Even states we don’t think of as oppressive sometimes police women’s sexuality harshly — take, for example, the punishing effects of the “Nordic approach” toward sex work. Most erotica was forbidden in the socialist countries. Yet there were important exceptions. Yugoslavia allowed some sex magazines. Elsewhere, sex manuals deeply attentive to pleasure were encouraged, and were best-sellers in the GDR and Poland, as Ghodsee wrote recently in the Washington Post. Every Bulgarian child knew where their parents’ copy of Man and Woman, Intimately was hidden.\nPleasure and Danger This book is a tonic for a badly ailing discourse. In recent years, women’s sexual pleasure has largely disappeared from left and feminist politics. Indeed, it has almost ceased to be thought of as a serious political matter. This erasure has been recent, even sudden, but we have been here before. Contrary to popular stereotype, sex, specifically women’s pleasure, was central to American second-wave feminism. (Except for a few outliers like Emma Goldman or Victoria Woodhull, women of the past are nearly always regarded as sexless prudes, probably because each generation is squicked by their mothers’ and grandmothers’ sexuality.) In consciousness-raising groups, women analyzed how patriarchy had confused them about their own bodies, correcting that confusion with mirrors. Books were written about the female orgasm, with diagrams showing where the relevant nerve endings might be found. Abortion on demand and access to birth control were central demands of the movement and explicitly linked to women’s sexual liberation. In the 1980s, however, facing right-wing backlash, American feminists retreated. The movement began to shrink from anything that seemed too slutty or insulting to conservative mores. I remember a woman who used to stand on the streets of New York City, yelling at people, especially women. “Sign the petition! Sign the petition!” she would bark at us, with the intensity of a Birkenstocked Cotton Mather, as we passed by, pushing into our faces a graphic depiction, from Hustler, of a woman being fed through a meat grinder. (That 1978 Hustler cover was a parody designed by Yippie feminist Paul Krassner, meant to critique the magazine’s exploitation of women; but such subtleties are easily lost in an outrage orgy.) If we declined, she would yell in our faces: “I hope you get raped!” (I remember stopping to read the petition but don’t remember what it said.) Camille Paglia made a short documentary, “Glenda and Camille Do Downtown,” in which she and her drag queen friend, Glenda Orgasm, instigate a brawl with the anti-pornography women. In a blend of tragedy and farce, part of the feminist movement had found common cause with the Right in demonizing pornography and getting “tough” on crime. They focused on male sexual violence against women as the primary instrument of women’s oppression, over anything else (never mind the workplace or the family). “Pornography is the theory, rape is the practice,” wrote Robin Morgan, editor of Ms. Magazine. Many feminists objected, both to the narrowing focus of the movement, and to the emerging view of sex as nothing but peril and trauma for women, arguing instead that sex was a source of both “pleasure and danger” (the title of a landmark feminist conference on sexuality from this period, as well as the anthology that came out of it, edited by Carole Vance). Some of these critics were academics, like Vance, while others, like Susie Bright, Amber Hollibaugh, and the late Ellen Willis (also women of the left), wrote for broader readership. The “pleasure and danger” camp, at first marginal, eventually enjoyed significant cultural and intellectual weight, aided by a growing and highly sex-positive queer culture, as well as by riot grrrl music, all of which had a huge influence on nineties feminism. (I was in my twenties during this decade and wrote some on these issues.) Some wrote personal essays and published them in zines and anthologies. We protested, ACT UP-style, to demand gay rights, resources for women’s health, funding for AIDS research and “abortion on demand and without apology.” We went topless to protests with the word “DYKE” written on our bellies. Women made feminist pornography. It would be easy to make fun of this period’s explosion of vibrator boutiques and easier still to mock the glossy magazine covers heralding the advent of “Do-Me Feminism.” But the idea that women had a right to sexual desire and joy, not defined by either male violence or male expectations, was an important intervention into the culture at large, as well as a re-intervention (after a brief Reaganite detour) into feminism itself. In recent years, however, feminism, including on the Left, has almost entirely abandoned the discussion of pleasure, returning to a fixation on male violence. While the #MeToo moment has led to some long-overdue action on workplace harassment, and made space for women to speak out against horrible abuses that had gone unexposed for too long, it’s also led to the return of a feminist discourse in which sex, for women, is once again seen primarily as a source of threat and oppression. This obscures many of our most cherished experiences — a criticism that the “pleasure and danger” feminists of the eighties and nineties lodged against the anti-porn obsessives — but even worse, threatens to erase pleasure from our utopian imaginings, encouraging us instead to settle for a society in which we are not raped. It’s a low bar — much too low — yet sadly, still unrealized by any society, socialist or capitalist. The #MeToo movement, like 1980s antiporn feminism, is right to insist that for sex to be “better” it must be consensual and free from fear. We shouldn’t lose sight of this, even while insisting on women’s right to pleasure. Strikingly, violence against women (domestic violence, rape, harassment) is absent from Ghodsee’s discussion. This is because, as she points out, the socialist states suppressed discussion of these issues. The material on East Germany makes some of the most compelling reading in Ghodsee’s book. Like any occupying army, the Soviets used rape as a weapon against the occupied in that country, with the full knowledge of the Soviet leadership. That means many German women’s introduction to “sex under socialism” was a horror; some historians have estimated at least hundreds of thousands of rapes, with some women being attacked multiple times. (Like anything concerning the former Soviet Union, the number has been bitterly contested, a kind of political football for those who would continually relive the Cold War.) Soviet war correspondent Natalya Gessen observed in 1945, “The Russians were raping every German female from eight to eighty…it was an army of rapists.” Given this traumatic beginning, the sexual well-being of women in what became the GDR is especially impressive. Of course, war is hell, and the Soviet soldiers were hardly the only rapists in World War II. (And, for context, they were absolutely plastered.) But the particular force and scale of the troops’ brutality suggests an acute failure on the part of Stalinist Russia to produce men who could imagine women as fellow human beings. I don’t fault Ghodsee for not discussing this ugly episode, but someone ought to mention it, so I’ll leave it here. None of this takes away from the many feminist achievements of the USSR and its Eastern bloc allies, nor from the fact that capitalist society has also failed far more spectacularly to recognize and develop women’s full humanity. That’s how we find ourselves in this odd moment when, Kate Julian reports, many women understandably prefer not to risk sex with young men who are so poorly socialized, porn-addled, aggressive and adrift from the IRL world that they don’t realize that you should probably ask a person what she enjoys before choking her in bed for fun. In addition to this kind of weird alienation, capitalism produces extreme economic vulnerability, which exposes women to even greater violence. Economic insecurity makes it harder to leave dangerous workplaces and relationships. Migrant farm workers and hotel maids are assaulted on the job far more often than white-collar women, and for all the media freakout over sexual violence on college campuses, college-aged women who are not lucky enough to be enrolled in school are 30 percent more likely to be raped, according to data from the Department of Justice’s National Crime Victimization Survey from 1995–2011. Jacobin writer Belén Fernández, writing about rape in Spain in a 2014 essay in Al Jazeera, viewed it in the context of neoliberalism in that country, observing the “violent severance of interpersonal bonds” and human solidarity in a society where capital reigns supreme.", "url": "https://www.jacobinmag.com/2018/11/women-better-sex-under-socialism-review"}