{"authors": ["Randy Erickson La Crosse Tribune"], "date_download": "2020-05-04 20:08:35", "date_modify": "2020-05-04 20:08:35", "date_publish": "2018-03-12 12:00:00", "description": "WEST SALEM, Wis. -- The Country Boom fuse was lit late last summer for what promises to be the La Crosse area’s biggest music event — by a country mile. This week, fans finally learn all the...", "filename": "_542b884afd71456786fe1f140e5f6505_1588622915.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_542b884afd71456786fe1f140e5f6505_1588622915.html", "title": "Country Boom headliners announced, ticket sales launched (copy)", "title_page": "Country Boom headliners announced, ticket sales launched (copy)", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WEST SALEM, Wis. -- The Country Boom fuse was lit late last summer for what promises to be the La Crosse area’s biggest music event — by a country mile. This week, fans finally learn all the long-awaited details for Country Boom, a two-day music festival to be held July 13-14 on the former Maple Grove Country Club grounds near West Salem.\nHeadliners for the festival’s first year include Randy Houser , Aaron Lewis , Tyler Farr , Riley Green and Ben Johnson on Friday and Josh Phillips , Phil Vassar , Michael Tyler , Faren Rachels and Chase Rice on Saturday. The talent lineup also will include local acts that will play on the main stage and in the VIP area, which will be in the space formerly occupied by the country club’s pool.\nFestival organizer Jon Holthaus acknowledged that its taken much longer than he would have expected to get to announcing artists, starting ticket sales and rolling out the website — www.countryboom.com . “We appreciate the support in the community and the patience,” he said.\nWhile the entertainers might not all be household names like Blake Shelton, the ticket prices for the event reflect that, coming in much lower than those of County Jam and other more established country music festivals. And prices will be lowest for those who buy early, going up after an introductory period of unspecified length.\nEarly-bird ticket prices are $25 for a one-day general admission pass or $40 for both days. Reserved seats go for $125 for the weekend, and there will be two sections of reserved VIP seating, with the closer seats going for $250 and the others going for $200. In addition to premium seating, the VIP passes also include beverages and access to the VIP building.\n“They’re going to get a heck of an experience with that,” Holthaus said of the VIP passes.\nThe festival also will feature a standing-room only “pit” directly in front of the stage, where people can pay $5 to $30 for a pass during any given artist’s set to get a more up-close experience. The view for people in the VIP seats won’t be impeded by people in the pit.\nA camping site for the weekend will go for $85, with a campground access pass costing $20. Only 1,300 camp sites will be available this year.\nHolthaus emphasized that people who buy VIP passes this year will have first crack at the VIP passes for future festivals, when he expects to have bigger names hitting the stage. “If you get in this year, you’re never going to get booted,” he said.", "url": "https://apnews.com/542b884afd71456786fe1f140e5f6505"}