{"authors": ["Charlie Brennan Staff Writer"], "date_download": "2020-05-04 20:06:59", "date_modify": "2020-05-04 20:06:59", "date_publish": "2018-08-01 00:19:50", "description": "Possibly the best present Clela Rorex received for her 75th birthday was one she learned about a week later — and was actually years in the making. On July 23, the Keeper of the National...", "filename": "_2beb5302d7254ea5ae6a16581914261f_1588622819.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2beb5302d7254ea5ae6a16581914261f_1588622819.html", "title": "Boulder County Courthouse Gets History's Nod at Federal Level", "title_page": "Boulder County Courthouse Gets History's Nod at Federal Level", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Possibly the best present Clela Rorex received for her 75th birthday was one she learned about a week later — and was actually years in the making.\nOn July 23, the Keeper of the National Register officially approved an amendment to the Boulder County Courthouse’s place on the National Register of Historic Places recognizing its significance to Colorado LGBTQ history and civil rights struggles. It did so for Rorex having issued the state’s first same sex marriage licenses there 43 years ago, as the county clerk and recorder at that time.\nJuly 23 is the date Rorex turned 75, but official word of the action did not reach Colorado until Monday.\n“It was very coincidental that they approved it on my birthday,” said Rorex, now a Longmont resident. “I’m surprised Trump did not put a halt to it.\n“I was a little worried whether the Trump administration would approve it, but I guess it fell under the radar. I was only notified yesterday.”\nFans of numerology would also join Rorex in appreciating that recognition for something she did in ’75 took place on her 75th birthday. But she hastened to say, as she has before, that this is a big moment for Boulder County at large, not herself personally.\n“It’s not me,” Rorex insisted. “But it was so nice of whoever really got the ball rolling on making that amendment, and it should have been done.”\nThe Art Deco-style Boulder County Courthouse, at 1325 Pearl St., was built in 1933 by local architect Glenn Huntington, to replace its predecessor, which burned in 1932.\nInitiated by History Colorado\nThe impetus to seek enhanced recognition by the National Register for the courthouse where Rorex issued those half dozen licenses — before ceasing to do so after an adverse opinion was issued by then-Colorado Attorney General J. D. MacFarlane — came from Erika Warzel, national and state register coordinator for History Colorado, and her predecessor, Astrid Liverman.\nWarzel said that it was part of a larger initiative launched by her office to seek recognition for communities she and Liverman knew to be under-represented by the National Register — LGBTQ, women’s history, Asian American/Pacific Islanders, African-Americans, Latino-Hispanic and urban Native Americans.\n“As part of that, our office had done some previous research into what are well known places in LGBTQ history, as a starting point,” Warzel said. “And this certainly came up as one that was very well known, that we could easily pull together to get the ball rolling.”\nAlso gaining recognition from the National Register through the same effort was the First Unitarian Society of Denver, in July 2017. That was for its church having hosted the April 1975 marriage of Anthony Corbett Sullivan and Richard Frank Adams. Earlier that day, they were the fifth couple to receive their license from Rorex.\nThe marriage of Sullivan and Adams received much-belated validation by the U.S. government in April 2016 — four years after the death of Adams and 41 years to the day after their wedding — when the U.S. Customs and Immigration Service approved Sullivan’s green card, following years of court battles over the couple’s right to stay in the country.\nThe couple’s attorney cast the green card’s long-sought approval as a retroactive affirmation of his clients’ 1975 marriage. And supporters of Rorex’s actions that year see it, by extension, also as validation of the licenses that she issued.\nGood news in bad news era\nOn May 18, the Colorado Historic Preservation Review Board unanimously approved forwarding the amendment to further recognize the courthouse for consideration by the National Park District, which maintains the National Register. It was already on the National Register by virtue of being located in the Downtown Boulder Historic District.\n“It’s certainly no surprise” that the federal approval came through, “but it’s very satisfying to be able to have this recognition,” Warzel said.\nThe amendment for the courthouse’s historic status had been strongly supported by local LGBTQ advocates.\n“In a world that seems so full of bad news these days, it’s heartening to know that the work that has been done before us matters, and continues to have a positive impact today,” said Mardi Moore, executive director of Out Boulder County.\nOn her Facebook page , Rorex on Monday linked to a Wikipedia listing of more than 30 locations that have received recognition at the federal, state, county or municipal level as having importance to the history of the LGBT civil rights movement, such as the Stonewall Inn in New York City, the Walt Whitman House in Camden, N.J., and jointly, the Castro Camera and Harvey Milk Residence in San Francisco. Rorex believes the Boulder County Courthouse merits inclusion with such well-known landmarks.\n“I notice on the list that a number of them had been designated in 2018,” she said.\n“So it looks like people are kind of catching up, and putting the history out there.”\nCharlie Brennan: 303-473-1327, brennanc@dailycamera.com or twitter.com/chasbrennan", "url": "https://apnews.com/2beb5302d7254ea5ae6a16581914261f"}