{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:10:12", "date_modify": "2020-05-04 20:10:12", "date_publish": "2018-10-06 00:00:00", "description": "[Thumbs down] We’ve heard of police officers wearing body cams, but booty cams is something new. A Houston Police Department officer was caught on video apparently trying to snap a pic of a...", "filename": "_55014bfbe18245d1b358dc2cd42f7468_1588623012.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_55014bfbe18245d1b358dc2cd42f7468_1588623012.html", "title": "Editorial Thumbs up and down", "title_page": "Editorial Thumbs up and down", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "[Thumbs down] We’ve heard of police officers wearing body cams, but booty cams is something new. A Houston Police Department officer was caught on video apparently trying to snap a pic of a woman’s behind at the Drake concert Tuesday night. HPD is launching an internal investigation.\n[Thumbs up] If you’re looking for the smartest place in Texas, it isn’t the 40 acres in Austin or the storied cloisters of Rice University. Instead, head for the south Texas town of Alice — population 19,104 — which is the birthplace of two Nobel Prize winners. Robert F. Curl Jr. was honored with a Nobel Prize in chemistry in 1996 for his work on carbon molecules known as buckyballs, and James P. Allison won a Nobel for his work in medicine this year.\n[Thumbs down] Alice is also the hometown of Reality Winner, the former American intelligence specialist who leaked important National Security Agency documents to the press revealing that at least one U.S. voting software supplier had been accessed by Russian hackers during the 2016 election. She is spending more than five years in jail for trying to bring the truth to light.\n[Thumbs down] Speaking of election interference, thousands of Texans had their voter registration forms rejected after trying to sign up online. Apparently state lawmakers think voters want the nostalgic experience of voting for W. Lee “Pass the Biscuits, Pappy” O’Daniel. Why else would we be forced to register via snail mail? Here’s a hello to the Legislature: It isn’t 1938 anymore! Let people register online. More than 2,000 potential voters who tried to fill out their forms at Vote.org will have to re-register. To check your own registration status, go to HarrisVotes.org. Tuesday, Oct. 9 is the last day to register to vote.\n[Thumbs down] What’s the deal with Texas politicians being stuck in the past? Washington Post reporter Dave Weigel noted last week that Attorney General Ken Paxton — who has been indicted for fraud — still makes multiple references to fighting the Obama administration on his campaign website. Then again, maybe it is part of a clever plan by Paxton’s lawyers get him off by making an insanity plea: We swear, judge, he doesn’t even know what year we’re living in or who the president is!\n[Thumbs down] How do you say “he visited all 254 counties in Texas” in Farsi? Apparently a right-wing, dark money group tried to hire a voice actor to impersonate Iranian President Hassan Rouhani to cut a fake ad endorsing Beto O’Rourke for Senate. No, we’re not kidding. However, the plan fell through and the ad was never made. “So popular even the Iranianpresident likes him” doesn’t seem like a particularly damaging message, but who understands politics anymore.", "url": "https://apnews.com/55014bfbe18245d1b358dc2cd42f7468"}