{"authors": ["Kori Tuitt", "Ktuitt Lowellsun.Com"], "date_download": "2020-05-04 20:10:29", "date_modify": "2020-05-04 20:10:29", "date_publish": "2018-09-09 12:25:36", "description": "TEWKSBURY -- As a first-grader at the Trahan Elementary School, Jamie Blake had a vision for her future. Twenty-five years later, that vision is coming into focus. Blake, 31, has long had...", "filename": "_39ee21cfa00a498db5cbbf44ac9f5958_1588623029.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_39ee21cfa00a498db5cbbf44ac9f5958_1588623029.html", "title": "Tewksbury Native's First Book Will Highlight Festival", "title_page": "Tewksbury Native's First Book Will Highlight Festival", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TEWKSBURY -- As a first-grader at the Trahan Elementary School, Jamie Blake had a vision for her future. Twenty-five years later, that vision is coming into focus.\nBlake, 31, has long had the goal to write children’s books and her debut novel is set to publish on Oct. 1.\nIt was grief that prompted Blake to write the story of “The Last Ghost” in her late teens and early 20s. She categorizes the young adult novel as urban fantasy. It’s “the world we live in now with a magical element in it,” she said.\nIn the story, 22-year-old Christian Orland is killed in a car accident. Another character, Woe, is assigned Orland’s death, but knows something is off.\nThroughout the novel, Woe tries to solve the mystery of how his case became hers by teaming up with the memory of Orland’s life.\n“I lost a few friends of my own when I was a teenager and I felt like I read a lot and what I was reading it didn’t necessarily make me feel better,” Blake said. “Or things that adults would say to me, like ‘things happen for a reason,’ didn’t make me feel better either.\n“So, I decided I would try to write the book that would have comforted me in that time,” she added.\nThe Tewksbury native now lives in Albany, New York, but is coming back to her hometown to participate in the library’s Book Festival on Saturday, Sept. 22.\nBlake -- who many may remember by her maiden name, Frank -- still comes to Tewksbury to visit her parents who still life in town.\nBeing able to come back to her roots to share this accomplishment is special, she said, especially in the context of the book.\n“The characters, they live in a suburb of Boston, an imaginary suburb of Boston,” she said. “But, I thought about Tewksbury a lot when I thought about these characters’ homes. Now, I can go back to the town that gave me so much.”\nBlake finished the first draft she was 22, shortly after earning her undergraduate degree.\nOver several years after that, between other projects and responsibilities, she edited the book.\nWhile it is a ghost story, Blake is quick to say it won’t spook you. The writing process was cathartic for her and she hopes readers are left with something positive at the end of the story.\n“It’s mostly just about connections that we all have with people and if somebody is feeling sad about losing someone they care about, this was specifically written for people to address that need,” she said.\n“It hopefully will provide some comfort for people that will read it.”\nFor more information on Blake and her novel, visit www.jamiecblake.com .\nFor more information on the Tewksbury Public Library Book Festival, visit www.tewksburypl.org .\nFollow Kori Tuitt on Twitter @KoriTuitt.", "url": "https://apnews.com/39ee21cfa00a498db5cbbf44ac9f5958"}