{"authors": ["Marcus Barnett", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Adam J Sacks", "Chris Maisano", "Adam Szetela", "Luciana Castellina", "Bhaskar Sunkara"], "date_download": "2020-05-04 19:56:02", "date_modify": "2020-05-04 19:56:02", "date_publish": "2018-02-12 00:00:00", "description": null, "filename": "2018_02_bolton-socialist-club-labour-party-working-class-culture_1588622162.html", "image_url": "https://images.jacobinmag.com/2018/02/12112011/labour.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_02_bolton-socialist-club-labour-party-working-class-culture_1588622162.html", "title": "The World Within a World", "title_page": "The World Within a World", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nWhen Alice Foley, a young cotton-spinner from the Northern English town of Bolton, was somehow convinced by her sister Cissy to attend a meeting on the ideas of William Morris, her disgust at the evident atheism of the proceedings was so violent that she left the meeting, fleeing to a church in order to pray for her sister’s soul. Like her mother, Alice was deeply prejudiced against socialism, convinced that the cultural and economic tracts her sister voraciously consumed were nothing but a cynical attempt at social climbing. When Cissy joined the Bolton Socialist Club, a small social club in the town’s center, she became the black sheep of the family. But, over time, Alice began to notice significant changes. Cissy’s intellectual fluidity was clear, and was earning her respect from the upper-class Suffragettes she associated with. She became influential on the factory floor, where her ability to lead her fellow workers with tactical prowess assured her rise through the male-dominated leadership of the local cotton workers’ union. Alice was intrigued by the type of person Cissy was becoming and, following their father’s death, she picked up the courage to begin attending the Socialist Club and its Socialist Sunday School. The experiences open to the Foley sisters in the Socialist Club were opportunities unavailable to people of their class anywhere except there. In the Club, they found self-taught workers teaching comrades how to play musical instruments. Sympathetic “non-pols” signed up to Esperanto lessons and shorthand classes, and a socialist steel-foundryman would patiently teach verses of Keats all year round. A croft-worker who spoke in Lancashire dialect made a particular impact on Alice: to the young and curious socialists of Bolton, he would give magic-lantern shows of the constellations, displaying a scholarly understanding of the planets and their moons. She later recalled his outlook: “Sithee, lasses, isn’t that a marvellous seet; a stupendous universe, yet we fritter our lives away i’ wars and petty spites!”\nBedrocks of the New Jerusalem The culture Alice encountered, and those who helped to cultivate it, were symbolic of an environment established by socialists in working class communities across Britain, one that encouraged the exploration of bolder social possibilities. In these socialist bases, workers were encouraged, developed, and emboldened to take control of their future. “We were not at all sanguine that the New Jerusalem was established in our midst,” Alice reflected in her memoirs, “but with a champagne consciousness we eagerly anticipated its imminent creation!” In a recent essay entitled “Corbynism From Below,” Salford Labour Party member Tom Blackburn thoughtfully elaborates on how today’s left might develop a strategy that goes beyond formally electoral concerns. Labour, in Blackburn’s eyes, can grow and maintain its mass credibility by attuning itself to the needs of the people who vote for it even when out of power. In emphasizing the need for Labour to adapt and become a party capable of direct intervention in community struggles, Blackburn references the Italian Communist Party (PCI) as a potential model to emulate. Indeed, the PCI’s history is an inspirational one: a mass oppositional force with a social, cultural and economic infrastructure, totally separate from the “official” Italy of NATO, Operation Gladio, and Coca-Cola, whose popolo comunista (to paraphrase Italian filmmaker Pier Paolo Pasolini) constituted a “country within a country” and an antidote to Italy’s ills. However, Blackburn’s article could have set its sight far more locally — on the worlds of labor that once flourished in the United Kingdom — and particularly in his own backyard of Salford. A seminal figure to emerge from this milieu was Walter Greenwood, today remembered for his epoch-defining social realist masterpiece Love on the Dole. Greenwood’s path into literary creation was not by chance or quirk, but the culmination of a youth spent among the Salford socialist movement. Love on the Dole was spawned from Greenwood’s desire to faithfully document his proud city and to suggest its possible heroic future transformation, whatever the pettiness or pessimisms displayed by his characters. Greenwood was not much of a party-political man, having joined neither Labour nor the Communists (until being encouraged to stand for Salford Council on a Labour ticket). Rather, his political consciousness was molded by his ownership of a share of Hyndman Hall, which he joined at the age of fourteen. Situated on an arterial road of Salford where today a fire station closed by austerity stands, Hyndman Hall — which briefly changed its name to that of a local antiwar hero, Bill Horrocks, after the previously-honored Henry Hyndman, leader of the Social Democratic Federation, threw his support behind World War I — was an impressive space. Boasting three floors of use for workers including a boxing gym, a meeting and rehearsal space, and a ground floor pub, the legendary singer Ewan MacColl would recall it in his memoirs as a unique and formative environment. MacColl — then known as Jimmy Miller — felt a particular gratitude to the Hall for screening Soviet avant-garde films, and for allowing him and his unemployed friends to create an agitprop theater troupe, The Red Megaphones, in the spare room. Fondly, he recalled the folk songs that blacklisted Scottish engineering workers like his own father would perform late into the night by the bar. This experience of warmth and cultural immersion, so starkly opposed to the drudgery of the outside world, spurred Jimmy to sit down in Hyndman Hall’s bar one evening and pen an early draft of “Dirty Old Town,” the warm but disconsolate anthem of northern industrial discontent. Another son of Salford, unemployed seaman Joe Norman, also began a lifelong involvement in socialist politics through Hyndman Hall. After the Navy made Norman redundant, he began attending National Unemployed Workers Movement meetings in the hall. Though he considered himself an “ordinary lad” in contrast to some of its more flamboyant characters, his class instinct matured in the surroundings of this socialist institution. Advancing in ostensibly apolitical activity such as boxing and darts, Norman began to think of himself more and more as a socialist. Soon enough, as a member of Hyndman Hall’s boxing team, he was sent on a delegation to the Soviet Union — where he beat the welterweight champion of the “socialist sixth of the world.” Spurred on by his experience, he befriended Eddie Frow, a young unemployed engineering worker and enthusiastic Marxist autodidact. Over glasses of tap water at the Hyndman Hall, Frow encouraged Norman to root his understanding of trade unionism in dialectical materialism, and to consider wider social issues. It was friendly, sincere conversations such as these that spurred Norman in to a lifelong involvement in labor politics, involving himself in the struggle against fascism and ultimately travelling to fight with the International Brigades in Spain, where he would narrowly avoid a firing squad during his time as a secret prisoners’ resistance committee representative in a concentration camp. Embedded at a local and national scale, the socialist movement engaged in all sorts of collective endeavors. Through boxing and cycling clubs, gyms, pubs, libraries, musical groups, and schools, it offered itself as a tool of improvement in working class life. This ecosystem of socialist culture helped pave the way for seemingly ordinary people such as the Foley sisters, Joe Norman, and Ewan MacColl to lead extraordinary lives. The meaning of this work was not only to develop a toughened core of socialists and trade unionists, but to show to a wider periphery of the population that socialism was worth it — it could, and would, make your life better, should you place your faith in it.\nThe Decline As the Labour Party developed into a party of real administrative clout following World War II, this infrastructural work was deemed no longer strategically worthwhile. Indeed, it was even attacked by Labour right-wingers such as Denis Healey, whose infamous 1959 speech in favour of “electability” denounced the perceived purist insularity of organizations like the Socialist Sunday Schools. The New Left was to follow in the sixties, with its libertarian antagonism to traditional labor movement institutions. For many in its ranks both western social democracy and Soviet communism were grey and uninspiring, a perspective which led many radicals to remove themselves from building movements which were both nationally relevant and locally rooted. While E.P. Thompson was passionately committed to building a more humane form of the mass Communist movement that inspired his younger self so deeply, one could imagine his disillusionment — portrayed so sadly in Christos Efstathiou’s recent biography — with his fellow New Left colleagues and their lack of political will. The rootedness of the socialist movement, which was hard fought for, became taken for granted. In some respects this was befitting of a moment in history when few young people believed that the postwar welfare state could vanish, or that the Soviet Union could someday be replaced by a far more antidemocratic and dystopian entity. Young socialists of today have inherited the landscape left behind by this lethargy — one where the Left has too often retreated into sectarian myopia or academic minutiae. It is an ossified environment which too rarely takes seriously the tasks of building what its predecessors emphasized. A striking example of this was offered in a recent speech by young Merseyside activist Beth Redmond. Becoming involved in socialist politics out of anger at the state of the world, Redmond was confused about the expectations placed on her to accept a “revolutionary starter-kit”: a reading group, a bundle of papers to sell, a party line, and a seat in a student meeting of eight. The subculture of the British left meant that her social life of going to watch football or music with her non-political friends was increasingly replaced with newspaper sales and unimaginative topical meetings. Attempts at blending new political friends with her old ones was met with hostility. Being a revolutionary, it seemed, meant gathering contacts — not enjoying the hobbies and cultural pursuits most people pursue. Thankfully, one of Corbynism’s most impressive features has been its ability to transcend this decaying culture and the self-appointed leaders that sustained it. The project is now heading towards its next major undertaking, the Labour Party’s Democracy Review. Led by former left-wing MP Katy Clark, it has received a number of interesting proposals. Prominent among them is an article by Max Shanly, whose arguments for reform of Young Labour take inspiration from the socialist movement’s earlier incarnations: Some studies estimate that over 120,000 people have died as a result of Tory austerity policies — it is not acceptable now (if it ever has been) to simply tell Labour voters to wait for the next election for a change in their lives to come. The people need the aid of the Labour Party now​. Today’s “red bases” are small but growing. One example is the series of Socialist Food and Clothing Banks that have popped up in England’s northeast to the terraces of fan-owned football clubs like FC United of Manchester, the “red rebels” whose fans chant songs penned by Ewan MacColl and Woody Guthrie, collect money for refugees, and operate a food bank. In Manchester’s southern districts, the Chorlton Socialist Club organizes concerts by prominent DJs and bands to weave together youth culture with socialist organization. Meanwhile, in Walter Greenwood’s old stomping ground, the Salford Community Theatre runs a non-professional, working class theater organization led by Momentum activists. Last year, it staged a much-heralded community theater production of Love on the Dole last year, with the entire cast made up of local working people. Perhaps most importantly of all, Labour have launched a “community organizing unit.” This is a direct attempt to reverse the drift away in support for the party in the most deprived, often geographically isolated areas of the country that were once the bedrocks of British socialism. If utilized properly, Corbyn’s community organizing plan could be instrumental in the revival of British socialist politics. A popular left-wing politics placed convincingly in a local context, it aims to inspire confidence and self-activity in communities beset by demoralization and far-right activism. Concrete steps forward today could help revive long-dormant hopes of a better tomorrow in many parts of Britain, and would honestly confront the inertia facing the labor movement in so many parts of the country. As newly elected MP Laura Pidcock recently remarked, “We need to get rid of this awful, destructive government . . . but we don’t have to wait [to] be effective locally.”", "url": "https://www.jacobinmag.com/2018/02/bolton-socialist-club-labour-party-working-class-culture"}