{"authors": ["Jasper Scherer"], "date_download": "2020-05-04 20:14:01", "date_modify": "2020-05-04 20:14:01", "date_publish": "2018-04-30 01:28:38", "description": "The horse sped around the edge of the arena, kicking dirt onto the spectators gathered along the low, nearby wall while two charros corralled the horse onward. As the animal approached, Luis...", "filename": "_d83c134a197f4288ae29533f23328819_1588623241.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d83c134a197f4288ae29533f23328819_1588623241.html", "title": "Charros and escaramuzas excite crowd at fan-favorite Fiesta Charreada", "title_page": "Charros and escaramuzas excite crowd at fan-favorite Fiesta Charreada", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The horse sped around the edge of the arena, kicking dirt onto the spectators gathered along the low, nearby wall while two charros corralled the horse onward.\nAs the animal approached, Luis Parra Villanueva stood several feet from the wall and twirled his rope in a sequence of pronounced gyrations. Calculations like the diameter of the arena and the horse’s speed flashed through Villanueva’s mind, now a subconscious process after years of practice that began at age 7 in Guanajuato, Mexico.\nIn one of the more dramatic moments of Sunday’s Day in Old Mexico — a rodeo-type performance showcasing the skills of some of San Antonio’s most talented charros — Villanueva, 28, lassoed the front legs of the horse again and again, gently bringing the speeding animal to a halt each time.\n“It’s a sport, but it is also an art. The thing that we do with the rope, you have to develop that skill since you were a young guy,” Villanueva said.\nHis perfect record drew escalating cheers from the crowd of about 2,500, until they began casting hats into the arena — the highest honor any competitor can receive, said Americo Garcia, a longtime attendee and enthusiastic hat-tosser.\nThe nine-event Charreada, put on by the Asociación de Charros de San Antonio at Charro Ranch on the South Side, included “piales en el lienzo,” where the horseman aims to rope the horse’s hind legs, and “escaramuza,” where a team of female riders performs a synchronized equestrian exhibition.\n“All the events are ranch work-oriented. Everything that’s done in the arena was done in the field for a purpose,” Garcia said, explaining that ranch workers might catch cattle using the techniques observed Sunday, often to brand or castrate the animals.\nThe multi-hour event drew much of the usual crowd, including 84-year-old Raul Gaona, the announcer who has been involved with the asociación for about 40 years, and 85-year-old Carl Rodriguez, the only living member of the asociación’s founding group.\nBut then there were the first-timers, many of whom attended the event with kids and spouses. Vanessa Gil, 38, attended with her husband and two children, and was particularly impressed by the escaramuzas.\n“The guys are good, too, but I liked the girls better,” Gil said.\nHer 6-year-old daughter, Sophia, said she wanted to take home one of the horses. Her favorite event: “The one where he was trying to get the wild horse.”\n“I like wild horses,” Sophia said. “And I like cowboys.”\nSome Fiesta dignitaries were honored at the event Sunday, including King Antonio XCVI Richard Sparr. Past royalty dropped in to take in the festivities, too, including Rey Feo LXIV Richard Ojeda, 63. He said he enjoys Charreada for its rustic and primitive nature — and for the performances and style unique to the event from American rodeo.\n“Everything’s real different,” Ojeda said. “But the beautiful thing is just the costumes and the horses. You’ll see some of the prettiest horses in San Antonio here.”\nJasper Scherer is a San Antonio Express-News staff writer. Read more of his stories here. | jscherer@express-news.net | @jaspscherer", "url": "https://apnews.com/d83c134a197f4288ae29533f23328819"}