{"authors": ["Local Columnist Willie Mae Samuel"], "date_download": "2020-05-04 20:27:53", "date_modify": "2020-05-04 20:27:53", "date_publish": "2018-09-16 05:00:00", "description": "We all feel blessed to have a pioneer-warrior like Joyce P. Smith leading us and guiding us on this restoration journey. Those of us in this community should give thanks for having people who have...", "filename": "_bf2e7c78a1e44e73a8d387dcac17a52e_1588624073.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bf2e7c78a1e44e73a8d387dcac17a52e_1588624073.html", "title": "Visionaries are Special", "title_page": "Visionaries are Special", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "We all feel blessed to have a pioneer-warrior like Joyce P. Smith leading us and guiding us on this restoration journey. Those of us in this community should give thanks for having people who have been given missions and visions and are willing to go the distance to accomplish them.\nOnce she entered the race there was no stepping back or turning around. We do not have the words to adequately thank Mrs. Smith for her dogged determination to rally the necessary help to restore the first-grade classroom of Rosenwald School in the Cave Spring area.\nAt this time of her life, she should be enjoying her freedom and relaxing, but instead she saw a piece of history that could be restored for reasons of posterity. Not just for the community of Cave Spring and the surrounding areas, but for the world to know that there was a great philanthropist, Julius P. Rosenwald, as well as an educator by the name of Booker T. Washington who gave of themselves and much of their possessions for such a time as that was in the 1920s.\nThese two men felt the pain and ignorance of a people in an oppressed situation and it moved them to action. Five thousand schools were built in the South for oppressed children. Rosenwald realized that he needed to connect with an educator who had the same love and desire as his as well as educational experience and a connection with the black community. He connected with Mr. Booker T. Washington and together they moved.\nWe do not keep this history alive to wallow in the misery of negatives, but to allow it to be a revelation or a compelling force, revealing what compassion can help us become.\nThis Fairview/E.S. Brown School means so much to the many people who passed this way. When speaking with Joyce, her beliefs are clear. She believes that each principal, teacher, parent and student left a piece of themselves, and that those pieces must be preserved. When she looks at what is left, she sees so many fingerprints and footprints, and anyone who loves history cannot stand idly by and watch the historical school fall to the ground as if it meant nothing to the thousands of oppressed people impacted by it.\nWhen looking at her face, one sees in her that spirit of pride, dignity and love that is still lingering concerning the kudzu-infested site. There is a chimney still standing and one can only imagine how many cold and shivering bodies were warmed in front of that chimney over 90-plus years ago.\nAfter the Fairview/E.S. Brown experiences, the parents and teachers sent the children off to various places and stations each year saying, “Go learn and grow and build.” They were saying go and learn more than we were able to teach you at Rosenwald School, but we gave you a start. We gave you enough to grow on and to build bigger dreams for others: bigger schools, bigger opportunities. Joyce sees this as an opportunity for us to expand on the Rosenwald experiences of touching lives even in the future.\nWhen looking at the rocks that remain, Joyce states that she sees the eyes of little ones in the future asking, “What meanest thou these stones?” Because the community has responded to her plea to press forward and continue the restoration project, we will be able to have the answer. We can show and tell them how we got over. These little ones from everywhere will be able to walk inside the restored building and examine the resource material that will be housed there. Resource classes will be held there to help inform travelers about what happened there when most of us are no longer around.\nWe are and have been motivated by the Joyce Smith spirit, and we rally behind it because we, too, believe and hold dear in our hearts what she believes. A man without a dream is like a bird without wings or a ship without a sail. We pledge our effort to that spirit and will attempt to be the wind in her sail or a feather in her wings.\nJoyce, we bid you strength in the effort for the restoration project. We know that the next phase has just begun. We say “good morning” to you, the Cave Spring community, and those across the vast horizon, because we will treat this as a new day dawning upon us, calling on us for the restoration of all things honorable, good and pure and true in the hearts and minds of men and women who grew up here.\n“In everything give thanks: for this is the will of God in Christ Jesus concerning you.” — 1 Thessalonians 5:18.\nWillie Mae Samuel is a playwright and a director in Rome.", "url": "https://apnews.com/bf2e7c78a1e44e73a8d387dcac17a52e"}