{"authors": ["Rachel Rosenbaum", "Rrosenbaum Appealdemocrat.Com"], "date_download": "2020-05-04 20:10:06", "date_modify": "2020-05-04 20:10:06", "date_publish": "2018-03-22 04:17:00", "description": "Editor’s Note: This is the first of two stories concerning a claim and allegations made by the former Sutter County district attorney’s chief investigator against the county. The second part,...", "filename": "_ecc099e343e445edaa3fb47ebed828bf_1588623006.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ecc099e343e445edaa3fb47ebed828bf_1588623006.html", "title": "Claim for $1 million denied by Sutter County", "title_page": "Claim for $1 million denied by Sutter County", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Editor’s Note: This is the first of two stories concerning a claim and allegations made by the former Sutter County district attorney’s chief investigator against the county. The second part, concerning additional allegations of instances of improper behavior, will be published in the Friday edition.\nSutter County rejected a claim for $1 million filed by a former chief investigator with the district attorney’s office.\nJason Parker’s claim alleged he was unfairly treated and that retaliatory measures were taken against him for whistleblowing. Parker’s attorney, Chris Carlos, has indicated that a second claim will be filed and that if it is rejected there will be further litigation.\nIn justifying his claim, Parker enumerated alleged inappropriate behaviors and actions by District Attorney Amanda Hopper, Sutter County Counsel Jean Jordan and others. The 32-page claim listed a number of allegations, including retaliation, a hostile work environment and unlawful termination.\nParker was placed on leave last year. He said he was officially fired as of Jan. 26.\nParker’s action was filed Jan. 16 and the county replied in a March 6 rejection that the claim was filed in bad faith and without reasonable cause.\nThe day before the county rejected the claim, it also was also ruled that the claim was filed in an untimely manner and stated Parker had to have filed it within six months of the date after the occurrence. Parker’s claim alleged the misconduct started on July 17, 2017.\n“It was actually filed one day before the six months was up,” Carlos said in an email. “The county is just wrong about the claim being filed untimely.”\nCarlos said that they have a right-to-sue letter from the California Fair Employment and Housing Agency, and that they intend to file another claim for unlawful termination.\n“Once the county rejects the second claim, as they always do, the lawsuit will be filed,” he said.\nCounty officials, including Jordan and Hopper, when contacted about the claim and possible lawsuit, said they were limited in what they could comment on.\nJordan said in an email Monday that her department provides legal services to the county and to county officers, so she is bound by a professional conduct code and must maintain the confidences of her clients.\n“Accordingly, I am unable to comment on any issue about which I have provided legal advice to the county, nor am I able to comment on any matter that involves an employee’s Constitutionally protected right to privacy,” she said.\nHopper provided limited replies to various points in the claim.\nParker alleges that the catalyst for what he says was his unlawful termination was when he had a private conversation with Hopper about a relationship she had with another department employee, which appeared inappropriate and was affecting other employees.\nHe said that Sutter County district attorney’s investigator Brandon Oakley was frequently in Hopper’s office behind closed doors and it appeared inappropriate. Parker noticed that Hopper was upset by the confrontation.\nHopper was asked what started the contention between her and Parker.\n“I had a professional, working relationship with Mr. Parker,” she replied in a written response. “The events that led to Mr. Parker’s termination are part of a confidential employee action.”\nBudget issues\nIn the claim, Parker also alleges that in June 2017 Hopper lauded the accomplishments of the investigations unit and used favorable statistics to request an increase of $50,000 in the overtime budget. While she had allegedly consulted Parker the year before to ensure accuracy, he claims she did not for the 2017-18 budget.\nAccording to his claim, he later saw the budget proposal and realized Hopper lied and exaggerated the accomplishments, including that DA investigators had solved multiple murder cases that were incompletely investigated by other agencies.\nParker alleges that investigators worked alongside the Yuba City Police Department and solved one murder that hadn’t been completely investigated because of insufficient resources.\nAccording to the budget, which can be found on the Sutter County website, the $50,000 increase in overtime was necessary “for proactive law enforcement efforts that require lengthy after-hours investigations and to allow employees to complete duties despite the time waste of travel to court because location needs remain unmet.”\nIn reply, in her written statement, Hopper said there had not been a sufficient overtime budget in the previous year. She also said there have been some proactive investigations this year but none of the magnitude of a sex sting operation in 2016 that netted 32 arrests.\n“This has been a year of increased productivity and casework,” she said. “We have experienced an increase in trials, complexity of cases, implemented a new case management system which includes the ongoing transition and training of our staff, including transitioning to a paperless system, and we have experienced understaffing. This has resulted in more time and effort spent on existing cases and less opportunity for proactive efforts. Subsequently, much of the requested overtime budget has not been spent.”\nShe said the accusation of her lying about solving multiple murder cases was false.\n“I am extremely proud of the work my investigations unit did to bring a number of homicide cases to closure and prepare them for a successful prosecution,” she said.\nIn the claim, Parker outlined a number of instances when he was praised for his budget management, including in an August 2016 evaluation, and during a January 2017 Board of Supervisors meeting.\nIn July 2017, Parker was called into a meeting with Hopper, Jordan and Human Resources Director Regina Romeo. He claims that Hopper scolded him for his abuse of overtime the previous year and that he mismanaged the overtime budget.\nAfter being punished for alleged mismanagement of the budget, a week after the meeting Parker obtained a breakdown of the overtime from the 2016-17 fiscal year from the District Attorney accountant, Marisa Garramore. Parker claimed that he and Garramore went over the hours and realized the investigations unit did not generate the majority of the overtime, which he says was actually from the attorneys and secretaries.\nParker claims that Hopper was furious with Garramore and removed budget documents from Parker’s desk, which he claims are public record. Garramore was fired shortly after – one day after Parker was placed on administrative leave.\nDiscrimination claim\nIn addition to claims of retaliation against him and Garramore, Parker alleges Hopper treated another employee poorly: Francisco Cervantes, an investigative aide who had worked for the department for over 15 years.\nIn January 2017, Parker wrote a good evaluation for Cervantes, which Hopper signed and approved. In May, Parker wrote a similar evaluation for Cervantes, which Hopper allegedly refused to sign, saying Cervantes was not doing his job.\nParker alleged that he noticed Hopper did not like Cervantes and treated him poorly.\nParker accused Hopper of illegally charging to state grants programs for Cervantes’ time, which Cervantes disagreed with. After Cervantes finally addressed the issue, Hopper shredded documents and no longer illegally billed for his time, according to the claim. But then Cervantes was treated differently.\nCervantes always had a county vehicle he would take home because he would regularly do work for the office which required a vehicle. Hopper allegedly removed this benefit from Cervantes with no explanation. The claim alleges that Cervantes was forced by Hopper to serve subpoenas in a way that jeopardized his safety, was given a greater caseload than his coworkers and was forced out of his office by Hopper to give it to a new employee.\nParker confronted Hopper about what he perceived as discrimination, and later notified Jordan and Romeo.\nDuring a meeting with Romeo and Deputy County Counsel William Vanasek, Parker complained about Cervantes’ removal from his office due to a complaint by Parker against Hopper, and addressed discrimination reported to him by Cervantes.\nParker alleged that Romeo and Vanasek denied the complaint and said it had to be filed by Cervantes.\nWhen asked about allegations of a hostile work environment, Hopper said the allegations were looked into by independent, third-party investigators who determined the allegations were without merit.\n“Any and all allegations reported to the county have been thoroughly investigated and put to rest,” Hopper said in her written statement. “You are welcome to speak with all of my employees about their work environment. From my position, we have a good office environment with co-worker camaraderie for Christmas parties, lunches, etc.”\nMisuse of grant funds\nParker alleged that Hopper had been illegally billing Cervantes’ work time to AB 109 – public safety realignment grant money.\nIn August 2017, Cervantes allegedly voiced his concerns with Parker about Hopper requesting him to sign a payroll form where 33 percent of his salary would be charged to that grant fund. When Parker started at the District Attorney’s Office in 2015, he said he learned Cervantes’ time was being billed to the public safety grant and expressed his concern to Hopper, according to the claim.\nHopper allegedly admitted the billing was incorrect. Parker claims that in 2016 Hopper sent an email discontinuing billing Cervantes’ time to the grant, and believed it was taken care of. But Parker later learned Hopper began billing the public safety realignment grant for Cervantes’ time in January 2017, he said.\nAccording to the claim, Cervantes brought it to the attention of Garramore and stressed that he did not believe it was right. Garramore allegedly brought it to the attention of Hopper, who then shredded the signed payroll form and said they wouldn’t bill the grant for his time.\nAccording to the California Department of Corrections and Rehabilitation, AB 109 provides a dedicated and permanent revenue stream to counties through vehicle license fees and a portion of the state sales tax. The vehicle license fees establishes the local revenue fund for counties to receive the revenues and appropriate funding for public safety realignment. The portion of the state sales tax provides revenue to counties for local public safety programs.\nHopper said an attorney position is funded by AB 109 funds, which is based on the assigned attorney’s salary; but it is not required that the attorney, and only that attorney, work the cases because there are multiple attorneys that handle the cases.\n“The CCP (Community Corrections Partnership) is aware of how the cases are handled and because it cannot be handled by one attorney only, it was determined that the best financial arrangement was to simply tie the funding to a position,” Hopper said in her written statement. “The AB 109 funds allocated the District Attorney’s Office were approved by the CCP Board with a full understanding of this determination.”\nUnlawful termination\nOn Aug. 24, 2017, days after notifying the county of his intent to sue, Parker was placed on administrative leave with no explanation, according to his claim. Parker began to inquire through his attorney about the nature of the charges for placing him on leave.\nAccording to the claim, Romeo and Jordan kept changing the accusations against Parker, who was initially only informed it was for violating a county rule or regulation.\nDays later, Parker received a new letter from the Human Resources Department stating that the personnel investigation into Parker was regarding “alleged harassment,” according to the claim. Parker’s attorney asked who made the complaint against Parker and learned it was Brandon Oakley, who Parker confronted about the appearance of an inappropriate relationship with Hopper.\nOn Sept. 1, Parker’s attorney sent a letter to County Administrative Officer Scott Mitnick and the Board of Supervisors regarding how the investigation was purely retaliation. He claims the letter was not responded to.\nOver the following days, Parker received three more letters, each with an added allegation against him: insubordination and failing to cooperate with a county investigation. Parker claimed the allegations were false, based upon lies, or that they were insignificant.\nParker alleged that the county-required informal investigation was skipped, and the county hired an expensive Bay Area firm to investigate Parker. According to the claim, county regulations require progressive discipline, which was ignored in Parker’s case.\nParker alleges that neither he nor his attorney have been provided a copy of the formal complaint – a violation of county rules and regulations. Parker asked the investigator if there were any additional people who complained about his actions. The investigator allegedly told him the only people who complained were Hopper and Oakley.\n“Clearly the allegations against Mr. Parker by B. Oakley and Hopper are retaliatory, based upon lies and mistruths, and an attempt to get Mr. Parker removed from the office so they can continue their relationship unhindered by Mr. Parker,” the claim alleges.\nOn Dec. 11, Hopper sent a notice of proposed disciplinary action to Parker, which the claim alleges is in violation of the Peace Officers Bill of Rights, Sutter County rules and regulations, Skelly laws (concerning the rights of an employee up for disciplinary action), and state and federal laws.\nAt the scheduled Skelly hearing, Parker’s attorney and Assistant District Attorney Jana McClung agreed that the hearing be continued in order to comply with the law, as Parker hadn’t seen the investigation, according to the claim.\nParker also alleged that in a December statement (a news release) to the Appeal-Democrat, Hopper violated county rules and regulations and intended to defame and injure Parker’s current employment and future employment opportunities.\nIn that statement, Hopper wrote that an investigation into Parker for unethical conduct while on duty determined allegations against him were sustainable. She also stated that the investigation determined that Parker and then-senior criminal investigator David Williams were found to not be credible in statements they made during the investigation. The statement was released three days before Williams’ retirement.\nWhen asked if her statements could put at risk any past cases Parker and Williams worked on, Hopper said it was the independent investigator’s determination she cited, not her own.\n“Credibility of any witness, but particularly a peace officer, can have an effect on the outcome of a criminal prosecution,” Hopper wrote. “The proper procedure for determining whether credibility issues are relative to a criminal case is accomplished through a Pitchess motion (a request to access information used to make an allegation).”", "url": "https://apnews.com/ecc099e343e445edaa3fb47ebed828bf"}