{"authors": ["Rachel Rodgers Rrodgers Saukvalley.Com", "Ext."], "date_download": "2020-05-04 20:12:01", "date_modify": "2020-05-04 20:12:01", "date_publish": "2018-12-14 01:07:00", "description": "MORRISON – The County Board plans to vote on six solar farm proposals Tuesday. Energy companies need a special-use permit from the county to build a solar farm as well as an interconnection...", "filename": "_a3f084eafec14c518cf55821ef693e06_1588623121.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a3f084eafec14c518cf55821ef693e06_1588623121.html", "title": "Whiteside County Board to vote on solar farm proposals", "title_page": "Whiteside County Board to vote on solar farm proposals", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MORRISON – The County Board plans to vote on six solar farm proposals Tuesday.\nEnergy companies need a special-use permit from the county to build a solar farm as well as an interconnection agreement with ComEd before they can submit their projects to a state lottery in the hopes of landing competitive renewable energy credits.\nThe Sauk Valley has been flooded with solar farm proposals, but only a few are likely to be built because of the large number of projects in the lottery compared to available credits and power grid capacity in a given area.\nThe first round of projects are slated to be picked from the lottery next month.\nThose going before the board asking for special use permits are from Prophet Solar III LLC for a solar farm at 22853 Gaulrapp Road in Rock Falls, and then five others from ENGIE to build on land at 19848 Bunker Hill Road and at 12107 and 12610 Yorktown Road in Lyndon, and at 14378 Hillside Road and 12597 Harvey Road in Morrison.\nThe boom of proposed solar projects began after the state passed the Future Energy Jobs Act in late 2016, which requires utility companies to get 25 percent of their energy from renewable sources by 2025 and includes incentives for energy companies.", "url": "https://apnews.com/a3f084eafec14c518cf55821ef693e06"}