{"authors": ["Dave Lavenderthe Herald-Dispatchlavender Herald-Dispatch.Com"], "date_download": "2020-05-04 20:08:37", "date_modify": "2020-05-04 20:08:37", "date_publish": "2018-02-08 08:57:04", "description": "To hear actress Dylis Croman talk about the musical \"Chicago,\" you'd say it's pretty \"spectacular.\" \"It is 'Chicago.' It is a spectacular story and spectacular dancing and spectacular music...", "filename": "_bdc720dc05054010ae23368a655bfb60_1588622917.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bdc720dc05054010ae23368a655bfb60_1588622917.html", "title": "... AND ALL THAT JAZZ", "title_page": "... AND ALL THAT JAZZ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "To hear actress Dylis Croman talk about the musical “Chicago,” you’d say it’s pretty “spectacular.”\n“It is ‘Chicago.’ It is a spectacular story and spectacular dancing and spectacular music — and to share it with people is an absolute joy,” Croman said by phone.\nCroman, who has been with the “Chicago” family some 12 years playing the lead role of Roxie Hart both on Broadway and now on the national tour of “Chicago,” isn’t just hyping the musical, because she doesn’t need to — it’s “Chicago.”\nAnd it is swinging its way here into the heart of Huntington.\nPresented by First Sentry Bank, the Marshall Artists Series performance of the national tour of “Chicago” — the No. 1 longest-running American music in Broadway history — will be performed at the Keith-Albee Performing Arts Center at 7:30 p.m. Monday, Feb. 12.\nTickets are $64, $70, $81 and $97 at the Marshall Artists Series Box Office at 304-696-6656, online at Ticketmaster.com or at the Joan C. Edwards Playhouse box office from noon to 5 p.m. Monday through Friday.\n“Chicago” comes right on the heels of a Marshall Artists Series production featuring the national jamgrass band Yonder Mountain String Band and comes just a couple days before Valentine’s Day.\nWith a legendary book by Fred Ebb and Bob Fosse, music by John Kander and lyrics by Ebb, “Chicago,” which is set in the Windy City in the Roarin’ 1920s, tells the wild, music-and-dance-filled rollercoaster story of drama queen Roxie Hart, a housewife and nightclub dancer who murders her side-man after he threatens to leave her. After being arrested, Roxie meets the six “merry murderesses” at the Cook County Jail, including Velma Kelly, her rival cellmate.\nDesperate to avoid conviction, Roxie hires Chicago’s slickest criminal lawyer to twist her crime into a publicity opportunity by way of sensational headlines in hopes of getting set free.\nCroman, who has been playing Roxie for the past four years on Broadway and on tour, said she loves getting to play someone who loves and feels life so strongly as Roxie.\n“She is a spicy little thing, and she wears her heart on her sleeve and is a very reactionary person blurting out whatever comes to her at the moment, and she always finds a way to make it work,” Croman said. “I think that some people might say she is all out for herself, but honestly I see her as a survivor. She has survived a lot, and she is always trying to do something to rise above what has been given to her. She can’t do it alone, and neither can Velma, and at the end they need each other. That is a beautiful lesson that winds up in the show — that storyline that these women need each other in the end, and ultimately in humanity we all need each other some times in some form.”\nHailed by Entertainment Weekly as “Broadway’s Most Electrifying Show,” “Chicago,” which won six Tonys when it was revived back in 1996, has become timeless in part due to a steady stream of songs such as “Cell Block Tango,” “All that Jazz,” “When You’re Good to Momma,” “Me and My Baby” and “Razzle Dazzle,” which provide a perfect vehicle for the Bob Fosse choreography.\n“It is a timeless story, and I always say we can all relate to the sensationalism of the press. It happens every day, and we can relate to that, and the storyline itself is relatable and timeless. Of course, the show is told so simply with the acting and the dancing with the song really being at the forefront,” Croman said. “Those are the stars of the show, so we don’t need to have all the extra frills to add to it — that is what makes ‘Chicago’ so special and so unique because of its simplicity and it really allows the story to shine through.”\nCroman, who in addition to 12 years with “Chicago” has racked up Broadway and national tour credits with New York Stage & Film productions said she feels blessed to have long been connected personally and professionally to the choreography of Bob Fosse and one of his dance disciples, Ann Reinking, from whom Croman began taking lessons at age 14.\nReinking not only reprised the role of Roxie Hart in the 1996 revival of “Chicago” but was also the choreographer, winning the Tony Award for Best Choreography. For the 2000 West End production of “Fosse,” she won the Olivier Award for Best Theatre Choreographer.\nCroman, in fact, just danced in October at a New York Dance Alliance Foundation Fundraiser honoring Reinking, who was named the 2017 NYCDA Foundation’s Ambassador for the Arts.\n“The Bob Fosse style of dancing is on of those styles that reads easier than it actually is, as it is a style based on less is more and that is hard to do,” Croman said. “As performers we tend to want to shine and want to give those jazz hands full out, but Fosse demands that you pull it back, and the audience comes to it. It is very detail oriented, and it is quirky and crazy, but it can tell a story with one shoulder roll and a finger twirl. Bob Fosse is like no other. When I was 14 ... I was introduced to it and was taught by Anne Reinking, and once she introduced it to me, she introduced me into this world, and I knew. It is like putting on a pair of shoes that are a perfect fit. ... Truly a majority of my career has been based on the Fosse style since then.”\nCroman, who carries that direct lineage to the stage, said she loved being able to be a part of the event in October, to be able to thank Reinking for the impact on her life.\n“She is such a glorious woman inside and out and worked her whole career and after her career dancing and in the leading roles on Broadway, she has really been passing down the legacy of Fosse in an incredible and beautiful way,” Croman said. “She has so much passion for it and cares to share with the younger generation and pass it down with love, and I am fortunate to be one of those people.”\nWith “Chicago,” Croman has spread the electricity of dance and music to audiences that have ranged from around the U.S. to Canada and Korea.\nCroman said there’s something immediate and universal to “Chicago,” which has spread to every corner of the world.\n“It definitely is something that I am grateful for to change people’s lives and to tell a story that is so tangible and so real,” said Croman, who has also appeared on TV on “Guiding Light” and “Smash.” “Sometimes you will play cities that have more of a conservative audience, and they will take it in, and they might not be as vocal — but at the end they will pop out of their seats, and they are guaranteed to love it. It is a complicated story in a simplistic form, and I love to see the reaction to it. It gives me the motivation to do the next show and the next night.”\nYOUR WEEKEND GUIDE\nThe Marshall Artists Series has two big shows Saturday, Feb. 10, and Monday, Feb. 12.\nSATURDAY: The Miller Investment Group at RBC Wealth Management presents The Yonder Mountain String Band at the Keith-Albee Performing Arts Center, 925 4th Ave., Huntington at 7:30 p.m. Saturday, Feb. 10. Tickets are $37, $48 and $70. Opening will be The Southern Belles. The Kind Thieves and Vessel will play an after-party at Black Sheep Burrito and Brews, 279 9th St. Entry is free with Yonder Mountain String Band ticket stub. Otherwise $5 cover. Music starts at 10.\nMONDAY: Broadway’s record-breaking Tony Award-winning musical smash “Chicago” will be performed at the Keith-Albee Performing Arts Center at 7:30 p.m. Monday, Feb. 12. Tickets are $97.87, $81.50, $70.58 and $64.04.\nGET TIX: Contact the Marshall Artists Series Box Office at 304-696-6656 or order tickets online at Ticketmaster.com. You may also visit the box office in the Joan C. Edwards Playhouse from noon to 5 p.m. Monday through Friday.\nON DECK FOR THE ARTISTS SERIES:\n• The new hit “Amazing Grace: The Broadway Musical” comes to the Keith-Albee at 7:30 p.m. Tuesday, Feb. 20. A tale of romance, rebellion and redemption, the show follows the story of John Newton, the English slave trader who later became an Anglican priest and eventually an abolitionist. He wrote many hymns, including “Amazing Grace.” The musical story of redemption had a three-month run on Broadway (from July to October 2015). Tickets are $97.87, $81.50, $70.58 and $64.04.\n• John Ondrasik at 7:30 p.m. Thursday, March 8. The acclaimed singer and songwriter, best known by his stage name Five for Fighting, will perform on piano along with a string quartet. He burst on the scene some 15 years ago with his Grammy-nominated hit “Superman (It’s Not Easy)” and has been a mainstay on mainstream radio ever since. Tickets are $54.21, $43.30 and $32.39.\n• The Rec Center at Marshall University presents The Banff Mountain Film Festival at 7 p.m. Tuesday, April 3. The Banff Mountain Film Festival is the most prestigious mountain festival in the world. Right after the festival, held every fall in Banff, Alberta, the Banff Mountain Film Festival World Tour starts to travel the globe with stops in about 450 communities and 40 countries. The 2017-18 world tour features a collection of films that explore the mountain world, highlighting new landscapes and remote cultures, and exposing audiences to adventures and sports. Tickets are $10.\n• Spring International Film Festival, April 5-8, at the Keith-Albee Performing Arts Center: Featured films include “Summer, 1993” (Spain), “Call Me By Your Name” (Italy/France), “Graduation” (Romania), “Things To Come” (France), “One Week and a Day” (Israel) and “After The Storm” (Japan). The festival is sponsored by the Cabell-Huntington Convention and Visitors Bureau. Tickets are $10 per film.", "url": "https://apnews.com/bdc720dc05054010ae23368a655bfb60"}