{"authors": ["Don Rebel"], "date_download": "2020-05-04 20:10:52", "date_modify": "2020-05-04 20:10:52", "date_publish": "2018-01-25 05:02:29", "description": "The first brackets of the 2018 winter sports postseason will be unveiled Thursday as the WPIAL releases pairings for the team wrestling playoffs which begin Monday with Class 3A preliminary round...", "filename": "_39f7572a8e4f471f815e203325f726f0_1588623052.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_39f7572a8e4f471f815e203325f726f0_1588623052.html", "title": "WPIAL wrestling brackets to be revealed as part of 3 things to watch Thursday in WPIAL athletics", "title_page": "WPIAL wrestling brackets to be revealed as part of 3 things to watch Thursday in WPIAL athletics", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WPIAL wrestling brackets to be revealed as part of 3 things to watch Thursday in WPIAL athletics\nThe first brackets of the 2018 winter sports postseason will be unveiled Thursday as the WPIAL releases pairings for the team wrestling playoffs which begin Monday with Class 3A preliminary round matches and conclude next Saturday.\nThere will 20 teams that qualify for the Class 3A playoffs, which will include four preliminary round matches. Fifteen teams make it for the Class 2A postseason with the top seed getting a first-round bye.\nThe big question heading into the team wrestling playoffs this year is will Burrell make it a golden dozen? The Buccaneers have captured a record 11 consecutive WPIAL Class 2A championships, making it one of the longest title streaks for any sport in WPIAL history.\nKiski Area is the defending champion in Class 3A. The Cavaliers have been dominant in Section 1 this season, but there are a handful of contenders to their crown, including Trib HSSN No. 1 team Canon-McMillan, along with Hempfield and Waynesburg.\nCheck back here Thursday afternoon for the playoff matchups, and watch the WPIAL wrestling championships next Saturday on the TribLive High School Sports Network.\nGirls’ night\nThe top two teams in a section meet in four WPIAL girls basketball games Thursday. Only one of those four basketball games though will be a battle for at least a share of first place in that particular section.\nIn Section 2-6A, first-place Latrobe hosts second-place Norwin. In Section 3-3A, front running Bishop Canevin visits second-place Avonworth, and in Section 2-A, Mapletown, currently tied for second place with Geibel, visits first-place West Greene.\nHowever Latrobe, Bishop Canevin and West Greene have given themselves a cushion atop their section and have at least a two-game lead in the loss column over the teams they face Thursday.\nThe lone exception is the Freeport at Cardinal Wuerl North Catholic game in which the 7-1 Yellow Jackets have a chance to tie for first place with a win over the 8-0 Trojans.\nBut it won’t be easy since CWNC won the first meeting back in December at Freeport, 60-22. In that game, the Trojans outscored the Yellow Jackets, 20-0, in the second quarter to take a 30-6 lead into the locker room and never look back.\nPoolside\nFour years ago, both the North Allegheny and Mars boys swimming teams were crowned WPIAL champions, the Tigers in Class 3A and the Fightin’ Planets in Class 2A. On Thursday, the two teams battle in a Section 2 meet at North Allegheny.\nSince the two schools won those WPIAL titles in 2014, Mars has moved up to 3A and into a classification that North Allegheny continues to dominate.\nThe NA boys have won six district crowns in a row and 11 of the last 12 titles. Not to be outdone, the North Allegheny girls swimming team tied a record set by Bethel Park in the 1970′s and early ’80′s with nine consecutive championships when they won again last February.\nBoth the NA boys and girls teams have not lost a section meet this season and will be favored to win gold again at the WPIAL championships in early March.\nDon Rebel is a TribLIVE High School Sports Network broadcaster and staff writer. Reach him at drebel@tribweb.com.", "url": "https://apnews.com/39f7572a8e4f471f815e203325f726f0"}