{"authors": ["Dave Williams"], "date_download": "2020-05-04 20:25:27", "date_modify": "2020-05-04 20:25:27", "date_publish": "2018-01-20 14:15:00", "description": "Positioned deep in Siberia, the village of Oymyakon Known as the 'Pole of Cold', holds the distinction of being the coldest permanently inhabited place on Earth. Just a few hundred miles...", "filename": "_10b2ee691ca34423aec4212becd81fab_1588623927.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_10b2ee691ca34423aec4212becd81fab_1588623927.html", "title": "Coldest Place on Earth", "title_page": "Coldest Place on Earth", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Positioned deep in Siberia, the village of Oymyakon Known as the ‘Pole of Cold’, holds the distinction of being the coldest permanently inhabited place on Earth.\nJust a few hundred miles from the Arctic Circle, it’s utterly dark - for up to 21 hours a day during the winter, and the temperature averages -72,4 Fahrenheit degrees (-58C). That’s balmy compared to one February in 1933, when Oymyakon earned its title as the coldest place on Earth when the mercury plunged to -96,16 Fahrenheit degrees (-71,2C).\n• Here arctic chill is simply a fact of life, something to be endured. People develop a variety of tricks to survive. Most people use outhouses, because indoor plumbing tends to freeze. Cars are kept in heated garages or, if left outside, left running all the time. Batteries lose life at an alarming speed. Pen ink freezes, anything less than fur fails at keeping the chill off, electronics are all but useless. Crops don’t grow in the frozen ground, so people have a largely carnivorous diet - reindeer meat, raw flesh shaved from frozen fish, and ice cubes of horse blood with macaroni are a few local delicacies.\n• The village, which is home to around 500 people, was, in the 1920s and 1930s, a stopover for reindeer herders who would water their flocks from the thermal spring. But the Soviet government, in its efforts to settle nomadic populations, believing them to be difficult to control and technologically and culturally backward, made the site a permanent settlement.\n• While spoiled kids to the south get out of school for snow days, the children of Oymyakon are stuck in class unless the temperature falls below –52C (-61 Farenheit degrees). If you were to go outside naked on an average day, it would take approximately one minute for you to freeze to death.\n• While its appeal may be mostly due to the novelty of being in such a bizarre climate as there is very little to do in Oymyakon, it has a relatively successful tourism market. Area-specific activities such as reindeer hunts, ice fishing and the juxtaposition of enjoying the hot springs when the temperatures are in the minus-fifties are available to those who would like to experience this opposite of a tropical vacation spot.", "url": "https://apnews.com/10b2ee691ca34423aec4212becd81fab"}