{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:11:56", "date_modify": "2020-05-04 20:11:56", "date_publish": "2018-10-19 10:35:36", "description": "Jackie Denisco tallied 35 digs as the Academy of Notre Dame defeated Nasboba Tech, 3-1, in a Commonwealth Athletic Conference girls volleyball match. Notre Dame 3 Nashoba Tech 1", "filename": "_bd8e4acb91ff49c4920a70f5a67c7b5f_1588623116.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bd8e4acb91ff49c4920a70f5a67c7b5f_1588623116.html", "title": "Lancers Get by Vikings", "title_page": "Lancers Get by Vikings", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lancers Get by Vikings\nJackie Denisco tallied 35 digs as the Academy of Notre Dame defeated Nasboba Tech, 3-1, in a Commonwealth Athletic Conference girls volleyball match.\nNotre Dame 3\nNashoba Tech 1\nElena Murguia had 17 assists and 13 service points as the Lancers topped Nashoba Tech, 22-25, 25-22, 25-13, 25-18.\nGirls volleyball\nMaddie Walent notched 15 service points with 10 aces. Christina Tasillas chipped in with 5 kills and 2 blocks.\nJulie Getchell (3 kills) and Angela Tarantino (2 blocks) played well for NDA.\nNDA head coach Richard Sierra was Nashoba Tech’s head coach from 2015-16. This was Sierra’s first matchup as NDA’s head coach against his former team.\nLincoln-Sudbury 3\nWestford 0\nLincoln-Sudbury swept past Westford Academy, 25-23, 25-22, 25-20, in a DCL match.\nElise Sepe finished with 7 kills, 2 aces and 3 blocks for Westford (7-6).\nKingswood 3\nPelham 0\nPelham ended the 2018 season with a tough 25-19, 25-22, 26-24 loss to visiting Kingswood Regional.\nAlly Altieri led the Pythons, winners of two matches, with 9 assists and 5 digs. Elise Hooper was also solid with 17 service points and 12 digs, while Natalia Villanueva had 4 kills and 6 digs. Also starring were Kate Fisher (5 kills), Maria Dagher (3 blocks) and Hannah Andrewchuck (3 assists).\nGreater Lawrence 3\nGreater Lowell 2\nKailynn Senechiame served well for Greater Lowell Tech during this CAC match.\nLynna Lopez and Jess Lawler had strong all-around matches.", "url": "https://apnews.com/bd8e4acb91ff49c4920a70f5a67c7b5f"}