{"authors": ["Emma Nelson"], "date_download": "2020-05-04 20:23:52", "date_modify": "2020-05-04 20:23:52", "date_publish": "2018-08-11 22:03:35", "description": "A campaign event for state Rep. Ilhan Omar was disrupted Saturday night when Laura Loomer, an alt-right provocateur with a history of attacking Muslims on social media, confronted Omar and...", "filename": "_522a0cc1938e423fa1c0d53543f4bdeb_1588623832.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_522a0cc1938e423fa1c0d53543f4bdeb_1588623832.html", "title": "Former Project Veritas staffer crashes Ilhan Omar campaign event in Minneapolis", "title_page": "Former Project Veritas staffer crashes Ilhan Omar campaign event in Minneapolis", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A campaign event for state Rep. Ilhan Omar was disrupted Saturday night when Laura Loomer, an alt-right provocateur with a history of attacking Muslims on social media, confronted Omar and Michigan congressional candidate Rashida Tlaib.\nLoomer was part of a group that confronted Omar and Tlaib at the event at Holy Land deli in Minneapolis. In an interview late Saturday, Loomer, who previously worked for Project Veritas, said she has been traveling the country investigating Muslim candidates for office, including in Minnesota. She declined to say how many people were with her.\nTlaib is running unopposed for a congressional seat representing Michigans 13th District, and could become the first Muslim woman elected to Congress. Omar, a Minneapolis DFLer, was the first Somali woman elected to the Minnesota Legislature. She is a candidate for the seat held by U.S. Rep. Keith Ellison, who is running for Minnesota attorney general.\nOmar could not be reached for comment late Saturday. Rep. Ray Dehn, DFL-Minneapolis, who attended the event, said Loomer and a few other men and women interrupted Tlaib and Omar as they spoke at Holy Land.\nUnfortunately, [Omar and Tlaib] werent able to speak a lot because they kept getting interrupted, he said. Ive seen way too much of this, and its really getting sickening.\nAs the group shouted questions about Hamas and female genital mutilation, Dehn said, the crowd of supporters began to chant Time for Ilhan.\nThere was a great group of people that were showing support for Rashida and Ilhan, and when you looked at the room, it was a room that reflects America, Dehn said. It was a diverse group of people. Islamophobia really has no place.", "url": "https://apnews.com/522a0cc1938e423fa1c0d53543f4bdeb"}