{"authors": ["Brian Stensaas"], "date_download": "2020-05-04 20:22:18", "date_modify": "2020-05-04 20:22:18", "date_publish": "2018-08-06 13:07:56", "description": "John Daly fired up his RV late Sunday evening and rolled off the TPC Twin Cities grounds $20,545 richer after a 20th place finish in the 3M Championship. Make way for the...", "filename": "_85f6176ddf1d4d06ad667d1b73117a42_1588623738.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_85f6176ddf1d4d06ad667d1b73117a42_1588623738.html", "title": "Bulldozers ready: TPC Twin Cities starts prep for PGA Tour event", "title_page": "Bulldozers ready: TPC Twin Cities starts prep for PGA Tour event", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "John Daly fired up his RV late Sunday evening and rolled off the TPC Twin Cities grounds $20,545 richer after a 20th place finish in the 3M Championship.\nMake way for the bulldozers.\nAlterations to the 19-year-old course to get it ready for the PGA Tour’s 3M Open begin Tuesday. Players arrive next July 1 for the full-field event at the Blaine course.\n“It’s extremely exciting,” TPC Twin Cities General Manager Alan Cull said. “We’ve been saying we’re honoring the past, celebrating the present and embracing the future. We hit the reset button; off we go.”\nThe biggest part of the project is technically still on hold.\nCull and architects from the PGA Tour continue to work daily with vendors on the plans, and for the most part the schematics are in place. But the cornerstone, completely reworking the layout of the 18th hole, can’t be started until permits are approved by the Coon Creek Watershed District at its Aug. 13 board meeting.\nIf authorized — Cull said “everything is in and we feel very good” about the permits — the large pond in front of the 18th green will be excavated, narrowing the fairway. Glacier sand from the work will be used to build a new set of tee boxes for the 18th hole on the hill behind the 17th green.\nMeantime, work has begun on the rest of the planned “competitive enhancements” to be completed by the 2018 growing season: constructing eight other new tee boxes, adjusting grass lines on 13 holes, adding three new bunkers and altering short grass areas on four greens.\nThe changes will turn the course into a par 71 for touring professionals, with No. 3 now playing as a long par 4.\n“It’s going to be a challenge,” said Kenny Perry, who won his third 3M Championship on Sunday and said he plans to play the 3M Open using his PGA Tour all-time money exemption. “I saw they’re putting the second tee back across the road. I’m used to hitting 3-wood and a sand wedge on that hole. Next year I’ll be hitting driver and a 5-iron.”\nThe course will be closed until Friday so aeration work and other scheduled maintenance is completed, which has become standard after hosting the 3M Championship. For the rest of this season, members will notice the extra work done to the course but Cull said no more than three holes should be unplayable at any time.\n“There are challenges, you bet,” Cull said. “If Mother Nature doesn’t cooperate, there will be issues. But we’ll work through that.”\nTom Lehman worked with Arnold Palmer designing the course 20 years ago. He’s involved in this project, too, bringing a veteran golfer’s eye to the changes.\n“When top players are on their game they’re going to beat any golf course,” Lehman said. “How do you challenge the best players? There are ways to do it without being stupid and tricky.”\nCull wouldn’t divulge the price tag of the project, only saying it was a “good number” that’s being funded “in a partnership between the sponsor and the PGA Tour.”\nOnce the snow melts next spring it’s a sprint to July. It will take the Tour four to six weeks to set up for the 3M Open, and that’s not including any concert stages, enhanced viewing platforms or other add-ons tournament CEO Hollis Cavner might come up with.\n“It all comes down to vision, and Hollis has no lack of vision,” Cull said. “It’s big picture with him, and even though that can present challenges, I love it.”", "url": "https://apnews.com/85f6176ddf1d4d06ad667d1b73117a42"}