{"authors": ["Kathleen A. Schultz Kschultz Saukvalley.Com", "Ext."], "date_download": "2020-05-04 20:15:16", "date_modify": "2020-05-04 20:15:16", "date_publish": "2018-03-31 02:20:00", "description": "MORRISON – The Bread Lady is crustfallen. For years, Shelli Eng has been selling her popular baked goods at the Morrison Farmers Market, from a food stand in front of her Erie farmhouse,...", "filename": "_6ab0f41c54fa49b1ae1fa5bef9bb3885_1588623316.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6ab0f41c54fa49b1ae1fa5bef9bb3885_1588623316.html", "title": "Cupcake law wars", "title_page": "Cupcake law wars", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MORRISON – The Bread Lady is crustfallen.\nFor years, Shelli Eng has been selling her popular baked goods at the Morrison Farmers Market, from a food stand in front of her Erie farmhouse, and, most recently, from a spot next door to her Main Street Morrison boutique, emeDesigns.\nThe problem is, two of those three ventures are illegal in Whiteside County, which has not adopted a “cupcake law.”\nWhen the health department got wind of her activities, Eng was told to cease and desist sales at all but the farmers market, unless and until she took a more legal, businesslike approach. She stopped selling March 19. (The seasonal market is not yet open.)\nEng, who is licensed and certified to sell her home-baked goods under the state’s Cottage Foods Law, had been selling at the Morrison storefront at 101 W. Main St. only a few weeks, quietly and by word-of-mouth only, simply to gauge how much interest there might be in a bakery downtown, she said. Judging from her sales, a lot.\nShutting down the stand in Erie, though, where she’s been selling baked goods hand-over-fist for years – hence her nickname – well, that really stings.\n“We’re a rural community, and the idea that a cupcake isn’t allowed to be sold by anybody out of a home kitchen is somewhat insane,” Eng said. “We all grew up on bake sales and Mom’s home cooking and Grandma’s home cooking.”\nShe has marshaled her disappointment into action, and, with the help of a few like-minded volunteers, is circulating petitions online and around the county, trying to drum up enough support to persuade the county board to pass a cupcake law of its own.\nShe’s had more than 20,000 people view her Facebook page and has nearly 300 online signatures, Eng said. She doesn’t know how may have signed the hard copies that are circulating.\nShe also plans to make the rounds to various municipalities, to try to get the support of city councils and village boards that she also can present to the county.\nThere’s a host of misperceptions and misinformation about the state laws governing home-baked goods and what they allow floating around.\nAmong other things, the state Cottage Food Law requires bakers to meet certain requirements, including taking sanitation and other food safety classes to obtain mandatory Food Service Sanitation Manager Certification.\nIt limits what kind of food can be sold, and requires specific ingredient and other labeling on the food that is allowed.\nAnd still, when all is said and done, the homemade products can be sold only at farmers markets – not at stores, not at farms, and not at farmers market-like settings.\nThe state home kitchen operation law, commonly called the Cupcake Law, was passed in 2014 – after Madison County shut down a preteen’s cupcake business, making national headlines – and against the strongly worded advice of the Illinois Department of Public Health.\nAs a concession to the IDPH, the law was made valid only if the local government – in this case, the county – adopts an ordinance authorizing it.\nAll it requires is that the goods are labeled as baked in a home kitchen, and that bakers not make more than $1,000 a month selling them. They are exempt from any health department inspections, there are no requirements for training, and no registration requirements.\n“They don’t have to wash their hands. They don’t even have to have a kitchen sink,” notes Jeff Deets, Whiteside County’s assistant director of public health, and the man who shut Eng down.\nThat laxity is why Eng most certainly will have an opponent in Beth Fiorini, county health department administrator.\nFiorini makes no bones about it: She does not want a cupcake law in her county for several reasons, among them:\nThe law does not do enough to protect people against possible infectious diseases. It doesn’t require that kitchens be certified, or that home bakers be educated on sanitation, food safety or allergen issues, she said.\nPoor personal hygiene and improper hand-washing are the most common ways food gets contaminated, as well as improper storage of supplies and ingredients, and ineffective cleaning and sanitizing of utensils and work spaces. Home kitchen businesses can’t be checked in advance for any of that.\nThe thought of things like a cat taking a shortcut from the litter box to the living room via the kitchen countertop, the accidental peanut, or noroviris hitching a ride on a batch of muffins, spurring an outbreak, gives her nightmares.\nAnd what if there is such an outbreak? If everyone’s allowed to sell baked goods made at home whenever and wherever they want, how do you pinpoint the source of contamination and shut it down?\nThey can’t just go inspect a person’s kitchen willy-nilly, there has to be some a complaint that there’s contamination there, Fiorini said.\n“There’s no traceability whatsoever,” Deets added. If there was a food-borne illness outbreak, “we’d have to try to track this person down.”\n​In other words, the cupcake law makes its harder to safeguard the health of the residents of Whiteside County, which is Fiorini’s prime directive.\n“I understand the importance of the health department. For heaven’s sake, what would we do if there weren’t restrictions?” Eng said.\nBut Fiorini and Deets are exaggerating the risk, Eng believes. Besides. the law already exists on the state level, so there’s no reason for the local health department to balk, she reasoned.\nThere’s a simple solution to Eng’s problem, Deets counters. Get a license, pass inspection and open a bakery. Or rent space in Sterling’s Kitchen Incubator of Northwest Illinois, on Industrial Drive, and bake there.\nNot only would that be legal, but it also would be fair to all the other bakers in Whiteside County who did so, and who don’t want to compete with unrestricted home bakers, he said.\n“Sure, maybe someday down the line I like to have my own bakery,” Eng said. “But to build out a restaurant from the ground floor is a huge amount of money. Being at home allows you to be an entrepreneur and work at your own pace.”\nGoogle Illinois cupcake law and a host of stories pop up on places that have passed it, that have passed on it, that still are deciding.\nFor her part, Eng is determined.\n“The law is the law and we’re willing to follow it – the Cupcake Law.”\nABOUT THE LAWS\nIllinois’ Cottage Foods Law allows small-scale entrepreneurs to sell products made in their own home kitchens, such as baked goods, jams and jellies, or dried herbs and teas, at their local farmers market only.\nUniversity of Illinois Extension has a website on the state’s Cottage Foods Law that explains which foods can and cannot be sold, what requirements must be met to get started selling your products, including how to get the mandatory Food Service Sanitation Manager Certification, and other food safety and labeling information.\nGo to web.extension.illinois.edu/cottage to learn more.\nThe state “Cupcake Law,” an amendment to the Food Handling Regulation Enforcement Act, was passed in 2014.\nGo to shawurl.com/38z2 to read the full text of the amendment.\nThe state Department of Public Health does not keep track of which counties have agreed to adopt a cupcake law. Locally, like Whiteside, Lee and Ogle counties have not; Carroll County has.\nTO SIGN THE PETITION\nFind The Bread Lady on Facebook or call Shelli Eng at 309-912-4556 to sign the petition or for more information on her effort to see a Cupcake Law passed in Whiteside County.", "url": "https://apnews.com/6ab0f41c54fa49b1ae1fa5bef9bb3885"}