{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:20:49", "date_modify": "2020-05-04 20:20:49", "date_publish": "2018-11-10 00:09:38", "description": "Where are your family photos? Not the ones on your camera or your phone, the photos from your childhood. The ones you swiped from your parents' albums when they weren't looking. The ones you...", "filename": "_438f2de5e5b24e33a5512b558a79f211_1588623649.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_438f2de5e5b24e33a5512b558a79f211_1588623649.html", "title": "Send It Away Saturday: Get Those Old Photos Organized", "title_page": "Send It Away Saturday: Get Those Old Photos Organized", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Where are your family photos? Not the ones on your camera or your phone, the photos from your childhood. The ones you swiped from your parents’ albums when they weren’t looking. The ones you brought home after you cleared out the family home. Chances are, they’re sitting on a shelf at the back of a closet. Hopefully they’re not in a box in the basement in the direct path of the next burst pipe or worse. But odds are, wherever they are, they’re not organized.\nWhen I flew back from the U.K. after my Dad’s funeral, I had a suitcase full of photographs. My Dad saved every photo he ever took and often had doubles printed. Each and every one was unlabeled and undated. There were photographs of his parents’ wedding mixed in with snapshots of the bus terminal construction. It took me a few months to get to the place where I could begin to go through them and tackle the mammoth project of pulling out the family photographs and sorting them into chronological order. Once the photos were scanned, I put them online for my siblings to share and then put the originals in albums, which I labeled where I could.\nWe think we’ll always remember but we don’t. As you take your photos this holiday season, remember to tag them as you import them to your computer. And as you pull out the old albums (best case scenario) or rummage through the boxfuls of photos (more likely scenario) to share the memories with your folks, take the time to jot down on the back of each old photo: who is in the photo? Where was it taken? What was the occasion? Then add any dates you all can remember.\nIf you’re lucky, your family has steel trap minds and can fill in all these details. If memories have faded a bit, capture what’s still there and save what you can to pass on for future generations. If you’re the youngest member of your family, there’s an additional emotional task which can be tough but empowering. You get to decide which ones you keep to cherish and enjoy. And you get to consciously dispose of the ones that are meaningless. If there are no younger relatives who might be interested in your family history, the choice of what to keep is all yours.\nLucy Kelly is a professional organizer who shares decluttering tips on her blog, joyfulsurroundingsllc.com . Reach her at lucy@joyfulsurroundingsllc.com .", "url": "https://apnews.com/438f2de5e5b24e33a5512b558a79f211"}