{"authors": ["Justin Rogers", "The Detroit News"], "date_download": "2020-05-04 20:13:12", "date_modify": "2020-05-04 20:13:12", "date_publish": "2018-01-18 15:59:02", "description": "It's the beginning of mock draft season and ESPN's Mel Kiper has released first. In a sight that should become somewhat familiar until free agency, at the very least, he has the Detroit Lions...", "filename": "_d166a81547434252b61c84bf9dc554fd_1588623192.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d166a81547434252b61c84bf9dc554fd_1588623192.html", "title": "Lions take Ohio State DE Hubbard in Kiper's first mock", "title_page": "Lions take Ohio State DE Hubbard in Kiper's first mock", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s the beginning of mock draft season and ESPN’s Mel Kiper has released first. In a sight that should become somewhat familiar until free agency, at the very least, he has the Detroit Lions addressing the defensive line with the No. 20 selection.\nKiper slots Ohio State defensive end Sam Hubbard to the Lions in that spot.\n“Ezekiel Ansah had a bounce-back year with 12 sacks, but he’s a free agent,” Kiper writes. “Will the Lions give him a long-term deal? Detroit’s No. 2 sacker was former sixth-round pick Anthony Zettel, who had 6.5, so this is a clear area of need. Hubbard is probably better for team that plays a 4-3 like the Lions. He didn’t have a consistent 2017 season, but he finished strong with 2.5 sacks at Michigan and 2.5 more in the bowl win over USC. Is he Joey Bosa? No, but that’s why Bosa went No. 3 overall. Hubbard would be good value at pick No. 20.”\nMore: Justin Rogers’ NFL mock draft 1.0\nAnsah is the biggest personnel decision Lions’ general manager Bob Quinn faces this season. The 12 sacks ranked eighth in the NFL, but largely came in bursts. He lacked consistency with his ability to rush the passer and finished 69th on pressure rate, according to Football Outsiders.\nKiper fails to mention Kerry Hyder, the team’s leading sacker from 2016, who is expected to return from an Achilles injury in 2018. But his resume is short, and it’s a particularly difficult injury to regain previous explosion, so it doesn’t lessen Detroit’s need for another edge defender.\nHubbard, listed at 6-foot-5, 265 pounds finished with seven sacks and 13.5 tackles for a loss last season. In 40 games over three years, he recorded 116 total tackles, 17 sacks and three forced fumbles.\nKiper has Michigan defensive tackle Maurice Hurst going two picks later, to the Buffalo Bills.\n“Hurst is a 3-technique penetrator who gets into the backfield and gets after quarterbacks,” Kiper writes. “He’s a perfect fit for a 4-3 team, and the Bills need pass-rushers. They had only 27 sacks in 2017, which ranked 29th in the league. Buffalo is a team to watch for the second tier of quarterbacks because Tyrod Taylor’s future is up in the air.”\njdrogers@detroitnews.com\ntwitter.com/Justin_Rogers", "url": "https://apnews.com/d166a81547434252b61c84bf9dc554fd"}