{"authors": ["Sentinel"], "date_download": "2020-05-04 20:06:33", "date_modify": "2020-05-04 20:06:33", "date_publish": "2018-12-02 11:33:37", "description": "The best way out is through, said Robert Frost. He was talking about one path to emotional healing, and I'll hold that idea as I deal with a common cold. I've been holed up in this house...", "filename": "_ab405f8941534ce0a9efe329f852491a_1588622793.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ab405f8941534ce0a9efe329f852491a_1588622793.html", "title": "Take a Bowl of Chicken Soup and Call Her in the Morning", "title_page": "Take a Bowl of Chicken Soup and Call Her in the Morning", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The best way out is through, said Robert Frost. He was talking about one path to emotional healing, and I’ll hold that idea as I deal with a common cold.\nI’ve been holed up in this house since last weekend when the kids and grandkids gave hugs and kisses before heading home. The night before, I tried willing away a red-flag sore throat, foolishly thinking it’d be gone the next morning. I woke with a runny nose and its accomplice, a raw cough, each descended with a vengeance and a reminder that, yes, indeed, the common cold is common. It’s also indiscriminate and inconvenient. All the hand-washing, carefully administered embraces and air kisses for naught, especially since summer had spurned and left us and our airways incubated indoors. We could not be inoculated against the unseen ones our loved ones would carry. Crap.\nDon’t get me wrong, I’m not blaming the green snot hanging like goo from my grandchild’s sweet, soft nose or a family friend’s hacking cough that broke the peace of a sleepy, starry night, or my grandson’s hat on a hook in a warm mud room rather than on his head while he enjoyed sledding in 10-degree weather and the sniffles that ensued. No, you can’t catch a cold from the cold, but it doesn’t help to further expose yourself to the elements. Remember, germs don’t care where they hang out. In fact, you’ll do just fine.\nMost people don’t set out to be sick, and at the same time, germs are egalitarian beings. They don’t discriminate. They have no predetermined biases.\nAnd each time a vagabond cold manages to hop my train, I backtrack and try to figure out from whom, and from when, did this needy character with its buggy bindle decide to hitch a ride. I’m bleary-eyed and tired of clearing my throat and sneezing.\nFunny thing is, I still can’t help wondering how we got here and where we are going. Isn’t that the big question? And common or uncommon, cold or no cold, we have to know, inquiring creatures that we are, even and especially when our noses are dripping and our throats are scratchy and our poor heads hurt.\nBut chances are, we can never really pinpoint the origin. There are just too many variables in a sea of icky booger possibilities. And besides, the cold isn’t going away until it’s done running its course, so you have to deal with it in the best way you can -- you just gotta get through it.\nThis is probably useless, but when I get a cold, I tend to go into action-stations mode, disinfecting counters, stripping beds, bleaching sheets and towels, mopping floors. I look like a zombie in slippers, but I keep moving, ’cuz the only way out is through. I wash my hands, pop throat lozenges and throw on a scarf. But the joke’s on me. The invader has broken and entered. My walls of defense have already been breached.\nMaybe I didn’t get enough sleep. Yep. Perhaps I ate too many sweets and not enough vegetables. Yep. Possibly I kissed one too many faces and squeezed one too many hands. Yep. Yep. Shared one too many sips and shared one too many bites. Same. I suppose my show of effort to oust the occupation of germs after the fact only serves to make me feel in control. I want to vanquish, to be the heroine victor with my magical Clorox cape.\nBut as much as I hate to admit it, there’s no controlling the common cold.\nThe scary and real truth is, every surface of every thing in our world, unless you live in a plastic bubble, is laced with stealthy, infectious nano-bodies ready to walk right in, uninvited.\nAs we know, the human body has plenty of ports of entry, and these micro-bodies are just looking for opportune entrances, from teary eyes to an itchy nose to a lint-tickled ear. All it takes is just the right touch.\nThere should be checkpoint signs above each orifice armed with little guards standing by to hold back such invisible threats. Instead, we’re stocking up on Kleenex and cough drops, and dusting off the warm-air vaporizer, which, you realize after all, is the perfect breeding ground for the germs you’re trying to avoid in the first place. Grumble. So you head to a pharmacy and spring for a cool-mist gadget with a slot for lavender vapors.\nYou’ve had an indulgent week of stuffing yourself with Thanksgiving fare, and now the vow you made to clean up your eating habits and get back into a regular exercise routine is on cruddy hold, so you eat another slice of buttered toast and hug a big mug of hot chocolate infused with peppermint. The day you start to feel a smidgeon better, your spouse comes down with the same common thing. Two steps forward, three steps back. More warm mugs. And grandmother’s chicken soup.\nEven after a search for the latest fixes, like aromatherapy treatments, and the oldest remedies, i.e., neti-pot nasal treatments, to ease the discomfort, hands down, grandma’s anti-inflammatory chicken soup does the trick.\nThe good news is, the cold will be a distant memory in a few days, and in the meantime, you can get to know Frost better and perfect your grandmother’s recipe. Feel better!\nEmail Bonnie at bonniejtoomey @gmail.com . Bonnie J. Toomey teaches at Plymouth State University, writes about writing, learning, and life in the 21st century. You can follow Parent Forward on Twitter at https://twitter.com/ bonniejtoomey. Learn more at www.parent forward.blogspot.com or visit bonnie jtoomey.com .", "url": "https://apnews.com/ab405f8941534ce0a9efe329f852491a"}