{"authors": ["Matt Mackowiak The Washington Times"], "date_download": "2020-05-04 20:14:56", "date_modify": "2020-05-04 20:14:56", "date_publish": "2018-11-14 18:28:09", "description": "ANALYSIS/OPINION: In January, Democrats will hold the majority in the House, dealing a crushing blow to much of the legislative agenda advanced by President Trump and Republicans on Capitol...", "filename": "_343beed0bc0d2586790528a8128024b5_1588623296.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_343beed0bc0d2586790528a8128024b5_1588623296.html", "title": "High drug prices a target of opportunity for divided Congress", "title_page": "High drug prices a target of opportunity for divided Congress", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ANALYSIS/OPINION:\nIn January, Democrats will hold the majority in the House, dealing a crushing blow to much of the legislative agenda advanced by President Trump and Republicans on Capitol Hill.\nBut a divided Congress, with Democrats holding a majority in the House and Republicans maintaining control in the Senate, means that any legislation that can pass must be bipartisan.\nThe parties are far apart on a range of hot-button issues, from immigration and taxes to energy. But there is a bipartisan interest in reducing drug prices and the stars may be aligning in January for some legislative action.\nThis issue is not new for Mr. Trump, who campaigned in 2016 on reducing drug prices. This past May, he gave a major speech on the issue, detailing what his administration has done so far, including approving more than 1,000 low-cost generic drugs through the Food and Drug Administration and reforming the Drug Discount Program for seniors. Together, the White House says these steps have already saved more than $9 billion.\nBut the administration is not done.\nThe administration is now proposing a rule requiring drug companies to disclose the list price of prescription medicine on their TV ads. The pharmaceutical industry is opposing this effort, arguing that such a requirement would be illegal. The benefit of the rule is clear for consumers: Price transparency makes consumers better educated and will lead to more competition in the market.\nMr. Trump has targeted the pharmaceutical industry and has not been shy about taking them on directly.\nIn that May speech, he noted, “The drug lobby is making an absolute fortune at the expense of American consumers. No industry spends more money on lobbying than the pharmaceutical health products industry. Last year, these companies spent nearly $280 million on lobbyists. That’s more than tobacco, oil, and defense contractors combined.”\nThe rising cost of prescription drugs is harming average American consumers, swallowing a larger share of their disposable income and eating away at their family budgets, their take-home pay, and even cutting into their savings for retirement.\nPresident Trump has pushed for giving Medicare Part D the authority and tools to negotiate lower drug prices and end the “gag orders” that prevent pharmacies from providing drug prices at the counter.\nAs Health and Human Secretary Alex M. Azar II, a former pharmaceutical executive, wrote, “We are going to give Medicare Part D plans better tools to negotiate discounts on behalf of our seniors tools that private-sector health plans often already use.”\nTransparency, competition and better negotiation will lead to lower drug prices for consumers. More bureaucracy and red tape from government will not lower drug prices. In the private sector, these principles have been working for years.\nPharmacy benefit managers (PBMs) have been encouraging rebates, using negotiation, and encouraging competition will make both Medicare and Medicaid less expensive. Private sector innovation is needed within these government programs.\nMr. Trump remains deeply frustrated that drugs in the U.S. cost so much, with U.S. prices far higher than for comparable drugs abroad.\nThe current Congress has not passed legislation to reduce the cost of prescription drugs, and legislation is going to be needed to make further progress.\nThis issue provides a real opportunity for bipartisan legislative accomplishment in the new Congress if both parties are willing to come together.\nMatt Mackowiak is president of Austin, Texas, and Washington, D.C.-based Potomac Strategy Group. He’s a Republican consultant, a Bush administration and Bush-Cheney re-election campaign veteran and former press secretary to two U.S. senators.", "url": "https://apnews.com/343beed0bc0d2586790528a8128024b5"}