{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:17:04", "date_modify": "2020-05-04 20:17:04", "date_publish": "2018-02-04 12:01:36", "description": "on Trump's address President Donald Trump's first official State of the Union address touched on a number of familiar themes and policy directions as he read his version of the box score of...", "filename": "_7457813fadc248ab9198c5049673efd1_1588623424.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7457813fadc248ab9198c5049673efd1_1588623424.html", "title": "The Good and Bad", "title_page": "The Good and Bad", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "on Trump’s address\nPresident Donald Trump’s first official State of the Union address touched on a number of familiar themes and policy directions as he read his version of the box score of a tumultuous year in office.\nPointing to the economic growth in the first year of his presidency, rising business confidence and particularly singling out historic lows in African American and Latino unemployment rates, Trump celebrated the passage of tax reform and the repeal of the individual mandate of Obamacare.\nAs the most significant piece of his agenda passed into law, with some of the most far-reaching impacts, tax reform, coupled with the repeal of the individual mandate, will at least in the near term deliver tangible benefits to the vast majority of Americans.\nTax reform will also make American companies more economically competitive and more capable of hiring and retaining employees.\nAs positive a development as tax reform is, though, Trump notably said nothing on the rising federal deficit, which is now approaching $1 trillion a year, and the national debt. That cannot be ignored if the Trump presidency is to be considered a fiscally responsible administration.\nIt also remains to be seen whether the repeal of the individual health insurance mandate and its replacement with direct federal spending will in fact be a sustainable and responsible course of action with respect to health care services.\nMeanwhile, on matters of trade and immigration, Trump stayed mostly within familiar parameters.\nDeriding “decades of unfair trade deals that sacrificed our prosperity and shipped away our companies, our jobs and our nation’s wealth” Trump repeated his more economically protectionist stand, which helped make him popular in the Rust Belt.\nBut we urge him to back away from curtailing trade in pursuit of the flawed idea that restricting trade will be a net benefit to American workers and consumers. Centuries of economic research have made clear that freer trade ultimately benefits the greatest number of people.\nWith respect to immigration, Trump made clear that he is open to a plan that would offer a path to citizenship for 1.8 million young people brought to the country illegally. In exchange, he wants greater border security, an end to the visa lottery system and an end to “chain migration,” to which he attributed acts of terrorism and other problems.\nWhile it is significant that he’s open to a path to citizenship, and compromise is important, immigration policy should be guided by evidence, not political rhetoric, and we encourage both parties in Congress to work through a deal that makes sense.\nFinally, Trump’s remarks on foreign policy left much to be desired. Nearly two decades into the war in Afghanistan, there is no clear objective in sight.\nAdditionally, while ISIS has been pushed to the brink, our nation’s efforts against it in Syria and Iraq remain unauthorized by Congress. If Trump is serious about making a priority of defeating ISIS, congressional authorization should be demanded.", "url": "https://apnews.com/7457813fadc248ab9198c5049673efd1"}