{"authors": ["Duncan Adams Daily Inter Lake"], "date_download": "2020-05-04 20:14:00", "date_modify": "2020-05-04 20:14:00", "date_publish": "2018-10-10 05:00:01", "description": "Five men from the region whose livelihoods hinge on cutting timber met with U.S. Senate candidate Matt Rosendale Tuesday afternoon in a back room at Sykes, in downtown Kalispell, to outline a host...", "filename": "_eb59baa1c43a405a8a15689a41b71328_1588623240.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eb59baa1c43a405a8a15689a41b71328_1588623240.html", "title": "Rosendale solicits concerns from regional logging industry", "title_page": "Rosendale solicits concerns from regional logging industry", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Five men from the region whose livelihoods hinge on cutting timber met with U.S. Senate candidate Matt Rosendale Tuesday afternoon in a back room at Sykes, in downtown Kalispell, to outline a host of challenges facing their industry.\nThe Glendive Republican and state auditor continued his campaign to oust incumbent U.S. Sen. Jon Tester, a Democrat. In August, Rosendale met at Sykes with local veterans to hear their concerns.\nOn Tuesday, the timber industry representatives listed concerns ranging from restrictions tied to the Endangered Species Act to the process for cutting timber on lands managed by the U.S. Forest Service, which they said is encumbered by red tape, snarled by litigation and hampered by the Forest Service’s apparent reluctance to identify acreage for logging.\nLeelyn Cahoon, of Bull Creek Forestry in Seeley Lake, told Rosendale that a regional Forest Service official had said that their job is to manage recreation, not the forest. He and others told the candidate that it is easier to work with the state than the federal government on timber sales.\n“Don’t get me wrong, there are some great people with the Forest Service,” he said.\nCahoon, named “Logger of the Year” in 2017 by the Montana Wood Products Association, said it would make more sense for the Forest Service to promote timber sales that could enhance forest health rather than spend millions of dollars fighting wildfires.\nIn addition, he said use of the Good Neighbor Authority - a measure authorized by the 2014 Farm Bill that empowers the Department of Natural Resources and Conservation to serve as an agent of the Forest Service and use state contracting services to conduct forest restoration and management activities on the ground - could be helpful because “the state people know how to get things done.”\nIn September, Gov. Steve Bullock announced a new, collaborative approach to forest management that could include the use of the Good Neighbor Authority.\nAt the time, Keith Hammer, chairman of the Swan Valley Coalition, and other representatives of conservation groups expressed concerns about the Good Neighbor Authority’s potential to result in destructive timber cutting.\nOn Tuesday, Kvande Anderson of Double Ott Trucking in Condon told Rosendale that cutting timber from state-managed or private lands isn’t enough to sustain businesses dependent on logging.\nSeparately, the candidate expressed concerns about the Equal Access to Justice Act, wondering whether it encourages legal challenges of timber sales.\nThe act allows attorney fees and other expenses to be awarded to individuals and small entities who can demonstrate that they are a “prevailing party” in litigation against the federal government.\nKevin Cotton, a salesman for Titan Machinery in Missoula, responded that litigants trying to stop timber sales should have some “skin in the game.”\nMike Garrity, executive director of Alliance for the Wild Rockies, responded Wednesday to Rosendale’s comments about the Equal Access to Justice Act.\n“Rosendale seems to have forgotten that the First Amendment to the U.S. Constitution very specifically guarantees all Americans the right to challenge government decisions,” Garrity said.\nTim McEntire, Northwest region representative for the Montana Logging Association, told Rosendale that concerns about protecting grizzly bear habitat in some areas have reduced the time loggers can be in the woods from about eight months to about six months.\nCotton added, “Just so you know, there are too many grizzly bears.”\nEd Jungers of J. & E. Contracting in Seeley Lake weighed in.\n“We love the bears too, but they need to be managed,” he said.\nFederal and state wildlife officials estimate there are about 1,000 grizzly bears occupying the Northern Continental Divide Ecosystem’s 8 million acres. The bear is considered a threatened species.\nAs the meeting wound down, Rosendale told the five men who had joined him at Sykes that he has been meeting the people who could help boost logging in Montana if he is elected to the Senate.\n“Well, go whip Tester, and do it,” said Jungers.\nMeanwhile, Tester stopped in Kalispell Monday for the grand opening of the Glacier Rail Park. He and other members of Montana’s Congressional delegation helped secure $10 million in federal grant funding for the project.\nReporter Duncan Adams may be reached at dadams@dailyinterlake.com or 758-4407.", "url": "https://apnews.com/eb59baa1c43a405a8a15689a41b71328"}