{"authors": ["Matt Bruenig", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Miya Tokumitsu", "Stan De Spiegelaere", "Michel Husson", "Stephanie Treillet", "Daniel Aldana Cohen"], "date_download": "2020-05-04 19:59:07", "date_modify": "2020-05-04 19:59:07", "date_publish": "2018-05-31 00:00:00", "description": null, "filename": "2018_06_working-hours-vacation-productivity-united-states-nordic_1588622347.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/05/31190248/41503984554_301032ad7f_k.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_06_working-hours-vacation-productivity-united-states-nordic_1588622347.html", "title": "The Overworked American", "title_page": "The Overworked American", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "In light of recent discussions, I thought it might be useful to refresh myself on how different work is in the US and Nordic countries, especially in more recent years after the effects of the Great Recession have started to wear off. In particular, I am interested to know how much the quantity of work differs in these countries.\nOne place to start this inquiry is to see what percent of each country’s population is actually working. The following graph provides that information.\nAs you can see, the employment rate varies from 46 percent in Finland to 53 percent in Norway. The US is a shade on the low side, but not by too much. Introducing a universal child care benefit would easily get us up to the Nordic average on this statistic.\nThe next question is how many hours do each of these workers put in each year? The following graph provides that information.\nUS workers put in more hours than workers in all four Nordic countries and way more hours than workers in Denmark and Norway. Getting down to Danish and Norwegian levels of work would be like giving American workers 2.2 additional months of vacation each year.\nWhat is especially interesting about America’s high number of hours worked is that normally hours worked declines as hourly productivity goes up. This is true generally across countries and also true within the Nordic countries. But it is not really true of the US, which works far more hours than its hourly productivity would predict.\nThe following graph shows the PPP-adjusted GDP per hour of the US and the Nordic countries.\nWhen you look only at the Nordic countries, you see that this graph is basically a mirror of the prior one. In the prior graph, Finland and Sweden work the most hours. Here they have the lowest per-hour GDPs. In the prior graph, Denmark and Norway work the least hours. Here they have the highest per-hour GDPs. That’s the usual trend across most countries: the higher the per-hour GDP, the lower the hours worked.\nThe US bucks this trend. In 2016, the US produced $69.6 of GDP per hour worked, a tick above Denmark. Yet the country’s workers put in 23 percent more hours than Danish workers. Put another way: the US could have Danish levels of wellbeing and work 2.2 fewer months each year, but instead it works way more than Denmark and has wild levels of inequality, poverty, and absolute material deprivation.\nThe last indicator worth looking at is hours worked per capita. This essentially combines the measures from the first two graphs to provide a full measure of labor utilization in each country.\nThe US puts in the most overall hours of work on this measure as well, despite having a slightly below-average overall employment rate and higher hourly productivity than all of the Nordic countries except Norway.\nWhat this all shows is that we don’t need more work in America. We have too much of it already.\nThere is a good case for redistributing the work in the US a bit more broadly. The best way to do that would be to decrease the amount of hours people currently employed have to work by providing more holidays, vacation, paid leave, and sick leave, and then increasing the ability of others to work by providing social care for children, the elderly, and the disabled and by implementing active labor market policies.", "url": "https://www.jacobinmag.com/2018/06/working-hours-vacation-productivity-united-states-nordic"}