{"authors": ["Ed Russo"], "date_download": "2020-05-04 20:07:32", "date_modify": "2020-05-04 20:07:32", "date_publish": "2018-03-25 07:00:00", "description": "Business and personal reasons led Ronda Perkins to change the name of her sports bar and restaurant from Sam’s on Franklin to Trev’s Sports Bar & Grill. Perkins had a successful career in...", "filename": "_9c9272cf6b04462b9b43196f641e43ea_1588622852.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9c9272cf6b04462b9b43196f641e43ea_1588622852.html", "title": "Tribute to a son", "title_page": "Tribute to a son", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Business and personal reasons led Ronda Perkins to change the name of her sports bar and restaurant from Sam’s on Franklin to Trev’s Sports Bar & Grill.\nPerkins had a successful career in the elder care field before purchasing Sam’s on Franklin Boulevard a year ago.\nChanging the name gives the business a new identity, which is part of Perkins’ goal to differentiate her business from the previous owners.\nAnd by naming the sports bar Trev’s, Perkins is honoring her late son, Trevor Dorry, who died in an accident nearly four years ago.\n“Naming it after him gave me the ability to feel like I was doing that,” Perkins said.\nSince she acquired the business, Perkins has added new dishes to the menu, as well as events, such as weekly karaoke and trivia nights.\nHer business is located across Franklin Boulevard from the University of Oregon and Matthew Knight Arena. The UO’s planned Knight science complex is to be built about a block away on the same side of Franklin as her restaurant.\nConstruction of the pair of four-story, 160,000-square-foot glass towers is expected to begin this summer, with completion in a couple of years.\nWith its proximity to Knight arena, the UO campus and the planned science complex, Perkins says her business is near plenty of potential customers. Besides sports fans and concertgoers, Trev’s food and drinks are meant to appeal to UO faculty and students, as well as travelers who stay at nearby motels on Franklin Boulevard.\nTrev’s Sports Bar & Grill serves breakfast, lunch and dinner. The eatery has food that sports bar patrons might expect, such as burgers, sandwiches and salads. However, it also serves such dinner entrees as grilled salmon and chicken marsala.\nPerkins is adding dishes to appeal to health-conscious customers, including a paleo-friendly sweet potato hash for breakfast.\nThe business scales back its menu in the two hours before an event at Matthew Knight Arena.\n“It’s a pared-down menu,” Perkins said. “No entrees. It’s stuff that the kitchen can get done fast. Usually two hours before an event, everybody shows up and wants to be fed. Getting folks served and out the door before a game is a challenge for sure.”\nPerkins, who started working as a caregiver at age 19, sold her ownership in a memory care home in Springfield in 2014.\nThat year, she also went through a divorce and lost her son. Trevor Dorry had worked as a cook at the Shari’s off Pioneer Parkway in Springfield. He died after falling from the bridge over the McKenzie River at Armitage Park north of Eugene.\nThe accident occurred after Dorry, his younger brother, Tyler, and their friends had floated the river to celebrate a friend’s birthday, Perkins said.\n“They climbed up to the bridge, (to jump into the river) which they had done a million times before, and he slipped and fell before they got over the water,” she said.\nTrevor Dorry was married and had a daughter, who is now 10 years old.\nPerkins returned to work in 2016, taking a job as director of mental health housing with responsibility for a five county area for a Salem-based nonprofit corporation.\nShe left after eight months because the growing travel, hours and workload began to affect her ability to have a healthy balance between work and personal life.\nPerkins then started looking for a bar and restaurant to buy because the idea had long appealed to her. She learned that Sam’s was for sale, and purchased the business for $225,000, plus the cost of the inventory.\nBefore Sam’s, the building housed The Bridge, and before that Deb’s Family Restaurant for many years.\nPerkins took over the business on April 1, 2017. She said she has not drawn a paycheck since then because she has put all of the profit back into the business.\nShe’s also added about eight employees.\n“For the last year, we have been focused on getting a good, solid team in place,” Perkins said. ”We are making sure the food is consistent. I can’t have one cook making this dish one way and another cook making it that way. Quality has to be super important to everybody.”\nSoon after buying the business, Perkins decided that she would change the name as part of a rebranding effort. She hired RG Media Company to create the Trev’s Sports Bar & Grill logo, with teal colored lettering, and to redesign the restaurant’s website.\nAltogether, the rebranding cost about $20,000, including the new sign in front of the business made by Image King Signs in Eugene.\nThe restaurant will have a ribbon-cutting ceremony at 4 p.m. on Monday in recognition of the name change. Perkins picked the day on purpose because it would have would have been Trevor’s 30th birthday.\nPerkins said people patronize restaurants for the food and to take a break from their routines.\n“People go out because they want to escape, whether it’s from work, or from something that is going on at home, or to just get out of the house,” she said.\nShe hopes that people think of Trev’s when they want a go-to place for food, drink and an enjoyable time.\n“I want people to say, ‘Where do you want to go?’ Oh, let’s go to Trev’s, because it’s so much fun,’ ” she said.\nFollow Ed Russo on Twitter @edwardrusso . Email ed.russo@registerguard.com .", "url": "https://apnews.com/9c9272cf6b04462b9b43196f641e43ea"}