{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:11:22", "date_modify": "2020-05-04 20:11:22", "date_publish": "2018-07-24 04:01:00", "description": "Our actions influence others. Like attracts like. If we give up, so will others. If we cry, so will they. But if we decide this is a new beginning, others will take courage. We...", "filename": "_aad5651f4df34569b7ca75bd8f4574a1_1588623082.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aad5651f4df34569b7ca75bd8f4574a1_1588623082.html", "title": "Our thoughts, actions influence others", "title_page": "Our thoughts, actions influence others", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Our actions influence others. Like attracts like.\nIf we give up, so will others. If we cry, so will they. But if we decide this is a new beginning, others will take courage.\nWe influence other people. Our attitudes send our ripples of feeling - like the scent of flowers that floats on air currents.\nWhat we think and what we say set the stage for what is to happen. We can change our minds, our words, our attitudes, and we stop crying.\nWe act like our prayers are already answered and take steps to show we believe it. When the early morning sun breaks through the far side of the woods, the dark places are lighted, and much healing takes place, and it is with us.\nTo share wise words from a Native American chief Black Elk: “Great Spirit, you lived first, and you are older than all need.”\nMy experience is to think peace, speak peace and you will feel peace. The beauty of life is right in front of us; we must open our eyes and see it.\nWhen we see it, we realize what a small part we are of it, but what we say and do makes a big difference as to how we experience it.\nWe all have the power to change what we don’t like that is going on around us — by changing how we think and act.\nMelinda Phillips\nHuntington", "url": "https://apnews.com/aad5651f4df34569b7ca75bd8f4574a1"}