{"authors": ["Eric Mark"], "date_download": "2020-05-04 20:15:20", "date_modify": "2020-05-04 20:15:20", "date_publish": "2018-01-17 00:00:00", "description": "Developer Robert Tamburro says his latest project is caught up in a Catch-22. Tamburro plans to build a retail complex on the site of the former Valley Crest nursing home, in Plains Twp. His...", "filename": "_b10890a6f8dc4e55aade587834ed9404_1588623320.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b10890a6f8dc4e55aade587834ed9404_1588623320.html", "title": "Developer Wants Tax Break To Build On Valley Crest Site", "title_page": "Developer Wants Tax Break To Build On Valley Crest Site", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Developer Robert Tamburro says his latest project is caught up in a Catch-22.\nTamburro plans to build a retail complex on the site of the former Valley Crest nursing home, in Plains Twp. His company purchased the 62-acre site, off Route 315 near the Department of Veterans Affairs Medical Center, from Luzerne County in 2015.\nTamburro on Tuesday said he has had discussions with potential corporate tenants about leasing space at the proposed shopping complex. Those tenants want a timeline that specifies when they can move in and open for business, he said.\nIn the meantime, it would require major infrastructure improvements to make the project possible, according to Tamburro. Those improvements, including upgrades to an already busy intersection that would provide access to the site, would cost millions of dollars, he said.\nTo finance the infrastructure improvements, Tamburro hopes to obtain a tax abatement from Plains Twp., Wilkes-Barre Area School District and Luzerne County, through a program known as tax increment financing, or TIF.\nUntil he gets the tax abatement, Tamburro says he cannot afford to commit to needed traffic improvements — and until he can afford to upgrade the infrastructure he cannot commit to the timeline potential tenants require, he said.\n“In order for us to get a Highway Occupancy Permit to handle the volume of traffic we anticipate the project creating, the intersection where Mundy Street meets (Route) 309 needs to be re-designed and updated,” he said. “In order to do that, we need funding.”\nTamburro said his team is working on plans to improve the intersection and develop the Valley Crest site, which has sat vacant since a county-owned nursing home closed about 10 years ago. The nursing home structures would need to be razed, which would cost about $2 million due to asbestos abatement and environmental concerns, he said.\nThe funds to raze the old buildings and construct the retail center would be entirely private, according to Tamburro. The tax abatement, if approved, would be dedicated solely to infrastructure improvements, he said.\nThose improvements would help the greater public good, by easing traffic problems that already exist near the site of his proposed project, Tamburro said.\n“We think this TIF will be a good opportunity to solve a public problem,” he said.\nOn Tuesday, project consultant Joseph Hogan made the case for the tax abatement to the Luzerne County Redevelopment Authority, which would serve as administrator of the request, if authority members approve.\nHogan, of the firm Mullin & Lonergan Associates, told the authority the tax abatement would be used solely to fund traffic and infrastructure improvements required by the Pennsylvania Department of Transportation.\nThe developers approached the redevelopment authority because only an authority — and not a private firm or a municipality — may serve as administrator of a request for tax increment financing, he said.\nAuthority member Scott Linde suggested that Tamburro and his consultants should meet with redevelopment authority staff members, who would then make a recommendation whether or not to pursue the tax abatement. The authority took no action on the matter Tuesday.\nTamburro declined to discuss specifics of the project, citing the ongoing discussions with potential tenants and the uncertainly over the requested tax abatement.\nHowever, businesses that open in the complex could create about 900 jobs, he said. Plans call for using the entire Valley Crest parcel for the project, which could include restaurants and residential housing as well as retail stores and shops, Tamburro said.\n“Our vision is for some substantial companies to locate on this property,” he said.\nContact the writer:\nemark@citizensvoice.com\n570-821-2117", "url": "https://apnews.com/b10890a6f8dc4e55aade587834ed9404"}