{"authors": ["Stephanie Hill"], "date_download": "2020-05-04 20:08:33", "date_modify": "2020-05-04 20:08:33", "date_publish": "2018-02-08 05:01:00", "description": "\"It is better to keep the top half of the gas tank full.\" - My dad \"That is why we never give up. Though our bodies are dying, our spirits are being renewed every day.\" - 2 Corinthians...", "filename": "_64bbe9b5102d427f93f1dc7240699e32_1588622913.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_64bbe9b5102d427f93f1dc7240699e32_1588622913.html", "title": "Stephanie Hill: To live your best life, you have to keep your tank full", "title_page": "Stephanie Hill: To live your best life, you have to keep your tank full", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "“It is better to keep the top half of the gas tank full.” - My dad\n“That is why we never give up. Though our bodies are dying, our spirits are being renewed every day.” - 2 Corinthians 4:16\nThis past week was Catholic Schools Week at the school in which my husband, John, and I teach. A special, fun-filled week with daily activities for students. The culminating experience occurs Friday with the annual eighth-graders-versus-teachers event. Lasting a little more than an hour at the end of the school day, the students cheer, applaud and, yes, scream for their favorite “team.”\nThis past Friday was made extra special as members of the Marshall University football team stepped into the role of teachers for a flag football game. Energy, enthusiasm, and excitement were palpable - making this year’s closing occasion even more loud and frenetic! By the end, as we walked out of the gym, my ears were ringing, and I observed numerous exhausted students. Many of the students that I teach were resting with their heads down on the tables as they waited for their parents to pick them up. Their tanks were visibly empty.\nWhen I was a new driver, I recall my dad instructing me on the importance of never allowing my car to go much lower than a half-tank. I can still hear his advice.\n“Steph, you never know what you might encounter on the road. You could get stuck in a traffic jam, or you could get stranded on an empty road late at night. Never let your gas gauge dip below half a tank, especially in the winter.”\nOf course, as a teenager, I doubted my dad. It wasn’t like he was a professional mechanic. I mean, really, he worked in an office all day. What did he know?\nIt turns out, there are several valid reasons for keeping a vehicle’s gas tank above the half-full mark. These include avoiding mechanical issues; increased gas mileage; increased safety, especially during the extremes of summer and winter conditions; saving time; and ultimately, saving money. It occurred to me how very similar this is to life.\nn Mechanical issues: As I understand it, gas not only serves as fuel for the car, but also as a coolant for the fuel pump. Additionally, a nearly empty tank can cause the fuel pump to overheat. Furthermore, it can also increase the amount of gunk and sediment in the car’s tank, which can foul the fuel filter or clog the fuel injector - all of which can contribute to mechanical malfunction.\nLikewise, our bodies need to be fueled with quality foods rather than processed. In the words of Michael Pollan, “Eat food. Not too much. Mostly plants.” Processed food (think bright, shiny packages) are usually full of “gunk and sediment,” such as excess sugar, preservatives, chemicals, and food coloring, foul up our body and, ultimately, our health. Just as we put our car’s health in mechanical jeopardy when we run our gas low, feeding our bodies processed foods runs our bodies low on nutrition while increasing the risk for a health break down.\nn Gas mileage. Increased fuel efficiency is another reason to keep the gas tank of a vehicle filled. Likewise, our bodies’ tanks need filled with 6-9 hours of sleep. Our body downshifts into repair mode as we sleep, keeping our “engines” running more smoothly. A full night’s sleep fills our life-tank with copious benefits, including increased memory; decreased inflammation; reduction of depression/anxiety; increased focus/attention; decreased likelihood of accidents or mistakes; reduction of stress, increased ability to maintain a healthy weight; increased longevity and promotion of healing, to name a few. Therefore, living a fully productive life requires nightly fill-ups of sleep.\nn Safety. Running a vehicle “on fumes” puts you, and any passengers with you, at risk for engine failure. Engine failure can cause a whole host of mechanical issues including loss of brakes and power steering. Plus, you risk becoming stranded - potentially in an unsafe situation. Likewise, allowing our spiritual health to run on fumes not only weakens our mental health, but also deeply affects our soul. Regular routines of scripture reading, prayer, meditation, and participation in your house of worship continually refuels the heart and soul with abundant love and inspiration. Without a heart-centered faith connection, we too, run the risk of being spiritually stranded in a world filled with soul-sucking distractions. Divine Providence does not demand perfection, it just asks for regular faith-full fill-ups.\nn Save time. Sure, stopping to gas up takes time - not something you exactly want to do on the way home after a 12-hour shift with an outside temperature below freezing. However, filling half a tank takes less time than refueling a whole; and, it’s much faster than the time needed for repairs if you perpetually run your car on fumes. Likewise, skipping exercise seems like a perfect time-saver. However, in the long run, taking time to exercise will benefit you with increased energy; increased ability to maintain or lose weight; stronger bones and muscles; increased cardiovascular health; reduced risk of disease; improved skin health; increased sleep quality; increased brain and memory function; as well as reduced stress. People who do not exercise spend more time sick, visiting doctors and/or therapists, or even time in the hospital. Thus, taking time to top off your tank with regular bouts of moderate physical activity, in any form, is like making regular deposits of quality time toward the longevity of your life.\nn Save money. Regularly skimping on the expense of gas fill-ups until the last-possible moment will not save money in the long run, especially if you end up needing a costly repair. The same is true for our own proverbial life-tanks. In our consumer driven world, we are repeatedly assaulted with images of the “good life.” From decked-out, oversize vehicles, to expansive, multi-roomed homes; from the current fashion trends, to the perfectly outfitted child; from the latest, greatest personal devices, to the newest, technologically most advanced home gadgets, from the picture perfect cup of coffee, to the over-the-top dining experience - message is clear, in order to be happy, one must spend and spend a lot. Does all of this spending really fill our life tanks? Or do loving connections, both at home and with friends/loved ones, mean more? In the long run, I believe, regular doses of time spent with family, friends, and loved ones, even in the simplest of settings, is far more fulfilling than any non-human thing that can be purchased.\nTo be certain, living a full life is not as easy as filling up our car’s gas tank. Life is never perfect. Often, like the roads over which our cars travel, life can be filled with unexpected curves, congestion, and tie-ups. Nonetheless, just like lack of proper car maintenance can shorten the life and quality of our car, so can our life choices. I guess Dad knew what he was talking about after all - keep the tank full!\nStephanie Hill is a freelance writer and a teacher at St. Joseph Catholic School in Huntington. She is also a lifelong resident of Lawrence County. She can be reached at hill992@zoominternet.net. Or you can check out her website, stephsimply.com.", "url": "https://apnews.com/64bbe9b5102d427f93f1dc7240699e32"}