{"authors": ["Andrew J. Tobias"], "date_download": "2020-05-04 20:04:35", "date_modify": "2020-05-04 20:04:35", "date_publish": "2018-04-16 16:11:00", "description": "Jim Renacci says he has $4.2 million for U.S. Senate run following campaign finance deadline", "filename": "_084b5f4b3ee04377b1e4b8896eebefe4_1588622675.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_084b5f4b3ee04377b1e4b8896eebefe4_1588622675.html", "title": "Jim Renacci says he has $4.2 million for U.S. Senate run following campaign finance deadline", "title_page": "Jim Renacci says he has $4.2 million for U.S. Senate run following campaign finance deadline", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jim Renacci says he has $4.2 million for U.S. Senate run following campaign finance deadline\nJim Renacci says he has $4.2 million for U.S. Senate run following campaign finance deadline\nCLEVELAND, Ohio — Republican U.S. Rep. Jim Renacci and his allies raised about $4.5 million for his U.S. Senate bid in the roughly 10 weeks after he launched his campaign in January, according to his campaign.\nCounting that fundraising, the Renacci campaign and an affiliated joint fundraising committee, together had $4.2 million in cash as of March 31, according to a campaign statement released Monday.\nCampaign officials did not offer a detailed breakdown of campaign fundraising and expenditures, and an itemized filing was not immediately available.\nDemocratic U.S. Sen. Sherrod Brown already has announced raising $3.3 million during the same time period, with $11.8 million in cash on hand. Overall, Brown has raised almost $17.9 million for his re-election campaign. A more detailed breakdown of spending was not immediately available. Campaigns were required to file their first-quarter 2018 campaign finance activity with the FEC by the end of Sunday. But there is typically a lag between when the filings are submitted and when the FEC makes them publicly available online. The numbers used in this story were voluntarily released by the campaigns.\nDue to the lack of detailed numbers, it’s unclear whether Renacci outraised Brown in the first quarter of 2018, since his campaign’s written statement left open the possibility that Renacci, an independently wealthy businessman, had loaned money to his own campaign. Renacci decided to run for Senate in January 2018, abandoning a run for governor, after Republican Ohio Treasurer Josh Mandel surprisingly dropped out of the race.\nAn earlier version of this story misstated Sherrod Brown’s campaign cash-on-hand total.\nThe other Republican U.S. Senate candidates — Cleveland investment banker Mike Gibbons, Central Ohio business owner Melissa Ackison, Central Ohio retiree Don Eckhart and Southwest Ohio financial adviser Dan Kiley as of Monday morning had not disclosed their top-line campaign finance numbers.\nThe primary election is on May 8, although early voting in Ohio already has begun. Renacci is considered the Republican frontrunner, having consolidated support from Ohio’s Republican political establishment and most major GOP groups, although a recent poll found that nearly two-thirds of likely Republican primary voters remain undecided.", "url": "https://apnews.com/084b5f4b3ee04377b1e4b8896eebefe4"}