{"authors": ["Joe Rutter"], "date_download": "2020-05-04 20:04:31", "date_modify": "2020-05-04 20:04:31", "date_publish": "2018-01-15 21:21:35", "description": "Five things we learned from the Steelers' 45-42 loss to the Jaguars in the AFC divisional round playoff game Sunday: 1. Yes, the Steelers can defy belief and give up deep pass completions to...", "filename": "_b2d8b007d007486288feb2da3ae15019_1588622671.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b2d8b007d007486288feb2da3ae15019_1588622671.html", "title": "Steelers pass defense needs fixing, and other things we learned in loss to Jaguars", "title_page": "Steelers pass defense needs fixing, and other things we learned in loss to Jaguars", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Steelers pass defense needs fixing, and other things we learned in loss to Jaguars\nFive things we learned from the Steelers’ 45-42 loss to the Jaguars in the AFC divisional round playoff game Sunday:\n1. Yes, the Steelers can defy belief and give up deep pass completions to Blake Bortles.\nThe Jaguars quarterback was supposed to be the weak link in the Jacksonville offense. He had 88 yards passing in the wild-card round, and the intent was for the Steelers to shut down the running game and force Bortles to pass.\nAfter all, how could Bortles beat them, especially on the deep ball?\nIt happened, continuing a second-half trend of poor play by the Steelers secondary. Bortles had completions of 45, 40, 21 and 19 yards in the game. On the first series, he had 53 yards passing as he led the Jaguars on a touchdown drive.\nPerhaps the biggest play was the 45-yard completion to Keelan Cole in the fourth quarter. The pass, which was caught between cornerbacks Joe Haden and Artie Burns, set up a 3-yard touchdown run that pushed the Jaguars’ lead to 35-21 with 10:34 remaining.\nA secondary that had second-year starters in Burns and safety Sean Davis, plus the addition of former Pro Bowl selection Haden, opened the year with such promise. Through the first four games, the Steelers didn’t allow one pass completion of at least 30 yards and just two of at least 25 yards.\nBut in the final 12 games, the Steelers allowed 13 pass plays of at least 40 yards, 24 that were at least 30 and 30 plays over 25 yards.\nHaden is signed for two more years and Mitchell has one year left on his contract. Davis and Burns are playing under their rookie contracts.\nRookie Cam Sutton could take on a bigger role next year, and rookie Brian Allen could push for more playing time as he continues to learn the position. The depth isn’t as prevalent at safety.\nChanges can be expected in the secondary. Otherwise, the likes of Bortles (let alone bona fide down-field passers) could present more problems for the Steelers in 2018.\n2. No, the Steelers didn’t fix their run-game deficiencies on defense.\nThe primary goal for the defense was the stop Jaguars rookie running back Leonard Fournette, who had gouged them for 181 yards in the regular season.\nIt was a concern entering the game considering the Steelers allowed five of their final six opponents in the regular season to surpass 100 yards rushing — yielding an average of 127.4 yards per game.\nOn Sunday, Fournette scored on a 1-yard fourth-down plunge on the opening series, the first sign that he wasn’t hitting the so-called rookie wall. He added touchdowns on runs of 18 and 3 yards while finishing with 109 yards on 25 attempts.\nFournette had 82 yards in the first half when he averaged 6.8 yards on 12 attempts before leaving with an ankle injury. Backup T.J. Yeldon had 20 yards on five carries and scored on a 4-yard run, and Fournette returned in the second half.\nThe Steelers also couldn’t contain Bortles, letting him gain 35 yards on five rushes. That added up to 164 yards rushing and a 4.7 average for the Jaguars.\nIt was another indication of how badly the Steelers missed inside linebacker Ryan Shazier. Fournette kept getting to the second level of the defense, and Vince Williams and Sean Spence weren’t up to the task of stopping him.\n3. It might be time to invest in a new right tackle.\nMarcus Gilbert’s early exit because of a concussion was another sign that his best days with the Steelers may be behind him. Hamstring injuries kept him out of the lineup for five games, and his suspension for performance-enhancing drugs cost the Steelers a four-game absence.\nGilbert is due to count $7.3 million and $6.6 million against the salary cap over the next two seasons, respectively. But since the Steelers can’t keep him on the field consistently, it might be time to start over, even if Gilbert is viewed as one of the best right tackles in the game.\nBackup Chris Hubbard is a free agent, and former fourth-round draft pick Jerald Hawkins is inexperienced. The replacement options are slim, but getting a more durable tackle on the right side is an option worth considering.\n4. The Steelers had no answer for Telvin Smith.\nThe Jaguars linebacker introduced himself in October when he returned an interception for a touchdown in the 30-9 win. For an encore, he returned a fumble 50 yards for a touchdown Sunday to give the Jaguars a 28-7 lead in the second quarter.\nSmith, though, wasn’t just in the right place at the right times in terms of converting turnovers into touchdowns. He also was the most productive defender on either team. Smith had 14 solo tackles and 16 total.\nNo other Jacksonville player had more than seven.\n5. One important offseason question was answered immediately after the game.\nAfter a season filled with distractions, Ben Roethlisberger ensured that his future plans wouldn’t be one of them carrying over into the winter.\nRoethlisberger announced his intentions to return in 2018 for a 15th season. This, of course, was a departure from last offseason when he first made the possibility of retirement public and didn’t give a firm answer until April.\nDespite his interception that led to a score and fumble that was returned for a touchdown, Roethlisberger nearly willed the Steelers all the way back from a 21-point deficit. With his future plans known, Steelers management can worry about addressing other areas in the offseason.\nJoe Rutter is a Tribune-Review staff writer. Reach him at jrutter@tribweb.com or via Twitter @tribjoerutter.", "url": "https://apnews.com/b2d8b007d007486288feb2da3ae15019"}