{"authors": ["Rachel Rodgers Rrodgers Saukvalley.Com", "Ext."], "date_download": "2020-05-04 20:05:44", "date_modify": "2020-05-04 20:05:44", "date_publish": "2018-12-20 00:03:00", "description": "ROCK FALLS – A former Whiteside County Airport Board chairman was honored for nearly 3 decades of service to the airport. The board recently inducted Stan Domack Jr., 83, of Morrison, into...", "filename": "_cee4f1c0c3b34878b304a51a17d118f8_1588622744.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cee4f1c0c3b34878b304a51a17d118f8_1588622744.html", "title": "Airport honors former chairman", "title_page": "Airport honors former chairman", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ROCK FALLS – A former Whiteside County Airport Board chairman was honored for nearly 3 decades of service to the airport.\nThe board recently inducted Stan Domack Jr., 83, of Morrison, into the airport’s Hall of Fame.\nDomack was on the board for 29 years, including 5 as chairman; he resigned in April 2017. His tenure in aviation spans 42 years.\nHe served 4 years in the U.S. Air Force and 9 in the Illinois Air Guard Reserves. He and his late wife, Shirley moved to Morrison in 1957.\nDomack is a member of the Experimental Aircraft Association as well as the Aircraft Owners and Pilots Association and also was a certified flight instructor.\nThe family has a long history of pilots, including Domack’s aunt in the 1930s, his father and his oldest daughter.\nHe joins several others in the Hall of Fame, which was created in 2003: Joseph H. Bittorf, for whom the airport field is named, Robert “Smiler” O’Rourke, Eugene Jacoby, Kenny Zimmerman, Perry Ports, Bill Havener, Leonard Skaggs, Jack Cassens, Benny Thome, Hal Christianson and Elwood “Verne” Curry.\nThe inductees are chosen for their merits in aviation and their impact on the airport.", "url": "https://apnews.com/cee4f1c0c3b34878b304a51a17d118f8"}