{"authors": ["Paul Turner"], "date_download": "2020-05-04 20:11:48", "date_modify": "2020-05-04 20:11:48", "date_publish": "2018-07-29 00:00:00", "description": "“What was that?” There are at least 21 ways to answer that startled question when someone in your tent asks about a mystery sound late at night while camping. Which of these...", "filename": "_bc87adabd8bc462ebce56adedd3ab7b2_1588623108.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bc87adabd8bc462ebce56adedd3ab7b2_1588623108.html", "title": "Paul Turner: Camping keeps the flame alive", "title_page": "Paul Turner: Camping keeps the flame alive", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "“What was that?”\nThere are at least 21 ways to answer that startled question when someone in your tent asks about a mystery sound late at night while camping.\nWhich of these explanations have you used?\n21. “It was probably just a twig snapping when a grizzly bear stepped on it. Go back to sleep.”\n20. “Well, I seriously doubt if it was those escaped convicts.”\n19. “That was just someone racking a shotgun. Why?”\n18. “Probably some woodland creatures getting frisky.”\n17. “I don’t know. Tell-Tale Heart maybe.”\n16. “I think it was an old screen door with squeaky hinges.”\n15. “Some manner of rabid carnivore.”\n14. “That was wee Mikey popping the top on a coldie. That little scamp!”\n13. “Well, it wasn’t a mountain lion. You never even hear them coming.”\n12. “I think that was one of the kids deciding to get a ‘Children of the Corn’ tattoo.”\n11. “You were dreaming about being in Costco and coming upon a pterodactyl that was handing out samples of some new lentils and bacon dip.”\n10. “Canadians. They’ve come to take back the Northwest.”\n9. “Raccoons trying to find the keys to the rig.”\n8. “Sounded like Michael Myers clearing his throat.”\n7. “Ticks massing outside the tent.”\n6. “Remember that campfire scene in ‘Blazing Saddles?’ ”\n5. “Probably some shards of a burned up satellite hitting a tree.”\n4. “The kids are trying to tunnel out of here and go home.”\n3. “Champagne cork at the next campsite.”\n2. “No more reefer for you. It always makes you paranoid.”\n1. “Everybody look what’s going down.”\nOffline capability\nI suspect I am not the first to have thought of this. But have you ever wondered if camping’s popularity in the Inland Northwest might position us to be the saviors of the world?\nOK, that might be overstating it a bit. But who knows?\nHere’s the deal. Though it varies, some camping locations in our area pose problems for cellphone users. That is, they don’t work well in a few remote locations. At least not for those reliant on certain networks.\nAs a consequence, families on camping trips sometimes have to make do without dependable cell connections. (Yes, I realize for some that’s part of the charm of heading into the woods.)\nThat means, of course, spending time doing things untethered from the online world. You know, perfecting survival skills and whatnot.\nAnyway, it strikes me that this time away from phones and other devices might stand us in good stead in the event of a zombie apocalypse or some other massive failure of the power grid.\nIf it all hits the fan, some of us in the Inland Northwest will still know how to do a few things. Thanks to camping.\nNow I realize camping is not unique to our area. People go camping in California and Minnesota, even with the bugs. I’m also aware that not every Spokane family pitching a tent in the woods starts cooking fires by rubbing sticks together or dines on fish pulled from a nearby lake.\nI’m just saying that time spent without looking at our phones has an upside you might not have considered.\nNo, of course I’m not rooting for something approximating the end times. I’ll leave such fantasies to the hardcore backcountry Redoubters.\nBut I’ll admit I get a kick out of imagining histories written one day about the 21st century’s Dark Ages. Accounts that make reference to “hardy bands of campers from Spokane, Washington, who kept the flame alive and saved our culture.”\nSometimes it’s good to be able to do something without needing to first look up the instructions online.\nChilly scenes of summer\nExperienced campers understand.\nEven when it has been a hot day, it can feel a bit nippy around about 3 a.m., if you are sleeping outdoors in the Northwest. So they prepare. Sometimes the solution is as simple as having a decent sleeping bag.\nBut every summer, a few rookie campers learn this lesson the hard way.\nThey enjoy frolicking throughout a hot summer afternoon. They savor dining around a campfire. They smile while staying up late, listening to stories and laughing under the stars.\nThen they turn in, thinking, “Boy, this camping is fun – I shouldn’t have let my basic hygiene requirements keep me from it for so long.”\nA few hours later, it hits them. “What the … I am freezing to death.”\nAs I said, live and learn.\nWhat’s your big chill story?", "url": "https://apnews.com/bc87adabd8bc462ebce56adedd3ab7b2"}