{"authors": ["Allison Shapiro"], "date_download": "2020-05-04 20:24:28", "date_modify": "2020-05-04 20:24:28", "date_publish": "2018-04-19 15:00:00", "description": "Editor’s note: The year was 1918. America was embroiled in World War I, women were pushing for the right to vote, and a flu pandemic would soon devastate the country. Our Throwback Thursday takes...", "filename": "_7f76d6c92e9d41e486885a0cbfb1c668_1588623868.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7f76d6c92e9d41e486885a0cbfb1c668_1588623868.html", "title": "Throwback: City will have new industry soon", "title_page": "Throwback: City will have new industry soon", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Editor’s note: The year was 1918. America was embroiled in World War I, women were pushing for the right to vote, and a flu pandemic would soon devastate the country. Our Throwback Thursday takes a look back at our most popular stories from this month in history, from the quirky to the heartbreaking.\nReading this throwback from April 19, 1918, it’s easy to see the similarities between then and now. At the Daily Journal’s recent Progress Awards, we heard from business success stories like Hemenover Construction, AAF Flanders and CSL, which has an 1.8 million-square-foot expansion on the way. Today’s throwback, from April 19, 1918, talks about an innovation that helped shape Kankakee County: the modern bandage.\nA factory for making of army bandages will be established in Kankakee May first, according to an announcement this morning of W.L. Rieck, superintendent of the spinning rooms of the Paramount Knitting Company.\nAlthough really a branch of the Paramount Knitting factory, the new concern will be known as the ReUse Knitted Gauze Company. It is backed by Henry Pope, President of the Paramount Knitting Company and other members of the company. Kankakee is to be the only city for the present which will be favored by the establishment of such a bandage factory.\nOwing to lack of room for the new work at the Paramount Knitting Mills, which are being worked to capacity on war orders at the present time, quarters for the new factory have been secured at 243 S. Schuyler Avenue in the store formerly occupied by the Pugh Stores Company. This is being fitted up and it is hoped will be ready for active work shortly after the first of May. Already a carload of machinery has arrived in Kankakee. The 45 machines included in this shipment are believed to be enough to begin actual work. If more machinery is needed it will be added from time to time.\n100 Employees\nBetween 75 and 100 employees will be needed to carry on the work of the new factory. Its general manager has not yet been chosen by the Paramount Knitting Company, although Mr. Rieck declared that the company was considering the appointment of one out of several applicants. When asked if any of the present employees of the Paramount would be transferred to the new factory, Mr. Rieck declared that the present mills are able to use all the employees they have at present and that 75 or 100 new employees, many of whom will be women, will be hired to conduct the work. This will mean work for 100 additional persons in Kankakee.\nOwing to the high cost of cotton and the fact that cotton bandages must be thrown away when used once, experiments have been conducted with gauze as a substitute for cotton. For some time past the Paramount Knitting Mills have been quietly making samples of new bandages which have been submitted to the government and which have received the approval of the medical department of the army.\nThese gauze bandages have been tried at army cantonments and have been found satisfactory in every respect and can be used for almost everything for which a cotton bandage can be utilized. More than this, the new bandages can be washed and reused any number of times. Apparatus for rewashing these bandages will be installed in all the army camps.\nOrders Already Received\nA big trial order had already been secured by the Paramount Knitting Company. Although Mr. Rieck did not care to state the exact size of this order he admitted that it was a large one, but declared that is was only a drop in the bucket compared with the size of future orders which the new company expects to secure.\nFor the duration of the war the new factory will turn all its attention to supplying the government with bandages. None of these new bandages will be placed on the commercial market. Mr. Rieck declared, however, that this would probably be done after the war is over.\nThe new factory will knit about 5,000 yards of gauze a day. Besides knitting this gauze it will be cut up into the necessary patterns and shapes and will be shipped wherever the government may designate. For the present most of the output will probably be utilized at the army cantonments, although some of the new bandages may be sent to France immediately.", "url": "https://apnews.com/7f76d6c92e9d41e486885a0cbfb1c668"}