{"authors": ["Jonathan Bombulie"], "date_download": "2020-05-04 20:24:59", "date_modify": "2020-05-04 20:24:59", "date_publish": "2018-04-01 06:47:27", "description": "Maybe it's coming Thursday night. Maybe it will have to wait until the Thursday after that. Perhaps it already happened last Sunday afternoon, and we just didn't know it at the...", "filename": "_dfd4e3ed0be242b48dbc295a18725560_1588623899.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dfd4e3ed0be242b48dbc295a18725560_1588623899.html", "title": "Late-season game could have implications for Penguins", "title_page": "Late-season game could have implications for Penguins", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Maybe it’s coming Thursday night.\nMaybe it will have to wait until the Thursday after that.\nPerhaps it already happened last Sunday afternoon, and we just didn’t know it at the time.\nGiven the way the last few weeks of their schedule shake out, there’s a pretty good chance the Penguins will have staged a playoff preview against their future first-round opponent within the final seven games of the regular season.\nThursday night, it’s New Jersey. The Thursday after that, it’s Columbus. Last Sunday was Philadelphia.\nUnless the Penguins make a late charge past first-place Washington in the Metropolitan Division standings or a late plunge into a wild-card spot, they’ll open the postseason against the Devils, Blue Jackets or Flyers.\nThis scheduling quirk prompts an obvious question: Does the outcome of a late-season game really have any bearing on a postseason series once it starts?\nIs it a chance for the winning team to send a message or is it a result that is quickly forgotten once the games start to really count?\nA quick survey of the Penguins locker room showed a variety of opinions.\nCoach Mike Sullivan, for instance, had no use for any talk of message sending. After a brutal 5-2 loss at Detroit on Tuesday night, his focus is set squarely on merely getting his team into the tournament.\n“I just think the points are important, and we’ve got to try to win regardless of who our opponent is,” he said. “There’s obviously a rivalry over the years that’s built up with these divisional teams. Every night, the stakes are high for both sides. I think the points are most important. We’re trying to put ourselves in the best possible position.”\nCarl Hagelin, meanwhile, said he thought this a great time of year to send a message, but not to a potential playoff foe.\n“Within this locker room, we need to send the message to each other that we’re ready to go,” he said. “We need to be better.”\nWhether players or coaches buy into the idea of setting a tone or not, a curious bit of anecdotal evidence says they should.\nFor each of the last five years, the final regular-season meeting between the Penguins and their first-round playoff opponent gave a good preview of how the series would go.\n• On April 4 last season, Jake Guentzel had a goal and an assist as the Penguins cruised past Columbus, 4-1. Eight days later, the Penguins began a five-game series victory over the Blue Jackets. Guentzel had five goals in the series, including a Game 3 hat trick.\n• On March 27, 2016, the Penguins beat the New York Rangers, 3-2, in overtime on a Sidney Crosby goal. Seventeen days later, the Penguins opened a five-game victory over the Rangers. Crosby had three goals and eight points in the series.\n• In 2015, the Rangers hung a 5-2 beating on the Penguins in the final regular-season meeting between the teams and went on to win the first-round playoff series in five games. In 2014, the Penguins managed a 2-1 win over Columbus in late March before dispatching the Blue Jackets in six games once the postseason started. In 2013, the Penguins blanked the Islanders 2-0 on March 30 then won a playoff series between the teams in six games.\nIt’s hardly scientific, but the evidence suggests these late-season meetings are indeed meaningful.\nThat’s fine with defenseman Olli Maatta.\nThe way he sees it, whether the Penguins view the late-season games as an important postseason preview or not, they’re going to play them with playoff-style intensity anyway.\n“I think you want to play these games as hard as you can, and I think it comes automatically,” Maatta said. “You don’t need any extra motivation there. You see the standings. You know those games are huge.”\nJonathan Bombulie is a Tribune-Review staff writer. Reach him at jbombulie@tribweb.com or via Twitter @BombulieTrib.", "url": "https://apnews.com/dfd4e3ed0be242b48dbc295a18725560"}