{"authors": ["Emilie Munson"], "date_download": "2020-05-04 20:13:11", "date_modify": "2020-05-04 20:13:11", "date_publish": "2018-04-24 18:46:03", "description": "HARTFORD — Former Boston Celtics forward Cedric Maxwell and former New York Yankees and Mets starting pitcher Al Leiter brought their star power to the Capitol Tuesday to push lawmakers to pass...", "filename": "_78297669a67e493185772c4616104598_1588623191.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_78297669a67e493185772c4616104598_1588623191.html", "title": "Former Celtics and Yankees stars advocate for Connecticut legal sports betting", "title_page": "Former Celtics and Yankees stars advocate for Connecticut legal sports betting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HARTFORD — Former Boston Celtics forward Cedric Maxwell and former New York Yankees and Mets starting pitcher Al Leiter brought their star power to the Capitol Tuesday to push lawmakers to pass legislation legalizing sports betting in Connecticut.\nJoined by officials from the PGA tour, NBA and MLB, the players hope any bill passed will include a cut for their leagues, 0.25 percent of wagering revenues. The league needs that money to provide the detailed statistics that betters would rely on and keep gamblers from influencing players and officials.\n“It’s all about the protection of the game,” Maxwell said.\nAfter talking to press, the sports stars dashed off to a meeting with Speaker of the House Joe Aresimowicz, D-Berlin, and other legislators.\nAresimowicz and other house leaders have said they support hiring a consultant to create a state “comprehensive gaming strategy” over passing legislation addressing sports wagering, casinos or the lottery individually.\nSports betting is now only permitted in Nevada due to a 1992 federal law. In 2012, Governor Chris Christie of New Jersey signed legislation to permit Nevada-style sports betting, but he was promptly sued by the NCAA, NBA, NHL, NFL and MLB. The case is being heard by the U.S. Supreme Court and a ruling is expected this year.\nAmericans illegally wager $150 billion on sports a year, according to the American Gaming Association.\nemunson@hearstmediact.com; Twitter: @emiliemunson", "url": "https://apnews.com/78297669a67e493185772c4616104598"}