{"authors": ["Jose T. Garza Iii"], "date_download": "2020-05-04 20:14:24", "date_modify": "2020-05-04 20:14:24", "date_publish": "2018-01-01 20:40:16", "description": "Converse City Council has approved the annexation of the Northampton subdivision through a municipal boundary adjustment agreement. The council voted 5-2 at its Dec. 19 meeting to add...", "filename": "_688357e21a7b41d8a48deeb533bba514_1588623264.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_688357e21a7b41d8a48deeb533bba514_1588623264.html", "title": "Converse officials approve Northampton annexation", "title_page": "Converse officials approve Northampton annexation", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Converse City Council has approved the annexation of the Northampton subdivision through a municipal boundary adjustment agreement.\nThe council voted 5-2 at its Dec. 19 meeting to add approximately 293 acres of land to the city as part of a “land swap” deal between Converse and San Antonio that was approved in March. The annexation will be conducted in two phases: Northampton’s northeast tract, roughly 236 acres, on Dec. 31, and the Southeast tract, about 57 acres, on Jan. 31.\nWith approximately 1,074 homes situated in the subdivision, the city will receive $859,000 in property tax revenue.\nCouncil members Deborah James and Joan Lindgren voted against the annexation. James opposed it because she said San Antonio City Council failed to release Northampton to Converse on Nov. 30 per an interlocal agreement and instead opted to combine that phase with the Gibbs-Sprawl annexation as part of one resolution. James said she would have voted for Northampton’s annexation if two separate resolutions were created.\n“I am not against Northampton’s (annexation),” said James. “I am all for helping their (residents) out because they need it.”\nMayor Al Suarez disagreed with James’s position because he said San Antonio approved the annexation.\nIn other business, Converse City Council unanimously approved the appointment of Assistant City Manager Le Ann Piatt to interim city manager. She was set to take over the position Jan. 3. Outgoing City Manager Lanny Lambert announced his retirement at city council’s Dec. 5 meeting.\nPiatt, who has served as assistant city manager for three years, said she will manage the progress of several city projects, such as the new city hall, animal care shelter, fire station and expanded public library in the interim.\n“I am very appreciative that the council has put their faith and confidence in me to guide the city as it grows and expands,” she said.\nCouncil also amended the city’s Economic Development Corporation’s 2017-18 fiscal year budget to include its $1.4 million purchase of approximately 7 acres of land on 301 Center St.\nThe purchase is part of a sales tax revenue bond that was approved in October to allow the corporation to pursue commercial development on the land, which was purchased Nov. 15.\nKate Silvas, Converse EDC director, said several businesses have inquired about the land but declined to name specific suitors.", "url": "https://apnews.com/688357e21a7b41d8a48deeb533bba514"}