{"authors": ["Elizabeth Dobbins", "Edobbins Lowellsun.Com"], "date_download": "2020-05-04 20:25:31", "date_modify": "2020-05-04 20:25:31", "date_publish": "2018-11-26 11:35:40", "description": "LOWELL -- Cheers erupted from the kindergarten classroom. A device made by a McAuliffe Elementary School student -- two cups held together by straws -- had successfully carried plastic...", "filename": "_7365bb598f6640db81e61f827a433c54_1588623931.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7365bb598f6640db81e61f827a433c54_1588623931.html", "title": "McAuliffe Elementary Students Battle in STEM Wars", "title_page": "McAuliffe Elementary Students Battle in STEM Wars", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- Cheers erupted from the kindergarten classroom.\nA device made by a McAuliffe Elementary School student -- two cups held together by straws -- had successfully carried plastic figurines down a string zip line and to their destination unscathed.\n“Wow,” said kindergarten teacher Mary Ellen Debasitis.\nThe demonstration was one of many at the busy elementary school on Wednesday, the day before Thanksgiving. The entire McAuliffe student body worked on projects for STEM Wars, a Star Wars-themed day with an emphasis on science and engineering.\n“It’s a big push for STEM curriculum, really wanting for students to go through the whole engineering design process,” said Principal David Anderson. “They went from getting a problem ... to having to brainstorm a solution to that problem and then come up with a design.”\nOn Wednesday, students were working on creating their models. Anderson said that several days earlier at the official kickoff, Luke Skywalker showed up to assign each grade a project.\nKindergarten students tested carriers and different types of string, such as fishing line and dental floss, to create a zip line for Ewoks.\nStudents in first grade created small cars for different surfaces to serve as a getaway vehicle from Storm Troopers.\nSecond-grade students worked in teams to create droids and third grade students learned basic circuitry to make Lightsabers.\nFourth-graders designed rockets, launched using one liter soda bottles and PVC pipes.\nAnderson said the rally was interrupted by a message from Darth Vader. On Tuesday night, all students received a call from Darth Vader about the upcoming activities.\n“I think it’s built excitement because the kids who may not have been interested may at least connect to the idea of the Lightsaber, of the Ewok,” Anderson said.\nIn addition to promoting STEM, Anderson said the day was intended to encourage attendance on the year’s least attended day. Last year, he said a fifth of students were absent the day before Thanksgiving. Anderson said the school saw a 40 percent increase in attendance this year over this day last year.\nFirst-grader Miller McCauley wore a Star Wars shirt while he worked on a car with his teammates. One set of wheels, a paper towel roll with plastic on either end, was attached to the cardboard body of the car using drinking straws. Miller pointed to a few buttons pasted on top.\n“That’s just to decorate it,” he said.\nUpstairs, 8-year-old Valentina Henriquez-Moreno was working with her team to create a model of a droid, which could be used as an air conditioner. Her team was busy adding a heart, arms and antennas to the device.\nMeanwhile, Yezaidelis Flores, also 8, was working on a drone called Y1F1, after her initials. Attached was a key to get into houses, she said.\nThe drone’s purpose?\n“It takes care of you when you’re sick,” she said.\nFollow Elizabeth Dobbins on Twitter @ElizDobbins", "url": "https://apnews.com/7365bb598f6640db81e61f827a433c54"}