{"authors": ["S.A. Miller The Washington Times"], "date_download": "2020-05-04 20:11:08", "date_modify": "2020-05-04 20:11:08", "date_publish": "2018-11-17 09:10:30", "description": "President Trump on Saturday said he is reviewing CIA conclusions about the killing of dissident Saudi writer Jamal Khashoggi, which reportedly link the assassination to Saudi Crown Prince Mohammed...", "filename": "_0e172ee79752c0bec2cd01a2b6f55885_1588623068.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0e172ee79752c0bec2cd01a2b6f55885_1588623068.html", "title": "Donald Trump weighs response after CIA link Khashoggi killing to Saudi prince", "title_page": "Donald Trump weighs response after CIA link Khashoggi killing to Saudi prince", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Trump on Saturday said he is reviewing CIA conclusions about the killing of dissident Saudi writer Jamal Khashoggi, which reportedly link the assassination to Saudi Crown Prince Mohammed bin Salman.\n“We’re taking a look at it,” Mr. Trump said as he departed the White House for California to see the response to devastating wildfires.\nHe said he would be briefed during the Air Force One flight by the CIA and Secretary of State Mike Pompeo.\nThe Oct. 2 killing of Mr. Khashoggi, a U.S. resident, in Turkey has strained relations with Saudi Arabia.\nMr. Trump said he was carefully weighing how to respond to the longtime ally.\n“You know we also have a great ally in Saudi Arabia,” said the president. “They have been a truly spectacular ally in terms of jobs and economic development and ... as president I take a lot of things into consideration.”\nSaudi Araba also has been a key ally in opposing Iran.\nThe CIA’s conclusions were first reported by the Washington Post, for which Mr. Khashoggi contributed opinion columns prior to his death.\nSources familiar with a U.S. intelligence probe into Mr. Khashoggi’s murder at the Saudi consulate in Istanbul said the CIA has assessed with high confidence that the killing was directed by the Crown Prince Mohammed.\nGuy Taylor contributed to this report.", "url": "https://apnews.com/0e172ee79752c0bec2cd01a2b6f55885"}