{"authors": ["Eric Blanc", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Emily Comer", "Jay O'Neal", "Joe Burns", "Meagan Day", "Kevin Prosen"], "date_download": "2020-05-04 19:53:18", "date_modify": "2020-05-04 19:53:18", "date_publish": "2018-03-08 00:00:00", "description": null, "filename": "2018_03_west-virginia-wildcat-strike-militancy-peia_1588621998.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/03/08125215/GettyImages-926417098.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_03_west-virginia-wildcat-strike-militancy-peia_1588621998.html", "title": "The Lessons of West Virginia", "title_page": "The Lessons of West Virginia", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe Great West Virginia Wildcat is the single most important labor victory in the US since at least the early 1970s. Though the 1997 UPS strike and the 2012 Chicago teachers’ strike also captured the country’s attention, there’s something different about West Virginia. This strike was statewide, it was illegal, it went wildcat, and it seems to be spreading. West Virginia’s upsurge shares many similarities with the rank-and-file militancy of the late 1960s and early 1970s. But there are some critical differences. Whereas labor struggles four decades ago came in the wake of a postwar economic boom and the inspiring successes of the Civil Rights Movement, this labor upheaval erupted in a period of virtually uninterrupted working-class defeats and economic austerity. The Supreme Court’s impending decision to throw the whole public sector back into the open-shop era gives West Virginia’s strike an added degree of momentousness. It’s too early to tell whether West Virginia will spark the revival of a fighting labor movement nationwide. Much depends on whether workers here can keep winning over the coming months — and whether a looming public education strike wave materializes in Oklahoma, New Jersey, Arizona, Kentucky, and beyond. Understanding the reasons workers won this strike will be crucial for activists engaged in these upcoming battles — and for all those interested in reviving the US labor movement. At the same time, it’s important to identify the challenges that lie ahead for the struggle in West Virginia.\nClass Power When it comes to a successful strategy for labor, there’s no need to reinvent the wheel. West Virginia has once again clarified the continued relevance of simple political insights that were long ago abandoned by most union leaders, as well as much of the Left. Class struggle gets the goods. Labor-management “cooperation” has led to concession after concession over the past decades. Nor has the prevailing form of what passes for “social justice unionism” been able to reverse organized labor’s decline. Instead of building workplace power and strikes, many progressive unions have focused on public relations campaigns, moral appeals to consumers, and lobbying Democratic politicians. In contrast, the bottom-up militancy and strike action of West Virginia’s teachers and school employees has reinvigorated working-class organization and won a whole series of important concessions, not the least of which was a 5 percent raise for all public employees. From day one, the active participation of rank-and-filers — and their remarkable ability at critical junctures to overcome the inertia or compromises of the top union leadership — has been the central motor driving West Virginia’s strike forward. Through the empowering dynamics of mass struggle, many individuals who only two weeks ago were politically inexperienced and unorganized have become respected leaders among their coworkers. Winning labor battles often requires breaking the law. Though it is illegal for public employees in West Virginia to strike, they struck anyway. Highlighting the long tradition of taking illegal action to win a righteous cause, many strikers here made homemade signs saying, “Rosa Parks was not wrong.” The state initially threatened to file injunctions to end the strike, but it was forced to back down. At moments of mass struggle, in other words, legality becomes a question of a relationship of forces. If a strike has the strength, the momentum, and the support of the public at large, it is hard for the ruling elite to crack down. A willingness to flout the law will be particularly crucial over the coming period. The constraints of the legal and institutional structure of US labor relations have already set up the union movement to fail. This will become even more the case if, as expected, the Supreme Court eliminates crucial labor rights in the public sector. But as the experience of West Virginia shows, it is possible to fight and win even in the face of the most draconian legal obstacles. Workplaces remain our most powerful site of resistance against the ruling elite. The fact that the system depends on our labor gives us immense structural leverage. As the events of the past week and a half have demonstrated, this holds true for public employees — including categories of workers that are predominantly female, like teachers — no less than it does for the private sector. Fittingly, one of the most popular chants at the capitol over the past week and half was: “If they don’t fix it, shut it down!” Unleashing and sustaining this potential power depends in large part on the independent initiatives of a “militant minority” of rank-and-file worker leaders. It’s unlikely the West Virginia strike would have happened — or succeeded — without the tireless efforts of a small group of deeply rooted, radical teachers. Many of these rank-and-file leaders first coalesced during the 2016 Bernie Sanders campaign. Others, particularly in the southern part of the state, like Mingo County, had already been politicized into a multigenerational tradition of militancy going back to the Mine Wars of the early twentieth century. Rebuilding an analogous layer across the country is essential. Ever since the McCarthy-era expulsion of radicals from the unions in the 1950s, the labor and the socialist movements have both been fatally weakened by this imposed divorce. And leftists in the past few decades have been surprisingly uninterested in trying to root themselves in workplaces and working-class organizations. Hopefully, the inspiring example of West Virginia will encourage a new strategic emphasis on class struggle at the point of production. Promoting the merger of socialism with the labor movement will necessarily require abandoning the ideological baggage and bad political habits accumulated over decades of marginalization. The ethos of the West Virginian strikers was the polar opposite of the sterile sectarianism, political insularity, and callout culture that prevails on so much of the Left. Radicals have much to learn from West Virginia’s model of unity in action. As Charleston high school teacher and union activist Emily Comer summed it up: “For a successful mass movement, people don’t have to agree on partisan politics, on religion, or anything else for that matter. But they do have come together and fight in solidarity around a shared issue.” Focus on the big, burning demands that face working people. The struggle here revolved around material questions — pay and health insurance — that directly impacted the livelihoods of thousands of West Virginians. The growing momentum towards strike action across the country shows that the urgency of these issues isn’t confined to Appalachia.\nChallenges Ahead Tuesday was a euphoric day for strikers across West Virginia. The celebration was well deserved. It was also well timed — many teachers were already teetering on the edge of physical exhaustion. Unfortunately, there won’t be much time to rest. West Virginia’s governing elite suffered a major blow, but they’re far from defeated. Over the coming days and weeks, they will ramp up their efforts to undermine the important gains won on Tuesday. This will above all take the form of a concerted offensive to pit public employees against other layers of the working class by attempting to pay for the deal by cutting essential services, including Medicaid. Whether the funding for the raise will come from the rich — as the strikers have demanded — or from the poor will largely depend on the ability of West Virginian educators and staff to continue mobilizing in the days to come, and whether or not other groups of workers, in both the public and private sectors, take to the streets. Strikers deserve to celebrate their victory and get some rest. But there’s a real danger that Republican leaders will attempt to ram through a regressive bill while people are still recuperating. Funding the pay raise through cuts would be a major political setback. Not only would this would inflict serious harm on those who depend on these services, but it would set the stage for a successful right-wing campaign of divide and conquer. The struggle, in short, is far from over. A similar dynamic will shape the fight to fix PEIA, the state public employee health insurance agency. This is a central demand, which played a pivotal role in uniting public sector employees with the rest of working class over the past months. On this front, the movement has a little more time since the current insurance rates are frozen up through 2019. Yet the task force set up by the governor to find a solution is set to begin meeting on March 13. There is no reason to believe that the state government — which remains beholden to corporate interests — will voluntarily cede to the strikers’ widespread demand to fully fund PEIA by raising the severance tax on natural gas. Without a new upsurge in protest to make out-of-state corporations pay, a serious long-term fix for PEIA will likely remain a mirage. While working-class West Virginians have gotten used to confronting and exposing the trickery of the Republicans, they will now face novel political challenges. In particular, though the forces of liberalism and official reformism are currently weak in West Virginia, this state of affairs will not last long. Due to the institutional debility of organized labor, the union officialdom was neither able to prevent or control this strike. But we should expect national teachers’ union leaders to seek to re-cohere a solid apparatus as they try to seize the huge organizing opportunity opened up by the West Virginia victory. Much of this support should be welcomed. Financial and human resources are needed to rebuild a strong militant union movement. But there’s no such thing as a free lunch. With this support will come increased pressure toward returning West Virginia’s educators and staff to more traditional, less disruptive, forms of organization and action. In addition, the militant minority will feel a strong pull to take union office. In many instances, this will likely make political sense. But without the democratic participation and organization of the rank and file at the school, county, and statewide levels — and without overcoming the debilitating divisions between the three statewide K-12 unions — electing even the best militants will be insufficient to revitalize West Virginia’s trade unions. Relations with the Democratic Party will be even more difficult political terrain to navigate. Eighty years of rule by a corrupt West Virginia Democratic Party beholden to corporations has culminated in the implosion of the party’s political and institutional influence. West Virginia is now a so-called “Red State.” So while past labor battles in the state were typically directed against Democratic politicians, the political villains today are Republicans. Whether out of conviction or electoral opportunism, the Democratic minority in the legislature consistently supported the strikers’ pay demands. Firebrand state senator Richard Ojeda in particular is widely regarded as a hero by West Virginia workers. One of the most common chants throughout the strike was, “We’ll remember in November.” On the one hand, the strikers’ basic political intuition is correct. Protests aren’t enough. To systematically transform West Virginia’s priorities — and the country’s as a whole — requires political power. Given this fact, and the role played by local Democrats during the strike, it’s understandable that most teachers and staff will enthusiastically vote for Democrats in November. The problem, however, is that neither the statewide nor national Democratic Party is a party of, or for, the working class. Democratic politicians have a long tradition of pro-business policies and broken promises. Today’s allies can quickly become tomorrow’s political turncoats. And not only have past attempts to “take back” the Democratic Party failed, but such efforts often played a critical role in demobilizing and defanging unions and social movements in the 1930s and 1960s. More recently, the powerful 2011 Wisconsin Uprising went down to defeat after protesters folded up shop in a misguided campaign to recall Republican governor Scott Walker. Maintaining the political independence of the unions and the broader movement remains a burning question. West Virginia just demonstrated that mass struggle can win major gains no matter who is in power. Even if most workers vote for Democrats in November, the labor movement will be in a better position to defend the interests of working people if it mobilizes independently and resists absorption into the Democratic Party.", "url": "https://www.jacobinmag.com/2018/03/west-virginia-wildcat-strike-militancy-peia"}