{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:14:00", "date_modify": "2020-05-04 20:14:00", "date_publish": "2018-08-23 06:00:00", "description": "Dear Dave: I am sure I am not the only one with this problem. My co-workers start doing their parts in big projects right away as they should, but, they begin to do less work, or even vanish as...", "filename": "_921b466d9e244d508ddcf1bf53c6101e_1588623240.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_921b466d9e244d508ddcf1bf53c6101e_1588623240.html", "title": "Dave Conrad: When co-workers ‘dog out’ on projects", "title_page": "Dave Conrad: When co-workers ‘dog out’ on projects", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dear Dave: I am sure I am not the only one with this problem. My co-workers start doing their parts in big projects right away as they should, but, they begin to do less work, or even vanish as the projects mature. This means that some of my fellow employees and I need to do their work and ensure that things come to a complete close. My manager just ignores this problem, because the projects are completed. Do you have any ideas on how to get all employees doing their fair share and do things from start to finish? — R\nDear R: I feel your pain. I fully understand your frustration with these people. Let me add that these people are often the ones who are the most boisterous in the early stages of planning — they want to give the impression they are helping as much as possible, knowing full well they will decrease their participation as time goes by.\nHowever, there are the quiet types, too, that add nothing of value all the way through the tasks and projects. There are also those that spend all of their time working on some picky little things that adds very little value, when there is a lot of work to be done.\nYou are a “doer,” which means you take care of business early and often, and make sure things come to effective closure. Thankfully, there are people like you, who realize that doing work means completing work. I cannot stand it when people start to break off and go who-knows-where when there is still so much to do, or when there are details that must be addressed.\nI think people well know how much they will dig in and participate during the lifetime of projects — and this may range from nothing to not much for some of these folks.\nConversely, you believe that “taking care of business” means just what it says.\nI blame your manager for allowing this problem to happen and linger. Good managers know that projects — even small tasks — need full effort and full completion. Just allowing the “workhorses” to carry the load is unfair and sets a poor example of what it means to operate as a team.\nA fully functioning team analyzes what work needs to be done, distributes the right work to the right people, and communicates about what is happening along the way. A well-oiled team fulfills their roles and even reaches out to help each other when things are not going as well as it should and others need some extra help. This is the intended purpose of teams, anyway.\nSurface the problems\nMost management writers will tell you that teams must handle their own problems and come up with solutions that should be agreed upon. This does not mean that everyone is going to be totally happy; rather, it means that a plan is constructed and everyone knows what they need to do.\nI think teams must establish ground rules and determine what conduct and work will be expected. This means that everyone knows what their job is, how to do it, and what completion really means.\nIf a project is already under way and people are not performing as expected, my suggestion is to — as a group — determine what exactly is wrong and how these things can be surfaced and solved without finger-pointing and making the weak workers defensive and upset.\nThe plan must be viewed as a thing that must be completed, and personalities must be taken out of the equation. Talk about work elements, needs, and factors — and do not let your emotions spoil the strategy.\nIf you tried to make the team function as planned and the problem workers are still dogging out, it is time to go to your manager with your case. You must remember that managers have their “pet people” and you need to tread lightly, and be careful if you want to single these people out and complain about their lack of work and overall participation. These people know they are close to, and even protected by, your boss.\nIf you come to your manager with only unsubstantiated protests, you will be viewed mostly as a nag or agitator who will grumble about anything. This means you need to have your facts together, so you can present a solid argument.\nAssess the plan and pinpoint exactly what is not being done and when. Present your agreed-upon plan and determine where the ball is dropped and what damage it is causing. Even the poorest of managers know they need to get things done and — if you can document what productivity is suffering by a lack of participation — your manager may sit up and take notice if he or she realizes they may look bad to their superiors. In any case, have a case.\nIf nothing changes and the slackers keep practicing their craft of doing little, you may need to face the fact that things are going to be as they are and that the best workers must carry the load to get things right.\nIf you cannot live with that responsibility, it may be time to find a new team and a new role.", "url": "https://apnews.com/921b466d9e244d508ddcf1bf53c6101e"}