{"authors": ["Dave Gong"], "date_download": "2020-05-04 20:04:30", "date_modify": "2020-05-04 20:04:30", "date_publish": "2018-12-05 05:00:01", "description": "An update Tuesday on the performance of Red River Waste Solutions left some City Council members in the dumps.  Several council members left the table dissatisfied with answers provided by...", "filename": "_eb85ecc47b344e9d87c26058610b8aee_1588622670.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_eb85ecc47b344e9d87c26058610b8aee_1588622670.html", "title": "City group against Red River rebate; council disgruntled", "title_page": "City group against Red River rebate; council disgruntled", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "An update Tuesday on the performance of Red River Waste Solutions left some City Council members in the dumps.\nSeveral council members left the table dissatisfied with answers provided by city Solid Waste Manager Matt Gratz and Adrienne Maurer, a member of Mayor Tom Henry’s working group on garbage and recycling collection.\nThe working group, Maurer said, has recommended against providing ratepayers a refund sought by Councilman Russ Jehl, R-2nd, and others.\nNo one from Red River attended Tuesday’s meeting.\n“Granting a rebate for one month of service or however it was going to be applied, in the opinion of the committee, was not something that was going to improve service,” Maurer said. “We have already assessed a number of fines on Red River to the extent that it’s cutting into quite a bit of their dollars. So far, assessing fines has not worked to make them more efficient. All that does is take more money out of their pocket and cause them to have more problems.”\nAccording to figures provided by the city, Red River has been fined 167,500 for missed recycling pickups. The company was fined 188,800 in September for missed garbage collections alone. Red River’s contract runs through 2025.\nIn an interview after the meeting, Jehl said improving performance isn’t the point of providing a refund. He described the recommendation to not provide a refund as “an insult” to ratepayers “who have been paying for terrible service all year.”\n“On behalf of the ratepayer that is (the city’s) fiduciary responsibility. You have to collect the fine,” Jehl said. “For thousands of ratepayers to spend 20 minutes, 30 minutes on the phone at our encouragement each time, just to get that little bit of justice and then to have that wiped away by arbitrary decision is mystifying to me, and I hope the administration reconsiders its policy.”\nCity spokesman John Perlich said the door isn’t closed completely on the possibility of a ratepayer refund.\n“I don’t think it’s a closed situation where they said absolutely no refund. That’s going to continue to be discussed,” he said. “At this particular point in time, the working group did not feel refunding is the answer at this point.”\nThe working group, Perlich said, is concerned about potentially depleting the solid waste fund, which would be used for future remediation if Red River continues to miss benchmarks outlined in the contract.\n“If you were to give a refund now, ... you run the risk of depleting the fund, which ultimately we might need in the event of any future changes to the contract and that fund helps alleviate any future increases that might happen down the road,” Perlich said.\nThe council approved a non-binding resolution urging city officials to explore a possible refund at its Nov. 20 meeting.\nExplanations for why city officials were collecting only about 20 percent to 25 percent of the total fines assessed against Red River also left some council members upset Tuesday. Gratz said it’s the same formula the city used for Republic Services, the previous garbage contractor.\nAccording to the contract, Red River can miss only one out of every 1,000 households each week. That means the company can miss only 83 homes a week before fines are assessed. Once that threshold is reached, the company can be fined $100 per house missed. There are additional penalties outlined in the contract for repeated and large-scale misses, as well.\n“If we fine them to the full extent, you are going to have issues where you could possibly have garbage not get picked up at all if they can’t meet their expenses, their payroll,” Gratz said. “It could make things worse.”\nPerlich said the working group will continue to evaluate Red River’s performance moving forward.\n“We want to see Red River continue to improve so we don’t have to assess fines,” Perlich said.\n“But if we continue to see areas where we’re not getting the delivery of services that we expect, the fines are going to continue and maybe continue at a significantly higher amount than we see now, but that’s to be determined moving forward.”\nCouncilman Glynn Hines, D-6th, was especially disappointed in Tuesday’s presentation. It’s time, he said, to take another look at the contract.\n“I’d really like to have us look at opening that contract up for rebid, because I think we’re past material breach, and I think that in 2019, the citizens will be voting for council members and mayors and they can let their voice be known if they’re still upset,” Hines said.\ndgong@jg.net", "url": "https://apnews.com/eb85ecc47b344e9d87c26058610b8aee"}