{"authors": ["Candice Williams", "The Detroit News"], "date_download": "2020-05-04 20:07:15", "date_modify": "2020-05-04 20:07:15", "date_publish": "2018-01-01 05:00:58", "description": "Change is brewing for 2018. Michigan residents will choose a new governor, attorney general and secretary of state. Aside from normal contested congressional election battles, there...", "filename": "_5e4830f6d4234ef7adbf2ada49f83903_1588622835.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5e4830f6d4234ef7adbf2ada49f83903_1588622835.html", "title": "Here's what's facing Michigan, Metro Detroit in 2018", "title_page": "Here's what's facing Michigan, Metro Detroit in 2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Change is brewing for 2018.\nMichigan residents will choose a new governor, attorney general and secretary of state.\nAside from normal contested congressional election battles, there will be elections for someone to fill out the remaining seven weeks of former U.S. Rep. John Conyers Jr.’s term following the Nov. 6, 2018 election as well as someone to represent his 13th Congressional District for the next two years starting in January 2019.\nArea business and civic leaders hope their collaborative efforts in 2017 will result in attracting a major sports league and an online retail giant to Detroit.\nHere’s a look at what 2018 has in store for Metro Detroiters and Michiganians.\nGovernor’s race\nIn November, Michigan voters will go to the ballot box to replace Gov. Rick Snyder, who can’t run again due to term limits.\nThe current favorites are former Senate Minority Leader Gretchen Whitmer for the Democrats and Attorney General Bill Schuette for the Republicans. But they both face many challengers in the August primary election.\nOther GOP hopefuls are Lt. Gov. Brian Calley, state Sen. Pat Colbeck of Canton Township, Saginaw obstetrician Jim Hines and Evan Space, a military veteran. Among the Democratic hopefuls are former Detroit health director Abdul El-Sayed, Ann Arbor entrepreneur Shri Thanedar and former Xerox executive Bill Cobbs.\nDemocrats and Republicans will select their lieutenant general, attorney general and secretary of state candidates at party conventions following the primary.\nReplacing Conyers\nThe resignation of civil rights icon John Conyers Jr. has set off a wide open race to replace the 88-year-old lawmaker after nearly 53 years in Congress.\nAmong the candidates are state Sen. Ian Conyers of Detroit, the congressman’s great-nephew, who angered the family by announcing he was running before the congressman announced his resignation. John Conyers Jr. endorsed his oldest son, John Conyers III, who hasn’t decided if he will run. Other announced contenders include state Sen. Coleman Young II.\nConyers resigned Dec. 5 amid sexual harassment allegations by former staffers after becoming the longest-serving African-American in congressional history.\nArena demolition\nJoe Louis Arena is expected to be demolished with the Red Wings playing games now in the new Little Caesars Arena. The city-owned Joe closed in July.\nBy this past Sunday, the building’s last occupant, Olympia Entertainment, management for the Wings, was expected to be completely moved from the building.\nDetroit is required under the bankruptcy agreement to give the land to bond insurer Financial Guaranty Insurance Co. after the arena is torn down. FGIC was a major creditor to the city and lost $1.1 billion when Detroit filed Chapter 9 bankruptcy in 2014.\nThe agreement says the city must demolish the building within 90 days of lease agreements expiring. While no plans have been revealed for the site, the bankruptcy agreement lists options including a hotel with at least 300 rooms, offices, retail locations, recreational uses and condominium units.\nDetroit’s Amazon bid\nDetroit could learn in 2018 if the city is a finalist among the 238 proposals from cities and regions in North America vying for Amazon.com to operate a second headquarters.\nAmazon plans to invest $5 billion and create 50,000 jobs averaging $100,000 a year in pay to the winning city or region.\n“We also anticipate that those that make it to the next list will be asked for another request for proposal, another set of questions,” said Sandy Baruah, president and CEO of the Detroit Regional Chamber. “We also expect those cities will receive a site visit. I fully anticipate that we’ll be on that list.”\nTo sweeten Detroit’s regional bid, the state of Michigan is offering extensive tax breaks for three decades. In addition, there would be $106 million in taxpayer subsidies from Windsor, which is also part of the pitch.\nTransit improvements were also mentioned in the pitch, with a reference to express bus service to begin in 2018. Beginning Monday, Suburban Mobility Authority for Regional Transportation will offer a direct route to Detroit Metropolitan Airport along Michigan Avenue and limited-stop routes along Woodward Avenue and Gratiot Avenue.\nMajor League Soccer bid\nDetroit is hoping to join Nashville, Tennessee, with a Major League Soccer expansion team. In December, MLS officials said they were still considering Detroit, Cincinnati and Sacramento, Calif.\nCleveland Cavaliers owner Dan Gilbert and Pistons owner Tom Gores are among a Detroit contingent that lobbied MLS commissioner Don Garber and the expansion committee in New York.\nThe pitch included that the expansion franchise would play games at Ford Field, which is touted as having characteristics that would make professional soccer successful there. The field hosted international matches in 2008, 2011, 2012 and 2015.\nPublic corruption case\nA number of defendants accused of participating in a high-profile public corruption case will face their day of reckoning.\nThe scandal centers around an FBI investigation into public officials accepting cash in exchange for approving municipal contracts with now defunct trash hauler Rizzo Environmental Services and a towing company. So far, the case has led to criminal charges against 18 people.\nAmong the upcoming sentencings:\nContractor Christopher Sorrentino, who admitted funneling $66,000 in kickbacks to an unnamed Macomb Township politician, will be sentenced Feb. 6 in federal court. He could spend 10-16 months in prison.\nChuck Rizzo of Rizzo Environmental Services pleaded guilty to conspiring to commit bribery and wire fraud. U.S. District Judge Robert Cleland tentatively scheduled a March 13 sentencing.\nRizzo admitted conspiring with others to bribe officials in Clinton Township and Macomb Township. The bribes were designed to influence or reward them in connection with municipal contracts for Rizzo’s trash-hauling company, prosecutors allege.\nRizzo’s father, Charles Rizzo, pleaded guilty to a charge of conspiracy to commit mail fraud. He faces five years’ imprisonment, a $250,000 fine, or both when he is sentenced by U.S. District Judge Robert Cleland on April 19.\nDetroit towing titan Gasper Fiore pleaded guilty to a bribery conspiracy charge that carries a maximum sentence of 5 years imprisonment and a fine of $250,000. A sentencing date has been set for May 1.\nGordie Howe Bridge\nConstruction is expected to begin in 2018 on the $2.1 billion Gordie Howe International Bridge that will connect Detroit and Windsor.\nAs of late 2017, the process of procuring a private-sector partner to design, build, finance, operate and maintain the project was ongoing, officials said.\nCanada is supplying Michigan’s $550 million share of the second bridge between Detroit and Windsor, which will have to be repaid through tolls.\nAt least $350 million of preparatory activities are underway in Canada and the United States. All permits and approvals have been received, and nearly 200 demolitions on the U.S. side have been completed, officials said recently.\nAbout 93 percent of properties have been acquired in the United States. The majority of the other 7 percent are owned by Ambassador Bridge owner Manuel “Matty” Moroun and are subject to litigation, officials said.\nHudson’s site construction\nA ceremonial groundbreaking took place in December for the $1 billion mixed-use development on the former site of the iconic J. L. Hudson Co. department store in Detroit’s downtown. Construction is expected to start in 2018.\nThe Hudson’s site project is among four developments packaged for consideration for $250 million in state financing through the Michigan Thrive legislation. Bedrock officials have said that about 11 percent of the total project cost for the Hudson site would be covered by the initiative.\nA name for the project could also come in 2018. Dan Gilbert, Bedrock’s founder and chairman, has said he’d like to incorporate the Hudson’s name in some way.\nThe 1 million-square-foot project is expected to be complete beyond 2020.\nBedrock and the city of Detroit are expected to make a request in March before the strategic fund for approval of the Transformational Brownfield Plan incentive package.\nU.S. auto sales\nThe year 2017 started with U.S. and foreign automakers engaging in Twitter spats with the president, and ended with promises of a big future for automated vehicles.\nBut there’s more to watch in 2018 among the auto companies than the development of robotic cars. U.S. sales are expected to continue to drop compared to records set in 2015 and 2016, when 17.55 million vehicles were sold. Experts think that will end up being the most vehicles sold in the history of the U.S. market, and that means Ford Motor Co., General Motors Co., Fiat Chrysler Automobiles, Toyota Motor Corp. and others will begin a hard battle for relevance as the market begins to shrink.\nCompanies are expected to roll out new pickup models to combat the Ford F-150, which will spur a turf war of sorts among the U.S. automakers.\nGM, meanwhile, is expected to move toward its lofty EV target. CEO Mary Barra wants 20 new all-electric vehicles on the market by 2023. That could start to materialize next year as the automaker promised the first two entries in the 18 months following its October announcement. That could include one of the two electric crossovers expected by 2020.\nFord CEO Jim Hackett and his lieutenants are expected to use 2018 to prove there’s a coherent vision for the future of the company. It’s expected the Dearborn-based automaker will give specifics on its autonomous vehicle program. The coming year should be packed with new-product announcements.\nCalifornia’s Tesla Inc. is under big pressure. Amid missed deadlines and failures to get its mass-market Model 3 sedan off the assembly line, CEO Elon Musk has only promised more: more vehicles, more models and more innovation. If the company fails to meet the goal of producing 5,000 Model 3s per week by March 2018, the comparatively new company could finally be subject to the scrutiny some legacy automakers have dealt with for years.\nStaff Writers Nora Naughton and Ian Thibodeau contributed.", "url": "https://apnews.com/5e4830f6d4234ef7adbf2ada49f83903"}