{"authors": ["Jeff Gravley", "Wral Sports Anchor Reporter"], "date_download": "2020-05-04 20:09:06", "date_modify": "2020-05-04 20:09:06", "date_publish": "2018-03-29 15:32:00", "description": "North Carolina Central's LeVelle Moton is staying put. The Eagles head coach interviewed Wednesday for the open position at East Carolina University, but he said Thursday he'll remain in...", "filename": "_c064302e917917b22c52899100fc17d1_1588622946.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c064302e917917b22c52899100fc17d1_1588622946.html", "title": "'I can't mess with happiness:' Moton staying at NC Central", "title_page": "'I can't mess with happiness:' Moton staying at NC Central", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "North Carolina Central’s LeVelle Moton is staying put.\nThe Eagles head coach interviewed Wednesday for the open position at East Carolina University, but he said Thursday he’ll remain in Durham for his 10th season leading NCCU.\n“I’m happy where I am,” Moton told WRAL News. “I can’t mess with happiness.”\nMoton met with ECU special advisor Dave Hart Wednesday about the ECU job.\n“ECU is a prestigious university within the state that I have revered since I was a kid,” Moton said. “I’m humbled and honored that they thought enough of me to consider me for the head coaching vacancy. However, after further discussion with my family, we have decided it’s best that I remain at NC Central.”\nHart, the former ECU director of athletics, is serving in an advisory role as the university searches for a new director of athletics to replace the outgoing Jeff Compher.\nMoton posted a photo on his Instagram Thursday with a Muhammad Ali quote.\nMoton was among several candidates for the ECU job, including former Pirates head coach Joe Dooley and former North Carolina State assistant and UNC-Charlotte head coach Bobby Lutz.\nDooley served as ECU head coach from 1995-99 and compiled a 57–52 overall record.\nMoton, 43, has compiled a 171-119 record in nine seasons leading the Eagles.\nHis teams have qualified for the NCAA Tournament three times, including a surprise run to the tourney this season after winning the MEAC Tournament title. NC Central lost its First Four matchup with Texas Southern.", "url": "https://apnews.com/c064302e917917b22c52899100fc17d1"}