{"authors": ["Rick Sobey", "Rsobey Lowellsun.Com"], "date_download": "2020-05-04 20:15:58", "date_modify": "2020-05-04 20:15:58", "date_publish": "2018-04-07 10:35:56", "description": "LOWELL -- Like father, like son. Except this son did much, much better than his father. UMass Lowell senior Mansour Chaya won more than $50,000 on the Thursday night episode of \"Wheel...", "filename": "_c39ba618f25a400cbd25c11bf15d4690_1588623358.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c39ba618f25a400cbd25c11bf15d4690_1588623358.html", "title": "'Wheel' Good Day for UML Senior, Winning $50G on 'Fortune'", "title_page": "'Wheel' Good Day for UML Senior, Winning $50G on 'Fortune'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- Like father, like son.\nExcept this son did much, much better than his father.\nUMass Lowell senior Mansour Chaya won more than $50,000 on the Thursday night episode of “Wheel of Fortune,” which was taped in late February in Los Angeles.\nThe 21-year-old from Methuen won more than $44,000 in cash and a trip for two to Hawaii. He also has bragging rights over his father, George, who was not as successful when he competed on the show nine years ago.\n“Just a surreal experience,” Chaya said Friday afternoon, a day after watching the show on TV with his family. He has been watching the show with his family for as long as he can remember.\nChaya, wearing a UMass Lowell shirt, appeared on the show’s “College Week Spring Break.” He won $17,000 during the first part of the show, advancing to the final bonus round.\nThe category was “Event.” After letters were displayed for the two five-letter words, he knew the first word ended in “ie,” and that the second word was “night.”\nImmediately, a lightbulb went off. He said, “Movie night.”\nHost Pat Sajak opened the envelope, revealing that he won $35,000 in the bonus round. Chaya said he was hoping it would say $100,000, but he was still “psyched” to get $35,000.\n“That’s still a huge chunk of money,” he said. The winnings will help him pay for law school, Chaya added. His family helps him pay for UMass Lowell.\nAfter the $35,000 reveal, he celebrated with his father who came on stage. They hugged and put their hands in the air in celebration.\nHis father was on “Wheel of Fortune” when they shot some shows in Boston nine years ago.\nSajak asked Chaya how his father did back then.\n“He won the first toss up,” Chaya responded, drawing laughter from the audience. His father won $1,000 on the show.\nWhen the show came to Boston two years ago for auditions, Chaya submitted an application. He got an email about seven months later, saying he made the final call back.\nWeeks later, he learned he made the show.\n“With my Dad on the show before, I have a feeling that helped,” Chaya said.\nChaya is in the UMass Lowell Honors College, and is on UMass Lowell’s Mock Trial team. His top choice for law school is Suffolk University, followed by Boston University and New England Law.\nFollow Rick Sobey on Twitter @rsobeyLSun.", "url": "https://apnews.com/c39ba618f25a400cbd25c11bf15d4690"}