{"authors": ["Ben Goessling"], "date_download": "2020-05-04 20:31:36", "date_modify": "2020-05-04 20:31:36", "date_publish": "2018-11-25 20:58:17", "description": "The construction of the Vikings roster does not require them to win games by leaning on Kirk Cousins the way the Packers often have to do with Aaron Rodgers. They gave Cousins a three-year, $84...", "filename": "_1fcd7576b79b40bca6d726f47cdcee32_1588624296.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1fcd7576b79b40bca6d726f47cdcee32_1588624296.html", "title": "Kirk Cousins rebounds for stellar performance in win over Packers", "title_page": "Kirk Cousins rebounds for stellar performance in win over Packers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The construction of the Vikings roster does not require them to win games by leaning on Kirk Cousins the way the Packers often have to do with Aaron Rodgers. They gave Cousins a three-year, $84 million deal with the belief he could augment a team that went 13-3 a year ago, rather than having to make up for its deficiencies.\nStill, the price the Vikings paid Cousins -- after saying goodbye to two quarterbacks who had won division titles for them -- comes with the expectation that the 30-year-old will have nights where he can be the difference in an otherwise close game. And after what might have been his worst performance of the season last Sunday night in Chicago, Cousins responded with one of his best when the Vikings needed him most.\nHe completed 29 of his 38 passes for 342 yards and three touchdowns in the Vikings 24-17 win over the Packers, rebounding from a two-interception performance against the Bears by helping the Vikings to a win that keeps their division title hopes alive.\nHe did a great job of managing what we needed to get done, said Vikings coach Mike Zimmer. I thought [offensive coordinator John DeFillipo] did a great job of putting [Cousins] in the right situations all night... I was really proud of him and thought he played exceptionally.\nOverall it was a very good team win, and we needed it.\nThe Vikings improved to 6-4-1 and lead the NFC wild card playoff chase. The Packers fell to 4-6-1.\nThe game was tied at 14 at halftime, but the Vikings scored 10 unanswered points in the third quarter to take control.\nThe Packers went for it on fourth-and-1 at their own 44 midway through the third and were stuffed, giving the Vikings the ball in Green Bay territory. The Vikings drive stalled when Cousins was sacked by Kenny Clark on third down, and Dan Bailey kicked a 37-yard field goal to give the Vikings their first lead at 17-14.\nA Sheldon Richardson sack of Rodgers and a 20-yard punt return by Marcus Sherels set up the next Vikings score. Cousins rolled right and hit Adam Thielen for a 14-yard touchdown and a 24-14 edge.\nCousins threw a pair of touchdown passes as the turnover-free first half ended 14-14, although Bailey missed two field-goal attempts late in the second quarter. Vikings coach Mike Zimmer later told NBC sideline reporter Michele Tafoya that hed go for it on fourth down in the second half rather than depend on Bailey with the game on the line.\nThe teams tied earlier this season 29-29 at Lambeau Field as Vikings kicker Daniel Carlson missed two field goal tries in overtime, was then cut and Bailey was signed.\nAfter two three-and-outs by the Vikings, the Packers took a 7-0 lead on their second possession, a drive aided greatly by a 26-yard pass interference penalty on Vikings cornerback Xavier Rhodes, who held the right arm of Davonte Adams as Adams flew down the left side. Adams victimized Rhodes again five plays later, catching a 15-yard scoring toss from Rodgers.\nThe Vikings responded by going 75 yards in five plays to tie the game. Cousins hit Stefon Diggs with a 24-yard pass to get the Vikings to the Packers 26 and, on the next play, Cousins found Dalvin Cook swinging out of the backfield for a touchdown pass.\nGreen Bay responded with a 75-yard drive of its own, capped by Aaron Jones 6-yard sweep of left end for a touchdown.\nThe Vikings converted two third downs on their second scoring drive. Cousins found Diggs open down the left sideline for a 30-yard touchdown to tie the game at 14. The third-down conversions came on passes to Kyle Rudolph and Diggs.\nBailey missed a 48-yard attempt wide left late in the half, then had a 56-yarder sail wide right as the half ended. Baileys final attempt was set up as a 51-yarder, but a motion penalty on Vikings tackle Rashod Hill moved the ball back 5 yards. A replay appeared to show that Bailey was run into on the second kick, but no penalty was called.\nCousins had a strong first half, completing 22 of 26 passes for 254 yards. One of his passes was a clear drop by inconsistent former first round pick Laquon Treadwell.\nThe Vikings play at New England on Sunday; the Patriots, defending AFC champions, are 8-3.", "url": "https://apnews.com/1fcd7576b79b40bca6d726f47cdcee32"}