{"authors": ["Mike Morrisonfor The Herald-Dispatch"], "date_download": "2020-05-04 20:23:59", "date_modify": "2020-05-04 20:23:59", "date_publish": "2018-05-16 07:40:44", "description": "PARKERSBURG — For the second straight day, Hurricane sophomore pitcher Harlie Vannatter was nothing short of brilliant in the circle as the Redskins traveled to take on the Parkersburg Big Reds in...", "filename": "_d7d5e033d44d4457b614d6a1b534c368_1588623839.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d7d5e033d44d4457b614d6a1b534c368_1588623839.html", "title": "Hurricane takes regional championship", "title_page": "Hurricane takes regional championship", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PARKERSBURG — For the second straight day, Hurricane sophomore pitcher Harlie Vannatter was nothing short of brilliant in the circle as the Redskins traveled to take on the Parkersburg Big Reds in the second game of the Class AAA, Region IV high school softball finals.\nAfter tossing a perfect game Monday night, Vannatter struck out 10 PHS hitters Tuesday evening and allowed just one base hit as Hurricane blanked Parkersburg 12-0 in five innings to claim its fourth consecutive Regional IV crown.\nHurricane pounded 15 hits, including home runs by Lindsey Phares, Jayme Bailey and Taylor McRae in the fourth inning.\nRedskins coach Meghan Stevens was impressed with the way her pitcher\npicked right up where she left off the day before.\n“She really brought it today and she has such good stuff. She has really shown it the past couple of days,” Stevens said of Vannatter, who struck out 23 of the 31 batters she faced in the series. “I was really pleased with how we came out the past couple of days and came out focused. We really, really wanted to get back to the state tournament and you could tell by their energy.”\nHurricane scored a run in the opening inning off of Parkersburg starting pitcher Kenzie Riddle when Kiersten Landers singled, stole second and came in to score on a Bailey base hit.\nThe Redskins batted around to score four times in the third inning and opened a 5-0 lead.\nCaiti Mathis, McRae, Zoey Dunlap and Phares collected consecutive RBI hits to account for the four runs.\nThe winds picked up and the skies became a bit dark in the fourth inning just in time for Hurricane to string together its long-ball barrage. Bailey homered on a line drive in center field to begin the inning before McRae followed suit with one out. Phares capped the power display with a towering shot to left field.\n“We are a very aggressive-hitting team and sometimes we want to do too much,” Stevens said. “Sometimes we get out on our front foot and have a tendency to pop up but once we get our timing down and get things going it’s contagious.”\nEvery hitter in the Hurricane lineup collected at least one hit, with Bailey and Phares smacking three each.\nWhile Hurricane advances to the state championship tournament once again, Parkersburg’s season comes to a close with a 12-15 record.\n“Overall we are pleased with our season. We play in a tough conference and also play a very tough schedule,” said Parkersburg head coach Jason Roberts. “I’m proud of their effort. It’s obviously disappointing for it to end like this but it has to end sometime.”\nMaggie Sauers double in the second inning was the only hit of the game for PHS.", "url": "https://apnews.com/d7d5e033d44d4457b614d6a1b534c368"}