{"authors": ["Eric Blanc", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Nema Brewer", "Joe Burns", "Vivek Chibber"], "date_download": "2020-05-04 19:59:59", "date_modify": "2020-05-04 19:59:59", "date_publish": "2018-05-25 00:00:00", "description": null, "filename": "2018_05_west-virginia-teachers-strikes-militant-minority-healthcare_1588622399.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/05/25121350/GettyImages-926417100.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_05_west-virginia-teachers-strikes-militant-minority-healthcare_1588622399.html", "title": "Betting on the Working Class", "title_page": "Betting on the Working Class", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Many of the big, strategic lessons from the teachers’ strikes aren’t widely or universally accepted on the Left, or even among socialists. One is that the working class is still the most powerful social agent for progressive, radical change. It’s sometimes hard even for Marxists to believe this because many of us haven’t seen it demonstrated in our lifetimes. But now we’re seeing it in practice, and it should give us a lot of confidence about our strategy and our political priorities.\nWorkplace action and strikes remain our most powerful weapon — there’s no equivalent form of action that creates as deep a crisis for capital and the state. This used to be a commonplace notion on the Left until the 1960s in the United States, and longer elsewhere, but it’s a fact that is either not accepted today or marginally accepted. The general idea today is that there are many different social struggles and it doesn’t really matter where you choose to focus. This leads many activists to just respond to what happens.\nSocialists should have a different perspective on where power lies and where our strategy should be focused. One particular place of focus is building a “militant minority” of radicals in workplaces and in the class struggle.\nIn the example of West Virginia, you can see the really outsized role that a small group of radicals rooted in workplaces and unions can play at times of social crisis. Oftentimes these recent strikes have been portrayed as spontaneous reactions to terrible conditions, as if people just rose up and joined the right Facebook group all at the same time. This really obscures the level of conscious political organization that went into West Virginia’s victory.\nThe beginnings of the West Virginia strike go back to last November when changes were proposed to double or triple teachers’ health insurance premiums. Health care was not a secondary issue in the West Virginia strike; it was the single biggest issue. When the changes were proposed a study group got together to figure out how to organize a strike. They studied the Chicago teachers’ strike in 2012 and they read Jane McAlevey’s No Shortcuts. Eventually, one of the organizers said, “If we lead, the union will follow.”\nSo they started a Facebook group. But the Facebook group wasn’t just for discussion; they organized a series of build-up actions, asking people to wear specific colors on specific days. They eventually had demonstrations and walk-ins. These radicals were able to link their efforts to another group of militants based out of the southern counties of the state, which had a tradition of labor militancy going back to coal miner battles. Together, they held strike votes in every work site, something that Arizona replicated. That set a huge precedent because education workers got a sense that the strike was up to them to start and up to them to end.\nYou might remember that about a week into the strike, the union leadership made a deal with the governor and it seemed like things were over. But the strike went wildcat in part because there was this precedent of school site votes. The rank and file kept the strike going from below, insisting that they wouldn’t return to work until their key demands were signed into law. It turned out that this prolongation of the strike was a critical development because, at first, the Republican Senate didn’t accept the governor’s deal. So if educators had ended the strike when the union leadership wanted them to, they may not have won anything.\nAnd what the educators eventually won after continuing their strike was huge. They not only defeated changes to their health care costs, but they also defeated a push to add charter schools and take away further union rights. They also nixed a plan that would have made teachers wear something like a Fitbit that would have raised their premiums if they didn’t meet certain health metrics — pretty draconian stuff. And then, of course, they won a 5 percent pay raise for all teachers, staff, and public employees.\nSo it was really a historic victory. We haven’t seen things like that in a long time. It didn’t come through lobbying the Democrats. And it didn’t come through innovative new ideas about how to revitalize labor. It came through a really traditional type of organizing that has been abandoned for a long time: namely, the strike. The right to strike for public employees has actually never existed in West Virginia, even though the state was dominated by Democrats for eighty years.\nThere’s a generalizable lesson in this experience — and it isn’t just a lesson for Republican-controlled states. The West Virginian organizers were few in number, but they had good class-struggle politics and a solid perspective on organizing their workplaces. So when the conditions arose to initiate a successful strike, they seized them. And that’s generalizable.\nThe fight in West Virginia for their health care continues. Educators didn’t just want to get rid of the proposed premium hikes, but they also were fighting to secure a new funding source for the PEIA, the state health insurance program. A task force was set up after the strike and the recommendations of that task force are going to be fought over. West Virginia’s radical organizers are clear that mass struggle will be needed again to make sure that the fix to the PEIA comes from taxing the corporations and the rich to come up with funds to pay for health care — not from privatization or by making cuts to other social services.\nIn Oklahoma, things turned out a bit different, though the conditions were similar. The strike and protests in Oklahoma were just as big, and anger at the cuts and conditions were just as wide. Yet in Oklahoma, they didn’t win all their demands and they came out of the strike much organizationally weaker. They did win a $6,000 pay raise, which is a pretty big victory in a state that hadn’t given pay increases for over a decade. But they didn’t win their funding demands and, most importantly, they definitely didn’t get as far as West Virginia in terms of rebuilding a fighting and organized labor movement.\nSo, why did the strike play out differently? Some people attribute it to West Virginia’s comparatively stronger labor tradition. There’s an aspect of truth to this, but the argument is generally very overstated. There was a labor tradition in West Virginia, but it was only in the process of organizing for the strike that this tradition got revived — so I don’t think you can point to that as the main differentiating factor.\nIn my view, the big differentiating factor was that you didn’t have conscious radicals helping lead the strike in Oklahoma. There was a rank-and-file network, but it was inexperienced and it never really progressed past using Facebook. It was led by relatively apolitical and inexperienced rank-and-filers who didn’t have a strategy or a conception of how to build for a strike. Crucially, they didn’t have the strike votes to build to their walkout.\nSo, organizationally, things were weak in Oklahoma. And after two weeks, the Republicans waited out the strike, and the union leadership caved. And because Oklahoma didn’t have real rank-and-file organization, you saw a big drop in momentum; they didn’t have the organizational capacity to push for a wildcat. So, again, it shows you need organization.\nThe Democratic Socialists of America had a lot of great people involved in the Oklahoma strike, but unlike in West Virginia, none of them were teachers who’d met via DSA and had developed a sense of labor militancy in this milieu. None of them were in the school system. So they supported from the outside and were able to do some solidarity actions, but they weren’t able to play the role that comrades played in West Virginia. It can have a huge impact on a strike to have two or three influential socialists organizing collectively.\nThe big lesson here is that if we have confidence in the working class (and we should, as you can see by recent events), then this has major implications for the type of work we focus on. It doesn’t mean that we drop everything else we’re doing and only get jobs in certain workplaces, but it’s not much of a mystery to know where the workplace actions are happening: it’s basically education and health care. We should be bringing socialist strategy to bear on these areas, plus logistics. Winning something like Medicare for All will take mass action, strikes, and workplace organization.\nIf we look at the 1930s as an example, it wasn’t like people just elected FDR and then got a bunch of social programs. Along the same lines, I don’t think electing Bernie will be enough. There needs to be a mass movement from below to force the capitalists to concede and to create such a crisis that they’re more scared of what would happen if they don’t concede something as huge as Medicare for All.\nThis gets to the question of training a whole new generation of socialists to get involved in the labor movement, to be involved in their workplaces. The teachers’ strikes are continuing and spreading to Colorado, to North Carolina. There’s no signs yet of the wave receding, and the role we have to play is huge. It’s a very exciting time to be a socialist, certainly the best in my lifetime. If we step back and look at the big picture, we can get a better sense of just how historic these strikes are. Reflecting on these recent events should give us increased confidence in the ability of the working class to not only win Medicare For All, but to radically transform society as a whole.\nThis is a lightly edited version of a talk delivered to the Phoenix chapter of the Democratic Socialists of America during the Arizona teachers’ strike.", "url": "https://www.jacobinmag.com/2018/05/west-virginia-teachers-strikes-militant-minority-healthcare"}