{"authors": ["Cindy George"], "date_download": "2020-05-04 20:22:42", "date_modify": "2020-05-04 20:22:42", "date_publish": "2018-03-09 06:00:00", "description": "Some Jack Yates High School students were more focused on cafeteria dance-offs with police officers than the hip-hop royalty in their midst on Friday in the final moments of school before spring...", "filename": "_9ef612b40f274edfb9d25c5ea3584e00_1588623762.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9ef612b40f274edfb9d25c5ea3584e00_1588623762.html", "title": "YATES MUSIC", "title_page": "YATES MUSIC", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Some Jack Yates High School students were more focused on cafeteria dance-offs with police officers than the hip-hop royalty in their midst on Friday in the final moments of school before spring break.\nBut Brad Jordan didn’t mind. He’ll catch the serious ones, the musical talents and the business minds this fall when he returns to campus as a guest lecturer.\nUnassuming in a pullover sweater, jeans and glasses, Jordan is a southern hip hop pioneer, rapper and record producer best known as Scarface of the Geto Boys. He visited the school Friday to talk to students about a music entrepreneurship program coming to Yates next academic year.\n“I was still in high school when my career started,” Jordan said, lamenting that he had to learn the business through “trial and error” during his early days as a member of the Houston rap group.\nJordan grew up on the city’s south side in a community much like the where the students he will be teaching live now. His three decades in the music business spans from eight-track tapes in the late 1980s to digital streaming today. He intends to teach the rudiments of music production and, of course, how to make money.\n“We’ll learn how to produce, we’ll learn how to write, we’ll learn how to engineer, we will learn how to make videos,” Jordan said. “We will learn how to put our music on a platform for sale and you will be paid for the music if you sell any records.”\nConsidered one of the top lyricists of all time, Jordan wrote and produced the Geto Boys’ biggest single “Mind Playing Tricks On Me.” He has collaborated with hip-hop giants including Jay-Z, Kanye West, DJ Khaled and Nas.\nIn a 2013 interview with Complex, Jordan said he never saw or received “checks in the millions” until he became president of Def Jam South two decades ago.\nThe spring break send-off was part of an ongoing intervention program from the One Houston, One Hood initiative, which seeks to redirect students from today’s tribulations to tomorrow’s promise.\nThe program, which made a stop this year at the Houston Independent School District’s Worthing High School, sprang from brainstorming sessions between One Houston, One Hood leader Gerry Monroe, Houston Police Department officials and Houston City Council member Dwight Boykins, who represents the area.\n“It looks like every time they take a holiday break, we end up losing kids. A lot of these kids that we’re losing come from schools on that Scott Street corridor — that’s why we targeted Yates and Worthing first,” said Monroe, an education activist and Yates alumnus.\nHe said Friday’s event was a platform to protect students and prepare them for opportunities that await them this academic year and next.\n“We might have a multimillion-dollar business run out of a schoolhouse,” said Monroe, who cut a music video and performed the rap lyrics for his school board campaign last year.\nOfficers who shared cake and punch with students represented the Houston Police Department, HISD Police Department and the Harris County Precinct 7 Constable’s Office.\nHPD Assistant Executive Chief Troy Finner, who oversees the department’s field operations, said the event creates opportunities to interact with young people in a positive environment, which aligns with the community policing goals of HPD Chief Art Acevedo.\n“Most are doing well, but there’s a group we have to extend ourselves to,” he said by phone. “Acevedo wants us to make every contact count and it’s great when we can do that at school.”\nThe music entrepreneurship program also offers a bridge to college as well as a new school-to-work option amid HISD’s financial and accountability turmoil.\nYates Principal Kenneth Davis said a music studio is part of the new building under construction. Houston Community College is helping the school develop a curriculum in which students will earn college credits.\n“People get confused. They think the money is made at the microphone. Ninety percent of the product is not behind the microphone — it’s behind the scenes,” Davis said. “The new studio that we’re developing is actually a music studio with sound boards and mixing, to industry standards, and they’ll be able to create music and put videos and programs together — and rap and sing.”\nStudents who will attend Yates next year expressed excitement about the new music entrepreneurship program.\n“I like the idea that I can come into the class and mess around with some beats … and turn it into something,” said junior Zachary Steward, 17, a band drum major.\nYates alumnus Christopher Knight, now the band director, said the program gives students a multi-faceted way of looking at music.\n“For me growing up, we were just players but we did not look at the business side,” he said. “If I had the same opportunity … I would probably be much farther in my music career.”\ncindy.george@chron.com\ntwitter.com/cindylgeorge", "url": "https://apnews.com/9ef612b40f274edfb9d25c5ea3584e00"}