{"authors": ["Staff Report"], "date_download": "2020-05-04 20:23:24", "date_modify": "2020-05-04 20:23:24", "date_publish": "2018-11-29 00:00:00", "description": "Chamber Singers Concert The Marywood University Chamber Singers’ Christmas concert will take place Sunday, Dec. 2, at 2 p.m. in Marian Chapel at Marywood, 2300 Adams Ave., Scranton. Composer Frank...", "filename": "_2d367128e91c46f1b3ef3d3d431b5d8a_1588623804.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2d367128e91c46f1b3ef3d3d431b5d8a_1588623804.html", "title": "Best Bets: Five Things To Do During The Week", "title_page": "Best Bets: Five Things To Do During The Week", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Chamber Singers Concert The Marywood University Chamber Singers’ Christmas concert will take place Sunday, Dec. 2, at 2 p.m. in Marian Chapel at Marywood, 2300 Adams Ave., Scranton. Composer Frank Martin’s “Mass for Double Choir a Cappella” will be the featured piece of the afternoon. The group also will perform works by late composers such as Steven Stucky, Stephen Paulus, David Willcocks, John McCabe and Conrad Susa. Admission to the concert is free. For more information, call 570-348-6268. ‘Andy Cooney’s Irish Christmas’ Get into the holiday spirit with “Andy Cooney’s Irish Christmas” on Sunday, Dec. 2, at the Theater at North, 1539 N. Main Ave., Scranton. Andy Cooney, dubbed “Irish America’s Favorite Son” by the New York Times, aims to celebrate the holidays in the Irish tradition. He is a member of the New York Tenors and has been a part of seven sold-out performances at Carnegie Hall. Cooney also recorded 19 albums and is also known for his “Cruise of Irish Stars,” a Carribbean cruise that draws more than 1,000 guests to enjoy Irish entertainment. Doors to the event will open at 2:30 p.m., and the show will start at 3. Tickets cost $30 to $40 and can be purchased at ticketfly.com. Fifth Annual Snow Forge Old Forge will celebrate its fifth annual Snow Forge on Sunday, Dec. 2, from 2 to 6 p.m. Snow Forge is a free event organized completely by volunteers. It will take place in the 300 and 400 blocks of South Main Street in Old Forge. Activities will include a trolley ride with Mrs. Claus, the lighting of Old Forge’s Christmas tree, Santa’s Village Craft Fair, pictures with Santa and horse-drawn wagon rides. Rudolph and his reindeer, a third horse-drawn carriage, also will make an appearance this year. Main Street will be closed to traffic during the event to ensure that guests can safely enjoy all of the activities. For more information, send a message to the event’s Facebook page or email SnowForgePA@gmail.com. Golden Days of Radio Players Performance Return to radio’s past with a performance of live sound effects and music Tuesday, Dec. 4, at 7 p.m. The Golden Days of Radio Players show will take place at the Dietrich Theater, 60 E. Tioga St., Tunkhannock, and is presented by the Dietrich Theater Radio Players. Admission is free and all are welcome to attend. The performance will also be followed by a light reception. For questions or to reserve a seat, call 570-996-1500. Santa Train The Lackawanna River Heritage Trail and Steamtown National Historic Site are hosting a multi-location event, “Christmas in a Small Town.” Watch Santa Claus ride his steam-powered train as he visits fans along a six-station stop on Saturday, Dec. 1. Santa’s train is scheduled to make stops in Carbondale at 10:30 a.m., Archbald at 11:35 a.m., Jessup at 12:20 p.m., Olyphant at 1 p.m., Dickson City at 1:45 p.m. and Steamtown’s turntable in Scranton at 3 p.m. Each town that Santa stops in will have its own celebration. This once-a-year event is free for all ages.", "url": "https://apnews.com/2d367128e91c46f1b3ef3d3d431b5d8a"}