{"authors": ["Ken Borsuk"], "date_download": "2020-05-04 20:11:11", "date_modify": "2020-05-04 20:11:11", "date_publish": "2018-09-15 13:40:55", "description": "Glenville On a somber day across the nation, the community gathered with the Glenville Volunteer Fire Company to pay tribute to the victims of the Sept. 11 terror attacks. Hundreds of...", "filename": "_8f605f3d2d6245f888c74fb724886e12_1588623071.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8f605f3d2d6245f888c74fb724886e12_1588623071.html", "title": "What’s going on in your part of Greenwich?", "title_page": "What’s going on in your part of Greenwich?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Glenville\nOn a somber day across the nation, the community gathered with the Glenville Volunteer Fire Company to pay tribute to the victims of the Sept. 11 terror attacks.\nHundreds of people were on hand Tuesday evening for the annual ceremony, which was held at the fire house. There, a piece of steel salvaged from the wreckage of the World Trade Center serves as a memorial to the victims and to the bravery and heroism of the first responders who rushed to the scene, many at the cost of their own lives.\nThe memorial ceremony in Glenville, which has been taking place since 2011, is significant both to the community and the members of the fire company.\n“It means everything to me,” said Sandy Kornberg, president of the Glenville Volunteer Fire Company. “On the morning of Sept. 11, we were activated to be part of the response. We were stationed in Valhalla (New York) with our Ladder Four truck in case we were needed. We were there from 10:30 a.m. to 9 p.m. on standby. So this is a day that is very meaningful to us.”\nNearly 250 people attended the brief ceremony — Kornberg called it a “great turnout” — which was held outdoors as the rain held off. First Selectman Peter Tesei and Selectman John Toner were there, along with state Sen. L. Scott Frantz, R-36, and state Reps. Livvy Floren, R-149, Michael Bocchino, R-150, and Fred Camillo R-151.\nThe Greenwich Police Department’s Honor Guard took part as did the Glenville Explorers Post 4, which is made up of high school students who have been in training with the Glenville Volunteer Fire Company.\nAt the end of the ceremony, Kornberg and fire company Chief Michael Hoha placed a memorial wreath at the base of the piece of steel.\nTo Kornberg, the strong community support of the ceremony is a hallmark of Glenville.\n“Whether it’s a day like this or a holiday like Memorial Day or St. Patrick’s Day or July 4, this is a very tightly knit community,” he said. “It’s a real slice of Americana. The people there turn out and support you. It’s a very special thing, especially when they are supporting our fire company.”\nAnother ceremony was held earlier Tuesday evening at Cos Cob Park, which is home to a memorial made of two glass towers constructed to represent the World Trade Center. The American flag is carved into the glass, with the names of the 33 victims from Greenwich or with a close connection to the community etched into the bars of the flags.\nCos Cob\nThe traditional gardening season for 2018 may be nearing an end, but it’s not too soon to start planning for 2019. And don’t forget the importance of pollinators in your garden as you dream of next spring.\nPollinators — such as bees, hummingbirds and some types of butterflies and insects — move pollen from one part of a flower to another, prompting plants to make fruits or seeds. The action of moving the pollen fertilizes the plant; without pollinators, plants can’t reproduce.\nYou can learn how to attract pollinators to your garden at the Greenwich Botanical Center, which will host a free educational workshop called Pollinator Friendly Gardening 101 from 6:30 to 8:30 p.m. Sept. 20.\nThe program will teach residents how to turn their gardens into pollinator-friendly habitats and to avoid the use of harmful chemicals. The program will address the benefits of attracting certain insects to your garden and how it is less work than you might expect.\nAleksandra Moch, environmental analyst for the town, said the workshop is part of the Pollinator Pathway initiative, a new program in town. It was started by the town’s Conservation Commission, with the support Greenwich Audubon, the botanical center, Greenwich Land Trust, volunteers and property owners. Inspired by a program in Wilton, the pathway is connecting open spaces and creating appropriate habitats to reverse the declining numbers of pollinators.\n“We want to boost this up and restore the habitats so they can do better,” Moch said.\nThe first stretch of the pathway is on North Street between North Street School and Greenwich Catholic School, property that includes the Sam Bridge Nursery and a cemetery. Moch is excited about the community education and outreach offered as part of the pathway initiative.\n“This is the perfect place for people to start,” she said of the workshop. “It’s going to talk about what pollinators are and what kind of elements in a habitat they like and what plants they like. … This is something we can’t do by ourselves. We need people to join in and work together with us on this.”\nThe town is also working in partnership with Wilton, Weston, Norwalk and Pound Ridge, N.Y., as part of the Pollinator Pathway initiative.\nThe program will include presentations from the Greenwich Botanical Center, Greenwich Audubon, Greenwich Land Trust and Troy’s Nursery. The workshop promises to offer practical steps any gardener can take.\nThe center is located at 130 Bible St. in Cos Cob. Formerly known as the Garden Education Center, it is celebrating its recent rebranding as the Greenwich Botanical Center.\nBackcountry\nA fall tradition like no other, the annual Go Wild celebration is set to return on Sunday, Sept. 23.\nThe 19th annual event, which is put together by the Greenwich Land Trust, will run from 3 to 6 p.m. on the Greenwich Polo Fields at Conyers Farm with rides, food, drinks, family-friendly activities and hot air balloons — which are such a hallmark of Go Wild — spread across the 62-acre backcountry preserve.\nSpecial features everything from a rock climbing wall and bungee trampolines to pony rides, crafts, the Connecticut Beardsley Zoomobile and a fire truck. Live music is also on the bill, with BackCountry Jazz, Songs for Seeds and Rusty Gear, which plays rock and blues, all set to perform.\nFood trucks will be on the scene, offering treats from Caffè Bon, Cowabunga, New Haven Pizza Truck, Spuds Your Way, and Taco Pacifco.\nThe ticket price includes all rides and activities as well as food, beverages and entertainment.\nA new addition this year is the Patron Tent, which is sponsored by Sotheby’s International Realty and staged by Grey Stone Designs. Patrons can enjoy the lounge and bar and also gain early access to Go Wild at 2 p.m.\nGeneral admission tickets cost $65 in advance and $75 at the gate. It’s $30 for children 18 and younger, and free to those under the age of 3. Prices for the patron tickets — good for a group of up to six people of any age — start at $1,000.\nTickets can be purchased at https://gltrust.org/events/gowild/. The proceeds benefit the Greenwich Land Trust’s ongoing work, including education and the preservation and maintenance of open space.\nThe nonprofit organization oversees more than 750 acres of open space in Greenwich, including woodlands, marshlands, orchids and meadows.\nkborsuk@greenwichtime.com", "url": "https://apnews.com/8f605f3d2d6245f888c74fb724886e12"}