{"authors": ["Justin Johnson", "Standard-Examiner Staff"], "date_download": "2020-05-04 20:07:20", "date_modify": "2020-05-04 20:07:20", "date_publish": "2018-01-13 05:49:23", "description": "BOYS BASKETBALL FREMONT 69, CLEARFIELD 40 CLEARFIELD — Fremont led Clearfield 37-17 at halftime and coasted to the road Region 1 win.", "filename": "_230f1686e28c46f4bfe476dcb6789b62_1588622840.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_230f1686e28c46f4bfe476dcb6789b62_1588622840.html", "title": "Prep Hoops Roundup: Fremont, Bonneville claim boys and girls region wins", "title_page": "Prep Hoops Roundup: Fremont, Bonneville claim boys and girls region wins", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BOYS BASKETBALL\nFREMONT 69, CLEARFIELD 40\nCLEARFIELD — Fremont led Clearfield 37-17 at halftime and coasted to the road Region 1 win.\nCade Hadley scored 15 points to lead a quintet of Silver Wolves in double digits. Baylor Harrop had 14, Tige Voorhees and Kyler Bush each netted 12 and Dallin Hall added 11. Hall hauled in 10 rebounds lo lead Fremont.\nGrayson Banks was the lone Falcon to reach double figures with 13 points. He also pulled down six rebounds.\nDAVIS 67, NORTHRIDGE 51\nKAYSVILLE — Davis led Northridge 33-18 at the half and cruised to a region victory.\nTyson Garff posted game-highs with 18 points and 10 rebounds to lead Davis (10-3 overall, 1-2 Region 1). Josh Sanders had 16 points and five assists while Brendon Redford added 11 points and nine rebounds.\nJackson Kohl led Northridge (5-7, 1-1) with 13 points and seven rebounds.\nSTORY & PHOTOS: Williams’ 29 leads Roy girls over Box Elder STORY: Gilbert’s winner lifts Syracuse boys over Layton\nBONNEVILLE 38, PARK CITY 29\nWASHINGTON TERRACE — Bonneville outscored Park City 12-4 in the fourth quarter to break open a close game and nab the Region 11 win.\nKinnon Finder and Jonah Nielson each scored 11 points with one 3-pointer to lead Bonneville.\nJUAN DIEGO 81, BEN LOMOND 47\nDRAPER — Ben Lomond fell behind 42-16 at the half in a Region 11 road loss at Juan Diego.\nTitus Hughes scored 12 to lead Ben Lomond. Sudan Puk added nine points.\nLAYTON CHRISTIAN 75, DUCHESNE 61\nLAYTON — Layton Christian led 27-24 at the break and used a big second half to pull away from Duchesne for the Region 16 win.\nSam Muller came off the bench to lead LCA with 20 points. Muller hit six 3-pointers on the night and scored 14 points in the third quarter. Micah Petty had 16 points with four treys, five steals and seven assists.\nBraxton Meah posted a triple-double with 11 points, 10 rebounds and 10 blocks. Sano Gasana scored nine points and dished out a game-high 11 assists.\nBEAR RIVER 52, RIDGELINE 49\nMILLVILLE — Ren Fonnesbeck hit a 3-pointer with 3.5 seconds left to break a 49-49 tie and lift Bear River to a Region 12 road win at defending state champion Ridgeline.\nFonnesbeck, Jake Dahle and Mark Huber each scored 12 points to pace Bear River. Jacob Olson added 10.\nLandon Brenchley scored a game-high 16 to lead the RiverHawks.\nThe Bears did not make a substitution in the game. Bear River’s starting five each played all 32 minutes of the game.\nVIEWMONT 65, TAYLORSVILLE 29\nVIEWMONT — Viewmont held Taylorsville to single-digit scoring in every quarter to set up the blowout win.\nSpencer Mackay led Viewmont with 21 points and eight rebounds. Josh Mordue had 12 points, three rebounds and three assists while Kendall Draxler added 10 points and three assists for the VIkings.\nMORGAN 61, SOUTH SUMMIT 51\nKAMAS — Morgan outscored South Summit 21-8 in the fourth quarter and closed the game on a 14-3 run for a Region 13 road win.\nLaine Carter led Morgan with 15 points. Tyson Hurd, Cade Russell and Kaleb Calderwood each netted 12 while Trey Miles added 10 points.\nNORTH SUMMIT 77, ST. JOSEPH 29\nOGDEN — St. Joseph fell behind North Summit 31-6 after the first quarter in the Region 16 home loss.\nGavin Andersen and Nick Garcia each scored seven points to lead St. Joseph.\nALTAMONT 70, UTAH MILITARY 30\nALTAMONT — Utah Military trailed at Altamont 15-1 after the first quarter and could not recover in the Region 16 road loss.\nJacob Ogden scored 10 points for UMA and Dante Huerta added eight.\nGIRLS BASKETBALL\nFREMONT 47, CLEARFIELD 39\nCLEARFIELD — Clearfield led 32-31 after the third quarter, but Fremont outscored the Falcons 16-7 in the final frame to claim the Region 1 road win.\nEmma Calvert scored 13 to lead Fremont. Abby Broadbent and Berkley Larsen each added 10 points.\nHaylie Anderson led all scorers with 17 points for Clearfield. Jill Thalman and Taevey Davis each added six points.\nNORTHRIDGE 50, DAVIS 49\nKAYSVILLE — Northridge led 38-34 going into the fourth quarter and held off a Davis rally to take a Region 1 road win.\nAbigail Neff scored a game-high 15 points to lead Northridge.\nSarandon Chino scored 11 for Davis and Kami Ober added 10 points.\nLAYTON 59, SYRACUSE 40\nLAYTON — Layton took a 43-22 lead into the fourth quarter and coasted to the win in the Region 1 contest.\nBrenda Gallegos scored a game-high 17 points to lead Layton. Daisy Barker netted 12 and Kaitlyn Viator added 10 points.\nPaityn Williams scored 12 points to lead Syracuse.\nBONNEVILLE 38, PARK CITY 22\nWASHINGTON TERRACE — Bonneville held Park City to four points in the second half on the way to a Region 11 win.\nJenna Czarnecki led Bonneville with 13 points, including two 3-pointers. Karly Conolly added 11 points.\nALTAMONT 51, UTAH MILITARY 25\nALTAMONT — Raegan Furniss hit 10 of 12 free throw attempts and scored 20 points for Utah Military, but it wasn’t enough as the Thunderbirds fell at Altamont in the Region 16 tilt.", "url": "https://apnews.com/230f1686e28c46f4bfe476dcb6789b62"}