{"authors": ["Doug Philllips Special To The Schuyler Sun"], "date_download": "2020-05-04 20:18:11", "date_modify": "2020-05-04 20:18:11", "date_publish": "2018-09-13 05:00:00", "description": "I don’t get much of a thrill in saying, “I told you so,” but I warned Husker nation last week that a win over Colorado last Saturday in Lincoln was NOT a given. So many were so caught up in the...", "filename": "_b632ef88f10f472b9bc887bd1e99ae38_1588623491.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b632ef88f10f472b9bc887bd1e99ae38_1588623491.html", "title": "Buffs crash the party", "title_page": "Buffs crash the party", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "I don’t get much of a thrill in saying, “I told you so,” but I warned Husker nation last week that a win over Colorado last Saturday in Lincoln was NOT a given. So many were so caught up in the hoopla of the first game of the Scott Frost era at NU that few expected the Buffs to come to Lincoln and steal a win.\nWhat led to my, shall we say, lack of faith in a Husker victory? That dreaded “H” word: Homework!\nIn Week 1, while the Huskers versus Akron game was a wash out, Colorado squared off in their annual fight for The Rocky Mountain State against Colorado State in Denver. CU squashed the Rams by a score of 45-13 after building up a 28-10 halftime advantage.\nKeep in mind this was a rivalry game. Also keep in mind there were many seasons the Buffaloes were supposed to be top-10 materials were washed away early in the schedule with losses to the Rams.\nColorado thrashed CSU for 596 yards of offense with 338 yards coming through the air and another 258 on the ground. Quarterback Steven Montez was being hailed as one of the more improved quarterbacks in the FBS ranks this year by the announcers of the game.\nThe Buff defense did look a bit porous at times, but it still held CSU to 284 total yards, 181 through the air and 103 on the ground.\nThe game was aired nationally late in the evening, but I watched it to see what kind of a team Colorado would be bringing to Lincoln.\nIn my mind, they scared me. Their offense looked to be in mid-season form, and Montez was right on target with his passes for much of the game. The way things have played out in the Pac-12 thus far this season, I wouldn’t be totally surprised to see the Buffs win their division this year and make some noise while entering the top 25.\nSo was CU that good and CSU that bad?\nThis past Saturday the Rams were a 14-point underdog at home against Arkansas. They put 17 points on the scoreboard in the 4th quarter and pulled off the 34-27 upset making Colorado’s win the week earlier even that much more impressive.\nNow< I am quite sure that most Nebraska fans could care less about Colorado State, Arkansas, and most of all, Colorado based on last week’s gut-wrenching loss. The point is, Nebraska lost to a good football team.\nNebraska should have won the game. As we have seen so many times in the past, Nebraska’s self-inflicted wounds did them in with the whole country watching to see what all of this Scott Frost talk has been about during the off season.\nToo many penalties at crucial times, too many turnovers, and too many dropped passes and dropped, would-be, interceptions spelled D-O-O-M for the Huskers in their 2018 season opener.\nNebraska did have 170 more total yards than CU (565-395), and outplayed the Buffs after the first quarter in most phases of the game, but couldn’t overcome their 0-3 turnover margin against a team as good as Colorado.\nNebraska gets a good team from Troy this Saturday morning in a game beginning at 11:00 a.m. in Memorial Stadium in Lincoln.\nThe Trojans are 1-1 on the season with a 56-20 home loss to Boise State in and a home romp over Florid A&M last Saturday by a score of 59-7. They finished 11-2 a year ago and come to Lincoln ready to pull off the major upset.\nThis week’s game sets up like last season’s 21-17 klunker against Northern Illinois in Lincoln the week after the demoralizing set-back of 42-35 at Oregon. The game against the Trojans we will show how much this program has truly turned itself around in a few short weeks under the leadership of Scott Frost and his staff.\nA year ago, Nebraska would have hung its head and walked around with its tailed between its legs waiting for another beating. I am very confident we can rest assured that won’t be the case this weekend in Lincoln.\nNebraska is an 11 ½ point favorite (as of Monday night), and the Big Red cover the spread. With or without Adrian Martinez the Huskers are good enough to win this one by a couple of touchdowns.\nThe Huskers will get that nasty taste of stale, tough Buffalo out of their mouths and pick up a 42-21 victory over the Trojans as Scott Frost puts victory number one into the record book.", "url": "https://apnews.com/b632ef88f10f472b9bc887bd1e99ae38"}