{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:10:37", "date_modify": "2020-05-04 20:10:37", "date_publish": "2018-05-08 06:31:00", "description": "Apparently, people angry with Michelle Wolf’s performance at the White House Correspondents’ Dinner just don’t “get it.” Saying people who don’t “like abortion” should try it isn’t some...", "filename": "_55bbcf6c70f8479d9969da4be46e23a0_1588623037.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_55bbcf6c70f8479d9969da4be46e23a0_1588623037.html", "title": "Rick Jensen: Body shaming conservatives is a great liberal sport", "title_page": "Rick Jensen: Body shaming conservatives is a great liberal sport", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Apparently, people angry with Michelle Wolf’s performance at the White House Correspondents’ Dinner just don’t “get it.”\nSaying people who don’t “like abortion” should try it isn’t some horribly insensitive scream at women who have anguished with that choice for years.\nIt isn’t a stab into the hearts of families that have wept and hugged and fought and reconciled over their teenager’s situation.\nThis is today’s liberal humor.\nSteven Colbert, Trevor Noah and Seth Meyers simply deliver lines like these more effectively than Michelle, a writer and contributor for “The Daily Show and “Late Night.”\nThis style of humor is mean, ugly and nasty and if you don’t laugh, you’ll be banished from the tribe.\nThat’s where our politics are today. It’s all tribal.\nIf you dare to suggest that Trump is anything but a racist bent on destroying a world whose leaders refuse to talk with him, then you’re a fascist racist bent on destroying the world.\n“I’m going to try a fun new thing, okay? I’m going to say, “Trump is so broke,” and you guys go, ‘How broke is he?’ All right.”\n“Trump is so broke he has to fly failed business class.”\n“Trump is so broke he looked for foreign oil in Don Jr.’s hair.”\n“Trump is so broke Southwest used him as one of their engines. I know, it’s so soon. It’s so soon for that joke. Why did she tell it? It’s so soon.”\n“Trump is so broke he had to borrow money from the Russians and now he’s compromised and susceptible to blackmail and possibly responsible for the collapse of the Republic. Yay, it’s a fun game.”\nHer voice trails off as the crowd goes mild.\nThe late night audiences actually love this stuff. It was the attacks on Sarah Sanders’ appearance that rankled.\n“We are graced with Sarah’s presence tonight. I have to say I’m a little star-struck. I love you as Aunt Lydia in, The Handmaid’s Tale.”\nFor those of you who don’t recognized the body-shaming in that insult, actor Amy Dowd’s “Aunt Lydia” character is one mean-spirited, rough-looking woman with makeup suggesting a face sandblasted by dust bowl winds.\nWolf: “Every time Sarah steps up to the podium I get excited, because I’m not really sure what we’re going to get — you know, a press briefing, a bunch of lies or divided into softball teams.”\nWait. What?\nWhat is Wolf’s frat bro slam saying about female softball players and why would it be funny to say Sanders looks like one?\nWhat Michelle has truly revealed is that today’s successful liberal comics are angry and mean.\nIt’s okay for them to behave like Trump because... Trump.\nThey are automatically above reproach for name-calling and bullying conservative women because... Trump.\nWolf represents the liberals so shocked and offended by Trump’s foul insults that they feel justified in emulating that behavior.\nMaybe this is a good thing.\nMaybe this liberal hypocrisy could reverse the trend to avoid any humor deemed “politically correct” and insensitive by the liberal “PC Police.”\nLiberal columnist David Horsey of the Los Angeles Times once wrote that Sanders, “does not look like the kind of woman” President Trump would choose for his press secretary.\n“By comparison, Sanders looks more like a slightly chunky soccer mom who organizes snacks for the kids’ games.\nRather than the fake eyelashes and formal dresses she puts on for news briefings, Sanders seems as if she’d be more comfortable in sweats and running shoes.”\nBody shaming conservatives by liberals is great sport, eh?\nLet the insults fly and let it be “game on” for all sides without any apologies and no more faux outrage from liberals.\nRemember, Wolf’s attempts at humor are the same sort delivered by the liberal hate night hosts who hire her to write for them.\nThey know their partisan, angry audience.\nThat’s why late night studio audiences like Colbert’s cheered these insults.\nShe just has no idea how to deliver nasty lines to a mainstream crowd that wasn’t thirsty for blood.\nRick Jensen is an award-winning Delaware talk show host and national columnist. Email Rick@DBCMedia.com.", "url": "https://apnews.com/55bbcf6c70f8479d9969da4be46e23a0"}