{"authors": ["Denise Allabaugh"], "date_download": "2020-05-04 20:09:40", "date_modify": "2020-05-04 20:09:40", "date_publish": "2018-12-11 14:02:45", "description": "HANOVER TWP. — Crowds of people filled an open house event at the new Adidas distribution center in Hanover Twp. on Tuesday, toured the facility and inquired about job opportunities. Adidas...", "filename": "_e70b8a69cd514ca68595c083326e246f_1588622980.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e70b8a69cd514ca68595c083326e246f_1588622980.html", "title": "Crowds File In To Adidas Open House", "title_page": "Crowds File In To Adidas Open House", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HANOVER TWP. — Crowds of people filled an open house event at the new Adidas distribution center in Hanover Twp. on Tuesday, toured the facility and inquired about job opportunities.\nAdidas is hiring for a variety of jobs that are posted at careers.adidas-group.com and www.pacareerlink.com. The majority of current job openings are for management positions including operations manager, operations supervisors, senior managers of industrial engineering and IT applications, manager of inventory control and maintenance shift supervisors.\nWilkes-Barre resident Alexi Wright, 25, came to the open house looking for a job as a warehouse worker. Adidas officials did not tell him yet how much the position pays per hour. They didn’t offer him or others warehouse jobs yet, but gathered information. He received a flyer saying that positions would be filled in 2019. Adidas is working with Manpower to fill the jobs.\nAn Adidas official at the open house told a reporter that questions about job openings and salaries must be emailed to a corporate spokesperson, who did not respond to an email on Tuesday. The Adidas official also said no photographs could be taken inside the new facility. An official from Manpower did not return a call on Tuesday.\nWhile an Adidas official would not say what the starting salary is for a warehouse worker, online job listings say the typical salary for a warehouse worker at Adidas ranges from $11 to $13 an hour.\nWright said he likes Adidas’ new 843,000-square-foot distribution center which is located on a 172-acre parcel at 550 New Commerce Blvd. near warehouses for online pet food retailer Chewy.com and outdoor clothing company Patagonia.\n“I think it’s very nice. It’s very modern and up-to-date and clean,” Wright said. “I think it’s great that transportation runs later so you could catch a bus here. I’m told there will be three shifts.”\nLines of people waited inside the new Adidas facility for tours. People who attended entered a raffle to win prizes like Adidas sneakers, water bottles and backpacks.\nBeatriz Holguin, 24, who recently moved to Wilkes-Barre and formerly worked for Amazon in Hazle Twp., came to the open house looking for information about getting a job as a warehouse worker.\nBrianna Zychal, 20, of Old Forge, spoke to recruiters at Adidas about job openings. She said she was excited when she found out Adidas was coming to the area. Her mom sent her information about the open house so she also inquired about a job as a warehouse associate and she said she plans to apply.\nAdidas, a multinational corporation, designs and manufacturers shoes, clothing and accessories.\nMissouri-based NorthPoint Development constructed the warehouses for Adidas, Patagonia and Chewy.com.\nBrent Miles, vice president of economic development for NorthPoint Development, recently said Patagonia has begun operating and Adidas will open next year. He could not be reached for comment on Tuesday, but previously said 2,000 jobs will be created at the site at the three buildings.\nWhen Adidas opens its new distribution center next year in Hanover Twp., its website states it will allow people to work with “world-class machinery and state-of-the-art automated processes.”\ndallabaugh@citizensvoice.com, 570-821-2115, @CVAllabaugh", "url": "https://apnews.com/e70b8a69cd514ca68595c083326e246f"}