{"authors": ["Tim Yonke"], "date_download": "2020-05-04 20:20:55", "date_modify": "2020-05-04 20:20:55", "date_publish": "2018-03-21 16:08:00", "description": "After canceling session and committee hearings in Springfield Thursday, the Illinois General Assembly is off for the next few weeks. When they come back, they’ll have about a month’s worth of...", "filename": "_7f27b873827d4e8d8148115b8bf984a6_1588623655.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7f27b873827d4e8d8148115b8bf984a6_1588623655.html", "title": "State lawmakers have around 30 scheduled days left to pass budget", "title_page": "State lawmakers have around 30 scheduled days left to pass budget", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "After canceling session and committee hearings in Springfield Thursday, the Illinois General Assembly is off for the next few weeks. When they come back, they’ll have about a month’s worth of working days to pass a plan to spend about $37 billion in taxes.\nThe House was off last week. The Senate adjourned Wednesday and canceled Thursday. Both chambers aren’t back in session until the second week of April.\nWhen they come back, they only have about 30 business days scheduled to pass a budget before the May 31 deadline.\nState Sen. Andy Manar, who chairs an appropriations committee, said he understands if taxpayers think lawmakers are wasting time not being in session.\n“Well, a lot of people say that when we’re here we waste time, too,” Manar, D-Bunker Hill, said. “So, it’s a darned if you do, darned if you don’t type of scenario.\n“My committee is gonna meet several times during this Easter break,” Manar said.\nNo appropriations committee dates and times in the coming weeks have been published.\nWhile he doesn’t agree with every aspect of Gov. Bruce Rauner’s proposed budget, Manar said this year’s is on better footing than previous years’, “which I think puts the legislative process in a better position to facilitate a compromise.”\nRauner’s budget relies on most of the $5 billion income tax increase lawmakers imposed over his veto last summer.\nState Sen. Kyle McCarter, R-Lebanon, said the budget should be top of mind “because the taxpayers have entrusted their hard-earned money to us. I think how we spend it is of utmost importance.”\nHe added: “We have got to make this a priority.”\nMcCarter said lawmakers were focused this week on passing gun legislation that he said if enacted into law could possibly be challenged and overturned by the courts.\n“We don’t need to be distracted by these things,” McCarter said. “We need to be accountable to taxpayers.”\nThe deadline to pass a balanced budget with simple majorities is May 31. After that, a supermajority is required.\nLast year, lawmakers went into overtime to pass a budget and income tax increase over the governor’s veto. The two years before that, lawmakers didn’t pass a full year’s budget at all, leaving spending virtually unchecked.", "url": "https://apnews.com/7f27b873827d4e8d8148115b8bf984a6"}