{"authors": ["Robert Nott", "Rnott Sfnewmexican.Com"], "date_download": "2020-05-04 20:09:07", "date_modify": "2020-05-04 20:09:07", "date_publish": "2018-07-08 02:35:00", "description": "Cecelia Cervantes doesn’t seem to worry about the limitations of a business card. Though the word “interim” has been attached to her designation as president of the Santa Fe Community...", "filename": "_9455f12d0fe34a68bc758930e980dcec_1588622947.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9455f12d0fe34a68bc758930e980dcec_1588622947.html", "title": "Santa Fe Community College’s interim president ready for long haul", "title_page": "Santa Fe Community College’s interim president ready for long haul", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cecelia Cervantes doesn’t seem to worry about the limitations of a business card.\nThough the word “interim” has been attached to her designation as president of the Santa Fe Community College since last fall and likely will stay there through next June, Cervantes says she’s determined to plow ahead as if time or title didn’t exist.\nShe said she cannot act as if an interim leader has no power or mandate to enact change.\n“I didn’t come in and say, ‘I’m an interim and I can’t do this; I’m an interim and I can’t touch that,’ ” she said. “That’s not been my MO. I have to think: ‘How can I help the college accomplish its mission and meet its goals?’ ”\nAt 69, and a veteran of education since starting as an elementary school teacher in El Paso in the 1970s, Cervantes has seen plenty in her career. And she’s likely to see a lot more after the college’s governing board recently extended her interim status through June 30, 2019.\nThe community college is dealing with a significant drop in student enrollment — 9 percent — and also faces the potentially thorny issue of ensuring negotiations with a new faculty union result in a deal by summer’s end. The college also is facing a lawsuit recently filed by a longtime faculty member who alleges he was fired for leading the effort to unionize.\nThose issues will take center stage while the board seeks a permanent successor with the help of a national search firm.\nSFCC’s five-member governing board unanimously voted to allocate $60,000 — plus an additional $25,000 in discretionary expenses, if necessary — to hire Washington, D.C.-based Academic Search during its last month.\nBoard Chairwoman Linda Siegle told The New Mexican in October, when Cervantes was chosen for the interim position out of 13 candidates, that the board would not hire her as the permanent president but planned to work with her to find the right person for the job. Cervantes will continue at her current annual salary of $190,000, plus benefits.\n“We’re very happy with her work. That’s one reason we extended her contract,” Siegle said. “She’s very experienced, she’s very personable and she listens to people.”\nThe board chose Cervantes last fall to replace outgoing president Randy Grissom, who retired.\nCervantes, who holds bachelor’s and master’s degrees from the University of Texas at El Paso and a doctorate from the University of Colorado, began working in higher education for the Community College of Denver, kicking off a 35-year-career working at colleges across the nation.\nAt SFCC, Cervantes worked to build voter support for a February 2018 bond to raise $17 million so the college could build a new auto repair facility, make renovations to its fitness center and update classroom and technology systems. Voters overwhelmingly approved that measure. Now, Cervantes says she’ll have to ensure those funds are spent as planned.\nCervantes also is working on a multipronged approach to the enrollment problem. For example, the college will look for ways to add more weekend, evening and online courses to appeal to nontraditional students who have families or jobs that preclude them from attending weekday classes.\nAdministrators also are reviewing the student application process to see “where gaps and problems are and address them,” she said.\nCervantes said she has worked with Santa Fe Public Schools to get seniors at Capital High and Santa Fe High to apply for financial aid and take the Accuplacer test, which gauges whether students are ready for college-level courses, before they graduate. This way, she said, the material they’ve learned is still fresh in their minds, possibly increasing their chances of passing the test.\nAccording to SFCC data from earlier this year, 76 percent of incoming high school students need to take at least one developmental education course in math, while 67 percent need developmental classes in English.\nThe college saw an increase in applicants this year — by nearly 50 students — as a result of the effort.\nCervantes also listened to student concerns about lowering or lifting the admission price to the college’s William C. Witter Fitness Center, working out a pilot program in which full-time students can attend free at certain hours on certain days.\nHer biggest challenge, SFCC board member Martha Romero said, will be to keep negotiations with the faculty union on track. Cervantes said negotiating teams from both sides have been meeting more regularly and are establishing a rapport that will hopefully lead to a contract agreement by the end of July.\nDuring a college labor board meeting Friday, however, union representatives said such a timeline is unlikely because most of the faculty members, who must be on campus to review and ratify the contract, are on summer break.\nThe union, which formed last spring and represents between 50 and 60 employees, has other concerns as well. Last month, William Clark Baughan, a faculty member for more than 18 years, filed a lawsuit in the state First Judicial District Court in Santa Fe against the college and its vice president, Margaret Peters, saying he was fired in retaliation for his work in helping to unionize employees.\nClark Baughan said in the lawsuit that appealing his termination to the college’s labor board would be “futile” because of biases on the board: The college appointed the father-in-law and business partner of its chief labor counsel to the three-member board, as well as an attorney whose firm routinely represents firms in disputes with labor unions.\nDuring Friday’s meeting, some critics of the appointments asked Vincent Yermal, the father-in-law of SFCC legal counsel John Kennedy, to recuse himself. The labor board took no action on the request.\nMeanwhile, Romero, the governing board member, said the board has put together a presidential search committee of about 20 people — community members, faculty members, staff, students and others — to review applications and résumés of the finalists once Academic Search narrows the field. That committee will conduct preliminary interviews of candidates and submit three to five recommendations for the board to consider.\nThe governing board plans to announce a new president in April and start the job in July 2019, Romero said. Ideally, she said, the new president will remain in the position for at least six or seven years to ensure continuity.\n“We really want someone who will come here and stay here for a good while,” she said.\nIn the interim — there’s that word again — Cervantes will continue to oversee the operations of the college, which opened in 1983 and has an annual budget of about $70 million.\nThere’s a certain amount of freedom that comes with knowing she’s only on the job for a limited time, she said.\n“What are they gonna do — fire me?”", "url": "https://apnews.com/9455f12d0fe34a68bc758930e980dcec"}