{"authors": ["James Barron"], "date_download": "2020-05-04 20:09:46", "date_modify": "2020-05-04 20:09:46", "date_publish": "2018-09-14 05:40:00", "description": "Ricky DeHerrera’s first loves were baseball and Mora. Over time, they were replaced by softball and Pojoaque Valley. At least DeHerrera could continue wearing the same colors (green...", "filename": "_612ef10a000a4e06ad24de39c55a7a03_1588622986.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_612ef10a000a4e06ad24de39c55a7a03_1588622986.html", "title": "Pojoaque coach DeHerrera resigns", "title_page": "Pojoaque coach DeHerrera resigns", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ricky DeHerrera’s first loves were baseball and Mora.\nOver time, they were replaced by softball and Pojoaque Valley.\nAt least DeHerrera could continue wearing the same colors (green and white), which he did proudly for 18 years as an assistant and head softball coach at Pojoaque. But health issues that DeHerrera declined to discuss led to him resigning Wednesday at Pojoaque after 10 years as the head coach.\nDeHerrera said he almost choked up a few times talking to his players about his decision, but he felt it was time to take a break.\n“There are just a few health issues I am working through, and I need some ‘me’ time,” DeHerrera said. “Overall, this is a great community that accepted me and I was blessed. I’ve been very blessed. So, why would you leave? That’s a tough question, but I just think it’s time.”\nDeHerrera was a 1988 Mora graduate who started his teaching and coaching career at his alma mater, but when positions in teaching and coaching volleyball and softball opened, DeHerrera chose to head to Pojoaque. It didn’t hurt that another Mora alumnus, Matt Martinez, was the athletic director at the time, and DeHerrera would be assisting his friend and fellow Mora grad Nelson Gutierrez in volleyball.\n“I was just lucky to have him join the staff,” said Martinez, who is now the AD at Rio Rancho Cleveland. “With him being available and the opportunity to come to Pojoaque presented itself, it was an easy pick to put him on both coaching staffs. He was a valuable asset.”\nDeHerrera worked under Gutierrez for four years, and he coached for the late Billy Trujillo, who started the program in 1995 and coached until 2005. DeHerrera said he loved baseball, but softball proved to be a more than adequate replacement.\n“I had been a baseball coach and player all my life,” DeHerrera said. “Softball kinda took my heart. It’s just a different sport because the girls, they are something else. Just super athletes.”\nHe continued as an assistant to Bob Chavez until he retired after the 2008 season. In DeHerrera’s second season, he led Pojoaque to a runner-up finish in District 2-3A and a No. 5 seed, although the Elkettes were knocked out by Dexter in the opening round of the tournament. The Elkettes made the state tournament for the first eight years under DeHerrera, but failed to make the 2017 and 2018 bracket. He finished his Pojoaque career with a 125-140 record.\nHowever, his best coaching job did not come on the diamond. When Pojoaque had Gary Morrow suddenly resign as head volleyball coach just days before the 2012 season opener, Martinez turned to DeHerrera, head boys basketball coach Joey Trujillo and assistant boys basketball coach Mark Loera to oversee the program through the season.\nThe trio helped the Elkettes win the fourth of five straight Class 3A titles despite a 1-3 start to the season.\n“It didn’t take us very long [to mesh],” DeHerrera said. “Joey was like, ‘I’ll do all the paperwork and everything else, you guys take care of the practices and the drills.’ I knew most of the girls because they played for me [in softball], and Mark dealt with the girls all day long [as a teacher]. It was a great experience. Looking back on it, that was special.”\nDeHerrera did not rule out a return to coaching, but said he will continue to referee volleyball matches and could possibly become a softball or baseball umpire.\nFor now, though, he is content to step away and continue his teaching career at Pojoaque.\n“I’m still going to be here,” DeHerrera said. “I lack six or seven years teaching wise before I can retire, so I will stick it out here. But there are some people who tell me, ‘Yeah right. You love it because of the green and white.’ ”", "url": "https://apnews.com/612ef10a000a4e06ad24de39c55a7a03"}