{"authors": ["Rosa Salter Rodriguez"], "date_download": "2020-05-04 20:13:35", "date_modify": "2020-05-04 20:13:35", "date_publish": "2018-02-21 05:00:01", "description": "For the third time in less than a year, local zoning board officials are being asked to allow gun-related businesses in neighborhood residences. The latest request, which is generating...", "filename": "_33e0fb26424a445f9eb6b52045d0e7cb_1588623215.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_33e0fb26424a445f9eb6b52045d0e7cb_1588623215.html", "title": "Zoning board asked to allow gun-related business in garage", "title_page": "Zoning board asked to allow gun-related business in garage", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "For the third time in less than a year, local zoning board officials are being asked to allow gun-related businesses in neighborhood residences.\nThe latest request, which is generating controversy, is for retail sales of firearms and gunsmithing from an approximately 500-square-foot attached garage at 4714 Parkerdale Drive in the Brookside Estates neighborhood in northeast Fort Wayne. The request will have a public hearing at 6 p.m. Thursday before the Fort Wayne Board of Zoning Appeals.\nThe request was made by Jarred A. Gladieux, who resides at the address, according to application documents filed with the Department of Planning Services.\nLocal zoning law allows zoning boards to approve home-based businesses as a special use and does not restrict them by type. But a board also can deny and restrict such businesses based on neighborhood impact, according to planning department staff.\nIn Gladieux’s application documents, he provided few details about the proposed business : except to state it will not affect neighbors because the property’s exterior would not be altered and the business “will take place in my house, behind closed doors, out of view” of the public.\nHowever, the plan has drawn opposition.\n“Businesses that sell items that are potentially dangerous do not belong in neighborhood settings,” wrote one neighbor, Roxana Rockwell of Parkerdale Drive, in a letter to the zoning board.\n“It is fine to say there is no reason to be concerned, but there is, unfortunately, always reason for concern when it comes to weapons. In our current society, guns are a major destructive force. There are no guarantees, and I believe that no gun shop belongs in any (residential) neighborhood.”\nRockwell’s letter also said a better place for such a business would be in a commercial setting, away from homes neighbors bought many years previously.\nBrookside Estates is east of St. Joe Road about half a mile from Shoaff Park and Our Lady of Good Hope Church and School. Homes there currently are valued at about 150,000, according to recent real estate listings.\nHowever, Gladieux said Wednesday opposition is based on misunderstanding of his intentions. Gladieux said he will not sell firearms at the location. He compared the business to an automobile repair garage : where people would bring their licensed weapons for repair or customization.\nHe said the federal Bureau of Alcohol, Tobacco and Firearms requires a locally approved location in order to issue him a license, and the license he is seeking includes sales and gunsmithing as permitted activities.\nThe license, he said, would allow him to order parts, including for hobbyists who enjoy building guns from scratch. Gladieux said he met with the Brookside Estates’ neighborhood association Tuesday night and obtained a letter of support.\nGladieux said he will soon graduate from a gunsmithing school and is attempting to turn his hobby “into a career.”\nIn previous cases, zoners have allowed and denied similar applications. In April, Fort Wayne zoners denied an application from Greg and Priscilla Smith of G.S. Guns LLC for 3814 Shannon Drive in the Parkview neighborhood of St. Joseph Township.\nNeighbors objected to the business, and the board ruled a home-based firearm business would be inappropriate and “unduly detrimental” to the surrounding residential neighborhood’s character and property values.\nHowever, the Allen County Board of Zoning Appeals in July allowed a firearms sales and accessories home business requested by Russell Concordia at a home at 14224 Illinois Road (Indiana 14) in Aboite Township.\nThat business was proposed for a little more than 500 square feet in the garage of a home on land zoned agricultural and not close to other homes but within a quarter-mile of other retail and commercial uses.\nHowever, the board imposed 14 conditions on its approval, including limiting the approval to the applicant, having the applicant use the home as his primary residence and maintaining its residential appearance unless approved by the board.\nSignage was prohibited, as was any discharge of firearms on the property. The business was required to be established within a year.\nFor the request being heard at Thursday’s hearing, Gladieux stated the business would have no sign, no exterior storage, no noise and no hazardous material use.\nHe did not answer a question asking for evidence the business would not be injurious to public health, safety and welfare : information that is required of several types of businesses, including shooting ranges, but not gun sales, according to a statement on the application.\nThe public hearing will take place in Room 35 of Citizens Square, 200 E. Berry St. Decisions are generally issued immediately after evidence is heard.\nrsalter@jg.net", "url": "https://apnews.com/33e0fb26424a445f9eb6b52045d0e7cb"}