{"authors": ["Patrick Varine"], "date_download": "2020-05-04 20:18:52", "date_modify": "2020-05-04 20:18:52", "date_publish": "2018-03-08 02:03:20", "description": "When Olivia Hamilton of Murrysville was younger, she spent a lot of time with her father working on cars. \"I knew I didn't want to be a mechanic, but I remember thinking that welding sounded...", "filename": "_74b9cd5993824c189941d14ec61b392d_1588623532.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_74b9cd5993824c189941d14ec61b392d_1588623532.html", "title": "Murrysville welding student challenges perception of vo-tech education", "title_page": "Murrysville welding student challenges perception of vo-tech education", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When Olivia Hamilton of Murrysville was younger, she spent a lot of time with her father working on cars.\n“I knew I didn’t want to be a mechanic, but I remember thinking that welding sounded pretty cool,” she said.\nToday, Hamilton, 18, is the first female welding student from the Franklin Regional School District, and one of only four in her classes at Northern Westmoreland Career & Technology Center.\n″(Four) is still kind of low, but it’s probably more than they’ve had over the years,” she said.\nStarting the sophomore year, Franklin Regional students can begin taking vocational-technical classes in the morning at places like Northern Westmoreland or Forbes Road Career and Technology Center in Monroeville, before coming back to the school in the afternoon. During their junior and senior years, the times are swapped.\nHamilton also participates in what Franklin Regional senior internship coordinator Jeff Stanczak called a “co-op” at Safety Guard, a steel fabrication company in Millvale.\n“Northern Westmoreland is affiliated with a number of professionals in the region,” Stanczak said. “Once students demonstrate a certain level of ability, the idea is to get them out to a place where they can have more of an apprenticeship.”\nSafety Guard Chief Operating Officer Bobby Campbell said there should be no stigma attached to vo-tech education.\n“I have an engineering degree, and I think that’s very valuable. But I see so many people going through college now and they just collect $100,000 in debt for a degree that they don’t know how to use, or that isn’t that marketable,” he said. “What’s really nice in a technical program is that you’re in school already, it’s paid for through taxes, and there’s a market for it.”\nHamilton said every day at Safety Guard is a little different.\n“I’ll tack weld, I’ll build and cut stuff,” she said. “Really, whatever they need you to do.”\n“Olivia’s been doing great,” Campbell said. “She has great attitude and is very easygoing.”\nLong gone is the surprised reaction when Hamilton tells people she is pursuing a welding career. She does still get a few looks of surprise when she tells people she is not planning to attend college.\nStanczak said he and others at Franklin Regional are working to erase any lingering stigma about vo-tech education.\n“We want all our students to be both college- and career-ready,” he said “So everything we do in our classrooms and every opportunity we try and create is to ensure they’re ready to take that next step after graduation.”\nHamilton said the nature of her skills, and the simple reality that welding is an essential part of the construction process, has boosted her confidence in the decision to go straight into the job market.\n“You always will have a job,” she said.\nWith more than 100 Pittsburgh-area welding jobs listed at just one website, Indeed.com, she is likely right.\nShe’s also showing her skill on the regional stage: she was among four Northern Westmoreland students to advance to the statewide SkillsUSA competition, held in Hershey in April. Hamilton finished third in the welding category.\n“I started out wanting to be a steamfitter,” she said. “But now I’m looking more at being an iron worker. I did a welding job a couple months ago and realized I didn’t really want to be inside. I like to be outside and climbing stuff.”\nHamilton encouraged any student with an interest in vocational or technical training to give it a shot.\n“You can always drop it if you don’t like it,” she said. “So I’d say try it out.”\nStanczak agreed.\n“Not everybody’s going to be going to college or taking AP courses,” he said. “So we really want to make sure to encourage our students to explore vocational opportunities as well.”\nCampbell said those opportunities abound in the Pittsburgh area.\n“If we have someone like Olivia with a good work ethic, we’ll help them build a skill set where there’s no doubt they’ll be able to get a job and have a career path.”\nPatrick Varine is a Tribune-Review staff writer. Reach him at 724-850-2862, pvarine@tribweb.com or via Twitter @MurrysvilleStar.", "url": "https://apnews.com/74b9cd5993824c189941d14ec61b392d"}