{"authors": ["Sentinel"], "date_download": "2020-05-04 20:09:37", "date_modify": "2020-05-04 20:09:37", "date_publish": "2018-09-11 10:33:41", "description": "Dear Bonnie: Can people here on Earth drain one's energy? We had a family get-together, and I was hurt by one of my family members who seemed to be intentionally trying to hurt my feelings. I...", "filename": "_c84fa723445f484fbdaaf6757a11d13c_1588622977.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c84fa723445f484fbdaaf6757a11d13c_1588622977.html", "title": "Don't Let Anyone Drain Your Energy", "title_page": "Don't Let Anyone Drain Your Energy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dear Bonnie: Can people here on Earth drain one’s energy? We had a family get-together, and I was hurt by one of my family members who seemed to be intentionally trying to hurt my feelings. I tried to handle it the best I could, even asking what my higher self would do, but it just didn’t work. I left the gathering feeling depleted and defeated. As much as I tried to brush it off, the feelings stayed with me and ended up ruining my weekend that followed.\nAny suggestions? I don’t want to let this happen again, so how do you have a relationship with someone without allowing them to destroy your feelings? -- Erica\nDear Erica: We are souls living in a human body, and we not only get our feelings hurt, but if you are sensitive like I am, our souls also get wounded. It’s not easy to believe that someone close to us or even in our family would want to hurt us, but it happens more than you know.\nIt really has more to do with how they feel about themselves then how they feel about us. A person that is not happy with himself tends to lash out and hurt others. It might make him feel like the “big man on campus” for a few minutes, but really it just takes away why we are here on Earth in the first place, which is to love each other unconditionally.\nHopefully, sooner or later, this person sees that their words and actions are not bringing them in life where they want to go.\nIt all comes down to self-confidence within ourselves and how we treat others. When we are unhappy about where we are in our lives and the hand that has been dealt us, we attack others who seem to have what we want. The best thing we can do when we encounter someone who seems to want to knock our self-confidence down is to learn how to protect ourselves using psychic protection to keep us safe from unwanted attacks.\nWe can all be sensitive in our own ways, so to dust off the energy of others becomes a necessity. Here are some tools you can use before encountering energy or people who seem to zap yours.\nn If you know you are going to come into contact with certain people or are going into a tense situation, stop and take the time to wrap yourself in a beautiful white ribbon of protection. Start at your feet and work your way up your body until you reach your head, making sure you ask for protection for your highest and greatest good. Another method is to surround yourself in a bubble of protection, visualizing this giant bubble surrounding you.\nn Sage is a protection tool that many use to clear themselves of unwanted energy, either for themselves, their home or their workplace. For this tool, you will need to collect just a few items: sage, a shell to hold the sage, and a feather to waft the smoke around while clearing the energy. You can purchase these things in any metaphysical stores or online.\nTo use the sage on yourself, the shell holds the sage as you carefully light it, and then lightly blow out the fire while the sage continues to smoke. Stand with the sage burning (you just want the smoke) while holding the shell in front of you, going up and down your body. Visualize the smoke also going up and down the back of you while saying a prayer or affirmation of your choice, clearing any unwanted energies and picturing them being taken away.\nn Your home or office: In very much the same way, start in the center of the room and make your way to each corner of the room, going up and down in each corner. After finishing each corner, close the door behind you, wait five minutes, and then open a window in the room to let out the stagnant energy. The smoke is what does the job as it collects the energy that is no longer wanted and carries it away.\nIt’s all about the intent behind the actions. You are important, so take the time to make yourself and your surroundings safe from these psychic attacks. It’s unfortunate that it happens, but using these tools can make sure the effects are not as detrimental and you feel protected.\nBonnie Page is a psychic medium and reiki master. She is available for private readings and reiki sessions at Messages From Heaven Healing And Learning Center, 646 Central St., Suite 3, Leominster, or by telephone at 978-297-9790. If you would like to ask Bonnie a question for her column, email at bonniepage@verizon.net .", "url": "https://apnews.com/c84fa723445f484fbdaaf6757a11d13c"}