{"authors": ["Steve Taggart"], "date_download": "2020-05-04 20:16:38", "date_modify": "2020-05-04 20:16:38", "date_publish": "2018-09-23 09:12:00", "description": "Democratic gubernatorial candidate Paulette Jordan’s contest against Republican Lt. Gov. Brad Little is stumbling badly. This month, her campaign was roiled by the departure of her campaign...", "filename": "_ceac00a2957542e997c95c8629e1c381_1588623398.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ceac00a2957542e997c95c8629e1c381_1588623398.html", "title": "What is going on with Paulette Jordan’s campaign?", "title_page": "What is going on with Paulette Jordan’s campaign?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "What is going on with Paulette Jordan’s campaign?\nDemocratic gubernatorial candidate Paulette Jordan’s contest against Republican Lt. Gov. Brad Little is stumbling badly.\nThis month, her campaign was roiled by the departure of her campaign manager, her communications director and her scheduler barely seven weeks before election day. On Sept. 14 according to press reports, her campaign headquarters in Boise was locked up. The Idaho Statesman contacted her campaign treasurer, former state Sen. John Peavey, and he could offer no insight. The Idaho Democratic Party confirmed the departures, but seemed surprised also.\nThis follows on the heels of a similar wave of departures from her campaign just before the Democratic primary in May. That blowup didn’t prevent her victorious primary effort but the impact is far more devastating now.\nOddly enough, her departing staffers are being tight-lipped because of “non-disclosure agreements.” While common in private industry, such agreements are rare in the campaign world.\nThe Trump campaign recently drew some scrutiny for binding its campaign staffers in 2016 and, uniquely, requiring White House staffers to also sign such agreements.\nWith these agreements, what is Jordan trying to hide from public scrutiny? Is it some aspect of her personality, her management style or is it simple paranoia?\nOn top of the staff discord is the absence of any serious campaign effort. That may have been the trigger for the departures.\nThe Jordan campaign is not running television advertisements even though the election is less than 60 days away. No direct mail has hit. And online efforts, if launched at all, are minimal at best. As a relatively unknown candidate her failure to define herself and her message leaves her vulnerable to Idaho Republicans filling in the gaps.\nReports are circulating widely of tepid fundraising efforts, which may explain the lack of paid media.\nThis is all sort of strange from a charismatic candidate who has drawn attention nationally and a lot of enthusiasm from Idaho’s progressive activists.\nIt is certainly not the way to run a successful campaign, in particular when you are running against a hardworking opponent like Brad Little in a heavily Republican state.\nJordan is traveling the state somewhat. She has appeared a few times in East Idaho. But,she has done little to use the primary tool of underdog candidates — free media. Most of her public appearances seem like initial introductions to the electorate rather than communicate substantive policy positions or differentiate herself from her opponent. She engaged a bit on the recent problems with the Idaho vehicle licensing system but only tepidly and for a day or two.\nFor a while I’ve thought that the Jordan campaign was relying inordinately on the Medicaid proposition measure to drive out new or infrequent voters in sufficient numbers to reshape the electorate. But that is an inadequate explanation for the limited campaign.\nThere is another possibility. Has Paulette Jordan herself essentially given up, just biding her time until Nov. 6?\nIf so, that would be a devastating blow to Idaho Democrats. They need a strong campaign from their gubernatorial nominee to strengthen their efforts down ticket.\nBrad Little is the primary beneficiary of Jordan’s weaknesses but other Idaho Republicans should be smiling, too.\nSteve Taggart is an Idaho Falls attorney specializing in bankruptcy (www.MaynesTaggart.com). He has an extensive background in politics and public policy. He can be reached at staggart101@gmail.com. This column originally appeared on idahopoliticsweekly.com.", "url": "https://apnews.com/ceac00a2957542e997c95c8629e1c381"}