{"authors": ["Brent Martin"], "date_download": "2020-05-04 20:13:48", "date_modify": "2020-05-04 20:13:48", "date_publish": "2018-02-16 12:26:00", "description": "LINCOLN - Gov. Pete Ricketts defends his proposed cuts to the University of Nebraska system, even in the face of dire warnings from university officials. University officials and supporters...", "filename": "_2faef4b137754edc8ce62a5a4cdcfb82_1588623228.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2faef4b137754edc8ce62a5a4cdcfb82_1588623228.html", "title": "Gov. Ricketts defends University of Nebraska cuts; says state must live within its means", "title_page": "Gov. Ricketts defends University of Nebraska cuts; says state must live within its means", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Gov. Ricketts defends University of Nebraska cuts; says state must live within its means\nLINCOLN - Gov. Pete Ricketts defends his proposed cuts to the University of Nebraska system, even in the face of dire warnings from university officials.\nUniversity officials and supporters warned members of the Appropriations Committee that deep budget cuts could stop its momentum in attracting students and spurring economic growth.\nRicketts declines to directly address the economic argument, stating the money simply isn’t there.\n“At the end of the day, we still have to live within our budget and that’s what every Nebraska family has to do. It’s what every business has to do,” Ricketts tells Nebraska Radio Network in a telephone interview.\nState revenue has failed to meet the forecasts made by the Nebraska Economic Forecasting Advisory Board. The board meets again later this month and could revise its forecasts.\nState tax revenue has exceeded forecasts the past two months. Yet, Ricketts cautions against reading too much into that. He says it will be mid-April when all income taxes are filed, and refunds distributed before a solid assessment can be made about the direction of state revenue.\nDuring his testimony before the Appropriations Committee, NU President Hank Bounds suggested legislators postpone any decision on the university budget until the fall, arguing they would then have a better handle on the direction of the state economy and could go into special session to enact any cuts.\nRicketts doesn’t see that as realistic.\n“I think you can see what happened last year when the Forecasting Board was not accurate with regards to their revenue forecast and we started relying on those forecasts to spend money,” Ricketts says. “It makes it tougher to go back and correct that afterwards.”\nRicketts has kept the Department of Correctional Services off the budget-cutting table. He says he will stick with the current school funding formula. He recommends a 2% across-the-board cut to other state agencies and higher education, followed by a 4% cut in the next fiscal year.\nFor the University of Nebraska that would result in an $11 million cut this year and a $23 million cut next year.\n“Obviously, we’re going to work very hard to live within our means at state agencies and we’re asking other folks to do the same,” Ricketts says.", "url": "https://apnews.com/2faef4b137754edc8ce62a5a4cdcfb82"}