{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:18:22", "date_modify": "2020-05-04 20:18:22", "date_publish": "2018-03-03 00:49:00", "description": "Joe: Toward the end of our last column you asked, \"What exactly is the crime the Mueller investigation is based on?\" One matter I raised was the June 2016 meeting in Trump Tower. When we ended,...", "filename": "_8cddad302e134893bd6e3d26daa149ad_1588623502.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8cddad302e134893bd6e3d26daa149ad_1588623502.html", "title": "Yurgine-Johnston: Is Mueller investigation worth the effort?", "title_page": "Yurgine-Johnston: Is Mueller investigation worth the effort?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Joe: Toward the end of our last column you asked, “What exactly is the crime the Mueller investigation is based on?” One matter I raised was the June 2016 meeting in Trump Tower. When we ended, you were an FBI agent holed up in a closet peering through a peep hole observing the meeting between a female Russian lawyer and individuals from the Trump campaign, trying to determine if probable cause existed to make arrests. So, what happened?\nKen: From his closet peephole in the Trump Tower meeting room, newly badged Special Agent F.N. Guy (his mom called him Fredric Nicholas) watched a half dozen Trump campaign figures, Trump Jr. being the only one he recognized, meet with the Russian lady lawyer. Extremely nervous, the agent thought his heart rate must be ticking at 130, and being as fresh as a flopping tuna, he mentally speculated that, maybe, the bureau might be using him for this job because he was expendable. Trump Jr. spoke softly and the lady had a thick accent making it impossible to know what they were saying, but she opened her briefcase with a flourish and produced a thick sheaf of documents and tossed them on the table. Trump handed her a fat envelope and picked up the documents — that was the signal to pounce. So, he jumped out of the closet holding up his badge and identified himself as Special Agent F.N. Guy. “You’re all under arrest!”\nSeveral FBI agents entered the room at that point, introducing themselves as Agent Deuce, Agent Poet and Agent K. They gathered up the documents as evidence, and took the whole show down to the FBI New York office where they were met by Agent Czrok who took charge, as well as two Trump campaign lawyers. Agent in charge: “Let’s see those documents.” Out of the evidence bag comes the papers. “It’s all in Russian. Cyrillic characters.” Looking at the Russian woman. “Lady, what’s this say?” A Trump lawyer makes universal “zip it” sign; the Russian says nothing. “We need someone who can translate. Anyone? No? Well, Poet, you go find someone in the building, or if not, bring him in from home.”\nPoet returns. “No one still here, but I found a man at home out in Long Island. I sent a chopper for him. About half hour away.”\nWhen the translator arrived, they sat him down and put the documents on the table in front of him. He scanned through several pages and then rapidly flipped through the rest. “Reads like a novel,” he said.\n“You mean there are a lot of lies and fabrications about the Democrat candidate?”\n“Well, not really. I mean it is a novel, the first two chapters of ‘Doctor Zhivago’ in the original Russian.”\n“Oh, boy,” gulped Agent F.N.Guy.\n“Where’s that envelope Trump handed her?” An agent took the envelope out of the evidence bag. The agent in charge slit it open and found a number of folded pieces of copier paper, all blank except for the top page that said, “Thanks very much. I’m learning Russian, and I hear this is a good read.” Signed D J Trump. “Oh, boy,” said Guy again.\nJoe: Somehow while reading your imaginative account of what happened, I felt the air I was breathing to be filled with medicinal marijuana. OK, you bailed from the closet and made arrests. Probable cause found with guilt for election law violations yet to be determined. So, let’s now get serious. I know you are a Trump guy. I know you feel this whole Mueller investigation is a steaming pile of horse manure, a partisan witch hunt, aimed at getting rid of a duly elected president. What is it about the Mueller investigation that you and Trump are afraid of? He’s had a slew of indictments and pleas of guilty (100 criminal counts against 19 people and three companies) with defendants who now are cooperating, probably implicating others. Do you want Mueller to simply shut down the investigation?\nKen: Have you forgotten what you said about the Ken Starr investigation of Bill Clinton? “It’s only sex,” you said. You complained about the cost. WJC, the main target was caught in a perjury by the DNA on the blue dress and lost his law license. Mueller indictments, so far, don’t amount to much in the big picture. The Flynn charges are dicey — lying to FBI, a process crime announced by Mueller after other FBI agents initially gave him a pass. A baker’s dozen Russians, all currently residing in Russia, including Putin Pal Yevgeny Prigozhin? I suspect Puti and Prigi had a laugh and tossed back a vodka toast or two. We all know they will never face a court in America. Manifort and Gates for financial shenanigans committed before Trump was the GOP nominee? And, hell yes, I think Mueller should stick his investigation up his nose and retire without so much as another ham sandwich indicted.\nJoe: With the fate of our nation and fair elections at stake with Russian moles, trolls and meddling, isn’t it a bit much to equate it with Starr’s investigation 10 years ago of Clinton and a woman with a blue dress? What has come out so far from Mueller regarding the individuals who Trump surrounded himself with during his campaign, is money laundering, trying to conceal facts, lying to investigators, shady deals with oligarchs and more misdeeds as shown in the indictments. If these acts are all OK with you, you are becoming soft on crime. Yes, no evidence yet has emerged to incriminate Trump in collusion, but the investigation rolls on. Perhaps, in the end, it will be financial transactions and illegal business dealings with Russia that will do in Trump, which is why he is running scared, condemning and hammering away at the investigation and FBI.\nKen: Cyber world snooping, spying, meddling? They do it, we do it, outcomes aren’t changed. And can you blame Trump for wanting to get rid of the bulldog that’s been clamped onto his pants for a year?", "url": "https://apnews.com/8cddad302e134893bd6e3d26daa149ad"}