{"authors": ["John Eubanks"], "date_download": "2020-05-04 20:03:57", "date_modify": "2020-05-04 20:03:57", "date_publish": "2018-09-28 22:51:35", "description": "“How sweet it is!” What does that phrase bring to mind? Perhaps you thought of a song from the 1960s, “How sweet It Is (To Be Loved By You)” by Marvin Gaye, since recorded by many other artists....", "filename": "_8d700e585b7c40bcac1611201b472f4a_1588622637.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8d700e585b7c40bcac1611201b472f4a_1588622637.html", "title": "When would you say, ‘How sweet it is?”", "title_page": "When would you say, ‘How sweet it is?”", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "“How sweet it is!” What does that phrase bring to mind? Perhaps you thought of a song from the 1960s, “How sweet It Is (To Be Loved By You)” by Marvin Gaye, since recorded by many other artists. Throw in a handful of movies with the same title, possibly some cookbook titles and that might be about all that would come to mind.\nOr maybe you associate the phrase with the late comedian Jackie Gleason (millennials, Google him). It was one of his catchphrases, along with “And awaay we go!”\nAnother connection with this phrase is an old zen story about a tiger and a strawberry. One account attributes it to Buddha. There are some slight variations in the different iterations.\nThe story is about a monk traveling through the wilderness who spies a tiger bearing down on him. He runs to the edge of a nearby precipice. He goes over the ledge and grasps a large vine growing out of the cliff. Far below is either another tiger or jagged rocks, depending on the version. Above is the hot breath of the growling, hungry tiger. Then two mice, one black and one white, appear and begin to gnaw at the vine. As the vine loosens, the monk notices a wild strawberry plant nearby with a bright, plump berry. He reaches out, picks the fruit and eats it, remarking, “How sweet it is!”\nAs in most of these types of stories, the interpretation is left to the reader. One interpretation is that the story is a metaphor for the whole of human existence. Of course, symbolism abounds in this text. The mice are said by many to represent time (day and night). Obviously, since he was able to reach for the berry, the mice must have been just out of the monk’s range!\nSo what does it say to you, if anything? Perhaps you are allergic to strawberries or bored by stories of tigers. What then causes you to pause and think, “How sweet it is!”?\nIs it the infant’s gurgle and coo? Is it the lover’s touch and embrace? Is it the shimmering canopy of the Milky Way, the midnight sun or the aurora borealis? Is it the earthy body of the fruit of the vine, the gastronomic delights of many lands? Is it the vibration of the performers’ chord that strikes deep within and resonates in fullness? Is it the simple patter and freshness of the rain? Is it the colorful, shining, sparkling dance of light? Is it the breath, surging through the body to its inmost parts?\nMaybe you seem to find little, if any, sweetness. I hope that is not the case. My desire is, whatever the circumstances in our last moment of awareness, we can say, “How sweet it is!”\nJohn Eubanks is author of the book “Life Support of Another Sort,” and a former teacher and actor who lives in Converse. He can be reached at joneu62@gmail.com", "url": "https://apnews.com/8d700e585b7c40bcac1611201b472f4a"}