{"authors": ["Kelly Meyerhofer"], "date_download": "2020-05-04 20:07:53", "date_modify": "2020-05-04 20:07:53", "date_publish": "2018-09-15 09:50:00", "description": "A longtime UW-Madison employee who served as an adviser to many journalism students died Wednesday, according to a university announcement. Susan Brandscheid, 70, was a central figure in the...", "filename": "_50b6a5a7f62541398930cae358a427d6_1588622873.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_50b6a5a7f62541398930cae358a427d6_1588622873.html", "title": "Longtime UW-Madison employee and 'unsung hero' of J-school dies", "title_page": "Longtime UW-Madison employee and 'unsung hero' of J-school dies", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A longtime UW-Madison employee who served as an adviser to many journalism students died Wednesday, according to a university announcement .\nSusan Brandscheid, 70, was a central figure in the School of Journalism and Mass Communication where she started working in 1973.\n“People (like Brandscheid) are the unsung heroes of UW,” said UW-Madison journalism professor Lewis Friedland. “Without them, simply nothing would get done.”\nFriedland, who worked with Brandscheid for more than two decades, said she had a “very low tolerance for bureaucracy” and “knew how to cut through it better than anyone I ever met.”\nBrandscheid started working for UW-Madison in 1969 as a typist for University Hospital and the Department of Sociology.\nShe eventually became an adviser to graduate students in the School of Journalism and Mass Communication and worked with hundreds of graduate students, Friedland said.\n“She was sort of an institution within the school herself,” said Robert Drechsel, who worked with Brandscheid as a faculty member for many years. While Drechsel was director of the School of Journalism and Mass Communication in the 1990s, Brandscheid served as his assistant.\n“The school was, in a way, her life,” he said. “It was difficult to go up to the office and not find Susie there.”\nA memorial service is scheduled from 1 to 3 p.m. Tuesday at Cress Funeral Home, 3610 Speedway Road.", "url": "https://apnews.com/50b6a5a7f62541398930cae358a427d6"}