{"authors": ["Jeff Himler"], "date_download": "2020-05-04 20:28:29", "date_modify": "2020-05-04 20:28:29", "date_publish": "2018-01-26 17:34:48", "description": "Westmoreland County's status as the proposed locale for one of Pennsylvania's new mini-casinos is good news for the local tourism industry — making that much sweeter the annual distribution...", "filename": "_9d31505cd159472d866b363e259cf59a_1588624109.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9d31505cd159472d866b363e259cf59a_1588624109.html", "title": "Casino will boost Westmoreland County tourism industry, lodging tax, officials say", "title_page": "Casino will boost Westmoreland County tourism industry, lodging tax, officials say", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Westmoreland County’s status as the proposed locale for one of Pennsylvania’s new mini-casinos is good news for the local tourism industry — making that much sweeter the annual distribution Thursday of tourism grants generated by a county lodging tax.\nThirty-five Westmoreland County tourism-related businesses and organizations received a combined $306,059 in grants during a presentation at The Palace Theatre in Greensburg. That’s a little less than a third of the money requested by this year’s 60 applicants.\nThe mini-casino is “going to have a ripple effect for all of you,” county commission Chairwoman Gina Cerilli told the grant recipients. “We’re going to be able to have more restaurants, more gas stations, more shops, more stores, more visitors coming to your attractions — more people staying in the hotels, getting the hotel tax up, and for us to be able to hand out more money in the coming years.”\nShe said the commissioners are “keeping our fingers crossed” that the proposed casino will come to fruition. “Nothing is official yet, but we are very optimistic and very excited for that.”\nAnn Nemanic, executive director of the Laurel Highlands Visitors Bureau, said visitors annually spend $1.8 billion in the region the bureau serves — Westmoreland, Somerset and Fayette counties. Visitors spent more than $753 million in Westmoreland County in 2015, according to the most recent state studies.\nMany visitors come to the county to enjoy outdoor activities, an appeal reflected in a number of the grant awards.\nWest Newton-based Performance Kayak received a $4,846 grant to promote a new outdoor event — the Youghness Monster 25, a 25-mile kayak and canoe race set for May 5 on a stretch of the Youghiogheny River between Connellsville and West Newton.\n“It’s all in the name. That’s one no one is going to forget,” Nemanic said.\nPerformance Kayak owner Hansel Lucas said kayakers from as far away as Florida, South Dakota and Oklahoma have expressed interest in participating in the Youghness race, featured on the shop’s website.\n“We’ve had several people want to do a flat water race. For a while it had been on our back burner,” Lucas said. “We were finally able to get it together. We had a lot of people chip in as volunteers.”\nThe race will raise funds for the West Newton Volunteer Fire Department. Music and other activities are planned over two days.\nSpectators may choose to follow the river race by biking along the adjacent Great Allegheny Passage trail. The Allegheny Trail Alliance that developed and maintains the trail received an $11,639 grant to support marketing efforts and create an updated trail map and brochure.\nThe Regional Trail Corp. received an $8,640 grant to help operate its visitors center, modeled after a period train station, along the Great Allegheny Passage in West Newton.\nThe trail has drawn bicyclists from about 40 countries for day trips or longer treks between Pittsburgh and Washington, D.C., according to Bryan Perry, executive director of the Allegheny Trail Alliance.\nThe station attracts thousands annually. “We’re a great stop along the way,” said Leslie Pierce, Regional Trail Corp. business manager.\nThe trail has been a boon to economic development in West Newton, she said. “There is a bike shop that wouldn’t be there if it wasn’t for the trail. There are several restaurants. There’s a parklet. It’s really pulled the town up.”\nSince 2003, the county has distributed $4.9 million in tourism grants, funded by a third of the lodging tax proceeds. Commissioner Ted Kopas said the county is working on a long-term plan for the remaining revenue.\nOther grants were approved for marketing efforts. Major awards were made to:\n• Fort Ligonier, which is adding evening tours, $22,500\n• Lincoln Highway Heritage Corridor, which is expanding its Route 30 museum to include a restored diner, $13,994\n• Fort Ligonier Days Inc., $15,000\n• The Palace Theatre, $25,000\n• Westmoreland County Airport Authority air show, $21,500\n• Latshaw Productions, $20,000\n• Westmoreland Museum of American Art, $16,000\n• Westmoreland Arts and Heritage Festival, $14,537\n• Westmoreland Heritage, $19,291\n• Ramada Ligonier, $14,437\n• Caddie Shak, $10,000\nA list of this year’s grant recipients and their projects can be viewed at laurelhighlands.org/grants.\nJeff Himler is a Tribune-Review staff writer. Reach him at 724-836-6622, jhimler@tribweb.com or via Twitter @jhimler_news.", "url": "https://apnews.com/9d31505cd159472d866b363e259cf59a"}