{"authors": ["Emilie Munson"], "date_download": "2020-05-04 20:07:55", "date_modify": "2020-05-04 20:07:55", "date_publish": "2018-04-26 19:51:47", "description": "HARTFORD — By a slim margin, the House gave a thumbs up Thursday to Connecticut joining the National Popular Vote Interstate Compact. If Connecticut joined the interstate agreement, it would...", "filename": "_8689558a02874a1f97e0e0f3a55b5810_1588622875.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8689558a02874a1f97e0e0f3a55b5810_1588622875.html", "title": "National Popular Vote compact narrowly wins House nod", "title_page": "National Popular Vote compact narrowly wins House nod", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HARTFORD — By a slim margin, the House gave a thumbs up Thursday to Connecticut joining the National Popular Vote Interstate Compact.\nIf Connecticut joined the interstate agreement, it would promise to give all seven of its Electoral College votes to the winner of the popular vote in presidential elections. So far 10 other states and the District of Columbia — with a collective 165 electoral votes — have made this promise.\n“In a National Popular Vote scenario, every vote in every state would matter,” said Rep. Daniel Fox, D-Stamford, who led passage of the bill.\n“The people of the United States of America should elect directly the president of the United States of America,” said Rep. Bob Godfrey, D-Danbury. “The whole point of this is to remove state influence and return power of the people.”\nSome 73 House member voted against the idea, including three Democrats Patrick Boyd of Pomfret, Daniel Rovero of Dayville, and Christopher Ziogas of Bristol. 77 House members voted in favor, all Democrats joined by Republican Livvy Floren of Greenwich.\n“I have supported one person/one vote since my college days at Vassar, and I do not consider it a Republican or Democrat, nor a liberal or conservative, idea,” Floren said. “In order to encourage civic engagement in the political process while maintaining the sanctity of each and every vote, I believe NPV is an idea whose time has come.”\nThe bill, which the General Assembly has discussed for the past 11 years, will now pass to the Senate for approval. But even if it wins their nod, the compact will not be activated until states with a combined total of 270 electoral votes — a majority of the Electoral College — sign on.\nHouse Republicans called it a “gimmick,” “end run” and “ingenious scheme.” If people want to dismantle the Electoral College, it should be done through a Constitutional amendment, they said.\n“Our United States government is organized as a republic; it is not a pure democracy,” said Rep. Laura Devlin, R-Fairfield. “Today I suggest we keep the republic and reject this bill.”\nOther Republicans worried that Connecticut residents would be disenfranchised if they did not vote like the majority of other Americans. They also expressed concerns about ceding power to to larger states.\nTo join this agreement would be to “act like a bunch of lemmings and follow somebody right off a cliff,” said Rep. Mitch Bolinsky, R-Newtown. “What it does is erode the influence of Connecticut.”\n“The impetus for this is the sour grapes from losing the 2016 election,” said Rep. David Labriola, R-Oxford.\nSecretary of the State Denise Merrill, who oversees Connecticut elections, applauded the House’s up vote Thursday.\n“From Board of Education to Governor of Connecticut to United States Senator, in every election the candidate who gets the most votes wins - except for the highest office in the land, the election for the President of the United States,” she said.\nThe bill passed the Government Administration and Elections Committee with the support of Democrats but not one vote from Republicans. A procedural tactic used by the committee means the Senate will need a special motion to the take up the bill — another potential hurdle to passage in a chamber that is split 18-18.\n“I fully reject the notion that the citizens of America in 2018 cannot be trusted to directly elect their president,” said Senate President Pro Tempore Martin Looney, D-New Haven, in February.\nSen. Michael McLachlan, R-Danbury, chairman of the elections Committee, said in February the compact would weaken voters’ voices because the state’s Electoral College votes would go to the winner of the popular vote regardless of whether Connecticut voters support the candidate.\n“If we do away with the Electoral College, Connecticut voters may as well avoid going to the polls on Election Day, because someone else will be making the decision for them,” he said.\nemunson@hearstmediact.com; Twitter: @emiliemunson", "url": "https://apnews.com/8689558a02874a1f97e0e0f3a55b5810"}