{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:14:58", "date_modify": "2020-05-04 20:14:58", "date_publish": "2018-04-20 17:01:24", "description": "SANTA MONICA, Calif.--(BUSINESS WIRE)--Apr 20, 2018--The Call of Duty® World League, Presented by PlayStation®4, brings competitive Call of Duty®: WWII action to Seattle for the first time this...", "filename": "_9e696c83f16349b582c65fcc3cb09e5d_1588623298.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9e696c83f16349b582c65fcc3cb09e5d_1588623298.html", "title": "Call of Duty® World League, Presented by PlayStation®4, Makes Seattle Debut April 20-22", "title_page": "Call of Duty® World League, Presented by PlayStation®4, Makes Seattle Debut April 20-22", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SANTA MONICA, Calif.--(BUSINESS WIRE)--Apr 20, 2018--The Call of Duty® World League, Presented by PlayStation®4, brings competitive Call of Duty®: WWII action to Seattle for the first time this week, as over 120 Call of Duty esports teams are set to compete April 20-22, 2018. Squads from around the world will square-off for their shot at glory and prizing during this record setting season of the CWL and its $4.2 million overall season-long prize purse. The action begins today and culminates with the event championship on Sunday, with $200,000 in event pool prizing up for grabs at the CenturyLink Field Event Center.\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20180420005609/en/\n\"The Call of Duty World League is excited to bring our record setting season to Seattle for the first time, allowing spectators to witness the best teams from around the world go head to head in Call of Duty: WWII. Participation in the CWL has never been higher and with so many skilled teams expected to be in attendance, we anticipate fierce competition as they inch closer to earning a spot at the 2018 CWL Championship this summer. Visiting new regions can introduce us to new players, so we’re excited to see what competitors from the Pacific Northwest can bring to the CenturyLink Field Event Center this weekend,\" said Call of Duty Esports Director, Kevin Flynn.\nFans can watch the broadcast action online at MLG.com/CallofDuty and Twitch.tv/CallofDuty. Matches will also be available to watch on PlayStation®4 via the in-game Call of Duty®: WWII theater.\nCWL Seattle Open tickets are available in multiple varieties, while supplies last. General admission passes for the event are available for $59.99 (plus applicable fees and taxes). A Premium Pass for the event is also available for $89.99 (plus applicable fees and taxes) and includes an event t-shirt and one month of MLG GameBattles Premium. A $299.99 (plus applicable fees and taxes) Prestige Pass is also available and includes an event t-shirt, event jacket, one-hour early entrance to the venue, access to the Prestige Lounge and more. For tickets, visit MLG.com/CWLSeattle.\nTeams in Seattle will compete in the open competition for their chance to earn one of four spots in the event pool. Those four remaining teams from the open bracket will then join twelve pre-qualified teams to compete for their share of the $200,000 event prize pool at stake this weekend.\nHere are the twelve teams who have already qualified for pool bracket play this weekend:\nYesterday, a Relegation tournament featuring eight elite teams took place to determine the four teams to qualify for Stage 2 of the CWL Pro League. Mindfreak, Evil Geniuses, Epsilon, and Tainted Minds were the eventual winners of the relegation tournament, also earning them a spot in the CWL Seattle Open pool bracket. The nine-week CWL Pro League Stage 2 series begins May 15, 2018 at the MLG Arena in Columbus, Ohio, and concludes with a playoff series featuring a $500,000 event prize pool.\nVisit CallofDuty.com/esports and follow the Call of Duty World League on Twitter and Instagram for the latest CWL updates. For live broadcasts and Video on Demand, visit MLG.com/CallofDuty.\nAbout Activision Publishing, Inc.\nHeadquartered in Santa Monica, California, Activision Publishing, Inc. is a leading global producer and publisher of interactive entertainment. Activision maintains operations throughout the world and is a division of Activision Blizzard, Inc. (NASDAQ: ATVI), an S&P 500 company. More information about Activision and its products can be found on the company’s website, www.activision.com or by following @Activision.\nCautionary Note Regarding Forward-looking Statements: Information in this press release that involves Activision Publishing’s expectations, plans, intentions or strategies regarding the future, including statements about the expected dates and features of the CWL Seattle Open, CWL Championship 2018 and CWL Pro League Stage 2 and the features of the Call of Duty World League, are forward-looking statements, that are not facts and involve a number of risks and uncertainties. Factors that could cause Activision Publishing’s actual future results to differ materially from those expressed in the forward-looking statements set forth in this release include unanticipated product delays and other factors identified in the risk factors sections of Activision Blizzard’s most recent annual report on Form 10-K and any subsequent quarterly reports on Form 10-Q. The forward-looking statements in this release are based upon information available to Activision Publishing and Activision Blizzard as of the date of this release, and neither Activision Publishing nor Activision Blizzard assumes any obligation to update any such forward-looking statements. Forward-looking statements believed to be true when made may ultimately prove to be incorrect. These statements are not guarantees of the future performance of Activision Publishing or Activision Blizzard and are subject to risks, uncertainties and other factors, some of which are beyond its control and may cause actual results to differ materially from current expectations.\n© 2018 Major League Gaming Corp. ACTIVISION, CALL OF DUTY and CALL OF DUTY WWII are trademarks of Activision Publishing, Inc. MAJOR LEAGUE GAMING is a trademark of Major League Gaming Corp. All other trademarks and trade names are the properties of their respective owners.\nView source version on businesswire.com:https://www.businesswire.com/news/home/20180420005609/en/\nCONTACT: Call of Duty World League\nXav de Matos\nPR Manager\nxdematos@mlg.tv\nKEYWORD: UNITED STATES NORTH AMERICA CALIFORNIA WASHINGTON\nINDUSTRY KEYWORD: ENTERTAINMENT ELECTRONIC GAMES TECHNOLOGY CONSUMER ELECTRONICS OTHER TECHNOLOGY TEENS CONSUMER\nSOURCE: Activision Publishing, Inc.\nCopyright Business Wire 2018.\nPUB: 04/20/2018 01:00 PM/DISC: 04/20/2018 01:01 PM\nhttp://www.businesswire.com/news/home/20180420005609/en", "url": "https://apnews.com/9e696c83f16349b582c65fcc3cb09e5d"}