{"authors": ["Melanie Feuk"], "date_download": "2020-05-04 20:07:39", "date_modify": "2020-05-04 20:07:39", "date_publish": "2018-08-03 05:00:00", "description": "A new local barbecue restaurant will be coming to Kingwood early next year. Fire Craft BBQ has already broken ground at their plot on Loop 494 next to Nico’s Bar and Grill. The design...", "filename": "_d37fffd04ac54664b04b469cd20367d0_1588622859.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d37fffd04ac54664b04b469cd20367d0_1588622859.html", "title": "Kingwood chef plans Fire Craft BBQ on Loop 494 in 2019", "title_page": "Kingwood chef plans Fire Craft BBQ on Loop 494 in 2019", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A new local barbecue restaurant will be coming to Kingwood early next year.\nFire Craft BBQ has already broken ground at their plot on Loop 494 next to Nico’s Bar and Grill.\nThe design and architectural work, conducted by Studio M6 Architects, is complete.\nFire Craft owner and chef David Welch said they are waiting on a permit to pour the slab and parking lot, after which CGL Contracting Services will begin construction on the approximately 4,000 square foot building, which is projected to cost $1.2 million to construct.\n“It will be a contemporary farmhouse-style restaurant,” Welch said. “It has a similar design as a church. It’s a big, long room with a high ceiling with exposed tresses, windows and two patios.”\nThe south side patio will be a kids’ area with interactive games and picnic tables.\nOn the back side of the property there will be a wine and beer garden as well as outdoor cooking and rotisserie. An outdoor stage will host live entertainment.\nWelch said Fire Craft BBQ will cook their barbecue overnight to serve for lunch the following day. At night, the restaurant will transition into more of a small-plate restaurant with food options such as tamales and nachos.\n“You’ll still be able to get some things off the barbecue menu of course, but at night, I want people to be able to come in and buy fresh oysters grilled over oak with your choice of topping, whether it’s a chipotle butter, some lemon garlic parmesan, maybe a Latin flavor and you can order them a la carte,” Welch said. “If you want to order two or three at a time, or half-a-dozen, or whatever. I’ll sell you one slice of something. Everything’s going to be sold by the pound.”\nIn addition to barbecue and small plate items, Fire Craft will have a few salad options and deserts. Another aspect of the restaurant includes a deli area where people can purchase various food items like smoked cheeses, meats, pickles and sauce to create their own catering trays at home.\nFire Craft BBQ has been operating as a catering business up to this point and will continue offering that service when the restaurant opens.\n“We’ll do a lot of catering,” Welch said. “We’ll do office parties and event planning also.”\nWelch describes his barbecue as a craft product that follows the early Texas traditional style.\n“I really started looking back, like how did barbecue get to Texas,” Welch said. “For example, my barbecue sauce is a mustard sauce. There’s no ketchup in it. It’s red because it’s got a lot of chilies. It’s basically a Mexican base with Czechoslovakian influence with the mustard. The Germans and Czechs were the ones that brought that kind of stuff over, so that’s kind of the tradition I follow — that really early Texas tradition.”\nWelch was a classically trained French chef and has worked with a variety of cuisine, but said about six years ago, he got bit by the barbecue bug. He looks forward to operating his own restaurant and providing the community with a unique culinary experience.\n“I really worked for some incredible places and that allowed to pick up a lot of things that stuck with me that I really want to do and the only way to do that is to have your own place,” Welch said. “I’ve got the experience and I’ve learned from some great mentors. I know what to do and what not to do. We’re really going to try to excel.”\nOnce the parking lot is finished, Welch plans to start doing pop-up restaurants while the building is under construction. He also plans to host some pre-opening events. More details will be made available closer to the restaurant’s completion.\nmfeuk@hcnonline.com", "url": "https://apnews.com/d37fffd04ac54664b04b469cd20367d0"}