{"authors": ["Steve Mocarsky"], "date_download": "2020-05-04 20:09:37", "date_modify": "2020-05-04 20:09:37", "date_publish": "2018-05-24 00:00:00", "description": "WILKES-BARRE — City officials have chosen a contractor for the first phase of the Solomon Creek flood wall replacement project, and they expect construction will begin next month. Popple...", "filename": "_cff77181878047f8ac7d1e82a45ceca0_1588622977.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cff77181878047f8ac7d1e82a45ceca0_1588622977.html", "title": "Work To Get Underway Soon In Solomon Creek Project", "title_page": "Work To Get Underway Soon In Solomon Creek Project", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WILKES-BARRE — City officials have chosen a contractor for the first phase of the Solomon Creek flood wall replacement project, and they expect construction will begin next month.\nPopple Construction, based in Laflin, was the lowest responsible bidder for the long-awaited project at $1,548,448, according to Joyce Zaykowski, director of the city Department of Economic and Community Development.\nZaykowski on Wednesday said the city has issued Popple a notice of award, but company officials must first produce some additional bank documents related to performance bonds before a contract is signed.\nShe expects those documents to be provided sometime next week, when company and city officials have a pre-construction meeting and decide on a specific date for launching construction.\n“We hope they’re ready to start by mid-June,” Zaykowski said, adding that she expects work will be complete within five to six months of the start date.\nThe first phase of the project calls for replacement of about 600 feet of flood wall along Brook Street between Waller and South Franklin streets. The wall was built in the 1930s.\nConstruction will begin at Brook and Waller streets and progress east toward South Franklin Street.\nThe second phase of the project includes construction of a pump station at a location in the neighborhood yet to be determined, and it is expected to take about three months. That phase is now in the engineering stage, and Zaykowski expects it will be put out for bid around the time the first phase is completed.\nPlans to repair the flood wall were in the works for several years, but they were pushed up after a 40-foot section of wall between Waller and Barney streets collapsed Dec. 9, 2016. Temporary repairs have been in place since then.\nBids for the first phase of the project were due May 4. Zaykowski said she had hoped the bid would be awarded sooner, but “we did some very extensive comparing of bids” because of the significance and scope of the project.\nOver the past 16 months, the city has secured $6 million in state grants for the project in addition to $4 million the city secured in a bond refinancing and borrowing.\nThe flood wall protects about 700 homes in South Wilkes-Barre. Mayor Tony George has said replacement of the wall has always been the top priority of his administration.\nContact the writer:\nsmocarsky@citizensvoice.com\n570-821-2110, @MocarskyCV", "url": "https://apnews.com/cff77181878047f8ac7d1e82a45ceca0"}