{"authors": ["Hal Kurfehs"], "date_download": "2020-05-04 20:11:23", "date_modify": "2020-05-04 20:11:23", "date_publish": "2018-03-19 17:35:38", "description": "Will government be able to turn-around the fiscal problems in Connecticut? Would the application of business methods help to provide economic growth? This is a debate that is being waged in our...", "filename": "_ad41761a3cee4ba89289616d89b7af8a_1588623083.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ad41761a3cee4ba89289616d89b7af8a_1588623083.html", "title": "Hal Kurfehs: Government and business - strengths and strains", "title_page": "Hal Kurfehs: Government and business — strengths and strains", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Will government be able to turn-around the fiscal problems in Connecticut? Would the application of business methods help to provide economic growth? This is a debate that is being waged in our state.\nBecause of my involvement in both business and government, I am familiar with both camps. On the business side I have an MBA from Wharton and was in corporate management for many years, then as an entrepreneur, and now in Commercial Real Estate. For the last 20+ years I have also concurrently been involved on the government side in various elected and appointed volunteer positions, mainly in economic development and land use, on a local, regional, and state basis.\nGovernment and business definitely have different roles, strengths, and weaknesses in making our social and economic system work. Government does many things that business would not even consider doing under normal circumstances, like running an education system, providing social services and a safety net, policing and fire control, infrastructure, including roads and bridges, health and safety, and so on. I say “under normal circumstances” because there have been movements to privatize some of these functions or to establish public-private partnerships to conduct some of these operations more efficiently.\nBusiness takes a product or service and systematically produces an organization that will efficiently and successfully move that effort to the marketplace. The operative word here is “efficiency.” If the production, financial, and marketing efforts are not efficient enough to achieve the organization’s goals while making an acceptable profit, there will be plant closings, layoffs and perhaps even bankruptcy.\nGovernment has no such restraints. If the budget is exceeded or revenues falter, government can always go to the well and extract more taxes. So the trick should be to budget realistically on the basis of desired outcomes, a concept in our state that the Connecticut Economic Resource Center has been vigorously proposing.\nThe problem is that politicians find it easy to hand out largesse because it guarantees their re-election. Programs keep getting added without an overall plan as to necessity or affordability. But not to worry because there are a myriad of taxes, fees, and levies of one sort or another to solve the shortfall. Efficiency? No need to worry about that.\nEventually, however, the chickens come back to roost. Our state is now near the bottom nationally in terms of friendliness to business, and has a steady loss of productive population. The budget excesses, the burdensome per capita debt, the three credit downgrades, the tax increases, the high cost of living and doing business, the inability to reform government labor and benefits, and the departure of GE and others cannot be ignored.\nLast summer my article “Let’s Get Connecticut Back on Track” presented my recommendations for an eight-point program to start to turn Connecticut’s economy around. People who agreed with that program outline nevertheless bemoaned the fact that nobody is listening.\nGetting back to the question of government efficiency, there have been a number of statistics bandied about that will dramatically illustrate the scope of the problem:\n1) Connecticut spends $477,875 per mile of road; the national average is only $160,997 per mile. What’s more, our administrative costs for transportation are $83,282 per mile of road versus a national average of $10,000.\n2) On a per capita basis, Connecticut has 22 percent more government employees than neighboring Massachusetts and 26 percent more government employees than New York.\n3) Even though many state government employees now earn more than they would in the private sector, they still enjoy direct pension plans rather than 401(K)s and more generous medical coverage than the private sector.\nUnfortunately, the reforms that would be needed to make state government more efficient will be difficult at best because long-term union employment contract benefits were locked in for 10 years as a quid pro quo for short-term salary concessions of dubious value. This is an important consideration because close to 50 percent of our budget goes to pensions, Other Post-Employment Benefits (OPEB), debt service and overhead.\nThere is perhaps a glimmer of hope with the blue-ribbon Commission on Fiscal Sustainability and Economic Growth, which just presented its recommendations to the Legislature. Hopefully our legislators will listen, take the recommendations seriously, and start the process to recovery.\nHarold “Hal” Kurfehs, a Brookfield resident, is vice president, Coldwell Banker Commercial, Scalzo Group, in Bethel.", "url": "https://apnews.com/ad41761a3cee4ba89289616d89b7af8a"}