{"authors": ["Rachel Dissell", "The Plain Dealer"], "date_download": "2020-05-04 20:15:29", "date_modify": "2020-05-04 20:15:29", "date_publish": "2018-03-23 14:46:58", "description": "At least one suspect committed another rape among 60 cases Cleveland detective failed to fully investigate, internal report says Cleveland, Ohio — A Cleveland police internal investigation...", "filename": "_6ff08f062ab54baebfb00d302eb47dd6_1588623329.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6ff08f062ab54baebfb00d302eb47dd6_1588623329.html", "title": "At least one suspect committed another rape among 60 cases Cleveland detective failed to fully investigate, internal report says", "title_page": "At least one suspect committed another rape among 60 cases Cleveland detective failed to fully investigate, internal report says", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "At least one suspect committed another rape among 60 cases Cleveland detective failed to fully investigate, internal report says\nAt least one suspect committed another rape among 60 cases Cleveland detective failed to fully investigate, internal report says\nCleveland, Ohio — A Cleveland police internal investigation into more than 60 sex crimes and child abuse cases that went largely uninvestigated, some for two years, revealed frustrated victims and at least one suspect who raped again.\nThe more than 250-page file includes recorded interviews with several victims who were upset about cases they reported in 2014 that were not followed up on by then-Det. Tom Ross.\nThis story is developing. Check back to cleveland.com for updates.\nOne woman said she sought mental health help because of the incident. Another filed a lawsuit against the city. A third told an internal affairs investigator, “You got somebody working for you that really don’t care.”\nOne of the victims reported to police in June 2014 that a neighbor knocked her out of her wheelchair and raped her. Ross did some investigation on the case and a city prosecutor said they case should be referred to a Grand Jury. But that didn’t happen.\nThe suspect in that case, Wilberto Santos Gonzalez, was charged with another rape months later and arrested by Bedford police and later sentenced to two decades in prison.\nThe first victim died before the investigation into her rape was completed.\nThe incomplete or uninvestigated cases investigations in the report also included:\nA case where the suspect, an East Cleveland police officer working a security job, was accused of showing a store clerk a photo of his penis and making lewd remarks.\nA case involving a 7-year-old boy who reported he was sexually assaulted by another student in his school.\nAt least three cases where evidence testing yielded possible suspect DNA that was not followed up on.\nA case involving a juvenile suspect who was not arrested and later connected to a robbery.\nThe Plain Dealer has reached out to Cleveland police and city officials for comment and has not yet received a reply.\nInternal affairs investigator Sgt. Jason Steckle shared his findings with the Cuyahoga County Prosecutor’s office in 2016. Assistant County Prosecutor Matt Meyer told Steckle that enough evidence existed to charge Ross with “dereliction of duty” but that since that crime was a misdemeanor the county wouldn’t prosecute, according to the file. Meyer said then-Prosecutor Tim McGinty reviewed the file and agreed with the decision.\nAfter that, the city asked an Akron prosecutor to review the investigation.\nIn an April 2017 letter, Akron Deputy Chief Prosecutor Craig Morgan said probable cause existed to charge Ross with dereliction of duty, but he was “unconvinced that any such prosecution would result in a conviction.”\nEarlier this month, Ross was demoted from his current rank as sergeant in the Third District’s Downtown Service unit. He plans to appeal that decision.\nTwo sex crimes unit supervisors also were disciplined. Sgt. Anthony McMahan was suspended for 15 days and Commander James McPike was demoted to the rank of captain. The city found both neglected their duties in supervising Ross and following up to make sure the cases were handled properly despite the victim complaints.\nThe file contains interviews with McPike and McMahan in which both said they were unable to adequately supervise the unit because of extreme understaffing, in some cases where they had to handle the jobs of multiple supervisors for months at a time.\nEarlier this month, Mayor Frank Jackson and Chief Calvin Williams said understaffing did not cause the problem that warranted the discipline.\n“It’s been said staffing is an issue, staffing is always an issue,” Williams said at a press conference. ”...In this particular case, there were things that happened that had nothing to do with staffing. There were things that happened in this case that shouldn’t have happened.”\nRead more about chronic problems in the sex crimes unit\nIn a May 2016 memo, included in the file, McMahan writes to a captain that detectives in the unit have high numbers of open investigations and that victims were complaining and asking if their cases could be reassigned. “These cases are piling up at an alarming rate,” McMahan wrote.\nMcMahan had written a similar memo pleading for additional detectives six months earlier. That memo also raised concerns about not having enough detectives to adequately investigate domestic violence cases.\nMcMahan wrote: “With the number of domestic violence cases on the rise, I feel our ability to safely and thoroughly investigate these cases will be compromised. As well our ability to investigate sexual assaults in a timely manner, potentially preventing an offender from striking again.”\nThe memos also pointed out that Sex Crimes had only three working cars for 13 detectives to use that that two other vehicles had been scrapped, forcing them to borrow cars from other units.\nMcPike also told investigators he was handling multiple jobs supervising the domestic violence and sex crimes units and told investigators that during a promotional interview he directly raised his concerns with Chief Calvin Williams. He said Williams acknowledged the concerns but McPike was not sure he understood what he was conveying.\nRoss, in his interview with investigators, said he fooled himself into thinking he could do two jobs when he offered to take his incomplete cases with him after being promoted in 2015 to the rank of sergeant. He also said he wanted to save himself from embarrassment and to prevent his colleagues from having to do his work.\nThe files show Ross had fallen behind on investigations quickly after entering the sex crimes and child abuse unit in 2012 and at one point was put on a work plan to catch up with the workload, in part, because of the volume of cases and also because he spent time doing ceremonial unit duties and work for the police union, according to his supervisors.", "url": "https://apnews.com/6ff08f062ab54baebfb00d302eb47dd6"}