{"authors": ["Jofawcett", "Staff Writer"], "date_download": "2020-05-04 20:32:01", "date_modify": "2020-05-04 20:32:01", "date_publish": "2018-02-19 00:00:00", "description": "BOYS CLASS 6A ■ DATES: Saturday, semifinals; March 3, 8 p.m. final at Mohegan Sun Arena ■ ADVANCE TO STATES: 1 ■ DEFENDING CHAMPION: Williamsport (Subregional); Hazleton Area (District 2) ■ TOP...", "filename": "_33f471962ee34fe8ac6853ec886a6725_1588624321.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_33f471962ee34fe8ac6853ec886a6725_1588624321.html", "title": "HS BASKETBALL: DISTRICT 2 CAPSULES", "title_page": "HS BASKETBALL: DISTRICT 2 CAPSULES", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BOYS CLASS 6A ■ DATES: Saturday, semifinals; March 3, 8 p.m. final at Mohegan Sun Arena ■ ADVANCE TO STATES: 1 ■ DEFENDING CHAMPION: Williamsport (Subregional); Hazleton Area (District 2) ■ TOP SEEDS: 1-Hazleton Area; 2-Scranton; 3-Williamsport (District 4); 4-Delaware Valley ■ PLAYERS TO WATCH: Ky’Ron Harbin, SCR, 17.6 points per game; Josh Samec, HAZ, 15.4; Jeffrey Planutis, HAZ, 15; Blake Gearhart, DV, 14.8; Da’Mir Faison, HAZ, 12.8; Joey Grula, HAZ, 12.3; Robbie McAndrew, SCR, 10.9; Marcus Bauman, SCR, 9.3; Jackson Shafer, DV, 7.7; Zach Klapak, DV, 7.3 ■ DIFFERENCE MAKER: Scranton’s Ky’Ron Harbin might be the best talent in the district. When he plays at his best, he is lightning quick to the basket and can soar for dunks and rebounds. ■ FAVORITE: Hazleton Area has been ranked in the Class 6A top 10 in the state all season by City of Basketball Love website. Very talented team. ■ SLEEPER TEAM: Scranton. The semifinal game against Williamsport should be one of the more exciting of the early rounds. There will be a lot of athletes on the court. ■ BOTTOM LINE: Hazleton Area has been motivated all season by its 64-56 loss to Williamsport in the subregional final. The Cougars have the most balance and are determined to win the title. BOYS CLASS 5A ■ DATES: Tuesday, quarterfinals; Friday, semifinals; March, 2, 8 p.m. final at Mohegan Sun Arena ■ ADVANCE TO STATES: 2 ■ DEFENDING CHAMPION: Abington Heights ■ TOP SEEDS: 1-Abington Heights, 2-Dallas, 3-Crestwood, 4-Wallenpaupack ■ PLAYERS TO WATCH: Draig Ruff, WVW, 26.5; George Tinsley, AH, 17.8; Jackson Danzig, AH, 17.4; Joey Parsons, DAL, 16.9; Shayne Merrifield, WS, 14.5; Josh Hart, WS, 14.0; Elijah Rosenthal, WAL, 13.5; Mike Palmiero, CRE, 11.9; Camden Boris, CRE, 11.7; Naseem Guillauame, PA, 11.1; Gabe Springer, WAL, 10.1 ■ DIFFERENCE MAKER: Jackson Danzig came of age during last season’s state playoffs and he hasn’t slowed down. He is an explosive player who scored more than 1,000 points in his career. ■ FAVORITE: Abington Heights. The Comets are back and, while not 100 percent, they are an outstanding team. They have won six straight District 2 championships. They have won five games against teams in the tournament by an average of 27.0 points. ■ SLEEPER TEAM: West Scranton. The Invaders reached the district final last season and would need a lot more of that magic to have that big an impact this season. However, they took Williamsport to the wire in the regular-season finale. ■ BOTTOM LINE: Abington Heights is the overwhelming favorite. Head coach Ken Bianchi won his 758th game this season and just kept going. Dallas has some quality wins this season and could be a threat. BOYS CLASS 4A ■ DATES: Wednesday, quarterfinals; Saturday, semifinals; March 3, 4 p.m. at Mohegan Sun Arena ■ ADVANCE TO STATES: 3 ■ DEFENDING CHAMPION: Scranton Prep ■ TOP SEEDS: 1-Scranton Prep; 2-Nanticoke; 3-Valley View; 4-Wyoming Area. ■ PLAYERS TO WATCH: Will Johnson, GAR, 21.0; Sam Greenfield, WA, 20.4; Leo O’Boyle, SP, 19.9; Nate Kreitzer, NAN, 18.9; Tyler Faux, TUN, 17.6; Marc Kudrich, VV, 15.6; Khairi Carson, GAR, 15.3; Trahjan Krupinski, NAN, 14.9; Anthony Hawk, GAR, 12.8; Sean Harder, TUN, 12.4; Wes Simons, SP, 12.0; Bobby Craig, VV, 8.7 ■ DIFFERENCE MAKER: Nate Kreitzer, Nanticoke is a clutch player who has ice-water in his veins. In a late-season game against Tunkhannock, he hit a buzzer-beater at the half and a half-court shot to force overtime. ■ FAVORITE: Scranton Prep. The Cavaliers have firepower and experience on their side. But there are still memories of last season’s semifinal when Nanticoke took a big lead before a late rally put Scranton Prep into the final. ■ SLEEPER TEAM: Tunkhannock. The Tigers have an outstanding ball-handler and scorer in Sean Harder and Tyler Faux has emerged as one of the top players in the Wyoming Valley Conference. ■ BOTTOM LINE: On paper this appears to be the tightest overall bracket. Valley View, the No. 3 seed, has a win over Scranton Prep. Tunkhannock, the No. 6, seed has a win over Nanticoke. GAR, the No. 8 seed, reached the district final last season and went to overtime against rival Meyers, the No. 7, seed Thursday. BOYS CLASS 3A ■ DATES: Tuesday, quarterfinals; Friday, semifinals; March 1, 8 p.m., final at Mohegan Sun Arena ■ ADVANCE TO STATES: 2 ■ DEFENDING CHAMPION: Holy Redeemer ■ TOP SEEDS: 1-Wyoming Seminary; 2-Holy Redeemer; 3-Mid Valley; 4-Dunmore ■ PLAYERS TO WATCH: Dimitri Gnall, SEM, 16.8; Collin Cook, HR, 14.4; J.J. Glinsky, MV, 14.0; Nick Prociak, HR, 13.2; Bobby Salitsky, CAR, 13.1; Brennan Gilhool, MON, 11.9; Evan Carrubba, RIV, 11.6; James Lewis, LAK, 11.5; Daniel Walsh, DUN, 11.4; Jacob Peck, MON, 11.2; Michael Rickert, RIV, 10.8; Nicholas Ganter, SEM, 10.7 ■ DIFFERENCE MAKER: Mid Valley’s J.J. Glinsky. He is in his third season as a starter and played on the big stage at Mohegan Sun Arena last season. He is a versatile player at both ends of the court. ■ FAVORITE: Wyoming Seminary, but only slightly over Holy Redeemer. Wyoming Seminary defeated the Royals, 58-51, on Feb. 6 and, 46-41, on Jan. 19. Holy Redeemer will embrace the role of underdog and will play with more energy as the reigning champs. ■ SLEEPER TEAM: Carbondale Area. The Chargers played well in the second half of the Lackawanna Division III season, and gave Holy Cross a good challenge in the regular-season finale. ■ BOTTOM LINE: Wyoming Seminary has had a heck of a season. However, the Blue Knights lost their regular-season finale to Hanover Area. With two wins already over Holy Redeemer, they are the favorite. BOYS CLASS 2A ■ DATES: Wednesday, quarterfinals; Saturday, semifinals; March 3, 2 p.m., final at Mohegan Sun Arena ■ ADVANCE TO STATES: 2 ■ DEFENDING CHAMPION: Holy Cross ■ TOP SEEDS: 1-Holy Cross; 2-Elk Lake; 3-Northwest Area; 4-Old Forge ■ PLAYERS TO WATCH: Rierdan Reyan, EL, 19.0; Sam Saxe, NW, 14.3; Kyle Streich, MV, 14.0; Dakota Knehr-Cook, FC, 13.4; Patrick Galvin, HC, 12.9; Jaxson Yaple, NW, 12.0; Joey Verespey, OF, 11.4; Kieran Burrier, HC, 11.2; Sam Cosmello, BR, 11.2; Shawn Jones, LT, 10.9; Alex Showalter, MV, 10.6; Brandon Nee, OF, 10.5; Jordan Non, FC, 10.5; Mikey Schermerhorn, MV, 10.4; Tyler Mozeleski, HC, 10.3 ■ DIFFERENCE MAKER: Patrick Galvin has matured physically and mentally, and developed from a 3-point specialist into an impact player for Holy Cross. He plays with passion and intensity on defense and is a complete offensive weapon. ■ FAVORITE: Holy Cross is the overwhelming favorite. The Crusaders, however, won’t forget that semifinal loss to Elk Lake two seasons ago. They also went 4-0 against teams in the bracket, beating Blue Ridge and Old Forge each twice. ■ SLEEPER TEAM: Elk Lake. The Warriors battled in the Lackawanna Division IV and Reyan has enough scoring punch to make them a factor. ■ BOTTOM LINE: This is Holy Cross’ title to lose. ... Again. The Crusaders are playing the best basketball of their season, having won 14 straight games. BOYS CLASS 1A ■ DATES: Thursday, quarterfinals; Monday, semifinals; March 2, final, 2 p.m. (only if Susquehanna does not reach subregional final) ■ ADVANCE TO STATES: 1 ■ DEFENDING CHAMPION: Lincoln Leadership (Subregional); Susquehanna (District 2) ■ TOP SEEDS: 1-Susquehanna; 2-Tri-Valley; 3-Nativity BVM; 4-Notre Dame (East Stroudsburg) ■ PLAYERS TO WATCH: Mason Deakin, SUS, 15.4; Bryce Baldwin, SUS, 12.9; Adam Rockwell, SUS, 7 ■ DIFFERENCE MAKER: Mason Deakin has become the go-to player for the Sabers. ■ FAVORITE: Susquehanna. It’s hard to say without having a firm grip on the District 11 teams. ■ SLEEPER TEAM: Nativity BVM has two wins over second-seeded Tri-Valley this season. ■ BOTTOM LINE: Susquehanna has had an amazing season, winning its first Lackawanna League division championship. However, the Sabers’ matchup against this field is a big question mark. Last season, they lost in the first round to Salem Christian, however that loss has been a big motivating factor this season. — JOBY FAWCETT", "url": "https://apnews.com/33f471962ee34fe8ac6853ec886a6725"}