{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:13:40", "date_modify": "2020-05-04 20:13:40", "date_publish": "2018-08-14 17:00:00", "description": "August is National Immunization Awareness Month and serves as a reminder that Northwest Georgians of all ages require timely vaccinations to protect their health. “Vaccinations are our best...", "filename": "_dfa004c0cac84d349207b05aa34b0dc2_1588623220.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dfa004c0cac84d349207b05aa34b0dc2_1588623220.html", "title": "Get vaccinated today, protect family", "title_page": "Get vaccinated today, protect family", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "August is National Immunization Awareness Month and serves as a reminder that Northwest Georgians of all ages require timely vaccinations to protect their health.\n“Vaccinations are our best defense against vaccine-preventable diseases,” said Janet Eberhart, immunizations coordinator for the ten-county public health district. “This National Immunization Awareness Month, we urge parents to think ahead and get themselves and their families up to date on their vaccinations, especially those required school vaccinations.”\nEvery adult in Georgia (19 years of age and older) should follow the recommended immunization schedule by age and medical condition. Vaccinations protect you and they protect others around you; especially infants and those individuals who are unable to be immunized or who have weakened immune systems.\nIt is always a good idea to have the adult vaccine schedule nearby as a reference and to make sure you are current on your immunizations. See this press release online for a link to get an immunization schedule.\nVaccines protect families, teens and children by preventing disease. They help avoid expensive therapies and hospitalization needed to treat infectious diseases like influenza and pneumococcal disease. Vaccinations also reduce absences both at school and at work and decrease the spread of illness in the home, workplace and community.\nFor the 2018-2019 season, CDC recommends use of the flu shot (inactivated vaccine or IIV) and the recombinant influenza vaccine (RIV) for everyone 6 months and older.\nStudents born on or after January 1, 2002 and entering the seventh-grade need proof of an adolescent pertussis (whooping cough) booster and adolescent meningococcal vaccinations.\nEvery child in a Georgia school system (Kindergarten-12th grade), attending a child care facility, or a new student of any age entering a Georgia school for the first time is required by law to have a Georgia Immunization Certificate, Form 3231. Below are the immunizations required for child care and school attendance:\n♦ Diphtheria\n♦ Tetanus\n♦ Pertussis\n♦ Polio\n♦ Measles\n♦ PCV13 (up to age 5 years)\n♦ Mumps\n♦ Rubella\n♦ Hepatitis A and B\n♦ Hib disease (up to age 5 years)\n♦ Varicella\n♦ Meningococcal Conjugate\nSome schools, colleges, and universities have policies requiring vaccination against meningococcal disease as a condition of enrollment. Students aged 21 years or younger should have documentation of receipt of a dose of meningococcal conjugate vaccine not more than five years before enrollment. If the primary dose was administered before their 16th birthday, a booster dose should be administered before enrollment in college.\n“The focus of vaccinations often lies on young children, but it’s just as important for teens, college students and adults to stay current on their vaccinations.” said Eberhart.\nThis August, protect your family by getting vaccinated The Georgia Department of Public Health Northwest Health District reminds adults to check with their health care provider for their current vaccination recommendations as well as parents to check for their children. Safe and effective vaccines are available to protect adults and children alike against potentially life-threatening diseases such as tetanus, diphtheria, pertussis, meningococcal disease, hepatitis A, hepatitis B, shingles, measles, mumps, rubella and varicella (chickenpox).\nSo, talk to your health care provider or visit your public health department and get immunized today.\nFor more information on immunization, visit http://dph.georgia.gov/immunization-section .", "url": "https://apnews.com/dfa004c0cac84d349207b05aa34b0dc2"}