{"authors": ["Jennifer Conn", "Akron Reporter"], "date_download": "2020-05-04 20:10:08", "date_modify": "2020-05-04 20:10:08", "date_publish": "2018-04-15 22:06:10", "description": "Akron's Bounce innovation hub draws hundreds to open house AKRON, Ohio - The Bounce open house in downtown Akron on Friday drew a majority of the more than 600 who registered to...", "filename": "_5c2af64898624e2a8bee10c9f893991f_1588623008.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5c2af64898624e2a8bee10c9f893991f_1588623008.html", "title": "Akron's Bounce innovation hub draws hundreds to open house", "title_page": "Akron's Bounce innovation hub draws hundreds to open house", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Akron’s Bounce innovation hub draws hundreds to open house\nAKRON, Ohio - The Bounce open house in downtown Akron on Friday drew a majority of the more than 600 who registered to attend.\nHoused in the historic B.F. Goodrich Building on S. Main Street, Bounce is the city’s hub for innovation. A $2 million renovation is planned to begin in the next few weeks and be complete by December.\nBounce evolved out of the Akron Global Business Accelerator for entrepreneurs and startups. That work will continue at Bounce but be expanded to offer maker-space and co-working space, with training, mentoring and classes open to the community through memberships. Event space and a café will also be available.\nIt is designed to attract not only entrepreneurs and inventors, but also large and small businesses, investors, schools, corporate executives, students and area residents interested in using innovation to create jobs of the future.\nBounce is an integral component of Mayor Dan Horrigan’s plan to draw in and retain talent in Akron and ultimately grow the city’s population.\n“My goal was to put a giant spotlight on the top of the building and be the attraction point for innovation and entrepreneurship,” Mayor Dan Horrigan told the crowd during the opening reception.\nOpening remarks also came from Bounce Board Chair Deb Hoover, president and CEO of the entrepreneurship-focused Burton D. Morgan Foundation. Hoover introduced newly named CEO Doug Weintraub. Weintraub was a founding member and chairman of Cleveland’s nonprofit Jumpstart Inc., which works to build and support startups.\nUnder Weintraub, Bounce will “change the way the city capitalizes on the talent and resources we have in abundance,” Hoover said.\nWork is underway in planning services the center will offer, Weintraub said.\n“Our vision for Bounce is to encourage open collaboration among diverse groups through unique opportunities,” he said.\nAmong those opportunities are an entrepreneur-in-residence program and a lecture series by successful entrepreneurs. A connection service to pair people and entities is planned, as is a schedule of low-cost workshops for professionals to sharpen their business, accounting and banking skills.\nWhen he assumed the CEO role about six weeks ago, Weintraub said his first order of business was to work with the existing companies. He encouraged attendees to take a self-guided tour to get to know those businesses.\n“The Bounce name may be new, but innovation and entrepreneurship in Akron is not,” he said. “There are already some incredible companies here doing some pretty cool things. The type of companies housed here at Bounce and the level of sophistication of their ideas and operations are impressive.”\nThe 307,000 square-foot building houses 52 tenants and employs more than 200 people. It is at 65 percent capacity now, Weintraub said.\nThe opening reception was held on the fifth floor, which will remain the site of The Bit Factory. The Bit Factory is geared for tech companies focused on software, internet-connected hardware, mobile apps and gaming.\nThroughout the event, attendees were free to wander the nine floors of the building, checking into offices with open doors to learn about the entrepreneurs and small businesses set up there. Several spaces had “available to rent” signs.\nIn addition to existing startups, Bounce also houses three art centers and five support organizations.\nBounce is located at 526 S. Main St. Visit the website for more information.\nWant more Akron news? Sign up for cleveland.com’s Rubber City Daily, an email newsletter delivered at 5:30 a.m. Monday through Friday.", "url": "https://apnews.com/5c2af64898624e2a8bee10c9f893991f"}