{"authors": ["Dave Peyton"], "date_download": "2020-05-04 20:12:56", "date_modify": "2020-05-04 20:12:56", "date_publish": "2018-08-29 07:40:42", "description": "I know why President Trump initially rejected honors for John McCain. You see, McCain put sugar on his coffee. Now wait a minute. How could that be? Well, how could it be that China is...", "filename": "_20e238aa3cac4503bd92ee48b5c51a3a_1588623176.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_20e238aa3cac4503bd92ee48b5c51a3a_1588623176.html", "title": "McCain-Trump tension? Blame it on the coffee", "title_page": "McCain-Trump tension? Blame it on the coffee", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "I know why President Trump initially rejected honors for John McCain.\nYou see, McCain put sugar on his coffee.\nNow wait a minute. How could that be? Well, how could it be that China is the reason why Trump’s promise that we would be friends with North Korea any day now has fallen through?\nTrump never admits he’s wrong. When things fall apart, he blames everybody but himself. I suspect many of his firings were a way to blame the people he fired. He learned that from his rich folk days.\nSo what is this about sugar in coffee? It comes from one of Trumps many strange followers — Phil Robertson, the patriarch of an equally strange but rich family.\nI was wandering through the Internet the other day when I discovered that Phil is still featured on a right-wing Web site called CRTV.\nHe and his family used to have a reality cable show called “Duck Dynasty,” about a company called Duck Commander. I watched it early on because I found it humorous, sometimes hilarious. I was all about the Robertson family and its “good ol’ boy” approach to life in Louisiana.\nThe family makes duck calls invented by hirsute Phil.\nThe show would have had us believe that six or seven of the Robertsons sat around in a backroom of their West Monroe, Louisiana, warehouse, chewin’ and spittin’ and telling jokes while they alone turned out duck calls.\nThe show is no longer in production. I have a feeling it shed its humorous luster and became an hour-long political commercial for Donald Trump.\nI stopped watching the show when Phil announced that he grew up in rural Louisiana and never saw any discrimination against black folks.\nOccasionally, Phil’s outrageous comments would make the national news, particularly those that mentioned his friend Donald Trump, whom the good Christian Robertson sees as our salvation.\nBut that apparently wasn’t enough for Phil, so he linked up with CRTV and gives his followers a weekly lesson in how to be a successful right winger.\nThe one I added to my Facebook page may be the weirdest one of all.\nIt begins with Robertson pouring a cup of black coffee and sipping it. That leads to a sermon about how real men drink black coffee only. He hints that men who put sugar in their coffee “like women” can’t be a Trump fan and are — ummm — well, you know.\nHe goes on to say we must return to our roots. Men must go out and kill beavers and the like, else this country is doomed to a sugar-coated coffee, live beaver, disaster.\nI had to watch this one a few times before I could believe it. Robertson was smart enough to create the perfect duck call that sells around the world as the best. But he apparently believes drinking coffee with cream and sugar is not only anti-Trump but anti-American.\nI hope no one ever takes Robertson’s sermon to heart. But I suspect they do, thousands of them, perhaps millions.\nI have it on good authority that Trump called Robertson to determine how the president ought to feel about McCain.\nRobertson told the president to ignore McCain because the senator added sugar to his coffee.\nIn time, however, Trump welcomed McCain back when he learned he was a real black coffee man.\nBelieve that and you’ll believe anything, including Trump’s claim that China is the reason we are on the doorstep of war with North Korea.\nDave Peyton is on Facebook. His email address is davepeyton@comcast.net.", "url": "https://apnews.com/20e238aa3cac4503bd92ee48b5c51a3a"}