{"authors": ["Sally Persons The Washington Times"], "date_download": "2020-05-04 20:07:56", "date_modify": "2020-05-04 20:07:56", "date_publish": "2018-04-18 09:11:42", "description": "Former President George W. Bush said Wednesday that his mother, former first lady Barbara Bush, did not fear death and was \"strong\" until her death late Tuesday. \"She truly believes that...", "filename": "_7734e0d94f32844d8bac25b8a905476b_1588622876.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7734e0d94f32844d8bac25b8a905476b_1588622876.html", "title": "George W. Bush says his mother Barbara Bush did not fear death; he also talks on trade, Russia", "title_page": "George W. Bush says his mother Barbara Bush did not fear death; he also talks on trade, Russia", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "George W. Bush says his mother Barbara Bush did not fear death; he also talks on trade, Russia\nFormer President George W. Bush said Wednesday that his mother, former first lady Barbara Bush, did not fear death and was “strong” until her death late Tuesday.\n“She truly believes that there’s an afterlife,” Mr. Bush said on Fox Business about his mother.\n“Laura and I went over to see her a week ago Saturday, and we had a wonderful visit. She was strong, lucid,” he said.\nMr. Bush said his father, former President George H.W. Bush, was by his wife’s side when she died. He said his father is doing well and thanked the country for the outpouring of thoughts and prayers. He also said that his mother made him promise that the work of the George W. Bush Presidential Center continue.\nThe 2018 Forum on Leadership at the Bush Center this week includes a lineup of speakers ranging from former House Speaker John A. Boehner to Amazon CEO Jeff Bezos.\nMr. Bush also made rare comments about a few news topics of the day, including his reaction to President Trump’s pardon of I. Lewis “Scooter” Libby, who served as an adviser to former Vice President Dick Cheney.\n“My reaction is I’m happy for Scooter and his family,” Mr. Bush said.\nMr. Libby was convicted in 2007 of lying to the FBI and obstructing justice in an investigation regarding the public reveal of CIA agent Valerie Plame’s identity. Mr. Bush commuted Mr. Libby’s prison sentence, but he did not officially pardoned him. Mr. Trump pardoned Mr. Libby last week. When asked about the Wall Street Journal editorial about Mr. Libby, which described him as “a man Bush left behind on the battlefield,” Mr. Bush did not seem surprised.\n“I’m sure he’s got some friends on the editorial board there,” the former president said.\nMr. Bush also commented on the trade policy between the U.S., Mexico and Canada saying that all three countries will need to unite to compete with other global powers, such as China.\n“We promote a positive agenda here, and make the case why in this case trade with Canada and Mexico, collaboration with Canada and Mexico, working closely with Canada and Mexico not only benefits U.S. citizens, but benefits citizens of all three countries,” Mr. Bush said.\nMr. Trump has made trade a top priority this year, announcing a change in tariffs on China, as well as an increase on U.S. steel and aluminum tariffs. He has also said he would like to renegotiate the North American Free Trade Agreement, or NAFTA.\nRegarding Russia, Mr. Bush said he’s not surprised to see how the relationship with the two countries has deteriorated since Russian President Vladimir Putin’s goal is to bring the country back to the Soviet Union.“I’m not very surprised. He’s a very aggressive person who wants to reinstate Soviet influence, even though the Soviet no longer exists. Therefore I always felt it was very important for the United States to be very forceful in dealing with Putin. Not belligerent, but forceful,” he said.\nWhen asked if he felt Mr. Trump was being forceful with Mr. Putin, he said he does not want to comment on the performance of his successors.", "url": "https://apnews.com/7734e0d94f32844d8bac25b8a905476b"}