{"authors": ["Tim Potts Black Hills Pioneer"], "date_download": "2020-05-04 20:11:25", "date_modify": "2020-05-04 20:11:25", "date_publish": "2018-11-27 18:30:00", "description": "STURGIS — The 24th annual Sturgis Festival of Trees was a huge success and an all-time record, raising nearly $49,000. This event may be one of the biggest fundraisers in the community that...", "filename": "_f711c92fee9c44fbaddd40d68a0db49e_1588623085.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f711c92fee9c44fbaddd40d68a0db49e_1588623085.html", "title": "Sturgis Festival of Trees raises record $49,000", "title_page": "Sturgis Festival of Trees raises record $49,000", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STURGIS — The 24th annual Sturgis Festival of Trees was a huge success and an all-time record, raising nearly $49,000.\nThis event may be one of the biggest fundraisers in the community that features trees, wreathes that are auctioned off, a silent auction, while everyone enjoys food, and spirits in a holiday atmosphere.\n“This is the 24th year of the event and we have raised a little over a half million dollars, and it is because of those very generous people that have purchased trees and wreathes in the past,” said Scott Reiman, First Interstate Bank president. “The $5 you spent coming in tonight all goes to the Kiwanis food bank, along with contributions from FIB employees and Neighbors feeding Neighbors and we are pleased to present a check for $5,000.”\nRosemary Roth, event coordinator, along with Jerry and Pat Casteel, the auctioneers, have been involved since the event started in 1995 and the three were recognized for their contribution.\nA special video was shown that highlighted community members that have made huge contributions to the Sturgis area and had lost battles to illness; Lucy Sundstrom, Roxie Chowen and Gary Lippold.\nThis year’s proceeds will go to the Northern Hills Regional Home and Hospice and First Interstate Greater Sturgis Area Foundation Endowment Fund. The Foundation funds countless non-profit organizations every year.\nTo read all of today’s stories, Click here or call 642-2761 to subscribe to our e-edition or home delivery.", "url": "https://apnews.com/f711c92fee9c44fbaddd40d68a0db49e"}