{"authors": ["Ivy Hillman"], "date_download": "2020-05-04 20:07:26", "date_modify": "2020-05-04 20:07:26", "date_publish": "2018-04-03 15:23:00", "description": "FROM ANDREWS MCMEEL SYNDICATION FOR RELEASE: THURSDAY, APRIL 5, 2018 TUNE IN TONIGHT by Kevin McDonough", "filename": "_be1bffcfbcdc462f982b2da6627674e9_1588622846.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be1bffcfbcdc462f982b2da6627674e9_1588622846.html", "title": "Are you ready to be conned into a 2nd season of 'Imposters'?", "title_page": "Are you ready to be conned into a 2nd season of 'Imposters'?", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Are you ready to be conned into a 2nd season of ‘Imposters’?\nFROM ANDREWS MCMEEL SYNDICATION\nFOR RELEASE: THURSDAY, APRIL 5, 2018\nTUNE IN TONIGHT by Kevin McDonough\nARE YOU READY TO BE CONNED INTO A SECOND SEASON OF ‘IMPOSTERS’?\n“Imposters” (9 p.m., Bravo, TV-14) returns for a second season. Though it’s not entirely clear if the stylish high-concept series ran out of story sometime during the first.\nIt offers a great showcase for Inbar Lavi (“Prison Break”) as Maddie, a shape-shifting beauty who cons people out of their money and their hearts. Last season, her three most recent dupes -- Ezra (Rob Heaps), Richard (Parker Young) and Jules (Marianne Rendon) -- teamed up to take her on, only to join forces with her to help her escape “the life” of a con artist.\nJust why they might do that makes sense only in the realm of TV thrillers. Maybe they just want to watch her in one stunning getup after another.\nAs a scripted series, “Imposters” marked a bit of a departure for the reality-centric Bravo but hardly a change in network identity.\n-- Speaking of unchanging network identities, “Jersey Shore: Family Vacation” (7 p.m., MTV, TV-14) follows a gang of loud, brash ethnic stereotypes sharing some downtime. In Miami, of all places. Proof that New Jersey is merely a state of mind.\n-- As if to churn the compost pile of ’90s pop culture, Viceland offers a double helping of the 1992 comedy “Encino Man” (6 p.m. and 8 p.m.). If you were too busy worrying about “Murphy Brown” to watch, it’s about teen geeks (Sean Astin and Pauly Shore) who thaw a caveman (Brendan Fraser) from a block of ice and let him loose on their high school. Fraser would reprise the role of a naive outsider in the 1999 comedy “Blast From the Past.”\nNow all grown up, Fraser appears in “Trust” on FX. Astin starred in the second season of “Stranger Things.” Shore recently appeared in the Adam Sandler Netflix movie comedy “Sandy Wexler.”\nCan “Bio-Dome 2” be far behind?\nTONIGHT’S OTHER HIGHLIGHTS\n-- Jerome finds a target on “Gotham” (7 p.m., Fox, TV-14).\n-- A patient’s tumor defies treatment on “Grey’s Anatomy” (7 p.m., ABC, TV-14).\n-- Catherine Zeta-Jones and Zac Posen guest-judge on the season finale of “Project Runway All Stars” (8 p.m., Lifetime, TV-PG).\n-- Xander and Calvin discover a military conspiracy on “Siren” (7 p.m., Freeform, TV-14).\n-- Andy and Jack argue over expenses on “Station 19” (8 p.m., ABC, TV-14).\n-- “Marcia Clark Investigates the First 48” (8 p.m., A&E, TV-14) examines the opening hours of the 2007 case against Drew Peterson.\n-- Olivia finds change difficult on “Scandal” (9 p.m., ABC, TV-14).\n-- Darius wobbles on “Atlanta” (9 p.m., FX, TV-MA).\nCULT CHOICE\nA con man (Ray Milland) lures a missionary’s widow (Ann Todd) into his criminal schemes in the 1948 shocker “So Evil My Love” (11 p.m.), a Victorian thriller presented in film noir style.\nSERIES NOTES\nLeonard and Sheldon face the voters on “The Big Bang Theory” (7 p.m., CBS, TV-PG) ... Local crafts go on sale on “Superstore” (7 p.m., NBC, TV-14) ... Sam and Dean go out of this world to protect their family on “Supernatural” (7 p.m., CW, TV-14) ... A tangle with a bully on “Young Sheldon” (7:30 p.m., CBS, TV-PG) ... A morbid blast from the past on “A.P. Bio” (7:30 p.m., NBC, TV-14) ... Adam reels on “Mom” (7 p.m., CBS, TV-14) ... The parent trap on “Will & Grace” (8 p.m., NBC, TV-14) ... Steve Harvey and Adrienne Houghton co-host “Showtime at the Apollo” (8 p.m., Fox, TV-14) ... Oliver risks everything on “Arrow” (8 p.m., CW, TV-14) ... Trouble in the stuffed animal kingdom on “Life in Pieces” (8:30 p.m., CBS, TV-PG) ... A new figure enters the equation on “Champions” (8:30 p.m., NBC, TV-PG) ... An heiress vanishes on “S.W.A.T.” (9 p.m., CBS, TV-14) ... Success goes to Boden’s head on “Chicago Fire” (9 p.m., NBC, TV-14).\nLATE NIGHT\nTyler Perry is booked on “The Daily Show With Trevor Noah” (10 p.m., Comedy Central, r) ... Sean Penn and Claudia O’Doherty appear on “Conan” (10 p.m., TBS, r) ... Drew Barrymore, Adam Devine and Moby are booked on “The Late Show With Stephen Colbert” (10:35 p.m., CBS, r) ... Jimmy Fallon welcomes Norman Reedus, Wendy Williams and Nate Bargatze on “The Tonight Show” (10:34 p.m., NBC) ... Seth Rogen, Jaina Lee Ortiz and I’m With Her appear on “Jimmy Kimmel Live” (10:35 p.m., ABC) ... Edie Falco, Jason Clarke, Sarah McBride and Steve Smith visit “Late Night With Seth Meyers” (11:37 p.m., NBC) ... Jamie Dornan, Pete Holmes and Rich Brian appear on “The Late Late Show With James Corden” (11:37 p.m., CBS, r).\n(Kevin McDonough can be reached at kevin.tvguy@gmail.com.)\n** ** **\nEDITORS: For editorial questions, please contact Gillian Titus at gtitus@amuniversal.com.\nCOPYRIGHT 2018 UNITED FEATURE SYNDICATE\nDISTRIBUTED BY ANDREWS MCMEEL SYNDICATION FOR UFS", "url": "https://apnews.com/be1bffcfbcdc462f982b2da6627674e9"}