{"authors": ["Jackie Borchardt"], "date_download": "2020-05-04 20:06:57", "date_modify": "2020-05-04 20:06:57", "date_publish": "2018-08-31 18:22:56", "description": "Ohio pharmacy board explains CBD oil position, enforcement COLUMBUS, Ohio -- Non-psychoactive CBD oil derived from hemp has always been illegal in Ohio, according to the Ohio State Board of...", "filename": "_caa61d434543448f9801d2da021c2e7d_1588622817.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_caa61d434543448f9801d2da021c2e7d_1588622817.html", "title": "Ohio pharmacy board explains CBD oil position, enforcement", "title_page": "Ohio pharmacy board explains CBD oil position, enforcement", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ohio pharmacy board explains CBD oil position, enforcement\nCOLUMBUS, Ohio -- Non-psychoactive CBD oil derived from hemp has always been illegal in Ohio, according to the Ohio State Board of Pharmacy.\nBut how that will be enforced is still unclear.\nLast weekend, the board advised Ohio medical marijuana dispensary licensees and prescribers including hospitals that CBD, even derived from hemp, is only legal when extracted and sold through the state’s still-forming medical marijuana program. The board released additional information about its statement on Friday through a series of questions and answers.\nOn the enforcement issue, the board says its guidance was intended to be informational and it will reassess action “if CBD continues to be illegally sold despite entities having accurate information.”\nSeveral central Ohio stores continued to stock the products as of Thursday evening.\nBoard spokeswoman Ali Simon clarified Friday that the board had shared the guidance with pharmacy board field agents to share with their local contacts. Simon said the board is developing a field guide for law enforcement that has not yet been released.\nProducts infused with CBD, short for cannabis compound cannabidiol, have become fairly mainstream health and wellness supplements. The products are advertised as containing CBD from hemp, defined in federal law as cannabis plants that contain 0.3 percent or less of psychoactive compound THC.\nCBD doesn’t produce a high, and consumers swear it helps with aches and pains, anxiety and other ails. A pharmaceutical-grade CBD extract received FDA approval earlier this year.\nOhio’s 2016 medical marijuana law, House Bill 523, made no changes to the legal definition of marijuana, which does not distinguish a difference between hemp and marijuana. And while Ohio’s definition of illegal marijuana exempts stalks and other parts of the plant, neither Ohio nor federal law exempts “resin,” the sticky substance found on stems and flowers that actually produces CBD and THC.\nThe board cited clarification from the U.S. Drug Enforcement Administration issued last year after the federal agency created a new code for marijuana extracts.\nThe DEA statement said cannabinoids such as CBD and THC are only found in trace amounts on the exempt parts of the plant.\n“Thus, based on the scientific literature, it is not practical to produce extracts that contain more than trace amounts of cannabinoids using only the parts of the cannabis plant that are excluded from the (Controlled Substances Act) definition of marijuana, such as oil from the seeds. The industrial processes used to clean cannabis seeds and produce seed oil would likely further diminish any trace amounts of cannabinoids that end up in the finished product.”\nMobile readers, click here to read the Ohio pharmacy board’s explanation.", "url": "https://apnews.com/caa61d434543448f9801d2da021c2e7d"}