{"authors": ["Michelle Ganassi Michelleg Dailyamerican.Com"], "date_download": "2020-05-04 20:31:34", "date_modify": "2020-05-04 20:31:34", "date_publish": "2018-04-19 02:50:00", "description": "In five years the Somerset County Workshop Shred Express has evolved from a concept to recycling nearly 400 tons of paper. “I think it is just amazing for a county like Somerset to grow that...", "filename": "_3d0d253406054c22a31a16a6defa7269_1588624294.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3d0d253406054c22a31a16a6defa7269_1588624294.html", "title": "Somerset paper shredding service proud of growth", "title_page": "Somerset paper shredding service proud of growth", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In five years the Somerset County Workshop Shred Express has evolved from a concept to recycling nearly 400 tons of paper.\n“I think it is just amazing for a county like Somerset to grow that fast in that time,” said Jackie O’Connor, workshop director.\nIn February 2013 the workshop received a $140,052 recycling grant from the Pennsylvania Department of Environmental Protection to assist in starting the business.\nO’Connor said Shred Express services 153 customers, including nine local school districts. She said part of the program teaches students about the importance of recycling. Customers also include both state prisons, businesses, insurance companies and private individuals.\n“The 153 does not include the 75 individuals that simply walk in and bring their paper,” she said.\nRecycled paper is made into facial tissue, toilet paper, paper towels and napkins.\n“One ton of paper saves enough energy to power the average American home for six months,” O’Connor said. “It saves 7,000 gallons of water, 3.3 cubic yards of landfill space and reduces greenhouse gas emissions by 1 metric ton of carbon equivalent.”\nThe workshop is a vocational rehabilitation facility that helps adults with physical or mental disabilities enhance their self-image and self-worth through compensable and meaningful work, according to its website.\nThe workshop performs work for Wheeler Bros., Berkebile Oil Co. and Guy Chemical, but O’Connor said the consumers enjoy paper recycling the most.\n“It is one of the favorite things,” she said. “Our consumers enjoy it because they are actually running the machine.”\nWorkshop project manager Ben Gilbert said consumers also enjoy going out on pickups and talking with prospective customers.\n“The consumers come with me to help with the consultation,” he said.\nThe workshop is a member of the National Association for Information Destruction. O’Connor said the workshop can shred confidential documents and offer a certificate of destruction if needed.\n“Usually, physicians and the hospitals and some accountants require them,” she said.\nO’Connor said local businesses and leaders have been supportive of the project.\n“Wheelers are extremely supportive and continue to be,” she said.\nO’Connor said word of mouth has been the workshop’s best advertisement.\n“And I think who we are and the consumers that have been served is the other positive,” she said.\nThe workshop offers scheduled route pickup and purge shredding. For more information call 814-445-6908.", "url": "https://apnews.com/3d0d253406054c22a31a16a6defa7269"}