{"authors": ["Andrew Oxford", "The New Mexican"], "date_download": "2020-05-04 20:10:31", "date_modify": "2020-05-04 20:10:31", "date_publish": "2018-01-25 06:45:00", "description": "Gov. Susana Martinez stood on a sound stage in Albuquerque last summer crediting the film and television industry with injecting a record $505 million into the New Mexico economy over the previous...", "filename": "_750d11a85ef642b3a915cff9902ff586_1588623031.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_750d11a85ef642b3a915cff9902ff586_1588623031.html", "title": "Push to nix cap on film industry rebates meets GOP resistance", "title_page": "Push to nix cap on film industry rebates meets GOP resistance", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Gov. Susana Martinez stood on a sound stage in Albuquerque last summer crediting the film and television industry with injecting a record $505 million into the New Mexico economy over the previous fiscal year.\nBut will the governor who sought to cut tax rebates for filmmakers when she first took office go along with a bill to lift the current cap on incentives, a measure that some say would provide an additional boost as the industry continues to prove a particularly busy part of the state’s economy?\nDemocratic legislators are pushing a bill that would eliminate the $50 million cap on the annual total of tax rebates the state provides film and television producers working in New Mexico.\nIn an unusual inversion of the Legislature’s typical partisan dynamics, Democrats argue it would be a boon for business, but Republicans contend it could strain the state’s budget and amount to a giveaway for out-of-state businesses.\nSo even though the proposal, House Bill 113, passed its first committee Wednesday, it only did so on party lines, casting doubt on whether the Republican governor would support it.\nThe state currently allows television producers and filmmakers to receive tax rebates on qualified expenses for projects shot in New Mexico. For instance, a filmmaker who spends $10 million in the state can qualify for a rebate of $2.5 million. Long-running television shows can get a slightly bigger rebate.\nThe bill’s sponsor, Rep. Antonio “Moe” Maestas, a Democrat from Albuquerque, argued to the House Labor and Economic Development Committee that removing the $50 million cap would provide greater financial certainty for production companies.\nThe move would probably cost an extra $5 million to $10 million each year, Maestas said.\nThat is worth it, he argued, given the competitive nature of the film industry.\nThe cap, he said, “just provides a disincentive we don’t need.”\n“Really what we’re looking at is removing the confusion and uncertainty that’s out there,” Wayne Rauschenberger, chief operating officer of Albuquerque Studios, told the committee.\nOther Democrats argued the film industry can help diversify a state economy that has long been heavily reliant on jobs in oil, gas and government.\nBut Republicans on the committee asserted that eliminating the cap could create uncertainty for the state’s finances.\nRepublicans said the cap creates a measure of fiscal certainty for the state. Filmmakers can claim more than $50 million in credits each year, but the cap ensures the state is not obligated to pay that money immediately. Lifting the cap would scrap that control.\n“I’m a little concerned this will be a budget buster in the future,” said Rep. Rod Montoya, a Republican from Farmington.\nOthers took up a more populist argument, pointing to major entertainment companies that benefit from the rebates.\n“It sounds like we’re giving a tax credit to some of the wealthiest people in the world,” said Rep. Rebecca Dow, a Republican from Truth or Consequences.\nAt one point, Montoya said the hearing had flipped the usual Democratic and Republican arguments on their heads.\n“I’m quite frankly excited to hear the other side of the aisle making this argument,” he said. “It is the case if you help a business remain in business, they’ll employ people.”\nCasting some uncertainty over the proposal, however, the Taxation and Revenue Department has not weighed in on how much the bill might cost. And representatives of the state Film Office did not appear at Wednesday’s hearing, raising doubt about whether the Martinez administration would come around to the measure. A spokeswoman for Martinez said Wednesday the governor had not reviewed the bill.\nMartinez was an outspoken critic of the film tax credit when she first took office amid a budget crisis, contending it siphoned funding from education and other services. However, she signed legislation in 2013 boosting the size of the credit. The film industry seems to have only flourished here since then, with the state Film Office reporting 61 major productions in New Mexico during fiscal year 2017. And in recent years, Martinez has celebrated the film industry’s contributions to the state economy.\n“All of us, including the governor, are much more comfortable with the film credit than we were eight years ago,” Maestas said.\nContact Andrew Oxford at 986-3093 or aoxford@sfnewmexican.com. Follow him on Twitter at @andrewboxford.", "url": "https://apnews.com/750d11a85ef642b3a915cff9902ff586"}