{"authors": ["Marc A. Thiessen"], "date_download": "2020-05-04 20:10:29", "date_modify": "2020-05-04 20:10:29", "date_publish": "2018-11-02 21:29:08", "description": "After a deranged Democrat living in his van nearly assassinated Rep. Steve Scalise, R-La., firing more than 70 rounds at House Republicans practicing for the Congressional Baseball Game, House...", "filename": "_8335cdeac46a47c1bebe149a791d6aaf_1588623029.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8335cdeac46a47c1bebe149a791d6aaf_1588623029.html", "title": "Democrats cupable for vitriol, too", "title_page": "Democrats cupable for vitriol, too", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "After a deranged Democrat living in his van nearly assassinated Rep. Steve Scalise, R-La., firing more than 70 rounds at House Republicans practicing for the Congressional Baseball Game, House Minority Leader Nancy Pelosi, D-Calif., declared it “outrageous” that anyone would blame Democrats’ rhetoric for inspiring the shooter.\n“How dare they say such a thing!” Pelosi thundered. Never mind that the shooter echoed Democratic vitriol against the president, ranting on Facebook that “Trump is Guilty & Should Go to Prison for Treason” and that “Trump Has Destroyed Our Democracy. It’s Time to Destroy Trump & Co.”\nNow Democrats are doing exactly what they condemned, blaming President Donald Trump’s divisive rhetoric for the recent spate of mail bomb attacks and the massacre at a Pittsburgh synagogue. The truth is they ceded the moral high ground years ago. Our descent into vitriol began long before Trump — and Democrats and their allies are as culpable as the president.\nRecall that in 2000, the NAACP spent millions on ugly ads accusing George W. Bush of moral equivalence with white supremacists who brutally lynched James Byrd in 1998. “My father was ... beaten, chained, and then dragged three miles to his death, all because he was black,” said Byrd’s daughter, as the screen flashed grainy images of a chain dragging a body behind a pickup truck. “So, when Governor George W. Bush refused to support hate-crime legislation, it was like my father was killed all over again.”\nBarack Obama set the tone for his 2008 campaign against John McCain when he declared, “If they bring a knife to the fight, we bring a gun.” Rep. John Lewis, D-Ga., answered that call when he compared McCain to segregationist Alabama Gov. George Wallace and declared that McCain was replicating the climate of “hatred and division” that led to attacks on civil rights workers. Four year later, a pro-Obama super PAC ran ads showing GOP vice-presidential nominee Paul Ryan pushing an old lady in a wheelchair over the side of a cliff, while another ran false ads blaming Mitt Romney for a woman’s death from cancer.\nDuring the 2016 campaign, Hillary Clinton compared Republicans to Nazis, saying in regard to illegal immigrants they wanted to “round them up” and put them in “boxcars.” She also compared the GOP to terrorists, declaring, “Now, extreme views on women, we expect that from some of the terrorist groups, we expect that from people who don’t want to live in the modern world, but it’s a little hard to take from Republicans.” And she listed Republicans alongside the Iranians among the “enemies” she was most proud of making.\nWhen Trump took office, Democrats abandoned their role as the “opposition” and declared themselves “the resistance.” Look up “resistance” in the Oxford dictionary and you’ll see the definition “the use of force or violence to oppose someone or something.” William E. Scheuerman, professor of political science at Indiana University, notes the word resistance “first surfaces in debates about tyrannicide, the violent removal from power of misbehaving kings who usurp authority not properly belonging to them.”\nScalise would have been forgiven for pointing out that his would-be assassin took Democrats’ calls to “resistance” literally.\nMore recently, some Democrats were peddling unfounded accusations that Brett M. Kavanaugh participated in gang rapes in an effort to destroy the Supreme Court nominee. Clinton defended smash-mouth tactics, declaring that “you cannot be civil with a political party that wants to destroy what you stand for.”\nNone of this excuses Trump’s rhetoric, but it does make his Democratic accusers hypocrites. When you traffic for decades in hateful, violent political rhetoric, you have lost the moral authority to effectively condemn others for doing so.\nIndeed, Democrats arguably bear much of the blame for creating Trump. One of the reasons voters rallied behind Trump is precisely because, after years of seeing their standard-bearers act like punching bags, Trump presented himself as a counterpuncher who isn’t afraid to fight back and gives as good as he gets.\nThe results are ugly. Trump is wrong to call the media the “enemy of the people” and to celebrate a congressman body-slamming a reporter, and the host of other terrible things he has said. But Democrats were dragging us into the political gutter long before Trump came along. If they think Americans elected a Frankenstein’s monster, they are Dr. Frankenstein.", "url": "https://apnews.com/8335cdeac46a47c1bebe149a791d6aaf"}