{"authors": ["Dk Mcdonald", "The Daily News"], "date_download": "2020-05-04 20:28:43", "date_modify": "2020-05-04 20:28:43", "date_publish": "2018-01-17 06:13:00", "description": "BULLHEAD CITY — Tri-City Council meets at 10 a.m. today in the Council Chamber, 1255 Marina Blvd. The council, formed in 2008, is comprised of mayors and governing body representatives of...", "filename": "_d03e48190f7a4f8297fb2d3ced766b63_1588624123.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d03e48190f7a4f8297fb2d3ced766b63_1588624123.html", "title": "Tri-City Council to discuss CAP purchase of water rights Wednesday", "title_page": "Tri-City Council to discuss CAP purchase of water rights Wednesday", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BULLHEAD CITY — Tri-City Council meets at 10 a.m. today in the Council Chamber, 1255 Marina Blvd.\nThe council, formed in 2008, is comprised of mayors and governing body representatives of Bullhead City, Kingman and Lake Havasu City, who meet quarterly in a different city on a rotating basis.\nItems on the agenda include the introduction of Kingman Interim City Manager Jim Bacon and Lake Havasu City Manager Jess Knudson.\nTri-City Council members will discuss taking possible action to issue a letter of support opposing the purchase of water rights associated with seven Mohave Valley farms by Central Arizona Water Conservation District. Members also will consider hosting an outreach meeting in Phoenix and discuss possible partnership opportunities with Mohave Community College.\nMembers also will hear updates from representatives of the Mohave County Board of Supervisors, Laughlin/Bullhead International Airport, Bureau of Land Management, Arizona Department of Transportation, Northern Arizona Employee Benefit Trust, rural Transportation Advocacy Council and a legislative preview update from League of Arizona Cities and Towns.\nBullhead City Mayor Tom Brady, Lake Havasu Mayor Mark Nexsen and Kingman Mayor Monica Gates will provide individual city updates.\nTri-City Council meetings are open to the public.", "url": "https://apnews.com/d03e48190f7a4f8297fb2d3ced766b63"}