{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:20:44", "date_modify": "2020-05-04 20:20:44", "date_publish": "2018-09-18 10:37:39", "description": "LOWELL -- The Learning in Retirement Association at UMass Lowell invites anyone retired or semi-retired to consider joining the association this fall. Their curriculum committee has lined up...", "filename": "_fee2aaa8fbb447b486d000caf75086ba_1588623644.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fee2aaa8fbb447b486d000caf75086ba_1588623644.html", "title": "Open Invite to Retirees", "title_page": "Open Invite to Retirees", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- The Learning in Retirement Association at UMass Lowell invites anyone retired or semi-retired to consider joining the association this fall.\nTheir curriculum committee has lined up an array of courses for the fall semester: Healthy Aging; Globalization and All That; Immigrant Stories; Money Matters in Retirement; Great Decisions: Foreign Policy Discussions; Election 2018; Art and Music: Concerts, Lectures, Museum Visits; and Book Discussions.\nThere are no education or age requirements for the program. LIRA is a partnership with UMass Lowell Community Relations and Alumni Relations. For information, visit www.uml.edu/Community/LIRA .\n-- RICK SOBEY\n‘Ireland’s Happy Man’ concert\nBILLERICA -- The Ancient Order of Hibernians of Lowell will sponsor “Ireland’s Happy Man” Cahal Dunne in concert on Sept. 29. The event will take place at the Billerica Lodge of Elks at 7 p.m. Proceeds will benefit the Ancient Order of Hibernians Scholarship Fund. Tickets cost $20 per person. For information, call 978-866-0819 or 978-866-6437.\n-- RICK SOBEY\nGrants awarded in Chelmsford\nCHELMSFORD -- The Greater Lowell Community Foundation will award grants to Budget Buddies and the Chelmsford Food Pantry Wednesday afternoon.\nThe grants will be awarded at Budget Buddies’ 114 Turnpike Road office Wednesday at 3 p.m., followed by the Chelmsford Food Pantry, behind the town offices at 50 Billerica Road, at 3:30 p.m.\n-- ALANA MELANSON\nAlumni group invests in activities\nCHELMSFORD -- The Chelmsford High School Alumni Association is offering mini-grants to enrich after-school activities for current students.\nChelmsford High clubs, organizations, teams or individuals may apply for small amounts of funding for such uses as planning an event, meeting a one-time need or startup money for a new program. Examples could include new chess boards for the Chess Club, materials to support a public service project, or organizing a speaker or presentation, among other possibilities. Proposals that involve alumni directly or in a supporting role will be given priority. A total of $2,500 is available this year.\nApplication forms and additional information can be found at chsalumni.org/mini-grant-program . Grant proposals are due Oct. 10. Recipients will be announced at SHARE Night on Oct. 24.\n-- ALANA MELANSON\nFundraiser at Masonic hall\nAYER -- The Ayer Masonic Association will hold its monthly fundraising breakfast on Oct. 7 at the Ayer Masonic Center, 11 Sculley Rd., Ayer.\nBreakfast will be served from 7:30 a.m. to 10 a.m., according to a release. The menu includes eggs cooked to order or pancakes with bacon, sausage, or hash and potatoes, toast, juice, and coffee. In addition to the usual menu as outlined, specials for this month are eggs benedict and an Italian omelet.\n-- AMARIS CASTILLO", "url": "https://apnews.com/fee2aaa8fbb447b486d000caf75086ba"}