{"authors": ["Diane Wagner"], "date_download": "2020-05-04 20:08:21", "date_modify": "2020-05-04 20:08:21", "date_publish": "2018-01-25 00:30:00", "description": "Jurors in the murder trial of Corey Demarcus Gardhigh heard testimony Wednesday on what the autopsy showed about how Paul Anthony Grady died. Gardhigh is accused of beating Grady so severely...", "filename": "_96cf507d94de428d80393302268db179_1588622901.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_96cf507d94de428d80393302268db179_1588622901.html", "title": "‘Blunt force trauma to the head’: GBI medical examiner testifies about autopsy results in the murder trial of Corey Demarcus Gardhigh", "title_page": "‘Blunt force trauma to the head’: GBI medical examiner testifies about autopsy results in the murder trial of Corey Demarcus Gardhigh", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "‘Blunt force trauma to the head’: GBI medical examiner testifies about autopsy results in the murder trial of Corey Demarcus Gardhigh\nJurors in the murder trial of Corey Demarcus Gardhigh heard testimony Wednesday on what the autopsy showed about how Paul Anthony Grady died.\nGardhigh is accused of beating Grady so severely during a Dec. 28, 2016, pay dispute that Grady died from his injuries a week later at Floyd Medical Center.\nBoth prosecutors and defense rested late Wednesday afternoon and jurors will likely begin deliberations Thursday morning.\nDr. Lora Darrisaw, a medical examiner with the Georgia Bureau of Investigation, said her autopsy revealed 24 separate visible injuries to Grady’s face, head and neck. She also found bleeding under the scalp and in the brain.\nDarrisaw put the cause of death as blunt force trauma to the head, by homicide.\nAssistant District Attorney Luke Martin introduced several photographs of Grady’s head, zeroing in on cuts, deep bruises and swelling. Grady also had stitches above an eye and on his lip.\nMartin asked Darrisaw about other medical issues revealed by the autopsy, including a clot in Grady’s lung, but the doctor connected them to the brain injury. She said the bleeding and swelling “caused abnormalities that cascaded” in the days Grady struggled for life.\n“There was a deterioration of the body processes ... The cause of that is blunt force trauma,” she explained.\nUnder cross-examination by Gardhigh’s attorney, Durante Partridge, Darrisaw said all of the injuries appeared to have been sustained “in one event.”\nShe agreed that some could have come from impact with the ground — “brick or concrete,” Partridge said — but noted that there were no signs that any did. She also dismissed Partridge’s theory that there could have been one punch and Grady hurt himself falling while trying to get up.\n“Each site is a (separate) impact site ... There were impacts to multiple sites on the head,” Darrisaw said.\nEarlier in the day, Martin questioned Floyd County Police investigator Amy Nails about testimony by Grady’s teenage son Tuesday. Partridge said the boy’s description of a man he saw fleeing after the attack did not match Gardhigh.\nNails said eyewitness testimony is not always reliable, “especially with a crime like this, where you have a child walking outside and finding his dad... with agonal breathing.”\nShe said Gardhigh admitted to her that he was on the scene when Grady was injured. Partridge had no questions for Nails on cross examination.", "url": "https://apnews.com/96cf507d94de428d80393302268db179"}