{"authors": ["Jeremy Johnson"], "date_download": "2020-05-04 20:07:34", "date_modify": "2020-05-04 20:07:34", "date_publish": "2018-10-30 14:15:00", "description": "Chasing your entrepreneurial dream is one of the great foundations of America. The U.S. Census Bureau of Labor Statistics records 29.6 million Americans are starting or running their own...", "filename": "_ab910e3c79f745a7bdf39a6ae818b12a_1588622854.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ab910e3c79f745a7bdf39a6ae818b12a_1588622854.html", "title": "Scams and the impact on small businesses", "title_page": "Scams and the impact on small businesses", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Chasing your entrepreneurial dream is one of the great foundations of America. The U.S. Census Bureau of Labor Statistics records 29.6 million Americans are starting or running their own businesses, supporting local communities with products and services while contributing millions of dollars and jobs to the American economy.\nBut when scammers or hackers attack your business — trying to compromise the dream that you have stressed, sacrificed and sweated over — it can be devastating. The Better Business Bureau joined the Federal Trade Commission to undergo a study looking into scams that target small businesses. The report — “Scams and Your Small Business” — found that these scams are growing, pose a significant risk to business owners, and generally result in a higher monetary loss per incident than those targeting individuals.\nThe top five riskiest scams are bank/credit card company imposters, directory listing and advertising, fake invoice, fake check and tech support.\n“Anyone could be a scammer’s next target,” said Chuck Harwood, director of the FTC’s Northwest Region office. “Small businesses are not immune from the threat, as the BBB’s new report shows, and the monetary loses may be sizable.”\nTyler Andrew, CEO of BBB Northwest + Pacific echoed that statement.\n“We knew that we needed thorough research to fully understand the types of scams targeting our small businesses,” Andrew said. “This study helps us to focus our fight against scammers by spotlighting how these con artists are tricking our businesses and how we can help minimize that impact.”\nTo try to minimize the impact the of these scams, it is important to know how scammers could approach your business.\nThe first and riskiest scams are bank or credit card imposter scams. Scammers reach out by phone, email or text claiming to be from your bank or credit card company. Many begin as a “robocall” recording offering you a better interest rate, updating your information, sending you a new card, or verifying a purchase. They often try to catch an employee off guard by mentioning the owner’s name and claiming they have verification from that owner to get the information.\nIn a different variation, a scam email instructs the target to click a link to update banking information. This can download malware to your device, which scammers can use to steal personal information, send spam, and commit fraud.\nDirectory listing and advertising scams are the second riskiest scams for small businesses. As new businesses begin to grow their customer bases, they are looking for new ways to get the word out about their products and services. Scammers ask them to pay for an advertisement in a directory, or “Yellow Pages.” In some cases, the directory exists but is not widely distributed and therefore worthless. In other cases, the directory is a total fake and the ad is never placed anywhere.\nA few weeks later, the business receives an invoice for several hundred dollars for an ad or listing in the directory. When the business calls to complain, the representative says that an employee verbally confirmed the placement. In many cases, the scammer even plays back a spliced version of the previous conversation. The altered recording makes it sound like the employee agreed to the charge, when, in fact, he or she was saying “yes” to the listing information.\nFake check scams are the third riskiest and are used as a tactic for a variety of scams. Sometimes the check is a payment for products or services, but it’s an overpayment, and the scammer asks the business to wire back the difference. In other cases, they ask the overpayment to be sent to a third party for taxes or to purchase supplies. In either case, businesses are asked to deposit a fake check and wire the difference. The business later learns that the check is fake after they’ve wired money to the scammer and the business is liable for the missing funds.\nThe Better Business Bureau suggests the best way to prevent these scammers from going after your organization, your reputation and your bottom line is training and education. Your best defense is an informed workforce. Explain to your staff how scams happen. Encourage your employees to talk with their co-workers if they spot a scam. Scammers often target multiple people in an organization, so an alert from one employee about a scam can help prevent others from being deceived.\nTrain employees not to send passwords or sensitive information by email, even if the email seems to come from a manager. Then stick with the program — don’t ever ask for sensitive data from employees by email. This can prevent a data breach and could cost not only your company but also your customers.\nMake sure procedures are clear for approving invoices or expenditures. To reduce the risk of a costly mistake, limit the number of people who are authorized to place orders and pay invoices. Review your procedures to make sure major spending can’t be triggered by an unexpected call, email, or invoice.\nPay attention to how someone asks you to pay. Tell your staff to do the same. If you are asked to pay with a wire transfer, reloadable card or gift card, you can bet it’s a scam.\nSmall business owners are known for their resilience, grit and sacrifice. As an owner, you give so much to your business, so it’s important to protect it from those who want to damage what you have worked so hard to build.\nFor more information on small business scams or tips that can help benefit your business, go to bbb.org.\nJeremy Johnson is the Eastern Idaho Marketplace Manager for the Better Business Bureau Northwest + Pacific. Contact the BBB at 208-342-4649 or email info@thebbb.org.", "url": "https://apnews.com/ab910e3c79f745a7bdf39a6ae818b12a"}