{"authors": ["Rick Mccann"], "date_download": "2020-05-04 20:13:20", "date_modify": "2020-05-04 20:13:20", "date_publish": "2018-01-27 05:01:00", "description": "HUNTINGTON - Marshall's Thundering Herd was stung by the result of its first meeting with Western Kentucky University. The Hilltoppers rolled into Cam Henderson Center on Jan. 6 and whipped...", "filename": "_ca9f3e0ad263463fa6ce578aa75fd1a4_1588623200.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ca9f3e0ad263463fa6ce578aa75fd1a4_1588623200.html", "title": "Marshall vs. WKU round two", "title_page": "Marshall vs. WKU round two", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON - Marshall’s Thundering Herd was stung by the result of its first meeting with Western Kentucky University.\nThe Hilltoppers rolled into Cam Henderson Center on Jan. 6 and whipped the home team, 112-87, in a Conference USA men’s basketball contest.\n“Western came in and played pretty good,” Marshall freshman guard Jarrod West said before the Herd made the trip to Bowling Green, Ky., for a 7 p.m. Saturday rematch in E.A. Diddle Arena that is televised on the Stadium network. “They beat us in every aspect of the game and we didn’t come ready to play. I don’t think we played half as good as we could have played. We just didn’t play well.\n“After watching film and seeing mistakes we made, I think that’s going to help us the next time we play them this weekend.”\nWestern Kentucky (14-6 season, 6-1 conference) is one game up on Marshall (14-6, 5-2) in the Conference USA standings. Middle Tennessee (15-5, 7-1) and Old Dominion (15-4, 6-1) are ahead of the Hilltoppers and fourth-place Marshall. A sold-out crowd is anticipated in the 7,326-capacity arena.\nThe Herd got off to a slow start in the earlier matchup and the Hilltoppers jumped through the opening. The Herd missed its first eight shots from the field, including a blown dunk by Ajdin Penava, and fell behind 10-1 when the 6-foot-9 junior forward left the game after spraining his right ankle. The nation’s top shot blocker rejected five field goals in a court appearance of less than four minutes.\nWestern Kentucky led at halftime, 61-35, and stretched the margin to 79-45 with 13:22 left.\n“They smacked us in the mouth from the start,” West said. “With Ajdin going down that just made it worse and I don’t think we ever responded from that initial run they made.”\nMarshall’s Darius George, a 6-7 freshman forward, also missed the first meeting (foot stress fracture).\nHerd practices leading up to the game were sub-par because some players were either injured, sick or reacting to the cold weather outside and inside the arena. Everyone is healthy now “And we still might get beat because they’re a good ballclub and they’ve got a good coach,” Marshall head coach Dan D’Antoni said.\nD’Antoni said video review of the Jan. 6 game shows the Herd having tons of opportunities and not executing like it did against other opponents. Players didn’t prepare like they should have and D’Antoni said he had to yell at the team before playing the game.\n“We’ve got to be better and tougher than that,” the Herd coach said.\nMarshall point guard Jon Elmore has league-best scoring (22.1) and assist (7.5) averages into the game. The 6-3 junior is the nation’s only player averaging 22 points, seven assists and five (5.4) rebounds and the only one with two triple-double games this season.\nHerd guard C.J. Burks, a 6-4 junior, scores 21.4 a game and is the leader for C-USA games only with 24.5. Penava is next for Marshall with 16.7 points and 9.1 rebounds along with NCAA highs of 88 blocked shots and 4.89 blocks a game. Six-foot-four junior guard Rondale Watson and the 5-11 West add 11.1 and 9.7 points respectively.\nMarshall is the nation’s seventh-highest scoring team (86.8 per game) and makes an average of 9.9 3-point field goals, which led Western Kentucky head coach Rick Stansbury to say Herd is capable of beating anybody, anywhere when its shots are going in.\n“They did something that we couldn’t do,” Stansbury said. “They beat Middle (Tennessee) at home, so it tells you how good they are.”\nMiddle Tennessee’s only conference defeat was Jan. 18 in Huntington, 73-63. The Blue Raiders quieted an over-capacity Diddle Arena crowd of 7,759 spectators two days later, 66-62.\nThe Hilltoppers are led by 6-4 grad transfer (University of Virginia) guard Darius Thompson who tripled against Marshall with 33 points, 10 rebounds and 10 assists. Thompson, a 40.9 percent 3-point shooter, averages 14.7 points. Justin Johnson is next with 14.1 and the 6-7, 245-pound senior also collects 9.2 rebounds. Johnson hurt the Herd at home with 27 points. Taveion Hollingsworth is a 6-2 freshman hitting for 12.7 points and making 43.8 percent from three-point distance.\nStansbury stocked his squad with several transfer players that also include 6-9, 245-pound grad transfer Dwight Coleby from the University of Kanasas who averages 12.4 points and 8.4 rebounds. Coleby had 18 points and 14 rebounds in Cam Henderson Center.\nLamonte Bearden is a 6-3 junior transfer from the University of Buffalo averaging 11.6 points has strep throat and is questionable for the game.\n“OK, if we went down and took Justin Johnson out of the ball game how good are they?” D’Antoni said. “Who wins? I don’t know.\n“I know they’re better when he’s on the floor and we’re better when Ajdin (Penava) is on the floor.", "url": "https://apnews.com/ca9f3e0ad263463fa6ce578aa75fd1a4"}