{"authors": ["Rachel Blount"], "date_download": "2020-05-04 20:05:43", "date_modify": "2020-05-04 20:05:43", "date_publish": "2018-08-24 21:28:38", "description": "As much of a luxury as it is to have options, it can create some difficult choices. Do you pick chocolate or vanilla? Steak or lobster? Platinum or white gold? Thats the situation Hugh...", "filename": "_c1f5a57369dc4b2a86e1ebd6c68fd1f4_1588622743.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c1f5a57369dc4b2a86e1ebd6c68fd1f4_1588622743.html", "title": "Gophers volleyball opens season with sweep over Florida State at Target Center", "title_page": "Gophers volleyball opens season with sweep over Florida State at Target Center", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As much of a luxury as it is to have options, it can create some difficult choices. Do you pick chocolate or vanilla? Steak or lobster? Platinum or white gold?\nThats the situation Hugh McCutcheon found himself in Friday, as the Gophers set sail on a new volleyball season at the Big Ten/ACC Challenge at Target Center. The coach said last week his most pressing task is to figure out how to assemble a lineup from perhaps the deepest roster of his seven seasons at the U. Though he liked what he saw in a 25-17, 25-21, 25-21 sweep of Florida State, it didnt do much to help him sort things out.\nThe fourth-ranked Gophers got a match-high 14 kills from Stephanie Samedy, 11 from Jasmyn Martin and eight each from Taylor Morgan and Regan Pittman. Behind that balanced attack and the usual steady performance from senior setter Samantha Seliger-Swenson the Gophers hit .268 to the Seminoles .190.\nWith so many high-caliber players, Morgan said, the competition has been ferocious in practice. While that might make for some difficult lineup decisions, McCutcheon expects that depth to be one of the Gophers greatest assets this season.\nHeres a lineup that did pretty well, and well look to introduce other players as we go through the course of [nonconference play], McCutcheon said. This competition thing, the way this team views it, its a really strong advantage to not have to rely on a group of players or on one player. We have a lot of players who can get the job done.\nNot everything went smoothly for the Gophers, but McCutcheon was glad to see his players get a test against someone other than themselves. The fast, scrappy Seminoles often made it tough on the host team, forcing the Gophers to maintain their poise through some rough stretches to withstand a persistent opponent.\nMorgan said that wasnt much different from what the Gophers see every day in the gym. In practice, she said, they are so competitive they argue over every point and never let up. That put them in a sharp frame of mind for the opener, and she anticipates that attitude to give them an edge over the course of the season.\nThat prepared us very well for a game like [Friday], said the junior outside hitter from Blaine, who hit a match-high .438 on Friday. Its very beneficial for us, because its not something we turn on and off. We could be doing a learning drill in the gym, and we still want to win, even if theres no score.\nMcCutcheon used nine players, including freshmen CC McGraw and Adanna Rollins. He praised McGraw, a libero/defensive specialist from Prior Lake, for her tactical thinking and ability to adapt to the situation at hand. She finished with 13 digs, three assists and two aces, while Rollins, an outside hitter from Carrolltown, Texas, impressed McCutcheon with her defense (six digs).\nAs much as McCutcheon likes to see the internal competition, hes also pleased with the Gophers team unity. That came into play in the third set, when they withstood a late 8-1 run by the Seminoles before Martins smash ended the match.\nOn Saturday, the Gophers play North Carolina, which was swept by No. 9 Wisconsin in Fridays first match. McCutcheon was unsure whether he would make substantial lineup changes. With eight more matches before the Big Ten opener on Sept. 19, he said he has lots of chances to experiment and see what he has.\nIn the past, McCutcheon said, he has typically chosen a group and stuck with it. The Gophers depth this season gives him the flexibility to make changes if a player is struggling. Though he expects some tough decisions ahead, its a luxury hes grateful to have.\nA lot of players have earned the right to get out there and do it, he said. Weve had good competition across a number of positions. Im really keen to see how the whole thing plays out.", "url": "https://apnews.com/c1f5a57369dc4b2a86e1ebd6c68fd1f4"}