{"authors": ["Daniel Finn", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Richard Seymour", "Jeremy Corbyn", "Branko Marcetic"], "date_download": "2020-05-04 19:56:36", "date_modify": "2020-05-04 19:56:36", "date_publish": "2018-04-09 00:00:00", "description": null, "filename": "2018_04_jeremy-corbyn-antisemitism-labour-party_1588622196.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/04/09101206/GettyImages-543774456.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_04_jeremy-corbyn-antisemitism-labour-party_1588622196.html", "title": "Corbyn Under Fire", "title_page": "Corbyn Under Fire", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThe dominant narrative in the British media about Jeremy Corbyn, the Labour Party, and antisemitism is false and defamatory. Labour does not have a leadership that tolerates or encourages prejudice against Jews. It is not a safe haven for bigots. There is no evidence that antisemitic views are more prevalent in Labour than in other parties, or in British society as a whole. Anyone making those elementary points is likely to face an indignant response. Hasn’t Corbyn himself admitted that Labour has a problem? How can you deny the evidence staring you in the face? The question “does Labour have a problem with antisemitism?” has been posed incessantly to Labour politicians and to ordinary party members. It should be seen for what it is: a rhetorical trap with a built-in conclusion. If they answer “no,” they will be ridiculed for suggesting that Labour is entirely free of antisemitic prejudice. If the party has even a single member with antisemitic views, that’s a problem. Only a fool would claim that Labour has managed to eliminate every last trace of bigotry from its ranks. But if they answer “yes,” that will be taken as an admission that the prevailing narrative is correct. Take, for example, Corbyn’s recent interview with Jewish News. After speaking at length about his opposition to antisemitism and the steps that would be taken to root it out, he was urged to “call on your supporters to stop calling allegations of antisemitism smears.” For some, any talk of “smears” is itself a form of antisemitism and should be sanctioned by the party. In other words: if some allegations are valid, then every allegation must be valid. When put as bluntly as that, the absurdity of the argument becomes obvious, but some variation on that faulty logic has been ubiquitous in the British media over recent weeks. So let’s be clear. The charge against Corbyn’s Labour Party is not that some party members have expressed antisemitic views, or that internal disciplinary procedures are not up to scratch, or that the leadership itself has been guilty of some failings on the issue. Measured, proportional criticism of that kind is not a “smear,” and the vast majority of Corbyn supporters would have responded to it in good faith, if that was the main thrust of the argument. Instead, they have been bombarded with hysterical claims that Labour under Corbyn is “a cold house for Jews,” riddled with antisemitism from top to bottom. It is said to have become a party “for the many, not the Jew,” with a leader who winks approvingly at bullies and bigots. That is the smear, propagated tirelessly by a wide range of political actors united by their hostility to Corbyn’s project. The effect of this defamatory campaign has been to make it harder for the Labour Party to solve the problems which do exist, since its supporters have been encouraged to look on all claims about “Labour antisemitism” with intense distrust — not by the party leadership, but by its most implacable critics. This attitude is not healthy and has produced its own set of issues. But it is the predictable result of a malicious onslaught. When you’re in a bunker, you develop a bunker mentality.\n“Reliable, Empirical Evidence” If Labour faces such intense criticism for its record on antisemitism today, it is not because of some drastic transformation in the party’s character since Corbyn became leader. The main thing that has changed in comparison with past leaderships is the degree of scrutiny. In October 2016, the UK Parliament’s Home Affairs Committee published a report which found “no reliable, empirical evidence to support the notion that there is a higher prevalence of anti-semitic attitudes within the Labour Party than any other political party.” With delicate understatement, the committee members declared themselves “unaware whether efforts to identify anti-semitic social-media content within the Labour Party were applied equally to members and activists from other political parties.” But having identified a disproportionate focus on Labour, they proceeded to replicate it by concentrating overwhelmingly on the party’s shortcomings, real or imagined. Richard Kuper, in a meticulous response, found it “impossible to read the report without being struck by its all-too-often snide and judgmental tone, its cavalier use of evidence, its cherry-picking of statements made by witnesses to it, [and] its failure to challenge and test the assertions made”’ by critics of the Labour Party. The same criticisms could be applied to media coverage of the issue in general. “Cavalier use of evidence”? Take Howard Jacobson’s article for the New York Times about last year’s Labour Party conference, in which he asserted that “a motion to question the truth of the Holocaust was proposed” from the conference floor. There was no such motion: Jacobson simply made it up. “Failure to challenge and test the assertions made”? In December 2017, the Guardian published an interview with Israel’s public-security minister, Gilad Erdan, highlighting his claim to detect “anti-semitic views in many of the leadership of the current Labour Party.” At no point was Erdan challenged to provide evidence for this claim, and readers were given no information that might shed light on his credibility as a witness. Erdan is one of the most extreme, hawkish politicians in the most extreme, hawkish government in Israel’s history. He calls openly for the annexation of settlement blocs in the occupied Palestinian Territories (“the time has come to express our Biblical right to the land … it doesn’t matter what the nations of the world say”), opposes the very idea of a Palestinian state, and engages in racist incitement against Israel’s Palestinian citizens. Erdan is also the principal architect of Israel’s campaign against Palestinian solidarity activists, and rejects any distinction between a boycott of Israel in general and a boycott of goods from illegal settlements in the West Bank — a position that puts him at odds with liberal Zionists like Peter Beinart who oppose the BDS movement. By any objective standard, his slur on the Labour Party should be seen as an outburst from the lunatic fringe, not given pride of place in a liberal newspaper. There is also the tactic of rhetorical inflation, where the definition of antisemitism is stretched well past breaking point. Writing in the Times recently, Philip Collins gave a list of “recent examples” which “shames the Labour Party.” It included the following transgression: “The filmmaker Ken Loach said that Emily Thornberry, shadow foreign secretary, ‘didn’t distinguish herself” when she praised Israel as a beacon of freedom.” There you have it: anyone who denies that Israel should be seen as a paragon of democratic virtue is guilty of antisemitism.\nThe Chakrabarti Report Three examples from the past six months, selected more or less at random, that give an accurate flavor of the methodology used by Labour’s critics, from innuendo to outright fabrication. For a true picture of reality, we have to look elsewhere. Shami Chakrabarti’s 2016 report has been relentlessly trashed by hostile critics, most of whom seem not to have read it. The Labour MP Wes Streeting, whose own record of political achievement should not qualify him to lick the postage stamps on Chakrabarti’s mail, derided it as a “whitewash” last week. In fact, the report was a model of clarity and good sense. Its opening paragraph insisted that Labour was “not overrun by anti-semitism, Islamophobia or other forms of racism,” but noted that there was “clear evidence (going back some years) of minority hateful or ignorant attitudes and behaviours… I have heard too many Jewish voices express concern that anti-semitism has not been taken seriously enough in the Labour Party and broader left for some years.” Chakrabarti warned that some forms of antisemitic prejudice — association of Jews with money, suspicions of “dual loyalty,” etc. — could still be found in left-wing circles: “I am not saying that this is endemic, but any seasoned activist who says that they are completely unaware of any such discourse must be wholly insensitive or completely in denial.” She gave the examples of “a Labour councillor who was told that he would be particularly good at a finance role” and “an MP around whom rumours circulated that she was some kind of agent for Mossad,” in both cases because of their Jewish heritage. The report concluded with a set of recommendations that would improve the organizational climate if acted upon by party activists and officials. It was precisely because Charkrabarti had delivered such a thoughtful and constructive report that her reputation had to be traduced by those hell-bent on defaming Labour. The Community Support Trust (CST) initially gave the report a cautious welcome, thanking Chakrabarti “for her efforts and for her engagement with the Jewish community,” and emphasizing that the “final verdict” on her work would “depend upon its implementation.” Within months, the CST was describing the inquiry as “wholly compromised,” without ever having explained what was wrong with its findings. And as Richard Kuper pointed out, the Home Affairs Committee went out of its way to malign Chakrabarti on spurious grounds, while discreetly plagiarizing some of her recommendations.\nNo More, No Less Another report, from the Institute for Jewish Policy Research (IJPR), gives some useful data on the prevalence of antisemitic attitudes on the British left, as measured by opinion surveys. It found that “the political left, captured by voting intention or actual voting for Labour, appears in these surveys as a more Jewish-friendly, or neutral, segment of the population.” The IJPR considered “the absence of clear signs of negativity towards Jews” to be “particularly curious in the current context,” since there were “perceptions among some Jews of growing left-wing anti-semitism.” If we proceed from fact to opinion and not the other way round, it is surely the perceptions of “growing left-wing anti-semitism” that appear curious and in need of explanation, not the “absence of clear signs of negativity.” It may be argued that the IJPR report measured the attitudes of Labour voters, not party activists, and thus cannot show whether antisemitic views are more prevalent among paid-up members than the wider left-wing electorate. One answer is to take the people who declare themselves to be “very left-wing” — 3.6 percent — as a rough proxy for the Labour membership, which is about 1 percent of the adult population in Britain. The IJPR found this hard-left minority to be “indistinguishable from the general population and from the political centre” in their attitudes to Jewish people. The same was true for those who considered themselves “fairly left-wing” or “slightly left-of-centre.” Unless there is a yawning gulf between the Labour membership and every section of left-wing opinion in Britain, which seems most unlikely, the picture of a movement infested with antisemitic attitudes simply cannot be sustained. It’s worth noting the IJPR’s point that “the very left-wing are, on the whole, no more anti-semitic than the general population, but neither are they less anti-semitic … one might assume that those on the far left of the political spectrum would be more likely to hold anti-racist ideas than the population as a whole, but we do not find this to be the case with anti-semitism” This warning against complacency in left-wing circles should reinforce the points made by Shami Chakrabarti in her report. Of course, we need to put our own house in order, and shouldn’t be satisfied if Labour’s problem is no worse than that of the society in which it is embedded. As Charkrabarti argued, a left-wing party should hold itself to a higher standard and go the extra mile to create a welcoming space for people from all ethnic backgrounds. But complacency is hardly the main danger for anyone who relies upon the British press to inform them. Wild exaggeration and bad-faith attacks are the surest way to provoke knee-jerk dismissal by left-wing activists of all concerns about antisemitism — especially when those attacks come from pundits and politicians who are up to their necks in rancid bigotry.\nLobbying Power If the evidence against the prevailing narrative is overwhelming, how has it managed to gain so much traction? For some of Corbyn’s supporters, there’s a simple explanation: the power of the “Israel lobby” in British politics. This is an argument that needs careful unpacking. There’s no question that the attacks on Corbyn are linked to his support for Palestinian rights. It’s best to see that position as just one strand of his heterodox line on foreign policy, and the ensuing attacks as part of a wider effort to drive Labour back into line. The concept of the “Israel lobby” has been imported from the US, where it was the subject of a celebrated essay by John Mearsheimer and Stephen Walt. This is not the place to discuss whether Mearsheimer and Walt’s thesis holds up in the light of subsequent developments. In the British context, we can identify several strands of pro-Israeli opinion whose combined weight is formidable. Whether those strands are best described as a coherent “lobby” is not especially important. First, you have campaigning groups like BICOM whose explicit purpose is to support Israel. They reinforce the diplomatic efforts of the Israeli state itself, which works tirelessly to influence Britain’s political class in its favor. Then there are organizations like the Board of Deputies and the Jewish Leadership Council (JLC) whose stated purpose is to represent the Jewish community in Britain, but which also campaign in support of Israel. Finally there is a much wider layer of politicians, journalists, and other people of influence who take a pro-Israeli line, including the Labour and Conservative “Friends of Israel” groups that count so many MPs among their adherents. For people in this cohort, support for Israel is usually not the core of their political identity: it’s just one element in the mix. Pro-Israel Labour MPs, for example, tend to share a wider set of positions, pro-NATO, pro-Saudi and pro-Trident. They also prefer the economics of George Osborne to those of John McDonnell (or even Gordon Brown). There’s no reason to doubt people in this third strand would still support Israel even if the first two were marginal or nonexistent. The “Israel lobby” is not a deus ex machina forcing British foreign policy onto a completely different path. If Israel had never existed, but all other things were equal, Britain would still pursue an aggressive, militarized, neo-imperial policy in the Middle East as a junior partner to Washington. The “friends of Israel” at Westminster give the same backing to Turkey in its oppression of the Kurds — or Saudi Arabia in its war on Yemen — as they give to Israel’s occupation of Palestinian land, without any equivalent “Turkish lobby” or “Saudi lobby” to encourage them. Support for Ankara and Riyadh is part of the Atlanticist package, and that is the decisive factor.\nOutriders What really sets Israel’s British supporters apart is their capacity to smear critics of the foreign-policy consensus at Westminster. This is where they provide an invaluable service for the conservative establishment. Turkey’s AKP regime routinely accuses its Western critics of Islamophobia and anti-Turkish racism, but if anyone tried to repeat those charges in a British context, it would sound very odd. In any case, there is no particular taboo against Islamophobia in the country’s political culture: the ruling party can run an openly racist campaign against a Muslim candidate without facing any consequences, and the defense secretary can remain in his post after defaming a Muslim cleric as an ISIS supporter. Charges of antisemitism, on the other hand, are politically toxic. Pro-Israel groups take advantage of this to slander their opponents, and have their accusations signal-boosted by the right-wing press. To complete the loop, anyone who points this out is bitterly denounced as an apologist for bigotry. Politicians who support Palestinian rights tend to be left-wing and critical of British foreign policy in general, so defenders of the status quo have every reason to assist the smear campaigns against them. The alliance with Saudi Arabia is just as vital for Britain’s power elite as the alliance with Israel, if not more so. But the attacks on Corbyn for his criticism of Riyadh are strikingly flaccid and ineffectual. There are no pro-Saudi equivalents of Jonathan Arkush, the president of the Board of Deputies. It was the Board of Deputies and the JLC that called the recent protest against the Labour Party on Parliament Square. When Jonathan Arkush attacked Corbyn, the British media largely accepted his claim to speak on behalf of Britain’s Jewish community and denounced any criticism of the protest as an attack on that community, even — or especially — when it came from British Jews. This is a man who congratulated Donald Trump on his victory, bemoaned Theresa May’s lost majority in the 2017 general election, and welcomed her alliance with the far-right Democratic Unionist Party. Arkush is by any standards a deeply conservative, partisan figure, and his hostility towards the Labour leadership must be seen in that light. With the power to condemn goes the power to absolve. Sometimes this means taking action, as with the message to Trump, glossing over the antisemitic undertones of his campaign. Sometimes it is enough to do nothing. When the Telegraph used its front page to promote lurid conspiracy theories about George Soros, Arkush was notably silent. Soros-mania is one of the main channels for the rehabilitation of traditional antisemitic tropes in Europe today. The Telegraph’s endorsement of those tropes was a very alarming development, but an attack on its editor for complicity with antisemitism is not the kind of story Britain’s right-wing press is likely to embrace. Leveling the same charge against Jeremy Corbyn is a very different matter. This is the real value of the “Israel lobby” for Britain’s conservative elite: its willingness to serve as a third rail for those who challenge Atlanticist orthodoxy. This ability to smear dissenters hinges on the support it receives from much more powerful interests in British politics and media. Israel’s supporters are not an external force that has bent the British ruling class to its will. They are the outriders of that class.\nCranks and Comrades Insinuations of antisemitism can be used, not merely to defame critics of Israel, but to discredit any radical critique of capitalism or imperialism in the modern world. That much is clear from reading the sleazy hit-job by two academics published in the New Statesman, dressed up in pseudo-Marxist verbiage to conceal its true purpose, like a bank robber in a clown suit. This widely praised article depicted Labour’s social-democratic reform program as a quasi-genocidal plan to “identify the guilty parties held to be personally responsible for the current malaise, and to remove them from the organic community of the productive.” The most important thing when faced with such tawdry attacks is to keep our nerve and refuse to be browbeaten. But there are other steps that can be taken too. Shami Chakrabarti’s report contained some very sensible recommendations about language: she urged left activists to “use the term ‘Zionist’ advisedly, carefully and never euphemistically or as part of personal abuse,” and to “resist the use of Hitler, Nazi and Holocaust metaphors, distortions and comparisons in debates about Israel/Palestine in particular.” If that advice had been taken to heart, some of the controversies of the past two years could have been avoided. In particular, everyone should read the article by David Rosenberg of Jewish Socialist Group about the most virulent of those controversies, which was provoked by the former London mayor Ken Livingstone with his comments about Hitler and Zionism in 2016. Rosenberg shows with great clarity why Livingstone’s intervention was wrong, foolish, and politically disastrous. Anyone who wants to make the case for Palestinian solidarity can learn some wider lessons from that fiasco. There have also been several articles by left-wing writers urging Labour supporters to up their game on antisemitism and learn about the ways it can be expressed in coded form. This is all good advice, and would still be good advice if there had been no media furor to cope with. But sometimes these arguments are accompanied by loose talk about “cranks” with a “fixation on Israel” who have to be “rooted out” or “marginalized.” I’ve seen this kind of language used by some Corbyn supporters on social media often enough for it to be worth addressing. The problem with “crankery,” like its near-neighbor, “sectarianism,” is that it’s very much in the eye of the beholder. Any left-wing argument, no matter how thoughtful, persuasive, and well-documented it is, will be derided as a “conspiracy theory” by journalists who nonetheless see the hand of Russia behind everything they dislike, from Black Lives Matter to the Catalan independence movement. Anyone who has not been involved in Palestine solidarity activism should be very cautious about applying the “crank” label to those that have. There can be few fields of political activity where so much toxic — and highly personalized — abuse is directed at activists whose only motivation is to the support the democratic rights of an oppressed people. I say this partly because I have some experience of working for the Palestine Solidarity Campaign in Ireland. The conditions for that work were unusually favorable, as support for Palestinian rights was considered perfectly legitimate in the political mainstream. If we wanted a meeting with politicians from the center-right parties, we just had to ask, and they always gave us a respectful hearing. Even so, Israel’s Irish supporters had untrammeled access to the national media whenever they wanted to slander us. I can only imagine the strains of doing similar work in a country like Britain, where the mainstream consensus is strongly pro-Israel, over a long period of time. It’s bound to have a distorting effect on the perspective of many activists. Those distortions should be criticized when necessary, but always with a generous spirit, and a recognition that “tone-deafness” comes in many different forms.\nThe Gaza Massacre Just four days after the anti-Corbyn protest in London, the Israeli army carried out a bloody massacre of Palestinian demonstrators in Gaza. The Board of Deputies rushed to blame the victims for the slaughter, and the Labour MP Stella Creasy, one of Corbyn’s most strident critics, gave her own version of the same line. It is some measure of Creasy’s racist myopia that she seemed to think she had condemned the IDF by presenting its butchery as a “response to violence” that may not have been strictly “proportionate.” Corbyn, on the other hand, did condemn the massacre: “The killing and wounding by Israeli forces of civilians demonstrating for Palestinian rights in Gaza is appalling.” His statement should have been more robust, and should have been accompanied by clear demands for action by the British government. But this is still the kind of language Israel’s rulers aren’t used to hearing from governments in the West. On paper, Corbyn’s position on Israel/Palestine isn’t especially radical. His call for a two-state solution is supposed to be the mainstream view in Europe. But most politicians express that view in the most insipid language, refusing to call the occupation by its proper name. They urge the Palestinians to engage with a fraudulent “peace process” whose only purpose is to allow Western governments to support Israel to the hilt while pretending otherwise. And they ignore every statement from Israeli politicians in which they spell out their determination to keep hold of the land that has been occupied since 1967. A “two-state solution” as envisaged by Israel and its Western allies would really be a “one state, several Bantustans solution,” with some pitiful fragments of the West Bank handed over to a supine Palestinian leadership to administer on Israel’s behalf. The longer Israel is shielded from any kind of effective pressure by euphemistic phrase-mongering, the more likely this outcome will be. A politician like Corbyn, who is willing to speak bluntly about “the oppression of the Palestinian people,” poses a real challenge to this agenda. There is nobody in such close proximity to power in a major Western state with a comparable record of support for Palestinian rights. That’s why Corbyn and his allies have been slandered so relentlessly for the past two years. The primary goal of this campaign is to destroy Corbyn altogether; the secondary goal is to deter him from talking about Palestine in terms that will discomfort the Israeli elite.", "url": "https://www.jacobinmag.com/2018/04/jeremy-corbyn-antisemitism-labour-party"}