{"authors": ["Terry Hersom For The Journal"], "date_download": "2020-05-04 20:05:25", "date_modify": "2020-05-04 20:05:25", "date_publish": "2018-04-17 01:00:00", "description": "SIOUX CITY -- All the years I’ve been writing about sports, nothing rivals my ongoing appreciation for historical perspectives. And, that will be my biggest regret regarding the rogue...", "filename": "_e6f887d969f146fc9625f89f6376e010_1588622725.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e6f887d969f146fc9625f89f6376e010_1588622725.html", "title": "HERSOM: Rain washed away more than events", "title_page": "HERSOM: Rain washed away more than events", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SIOUX CITY -- All the years I’ve been writing about sports, nothing rivals my ongoing appreciation for historical perspectives.\nAnd, that will be my biggest regret regarding the rogue blizzard that invaded mid-April over the weekend, essentially wiping out the 54th running of the Sioux City Relays.\nYes, lots of competition failed to take place. This happens every spring to a large number of Siouxland track meets.\nWhat I truly hated was that three of the finest track and field athletes our area has ever known were denied opportunities to take their richly deserved bows as newcomers to the Sioux City Relays Hall of Fame.\nThey’ve all won plenty of other awards and still others are yet to come, no doubt, for Megan Glisar-Wegher, Tyler Mulder and Darwin Vande Hoef. Even though organizers are hopeful of saluting them all again when Western Iowa’s premier track carnival unfolds again next year, I couldn’t let this pass without a little follow-up.\nI’ve served on the hall of fame committee ever since these honors were first conceived in 1989. As a sidebar, we’ve made our selections for the last 20 years or so after a small luncheon at North Park Senior Living, where the incomparable Dwight Hauff was our host for many years. And even though Dwight passed away at age 104 in 2009, North Park has still graciously allowed us to uphold our tradition.\nWe have a very knowledgeable and caring group of track and field lovers who’ve worked hard each and every year to come up with two or three (we did induct four in 2007) new additions to a remarkable group of athletes, coaches and contributors.\nOne of our primary rules is that we at least postpone selection of any inductee who doesn’t agree to be present to receive their award. Not counting a handful of posthumous honorees like 1924 Olympic gold medalist F. Morgan Taylor, I can only recall one individual who failed to show up.\nBeyond paying tribute to special people, the committee wants to show our participants and our audience just how special some of the folks involved in this event truly are.\nHaving said all of this, I believed this year’s hall of fame class was probably the best from a lot of very fine classes. It should have led to a mid-day Saturday salute worthy of goose bumps and even a few tears. Because even though they all went on to do so much more, I can recall being misty-eyed simply covering some of the state and/or Drake Relays titles they all made it possible for me to report.\nGlisar-Wegher was the first Iowa girl to ever win four consecutive state high jump titles during her prep career (2006-09) at Sergeant Bluff-Luton. She wound up winning an NAIA national championship at Morningside and then established herself as one of the premier jumpers in NCAA Division I track, posting first-team All-America finishes of fourth and sixth after transferring to the University of South Dakota.\nMulder blossomed as a high school senior at Orange City Unity Christian, breaking the Class 2A record with 1:54.79 as a state champion in the 800 meters. Good as that was, it couldn’t have foretold the more than 10 seconds he slashed off that personal best, clocking 1:44.34 during an unrivaled University of Northern Iowa career that saw him earn 11 Missouri Valley Conference titles, eight All-America finishes and an NCAA Division I crown.\nThen, there was Vande Hoef, one of the finest all-around athletes Iowa high school sports has ever known. A three-time state high jump champ for Rock Valley, his prep best of 7 feet, 2 inches in 1989 is still tied for second best ever in the state nearly 30 years later. A six-time state champ, counting hurdles events, he also won four times at the Drake Relays. In fact, he’s still the only Iowa high school boy to win three individual events at “America’s Athletic Classic.”\nAll three of these athletes went on to compete very well at the professional level. Glisar, whose P.R. is 6 feet and three-quarters of an inch, placed as high as third at the USA Indoor Nationals in 2014 while Mulder finished fourth at the Pan-Am Games in 2011 and Vande Hoef wound up fifth in the decathlon at the 1997 USA Outdoor Nationals.\nMoreover, all three have moved on to very rewarding adult lives.\nGlisar-Wegher, the wife of former NFL running back Brandon Wegher, is a mother of two who will complete work next spring on a doctorate in audiology.\nMulder has launched a career in coaching, building an impressive first-year track team at Hawkeye College near Waterloo. That team, which had been scheduled to join their coach here, qualified 16 athletes, all freshmen, for last month’s National Junior College Athletic Association indoor nationals.\nVande Hoef is now living in the scenic Los Angeles suburb of Seal Beach, hugging the Pacific coastline, and he’s employed by Insperity HR Services.\nCertainly, one of the other potential thrills we missed with Mother Nature’s latest retort to “global warming” was an opportunity for Kingsley-Pierson/Woodbury Central’s Nick Phelps to break the impressive records he set last year in both the shot put and discus events -- throws of 64-3 and 186-10 (old marks were 58-11 and 178-0).\nPhelps, in case you missed it, just cranked out a national-best discus spin of 196 feet, 2.5 inches last Tuesday at Harlan. A season that may become the most abbreviated ever in our state was just getting started and here was a throw that ranks fifth on the state’s all-time list. And, this followed an shot put heave of 66 feet and one-quarter inch at an indoor meet in March -- fourth best ever by an Iowa prep.\nPhelps’ discus effort is barely 10 feet shy of a 30-year-old state record of 207-8 by Mason City’s Scott Crowell, an NCAA champ for Iowa State in 1981. The only other Iowans to exceed the K-P/WC star’s new P.R. have been Newton’s Chase Madison in 2004 (206-9), Iowa Valley’s Mike Goad in 1981 (204-10) and Northwood-Kensett’s Tom Yezek, a current UNI sophomore who set the all-class state meet record of 197-5 two years ago.\nIf not for two Iowa preps who threw 67-0 and 66-2 just last year, Phelps’ shot put mark would trail only the 50-year-old state record of 70 feet, 11 inches set by Cedar Rapids Jefferson in 1968. Just last season, though, Mount Vernon’s Tristan Wirfs had the 67-0 and Epworth Western Dubuque’s William Blazer threw his 66-2. Wirfs, you’ll probably recall, started at offensive tackle as a true freshman at Iowa last fall.", "url": "https://apnews.com/e6f887d969f146fc9625f89f6376e010"}