{"authors": ["Peter Huguenin", "The Columbus Telegram"], "date_download": "2020-05-04 20:16:10", "date_modify": "2020-05-04 20:16:10", "date_publish": "2018-12-27 06:00:00", "description": "Keeping track of David City senior Macy Svoboda is a full-time task. On the field, off the field, in the classroom, around school and around time, Svoboda is in high demand. Her athletic...", "filename": "_d992f217d0d24c4abe68f1d2cd68c6df_1588623370.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d992f217d0d24c4abe68f1d2cd68c6df_1588623370.html", "title": "Macy Svoboda excels on and off the court", "title_page": "Macy Svoboda excels on and off the court", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Keeping track of David City senior Macy Svoboda is a full-time task. On the field, off the field, in the classroom, around school and around time, Svoboda is in high demand.\nHer athletic schedule includes volleyball, basketball and track. Her extracurricular memberships include Stay U, the speech team, National Honor Society, Fellowship of Christian Athletes, dance and more school clubs almost too numerous to list.\nIn a sense, she’s like many high school students looking to get a leg up her next phase in life. In another, she’s very different.\nWhether discussing strategy with her teammates during a game or discussing how to complete the next project with fellow club members, Svoboda is constantly finding a way to lead from the front.\n“Not only is she involved in so many things, but she is the leader of every single group that she’s a part of,” said head basketball coach Nathan Wall. “I don’t believe there’s anything as a natural-born leader. Leadership is a decision, and she has decided to be the leader and be the role model in everything she touches.”\nWith such a busy schedule, it’s not always easy for Svoboda to balance every activity. It requires the help of teachers and coaches working together to ensure they each have their own share.\nThat has often meant moving practice or meeting times around, but Svoboda’s support system has been happy to help\nCurrently, she’s in the middle of her third varsity basketball season. Svoboda has been a staple at the point guard position since her sophomore year.\nThrough the first month, David City is 2-4. Svoboda is second on the team with six points per game, tops in steals and the only Scout who as recorded a 3-pointer.\n“Macy is our heart and soul,” Wall said. “Her first year, that team only won two games. She was really part of the rebuilding project when we changed our system of play.\n“She has the pulse on the team, what our culture is like, what our chemistry is like. She’s just been through so many games and has so much experience. She’s really the heart and soul and pulse of this team.”\nLast year, David City more than tripled its wins from the previous season totaling seven and has already won twice in the first six games of the 2018-19 campaign.\nSvoboda’s love for basketball started a young age, around six or seven as she can recall.\nShe has spent time honing her skills, going to summer camps in the offseason, such as the Mike Trader’s camp in Columbus, and more recently basketball camps at Concordia University.\n“I just kind of like the team aspect of basketball and being able to play with others and helping my team and being able to participate with other people,” Svoboda said. “I also like how I can rely on my teammates and be able to trust all my teammates.”\nThere are many skills that make Svoboda an asset to David City basketball, but according to Wall, there is an aspect in particular that has given opposing teams the most trouble - her ambidexterity.\n“That really throws people off,” Wall said. “She’s right handed, but she’s so good with her left. She’s pretty explosive going to the hoop, really good in transition, good passer and she’s worked hard to improve her shooting. I think she’s made something like 1,300 3-pointers this summer.”\nWhile Svoboda enjoys playing basketball, track is possibly her best sport.\nShe is a three-time state qualifier, last year participated at Burke in the 100-meter hurdles and the long jump where she was 12th out of 26.\nIn 2016 she qualified for the 400-meter relay as a freshman.\n“For track, it’s mainly myself. I can push myself and I know my limits and I know I can go past those if I need to,” Svoboda said. “In track, I really like being able to push myself, but there’s also me knowing that when I push myself and I place and I get medals, I’m also helping out my teammate with the team points.”\nSvoboda said her coaches have described her as competitive, coachable and a team player, and that she has excelled in athletics and clubs because of her family and coaches support.\nThat competitiveness is best explained in a story Wall likes to recall about a certain pregame guarantee Svoboda made in the locker room.\n“Before one game last year against an opponent, Macy said she was going to break a girl’s ankles. She was going to cross her up so bad to break the girl’s ankles. I just kind of shook that off as a high school kid talking, but during that game she actually did it,” Wall remembered. “She actually did give a girl a move that made her fall her down and, so-called, break her ankles. Macy was the first girl I’ve ever coached to call her shot.”\nWhen, though rare as it is, she finds a free moment in her schedule, Svoboda most often spends it around family. Some of her favorite activities include visiting grandpa’s farm and shooting with dad, whether it be firearms or bow and arrow.\nEven a simple meal around the table together is something she never takes for granted.\nThat family connection is a big reason Svoboda has grown into the player and person she is.\n“Macy Svoboda is as good as it gets,” Wall said. “She comes from a great, close-knit family where she’s been taught the difference between right and wrong, and values, and the value of hard work. Her parents are two of the greatest people I’ve ever known.\nBeing a senior at David City High School, Svoboda already has her eyes set on the future. While she has offers to run track at some schools in South Dakota and Nebraska Wesleyan, her first option right now might be to give up sports and become a business or interior design student at Nebraska.\nNot surprisingly, family has influenced that decision as well. Svoboda’s aunt is an interior designer. Her father owns a convenience store.\n“Macy is going to be an extremely successful person in whatever she decides to do because she has a great work ethic,” Wall said. “She knows that everything in this life is earned. There’s nothing given to her, and she understands how to work for what she wants.\n“She’s also a very kind person. She’ll be able to do whatever she wants to do because of that.”\nPeter Huguenin is a sports reporter for The Banner-Press. Reach him via email at DVDsports@lee.net", "url": "https://apnews.com/d992f217d0d24c4abe68f1d2cd68c6df"}