{"authors": ["Thomas Jewell", "Special To Cleveland.Com"], "date_download": "2020-05-04 20:06:04", "date_modify": "2020-05-04 20:06:04", "date_publish": "2018-11-06 22:52:48", "description": "Community meeting set to address Shaker High School staffing changes SHAKER HEIGHTS, Ohio -- While they won't be discussing specific personnel issues, school officials will hold a community...", "filename": "_36dfa8be501d4ef0a2d080c43b471413_1588622764.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_36dfa8be501d4ef0a2d080c43b471413_1588622764.html", "title": "Community meeting set to address Shaker High School staffing changes", "title_page": "Community meeting set to address Shaker High School staffing changes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Community meeting set to address Shaker High School staffing changes\nSHAKER HEIGHTS, Ohio -- While they won’t be discussing specific personnel issues, school officials will hold a community meeting Thursday (Nov. 8) to address any staffing concerns amid recent controversy at Shaker High School.\nThe meeting is scheduled for 6:30 p.m. in the large auditorium at the high school, with questions taken by Interim Superintendent Stephen Wilkins and David Glasner, who was appointed interim high school principal on Nov. 1.\nThat move came as high school Principal Jonathan Kuehnle was placed on administrative leave, “effective immediately” and pending the conclusion of a review.\n“We remind you that discussion of personnel matters is limited in accordance with board policy,” a Shaker Heights City School District statement released Monday (Nov. 5) announced.\nSchool officials added that Kuehnle’s administrative review is not criminal in nature.\n“We also want our families to know that issues with the principal on administrative leave do not involve police matters, and that the safety and well-being of our students has never been in question,” the district release stated.\nMeanwhile, the high school is also dealing with the departure of head football coach Jarvis Gibson after eight years.\nGibson had been placed on administrative leave Oct. 23, then resigned three days later, prior to the team’s final game of the season.\nAccording to the student newspaper, The Shakerite, Gibson came under fire because of criminal convictions against one of his assistants, who was coaching the team this year as a volunteer.\nIt remains to be seen whether supplemental contracts will be renewed for the rest of Gibson’s assistant coaching staff.\nAnd after 23 years, varsity cheerleading coach Vikki Long, along with an assistant, resigned last month after allegations of “body shaming” a cheerleader who had requested a larger uniform, according to reports from local TV stations with whom the girl’s mother spoke directly.\nThe mother brought the allegations to the Oct. 9 school board meeting, although a district email to members of the cheerleading squad, obtained by The Shakerite, stated that an investigation was already under way.\nDistrict officials added that Long was planning to retire from coaching after this year anyway, although she will continue to work for the district as a secretary in the athletic department.\n“This past month has been challenging for our high school community -- for our students, student athletes, staff and families,” Wilkins noted in a Nov. 2 district email.\nWilkins then formally announced that Glasner, a former principal at Shaker Middle School and currently the district’s executive director for curriculum and instruction, would be moving over to the high school as its substitute principal.\n“To be clear, our schools are still strong,” Wilkins added. “However, the district is not immune to challenges -- and when they occur, we must follow clearly defined processes and procedures before taking any necessary corrective action.”\nGlasner followed up a short time later with his own email, saying that he enjoyed being back in a school setting and “reconnecting Friday (Nov. 2) with many familiar -- and now taller -- students from my days as the middle school principal.”\nIn his new assignment, Glasner said, “my job is to ensure that high school operations continue to run smoothly” pending Kuehnle’s placement on administrative leave and subsequent review.\nKuehnle has been principal at the high school since July 2016. He previously was campus director at Springfield High School in the Springfield City School District in west-central Ohio.\nKuehnle also was district grants administrator for the Pickaway County Educational Service Center for the Circleville (Ohio) City Schools.\ncleveland.com reporter Cliff Pinckard contributed to this article.", "url": "https://apnews.com/36dfa8be501d4ef0a2d080c43b471413"}