{"authors": ["Marty Myers", "Staff Writer"], "date_download": "2020-05-04 20:20:26", "date_modify": "2020-05-04 20:20:26", "date_publish": "2018-02-18 00:00:00", "description": "All you can ask for from a sports official is consistent and fair. Clarks Summit’s Marty Boyer has always been that, and much more. Now, it would be nice for the community to show their...", "filename": "_f8eee542b3ab4748abf83477ed091fc0_1588623626.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f8eee542b3ab4748abf83477ed091fc0_1588623626.html", "title": "AROUND TOWN: Event Set For Boyer", "title_page": "AROUND TOWN: Event Set For Boyer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "All you can ask for from a sports official is consistent and fair. Clarks Summit’s Marty Boyer has always been that, and much more. Now, it would be nice for the community to show their appreciation for what he’s done as a sports official and coach. Boyer has been diagnosed with cancer and is in a fight that makes an argument with a coach on the sidelines mere child’s play. The Scranton Chapter of Football Officials have already made the call for a fundraiser to help Boyer and his family. An event has been scheduled for March 24, 6-10 p.m., at the Clarks Summit Fire Company on Bedford Street, and two Go Fund Me pages have been started, one by the officials and another by a family friend of the Boyers. Even when he wasn’t working football games or wrestling matches, I always found that you could find Boyer wearing the white hat of a good guy — dating back to our college days at Lock Haven University. That continued as our paths brought us here, with Boyer not only wearing the striped shirt, but also touching lives as a junior high wrestling coach under John Diven at Abington Heights. Twenty years Boyer served as an assistant wrestling coach, even as the father of two girls. “He was a great coach, great with kids,” former AH athletic director Jim Warner said. “Kids loved him. “I never heard him yell, never heard him scream. He always had his kids prepared. He was dedicated, conscientious and a real people person.” State football rules interpreter Paul Sheehan echoed those sentiments. “He always has had a great demeanor, which you need for officiating,” Sheehan said. “He never loses his cool. He’s a great rules guy and always has lots of input at our rules meetings, and always in top physical shape.” That led to Boyer working a state football final in 2015 — he has two brothers who have worked finals, too — and had three state wrestling championships, in 2011, 2012 and 2013. “Professionally, he does a lot and a great job,” Sheehan said. “Personally, just a good guy, fun loving and a great, great teammate. “He’s a good soul and a great family man. It tears my heart out.” A lot of that sentiment going around, but here’s how you can do something to help someone who so deserves it. Tickets for the fundraiser are available at $25 a pop by contacting Gary Davis, 570-904-3114; Chuck Parry 570-351-5419; and Karl Lynott 570-343-2323. More info is on Facebook at Benefit for Boyer. Top-shelf entertainment and food will be on tap, with E.J. the D.J. entertaining and Lisa Armetta working her culinary magic. And since it is Sweet 16 weekend for the NCAAs, basketball fans can rest assured that will be covered with a big screen TV for watching the games. Donations for prize baskets and raffle prizes are also being accepted, as are sponsors who will be recognized at the event for a donation of $100 or more. Also, family friend Laurie Murdock Fiegleman has set up a GoFund Me page at Help Marty Boyer Fight Cancer, and you can donate there. Or donate and go! Tribute for Mecca Friends of the late Joe “Scappy” Mecca will conduct their second annual memorial tribute to the long-time Dunmore High School teacher, coach and PIAA sports official, April 2, beginning at 6 p.m. at Stirna’s Restaurant. For information contact Bill Schoen or Gino Tempesta. Contact the writer: mmyers@timesshamrock.com; 570-348-9100, ext. 5437; @mmyersTT on Twitter", "url": "https://apnews.com/f8eee542b3ab4748abf83477ed091fc0"}