{"authors": ["Matt Bufano"], "date_download": "2020-05-04 20:07:24", "date_modify": "2020-05-04 20:07:24", "date_publish": "2018-03-22 00:00:00", "description": "A good first impression goes a long way. For Wake Forest field hockey coach Jennifer Averill, it helped the Demon Deacons net an elite prospect. “My family and I were visiting some...", "filename": "_f3a5c41099fc40efa87dcc8af75af1f3_1588622844.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f3a5c41099fc40efa87dcc8af75af1f3_1588622844.html", "title": "Wyoming Seminary's Maxwell Picks Wake Forest", "title_page": "Field Hockey: Wyoming Seminary's Maxwell Picks Wake Forest", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A good first impression goes a long way.\nFor Wake Forest field hockey coach Jennifer Averill, it helped the Demon Deacons net an elite prospect.\n“My family and I were visiting some schools and we went out to Wake Forest unannounced,” said Forty Fort’s Hannah Maxwell. “I went to the coach’s office — coach Averill — and talked to her for an hour-and-a-half. That stuck with me from when I visited there. Taking my family and I in was pretty awesome.”\nAt that point in spring 2017, Maxwell was just one year into her varsity career.\nWhile she’s since visited about a dozen interested programs, the North Carolina college remained the top choice for Maxwell, who verbally committed last week to Wake Forest.\n“I’m just thankful that there’s schools that are interested in me and there was kind of options,” said Maxwell, a sophomore at Wyoming Seminary. “But I’m really excited to go there in the next two years and continue my academic and athletic careers, and hopefully do great things.”\nMaxwell was on the NCAA Division I radar even before high school, thanks to success with her club team, Electric Surge, on the indoor and outdoor travel field hockey circuit at showcases and tournaments.\nHoping to play in the Big Ten or ACC, Maxwell said Northwestern, St. Joseph’s, Duke and Rutgers were among the other schools she seriously considered.\nShe said Averill’s personality as well as the school itself, including its southern location and academic and athletic programs, made Wake Forest the top choice.\nMaxwell impacted the Wyoming Valley Conference as a freshman, when she led her division with 20 goals for coach Karen Klassner’s Blue Knights.\nThis past season, she played forward, midfield and defense at times, scoring 17 goals and 11 assists while helping Sem win the District 2 Class A championship and finish runner-up in the state. She made all-state and The Citizens’ Voice all-star team in back-to-back years.\nWhile the recruiting process for most student-athletes picks up in the next two years — when “official visits” become an option — Maxwell said she’s happy to have already made her commitment.\n“Basically for now, it’s pretty much over,” Maxwell said of recruitment. “Just gotta keep working on field hockey and keep my grades up.”\nAverill’s career record as coach of Wake Forest is 374-182-3 with three national championships in 26 years. The Demon Deacons were 12-8 in 2017.\nAverill entered last season No. 20 on the all-time wins list in NCAA D-I field hockey.\nMaxwell is the daughter of Scott and Donna Maxwell. She has a younger brother, Rorry, and older brother, Hunnter, who plays soccer for Wilkes.\nContact the writer: mbufano@citizensvoice.com; 570-821-2060; @CVBufano on Twitter", "url": "https://apnews.com/f3a5c41099fc40efa87dcc8af75af1f3"}