{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:05:21", "date_modify": "2020-05-04 20:05:21", "date_publish": "2018-05-11 15:00:00", "description": "Yvonne Murrell, 74, of Kankakee, passed away May 3, 2018, at Presence St. Mary’s Hospital in Kankakee. Visitation will be from 5 p.m. to 7 p.m. Monday, May 14, at Lax Mortuary, Kankakee. An...", "filename": "_c5a203a83f4e4c1d8db1fbfd0123b0e4_1588622721.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c5a203a83f4e4c1d8db1fbfd0123b0e4_1588622721.html", "title": "Yvonne Murrell", "title_page": "Yvonne Murrell", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Yvonne Murrell, 74, of Kankakee, passed away May 3, 2018, at Presence St. Mary’s Hospital in Kankakee.\nVisitation will be from 5 p.m. to 7 p.m. Monday, May 14, at Lax Mortuary, Kankakee. An additional time for visitation will be from 10 a.m. Tuesday, May 15, until the 11 a.m. funeral services at Greater New Hope Missionary Baptist Church, Kankakee. The Revs. John and Mary Tellis, of Denver, Colo., will officiate. Burial will be in Mound Grove Gardens of Memory, Kankakee.\nYvonne Murrell was born June 8, 1943, in Chicago, the daughter of Johnnie C. Murrell Sr. and Fatima I. Milai Murrell.\nShe grew up in Hopkins Park, attended Hopkins Park Schools and St. Anne High School and received her GED from Kankakee Community College.\nIn her younger years, she attended Rehoboth Mennonite Church, and after moving to Kankakee, she became a member of Morning Star Baptist Church. She worked with the youth in “The Judgment Day” play, which she wrote and received a copyright for, and other skits.\nShe had been employed at Manteno State Hospital, Riverside Medical Center and Texize Chemical.\nIn 1991, she relocated to Denver, Colo., for health reasons. There, she worked as a switchboard operator for the Veterans Administration and later was employed by Bayaud Industries as a supervisor at the Environmental Protection Agency. She also did home care. Yvonne relocated her oldest brother, Johnnie, from New York and cared for him.\nMs. Yvonne did much mission work in Denver, Colo. At times she would make lunches, take them to the park and feed the hungry, or wherever she found them, then minister to them.\nShe also cared for many children in her home throughout the years, one in particular whom she raised from 3 weeks old, Thasis, lovingly called “Ms. Hodo.”\nYvonne became an active member of Solomon Temple Baptist Church and served in various capacities, including Board of Trustees, New Members’ teacher, Director of Drama and Arts Ministry, Senior Mission, leading prayer meetings and was inducted into the church’s Mother’s Hall of Fame.\nShe leaves to cherish her memory, a daughter, Thasis Hodo and her fiance, Christopher Walton, of Orlando, Fla.; four brothers and two sisters-in-law, Cornell and Sharon Murrell, Alvin Murrell and Calvin Murrell, all of Kankakee, and Floyd and Alicia Murrell, of Nashville, Tenn.; four sisters and one brother-in-law, Edna Beard, of Philadelphia, Pa., Jeanette Muhammad, of Country Club Hills, Amonez and the Rev. Sammie Rover II, of Pembroke Township, and Sylvia Bell, of Kankakee.\nPreceding her in death were her parents; and five brothers, Johnnie Murrell Jr., Wendell Murrell, Kenneth Murrell, Vernon Murrell and Oreon Roberts.\nPlease go to laxmortuary.com to send condolences.\n(Pd)", "url": "https://apnews.com/c5a203a83f4e4c1d8db1fbfd0123b0e4"}