{"authors": ["Nicki Mayo"], "date_download": "2020-05-04 20:11:39", "date_modify": "2020-05-04 20:11:39", "date_publish": "2018-03-21 10:00:00", "description": "Mark Dombroski, a 19-year-old college athlete from Pennsylvania, was in Bermuda over the weekend for an international rugby tournament. The matches ended Saturday afternoon, and that night,...", "filename": "_be9ebf4c67cb4e38ac6ecffea0f62325_1588623099.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be9ebf4c67cb4e38ac6ecffea0f62325_1588623099.html", "title": "Mystery surrounds death of St. Joseph’s University rugby player in Bermuda", "title_page": "Mystery surrounds death of St. Joseph’s University rugby player in Bermuda", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mark Dombroski, a 19-year-old college athlete from Pennsylvania, was in Bermuda over the weekend for an international rugby tournament.\nThe matches ended Saturday afternoon, and that night, he, along with teammates and some of his relatives, stopped by a local watering hole. Then he disappeared.\nOn Sunday morning, a family member reported to police that Dombroski was missing. On Monday, his body was found in a moat at the base of a “significant drop” at Fort Prospect — a colonial-era fort in a park near a sports center where his team had played — Sean Field-Lament, the Bermuda Police Service superintendent, said in a news conference Tuesday.\nThe cause of death remains a mystery, and police have not ruled out any possible explanation, including foul play. “We really just don’t know why he was walking up there,” Field-Lament said.\nDombroski, who was from Media, Pennsylvania, and was a freshman at St. Joseph’s University in Philadelphia, was last seen by family and friends just after midnight Sunday morning at the Dog House, a popular restaurant and bar, according to authorities.\nPolice, who have been examining closed-circuit camera footage, said Dombroski was seen walking alone just after 1 a.m. Sunday, about a mile from the bar. He appeared to be using a cellphone. The last known documentation of Dombroski alive was at 1:30 a.m., as he was walking just south of where he was found — about 1 1/2 miles from the bar, police said Tuesday.\nOn Monday, before Dombroski’s body was discovered, his mother, Lisa Dombroski, pleaded for her son’s safe return during a news conference.\n“We dearly love our son and cherish our son,” she said while standing with her husband, John, and her other two sons, John and Kevin. “We want him back.”\nLisa Dombroski said she had reviewed the camera tapes and believed Mark was not feeling well because he had sustained a shoulder injury during a rugby match that day. At the bar that night, he “wanted to get going,” she said. He was not in a “celebratory kind of mood,” she said.\nOfficials believe there were people in Fort Prospect — where Dombroski’s body was found at 4 p.m. — just before the discovery, Field-Lament said. “We’d like them to come forward and help us.”\nPolice want every detail, he said, “no matter how insignificant it may seem to you.”\nA forensic pathologist from overseas is expected to conduct the autopsy Wednesday, Field-Lament said. But until those results are available, Field-Lament said he would not comment on how Dombroski may have died. He did say, however, that contrary to speculation on social media, Dombroski had not been bound or tied up. He also still had his wallet and cellphone.\nAsked about speculation that Dombroski may have been in a fight at the bar, or that he went to Fort Prospect to meet someone, Field-Lament asked that anyone making such claims contact police. “We all want to get to the bottom of what happened to Mark,” he said.\nField-Lament confirmed that the FBI had been involved since Sunday because Dombroski’s family has “a connection” to a former director of the FBI, but he did not identify the director. He added that the agency would have gotten involved anyway as part of the Bermuda Police Service’s protocol.\nIn a statement, St. Joseph’s University said the school’s community was “heartbroken” and offered “deepest sympathies” to Dombroski’s family and others close to him.\nOn Facebook, the school’s rugby team said it was “terribly saddened by the loss,” and called Dombroski a “true champion of the game.”\n© 2018 New York Times News Service", "url": "https://apnews.com/be9ebf4c67cb4e38ac6ecffea0f62325"}