{"authors": ["James Towney Jtowney Havasunews.Com"], "date_download": "2020-05-04 20:10:28", "date_modify": "2020-05-04 20:10:28", "date_publish": "2018-12-08 06:14:00", "description": "Sophomore Kendra Park scored two goals in the Lake Havasu girls soccer team’s 2-0 win over Kingman in its second game of the Mohave County Soccer Tournament at Lee Barnes Stadium on...", "filename": "_a493124a20834777b74dfe8b5633088d_1588623028.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a493124a20834777b74dfe8b5633088d_1588623028.html", "title": "Knights girls soccer split matches", "title_page": "Knights girls soccer split matches", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sophomore Kendra Park scored two goals in the Lake Havasu girls soccer team’s 2-0 win over Kingman in its second game of the Mohave County Soccer Tournament at Lee Barnes Stadium on Friday.\n“The girls are feeling pretty good right now,” Lake Havasu coach Josh Kistler said. “We came out here with confidence for this game. We weren’t on our game yet in the first half but they woke up in the second half, played a good game of soccer and finished it strong.”\nThe Knights opened up the scoring when Park grabbed the ball and found room for a big breakaway. Charging down the field, Park shot the ball and found the back of the net.\nPark then scored again off of a corner kick that found its way right to her. Park managed to get a foot on the ball and lob it in to put the Knights up for good.\nUp until that point, Park was responsible for all four of the goals Havasu scored in the tournament.\nThe Knights played again against Lee Williams later on in the day for their third game of the tournament and 3-2 to the Volunteers.\nThe game was knotted at one all going into the half. Havasu and Lee Williams each found the back of the net again, only the Volunteers scored again late in the game for the win.\nIn the tournament, Havasu is 2-1 and will look to contend for the championship when they play River Valley today at 2 p.m. The Knights have already beaten the Dust Devils this year with a 3-2 win on Nov. 27.", "url": "https://apnews.com/a493124a20834777b74dfe8b5633088d"}