{"authors": ["Adam Zielonka The Washington Times"], "date_download": "2020-05-04 20:05:53", "date_modify": "2020-05-04 20:05:53", "date_publish": "2018-03-01 16:55:33", "description": "Whether you're a child now or haven't been one for a long time, wouldn't you want to take a field trip sponsored by a professional sports league? The NHL hosted 20 fourth-grade students from...", "filename": "_1aeaa6486bdcee06e8cded0d88e8fbad_1588622753.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1aeaa6486bdcee06e8cded0d88e8fbad_1588622753.html", "title": "NHL behind-the-scenes field trip reveals mechanics of outdoor hockey", "title_page": "NHL behind-the-scenes field trip reveals mechanics of outdoor hockey", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Whether you’re a child now or haven’t been one for a long time, wouldn’t you want to take a field trip sponsored by a professional sports league?\nThe NHL hosted 20 fourth-grade students from Germantown Elementary School in Annapolis, who walked less than a mile from their school to Navy-Marine Corps Memorial Stadium on Thursday. They took part in the NHL/NHLPA “Future Goals” program two days before the Washington Capitals face the Toronto Maple Leafs in a stadium usually reserved for Navy football.\nWhat the fourth-graders learned about the mechanics of putting on an outdoor hockey game is likely just as new and valuable to a casual hockey fan who might turn on NBC to watch Saturday’s game. While the league works to make the on-rink experience identical to its standards, different equipment and processes are required to make it possible.\nMike Craig, the NHL’s senior manager of facility operations, taught the kids a lesson plan billed as “Ice Making 101” and fielded questions from “What time is the game?” and “Will there be figure skaters?” to more intricate inquiries.\nCraig showed the students the league’s mobile refrigeration unit at 53 feet long and a 300-ton capacity, the largest of its kind in the world. The trailer pumps ammonia and glycogen to the rink to keep it in the right condition. For the league’s first regular season outdoor game in 2003, the league used a temporary system, and it has added pieces onto the current unit over time.\n“Without this trailer, there’s no hockey rink out there, so it’s a pretty important piece,” Craig told the students.\nThe biggest concern among students and chaperones alike was the weather. Can it be too hot? Too cold? Too rainy? Craig said the weather is the league’s biggest concern, too. If it gets too cold, they can use in-line heaters; if it’s too warm, they’ll put down insulated tarps.\nThere shouldn’t be a problem on Saturday. On Thursday, the nighttime forecast for Annapolis was 37 degrees, right on par with the city’s average low temperature this time of year. The average temperature of the previous 24 NHL outdoor games was 34.9 degrees.\n“Rain can help up to a point,” Craig added as the group stood in a light drizzle. “It definitely doesn’t hurt, but if it gets too heavy then we’ll have to remove it. But at this point it’s just freezing as it comes.”\nIt took about a week to make the ice that now sits in the middle of the stadium. The ice resurfacer the league will use (made by Olympia, not Zamboni) was designed to be slightly lighter than standard ones to avoid too much stress on the rink. That’s even considering that the ice is twice as thick as usual.\n“In a normal NHL rink, it’s only about an inch-and-a-quarter thick,” Craig said. “Out here, because it’s temporary ... right now we did a measurement first thing this morning and we’re about 2.5 inches thick.”\nThe NHL used 350 gallons of white paint on the ice, but took a different approach for the rink markings and the logos of sponsors like Dunkin’ Donuts.\n“In lots of rinks in the NHL, we actually paint it,” Craig said. “But outside here, we found that it’s a little bit better to use a fabric, almost like a clothing cloth, that’s made that color. We lay it in and freeze it in.”\nThe kids toured the press box, broadcasters’ area, interview room and locker room and were surprised at the end of the trip with free tickets to Saturday’s game.\nThey also met Peter Bondra, who played 14 seasons with the Capitals and scored 503 goals over his NHL career. Bondra grew up in Eastern Europe and played hockey outside as a boy, but his only experience playing outdoors in America came in an alumni game in Pittsburgh ahead of the 2011 Winter Classic.\n“I can’t imagine if I was an NHLer and had to play an NHL game (outdoors), how I would prepare for the game,” Bondra said. “First of all, I’d need a feel for the ice and I want to know how we’re going to sharpen my skates. I might have a little bit different preparation than for a regular game because of the conditions.”\nBondra was happy to spend his time with the kids, saying that programs like “Future Goals” were important for the sport.\n“There’s no question that hockey’s growing, not just in the States and Canada. Hockey’s growing globally. Everywhere in the world, the Capitals have fans,” Bondra said. “It’s very important to have programs like this, and for the kids, (I’m) pretty sure it’s a great field trip for them to be a part of. They had a lot of questions about how, for example, how the ice is produced, how everything is working in a situation like this.”\nHe also shared his excitement for the Capitals’ upcoming game.\n“If I was a player looking at the schedule before the season, I would definitely circle that day, make sure I am able to be part of this,” Bondra said. “It’s got to be fun for the players. I can only imagine if I was in their shoes.”", "url": "https://apnews.com/1aeaa6486bdcee06e8cded0d88e8fbad"}