{"authors": ["Bill Biswanger", "Sun Outdoors Writer"], "date_download": "2020-05-04 20:09:18", "date_modify": "2020-05-04 20:09:18", "date_publish": "2018-07-28 21:07:50", "description": "On July 17, the Massachusetts Fisheries and Wildlife board of directors unanimously voted to appoint Mark Tisa, a native of Leominster, as the director of MassWildlife. \"Tisa was selected...", "filename": "_f7e7912430ef4595a57370530e0736da_1588622958.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f7e7912430ef4595a57370530e0736da_1588622958.html", "title": "Tisa a Good Choice to Head Mass. Fisheries and Wildlife", "title_page": "Tisa a Good Choice to Head Mass. Fisheries and Wildlife", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "On July 17, the Massachusetts Fisheries and Wildlife board of directors unanimously voted to appoint Mark Tisa, a native of Leominster, as the director of MassWildlife.\n“Tisa was selected “because of his lifelong commitment to wildlife and fisheries conservation and his excellent record of service to the agency and the Commonwealth,” Fisheries and Wildlife Board chairman Joseph Larson said after the meeting. “The board looks forward to working closely with Mark to achieve his goals for the agency in the coming years.”\nTisa began his career in 1987 with MassWildlife as the project leader of the Anadromous Fish Restoration Program. He was promoted to assistant director of Fisheries in 1990, and then to deputy director in 2015. Tisa has led a number of major initiatives over the years for the agency, including the Youth Pheasant and Young Adult Turkey hunt programs and the construction of the Mass Wildlife Field Headquarters in Westboro.\nUpon the retirement of former director Jack Buckley, he was appointed acting director, effective May 1.\n“I’m honored, humbled, and thrilled to be appointed to lead MassWildlife, where I have worked for 31 years,” said Tisa. “We at MassWildlife care about all the Commonwealth’s wildlife and plants, including state-listed species, and I look forward to continuing to work with hunters, anglers, trappers, conservationists, and all Massachusetts citizens to carry forward MassWildlife’s tradition of conserving and helping everyone to enjoy all our treasured wildlife resources.”\nI have talked with Mr. Tisa on several occasions and found him to be very approachable. We have talked mainly about trout as he spent many years working on the hatcheries that at one time were in great peril of failure. He got funding to bring on alarm systems in case water flow failed and the trout would die. He had people on call so the pumps could be fixed at each of the hatcheries.\nHe also just worked on a project that brought fresh water to the largest hatchery in the state. The mile-long underground project was years in the planning and provides water from the Swift River at a constant flow and temperature. So the trout should never be in peril.\nWe have also talked about the old days of the trout season when there was an opening day the third Saturday in April. “Those were the good old days, Bill. But times have changed and as much as I loved trout and I think we could go back to an opening day, it just would not work today,” Tisa told me.\n“Bass fishing is now the number one fishing sport in this state so we have to take care of what is most popular. It might not be what you and I like but it’s what the general public wants.”\nTisa has spent a lot of time fishing the local rivers, such as the Squannacook in Townsend and Groton. He also fished the Nissitissit in Pepperell. He frequented the Leominster Sportsmen’s Club and the Townsend Rod and Gun Club. “I was just a local kid so I went all over,” said Tisa. “I would have to say the Squannacook is my favorite.”\nTisa also is an upland game hunter and loves to hunt over a good dog. He has started programs for youth pheasant hunters with adults to get kids involved in the outdoors. Without the kids we have no future. So he wanted to get the kids started early.\nTisa can be found on Saturday mornings in his hunter orange out on a wildlife management area like every other hunter during the fall season. You may not recognize him out there but he can be found among the throng trying for a ringneck or a timberdoodle. Tisa also likes to chase ruff grouse.\nDirector Tisa grew up in Leominster. He earned a B.S. in Biology from Springfield College, an M.S. in fisheries from the University of Tennessee, a Ph.D. in Fisheries and Wildlife Sciences from Virginia Tech, and an MBA from Anna Maria College.\nBill Biswanger’s email is bboutdoor1@aol.com", "url": "https://apnews.com/f7e7912430ef4595a57370530e0736da"}