{"authors": ["Robert Avery"], "date_download": "2020-05-04 20:04:23", "date_modify": "2020-05-04 20:04:23", "date_publish": "2018-05-17 05:00:00", "description": "CROSBY - With a first name of Walker, it was apparently just a matter of time before Pasadena-First Baptist Christian Academy’s outfielder lived up to that name. Walker Draeger collected a...", "filename": "_62173aca6aff423c966e0539b6375de0_1588622663.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_62173aca6aff423c966e0539b6375de0_1588622663.html", "title": "Walk-off single sends FBCA to state championship game", "title_page": "Walk-off single sends FBCA to state championship game", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CROSBY - With a first name of Walker, it was apparently just a matter of time before Pasadena-First Baptist Christian Academy’s outfielder lived up to that name.\nWalker Draeger collected a walk-off single when he dramatically rolled a ball through the left side of the infield, scoring Dylan Heard with the winning run as the Warriors nipped Bryan Brazos 4-3 in a TAPPS Division IV state semifinal game at Crosby High School Thursday afternoon.\nBatting for the first time in the game because of a designated hitter, Draeger saw three pitches from relief pitcher Cooper Kay before connecting for his game-winner. He got swallowed up by his appreciative teammates behind first base as the Warriors clinched their second trip to a state championship game in four years.\nThe team will oppose El Paso Faith Christian for the state crown Friday night at 7 back at Crosby High School. The El Paso school eliminated Denton Calvary in its semifinal game 7-1.\nIt was appropriate that Heard was the one flashing across home plate with the winning run because he was outstanding in two-and-one-third innings of relief work on the mound.\nThe righthander faced seven batters and retired all seven. He struck out three and induced a pair of ground balls to each side of the infield.\nBut the most important batter he retired was his first one. Bryan Brazos had stolen the momentum from the Warriors by overcoming a 3-0 lead, tying the game in the fifth and putting two potential go-ahead runs in scoring position.\nThat ended starting pitcher Jake Sweeney’s day and brought in Heard from left field. On Heard’s first pitch, Kay and Parker Smith, the starting and losing pitcher, each stole a base to put the pair in scoring position.\nFacing Bryce Steel, the five-hole batter, Heard worked the count to 3-2 before inducing Steel to fly out to right field.\nSweeney certainly started out much better than his assignment in Giddings last week. He only allowed two baserunners through three-and-a-third innings.\nBut then the next four batters reached base as a bout with wildness crept into the picture. A hit batter and two walks led to Blake Griffin lining a single to center field, scoring two runs.\nThe Warriors caught a break when Trey Fisher overran second base and was tagged out or otherwise FBCA was looking at a Bryan Brazos runner in scoring position with just one out.\nSweeney took the hill in the fifth, but a one-out double and a two-out single tied the contest. After Sweeney issued his fourth free pass in three innings.\nBut Sweeney and Heard forced Bryan Brazos batters to go 1-for-7 with runners in scoring position.\nDraeger’s hit was just FBCA’s fifth of the game. Leadoff hitter Zach Dillard scored twice, including a balk call on Smith in the first.\nJesse Perry singled home Bailey Baird in the second inning and Sweeney singled home Dillard in the third, creating that 3-0 lead. Dillard had walked, stole second and went to third on a wild pitch.\nBut Smith promptly retired 10 of the next 11 batters. But when he walked Heard to start the seventh, he received the quick hook from the coaching staff, prompting Kay’s arrival on the mound and Walker’s walk-off single a few minutes later.", "url": "https://apnews.com/62173aca6aff423c966e0539b6375de0"}