{"authors": ["James Varney The Washington Times"], "date_download": "2020-05-04 20:22:02", "date_modify": "2020-05-04 20:22:02", "date_publish": "2018-09-11 21:05:12", "description": "With California poised to kick off its Global Climate Action Summit on Wednesday, a new report shows a network of environmental activists and donors working with governors and state attorneys...", "filename": "_8cc6b331f3cf6aaedd19b72118e8e246_1588623722.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8cc6b331f3cf6aaedd19b72118e8e246_1588623722.html", "title": "Competitive Enterprise Institute: Activists working with officials to advance green agenda", "title_page": "Competitive Enterprise Institute: Activists working with officials to advance green agenda", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With California poised to kick off its Global Climate Action Summit on Wednesday, a new report shows a network of environmental activists and donors working with governors and state attorneys general to advance their global warming agenda.\nThe picture that emerges is of state governments pursuing aggressive green policies through prosecutions and other executive strategies that they were unable to get through their legislatures or by taxpayers, according to the Competitive Enterprise Institute, a free market think tank.\n“What you have is a mercenary use of law enforcement powers,” said CEI senior fellow Chris Horner. “When you have the legal system working as an area of policymaking you have to ask, ‘how in the world did they begin to use law enforcement this way?’”\nMr. Horner says he discovered through public documents and information pried loose in litigation a consortium of blue-state leaders leveraging money and manpower of various nongovernmental organizations and environmental activists.\nThe environmental activists and donors agreed to foot the bills for personnel who would be attached to state government, and that outside groups write reports states can pass off as their own work, Mr. Horner concluded. In return, the governors appear on the forefront of the global warming fight and enjoy a closer relationship with major liberal donors.\nDraft contracts obtained by CEI explicitly state that the politicians will make hiring decisions that will be formally executed by the nonprofit which will then hire and house the “support functions” that are to be at the politicians’ disposal and direction. This arrangement was made possible by the “plethora of advocate and funder interest.”\nGovernors’ offices in New York, California and Washington didn’t respond to requests for comment, nor did the Hewlett Foundation, the biggest donor mentioned.\nCEI acknowledged they “do not know the full extent of this model’s use,” but said it is an extension of efforts by disgraced former New York Attorney General Eric Schneiderman to mulct energy companies and so-called “climate deniers.” That effort collapsed among media scrutiny, legal pushback and Mr. Schneiderman’s resignation after unrelated sex abuse accusations.\nThe donors, non-profits and public officials involved all stepped up their efforts after President Trump’s election, the records show.\nUnder the aegis of the “U.S. Climate Alliance,” Dan Carol, Mr. Brown’s senior aide for infrastructure and energy prepared a “PowerPoint presentation, which is titled ‘Climate Energy Outcomes for 2017-2021: U.S. Climate Alliance, [that] cites ’2018: $15 million ramps up work ($10 million passed through to consortium partners)’ and ‘2019: $30 million as we engage new governors, share deployment learnings, and drive a new national priorities debate ($25 passed through to consortium partners),’” according to the documents.\nIn the documents, Mr. Carol estimates the amount of money spent on groups pursuing global warming policies as $1 billion annually.\nWhile taxpayer money does not appear to have been directly spent on the governors’ effort, Mr. Horner contends hundreds of hours were spent by government employees in framing and coordinating the concept.\n“It appears that the authors of this campaign both wrote and transmitted the proposal to donors to fund a 501(c) 3 for the governors’ policy advocacy use while using public offices and resources in their roles as public employees.”\nCEI released its report on the eve of Democratic Gov. Jerry Brown of California hosting a three-day climate meeting in San Francisco. Mr. Brown this week also signed legislation to require California to get all of its energy from renewable sources in the next 27 years, and to move up the deadline for when the state must get half of its energy from such sources to 2026, four years earlier than the previous marker.\nThe meeting’s agenda doesn’t discuss the coordination Mr. Horner alleges, but it does tout the gathering as a chance for like-minded folks to work to “to fulfill the Paris Agreement and the United Nation’s Sustainable Development Goals.”\nMr. Trump announced last year he was withdrawing the U.S. from the Paris Agreement, the most recent sweeping global warming plan of the U.N. that was signed in 2015.\nWhile green activists assailed the decision, the Paris agreement is also coming under scrutiny. The Climate Action Network reported recently that most of the European signatories “are failing to work towards delivering on its objectives.”", "url": "https://apnews.com/8cc6b331f3cf6aaedd19b72118e8e246"}