{"authors": ["Staff Writer"], "date_download": "2020-05-04 21:06:37", "date_modify": "2020-05-04 21:06:37", "date_publish": "2018-06-12 17:28:00", "description": "Dear Annie: I am feeling so desperate, angry and frustrated. I deal with depression, and my brother is certainly not helping matters. I am 65. I cannot do a lot of lifting because of back...", "filename": "_89189911847a4e80a8143546f90eb4d5_1588626397.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_89189911847a4e80a8143546f90eb4d5_1588626397.html", "title": "Setting personal boundaries", "title_page": "Setting personal boundaries", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dear Annie: I am feeling so desperate, angry and frustrated. I deal with depression, and my brother is certainly not helping matters. I am 65. I cannot do a lot of lifting because of back problems, so I wait for my grandkids to come and help me when they can, which is not so often as I’d like.\nMy brother thinks I am a hoarder. He tells me that I have obsessive-compulsive disorder and that I need to deal with my problems. My brother is an alcoholic but does go to Alcoholics Anonymous and has not imbibed for over 20 years. Every time we get together, he is rude and sarcastic and will not stop the conversation when I tell him that he is not my counselor and that my issues are my business and not his.\nI do not feel that I’m a hoarder by any means. I will admit that I have accumulated things over the years and that this has gotten out of hand, but my home is not filthy or toxic. My downstairs area is not accessible at this time because I have been sorting through my things. I have taken several bags to The Salvation Army. I have thrown many things away. And some of the items I’ve kept will be set up for a rummage sale this summer. If these items do not sell, they are going. This is not good enough for my brother.\nI was going to my own counselor, but she retired at the end of April. She was awestruck with some of the things that my brother has said and done. Now he wants us to go to counseling. The problem is that I’m so tired of his abuse that I just don’t want to be around him anymore. My brother has no concept of what personal boundaries are. What is your response to all of this? -- Want Peace Back in My Life\nDear Want Peace: You are right that these are your issues, not your brother’s. He might be trying to help, but forcing his version of help upon you clearly isn’t helping anyone. The good news is that it doesn’t matter too much if he has no concept of personal boundaries, because the person who sets your boundaries is you. You get to decide how often you talk to your brother and how many of his comments you take to heart. Peace is within your power.\nThat being said, it does sound as though clutter is getting in the way of your life. Your items have rendered a floor of your house inaccessible, and you admit that it’s gotten out of hand. If you have a desire to address that issue, you don’t have to wait until your children or grandchildren come by to help. Consider hiring a personal organizer or senior move manager to sort out your belongings and move things into storage. You can also call a junk removal service for the items you have no use for.\nEven more important than addressing your clutter, however, is treating and managing your depression. Your therapist should have referred you to someone else when she retired. Follow up with her for some names. If you can’t get in touch with her, the American Psychological Association offers a psychologist locator tool on its website. Psychology Today offers a similar tool: https://www.psychologytoday.com/us/therapists.", "url": "https://apnews.com/89189911847a4e80a8143546f90eb4d5"}