{"authors": ["Parker Gabriel Lincoln Journal Star"], "date_download": "2020-05-04 20:22:43", "date_modify": "2020-05-04 20:22:43", "date_publish": "2018-09-09 22:30:00", "description": "Life as a playcaller is pretty good when you have a quarterback who can threaten a defense with his arm and his legs. Scott Frost has had that in each of his past five seasons holding the...", "filename": "_da15b0649f32499f93dab78d20082160_1588623763.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_da15b0649f32499f93dab78d20082160_1588623763.html", "title": "Playmaking quarterbacks and other notes from NU's season-opening loss", "title_page": "Husker Extra Rewind: Playmaking quarterbacks and other notes from NU's season-opening loss", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Life as a playcaller is pretty good when you have a quarterback who can threaten a defense with his arm and his legs.\nScott Frost has had that in each of his past five seasons holding the play card, but Nebraska fans were reintroduced on Saturday afternoon against Colorado as freshman Adrian Martinez made play after play either in designed run situations or by extending a play with his legs.\nNow, of course, Martinez, the coaching staff and Husker fans all wait for word on the severity of Martinez’s apparent right knee injury, suffered late in the fourth quarter. If he misses time, clearly the Huskers’ depth at the position becomes razor thin.\nFor those outside the program, though, the first look in a live setting — outside of April’s Red-White Spring Game — at sophomore walk-on Andrew Bunch showed that NU’s back-up is comfortable playing in a similar way.\nHe’s not the game-breaking athlete Martinez is, but Bunch, in just 3 minutes, 29 seconds of action down the stretch, showed an ability to get out of the pocket, keep his eyes downfield and make plays.\nThere are a couple of throws he would like to have back, of course. Senior receiver Stanley Morgan had a step on a corner route on second down with 13 seconds to play but Bunch’s throw carried through the back of the end zone. That’s a long, difficult throw, but it’s the kind that sometimes must be made in order to win a close game. If it’s thrown a half-beat earlier, maybe Morgan has a chance.\nBut Bunch never even gets the chance to make that one if he doesn’t avoid pressure two plays earlier, range far to his left and deliver a third-down strike to Morgan for 25 yards when NU absolutely had to have it.\nThe Thompson’s Station, Tennessee, native played in this kind of offense in high school and also at Scottsdale (Ariz.) Community College before transferring to NU before last season. He said Saturday he’s approached the past nine months as if he’d be counted on to play.\nThat much was clear in his short time on the field Saturday. He couldn’t get the Huskers into the end zone for a game-winning score, but his training and his preparation showed. A holding penalty and a JD Spielman drop marred the first drive Bunch took part in after Martinez was hurt, and a procedure penalty immediately after Morgan’s 25-yarder cost the Huskers their final timeout with 19 seconds remaining.\nAs Martinez’s status remained uncertain Sunday, there are certainly tools to work with if Bunch is needed going forward.\nBut there are also situations in which Martinez simply made plays that others probably could not.\nTake his 41-yard touchdown run in the first quarter, for instance. With the ball on the left hash mark, Martinez had freshman running back Maurice Washington lined up to his left and all of his eligible receivers aligned to the field (wide) side. The way Washington was aligned originally, a run play would typically go to the field. But NU liked its numbers into the boundary and changed the play from the sideline and Martinez flipped Washington to his right before the snap. CU made an adjustment, moving cornerback Delrick Abrams over toward the boundary, but Martinez still likely knew that, if he decided to keep the ball, he would have only Abrams to beat.\nThat’s how it worked, and the freshman quarterback made a quick cut inside, leaving the senior corner grasping at air. From there, Martinez simply outran a pair of defenders down the sideline and dove over the front pylon for a touchdown.\nWe don’t know exactly what Frost and Martinez were thinking on the play, but what a luxury to be able to deploy all of your skill talent to one side, see how the defense reacts and then decide whether to use it or tell your quarterback, “All you have to do is beat one guy and then it’s a footrace.”\nHow long until the pair is doing that again? That’s the answer everybody waits on.\nCovering your bases: Erik Chinander did use several sub groups through Saturday’s season-opener, but the NU defensive coordinator appears to have a deep trust in his base alignment.\nTime will tell if that’s a season-long trend or more a CU-specific game plan, but Chinander wasn’t afraid to stick with base even on an afternoon that saw Buffs quarterback Steven Montez throw the ball 50 times.\nNU played a bit of nickel in the first half and incorporated it more – and also a 2-3-6 dime look – down the stretch, but also played base in clear passing situations like a second-and-19 in the third quarter.\nEvery coordinator has his go-tos, and Husker fans will learn what Chinander likes best over time. One thought: The way Chinander’s linebackers played Saturday, it’s no big surprise he leaned extensively on a true 3-4 look.\nMasking the rush: Nebraska racked up seven sacks against the Buffs, including four on third-down plays. Over and over again, Chinander would show six defenders right at the line of scrimmage to make it difficult to discern who was actually rushing and who was dropping into coverge. He brought every number from three to six at different times.\nDefensive personnel notes: When the Huskers did go to nickel or dime, a variety of players filled those spots. The Huskers at times added an extra safety – Deontai Williams and Aaron Williams – or an extra corner (Cam Taylor). In a couple of spots late, they added one of each.\nOn Saturday, NU had five players who essentially played every down: Corners Lamar Jackson and Dicaprio Bootle, safety Tre Neal and outside linebackers Luke Gifford and Tyrin Ferguson. The dime stuff did take the outside backers out for a snap here and there – and Alex Davis got an occasional rep – and Neal briefly exited at one point, but those five played more than anybody else.\nUp front, the camp talk of rotating heavily was no joke. Mick Stoltenberg, Damion Daniels and Peyton Newell all manned the middle for multiple series and the Huskers rolled through nine defensive linemen in all.\nSafety saw regular rotation, too, as Aaron Williams played significant snaps in a rotation with Antonio Reed, while Deontai Williams was mostly in during sub-group situations.\nWilson first off the bench for offensive line: When center Cole Conrad went down in the middle of the first quarter, Greg Austin slid Tanner Farmer from right guard to center and subbed in sophomore Boe Wilson at right guard.\nWilson finished that drive and stayed in for the next even though Conrad came back in, giving Farmer a breather. Wilson also saw time on two later drives, finishing, unofficially by the Journal Star’s count, with 21 snaps. That puts Farmer at 68 snaps total (62 at right guard, six at center), while left tackle Brenden Jaimes, left guard Jerald Foster and right tackle Matt Farniok each played all 83.\nSkill groupings: Nebraska didn’t dip as deep as it could have into its skill groups on Saturday, and it will be interesting to see how usage unfolds in the coming weeks. All sorts of factors matter – game situation, game plan, health, etc. – but NU used its top three receivers (Morgan, Spielman and Mike Williams) heavily, Tyjon Lindsey a fair amount and Bryan Reimers for two snaps.\nThe Huskers used three running backs (Greg Bell, Devine Ozigbo and Maurice Washington) and three tight ends (Jack Stoll, Austin Allen and Kurt Rafdal).\nHere’s how NU’s receiving targets shook out: Morgan led with eight, followed by Spielman at seven and Williams five. Stoll, Bell, Ozigbo and Washington had two apiece and Rafdal one.\nLindsey was not targeted in the passing game and had two carries for 9 yards.\nFourth-and-short failures sting: NU missed two fourth-and-shorts in the second half. Frost said afterward that he didn’t want to get cute with the play calls because the Huskers had been churning away on the ground all day.\nOn those two snaps, Colorado loaded 10 and nine men into the box, respectively, and just had too many hats near the ball for the Huskers to successfully account for and handle.\nChunk plays: Nebraska had 15 offensive chunk plays (six passes and nine runs), defined as a pass of 15-plus or a run of 10-plus. Colorado had 13 (nine passes and four runs).\nLife on the corner: You want to know what it’s like to be a Big Ten cornerback? Consider Dicaprio Bootle’s Saturday afternoon. The Nebraska sophomore by and large played physically, helped consistently in run support, broke up two passes and didn’t have any obvious coverage busts.\nBootle also, though, was in coverage on two Laviska Shenault catches for 77 total yards in two critical moments that set up second-half scores. A third-and-15 late in the third quarter went for 37 yards and led to a touchdown. Then a 40-yarder on CU’s last offensive snap turned out to be the game-winning score. On both plays, CU put Bootle in position to have to cover a ton of ground and he took away everything but a perfect throw from Montez to the fast, physical, 6-foot-2, 220-pounder. The margin between making a big play and giving one up can be very small.\nA Land-man wrecking crew: CU sophomore linebacker Nate Landman gave NU all kinds of headaches on Saturday. He finished with a game-high 13 stops (two for loss) and made several big plays. The reigning Pac-12 defensive player of the week made a case for a second straight honor by forcing Greg Bell’s first-quarter fumble, intercepting Martinez in the fourth quarter and stopping Bell behind the line on a fourth-and-2. Basically, he was everywhere.\nMore on NU’s own talented linebacking corps coming up this week.", "url": "https://apnews.com/da15b0649f32499f93dab78d20082160"}