{"authors": ["The Herald-Dispatch"], "date_download": "2020-05-04 20:04:19", "date_modify": "2020-05-04 20:04:19", "date_publish": "2018-02-27 17:15:00", "description": "The Herald-Dispatch IRONTON, Ohio — The Lawrence County Sheriff’s Office has made another arrest concerning threats made to a local school, Sheriff Jeff Lawless said Tuesday. On...", "filename": "_9fdcc6a43df246b4892d88923fc1d8df_1588622659.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9fdcc6a43df246b4892d88923fc1d8df_1588622659.html", "title": "Girl arrested for threats made against Fairland school", "title_page": "Girl arrested for threats made against Fairland school", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Herald-Dispatch\nIRONTON, Ohio — The Lawrence County Sheriff’s Office has made another arrest concerning threats made to a local school, Sheriff Jeff Lawless said Tuesday.\nOn Thursday, Feb. 22, the Fairland High School contacted the sheriff’s office concerning a threat, Lawless said, and school officials continued to work with detectives to develop a case against the suspect, a female juvenile student of Fairland, who had been on suspension from school since the threat was made.\nAt around 8:30 a.m. Tuesday, deputies arrested the girl at her home on warrants for one count of Unruly/Delinquency by Terroristic Threats and one count of Unruly/Delinquency by Inducing Panic, Lawless said.\nThe girl’s arrest comes on the heels of two other threats traced back to local students in recent days following a shooting that claimed 17 lives at a Florida high school.\nLast week, the sheriff’s office had made an arrest on the threat toward the Rock Hill schools and the Coal Grove Police Department made an arrest on a threat toward the Dawson Bryant schools.\nLawless said his office continues to investigate threats toward Symmes Valley schools and Chesapeake schools.\n“Parents and students should realize that nearly everything that is put out over a computer or cellphone is traceable back to the person who sent it,” Lawless advised Tuesday. “There is a misconception that some sites are not traceable and ‘disappear’ in a few seconds but the truth is, once it’s out there it does not go away.\n“Making a threat is not a joke, there is nothing funny about it and doing so could result in your arrest.”", "url": "https://apnews.com/9fdcc6a43df246b4892d88923fc1d8df"}