{"authors": ["Steve Cahalan For The La Crosse Tribune"], "date_download": "2020-05-04 20:11:38", "date_modify": "2020-05-04 20:11:38", "date_publish": "2018-01-21 08:00:00", "description": "HOKAH, Minn. — With more than three decades of experience in the food industry, Barb Kappauf says the healthier food and homey atmosphere at her new Tas-Tee Shoppe soup and sandwich shop have been...", "filename": "_12190bfe1af745a0858fdcbe34b3d9e5_1588623098.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_12190bfe1af745a0858fdcbe34b3d9e5_1588623098.html", "title": "Food industry veteran opens soup and sandwich shop in Hokah", "title_page": "Food industry veteran opens soup and sandwich shop in Hokah", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HOKAH, Minn. — With more than three decades of experience in the food industry, Barb Kappauf says the healthier food and homey atmosphere at her new Tas-Tee Shoppe soup and sandwich shop have been well-received by Hokah-area residents.\nShe opened her new business Jan. 3 in a small building at 211 Main St. that formerly housed a Head Start program, behind the Hokah City Center building (the former Hokah Elementary School), which houses city offices. The city of Hokah owns both buildings and leases the smaller one to Kappauf.\nKappauf also manages the Hokah City Center’s kitchen, which is used to prepare food for events (such as parties, business meetings and wedding receptions) booked at the center.\nBefore opening Tas-Tee Shoppe, Kappauf operated the Sidewalk Cafe at 46 Main St. in downtown Hokah from 2013 until she closed that business at the end of December.\nIt was time to do something new in a new location, Kappauf said. Her menu at the Tas-Tee Shoppe offers healthier fare than she had at the downtown cafe, she said. The new menu is “totally different” than her old one, she said.\nFor one thing, there’s no deep fryer at the Tas-Tee Shoppe, so Kappauf’s french fries are made with an air fryer, and her doughnuts are baked rather than fried.\nOpen Monday through Saturday, the soup and sandwich shop has a menu board that lists several signature sandwiches that are available daily. Such as The Cuban, featuring smoked pork, salami, sliced ham, Swiss cheese, pickles and a secret sauce on a ciabatta bun; a pork melt sandwich made with shredded pork, Swiss cheese and cranberry horseradish sauce on toasted marble rye bread; a grilled salmon patty sandwich made with grilled Texas toast and a mayo dill sauce; and Barb’s Deluxe Egg Salad sandwich on a hoagie bun.\nKappauf plans to begin offering wrap sandwiches and salads in about a month, and will continue to add to her menu. “I want to have things on it that nobody else around here has,” she said.\nShe has two or three soups available each day, such as chicken dumpling, baked potato, bean, cheesy broccoli, vegetable beef and chili. “The chili is available each day throughout the winter,” Kappauf said, adding that “I make a great chili. I’ve won four chili cook-offs in town with it.”\nThe soup and sandwich shop also has daily specials, such as an open-face turkey sandwich with mashed potatoes, stuffing and gravy; spaghetti; and baked chicken.\nOn Fridays, the fish special gives diners a choice between broiled and pan-fried fish.\nKappauf said pizzas are coming soon; she hopes to begin serving them in the next few weeks. “They’ll be different, specialty pizzas that I like to make,” she added.\n“I have homemade cinnamon rolls every day,” Kappauf said. And each day she has two kinds of pie, and a selection of pastries and other desserts. Her biggest-selling pies are sour cream raisin, lemon meringue and pecan.\nOne of Kappauf’s most popular varieties of baked doughnuts is made with a Snickers candy bar in the center.\nShe plans to offer ice cream novelties – such as ice cream sandwiches and malt cups – in the warmer months.\n“We also offer low-sodium alternatives,” Kappauf said of her menu. Beverages include fruit punch, lemonade, iced tea, soda pop, coffee beverages and hot chocolate.\nThe Tas-Tee Shoppe also sells the creations of local crafters, Kappauf said. So far, those items include sugar scrubs, handmade jewelry, postcards, crocheted hats and T-shirts.\n“We’re also handicapped-accessible,” Kappauf said, with handicapped-accessible bathrooms and designated parking spots for handicapped persons.\nShe runs the business with the help of her nephew, Justin Langen. “He’s my right-hand man,” Kappauf said.\nThe soup and sandwich shop’s interior has a country theme, with lots of country decor. It can seat about 30 people at its dining room tables and chairs –\n“When people come in here, they get that relaxed, at-home atmosphere,” Kappauf said of the furniture in her eatery. “That’s what I wanted. I’ve gotten all positive feedback. People love the environment in here.”\nCustomers can dine in or carry out, and Kappauf also offers catering.\nShe plans to hold a grand opening celebration sometime this spring.\nKappauf, who is 56, has been in the food industry – mostly cooking at restaurants and cafes – since she was 19. She was raised on a farm between Hokah and Caledonia.\n“I like the small-town support and the caring that people here in Hokah show,” she said. “This is a giving community.”", "url": "https://apnews.com/12190bfe1af745a0858fdcbe34b3d9e5"}