{"authors": ["Alan Greenspan", "John R. Kasich"], "date_download": "2020-05-04 20:15:03", "date_modify": "2020-05-04 20:15:03", "date_publish": "2018-04-18 05:00:00", "description": "The last half of the 1990s witnessed a remarkable time for America. It was an era of extensive business growth that created jobs, increased wages and productivity gains spurred by unprecedented...", "filename": "_cd3f6132cba6425c99daab83a7c7ce82_1588623303.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cd3f6132cba6425c99daab83a7c7ce82_1588623303.html", "title": "America’s debt time bomb has a short fuse", "title_page": "America’s debt time bomb has a short fuse", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The last half of the 1990s witnessed a remarkable time for America. It was an era of extensive business growth that created jobs, increased wages and productivity gains spurred by unprecedented technological advances. The federal government did its part to support those good times with a series of far-reaching fiscal and policy reforms that helped improve life for millions of Americans. We know, because we were there.\nLegislative landmarks of that era included historic welfare reform, the Balanced Budget Act of 1997 and privatization of government-controlled assets. In addition, decision-makers in Washington restrained government spending, cut capital gains taxes and began a serious effort to control entitlement costs.\nThe result was a virtuous cycle that generated growing tax revenues and led to the first federal budget surpluses in decades, allowing the Treasury to begin paying down debt held by the public. In fact, there were fears that we might actually pay down too much debt, which led some in Washington (including the authors) to urge using the surplus to solve pressing structural issues with the major entitlement programs. For example, from our separate positions at the time, both of us called for providing Individual Retirement Accounts. We knew then — as it remains abundantly clear today — that demographics would soon catch up with any “surpluses” in entitlements, as an older and grayer America continues to grow and available resources dwindle.\nWashington’s economy-boosting achievements of the 1990s were made possible by good-faith bipartisan cooperation between all branches of government and across-the-aisle give and take in Congress. Most important, these reforms and the cooperative spirit that produced them were projected to last far into the future. Sadly, they did not.\nFiscal-policy decision-makers who followed over the succeeding 16 years — in the White House and in Congress — failed to keep what they had been given. Their failures had many causes: the endless costs of nation-building, unpaid-for tax cuts, growth-killing business regulations, widespread reversal of reforms and creation of a major, new entitlement that wasn’t paid for. What had been a virtuous cycle of savings, investment and productivity growth soon evolved into a one-way, upward path of consumption and debt, with government spending that more than doubled in less than 20 years.\nThe result of these failures, combined with a deep recession when the housing bubble burst, was an economic impasse that has brought us to where we are today: trillion-dollar deficits and an astounding federal debt held by the public that now exceeds $15 trillion — and growing. Worse, present-day decision-makers in Washington have failed to learn from the past. According to the president’s budget proposal, our national debt will exceed $29 trillion in 2028. But that projection almost certainly understates the effects of the Bipartisan Budget Act of 2018, which increases spending to an extent that the Committee for a Responsible Federal Budget fears could add more than $2 trillion to the national debt. That’s an unimaginable mountain of debt we are leaving to our children, their children and generations beyond, while all of us will have to live now with debt’s immediate and widespread consequences.\nAccording to the Congressional Budget Office, such a large and growing federal debt crowds out national savings, and, hence, investment and, we infer, productivity growth in the long term. Moreover, increasing the government’s interest payments also crowds out other essential programs, limiting our ability to respond to unforeseen events and pushing us ever closer to the likelihood of a full-blown financial crisis.\nIn addition, the timing of these budgetary failures is fueling a perfect storm for large numbers of Americans, coming at a time when 74 million baby boomers are retiring, and when the Social Security and Medicare programs continue to grow. This makes entitlement reform a key component — perhaps the essential component — in Washington’s battle against debt.\nIt is well past time for leaders in Washington to get serious about meaningful spending restraint that begins to rein in our national debt. Their discussions should start with ways to begin dealing with the costs of entitlements — Medicaid, Medicare and Social Security — the greatest contributors to spending and debt. These are steps we stood firmly behind in the early 1990s, and we are calling for them even more strongly today.\nWe simply cannot allow this debt to grow. Controlling entitlements is the essential first step. Congress will find many who are ready to help, including the Congressional Problem Solvers Caucus within its own ranks and state governors who are required to balance their books in every budget cycle. In fact, 28 states have already called for a balanced budget amendment to the U.S. Constitution.\nTime is running short, and America’s debt time bomb continues to tick. The president, his treasury officials and congressional leaders on both sides of the aisle need to take action without delay on meaningful — and sustainable — steps toward entitlement reform. We’ve played this deadly serious game before, and the last time we thought we had won. But those accomplishments proved unsustainable, undermined as they were by partisan politics and an uncontrolled appetite for spending. This time, we cannot afford to fail.\nGreenspan was chairman of the Board of Governors of the Federal Reserve (1987-2006), and Kasich, governor of Ohio governor since January 2011, served as a member of Congress (1983-2001) and was chairman of the House Budget Committee (1995-2001).", "url": "https://apnews.com/cd3f6132cba6425c99daab83a7c7ce82"}