{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:09:00", "date_modify": "2020-05-04 20:09:00", "date_publish": "2018-10-21 10:37:39", "description": "LOWELL -- Candidates for state representative in two districts will meet in debates this week. On Wednesday night, candidates in the 22nd Middlesex District debate starting at 7 p.m. at the...", "filename": "_fcfd9fd084994605815eaaf501e1361c_1588622940.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fcfd9fd084994605815eaaf501e1361c_1588622940.html", "title": "State Rep Candidates to Debate in Billerica, Wilmington", "title_page": "State Rep Candidates to Debate in Billerica, Wilmington", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- Candidates for state representative in two districts will meet in debates this week.\nOn Wednesday night, candidates in the 22nd Middlesex District debate starting at 7 p.m. at the Billerica Senior Center. Republican incumbent Marc Lombardo is challenged by Democrat Chris Tribou, and Matthew Mixon, who lists his affiliation as “Second American Revolution.” Lombardo and Tribou have accepted the invitation; Mixon has declined.\nThe seat represents the town of Billerica.\nThe debate is sponsored by The Sun and Billerica Access Television. The one-hour debate will be moderated by Tom Zuppa, The Sun’s managing editor/days. The event is open to the public. BATV will rebroadcast the debate.\nOn Thursday night, candidates in the 19th Middlesex District will debate at Wilmington High School.\nThree candidates, all from Tewksbury, are seeking to succeed Rep. Jim Miceli, who died in April. They are: Republican Pina Prinzivalli, Democrat David Robertson, Miceli’s former aide, and independent Patricia Meuse. Robertson won a five-way primary in September, earning a ballot spot.\nThe district represents Tewksbury precincts 1, 1A, 2, 2A, 4, 4A and Wilmington precincts 1, 2, 4, 5, 6.\nThe debate will be broadcast live on Wilmington Community Television. Debate partners are The Sun, Wilmington-Tewksbury Chamber of Commerce, Wilmington Apple and Your Tewksbury Today. Sponsors are EBW Coin and Neighborhood Parcel Corp.\nCandidates will be questioned by Robert Hayes of Wilmington Apple, Bill Gilman of Your Tewksbury Today, and Cassia Burns of the Town Crier. Zuppa will moderate.\nThe debate starts at 7 p.m. The public is invited.", "url": "https://apnews.com/fcfd9fd084994605815eaaf501e1361c"}