{"authors": ["Eric Heisig"], "date_download": "2020-05-04 20:11:37", "date_modify": "2020-05-04 20:11:37", "date_publish": "2018-02-26 18:01:00", "description": "The road from computer whiz to creepy hacker: North Royalton man accused of spying on thousands CLEVELAND, Ohio — Awkward and eccentric, that's how friends and former classmates of Phillip...", "filename": "_d265f10213f04419838ba15015cfeeb6_1588623097.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d265f10213f04419838ba15015cfeeb6_1588623097.html", "title": "The road from computer whiz to creepy hacker: North Royalton man accused of spying on thousands", "title_page": "The road from computer whiz to creepy hacker: North Royalton man accused of spying on thousands", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The road from computer whiz to creepy hacker: North Royalton man accused of spying on thousands\nThe road from computer whiz to creepy hacker: North Royalton man accused of spying on thousands\nCLEVELAND, Ohio — Awkward and eccentric, that’s how friends and former classmates of Phillip Durachinsky described the man they once knew.\nNowadays, he’s known as a cyber-creep and federal prosecutors want him locked up for more than a decade. The North Royalton native has already spent a year behind bars, charged with spreading voyeuristic malware to thousands of computers and using it to spy on unsuspecting men, women and children.\nWhile it was a secret for more than half his life, the revelation didn’t come as a complete surprise to at least one former classmate.\n“From what I knew of him then, he seemed like the kind of reclusive person who would do what he did,” said Nik Krieger, who attended North Royalton High School with the suspect.\nThe FBI says Durachinsky, 28, conducted illicit cyber activities for 14 years. How he put his technical capabilities to work is shocking – essentially spying on unwitting victims, sometimes watching and listening while the victims were at their most vulnerable.\nOnce downloaded, the malware – which cybersecurity analysts named “FruitFly” – allowed him to take over while the user had no idea what was going on. While sitting behind a “control panel,” Durachinsky could perform a variety of tasks, from virtually rifling through and stealing a person’s files to logging what a person typed on a keyboard, according to the FBI.\nIf that weren’t disturbing enough, FruitFly also allowed Durachinsky to turn on a computer’s microphone and camera and make audio and visual recordings, charging documents state.\nDurachinsky has pleaded not guilty to the charges.\nCybersecurity analysts were familiar with Durachinsky’s work for a year before the federal government publicly said he was the mastermind behind FruitFly. They were intrigued because the malware targeted both Apple and Microsoft-based computer systems – a bit of a rarity since Microsoft has a bigger market share of personal computers and is thus targeted more frequently.\nThey were also confounded that the worm went undetected for so long.\nLike the man accused of developing it, why it wasn’t discovered sooner is part of the mystery.\n“There’s nothing that really stands out from a complexity perspective,” said Mark Nunnikhoven, an Ottawa-based analyst and vice president of cloud research at Trend Micro. “What stands out is the defendant was able to write it and use it for so long without it being detected by the security community.”\nThe whiz\nDurachinsky lived in the Cleveland area all his life. His family’s house, a modest ranch off a busy road, is one-and-a-half miles from North Royalton High School, where he graduated in 2007 and where his interest in computers was nurtured.\nHigh school friends and classmates described him as socially awkward. Such a trait is not uncommon for teenagers, but interviews showed that he never truly grew out of it.\nHe cared little about his appearance and cut his own hair, his former schoolmate Krieger said. Durachinsky was a nice guy but “one of those kids who was very smart but didn’t have any drive to apply himself,” Krieger said.\nStill, he was a computer whiz in an early age.\nPhillip Walsh, another high school friend, recalled Durachinsky creating video games for class projects using the software program Flash.\n“He was really self-motivated to teach himself on computers,” Walsh said.\nDurachinsky was a member of the school’s computer club and helped a team win first place at Baldwin-Wallace College High School Computer Programming competitions in 2007, according to a Sun News article from that year.\nThe budding programmer told the reporter that he was developing software to make a computer read music, something he himself could not do.\n“It’s about teamwork, knowing your strengths and weaknesses to help the team,” Durachinsky said at the time. “I’ve been surprised at how well we’ve done.”\nBut even then, stories of Durachinsky working alone to use programming prowess for darker purposes circulated. A rumor spread among classmates at the time that Durachinsky had hacked into his school’s computer system. As with any rumor, the specifics varied on who recounted it.\nThose tales could not be confirmed by cleveland.com. Greg Gurka, the school district’s superintendent, said he would not discuss Durachinsky’s time as a student.\nOn to Case Western\nDurachinsky’s interest in computers led him to Case Western Reserve University. Like in high school, classmates said his computer skills stuck out. As did his awkwardness.\nBill Flaherty, who attended school with Durachinsky, said the programmer looked exactly like he does in the mugshot that circulated after his indictment: long hair and goatee. Flaherty said Durachinsky was quiet but was really funny once he opened up.\nDurachinsky was in the university’s philosophy club that met weekly at a coffeehouse. Flaherty said Durachinsky was interested in the philosophy behind mathematics. Once, Durachinsky hosted a screening of “The Big Lebowski,” Flaherty said.\nDuring his junior and senior years, he lived in a suite on campus with eight others. Mark Syvuk, one of his suitemates described Durachinsky as “nice but a bit eccentric.”\nHe recalled going into Durachinsky’s room on one occasion. He didn’t see much in the way of personal belongings, save for a lot of empty Dr. Pepper boxes.\nThere was also a computer.\n“I remember asking him about it and he said, ‘Well, what else do I need?’” Syvuk said. “He had his computer, which he can do everything with, apparently.”\nDurachinsky graduated from Case in 2012 with a degree in physics.\nLaunching Fruitfly\nWhile his classmates and friends knew about Durachinsky’s classroom and public activities, Durachinsky kept the true use of his skills private.\nA Jan. 10 indictment says Durachinsky hacked into computers as far back as 2003, when he was in his early teens. It didn’t stop until his arrest last year.\nDurachinsky accessed thousands of computers owned by local, state and federal governments, a police department, schools, companies and various people, the indictment says. One of the computers belonged to a subsidiary of the U.S. Department of Energy.\nThough the government hasn’t publicly said how it believes Durachinsky hacked into so many computers, hackers have long been able to find ways to install malicious software on people’s computers without permission. For example, hackers have sometimes exploited a vulnerability on a network where computers can send and receive files.\nOnce inside, a hacker can control a computer. Durachinsky broke into multiple computers at the same time and was able to look at images and information from several computers at once, authorities say.\nInvestigators said he kept a lot of the data he stole. When the FBI began its investigation, agents found that the computers, hard drives and vaults it seized had more than 20 million files that Durachinsky had amassed.\nDurachinsky used this unfettered and unwelcomed access in a variety of ways, according to authorities – listening in on conversations and recording videos that constitute child pornography.\nHe saved images of his victims’ tax, banking and medical records, photographs, internet searches and other “potentially embarrassing communications and data,” the indictment states. This included when somebody searched online for pornography.\nDurachinsky also stole people’s usernames and passwords for certain websites and accessed the sites to steal even more data, prosecutors said.\nIn order to spread the malware, Durachinsky harnessed the processing power of the computers he infected. He created proxy networks and servers to hide his involvement with the malware, authorities say.\nBluboard tells how to use their application in the retail environment. pic.twitter.com/xvu4E2GGeZ— Shirley Reynolds (@sreynolds7088) January 5, 2017\nCaught, and arrested\nThere were brushes with authorities before his arrest.\nIn addition to the rumors that spread about Durachinsky hacking into the school district’s computers while he was a student, Gurka said the district believed Durachinsky committed another hack after Durachinsky graduated from high school. Gurka declined to provide more information.\nThomas Kelly, the city’s law director, also said Durachinsky “was not unknown to the authorities.”\nBut Durachinsky had never been criminally charged. By last year he had graduated from college and was working for BluBoard, a Cleveland startup company that sought to create tablets for businesses to use as displays.\nOfficials in the Case Western IT department reached out to federal agents on Jan. 5, 2017, because it believed someone hacked the university’s computer system, according to an affidavit written by FBI agent Michael Brian.\nThe university identified more than 100 computers with active internet connections that were infected by malware. Agents learned the computers had been compromised for a few years, the affidavit says.\nThe university also found an IP address, a number that identifies its location on the internet, associated with the malware was also used to access Durachinsky’s alumni email account, Brian wrote.\nThe FBI seized Durachinksy’s laptop on Jan. 18, 2017, and found a program that controlled the malware found on the Case computers, according to authorities. They also found that the malware had wormed its way onto computers outside of Case.\nTo tie it all together, the agents also found meticulous notes that Durachinsky kept about his exploits, according to court filings.\nA week after his laptop was seized, Durachinksy was arrested. A subsequent investigation tied him to additional hacks.\nPossible plea falls apart\nMore than a year after his arrest, Durachinsky remains in jail. Court filings indicate that he may have thought about pleading guilty, as he repeatedly agreed to waive time requirements prosecutors must follow to present a case to the grand jury.\nSomething happened, though. Durachinsky’s original attorney left the case and was replaced by a court-appointed defense lawyer. A grand jury then handed up 16 charges, including accessing protected computers without authorization, production of child pornography, wire fraud, aggravated identity theft and unauthorized wiretapping.\nIf convicted, Durachinsky faces a minimum of 17 years in federal prison. His next court appearance is set for March 9, and a trial date has not been set.\nHis attorney Thomas Conway declined to comment for this article, as did a man who answered the door at Durachinsky’s home on Jan. 31.\nContaining FruitFly\nCybersecurity analysts took notice of Durachinsky’s alleged software around the same time as the FBI, intrigued that a piece of malware was infiltrating Apple computers.\nWhile Macs have a reputation of being more secure than their Microsoft counterparts, analysts say that’s not true. They’re just not targeted as often.\nThomas Reed, director of Mac and mobile at the Malwarebytes software company, said an acquaintance asked him in early January to look at some sort of intrusion found on the computers of a Midwest university. He blogged about it for his company’s website, the first time information about the malware was published.\n“Right away it was pretty obvious that it was malicious,” Reed said.\nAs more analysts looked at the malware, they were intrigued by its capabilities.\nPatrick Wardle, a former National Security Agency analyst who now works as chief research officer for Digita Security, said it’s unique for malware targeting Apple products to completely take over a computer by using methods such as moving a cursor or turning on a webcam or microphone in real time.\nBut Durachinsky’s malware could do that and more, said Wardle, who analyzed the software and provided information to the FBI about some of his findings.\n“I’ve never seen any other Mac malware with that capability,” Wardle said.\nThose interviewed for this story said the malware is likely dormant, as the control panel and person responsible for directing its functions are offline.\nThere was one more thing that stuck out to cybersecurity analysts about Durachinsky’s case. Many hackers these days try to use their malware to make or steal money. While Durachinsky is accused of stealing incredibly personal information in a creepy way, there was no indication he was going to use the information for monetary gain.\nReed, like other analysts, have concluded that Durachinsky is more of a digital collector, developing “spyware at its worst,” he said.\n“As Patrick Wardle called it, this was more ‘creepy’ malware,’” Reed said.\nIf you would like to comment on this story, please visit Monday’s crime and courts comments section.", "url": "https://apnews.com/d265f10213f04419838ba15015cfeeb6"}