{"authors": ["Branko Marcetic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Luke Savage", "Meagan Day"], "date_download": "2020-05-04 20:00:17", "date_modify": "2020-05-04 20:00:17", "date_publish": "2018-08-16 00:00:00", "description": null, "filename": "2020_02_yesterdays-man-case-against-joe-biden-new-deal-reagan_1588622417.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/08/16191206/biden1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_02_yesterdays-man-case-against-joe-biden-new-deal-reagan_1588622417.html", "title": "Joe Biden Helped Pull the Democrats to the Right", "title_page": "Joe Biden Helped Pull the Democrats to the Right", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The following is an excerpt from Branko Marcetic’s forthcoming book Yesterday’s Man: The Case Against Joe Biden . You can now order a copy of this important new book direct from Jacobin for only $10, with free shipping.\nAll of us can take the heat from the special interest groups if we’ve got the support of the middle-class guy. —Joe Biden, 1977. It was November 1980, and one of Joe Biden’s staffers was poring over a list of congressional ratings. The liberal organization Americans for Democratic Action regularly scored every member of Congress on how progressive they were based on select votes. Biden wanted to find out where he ranked. Biden’s search had been prompted by Ronald Reagan and the Republicans’ staggering landslide victory earlier that month. Reagan, the first challenger to lop off an elected incumbent president since Franklin Roosevelt’s victory over Herbert Hoover forty-eight years earlier, had won by ten percentage points and carried forty-four states, earning 489 Electoral College votes to Carter’s forty-nine. He had done so expressly by shattering Carter’s winning 1976 coalition and poaching parts of it for himself: union members, Jews, Catholics, even self-described liberals all defected to Reagan in large numbers. He won the South and the Midwest. The fact that voter turnout had dropped once more to about half the adult population had helped, too. This wasn’t meant to happen. Reagan was a conservative ideologue, a man considered far to the right of not just the voting public, but reality itself. He had a habit of accusing his opponents of communist sympathies and railing against “big government,” and his flagship idea was a tax cut for the rich. He insisted Vietnam had been a “noble cause” and suggested at the time that the United States should “pave the whole country.” Now, in public statements, he itched for military confrontation with the Soviet Union. Ku Klux Klan Imperial Wizard Bill Wilkinson endorsed him, gushing that his platform “reads as if it were written by a Klansman.” He planned to “make America great again.” Reagan was a creation of a long-gestating right-wing movement kick-started during the New Deal by a group of the country’s most powerful industrialists, including Jasper Crane and Pierre du Pont, two executives of the very same DuPont company that ruled Delaware as a fiefdom. Reagan received what he called his “post-graduate education in political science” while serving as General Electric’s “traveling ambassador” under its vice president, Lemuel Boulware, a union buster extraordinaire and part of the same corporate conservative network that had started organizing against Roosevelt. It was under Boulware’s tutelage that Reagan made the transition from New Deal Democrat to, well, Ronald Reagan, voraciously consuming the ideas of conservative thinkers like Friedrich Hayek, who in his most famous book had argued just about any government involvement in the economy was the first step on the road to totalitarian dictatorship. That conservative movement had, by 1980, succeeded in putting not just Reagan in the White House but a host of candidates in the US Congress who vowed to back his radical agenda. The National Conservative Political Action Committee (NCPAC), founded by “New Right” activist Terry Dolan with help from direct-mail fundraising wizard Richard Viguerie, was at the center of these efforts. With close ties to Reagan that made a mockery of election laws, the NCPAC had a symbiotic relationship with the Republican candidate, who asked his supporters to back the committee, which in turn raised money to support the candidate and attack his vulnerable liberal opponents in Congress. Thanks to the work of such organizations, the Democrats lost thirty-three seats in the House and twelve in the Senate come November. A number of those had been specifically targeted by NCPAC in a “hit list” of long-serving liberal senators, including Indiana’s Birch Bayh, Idaho’s Frank Church, and 1972 presidential candidate George McGovern. While movement conservatives plotted, Biden was unhappily drafted by Carter to stump for the floundering president. Biden’s lack of enthusiasm for the task was palpable. At one stop, he launched into a series of backhanded compliments, practically apologizing for the president. “Let’s face it,” he said. “Jimmy Carter is not the finest thing since wheat cakes; he’s not the second coming. . . . He’s not going to go down in the history books . . . but he is doing a good job.” Nevertheless, Biden had done his duty, including a speech at that year’s Democratic National Convention in which he assailed the “bankruptcy,” “hollow dreams,” and “hypocrisies” of the Reagan-led GOP’s 1980 platform. Biden had summoned the populist spirit of his first Senate run, condemning Reagan’s “banker friends” and “advisers in the oil industries,” and calling on Democrats to muster the courage to “maintain the historic commitments to the New Deal, the Fair Deal and the Great Society.” It was all for naught, with Carter no match for an embittered populace fed up with a decade of recession and inflation and an energized conservative movement working to get their man into office. But for Biden, Reagan’s victory had its upsides. Thanks to the defeat of several of his colleagues, Biden moved up a spot on all his committees, including Judiciary, where he would end up the ranking Democrat. And the president-elect’s anti-government philosophy actually gelled with his priorities. “In a strange way,” Biden said, “the election of Ronald Reagan is more consistent with the budgetary thrust that a guy like me . . . has been going for for the past few years.” Biden’s long-delayed sunset legislation could now move forward, he said. And he, too, wanted a tax cut. “Biden might come out looking like a conservative when he sits in his seat on the budget committee,” noted the Wilmington Morning News . Reagan’s presidency didn’t lead to the instant anti-government “revolution” his grassroots backers had envisioned. But by the end of his eight years, Democrats and liberals whose previously steadfast commitment to New Deal politics had already been wavering during the 1970s would abandon it entirely. In some ways, Reagan’s success in transforming his opposition was his most long-lasting legacy, a transformation Joe Biden would help lead.\nNo Longer Liberal Biden’s already growing public discomfort with the New Deal legacy made him perfectly poised to drift rightward with the Reagan years. Even as he thundered against Reagan’s platform during the campaign, he had told crowds that in the world of the 1980s, “we can’t solve all social problems by an endless succession of government programs.” And while he tried to undo Reagan’s scrapping of price controls on oil and gas and voted “to fill the holes in Reagan’s safety net” left by his severe 1981 budget, Biden made clear he was “not concerned about social programs as much as the direction” the country was going. Asked where Democrats should draw the line with Reagan’s cuts, Biden singled out agencies like NASA, Conrail, the Export-Import Bank, and energy research and development. “They’re finding new answers to old problems,” he said. “Instead of social programs, give the Northeast a rail system that works.” Despite claiming that “the Reagan program will be economically disastrous for most of us in this country,” Biden voted for the new president’s first budget, one of thirty Democrats to do so. The budget was “a triumph for conservatives rivaling the liberal triumphs of” Roosevelt and Johnson, the New York Times wrote: scores of federal programs for health, education, and social services drastically cut back, weakened, or outright eliminated. The cuts threw countless lives into chaos, with 270,000 public service workers losing jobs, more than 400,000 families thrown off the welfare rolls, and more than one million workers ineligible for extended unemployment benefits, just to name a few. The Reagan onslaught marked “the reversal,” wrote the Washington Post , “of two great waves of government intervention, the New Deal and the Great Society,” a verdict shared by lawmakers on both sides of the issue. As the decade wore on, Biden’s criticism of Reagan’s policies shifted away from their cruelty to complaints that they were fiscally irresponsible and deficit-bloating. “The elimination of federal deficit spending should be the single most important element in a program to achieve an economically sound future for this country,” he said six months into Reagan’s tenure. He and the many other Democrats who began talking like Republicans were gently prodded into it by the 1981 tax cut, the other keystone measure in Reagan’s plan to overhaul Americans’ relationship to their government. Biden also voted for this measure, despite calling it “inequitable and inflationary.” The Reagan tax cut, the largest in postwar US history, was a lopsided giveaway to the very richest that led almost instantly to ballooning deficits and widening economic inequality. Over time, the super-rich would parlay their economic gains into growing political power by exploiting an ever-more corrupt political system — and use that power to roll back much of what had been built under New Deal presidents, creating a growing class of disillusioned, fed-up Americans. That it was the Democrats who had first pushed for cutting the top income tax rate, and that Reagan had initially rejected it, is just one of the ironies of all this. The tax cuts did something else, too. As Bruce Bartlett, one of Reagan’s advisers, would later explain, conservative intellectuals wanted “to force a major overall spending cut that would be a political non-starter without first passing a tax cut that creates a deficit so large, something must be done about it.” Indeed, Reagan himself quickly pivoted to fearmongering about the very deficit he had helped create. It was a perfect trap for a political class increasingly allergic to anything resembling New Deal liberalism. And the Democrats, spooked by anti-tax, anti-government revolts and desperate after Carter-era stagflation to prove themselves able money managers, fell right into it. Biden was out in front of this shift. Even as he voted against keeping the food stamp program going and for cuts in programs like federal pensions, he voted against Democratic efforts to plug the revenue hole left by Reagan’s tax cut with a series of admittedly regressive tax increases. They were too much of a burden on the middle class, he complained. Griping that the tax system was unfair and too complicated, he signed on to successive tax reform bills that were, in practice, massive tax cuts for the rich. One pared back the number of tax brackets to just three, none of which would pay more than 30 percent; another set a flat tax of just 14 percent for all individuals, one-upping even the flat tax proposal cooked up by the conservative Hoover Institution. Five years after voting for Reagan’s tax cuts, Biden admitted they marked the defeat of a Democratic era. “The Reagan tax cuts have ended growth of the social agenda; it’s all come to a screeching halt,” he said. “There’s nothing [Democrats] can do but keep what’s there.” Just as in 1978, a looming reelection in 1984 was key to Biden’s evolution. His popularity, reflected in intimidating poll results, warded away his most formidable challenger for a second time: outgoing Delaware governor Pete du Pont. The task instead fell to John Burris, the state House’s former majority leader and a du Pont ally, whose campaign rested on the charge that Biden wasn’t doing enough to execute Reagan’s economic program. Burris was a weak candidate who ran a weak campaign, little different in substance from James Baxter’s. Biden won with 60 percent of the vote, only ten points less than what the polls had shown in March and an improvement on his previous result. Even so, Biden once again pulled out all the stops to win. Following what he termed an “olive branch” from Reagan — a spending freeze that also raised taxes — he linked arms with two Republican colleagues on the Senate Budget Committee to introduce his own freeze proposal in 1984. Acknowledging it would be labeled “draconian” (“I don’t know how to do anything else than bring it to a screeching, screeching halt,” he said), Biden’s plan cut $239 billion from the deficit over three years, almost $100 billion more than even Reagan’s proposal, and proposed doing it partly by eliminating scheduled increases for Social Security and Medicare beneficiaries. It would, he said, “shock the living devil out of everyone in the US Senate.” Biden indulged in doomsday predictions to sell the measure, warning that letting deficits go untamed would “allow the economy to come crashing down” and lead to “an economic and political crisis of extraordinary proportions” within twelve to eighteen months. As bemused commentators would note decades later, it was all straight from the playbook of Tea Party darling Paul Ryan, the Ayn Rand-worshiping congressman from Wisconsin who was bent on taking a meat cleaver to Medicare and Social Security. When Biden ran directly against Ryan for vice president in 2012, he warned voters Ryan was a threat to their hard-earned entitlements. Though the freeze failed, it was only the beginning. Biden’s ongoing distaste for a balanced budget amendment to the Constitution didn’t stop him from introducing a similar amendment in 1984, this one tying spending to the growth of gross national product and inflation, which he referred to as a “pay-as-you-go” measure. Calling it a “much more realistic approach,” he proudly boasted that he had “literally plagiarized” it from du Pont, a Republican. Later that year, Biden backed the line-item veto — an anti-spending measure cherished by Reagan, the conservative movement, and, incidentally, Burris — and another budget measure, this one successful, requiring Congress to vote on freezing the budget for one year before it could raise the debt ceiling. His campaign then ran radio ads claiming that “cutting the deficit is more important than party differences.” Undergirding all this was the endless quest for campaign cash. To keep Burris at bay, Biden again drew on the paradoxical coalition of union and corporate donors to fund his campaign. Declining Burris’s challenge to limit spending at $1 million each, he raised $1.3 million by September, more than double his opponent, with most of his money coming not from individuals but PACs (it was vice versa for Burris, who had a mere $18,000 left by this point). On Biden’s donor list, names like the Seafarers Union, United Steelworkers, and United Mine Workers sat uneasily next to Chrysler, General Electric, and Pfizer. His campaign mailed twenty thousand copies of a letter signed by local corporate bigwigs (including a du Pont) declaring him “a leader on fiscal responsibility.” As in 1978, Biden endorsed a core tenet of conservatism shortly before the election. Where he’d previously come out for fiscal austerity, he now took aim at the role of government. “I see less of federal government dictating to the states,” he said. The federal government had “changed the mindset of the states” over the past thirty years, meaning “federal involvement with social and racial problems is less required” as long as antidiscrimination laws stayed on the books. He said he believed “education is best left to the states” and argued “you could make that case . . . for a whole range of areas where heretofore the federal government was involved.” Government, he said, would stay involved in the environment and issues like the global drug trade, but it would be “less involved in direct social questions like day care, education or health.” It’s debatable how far Reagan’s politics had actually seeped into the hearts and minds of the American public. After all, millions of working-class Americans of all races and backgrounds continued to rely on the federal government to keep them from poverty, ill health, or death’s door, and almost half the country didn’t even bother voting. But Biden appeared to be one of the converts. As his defeated opponent remarked in the wake of the election: “Win, lose or draw, Joe Biden isn’t a liberal any more . . . I think that’s a victory.” For his part, Biden blamed the Democrats for Reagan’s success. He urged them to support efforts to “clean our house” through a budget freeze and tax reform. Biden’s freeze never came to pass, but he did finally get the latter. Three years out from another election, Biden joined all but three of the Senate’s Democrats to hand Reagan another victory, passing the tax overhaul the president had requested. There would now be only four brackets, and while tax rates would rise for the lowest bracket, the rate for the top bracket was slashed from 50 percent to 28 percent, another boon for the nation’s wealthiest. “On balance the bill is a good one,” said Biden. He wasn’t alone: the tax bill was the brainchild of two Democrats and passed with huge bipartisan majorities. The Reagan Revolution, it seemed, had been brought to the public by the Democrats. Biden would eventually realize the error of his ways. After years of spiraling deficits caused partly by the “tax bubble” he had helped create, Biden would vote in 1990 to raise taxes on the wealthy. But with anti-tax sentiment by then firmly lodged in the post-Reagan Republican Party, the measure failed, and the lopsided tax system stayed in place for years. Lest his vote for tax cuts suggest Biden wasn’t serious about cutting the deficit, he also put his support behind the Gramm- Rudman bill, a budget-balancing measure that split the Democrats. Mandating a balanced federal budget by 1991, the legislation required the president to make spending cuts across the board (with some exceptions) if Congress failed to do so, leading to years of austerity for the nation’s cities. Timid, uncertain, and on the back foot with another election looming, Democrats landed all over the place on Gramm-Rudman, with stalwart liberal Ted Kennedy backing it to prove he was serious about wrangling the deficit and neoliberal Gary Hart, trying to prove he wasn’t a compassionless automaton, opposing it. Staying true to his new beliefs, Biden voted “aye.” Biden may have told himself his evolution was necessary to update Roosevelt’s legacy for an era of rising anti-government sentiment and a future where Democrats believed “that the New Deal is old but that the commitments of the New Deal are real,” as he put it. This is certainly how Democrats would come to justify the “triangulation” of the Clinton era, as the party took up Biden’s victory-through-right-wing-camouflage approach as their ethos. But maybe there was another way. While Biden reacted to conservatism’s ascent by doing his best to shed the label of “liberal,” five hundred miles to the north, a middle-aged activist and documentarian named Bernie Sanders became mayor of the largest city of the then-conservative state of Vermont while calling himself a “socialist.” Like Biden, he too adapted his politics to the mood of the era. But instead of railing against government, fearmongering about the deficit, and relying on the largesse of a corporate class whose worldview he would come to adopt, Sanders launched an anti-tax crusade from the left, seeking to shift Burlington’s tax burden from put-upon property owners to businesses and the rich while coordinating with a grassroots movement of activists to fight for the interests of working families and the poor. As Mayor Sanders tussled with the painful cuts imposed on his city by Reagan, Biden, and the rest of Congress, he fought a pitched war with the local conservative establishment, rallying a coalition of voters — and, crucially, nonvoters — to his side and ultimately transforming his city into a bastion of progressivism controlled by a coalition of like-minded aldermen. Sanders’s success in Burlington during the 1980s serves as a glance back down a road ultimately not traveled. As Biden and the rest of the Democratic Party doubled down on their rightward drift in the years ahead, Sanders’s achievements suggested a way other than the Third Way might have been possible. Instead Biden helped drag a dazed Democratic Party over to his side of the political spectrum.\nMoving the Party In September 1987, as the Senate Judiciary Committee took a break from grilling Reagan’s latest Supreme Court nominee, the ultraconservative Robert Bork who was ultimately defeated in a close Senate vote, Joe Biden, his wife, his sister, and her husband filed into its hearing room, suddenly packed with dozens of cameras, microphones, and reporters. Three and a half months after officially announcing his candidacy for president of the United States, he was now officially ending it. Biden had run a campaign vastly better financed than almost all of his rivals and had charmed both the Democratic donor class and media establishment with his Kennedyesque aura and centrist bona fides. While he hadn’t lit up the polls, it was still early, and with none of the other candidates catching fire, it wasn’t hard to imagine the young, exciting candidate carving out at least some chunk of votes in the first primary contests in early 1988. Instead, his campaign had disintegrated over the course of eleven days as a series of personal scandals turned Biden’s name into a hack columnist’s punch line for years to come, closing the door on another presidential run for decades more. He could at least take solace in one victory, however: though Biden failed to win the presidency, he’d helped make sure the next Democrat who did would be one made in his image. If the Democrats had been demoralized by their last two election losses, then nothing could have prepared them for 1984. Despite a recession that plagued his first year in office and rounds of unpopular budget cuts, Reagan cruised to victory in one of American history’s biggest landslides, winning forty-nine states and 525 electoral votes. His opponent, Walter Mondale, a moderate liberal who ran an uninspiring campaign calling for a tax hike to pay down deficits, managed only thirteen electoral votes. “For 13 years, I’ve been trying to move the Democratic Party off the course it’s been on,” he told the Wilmington Morning News a year after Reagan’s reelection. “I said what nobody else was saying: That interest groups had a stranglehold on us, and, number two, there’s a whole generation of Americans ready to move. . . . Now everybody says those things.” Other Democrats were toting the same line. “We’ve got to propose innovative solutions to problems and get away from government intervention,” said Dave Nagle, chairman of the Iowa Democratic Party, in the wake of the loss. “We have to recast the old values, sort of begin to find a national vision,” Arizona Gov. Bruce Babbitt told CBS Morning News as he sat shoulder to shoulder with Biden, explaining that that “vision” included “fiscal responsibility” and “the budget.” “I think Democrats lost the middle class,” Biden added, “as a consequence of forgetting the middle class doesn’t belong to any particular interest group.” Biden had been complaining about these “interest groups” and “special interests,” typically contrasted with his beloved “middle class,” for about as long as he’d been complaining about the party’s direction. But who exactly were these shadowy entities? Franklin Roosevelt, too, had attacked “special groups” and “special interests” in the 1930s. But while Roosevelt meant the “unscrupulous money changers” and the anti–New Deal “minority in business and finance” whose minions “swarm through the lobbies of the Congress and the cocktail bars of Washington,” Biden meant something very different. “Minorities and other vested interests are sick and tired of hollow promises,” he had said in 1971 after his very first win. Seven years later, he would bellow at these “interest groups” who refused to do away with government programs that benefited them; he now blamed these groups for the runaway spending he sought to control. Now, as he toured the country preaching his vision, Biden urged Democrats to proclaim that special interest groups came second to the national interest. In Alabama, his denunciation of such interests (“warmly received,” wrote the Wilmington Morning News ) was followed by his insistence that the state had confronted and largely worked out its racist demons. Elsewhere, as in Delaware, he softened these attacks. “All the talk about us having to shed ourselves of control of special interests misses the point,” he told seven hundred of the state’s Democrats. “In fact, we don’t have a problem with labor. We need labor. . . . I’m proud to be in a party that has garnered the support of the majority of black Americans.” In other words, whether defending or attacking them — and by this point, it was almost always the latter — “special interests” were the diverse constituencies that had flocked to the Democrats: union members, African Americans, feminist women, gays, environmentalists, and any others whose image didn’t square with the “middle-class guy” Biden and others increasingly viewed as the typical voter. With two simple words, their participation in the political process and struggle for the rights and welfare of themselves and others like them had been cast as suspect, even corrupting. Where once the tyranny of “special interests” meant the control of government by big business and the super-rich, it now referred to the ordinary Americans the New Deal had sought to protect from those same powerful entities. The Democrats’ new priority would instead be Biden’s “middle-class guy,” at least as they imagined him: socially conservative, suspicious of government and taxes, and otherwise curiously aligned with the political desires of the country’s most powerful interests. And he was Southern. Biden had been urging Democrats to look to the South for ideas and presidential material since the 1970s, allying himself with Jimmy Carter and encouraging conservative South Carolina senator Fritz Hollings to run for the 1984 Democratic presidential nomination. The party’s successive electoral collapses had won the Democratic leadership to Biden’s side. “Unless we . . . have the South with us, we will not control the national agenda,” he said. “For the first time, New York Democrats and California Democrats and Illinois Democrats are all saying that we must have a presidential candidate in 1988 who will appeal to the South.” Biden wasn’t wrong: the “solid South” had indeed been pivotal to Democratic victories for generations, thanks to the party’s virulent support for slavery and white supremacy. When Democrats began embracing civil rights under Roosevelt, the South’s outsize power would remain a brake on progressive change for decades, thwarting civil rights legislation and weakening New Deal measures. Like Biden, Roosevelt had understood the South’s electoral importance. He’d tried to politically reshape it in his own image and push the region to “a more intelligent form of Democracy,” but he failed to dislodge the right-wing Southern elite, despite his and the New Deal’s popularity there. The South would remain an anti-union, economically conservative political backwater. Biden’s effort to win it back could have revived Roosevelt’s effort, capitalizing on new civil rights protections and Democratic popularity among black voters to run a populist campaign that brought blacks and poor whites together through their shared economic interests. Instead, Biden made clear he desired not to bring the South to where Democrats stood, but vice versa. “The party has lost its way,” Biden told Democrats in North Carolina. “You have been where the Democratic Party was and now the Democratic Party must be where you are.” Instrumental to this was the Democratic Leadership Council (DLC), an unofficial party organization founded after Mondale’s loss to push the Democrats rightward. Its founder, Al From, had been the executive director of the House Democratic Caucus in 1981, when it had put out a statement of “Democratic Economic Principles” that pledged fealty to Reagan’s agenda. Made up of governors and congressmen — almost all of them white men and mostly hailing from the West and especially the South — the DLC hoped to give the latter region greater influence in the party. This all came at the same time as a small group of the party’s fundraisers, including Goldman Sachs executive Robert Rubin, similarly decided to make the Democrats into a centrist, business-friendly force. Biden was a natural fit with the group. In fact, From and Biden’s pollster friend Pat Caddell had already unsuccessfully tried to get him to jump into the 1984 race as the standard-bearer for their preferred policies. They polled the appeal of a made-up “Mr. Smith” who resembled Biden against the other candidates and planned to use the results to pressure House Democrats to abandon Mondale. Though he had declined to run then, Biden was now, in From’s words, one of the DLC’s “leaders,” and with a wide-open 1988 contest in mind, he embarked on a tour across the South with the DLC, lecturing Democrats that they needed to change. Calling North Carolina the “conscience of the South,” Biden “most persistently pursued a southern theme in his remarks” at one event, despite being the only speaker not from the South, noted a bemused local columnist. In Virginia, he professed the party would be “much better off” if its conservative Democratic senator Chuck Robb, the chairman of the DLC, ran for president. In Alabama, Sen. Howell Heflin praised Biden for his fiscal conservatism and for being sympathetic to the South’s “traditions and values”; returning the favor, Biden told the crowd “a black man has a better chance in Birmingham than in Philadelphia or New York.” He cut from his speech the usual lines about his fictive civil rights activism and a reference to Birmingham Police Commissioner “Bull” Connor’s use of dogs against black protesters. Conservative columnist Dick Williams of Georgia, who boasted of breaking a union at a television station as a young man, put Biden among the party’s “best and brightest” ahead of his appearance there. Anti-unionism was central to the ideology of the DLC and the “New Democrats,” as they came to be called, and despite the critical role organized labor had played in his career, Biden began faintly echoing these sentiments. At the Florida AFL- CIO’s annual convention in 1985, he delivered a keynote speech blaming labor for its own decline, chiding unions for fearing change and focusing on their own interests instead of the national interest. The following year, at the Virginia state AFL-CIO’s convention, he warned that labor, like the Democratic Party, was in “deep trouble” and needed to “have a broader umbrella” to “envelop middle-class America” so that it was no longer viewed as a “special interest.” Stumping for a House candidate who he warned was not an automatic pro-labor vote, Biden told another union audience: “You’re not entitled to anymore, and you’re lucky if you get that much.” As outlets like the New York Times commented at the time, Biden’s rhetoric here was a “Hart-like message.” The “Hart” was Gary Hart, the young ex-senator from Colorado who had become the face of Democratic neoliberalism and had lost out to Mondale for the Democratic nomination in 1984. Labor despised Hart, whom then–AFL-CIO President Lane Kirkland had accused of “labor baiting” during the Democratic contest. For years, Biden and Hart would receive identical ratings from the AFL-CIO in the federation’s annual legislative scorecards, typically in the high 70s and low 80s — strikingly low compared to liberal Democrats in the Senate. After all this, however, Biden and the DLC’s theory of change was quickly debunked. In the 1986 midterm elections, with the GOP outspending Democrats five to one and the still-popular Reagan crisscrossing the country to ask the public to vote Republican one last time, the Democrats surprised everyone by reclaiming the Senate and enlarging their House majority. Ignoring the DLC’s prescriptions, the party ran candidates who were left of center economically. In return, union households voted overwhelmingly for Democrats, and the party’s advantage with women and especially African Americans (90 percent of whom voted Democratic nationally) made up for its shortfall with white men, providing winning margins in close races. Even in the South, liberal Democrats won by stitching together cross-racial coalitions. In theory, this Democratic takeover halted the “Reagan Revolution.” In practice, that revolution had already succeeded. Despite the 1986 election results, the Democratic Party had internalized the political lessons Biden and others had been urging, shying away from proposing any major big-spending programs while the DLC only grew in influence. And as the race for 1988 nomination heated up, Biden continued striving to be “the candidate of the South.”", "url": "https://www.jacobinmag.com/2020/02/yesterdays-man-case-against-joe-biden-new-deal-reagan"}