{"authors": ["Paul Walsh"], "date_download": "2020-05-04 20:11:37", "date_modify": "2020-05-04 20:11:37", "date_publish": "2018-07-31 06:44:18", "description": "The Minnesota Twins have resumed their business relationship with the Papa John’s pizza brand, citing its dedication to a local franchisee, despite the recent national uproar over the founder...", "filename": "_9fffee3597024f52a2bed8673f1e166f_1588623097.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9fffee3597024f52a2bed8673f1e166f_1588623097.html", "title": "Twins put Papa John's back in their promotional lineup", "title_page": "Twins put Papa John's back in their promotional lineup", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Minnesota Twins have resumed their business relationship with the Papa John’s pizza brand, citing its dedication to a local franchisee, despite the recent national uproar over the founder using a racial slur during a conference telephone call.\nForbes first revealed the utterance by John Schnatter earlier this month, reporting that he used the N-word during a media training session in May, and the comment led the marketing agency to sever its ties with the company.\nSoon after the Forbes report, the Twins front office followed other Major League Baseball teams and “indefinitely suspended” its relationship with the pizza chain. That suspension was lifted Monday, the team announced, pointing to its seven-year partnership with DMD Minnesota Pizzas, who owns local Papa John’s franchises.\n“Based on our local partnership experience, the Twins believe the comments made by Schnatter are not reflective of the views or actions of DMD Minnesota Pizza,” the team announcement read.\nManny Overton, operating partner of DMD Minnesota Pizza, released a statement distancing itself from what Schnatter said, adding that “we respect each and every employee and customer regardless of their race and will continue to serve our employees and our customers as we always have, respectfully.”\nThe Minnesota Lynx also suspended promotions with Papa John’s. The team has yet to say whether that suspension is still in force.\nSchnatter, who quit as CEO on that night in May, said he used the word while describing how KFC marketing icon Colonel Sanders spoke, but added that he would never use it as an epithet.\nHe has since apologized for what he said but is fighting to reclaim his CEO post. He remains on Papa John’s board and is the company’s largest shareholder.\nPaul Walsh • 612-673-4482", "url": "https://apnews.com/9fffee3597024f52a2bed8673f1e166f"}