{"authors": ["Peter Gowan", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Kate Aronoff", "Stefania Barca", "Brent Ryan Bellamy", "David Thomas", "Trish Kahle"], "date_download": "2020-05-04 19:51:05", "date_modify": "2020-05-04 19:51:05", "date_publish": "2018-03-26 00:00:00", "description": null, "filename": "2018_03_nationalize-fossil-fuel-companies-climate-change_1588621865.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/03/26115238/oil.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_03_nationalize-fossil-fuel-companies-climate-change_1588621865.html", "title": "A Plan to Nationalize Fossil-Fuel Companies", "title_page": "A Plan to Nationalize Fossil-Fuel Companies", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "All progressives recognize that climate change is a grave threat that is already causing devastating damage around the world. There is less agreement about what policy options could seriously mitigate its effects.\nOne strong option: nationalizing fossil-fuel companies. While hardly discussed in the US, this ambitious approach is being proposed by the Labour Party in the UK and is already in place in Norway. It would work just as well in the US.\nFree-market solutions and incentives are incapable of spurring the economic transition needed, on a quick enough timescale, to avoid environmental disaster. The use of workers in the fossil-fuel industry as a cynical bargaining chip by the owners of those firms represents a massive political obstacle to a real energy transition, as does the valuation of these firms based off an expectation by investors that much or all of their underground assets will be developed — which, if we are to avoid climate catastrophe, will not be.\nWhat we should do instead is have the state buy a controlling stake in all major fossil fuel firms.\nThis could be quite costly — writers from The Democracy Collaborative recently estimated “the price tag to purchase outright the top 25 largest US-based publicly traded oil and gas companies, along with most of the remaining publicly traded coal companies” at $1.15 trillion. But there are ways to minimize this cost while still obtaining all of the benefits.\nThe mode for gaining public control of these companies should involve making the federal government’s final intentions well known to investors from the outset. Control over these shares would be given to a new Social Energy Fund, which would be chartered to use its stake in the firms to achieve key priorities, including national compliance with ambitious decarbonization targets and building up publicly owned renewable energy firms. This means stating from the outset that huge quantities of oil and gas will be left in the ground. The state would vote for resolutions and directors that will ensure its social goals are met.\nWhile full nationalization would be preferable under an ideal legal regime, the Supreme Court case law under the Takings Clause requires market-value compensation for compulsory purchases. Having made its intentions to annihilate the fossil fuel industry known, the government would then offer to voluntarily purchase up to 51 percent of shares. It would also announce that it intended to compulsorily purchase any shares required to obtain its majority stake at some point in the future — say, one year later.\nThis would guarantee to investors that if they did not sell their stakes, they would be left holding an asset worth far less than they paid for with no available buyer. The price of fossil-fuel shares includes both their immediate profits and a speculative value based on the expectation that firms will continue to have a stranglehold on the political system and ensure their ability to extract and sell fossil fuels for years to come. We would therefore expect the value of the stocks to collapse just as shares in private prisons collapsed in 2016 after President Obama’s promise to phase them out.\nThe state could add a further incentive to sell immediately by stating that it would include a discount accounting for environmental externalities in its “just compensation” for compulsory purchase. This wouldn’t persuade America’s right-wing judiciary, and the state would eventually have to pay market value. But the prospect of holdouts having to fight an extended legal battle with the federal government should depress the stock price further.\nIf we assume the Democracy Collaborative’s figures are correct and a conservative discount of 30 percent on the current prices, and only purchase 51 percent of the shares, the total cost works out at $410 billion. A similar plan by David Hall of the University of Greenwich put the cost of nationalizing half of the UK’s major fossil fuel companies at market value at around £36 billion ($50.2 billion), or £44.4 billion ($61.9 billion) if one includes the transmission and distribution grids. The US economy is about seven times larger than the British economy, so the figures are roughly comparable.\nIn truth, this would be worth doing even if the sticker price was far higher. The long-term costs of climate change to the US economy and society will dwarf any capital investment we need to make right now.\nEconomists largely agree that nationalization does not have a direct impact on the government’s balance sheet due to the acquisition of public assets, a fact recently acknowledged by the Financial Times in reference to Jeremy Corbyn’s plan to nationalize the energy network. The government’s ability to plan energy transitions in a way that does not require them to pay off fossil-fuel barons with subsidies and tax incentives will no doubt improve the government’s financial resources over time, and the revenues from fossil fuels will provide a stopgap until a large public clean energy sector begins to pay dividends.\nAn undeniable consequence of decarbonization will be job losses in the fossil-fuel sector. The fund should address this through a gradual downward trend in employment which can be absorbed through hiring freezes, voluntary redundancies, and active labor-market policies rather than through large-scale immediate layoffs — especially where largely concentrated in a single area. The Wilson Labour government in the United Kingdom reduced employment in collieries by a similar absolute number to the Thatcher government, but its cooperation with unions, focus on full employment, and active industrial policy ensured this did not cause a social catastrophe.\nThe welfare state and union-run retraining schemes should also fill the gap here. We should aim to smooth out the transition for people as much as possible. The liberalized market is a massive obstacle to decarbonization because it polarizes the interests of energy workers against everyone else’s compelling interest in energy transition. This is not inevitable, and a large social-democratic welfare state would significantly reduce these divisions.\nNorway’s social wealth fund recently suggested divesting from privately held fossil fuel firms, and its state energy company Equinor is seeking to diversify away from oil. The fossil fuel industry in America already exists, and state management is much better suited to planning a fair and viable transition that will avoid catastrophic climate change.\nHow should we pay for such a plan? Climate change poses a grave risk to global security in the long run. Even major oil producers have recognized this. Norway’s climate and environment minister noted that “studies have pointed out that the record drought that ravaged Syria in 2005 to 2010 was likely stoked by ongoing man-made climate change,” and that this “helped push conditions over the threshold” of civil war.\nIf offsets are required to pass this proposal, funding it by cancelling planned military spending increases makes sense. We should not need excessive spending on the military if we are living in a safer world, and a publicly controlled energy transition whose profits finance a secure, collectively owned clean energy industry will do more good for America, and the world, than any spending on F-35s or foreign interventions.", "url": "https://www.jacobinmag.com/2018/03/nationalize-fossil-fuel-companies-climate-change"}