{"authors": ["The Herald-Dispatch"], "date_download": "2020-05-04 20:04:11", "date_modify": "2020-05-04 20:04:11", "date_publish": "2018-11-06 10:20:30", "description": "CHARLESTON — Thirty-six high school bands and two middle school bands from around the state showcased their talents in the seventh annual West Virginia State Marching Band Invitational...", "filename": "_bfc4f5b44782421faf089204de8b1167_1588622651.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bfc4f5b44782421faf089204de8b1167_1588622651.html", "title": "MARCHING TO VICTORY", "title_page": "MARCHING TO VICTORY", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLESTON — Thirty-six high school bands and two middle school bands from around the state showcased their talents in the seventh annual West Virginia State Marching Band Invitational Championship on Oct. 27 at the University of Charleston Stadium at Laidley Field.\nCabell Midland High School won the Overall “Honor Band” Award and Old Gold Division Grand Champion, and Paden City Jr./Sr. High School won the Blue Division Grand Champion award.\nBands were judged on general effect, marching and maneuvering, music, music effect, percussion, drum major, color guard, majorettes and feature twirler.\nThe West Virginia Department of Arts, Culture and History also inducted seven current and former band directors into the State Marching Band Directors Hall of Fame.\nHonorees included Jeff Bryant, former band director for Greenbrier East High School; Joe Hardin, current band director at Spring Valley High School; Stephen Jarrett, former band director for Braxton County High School; Michael Knepper, current band director at Musselman High School; James Porter, former longtime band director for Ravenswood High School; Bob Scott, former band director at Capital High School; and Wayne Smith, former band director at Tyler Consolidated Middle/High Schools.\nThe winners of the State Marching Band Invitational Championship are as follows:\nOverall awards (Honor Band)\nWest Virginia State Honor Band: Cabell Midland High School; 1st runner-up: Musselman High School; 2nd runner-up: Spring Valley High School; 3rd runner-up: Greenbrier East High School; 4th runner-up: Paden City Jr./Sr. High School\nDivision Awards\nOld Gold Division Grand Champion: Cabell Midland High School; Old Gold Division 1st runner-Up: Musselman High School; Old Gold Division 2nd runner-Up: Spring Valley High School Blue Division Grand Champion: Paden City Jr./Sr. High School;\nBlue Division 1st runner-Up: Wayne High School; Blue Division 2nd runner-Up: Lincoln County High School\nClass A Band Awards\n1st place: Cabell Midland High School; 2nd place: Musselman High School; 3rd place: Greenbrier East High School\nClass A Best Overall Awards\nPercussion: Musselman High School; Color Guard: Cabell Midland High School; Drum Major: Cabell Midland High School; Soloist: Cabell Midland High School\nClass B Band Awards\n1st place: Spring Valley High School; 2nd place: Nitro High School; 3rd place: St. Albans High School\nClass B Best Overall Awards\nPercussion: Spring Valley High School; Color Guard: Spring Valley High School; Drum Major: Nitro High School; Soloist: Spring Valley High School\nClass C Band Awards\n1st place: Wayne High School; 2nd place: Lincoln County High School; 3rd place: Tyler Consolidated High School\nClass C Overall Awards\nPercussion: Wayne High School; Color Guard: Wayne High School; Drum Major: Poca High School; Soloist: Lincoln County High School\nClass D Band Awards\n1st place: Paden City Jr./Sr. High School; 2nd place: Sissonville High School; 3rd place: Bluefield High School\nClass D Best Overall Awards\nPercussion: Sissonville High School; Color Guard: Paden City Jr./Sr. High\nSchool; Drum Major: Sissonville High School;\nSoloist: Paden City Jr./Sr. High School\nClass E Band Awards\n1st place: Gilmer County High School; 2nd place: Wyoming East High School; 3rd place: Wirt County High School\nClass E Best Overall Awards\nPercussion: Gilmer County High School; Color Guard: Calhoun Middle/High School; Drum Major: Wirt County High School; Soloist: Gilmer County High School\nBest Overall Show Band Awards\n1st place: Richwood High School; 2nd place: Webster County High School; 3rd place: Sherman High School\nMiss Majorette\nMiss Majorette: Catherine Blankenship, Lincoln County High School; Miss Majorette runner-up: Kristen Cox, Braxton County High School\nBest Overall Twirler\nBraxton County High School\nBest Overall Majorettes\nPhilip Barbour High School\nBest Overall Dance Team\nWebster County High School\nBest Dressed Director\nJohn Kimble, Braxton County High School\nThe West Virginia State Marching Band Invitational Championship was sponsored by the WVDACH in participation with the VH1 Save The Music Foundation and the Higher Education Policy Commission.\nThe State Marching Band Championship helps to promote, encourage and celebrate arts education throughout West Virginia.\nFor more information about the State Marching Band Championship, contact Andrea Nelson, public information specialist for the department, at 304-558-0220 or Andrea.E.Nelson@wv.gov.", "url": "https://apnews.com/bfc4f5b44782421faf089204de8b1167"}