{"authors": ["Chelsea Curtis Ccurtis Havasunews.Com"], "date_download": "2020-05-04 20:13:17", "date_modify": "2020-05-04 20:13:17", "date_publish": "2018-08-30 06:12:00", "description": "Election results for Lake Havasu City mark a change in leadership after 12 years. Voters have elected incumbent Councilman Cal Sheehy as mayor – a role that’s been filled by incumbent Mark...", "filename": "_f08f0765634e421195acfa90771f74c7_1588623197.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f08f0765634e421195acfa90771f74c7_1588623197.html", "title": "New leadership set to take reins of Lake Havasu City government", "title_page": "New leadership set to take reins of Lake Havasu City government", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Election results for Lake Havasu City mark a change in leadership after 12 years.\nVoters have elected incumbent Councilman Cal Sheehy as mayor – a role that’s been filled by incumbent Mark Nexsen since 2006. Nexsen did not seek re-election and plans to retire at the end of his four-year term this year.\nSheehy did not respond to inquiries Wednesday but told the Today’s News-Herald on Tuesday night that “it’s going to be big shoes to fill.”\n“Change can be good and I have continuity of experience on the council that we’ll be able to navigate and move forward in a positive way,” he said.\nSheehy told the News-Herald last week that his goals as mayor would be to meet the needs of the citizens, many of which were identified in the city’s community investment program and Vision 20/20 Implementation Plan, he said at the time.\nTuesday’s election results mean the city could skip a general election this November as voters have also re-elected incumbent Councilwomen Michele Lin and Jeni Coke for another four years and newcomer Jim Dolan, a Havasu business owner.\n“I’d just like to proceed cautiously and kind of take it a day at a time…get my feet in the water and kind of learn how the process works,” Dolan said on Wednesday. “I think we have a good team, a good council that’s going to work together so I’m just excited to get in there and start working.”\nTo win council seats during the primary election, candidates needed to acquire a majority of all votes cast within their race, which is determined by a formula. According to calculations based on the preliminary numbers, the mayoral candidates needed to have at least 5,662 votes to win while the council candidates needed to have 4,495 votes to win.\nSheehy had 7,796 votes, outpacing his opponent Nicole Norona by more than 4,200 votes. Dolan received 7,286, Coke had 6,772 and Lin had 5,560, outpacing their opponents, Rich Crayne and Alex McClane.\nLake Havasu City Manager Jess Knudson said the city is waiting for the elections results to be certified by the Mohave County Board of Supervisors. Once that happens, the city can take steps to plan for the new council’s transition at the end of the year.\nHe said the anticipated date to seat any new candidates is the second City Council meeting in November.\nProp. 409\nPreliminary election results continue to show that voters have passed Proposition 409. Three-fourths of voters agreed to increase the city’s expenditure base by $5 million, which would more than double its spending cap in the 2019-2020 fiscal year.\n“It’s certainly a relief, the voters sent a message that they trust council and staff to manage the finances and provide quality of services to the residents, now it’s our job to continue to earn that trust from our residents,” said Knudson.\nHe stated that a passage of Prop. 409 would help the city maintain its current level of services with its current level of resources and, therefore, cuts to city services will not be necessary next fiscal year. Additionally, he added, the city will no longer need to issue debt in order to avoid exceeding its expenditure limitation.\nLast week, Lin stated that if Prop. 409 passed she would continue pushing for additional funding in the city’s budget to address compression issues within the fire department, among others. Compression, also referred to as compaction, occurs when long-time employees make similar wages to those hired at a later date.\nLin and Coke did not respond to inquiries Wednesday.", "url": "https://apnews.com/f08f0765634e421195acfa90771f74c7"}