{"authors": ["Grant Traylor Hd Media Gtraylor Herald-Dispatch.Com"], "date_download": "2020-05-04 20:17:50", "date_modify": "2020-05-04 20:17:50", "date_publish": "2018-12-26 08:06:08", "description": "TAMPA, Fla. — Marshall University head coach Doc Holliday spoke for the last two weeks about finishing the 2018 football season the right way. On Thursday evening at Raymond James Stadium,...", "filename": "_9b89ec012dbe4fc297dacf0157119def_1588623470.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9b89ec012dbe4fc297dacf0157119def_1588623470.html", "title": "Dominant finish punctuates season for Herd", "title_page": "Dominant finish punctuates season for Herd", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TAMPA, Fla. — Marshall University head coach Doc Holliday spoke for the last two weeks about finishing the 2018 football season the right way.\nOn Thursday evening at Raymond James Stadium, the Thundering Herd did exactly that.\nMarshall’s fourth quarter was one of its best all-around quarters of the season as the Herd (9-4) locked up its 38-20 win over the University of South Florida (7-6) in the Gasparilla Bowl by dominating on both sides of the ball.\nMarshall used two drives to salt away 11:30 out of the final 15 minutes and South Florida ran just eight offensive plays as the Herd capped a nine-win season and its seventh consecutive bowl victory.\n“That says a lot for our strength program and the way we go to work and prepare for bowls,” Holliday said. “These guys get (mad) at me, at times, because they think we’re practicing too much or in\npads too much or whatever, but that’s what you have to do to prepare to go win a bowl game.”\nThe final quarter was staggering, with Marshall outgaining the Bulls 142 yards to 11 in the final period.\nIt becomes more impressive when considering South Florida was on its home field and had a bit of momentum after cutting Marshall’s lead to 11 late in the third quarter and regaining possession after a defensive stop.\nHowever, the momentum changed when Charming Hames registered his second quarterback sack, forcing South Florida into a third-and-long the Bulls did not convert.\nOnce Marshall regained possession, it played keepaway behind its rushing attack, led by a strong offensive line.\n“You’ve got to give it to that offensive line,” Holliday said. “That offensive line did a great job of getting hats on the right guys.”\nMarshall’s first drive of the fourth quarter secured the victory as the Herd marched 64 yards in 11 plays and took 5:47 off the clock. The Herd went 3 for 3 on third-down conversions on the drive — the last being a 16-yard touchdown run by Keion Davis when he broke a tackle at the line of scrimmage and raced to the end zone to restore a three-score lead.\nSouth Florida head coach Charlie Strong said the inability to get off the field on third down was a continuation of the Bulls’ problems.\n“You have the one drive in which it’s third-and-one or two and you just don’t make the tackle,” Strong said. “All of the sudden, they get a first down, then they burn more time off and guys start pressing.\n“That’s when you tell players that they’ve got to just relax and just play, but it’s really hard because everyone wants to make a play and everyone wants to get off the field. It just (magnifies) it more because everyone sees that, ‘Hey, we’ve got to get a stop, we’ve got to get the stop’ but we don’t get the stop.”\nThat pressure showed itself on South Florida’s next offensive possession as the Herd turned up the heat. The end result was a dropped pass by normally sure-handed tight end Mitchell Wilcox that led to a fourth-and-long from inside the USF red zone.\nStrong elected to punt and the Bulls never had the ball again as Marshall put the game away with another long drive that chewed up 73 yards in eight plays and ate up the final 5:43 of game action.\nThat fourth-quarter performance showed Marshall at its peak on both sides of the football, which Holliday said is a big momentum boost as the team heads into the offseason.\nMarshall ended its season by winning four of its final five games and six of its last eight, which was a contrast to 2017 when the Herd stumbled down the stretch in close contests before salvaging the season with a New Mexico Bowl win over Colorado State.\nThursday’s conclusion to the season was everything Holliday envisioned. Marshall finished the year with a solid all-around performance that allows the team to build as it turns to 2019.", "url": "https://apnews.com/9b89ec012dbe4fc297dacf0157119def"}