{"authors": ["Staff Writer"], "date_download": "2020-05-04 21:07:06", "date_modify": "2020-05-04 21:07:06", "date_publish": "2018-04-20 12:45:00", "description": "Harris Arts Center presents sculptural, functional and mixed media works by eighteen Georgia ceramic artists in “Talking With Our Hands,” on view through June 7. The exhibit opens with a...", "filename": "_0ae2a7c5fb4c412e911a96a53c5103bc_1588626426.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0ae2a7c5fb4c412e911a96a53c5103bc_1588626426.html", "title": "HAC ceramic art exhibit opens with reception on Sunday", "title_page": "HAC ceramic art exhibit opens with reception on Sunday", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Harris Arts Center presents sculptural, functional and mixed media works by eighteen Georgia ceramic artists in “Talking With Our Hands,” on view through June 7.\nThe exhibit opens with a reception at the art center on Sunday, April 22 from 3 - 4:30 p.m.\nAccording to Mary DeFoor, co-chair of the Visual Arts Guild, the title of the show reflects the fact that each of the artists has a story to tell through the medium of clay. From figurative and symbolic sculptures to graceful and colorful functional tableware, the exhibit features a diverse spectrum of artistic expression.\nArtists participating in the show include Tisa Barton, Sue B. Chisholm, Triny Cline and Mike Sherrer, Dan and Mary DeFoor, Fred and Laura Ellis, Sheryl Holstein, Jerry Jankovsky, Deborah Macknight, Phoebe Maze, Cathy Meincer, Janet Smith, Marie-Luce Van Asten, Tina Vamvakias, Ann Wallin, and Linda Zlotnik. The public is invited to come meet the artists and tour the galleries at the opening reception on April 22.\nHarris Arts Center is located at 212 South Wall Street in Calhoun. For further information, contact the center at 706-629-2599.", "url": "https://apnews.com/0ae2a7c5fb4c412e911a96a53c5103bc"}