{"authors": ["Andy Mannix"], "date_download": "2020-05-04 20:29:13", "date_modify": "2020-05-04 20:29:13", "date_publish": "2018-06-21 16:06:15", "description": "An independent investigation will focus on whether Minneapolis police officers inappropriately urged or assisted paramedics in the use of ketamine in recent years, Deputy Police Chief Henry...", "filename": "_d18be46574534036a67d815e7a164624_1588624153.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d18be46574534036a67d815e7a164624_1588624153.html", "title": "Ketamine probe will examine conduct of officers", "title_page": "Ketamine probe will examine conduct of officers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "An independent investigation will focus on whether Minneapolis police officers inappropriately urged or assisted paramedics in the use of ketamine in recent years, Deputy Police Chief Henry Halvorson told council members Thursday.\nAt the City Council’s public safety committee, Halvorson said no officers have been disciplined for incidents involving the powerful sedative. Reading a statement from Chief Medaria Arradondo, Halvorson said the information on ketamine and police is incomplete, and police command staff will wait for further investigation before deciding on how to respond.\n“When the report is final and the independent review has been completed I am committed to acting on the independent examiners findings and any best practices set forth,” said Halvorson, speaking for Arradondo, who had a prior commitment.\nHalvorson made the comments at a committee meeting so crowded the city opened up a separate viewing room for overflow.\nThe purpose of the meeting was to allow for public comment and an update regarding a draft report from the city’s Office of Police Conduct Review that questioned whether officers overstepped their bounds by urging paramedics to use ketamine, sometimes when it didn’t appear necessary.\nThe draft report has not been released to the public, but the Star Tribune obtained a copy and published excerpts last week.\nMore than a dozen members of the public spoke critically about the practice of paramedics sedating people at the behest of police. Many called on the council and police for swift action to discipline the officers quoted in the draft report.\n“What’s going on here? There’s a serious breakdown in oversight, which frankly does not surprise me,” said activist David Bicking. “I don’t think it’s good for the city to sit back and wait for lawsuits to be filed, though I’m sure there will be.”\n“It’s wrong. It’s just wrong,” said Toya Woodland, a minister. “And the people who did these things should be fired from their jobs immediately.”\nThe council invited representatives from Hennepin Healthcare to speak, but none were present.\nEarlier this week, Arradondo and Mayor Jacob Frey announced they would be calling for the investigation into the ketamine incidents. A group of City Council members asked for the police oversight investigators to finish their report by late July.\nThe council committee did not take any action at the meeting Thursday, but several members raised concerns over the draft report and questioned Halvorson on the police response.\n“I hear everyone here,” said Council Member Phillipe Cunningham. “Y’all showed up and spoke truth about what is happening and I share in your concern.”\nCouncil Member Jeremiah Ellison asked Halvorson about the investigation that Arradondo and Frey requested.\nHalvorson said they have not yet named an investigator, but will look for someone outside the city -- and potentially outside the state -- with no ties to the police department. He said Arradondo and Frey are very close to naming the investigator, and the examination will likely be limited to the actions of Minneapolis officers, rather than questions the draft report raised about paramedics.\n“Basically we will focus on what our officers were doing at the scene specifically related to ketamine,” said Halvorson.\nSeveral council members spoke about the importance of preserving community trust and showing the city cares about the civil rights of its citizens.\n“Whether we discover that our officers directly ordered or had a legally inappropriate role in administering ketamine, what I can tell you is this feels like a violation of the spirit of our community,” said Council Member Steve Fletcher. “What most of us feel is recoil.”\nAndy Mannix • 612-673-4036", "url": "https://apnews.com/d18be46574534036a67d815e7a164624"}