{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "J. W. Mason", "Nuno Teles"], "date_download": "2020-05-04 19:57:02", "date_modify": "2020-05-04 19:57:02", "date_publish": "2018-10-11 00:00:00", "description": null, "filename": "2018_10_too-big-to-fail-sanders-bill-financial-crisis_1588622222.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/10/11131331/GettyImages-79017339.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_10_too-big-to-fail-sanders-bill-financial-crisis_1588622222.html", "title": "“Too Big” Is Too Little", "title_page": "“Too Big” Is Too Little", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Sanders’s bill is a step in the right direction. But if we want to transfer power from Wall Street to Main Street, we’re going to have to think bigger.\nOn the tenth anniversary of TARP’s founding, another man has decided to take on the banks. Bernie Sanders introduced a bill in Congress last week — the “Too Big To Fail, Too Big to Exist Act” — to cut America’s biggest financial institutions down to size and, hopefully, prevent a second Great Recession. The primary aim of the legislation is to force the “breakup of any financial institution with a total exposure greater than 3 percent of our nation’s GDP, $584.5 billion.” It targets JP Morgan Chase, Citigroup, Wells Fargo, Goldman Sachs, Bank of America, and Morgan Stanley — which, according to the bill’s summary , control over $10 trillion in assets or 54 percent of the US gross domestic product.\nUnfortunately, Barofsky’s unwitting role in the drama was to provide cover for the very institutions that had caused the crisis, “foaming the runway” for the banks so they could return to business as usual. And return they have. Today, America’s financial behemoths are bigger than ever.\nTen years ago Neil Barofsky got the call. His country needed him. The financial sector had collapsed in what would end up being the biggest financial crisis since the Great Depression, and it was up to Uncle Sam to save the day. Barofsky packed his bags and headed to Washington, determined to do his part as the special inspector general overseeing the Troubled Asset Relief Program (TARP).\nPreventing the Next Crisis\nThe timing of Too Big’s release commemorates more than just the debacle of Wall Street fat cats getting paid while millions lost their homes, jobs, and pensions in the 2008 crisis. It’s also a reminder that even though a decade has passed since the financial meltdown, the country is still in crisis. The US economy is doing well by many accounts — low official unemployment and inflation, strong corporate profits and stock market — yet we feel an overwhelming sense of foreboding. Hand wringing and murmurs about getting out ahead of the next big one have checkered the pink pages for months.\nGetting out ahead is a central aim of Sanders’s bill. The logic is simple: if we don’t let banks get too big, they won’t bankrupt us if (and when) they fail. The bill compels banks to shrink down (within two years), and limits their freedom to gamble with insured deposits while they restructure. It also requires insurance companies and other “near-bank” financial institutions to publicly report their exposure, and increases oversight from the Federal Reserve vice-chair for supervision and the Financial Stability Oversight Council.\nSo would Sanders’s bill prevent a catastrophe like the 2007–8 US crisis and bailout? The experts will no doubt weigh in. It’s worth remembering, however, that the 2007–8 crisis was a “black swan” event. Even observers who were deeply uneasy about the housing bubble had little sense of the magnitude or the mechanisms of the coming crash. When Lehman Brothers tanked, nearly everyone (except maybe that guy in The Big Short) was stunned.\nWhile it’s impossible to say how the next big financial crisis will play out, the global financial system remains highly integrated and unstable — so it’s a safe bet that the conflagration won’t be contained to a handful of big US banks. As a bill focused primarily on American financial institutions, Too Big does little to address the global nature of financialization, making no attempt to restructure global financial markets or regulate capital flows. This is likely to limit its efficacy, especially considering how the ripple effects of the 2008 financial crisis were felt in nearly every corner of the world. It’s hard to imagine how we could prevent or ameliorate the next big one without addressing the interlocking nature of global finance.\nTackling global financial hegemony is a tall order, however, so it’s unfair to dismiss the bill for not doing so. Sanders is right to go after the big US banks. They should be reined in. But we should also be clear-eyed about Too Big’s limitations.\nThe bill’s supporters — including left-liberal heavyweights like James Galbraith, Robert Hockett, and Dean Baker — view it as a big step in the effort to “revitalize Main Street and cut Wall Street back down to size.” Brad Sherman, a cosponsor and fellow break-up-the-banks advocate, says, “By breaking up these institutions long before they face a crisis, we ensure a healthy financial system where medium-sized institutions can compete in the free market.”\nProponents of the bill further contend that by limiting the size of financial institutions, credit will flow more widely and smaller banks will multiply, serving Main Street instead of Wall Street and ameliorating the annoying fact that big banks would rather earn a profit on hedges and derivatives than lend money to communities and households. If we just restore competition, the “free market” will work its magic.\nThis is a fantasy. A “healthy financial system” would force banks (no matter their size) to loan money to ordinary people at low interest rates. It would place strict limits on how banks could use federally insured (and publicly backed) deposits. It would guarantee community access to affordable loans. It would ban the predatory practices of banks in poor neighborhoods, especially poor neighborhoods of color, and expand basic affordable financial services to the millions of American households who are either unbanked or are forced to rely on financial predators. The bill does none of these things.\nSanders’s bill is perfectly fine as a stopgap measure. But if our goal is to reduce the power of financial logic to shape life according to the needs of the rich, we need a bigger vision. Too Big, alongside legislation like New York senator Kirsten Gillibrand’s postal banking bill (which Sanders and others support), could be part of this bigger vision — but they can’t be the anchor point of radical reform.", "url": "https://www.jacobinmag.com/2018/10/too-big-to-fail-sanders-bill-financial-crisis"}