{"authors": ["Allen Trieu", "Special To The Detroit News"], "date_download": "2020-05-04 20:07:52", "date_modify": "2020-05-04 20:07:52", "date_publish": "2018-05-22 20:33:20", "description": "Michigan is set to receive an official visit from Hoover (Ala.) wide receiver George Pickens on June 9. Pickens (6-5, 199 pounds) is a Top 100 national prospect who has been committed to Auburn...", "filename": "_c6376579678a495287cd1f8bf6990ac8_1588622872.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c6376579678a495287cd1f8bf6990ac8_1588622872.html", "title": "Trieu: Michigan in play for Auburn WR commit Pickens", "title_page": "Trieu: Michigan in play for Auburn WR commit Pickens", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Michigan is set to receive an official visit from Hoover (Ala.) wide receiver George Pickens on June 9. Pickens (6-5, 199 pounds) is a Top 100 national prospect who has been committed to Auburn since last July, but a sudden recruiting boom has him re-thinking whether he experienced enough of the recruiting process.\n“It was this time last year that he was finally playing varsity at Hoover, ...,” 247Sports analyst John Garcia said. “He had a huge spring game and a lot of schools were thinking, why haven’t we heard of him before? So he starts getting offers that day and a few weeks later, camps at Auburn, gets an offer and commits. He was just getting around to getting recruited, so he’s doing everything in reverse order because he blew up and committed early. As he continued to add offers, he felt he hadn’t entirely taken advantage of the process.”\nAs an eighth-grader, Pickens caught the ball so well with one-hand that his coaches said he almost refused to use two hands to catch the ball. With Hoover being such a storied program, young players do not get pulled up to varsity often, so even though he flashed major talent early, he had to wait his turn and did not see the recruiting rush until that fateful spring game last year.\nHe has maintained his Auburn commitment and only recently decided to take visits.\n“I was surprised,” Garcia said. “He has the Michigan one set, he wants to take one to Oregon and he wants to get back to Auburn soon. He also mentioned Alabama, South Carolina and Florida State. He says he’s solid, but he’s opened things up in terms of visits, which he wasn’t in the past. If he follows through, it could be interesting. He’s had some planned in the past and been a no-show.”\nThe Wolverines currently do not have a wide receiver commit in their 10-man 2019 recruiting class. Pickens is similar in size and style to Nico Collins, who the Wolverines signed out of Alabama in the 2017 class and played as a freshman last season.\n“Pickens is really good,” Garcia said. “He’s still pretty lean relative to his height. He was a running bck coming up and he’s not the fastest dude, but for his size, when he catches the ball, the first guy never brings him down. He is always breaking tackles. He is the starting punt returner. He is very athletic and instinctive with the ball. He is still learning to set up defenders, but he has the length and his hands are strong already.”\nThere have been some great players who have come through Hoover — including Chad Jackson, who was a first-round draft choice at wide receiver coming out of Florida — but Pickens is right there with any of them, according to the Hoover coaches.\n“They say he might be the best wide receiver to come through that program, which is saying a lot,” Garcia said.\nMichigan will get its shot at adding that talent to its class in early June.\nUM offers 2 in-state teammates\nEast Kentwood class of 2020 defensive end Bryce Mostella and offensive lineman Dallas Fincher were both offered by the Wolverines last week. Both have been to campus before, and Mostella said he plans to return for camp in June.\nThe 6-foot-6, 235-pound Mostella already has drawn a number of predictions for the Wolverines on the 247Sports Crystal Ball.\nFincher (6-4, 265 pounds), on the other hand, is a Michigan State legacy (his father Mark was an offensive tackle there) who has several predictions for the Spartans.\nThe Wolverines are heavily recruiting their class of 2019 teammate Mazi Smith.\nMore information\nGeorge Pickens profile\nBryce Mostella profile\nDallas Fincher profile\nAllen Trieu covers Midwest football recruiting for 247Sports. He has been featured on the Big Ten Network on its annual Signing Day Show. His Michigan and Michigan State recruiting columns appear weekly at detroitnews.com.", "url": "https://apnews.com/c6376579678a495287cd1f8bf6990ac8"}