{"authors": ["Donald Hunt Tribune Staff Writer"], "date_download": "2020-05-04 20:16:49", "date_modify": "2020-05-04 20:16:49", "date_publish": "2018-04-06 04:00:00", "description": "For the second time in three years, Villanova had a spectacular parade to celebrate its NCAA basketball championship in Philadelphia. Thousands of Philadelphia sports fans along with a...", "filename": "_0f5a4e44efa94fc58ff1c75ce4310a97_1588623409.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0f5a4e44efa94fc58ff1c75ce4310a97_1588623409.html", "title": "Philadelphia celebrates NCAA champions Villanova with parade", "title_page": "Philadelphia celebrates NCAA champions Villanova with parade", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "For the second time in three years, Villanova had a spectacular parade to celebrate its NCAA basketball championship in Philadelphia.\nThousands of Philadelphia sports fans along with a number of Villanova alumni came down to Dilworth Park to greet and recognize the national champion Wildcats as they cruised the Center City streets in two buses.\nPhiladelphia has become a championship town this year. The city has held two championship parades in less than two months.\nThe Eagles had a Super Bowl parade after defeating the England Patriots in February.\nThen, Villanova catapulted itself into the national spotlight Monday night crushing Michigan to bring home its third NCAA title in school history.\nThe parade route started at 20th and Market streets and concluded at Dilworth Park around city hall. The team still basking in the glow of the big win just a few days ago really enjoyed all the festivities.\n“It’s a group of people you’re going to remember for a long time,” said Jalen Brunson, who won several national player of the year honors. “This is so special. We’re just really thankful.”\nBrunson was part of the 2016 celebration in Philadelphia along with his backcourt teammate Phil Booth who gave the Wildcats steady and great leadership. Booth was thrilled to be a part of two championship parades.\n“The love we’re getting is amazing,” Booth said. “It’s genuine. You can feel it. It’s real. The fans have been great all year. They’re so supportive. It’s a great all-around day.”\nVillanova finished the season with a 36-4 overall record. The Wildcats have established themselves as one of the elite programs in college basketball.\nJay Wright, Villanova head coach, enjoyed the parade and tried to stay in the moment.\nAlthough many people are looking forward to see if the Wildcats can win another championship next year.\n“I really have not thought about next year,” Wright said. “We’re trying to get through this [victory celebration]. I really want to make sure the guys enjoy this. Even though we have guys who decisions to make about the NBA. They’re also putting everything off to try to enjoy this week especially Jalen [Brunson] and Mikal [Bridges]. They’re going to get these awards in L-A [Los Angeles].”\nBridges is a candidate for the Julius Erving Award. Brunson is up for the Bob Cousy Award as well as the John R. Wooden Award for Player of the Year honors.\n“It’s a great event,” Wright said. “They can enjoy this [celebration] and being in L-A and then come back and think about next year.”", "url": "https://apnews.com/0f5a4e44efa94fc58ff1c75ce4310a97"}