{"authors": ["Joe Allen", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman"], "date_download": "2020-05-04 19:59:59", "date_modify": "2020-05-04 19:59:59", "date_publish": "2018-10-11 00:00:00", "description": null, "filename": "2018_10_ups-contract-rejection-james-hoffa-hybrid-drivers_1588622399.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/10/11183441/hoffa.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_10_ups-contract-rejection-james-hoffa-hybrid-drivers_1588622399.html", "title": "James Hoffa’s Anti-Democratic UPS Catastrophe", "title_page": "James Hoffa’s Anti-Democratic UPS Catastrophe", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Rank-and-file reaction to the October 5 vote count on the two proposed national contracts between the Teamsters and United Parcel Service (UPS) quickly went from elation to confusion to raw fury in a few minutes.\nThe vote count was carried live on a nationwide conference call and online. It was presided over by Ed Hartfield, the Teamsters election supervisor, and Denis Taylor, the Teamsters chief negotiator for UPS.\nIn a ceremony reminiscent of a state lottery, the results showed that the UPS National Master Agreement, the larger of the two covering 260,000 workers, was rejected by 55 percent of the members who voted, while the UPS Freight contract, covering about twenty thousand workers, was rejected by an even greater number, 63 percent. (Slightly less than half of all UPS Teamsters voted.)\nReaction to the vote was quick, especially from those who had been campaigning for its defeat in one of the most contentious contract battles in many years. Joan-Elaine Miller, a veteran UPS package car driver in Philadelphia, posted on the popular Vote No on UPS Contract Facebook page:\nWe fucking did it !!! We voted down the national and forced Taylor back to the table !!! I am crying tears of joy right now!!!!WE FUCKING DID IT!!!!!!\nIt was an important victory. It’s hard to carry out any kind of “vote no” campaign like this one on a national scale; it is even more difficult at an enormous, far-flung corporation like UPS that runs a twenty-four-a-day operation with a myriad of work classifications and a high turnover rate among part-timers, which is as high as 90 percent per annum in most locations.\nLocal supplements were also defeated. In New York City, the Teamsters Local 804 agreement, the old home local union of the late Ron Carey, the leader of the historic 1997 national UPS strike, was rejected by a whopping 95 percent of the membership.\nWhat made the victory even more sweet was that “vote no” campaigners led by Teamsters for a Democratic Union (TDU) and Teamsters United fought the combined forces of the company and the union. Both UPS and the bulk of the Teamsters leadership led by James P. Hoffa campaigned together to get a quick ratification of both contracts, which were loaded with unnecessary and unpopular concessions.\nThey also hoped to avoid the thicket of problems that ensnared them five years ago, when UPS Teamsters repeatedly voted down regional and local supplements (mini-contracts that cover certain workers and geographic areas) that prevented the implementation of the national contract for ten months.\nFive years ago, the major flashpoint of the contract battle was healthcare concessions. This time around, it’s the controversial proposal to create a new category of “hybrid-drivers,” who would make less than full-time package cars drivers and work weekends without overtime pay.\nThis proposal ironically came from the Teamsters themselves, who tried to sell it as a way of combating the burdensome overtime that falls on package car drivers across the country.\nIt was a devious ploy. UPS had dreamed for years of breaking up the high-paying package jobs, and getting the union to make the proposal instead of them was seen as a way of making a debilitating concession look like a gift. It didn’t work, but it revealed that Hoffa and Taylor were willing to do the worst biddings of the company.\nAt the same time, a lot of opposition to the contract proposals both at UPS and UPS Freight came from a general anxiety at the continued decline of the union — and with it, the working conditions that have led to two mass shootings at UPS in the last three years.\nInsult was added to injury in the final days of voting when Amazon CEO Jeff Bezos, the richest man in the world, announced that he would raise the minimum wage for new and current Amazon employees to $15 an hour. The current Teamsters-negotiated contract with UPS starts part-time employees at $13.\nConfusion, however, set in after the rejection votes were announced when Denis Taylor — not the most articulate of men in the best times — muttered that the contracts were “ratified.” As one of the many thousands who listened in and watched online, I thought to myself, “Did I hear that right?”\nIt wasn’t a mistake — and it wasn’t completely unexpected either. At a Teamsters-UPS national grievance panel meeting in San Diego several days before the vote count, Taylor threatened to impose the proposed contract even if a majority rejected it.\nHoffa and Taylor rely on the dubious interpretation of the Teamsters Constitution that grants the Teamsters general president the power to implement a contract if less than 50 percent of the members vote on a contract that then requires two-thirds “no” vote to reject. But this is only the case in a final offer, and, anyway, the general president can also return to negotiations if he wishes.\nHoffa and Taylor have chosen to deliberately ignore the wishes of UPS Teamsters and side with the company against their own members, despite significant portions of the UPS Teamsters who want to take the fight to the company. In June, 90 percent of UPS and UPS Freight Teamsters voted to authorize a strike, and now a majority of UPSers have voted down both Teamsters contracts. Hoffa and Taylor don’t care.\nSuch treachery is not new to Hoffa. When he was a labor lawyer in the late 1980s and early 1990s, he was the attorney for Teamsters Local 283. Local 283 was led by an old corrupt official, George Vitale.\nVitale wanted to keep the local’s members from seeing their contract and the financial records of the local union hidden from the members. Hoffa represented Vitale in federal court. The judge who presided over these cases lambasted Hoffa:\nThe people you represent work hard. They do physical labor for a livelihood. They are not lawyers, and most of them have no hope of ever becoming a lawyer. They hope, in fact, through their membership in a union such as this to be able to educate their children as your parents were able to, to spare them the back-breaking work they are undergoing. Their dues in this organization are paid to advance their lives, not to set off your ego.\nSounds familiar.\nRight now, petitions are circulating to demand Hoffa honor the wishes of the membership. Members have made calls for an emergency meeting of the Teamsters General Executive Board to override Hoffa and Taylor. They have ignored these appeals so far.\nHoffa’s sabotage at UPS is not only a catastrophe for UPS Teamsters — it is a gift to antiunion forces in the Janus era. If a boss wanted to make up a story to defeat a fledgling union drive — with indifferent union leaders who collect members’ dues, negotiate a contract with a lower starting pay than non-union Amazon, and then flagrantly ignore those workers’ clearly and democratically stated objections to that contract — they couldn’t come up with one as good as what’s just played out between UPS and the Teamsters.\nJames Hoffa is a gift that keeps on giving to the bosses. It’s up to the rank-and-file UPS workers to decide what happens next.", "url": "https://www.jacobinmag.com/2018/10/ups-contract-rejection-james-hoffa-hybrid-drivers"}