{"authors": ["Cody Scott"], "date_download": "2020-05-04 20:10:33", "date_modify": "2020-05-04 20:10:33", "date_publish": "2018-08-25 04:03:49", "description": "The Ligonier Valley girls soccer team is looking forward to building off of a 9-5-5 season that ended with a 1-0 loss to Central (Martinsburg) in the District 6 Class AA quarterfinals. The...", "filename": "_06832c169e82427caa7a3f85ea9d6224_1588623033.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_06832c169e82427caa7a3f85ea9d6224_1588623033.html", "title": "Experienced Ligonier Valley girls soccer looks to take next step", "title_page": "Experienced Ligonier Valley girls soccer looks to take next step", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Ligonier Valley girls soccer team is looking forward to building off of a 9-5-5 season that ended with a 1-0 loss to Central (Martinsburg) in the District 6 Class AA quarterfinals.\nThe team has gradually progressed over the past three years -- missing the playoffs in 2015, a first-round exit in 2016 and the loss in the quarterfinals last season.\n“This is a talented, experienced group,” coach Eric Vogelsang said. “We have eight returning starters, with seven of those being starters for at least three years, so we are loaded with experience.”\nThe group will be led by senior forward Mia Lynn, who had 21 goals and 10 assists last season.\n“We have a bunch of motivated seniors coming into this season, which will help us from our transition from last year into this season,” Lynn said. “We have six senior starters that can bring a lot of energy and continue to motivate the younger players.”\nLynn also became the second player in school history to score a hat trick in a playoff game, netting all three goals in a 3-0 win over Forest Hills in the first round. At 41 total career goals, she is nine away from becoming the sixth player in Rams history to hit the 50-goal plateau.\n“Mia Lynn as a striker has made herself a bonafide superstar with her offseason work,” Vogelsang said. “She is one of the strongest I have ever had, and will likely graduate as our second all-time leading scorer if she has a season like last year, which we fully expect.”\nAlthough the team lost goalie Lexie Petrof to graduation, Ligonier Valley is looking forward to solid play from senior Anna Walker, a backup the past three seasons.\n“Lexie Petrof was the best goalie I have ever coached, period,” Vogelsang said. “But, we are so lucky not to have to start from scratch. (Walker) has been the dutiful backup for three years without complaint, and is ready to shine her senior year as a starter.”\n“The main difference this year is that we will not have Lexie back in goal for us as she was for the past four years,” Lynn said. “That being said, we are happy to have Anna, who we can trust, has seen everything and will always be ready mentally come game time.”\nWith the talent, experience and depth, the expectations from both the coaches and players are higher than they have been in the past years.\n“I have done this long enough to know there are lots of things that can go wrong in a season that are unexpected, but I have not entered a season more confident and optimistic, possibly ever. I am hoping this is the year,” Vogelsang said.\nThe Rams will start the season at Indiana’s Labor Day Kickoff tournament. They will match up against Indiana in the first game at 3 p.m. Aug. 31.\n“We are always looking on improving, so we want to be able to make a deeper run come playoff time,” Lynn said. “As a senior, my focus is on a district title. With the number of seniors we have on this team, I think it is important that we go out on a high note.”", "url": "https://apnews.com/06832c169e82427caa7a3f85ea9d6224"}