{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:06:01", "date_modify": "2020-05-04 20:06:01", "date_publish": "2018-04-20 17:00:00", "description": "Hazel A. Markham, age 87, of Rochester, died on Wednesday, April 18, 2018, at Seasons Hospice House in Rochester. The celebration of life will be at 11 a.m. Monday, April 23, at Ranfranz and...", "filename": "_a3433af9f3d44ac6a43c3d77a9fd5106_1588622761.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a3433af9f3d44ac6a43c3d77a9fd5106_1588622761.html", "title": "Hazel Markham -- Rochester", "title_page": "Hazel Markham -- Rochester", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Hazel A. Markham, age 87, of Rochester, died on Wednesday, April 18, 2018, at Seasons Hospice House in Rochester.\nThe celebration of life will be at 11 a.m. Monday, April 23, at Ranfranz and Vine Funeral Homes. The visitation will be from 4 p.m. to 7 p.m. Sunday, April 22, and one hour prior to the service at the funeral home. The burial will be in Grandview Memorial Gardens. In lieu of flowers, memorial gifts may be directed to Homestead Church or to Mayo Clinic Cancer Research.\nHazel Agnes Brown was born on May 12, 1930, in Eyota Township, Olmsted County, to Harry O. and Inez (Jarred) Brown. In 1938, she moved with her family to Rochester. She graduated from Rochester High School in 1948.\nHazel married William Clarence Markham, son of Bernie and Mabel (Stoppel) Markham, of Oronoco Township on June 14, 1948, at the United Brethren Church in Rochester, where she was baptized and confirmed as a child.\nThe couple lived in Marion Township until Oct. 12, 1952, when they moved to his family farm in Oronoco Township, where they lived for 56 years. They attended the Oronoco Presbyterian Church from 1952 to 1967, when they returned to the United Brethren Church, which was then called Homestead United Methodist in Rochester. They continued to live on the farm and celebrated their 60th wedding anniversary in 2008. William passed away March 14, 2009. Hazel moved to Rochester on July 1, 2009.\nHazel was a homemaker, farm wife, mother of five children and partner with her husband in business ventures. Later, she worked at various places in Rochester until 1986, when she attended Rochester Vocational School and graduated in 1987. She worked for Mayo Clinic and then at IBM, where she retired in 2004 at the age of 74.\nHazel volunteered in various jobs at churches, schools, 4-H, history centers and nursing homes. Her interests included home, family, friends, writing, history, piano, computer, sewing and entertaining. Hazel enjoyed collecting and organizing objects and information.\nSurviving are daughters, Jeannine Markham of Rochester, Patty (Chopper) Cowden of Oronoco and Rita (Greg) Kirchner of Elgin; sons, Thomas (Vicki) of Byron and Howard (Alison) of Rochester; 14 grandchildren: Jennifer and Jamison (Natalie) Hayward, Andrea, Rachel, Emma and William T. (Amber) Markham, Alexandra (Luke) Urevig, Christina, Richard A. (Mandy) Fricker, Robyn (Randall) Tullis, Heidi Cowden, Holly Eklund, and Gabriel and Andrew Kirchner; nine great-grandchildren, Calvin and Erin Hayward, Kaylee Cowden, Kaden Spaid, Mazzy and Kinsey Fricker, Ava Markham, and Jude Tullis and Liam Urevig; sister, Marie Mork of Rochester; brother, Ned Brown of Rochester; two Markham brothers-in-law and two Markham sisters-in-law, Leon and Virginia Markham of Mantorville, Bernard Markham of Rochester and Eunice Markham of Oronoco; as well as several nieces and nephews and many friends.\nHazel was preceded in death by her parents; husband, William; two infant sons; one infant daughter; sister, Mae Eickhoff; sister-in-law, Marlys Brown; two brothers-in-law, Vic Eickhoff and Ken Mork; her husband’s parents; siblings and spouses, Henry, Tess, Dorothy, Vernon, Leonard, Myra and Betty Markham, and Doris and Gaylord Kautz, all of whom were like family to her.\nArrangements are with Ranfranz and Vine Funeral Homes, 5421 Royal Place NW, Rochester, MN 55901. www.ranfranzandvinefh.com.", "url": "https://apnews.com/a3433af9f3d44ac6a43c3d77a9fd5106"}