{"authors": ["S.A. Miller The Washington Times"], "date_download": "2020-05-04 20:08:10", "date_modify": "2020-05-04 20:08:10", "date_publish": "2018-02-21 15:15:00", "description": "The Winter Olympics now will get the real Ivanka Trump. President Trump's daughter and top adviser will lead the U.S. delegation to the closing ceremonies this weekend at the Winter Olympics...", "filename": "_92163328405ed4e3763845eca46c3bf5_1588622890.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_92163328405ed4e3763845eca46c3bf5_1588622890.html", "title": "Ivanka Trump to lead U.S. delegation to Winter Olympics closing ceremony", "title_page": "Ivanka Trump to lead U.S. delegation to Winter Olympics closing ceremony", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Winter Olympics now will get the real Ivanka Trump.\nPresident Trump’s daughter and top adviser will lead the U.S. delegation to the closing ceremonies this weekend at the Winter Olympics in Pyeongchang, South Korea.\nThe opening of the games was marked by breathless news reports about the North Korea delegation that included the dictator’s sister, Kim Yo-jong, who was favorably compared to Ms. Trump.\nMs. Trump, a winter sports enthusiast, said she was honored to lead the U.S. delegation.\n“We look forward to congratulating Team USA and celebrating all that our athletes have achieved,” she said. “Their talent, drive, grit and spirit embodies American excellence, and inspire us all.”\nMs. Trump will be accompanied by White House press secretary Sarah Huckabee Sanders and several dignitaries.\nA senior White House official described the visit by Ms. Trump and the delegation as an opportunity to cheer on athletes and reaffirm the U.S.-South Korean alliance.\n“It is a celebration of a successful games and in the spirit of the games,” the official said.\nMs. Trump will not engage in talks or interaction with North Korean officials, the official said.\nMs. Trump will have dinner Friday with South Korean President Moon Jae-in at the Blue House in Seoul. She and the other members of the delegation will attend Olympic events in Pyeongchang on Saturday and Sunday.\nThe delegation includes Sen. James E. Risch, Idaho Republican and chairman of the Senate Foreign Relations Near East, South Asia, Central Asia, and Counterterrorism Subcommittee; General Vincent K. Brooks, commander of United Nations Command, Combined Forces Command, and U.S. Forces Korea; Marc E. Knapper, charg d’affaires ad interim at U.S. Embassy in Seoul; and Sgt. Shauna Rohbock, a U.S. Army National Guard member, Team USA coach and former Olympic athlete.", "url": "https://apnews.com/92163328405ed4e3763845eca46c3bf5"}