{"authors": ["James Varney The Washington Times"], "date_download": "2020-05-04 20:07:42", "date_modify": "2020-05-04 20:07:42", "date_publish": "2018-09-16 18:50:12", "description": "Support for Democrats from Hollywood left-wingers is nothing new, but Texas senatorial candidate Robert \"Beto\" O'Rourke has taken it to new heights this midterm. The Democratic...", "filename": "_d805b87fe9fb72f191931fd161b728f8_1588622862.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d805b87fe9fb72f191931fd161b728f8_1588622862.html", "title": "Beto O'Rourke getting support from Hollywood stars", "title_page": "Beto O'Rourke getting support from Hollywood stars", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Support for Democrats from Hollywood left-wingers is nothing new, but Texas senatorial candidate Robert “Beto” O’Rourke has taken it to new heights this midterm.\nThe Democratic representative whom polls show within striking distance of incumbent Republican Sen. Ted Cruz has been ubiquitous on the showbiz circuit recently.\nAfter making an appearance on Ellen DeGeneres’ talk show, Mr. O’Rourke this week hit the town in Manhattan, showing up on Stephen Colbert’s late night show and attending a fundraiser hosted by Bravo network’s Andy Cohen. Later this month, country singer Willie Nelson will give a concert for Mr. O’Rourke in Austin, Texas.\nMr. Nelson has long called Texas home and thus will probably seem less Hollywood than others. Yet as the social media backlash against his upcoming gig showed, not everyone is happy to see the stars come out.\nNevertheless, for an underdog like Mr. O’Rourke, the Hollywood attention provides lots of cash and friendly airtime.\n“I think the O’Rourke campaign is pursuing two different strategies and as always when you try to do two things there’s some tension there,” said University of Texas law professor F. Scott McCown. “There might be some who are turned off by the Colbert and DeGeneres stuff, but there are others who will hear about you and be energized by it all. Beto’s trying to appeal to those Texans who traditionally vote and are sort of more moderate, Lloyd Bentsen-type folks and peel them off, and at the same time turn out folks who haven’t traditionally voted.”\nHollywood’s swollen wallets have often opened for liberal causes and Democrats, although often that is most noticeable in presidential elections and with national topics such as gun control or abortion. The 2018 midterms, with a progressive base energized by animus toward President Trump, offer an unusual moment in which movie stars are getting more granular, as in Mr. O’Rourke’s bid to unseat Mr. Cruz.\nMr. Cruz has spoofed Hollywood’s love affair with his opponent. On Thursday, over a photoshopped picture of “BETOWOOD” as the famed sign in the hills above Los Angeles, Mr. Cruz wrote, “we’ve been told that Hollywood is afraid of being outdone by New York after last night’s fundraiser, so now they’re pulling out all the stops. #DontCaliforniaOurTexas.”\nAs an example of left-wingers in Hollywood involved at the moment in a national issue, several of them have backed the campaign to give money to the opponent of Maine Republican Sen. Susan Collins should she vote against the confirmation of Supreme Court nominee Judge Brett M. Kavanaugh. This “never-used before conditional fundraising [that] sets wave for future advocacy,” as its organizers bill it, has attracted money from familiar left-wingers in showbiz such as Chelsea Handler, Amy Schumer and Debra Messing.\nOther Tinseltown fundraising efforts on behalf of Democrats are in the works. For instance, DreamWorks founding partner Jeffrey Katzenberg will host a Beverly Hills fete for Democrats like House Minority Leader Nancy Pelosi on Sept. 24 at which some of Hollywood’s best known liberals, such as Barbra Streisand and Steven Spielberg are scheduled to attend, according to industry press.\nSimilarly, Jimmy Kimmel is slated to “emcee” a fundraiser Los Angeles Democratic Mayor Eric Garcetti is holding to raise $1 million for Democrats in 10 state races. Variety has reported that some actors like Alyssa Milano and Ron Livingston have quietly been meeting with “politicians and Democratic National Committee figures.”\nMovie star support for Democrats isn’t always a game changer in state races that polling shows are close. Four years ago, for instance, when Democrat Alison Grimes tried to unseat Republican Senate Majority Leader Mitch McConnell in Kentucky, she got maximum contributions from Ben Affleck, Leonardo DiCaprio and Jennifer Garner, among others, but fell short.\nNor is Texas the only state in which star power is being brought to bear on behalf of Democrats this November. Democratic Sen. Jon Tester in Montana is facing a strong re-election challenge from the state’s Republican Auditor Matt Rosendale, and Mr. Tester tied a fundraiser this summer to a Pearl Jam concert there that featured a poster with a corpse of Mr. Trump in front of the White House.\nConservatives have their occasional Hollywood backer, too, although they tend to be more low-key about their support. Rob Lowe, Kelsey Grammer, Jon Voight and Bruce Willis have all been associated with conservative issues or Republican candidates at various times, and James Woods is popular on Twitter.\nBut there do not appear to be any GOP galas on the schedule in Santa Monica the next two months.\nEmployees at Creative Artists Agency, a Hollywood powerhouse firm, have donated $12,100 to Mr. O’Rourke, good for 48th on his list of most common employers among contributors. Overall, CAA employees have donated nearly $2250,000 to Democrats this cycle, compared to $13,000 to GOP candidates, according to the Center for Responsive Politics’ numbers.\nRepublican officials in Texas said they are familiar with facing off against on-screen star power.\n“It just shows again that O’Rourke’s base of support is a collection of bicoastal liberals in Hollywood and New York,” said state GOP Chairman James Dickey. “Fortunately, Hollywood’s never spoken for Texas voters, because Beto O’Rourke’s off-the-cliff liberal policies may be attractive to Californians, but not Texans. Texans appreciate that life is better in Texas because of policies Ted Cruz and the Republican leadership have put in place here.”\nThe O’Rourke campaign did not respond to questions about balancing Hollywood’s message against Texas voters’ priorities.", "url": "https://apnews.com/d805b87fe9fb72f191931fd161b728f8"}