{"authors": ["Mike Stivers", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Megan Erickson"], "date_download": "2020-05-04 19:54:58", "date_modify": "2020-05-04 19:54:58", "date_publish": "2018-07-04 00:00:00", "description": null, "filename": "2018_07_the-socialist-case-for-school-integration_1588622098.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/07/04144020/9606779193_a4c03af235_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_07_the-socialist-case-for-school-integration_1588622098.html", "title": "The Socialist Case for School Integration", "title_page": "The Socialist Case for School Integration", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nLevels of school segregation are approaching what they were in the immediate aftermath of Brown v. Board of Ed. in 1954. Massive expansions of public school systems, alongside President Johnson’s Great Society programs, huge changes in curriculum and pedagogy, additional academic research outlining the scope of the problem, lawsuits demanding desegregation, attempts at busing, and more have still not addressed the issue. In fact, school segregation is getting worse. The numbers are depressing, the prospects grim. But there is a way forward to desegregate American schools — one that differs from those most commonly offered in the last sixty years. Arguments for integration have emphasized inclusion and multiculturalism. Often these arguments have also taken up a “zero-sum” framework in which demands are made to redistribute existing resources from predominantly middle-class, white communities towards poorer communities of color. It’s an important framework that we shouldn’t discard. But truly integrating our nation’s schools requires that we move beyond it. Integration will only be transformative and lasting if it can also force the state to redistribute wealth and massively expand universal public institutions that benefit all.\nHow Bad Is It? The current state of school segregation is abhorrent. When school integration peaked in 1988, almost 45% of African-American students were attending majority white schools. It’s been a steady backslide since then. According to a 2016 New York Times article, “In the Northeast, 51.4 percent of black students attend schools where 90 percent to 100 percent of their classmates are racial minorities, up from 42.7 percent in 1968. In the country’s 100 largest school districts, economic segregation rose roughly 30 percent from 1991 to 2010.” In states where integration was court-ordered, many integration programs that were once mandated by courts have been deemed unnecessary or even unconstitutional. According to a 2016 study by the Government Accountability Office, “more than 20 million students of color now attend racially and socioeconomically isolated public schools.” This “isolation” is defined as those schools where more than 75 percent of children receive free or reduced-price lunch and more than 75 percent are black or Hispanic. That number is up from about 14 million students in 2001. The Hechinger Report , an investigative journalism organization for education issues, recently noted that this segregation exists in both big cities and small towns. While major metropolitan centers are often referred to as “diverse,” the more appropriate term is typically “segregated,” as Nate Silver at notes . And while large Southern cities like Atlanta and New Orleans rank among the most segregated, so do northern cities like Philadelphia, Washington D.C., and the country’s most residentially segregated city, Chicago. Rural schools are often less segregated, challenging the typical image of small-town southern racism. But even they don’t fare much better. As Gary Orfield and Erica Frankenberg of UCLA’s Civil Rights Project note, it’s only in rural areas that “half of black and Latino students attend majority white schools.” They add that “the only areas where levels of intense segregation have declined since the early 1990s for black and Latino students are in rural areas and smaller towns.” Still, Orfield and Frankenberg conclude that “the growing number of middle-class black and Latino families mov[ing] to the suburbs are not finding what other groups who suburbanized earlier received. In many cases, segregation is coming with them in spite of fair housing laws.” A 2014 ProPublica investigation traced the roots of this resegregation, both urban and rural, back to Reagan era policies in the Justice Department. While many districts were once under close watch of the Department, it has since loosened its grip on segregated districts and granted them more autonomy in determining school policy. The Justice Department, the report argued, was “no longer committed to fighting for the civil-rights aims it had once championed.” The Washington Post , in its coverage of the report, noted, “More than half of students are now low income, as measured by eligibility for subsidized meals. Hispanic students have replaced black students as the largest minority group in schools, accounting for 25 percent of the overall student population.” In many states, cities, and districts, schools truly are resegregating from an era which was far from perfect, but at least somewhat more equitable than the current situation. Yet some districts never really integrated in the first place. Court orders in the wake of Brown v. Board of Ed. struck down legal structures, mostly in the South, legislating Jim Crow-style segregation. But for those school systems with no formal structure of segregation on the books, the courts had less power. School districts like New York are just as segregated now as they were before Brown. Understanding this side of the story is important. It shows that school systems weren’t only segregated by explicit legislation, but by the inequality in society that existed both before and after Jim Crow. New York City is a notable example. Despite the absence of Jim Crow, New York’s schools were just as segregated as some Southern systems in the lead-up to Brown v. Board of Ed in 1954. Unlike in Mississippi and Alabama, there was no legal regime of segregation to strike down in New York. Thus after Brown, progressive organizations were forced to push for local solutions to segregation rather than federal court orders. By some accounts, the largest civil rights demonstration in U.S. history occurred in New York over education desegregation. In 1964 more than 460,000 public school students, roughly 50 percent city wide, stayed home as part of a boycott of segregated schools led by Pastor Milton Galamison, as detailed in Clarence Taylor’s book Knocking At Our Own Door . Despite the massive campaign, the city deferred and delayed until the organizers lost steam, and the project of integration was dead. Today, New York City schools are the most segregated in the nation . Racial and economic segregation are in fact worsening. But in thinking about solutions, we shouldn’t imagine there were ever golden days. Schools in the United States have always reflected the systemic inequality of the United States. While federal court mandates changed the composition of some state and city systems temporarily, the racial and economic inequality that first produced the segregation has remained largely intact.\nWhy Integrate? Though integration is desired by nearly all who aren’t open reactionaries, it’s worth making explicit the three major arguments made in favor of the policy: political, material, and multicultural. The most prominent reason used by progressives and liberals today is the political one that motivated the Supreme Court’s decision in Brown v. Board of Ed. Given the history of racial oppression in the United States, separate institutions for different racial groups are inherently unequal because they prevent the full participation of those oppressed groups in political and social life. Modern versions of this argument assert that despite the end of Jim Crow and the historic passage of the Civil Rights and Voting Rights Acts, systemic racial oppression still exists, so the remedy for full inclusion in the political and social domains remain the same as it was before the civil rights era. This demand for inclusion was part of a broad program in that time — full social and political participation, not only at school, but at the ballot box, in the courthouse, in consumer society, in the job market, and more. The material justification is related to, though not the same as, the political: poor students flourish in integrated schools (relative to segregated ones at least). The reason for this is simple: integrated schools are well-resourced. When powerful constituencies, those that are politically connected and can navigate the city bureaucracy, are distributed across many schools rather than cordoned off in a few, the political pressure to fund those schools increases and all students benefit from those resources. This is the argument made by Nikole Hannah-Jones, who, through her appearances on This American Life and an essay in the New York Times Magazine , has done more recently than any other active journalist to bring the issue of school segregation back into the mainstream. Finally, there is the multicultural argument: students who attend integrated schools develop a greater tolerance for and appreciation of those different from themselves. This benefits students by enriching their lives through a wider exposure to diverse cultures, as well as producing a more harmonious and tolerant society as a whole. While there is certainly merit to this argument, it reveals the confusion in the way we often use the term “integration.” In one sense, integration is simply the joining of diverse peoples in institutions along lines of gender, race, class, national origin, language ability, and other features. But by this metric, lots of schools that are deemed segregated simply aren’t. Many schools in urban centers labeled “segregated” are in fact populated almost exclusively by Black and Latino students. But others have students with diverse ancestries, multiple languages, and different faiths. Despite this diversity, schools in both these categories often lack two key constituencies: white and middle/upper-income students. This other, more common connotation of “integration” refers to the inclusion of oppressed groups in institutions dominated by more privileged ones. The problem of segregation is thus twofold. First, it physically separates more privileged students from those less privileged. Second, segregation both reflects and reinforces the political, social, and economic inequalities present in the broader society. While much attention is rightly paid to the first part of the problem, the heart of the injustice lives in the second, because inequality isn’t just reflected in school segregation — it’s the root cause of it. And of course, this general inequality, in schools and otherwise, is in large part due to lack of funding for public institutions in a neoliberal, capitalist economy. US schools receive the vast majority of their funding through property taxes at the local level, allowing wealthier suburban towns and cities to avoid paying for poorer families’ schooling. This is perhaps the largest barrier to fair school funding today. Separate school districts with their own funding streams were one of the most powerful incentives for suburban sprawl of the 1950s and 1960s. That said, the suburban/urban divide doesn’t totally explain the inequality. New York City is one district that uses a “fair student funding” model in which schools receive additional funds for students that are poor, English language learners, disabled, and a few other criteria. Yet despite this apparent equity, a white upper-class child on the Upper East Side (one of the wealthiest zip codes in the country) has a drastically different education from a low-income black child in Brownsville (one of the poorest). Still, structural barriers like local school funding partly explain why schools remain so segregated despite a huge body of research on the positive effects of integration. Studies have shown that students who attend integrated schools score higher in reading and math and are less likely to experience poverty, health issues, or jail time. They are more likely to attend college and then establish residency in integrated neighborhoods. Attending integrated schools is even connected to a longer life span . Commenters often point to these results as proof of the seemingly magical power of integration to allow poor students to succeed. But these findings aren’t that surprising when considering the materialist argument for school integration. If integrated schools enable poor students to access resources they wouldn’t have otherwise, and the class trajectory of their lives is altered due to better schooling, an increase in their quality of life is unsurprising. The question then is if integration is a zero-sum game. If all schools were integrated, would all schools be adequately funded because white and middle/upper income students now attend them? Or would the systemic lack of funding and social support programs instead be evenly distributed across all schools? The answer to this question depends on whether integration remains solely a mechanism for multiculturalism, or if it can also spur larger changes in the role of the state in funding and supporting public institutions.\nIntegration vs Community Control While integrated schools may seem like a political no-brainer for progressives, this hasn’t always been the case. The question “why integrate?” was taken up in earnest in New York as the prospect of a city-wide integration program seemed increasingly unlikely even after Brown v. Board of Ed. Most memorably in the case of Ocean-Hill Brownsville, community organizations, influenced by the rising ideology of Black Power, argued that if the city was not willing to integrate the schools, then the community should at least control the segregated schools in their neighborhood. The threat to the structure of collective bargaining caused the New York City teachers union, the United Federation of Teachers (UFT), to wage three bitter strikes against the community control project. The desire for community control dovetailed with the argument that integration as a program implied that poor students, particularly Black and Puerto Rican at the time, could only be educated when in contact with their white and middle-class peers. As detailed by Jerald Podair in his book on the 1968 community control experiment in Ocean Hill-Brownsville, The Strike That Changed New York , many parents and community organizers thought that an integrated school was damaging to students of color due to the racism and at times outright physical violence they experienced at the hands of their white peers, teachers, and administrators. Further, the political strategy was questioned. Why did privileged students need to attend “ghetto schools” in order for those schools to improve? Wasn’t this a form of pleading before the power elite to grace children of color with the presence of more privileged students? To many, this didn’t seem like a truly radical demand. Others saw it differently. Social democrats like Bayard Rustin supported the UFT during the strikes, as did A. Phillip Randolph (a minority position among black political leaders). They argued that integration wasn’t a plea, but a demand rooted in claims of basic equality. For Rustin in 1968, this position extended from his general philosophy that in order to achieve social and economic prosperity, Blacks needed to participate in labor-led, multiracial alliances making universal demands on the state, rather than to emphasize the particularity of Black identity in their politics. Rustin saw the Black Power-influenced idea of community-based, Afrocentric education as a return to the doctrine of separate but equal dressed up in radical clothing. And he criticized the community control program for failing to demand any significant redistribution from the wealthy to the poor. Rustin and Randolph had also seen how the concept of “community” was wielded in years prior by the political right to fight against integration, particularly in cases of busing. Rustin saw integrated schools as one type of universal program that could increase the capacity of working-class people through public institutions. Like other public institutions with universal access, they would then generate their own constituencies for support. In a school setting, the power that universal demands lends to the struggle for integration is clear. Segregated schools have different needs: an upper-income school has no interest in school-based health clinics because those families have employer provided insurance. A low-income school whose families have no health insurance certainly do. Integrated schools thus produce a more universal set of demands and by extension a wider, more united constituency to advocate for them. To be sure, Rustin had his blind spots. By aligning so closely with the UFT leadership, he was unable to criticize their more egregious practices during the strikes like whipping up instances of anti-Semitism against the union to a greater extent than actually existed. And by toeing the UFT line, he effectively isolated himself from the constituencies he would have needed to mobilize (working-class Blacks and Puerto Ricans) in order to win the social-democratic policies he wanted. Still, Rustin has much to teach those fighting for integration today. As detailed by Daniel Perlstein in Justice, Justice, Rustin knew that the only meaningful way to discuss segregation of poor, black, and Latino students was to connect it to the inequality of society at large. As roughly 10 percent of the population, blacks simply didn’t have the political power to force integration. Instead, they needed to ally with a progressive majority and crucially, the labor movement to create the schools that all students, parents, and teachers needed. But even if we want integrated schools for the reasons Rustin did — to achieve social and political equality, maintained through strong labor unions and social-democratic policies — the question remains how we might get them.\nThe Integration Toolbox There are many mechanisms that could be used in the medium term that would begin to desegregate schools. Rezoning and Controlled Choice are two of the more popular right now, though both have shortcomings in the context of a capitalist economy. Rezoning is the redrawing of school district lines so that low-income students get assigned to nearby, well-resourced schools dominated by their middle- and upper-income peers. It does not require the construction of new schools on neighborhood borders nor does it require students to travel far to high-quality schools. One of the challenges here, of course, is that parents of the more privileged students don’t want their children attending schools that have fewer resources and less experienced teachers. Part of the recent attention on school segregation was due to two high-profile rezonings of elementary schools in New York City. In both cases, parents of students who would be rezoned to the “struggling” school were intensely opposed to the plans. While we shouldn’t discount the racism present in these debates (often couched as concerns for their children’s safety), we should also acknowledge the economic reasons more privileged parents have to preserve the segregated system. Parents know that schools full of rich kids are well-funded and those without rich kids are not. While we might be able to convince some wealthier, progressive families to opt for a school with fewer resources in service of integration, it’s not a strategy that can scale. As long as resources within public school systems are allocated this way, most parents will fight to make sure their own children get resources over someone else’s. Furthermore, politicians know that aside from provoking a response from upper-income parents and jeopardizing their own political careers, wealthier parents could up and leave the city. Not only would this drain the municipal tax base, but it would further segregate the schools. This is similar to what happened in Boston during the busing crisis of the 1970s . Between 1974 and 1988, Boston had a federal court-ordered integration program carried out through busing. In those fourteen years, the public school population in Boston dropped from 93,000 to 57,000. The percentage of white students decreased from 65 percent to 28 percent . And by 2003, 44 percent of white students in Boston attended private schools. Rezoning as a policy must also confront geography. While rezoning might be effective in gentrifying areas or those with public housing that border wealthier stock, it doesn’t address low-income neighborhoods that only border other low-income neighborhoods. The greater the geographic area that a district tries to rezone, the further away students will have to travel from their neighborhood in order to attend a quality school, similar to busing. Still, rezonings are important mechanisms to disrupt the system of economic ordering that segregated schools produce. They can enable poor students to attend well-resourced schools and pressure school administrations to adequately fund previously under-resourced schools because families with more political power now have children in them. A second mechanism for integrating schools is controlled choice. Less well known than rezoning, controlled choice allows parents to rank their choices of schools for their children, but also requires that all schools within a district have a student population that mirrors the district at large. For example, a district could set limits on the number of upper-income or white students in each school. The policy was pioneered in Cambridge, Massachusetts, in 1981 and has been implemented to varying degrees in many cities since. One district in NYC is already piloting the program . Controlled choice is less controversial than rezoning in that it preserves parents’ choices, but is challenging because it requires buy-in from the entire district. Controlled choice is a promising option for urban districts with mixed-income residents. It’s less ideal for suburban and rural districts with few schools to choose from and a homogenous student body from which to populate the schools. Controlled choice also presents challenges for elementary school students who can’t commute by themselves. If controlled choice is implemented in a small district that is entirely homogeneous, it’s not very effective. If it’s implemented across a large area that is segregated, it burdens parents to escort their children far outside their neighborhood, which disproportionately affects poor families. In these instances, the power of housing segregation is apparent. Controlled choice should still be offered in urban districts, but advocates should be sober about its potential impact. Controlled choice is also limited in that if it were applied on a large-enough scale, the political backlash could be severe and ultimately counterproductive. Ujju Aggarwal and Donna Nevel in City Limits seem to underestimate the prospect of this, Amidst increased conversations about how Controlled Choice might work has been an oft-repeated question: how can we ensure that some wealthy parents, who now have choice, won’t leave the school system—or the city? The answer is simple: We can’t. We can’t predict what those who currently benefit from segregated enclaves—and work very hard to defend those enclaves—will do. But this flight of families, if experienced system-wide, would have a profound effect on the poor students that Aggarwal and Nevel are concerned for. Schools are funded through property taxes, and so scaring away the tax base that would fund schools is a legitimate concern. This might be different under a social-democratic system of school funding, but that’s not the political context we live in. These shortcomings make rezoning and controlled choice much less appealing in their own right. The limitations show that as long as we operate in a system in which there are rational (if also unjust) motivations to send one’s child to a segregated school, that system will remain in place. If however, we can unite a broad constituency and fight for a massive increase in school funding, we could create schools to which all families want to send their kids and where all teachers want to work. In order to do this, we’ll need to change how schools are populated, and this means ending school choice policies.\nLots of Choice, Few Good Options Another major driver of school segregation, particularly in urban areas, has been the expansion of “school choice” programs. Despite having no evidence to support their use when first implemented, the programs were celebrated by billionaire education reformers like the Gates, Walton, and Broad families, along with neoliberal mayors like Michael Bloomberg. To desegregate our schools, we have to end school choice programs. In allowing parents to leave their “zone” and send their kids to any school they choose, school choice programs force schools to act like businesses. Schools offer a product (education) and consumers (students and families) choose from an array of sellers (schools). Ultimately, the theory went, parents would abandon “bad schools,” flock to the successful ones, and then other schools would replicate the best practices. This never happened. Schools became increasingly segregated and are now still plagued by the many problems that preceded school choice, like inadequate funding, inexperienced teachers, and skeletal support staff. In more traditional school systems, students attend their “zoned” or neighborhood school closest to them. This is still how it works in most affluent suburban districts. But in cities like New York, school choice has led to a system in which middle and high schoolers can travel anywhere in the city, as long as they meet the school’s admission requirements (of course, some families have more choice than others). This policy of choice has helped create the most segregated school system in the country by reducing government intervention and incentivizing the public school system to act like a market. Those with purchasing power do fine. Those without suffer. Thus at a school like Stuyvesant, New York’s most elite public high school, Black and Latino students are drastically underrepresented . This has nothing to do with residential segregation — its predominantly White and Asian-American population commute from all over the city — and everything to do with social and political power. Admissions at Stuyvesant is dominated by a single exam . Other elite schools in the city rely on middle school test scores, attendance records, parent attendance at an open house, and similarly restrictive measures that benefit those with the most resources and free time. Students and their families that can’t clear these hurdles are often relegated to schools (typically still outside of their neighborhood) with inexperienced teachers, ineffective administrators, and without a PTA that can raise thousands of dollars to bolster their programs. This system of school choice adds to the many factors that produce segregated schools. Just as it’s necessary to challenge residential segregation in order to produce integrated schools, it’s also necessary to challenge school choice policies that enforce social and economic segregation. This would require a drastic reduction, if not total elimination, of high-stakes entrance exams and the other restrictive admissions criteria mentioned above.", "url": "https://www.jacobinmag.com/2018/07/the-socialist-case-for-school-integration"}