{"authors": ["Mike Shaw"], "date_download": "2020-05-04 20:14:05", "date_modify": "2020-05-04 20:14:05", "date_publish": "2018-07-27 06:57:36", "description": "Did you know that all the stars, planets, meteors, gas nebulae, the moon virtually everything you see in the night sky with your naked eye are part of our home galaxy, the Milky Way? That...", "filename": "_d15e9a7a6d804a9ba9972859d9bde88f_1588623245.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d15e9a7a6d804a9ba9972859d9bde88f_1588623245.html", "title": "Now's the best time to photograph the Milky Way", "title_page": "Now's the best time to photograph the Milky Way — here's how", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Did you know that all the stars, planets, meteors, gas nebulae, the moon virtually everything you see in the night sky with your naked eye are part of our home galaxy, the Milky Way?\nThat luminous Milky Way patch you may have seen during the summer is actually part of its glowing, central band. And right at its heart is the glittering galactic core: the star-studded hub around which the earth, solar system and all other Milky Way denizens revolve. The central band and galactic core region shine so brilliantly because of their dense concentration of billions of stars. They are the Milky Ways brightest region. Theyre also its most easily photographed. Really.\nHave you ever wanted to photograph the Milky Way but arent sure how? Its a lot easier than you might think and over the next several weeks is one of the best periods of the year to grab your camera and head outdoors. Lets get you started.\nTiming: June through September is the best time to observe and photograph the galactic core region of the Milky Ways central band. Thats because these months are when the night side of the earth faces directly toward the galactic core.\nYour next step is to choose a date within three to four days of the new moon for the darkest skies and best viewing. Then, look toward the south/southwest right after dark and youll find the galactic core region and central band angling up and to the east. Its time to start shooting. Looking ahead, this means photographing between about 9:30 p.m. and 4 a.m. on any of the nights of Aug. 7-15, for locations with the same latitude as the Twin Cities. (Bonus: The annual Perseid meteor shower peaks on the night of Aug. 12!)\nCamera: Youll need a camera that allows you to manually set both the focus and exposure. By exposure, I mean the combination of aperture, or f-stop, shutter speed and ISO needed to get a well-exposed image. If you have a digital single-lens reflex (DSLR) or mirrorless camera, youre likely all set. (And forget about using your smartphone for Milky Way shots; this is one situation where they dont work.)\nA good place to start with your exposure settings is with an ISO of 6400, your aperture as low as possible for example, f/4.0 and a shutter speed of 20 seconds. These settings will work great for capturing the Milky Way in a dark location. Try a shorter shutter speed of five to 10 seconds for brighter locations.\nYoull want to stick with wide-angle lenses. Those with focal lengths in the 14-24 millimeter range are ideal. And a headlamp with a red bulb is essential: It frees your hands and preserves your night vision. Finally, a sturdy tripod is required; its impossible to hold your camera steady enough for such long exposure times.\nNeed to know: Focusing can be a challenge. Heres my advice: Autofocus on the horizon before it gets dark, switch your camera or lens to manual focus, then apply a small piece of gaffers or painters tape to keep the focus ring of your lens in place and leave it there. After you gain experience, use the liveview feature of your camera to focus directly on the brighter objects. Jupiter, Saturn and Mars are especially good focusing aids, and are visible during much of the night for the rest of the summer.\nGood foreground subjects include streams, lakes, barns, churches the list is endless. Keep in mind that youll be standing to the north of your subject and facing south, or to the east and facing west. You can use Stellarium (stellarium.org), a free, virtual planetarium, to find the precise location and orientation of the Milky Way for the time and date youve chosen. A daytime scouting trip is a good idea, because it can be challenging to find your way and create the best composition in the dark.\nInterested in learning more? In addition to my recent book (mentioned below), there are tutorials and other resources online. The Minneapolis-based Minnesota Astronomical Society (mnastro.org) offers many friendly, public meetings and star parties. Maybe Ill see you there.\nIn the meantime, good luck and heres to clear, dark skies.\nMike Shaw is a freelance photographer from St. Paul. He is the author of The Complete Guide to Landscapes Astrophotography. Follow Shaw on Facebook and Instagram: @MikeShawPhotography, and on Twitter @MikeShawPhoto.", "url": "https://apnews.com/d15e9a7a6d804a9ba9972859d9bde88f"}