{"authors": ["John Maccormack"], "date_download": "2020-05-04 20:05:42", "date_modify": "2020-05-04 20:05:42", "date_publish": "2018-07-13 01:39:50", "description": "VICTORIA — The admitted teen accomplice of the man accused of burning down the local mosque detailed how the hate crime unfolded in early 2017 as the prosecution rested its case...", "filename": "_00c7f7bb97c245efae7e4a9f9f19eeef_1588622742.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_00c7f7bb97c245efae7e4a9f9f19eeef_1588622742.html", "title": "Teen accomplice details how Victoria mosque went up in flames", "title_page": "Teen accomplice details how Victoria mosque went up in flames", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Teen accomplice details how Victoria mosque went up in flames\nVICTORIA — The admitted teen accomplice of the man accused of burning down the local mosque detailed how the hate crime unfolded in early 2017 as the prosecution rested its case Thursday.\nThe juvenile, identified only by his initials, K.R., described to jurors how Marq Vincent Perez set the blaze that rapidly consumed the gold-domed Victoria Islamic Center on Jan. 28, 2017.\n“I saw him with the lighter. He wrapped some papers like a cone and started lighting them,” testified K. R.\n“I asked him why he was doing that. He said, ‘To send a message.’” And I said, you could just spray paint it, but he said, ‘No, this is better,’” he recalled.\nRELATED: Employees accused of stealing from celebrity-owned S.A. bakery\nPerez, 26, is on trial for three federal felonies that carry a potential sentence of up to 40 years in prison. He has denied any involvement in the mosque fire, which drew national and international attention.\nK.R., who is cooperating with the government, told about first meeting Perez, a decade his senior, when he moved in to the duplex next door.\n“I looked up to him. He told me he was ex-military. He talked about combat training. I thought he had been in for more than five years. I thought that was pretty cool,” recalled K.R., who had also thought about joining the military.\nRecords show, Perez served only six weeks in the Air Force a decade ago before exiting the service.\nAccording to the teenager, Perez involved him in two drive-by shootings that targeted a neighbor. He said Perez then hatched a plan against the mosque, which was only a short walk from where they lived.\n“He wanted to go look for guns and bombs. Apparently they were buying a bunch of stuff,” he recalled of Perez’s belief that the local Muslims were linked to terrorists and were a threat to Victoria.\n“He told me he didn’t like them. The fact that there were adult men marrying 6-year-old kids and stuff like that,” he recalled.\nAfter midnight on Jan. 21, 2017, the two walked over to the mosque and Perez broke in through a back door, K. R. testified.\n“The first thing I noticed is that they had soft carpet,” recalled the youth, who was also impressed by the mosque’s pingpong table.\n“It was the first time I’d ever seen one in person. It was cool,” he recalled.\nThe teen described how the two searched for weapons and hidden compartments, but instead found about two dozen cellphones, which they stole.\nThe phones were quickly sold on Facebook and later helped lead authorities to Perez and K. R. By then, the two had broken into the mosque a second time, he said.\nVery early on Jan. 28, 2017, a day after the birth of Perez’s second child, K. R. said they busted through the mosque’s back door, which had been boarded.\nAgain, the brief search for armaments came up empty. This time, K. R. said, Perez unexpectedly set the mosque on fire.\nOn the walk home, when they looked back and saw the flames and smoke, Perez was elated.\n“He was jumping like a little kid jumps when you give them ice cream. He said. “Oh (expletive), that’s way better than I planned out,” K. R. said.\nThe two soon split up for the night.\n“He said he was going back to the hospital. He said, ‘My alibi is I was with Mathilda (his girlfriend),’” said K. R.\nOn March 3, 2017, police and federal agents armed with search warrants hit both their residences. In Perez’s side of the duplex, they turned up firearms and explosives used in a car bombing, and computers stolen from the mosque.\nK. R. earlier was caught with stolen cellphones and a gun. He soon began talking to investigators.\nArrested on March 3, Perez has been held without bond since.\nDuring the course of the three-day trial, jurors read numerous online messages in which Perez expressed hatred of Muslims and others in which he talked about taking action against them.\nWith the prosecution’s conclusion, Perez’s defense begins Friday. Defense Attorney Mark DiCarlo told Judge John Rainey he will wrap up his case by Monday.\nAmong those in the audience of about 30 people were several female members of the Victoria Islamic Center. On Monday, their president, Dr. Shahid Hashmi, had testified at length.\nHashmi, 71, a local surgeon, said Thursday the congregation is anxiously waiting for the trial to end, no matter what the verdict.\n“It is kind of a burden, all of this that has happened. Now we anticipate that in the next few days we’ll have the final word and appropriate justice is done,” he said.\nHashmi said the whole ordeal is being looked upon as a test from God.\n“Our faith tells us that any kind of hardship or tragedy is a test of faith. When the hard times come, and you get upset with God, and ask, ‘Why me,’ that’s not acceptable,” he added.\nAnd, he added, while some in the congregation of about 45 families found the outpouring of support after the fire helped dispel doubts, the uncertainty lingers for others.\n“We have some female members who used to always wear the hijab. Now they wear it for prayers but take it off when they leave the mosque. They do not want to be recognized,” he said.\n“To me this means they are still afraid,” he said.\nJohn MacCormack is a San Antonio Express-News staff writer. Read more of his stories here. | JMacCormack@express-news.net | Twitter: @JohnMacCormack", "url": "https://apnews.com/00c7f7bb97c245efae7e4a9f9f19eeef"}