{"authors": ["Samara Kalk Der", "Wisconsin State Journal"], "date_download": "2020-05-04 20:06:26", "date_modify": "2020-05-04 20:06:26", "date_publish": "2018-08-19 10:45:00", "description": "Carp is not the kind of fish found on restaurant menus in this country, but Hayden Cohan likes to fish them, smoke them, eat them, and give them to his friends and neighbors in an effort to help...", "filename": "_9bac92cd8bbe46269f9ae6524c083cee_1588622786.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9bac92cd8bbe46269f9ae6524c083cee_1588622786.html", "title": "Teen trying to solve carp problem with culinary skill", "title_page": "Teen trying to solve carp problem with culinary skill", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Carp is not the kind of fish found on restaurant menus in this country, but Hayden Cohan likes to fish them, smoke them, eat them, and give them to his friends and neighbors in an effort to help get the invasive species out of Lake Mendota.\n“In this country, it’s not as utilized as you would think. It’s got a flavor that is not preferred,” said Cohan, who turns 18 today and graduated in June from East High School.\n“We like our fish to taste kind of like nothing,” he said. “That quintessential fishy flavor that you think of, carp is full of it.”\nThat’s why after he catches his common carp by bow fishing from his backyard on Lake Mendota, he generally smokes them. The preparation starts right away and is a bit gory, he said one day this summer as he monitored more than 50 pounds of carp he had going on two backyard smokers.\nImmediately after he shoots a carp, he cuts the collar off, pulls out the gills and hangs it upside down so that the blood drains out. After it’s refrigerated for a short time, he fillets it and puts it in a brine. Then, he leaves it for 10 hours before smoking it.\nThe other big problem Americans have with common carp are its bones. “When you go to the supermarket, you’ll see a salmon fillet or tuna steak completely boneless,” Cohan said.\nCohan has been on a mission to take common carp -- and to a lesser extent, zebra mussels -- and make them taste as palatable as possible in an effort to turn the lake scourges into a food source and clean up the lakes.\nHe typically shoots carp when they’re spawning in the spring. They’re a lot easier to shoot then because they’re much closer to shore. He often spears them with a trident.\nKent Berton, Cohan’s Sherman Avenue neighbor, is glad to take Cohan’s extra fish, which to him don’t taste overly fishy. “It’s kind of like any kind of smoked fish I’ve ever had. It’s pretty oily. It’s very flavorful.”\nPutting an invasive species to use\nCohan’s time at Conserve School, an environmental boarding school in Land O’ Lakes, on the border of the Upper Peninsula of Michigan, where he went for a semester his junior year, made him more aware of fish species becoming depleted from lakes and oceans.\n“I learned a lot about overfishing and how it’s affecting the fisheries in our area and I thought, ’Well, invasive species are something that you really can’t overfish and is a resource that no one is utilizing.”\nHolly Gibbs, a UW-Madison professor of environmental studies and geography, who teaches classes on agricultural sustainability, was impressed to learn about Cohan’s efforts.\n“What an exciting project and how amazing that such a young student is spearheading this type of innovation,” she said.\nCarp and zebra mussels are choking off other species that would make the lakes more healthy as well as economically productive, Gibbs said. Recreational fishing and other activities on the water become limited both by water quality issues and invasive species, she added.\n“Anything that we can do that would be both cleaning up our lakes and removing some of the volume of invasive species and providing an additional protein source sounds like it has a high potential to be a win-win scenario,” Gibbs said.\nFinding those willing to eat carp\nCohan and his friend, Bryce Campbell, developed an app this summer that connects fishing enthusiasts who like to fish for carp, but not eat them, with those who will eat them. They are trying to work out some bugs in the iPhone version, but the Android version is working.\nOn Saturday, Cohan will leave for college at the University of New England in Maine, a school he learned about by researching colleges with big marine science departments that focus on invasive species.\n“They do a lot of research for things like green crabs and pike, which are native here, but they’re invasive in Maine,” Cohan said.\nCohan, who grew up fishing, swimming, and sailing on Lake Mendota and knows it “in a way not a lot of people do,” has also been collecting zebra mussels that he said “coat every single rock in the lake.” While carp are most abundant in the spring, the zebra mussels are always there for the picking.\nHe just pulls rocks out and scrapes off the zebra mussels, but he’s had trouble making stock out of them. He’ll rinse the mussels in freshwater, and cook them in a pot with vegetables and salt. So far, he’s not serving them to anyone.\n“I’m still working on the flavor,” Cohan said. “The zebra mussels are a pretty new dish for me. I think it’s going to take a couple more batches to get it right. But right now it’s just a little too bitter.”\nA new solution\nThere have been efforts over the years to eradicate sediment-churning carp from local bodies of water, but not in the culinary way Cohan is tackling it. A successful project took place in Lake Wingra in 2009, when the trapping of carp during the winter resulted in a marked improvement in the lake’s clarity.\nLike professor Gibbs, Tim Campbell, aquatic invasive species specialist with Wisconsin Sea Grant and UW-Extension, said he hasn’t heard of anyone trying to make invasive species palatable the way Cohan is doing.\nSome communities will contract with fishing enthusiasts to remove carp from lakes and some lake associations and fishing clubs will do “carp roundups,” Campbell said. One method is to put “a golden carp” in the lake and whoever catches it wins $500 or some other amount of money.\n“But that’s really more about the carp removal. I definitely haven’t heard anyone doing it through the invasive lens of, ‘I want to get all this stuff out of the lake and then turn it into something tasty,’ ” he said.\nCarp are eaten in Europe, where in some countries it’s a holiday tradition to bring a common carp home and let it live in the bathtub for a number of days before a Christmas feast, said Campbell, who owns a children’s book called “Carl the Christmas Carp.”\nCampbell has never tried carp himself, but said he’s heard mixed reviews. He guesses, that like a lot of things, they’re good smoked. The taste depends on what body of water the carp came out of and what it’s been eating, he said.\n“I can’t speak too much on the palatability of carp, except that I think in the 1800s we initially brought it over because it was a desirable food and sport fish. And then somewhere along the line people in the United States decided that they didn’t like it anymore.”\nPerfecting the recipe\nCohan said when he first started preparing carp to eat about five years ago, he didn’t have a good recipe. “I didn’t know how to bleed it, I didn’t know how to salt it, I didn’t know how to smoke it, and it just wasn’t working.”\nBut in the past two years, he’s fine-tuned his recipe. He researched how carp are prepared in England and in Eastern European countries. Gefilte fish, a Jewish specialty, is made from carp, along with whitefish or pike.\nCarp have Y-shaped bones, which means that there’s a second row of bones on its back that makes it difficult to get a large, boneless cut, Cohan said.\nTo get around that, it helps to eat it with your hands once you’ve smoked it, and use the parts that are boneless. The rib meat has no bones, he said.\nCohan worked at Baldwin Street Grille last summer and this summer he’s been working at Underground Butcher learning how to butcher meat. He also does prep work for Underground catering jobs. “It’s great practice for becoming a good chef,” he said.\nFor his graduation party in June, Cohan cooked about 120 pounds of meat for a Brazilian-style barbecue and served as many as 250 guests. Cohan, who’s mother is a middle school computer teacher and father is an entrepreneur, said his parents invited a lot of friends.\nHe also put out two smoked carp fillets that day, and while he didn’t hear a lot of feedback, the fish were gone by the end of the party. “That’s always good to see,” he said.\nHis longtime love of Lake Mendota makes him want to solve its problems. “That’s why I’m really into these invasive species. You see your lake getting hurt by carp and zebra mussels and you’re like, ’How do I fix it? And I’m hoping that cooking is one way to do that.”", "url": "https://apnews.com/9bac92cd8bbe46269f9ae6524c083cee"}