{"authors": ["Dana Milbank"], "date_download": "2020-05-04 20:09:42", "date_modify": "2020-05-04 20:09:42", "date_publish": "2018-08-25 05:00:00", "description": "WASHINGTON -- It was as though Nancy Reagan had given a \"Just Say No\" speech while her husband honored the occasion back at the White House by snorting cocaine during a live news...", "filename": "_1503d998cbc3431f9caf2cb38460d5e0_1588622982.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1503d998cbc3431f9caf2cb38460d5e0_1588622982.html", "title": "Here's one easy way for Melania Trump to reduce cyberbullying", "title_page": "DANA MILBANK: Here's one easy way for Melania Trump to reduce cyberbullying", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WASHINGTON -- It was as though Nancy Reagan had given a “Just Say No” speech while her husband honored the occasion back at the White House by snorting cocaine during a live news conference.\nBut this actually happened Monday: Melania Trump participated in the Federal Partners in Bullying Prevention’s Summit on Cyberbullying while her husband was home at the White House -- cyberbullying.\nAt the summit, a Twitter official spoke about attempts to make Twitter “a more positive and healthy place.” A Facebook representative talked about “the importance of role modeling” and encouraged those who are “typing in all caps” to “take a step back and look at what those communications look like.” And the first lady herself cautioned that social media can “be destructive and harmful,” and therefore young people should be taught “how to conduct themselves safely in a positive manner.”\nYet in virtual split screen at the White House, President Trump, during the 90 minutes his wife participated in the cyberbullying summit, engaged in his unique form of role-modeling: He fired off a series of tweets to his nearly 54 million followers vilifying “political ‘hack’” John Brennan (the “worst CIA director in our country’s history”), disparaging his own attorney general, attacking the “Mueller Rigged Witch Hunt” and spewing vitriol: “phony, dirty and discredited … a total joke!”\nEarlier Monday, even as his wife prepared to head to Rockville, Maryland, for the summit, Trump used social media to call special counsel Robert S. Mueller III and his team “thugs” (in a misspelled tweet about the White House “councel”) and a “National Disgrace.”\nThis created an elephant-in-the-room situation. Summit participants avoided mention of the cyberbully in chief -- the equivalent of having a summit on election hacking with no mention of Russia. For good reason: If they stood up to the bully, he might have taken their lunch money.\nSummit participants Joseph Grunwald, a student at the University of Texas who said he has endured bullying, came closest. “Bullying,” he said, “happens in our homes, happens in our communities and it happens at the national level.” Presumably he was not talking about Orrin Hatch. Cyberbullying “is a method of bullying among the most cowardly among us,” Grunwald said.\nMelania Trump, seated on the dais, gazed expressionlessly at Grunwald.\nThe notion of a first lady taking public aim at her husband’s vice is not without precedent. Laura Bush touted literacy while her husband asked, “Is our children learning?” But George W. Bush didn’t do that on purpose.\nTrump has no such excuse. In recent days alone, he has cyberbullied his former White House aide Omarosa Manigault Newman (“dog,” “wacky,” “vicious,” “nasty,” “a loser” “hated,” “crazed, crying lowlife”); John Dean (“rat”); the media (“sick,” “fake,” “disgusting,” “enemy of the people”); Brennan (“loudmouth, partisan, political hack,” “limited intellectually”); his own attorney general (“BLANK Jeff Sessions”); Connecticut Democratic Sen. Richard Blumenthal (“Loser!”); Senate Minority Leader Charles E. Schumer (“haywire”); New York Gov. Andrew Cuomo (“incompetent,” “really dumb,” “having a total meltdown”); Ohio Gov. John Kasich (“very unpopular,” “failed”); and those investigating Trump (“creep,” “McCarthyism at its WORST!” “zero credibility,” “corrupt,” “a fraud,” “lowlife”).\nAs a result, the president’s underlings at the cyberbullying event had to suppress all sense of irony.\nAlex Azar, the secretary of health and human services: “Bullying is bullying wherever it occurs, in the schoolyard or the internet.”\nOr the Oval Office?\nIndustry representatives didn’t dare mention the First Offender, either. The Family Online Safety Institute’s Jennifer Hanley mentioned “the challenge” some parents face “when their own child might be the bully.”\nOr their own husband?\nFrom Facebook, Antigone Davis noted that “in almost all cases when we see online bullying, it’s connected to offline bullying.” That’s true in the schoolyard or at campaign rallies where “disgusting” journalists and “low-I.Q.” Rep. Maxine Waters, D-Calif., are taunted. And Trump doesn’t just bully Brennan online -- he strips him of his security clearance.\nThe first lady was no doubt genuine in her four-minute speech, when she spoke about the need to focus on the problem of bullying and the “pitfalls” of social media. She spoke of reducing “bullying through kindness and open communication.”\nBut the best thing she could do for the cause would be to lead by example -- specifically, to use her considerable influence to get her husband to take it down a notch.\nThe representative from Twitter at the cyberbullying summit, Lauren Culbertson, singled out the first lady and made a self-serving plea. “Twitter is a powerful tool,” she said. “If there’s a way we can help our partners leverage that tool, please let us know.”\nIf Melania Trump is serious about reducing cyberbullying, she could answer that request with four words: “Delete my husband’s account.”", "url": "https://apnews.com/1503d998cbc3431f9caf2cb38460d5e0"}