{"authors": ["Don Walton Lincoln Journal Star"], "date_download": "2020-05-04 20:14:24", "date_modify": "2020-05-04 20:14:24", "date_publish": "2018-07-30 18:00:00", "description": "A moment of truth may be approaching rapidly for Nebraska's nonpartisan Legislature. That's what departing Sen. Roy Baker of Lincoln suggests. Mark the date: Jan. 9.", "filename": "_7c5eaab87f4643f68168e290cc7b2b65_1588623264.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7c5eaab87f4643f68168e290cc7b2b65_1588623264.html", "title": "Sen. Roy Baker hopes Legislature will restore nonpartisan manner", "title_page": "Sen. Roy Baker hopes Legislature will restore nonpartisan manner", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A moment of truth may be approaching rapidly for Nebraska’s nonpartisan Legislature.\nThat’s what departing Sen. Roy Baker of Lincoln suggests.\nMark the date: Jan. 9.\nThat’s the first day of the 2019 legislative session, the day that senators select their leadership for the following two years and cast secret-ballot votes for committee chairmanships.\nIn 2017, members of the Legislature systematically elected a slate of designated conservative Republicans to fill all of those positions except two, carving out one slot for a Democrat, freshman Sen. Justin Wayne of Omaha, to lead the Urban Affairs Committee.\nSen. Laura Ebke of Crete, a former Republican turned Libertarian, was selected to head the Judiciary Committee.\nIn a step-by-step process, moderate Republicans as well as Democrats were stripped of leadership positions and denied chairmanships.\nSome were blindsided with 10 minutes’ notice.\nAnd as the process played out, newly-elected senators essentially fell in line.\n“People got together and stacked the deck,” Baker said.\nThat was the signal heralding the structuring of a more partisan body, he said, contrary to the intent and spirit of the unique nonpartisan, one-house legislature championed by George Norris and approved by Nebraska voters in 1934.\nBaker is a Republican, a moderate and independent voice, and he was not part of that takeover.\nIf it happens again next year, he fears, that process “might become established as a pattern” and essentially become institutionalized, and then an important piece of the nonpartisan and independent spirit of Nebraska’s unique Legislature will be gone.\n“My first two years were pretty good,” Baker said in looking back on the four-year adventure that followed a 37-year career as a school superintendent, including a high-profile stint with the Norris School District, the district named for Nebraska’s famously independent U.S. senator.\nAfter that good start in 2015, the “predetermined nature” of those leadership votes in 2017 was disheartening, Baker said during an interview in his office at the state Capitol, and they signaled a rise of partisanship.\n“I don’t think that’s what George Norris had in mind,” Baker said.\nBaker is not seeking re-election to a second term this year, opting instead to move with his wife to Minnesota during the summer months and to Arizona during the winter months to share more time with their children and grandchildren.\n“I was 69 before I got here,” he said, and a second term never was part of his plan.\nDespite his concerns with the changing nature of the Legislature, Baker says: “I’m glad I did it. I’d do it all over again. I’ll really miss it.”\nThe experience was an adventure that brought new and interesting people and fresh challenges into his life, Baker said.\n“However, my legacy will be as a school superintendent for 37 years,” he said.\n“As I said when I ran for the Legislature, I don’t breathe partisan fire. I believe in the nonpartisan unicameral, and I think I was who I said I was going to be.”\nGov. Pete Ricketts has “a whole lot of influence” in the Legislature, Baker said in assessing the governor’s role.\nBaker pointed to the governor’s address to the Republican state convention in 2016 in which he called out state senators who are Republicans by name for opposing him or the GOP state platform on issues or veto override votes as another clear example of efforts to inject partisanship into the nonpartisan Legislature.\n“I like Pete Ricketts,” he said, but the governor often takes “a dogmatic position (and) he hasn’t been as good as he could have been.”\nIf it was Baker’s decision, he would eliminate term limits for state senators or at least add four years by either moving to a system of two six-year terms or three four-year terms.\nThe current limit of two terms, or eight years, robs the Legislature of the knowledge and value of experienced senators, he said.\nBaker gives high marks to the corps of legislative lobbyists who occupy the Rotunda when the Legislature is in session.\n“I have found them to be good sources of information, helpful and ethical,” he said.\nAs Baker prepares to move on at the end of the year, he wants the Legislature to turn back from the road it followed in 2017, and he finds a reason to be hopeful.\nMany of “the ringleaders” of that move in the direction of partisanship — which some senators later privately argued was more of a move toward conservative policy rather than political party — will be gone in 2019, Baker noted.\nSo should be an effort to slate legislative leadership positions and to do so in a partisan manner, he said.", "url": "https://apnews.com/7c5eaab87f4643f68168e290cc7b2b65"}