{"authors": ["Kristina Rackley"], "date_download": "2020-05-04 20:22:41", "date_modify": "2020-05-04 20:22:41", "date_publish": "2018-12-27 16:41:00", "description": "The annual New Year's Polar Plunge at Aiken State Park has been canceled due to inclement weather, according to park staff. A mix of thunderstorms, showers and rain is expected throughout...", "filename": "_37105e3737234406b5facd6ea5bb9a2d_1588623761.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_37105e3737234406b5facd6ea5bb9a2d_1588623761.html", "title": "Aiken State Park Polar Plunge canceled; First Day Hike will still take place", "title_page": "Aiken State Park Polar Plunge canceled; First Day Hike will still take place", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Aiken State Park Polar Plunge canceled; First Day Hike will still take place\nThe annual New Year’s Polar Plunge at Aiken State Park has been canceled due to inclement weather, according to park staff.\nA mix of thunderstorms, showers and rain is expected throughout the coming weekend and into next week. As a result, the park has canceled its Polar Plunge event.\nThe First Day Hike will still occur at the park on New Year’s Day, barring any serious downpours or thunderstorms. Current predictions call for a chance of showers on Jan. 1 for most of the morning.\nA special giveaway will be held at the event this year. There will be a raffle drawing, with the winner receiving a statewide park passport that will guarantee free admission to any South Carolina state park for a year.\nThe guided hike will take place along the park’s Jungle Trail. Park admission fees are $2 per person, with children 15 years of age or younger being free.\nVisitors are encouraged to bring good walking shoes, cameras, water and binoculars.\nPark staff recommend calling ahead for this event, in case a sudden change in weather causes the hike to be canceled.\nAiken State Park can be reached at 803-649-2857.", "url": "https://apnews.com/37105e3737234406b5facd6ea5bb9a2d"}