{"authors": ["Jeff Himler"], "date_download": "2020-05-04 20:09:18", "date_modify": "2020-05-04 20:09:18", "date_publish": "2018-09-04 14:07:20", "description": "Pennsylvania Turnpike users who have an E-ZPass account now can use the program when traveling on some toll roads in central Florida. The Central Florida Expressway Authority (CFX) on...", "filename": "_762824f241884938a31bf8f63d294c54_1588622958.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_762824f241884938a31bf8f63d294c54_1588622958.html", "title": "PA Turnpike E-ZPass transponders now will work in Orlando area", "title_page": "PA Turnpike E-ZPass transponders now will work in Orlando area", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pennsylvania Turnpike users who have an E-ZPass account now can use the program when traveling on some toll roads in central Florida.\nThe Central Florida Expressway Authority (CFX) on Saturday began accepting E-ZPass transponders on 118 miles of its Metro Orlando toll roads, joining 16 other states east of the Mississippi River that make use of the devices.\nSouth Carolina and Georgia are two key states that don’t participate in the program.\nThe transponder is a radio frequency device that communicates with an antenna at each designated E-ZPass lane, allowing participants to pass through toll plazas without searching for cash and stopping to make payment. The toll amount is calculated and is deducted from the motorist’s prepaid account.\nIn Florida, CFX will bill the accounts of E-ZPass users who travel on its roads without charging an extra fee. The transponders will work on Florida roads marked with both E-PASS and E-ZPass logos.\nE-ZPass participants who drive on roads operated by Florida’s Turnpike Enterprise under the SunPass brand will be invoiced for tolls through that state’s Toll-By-Plate program.\n“Our customers wanted portability to the Sunshine State, and now they have it in Metro Orlando, the number-one tourist destination in the U.S.,” E-ZPass Group Executive Director PJ Wilkins said in a press release. “There is no pre-registration required since customers are already enrolled.”\nAlmost half of Florida’s domestic visitors come from other states that participate in the E-ZPass program, with about 50 percent traveling by car.\nThe multi-state E-ZPass system has grown from 6.5 million accounts in 2005 to nearly 21.6 million in 2017.\nVisit e-zpassiag.com for more information about the program.\nThe Pennsylvania Turnpike Commission manages nearly 2.3 million E-ZPass accounts with 3.1 million transponders in circulation. Today, 82 percent of all Pennsylvania Turnpike transactions are paid through E-ZPass.", "url": "https://apnews.com/762824f241884938a31bf8f63d294c54"}