{"authors": ["Seth Mclaughlin The Washington Times"], "date_download": "2020-05-04 20:25:17", "date_modify": "2020-05-04 20:25:17", "date_publish": "2018-04-20 11:14:45", "description": "Former House Speaker Newt Gingrich said Friday that James Comey is an amateur fibber and described the former FBI director as \"almost a pathological liar.\" \"You are looking at a guy who...", "filename": "_92eedb173a5834e17b177032c749f623_1588623917.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_92eedb173a5834e17b177032c749f623_1588623917.html", "title": "James Comey is 'almost a pathological liar'", "title_page": "Gingrich: James Comey is 'almost a pathological liar'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Former House Speaker Newt Gingrich said Friday that James Comey is an amateur fibber and described the former FBI director as “almost a pathological liar.”\n“You are looking at a guy who around the seventh grade practiced sincerity,” Mr. Gingrich said on “Fox and Friends.”\nMr. Gingrich was alluding to the way Mr. Comey has tried to distanced himself from former FBI Deputy Director Andrew McCabe in the wake of news that the Justice Department inspector general has referred his case to federal prosecutors to decide whether to bring criminal charges against him.\nThe inspector general’s report found that Mr. McCabe lied repeatedly about a leak he made to The Wall Street Journal in August 2016 that confirmed that the FBI was probing the Clinton Foundation.\nMr. Comey told CNN this week that he feels “conflicted” about Mr. McCabe and that he could potentially be a witness for the prosecution in a case against his one-time deputy.\n“I like him very much as a person, but sometimes even good people do things they shouldn’t do,” Mr. Comey said.\nMr. McCabe has maintained that Mr. Comey was aware he was speaking with the reporter.\nMr. Gingrich likened Mr. Comey’s behavior to a child who throws a baseball at a car and then tries to pin the blame on his cousin.\n“I mean look at his face,” Mr. Gingrich said. “He taught himself at an early age a series of self-serving emotions, which he uses over... and over and over.”\n“This guy is almost a pathological liar,” he said.", "url": "https://apnews.com/92eedb173a5834e17b177032c749f623"}