{"authors": ["Gary Kadansky Life Postbulletin.Com"], "date_download": "2020-05-04 20:28:18", "date_modify": "2020-05-04 20:28:18", "date_publish": "2018-05-05 05:30:00", "description": "I really enjoy hanging out with and listening to teenagers. I was actually a teen myself — a long, long time ago! After becoming a follower of Jesus in 1981, I started volunteering with the youth...", "filename": "_6948d0b00d88450ea4d7c60931da5f2f_1588624098.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6948d0b00d88450ea4d7c60931da5f2f_1588624098.html", "title": "From the Pulpit: God loves a good question", "title_page": "From the Pulpit: God loves a good question", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "I really enjoy hanging out with and listening to teenagers. I was actually a teen myself — a long, long time ago! After becoming a follower of Jesus in 1981, I started volunteering with the youth group at church. Thirty-seven years later, my God given passion to share the hope and encouragement of the gospel message with kids is as strong as ever.\nOne group of kids I can’t get enough of is our Teen Gospel Choir. 100-plus kids strong, we’ve been working on music and doing life together almost every Monday night since February. I appreciate their commitment and ability to balance responsibilities including school, jobs, athletics, dance team, school plays and the ups and downs of life at home. I also love their honest questions.\nI believe God loves a good question and these kids have many of them. Such as: Why did God choose to save us? What, and who, will be in heaven? Why do I sin so much? Why do bad things happen to good people? Why is it so hard to stand up for God around my friends? How can I stop worrying about so many things? God is not put off by our questions. Sometimes for me, and kids, it’s hard to stop and listen to His answers. I believe listening to kids is a great way to show them that we, as adults, care about and value them.\nOn the subject of listening, I invite you to come listen to a great group of Gospel Choir kids perform two concerts tomorrow, Sunday, May 6. Attend a 3 p.m. concert at Autumn Ridge Church, 3611 Salem Road SW, in Rochester, or at 7:30 p.m. in Stewartville at the High School Performing Arts Center, 500 Fourth St. SW.\nNo tickets are needed, however a free-will offering will be taken to support the choir. Find more information at www.rochesterareayfc.org .", "url": "https://apnews.com/6948d0b00d88450ea4d7c60931da5f2f"}