{"authors": ["Patrick Reusse"], "date_download": "2020-05-04 20:19:41", "date_modify": "2020-05-04 20:19:41", "date_publish": "2018-11-28 22:01:02", "description": "Timberwolves followers became so convinced the franchise had entered another train-wreck period in the opening days of the season that they are having a difficult time leaving Target Center in a...", "filename": "_c64989298ea7477db4cf4fd47d574b31_1588623581.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c64989298ea7477db4cf4fd47d574b31_1588623581.html", "title": "Wolves fans want to worry instead of being happy", "title_page": "Wolves fans want to worry instead of being happy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Timberwolves followers became so convinced the franchise had entered another train-wreck period in the opening days of the season that they are having a difficult time leaving Target Center in a jovial mood, even after one of the more-impressive efforts seen around here since 2004.\nThe San Antonio Spurs came to town for the fourth game of a Midwest road trip, in which they had won at Indiana and Chicago and lost narrowly at Milwaukee. It was their third game in four days, and yet there was no reason to suspect the Wolves would be able to discourage Gregg Popovichs Spurs almost from the get-go.\nThis is season No. 30 for the Wolves, and they were 29-87 all-time vs. the Spurs, including three losses in four games dating to the start of 2017-18 a season in which the Wolves returned to the playoffs for the first time since the aforementioned 2004.\nThe Wolves outscored San Antonio 29-9 in the second quarter for a 57-34 halftime lead, and made it climb to 48-points 119-71 with five minutes remaining. The largest lead at any point in Wolves history had been 50 points, and the Spurs avoided topping that deficit by outscoring the Wolves 18-9 in those last five minutes.\nTimberwolves 128, Spurs 89.\nNobody knew we were going to beat Spurs like that, said Josh Okogie, who entered with 10:22 left and scored 12 points, going 3-for-4 on three-pointers.\nAnd the productive appearance of the rookie was the reason the stragglers in the small crowd announced at 11,023 could not go home content, even with a 40-point victory over Pops Spurs, even with a fourth straight victory that brought the previously discombobulated Wolves back to .500 at 11-11.\nTwitter followers have been offering bitter complaints about Okogies permanency on the bench, as coach Tom Thibodeau has stuck with a nine-player rotation of veterans in the push to get back to even after the 4-9, pretrade hole.\nThe Wolves were three weeks into the schedule after a five-game losing streak on the West Coast when Thibodeau and General Manager Scott Layden made the Jimmy Butler trade. And despite the howls, nationally and locally, they found a good return: 6-foot-9 Robert Covington and 6-10 Dario Saric from Philadelphia.\nThere are strong, early indications that Covington, 29 next month and three months younger than Butler, is a better player for the Wolves than was Jimmy. And were not talking about better than the disgruntled Butler of this autumn, but better than Butler was when his acquisition boosted the Wolves back to the playoffs in 2017-18.\nButlers hard-nosed style and defensive tenacity was supposed to rub off on the rest of the Wolves. It didnt. His individual talent helped considerably, but there was no rubbing off, not like has been seen as a defender from Covington in a sample of eight games.\nCovington was a plus-29 when on the floor in the first half, and he was a plus-44 in 31 minutes when he left with seven minutes remaining and the score at 106-67. It took his gesture toward the sideline to come out at that point.\nIll defend Thibodeau here: After the previous seasons of his teams defensive ineptitude, the coach was having so much enjoyment watching the Wolves claw away with Covington that he didnt want to stop.\nAsked about Covingtons plus-44 in 31 minutes, the coach said: I dont think Ive seen that before.\nThibodeau talked optimistically about Covington when the trade became official on Nov. 12. He was asked after this blowout if Covington has turned out to be a better than anticipated.\nHe went into a description of Covingtons assets and then said: Hes definitely first-team, all-league defense. Hes special.\nBeating the Spurs by 39, even a road-weary Spurs team that shot 39.5 percent from the field and were beaten to most every free ball or contested rebound for 3andfrac12; quarters that takes a few special efforts.\nJeff Teague was outstanding. Taj Gibsons inside muscle backed up the Spurs. KAT, Derrick Rose, Gorgui Dieng the whole crew was outstanding, except for Andrew Wiggins, who went 3-for-15 from the field and is now 11-for-52 shooting during the four-game winning streak.\nThus, Wolves fans couldnt be happy, because they want Okogie to play and Wiggins to sit, even though you could see his veteran teammates trying to get Wiggy untracked, knowing that has to happen for this turnaround to be more than a refreshing blip in a grueling season.\nBulletin: Andrew Wiggins is more important to the Wolves future than Josh Okogie.", "url": "https://apnews.com/c64989298ea7477db4cf4fd47d574b31"}