{"authors": ["Meagan Day", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Lehmann", "Corey Robin", "Tanner Howard", "Chris Hayes"], "date_download": "2020-05-04 19:54:36", "date_modify": "2020-05-04 19:54:36", "date_publish": "2018-09-28 00:00:00", "description": null, "filename": "2018_09_brett-kavanaugh-banality-elites-meritocracy_1588622076.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/09/28124103/1600px-Brett_Kavanaugh_Yale_Yearbook.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_09_brett-kavanaugh-banality-elites-meritocracy_1588622076.html", "title": "The Banality of Brett Kavanaugh", "title_page": "The Banality of Brett Kavanaugh", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The masters of the universe, it turns out, are losers.\nThe Brett Kavanaugh hearing was a kaleidoscope of family and God and prestigious clerkships spliced with boofing and ralphing and brewskis. It was a thorough dressing-down. In the end, one was left with the impression of an unremarkable guy who was born on a conveyor belt to power, without much obligation to distinguish himself from his peers. On the contrary, his success was relatively guaranteed on the condition that he didn’t distinguish himself from them, that he simply play nice with the fellas — and not necessarily so nice with women — from prep school to the Ivy League to the White House and beyond.\nWhat struck me most about yesterday’s hearing, cutting through Kavanaugh’s tone-deaf retorts and indignant whinging and his frequent professions of love for beer, is how utterly ordinary he is. This guy is juvenile, arrogant, sexist — and very familiar. It pointed to a larger truth: the people running the show are callous and dangerous, but they’re also astonishingly average. They have no irreplaceable qualities or insights that would oblige us to put up with their bullshit. They would hate for us to realize this.\nIt was a familiar feeling to me. The Hillary Clinton campaign was my big emperor-wears-no-clothes moment, when the mundane ineptitude of the ruling elite exposed itself and demolished whatever faith I retained in rule-by-the-most-excellent. Until then I’d entertained the latent notion that, despite the Democratic Party’s frequent refusal to stand on the side of working people, there was probably a reason its top brass were the ones in charge of battling Republicans. Because they knew how to win. Because they were in charge. It was tautological.\nWhen I balked at yet another corporate compromise floated by the Democrats, a small voice assured me it was just an encounter with the dark arts of pragmatism. I wouldn’t understand — after all it wasn’t me who was appointed to be Hillary Clinton’s campaign manager, it was presumably someone who knew what they were doing. Their suitability to a task as critical as defeating the Right was self-evident, since they were the ones charged with the task.\nThat voice fell permanently quiet for me during the 2016 presidential election. Politics provides no shortage of moments such as these, when the mask of power slips and you realize the people at the top are not worthy of the respect you afford them — not just as individuals, but as a class. I suspect George W. Bush’s aggressive vacuity as he ramped up austerity and shepherded the nation into interminable war prompted similar revelations for many. But as our society continues to rear new people instilled with the belief that decisions about the fates of millions are made by those whose rarified expertise, superior talents, and impressive families qualify them to make those decisions, the illusion regenerates perpetually and must be shattered time and time again.\nPerhaps the greatest threat to this illusion in all American history is Donald Trump. It’s no coincidence that popular politics are gaining new dynamism under his presidency, including the swelling ranks of the socialist left, but also the menacing flash of energy on the right. Trump is a powerful grenade tossed into the fortress of meritocracy. Obama’s Ivy League competence and cool were, for liberals who loved him but also for many who hated him, powerful reinforcement of the idea that the people at the top are there because they have some special wiring, an innate excellence. They got there because they were meant to be there, and where they are is proof of where they were always meant to be.\nBut Trump undoes it all. In the realm of ideology, this is Trump’s greatest threat to Obama’s legacy. Trump is a transparent jackass and an egregious bully. Worst of all, he’s unprofessional. And in that way he gives ordinary people across the political spectrum confidence in their own fitness for politics.\nWhat dawns upon you when you bear witness to Trump — even more so than with Bush, who more closely resembles Kavanaugh in both his fatuous smugness and his more conventional unobstructed path to political power — is that the people at the helm don’t necessarily know anything special. It cannot be deduced from the mere fact of their power that they have access to a higher wisdom, beyond the grasp of commoners. The powerful aren’t sages, you realize. What they know that the rest don’t know is how to appreciate money and influence. And, most importantly, they know each other.\nKavanaugh is probably guilty of sexual assault. That’s my read, after reviewing the available testimonies and also thirty years of experience with people. But what’s really sticking for me isn’t the exceptional brutality of powerful men — the cruelty of Kavanaugh or his prep-school friends or of the fulminating Republicans who protested his mistreatment yesterday, referring to the investigation of sexual abuse allegations against a Supreme Court nominee as “unfair” and “innuendo.” No, it’s not their monstrosity that stands out. It’s their ordinary pettiness, their desperate desire to impress each other and, when the shit hits the fan, to save face together.\nOne got the impression from Kavanaugh’s hearing that it’s his boyhood friend Tobin, he of the home weight room, whose admiration Kavanaugh covets most of all — then, now, and forever. Many people are like this. It can sometimes be a good thing. But here’s where it differs from other types of loyalty: the reason these guys cling so tight is because they’re each other’s ticket to the top, and each other’s insurance policy once they get there. Their fidelity, their solidarity, is how they run the world in the absence of remarkable personal qualities.\nThe banality of Brett Kavanaugh is another data point, especially for a new generation, in the collapse of the illusion of meritocracy. On one hand I am hopeful. These points are clustering closer together, and people’s belief in the ipso facto legitimacy of the ruling elite is evaporating faster than ever before.\nBut I also despair. Because as long as we have a political economic system that floats chumps like Kavanaugh on wings of respectable pedigree and impressive social connections to the highest strata of society, and as long as we continue fostering in people’s hearts — even of liberals, especially liberals — the fantasy of those people’s inherent superiority, these guys will continue to have power they don’t deserve. They will continue to be in charge of monumental decisions like Roe v. Wade or Janus v. AFSCME, or going to war or eliminating social programs, or who’s guilty and who’s innocent.\nAnd those decisions won’t be calibrated to maximize society’s well-being and prosperity. They will be meticulously triangulated to preserve club membership, to make their buddies proud — their classmates who chose to go into finance or real-estate or military weapons manufacturing instead of politics. The illusion that these men are prodigies instead of mere scions will prevail, because they will protect it at all costs, and so in turn will their class’s stranglehold on our society.\nShattered illusions may be a good beginning and necessary component of lasting and substantive change. But without a radical alteration of the political economic system that fast-tracks the born elite into the halls of power, they will not be enough.", "url": "https://jacobinmag.com/2018/09/brett-kavanaugh-banality-elites-meritocracy"}