{"authors": ["Sentinel"], "date_download": "2020-05-04 20:19:06", "date_modify": "2020-05-04 20:19:06", "date_publish": "2018-11-24 11:33:40", "description": "By Marc A. Thiessen Special to the Washington Post WASHINGTON -- President Trump did defy history in the 2018 midterm elections. While his predecessor, Barack Obama, lost 63 House...", "filename": "_35859ad0c5704ca08f3fe42c9f7f95fb_1588623546.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_35859ad0c5704ca08f3fe42c9f7f95fb_1588623546.html", "title": "How Trump Can Avoid One-term Presidency", "title_page": "How Trump Can Avoid One-term Presidency", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Marc A. Thiessen\nSpecial to the Washington Post\nWASHINGTON -- President Trump did defy history in the 2018 midterm elections. While his predecessor, Barack Obama, lost 63 House seats and six Senate seats in his first midterms, Trump held the GOP’s House losses to just over half of that and bolstered the GOP majority in the Senate. The combination of a Senate map that heavily favored Republicans, and Trump’s success in turning out his 2016 base, produced a red wall that held up pretty well against the blue wave.\nBut there are also warning signs in the results that Trump should not ignore. While the working-class voters Trump won in 2016 turned out in droves on Election Day, Republicans were decimated in higher-income suburban Republican districts -- including many that voted solidly for Mitt Romney in 2012.\nThese losses are self-inflicted wounds. The economy is booming: Under Trump’s leadership, economic growth in the second quarter was 4.2 percent, and the unemployment rate has reached 3.7 percent -- a nearly 50-year low. Yet Trump’s approval rating on the eve of the 2018 election was 39 percent, the worst for any president since before Dwight Eisenhower. By contrast, Obama had 46 percent approval before his first midterms, at a time when unemployment was soaring at almost 10 percent.\nThe problem is that Trump has failed to do what every successful two-term president has done before him: expand his base of support. Instead of trying to win over persuadable Americans and bring them into his coalition, the president has sought to energize his base in ways that drive those persuadable voters -- particularly suburban women -- away.\nIf he wants to win reelection, Trump needs to bring suburban Republican voters back into the GOP fold. In 2016 he won the suburbs by five points. This gave him the margin of victory in key swing states: In Pennsylvania, he took the overwhelming majority of the state’s rural areas and small towns, while Hillary Clinton won the urban areas around Pittsburgh and Philadelphia. But, as a Post analysis explained, “What made the difference in the end was a Republican shift across much of the state’s suburbs” which “was large enough to carry Trump to a statewide victory of less than one percentage point.” It was a similar story in Wisconsin, Michigan, Ohio, North Carolina and Florida. If Trump wants a second term, he needs to win those suburban GOP voters back.\nThere is no need for Trump to choose between energizing his base and expanding it. He can do both by using the presidential bully pulpit to reach out to those who disagree with him. For example, suburban voters constantly hear from the left that Trump is a racist, and no one wants to vote for a bigot. But during the 2016 campaign, Trump reached out to African American voters, visiting a black church in Detroit and delivering a major speech in Charlotte in which he promised black Americans, “Whether you vote for me or not, I will be your greatest champion.” He’s delivering on that promise. African American unemployment reached its lowest rate on record. Trump’s tax reform included “Opportunity Zones” to revitalize struggling low-income communities. He’s fighting for school choice and recently announced his support for bipartisan criminal-justice reform.\nSo why doesn’t Trump visit a black church and say: “I promised to fight for you whether you voted for me or not, and that is exactly what I am doing”? His African American support has increased from about 8 percent of voters in 2016 to about 14 percent in a poll earlier this year. There is no reason it shouldn’t go higher. And millions of persuadable suburban voters would be watching his outreach and would be more likely to support to a president who fights for everyone, including those who don’t support him.\nSuch outreach would be a start toward a broader change in tone. The best policies in the world won’t gain traction with suburban voters unless the president’s tenor become less bombastic and his administration less chaotic. Trump can win back voters who fled the GOP coalition in 2018 if he chooses to, and doing so does not have to come at the expense of tending to his blue-collar base. But time is running short. The longer he waits, the more impressions of the president harden, the less persuadable these voters become -- and the more likely it is that Trump will end up a one-term president.\nFollow Marc A. Thiessen on Twitter, @marcthiessen.", "url": "https://apnews.com/35859ad0c5704ca08f3fe42c9f7f95fb"}