{"authors": ["Corey Paul Cpaul Oaoa.Com"], "date_download": "2020-05-04 20:12:05", "date_modify": "2020-05-04 20:12:05", "date_publish": "2018-01-28 11:00:00", "description": "Republican voters in Ector County will pick one of two political newcomers to become the new county judge, marking the first time in 16 years that the county’s top administrator has been decided...", "filename": "_e728d8e42f4a4370897bf004fe686705_1588623125.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e728d8e42f4a4370897bf004fe686705_1588623125.html", "title": "County’s top spot on ballot", "title_page": "County’s top spot on ballot", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Republican voters in Ector County will pick one of two political newcomers to become the new county judge, marking the first time in 16 years that the county’s top administrator has been decided by an election and falling at a time when the county faces critical challenges including the prospect of an ongoing budget crisis.\nThe March primary naming a Republican nominee will decide the race because no other challengers have filed for the post.\nAnd the winner may assume their post months before the November election, if incumbent Ron Eckert steps down from his post after the primary as he said he might do following voters’ rejection of his proposal to create a new county sales tax that could have boosted the county’s general spending fund by more than 25 percent.\nThe candidates include Debi Hays, a small businesswoman who’s held leadership posts in influential Republican groups, and Chris Fostel, an attorney who worked as a prosecutor in the Ector County District Attorney’s Office until resigning his post this month to campaign.\nHays has lived in Odessa for more than three decades and touts her experience beginning as a clerk without a college degree and rising to an executive position at a savings and loan company, a business consultant, and an entrepreneur who ran a successful tanning salon and later, La Mirage Spa and Beauty Salon, which remains in business.\nShe touts her business experience as key to a new direction for the county, including fixing its budgetary mess.\n“Until a person who understands finance and budgeting can lay their hands on all those multiple pieces of knowledge, then you cannot come up with a solution,” Hays said. “And I’m an outsider looking in. But I do know the experience that I have had over the 35 years that I am very qualified, because this job is an administrative position.”\nFostel moved to Odessa about five years ago, from the DFW area, for a job as an assistant district attorney who tried felony cases after work back home that included stints as a prosecutor and owning a small private practice.\n“Who has actually served this county? And who knows how this county works?” Fostel said. “That’s clearly going to be me.”\nNeither has ever been elected to office or served in a top governmental role. And both campaigns include promises to fix the budgetary mess, trimming county expenditures and shoring up funds. But when asked for specific strategies in interviews, both said they are still forming their approaches to the job as chief budget officer.\nThere are some key distinctions between the two: Hays is proposing a new means of building a county courthouse, which Fostel rejects, that would avoid debt by recruiting a private builder and leasing to buy to the new facility. And Fostel is an attorney and Hays is not, a difference that would limit the courtroom work that Ector County judges, who are traditionally attorneys, perform.\nBoth also described the county sales tax proposal as worthwhile and a viable means of raising new county revenue.\nLast year, facing the threat of a $4.8 million deficit last summer, the Ector County Commissioners Court raised property taxes, ate into the reserve fund, laid off 15 employees and slashed departmental budgets in order to fund through the 2018 Fiscal Year. Commissioners still failed to pass a balanced budget, and none of the cuts were long-term fixes.\nMeanwhile, the Ector County Courthouse remains in disrepair, which periodic sewage leakages through courtroom ceilings illustrate.\nThe candidates differ in the strategies they say they would pursue for replacing the courthouse. Hays advocated finding a private entity to build the courthouse in a lease-to-buy arrangement that would allow the county to avoid taking on debt and asking voters to approve a bond.\nThat option has been floated for years, including before voters rejected a $95 million bond proposal during the tenure of County Judge Susan Redford in 2013. Eckert had also dismissed the lease option, preferring the county purchase a new building outright but never advancing a plan to do so.\n“The last thing the taxpayers want is to continue to go into debt and for you to always be reaching into their back pockets,” Hays said, saying she wanted the courthouse to include extra floors for office and retail space that the county could rent. “The ideal goal of it is this: you use the rental income to offset your debt, then as you pay off your debt, you can expand into the floors if needed or if not needed, then you have extra income coming in to help with the expansion of the needs of the county. So how is that not a win-win?”\nFostel, who said he’s a “victim” of the poor courthouse infrastructure (he tells a story about sewage dripping on his neck), rejects the idea of a long-term financing arrangement with a private builder and questioned whether the county would be left in a “beholden position to these investors” (something Hays dismissed).\n“If you are going to have a community and you are going to have a government, you need to have at least enough pride in it for the county to own its own courthouse,” he said, while acknowledging “the money is not there right now.”\n“I know the courthouse is a disaster,” Fostel said, but added he has not decided on the best way to replace it. “Really, that’s not at the top of my list right now. We’ve got to right the ship at the county before we can do that. There’s no question that building has served its purpose, and our employees and citizens deserve something better. I don’t want to bring that to the people until we have a transparent plan for how we are going to do that, how we are going to pay for it, what kind of building we want, what our future needs are going to be.”\nRuling out a private builder would leave building a new courthouse through debt and likely asking voters to approve a bond if the county cannot find another way of funding it such as shoring up new revenue.\nFostel said he wanted to seek more state and federal grants, maybe hiring a full-time grant writer. He said crime would be a top issue. He said he plans to invest in staff such as prosecutors and investigators. And he said he wanted to “push the courts to speed up their dockets,” although the county’s top executive has limited ability to do that. Judges are elected. And in the case of district judges, the county funds only a portion of their budgets.\nBut Fostel pointed to another factor he argues is a key reason he should become the next county judge over Hays: His license to practice law.\n“The dangerous thing about my opponent is that if she comes in she doesn’t have a law license,” Fostel said. “That removes one of the county criminal courts. That takes it out of play.”\nHe argued it would “backlog their system,” while Hays says the two County Court at Law judges could “absolutely” handle it.\nMost county judges are not lawyers, and the importance of a law license varies, said Susan Redford, the former Ector County Judge who resigned in 2015 to work for the Texas Association of Counties, where she still trains county judges throughout the state.\n“We have more licensed attorneys now than we have in recent history in the State of Texas, but as far as whether it’s important or not it’s a county by county question,” said Redford, who cannot endorse candidates in her current role.\nA county judge who is not an attorney still presides over some cases including matters related to guardianship, mental health and uncontested wills. An attorney can hear more cases, primarily misdemeanor criminal cases that would otherwise be handled entirely by the two County Courts at Law, which will both have relatively new judges.\nAttorney-county judges that spend 40 percent or more of their time in the courtroom also get a state supplement to their salaries.\nBut the majority of the county judge’s duties are chiefly administrative: proposing a budget, presiding over the commissioners court, serving on boards with important functions like transportation planning, working with departments and so forth.\nCounty Attorney Dusty Gallivan, who said he supports Hays, argued that County Courts at Law should not suffer if the county judge no longer handles what usually amounts to 20 percent of the criminal docket that his office prosecutes.\n“He’s a lawyer and he could handle that aspect of it but it’s such a small part of the overall job of the judge,” Gallivan said. “To me the other stuff is more important because we have two competent County Court at Law Judges who can handle those cases.”\nGallivan said that misdemeanor criminal work normally consumes maybe 5 percent of a county judge’s time.\nFormer County Court at Law Judge Scott Layh, who resigned last month to work in private practice, said the county judge’s help on misdemeanor cases “absolutely makes a difference” but that the other two courts could absorb them.\nLayh, a fellow Republican, said he has yet to decide on a candidate judge but knows both and said they are qualified.\nHe said the greatest challenge the new judge will face, and the most immediate if they are appointed, is proposing and passing a budget. Second is finding a way to build a new courthouse and securing sales tax revenue.\n“There is not enough money in the county and there is no way there is going to be enough money in the county to cover the costs that are necessary,” Layh said. “So that’s a hard job. That’s a ridiculously hard job.”", "url": "https://apnews.com/e728d8e42f4a4370897bf004fe686705"}