{"authors": ["Andrew Devey Herald Correspondent"], "date_download": "2020-05-04 20:11:40", "date_modify": "2020-05-04 20:11:40", "date_publish": "2018-02-14 06:00:00", "description": "Lavender Briggs scored 32 points and Melissa Martinez chipped in 12 to lead the Provo Bulldogs to a 70-60 win over Maple Mountain and claim a share of the Region 8 girls basketball...", "filename": "_bd7518bea3b04960b0e15ceedd641bb6_1588623100.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bd7518bea3b04960b0e15ceedd641bb6_1588623100.html", "title": "Girls basketball: Briggs and seniors lead Provo past Maple Mountain", "title_page": "Girls basketball: Briggs and seniors lead Provo past Maple Mountain", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lavender Briggs scored 32 points and Melissa Martinez chipped in 12 to lead the Provo Bulldogs to a 70-60 win over Maple Mountain and claim a share of the Region 8 girls basketball title.\n“It’s been a while since Provo has had any kind of accolades — it’s a big deal,” Provo head coach Amanda Barker said. “I knew that we needed to come out and give a full effort tonight. We’ve had lots of games where we’ve played only part of the game. We’ve been working really hard on playing 32 minutes of solid basketball, and we almost got there tonight.”\nThe Senior Night matchup and regular-season finale for both teams featured a showdown of two of the top scorers in the state, Provo’s Briggs and Maple Mountain’s Maddy Eaton — both juniors.\nBriggs started out hot, scoring 12 in the first quarter and shooting a perfect 3-for-3 from the 3-point line in the first half.\n“My mindset always is to take as many open shots or create my shot as much as possible,” Briggs said. “I just try to stay as focused as possible and get into game mode right from the start.”\nProvo’s fast start kept Maple Mountain at a distance for most of the game, but in the third quarter Eaton and the rest of the Golden Eagles went on an 8-2 run to cut the Bulldog lead to three, prompting Barker to call timeout.\n“I yelled … a little,” Barker said. “In the first half they were beating us down the court. We had just talked about getting back on defense and they came out and didn’t do what we had talked about. So, we reiterated it in a more aggressive way what we talked about at halftime, hustling back, and getting back on defense and the girls responded.”\nQuick buckets by Briggs and seniors Angelea Slinker and Maddi Thompson pushed the Provo lead back to eight. Senior guard Melissa Martinez scored the final seven points of the quarter for the Bulldogs as Provo regained its composure and control of the game.\n“We had a lot of girls step up and contribute which was really important for us,” Martinez said. “We had really good energy, but our coach was not satisfied with us so we had to keep pushing. We did a good job playing as a team.”\nMaple Mountain wasn’t able to pull any closer in the final quarter. Eaton fouled out in the fourth quarter with 23 points and the Golden Eagles are now faced with a play-in game against Springville to qualify for the state tournament.\nThis season has been a historic one for the Bulldogs. But the girls insist they aren’t done yet.\n“It was definitely special and emotional, but getting the ‘W’ was really nice,” Martinez said. “It being Senior Night was just that extra push we needed to give it our all. It’s really nice to see the outcome of all of our hard work and hopefully we’ll go to state and make some more history.”", "url": "https://apnews.com/bd7518bea3b04960b0e15ceedd641bb6"}