{"authors": ["Linda Conner Lambeck"], "date_download": "2020-05-04 20:19:21", "date_modify": "2020-05-04 20:19:21", "date_publish": "2018-01-25 20:33:48", "description": "SHELTON — Two years of restraint during tight budget cycles appears to be the limit for a city school board shooting for a higher state ranking. The Shelton Board of Education this week...", "filename": "_de71a925f9dd4377be40b842042fe887_1588623561.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_de71a925f9dd4377be40b842042fe887_1588623561.html", "title": "Shelton wants school budget that will boost its standings", "title_page": "Shelton wants school budget that will boost its standings", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Shelton wants school budget that will boost its standings\nSHELTON — Two years of restraint during tight budget cycles appears to be the limit for a city school board shooting for a higher state ranking.\nThe Shelton Board of Education this week unanimously approved a $74.3 million budget request for the 2018-19 fiscal year, representing an increase of nearly 4 over current funding.\n“The budget we will be voting on tonight isn’t perfect, but it will allow us to get class sizes back to an acceptable level and ensure classes we must run can be staffed,” Board Chairman Mark Holden, a Republican, said during Wednesday’s meeting.\nDave Gioiello, a school board member and chairman of the city’s Democratic Town Committee, was of the same mind.\n“I hope the rest of the citizens of Shelton will understand this is a goal-oriented budget — one that moves us forward (into) the top 25 percent of districts in the state,” Gioiello said. “It is where we should be.”\nThe requested $2.8 million increase would add 6.8 teaching positions, restoring several positions cut over the past two years and furthering efforts to bolster science and innovation at Shelton’s high school and intermediate schools.\nSchools Superintendent Christopher Clouet called it a correction that would boost science, technology and music programs and help reduce class size at the elementary school level.\n“We are looking to take the momentum we have and build on it,” Clouet said. “We need the proper staffing and materials in order to do it.”\nHolden called last year’s budget an unusual case, based on a lot of uncertainty. The state budget was unsettled for months after the fiscal year began and school funding remained a wild card.\n“No one felt comfortable predicting what would happen,” Holden said.\nThe city, which foots more than 80 percent of the school budget, gave the school district a $1 million funding boost, which because of rising costs forced cuts to staffing and school supplies.\n“The effects have been painful for many people, but there is no getting away from the fact that our mayor and aldermen accepted a risk to give us some certainty,” Holden said.\nIn the new fiscal year, the state Legislature, still facing a staggering deficit, is scheduled to give Shelton $402,736 more in its education grant.\nWhile many decried a state Supreme Court ruling last week siding with the state on school funding, Clouet said the absence of a court decree may slow a strict adherence to a school funding formula based strictly on need. Shelton stands to lose if the formula were strictly followed.\nHolden said the last two budget seasons have been friendly and cordial.\n“I hope everyone will support the budget proposal and work ... to help the mayor, Board of Apportionment and Taxation and Board of Aldermen understand this budget,” Holden said. “It is a good investment in the future of Shelton.”\nThe request goes to Board of Apportionment and Taxation and then the Board of Aldermen in late February.", "url": "https://apnews.com/de71a925f9dd4377be40b842042fe887"}