{"authors": ["Cindy Babish-Schultz"], "date_download": "2020-05-04 20:08:03", "date_modify": "2020-05-04 20:08:03", "date_publish": "2018-04-16 21:25:39", "description": "Happy 100th birthday to Joseph Zimbicki of Bower Hill (from Heidelberg), who will celebrate April 17. Joe was married to the late Alma (David) Zimbicki, who died in 1983. Joe and Alma had two...", "filename": "_49b96623dd4f4bc19c4808149a19f8c2_1588622883.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_49b96623dd4f4bc19c4808149a19f8c2_1588622883.html", "title": "Bower Hill man to turn 100", "title_page": "Bower Hill man to turn 100", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Happy 100th birthday to Joseph Zimbicki of Bower Hill (from Heidelberg), who will celebrate April 17. Joe was married to the late Alma (David) Zimbicki, who died in 1983. Joe and Alma had two daughters, Beverly (James) Senchak of Scott, who died in 2011, and Becky (Blaine) Hurst of North Carolina.\nHis grandchildren include Julie Senchak (Ceri Morgan), Janie (Dave) Hunley of North Carolina, Joseph Senchak, and David Hurst. Joe also has three great-grandchildren, Luke, Tessa and Max Hunley.\n• Happy 45th wedding anniversary to Lynne (Ramp) and Frank Tinnion of Carnegie, who celebrated April 7. They are the parents of Jamie Reilly and Kellie Tinnion and have one granddaughter Layla Lynne.\n• Arleen Wheat of South Fayette celebrates another year April 13. She is the daughter of the late Joan and John Wheat and sister to Pam Wheat of P.J.’s Deli and Catering.\n• Happy 26th wedding anniversary to Pat and Dale Ambrose of Carnegie, who celebrated April 10. Their family includes children, Tara (Mike), Sherry (Joe), Erik, Dawn (Jim) Wood and Cari (Ben) Stork. Grandchildren are Brad, Alex, David, Miley, Grace, Kenley and Jude. Family and friends wish you another happy 26 years.\n• Dennis Holderbaum of Carnegie celebrated another year April 10 with his wife, Carrie, and four sons, David, Zack, Brady and Bryan.\n• Debbie and Ted Popivchak of Carnegie will celebrate their 41st wedding anniversary April 16. They are the parents of Jason (Heather), Julie (Bill) Weil and Jaimee (Justin). Debbie and Ted also have seven grandchildren.\n• Happy 24th birthday to Brent Nadik of Collier, who celebrates April 12. Brent’s sister, Dominique, who resides in Nashville, celebrates her 25th birthday April 13. Brent and Dominique are the children of Maria (Schepis) and Tim Nadik.\n• Judy Granata Castello of Rosslyn Heights celebrated her birthday April 8. She is the wife of Tim Castello, and together they are the parents of Anne and Timmy.\n• Special birthday wishes are sent to Richard Wagner of Collier, who celebrated April 8 with his wife, Dottie, and family.\n• Kay Downey-Clarke and Gerry Clarke of Collier Township will celebrate their 27th wedding anniversary April 13.\n• Birthdays this week include Theodore Hatcher, Patsy Pearce, Jeannie Kossler, Susan Sonson, Paula Kusler, Alexander Popichak, James Coletta, Paul Saracena and Dr. Frank Verri.\n• Mary Ann and Bob Kinzler of Cubbage Hill will celebrate their 55th wedding anniversary April 20. They are the parents of two daughters, Mary Chris and Donna.\nCindy Babish-Schultz is a Tribune-Review contributing writer. Reach her at 412-249-6346 or cbabish@aol.com.", "url": "https://apnews.com/49b96623dd4f4bc19c4808149a19f8c2"}