{"authors": ["Emily Balser"], "date_download": "2020-05-04 20:24:58", "date_modify": "2020-05-04 20:24:58", "date_publish": "2018-01-25 04:06:50", "description": "Students and faculty at Bethel Park High School will hold an African American read-in as part of observing Black History Month. The event will be held at 2 p.m. Feb. 11 in the Bethel Park...", "filename": "_7db6b20a216e4bdf8048d342f3206542_1588623898.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7db6b20a216e4bdf8048d342f3206542_1588623898.html", "title": "Bethel Park High School to host African American read-in on Feb. 11", "title_page": "Bethel Park High School to host African American read-in on Feb. 11", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Students and faculty at Bethel Park High School will hold an African American read-in as part of observing Black History Month.\nThe event will be held at 2 p.m. Feb. 11 in the Bethel Park High School Large Group Instruction Room, 309 Church Road.\nThe read-in will be put on by the Bethel Park High School English Language Arts Department and the students in STAND—Standing Together Against Negativity and Discrimination.\nThe STAND students will present poems, excerpts from speeches and spoken word performances from African-American authors including Maya Angelou, August Wilson, James Baldwin, and Langston Hughes. Students will also present their original works.\nThe event is part of the National Council of Teachers of English’s nationwide program, which is a poetry recitation and readers’ theater program celebrating literary selections for Black History Month.\nThis is the fourth year that Bethel Park High School students have participated.\nEmily Balser is a Tribune-Review staff writer. Reach her at 724-226-4680, emilybalser@tribweb.com or on Twitter @emilybalser.", "url": "https://apnews.com/7db6b20a216e4bdf8048d342f3206542"}