{"authors": ["Emily Hoard"], "date_download": "2020-05-04 21:09:09", "date_modify": "2020-05-04 21:09:09", "date_publish": "2018-01-05 16:45:00", "description": "With rock music playing in the background and framed tattoo designs of snakes, flowers and dragons decorating the walls, Jackson Street Tattoo is open for business at 650 Jackson St.,...", "filename": "_aa8ed4424e3147b19b73308c75e120cf_1588626549.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aa8ed4424e3147b19b73308c75e120cf_1588626549.html", "title": "Jackson Street Tattoo to host opening party Saturday", "title_page": "Jackson Street Tattoo to host opening party Saturday", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With rock music playing in the background and framed tattoo designs of snakes, flowers and dragons decorating the walls, Jackson Street Tattoo is open for business at 650 Jackson St., Roseburg.\nOwner James Walls, 34, plans to host an opening party at the shop starting at noon Saturday so locals can come in and get to know the tattoo artists. From 4 to 8 p.m., he plans to raffle off shirts and offer free cupcakes and pizza donated from Bluebird Cupcakes and Old Soul Pizza. About 100 pre-drawn tattoo designs will be available for walk-ins to choose at a discounted price, starting at $50.\n“We want people who might not have the chance to come into a tattoo shop to come in and learn about the art,” Walls said.\nWalls began his tattooing career in Eugene at a shop called the Annex. In 2011, he decided he wanted a slower lifestyle away from the city, so he moved down the freeway to buy a house in Green and spend his free time fishing and camping. After working for High Priestess Piercing & Tattoo on Garden Valley Boulevard for a few years, Walls took the opportunity to start his own shop.\n“It’s taking more control of my own life and building something that’s mine forever,” Walls said of his new business.\nHe described Jackson Street Tattoo as “a place where people can feel comfortable coming in to hang out and talk tattoos.”\nWalls grew up around the tattoo-clad friends of his father and was fascinated by the photos of tattooed people in National Geographic magazine.\n“When I was a teenager, I thought this is what I should do,” Walls said.\nWhile Walls said everyone has their own ideas about tattoos, he sees them as milestones, or souvenirs of different parts of someone’s life.\n“You might get one of Bart Simpson on a skateboard, not because you think you’ll like it down the road but because you like it now,” Walls said. “It’ll remind you of when you liked something.”\nWalls shares the tattoo shop with four other tattoo artists who are working there as independent contractors.\nEach of the five has his own style, and Walls said if someone were to get a tattoo of the same thing from each of the artists, they would all have their own flavor. While Walls said his style is “American traditional” with bold lines and bright colors, Timothy James, one of the independent artists, prefers fine lines in gray and black.\nJames said Jackson Street Tattoo is probably the most progressive tattoo shop in the area.\n“All the artists here are really good and it makes you want to be better,” James said. “Everybody here has a good understanding of tattoo culture.”\nSome people choose tattoos that have a lot of meaning to them, while others just like to collect art, James said. He added some of his tattoos have meaning, but he mostly likes to collect art from different tattoo artists.\nWalls said he decided to open the shop in downtown Roseburg because he sees a lack of culture in the area. On the weekends, he visits Bend or Eugene where he walks around and stops in unique shops, and he said he wants to help cultivate that kind of experience in Roseburg. He hopes to coordinate with other local business owners to schedule events to bring more foot traffic downtown.\n“Our goal is to always be available to give someone a nice tattoo for a fair price,” Walls said.\nJackson Street Tattoo will be open from noon to 8 p.m. Tuesday through Saturday during the winter and is expected to expand to seven days per week in the spring.", "url": "https://apnews.com/aa8ed4424e3147b19b73308c75e120cf"}