{"authors": ["Eric Schucht The Banner-Press"], "date_download": "2020-05-04 20:28:46", "date_modify": "2020-05-04 20:28:46", "date_publish": "2018-09-27 12:00:00", "description": "Garages and yards were full of items for sale throughout David City on Thursday, Sept. 20. It was all a part of the City-wide Garage Sale held throughout last weekend. The Hruska Memorial...", "filename": "_a94eb3db45874ba686bd0c9364d3934b_1588624126.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a94eb3db45874ba686bd0c9364d3934b_1588624126.html", "title": "Residents participate in David City-wide garage sale", "title_page": "Residents participate in David City-wide garage sale", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Garages and yards were full of items for sale throughout David City on Thursday, Sept. 20. It was all a part of the City-wide Garage Sale held throughout last weekend.\nThe Hruska Memorial Public Library decided to get in on the sale with a Friends of the Library’s Bargain and Book Sale. The library’s lobby was full of books and other donated items for sale, with proceeds going towards the purchase of children’s books.\nOne of the most unique items the library had for sale was a card catalog, a cabinet used to store and organize reference cards. Kay Schmid, the library’s director, said the facility had it for years. The price tag on it was listed at $350. On Sept. 20, Schmid said the sale had a nice crowd and she hoped to sell out of their wares. She noted she thought the garage sales around town were a great way to attract out of town visitors.\n“I went out to the garage sales this morning and there were a lot of people from other communities out and about,” Schmid said. “So it brings a lot of people into town. “\nBonnie Riha was one of many people who held a garage sale in David City that weekend. She was trying to sell off some unwanted tools, housewares, blankets, children’s clothing and ceramics. She said the sale was a great way to attract visitors to town and that she was well known for her yard sales.\n“I know there are a lot of people who come into town and I kind of have a reputation, everybody drives by and goes, ‘oh, she’s having a garage sale,’” she said. “So I put my signs out and don’t have any problems.”\nRich Ware was another individual hosting a garage sale that weekend. He was able to sell some unwanted cabinets and chairs.\n“Well we had a garage sale the weekend before this,” he said. “Everybody said, ‘you should have waited.’”\nLori Matulka decided to participate for the first time in the Citywide Garage Sale. Her yard was full of items such as baseball cards and towels, which the wind was constantly blowing away. She said she wanted to downsize and liked how all the sales collectively “brought lots of people to town.”\nOne of her customers was Mari Anne Matulka, who said she was just browsing and looking for anything that caught her eye at the many sales throughout town.\nWhile Lori Matulka and Mari Anne Matulka were being interviewed by The Banner-Press, the two discovered they shared the exact same last name, but with no immediate family relation. Mari Anne speculated the two might be related through a distant relative.\nRachel Johnson was selling kids clothing and restored furniture from her business, The Rustic Farmhouse, at her garage sale. She also sold homemade signs at her sale from her business, which had a booth present at the St. Joseph’s Villa and Court vendor show the weekend prior.\n“We kind of take junk, as some people would call it, and turn it into something nice,” she said about The Rustic Farmhouse. “Since we already had it set up from the craft show, I’m like, oh, let’s just leave it up and let’s see. And a lot of people have said it’s really really nice items that we have and make.”\nJohnson started her sale the day before, but business was slow then. On Sept. 20, she said she had a steady stream of people stopping on by her sale. She said she plans to use the money earned to treat her kids to trip to the zoo or to help save up for a family vacation.\nEric Schucht is a reporter for The Banner-Press. Reach him via email at eric.schucht@lee.net", "url": "https://apnews.com/a94eb3db45874ba686bd0c9364d3934b"}