{"authors": ["Emily Balser"], "date_download": "2020-05-04 20:09:17", "date_modify": "2020-05-04 20:09:17", "date_publish": "2018-04-06 22:40:38", "description": "Harmar officials are considering a plan to make it easier for hospitals and urgent care facilities to come into the township. Township supervisors will hold a meeting and public hearing...", "filename": "_017bae4889a84b4d8e7cc56ace1c8610_1588622957.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_017bae4889a84b4d8e7cc56ace1c8610_1588622957.html", "title": "Harmar to open the door for hospitals, urgent care centers", "title_page": "Harmar to open the door for hospitals, urgent care centers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Harmar to open the door for hospitals, urgent care centers\nHarmar officials are considering a plan to make it easier for hospitals and urgent care facilities to come into the township.\nTownship supervisors will hold a meeting and public hearing April 19 to consider amending its zoning ordinance to designate hospitals, health care facilities and urgent care centers as permitted uses in the township’s commercial zones.\nThe current ordinance doesn’t address these types of facilities at all.\nTownship Secretary Donna Piper said officials want to update the ordinance to make it easier for these types of businesses to move into the area.\nPiper said there isn’t an urgent care in the Harmar area, so officials are open to one potentially moving in.\n“The urgent cares are a relatively new thing,” Piper said. “It (the ordinance) was never updated to address anything like that.”\nShe said they don’t currently have any businesses interested or plans submitted.\nHowever, Harmar already is home to two large office building that house doctors’ offices, including that perform minor medical procedures.\nThe ordinance defines the main commercial district as being between the Pennsylvania Turnpike, Route 28 and Freeport Road. It is considered the regional business center of the lower Allegheny Valley. An additional commercial district includes the area between Route 28 and Route 910.\nThe current zoning ordinance and map can be viewed on the township’s website, www.harmartownship-pa.gov.\nOfficials will also update definitions and parking requirements for the facilities.\nThe current zoning ordinance was adopted in 1999.\nResidents can view a copy of the proposed ordinance amendments at the township office during regular business hours, 8:30 a.m. to 4:30 p.m.\nPiper said residents with questions are encouraged to come to the public hearing.\nEmily Balser is a Tribune-Review staff writer. Reach her at 724-226-4680, emilybalser@tribweb.com or on Twitter @emilybalser.", "url": "https://apnews.com/017bae4889a84b4d8e7cc56ace1c8610"}