{"authors": ["Matt Langone", "Mlangone Lowellsun.Com"], "date_download": "2020-05-04 20:07:53", "date_modify": "2020-05-04 20:07:53", "date_publish": "2018-06-24 10:37:37", "description": "Ayer Shirley High School track and field coach Chris Donovan remembers coaching Trevor Fields, Ed Ernst, Will Ernst and Ethan Matthews as middle schoolers, when practice was pretty much an excuse...", "filename": "_9f385dac67074286b6ebda6e2d280a1f_1588622873.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9f385dac67074286b6ebda6e2d280a1f_1588622873.html", "title": "Ayer Kids Make National Impact", "title_page": "Ayer Kids Make National Impact", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Ayer Shirley High School track and field coach Chris Donovan remembers coaching Trevor Fields, Ed Ernst, Will Ernst and Ethan Matthews as middle schoolers, when practice was pretty much an excuse to hang out and socialize.\nAs each year passed, they got more and more serious about competing, to the point where this spring the four seniors from a small school in Central Mass. set an ambitious goal for themselves.\n“They started talking with each other, saying ‘hey, do you think we can make nationals?,’” said Donovan. “I wasn’t sure they could.”\nIn truth, the chatter amongst the quarter about nationals actually started during the indoor season over the winter, but they were unable to qualify in the 4x800 relay. This spring, the plan was to qualify for the outdoor nationals as an emerging elite distance medley team.\nFields ran the 1,200, Will ran the 800 while his identical twin Ed ran the 400 and Matthews ran the mile. Their best times from each event combined would be their relay time. They competed in as many meets at possible and Donovan frequently submitted their times to the nationals committee, but none were good enough to qualify, leaving one final opportunity at the All-State Meet.\nMatthews was able to cut six seconds off his mile time at the All-State Meet and that proved to be the difference. Donovan promptly submitted the newest relay time to the nationals committee on the way home from the All-State Meet. The next day, the seniors found out their time was strong enough and they would be invited to the New Balance Outdoor National Championships, which were held last weekend at Aggie Stadium in Greensboro, N.C.\nThe team placed 15th out of 28 teams on a sweltering 91-degree day last Sunday. They finished in a school-record time of 10:44 in the final competition of their high school careers.\n“It was overwhelming at first,” said Will Ernst. “When we got down there it was extremely hot, and we were used to training in 72-degree weather. But being in that atmosphere was awesome.”\nDonovan said it was the first time in at least 10 years that Ayer Shirley had sent athletes to nationals.\n“It was definitely a nice sendoff,” said Donovan, who is Ayer Shirley’s co-head coach along with Mike Seguin. “They are kids who are together all the time, so to get the four of them there together was special.\n“It was a balance all year between doing what was best for the team, but also helping them achieve their goal. But it was worth it.”\nThey flew to North Carolina last Friday and had a chance to explore the stadium on Saturday before competing on Sunday. The school was instrumental in helping the team pay for flights and room accommodations.\n“Without the support of the school, this never would’ve happened,” said Will.\nRunning at nationals was the perfect ending to a sensational senior year for the Ernsts, Fields and Matthews. They helped lead Ayer Shirley to a Division 5 indoor title in the winter and also a Division 2 Central/West crown in the spring.\nMatthews will continue running at Southern New Hampshire University, while the Ernst brothers are still deciding if they will run at Fitchburg State. Fields is headed to UMass Lowell and is also weighing his running future.\n“We’re such a small school that we get to start coaching them in middle school,” said Donovan. “It’s a special thing and it was fun watching their work ethic kick-in. The last two years, especially, outside of school and their part-time jobs, running has been everything. It’ll be a group that I remember for a long time because of their leadership and dedication.”\nFollow Matt Langone on Twitter @MattLangone", "url": "https://apnews.com/9f385dac67074286b6ebda6e2d280a1f"}