{"authors": ["Cassie Sheets"], "date_download": "2020-05-04 20:17:03", "date_modify": "2020-05-04 20:17:03", "date_publish": "2018-03-23 13:00:00", "description": "Paper plates and plastic cups may bring to mind eighth birthdays and college parties, but you can save yourself post-party dish washing without sacrificing style. These sophisticated single-use...", "filename": "_d27be4cee1654b1384c5dba6af9bb885_1588623423.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d27be4cee1654b1384c5dba6af9bb885_1588623423.html", "title": "Disposable party tableware you won’t want to throw away", "title_page": "Disposable party tableware you won’t want to throw away", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Disposable party tableware you won’t want to throw away\nPaper plates and plastic cups may bring to mind eighth birthdays and college parties, but you can save yourself post-party dish washing without sacrificing style. These sophisticated single-use tableware picks are so pretty you won’t want to throw them away.\nCacti Tumblers\nThese on-trend cacti tumblers from Sugar & Cloth are the perfect way to serve drinks at your first spring patio party. At $10.99 for a set of 8 BPA free plastic tumblers, breakage isn’t a tragedy—but eco-friendly hosts can hand wash these sturdy cups and reuse them.\nSugar & Cloth Gold Cacti Disposable Plastic Tumblers available from Amazon\nPalm Leaf Bowls\nThese disposable palm leaf bowls are the perfect biodegradable alternative to polluting Styrofoam. The plant-based dishware has a tropical look that will seamlessly fit in at a backyard barbecue.\nNaturally Chic Dinnerware Disposable Palm Leaf Bowls available from Amazon\nPaper Straws\nThese biodegradable paper straws from Kikkerland offer a stylish alternative to plastic in a variety of patterns—but the green bamboo straws are the best fit for warm weather drinks.\nKikkerland Biodegradable Paper Straws 144 Count available from Amazon\nFloral Dinner Plates\nThese lovely floral dinner plates are so pretty it’s hard to believe they’re made out of paper. They’re sure to be the hit of any spring garden party.\nBlissful Blooms Dinner Plates, Pack of 18 available from Amazon\nWooden Cutlery\nLooking for disposable cutlery that’s environment and budget friendly? Try this stylish wooden cutlery set from First Choice, which donates a portion of annual net-profits to environmental organizations. The utensils are 100% biodegradable.\nFirst Choice Disposable Wooden Cutlery Set 200 Pieces", "url": "https://apnews.com/d27be4cee1654b1384c5dba6af9bb885"}