{"authors": ["Nick Stevenson"], "date_download": "2020-05-04 20:12:26", "date_modify": "2020-05-04 20:12:26", "date_publish": "2018-03-20 10:09:00", "description": "NORFOLK - The Norfolk City Council gave the green light to take the next step toward building a new communications tower on 25th Street. During Monday night’s meeting City of Norfolk Risk...", "filename": "_8d02348ba5154ceeb0214c828e301dc4_1588623146.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8d02348ba5154ceeb0214c828e301dc4_1588623146.html", "title": "City council awards contract for new communications tower", "title_page": "City council awards contract for new communications tower", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NORFOLK - The Norfolk City Council gave the green light to take the next step toward building a new communications tower on 25th Street.\nDuring Monday night’s meeting City of Norfolk Risk Manager Lyle Lutt told council members City Staff worked with Specialty Telecommunications Services of Oklahoma City and it’s recommended to award the contract to construct a new tower west of 25th Street to Capital Tower and Communications of Waverly.\nRod Wilke a resident in the area expressed concerns with the process on how Norfolk is able to build a tower in residential zoning.\nCity Attorney Clint Schukei said the zoning regulations don’t apply to the City.\n“There is a long line of Nebraska Supreme Court cases that say they are not applicable. The reason for that is that anytime a political subdivision or the State of Nebraska has the right of eminent domain, the zoning regulations are not applicable Schukei said.\n“In essence citizens really have no rights in terms of what is done with property in the City. If the city council decides you want eminent domain on something you just take it. Is that right?” Wilke said.\n“There was no public request for input on that location at all. It is not the right location for it” Wilke added.\nCouncil Member Jim Lange told Wilke they’re multiple reasons why this is the best location, which were shared with him at the November meeting.\nThe council voted unanimously to award the contract to Capital Tower and Communications.", "url": "https://apnews.com/8d02348ba5154ceeb0214c828e301dc4"}