{"authors": ["Logan Wroge", "Wisconsin State Journal"], "date_download": "2020-05-04 20:16:53", "date_modify": "2020-05-04 20:16:53", "date_publish": "2018-01-24 01:46:00", "description": "A proposal to build a house on Madison’s Southeast Side to demonstrate water conservation features is moving forward, while the cost of the project is being scaled back. At a meeting...", "filename": "_921b43854d874811bb7d98c2ed431eb6_1588623413.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_921b43854d874811bb7d98c2ed431eb6_1588623413.html", "title": "Madison Water Utility's proposal for custom-built conservation home moves forward", "title_page": "Madison Water Utility's proposal for custom-built conservation home moves forward", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A proposal to build a house on Madison’s Southeast Side to demonstrate water conservation features is moving forward, while the cost of the project is being scaled back.\nAt a meeting Tuesday, the Water Utility Board unanimously approved Engberg Anderson Architects to design the Water Conservation House — a custom-built home aimed to be an educational tool to homeowners and contractors on ways to reduce water consumption, said Madison Water Utility spokeswoman Amy Barrilleaux.\nA revision to the proposal would reduce the city’s financial investment in the project.\nThe project was originally budgeted for $300,000, including about $200,000 for construction. But the utility looked at the costs of bidding the project out and realized the budget was insufficient, Barrilleaux said.\nInstead, the Madison Water Utility would sell three vacant lots it owns next to a well at 4724 Spaanem Ave. to a private developer. That developer would construct homes on the three lots, one of which would be the conservation house.\nThe public utility would then rent the conservation house for a limited time from the developer, allowing it to avoid the cost of construction.\nNow, the total cost is projected to be $87,000, including $72,000 in architectural fees. The utility estimates the three lots could be sold to a developer for around $120,000, potentially making a profit.\nThe conservation house would have custom features like rainwater capture for toilet use and more attainable approaches for homeowners to save water, such as specialized landscaping and low-flow faucets.\nThe revised approach takes away some of the risk of the city trying to sell the conservation house, Barrilleaux said.", "url": "https://apnews.com/921b43854d874811bb7d98c2ed431eb6"}