{"authors": ["Jim Meehan"], "date_download": "2020-05-04 21:06:34", "date_modify": "2020-05-04 21:06:34", "date_publish": "2018-06-24 00:00:00", "description": "When the Spokane Empire ceased operations after the 2017 season, head coach Adam Shackleford thought his 35-year streak of involvement in football was coming to an end. He had held nearly...", "filename": "_cb3657f6a32e421886f576401f855e8c_1588626394.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cb3657f6a32e421886f576401f855e8c_1588626394.html", "title": "Life without arena football: Coaching job takes former Spokane Shock, Empire coach Adam Shackleford away from home base", "title_page": "Life without arena football: Coaching job takes former Spokane Shock, Empire coach Adam Shackleford away from home base", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When the Spokane Empire ceased operations after the 2017 season, head coach Adam Shackleford thought his 35-year streak of involvement in football was coming to an end.\nHe had held nearly every title – player, assistant coach, personnel director, offensive coordinator, head coach – but he wondered if it was time to stay on the sideline with his family firmly settled in Spokane.\nThen came the phone call from longtime friend Matt Stoute, coach of the IFL’s Nebraska Danger, offering the offensive coordinator position. Shackleford wasn’t about to uproot his wife, Migdalia, from her job or sons Elijah and Caleb from their West Valley schools, so the debate was if he wanted to coach again and live in a Grand Island, Nebraska, hotel separated from his family.\n“I talked to my wife about it and decided to give it 5 1/2 months and see what happens and where it might lead,” Shackleford said in a phone interview.\nShackleford and Pig Brown were elevated to co-head coaches when Stoute was dismissed in May. Shackleford’s center is Michael Boyefio, a former Empire player who teaches in Dallas and flies in for games.\nThe Danger (4-10) made the four-team playoffs in the six-team IFL. They were eliminated by Iowa on Friday.\nThe sacrifice for continuing his coaching career has been seeing his family for just five days during a bye week. He missed his youngest son’s birthday and when he was named student of the month. Shackleford’s sons are involved with wrestling and soccer. Dad watches from afar via FaceTime.\n“I always tell people FaceTime heals the mind but doesn’t heal the heart,” Shackleford said. “When Caleb is wrestling, I can hear my wife screaming in the background.”\nShackleford, 42, put down roots when he was hired as Shock head coach in 2007. He coached three seasons, winning one arenafootball2 title, but wasn’t retained when Spokane joined the AFL. Shackleford took over as head coach at IFL Tri-Cities while the family base remained in Spokane.\n“I put a lot of miles on my vehicle those six years,” he said. “I’d try to get back to watch a baseball game. There were a lot of meetings at Subway in Ritzville near the gas station.”\nShackleford considers Spokane “the greatest job I had, a destination for any coach to get to.” He doesn’t know what his coaching future holds, but he knows Spokane will always be home.\n“That’s not going to change,” Shackleford said.", "url": "https://apnews.com/cb3657f6a32e421886f576401f855e8c"}