{"authors": ["David La Vaque"], "date_download": "2020-05-04 20:05:14", "date_modify": "2020-05-04 20:05:14", "date_publish": "2018-01-11 15:37:53", "description": "Connor Kruse, a freshman offensive lineman at North Dakota, returned to his high school in Waconia in mid-December on break from classes but seeking quality football workouts. His alma...", "filename": "_23a175ade6fa461ba99fd8b80564b73e_1588622714.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_23a175ade6fa461ba99fd8b80564b73e_1588622714.html", "title": "Minnesota high schools pump up commitment to strength and conditioning", "title_page": "Minnesota high schools pump up commitment to strength and conditioning", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Connor Kruse, a freshman offensive lineman at North Dakota, returned to his high school in Waconia in mid-December on break from classes but seeking quality football workouts.\nHis alma maters new state-of-the-art weight room, a striking example of a growing commitment to strength and conditioning at the high school level, proved more than accommodating.\nYou can do all the workouts Ive been doing at North Dakota, said Kruse, a 6-6, 298-pound lineman.\nWaconia senior Tyler Wagener, who visited Augustana University in Sioux Falls and signed with the Vikings wrestling program, said his high school facility is definitely right there with Augustana. This weight room is nicer than most colleges.\nBig fellas such as Kruse once were a weight rooms main inhabitants. Likewise, a few repetitions of heavy weights once passed as a workout. No more. Weight rooms and workouts today must entice more athletes across a wider sports spectrum to prime their bodies. Training them requires a mix of universal movements and sport-specific workouts designed to improve performance.\nGreater emphasis on strength and conditioning has triggered changes in high school weight rooms throughout the metro area. More strength and conditioning coaches are pursuing national certification, allowing them to design and teach more efficient, athletic movement-based workouts. Doing so reduces athletes risk for injury in their sports, more important than ever in the age of specialization.\nThats become a major driver because parents dont understand sports-skill balance, said Wayzatas Ryan Johnson, named the 2017 High School Strength and Conditioning Coach by the National Strength and Conditioning Association. If you dont train outside your one sport, youre setting kids up for failure.\nFueled by hundreds of thousands of dollars of upgrades approved by voters in school bond referendums, weight rooms at Dassel-Cokato, Stillwater and Waconia have evolved to best accomplish these tasks. Others, including Farmington and Minneapolis Washburn, are reconfiguring existing spaces.\nIn all cases, strength and conditioning coaches are cutting the cord on pulley-and-cable machines in favor of more open, multipurpose space.\nTwo premiere facilities, Waconia and Wayzata, feature a swath of turf where student-athletes hone their movements. On either side are squat/bench press racks as well stations to accommodate Olympic lifts such as the power clean.\nWaconia installed Perform-X Training Systems to its racks and stations. Strength and conditioning coordinator Josh Anderson said the NFLs Tennessee Titans recently installed the band system, which helps maintain resistance throughout the full motion of an exercise.\nThere is a real wow in regards to whats happening now, said Anderson, who joined Ridgeview Sports Medicine and began working with Waconia in 2013. When you look at how far strength and conditioning has come, what we can do with athletes is amazing as long as you know what youre doing.\nBenefit to athletes\nWaconia junior Courtney Freeberg played up on the Wildcats basketball freshman team as an eighth-grader. When coaches encouraged her to get stronger and become a presence inside, Freeberg said, she initially worried that she would have to max out every time and be sore in the morning.\nThe workouts convinced her otherwise. Last summer she eased younger players nerves about hitting the weight room.\nYou are tired when you work hard for 45 minutes, said Freeberg, one of Waconias scoring leaders this season. They were sore, but it was a good sore, not like, I dont ever want to do this again.andthinsp;\nWeight rooms these days resemble laboratories where athletes can strengthen their bodies in myriad ways. Beyond pumping up beach muscles such as pectorals and biceps, athletes use a variety of repetitive movements, increasing weight gradually as they build overall strength and explosiveness.\nWagener, a Class 2A state champion at 145 pounds last year, credited Anderson for having a great workout program for us. Even for the days were feeling sore, hell have us do agility workouts to get lactic acid out. Its a lot smarter now and more efficient. I think its safer, too.\nFighting the unintended consequences of sports specialization muscle imbalances that lead to knee or arm injuries is a priority for Johnson, Wayzatas strength and conditioning coach. He stresses the need for strength and conditioning beyond sport-specific skill training.\nStrength and conditioning training makes you a better athlete, not just better in your sport, Johnson said.\nBy March of 2013, six Waconia girls basketball players had suffered ACL tears in a years time. Coach Carl Pierson said he told them about doing more with strength and conditioning but Josh brought it to the next level. No players have been lost to an ACL tear since, Pierson said.\nBigger, faster, stronger, better\nJohnson said the aim of strength and conditioning goes beyond lets win some games. But success within sports remains an important gauge of effectiveness.\nSt. Louis Park made its football state tournament debut last fall after its first winning season in more than three decades. Strength and conditioning coach Jessica Gust, in her eighth year, moved the focus of workouts from brute strength to efficient movements that sustain power.\nReaching the state tournament showed the buy-in, Gust said. They were dedicated to strength and conditioning as well as the development of their football skills. That built a community over time and when the season came along, they were ready to dive in and compete.\nAt Stillwater, assistant strength and conditioning coach Ryan McCauley said the girls lacrosse program at times outnumbered the bigger sports in the weight room. The Ponies have made seven consecutive state tournament appearances.\nFarmingtons Scott Meier, National High School Strength Coaches Association state director, said Lauren Petersons rise to become one of the states top distance runners coincided with getting in the weight room.\nInvestments in strength\nWhile lauding Waconias weight room, Anderson gushed, Weve got everything we could want.\nThe weight room upgrades, totalling about $250,000 for turf installation and new equipment, were part of a $75 million bond request approved by school district voters in 2014.\nStillwaters new Pony Activity Center, a 5,600-square foot weight training facility with an indoor track, was part of a $97.5 million voter-approved bond request.\nDassel-Cokato christened a new weight room in 2016, a $264,000 construction project made possible through fundraising, in-kind donations of time and materials and dollars from the school district capital budget.\nSt. Louis Park School District voters recently approved a $100.9 million bond referendum, a portion of which will go to updating the weight room. Farmington and Minneapolis Washburn are reconfiguring space to enhance their weight rooms.\nAs far as the inner city goes, we have one of the biggest spaces, said Tracy Byrd, a 1989 Washburn graduate who coached at Wayzata before returning this fall to direct strength and conditioning for the Millers football program. The facility is there to build soldiers. Now we just have to get them in there because success usually follows strength.\nMore strength and conditioning coaches are pursuing national certification such as Certified Strength and Conditioning Specialist through the National Strength and Conditioning Association.\nA certified strength and conditioning coach is just as important as a certified athletic trainer, said Amanda Berg, strength and conditioning coach at Dassel-Cokato.\nSaid Johnson said, As a profession, were getting better. Twenty years ago, the football coach unlocked the door to the weight room and told players, Get stronger. Now, coaches are saying to strength and conditioning coaches, Teach us how to get stronger.andthinsp;", "url": "https://apnews.com/23a175ade6fa461ba99fd8b80564b73e"}