{"authors": ["Chuck Landon"], "date_download": "2020-05-04 20:27:53", "date_modify": "2020-05-04 20:27:53", "date_publish": "2018-01-23 10:06:02", "description": "Welcome to \"Second Guess\" Tuesday. Here are the opinions du jour. • It appears Marshall's football program is indeed interested in bringing in a graduate transfer quarterback.", "filename": "_ba0f661b493343c9be5e7a136a59a234_1588624073.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ba0f661b493343c9be5e7a136a59a234_1588624073.html", "title": "MU looking at graduate transfer quarterbacks", "title_page": "MU looking at graduate transfer quarterbacks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Welcome to “Second Guess” Tuesday.\nHere are the opinions du jour.\n• It appears Marshall’s football program is indeed interested in bringing in a graduate transfer quarterback.\nThat premise was suggested in this space a week ago because Marshall’s front-runner to become the starting quarterback in 2018 is Isaiah Green, a redshirt freshman who never has taken a snap in a game.\nThe Herd obviously needs someone with experience.\nApparently, Marshall’s coaching staff agrees, based on a recent entry on Yahoo Sports.com sports writer Pete Thamel’s Twitter account. He wrote that Alex Thomson, 6-foot-5, 225-pound quarterback from Keyport, N.J., who has gotten his release from Wagner College in Staten Island, N.Y., “has gotten calls from Alabama, Marshall and Baylor.”\nThamel also noted that Tennessee has offered a “blueshirt” to Thomson, who has two years of eligibility remaining. FIU and Oregon State also have shown interest.\nThomson, who reportedly will graduate in the spring with a 3.55 GPA, is considered a bona fide NFL prospect.\nOf course, he’s not the only graduate transfer quarterback available. Since I listed seven others last week who are on the market, at least one more has joined the group.\nMiami Hurricanes’ backup quarterback Evan Shirreffs announced he is looking for a new school. The 6-5 Shirreffs is a native of Jefferson, Ga., was recruited by Marshall in high school and has two years of eligibility remaining.\nSo, perhaps, Marshall will be able to sign a graduate transfer quarterback and allow Green to gain some experience while serving as the backup.\nIt certainly would be a smart move.\n• Who should West Virginians pull for in Super Bowl LII?\nIt’s a no-brainer.\nThe Philadelphia Eagles have nine Mountain State connections on their roster and coaching staff. New England? The Patriots have one.\nMarshall fans everywhere are well aware of former Herd standout Vinny Curry, who starts in the defensive line for the Eagles. The 6-3, 279-pound Curry is in his sixth year with Philadelphia.\nBut there’s also a connection with starting cornerback Ron Darby Jr. The 5-11, 193-pound third-year pro is the son and namesake of former Marshall star running back Ron Darby. The elder Darby is a member of MU’s Hall of Fame and once rushed for 262 yards in a game.\nAnother Herd connection is assistant quarterbacks coach Press Taylor. The fourth-year coach was a quarterback at Marshall for two years.\nThen, there are four more connections, who played for WVU.\nThey include sixth-year linebacker Najee Goode, second-year running back Wendell Smallwood, rookie corner back Rasul Douglas and rookie wide receiver Shelton Gibson.\nBut, wait, there’s more.\nLook at the Eagles’ practice squad and there’s a pair of rookies from Shepherd University in the Eastern Panhandle.\nTre Sullivan is a 6-0, 200-pound safety and Billy Brown is a 6-4, 255-pound tight end.\nSo, there it is – nine West Virginia connections.\nNew England’s one is well-documented. He is veteran wide receivers coach Chad O’Shea, who was a quarterback at Marshall in 1991 and ’92.\nI don’t know about everybody else, but a 9-to-1 margin makes it easy for me to decide who to pull for February 4 in Minneapolis.\nGo, Eagles.\n• It was no fluke.\nMarshall’s “sweeps week” victories over Middle Tennessee and UAB weren’t based on breaks or luck. The Herd simply made it happen with a generous dose of defense.\nMU is capable of beating anyone on its schedule.\nChuck Landon is a sports columnist for The Herald-Dispatch. Contact him at clandon@herald-dispatch.com.", "url": "https://apnews.com/ba0f661b493343c9be5e7a136a59a234"}