{"authors": ["Joanne Barkan", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul S. Adler", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips"], "date_download": "2020-05-04 19:57:53", "date_modify": "2020-05-04 19:57:53", "date_publish": "2018-06-12 00:00:00", "description": null, "filename": "2018_06_us-public-schools-charters-vouchers-privatization_1588622273.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/06/12123036/school.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_06_us-public-schools-charters-vouchers-privatization_1588622273.html", "title": "Death by a Thousand Cuts", "title_page": "Death by a Thousand Cuts", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThis article is dedicated to Paul Booth, 1943–2018.\nWhen champions of market-based reform in the United States look at public education, they see two separate activities — the government funds education and the government runs schools. The first is okay with them; the second is not. Reformers want to replace their bête noir — the “monopoly of government-run schools” — with freedom of choice in a competitive market dominated by privately run schools that get government subsidies. Public funding, private management — the four words sum up American-style privatization whether applied to airports, prisons, or elementary and secondary schools. In the last twenty years, the “ed-reform” movement has assembled a mixed bag of players and policies, complicated by alliances of convenience and half-hidden agendas. Donald Trump’s election and his choice of zealot privatizer Betsy DeVos as US secretary of education bolstered reformers but has also made more Americans wary. What follows is a survey of the controversial movement — where it came from, how it grew, and what it has delivered so far to a nation deeply divided by race and class.\nThe Backstory in Brief In the latter decades of the nineteenth century, consensus grew around an expansive vision of education in which government plays a far-reaching role: schooling should be government funded and administered, universal, and compulsory until a certain age. In a nation that was increasingly industrialized and home to new immigrants, citizens expected public schools to accomplish a great deal, including impart general knowledge and practical skills, prepare young people psychologically and socially for self-sufficient adult lives, educate for democratic citizenship, unify a diverse population, and create opportunity for upward mobility. Over time, many Americans came to regard public education as a mainstay of democracy. The US constitution makes no mention of education, so the federal government had no specified role to play. Since the earliest days of the republic, local and state authorities shaped elementary and secondary (K-12) public education. Racial segregation in schools, which became the law in seventeen states and the norm almost everywhere else, was also a local and state matter. This did not change until 1954 when the US supreme court ruled that racially segregated public schools were “inherently unequal” and therefore unconstitutional (Brown v. Board of Education of Topeka). When the federal government stepped in to enforce school desegregation, it met with fierce resistance. After several years of minimal progress, federal authorities resorted to court-ordered desegregation plans, which they imposed on school districts across the country, not only in the South. For the first time, government at the highest level assumed a significant role in K-12 schooling. In the mid-1960s and 1970s, the federal role expanded to include protecting the civil rights of all students and offering financial assistance to public schools with high percentages of low-income students. In the 1980s, the political climate shifted. An international renaissance of laissez-faire economics, updated as “neoliberalism,” challenged the dominant Keynesian model of regulated markets. Governments around the world began to act on a suite of neoliberal principles: competition and choice in the free market are the best organizing principles for most human activity because they produce greater efficiency and higher quality; the role of government is to provide a framework that allows the market to function freely; most other government activity merely clogs the system with bureaucracy and special interests. Ruling elites believed that implementing these principles would solve high inflation, stagnation, unemployment, low productivity, and whatever else was ailing an economy. Neoliberalism led logically to specific policies such as cutting taxes and government spending, deregulating the economy, and transferring as much government activity as possible to the private sector, including education. And when government funding is necessary to get something done, states turned management over to the private sector. The ideological shift to neoliberalism was rapid and widespread. This was the age of Britain’s Margaret Thatcher and the US’s Ronald Reagan — two world leaders who aimed to revolutionize economic policy at home and abroad. Governments around the world embraced austerity, deregulation, and privatization. Consider, for example, some major nationalized industries that were privatized in the 1980s: British telecommunications (1984), Spain’s car manufacturer, SEAT (1986), New Zealand Steel (1987), Japanese National Railways (1987), and Air Canada (1988), to name just a few.\nNeoliberalism’s Education Guru One of neoliberalism’s major thinkers and its most successful popularizer was economist Milton Friedman (1912–2006), who advised Reagan during the 1980 presidential campaign and joined his Economic Policy Advisory Board in 1981. On education policy, Friedman never deviated from the model he presented in his 1955 essay, “The Role of Government in Education.” He proposed that government get out of the business of running schools altogether. Instead it should fund a voucher worth the same amount of money for every school-age child to use at his or her choice of private school. In the real world, the poor buy necessities at a price they can afford even if the quality is inferior. This is why the free market has always failed to meet the real needs of low-income people; they get what they can pay for. For Friedman, the choices would include private for-profit schools, private nonprofit schools, religious schools, and “some even” run by the government. A democratic society, he reasoned, requires “a minimum degree of literacy and knowledge on the part of most citizens.” Hence government has a legitimate interest in requiring and paying for what the community decides will be the necessary “minimum amount of education.” But government running schools is not “justifiable in its own right in a predominantly free enterprise society.” In this marketized system, competition would, theoretically, eliminate low-performing schools because they wouldn’t attract enough customers to stay in business. In the real world, the poor buy necessities at a price they can afford even if the quality is inferior. This is why the free market has always failed to meet the real needs of low-income people; they get what they can pay for. In a school voucher system, wealthy families can (and will) add as much money as they want to their vouchers to pay for their choice of schools; middle-income families will pull together whatever resources they can for the best schools in their price range. Low-income families without additional resources will “choose” schools charging the value of the voucher. Almost no higher quality schools will be available because they will have no incentive except altruism to offer their products at the minimum price. (For example, the value of a government voucher for high school in Washington, D.C. in 2016–17 was $12,679 while tuition at Washington’s elite private schools exceeded $40,000 a year.) As a last resort, low-income families could choose a “government school.” For free-market ideologues, government schools are always a last resort and available to the poor. Many Southern states anticipated the 1954 Brown school desegregation decision and prepared policies to evade racial integration. Between 1954 and 1959, eight states adopted what were whites-only versions of Friedman’s voucher system. They used public funds to pay for white students to attend all-white private schools, which were called “freedom of choice schools” or “segregation academies.” States also leased unused public school property to private schools. Shortly before publication of his 1955 essay, Friedman added a footnote to address the segregationist versions of “essentially this [i.e. his own] proposal.” He argued that both forced segregation and “forced non-segregation” were evil. His solution for the South and everywhere else was publically funded vouchers used for “exclusively white schools, exclusively colored schools, and mixed schools. Parents can choose which to send their children to.” Friedman’s essay prefigured the indifference of today’s pro-market reformers to racial segregation in education as long as the tradeoff is private schools. The essay still functions as a touchstone for them.\nSowing the Seeds of Market-Based Reform Education policy advisers in Reagan’s administration hoped to wean Americans off public schools while also weakening the teachers’ unions, which were a significant source of power for the Democratic Party. Starting the weaning process required convincing Americans that public education was failing. In 1983 the administration released A Nation at Risk, a report aimed at generating support for radical reform. The rhetoric was hyperbolic: “The educational foundations of our society are presently being eroded by a rising tide of mediocrity that threatens our very future as a Nation and a people.” Apocalyptic claims were backed up by what one researcher called “a golden treasury of spun statistics.” The media hyped the report to the point of stoking a panic about failing schools. Politicians across the political spectrum called for higher standards, better test results, and greater performance accountability from public schools. Conservatives simultaneously aimed for deep spending cuts. The sky-is-falling panic about public schools and the “standards and accountability” demands attracted bipartisan support. Neoliberal thinking had influence far beyond ideological devotees. It tinged political moderates, self-identified liberals, media people, and think-tank opinion makers. It permeated what became the dominant wing of the Democratic Party — the “New Democrats.” Their jargon included choice, competition, efficiency, and downsizing government; they often competed with Republicans for pro-market credibility. The mainstream political world seemed to slide easily from the ostensible goal of racial integration to aiming for something like ‘separate but improved’ for low-income minority children. In the 1990s, the escalating drive for tougher education standards, better test scores, and more accountability coincided with a declining commitment to racial desegregation. Public school integration, on the rise since the mid-1960s, peaked in 1988 when 43.5 percent of all black students attended schools that were at least 50 percent white. Although research showed that integrated schools narrowed the achievement gap between minority and white students without harming the latter, the dedication of most government officials to proactive desegregation had dissipated. Decisions of the US Supreme Court in 1991, 1992, and 1995 made it easier for school districts to abandon their court-ordered plans. Resegregation began immediately. In just ten years, the percentage of black students attending schools that were at least 50 percent white dropped to 32.7 percent. By 2011 that figure had fallen to 23.2 percent. Highly segregated schools attended by low-income minority students were notoriously under-resourced compared to public schools attended by white middle-class and wealthy students. Schools in poor urban neighborhoods needed much greater support. Moreover, although the achievement gap between minority and white students had been narrowing, it still existed. Politicians might profess a commitment to reducing racial inequality, but most acted within neoliberal boundaries and with no interest in pushing integration further. Glorification of the market along with the vogue for standards and accountability led to a new approach: government could commit to improving education for low-income minority students with market tools while leaving schools segregated. The mainstream political world seemed to slide easily from the ostensible goal of racial integration to aiming for something like “separate but improved” for low-income minority children. Government would hold public schools to high standards, monitor how well they were doing, and help students in inadequate public schools move to better schools of their choice. The primary measure of school quality would be student scores on standardized tests despite the fact that most education scholars agreed the scores reveal little about education success. Thus the seeds for twenty-first-century market-based reform were sown.\nBuilding a Movement From the Top Down Neoliberal innovations in education policy took hold slowly. Reagan proposed several voucher-type programs, but they died in Congress. He did, however, cut the federal government’s portion of total public education spending from 12 percent to 6 percent. The George H. W. Bush administration (1989–1993) produced no major education laws although some policy ideas were picked up by Bill Clinton (1993–2001). In 1994 Clinton signed the Improving America’s Schools Act, which provided federal funds to states to create a new type of school: publicly funded, privately operated “charter schools.” They would have more autonomy than district (traditional) public schools and, advocates claimed, be more innovative. The first charter school in the United States had opened in St. Paul, Minnesota, in 1992 under state law. Clinton’s Improving America’s Schools Act was designed “to increase the number of charter schools nationwide.” In 1999 Florida’s governor Jeb Bush (the former president’s son) signed into law the nation’s first statewide voucher plan. Still in operation, the Florida Opportunity Scholarship Program allows students in “failing” public schools to use state funds to pay for private schools, including religious schools. After the turn of the twenty-first century, pro-market ed-reformers began to attract enough support and funding to build organizations and to operate like, or at least look like, a movement. Charter schools and voucher programs appealed to conservatives and centrists of all stripes but few progressives. By 2010 “reform-think” dominated the national conversation on K-12 education. Still, market-based reform never became a grassroots movement. It attracted elites: billionaire philanthropists, private mega foundations, finance and high-tech entrepreneurs, politicians at every level of government, business leaders, media figures, and think-tank associates. The players have been overwhelmingly white; their methods consistently top-down. Notably missing have been teachers, school administrators, parents, and students. With elite support, ed-reformers collected enough money to build an ed-reform industry of organizations employing same-thinking researchers, program designers, consultants, lobbyists, campaign organizers, and media producers. A cadre of super-wealthy donors regularly gives millions of dollars to pro-ed-reform candidates for state and local offices; they fund ballot initiatives around the country and pour hundreds of thousands of dollars into local school board races. The right-wing American Legislative Exchange Council (ALEC), which drafts model legislation for conservative state lawmakers, has been an important ally of the ed-reform movement. Some states have adopted ALEC model education legislation verbatim. Help also came from the White House. George W. Bush (2001–9) advanced both charter schools and vouchers. His signature education law, No Child Left Behind (signed in 2002), established that students in low-testing, low-income public schools could transfer within their district to another public school or to a charter school. In 2004 Bush signed into law a voucher program that Congress designed for Washington, DC (Congress has final jurisdiction over the District of Columbia). The Opportunity Scholarship Program offers every low-income student in DC a federally funded voucher to use at a participating private school, secular or religious. Barack Obama (2009–2017) opposed school vouchers, but he quickly became charter-advocate-in-chief. In the depths of the “great recession” in 2009, his Department of Education (DOE) launched a $4.35 billion competitive grant program called Race to the Top. The rules stipulated that each competing state submit a public school reform plan, taking into account a long list of DOE pet policies. States that scored highest on the DOE’s point system would win millions of dollars to implement their plans. DOE criteria included not limiting the growth of charter schools (some states had capped the number). States were also required to give charter schools free use of public facilities or help charters pay for facilities. Public school supporters fiercely opposed the measures because they diverted resources from already stretched-to-the-limit education budgets. But state governments were desperate for money from anywhere; all but four eventually entered the contest. Obama’s Race to the Top gave the entire charter school enterprise a substantial boost.\nAnatomy of Vouchers and Charter Schools Both voucher programs and charter schools channel public funding to private entities but in different ways. When students receive a government-funded voucher for a set amount of money, they give the voucher to a private or religious school as payment or partial payment for tuition. All the taxpayer funds that end up in private and religious schools are funds no longer available for public education. In the charter school system, the private entities that run the schools receive an allotment of public funds for each student who enrolls. The allotments are transferred directly from district schools to the charter schools, shrinking the district public school budgets. The public schools are left with the same fixed expenses but fewer students and therefore less money coming in. They almost inevitably deteriorate: a school that could previously afford, say, a librarian, art teacher, nurse, or smaller classes can no longer cover costs. Ed-reformers do not promote vouchers and charter schools to the public as strategies to privatize public education. Instead, they pitch their reforms as ways to create choice in K-12 schooling. Reformers claim that charter schools and vouchers give low-income students “trapped” in low-performing schools new choices, and thus their parents — like wealthy parents — have the power to choose the schools they know are best for their children. Who could object? Reformers have successfully made “choice” the subject of the policy debate. A candid description of vouchers and charter schools — for example, these policies drain public funds from district public schools and channel the money to private entities student by student, school by school — would attract little support (see the analysis of public support below). While conservatives consciously aim to shift control over K-12 education from government to the private sector, moderates in the ed-reform camp do not have privatization as their main goal. Instead, they want to move as many students as possible, as quickly as possible, out of low-testing schools. They see their twenty-year-old alliance with conservatives as tactical. Yet not only have they ended up buttressing conservatives politically, they practice a kind of triage without thinking through the consequences. By steadily draining resources from district public schools, they undermine the very schools that the overwhelming majority of American children, including low-income children, still attend. Both conservatives and moderates call school choice “the civil rights issue of our time.” Charter schools claim to be public schools because they receive taxpayer money and, in theory, are overseen by state-approved authorities. But private-sector entities — boards of directors and charter management organizations (CMOs) — manage the schools and control finances. Private management, which can be for-profit or nonprofit, allows charter schools to avoid the transparency and accountability required of district public schools. When the public or press asks for documentation, managers can claim private status. They regularly refuse access to their financial records, data, and internal communications — information that public entities are required to make available. In September 2017, for example, investigative reporters requested some emails from Eva Moskowitz, CEO of Success Academy Charter Schools, Inc., a CMO that runs forty-six schools in New York City. The company’s lawyer responded that the CMO “is not itself a charter school or a government agency . . . it is not in and of itself subject to FOIL [Freedom of Information Law] or required to have an appeal process.” Charter school lobbies press state governments for as little supervision as possible. For example, in California, where over 1,200 charter schools operate, government audits are neither regular nor proactive; they take place only when a county official suspects fraud and requests an audit. Some 90 percent of charter schools nationwide are not unionized, so unions cannot provide general oversight. Predictably, inadequate transparency and oversight have led to widespread malfeasance in the sector. Pro-market reformers also champion online (virtual) schools, most of which are privately run, for-profit, and notably lucrative. They use the same funding mechanism as charter schools — the operators get public funds for each child who signs up — but they do not have to maintain buildings, provide transportation, or pay for full staffs. One teacher can follow scores, even hundreds, of students as they tap their way through digital lessons on their own computers.\nCharter School Performance According to the National Alliance for Public Charter Schools (2017), charter enrollment increased from 1.2 million students in 2006–7 to an estimated 3.1 million in 2016–17. The number is still tiny compared to the overall size of the US K-12 system. For example, the federal government projected that about 50.7 million students would attend public and charter schools in fall 2017; about 5.2 million would attend private schools. In addition, about 1.7 million were homeschooled in 2016. But charter schools are highly concentrated geographically and wield substantial political clout. About 92 percent of K-12 students in New Orleans attend charter schools; 53 percent in Detroit; and 45 percent in the District of Columbia. Charter networks run well-funded lobbying efforts in most states. As of November 2017, only six states did not allow charter schools. To justify the existence of charter schools, ed-reformers have always claimed they outperform the district public schools that most low-income and minority students attend. Indeed, unless charters perform better, they serve no purpose other than choice for the sake of choice regardless of quality. To measure performance, both government and ed-reformers still rely on student scores on standardized tests. Since 2009 a pro-privatization research center at Stanford University has regularly conducted nationwide studies comparing the test scores of charter school students to the scores of demographically similar students at district public schools. As for the higher-performing charter schools, research has shown they often boost test scores by ‘counseling out’ the most challenging students — those with cognitive and physical disabilities, behavior problems, and English language learners. The studies have generated a fairly consistent, albeit very rough, picture of average performance nationwide: about one half of all charters perform at the same level as district schools, about one quarter perform worse, and about one quarter perform better although often by minuscule amounts. A much clearer picture of performance comes from state and district studies, not national averages. In 2016, for example, a study of charter schools in Texas found that “at the mean, charter schools have no impact on test scores and a negative impact on [future] earnings.” These mediocre results fall far short of reformers’ claims and hardly justify undermining district schools. As for the higher-performing charter schools, research has shown they often boost test scores by “counseling out” the most challenging students — those with cognitive and physical disabilities, behavior problems, and English language learners. These students remain in district schools, increasing the concentration of at-risk students in precisely the districts that have lost funding to charter schools. In the 2013–14 school year, the Budget, Facilities, and Audit Committee of the Los Angeles Unified School District (LAUSD) reported that 1.2 percent of charter school students were severely disabled; the figure for LAUSD overall was 3.8 percent — more than three times as large. In December 2017, the American Civil Liberties Union of Arizona released the results of its investigation of 471 charter schools, which found that 56 percent had enrollment policies that clearly violate the law or discourage at-risk students. For example, Spanish is the most commonly spoken language after English, but only 26 percent of these schools provide enrollment documents in both languages. Attrition rates — that is, how many students drop out of a school or class in a given period — are strikingly high for high-testing charters. In 2006 Eva Moskowitz launched Success Academy Charter Schools, Inc. with seventy-three first graders. In 2018 this class became the first to graduate from the academy’s high school, but only seventeen of the early enrollees remained — an attrition rate of 77 percent.\nA Closer Look at Vouchers The goal of staunch voucher advocates is to replicate the system that Milton Friedman proposed in 1955: a taxpayer funded voucher for every student to use in a free market of secular and religious private schools. Several states now offer vouchers to all families regardless of income, but public support for such “universal” programs is low. To get around this obstacle, ed-reformers promote programs limited to low-income students, students in low-performing schools, or students with special needs. They have also devised several variations on vouchers, all of which channel public funds to private schools but avoid using the unpopular “v” word. “Private-school tuition tax credits” allow families to subtract the cost of tuition from the taxes they pay; “tax-credit scholarships” give tax credits to donors (corporations included) who fund scholarships for other people’s children to attend private schools. Donors cycle their money through private nonprofit “school tuition organizations” (STO). Rerouting the money this way, reformers argue, prevents any violation of the separation of church and state: the STO “middleman” separates the government funding (the tax credit) from the religious institution (the school). In reality, the process works like money laundering: funds pass through a private entity and arrive at a religious school scrubbed clean of their taxpayer origin. Another tool — “education savings accounts” — gives families government-funded debit cards to use for various private education expenses in addition to tuition. According to the Milton and Rose Friedman Foundation (which changed its name in 2016 to the less politically charged EdChoice), there were sixty-four voucher and voucher-type programs in thirty states and the District of Columbia as of January 2018. Most of the money ends up at religious schools. For example, 82 percent of the nearly one hundred thousand students in the Florida Tax Credit Scholarship Program chose religious schools in 2017. Republicans, who control a large majority of state governments as well as the White House and Congress, aim to expand voucher programs. Paradoxically, the promised expansion comes after the release of several studies showing that voucher programs actually hurt student performance. In late 2015, researchers reported that Indiana’s “voucher students who transfer to private schools experienced significant losses in achievement” in math and no improvement in reading. In June 2016, a study of a large Ohio voucher program, published by the pro-reform Thomas B. Fordham Institute, found: “The students who use vouchers to attend private schools have fared worse academically compared to their closely matched peers attending public schools . . . Such impacts also appear to persist over time . . . .” Voucher supporters (Milton Friedman included) have always assumed that transferring from a public school to a private school would mean transferring to a better school. But in recent years, public schools in the United States have closed the achievement gap with private schools. Since government vouchers never cover the cost of higher quality private schools, most low-income students end up at schools that are academically no better or even worse than the public schools they leave.\nCorruption and Segregation Both charter school management and voucher programs are rife with fraud. It comes with the territory when states hand out millions of dollars to private-sector actors without adequate vetting or ongoing oversight. The pro-public-school Network for Public Education posts a feature on its website called ANOTHERDAYANOTHERCHARTERSCANDAL, which keeps a running account of charter misconduct along with links to source material. Here are a few typical scandals from a four-week period in fall 2017: The founder and former administrator of Southwest Learning Centers, which ran four charter schools in Albuquerque, NM, pleaded guilty to pocketing over $2 million by having his schools pay fake invoices to a fake company he set up in Las Vegas; he also billed parents for online credits that their children never earned and charged his schools double the actual rent for a building he leased. The Pennsylvania Ethics Commission fined the former CEO of the defunct Pocono Mountain Charter School in Coolbaugh Township for four years of deficient financial statements. The commission also cited him for asking the charter board to raise his wife’s salary at the school and hire his children for school positions. The former principal of a Delaware charter school — the Academy of Dover — pleaded guilty to embezzling $145,480. The case went to federal court “due to the significant [federal] funding received by the Academy of Dover.” The case of Ohio’s Electronic Classroom of Tomorrow (ECOT) — once Ohio’s largest online charter school — epitomizes the corruption in the virtual charter sector. ECOT was notorious for its low graduation rate (under 39 percent in 2014) and its dropout numbers (the highest in the nation, according to federal data). But despite the school’s abysmal performance, Ohio’s Republican establishment gave it unwavering support. According to an exposé in Mother Jones magazine, ECOT’s founder and the CEO of its management company, William Lager, took home about $153 million from the school between 2000 and 2017. In the same period, he contributed $1.9 million to political candidates, mostly Republicans. In 2016 and 2017, the state’s Department of Education found that ECOT had overcharged taxpayers about $80 million in just two years for “truant” students — students who had not logged into the online instruction system for even the required minimum of once every thirty days. On January 18, 2018, the board overseeing ECOT voted to close the school immediately because it could not repay its $80 million debt. ECOT’s twelve thousand students were left scrambling to find places at other schools — a problem created whenever a charter school suddenly shuts down. Voucher corruption looks like this: The Arizona Christian School Tuition Organization (ACSTO) is one of the state’s largest groups giving out vouchers, called tax credit scholarships, for private schools. From 2010 to 2014, private donors contributed $72.9 million to ACSTO. Arizona law allows families of all income levels to use these vouchers; it also allows voucher granting groups to keep 10 percent of all donations to cover overhead. ACSTO’s founder and executive director, Steve Yarbrough, is also president of the Arizona State Senate and a longtime voucher promoter. ACSTO outsources much of its work — from data entry to customer service — to HY Processing, a private for-profit company owned by Yarbrough, his wife, and another couple. ACSTO also pays $52,000 a year in rent to its landlord, who is Yarbrough. When Yarbrough bought a $16,000 car in 2012, ACSTO reimbursed him for the full amount. Vouchers and charter schools create still another problem: they increase racial and socioeconomic segregation. A March 2017 report by the Century Foundation, which analyzed longitudinal data from the Milwaukee Parental Choice Program, found that 68.4 percent of voucher-participating private schools had enrollments that were either 90 percent white or 90 percent black. Overall, 90 percent of voucher transfers “increased segregation in private schools, public schools, or both sectors.” According to a 2016 comprehensive report by the Brookings Institution, “charter schools enroll more black and poor students than traditional public schools in the same areas and are more likely to be at one extreme or the other of the racial and economic demographic spectrum than traditional public schools.” In the 2016–17 school year, charter students comprised about 6 percent of the combined enrollment of all district and charter schools nationwide; the figure for black students was over 12 percent.", "url": "https://www.jacobinmag.com/2018/06/us-public-schools-charters-vouchers-privatization"}