{"authors": ["David Sherfinski The Washington Times"], "date_download": "2020-05-04 20:11:02", "date_modify": "2020-05-04 20:11:02", "date_publish": "2018-01-10 10:10:34", "description": "Tom Donohue, president and CEO of the U.S. Chamber of Commerce, on Wednesday said the GOP's recently passed $1.5 trillion tax-cut plan is poised to usher in a \"new era of growth\" for the U.S....", "filename": "_9f52496594ab64451b0bdb9dab5da25b_1588623062.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9f52496594ab64451b0bdb9dab5da25b_1588623062.html", "title": "Tax bill will usher in 'new era of growth'", "title_page": "Tom Donohue, U.S. Chamber of Commerce CEO: Tax bill will usher in 'new era of growth'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tom Donohue, U.S. Chamber of Commerce CEO: Tax bill will usher in ‘new era of growth’\nTom Donohue, president and CEO of the U.S. Chamber of Commerce, on Wednesday said the GOP’s recently passed $1.5 trillion tax-cut plan is poised to usher in a “new era of growth” for the U.S. economy, which he said is already feeling the effects.\n“The final package wasn’t perfect, but it was pretty darn good, and achieved our priorities of lowering rates for all businesses, instituting an international competitive system of taxation ... and allowing for full expensing of capital expenditures,” Mr. Donohue said at the chamber’s annual “State of American Business” address.\n“Most important, it will usher in a new era of growth for the American economy,” he said.\nHe said upon passage, a number of businesses immediately announced plans to raise wages, give bonuses, and boost charitable giving.\n“All thanks to the expected gains not ones they’ve already received from a more competitive and productive tax system,” he said.\nMr. Donohue said the state of American business is “strong and positioned to grow stronger still,” saying the Trump administration has also made great strides in rolling back federal regulations.\nHe said the business lobbying group supports reforms to trade agreements such as the North American Free Trade Agreement (NAFTA).\nBut he warned the Trump administration against an outright withdrawal, saying such a move would be a “grave mistake.”\n“The American economy has taken several big steps forward with regulatory relief and tax reform, and this administration deserves lots of credit. But a wrong move on NAFTA would send us five steps backwards,” he said.\nMr. Donohue also called for immigration reform, saying lawmakers need to address certain immigrants at risk of deportation, such as spouses of high-skilled visa holders and so-called “Dreamers” who have been protected under the Deferred Action for Childhood Arrivals (DACA) program.\n“These now hard-working individuals contribute their talents to our economy in integral ways, and we will lose them, too, if Congress doesn’t act soon to resolve this problem,” he said.\nThe Trump administration had given Congress a March deadline to come up with a DACA solution, though a federal judge in California blocked the administration’s planned phaseout in a ruling late Tuesday.\nMr. Donohue also said 2018 needs to be the year of major infrastructure investment, and that the chamber would put forward some proposals on that subject next week.", "url": "https://apnews.com/9f52496594ab64451b0bdb9dab5da25b"}