{"authors": [], "date_download": "2020-05-04 20:04:25", "date_modify": "2020-05-04 20:04:25", "date_publish": "2018-04-06 06:18:00", "description": "With a heavy downpour in the forecast for today, Sutter High scrambled to complete the Sutter Spring Classic on Thursday by scheduling a full slate of games at Sutter, Colusa and...", "filename": "_66d7d875925a439b98f4d1849a3558dc_1588622665.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_66d7d875925a439b98f4d1849a3558dc_1588622665.html", "title": "PREP ROUNDUP: Wheatland takes second, Gridley finishes third at rain-shortened Sutter Spring Classic", "title_page": "PREP ROUNDUP: Wheatland takes second, Gridley finishes third at rain-shortened Sutter Spring Classic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "With a heavy downpour in the forecast for today, Sutter High scrambled to complete the Sutter Spring Classic on Thursday by scheduling a full slate of games at Sutter, Colusa and Marysville.\nLeading the list of local schools at the 20-team tournament was Wheatland, which beat University Prep in nine innings in the semifinals before running out of pitching in a loss to Winters in the championship game.\nWheatland and University Prep were tied at the end of seven innings before the Pirates earned a 5-3 victory by scoring a pair of runs in the top of the ninth. Chanse Davis drove in the first run with an RBI double and Chad Wilkins came through with a sacrifice squeeze to give Wheatland some breathing room heading into the bottom half of the inning.\nLogan Tapp went 2 for 5 with a solo home run, Jonathan Polecat hit an RBI single and Jordan Getz singled and scored on a wild pitch to account for the Pirates’ other runs.\nTrapp also earned the win by striking out five and allowing one run on three hits over four innings of relief. Getz pitched the first five innings and allowed six hits and struck out six.\nThe win propelled the Pirates into the championship game, but they didn’t have much left in the tank and were held to one hit in a 13-0 loss to Winters in a contest that was called after five innings due to the 10-run rule. Josh Barrick singled for the lone hit as Wheatland ended the tourney with a 3-1 record.\nThe Pirates (6-7) will jump back into league play next week when they host Corning in a Butte View League/Westside League crossover game on Tuesday.\nWinters 7, Gridley 0\nGridley 12, University Prep 2, 5 inn.\nIn Sutter – The Bulldogs were limited to only two hits in a shutout loss to Winters in the semifinals before bouncing back to beat U-Prep to finish third at the Sutter Spring Classic with a 3-1 record.\nKellen Brothers pitched well in the loss to Winters by allowing only two hits and one earned run over five innings of work. He struck out six and left with Gridley trailing 2-0 before the Warriors erupted for five runs in the sixth inning to pull away for good.\nLance Santerre and Frank Leyva both singled to account for Gridley’s two hits.\nThe Bulldogs had little trouble scoring runs in the second game as they scored early and often to beat University Prep by the mercy rule.\nTriston Platter finished 3 for 3, Robert Peters went 2 for 4, and Ty Cota and Brian Wilkerson both doubled and drove in two runs to supply the bulk of the offense. Jace Villapania also hit a double, and Cota earned the win on the mound by striking out six and allowing no earned runs on three hits over five full innings.\nGridley (13-2-1) will host Paradise in a BVL/WSL crossover game on Tuesday.\nSutter 2, Lassen 2\nSutter 10, Oroville 3\nIn Sutter – The host Huskies capped off the Sutter Spring Classic with a 2-1-1 record after tying Lassen and beating Oroville on the final day of tourney play.\nDante Caracciola turned in a strong pitching performance in the tie against Lassen, striking out 10 and scattering five hits over six innings of work in a game that was called after seven innings due to time constraints.\nAustin Dorman hit an RBI single to account for one of Sutter’s six hits, while Zachary McDaniel walked with the bases loaded to account for the team’s other run.\nThe Huskies bounced back from the tie by recording eight hits in the win over Oroville. Todd Carr went 2 for 4 with two RBIs, Zach Yacavace was 2 for 4 with an RBI, Caracciola finished 2 for 3 with a double and McDaniel knocked in a pair of runs to lead the way offensively in the victory.\nMcDaniel also picked up the win by striking out seven and allowing five hits and two earned runs over six innings.\nSutter (10-4-1) will host Las Plumas in a BVL/WSL crossover game on Tuesday.\nColusa 9, Durham 1\nColusa 11, Rio Vista 5, 5 inn.\nIn Colusa – The RedHawks completed a 3-1 run at the Sutter Spring Classic by winning two games on their home field.\nClayton Angus went 2 for 4 with three RBIs and Blake Steidlmayer was 2 for 3 and scored twice in the victory over Durham in the first game of the day. Freshman lefty Drew Bradbury continued his strong season by striking out six and allowing no earned runs in a complete-game effort to earn the win on the mound.\nColusa followed up that win by pounding out 14 hits in a victory over Rio Vista in a game that was limited to only five innings due to time contraints.\nEthan Rakela finished a perfect 3-for-3 with three RBIs and Leo Guzman was 2 for 3 with three RBIs of his own to help lead the offensive onslaught. Cody Free also went 3 for 3 and drove in a pair of runs, Raymond Frias was 2 for 3 and scored twice, and Angus chipped in with another 2-for-3 showing to round out the leaders.\nThe RedHawks (13-2-1) return to Sacramento Valley League play next week with a key two-game series against Winters starting Tuesday on the road.\nLas Plumas 11, Marysville 8\nMarysville 7, Willows 4\nIn Marysville – The Indians finished the Sutter Spring Classic with a 2-2 record after splitting their two games at home at Weldon Field.\nJustin Walsh went 3 for 4 with a triple, two RBIs and two runs scored, John Flores hit a two-run double and Pryce Bramer drove in a pair of runs in the loss to Las Plumas in the opener.\nMarysville bounced back from the loss with a victory over Willows in its tournament finale. Job Stout belted a solo home run, Devon Conway hit an RBI double and Seth Pyse added an RBI to lead the offense for the Indians, who scored two runs on an error and another on a double steal to come away with the victory.\nFreshman call-up C.D Portillo earned the win on the mound by tossing 31/3 scoreless innings.\nThe Indians (10-4) return to Golden Empire League play on Monday in Sacramento against West Campus.\nSOFTBALL\nSutter 7, Vacaville Christian 0\nSutter 17, Bradshaw Christian 0, 5 inn.\nIn Vacaville – The Huskies opened the Vacaville Christian Tournament strong by posting a pair of convincing victories over parochial schools from the Sac-Joaquin Section.\nReagan Ford went 2 for 3 with a pair of RBIs and Emma McConville slapped a pair of hits to lead Sutter to the win over the host Falcons in the first game. Darcy Gillen also connected for a two-run triple, and Hailey Peterson hit an RBI double and struck out 16 while tossing a two-hit shutout in the circle.\nThe hits kept coming for the Huskies in their second game of the day as they dispatched The Pride via the mercy rule. McConville turned in another strong showing at the plate by going a perfect 3-for-3 with a home run, double and three RBIs, while Briana Cooper finished 2 for 4 with a home run, double and three RBIs as well.\nSam Anderson went 2 for 4 with a double, triple and three RBIs, Hailey Schamanski was 2 for 2 and knocked in two runs, and Juliana Capaul hit a solo home run. Peterson earned her second win of the day by striking out 11 and firing a one-hitter.\nSutter (9-1) is scheduled to continue the tournament today at 10 a.m. against Pleasant Valley, weather permitting.", "url": "https://apnews.com/66d7d875925a439b98f4d1849a3558dc"}