{"authors": ["Anita Gates"], "date_download": "2020-05-04 20:12:22", "date_modify": "2020-05-04 20:12:22", "date_publish": "2018-04-14 02:30:00", "description": "LOS ANGELES — Donald McKayle, one of the first choreographers to weave the African-American experience into the fabric of modern dance and the first black man to direct and choreograph a Broadway...", "filename": "_14a49cf7bd3a43d9aeefc87e420c48f4_1588623142.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_14a49cf7bd3a43d9aeefc87e420c48f4_1588623142.html", "title": "Donald McKayle, Broadway and modern dance choreographer, dies at 87", "title_page": "Donald McKayle, Broadway and modern dance choreographer, dies at 87", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOS ANGELES — Donald McKayle, one of the first choreographers to weave the African-American experience into the fabric of modern dance and the first black man to direct and choreograph a Broadway musical (“Raisin”), died Friday, April 6, 2018 at a hospital near his home in Irvine, Calif. He was 87.\nHis wife, Lea Vivante McKayle, confirmed the death. He was a professor of dance at the University of California, Irvine, for almost 30 years.\nMcKayle had been working on Broadway for more than two decades when he achieved his triumph with “Raisin,” a musical based on “A Raisin in the Sun,” Lorraine Hansberry’s classic drama about a Black family struggling with loss, change and identity in midcentury Chicago.\nClive Barnes, in his New York Times review of the production, suggested that the musical was even more evocative than the play, and compared McKayle to the star choreographer Jerome Robbins.\n“Mr. McKayle comes to the musical theater as a ranking choreographer,” Barnes wrote, “but also like Mr. Robbins, his skill with actors must now be unquestioned.”\nThe show won the 1974 Tony Award for best musical, and McKayle was nominated for both his roles — as director of a cast led by Joe Morton and as choreographer.\nThey were not his first Tony nominations — the first was for “Golden Boy,” with Sammy Davis Jr., in 1965 — and they would not be his last: He received two more, for “Doctor Jazz” in 1975 and for “Sophisticated Ladies,” which was his original concept, in 1981.\nMcKayle received more than a score of other awards and fellowships, including a spot on the Dance Heritage Foundation’s original list of America’s 100 “irreplaceable dance treasures.”\nLong before his Broadway successes, though, his work was well known to the New York dance world; at least two of his works are considered modern classics.\nIn 1951, when McKayle was barely of age, “Games” had its premiere at Hunter College Playhouse (now the Kaye Playhouse). It depicted urban children at play in streets coursing with an undercurrent of fear, and was distinguished by its being performed without any orchestral music: The dance was set to a cappella songs and chants associated with childhood games.\nWhen McKayle’s “Rainbow ’Round My Shoulder” opened in 1959, few New York dance lovers had ever seen a chain gang represented onstage before. A line of bare-chested men, sometimes holding hands and sometimes intertwining their arms, as if chained together, lamented their imprisonment and dreamed of the cherished women in their lives. In 2016, when the work was part of Paul Taylor’s American Modern Dance season at Lincoln Center, it received a Bessie Award for best revival.\nDonald Cohen McKayle was born in Manhattan on July 6, 1930, the younger of two sons of Philip McKayle and the former Eva Cohen, both born in Jamaica. When his children were small, the elder McKayle worked as a maintenance man for a while at the Copacabana; as World War II approached, he became an aviation mechanic. Donald’s mother did some work in the garment industry, then went back to school to become a medical assistant.\nDance was a part of the McKayles’ life in their Harlem neighborhood, crowded with West Indian immigrants. Donald remembered going with his parents to the Renaissance Ballroom and watching his father pretend to dance on the job, wearing steel-wool pads on his feet as he mopped the floor. But it was modern dance that entranced the young man.\nOne day, on his way to church, Donald noticed a poster showing attractive black people in exotic clothes. It was an ad for Katherine Dunham and her company, the nation’s first self-supporting black modern-dance troupe. Donald promptly spent $4.50 for a balcony seat to see their show, “Haitian Roadside.”\nHe soon saw Martha Graham perform but wasn’t sure whether he liked it, he wrote in his memoir “Transcending Boundaries: My Dancing Life” (2002). But, he added, he could not get it out of his mind.\nWhen he was 14 he was enchanted by the first musical he saw, “Finian’s Rainbow.” But it was a dance concert with Pearl Primus, another pioneer in introducing African and Caribbean dance to Americans, that sealed the deal. “I want to dance like her,” he announced to a friend that night. And from then on he considered himself a dancer.\nWithout any formal training, he received, in 1947, a scholarship to the New Dance Group, a company dedicated to promoting social change. Three years later he was on Broadway, part of the ensemble in the musical revue “Bless You All,” with Pearl Bailey as headliner. (He attended City College of New York but dropped out in his sophomore year.)\nMcKayle’s career spanned seven decades. His last work, “Crossing the Rubicon: Passing the Point of No Return,” addressed the plight of immigrants and was performed last year by the Etude Ensemble at the University of California, Irvine. Although he formally retired from the university in 2010, he continued to teach and to work with the ensemble.\nMcKayle worked in film and television as well, choreographing movies like the animated classic “Bedknobs and Broomsticks” (1971) and the remake of “The Jazz Singer” (1980), starring Neil Diamond, and earning an Emmy nomination for “Minstrel Man” (1977). He also did the choreography for Marlo Thomas’ landmark TV special “Free to Be ... You and Me” (1974).\n— (The New York Times)\nThe screen was not his favorite place, however. When Norman Lear, the king of socially conscious 1970s television, offered him a job as director of his newest series, “Good Times,” a “Maude” spinoff starring Esther Rolle, McKayle accepted, but hesitantly. He directed three episodes. After that, he had to take time off because of an illness in his wife’s family, and he never returned.\nHis last Broadway contribution was to the revue “It Ain’t Nothin’ but the Blues,” starring Gregory Hines, in 1999.\nIn addition to his wife of almost 53 years, whom he had met in Israel when she was his dance student, McKayle’s survivors include two daughters, Liane McKayle and Gabrielle McKayle, both from his first marriage, to Esta Beck; a son, Guy; and two grandchildren.\nIn a 2008 interview with the publication Backstage, McKayle was asked what his advice would be for young dancers. “Work in as many areas as you can,” he suggested. “The more colors you have on your palette, the more you have to work with, and the more you can aspire to.”\n— (The New York Times)", "url": "https://apnews.com/14a49cf7bd3a43d9aeefc87e420c48f4"}