{"authors": ["Billy Summers"], "date_download": "2020-05-04 20:07:54", "date_modify": "2020-05-04 20:07:54", "date_publish": "2018-04-13 10:15:49", "description": "\"A Quiet Place\" is a pretty creepy movie. In a good way. Director John Krasinski (\"The Hollars,\" \"The Office,\" \"Brief Interviews with Hideous Men\") does very well keeping the suspense...", "filename": "_7486695f5a4841d6ba1602302282cda4_1588622874.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7486695f5a4841d6ba1602302282cda4_1588622874.html", "title": "'A Quiet Place' succeeds at difficult storytelling", "title_page": "'A Quiet Place' succeeds at difficult storytelling", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "“A Quiet Place” is a pretty creepy movie.\nIn a good way.\nDirector John Krasinski (“The Hollars,” “The Office,” “Brief Interviews with Hideous Men”) does very well keeping the suspense going as an alien race takes over Earth and hunts and kills humans.\nAlthough the “things” cannot see or smell, they respond rather quickly, and with violent force, to sound.\nAlthough the threat is global, all the audience gets to see is one family in a small rural community.\nEmily Blunt (“The Devil Wears Prada,” “Live Die Repeat,” “The Girl on the Train”) is Evelyn Abbott, a mother of three who must maintain a semblance of normalcy in a world where no one must make a single sound.\nHer husband, Lee, played by Krasinski, must also take command of his nuclear family and is constantly trying to figure out ways to survive and possibly eliminate the aliens.\nOf the three children, Millicent Simmonds (“Wonder-struck”) as Regan Abbott gets the meatiest role, as a tween who loses her self-worth due tc a tragedy early in the movie.\nShe (especially) and all of the others perform well in a hard place, due to the restrictions of almost zero dialogue. The emotion that she has to produce, without speaking, would be hard for any actress, let alone a (Fm guessing) 13-year-old.\nWith less to do, and not as much screen time, Noah Jupe (“The Night Manager,” “Suburbicon,” “The Man with the Iron Heart”) as little brother Marcus Abbott, also does great, even though his role is only to appear, here and there, as a filler to the more essential roles.\nCade Woodward plays youngest brother Beau Abbott and is fine in limited exposure.\nThis whole movie contains only half a dozen human characters, and with no (audible) dialogue, it must have been tough to direct, but Krasinski not only pulls it off, but makes it very suspenseful and to his credit, not as bloody as it could have been.\nAlthough the aliens do their killing with sudden fury, the amount of slaughter porn is kept to a minimum. This only adds to the suspense and goes a long way in making this horror movie less like the campy, popcorn fare of other creature features.\nAlthough similar to the “Clover-field” movies and Steven Spielberg’s “War of the Worlds/′ this movie actually “gets” it. To be taken seriously, even in a horror movie, you have to maintain the seriousness.\nI would have to say that “A Quite Place” (I’m not really happy with the title) is one of the most fun movies that I have seen in quite a long time.\nBilly Summers Is a freelance photographer who also reviews films for the Putnam Herald. He can be reached at summers855@yahoo.com.", "url": "https://apnews.com/7486695f5a4841d6ba1602302282cda4"}