{"authors": ["Cliff Pinckard"], "date_download": "2020-05-04 20:26:38", "date_modify": "2020-05-04 20:26:38", "date_publish": "2018-08-10 10:15:10", "description": "Several NFL players continue protests: A.M. News Links Featured stories Several NFL games see players continue to protest racial injustice during national anthem (Associated Press)", "filename": "_128fac327d4b48f1b2018d09316a25d6_1588623998.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_128fac327d4b48f1b2018d09316a25d6_1588623998.html", "title": "Several NFL players continue protests: A.M. News Links", "title_page": "Several NFL players continue protests: A.M. News Links", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Several NFL players continue protests: A.M. News Links\nSeveral NFL players continue protests: A.M. News Links\nFeatured stories\nSeveral NFL games see players continue to protest racial injustice during national anthem (Associated Press)\n‘Pretty outrageous’: Federal judge blasts U.S., orders plane carrying deported mother and daughter to turn around (USA Today)\nFirst lady’s parents become U.S. citizens thanks to ‘chain migration’ (NPR)\nEmail exposes Kavanaugh to questions about role in terrorism response (Politico)\n‘A devastating scenario’: Brazil sets new record for homicides at 63,880 deaths (The Guardian)\nNational news\nManafort trial Day 8: A heated exchange, judge admits fault, Airbnb enters the spotlight (Politico)\nEx-Ohio State wrestler clarifies comment about congressman’s awareness of abuse (CNN)\nPence calls for Space Force to be established by 2020 (Fox News)\nMichael Avenatti, Stormy Daniels’ lawyer, eyes another gig: president (New York Times)\nU.S. appeals court orders EPA to ban pesticide said to harm children (Reuters)\nD.C. prepares for Sunday showdown between white supremacists and counterprotesters (Washington Post)\nAn Arkansas police officer is fired after telling a group of black men ‘you don’t belong in my city’ (CNN)\nBorder Patrol’s 1st female chief praises the agency’s ‘heart’ (ABC News)\nMassachusetts man arrested for threatening ICE agents on Twitter (NBC News)\n‘Clerical error’ in Kansas governor’s race left off 100 votes for Gov. Jeff Colyer (USA Today)\nTwitter says Infowars hasn’t ‘violated our rules.’ It looks like that’s not the case (CNN)\nThird firefighter killed while responding to Carr Fire in California (San Francisco Chronicle)\nUtah’s Coal Hollow Fire prompts evacuations in 3 counties, brief closure of U.S. 6 (Deseret News)\n‘Embarrassed, disgusted’ police chief helps trace and arrest son in attack on Sikh man (ABC News)\nTennessee executes Billy Ray Irick, first lethal injection in state since 2009 (The Tennessean)\nMan bitten by shark near Texas beach: ‘He wanted to taste me’ (khou.com)\nWorld news\nNorth Korea: US not adhering to its side of the bargain since Trump-Kim summit (CNN)\nYemen war: Saudi-led air strike on bus kills 29 children (BBC)\nIndonesian quake, one of the deadliest earthquakes in years, leaves injured waiting for help (Associated Press)\nIsrael orders ‘strong action’ against Hamas as rocket fire from Gaza persists (Fox News)\nRussia slams ‘unacceptable’ U.S. sanctions, warns of retaliation (Associated Press)\nAustralia relaxes rules on shooting kangaroos during historic drought (USA Today)\nFrance floods: 1,600 evacuated, German missing at campsite (BBC)", "url": "https://apnews.com/128fac327d4b48f1b2018d09316a25d6"}