{"authors": ["Miguel Otárola"], "date_download": "2020-05-04 20:09:06", "date_modify": "2020-05-04 20:09:06", "date_publish": "2018-09-05 20:07:35", "description": "A preschool, a luxury car dealership and a Dunkin Donuts are just a few of the projects underway in Richfield, an inner-ring suburb thats suddenly in the midst of a makeover. More than $200...", "filename": "_aee7e3acbc7548a2ba985af0083fc05f_1588622946.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_aee7e3acbc7548a2ba985af0083fc05f_1588622946.html", "title": "'Explosion of interest' leads to $200M redevelopment boom in Richfield", "title_page": "'Explosion of interest' leads to $200M redevelopment boom in Richfield", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A preschool, a luxury car dealership and a Dunkin Donuts are just a few of the projects underway in Richfield, an inner-ring suburb thats suddenly in the midst of a makeover.\nMore than $200 million worth of redevelopment is happening within the citys seven square miles, officials announced last week.\nI liken it to an explosion of interest in Richfield, said City Manager Steve Devich, who has worked for the city for almost four decades. Ive never seen anything like that before, ever.\nIts part of a construction boom surging through other nearby suburbs, including Edina, Minnetonka, St. Louis Park and Bloomington, where cranes dot the skylines.\nThere have been fits and starts in Richfield, Devich said, especially when Best Buy built its corporate campus about 15 years ago. But the city, which is built-out and has virtually no vacant space, now has redevelopment happening in many places.\nMore than a dozen projects are under construction, according to city officials. They include Primrose Schools, a preschool that broke ground last week near the Target store on Cedar Avenue, and a Dunkin Donuts set to open this fall at W. 66th Street and Penn Avenue.\nThree others projects recently got final approval from the City Council, and others are in the review and proposal stages.\nA $25 million Jaguar and Land Rover dealership owned by Morries Automotive Group, approved last winter, will rise on property once home to the Adler Graduate School and Jim Ramstad Community Services Center.\nThe largest project underway is the Chamberlain, a $43 million development that includes 284 new apartments and 33 renovated units, also near the Target plaza. The complex is set to open next fall.\nConstruction has been nonstop, leading city officials to double-book some ribbon-cuttings. On Thursday, Mayor Pat Elliott and other council members began their day at the grand opening for the Havenwood Senior Living facility and then went to the groundbreaking for the Primrose project.\nThe 88-unit Havenwood was built on the site of the citys former public works garage. Developer Kent Roers jumped at the chance to build there. City officials approved tax-increment financing for the $21 million project, he said.\nWe liked the opportunity of Richfield because it is a nice, aging community, Roers said.\nHavenwood was Roers Companies first foray into senior living, and worked well for what he called a town that is in transition. It now has 91 percent of its independent and assisted-living units filled up.\nIts about location\nWhats driving the Richfield boom? For one thing, Location, location, location, Devich said.\nThe city is about 9 miles south of downtown Minneapolis, only a short drive up Interstate 35W (when its not closed for construction). The airport and the Mall of America are next door. Its walkable, and sidewalks and roads are being improved; one example is the renovation of W. 66th Street.\nHomes are affordable and near commuter routes.\nAfter adding it all up, developers began knocking on doors at City Hall.\nIts unlike the position that Richfield has been in historically, Devich said.\nThe city reached its peak population around 1970, when more than 45,000 people called Richfield home. Those numbers dropped over the years and stand now at about 36,000.\nBut its expected that additional housing will nudge the population higher. Elliott, who grew up in the suburb and returned in 1985, said he hopes the city reaches 39,000 residents by the 2020 census.\nWere gradually building that population back, he said.\nCommunity Development Director John Stark noted that construction typically brings with it some pain. Drivers face several delays traveling through the city.\nIt is going to be difficult to people, especially those living immediately adjacent to these projects, he said.\nBut construction is temporary, Stark added. The future is really exciting, he said.\nMiguel Otandaacute;rola 612-673-4753", "url": "https://apnews.com/aee7e3acbc7548a2ba985af0083fc05f"}