{"authors": ["Holly K. Michels Holly.Michels Lee.Net"], "date_download": "2020-05-04 20:06:05", "date_modify": "2020-05-04 20:06:05", "date_publish": "2018-04-08 14:00:00", "description": "As the calendar moves closer to the June 5 primary election, the gloves are starting to come off for the four Republican candidates in their party’s contest for the U.S. Senate race. Through...", "filename": "_4b8e8a440b7e4e10ae6cfd8c4dd7a9be_1588622765.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4b8e8a440b7e4e10ae6cfd8c4dd7a9be_1588622765.html", "title": "As U.S. Senate primary nears, GOP candidates seek to separate selves from pack", "title_page": "As U.S. Senate primary nears, GOP candidates seek to separate selves from pack", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As the calendar moves closer to the June 5 primary election, the gloves are starting to come off for the four Republican candidates in their party’s contest for the U.S. Senate race.\nThrough a handful of public forums across Montana, the four men seeking to unseat Democratic U.S. Sen. Jon Tester have played a light game of touch football with each other while going full tackle on the incumbent.\nBut now Big Sky businessman Troy Downing, former Yellowstone County judge Russ Fagg, state legislator and surgeon Albert Olszewski and state Auditor Matt Rosendale are starting to point out not just their own bona fides, but where they see each other coming up short.\nThe race against Tester is expected to be closely fought and draw a large amount of attention and money to Montana. Democrats nationally are trying to ride a wave of energy to win back control of Congress, while Republicans view Tester’s seat as vulnerable, pointing to the fact he’s never gotten more than 49 percent of the vote.\nMatt Rosendale\nRosendale has spent most of his time focusing outright on Tester and the least digging at his primary opponents. He’s seen by some as the front-runner in the primary race and has raised the second-highest amount of money so far — the most when not counting the candidate’s own funds — amassing about $764,230 in 2017. Though the most recent campaign finance reports were due to the Federal Elections Commission more than a week ago, they have not yet been made public.\nTester ended 2017 with $6.3 million cash on hand.\nRosendale previously spent two terms in the state Legislature, including one as Senate majority leader. A crowded GOP primary isn’t new to him, either — in 2014 he ran and came in third in a five-way primary for Montana’s U.S. House seat.\nInstead of spending much time talking about why he’s a better choice than Downing, Fagg or Olszewski, Rosendale likes to talk about why he’s the right one to square off against Tester.\n“What I focus on is how my record contrasts with Jon Tester, because I honestly believe that based on the support I have across the state, based on the infrastructure I have across the state, based on the support I have at the national level to help us get across the finish line, that I am going to be running against Jon Tester,” Rosendale said this week.\nRosendale points to his past as a state lawmaker and state auditor as giving him a foot up on the others, though he doesn’t call out anyone specifically. He keeps that for Tester.\n“Everyone else has to campaign on hypotheticals,” Rosendale said. “They have to campaign on hypotheticals about what they promise to do, and they promise to do all types of things, but I’m the only one that can say I serve the way I campaign.”\nWhile Rosendale wants his past to speak for him, money also has a loud voice in the primary.\nOut of the 1,489 individual contributions Rosendale reported in 2017, only 170 were from Montana. He’s also received big money from national groups, like $29,000 from the Republican Challengers Fund, and had the most spending by outside groups in support of him, including the conservative Americas PAC, Senate Conservatives Fund and Club for Growth PAC. At the end of March, the Restoration PAC produced a video in support of Rosendale that focused solely on going after Tester.\nRuss Fagg\nWhile Rosendale sees that national support as a good thing, a sign he’ll be able to amass the war chest needed to square off against Tester, candidates like Fagg find fault in that thinking.\n“It’s my Montana endorsements … and my Montana contributions,” Fagg said of why primary voters should pick him.\nFagg has claimed through the campaign that about 80 percent of his campaign donations have come from Montana. That proves out — about 329 of Fagg’s 400 contributors come from the state. That comes to about $461,480 of the $615,454 he’s brought in, including $25,000 of his own money.\n“I think I have that Montana support,” Fagg said of those totals.\nFagg also called out Downing’s out-of-state contributions and self-funding. Of Downing’s nearly 150 contributors, 44 are from Montana. Though Downing raised $857,823 in 2017, the most of anyone in the primary, $560,000 came from Downing himself as loans to the campaign. That makes up about 81 percent of his Montana donations.\nTroy Downing\nDowning, who jumped out of the business world after 9/11 to serve in the Air Force for eight years, has also cast most of his focus on Tester. His most recent ad directly goes after the farmer from Big Sandy — it features a fighter jet presumably flown by Downing knocking a trumpet-playing “Tester” off a tractor.\nDowning, still, is starting to cast some of his efforts toward separating himself from the other primary candidates, including Fagg specifically.\n“One is running on a platform of creating jobs and he’s never created a job in his life,” Downing said. “I think there’s a tremendous amount of separation between us. If you look at them, there’s nobody that’s ever built anything meaningful. I think that’s a big step of understanding how to create jobs, how to build business, how to build the American dream.”\nFagg’s campaign slogan is “Jobs First. Montana Always.” Downing has had a successful career across several businesses, including founding a tech startup that later merged with Yahoo.\nWhile Rosendale and Olszewski also tout having a voting record for Montanans to review, Downing said his lack of one plays to his advantage.\n“I’m the only one running that is not a current or past politician,” Downing said. “I think that Montana and America are much more excited about people that are not status quo politicians. That’s one of the reasons we elected Donald Trump by such a wide margin.”\nHe also cited his business and military experience.\n“I think that having private-sector experience is really important to most Montanans and most Americans. … Congress has the ability to declare war and I think that’s important that we have people representing us that know what that means, not as an abstraction, but knows what that smells like, what that looks like. We do not have a single person representing Montana or running for this seat that has been in that situation.”\nAlbert Olszewski\nOlszewski also served in the Air Force as a doctor. Though he’s raised the least amount of money, he said his lack of big-time contributions shows he’s best suited to serve Montanans and isn’t beholden to Washington, D.C., interests. He’s raised $209,453, including a $2,700 donation from himself and a $100,000 loan he made to his campaign. Of his roughly 158 donations, about 134 are from Montana, for about $187,150 of his total.\n“I learned as a boy an old saying ‘You dance with the one who brought you.’ My intent is to go the U.S. Senate as a representative of the people of Montana. Nobody from the outside has influence on this campaign,” Olszewski said. “This is a made-in-Montana campaign. I’m the only guy that’s a free agent and I’m telling you, people dance with the one that brought them.”\nOlszewski said that, like Rosendale, he also has a record voters can review. Having that, he said, makes him best suited to run against Tester.\n“I feel that the way the Montana Republican Party regains this U.S. Senate seat from Jon Tester and the national Democratic Party is we need to focus the general campaign on the issues that we talk about, where Jon Tester stood on his voting. I believe I’m the only candidate in the GOP that can articulate that message and actually drive it toward the issue of where Jon has voted. I’m one of the few that actually has a voting record where people can compare and contrast.”\nMontana roots\nIn March, one of the first signs of the Republican primary candidates going at each other was an email Fagg sent to his supporters that referenced Rosendale and Downing not being from Montana.\nIt’s become almost a hallmark of Montana elections — who was born here and what that means. Montana Democrats in 2016 went hard after then-governor candidate Republican Greg Gianforte, now Montana’s sole U.S. House representative, for being from New Jersey. Though it’s unclear how much of a role that played in the race, Gianforte lost by 4 points in a year when Republican President Donald Trump took Montana by 20.\nIn his campaign email, Fagg said if either Downing, who moved here from California, or Rosendale, who moved here from Maryland, were to win the primary, “the Democrats are going to hang that fact over their head in every TV ad, mail piece and news story from June to November.”\nTester is from Montana.\nFagg said he appreciates anyone who’s moved to Montana, but said “it’s moving to Montana to start a political career, I think that’s what bothers some people.”\n“A couple of my opponents moved here 15 years ago (Rosendale) and sometime within the last nine years (Downing),” Fagg said. “There’s no problem with them moving to Montana but it looks like they moved here to basically start a political career. Matt (Rosendale)’s run I think (four) times in the last eight years, I think that’s something that concerns Montanans and that’s rightfully so. … My family has actually been here 141 years. We go way back.”\nWhile this is Downing’s first bid for office, Rosendale ran for state Legislature in 2010 and 2012, Montana’s U.S. House seat in 2014 and state auditor in 2016\nOlszewski, the other Montana native in the primary, made less of a point to tout his Montana roots but said it could open a candidate to Democratic attacks.\n“If your family moved here three, four, five generations ago or you just got here, if you moved to Montana because you love Montana and our heritage and you want to build on that heritage and not make us different, you’re 100 percent Montanan,” Olszewski said.\n“The truth is when we go into any campaign, we have to find any angle as a politician to try to differentiate ourselves from the other person. That is being used by Russ Fagg against the two other candidates that he believes are a threat to his candidacy. I wouldn’t put it past Jon Tester to use it. It’s politics.”\nRosendale flipped the issue, saying that an ad Democrats put out last month mocking his “Maryland accent” and the way he pronounces “Montana” shows the party has identified him as the best chance at beating Tester. The ad also pulls footage of Fagg talking about Rosendale’s East Coast roots.\n“Based on the activity the Democratic Party has generated against me in the last 30 days, they’ve identified me as Jon Tester’s opponent as well,” Rosendale said.\nHe points to his win in the auditor’s election as showing Montana voters don’t care much about where someone is from.\n“I can tell you that 262,045 Montanans don’t care about it, because that’s how many voted for me last election,” Rosendale said. He also stressed that Tester, either in his 2006 or 2012 election to the U.S. Senate, never got that many votes.\nDuring a Bozeman forum, Downing said, “I’ve always been a Montanan. It just took me 31 years to get here.”\n“I think Montanans are smarter than that,” Downing said recently of the issue of where candidates are from. “What it really is, is what constitutes Montana values. That’s what I think it comes down to. Nobody is voting for my great-grandmother. … Whether my great-grandmother was born here or anywhere else is irrelevant, I think most Montanans are smart enough to know that.”", "url": "https://apnews.com/4b8e8a440b7e4e10ae6cfd8c4dd7a9be"}