{"authors": ["Joe Duggan World-Herald Bureau"], "date_download": "2020-05-04 20:12:27", "date_modify": "2020-05-04 20:12:27", "date_publish": "2018-03-19 15:49:00", "description": "LINCOLN — Nebraska Supreme Court Judge John F. Wright, who served 24 years on the state's highest court, died Sunday after a long illness. He was 72. The seven-member court's senior judge...", "filename": "_fe426ff46db2498a9160a83ddd0a6270_1588623147.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fe426ff46db2498a9160a83ddd0a6270_1588623147.html", "title": "Nebraska Supreme Court Judge John Wright dies after long illness", "title_page": "Nebraska Supreme Court Judge John Wright dies after long illness", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN — Nebraska Supreme Court Judge John F. Wright, who served 24 years on the state’s highest court, died Sunday after a long illness. He was 72.\nThe seven-member court’s senior judge was appointed by then-Gov. Ben Nelson and took office on Feb. 25, 1994. He previously served for two years on the Nebraska Court of Appeals and worked for more than two decades as a private practice attorney.\nChief Justice Michael Heavican released a statement Monday calling Wright a much-loved member of the court.\n“His loss leaves a great void as our longest serving, most experienced member of the bench,” Heavican said. “Our deepest condolences to his wife, children, grandchildren and extended family.”\nIn a recent interview, Heavican said his colleague had been absent from the court for several months after he underwent a major medical procedure and then suffered a setback in his recovery. Heavican had expressed optimism that Wright would be able to return to work.\nWright’s death means Gov. Pete Ricketts will make his fifth appointment to the Supreme Court since taking office in 2015. Ricketts has appointed current Judges Stephanie Stacy and Jeffrey Funke and is in the process of reviewing four finalists for a current vacancy on the court.\nThe vacancy was created by the sudden resignation of Judge Max Kelch, also a Ricketts appointee. Kelch stepped down in January in the face of an ethics complaint involving sexual harassment .\nWright was a 1970 graduate of the University of Nebraska College of Law. He was a veteran of the U.S. Army and served for six years in the Nebraska National Guard.\nHe is survived by his wife, Deborah, and four children.\nAs the Supreme Court awaits the appointments, it continues to hear cases with the help of several district court judges serving as substitute members.", "url": "https://apnews.com/fe426ff46db2498a9160a83ddd0a6270"}