{"authors": ["April Marble"], "date_download": "2020-05-04 20:07:42", "date_modify": "2020-05-04 20:07:42", "date_publish": "2018-01-01 20:00:00", "description": "For 16 years, Amy Morris' place in the world was as a businesswoman serving in the hospitality and new home construction industries. Throughout that time, though, art maintained an overwhelming...", "filename": "_970fb5af4025440a8fdd48a97529ffb8_1588622862.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_970fb5af4025440a8fdd48a97529ffb8_1588622862.html", "title": "Local artist's work captures emotions of Harvey", "title_page": "Local artist's work captures emotions of Harvey", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "For 16 years, Amy Morris’ place in the world was as a businesswoman serving in the hospitality and new home construction industries. Throughout that time, though, art maintained an overwhelming presence in her periphery.\n“When I lived in Fort Worth, I felt like much of the work I was doing involved art,” Morris said. “Whether it was designing sets for church plays or working with painting-party companies, art has always been a major part of my life.”\nAfter spending almost 20 years away from Southeast Texas, Morris returned to get her bachelor’s of fine arts in studio art at Lamar University. Although her focus was on painting, she describes her styles as an eclectic mix.\n“I would describe my work as somewhere between sculpture and painting,” Morris said. “I like to employ many different techniques to my work and I can’t describe it as one thing or another.”\nOne of the techniques, encaustic wax painting, dates to the ancient Greeks.\n“I was visiting an art museum and they had these encaustic paintings from Egyptian tombs, and I became fascinated with it,” Morris said. “I spent a lot of my free time researching it and I had this overwhelming desire to learn how to do it.”\nMorris’ fascination and desire led her to Richardson, outside Dallas, to learn the craft.\n“In order to learn encaustic painting, I applied for a research grant so that I could afford to attend classes that focused on the technique,” Morris said. “My senior thesis series is the first time I’ve actually incorporated it into my work.”\nMorris used her new skills to highlight the effects of Hurricane Harvey in her series, “Submerged.”\n“After Harvey made its way through Southeast Texas, I remembered the red tape and the marked-off properties, and I wanted to encapsulate seeing all the debris in the streets,” Morris said. “One of the pieces uses that red tape, others use actual garbage from the storm’s aftermath. I wanted to capture all of the aspects of that experience.”\nMorris also uses the series to highlight the emotional toll Harvey inflicted.\n“The pieces in the exhibition show the different kind of damage that was taken during the storm,” Morris said. “The piece ‘Defilinf’ is made out of a Bible I found in the debris. It was completely covered in mold, and I saved some of the pages and made a piece out of them. I wanted to show that not only were there damages to property, but items of sentimental value were lost in the storm.”\nMorris’ goal is to create a conversation between the pieces and the viewer.\n“When you look at the pieces from a distance, they look strange,” Morris said. “It draws you in, but once you look closer you really have this dialogue between each piece and the viewer because each person is going to have a different reaction to them.”\n“Submerged” will be on display at San Jacinto College in Houston from Jan. 16 to Feb. 15, but in the future, Morris plans on leaving Southeast Texas to learn different styles and techniques around the country.\n“In Southeast Texas, there definitely is a particular art culture that has definitely influenced my work over the past four years,” Morris said. “Now, I’m ready to travel outside of Texas and pick up different styles and techniques in a new area. I’ve applied to many schools that are out of state and I’m very excited to expand my knowledge.”\nApril Marble is a freelance writer.", "url": "https://apnews.com/970fb5af4025440a8fdd48a97529ffb8"}