{"authors": ["Derek Halseyfor The Herald-Dispatch"], "date_download": "2020-05-04 20:23:11", "date_modify": "2020-05-04 20:23:11", "date_publish": "2018-08-10 10:11:10", "description": "When considering a vacation to a cooler climate, the High Country region of western North Carolina is a fun pick for a week of natural beauty, fun and music. While West Virginia is known as the...", "filename": "_48841a761d864931bd045781b783d39b_1588623791.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_48841a761d864931bd045781b783d39b_1588623791.html", "title": "Western North Carolina a great vacation destination", "title_page": "Western North Carolina a great vacation destination", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When considering a vacation to a cooler climate, the High Country region of western North Carolina is a fun pick for a week of natural beauty, fun and music. While West Virginia is known as the Mountain State, the highest mountains east of the Rockies exists a short drive from the Tri-state in and around Boone, North Carolina.\nTraveling either by I-64/I-77/1-81 or the scenic path down Route 23, the High Country of western North Carolina presents opportunities of many kinds for a summer, fall or winter vacation. All in five hours or less from Huntington.\nThe High Country is made up of seven specific counties found between Boone, North Carolina, and Mount Mitchell, which is the tallest mountain in eastern United States at 6,683 feet above sea level. The heart running through the region is the magnificent Blue Ridge Parkway.\nPerhaps the most traveled scenic roads in all of America, the Blue Ridge Parkway (BRP) meanders its way on the top of the Appalachian Mountains for 469 miles from the Shenandoah Valley of Virginia to the Great Smoky Mountains of North Carolina. The section of the BRP located in between Deep Gap, North Carolina, on the edge of Boone, to Mount Mitchell and farther west is a trail of natural beauty that is filled with wonderful places to hike, explore, shop, and take in live music along the way.\nWhen it comes to live music, western North Carolina is still a place filled with musicians of all stripes found in and among the Blue Ridge Mountains. On the corner of King Street and Depot Street in downtown Boone, there is a statue honoring the late and great local music hero Doc Watson.\nWatson was known around the globe for his “traditional-plus’ mountain music and was considered one of the best guitarists in the roots music world.\nAs for live music in and around Boone, a small college town located at 3,333 feet elevation surrounding Appalachian State University, there are many venues that feature local, regional and national acts such as the Boone Saloon, The Local, the Schaefer Center for the Performing Arts, Lost Province Brewery, Appalachian Mountain Brewery and more. As you venture out into the higher mountains outside of Boone, there are many other unique venues to look for and visit.\nThe resort town of Banner Elk is located about 17 miles from Boone and features three wineries that showcase live music on the weekends every summer and fall. Those include Grandfather Vineyard and Winery, Linville Falls Winery and Banner Elk Winery, all of which are in beautiful, scenic settings.\nBeech Mountain Ski Resort and Sugar Mountain Ski Resort, which feature excellent skiing above 5,000-foot elevation in the winter months near Banner Elk; both turn into playgrounds in the summertime with hiking, mountain biking trails and high altitude disc golf. Beech Mountain Resort brings in live bands every Saturday afternoon to their 5506-foot Skybar, a unique pub found on top of Beech Mountain with views as far as the eyes can see.\nThe nearby town of Blowing Rock, North Carolina, also features live outdoor music every Friday evening in the summer at the Inn at Ragged Gardens as does Valle Crucis Park in Valle Crucis, North Carolina. Blowing Rock is known for its downtown shopping opportunities as well as great mountain views and eateries. As for the more rural Valle Crucis, nearby is the original Mast General Store, which is a historic country store filled with old school items established in the late 1800s.\nIf you are into hiking and looking for adventure, the trails on or near the BRP from Boone to Asheville are spectacular. The famous Grandfather Mountain is omni-present on the skyline and within a 15 mile radius of it exists three gorges to explore; John’s River Gorge, Wilson Creek Gorge and the world-famous Linville Gorge. Linville Gorge is the deepest gorge east of the Mississippi River and is anchored by two distinct mountains that rise up from the river below in Hawks-bill Mountain and Table Rock Mountain.\nWhile Linville Gorge itself is about 12 miles long and features many miles of trails, the paths to the summit of both Hawksbill Mountain and Table Rock Mountain are only about one mile long, straight up. But there are also gorge rim trails that follow the ridge of the great chasm and are equally spectacular without requiring much climbing, such as the first mile of both the The Chimneys Trail and the Rock Jock Trail.\nFor those wanting an easy, paved view of Linville Gorge there is Wiseman’s View Outlook located on a four-mile long gravel road that is two-wheel drive accessible while dry, but will probably require an all-wheel drive vehicle if the road is wet. The view brings nature to the foothold for each visitor.\nAt one end of Linville Gorge is Linville Falls, which is an easy walk to a wonderful overlook. A couple of miles farther south of Linville Gorge is Linville Caverns, a privately run facility that features tours year round. There are many other trails to seek out along the BRP from Deep Gap to Asheville, and the information needed to find and hike them is easily retrievable online. Some of the better trails to research include the Beacon Heights Trail, the Flat Rock Trail, the Little Lost Cove Cliffs Trail, Roan Mountain Grassy Balds Trail, Darkside Cliffs Trail, Elk Knob Mountain Trail, Rough Ridge Trail, the Moses Cone Manor Fire Tower Trail, the Profile Trail, and the Mile High Bridge and the rest of the trails located in the state-owned Grandfather Mountain Park.\nBetween the views, music, food, and atmosphere, North Carolina has a graciously lived up to offering the a little something for everyone.", "url": "https://apnews.com/48841a761d864931bd045781b783d39b"}