{"authors": ["Deron Snyder The Washington Times"], "date_download": "2020-05-04 20:17:40", "date_modify": "2020-05-04 20:17:40", "date_publish": "2018-07-30 17:15:50", "description": "The heart says don't give up on the Nationals' core. Resist the urge to be sellers as the MLB trade deadline approaches. If you must go down, do so fighting in possibly your last season with Bryce...", "filename": "_5a4d0fae9c624db94d3d3e1fab4e96b6_1588623460.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5a4d0fae9c624db94d3d3e1fab4e96b6_1588623460.html", "title": "Head, heart disagree on Nationals", "title_page": "Head, heart disagree on Nationals", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The heart says don’t give up on the Nationals’ core. Resist the urge to be sellers as the MLB trade deadline approaches. If you must go down, do so fighting in possibly your last season with Bryce Harper.\nThe head says ... I don’t know.\nGeneral manager Mike Rizzo has good reasons to pick up the phone as playoff-bound teams call. He’s usually the person reaching out to also-rans, sniffing for their players who could make an immediate impact in Washington. Being on the receiving end of such inquiries must be difficult, especially when the Nats were considered World Series contenders entering the season.\nThis team was built to win, not surrender. It was supposed to capture its fifth NL East title in seven years and advance to the NL Championship Series for the first time. Rookie manager Dave Martinez was supposed to be an upgrade over Dusty Baker as the Nats de-emphasized gut decisions.\nBut what does the gut say about this?\nThey have a losing record with 57 contests remaining. Philadelphia and Atlanta ahead in the division race. The Nats tied for seventh-place in the wild-card standings. Making the playoffs is less than a 50-50 proposition according to FanGraphs, which pegs the Nats’ postseason probability at 48.9 percent.\nThen we get to the eyes.\nWe can’t believe they’re telling the truth\nFacing a make-or-break weekend series in Miami, against the league’s third-worst team, Washington came away with a split. The Marlins held the Nats’ “vaunted” offense to one run on seven hits over the final two games. In Sunday’s series finale, a spiritless 5-0 loss, you’d never know they were fighting to keep the team together and make a run down the stretch.\n“Today’s game was just flat,” Martinez told reporters after his squad managed a measly pair of singles. “I’m not happy about that,” he said. “We’re playing for something and they get it. It’s just one of those days. For whatever reason, we come out and couldn’t swing the bats today.”\nWith the calendar on the brink of August, “one of those days” is extending to one of those years.\nWhich brings us to the senses.\nNo matter how much the heart believes, there’s a feeling that this season will end Sept. 30.\nThe team as presently constructed doesn’t inspire much confidence that a turnaround is ahead. Take a few and drop a few seems about right for a squad that hasn’t produced a four-game winning streak since May 28. Over that same period, the Nats have won back-to-back games just five times, while losing at least two in a row 10 times (including skids of three, four and five games).\nThe weekend in Miami was a perfect illustration of the Nats’ maddening inconsistency. They scored 19 runs in the first two games behind quality starts from emergency fill-in Tommy Milone and ace Max Scherzer, only to go limp in support of Gio Gonzales and Jeremy Hellickson.\nScoring runs should be the least of Washington’s problems. However, despite the emergence of rookie Juan Soto and the presence of Bryce Harper, Anthony Rendon, Trea Turner, et al, Sunday marked the 10th shutout since June 1. Miami catcher J.T. Realmuto would look great in a Nationals uniform and certainly be an upgrade if Rizzo opts to add reinforcements.\nBut not even Realmuto would address the main problem.\nScherzer is the only reliable starter, anchoring a rotation with four question marks. That in turn has led to an overworked bullpen. Considering how we never know what to expect from Gonzalez or Roark, and no one knows when oft-injured Stephen Strasburg will feel another twinge, adding a starter should be the priority.\nBack to the gut.\nWashington will have plenty of chances to get back in the win column this week with six games against the cellar-dwelling Mets and Reds. The Nats can control their destiny later this summer with nine games against Philadelphia. Another six against Atlanta could be beneficial, too.\nBut it will require more intestinal fortitude than we’ve seen thus far. The Nats came out of the All-Star break declaring this was “go time,” the point where they’d play every game as if life depended on it.\nInstead, we’ve gotten more of the same ‘ol, same ’ol a 4-5 record that dovetails nicely with their 52-53 season mark.\nRizzo’s heart might convince him to stick with his hand-picked squad. If so, the Nats need to show more heart to prove him right.\nBecause everything else suggests it’s time to sell.\n⦁ Deron Snyder writes his award-winning column for The Washington Times on Tuesdays and Thursdays. Follow him on Twitter @DeronSnyder.", "url": "https://apnews.com/5a4d0fae9c624db94d3d3e1fab4e96b6"}