{"authors": ["Natasha Blakely"], "date_download": "2020-05-04 20:27:15", "date_modify": "2020-05-04 20:27:15", "date_publish": "2018-03-19 00:31:06", "description": "Battle Creek — The dress code was formal. Women in jewel-colored dresses mingled with men in sleek dark suits and tuxedos at the Battle Creek Country Club. The occasion was a farewell of sorts,...", "filename": "_f839cd12cab84d5f883170b670b33192_1588624035.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f839cd12cab84d5f883170b670b33192_1588624035.html", "title": "Battle Creek club has one final bash in 84-year history", "title_page": "Battle Creek club has one final bash in 84-year history", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Battle Creek — The dress code was formal. Women in jewel-colored dresses mingled with men in sleek dark suits and tuxedos at the Battle Creek Country Club. The occasion was a farewell of sorts, the end of an era.\nThe Chesterfield was a Battle Creek tradition, a club dating back to 1934 that brought people together a few times a year to eat, drink and dance.\nThe Chesterfield celebrated its last hurrah on Feb. 24, a Saturday night. Some of the 52 people in attendance had been coming regularly. Others had fallen away years ago but wanted to be there for the end.\n“It’s a segment of what happens in this community that we’re going to dearly miss,” said Mike Toth, who started coming to the Chesterfield with his wife Kathy in 1984.\nThey stopped coming regularly about 15 years ago.\n“One of my good friends was president of the club in the early ’90s when smoking was banned,” Toth said. “I recall a very interesting letter from a founder of the organization, or his father was a founder, that said, ‘I understand you’ve changed the policy of smoking in the Chesterfield Dance Club. The club was named after a pack of cigarettes. Therefore, please consider this my resignation from the club.’\n“So that says it all. Think about it. This organization is named after something it is illegal to do now. It’s a different world.”\nAs recently as the 1980s, Chesterfield events had waiting lists of people eager to attend.\n“It was so popular back then, you almost had to have an opening, a death,” said Phil Slayton, 77, who has been coming to the Chesterfield for more than 20 years.\nThere hasn’t been a waiting list for the Chesterfield in a while.\nThe Chesterfield Dance Club grew out of John Harvey Kellogg’s interest in having a dance club in Battle Creek. He had visited the Fortnightly Club in Illinois and offered to back the club for the first year, according to David Brown, a Chesterfield board member.\nBut times are different. The Battle Creek Sanitarium is now the Hart-Dole-Inouye Federal Center. The Kellogg Co.’s footprint in Battle Creek is smaller. And the Chesterfield is over.\nThe organization did make gradual changes over the years. Some were attempts to draw in the next generation, but they never seemed to bear much fruit.\nThe word “dance” was dropped from the event name to encourage people who either weren’t good at or not interested in dancing to attend.\nTwo years ago, requirements of membership were changed so guests would pay for the dinner and dance one event at a time, instead of having to pay for the whole season at once.\nMembership cost $6 for the full season when the Chesterfield started in the 1930s. By the end, attending cost $140 for a single dance and dinner.\n“It’s hard to say really what the issue is,” said Kelly Kerschbaum, a Chesterfield board member. “For some people, it’s the timing, just the wrong time in their life.”\nUnfortunately for the Chesterfield, it was the wrong time for enough people that average attendance that was once close to 300 slowly dropped to 30 last year.\n“It’s basically the board members and their friends,” said Bernie Kerschbaum, the treasurer of the Chesterfield.\nFor one more night though, the Chesterfield was hopping.\n“My view is that Chesterfield is a microcosm of Battle Creek,” Toth said, “and that Battle Creek has significantly changed and can’t support this type of event because most people who have employment situations in Battle Creek choose not to live here anymore, and those same people are going to dance clubs in Kalamazoo and Gull Lake.\n“Sometimes we misunderstand what diversity is,” he added. “Diversity is you have a bunch of people wearing tuxedos dancing around to fancy music drinking fancy cocktails, and I think it’s important for communities to have that, and we can’t lose that because I’m very, very concerned that we’re going to end up being known as a depressed area.”\nWhat seems to be the largest problem, however, is a lack of continuity.\n“This used to be a big shindig,” said John Melges, 48, whose grandparents were among the founders of the Chesterfield. “You don’t see a lot of people below 40. Some of them have brought their kids, but, for them, it’s kind of like a one-and-done. They show up to see what it’s like.”\nIt isn’t a one-and-done for Chris and Shanti Brown, however, who are 25 and 24 respectively and have enjoyed coming to the Chesterfield for the past four years.\n“I think a lot of people in our generation may not know things like this exist and are open to them,” Shanti Brown said, “but I guess that’s why people our age aren’t coming.”\nLisa Brown and her husband, David, got engaged just before a Chesterfield event 30 years ago. Both are now members of the board.\n“When we first went, we were the youngest ones there because we went with our parents, but now it’s shifted,” she said. “Probably our son and his wife are some of the youngest coming now.”\nTypo, the band hired for the last event, played a range of songs. The lead singer’s voice was a warm rumble well suited to songs such as “Faithfully,” by Journey, and “Save a Horse (Ride a Cowboy),” by Big & Rich and perhaps less suited to Bruno Mars’ “Uptown Funk.”\nThough that didn’t stop attendees from rushing the dance floor and enjoying the beat of the more modern covers.\nRelaxed from conversation with friends, the beef tenderloin dinner and the drinks, attendees raised the energy levels on the dance floor, jumping around to the beat or swaying to the slower songs.\n“Some people think this is crazy, but we moved to Chicago four years ago and we would still come back for these,” said Kelly Dechant, who wore an eye-catching teal and blue dress. Her husband, Tim, was equally eye-catching but for his height. “We stayed members, and we would come for the night and come to Chesterfield.”\nThey’d been members for at least 15 years and had even been on the board a few times.\n“When we were on the board, the preparing for the dances was as fun as the dances,” Tim Dechant said. “Because, again, there were such great friendships that were formed and the times we get together at each other’s’ houses to plan the menus, plan the bands, plan the decorations, work on finances, all that stuff, membership drives, everything.”\nSue Heeres was part of a group trying to recreate a photo taken at a Chesterfield dance in 1996. There were 12 people in the original photo. Only six had come back for the Chesterfield’s last night.\n“It’s kind of bittersweet,” Heeres said. “That’s why we wanted to get our pictures. We were thinking we would never be in formal dresses and tuxedos again.”", "url": "https://apnews.com/f839cd12cab84d5f883170b670b33192"}