{"authors": ["Ben Bromley", "News Republic"], "date_download": "2020-05-04 20:24:56", "date_modify": "2020-05-04 20:24:56", "date_publish": "2018-05-25 22:00:00", "description": "Arthur Gibson’s daughter didn’t know he practiced a lost art until she lost Art. The Baraboo veteran died of heart failure in January at 92. His daughter Julie Rose has not only preserved a...", "filename": "_39a8f71ed8444101b086c351761e9425_1588623896.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_39a8f71ed8444101b086c351761e9425_1588623896.html", "title": "Daughter transcribes WWII letters of Baraboo Navy man", "title_page": "Daughter transcribes WWII letters of Baraboo Navy man", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Arthur Gibson’s daughter didn’t know he practiced a lost art until she lost Art.\nThe Baraboo veteran died of heart failure in January at 92. His daughter Julie Rose has not only preserved a collection of photographs and newspaper clippings chronicling his World War II service, but typed up 20 handwritten letters he sent back home from distant ports.\n“His Navy years meant an awful lot to him,” she said. “He was terrified. He hated Hitler. He hated what was going on over there. He wanted to make a difference.”\nYears before becoming a Holiday Wholesale salesman and man about town, Gibson enlisted at 17 before finishing high school in Baraboo. He served as a machinist on a destroyer that dropped depth charges on German U-boats\nDuring his 32 months in the Navy, Gibson saw Brazil, Italy and North Africa. His ship went to the Malta Conference to safeguard President Franklin Roosevelt.\nMonday will mark the family’s first Memorial Day without him. “It’s going to hurt. Everything hurts,” widow Lois Gibson said.\nRose interviewed her father about his life and wrote a brief memoir. She later transcribed wartime letters that came to Baraboo via air mail more than 70 years ago. In them, Gibson asks his mother for white socks and copies of the Baraboo News. He discusses the service of other Baraboo natives, asks about family members’ latest news and encourages his mother to quit her job at a mill.\nIt’s the kind of hand-crafted personal correspondence that has all but disappeared now that keyboards fit in pockets. His daughter wishes she could reach out to him once more. “I pick up the phone to tell him something, and he’s not there,” Rose said.\nGibson was born in Lyons, modern West Baraboo. In 1942 he left school and, bearing a letter of permission from his parents, joined the Navy alongside 16 other Baraboo boys. He served two years aboard the USS Memphis, a ship that’s now depicted on his headstone.\nHe married his sweetheart Eulaine Hattle, Rose’s mother, in 1946. He worked as a butcher before landing a sales job with the Sunbeam bread company in 1959. A decade later he began a 37-year career with Holiday Wholesale in Wisconsin Dells.\nGibson was a proud member of the American Legion, Emanuel United Methodist Church and the Masons. He also was the life of any party, leading singalongs. “He had a very good life. He was a lot of fun to be with,” Lois Gibson said. She married him in 1992, a year after his first wife died.\nDuring his Navy years, Gibson’s mother – Cora Haskins Gibson – assembled a scrapbook that his daughter Rose now maintains. Service is a family tradition, as Rose’s grandfather William Hattle was a World War I Army cook before starting Hattle’s Café in downtown Baraboo.\nDecades after using what’s now considered an old-school technique to correspond with his family, Gibson turned to the internet to reconnect with his Navy buddies.\n“His love for our country was very deep-rooted,” Rose said.\nOn Monday, his descendants will reflect on his service and his life. “Everybody loved Art Gibson,” his widow said.", "url": "https://apnews.com/39a8f71ed8444101b086c351761e9425"}