{"authors": ["Mina Corpuz", "Mcorpuz Sentinelandenterprise.Com"], "date_download": "2020-05-04 20:07:36", "date_modify": "2020-05-04 20:07:36", "date_publish": "2018-06-26 10:33:41", "description": "LUNENBURG -- The high school's track and field will bear the name of former athletic director Richard Mulligan and student athlete Myles McCarron. School Committee members voted unanimously...", "filename": "_e6138286ea0842e786740c262d083784_1588622856.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e6138286ea0842e786740c262d083784_1588622856.html", "title": "Lunenburg Track, Field to Be Named in Honor of Former AD, Student-athlete", "title_page": "Lunenburg Track, Field to Be Named in Honor of Former AD, Student-athlete", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lunenburg Track, Field to Be Named in Honor of Former AD, Student-athlete\nLUNENBURG -- The high school’s track and field will bear the name of former athletic director Richard Mulligan and student athlete Myles McCarron.\nSchool Committee members voted unanimously last week to name the track for Mulligan and and the field for McCarron.\n“There is no better example of what you’re looking for than naming these facilities for these two individuals,” said committee member Carol Archambault.\nThe recommendations came from Sandy Laserte who represents members from the former Lunenburg Track and Athletic Fields Association, the Miles for Myles road race committee, and the Community Foundation of North Central Massachusetts.\nThey started the process of proposing names for the track and field more than a year ago.\nMulligan,a Lunenburg high graduate, taught at the school and served as athletic director for more than 20 years. He coached basketball, track, and cross country.\nIn addition, he was recognized as athletic director of the year in 1983 and was inducted to the Mass State Track Association Hall of Fame.\n“Mully was everything in the town of Lunenburg for many, many, many years,” Laserte told the committee.\nMcCarron was a soccer player who died in a car crash in 2002.\nHis family and Laserte created the Miles for Myles 5K run, walk, and ride fundraiser, which has become a community event.\nThe race helped raise about $150,000 to build and support the track and field for over 15 years.\nTwo bronze plaques with Mulligan and McCarron’s names will be displayed at the red brick monument at the entrance to the track and field complex.\nThe Community Foundation will provide funding for the plaques.\nLaserte said the groups would like to do a dedication with the families and members of the community in the fall.\nCommittee members noted that suggested names adhered to the facility naming policy they recently approved.\nAfter some discussion about concerns, Chair Heather Sroka said the committee is not setting a precedent that it will be naming facilities constantly.\nShe added that perpetual memorials would be preferred in the form of a scholarship or award.\nFollow Mina on Twitter @mlcorpuz.", "url": "https://apnews.com/e6138286ea0842e786740c262d083784"}