{"authors": ["Al-Rasheed Benton"], "date_download": "2020-05-04 20:19:35", "date_modify": "2020-05-04 20:19:35", "date_publish": "2018-01-05 05:01:01", "description": "West Virginia University http://mountaineernewsservice.com When Bella Ross was in third grade, she was bitten on the ankle by a spider. Within hours, her leg had swollen completely and...", "filename": "_e878dfaef9e74742abd926e6a394822a_1588623575.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e878dfaef9e74742abd926e6a394822a_1588623575.html", "title": "Inaction on CHIP puts WV children at real risk", "title_page": "Inaction on CHIP puts WV children at real risk", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "West Virginia University\nhttp://mountaineernewsservice.com\nWhen Bella Ross was in third grade, she was bitten on the ankle by a spider. Within hours, her leg had swollen completely and the 12-year-old from Fairmont was in considerable pain.\n“I woke up and the swelling was all the way up my leg,” Bella recalls.\nHer mother, Lauren Ross, rushed Bella to the hospital in the middle of the night. As doctors soon discovered, she was highly allergic to the venom of the spider, causing a bacterial infection that, if left untreated, could have killed her. The doctors put Bella on a course of antibiotics, successfully treating the infection.\nBella Ross was lucky. She is one of 21,000 children in West Virginia who have health insurance thanks to the Children’s Health Insurance Program (CHIP), a federally funded program that provides insurance for children in low-income families that earn too much to qualify for Medicaid. As a single mother, Lauren Ross works full time at an MVB Bank in Fairmont, but doesn’t make enough money to buy health insurance for her child.\nThis fall, the U.S. Congress did not reauthorize the CHIP program for the first time since it was launched in 1997. As a result, up to 21,000 children in West Virginia may lose their health insurance this year.\nThe West Virginia CHIP program is already not allowing new applicants to enroll in the program. According to The Washington Post, children in six other states have faced losing CHIP health coverage by the end of 2017.\n“Each day (CHIP) goes unauthorized is another day that families and children who rely on it for their health care coverage have to live with uncertainty,” says Lisa Costello, a pediatrician at WVU Children’s Hospital who treats children insured under CHIP.\nIn early November, the U.S. House of Representatives passed a CHIP reauthorization bill, but it included a provision that would require the raising of taxes or money from other health care programs to be used to fund CHIP; the Senate has yet to pass a comparable bill.\nCongress did pass a resolution to keep the government open in December, which included about $3 billion in short-term CHIP money to keep state CHIP programs funded.\n″(West Virginia) may need to start taking administrative action to wind down the program soon if funding isn’t guaranteed,” says Kate Cassling, legislative assistant to Sen. Joe Manchin, D-W.Va. “Obviously, Congress needs to act soon.”\nIf CHIP is not reauthorized, West Virginia will be especially hard-hit because the program is now 100 percent federally funded.\nThat’s because so many people in the state fall below the national poverty line, and the Affordable Care Act, also known as Obamacare, increased financing for the program.\nWest Virginia lawmakers have decided to end CHIP by Feb. 28 if Congress does not extend its financing.\nLauren Ross says she is extremely grateful for the health coverage CHIP provides her daughter.\n“Having the CHIP program means I don’t have to panic when something is wrong with my child. I know that she’s gonna get the care she needs,” Ross says. “When your child is sick, it is the worst feeling in the world.”\nAdding Bella to her health care plan (if she can no longer be covered by CHIP) would cost Ross an additional $170 out of her biweekly pay.\n“For someone with one income, that’s a good chunk of my check,” says Ross. ”(If we lose the CHIP funding), I don’t know what we’re gonna do.”\nMountaineer News Service is produced by journalism students at West Virginia University. Students from the WVU Reed College of Media report, write and produce multi-platform news and feature packages about newsworthy subjects in West Virginia, with an emphasis on Morgantown and WVU.", "url": "https://apnews.com/e878dfaef9e74742abd926e6a394822a"}