{"authors": ["Shana Donahue"], "date_download": "2020-05-04 20:12:26", "date_modify": "2020-05-04 20:12:26", "date_publish": "2018-09-09 10:02:00", "description": "TODAY Aiken Community Theatre will perform \"The Addams Family: A Musical\" at 7:30 p.m. Sept. 13, 14 and 15, and 2 p.m. today and Sept. 16 at the AECOM Center for the Performing Arts, 126...", "filename": "_e4d72b404f8040eca16b5b8aaa811e73_1588623146.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e4d72b404f8040eca16b5b8aaa811e73_1588623146.html", "title": "Today's events for Sept. 9", "title_page": "Today's events for Sept. 9", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TODAY\nAiken Community Theatre will perform “The Addams Family: A Musical” at 7:30 p.m. Sept. 13, 14 and 15, and 2 p.m. today and Sept. 16 at the AECOM Center for the Performing Arts, 126 Newberry St. S.W. Tickets are $25 for adults, $20 for seniors age 60 and older, and $15 for students. For more information or to purchase tickets, visit aikencommunitytheatre.org.\nThe Campaign for Compassion Tour 2018 , a medical cannabis educational event, will be held from 3 to 5 p.m. Sunday at the Aiken County Historical Museum, 433 Newberry St. S.W. Guest speakers will be Quan Williams Jenkins, Sebastien Cotte and Jill Swing.\nA piano recital in honor of the recently donated conservatory-size grand piano to North Augusta High School will be held at 5 p.m. Sunday in the school’s auditorium, 2000 Knobcone Ave., North Augusta.\nThe Old Edgefield District Genealogical Society will meet at 3 p.m. Sunday in the Lynch Building Annex of the Tompkins Library, 104 Courthouse Square, Edgefield. Tom Robertson will be the guest speaker. His topic will be his book, “Resisting Sherman; A Confederate Surgeon’s Journal and the Civil War in the Carolinas, 1865. Refreshments will be served.\nMONDAY, SEPT. 10\nThe 17th annual Mended Hearts Aiken Regional Medical Centers Charity Golf Tournament will be held Monday, Sept. 10, at the Reserve Club at Woodside Plantation, 3000 Reserve Club Drive. Check-in begins at 8 a.m. with a shotgun start at 9:30 a.m. The tournament is captain’s choice, best ball-format. The cost is $240 per team. The registration deadline is Tuesday, Sept. 4. For more information or to register, call 803-644-4008.\nThe College Acres Public Works Commission will hold a public meeting at 7 p.m., Monday, Sept. 10, in the Public Works office, 33 Citadel Drive. All district resident are invited to attend.\nThe Aiken County Transportation Committee will hold a work session meeting at 6 p.m. Monday, Sept. 10, in the Sandlapper Room of the Aiken County Government Center, 1930 University Parkway. The meeting is open to the public. For more information, call 803-642-1694.\nThe Material Girls, Aiken’s American Sewing Guild group, will meet at 10 a.m. Monday, Sept. 10, at St. Augustine of Canterbury Episcopal Church, 1630 Silver Bluff Road. Guests are welcome. The project will be fabric flower pins. Basic sewing supplies will be needed including pins, needles, thread, scissors and fabric scraps. For more information, call Cheri Dowd at 803-664-0573.\nThe Carolina Pine Quilters will meet at 7 p.m. Monday, Sept. 10, at Trinity United Methodist Church, 2724 Whiskey Road. The program will be a presentation by the Fringe Sisters. They will discuss their creative process as a group and individually. They enjoy mixed-media and other styles of quilting. Guests are welcome.\nTUESDAY, SEPT. 11\nThe Aiken Newcomers’ Club will meet Tuesday, Sept. 11, at Newberry Hall, 117 Newberry St. Doors open at 9:30 a.m. followed by a business meeting at 10:15 a.m. and lunch at 11:30 a.m. This month’s program will focus on the many special interest groups available to members. Community Service will be collecting personal care items for the Cumbee Center to Assist Abused Persons. To make a reservation or cancel a reservation, call Lee Rand at 803-643-0343 (A-L) or Judy Ruocco at 803-643-5650 (M-Z) or email newcomers29803@gmail.com. Reservations or cancellations must be made by noon Thursday, Sept. 6.\nCub Scout Pack 110, BSA, sponsored by First Presbyterian Church will hold an open registration from 6:30 to 8 p.m. Tuesday, Sept. 11, in the church’s fellowship hall, 224 Barnwell Ave. N.W. Registration is open to children grades 5K-fifth grade.\nThe Suicide Bereavement Support Group will meet from 6:30 to 8 p.m. Tuesday, Sept. 11, at Mental Health America Aiken County, 233 Pendleton St. N.W. For more information, call Lisa Tindal at 803-641-4164.\nThe School District of Edgefield County will hold a regular meeting of the Board of Trustees at 7 p.m. Tuesday, Sept. 11, in the District office board room. For more information, call 803-275-4601.\nAn Alzheimer’s Support Group will meet at 11 a.m. Tuesday, Sept. 11, at the DayBreak Outreach and Training Building, 151 Linden St. Liz Neal and Linda Lucas are the facilitators.\nA Back the Badge Silent Auction and Fundraiser for first responders from 5 to 7 p.m. Tuesday, Sept. 11, at HarborChase, 1358 Silver Bluff Road. The event will feature live entertainment, cocktails and chef-prepared appetizers. Space is limited. For more information or to RSVP, call 803-642-8444.\nWEDNESDAY, SEPT. 12\nThe National Active and Retired Federal Employees Association will meet at 11 a.m. Wednesday, Sept. 12, at the Golden Corral, 2265 Whiskey Road. Andrew Marine, with the Aiken County Election Board, will be the guest speaker. His topic will be the election process and how to get involved. John Geiger also will give an updated on the national NARFE. The meeting is open to all federal employees working or retired.\nThe National Society Daughters of the American Revolution Henry Middleton Chapter will meet Wednesday, Sept. 12, at the Aiken County Historical Museum, 433 Newberry St. S.W. Social hour will be at 9:30 a.m. followed by the meeting at 10 a.m. Aiken Mayor Rick Osbon will be the guest speaker. His topic will be the Constitution and its influence in his job. For more information, call Carolyn at 803-649-7909.\nThe Cold War Patriots, a community resource organization, will hold town hall meetings for nuclear weapons workers at 10 a.m. and 2 p.m. Sep. 12-13. The morning sessions are designed for those who have applied to the Energy Employees Occupational Illness Compensation Program Act and will cover: How to file for medical expense reimbursement; how impairment evaluations can get them more monetary compensation; why they should add conditions to a claim; why in-home care might be right for them; and what to do if they are approved/pending some claims but denied others. The afternoon sessions are for those who have not yet applied for benefits, and will will cover: whether they qualify; how to apply for benefits; what benefits are included; and how to reopen denied claims. The Wednesday meeting will be held at the North Augusta Community Center, 495 Brookside Ave., North Augusta. The Thursday meeting will be held in the meeting room of St. Paul United Methodist Church, 600 Main St. S., New Ellenton. For more information, visit coldwarpatriotsorg.\nTHURSDAY, SEPT. 13\nLet’s Talk About It – Modern South Carolina Novelists will be held at 7 p.m. Sept. 13 and 20 at the Aiken County Public Library, 314 Chesterfield St. S.W. The movie, “Rich in Love,” will be shown Sept. 13 followed by a discussion with Dr. Tom Mack on Sept. 20. Participants will read, watch and compare novels to their film adaptations. The program is made possible with a grant from the S.C. Humanities and funding from Friends of the Library. The program is designed for those 18 and older. For more information, call the reference desk at 803-642-2020 x.1131.\nSingle, Single Again will meet for dinner at 6 p.m. Thursday, Sept. 13, at Longhorn Steakhouse, 2480 Whiskey Road. Reservations are due by Wednesday, Sept. 12. For more information or to make a reservation, email Carla Noziglia at skipncar@aol.com or call Jeanne Shanks at 803-663-3839.\nAiken Community Theatre will perform “The Addams Family: A Musical” at 7:30 p.m. Sept. 6, 7, 8, 13, 14 nd 15, and 2 p.m. Sept. 9 and 16 at the AECOM Center for the Performing Arts, 126 Newberry St. S.W. Tickets are $25 for adults, $20 for seniors age 60 and older, and $15 for students. For more information or to purchase tickets, visit aikencommunitytheatre.org.\nGreater Aiken SCORE will hold a workshop titled Thinking of Starting a Business from 5:30 to 7:30 p.m. Thursday, Sept. 13, at the North Augusta Chamber of Commerce, 406 West Ave., North Augusta. For more information or to register, call 803-641-1111 or visit greateraiken.score.org.\nSingle, Single Again will hold a pool party Saturday, Sept. 15. Come anytime after 2 p.m., food will be served at 4 p.m. Reservations are needed by Thursday, Sept. 13, so enough meat can be purchased. Hamburgers and hot dogs will be provided. Last names A to M should bring a salad or something similar. Last names N to Z should bring a dessert. Those attending should also bring what they want to drink. For more information or to register, call Carla Noziglia at 803-979-2059 or email skipncar@aol.com.\nThe Cold War Patriots, a community resource organization, will hold town hall meetings for nuclear weapons workers at 10 a.m. and 2 p.m. Sep. 12-13. The morning sessions are designed for those who have applied to the Energy Employees Occupational Illness Compensation Program Act and will cover: How to file for medical expense reimbursement; how impairment evaluations can get them more monetary compensation; why they should add conditions to a claim; why in-home care might be right for them; and what to do if they are approved/pending some claims but denied others. The afternoon sessions are for those who have not yet applied for benefits, and will will cover: whether they qualify; how to apply for benefits; what benefits are included; and how to reopen denied claims. The Thursday meeting will be held in the meeting room of St. Paul United Methodist Church, 600 Main St. S., New Ellenton. For more information, visit coldwarpatriotsorg.\nAn AARP Driver’s Safety class will be held from 9:15 a.m. to 1:30 p.m. Thursday, Sept. 13, in room 203 of St. Paul’s Lutheran Church, 961 Trail Ridge Road. The cost is $15 for AARP member and $20 for non-members. Snacks are permitted. Completion of the class may make students eligible for a discount on their auto insurance. For more information or to register, call Vince Jones at 803-648-1363 or 803-443-8899.\nFRIDAY, SEPT. 14\nStorytime with a special guest will be held at 11 a.m. Friday, Sept. 14, at the Aiken County Public Library, 314 Chesterfield St. S.W. Toddlers and preschoolers age 18 months to 5 years will be able to meet our friends from Aiken County Emergency Services, learn about paramedics and see and ambulance close up. For more information, visit abbe-lib.org.\nAiken Community Theatre will perform “The Addams Family: A Musical” at 7:30 p.m. Sept. 6, 7, 8, 13, 14 nd 15, and 2 p.m. Sept. 9 and 16 at the AECOM Center for the Performing Arts, 126 Newberry St. S.W. Tickets are $25 for adults, $20 for seniors age 60 and older, and $15 for students. For more information or to purchase tickets, visit aikencommunitytheatre.org.\nA weekend celebration in honor of Aiken’s African-American Excellence will be held Sept. 14-16 at the Center for African American History, Art and Culture, 120 York St. N.E. At the Center, a free youth-centered event that includes arts, crafts, food and entertainment, will be held from 5 to 7 p.m. Friday. A Celebration of Aiken’s African-American Excellence, featuring jazz, art, a silent auction and awards to community champions, will be held from 6 to 9 p.m. Saturday. A 100th anniversary celebration of the NAACP – Aiken County Branch will be held from 3 to 5 p.m. Sunday.\nBridles and Birdies will be held from 5:30 to 8:30 p.m. Friday, Sept. 14, at Aiken Horse Park, 931 Powderhouse Road S.E. Tickets are $45. For more information, visit thefirstteeaiken.org.\nSATURDAY, SEPT. 15\nAiken Community Theatre will perform “The Addams Family: A Musical” at 7:30 p.m. Sept. 6, 7, 8, 13, 14 nd 15, and 2 p.m. Sept. 9 and 16 at the AECOM Center for the Performing Arts, 126 Newberry St. S.W. Tickets are $25 for adults, $20 for seniors age 60 and older, and $15 for students. For more information or to purchase tickets, visit aikencommunitytheatre.org.\nA weekend celebration in honor of Aiken’s African-American Excellence will be held Sept. 14-16 at the Center for African American History, Art and Culture, 120 York St. N.E. At the Center, a free youth-centered event that includes arts, crafts, food and entertainment, will be held from 5 to 7 p.m. Friday. A Celebration of Aiken’s African-American Excellence, featuring jazz, art, a silent auction and awards to community champions, will be held from 6 to 9 p.m. Saturday. A 100th anniversary celebration of the NAACP – Aiken County Branch will be held from 3 to 5 p.m. Sunday.\nA Holistic Wellness Fair will be held from 9 a.m. to 3 p.m. Saturday, Sept. 15, at the H. Odell Weeks Activities Center, 1700 Whiskey Road. The event is free and open to the public, and aims to connect residents to holistic wellness providers. For more information or to be a vendor, call 803-640-0785 or visit holisticwellnessfair.org.\nThe Aiken Training Track and the Aiken Thoroughbred Racing Hall of Fame will offer an Historic Stable Experience at the Aiken Training Track Saturday, Sept. 15. Participants should wear comfortable clothing and walking shoes, and is intended for those ages 12 and older with an adult. Participants should meet in the parking lot of the Rye Patch, 100 Berrie Road, at 8:45 a.m. Registration and payment will be at the H. Odell Weeks Activities Center, 1700 Whiskey Road. For more information, call 803-643-2121 or email halloffame@cityofaikensc.gov.\nThe Phoenix Factory’s Old Edgefield Pottery will hold an Edgefield Groundhog Kiln Opening from 9 to 10 a.m. Saturday, Sept. 15. The kiln is located at 54 Crest Road, Edgefield. The ware will then be returned to the Phoenix Factory studio, 230 Simkins St., Edgefield.\nThe Aiken Community Theatre Youth Wing will meet Saturday, Sept. 15, at the AECOM Center for the Performing Arts, 126 Newberry St. Grades 3-7 will meet from 11:30 a.m. to 1 p.m. and grades 8-12 will meet from 1 to 3 p.m. The program is free and allows students the chance to attend workshops on a range of theatrical skills. Those attending should wear comfortable clothes and shoes that allow for movement. For more information, email acpyouthwing@gmail.com.\nShoutfest, a free outdoor gospel festival, will be held from 11 a.m. to 5 p.m. Saturday, Sept. 15, at Perry Memorial Park, 720 Abbeville Ave. Admission is free. For more information, visit shout947.com.\nSUNDAY, SEPT. 16\nAiken Community Theatre will perform “The Addams Family: A Musical” at 7:30 p.m. Sept. 6, 7, 8, 13, 14 nd 15, and 2 p.m. Sept. 9 and 16 at the AECOM Center for the Performing Arts, 126 Newberry St. S.W. Tickets are $25 for adults, $20 for seniors age 60 and older, and $15 for students. For more information or to purchase tickets, visit aikencommunitytheatre.org.\nA weekend celebration in honor of Aiken’s African-American Excellence will be held Sept. 14-16 at the Center for African American History, Art and Culture, 120 York St. N.E. At the Center, a free youth-centered event that includes arts, crafts, food and entertainment, will be held from 5 to 7 p.m. Friday. A Celebration of Aiken’s African-American Excellence, featuring jazz, art, a silent auction and awards to community champions, will be held from 6 to 9 p.m. Saturday. A 100th anniversary celebration of the NAACP – Aiken County Branch will be held from 3 to 5 p.m. Sunday.\nThe Aiken County Historical Society will hold its fall general meeting at 3 p.m. Sunday, Sept. 16, at the Gaston Livery Stable, 1315 Richland Ave. E. Peter Hughes will be the guest speaker. His topic will be the town of Hamburg and its founder Henry Shultz. An official State Historical Marker will be unveiled to recognize the town’s history. Tours of the restored stable also will be given. A reception will follow. For more information, call 803-649-6050. Those attending are asked to bring a lawn chair.", "url": "https://apnews.com/e4d72b404f8040eca16b5b8aaa811e73"}