{"authors": ["Dave Lavenderthe Herald-Dispatchlavender Herald-Dispatch.Com"], "date_download": "2020-05-04 20:19:43", "date_modify": "2020-05-04 20:19:43", "date_publish": "2018-03-04 09:56:09", "description": "DAVIS, W.Va. — Starting Thursday, March 8, NBC Olympics will present unprecedented coverage of the Pyeong- Chang 2018 Paralympic Winter Games. Through Sunday, March 18, there will be 94...", "filename": "_64b541ee30544743ad8e6db67fcfc1e7_1588623583.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_64b541ee30544743ad8e6db67fcfc1e7_1588623583.html", "title": "OPENING THE MOUTAINS TO ALL", "title_page": "OPENING THE MOUTAINS TO ALL", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DAVIS, W.Va. — Starting Thursday, March 8, NBC Olympics will present unprecedented coverage of the Pyeong- Chang 2018 Paralympic Winter Games.\nThrough Sunday, March 18, there will be 94 hours of TV coverage (double the coverage of Sochi 2014) and more than 250 hours of inspirational coverage on all mediums as Paralympic athletes from around the world compete in six winter sports — alpine skiing, snowboarding, ice hockey, wheelchair curling, cross-country skiing, and biathlon — spread across 10 days.\nWhile they may never make it to the Paralympics, for folks with a wide range of disabilities — from being blind to missing limbs — getting to ski in West Virginia, has never been more possible and affordable, thanks to The Challenged Athletes of West Virginia.\nFounded in 1996, the 501-c3 nonprofit based out of Snowshoe Mountain and Timberline Four Seasons Resort has helped thousands of folks with all sorts of disabilities gear up and hit the slopes at ski resorts around the Mountain State.\nA flyin’ Flynn\nFor anyone who first gets on the slopes it is a triumph of overcoming fear and anxiety to tackle what seems like a mission impossible — slip-sliding down a mountain on skies.\nBut for someone like 12-year-old Eric Flynn Jr., who lost both of his legs below the knees to a strep infection when he was 5, getting to not just ski, but to advance to carve up the hill better than most teenagers, is a game-changer.\nEric Flynn Sr. said getting on the slopes all started two years ago.\n“He has always been a crazy kid from the time that he was born, and nothing has stopped him or slowed him down,” Flynn said. “We were skiing with my brother-in-law and his cousins, and he was upset because they were going and he couldn’t.”\nThe Flynns, who live near Annapolis, Maryland, and who ski at Timberline, knew just who to enlist to rig up the right gear to get him on the mountain — Chris Ujvagi, the director of the Adaptive Ski program at Timberline through Challenged Athletes of WV.\nFor the past 22 years, Ujvagi, a Hocking College graduate, has been working out of a workshop at Timberline to use the latest advances and a whole lot of ingenuity to get anyone with a disability the right gear to get on the slopes, whether they are visually impaired or deaf, or have MS, a traumatic brain injury, autism, or any range of amputation or mobility problems.\n“Chris came up with the idea using the Enabling Technologies ski foot that they use for their sleds. We ordered the feet on a Monday, got them in on a Wednesday and were up at Timberline on a Friday,” Flynn said. “I was literally stopping at a Home Depot on the way up to get nuts and bolts, and Chris and myself and my son started drilling, and we made the feet work on the skis.”\nThanks to another boot mod by Baltimore Ski Warehouse, Flynn has been on skis for two years, skiing at Timberline as well as during annual trips to Maine and to other regional ski resorts such as Whitetail.\nThis year at Timberline, after just six skiing trips, the young flyin’ Flynn got rid of his outriggers (to help balance), got put on longer, bigger, more advanced skis and was nice enough to slow down and wait on some of his able-bodied cousins who were just learning to ski.\n“The fact that he has no legs from the knees down, it is amazing that he does it. A couple of times he has gotten cooking and has bailed pretty hard, and that’s a pretty hard lesson to learn to be humble when you’re skiing, but he is tough. He went in and got something to eat and went back and tore it up,” Flynn said. “To me as a parent it is the greatest feeling in the world.”\nA history of helping\nFounded in 1996, the CAWV operates the Adaptive Sports Center and Adaptive Ski School at Snowshoe Mountain’s Silver Creek ski area.\nCAWV also has an office at Timberline Four Seasons Resort in Davis, West Virginia, where ski instructors work at the family-owned Timberline and its neighboring state-owned Canaan Resort to help get a wide variety of folks with challenges on the mountain.\nOver MLK Weekend, 50 or 60 people with Special Love, a group of kids battling cancer, were on the slopes and tubing, and the CAWV typically hosts about 50 blind students and about 20 deaf students a year in its 300 total skiers a year.\nUjvagi, the director at Timberline, who gets help from assistant director Martin Williams and a host of ski instructors at Timberline and Canaan, said he got involved 22 years ago when he was a Courtesy Patrol and was asked to assist with the annual Lion’s Club trip for the Romney-based West Virginia Schools for the Deaf and the Blind (which has now turned into a ski trip for many other blind skiers as well).\n“You think you are pretty good at something, then you realize you have to much to learn,” Ujvagi said. “I feel like those students were able to teach me so much more than I was able to present, and I was very humbled by that experience of learning so much from someone else in an experience where you thought you were the instructor and I felt like I was the student. I still feel 22 years later that I am still learning so much from my students, that (with) each one of my students you have to be open, that each student has so much. Everyone is an individual. Instead of categorizing a student as having a visual impairment, they still are an individual. If they have a hearing impairment, or if they are an amputee, or have cerebral palsy, they are still an individual, and every person learns differently and each person has a different experience. You are an individual first.”\nA ‘Lion’s’ heart for the blind\nWere it not for the torrential rains in the past couple of weeks, this would have been the 41st year the Lion’s Clubs in West Virginia have sponsored a ski trip to Timberline for about 50 blind students from around the state and about 20 deaf students as well. And they are still holding out hope the slopes will again whiten in time for a ski trip in the next couple weeks.\nBarbara Fishel, a former district commander for the Lions, has helped this recreational program for about the past 10 years. The idea — from a teacher at the Romney-based West Virginia Schools for the Deaf and the Blind — of skiing has turned into a favorite annual trip that not only includes students from the Romney school, but also blind and deaf students in school in about six surrounding West Virginia counties.\nWhile the Lion’s Parks and Recreation program also takes the students on a number of other outings, she said the skiing trips through the years have really become something special.\n“We love Chris and the relationship we have with them,” Fishel said. “Over the years a lot of students have just first started out like, ‘No, I cannot do this, I am not going skiing,’ and then one of their friends comes back and is talking about what a good time they had, and that student is right there the next year.”\nUjvagi said, like all other ski lessons, skiing with the blind is specifically geared toward the person who can ski down and communicate with their teacher using headsets to get instructions.\n“It depends on their capabilities are. You have to use what they have,” Ujvagi said. “Some of them you can ski in front of them, and they can follow you by using what they have — you try to take advantage of what someone has and do the most with it. You can ski side by side and hold onto a bamboo pole. Some can ski with voice commands, and you can say, ‘Right, right, right,’ and ‘Left, left, left,’ and some you can hold onto their hands. There are all options, and so you don’t want to pigeonhole someone into this is the only way they can do it.”\nThe slopes open to all\nWhile the Lions’ Club’s blind ski is one of the oldest group trips coming to ski West Virginia, in recent years other large group has begun skiing and enjoying winter sports in the mountains.\nBased out of Bethesda, Maryland, Special Love has organized trips for cancer patients and their immediate family members who are 17 years of age and younger and have been treated for cancer since August 2014, as well as bereaved families with siblings 7-16 years old. The group usually has about 200 folks come to Canaan Resort.\nAt Snowshoe Mountain, the CAWV has helped coordinate such large events for the past eight years such as the Gathering of Mountain Eagles, a group of veterans and active-duty soldiers who come out to ski and who can be suffering from anything from PTSD and amputations to spinal injuries. The group also helps with The War Fighter Sports at Snowshoe, another event for veterans and their families.\nWilliams, a retired contractor who helps Ujvagi at Timberline, said they try to make sure anyone who wants to get onto the mountain can do so.\n“Sometimes it is just letting people know that this is available,” Williams said. “We were at Special Love over at Canaan, and we saw a young girl in a wheelchair. She wasn’t signed up to ski, and Chris walked up and said,′ Hey would you like to ski?′ And her mom said, ‘My daughter can’t walk,’ and we said,′ We will make it happen.’”\nUjvagi said adaptive skiing means they work with anyone with disabilities.\n“A lot of people see that we do adaptive skiing with people with disabilities and exceptionalities, but the majority have some sort of cognitive exceptionality going on, like traumatic brain injury or ADD and autism spectrum ... Yesterday we were skiing at Canaan Valley where our program works also. We had Special Love, a group of kids with cancer, and all over the spectrum there,” Ujvagi said. “Some have effected balance, coordination and muscle tones, so we work with students like that and students with MS, stroke patients, amputees, and hearing and visually impaired.”\nThe changing game for amputees and modding on the mountain\nAs will be on full display during the Paralympics, advancements in ski gear for amputees has helped get just about anyone on the slopes.\nManufacturers such as Enabling Technologies, Mountain Man and Freedom Factory make a wide range of adaptive ski gear from outriggers (think of polio crutches with ski bottoms for stabilization) to mono and bi-skis, which are one or two skis under a seat.\n“There are a bunch of manufacturers now, and everything is expensive,” Ujvagi said. “The last bi-ski we got was just under $6,000. But with a mono ski or a bi-ski someone can ski that independently. It takes a lot of work, and most of our students don’t achieve that because — like a lot of our skiers — they may come only once or twice a year. But that is a big goal of ours — to have someone to ski independently so we can get them to go ski with their family and they don’t need us out there.”\nWhile a series of bi-skis hang overhead from the rafters of the Timberline Lodge near the ski school, a lot of gear is tucked into the cozy workshop/clubhouse where Williams and Ujvagi work to make sure the gear fits the person’s specific size and need.\n“Even if we have a piece of equipment, we are always modifying it, adding extra padding or trying to make it better accommodate the certain student — everything gets modified,” Williams said.\n“Like, we had a guy who we skied with who was an incomplete quadriplegic, and we had to re-drill a set of hand-held outriggers to be able to hold them in a natural position of comfort,” Ujvagi said.\nUjvagi said if someone with a disability wants to get on the mountain all they have to do is call, and they will try their best to make it happen.\n“Ideally we say give us a call and give us a two-week headsup to make sure we have the people to make it happen and so we can talk to them about different options,” Ujvagi said. “They also have walk-ins as well, but sometimes they cannot help folks if they do not have enough staff or the right gear. If you call ahead, we can usually make it happen; if it is a walk-in, we will try our darnedest to make it happen.”\nAll of the work they say is joy when they see the result.\n“It is pretty amazing, but what I think is amazing is that you have these people whose doctors may have said you won’t be able to do this, and maybe heard at 3 years old that they would never walk, and then at age 10 they are out here skiing. So it is not that I am able to do something but that you bring these people with this drive and passion, and it makes you want to do more. It inspires me. I just happened to be able to help out with something — and sometimes it is just 15 minutes out on the snow — and the smile that it puts on the individual’s face, and the parent’s face and the caretaker’s face, it is pretty cool giving them that opportunity,” Ujvagi said as he and Williams got misty-eyed. “It gets emotional. Yesterday, one of the kids that we skied with, the mom was just over the top just cause the kid can’t get out and do things, but skiing was something he could do. Just that smile on his face and his enthusiasm that he had, makes them look forward to this trip because he is able to do something and they are able to get their whole family to the top of the mountain.”\nANYONE CAN SKI WV\nHere’s a closer look at how anyone can ski in West Virginia:\nWHAT AND WHERE: The Challenged Athletes of West Virginia operates the Adaptive Sports Center and Adaptive Ski School at Snowshoe Mountain’s Silver Creek ski area. CAWV also has an office at Timberline Four Seasons Resort in Davis, West Virginia, where ski instructors work at the family-owned Timberline and its neighboring state-owned Canaan Resort to help get a wide variety of folks with challenges on the mountain.\nABOUT THE MISSION: Its mission is to provide snow sports opportunities for children and adults with disabilities. Most of the staff are certified PSIA-adaptive ski instructors who love to help people have fun on the snow.\nWHO CAN SKI? CAWV works with both adults and children who have a variety of exceptionalities, including developmental, cognitive and behavioral disabilities; neuromuscular disabilities; visual impairment; auditory impairment; spinal cord injury and amputation. The CAWV Adaptive ski programs have a full inventory of mono-skis, bi-skis, outriggers and other equipment that can accommodate almost any skier.\nCONTACT THEM: Call CAWV at Snowshoe at 304-572-6708 and go online at https://www.snowshoemtn.com/plan-your-trip/lessons/ski-and-snowboard-school/adaptive-winter-sports-program. At Timberline/Canaan Valley, visit http://cawvtimberline. weebly.com/ and call 304-866-6333.\nHOW TO HELP: The CAWV is a 501c3 nonprofit and runs on donations. It also can use more volunteers to help on the slopes and with events. Go online at http://www.cawvsports.org.", "url": "https://apnews.com/64b541ee30544743ad8e6db67fcfc1e7"}