{"authors": ["Patrick Ethridge"], "date_download": "2020-05-04 20:18:28", "date_modify": "2020-05-04 20:18:28", "date_publish": "2018-03-28 13:14:00", "description": "Dear Annie: For the past few months, my phone has just about exploded with calls from telemarketers and scammers. I am at my wits' end! No, robot, I'm not past due on my bank payments. I don't...", "filename": "_11151b10d36440b99fd1dc16e2590b61_1588623508.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_11151b10d36440b99fd1dc16e2590b61_1588623508.html", "title": "Getting rid of junk calls", "title_page": "Getting rid of junk calls", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dear Annie: For the past few months, my phone has just about exploded with calls from telemarketers and scammers. I am at my wits’ end! No, robot, I’m not past due on my bank payments. I don’t want a free stay at your beach resort in Panama. And I’m not going to send money to you to “protect” my identity. These people have gotten so good that they’re even manipulating numbers to look like ones of relatives, with up to four of the same digits. There are more implications than my being annoyed every time I step out of my office and answer only to hear a scammer’s voice on the other end. I feel my privacy is invaded, and as a small-business owner, I have to answer every call, as it may be a client or vendor. One day, I put an unknown number straight to voicemail twice, and it turned out to be work-related. Needless to say, I was embarrassed, and she was peeved.\nIs what these companies are doing even legal? And is there any technology available to help quiet my phone lines? I find the notion of paying for that kind of service to be pretty ridiculous, but I’m not sure what else to do. I also wonder whether any of your other readers have experience with this and/or advice. -- Don’t Like This Robot Dance\nDear Don’t Like This Robot Dance: It’s not just you. In the first month of this year alone, Americans received 2.9 billion robocalls. Prerecorded sales calls are illegal unless a company has your written permission to contact you that way. The Federal Communications Commission receives more than 300,000 complaints about robocalls every month. Visit http://ftc.gov/complaint to add your voice to the deafening chorus. You can also contact your congressional representatives about the problem, with the hope that they pass better legislation to address this problem or bolster existing legislation so that it can be better enforced.\nBut if you’d like a quicker fix, consider using an app such as YouMail, RoboKiller or Truecaller, which help block robocalls to smartphones. Just be aware that these apps might also block robocalls that are actually legitimate, such as appointment reminders.\nDear Annie: For years, my husband has celebrated his birthday with cake and company. Many times, I have taken my husband and several family members and friends out to a restaurant to have a birthday party for him. However, he never seems to plan anything for my birthday. This past year, I had major orthopedic surgery, and he used that as an excuse for not planning anything again. No card, cake or best wishes; of course, no apology, either. I am tired of the one-sided plans and would just like to forget to do anything for his birthday coming up later this month. I just don’t want to be that miserable. I can’t seem to get him to see how hurt my feelings are. I’m looking for happier celebrations. -- Birthday Non-Celebrations\nDear Birthday Non-Celebrations: Have you tried telling your husband how you feel? Because though you can drop all the hints in the world, there’s no guarantee he’ll pick them up. And you’ll just grow even more frustrated. So be direct. Let him know that it’s important to you to commemorate birthdays with gifts and/or celebrations and that it means a lot to you that he do something. Perhaps he thinks of birthdays as a time to treat yourself and doesn’t realize how much it means to you that he plan something.", "url": "https://apnews.com/11151b10d36440b99fd1dc16e2590b61"}