{"authors": ["Kelly Hinchcliffe", "Wral Education Reporter"], "date_download": "2020-05-04 20:13:53", "date_modify": "2020-05-04 20:13:53", "date_publish": "2018-01-24 22:17:00", "description": "North Carolina charter schools have enrolled more than 100,000 students this school year, the first time they have surpassed that mark. The latest enrollment data on the North Carolina...", "filename": "_a2279e20d0f4920a848f1f2dc8969857_1588623233.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a2279e20d0f4920a848f1f2dc8969857_1588623233.html", "title": "NC charter schools enrollment hits 100,000 for first time", "title_page": "NC charter schools enrollment hits 100,000 for first time", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "North Carolina charter schools have enrolled more than 100,000 students this school year, the first time they have surpassed that mark.\nThe latest enrollment data on the North Carolina Department of Public Instruction’s website shows charter schools have enrolled 100,866 students in 2017-18 – a gain of more than 8,600 students from this same time last school year.\n“What a milestone worth celebrating,” said Rhonda Dillingham, executive director of NC Association for Public Charter Schools.\nTraditional public schools, which still educate the vast majority of students in North Carolina, have continued to see their numbers drop. This school year, 1,432,314 students enrolled in traditional schools, which is 4,700 fewer students than this same time last school year.\nCharter schools were created in North Carolina two decades ago and now enroll students in more than 170 schools. State funding has grown from about $16.5 million in 1997, when there were 33 schools, to more than $444 million in 2016-17.\nAccording to the latest survey of the state’s charter schools, more than 37,000 students were on wait lists to get into the schools. However, it’s difficult to verify the accuracy of those numbers because some students may be on wait lists at multiple schools. Also, only 103 of the state’s charter schools reported their wait-list numbers.\nDillingham said the numbers were “further proof that parents support school choice.”\n“It’s not surprising, considering that a recent study reveals that 63 percent of Americans believe in it as well,” she said. “Now the next step is to ensure that these young charter school students’ educations are funded equitably.”\nEnrollment has also changed at private schools. The earliest data available show more than 17,000 students enrolled in 166 private schools in North Carolina in 1961. Now, more than 100,000 students are enrolled in more than 750 schools in the state.\nHome schools were officially legalized in North Carolina in 1985 as a result of a decision by the state Supreme Court. In 1988, the North Carolina General Assembly enacted legislation defining a home school and making specific legal requirements for them. The 1985-86 school year was the first school year during which home schools were legally recognized as non-public schools.\nNorth Carolina’s home school population has surged from about 800 children in the mid-1980s to more than 127,000 in 2017", "url": "https://apnews.com/a2279e20d0f4920a848f1f2dc8969857"}