{"authors": ["Ken Borsuk"], "date_download": "2020-05-04 20:25:58", "date_modify": "2020-05-04 20:25:58", "date_publish": "2018-04-11 21:38:07", "description": "GREENWICH — The Femmes for Fiscal Freedom are no more, but if you were looking to join up with their advocacy efforts, don’t worry. Only the name of the group is changing as it will now be known...", "filename": "_8c2273ee8b01434f93ee0b8e23525730_1588623958.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8c2273ee8b01434f93ee0b8e23525730_1588623958.html", "title": "Group changes name, keeps mission", "title_page": "Group changes name, keeps mission", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GREENWICH — The Femmes for Fiscal Freedom are no more, but if you were looking to join up with their advocacy efforts, don’t worry. Only the name of the group is changing as it will now be known as Fiscal Freedom for Connecticut.\nThe town group formed earlier in the year as part of last month’s debate before the Representative Town Meeting about banning single-use plastic bags in town businesses.\nFounding member Laura Gladstone said the group retains its goal of promoting fiscally conservative policies in town and in the state. The name change is to let men know they are more than welcome to be a part of the effort too.\n“During the whole plastic bag debate we had a lot of interest from men and they wanted to join in and be a part of the group but there was some hesitation about jumping in because of the name,” Gladstone said. “We thought that was a silly reason to not have people be a part of this so we decided to make a change.”\nCurrently there are about 10 “full-time” members of Fiscal Freedom for Connecticut and Gladstone said there are about 25 more who are looking to be associated with the group.\nSeveral are are on the RTM and/or the Greenwich Republican Town Committee.\n“Right now Connecticut has so many issues with overspending and high taxes,” Gladstone said.\nShe said group members will attend Thursday’s meeting of the RTM’s Budget Overview Committee, which will consider the potential $426 million 2018-19 municipal budget.\nThe budget was proposed by First Selectman Peter Tesei, a Republican, and was approved last month by the Democratically controlled Board of Estimate and Taxation. In approving the budget, the BET used some of the town’s reserves to prevent a mill rate increase, keeping the tax rate flat from the current year. But Gladstone said the group still has concerns about taxes and spending in town.\nThe group also plans to study and weigh in on union contracts, at both the town and state level, and the possibility of returning tolls to state highways.\nGladstone said the group is opposed to tolls. A legislative committee last week moved a plan forward to place dozens of electronic tolls on Connecticut’s highways.\n“It’s another regressive attack on the poor,” Gladstone said. “The people that are commuting to the city or to Westchester County for their jobs are going to be the ones that feel the burden of this tax … And this is also unfair to small businesses in the state too.”\nThe group first surfaced during the debate over the ordinance to ban the use of plastic bags in Greenwich, which was designed to get people to use reusable bags when shopping. The ordinance initially included a fee for people who used paper shopping bags but opposition, led by members of Femmes for Fiscal Freedom, resulted in the fee being dropped.\nMembers of the group argues the fee would disproportionately hurt low-income and fixed-income residents.\nAs more people get involved, Gladstone said she expects the group to get involved in a wider array of issues. She said recently a member voiced opposition to the potential legalization of marijuana in Connecticut.\nThe formation of Fiscal Freedom for Connecticut comes after the success last year of the activist groups March on Greenwich and Indivisible Greenwich. Both formed in the wake of the 2016 election of President Donald Trump and successfully ran candidates for the RTM and had a significant impact on other municipal elections.\nJoanna Swomley, the founder of Indivisible Greenwich and a newly elected member of the RTM, said the group will remain focused mostly on federal and state issues.\n“That said, we do feel that we have made a difference locally by creating an energy that promotes civic and political engagement by a wide variety of people, including those who previously have not been engaged,” Swomley said. “We think Greenwich residents are more involved politically and hope that engagement has been inspired, in part, by the presence of our group.”\nkborsuk@greenwichtime.com", "url": "https://apnews.com/8c2273ee8b01434f93ee0b8e23525730"}