{"authors": ["Joshua Fechter"], "date_download": "2020-05-04 20:03:54", "date_modify": "2020-05-04 20:03:54", "date_publish": "2018-03-21 21:11:39", "description": "Texas shoppers could soon buy a handle of whiskey or vodka at Walmart and other publicly traded big-box retailers if a opposing group doesn’t successfully appeal a federal judge’s...", "filename": "_1cbd94365aff4cd494078adb4e86b188_1588622634.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1cbd94365aff4cd494078adb4e86b188_1588622634.html", "title": "Big box stores like Walmart could start selling liquor at its Texas stores after judge’s ruling", "title_page": "Big box stores like Walmart could start selling liquor at its Texas stores after judge’s ruling", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Big box stores like Walmart could start selling liquor at its Texas stores after judge’s ruling\nTexas shoppers could soon buy a handle of whiskey or vodka at Walmart and other publicly traded big-box retailers if a opposing group doesn’t successfully appeal a federal judge’s ruling.\nUnder state law, publicly-owned retailers like Walmart Stores Inc., Costco Wholesale Corp. and Target Corp. are prohibited from selling liquor — a rule that doesn’t apply to privately-held retailers.\nThat could change after U.S. District Judge Robert Pitman in Austin sided with Walmart late Tuesday in a federal lawsuit against the Texas Alcoholic Beverage Commission, stating in a 50-page ruling that the ban violates the Dormant Commerce Clause of the U.S. Constitution.\nRELATED: Texas businesses busted accused of substituting alcohol\nPitman also ruled against a state law prohibiting some retailers and not others from obtaining more than five permits, citing the constitution’s Equal Protection clause.\n“We applaud Judge Pitman’s order striking down Texas laws that have prevented us from fully serving our customers,” Walmart spokeswoman Anne Hatfield said in a statement. “Walmart filed suit because these laws are unfair and hurt our customers. We are grateful for Judge Pitman’s thoughtful opinion, finding that these laws violate the U.S. Constitution.”\nShoppers shouldn’t expect to immediately see liquor bottles on store shelves in Walmart, Costco and Target. Pitman put a 60-day stay on any implementation of the ruling to allow defendants ample time to appeal.\nRELATED: 15 unusual facts about Texas’ alcohol laws\nThe Texas Alcoholic Beverage Commission is currently reviewing Pitman’s ruling with the state Attorney General’s Office to decide whether to appeal, agency spokesman Chris Porter said. Porter declined to comment on the substance of the ruling but said he does not expect the ruling to be implemented until after any appeal process is exhausted.\nThe Texas Package Stores Association, an organization that represents 2,500 liquor store owners, has vowed to appeal the ruling. The group was allowed to intervene in the case in 2015.\n“The Texas Legislature put a system in place to ensure safe access to alcoholic beverages in Texas, and that system has worked for over 80 years,” Lance Lively said in a statement. “We will appeal the trial court’s decision and continue to fight for family-owned liquor store owners against the world’s largest corporate entities that seek to inflate their profits by upending sensible state laws that protect both consumers and small businesses.”\nJoshua Fechter is a San Antonio Express-News staff writer. Read more of his stories here. | jfechter@express-news.net | Twitter: @JFreports", "url": "https://apnews.com/1cbd94365aff4cd494078adb4e86b188"}