{"authors": ["Ron Haggstrom"], "date_download": "2020-05-04 20:31:46", "date_modify": "2020-05-04 20:31:46", "date_publish": "2018-03-24 16:28:08", "description": "Eastview classmates Lauren Glas and Macy Guebert embraced near halfcourt on the Target Center floor, giving each other a giant hug. The two juniors were in celebratory mode. The Lightning...", "filename": "_be0d2d562cb1445883f6d6c76c440595_1588624306.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be0d2d562cb1445883f6d6c76c440595_1588624306.html", "title": "Eastview's girls' basketball title caps lively south metro winter prep sports season", "title_page": "Eastview's girls' basketball title caps lively south metro winter prep sports season", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Eastview classmates Lauren Glas and Macy Guebert embraced near halfcourt on the Target Center floor, giving each other a giant hug. The two juniors were in celebratory mode.\nThe Lightning girls basketball players were enjoying the end of a 32-0 season and their second Class 4A state championship in the past five years. Top-ranked Eastview defeated No. 2-ranked Hopkins 68-63 in the finals.\nIt was the lone winter season team title entering the boys basketball state tournament by metro schools south of the Minnesota River, but there were plenty of other highlights from the winter season.\nHere a look back at some of the top performances:\nGirls basketball\nNearly everybody thought this would be an Eastview-Hopkins showdown. The two met earlier in the season, with the Lightning prevailing 66-56.\nIn the finals, Hopkins raced to a 13-point lead, 25-12, in the opening eight minutes. It would continue to lead until senior forward Megan Walstads jumper gave Eastview its first lead, 37-35, with 14 minutes, 16 seconds remaining. Walstad finished with a team-high 20 points.\nThe game remained close the rest of the way. Junior guard Emma Carpenters two free throws with one second left sealed the Royals fate. Hopkins missed a potential game-tying three pointer on its previous possession.\nI said that I didnt think any team can stick with us for an entire 36 minutes of playing defense and our team-first mentality, Lightning coach Molly Kasper said after the victory. Luckily, we got to play a whole game like that.\nWrestling\nThere were 42 individual champions, seven from the south metro, crowned at Xcel Energy Center in St. Paul.\nThe spotlight shone brightest on Apple Valley senior Gable Steveson. The top-ranked heavyweight in the nation won his fourth title by pinning Anoka senior Brandon Frankfurth in 17 seconds in the Class 3A finals.\nThe University of Minnesota recruit finished his prep career with a record of 210-3, with all three losses coming during his eighth-grade season. He became the 18th wrestler in state history to win four individual crowns, and finished his career winning 171 consecutive matches.\nSteveson also knows how to celebrate in style, executing a back flip for the crowd, which responded with a standing ovation.\nTeammate Nate Larson, also a senior, won the 145-pound title.\nShakopee senior Alex Lloyd won his third championship with a 6-4 victory over Anoka senior Tyler Eischens in the 152-pound finals. Eischens was riding a 97-match winning streak at the time.\nHastings senior Trey Rogers ended his career by winning the 195-pound title.\nIn Class 2A, Scott West coach Jerold Stauffacher was nearby looking on as his son, Jackson, won the 126-pound Division. It was also Jacksons final high school match.\nSimley senior Jake Gliva won the 132-pound title and junior Daniel Kerkvliet won the 220-pound championship. It was the third championship for each.\nBoys swimming\nThe Jean K. Freeman Aquatic Center on the University of Minnesota campus brought out the best in four swimmers.\nLakeville North junior Andrew Trepanier was a double winner in the Class 2A state meet. He claimed the top spot in the 50-yard freestyle with a time of 20.46 seconds and the 100-yard freestyle in 44.52 seconds.\nPrior Lake produced two individual champions in junior Sean Dwyer and senior P.J. Lenz. Dwyer won the 500 freestyle in 4:29.75 while Lenz claimed was the diving champion with a score of 467.05.\nIn the Class 1A meet, Red Wing senior William Meacham won the 100 butterfly with a time of 49.76.", "url": "https://apnews.com/be0d2d562cb1445883f6d6c76c440595"}