{"authors": ["Eric Shultz", "Staff Writer"], "date_download": "2020-05-04 20:23:04", "date_modify": "2020-05-04 20:23:04", "date_publish": "2018-07-16 00:00:00", "description": "By Eric Shultz Staff Writer DURYEA — The core of Green Ridge’s Little League majors team has been together long enough that manager Eddie Decker knew he didn’t have to say much. After Green Ridge...", "filename": "_1431ffe13c7e4aeca054f638eba95834_1588623784.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1431ffe13c7e4aeca054f638eba95834_1588623784.html", "title": "Green Ridge Eliminates PCD", "title_page": "Green Ridge Eliminates PCD", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Eric Shultz Staff Writer DURYEA — The core of Green Ridge’s Little League majors team has been together long enough that manager Eddie Decker knew he didn’t have to say much. After Green Ridge jumped out to a 5-run lead in its Section 5 elimination-bracket game Sunday evening, Pittston City/Duryea’s offense came alive in the fourth inning to tie the score. As Decker’s team got ready to bat in the fifth, he lobbed a simple question at them. “I went in and I said, ‘You guys aren’t done yet, are you?’ They just laughed,” manager Eddie Decker said. “They said, ‘We got it, Coach.’ ” Everyone was up to the challenge — all the way through Green Ridge’s roster. Substitute hitter Brian Gola singled home the go-ahead run in the fifth, and Green Ridge’s 7-run sixth inning sealed a 13-5 win over Pittston/City Duryea at Duryea Little League. “The core group of these guys have been together four years,” Decker said. “We’ve had four district titles and we’ve been in these games. I have faith in them all the time; I know they got the heart.” Green Ridge plays again tonight at 6 with a spot in the double-elimination final on the line. Just about everyone in Green Ridge’s lineup had some contribution at the plate Sunday, led by starting pitcher George Stallman’s 4-for-5 day that included a two-run blast in the opening half-inning. Stallman pitched 2⅔ innings and allowed just a hit and a walk to the eight batters he faced. Chase Scanlan batted 2 for 3 with three runs and two RBIs, winning pitcher Grace McCormack went 2 for 3 with an RBI and two runs — including the go-ahead score — and leadoff hitter Blake Decker had three hits. It was all smooth sailing at first for Green Ridge when Stallman quite literally put runs on the board with his home run that smacked off the scoreboard in centerfield. Scanlan came home later that inning, and the team’s lead grew to 5-0 in the third on Scanlan’s double to the wall and McCormack’s single through the infield. But Pittston City/Duryea ended Green Ridge’s combined one-hit bid at the midway point with a 5-run third inning. Its first three batters loaded the bases for Dom Innamorati to walk home a run, Paul Rusincovitch to bunt in another and Jake Dobrowalksi to walk in a third. Leadoff hitter Nic Borgia got his turn as Pittston City/Duryea batted around the order, and his double into the left field gap drove in the tying runs. McCormack settled in on the mound after that, though, retiring seven of the final eight batters of the game with just two balls hit past the infield. She got Green Ridge ahead 6-5, too, when Gola subbed in at the plate and lined an RBI single into center during his only chance at the plate. “He has a great bat and finally, it just takes that little click of confidence,” Decker said. “I told him (he) sparked the rest of the team.” Green Ridge put away the game in the sixth during an onslaught that included three runs from a hit batter, a walk and a wild pitch, plus RBIs by sub Nate McDonald and Brian McCormack. Decker finished the rally with a two-run single into right field. Offense like that is what manager Decker is looking for as the tournament continues today. Contact the writer: eshultz@citizensvoice.com; 570-821-2054; @CVEricShultz on Twitter.", "url": "https://apnews.com/1431ffe13c7e4aeca054f638eba95834"}