{"authors": ["Kelly Simon Ksimon Wiscnews.Com"], "date_download": "2020-05-04 20:14:04", "date_modify": "2020-05-04 20:14:04", "date_publish": "2018-03-28 18:00:00", "description": "The Beaver Dam Family Center Ice Arena was named the winner of the Ephesus Light Like the Pros national promotion, and will receive a free state-of-the-art Ephesus LED sports lighting system...", "filename": "_7a7eba7f0d784b00af83046c7a73f266_1588623244.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7a7eba7f0d784b00af83046c7a73f266_1588623244.html", "title": "Beaver Dam Family Center wins $50,000 lighting contest", "title_page": "Beaver Dam Family Center wins $50,000 lighting contest", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Beaver Dam Family Center Ice Arena was named the winner of the Ephesus Light Like the Pros national promotion, and will receive a free state-of-the-art Ephesus LED sports lighting system valued at more than $50,000.\nAt the start of the 2017-18 American Hockey League season, skating rink owners, coaches and hockey parents shared in an essay why their rink is deserving of the lighting system. The criteria to select the winning rink was based 75 percent on its vote totals online and 25 percent on an essay score.\nThe Family Center’s essay was written by Lori Uttech-Hanson and Nicole Lont. It read in part, “Our facility was made possible by the dream of a group of local residents who more than 35 years ago embarked on a major capital fundraising campaign and took out second mortgages on their homes to provide the finances needed to construct the building and institutionalize youth skating programs in our community. The Beaver Dam Family Center not only has provided amazing opportunities for our children to learn, grow and make lifelong friendships, it has also been a place where families come together putting forth hard work year after year to keep that dream alive.”\nJudges narrowed the field to 33 quarterfinalists and more than 150,000 votes were cast in three rounds of online voting from mid-January through mid-March to help determine the winner.\nThe AHL’s Milwaukee Admirals and power management company Eaton announced the Family Center as the grand prize winner Wednesday afternoon in front of hundreds of children and parents at the Family Center, 609 Gould St., Beaver Dam.\nBeaver Dam Mayor Becky Glewen thanked the Beaver Dam Hockey Association and Swan City Ice Skaters for providing positive youth development in the community and congratulated the Family Center on running a successful campaign.\nAccording to rink manager Jim Szopinski, the Family Center is on its second lighting system in the 34-year-old building.\nEaton representative Doug Drotman said the lights the Family Center will receive are the same ones that are being put in the new Milwaukee Bucks arena. The energy-efficient LED lights use less energy and emit less heat, saving additional time and energy that would be used to maintain the ice.\nAdmirals President Jon Greenberg praised the community for its dedicated voting in the contest.\n“You do amazing things in Beaver Dam,” he said. “The online votes far exceeded expectations. This was not a narrow victory; it was a blowout.”\nThe Beaver Dam Family Center is home to the Beaver Dam Hockey Association and Swan City Ice Skaters. It also is where Beaver Dam High School hockey games are played.", "url": "https://apnews.com/7a7eba7f0d784b00af83046c7a73f266"}