{"authors": [], "date_download": "2020-05-04 20:07:47", "date_modify": "2020-05-04 20:07:47", "date_publish": "2018-01-31 12:32:39", "description": "Charlotte – A week after being sentenced to 40-to-175 years in prison for sexually assaulting young athletes, Larry Nassar will face more of his victims beginning Wednesday in an Eaton County...", "filename": "_ccf57610d2fb4653838bdcfbaa43d5a0_1588622867.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ccf57610d2fb4653838bdcfbaa43d5a0_1588622867.html", "title": "Nassar faces more victims in Eaton County sentencing", "title_page": "Nassar faces more victims in Eaton County sentencing", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Charlotte – A week after being sentenced to 40-to-175 years in prison for sexually assaulting young athletes, Larry Nassar will face more of his victims beginning Wednesday in an Eaton County courtroom.\nAt least 57 women are scheduled to testify or submit written statements during Nassar’s sentencing hearing on three counts of first-degree criminal sexual conduct. Prosecutors are seeking a sentence of 40 to 125 years in prison.\nMore than 150 women delivered victim impact statements during the former sports doctor’s sentencing hearing in Ingham County Circuit Court, which lasted for seven days before Nassar, 54, was given the lengthy prison term for seven counts of first-degree criminal sexual conduct.\nNassar, who worked for Michigan State University and USA Gymnastics, previously was sentenced to 60 years in prison on federal child pornography charges.\nHe pleaded guilty to the Eaton County charges in November. They involve three women who said Nassar digitally penetrated them under the guise of medical treatment.\nAt the time of the incidents, which occurred at Geddert’s Twistars USA Gymnastics in Diamondale between 2009-11, one of the victims was younger than 13, while the other two were 13-15 years old.\nLast week, USA Gymnastics suspended the club’s owner, John Geddert, a former coach of the U.S. women’s national team.\nA Detroit News investigation found that reports of sexual misconduct involving Nassar reached 14 staff members at MSU over two decades before he was fired in September 2016. Among them was President Lou Anna Simon, who was informed in 2014 that a Title IX complaint and police report had been filed against an unnamed physician.\nSimon and Athletic Director Mark Hollis stepped down last week.\nkkozlowski@detroitnews.com", "url": "https://apnews.com/ccf57610d2fb4653838bdcfbaa43d5a0"}