{"authors": ["Ben Tarnoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Björn Westergard", "Siddharth Patel", "Kristen Sheets", "Matt Schaefer", "Samuel Earle"], "date_download": "2020-05-04 19:55:04", "date_modify": "2020-05-04 19:55:04", "date_publish": "2018-04-18 00:00:00", "description": null, "filename": "2018_04_big-tech-techlash-facebook-cambridge-analytica_1588622104.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2018/04/18102132/1207951267_acbc8e50f2_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2018_04_big-tech-techlash-facebook-cambridge-analytica_1588622104.html", "title": "A Socialist Silicon Valley", "title_page": "A Socialist Silicon Valley", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nSilicon Valley once sold a very strange idea with great success: by doing what was best for itself, it would do what was best for everyone. The idea had a long and influential life, elevating figures like Steve Jobs into cultural icons. Over the past year, though, it has reached a breaking point. The internet, we are now told, is turning people into Nazis, scaring the hell out of children, and spreading dangerous lies. Meanwhile, the four biggest tech firms boast a combined valuation of more than three trillion dollars. Companies that claim to be in the business of making the world a better place are doing good business — by making the world worse. This realization has produced a chorus of calls for tech regulation in the United States. So long as Silicon Valley was seen as humanity’s benefactor, many were content to leave it to its own devices. But as the damaging effects of those devices become clear, a growing number of American politicians seem willing to contemplate the possibility of regulating tech. Regulation probably isn’t imminent, at least in any meaningful form. The enormous sums of money that tech giants devote to lobbying, both at the federal and state levels, minimize the chances of all but the mildest measures. Still, the new mood is significant. Recent polls suggest that public opinion is shifting: big tech companies, once widely popular, are seeing their favorability ratings fall. And while robust regulation isn’t likely under the current political configuration, that may change in the coming years — especially if more progressive forces continue to gain steam and if journalists keep unearthing Silicon Valley scandals. That’s why it’s worth considering how socialists should relate to the so-called “techlash.” The conversations happening now will set the political agenda for tech in the years ahead. And those are conversations that socialists can’t afford to sit out, because tech is one of the most powerful nodes in the circuit of global capitalism. It’s precisely tech’s centrality to our current economic regime that makes the socialist perspective so vitally needed — both in accurately diagnosing the problem and in proposing effective solutions.\nThe Problem What’s wrong with tech? People are angry at Silicon Valley for a range of reasons, but perhaps the most dominant theme so far has been surveillance. The scandal surrounding Cambridge Analytica, which has elicited the most powerful reaction yet, has drawn attention to the sheer quantity of information a company like Facebook collects on its users. It does so in order to sell targeted advertising, which is the basis of its business model. The outrage is justified, but the emphasis on surveillance offers only a partial view of the problem. Apple and Amazon aren’t advertising companies, and therefore don’t have surveillance-based business models. In fact, Apple is pretty good on privacy — a fact that its CEO has recently been fond of pointing out. But that doesn’t mean that Apple and Amazon don’t inflict immense social costs, whether it’s bleeding billions from public coffers through enormous tax breaks or fostering inhumane working conditions both at home and abroad. The violation of our privacy, though important, has to be seen as one symptom among many. The problem goes deeper than Facebook’s business model, or the business model of any given tech company — the problem is business itself. So long as private firms run our economy for profit, undemocratic outcomes are inevitable. These outcomes may vary by type and intensity, but they share a common root in capitalism. This broader view of the problem helps illuminate the many linkages between issues that might otherwise seem disconnected. Tech isn’t unique: online or off, capitalists are driven by the imperative to make money. Your privacy is disappearing because it is profitable for it to disappear, just as it is profitable to dig fossil fuels out of the ground or to deny health care to millions of Americans. A small number of people get very rich, while everybody else suffers the personal, social, and ecological consequences.\nThe Solution The socialist perspective not only helps connect the dots between different injustices. It also points us towards genuinely emancipatory solutions. So far, the proposals for tech reform that have received the most mainstream attention involve new requirements around transparency and accountability, such as privacy rules that would give users greater control over their personal data. Next month, the European Union will implement a raft of new rules along these lines that will likely have a significant international impact and may serve as a blueprint for similar efforts around the world. New regulations to protect personal information are important. In isolation, however, they run the risk of reinforcing existing concentrations of private power by introducing compliance costs that only large corporations can bear. One can easily imagine a future in which Facebook accepts a few restrictions on how it can acquire and process personal data while continuing to enjoy an extremely profitable monopoly. Such is the danger of what we might call the liberal managerial model to tech, whether it’s applied to privacy or the booming field of “AI ethics.” There is no doubt that tech needs to be regulated. But compliance regimes often end up strengthening and normalizing corporate power, while defusing popular pressure from below by channeling it into opaque, bureaucratic structures that are easily manipulated by business interests. A better regulated tech industry may prevent the worst abuses, but in the absence of stronger action, it could make the tech giants even more powerful than they already are. Stronger action means striking at the roots of that power — and that means tackling tech ownership. Encouragingly, a growing antitrust current within liberal circles is raising exactly this issue. Recently formed organizations like the Open Markets Institute and the Congressional Antitrust Caucus are calling attention to corporate consolidation and demanding antitrust measures to combat it. In the case of Facebook, Open Markets Institute members Barry Lynn and Matt Stoller propose spinning WhatsApp, Instagram, and the ad network off into separate companies; banning all acquisitions for five years; and forcing the platform to adopt open standards to make it interoperable with competitors. These are good ideas, and ones that socialists should support. The antitrust toolkit is indispensable for encircling and eroding corporate power, imposing greater democratic control over the economy, and empowering workers. Antitrust liberals are advancing an unapologetically anti-corporate message that can help progressives push the Democratic Party further left. But while socialists can and should make common cause with antitrust liberals, our projects diverge in significant ways. We may agree on the need to confront big business, but we disagree on what should take its place. The antitrust answer is smaller business: they believe markets can generate good social outcomes, so long as a vigilant state acts to ensure that markets are competitive. By contrast, socialists generally want to shrink markets. In the words of Ellen Meiksins Wood, we want “the decommodification of as many spheres of life as possible and their democratization.” This means not replacing big business with small business — although that may prove a desirable short-term strategy to weaken capital — but replacing businesses big and small with publicly and cooperatively owned alternatives. It means not making markets more competitive but less dominant — less central to our survival and our flourishing and the organization of our common life.", "url": "https://www.jacobinmag.com/2018/04/big-tech-techlash-facebook-cambridge-analytica"}