{"authors": ["Tara O'Neill"], "date_download": "2020-05-04 20:26:23", "date_modify": "2020-05-04 20:26:23", "date_publish": "2018-12-29 05:00:00", "description": "BRIDGEPORT — The police department in the state’s largest city saw its share of ups and downs in 2018. Among the positive: the department added a Fusion Center to help keep an eye on crime...", "filename": "_967fc399ee2a4de1a0111d905ebf508b_1588623983.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_967fc399ee2a4de1a0111d905ebf508b_1588623983.html", "title": "Highs and lows of the Bridgeport PD in 2018", "title_page": "Highs and lows of the Bridgeport PD in 2018", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Highs and lows of the Bridgeport PD in 2018\nBRIDGEPORT — The police department in the state’s largest city saw its share of ups and downs in 2018.\nAmong the positive: the department added a Fusion Center to help keep an eye on crime and develop predictive policing measures, confirmation of acting Police Chief Armando Perez as permanent chief, and introduction of body and dashboard cameras to record police interactions with the public.\nBut the bad included a veteran cop who was accused of abusing the department’s payroll and overtime system, and the sudden retirement of Perez’s right-hand man, who left the job after racist messages allegedly sent from him surfaced.\nIn mid-February, Bridgeport police arrested Lt. Stephen Shuck for theft after a criminal investigation.\nShuck, a 34-year veteran of the department, was charged with first-degree larceny following allegations that he was abusing the payroll and overtime system. Perez announced April 20 that he had fired Shuck.\nPerez recently said the department plans to roll out a new payroll and overtime system in 2019.\nIn July, private Facebook messages of a racist manner surfaced, allegedly sent by Capt. Mark Straubel, a longtime colleague of Perez. Some the messages targeted Police Capt. Roderick Porter, the city’s highest ranking black police officer.\nStraubel retired the following month after being placed on administrative leave pending an internal investigation. An additional probe by Bridgeport State’s Attorney John Smriga found that Straubel did send private racist messages via Facebook messenger but that he did not commit a crime — though Smriga did call the messages “repugnant and alarming.”\nPerez had said the situation left him heartbroken.\nDespite 2018 being what Perez termed “a tough year,” the chief said the department has come out stronger and more prepared for 2019.\nBecoming more productive\nLt. Manuel Cotto said the department worked on some minor changes to be more productive in 2018, including fixing some broken computers to free up more time for officers to focus on community policing, traffic enforcement and more.\nOver the past 12 months, Bridgeport police lost 67 officers to retirement. But those ranks were filled and then some, Perez said, by the roughly 100 new officers that went through recruitment and joined the force.\n“Every body that’s out there helps,” Perez said.\nThe department’s biggest addition in 2018 were the body and dashboard cameras added to 255 patrol, traffic, K-9 and Tactical Narcotics Team officers and their vehicles. The program launched in August, after a pilot program earlier in the year.\nAs things were finalized for the body and dash cameras, the police department added some other technology to its arsenal.\nIn early May, the city added NexGen software to all first responders’ vehicles. The computer program allows police officers, firefighters and emergency personnel to share information with each other while responding to calls. The new program was installed to keep all agencies in the loop and improve efficiency, Perez said.\nAlso in May, Bridgeport police launched the Fusion Center at 999 Broad Street, staffed 24/7 to monitor the 1,200 cameras around the city. The center’s focus has remained the same since its first day: quality of life in the city.\n“It’s not meant to be an invasion of privacy,” Perez said recently. “It’s about keeping the Bridgeport community safe.”\nWith the Fusion Center, the department dove head-first into predictive policing. By using the cameras, police track areas where criminal activity happens repeatedly and adds additional patrol units in the area.\n“It’s data-driven analysis,” Cotto said. “We’re tracking trends. And it works.”\n“That’s the future,” Perez added.\nIn November, Bridgeport police acquired Dennis, a police dog trained in explosive detection. Perez recently said there are currently four trained K-9 officers on the force. But, he said, the department is hoping to get 25 more trained sometime in March 2019.\nIn December, the ShotSpotter system went live. The system detects and time stamps gunfire-like sounds, confirms the sound heard to be gunshots, and then triangulates where the shots were fired and alerts all Bridgeport officers to the location. All of this, Cotto said, happens in less than 45 seconds.\nOnce officers are alerted to gunfire, they’re able to tap into nearby cameras on their department-issued devices to see possible victims, suspects or suspect vehicles in the area. Cotto said the new system in no way replaces the need for residents to call 911 when they hear gunshots.\nShotSpotter also helps police with predictive policing, allowing them to dig into crimes, notice trends and “hopefully catch some of the bad guys,” Cotto said.\n“ShotSpotter is a complete game-changer,” he said. “We’re going to save lives.”", "url": "https://apnews.com/967fc399ee2a4de1a0111d905ebf508b"}