{"authors": ["Grant Traylorthe Herald-Dispatchgtraylor Herald-Dispatch.Com"], "date_download": "2020-05-04 20:15:02", "date_modify": "2020-05-04 20:15:02", "date_publish": "2018-07-13 10:10:51", "description": "HUNTINGTON — It was announced last week that A Military Tribute at The Greenbrier would move to fall in 2019 by Habibi Mamone, the tournament's executive director. On Tuesday, the PGA Tour...", "filename": "_37cce552250448ebbf0bd44188cc1f4a_1588623302.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_37cce552250448ebbf0bd44188cc1f4a_1588623302.html", "title": "Greenbrier tournament shifts to fall in 2019", "title_page": "Greenbrier tournament shifts to fall in 2019", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON — It was announced last week that A Military Tribute at The Greenbrier would move to fall in 2019 by Habibi Mamone, the tournament’s executive director.\nOn Tuesday, the PGA Tour made that move official.\nThe Tour announced its 2018-19 schedule Tuesday morning, and tournament at The Greenbrier was not among the events listed in the new schedule, which runs from this October to August 2019.\nIn the PGA’s release, it stated that two PGA tournaments — the Houston Open and A Military Tribute at The Greenbrier — were moving to the fall and would next be played as part of the 2019-20 schedule.\nThat falls in line with what\nMamone said last week when she anticipated a late September or early October date for the 2019 tournament.\n“We will be the first on the wrap-around/′ Mamone said. “We will be the first tournament of the fall, which we expect will be late September or early October.”\nThe 3M Open, hosted by TPC Twin Cities in Blaine, Minnesota, is taking the date vacated by A Military Tribute at The Greenbrier and will be played July 1-7 next year.\nThat event becomes the first PGA Tour Champions tournament to make the transition as a full PGA Tour stop.\nThe move involving the Greenbrier tournament was one of many made by the PGA Tour this week as the Tour looks to change its schedule format in an effort to finish its year-end events by the end of August.\nThe PGA Tour is making those moves so that its marquee season-end events — the FedExCup playoffs — do not have to battle other sports for exposure.\n“It’s been our stated objective for several years to create better sequencing of our tournaments that golf fans around the world can engage in from start to finish,” said PGA Tour Commissioner Jay Monahan in a statement. “And by concluding at the end of August, the FedExCup Playoffs no longer have the challenge of sharing the stage with college and professional football. This will enhance the visibility of the Fed Ex Cup Playoffs and overall fan engagement with the PGA Tour and the game as a whole.”\nIt was also announced that the Fed Ex Cup Playoffs would go from four events to three in 2018-19.\nThose events are The Northern Trust (Aug. 5-11, Liberty National Golf Club, Jersey City, New Jersey), the BMW Championship (Aug. 12-18, Medinah Country Club, Medinah, Illinois) and the Tour Championship (Aug. 19-25, East Lake Golf Club, Atlanta).\nNo official word was given by the PGA Tour on a 2019 date for A Military Tribute at The Greenbrier.", "url": "https://apnews.com/37cce552250448ebbf0bd44188cc1f4a"}