{"authors": ["T. S. Last", "Journal Staff Writer"], "date_download": "2020-05-04 20:08:10", "date_modify": "2020-05-04 20:08:10", "date_publish": "2018-12-19 00:12:36", "description": "SANTA FE ? A Santa Fe woman is suing Santa Fe city government, saying it is responsible for her home getting flooded in the so-called 1,000-year flood in July. Piper Kapin's suit in state...", "filename": "_efa9d2f10c634a25bdf4a15dc58f82ce_1588622890.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_efa9d2f10c634a25bdf4a15dc58f82ce_1588622890.html", "title": "Santa Fean says city fence clogged drainage during summer flood", "title_page": "Santa Fean says city fence clogged drainage during summer flood", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SANTA FE ? A Santa Fe woman is suing Santa Fe city government, saying it is responsible for her home getting flooded in the so-called 1,000-year flood in July.\nPiper Kapin’s suit in state court says that a six-foot chain link fence had been across a curb cut that was supposed to allow stormwater to drain into a channel leading to an arroyo at the end of Escudero Street.\nThe fence became a collector for weeds, dirt and trash, causing rainwater to back up and flood her home.\nThe lawsuit says the city installed the fence as part of its maintenance of the street.\n“As a result of the blockage, runoff was diverted onto Plaintiff’s property, causing damage to Plaintiff’s property,” the lawsuit states.\nWhile water was still backing up onto her property, Kapin and neighbors cut the fence and worked to clear the accumulated debris, according to the lawsuit.\n“As soon as the curb cut was cleared, the floodwater that was backed up in the street and onto Plaintiff’s property immediately began to drain,” the suit states.\nThe rain storm on July 23 dropped more than 3 inches of rain over an hour or so in some sections of the city. National Weather Service personnel said that so much rain fell in some parts of town that the rainfall amounted to a one-in-1,000-year occurrence for those spots.\nThe floodwaters caused extensive damage to Kapin’s home, the lawsuit says.\nShe is asking for the city to pay costs for replacing flooring in 75 percent of the home, the bottom 18 inches of sheetrock that make up the walls in the kitchen and dining room and three exterior doors. She’s also asking for costs for repair of her refrigerator, the material and labor incurred in cleaning floors and walls, and to replace a shed and portion of her driveway, among other things.\nA city of Santa Fe spokesman did not respond to a request for comment.\nA woman by the name of Piper Kapin is owner of Santa Fe’s Back Roads Pizza on Second Street and in recent years has served on the city’s Business and Quality of Life Committee and Planning Commission. Minutes from recent Planning Commission meets show that she was listed as a member of the Planning Commission through the Sept. 20 meeting, but not after that.\nThe plaintiff’s attorney would not confirm that his client is the same Piper Kapin. A message from the Journal left for her at Back Road Pizza was not returned on Tuesday.", "url": "https://apnews.com/efa9d2f10c634a25bdf4a15dc58f82ce"}