{"authors": ["Roderick Random"], "date_download": "2020-05-04 20:17:38", "date_modify": "2020-05-04 20:17:38", "date_publish": "2018-03-17 00:00:00", "description": "Lackawanna County Commissioner Patrick O’Malley honed his political persona with Easter egg hunts, Halloween parties and 5k runs. The commissioner has graduated. Nowadays, O’Malley presides over...", "filename": "_88659ad5c2534e4b9e8882b00f6909a6_1588623458.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_88659ad5c2534e4b9e8882b00f6909a6_1588623458.html", "title": "Fair Or Foul, O’Malley Employs Bread, Circuses", "title_page": "Fair Or Foul, O’Malley Employs Bread, Circuses", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Lackawanna County Commissioner Patrick O’Malley honed his political persona with Easter egg hunts, Halloween parties and 5k runs. The commissioner has graduated. Nowadays, O’Malley presides over events like the construction of a new county government center, an airport with a revived air show and, next year, a county fair. O’Malley, a Democrat now, faces re-election next year. The primary election for commissioner — when Democratic and Republican voters choose their candidates — will take place May 21, 2019. The Lackawanna County Government Center is scheduled to open by Dec. 1, five months before the primary. The next Northeast Pennsylvania Air Show is set for May 25 and 26, 2019. That’s after the primary but you can bet the airport will advertise the air show a fair amount before the election and O’Malley will campaign on its revival. The Lackawanna County Heritage Fair follows that right away from May 29 to June 2 with advertising and O’Malley credit-taking sure to precede the primary. Fair organizers might dislike hearing that their efforts will carry a political tint because they planned it for nonpolitical reasons, but O’Malley started taking credit for it at the announcement Thursday. These events plus, presumably, a third straight budget without a property tax hike will form the basis for O’Malley’s re-election bid. You can take this no-tax-hike-next-year prediction to the bank. The county won’t raise taxes because it has at least a $19.85 million surplus as of December. The 2018 budget has a $1.5 million operating deficit that commissioners said they would try to close by saving money but they have that big budget surplus to count on if they can’t find savings. That surplus won’t change much for the 2019 budget. The surplus could get smaller because of another operating deficit, but the surplus will remain large enough to cover any shortfall. County officials including Commissioner Laureen Cummings have disdained cutting into the surplus to balance the budget. They like that surpluses look good to the bankers and investors who bought the bonds the county sold to raise money for projects and pay off past, higher-interest bonds. In other words, bankers, who hate paying the taxes that only rich people pay, like estate and capital gains taxes, don’t mind much when a local government raises property taxes because that ensures they get paid back with interest. Taxpayers end up a lot unhappier. In this case, they don’t have to worry about a county tax hike for at least next year and probably beyond because of the surplus’ size. The commissioners should thank their chief financial officer, Thomas Durkin, for that. If you’re looking for a favorable backdrop to base a re-election campaign on, O’Malley starts out with a pretty good one. Commissioner Jerry Notarianni and his ally, Chuck Volpe, have predicted massive cost overruns for the county government center project, bids for which came in at $16.9 million. If the overruns materialize, that damages O’Malley and, probably, Cummings. Potentially more explosive is the claim in a federal lawsuit by women, former county inmates, who allege guards sexually abused them. They say O’Malley, a former prison guard, tipped off a female guard that she was under investigation because she never told prison higher-ups about several inmates’ abuse allegations. When state Attorney General Josh Shapiro announced the arrest of seven former prison guards last month, he said “you have to wonder how far up the chain this goes.” A lot of people wondered if “up the chain” meant O’Malley. Lawyers for O’Malley, including James A. Doherty Jr., moved to dismiss the inmates’ complaint. They alleged it contained “scandalous, impertinent and irrelevant” allegations with no basis in fact and amounted to a “lazy and desperate effort” to evade an earlier motion to dismiss. The allegations are also “patently false,” Doherty contended in court papers. Doherty’s defense of O’Malley comes with a touch of irony. Back in 2001, O’Malley ran for Scranton City Council as James A. Doherty Jr.’s brother, Chris, ran for mayor. O’Malley came to believe he lost the seat because the Doherty camp worked for the re-election of city Councilman Brian Reap, a Republican and close Chris Doherty ally at the time. Chris Doherty, a Democrat, vehemently denied “cutting” O’Malley. The female former inmates’ lawsuit comes with its own ironic connection. The women’s lawyer, Matthew Comerford, is a law partner with Paul Walker. Walker is Notarianni’s first cousin. Walker even represented Notarianni in his unsuccessful bid to get his own solicitor when O’Malley hooked up with Cummings, a Republican, to form the present unique majority on the board of commissioners. Notarianni regularly skips showing up for O’Malley-orchestrated events like the ceremonial wall-breaking for the government center. That’s where things stand now, but, hey, we’ve got 14 months to the primary election, a lifetime. BORYS KRAWCZENIUK, The Times-Tribune politics reporter, writes Random Notes.", "url": "https://apnews.com/88659ad5c2534e4b9e8882b00f6909a6"}