{"authors": ["Robert Cessna Robert.Cessna Theeagle.Com"], "date_download": "2020-05-04 20:03:49", "date_modify": "2020-05-04 20:03:49", "date_publish": "2018-04-13 05:00:00", "description": "There’s plenty for Aggies to like about Jimbo Fisher. >> Former Texas A&M coaches talk expectations for Jimbo Fisher He grew up in a loving family on a West Virginia farm, where he...", "filename": "_be441ec517c3409cb5a3f7fdff536601_1588622629.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_be441ec517c3409cb5a3f7fdff536601_1588622629.html", "title": "Jimbo Fisher's journey from West Virginia to Aggieland", "title_page": "New era begins: Jimbo Fisher's journey from West Virginia to Aggieland", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "There’s plenty for Aggies to like about Jimbo Fisher.\n>> Former Texas A&M coaches talk expectations for Jimbo Fisher <<\nHe grew up in a loving family on a West Virginia farm, where he was taught the value of hard work and the benefits of getting an education. He has an engaging personality and a burning desire to be successful.\nHe’s embraced Texas A&M and everything it has to offer, as if he’s lived here his whole life. And he plans on being here a long time and building something special.\n“It is truly a great honor and privilege to be standing in front of you in Aggieland today,” he said at his introductory press conference in December. “It really is. I’ve always admired Texas A&M from afar and appreciated what it had. I’m extremely grateful to be here at Texas A&M.”\nEarly years\nFisher was born as John James Jr. in 1965. He went by Jimmy and J.J. in his childhood, but because the family had so many Jims and variations of the name, his great aunt came up with Jimbo.\n>> Jimbo Fisher’s days at Samford played key role in career development <<\n“And that’s what stuck,” Fisher said.\nHe grew up in Clarksville, West Virginia. It’s the county seat for Harrison County, which is 40 miles southwest of Morgantown. The town put up a sign in July 2016, recognizing the 52-year-old Fisher’s roots there.\n“Growing up here, I learned the choices you make will make you who you are,” Fisher said at the unveiling. “If you control your choices, don’t follow the crowd and want to work extra hard and do more than the other guy does, good things will happen to you.”\nThat has certainly been the case for Fisher, who A&M signed to a 10-year, $75-million guaranteed contract to replace Kevin Sumlin. Fisher credits his parents for providing an environment that helped him make the right choices.\nHis father, John James Fisher, was a farmer and a coal miner who was in a mine explosion when Fisher was 2 years old. He suffered severe injuries, but battled back to return to work, an ordeal Fisher recalled during a speech at Samford University earlier this year. He eventually developed black-lung disease, suffered several strokes and died from a heart attack in 1992 at the age of 62. Fisher’s mother, Gloria, was a longtime chemistry and physics teacher in three Harrison County schools. She retired at age 76, though she’s back teaching as a full-time, 81-year-old substitute.\n“I was blessed to have two hard-working, very down-to-earth people,” Fisher said of his parents.\nFisher earned all-state honors at Clarksburg’s Liberty High School in football, basketball and baseball. He went to Clemson on a baseball scholarship, but returned home after a semester, then played quarterback at nearby Salem College. He stayed there three seasons before transferring to Samford in Birmingham, Alabama. Fisher earned NCAA Division III All-America honors in 1987, and was inducted into Samford’s Hall of Fame in February.\n“None of us ever got into athletics thinking we’re going to be in some hall of fame,” he said during his acceptance speech. “We did it because we loved what we were doing. I just loved to play.”\nFisher also discovered playing and coaching made him a better person and allowed him to help others.\n“I think athletics is a just great buffer to teach kids how to compete and do things in life,” he said. “And if you can take those same qualities on the field the coaches give you, and take them to the classroom, take them to the business world … I think you’re 10 steps ahead of everybody else in the world, because you know how to work and compete and do things.”\nCareer path\nFisher spent 17 seasons playing for or coaching with the Bowden family. He played for Terry Bowden at Salem and Samford. Terry’s brother, Jeff, was offensive coordinator at Samford during Fisher’s years there.\nFisher moved with Terry to Auburn in 1993, where he served as quarterbacks coach. And he was offensive coordinator and quarterbacks coach at Florida State under coaching legend Bobby Bowden — Terry and Jeff’s father — from 2007 to 2009, before succeeding him as head coach.\n“I mean, for years people thought I was a Bowden,” Fisher said. “Because growing up, I would go stay at their house when I was playing, or when I was at [Salem] I’d go down and be with Jeff, Tommy and Terry and stay at their house.”\nWhen Fisher started coaching, he’d go to the bowl games with the Bowdens, sitting in on the meetings, listening to Bobby’s directions.\n“That’s when he was still calling the games, calling plays,” Fisher said. “I’d sit and listen to him call games on the headset … I’d be in the box, and listen to him call games. [He] had a tremendous football mind, tremendous offensive mind. One of the greatest coaches in the history of college football, if not the greatest.”\nBut what impressed Fisher most was how Bowden carried himself and the way he treated people.\n“He could make you feel like you knew him for 20 years in the first five minutes, and it wasn’t fake,” Fisher said. “It wasn’t made up, like, ‘I’m trying to do this.’ It was just who he was and the way he was.”\nAfter leaving Auburn, Fisher spent the 1999 season on Rick Minter’s staff at Cincinnati as offensive coordinator and quarterbacks coach. Fisher then moved to LSU from 2000 to 2004 for Nick Saban, helping the Tigers win a pair of Southeastern Conference championships and a national title in 2003.\nSaban bolted to the NFL after the 2004 season, but Fisher remained in Baton Rouge for two more years under Les Miles. In Fisher’s seven seasons at LSU the Tigers were 70-20, including 41-15 in league play and a 5-2 bowl record.\nFisher said he and Saban “looked at the game very similar” during their LSU days.\n“I learned a tremendous amount about him,” Fisher said, “about his team resources, development, organization, a lot of X’s and O’s.”\nFisher left LSU to become offensive coordinator under Bobby Bowden at Florida State in 2007, and was named the head coach in waiting the following year.\nBowden turned the Seminoles into a national power in the 1980s, including a string of 14 straight 10-plus-win seasons, and national championships in 1993 and 1999. But from 2005 to 2009, Florida State took a step back, going 38-27.\nThe transition of power wasn’t a smooth one. Florida State wanted the change to happen before Bowden was ready to retire. He eventually was forced to step down after the 2009 season, something Fisher said he had no hand in because of his respect for Bowden.\nBowden expressed optimism for Fisher in the 2010 Florida State media guide: “I really have a lot of confidence in Jimbo. He is one of the sharpest coaches, young coaches I have seen. He will hire well and he will recruit well. I think he will do good.”\nFisher paid tribute to Bowden during his introductory press conference at A&M: “And a special thank you to Coach Bowden. He gave me an opportunity 11 years ago to come there and then gave me an opportunity to be a head football coach.”\nFlorida State quickly ascended under Fisher, who revamped the coaching staff, bringing in five new assistants along with a new strength and conditioning coach. His assistants included Dameyune Craig, a former quarterback he had coached at Auburn, as recruiting coordinator and quarterbacks coach. Mark Stoops was his defensive coordinator. Craig is now with Fisher at A&M, and Stoops is head coach at Kentucky.\nFisher won at least 10 games in six of his first seven seasons, with three conference championships and a national championship in 2013.\nQuarterback focus\nFisher is most demanding on his quarterbacks. His college success stories include two players selected first in the NFL Draft, JaMarcus Russell and Jameis Winston.\n>> Jimbo Fisher has earned strong reputation for developing QBs <<\n“I think when you’ve got a great quarterback, you really have a chance,” Fisher said.\nAt A&M, Fisher inherited two sophomore quarterbacks with starting experience. Nick Starkel, a redshirt sophomore, started the 2017 opener and the last four games of the season, with Kellen Mond starting the rest. They’re adapting to Fisher’s hands-on approach in the quarterback room and the practice field.\n“If we do something wrong, he’s on us,” Mond said. “If we do something right, he’s on us, because there’s a better way to do stuff. He’s trying to hold us accountable, trying to depend on us to lead the whole entire offense, the whole entire team.”\nFisher said A&M will run the football and have a balanced attack, but it starts with the guy under center.\n“That quarterback is the key,” Fisher said. “He and I have to be able to finish each other’s sentences, think alike, know alike. When I call certain plays, certain downs and distance, certain field positions, how it means different things.”\nFisher’s knack for calling plays started as a player. Tommy Rohling is a former teammate and coach at Samford, and the school’s current strength and conditioning coach. He recalled the team’s first play in the 1987 home season opener.\n“We come out, and I want to say Terry called the play off-tackle or off-guard,” Rohling said. “Well, Jimbo comes up and sees man-press, and he checks out of it, and he calls a fly pattern. And sure enough, with play-action, it’s an 80-yard touchdown.”\nThe blueprint\nFisher is taking over a program that hasn’t won a conference championship since 1998 and a national championship since 1939.\n“I talk about building our program at Texas A&M,” Fisher said. “I had to do it at Florida State. … You have to create your own culture and what you want your culture to be. How you want your people to be, how they think and believe.”\nHe twice turned down overtures from LSU to leave Florida State. But A&M was an opportunity he couldn’t turn down. Fisher had worked with current A&M athletic director Scott Woodward at LSU.\nFisher believes A&M has all the pieces in place to win. He just needs to make it happen. That encompasses physical and mental development, educating the players on and off the field and dealing with expectations.\n“We want to be hungry to win, but we’ve got to make sure we prepare to win,” Fisher said. “The power of preparation and the ability to put things in place to win are much more important than saying we’re going to win. Two plus two always equals four. If you put the right things in place, you’re going to get the results you have to have.”\nThough the SEC West is one of college football’s toughest divisions, Fisher reminded Aggies in his introductory press conference that he “grew up in this league.”\n“I coached 13 years in this league,” he said. “I understand this league. I was six years at Auburn. I was seven years at LSU. I achieved national champions in this league, conference championships in this league. It’s one of the best conferences in all of college football. It’s one of the best divisions in all of college football. We understand everything that goes with it. That’s the challenges I like. That’s what I want to be.”\nFeeling at home\nFisher has said on multiple occasions that the most surprising thing about Aggieland has been the people.\n“I’ve never been anywhere where the people genuinely lived the culture of the university in the area and they want to give back,” Fisher said. “The people are genuine, they’re honest, they’re helpful. They’ll say, ‘What can I do? What can I do?’ I’ll say, ‘I’m not sure, but just keep that thought. When I figure it out, I’ll ask ya.’”\nFisher looked like a native Texan at the Houston Livestock Show and Rodeo in March, when he rode a horse as a celebrity judge. His grandfather on his father’s side bought him a horse before he was born, and Fisher was barrel racing when he was 4 and 5 years old.\n“Matter of fact, that’s how my mom met my dad, was at a fair,” Fisher said. “He rode up to her on a horse and started talking to her, believe that or not.”\nRohling, who saw Fisher at Samford’s Hall of Fame ceremony, said that he is still the same after all these years.\n“Now, some of the West Virginia is gone,” he said, “but Jimbo is still the same hard-nosed guy who is the son of a coal miner who almost lost his life in a mine explosion, and his mother is a chemistry teacher.”\nRohling said he was surprised Fisher left Florida State, but he has no doubt Fisher is at home in Aggieland.\n“He’s not a teasip, I know that,” Rohling said. “He’s not a high-browed teasip.”\nThat’s always a great starting point for any Aggie.\n>> Cessna: Fisher’s arrival has Aggies dreaming of championships <", "url": "https://apnews.com/be441ec517c3409cb5a3f7fdff536601"}