{"authors": ["Rachel Blount"], "date_download": "2020-05-04 20:03:58", "date_modify": "2020-05-04 20:03:58", "date_publish": "2018-11-29 20:07:05", "description": "Just thinking about it makes Taylor Morgan grin. When the Gophers opponents are planning their defensive strategy, they cant focus on only one player, or two, or three. They have to worry...", "filename": "_b6688463e5c84474b0b9b3727858e728_1588622638.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b6688463e5c84474b0b9b3727858e728_1588622638.html", "title": "Hit parade: Gophers volleyball team rides five talented attackers into NCAA tournament", "title_page": "Hit parade: Gophers volleyball team rides five talented attackers into NCAA tournament", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Just thinking about it makes Taylor Morgan grin. When the Gophers opponents are planning their defensive strategy, they cant focus on only one player, or two, or three.\nThey have to worry about Morgan, a spring-loaded middle blocker who has become a lethal scorer this season. And Stephanie Samedy, an always-dangerous outside hitter. And Alexis Hart, another leaper with a loaded arm. And 6-5 Regan Pittman, and rookie powerhouse Adanna Rollins.\nWe leave everyone guessing, Morgan said. Were like gears in a machine. We all just fit together and when were going, man, theres no stopping us.\nThat free-swinging fivesome powered the Gophers to a 25-3 record, a Big Ten championship and a No. 2 seed in the NCAA tournament. Starting with Fridays first-round match against Bryant, they will take their all-for-one spirit into the postseason, hoping to ride it to the Final Four at Target Center in two weeks.\nTo score the upset, the Bulldogs will have to figure out how to stop a team that supplements Plan A with Plans B, C, D and E. Samedy, a unanimous first-team All-Big Ten selection, leads the Gophers with 326 kills. Hart (257), Pittman (249), Rollins (248) and Morgan (228) are close behind in a group that attacks with precision and power.\nSamantha Seliger-Swenson, the Big Ten player of the year, is the ringmaster whose skill as a setter keeps them all in sync. With so many mighty arms, she said, the Gophers feel confident they can handle any situation.\nIts a huge advantage, said Seliger-Swenson, who ranks seventh nationally with 11.77 assists per set. Everyone is a weapon, so the opposing defense cant just camp out on one player. They never know what to expect. It can be frustrating for them, because we have so many girls who can put it away.\nEven Morgan feels a little astonished at just how deep the Gophers have become.\nEvery time we go out there, seeing how heavy everyone hits and all the range that every hitter has, its like, Wow,andthinsp; she said.\nSeliger-Swenson said its unusual for a team to have such a wealth of reliable options. Of the five big hitters in the regular lineup, each has at least 400 kill attempts this season. The Gophers rank third in the nation in kills per set (14.93), sixth in hitting percentage (.296) and seventh in assists per set (13.78).\nThe group includes established stars, a splashy newcomer and one grinder Morgan who has found her groove after some hard-luck years. Samedy and Pittman, who ranked first and third on the team in kills as freshmen last season, have continued sharpening their games. Hart, in her third season, remains a mainstay.\nMorgan, finally healthy after multiple knee surgeries, increased her output from 0.82 kills per set in 2017 to 2.45 per set this season. Like Samedy, Rollins immediately stepped into stardom, hammering 248 kills as a six-rotation player.\nAll five earned Big Ten postseason honors this week. Samedy and Pittman were named All-Big Ten first team, while Morgan, Hart and Rollins made the second team.\nOur balance is our strength, coach Hugh McCutcheon said. The thing thats cool is when youve got a matchup that isnt working, you can go find one that is. No one person has to carry the load.\nSeliger-Swenson said the Gophers can adjust their strategy on a point-by-point basis. The five biggest hitters have a diverse skill set, giving the team multiple ways to attack. That turns many matches into games of Whac-A-Gopher; when an opposing defense shuts down one player, another instantly pops up.\nDistributing the ball among five hitters requires chemistry, too, which the Gophers have mastered through hours in the gym. Seliger-Swenson understands each hitter in great detail: the mechanics of her shot, where she wants the ball set, the situations where she is most effective. She also has a keen sense for identifying advantageous matchups, allowing her to best deploy all five.\nWhat really makes it work, though, is the Gophers willingness to share the spotlight. Samedy said there is a certain comfort in knowing that if one player falters, someone equally capable will fill the gap.\nBesides, Morgan said, its just more fun this way.\nWe love seeing each other succeed, she said. Its awesome seeing the girls do what they do best.\nIve never felt anybody [saying], Oh, I want the most swings. Or I want the most kills. We all want the same thing. We all have that same end goal.", "url": "https://apnews.com/b6688463e5c84474b0b9b3727858e728"}