{"authors": ["Register Staff Report"], "date_download": "2020-05-04 20:08:21", "date_modify": "2020-05-04 20:08:21", "date_publish": "2018-01-06 23:30:53", "description": "ROBINSON - The Mount Carmel finished 4-0 at the Robinson Duals Saturday in high School wrestling action. The Aces the host school, 43-30, the Lawrenceville, 52-30. From there, Mount Carmel...", "filename": "_943cbc8f9410431f8848cfe514d2afed_1588622901.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_943cbc8f9410431f8848cfe514d2afed_1588622901.html", "title": "Aces win four Saturday on the wrestling mat", "title_page": "Aces win four Saturday on the wrestling mat", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Aces win four Saturday on the wrestling mat\nROBINSON - The Mount Carmel finished 4-0 at the Robinson Duals Saturday in high School wrestling action.\nThe Aces the host school, 43-30, the Lawrenceville, 52-30. From there, Mount Carmel then defeated St. Joe Ogden (43-12), and went on to end the meet with a win against Cumberland, 45-19.\nThe Aces earned five pinfall victories over Robinson. Ryan Johnson pinned his 180-pound opponent in 2 minutes, 41 seconds. Dalton Farrar won at 195 pounds in 3:22 while Blake Kight won at 220 pounds at the 4:24 mark.\nDayton Hall was a winner at 113 pounds with a pin at 4:46 and Clay Critchfield won at 132 pounds in a minute, 22 seconds.\nMount Carmel continued to roll against Lawrenceville and earned five pins. Sabastain Lowe was a winner with a pin in 4:54 at the 160-pound weight class while Dalton Farrar picked up the fastest pin with his 41-second victory at 195 pounds.\nKight (220 pounds), Lowe (160 pounds and Farra (195 pounds) all earned wins against St. Joe Ogden, while Hall (113 pounds) and Critchfield (132 pounds) picked up victories against Cumberland.\nThe Aces will host Lawrenceville Monday.\nAllendale competes in WEAA tournament\nAllendale competed in the WEAA conference tournament Thursday in Cisne and opened with a loss to No. 1 seed Jasper, 60-20, in junior high boys basketball action.\nOwen Gher led the way with 10 points. Trent Casburn had four points, Bryce Lane had three points and Kollin Kelsey finished with three points.\nAllendale faces St. Joe Monday as it continues in the WEAA conference tournament. Game time is set for 6 o’clock.\nJD Bowser tied for first in the 3-point contest. Bowser connected on seven from behind the 3-point line and will shoot again Monday before the Yellow Jackets’ game.\nLady Rockets fall\nSt. Mary’s lost Tuesday night in varsity girls basketball action Tuesday, 33-26, against New Hope.\nOlivia Stinson led the Lady Rockets with eight points. Emma Keepes finished with six, and Savannah Zimmerman tallied three. Emma Frymire led New Hope in scoring with 13 points.\nSt. Mary’s won the junior varsity contest, 32-16. Mady Young was the leading scorer for the Lady Rockets with 10 points. Eden Wankel and Lexi Stevens each had six points. Nora Jones finished with four points, while Lauren Hall, Anna Gill, and Lindy Rafferty all picked up two points, respectively.\nMount Carmel wins twice during the week\nMount Carmel picked up two wins on the road in girls basketball action.\nThe Lady Aces defeated Carmi, 60-46, Tuesday then picked up the victory over Mt. Vernon (In), 55-40, on Thursday in Big Eight Conference action.\nOn Thursday, Mount Carmel senior Kylie Applebey scored her 1,000th point for her career. The milestone came from the free throw line.\nApplebey led the way against Carmi with 19 points. Baylie Ray finished with 18 points and Kassidy Drone picked up nine points.\nThe Lady Aces are now 11-6 on the season. Mount Carmel will be on the road Tuesday at Robinson.\nJr. Aces beat Carmi\nThe Mount Carmel Jr. Aces defeated Carmi Thursday evening, 42-33, in boys junior high basketball action.\nNoah Martin led the way for Mount Carmel with 15 points. He connected on six field goals and finished 3-for-4 at the free throw line. Luke Laws finished with 12 points. He scored his points on six field goals.\nMount Carmel led 10-8 at the end of the first quarter and 22-17 at the free throw line. The Jr. Aces led 33-21 at the end of the third quarter and held off a fourth-quarter run to pick up the victory.\nLuke Simon led Carmi with 21 points on 10 field goals.\nThe junior varsity for Mount Carmel won, 34-23.\nWarriors defeat Three Rivers\nWabash Valley’s Men’s basketball team opened the 2018 portion of its schedule with a 94-83 victory Wednesday against visiting Three Rivers Community College.\nMarcus Garrett led the way for the Warriors with 24 points. Tyresse Williford and Jalen Newson each scored 14 points. Jordan Bell had 11 points and Austin Trice had 10 points.\nThree Rivers was led in scoring by Charles Wilson’s 24 points. Aidan Saunders had 20 points and Keiondre Jefferson had 19 points.", "url": "https://apnews.com/943cbc8f9410431f8848cfe514d2afed"}