{"authors": ["Becky Kramer"], "date_download": "2020-05-04 20:08:57", "date_modify": "2020-05-04 20:08:57", "date_publish": "2018-02-20 00:00:00", "description": "When Shania Wright’s husband was stationed at Fairchild Air Force Base, she struggled to find hair dressers familiar with African-American styles and who stocked products suitable for her...", "filename": "_fbc540909c9440b4b05bb87b0e992f85_1588622937.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fbc540909c9440b4b05bb87b0e992f85_1588622937.html", "title": "Black Business Expo showcases economic contribution of Spokane’s African-American entrepreneurs", "title_page": "Black Business Expo showcases economic contribution of Spokane’s African-American entrepreneurs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When Shania Wright’s husband was stationed at Fairchild Air Force Base, she struggled to find hair dressers familiar with African-American styles and who stocked products suitable for her hair.\nThe experience led to WrightWay Beauty Supplies, which opened in September at 2103 N. Division St. The store – owned by Wright and her husband, Michael – sells ethnic beauty supplies.\n“We’re solving a problem for African-American women,” Michael Wright said. “We sells wigs, and we do braiding and weaves. We also sell beauty supplies, shampoos, conditioners and oils.”\nOn Sunday, the couple will be promoting their store at the Black Business Expo, which runs 2 to 5 p.m. at Emmanuel Family Life Center, 631 S. Richard Allen Court, in Spokane’s East Central neighborhood.\nThe expo is part of Black History Month observations. It’s designed to showcase the economic contributions of African-American entrepreneurs in the greater Spokane area, said Sandra Williams, editor and publisher of Black Lens News, a local African-American newspaper and one of the event’s sponsors.\nAbout 30 local companies will be featured at the expo. The businesses run the gamut from traditional black-owned enterprises such as barber shops and restaurants, to urban farmers, real estate agents and birthing coaches. To participate, a company must be 50 percent African-American owned.\nNationally, blacks make up 12 percent of the U.S. labor force, but represent only 2 percent of business ownership, according to a 2016 report published by the Center for Global Policy Solutions.\nWhen people of color start companies, they often hire other people of color, which promotes employment among minority populations, Williams said. For minorities, however, securing capital, lack of business experience and lower educational levels can be barriers to starting companies, the report said.\nSunday’s event is designed to help local African-American business owners network among themselves and also introduce them to the greater Spokane community. Williams picked Sunday for the expo, because it’s typically a day off for small-business owners.\nWilliams started Black Lens News three years ago. She ended up with handfuls of business cards from black-owned establishments, but couldn’t find any type of local, black-owned business directory that new entrepreneurs or prospective clients could consult.\n“Running a business by itself is challenging. Being a person of color launching a business is challenging,” Williams said.\nWhen minority business owners can share information, it creates a community that supports entrepreneurial efforts, she said.\nOther sponsors of Sunday’s Black Business Expo are the Spokane Ministers’ Fellowship, the Spokane NAACP and Spokane’s African American, Hispanic, Asian and Native American Business and Professional Association.\nThe Wrights, who are both Air Force veterans, were at Fairchild from 2006 to 2012. After Michael Wright’s retirement, the couple moved back to Spokane from Malmstrom Air Force Base in Great Falls to launch WrightWay Beauty Supplies.\nThey picked a Division Street location for the store so they could benefit from the exposure of high-volume vehicle traffic.\nThey also visited local black churches to introduce themselves to potential customers.\nThe couple also promotes other black-owned companies at WrightWay Beauty Supplies, Shania Wright said. Other business owners leave their cards, which the Wrights share with their customers.\n“The networking is starting to grow,” she said. “There’s a woman who runs a nursing home. She came in and talked to customers.”\nThe Wrights also used word of mouth to get information out about a black-owned photography business and a travel agency.\nWilliams said the entire Spokane community benefits when minority-owned businesses succeed.\n“If Spokane can be a place where everyone thrives, it increases the economic base for everyone,” she said.", "url": "https://apnews.com/fbc540909c9440b4b05bb87b0e992f85"}