{"authors": ["Jill Dion"], "date_download": "2020-05-04 20:06:21", "date_modify": "2020-05-04 20:06:21", "date_publish": "2019-03-18 17:24:50", "description": "MILFORD — Mayor Ben Blake has decided to sideline plans for a new police station, and neither the police chief nor the Police Commission chairman are happy about it. Milford’s aldermen voted...", "filename": "_3716aa5eb23e4c61974b4942bab7a864_1588622781.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3716aa5eb23e4c61974b4942bab7a864_1588622781.html", "title": "Milford mayor ‘taps brakes’ on new police station", "title_page": "Milford mayor ‘taps brakes’ on new police station", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MILFORD — Mayor Ben Blake has decided to sideline plans for a new police station, and neither the police chief nor the Police Commission chairman are happy about it.\nMilford’s aldermen voted in 2017 to buy land for a new police station, but the mayor said late last week he has “tapped the brakes” on the project, and is instead having city workers fix immediate problems at the existing station.\nBlake said the city might look again in a few years at building a new police station, but not now.\n“It’s a big expense,” Blake said. “It would grow our debt service considerably for the next 20 years.”\nWhile there is some disagreement about the total projected cost, Blake said the new police station will cost more than double the $30 million the city has budgeted. He also said the existing facility is in line with, if not larger than, police stations in similar towns, and he repeated what he said several months ago, that the city should continue to look at adding onto the existing building.\n“To some degree I have to be the person to say ‘it’s not in the budget’,” Blake said. “If cost was not a factor, we’d absolutely build the Taj Mahal of police stations.”\nCity leaders voted in 2017 to buy about six acres of land at 130-150 Boston Post Road for $4.5 million for a new Milford police station. The plan then was to eventually sell the current station for about $3.5 million to help recoup some of that cost.\nBlake said this week he’s gotten several offers for those six acres, and if the city doesn’t hold onto the land to build a new police station in the future, the parcel can be sold at a profit.\nPolice Chief Keith Mello saw the Boston Post Road site as a perfect location for a new station when he became chief in 2004. It wasn’t for sale then, so he’d hate to see the city let it go.\nMello said the most recent numbers as of April 2018 put construction costs for a new police station in the mid $30 million range, with total project costs at approximately $45 million.\n“I’m not sure where anyone is getting ‘more than double $30 million from,’” Mello said. And he thinks that compared to police stations built in recent years, Milford’s proposal “is on point.”\nThe current Milford police station was built in 1978 at 430 Boston Post Road, and police and other city officials have said it was too small and obsolete from day one.\n“Currently, we do not even have adequate interview rooms to conduct day-to-day operations and investigations,” Mello said. “We have over 100 male employees, but only locker space for 85. We have converted holding cells to storage spaces and we have inadequate storage for critical evidence. I think the public would be very surprised at the inadequacies of our current facilities.”\nThe current police station is about 43,000 square feet, plus another 5,000-square-foot garage. The department is also using about 12,000 square feet of space at the old Simon Lake School.\nThe chief said plans for the new station call for 63,091 square feet, plus another 14,782-square-foot garage and outbuilding.\nPolice Commission Chairman Rich Smith still wants to move forward with new construction, saying that the existing building cannot be brought up to speed. He said the building committee spent 18 months looking for ways to use the existing building.\n“We looked at constructing a second building on-site as well as an addition to the existing building,” Smith said. “We looked at cost, functionality, operations, workflow and more. After exhaustive consideration it was determined infeasible to build on the current parcel responsibly.”\nSmith said he hopes the mayor will change his mind and that the city will break ground on a new police station in the spring.\nBut Blake doesn’t seem ready to change his mind. He said the Public Works Department is addressing some of the immediate needs at the police station, reconfiguring space to allow for more locker room area, plus roof and driveway repairs. He said he wants his department heads to push for what they want, but in the end he has to weigh their views against the costs.\nBlake said the city might want to look at the idea of building a new police station in a few years.\nMello said costs will increase in the coming years and he’s upset that “after 30 years of planning, the Police Department project appears to be going nowhere.”", "url": "https://apnews.com/3716aa5eb23e4c61974b4942bab7a864"}