{"authors": ["Idaho Press Staff Newsroom Idahopress.Com"], "date_download": "2020-05-04 20:22:34", "date_modify": "2020-05-04 20:22:34", "date_publish": "2019-03-25 17:15:00", "description": "BOISE — Gov. Brad Little signed into law Friday a bill requiring all sexual assault kits be tested, except in rare cases. Previously, assault victims could refuse to have police test a rape...", "filename": "_f54e2bd23d6c457284d4712f8c862efc_1588623754.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f54e2bd23d6c457284d4712f8c862efc_1588623754.html", "title": "'Test all kits' bill signed into law", "title_page": "'Test all kits' bill signed into law", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BOISE — Gov. Brad Little signed into law Friday a bill requiring all sexual assault kits be tested, except in rare cases.\nPreviously, assault victims could refuse to have police test a rape kit, which contains DNA swabs and other evidence taken after an assault. The new law says all kits must be tested unless evidence shows the report of the assault was unfounded.\nThe goal is to get more DNA evidence in the federal database and potentially catch more offenders.\n“These are proactive efforts to stop serial offenders and seek justice for survivors,” bill sponsor Rep. Melissa Wintrow, D-Boise, said in statement Friday. “The legislation treats survivors with respect and compassion after they have just endured a traumatic event. If we are going to ask a victim to endure a long invasive process to collect evidence of a crime, then we should be testing the evidence and not let it collect dust on shelves.”\nThe bill, HB 116, follows a string of efforts by Wintrow to improve rape kit testing and tracking in Idaho. An Idaho Press investigation in 2015 found police agencies had backlogs of kits left untested on shelves, with no method for tracking when and why a kit didn’t get tested. A bill sponsored by Wintrow in 2016 and signed into law requires agencies to track the kits and report how many go untested, but it didn’t require the testing of every kit.\n“This legislation is the product of several years of work with multiple groups to come to the best solutions possible.” Wintrow stated. “Together, we will continue to build on our successes and work towards victim centered solutions where victims are treated with dignity and respect and justice is served.”", "url": "https://apnews.com/f54e2bd23d6c457284d4712f8c862efc"}