{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:23:09", "date_modify": "2020-05-04 20:23:09", "date_publish": "2019-04-25 18:00:00", "description": "Judith “Judy” Ann Marthaler, 78, Beaver Dam, passed away Sunday, April 21, 2019, at Hillside Manor in Beaver Dam. Judy was born in Beaver Dam on Oct. 5, 1940, the daughter of Raymond and...", "filename": "_7084ceb5ae074c91a7a977bdd9355e29_1588623789.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7084ceb5ae074c91a7a977bdd9355e29_1588623789.html", "title": "Judith Marthaler, 78, Beaver Dam", "title_page": "Judith Marthaler, 78, Beaver Dam", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Judith “Judy” Ann Marthaler, 78, Beaver Dam, passed away Sunday, April 21, 2019, at Hillside Manor in Beaver Dam.\nJudy was born in Beaver Dam on Oct. 5, 1940, the daughter of Raymond and Hildegarde Schmidt. On Feb. 20, 1960, she was united in marriage to Dale F. Marthaler at St. Peter’s Catholic Church in Beaver Dam. She lived in Darmstadt, Germany, for nine months while Dale proudly served his country in the U.S. Army. Judy enjoyed her job working at Gene’s Beaver Floral in Beaver Dam for several years.\nJudy is survived by her younger sister, Susie Miller of Hancock, Wisconsin; niece, Michelle Miller and her children Jordan, MacKenzie and Austin; nephew, Todd Miller and his son, Ian; niece, Debbie (Jeff) Thompson and her children, Alex and Ally; nephew, Richard (Cindy) Marthaler Jr., and his sons, Jeremy, Chad (Stef) and Cody; and further survived by Caryn Haas of Beaver Dam, who was like a daughter to Judy, along with other relatives and friends.\nShe was preceded in death by her parents; husband, Dale in 2017; brother-in-law, Richard Marthaler Sr.; and other relatives.\nHonoring her wishes, a private family service will be held.\nIf desired, memorials in Judy’s name may be directed to the Dodge County Humane Society (www.dchs-wi.org).\nCornerstone Funeral & Cremation Services, 135 Keller Blvd., Beaver Dam, is honored to be serving the family. Send private online condolences or sign the family’s guest book at cstonefs.com.", "url": "https://apnews.com/7084ceb5ae074c91a7a977bdd9355e29"}