{"authors": ["Kianna Gardner Daily Inter Lake"], "date_download": "2020-05-04 20:06:08", "date_modify": "2020-05-04 20:06:08", "date_publish": "2019-04-24 05:00:01", "description": "From the minute Kevin Riley was bludgeoned and knocked unconscious by a log under pressure from a line machine at his workplace, to the time he was transported to Kalispell Regional Medical Center...", "filename": "_09d68a6b46f241e7893b2820bf358237_1588622768.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_09d68a6b46f241e7893b2820bf358237_1588622768.html", "title": "Plains logger credits A.L.E.R.T. air ambulance for lifesaving rescue", "title_page": "Plains logger credits A.L.E.R.T. air ambulance for lifesaving rescue", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "From the minute Kevin Riley was bludgeoned and knocked unconscious by a log under pressure from a line machine at his workplace, to the time he was transported to Kalispell Regional Medical Center for life-saving surgery, was only about 56 minutes.\nBy means other than helicopter, the transfer would have taken about 1 hour and 48 minutes, which medical professionals told Riley was about 42 minutes too long.\n“Doctors said it was a matter of 10 minutes,” Riley said. “Just 10 minutes later and I would have died.”\nAnd all that happened within those 56 minutes and the following days were a complete blur to Riley, but from what others have told him, the process of delivering him to the hospital was daunting.\nIt was made especially difficult by his particular location on July 23, 2018. Riley, 25, works with a logging company and on that day was down in thick brush off the back of Blacktail Mountain and was far removed from any service roads. He was perched on a hillside at about a 45-percent grade before a stray piece of log, under hundreds of pounds of pressure, launched itself straight at Riley’s head.\n“I’m not completely sure how fast the log was moving, but I imagine it would be like someone blindsided you with a Louisville slugger,” Riley said.\nTwo Bear Air was first to arrive on the scene. A nurse rappelled from the helicopter, placed a breathing tube into Riley and induced paralysis. From there, he was hoisted about 200 feet below the helicopter itself, and was transferred to the peak of the mountain where the A.L.E.R.T. air-ambulance helicopter was waiting, ready to transport him to Kalispell Regional. It took A.L.E.R.T. pilots eight minutes to get him to the hospital, where he underwent the first of what would become multiple surgeries.\nRiley sustained multiple fractures to his skull, major brain trauma, broke his eye socket in two places, broke parts of his jaw and shattered enough bones in his left ear to leave him with about 15 percent of his hearing.\n“People who see the MRIs can’t believe I made it through, let alone believe that I’ve made full cognitive recovery,” Riley said.\nRiley spent 11 nights in Kalispell Regional before being flown to Denver, where we would spend about two months in two different facilities recovering. He saw speech, occupational and physical therapists every day. They worked with him on basic picture recognition and simple exercises to restore his equilibrium. He was asked to name objects shown in 50 pictures, of which, he only managed to get 18 correct. He recalls, with a sense of humor, describing an escalator as an “automatic staircase.”\n“I was adamant that it was a damn automatic staircase and was upset when the therapist told me it wasn’t,” Riley said.\nRiley wouldn’t return to his home in Plains until Oct. 22. And what may surprise some, Riley chose to go back to working as a logger, which he describes as a profession he looks forward to every day.\n“It’s hard to stay away. The office changes every day and I never see the same thing twice,” Riley said.\nAnd looking back now, he has many people to thank for his return to his ideal life. First is his family, who showed overwhelming support during his first stretch in the hospital at Kalispell Regional. His parents, brothers, sisters, sister-in-law and nephews would fly into Kalispell from Arizona, Chicago, Indianapolis and New York.\nSecond, his gratitude lies with the helicopter crews, first responders and medical staff.\n“Without them, I wouldn’t be here,” Riley said. “Everything they did was beyond impressive.”\nRiley became one of the more than 1,600 patients whose lives have been saved by A.L.E.R.T - the nonprofit air ambulance service of Kalispell Regional Healthcare that worked in tandem with Two Bear Air that day in June.\n“Our relationship with Two Bear Air is certainly one that we value,” said Matthew Weller, A.L.E.R.T. rotor wing chief pilot. “Their helicopter is different than ours and both our systems have different capabilities. The collaboration between the two is important.”\nIn A.L.E.R.T.’s nearly 45 years of existence, the program’s air ambulances have gone out on more than 18,300 missions, responding to anything from bear attacks to logging incidents much like Riley’s. The program’s two air ambulances are staffed 24 hours a day, seven days a week with a nurse, a medic and a pilot - a service Weller says is rare in a community the size of Flathead valley.\n“When we look at all A.L.E.R.T. has provided to the community, we are incredibly proud of that heritage,” said Weller, who has been with the program for more than a decade. “If you looked around the nation, you’d be hard-pressed to find another program like ours.”\nThe program started as the second hospital-based advanced life support helicopter system in the United States back in 1975 and was the first of its kind to manifest in a rural location.\nA.L.E.R.T has proven itself useful to the people of Flathead County and beyond and remains a leader in the air ambulance industry, which are accomplishments Weller said wouldn’t be possible without support from the community. And one of the biggest community events of the year, the A.L.E.R.T. Banquet, is right around the corner. This year marks the 41st annual banquet and will take place at the Flathead County Fairgrounds on Saturday. Proceeds from the event are the most significant in assuring A.L.E.R.T. continues to provide the level of service it does.\n“We are able to support this area to this level with help from everyone who lives in it,” Riley said. “We are grateful to the community that has supported us for decades now.”\nFor more information on the banquet and to secure tickets, contact Lori Alsbury at 406-752-1710 or lalsbury@krmc.org.\nReporter Kianna Gardner can be reached at 758-4439 or kgardner@dailyinterlake.com", "url": "https://apnews.com/09d68a6b46f241e7893b2820bf358237"}