{"authors": ["David Sherfinski The Washington Times"], "date_download": "2020-05-04 20:10:16", "date_modify": "2020-05-04 20:10:16", "date_publish": "2019-02-12 15:14:19", "description": "Rep. Mark Meadows, a leading House conservative and ally of President Trump, on Tuesday predicted that Mr. Trump will \"reluctantly\" sign an emerging deal on border security top congressional...", "filename": "_7fe84a3cb4fd7a46513477e8ed59ca3c_1588623016.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7fe84a3cb4fd7a46513477e8ed59ca3c_1588623016.html", "title": "Mark Meadows predicts Trump will 'reluctantly' sign emerging border security deal", "title_page": "Mark Meadows predicts Trump will 'reluctantly' sign emerging border security deal", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Rep. Mark Meadows, a leading House conservative and ally of President Trump, on Tuesday predicted that Mr. Trump will “reluctantly” sign an emerging deal on border security top congressional negotiators say they struck this week.\n“I think he will do so reluctantly, and then obviously have to use executive actions to secure our border,” said Mr. Meadows, who chairs the conservative House Freedom Caucus.\nMr. Meadows said he doesn’t know that the Freedom Caucus, now relegated to a slice of the minority party in the House, has the “leverage” to “go to the mats on it” at this point.\n“We don’t have leverage on this particular issue because it obviously is going to be Democrat-led, both in the House and in the Senate to get this done,” he said.\nBut members of congressional leadership from both parties are now working to sell their lawmakers on the deal, which is supposed to include $1.375 billion for border barriers.\nThat’s less than the $5.7 billion Mr. Trump has been seeking, but more than the zero dollars for barriers House Democrats initially offered.\nMr. Trump said earlier Tuesday that he wasn’t thrilled with the deal, but vowed to build a U.S.-Mexico border wall regardless.\nThere is still some question about the issue of Immigration and Customs Enforcement (ICE) detention beds, which had emerged as a key sticking point late in the negotiations.\nThe deal is supposed to set a target of getting the number of detention beds to 40,520 by October, down from about 49,000 today. Democrats had initially wanted the number cut to 34,000, with an additional cap on how many immigrants who were arrested in the interior of the country could be detained.\nBut Republicans say there’s enough funding flexibility in the deal to boost bed space close to 59,000 if necessary - well above the 52,000 the White House requested.", "url": "https://apnews.com/7fe84a3cb4fd7a46513477e8ed59ca3c"}