{"authors": ["David Sherfinski The Washington Times"], "date_download": "2020-05-04 20:18:18", "date_modify": "2020-05-04 20:18:18", "date_publish": "2019-02-28 22:54:17", "description": "Academics may debate whether President Trump has a foreign policy doctrine, but conservative activists gathered in suburban Maryland this week say there's no question he has a guiding axiom,...", "filename": "_9af6352d9619a61e483655c098c38eba_1588623498.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9af6352d9619a61e483655c098c38eba_1588623498.html", "title": "Activists at CPAC pleased with Trump's 'America First' axiom", "title_page": "Activists at CPAC pleased with Trump's 'America First' axiom", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Academics may debate whether President Trump has a foreign policy doctrine, but conservative activists gathered in suburban Maryland this week say there’s no question he has a guiding axiom, summed up in two of his favorite words: America First.\nMembers of Congress have complained about a withdrawal from the world stage and jeered the president for moving to cut U.S. military engagement in Afghanistan and Syria, but those are exactly the moves many activists at the Conservative Political Action Conference were hoping to see.\n“I think that Trump is more like Reagan. So his foreign policy is, ‘what’s good for us?’” said Andrew Boone, a retired teacher who lives in South Carolina. “If our relationship with you is going to help us, we’re all for it. And if it’s not, goodbye like he did with Rocket Man this morning,” referring to the president walking away from negotiations with North Korean dictator Kim Jong-un in Vietnam.\nMr. Boone also saw that motivation in Mr. Trump’s recent threat to cut off U.S. aid to Guatemala, Honduras and El Salvador amid issues with U.S.-bound migrant caravans.\n“We just sat back and handed out checks. No more checks and that’s what I love about him. No more checks,” Mr. Boone said. “The Democrats are screaming, ‘How do we get those countries to take care of their problems?’ I don’t know. It happens to be Honduras’s problem. Our problem is keeping our country safe. I don’t know what Honduras is going to do.”\nAngel Laboo, 19, said she doesn’t understand why some people are cool to an “America First” attitude on foreign policy.\n“I like his whole idea that we should stick [with] America and then work with other places secondary,” said Ms. Laboo, a student at Bridgewater College in Virginia. “We have to help ourselves before we can help other people.”\nThe president’s critics complain that they can’t make heads or tails of his policies, suggesting his approach to foreign affairs lacks coherence. They question his decisions to engage with leaders of North Korea and Russia, while battling traditional allies in Europe and griping about neighbors in the Western Hemisphere.\nBut Sen. Lindsey Graham, South Carolina Republican, told the crowd at CPAC in Oxon Hill that Mr. Trump has upended a stagnant world order that allowed problems to fester.\n“Why is Rocket Man talking to Trump when he’s never talked to anybody else? Because he knows Trump means business,” he said, using the president’s nickname for the North Korean dictator. “Why is the Taliban at the peace table? Because [we’ve] been kicking their ass.”\nAngelo Spanodemos, 58, said it didn’t cost Mr. Trump anything to engage with Mr. Kim at the summit in Vietnam this week.\n“He said that the sanctions issues were keeping them from moving forward, and I guess it’s understandable,” said Mr. Spanodemos, who is from Long Island, New York. ”[He’s] not giving anything away. I mean, if he would have turned around and said all right, we’re getting rid of all the sanctions to quote unquote make progress, I might not agree with that.”\nJerry Feith, a retired IRS employee from Maryland, said he wished President Barack Obama and former Secretary of State John Kerry had adopted a similar ready-to-walk attitude as Mr. Trump when they were crafting the Iran nuclear deal.\n“My sense is that he will protect the American people No. 1 and get involved as much as he thinks is necessary in order to keep us safe,” Mr. Feith said. “I think he has an IQ like Einstein.”\nMr. Feith also said Mr. Trump has made clear he’s not afraid to show force when necessary.\n“As a Jewish person, I believe he would have bombed the railroad tracks and the ovens if he was the president instead of FDR because of the type of person he is,” he said. “In Syria, when he bombed them ... they know he means business. You can’t bully him.”\nBut the praise at CPAC was not universal.\nEricka Williams, a 34-year-old investor from Texas, said she’s from a military family and she’d like to see more concrete moves to back up the president’s stated goals of ending useless entanglements.\n“I hate to say it I haven’t seen much progress other than saying we’re going to pull some people out of Afghanistan, honestly,” she said. “There’s more Navy moving to Spain, there’s more Navy going to Italy. I have a lot of friends out of Fort Bragg who just got stationed in Italy.”\nShe also said she doesn’t know what to make of how Mr. Trump has dealt with Russia and Vladimir Putin.\n“Do we talk to them? Do we not? Is there collusion? Is there not?” she said. “I would definitely love some clarity at least some closure on it. It just seems fuzzy at this point.”", "url": "https://apnews.com/9af6352d9619a61e483655c098c38eba"}