{"authors": ["Barry Eidlin", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Natasha Fernández-Silber", "Neal Meyer", "Robin Marie Averbeck"], "date_download": "2020-05-04 19:53:05", "date_modify": "2020-05-04 19:53:05", "date_publish": "2019-08-19 00:00:00", "description": null, "filename": "2019_08_what-is-socialism_1588621985.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/19210419/GettyImages-1146330449.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_what-is-socialism_1588621985.html", "title": "Why I’m a Socialist", "title_page": "Why I’m a Socialist", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Adapted from remarks given at the libertarian conference FreedomFest, billed as “the largest liberty conference of the year,” in Las Vegas on July 20, 2019. Eidlin debated John Mackey, cofounder and CEO of Whole Foods and a leading proponent of “conscious capitalism.”\nI am a socialist because I believe in freedom for all, not just for the few and the privileged. And I am a socialist because I believe in democracy, not the rule of the few and the privileged.\nCapitalism has figured out ways to generate previously unimaginable levels of wealth, creating freedom and prosperity for some. The problem is that this freedom and prosperity has been at the expense of the many. This undermines democracy and impedes social cooperation.\nOf course, prosperity and democracy have expanded over the past few centuries. But this is in spite of capitalism, not because of it. It happened because people fought to rein in capitalism. Many did so in the name of building a better world beyond capitalism. Some called that socialism, and even those who didn’t were often accused of being socialists.\nThose of us in that tradition ask a simple question: can’t we do better?\nSure, setting aside the bloodshed, dispossession, and environmental devastation, capitalism has brought about tremendous social progress. But is it really the best that humanity can do?\nAs a socialist, I believe that we can do better. In fact we must do better if we hope to continue life on this earth and avert a climate catastrophe. Because if one constant runs throughout history, it is the capacity to improve. That’s why I find the staunch defense of capitalism so puzzling. It betrays a lack of imagination and faith in the human capacity to innovate—the thing capitalism is supposed to be all about.\nWe can dream about and transform the way we communicate, the way we travel, eat, cure diseases, and make things. We can even talk about building space colonies on Mars. But when it comes to figuring out how to improve on capitalism by going beyond it, then all of a sudden, we draw a blank. Instead, we reassure ourselves that the way things are is the best they can possibly be.\nIt’s as if Henry Ford, upon completing the Model T, looked upon his creation and said “OK, we’ve surpassed the horse-drawn carriage and hand-assembly. This is the best we can do.”\nNow what would “better” look like?\nI’m not sure. Marx wrote that he had no interest in “writing recipes for the cookshops of the future,” for good reason. Since socialism is fundamentally about democracy and freedom, it stands to reason that the socialist future should be democratically developed by those who live in it, not a blueprint laid out by some self-appointed mastermind.\nStill, we need some vision of what socialism could look like. Fortunately, we don’t have to look far.\nAnother famous socialist, the Rev. Martin Luther King Jr, once said that “we have socialism for the rich and free enterprise capitalism for the poor.” What he meant was that those with wealth under capitalism have a baseline of economic security, autonomy, and freedom. They don’t have to worry about food, clothing, and shelter. They can get around with relative ease. Medical expenses and education are taken care of. They likely have a high degree of autonomy and control at work, from which they derive meaning and self-worth.\nNone of this is guaranteed under capitalism. But with wealth, you’ve got a safety net. It would take many missteps to fall into destitution.\nThat baseline gives you freedom. Freedom to take risks. Freedom to explore your creativity. Freedom to seek out new experiences. Freedom to innovate.\nThe problem is that under capitalism, that freedom is only for a select few. And despite myths about capitalism rewarding initiative, whether or not you are part of that select few largely depends on where you were born, and who your parents are.\nSocialism is the idea that everyone should have that baseline. What we each do with that would depend on our individual capacities and desires, combined with a democratic assessment of social needs, rather than being determined by what Marx called “the dull compulsion of economic relations.”\nLiberated from the day-to-day struggle for survival under capitalism, each would be free to innovate, take risks, and develop their human capacities under socialism.\nIs it realistic for everyone to have that baseline? Economically, yes. There is more global wealth today than there has ever been. It’s just poorly distributed. According to Oxfam, twenty-six people owned as much wealth as the poorest half of humanity in 2018. There’s enough to go around.\nWhy doesn’t it? There is an inexorable tendency for wealth to concentrate under capitalism. Absent a countervailing force, capitalism deprives more and more people of economic security, depriving society of their creativity and ingenuity.\nWhat is that countervailing force? Democracy.\nSocialism is about expanding democracy to more aspects of our lives. The goal is to eliminate society’s dependence on the whims of a fortunate few, and the majority’s dependence on markets for meeting their basic needs.\nDoes this mean abolishing markets? No. Markets existed before capitalism, and will exist after it’s gone. They just won’t have such a central, life-determining role.\nYou’ll have commodity markets, farmers markets, bookstores, cafés. Hopefully we won’t have to abolish Whole Foods under socialism, otherwise I won’t know where to get my aged Gouda and La Croix. I’m sure the workers can figure something out.\nWhat you won’t have are markets for labor and capital. Workers won’t be forced to sell their labor for wages, and we won’t have to depend on the whims of a small coterie of billionaires for major investments.\nInstead, we’d have a mix of self-employment, worker-owned co-ops, and publicly-owned, worker-managed firms coordinated by sectoral councils to ensure socially productive work gets done, with the surplus allocated according to democratic planning. Meanwhile, large portions of life will be decommodified. That means basic social needs like housing, health care, and education will be provided to all.\nThat’s a broad sketch, and there’s been some interesting work trying to figure out the details. If you think it sounds like an unworkable mess, think of the complexity and planning involved in running a public library system, or landing on Mars, or curing polio, or keeping Wikipedia going, and you can see that there are plenty of non-market-based ways to accomplish major tasks. We can do better than letting markets run roughshod over our lives.\nBut hasn’t socialism already failed? What about the Soviet Union? What about Venezuela? There are specifics in each case that undermined socialism, but the worst excesses of past efforts were precisely the result of deviating from socialism’s emphasis on democracy.\nStill, socialism isn’t off the hook. Some problems were systemic, problems of information sharing, coordination, resource allocation, and more. We socialists have to be honest about that. The socialist tradition that I’m a part of has always tried to honestly wrestle with those failings.\nThe question is what lessons we draw. For many here, the lesson is that socialism doesn’t work. For others, we learn from past mistakes to build something better.\nIf we were talking about anything besides socialism, this would be a natural response. Think of Silicon Valley’s approach to failure, where it’s an essential part of progress: “fail better” as the mantra goes. Why not take a similar approach to socialism?\nAfter all, past socialist societies, for all their failings, got some things right. Poverty and homelessness were generally solved. They built decent education and health systems. They made significant progress on gender and other types of equality. We can learn from their successes as well as their failures.\nThere’s a lot to figure out about socialism, but given the human capacity for creativity and innovation, we don’t have to view it as impossible. We can do better than the limited freedom and prosperity for some that we have under capitalism.\nThe question is if we dare to try.", "url": "https://www.jacobinmag.com/2019/08/what-is-socialism"}