{"authors": ["Noah Hausmann"], "date_download": "2020-05-04 20:12:47", "date_modify": "2020-05-04 20:12:47", "date_publish": "2019-04-02 12:00:00", "description": "The end portion of the pier north of the Loomis Street Boat Launch has sagged and collapsed due to erosion of the ground underneath, and the City of Ludington is asking pedestrians not to walk on...", "filename": "_9a32a7c0239145e1b5be4998e8cdead8_1588623167.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9a32a7c0239145e1b5be4998e8cdead8_1588623167.html", "title": "Walkway sunk at Loomis boat ramp", "title_page": "Walkway sunk at Loomis boat ramp", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The end portion of the pier north of the Loomis Street Boat Launch has sagged and collapsed due to erosion of the ground underneath, and the City of Ludington is asking pedestrians not to walk on the pier.\nThe Ludington Department of Public Works placed a warning barrier on the pier Monday shortly after community member Dave Dister noticed the issue and informed the city that the concrete segment closest to the end of the pier has sunken and upheaved by several inches.\nThe pier was installed nine years ago as a breakwall to prevent additional sand from encroaching upon the boat launch. The walkway on top of the pier was normally open to the public for fishing and walking to the overlook at the end, which shows a view of Lake Michigan and the north break light in the distance.\nThe ground beneath the pier was eroded due to high water levels on Lake Michigan as well as other weather events during recent years, which have all “taken a toll on the pier,” stated Ludington City Manager Mitch Foster in a press release.\n“In the fall, minor erosion was noticed underneath the pier, but not at an amount that caused any immediate concern,” Foster stated. “It was believed to be something that could be addressed this spring. As the thaw began last month, engineers were called to have them review the situation as soon as ice/snow was melted to a point where you could get on site and review from both the water and land. This was to occur within the next two weeks when the engineers were in town reviewing another item.\n“As the thawing out has occurred, it has been identified that the sagging has greatly increased to a point which is no longer safe for pedestrians to get near,” he stated.\nFoster told the Daily News that the City of Ludington will have engineers examine the pier on Wednesday morning, and that is the first step toward understanding the best way to fix the structure so that erosion should be prevented in the future. He said the U.S. Army Corps of Engineers might also be involved in the repair process, since the pier is on the Lake Michigan shoreline.\n“Once the fix options have been determined, we will share more with the public as part of the decision process,” he stated in the release.\nFoster said the engineers will probably use a boat to look at the walkway up-close. It is impossible to know for sure when the walkway sunk because, until recently, the pier was covered in ice from the freezing waves, he said.\n“You couldn’t even see it,” Foster told the Daily News. “It was still iced over, but now with (the ice) being cleaned out, you can actually get to the water and take a boat there if the ice again doesn’t build up. So that’s the other issue, just being able to get there and evaluate it better.”\nIn the meantime, members of the public should not walk past the warning barrier, Foster said. The public may be prohibited from going on the walkway at all due to safety concerns, he said, adding that the Ludington Police Department will be consulted on that decision.\n“As a request, please stay away from the pier for your safety and the preservation of the pier,” Foster stated in the release.\nFoster said the collapsed pier is the third incident of the city’s shoreline being severely eroded in recent years because of storms and Lake Michigan.\n“It’s a high water issue,” he said. “Because of all the high water we’ve had the last couple of years, this is now the third instance of high water eroding something right along the waterfront. It happened at Waterfront Park previously, the south side of that (Loomis Street Boat) Launch and now that pier.”", "url": "https://apnews.com/9a32a7c0239145e1b5be4998e8cdead8"}