{"authors": ["Sentinel"], "date_download": "2020-05-04 20:14:15", "date_modify": "2020-05-04 20:14:15", "date_publish": "2019-04-25 10:33:53", "description": "LEOMINSTER -- The New England First Amendment Coalition will present a panel discussion on the First Amendment and the free press on May 15 from 7-9 p.m. at the Leominster Public...", "filename": "_118e7a01fb8a49dd9d53b0d558f82a8d_1588623255.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_118e7a01fb8a49dd9d53b0d558f82a8d_1588623255.html", "title": "First Amendment Talk Set in Leominster", "title_page": "First Amendment Talk Set in Leominster", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LEOMINSTER -- The New England First Amendment Coalition will present a panel discussion on the First Amendment and the free press on May 15 from 7-9 p.m. at the Leominster Public Library.\nThe program is free and open to the public. It is presented as part of the library’s focus on social justice during the month of February, and its yearlong “Leominster Library University” slate of educational programs.\nSpeakers include:\n* Richard Gagliuso, an attorney and member of NEFAC’s Board of Directors\n* Justin Silverman, executive director of NEFAC, an attorney, and a former journalist and publisher.\n* Susan Spencer, a Worcester Telegram & Gazette reporter who covers Worcester County news, and health, investigative and environmental issues for the . She has worked for the daily newspaper as a staff reporter for eight years plus an additional five years as a freelance correspondent.\nTwin Cities Holocaust event May 5\nLEOMINSTER -- The annual Twin Cities Holocaust Observance, Yíom Ha Shoah, will take place at 6 p.m. Sunday, May 5 at Congregation Agudat Achim, 268 Washington St.\nThe speaker will be Dr. Benjamin Lieberman, professor of Economics, History and Political Science at Fitchburg State University. A published author, Dr. Lieberman’s topic will be “Lessons Learned from the Holocaust.”\nAdditionally there will be a special memorial candle lighting by direct descendants of Holocaust survivors and communal candle lighting by all present.\nWe invite you to join with us and Rabbi Yehoshua Zehavi, our spiritual leader, and ask that you contact Sarah Jane Acheson at Congregation Agudat Achim, 978-534-6121, for further information.", "url": "https://apnews.com/118e7a01fb8a49dd9d53b0d558f82a8d"}