{"authors": ["Caitlin M. Bagley"], "date_download": "2020-05-04 20:16:36", "date_modify": "2020-05-04 20:16:36", "date_publish": "2019-04-20 04:00:00", "description": "It’s your family’s private sanctuary, tucked into the backyard and outfitted as simply or as elaborately as suits your taste. It can rise as high as the trees, affording you a view of the...", "filename": "_2fb63a3e16b443449d71794903d37439_1588623396.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2fb63a3e16b443449d71794903d37439_1588623396.html", "title": "Home Destination: Your deck", "title_page": "Home Destination: Your deck", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s your family’s private sanctuary, tucked into the backyard and outfitted as simply or as elaborately as suits your taste. It can rise as high as the trees, affording you a view of the neighborhood that’s entirely yours. Or your deck can sit closer to the ground, opening up to a pool or a garden oasis.\nWhatever your fancy, there is so much you can do to deck out your deck these days. But first, the basics.\nDecks are relatively contemporary add-ons to homes. Architect Joshua Zinder, founder and principal of New Jersey-based Joshua Zinder Architecture + Design, says that upgrades to roofing systems in the last 20 years or so opened up this opportunity.\nFlat roofs are becoming more common in the residential market, Zinders adds, and roof decks atop structures like garages are catching on.\n“Once you have a flat surface you’re looking out on, you want to occupy that space,” he says.\nExpand the view with cable or glass rails\nAnother trend in deck design is the use of open railing systems, like steel cables or glass, instead of wooden pickets. These sleek alternatives ensure your deck follows safety codes without obstructing your view.\n“Glass rails open up a new view plane from where you’re sitting,” Zinder says. And cable rails do not occupy a lot of space, easily slipping out of your field of vision as you look out and admire your personal vista.\nIf you value privacy more than an open view, consider other rail options like vinyl or wooden lattice panels, canvas, or siding, which has the added benefit of matching or contrasting the siding on your home.\nZinder says that people are becoming more conscious of the architectural aspects of their home, and they want a deck that’s just as thoughtfully designed.\n“More and more, we’re seeing decks integrated with the architecture of the home,” Zinder says. It’s becoming a frequent request when he works on residential projects.\nModernize the Materials\nHomeowners are putting more thought into the design of their decks, as well as the materials used to build them.\n“There’s been a shift away from pressure-treated wood for decks,” Zinder says. Instead, the use of naturally durable, long-lasting and water-resistant wood, as well as composite materials, has become increasingly popular.\nAfrormosia, a rot- and bug-resistant wood native to Africa, is tough wood that holds up to challenging climates. Popular in Europe for use in home interiors, the wood darkens over time, eventually turning into a deep, rich walnut-like color.\nThen, there’s wood like ipe, a hardwood found in the rainforests of Brazil. Not only is it known for its strength - it’s a dense wood that can last for more 25 years outdoors - ipe is beautifully colored, similar in appearance to mahogany.\nThose who prefer to build with composite materials can turn to Trex, the “hassle-free” alternative to wood decking that Zinder says transformed the deck industry.\nTrex combines recycled plastic and reclaimed wood to create a high-performing, low-maintenance product that’s durable, termite-proof, and readily available in a range of fade-resistant colors to complement any home.\nPlus, according to Trex, the company saves 400 million pounds of plastic and wood from landfills each year.\n“It’s at the forefront of sustainability,” Zinder says. “It’s finding new life for what otherwise would be trash.”\nIf lumber or composite materials don’t fit the vision you have for your dream deck, Zinder suggests looking into using large-format porcelain pavers.\n“That’s the next big thing,” he says. “You’ll see a shift in people incorporating porcelain pavers in their decks.”\nLike afrormosia, porcelain pavers are trendy in Europe, but their use is catching on in the U.S. Porcelain pavers are lightweight and easy to install, and particularly suitable for roof decks. The non-porous nature of porcelain means they do not require sealing, they won’t stain, and they demonstrate superior resistance to wear, tear and weathering over time.\nPorcelain pavers can be made to look like wood, stone or tile, making it easy to achieve your desired deck aesthetic.\nDIY deck? Not so fast\nIt may be tempting to build a deck yourself, especially if you’re looking to do something simple, but it’s best to leave this kind of project to the professionals.\nFirst, depending on the scope of the project, you’ll likely need a permit. Do-it-yourself decks built without permits can come back to haunt homeowners, especially if they later try to sell the home and run into issues with a deck that’s not considered up to code. Different municipalities may also have various zoning regulations regarding decks. A professional with deck-building experience can guide you through the rules to ensure your deck is compliant and safe.\nHow the deck will attach to your home is another consideration that could require previous deck-building or other architectural experience. Your home is a structure, the deck is a separate structure: They move separately, Zinder explains, and that could create an opportunity for water infiltration into the home. You need some separation between the two structures to allow them to move independently. Again, it’s best to leave this kind of project to the pros.\nDeck it out\nSo you’ve decided to upgrade your deck - or you’re going to build something completely new - and you’ve chosen the type of railing you like best, the materials that match your vision, and hired the professional. Now it’s time to equip your backyard or rooftop hideaway with whatever suits your fancy.\nThe size for your deck will dictate its functionality. Do you have enough space for a grill, a table, chairs and an umbrella? That’s all you need to make it your go-to spot for dining al fresco. You can also easily add some color to your deck with built-in planters bursting with your favorite blooms.\nIf you have a large space to work with, the sky’s the limit (literally).\nDesignate an area for a pergola to ensure there’s a shady spot to relax beneath, no matter where the sun is shining at any point during the day. A covered pergola not only adds a sense of grandeur to your deck, it can also serve as an area to house electronic equipment, like speakers and even a TV.\nIf you want your deck to become the neighborhood hotspot for summer barbecues and parties, consider incorporating an outdoor kitchen and bar. Install a hot tub on one side of the deck, and a firepit and built-in benches on the other side.\nYour deck is what you make it. Whether you favor simple elegance, or the latest trends in modern outdoor entertaining, create your own retreat to escape to during all spring, summer, and fall.\nCaitlin M. Bagley is a freelance writer.", "url": "https://apnews.com/2fb63a3e16b443449d71794903d37439"}