{"authors": ["Jennifer Koski"], "date_download": "2020-05-04 20:22:03", "date_modify": "2020-05-04 20:22:03", "date_publish": "2019-05-01 08:00:00", "description": "It’s my earnest belief that one of the ways to stay young — or at least young at heart — is to frequently try new things. For me, that’s meant high ropes courses and windsurfing, concert...", "filename": "_0ec2a78ca40247a5942356c92850bdbd_1588623723.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0ec2a78ca40247a5942356c92850bdbd_1588623723.html", "title": "How a dare led to a new persona", "title_page": "Jen's World: How a dare led to a new persona", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s my earnest belief that one of the ways to stay young — or at least young at heart — is to frequently try new things.\nFor me, that’s meant high ropes courses and windsurfing, concert road trips and singing backup. And while it’s possible these activities haven’t actually made me any younger, they’ve sure been fun.\nOn Friday, I continued my quest for the new and exciting by attending my first-ever drag show. As in drag queen show (not to be confused with drag race show). As in The Rochester Girls.\nThe Rochester Girls is an organization that has been raising funds for area charities through drag shows for more than 20 years. And Friday’s show did not disappoint.\nIf I’d had any idea what to expect from my first drag show, this would’ve been it. Big hair. Gorgeous, over-the-top makeup. And queen after queen strutting, singing and dancing her way along the catwalk.\nI was especially excited to see longtime performer Jayda Clyne on stage. I first met Jayda as Daniel Zeller, the box office and front of house manager at Rochester Civic Theatre.\nAt the time, I didn’t know that Dan performed as Jayda — or that, when I asked him if he’d like to be interviewed for Rochester Magazine’s “Random Rochesterite” column, that I’d be getting a two-for-one.\nBut I did. During the interview, Dan told me that he’d first started performing as Jayda nearly 25 years earlier. He explained that his interest in theater, music and singing led him to drag shows as a way to express himself.\nBut, really, he said, it all started with a dare.\nIn honor of Friday’s show, I’d like to share part of Dan/Jayda’s interview here … starting with that dare.\nWhat was the dare? My friends dared me (to dress in drag) on Halloween — and when I met them at the front doors as I walked in, they didn’t know it was me. I had done my research, taking what I saw in Twin Cities’ performers and drawing that for myself.\nAs that night grew longer, I met the show director, who was standing at the bar. She said, “You look new.” I said, “Absolutely, I’ve never done this before.” She didn’t know that I’d met her before, out of drag. She invited me to do a show the next night. I showed up with two numbers — and after that I was booked the following weekend and the following weekend and that was it. It sparked an interest, a creative outlet, if you will. Imagine if I had no outlet and this was stuck inside of me!\nHow did you get the name Jayda? “Jade” has always been my favorite name — and I thought I needed to make it more difficult! So I just added the “da” and a “y.” And I’ve always been a fan of Patsy Cline, the first female country star. I thought that name sounded great, so I’m Jayda Clyne.\nYou perform with the Rochester Girls? After performing for years, I found myself involved in community activism. I found that many non-profits and organizations relied on donations, so I started getting involved in organizations that raise money for these groups. I’ve been involved in the Imperial Court of Minnesota, NSGRA (the Gay Rodeo Association), and the Rochester Girls.\nTell me about the Rochester Girls. We were started many years ago by a performer named Celeste DeVille, who unfortunately passed away in an accident. My best friend, Sidonia Dudval, continued the legacy. And in doing that, I continued to stay involved, too, helping the Rochester community raise money for various organizations — like Channel One, the Ronald McDonald House, the Women’s Shelter, American Red Cross — by performing shows.\nThat’s good work. When I hit the stage, what’s important to me is the entertainment — and not only for me to have that theatrical outlet and create that character. But it allows any patron who comes to us to escape for a little bit and not have to deal with the realness of their life. When I hit that stage, I think, “I am allowing someone here the outlet or release of five minutes — five minutes of not having to deal with something serious that they’re dealing with. Five minutes of not thinking about their issues, about their problems.” Maybe not all things need to be taken as seriously as they often are.\nHow did you introduce yourself as Jayda to your family? My family didn’t always know about Jayda, and I wasn’t sure how to introduce that to them. She was becoming a pretty significant part of my life. My partner invited some of my family members, including my mom, to a show … and that was it. And once my mom knew, I found there wasn’t anything that I needed to hide from anyone. My mom’s a huge supporter. The first time, she didn’t know what to expect — but she’s been my No. 1 fan ever since.\nWhat would you tell someone who wants to perform? Go after their dreams — because you don’t know unless you give it a chance.", "url": "https://apnews.com/0ec2a78ca40247a5942356c92850bdbd"}