{"authors": ["Megan Osborne The Herald-Dispatch Mosborne Heralddispatch.Com"], "date_download": "2020-05-04 20:09:34", "date_modify": "2020-05-04 20:09:34", "date_publish": "2019-02-24 08:50:52", "description": "CHARLESTON — A bill to increase criminal penalties for those who endanger others by operating a motor vehicle under the influence left committee Saturday and is on first reading in the West...", "filename": "_e74866cf51e44077af7a85f397392472_1588622974.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e74866cf51e44077af7a85f397392472_1588622974.html", "title": "Senate Bill 105 advances", "title_page": "Senate Bill 105 advances", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHARLESTON — A bill to increase criminal penalties for those who endanger others by operating a motor vehicle under the influence left committee Saturday and is on first reading in the West Virginia House of Delegates.\nThe bill, Senate Bill 105, was introduced by Sen. Mike Woelfel, D-Cabell, at the beginning of the legislative session following public outcry after two people were arrested in July 2018 when they crashed their vehicle near the Ritter Park playground after an overdose.\nThe one-paragraph bill reads as follows:\n“Any person who, while operating a motor vehicle ... places a non-passenger at risk of physical injury, shall be guilty of a misdemeanor and, upon conviction, shall be fined not less than $500 nor more than $1,000, confined in jail for not more than one year, or both fined and confined.”\nPreviously, laws did not provide for legal action as it pertained to the Ritter Park incident. Wanton endangerment laws criminalize weapons-related threats and impaired driving laws only accounted for an actual injury occurring.\n“It’s really a brand-new crime because it’s so unique to the situation,” Woelfel said.\nWoelfel said the bill originally only named non-passenger children but was amended before leaving committee Saturday to include adults.\nSaturday was the last day during the legislative session for legislation to leave committee.\nTabitha Wyrick, 34, and her husband, Bradley Stephen Wyrick, 33, both of Huntington, were accused of overdosing in a vehicle in a Ritter Park parking lot, which caused the vehicle to crash into a light post in the playground area. While no physical injuries were reported by parents and children, those who witnessed the crash were offered therapy to help with possible emotional issues caused by it.\nTabitha Wyrick pleaded guilty to misdemeanor driving under the influence in October 2018 and was sentenced to serve six months at Western Regional Jail in Barboursville. Her sentence began in early November. Other misdemeanor charges for assault and reckless driving were dismissed as part of the plea deal, according to Cabell Magistrate Dan Goheen.\nBradley Wyrick went before Cabell Magistrate Johnny McCallister for a bench trial Jan. 18, accused of misdemeanor charges of permitting DUI and possession of a controlled substance in the July 2018 crash.\nBradley Wyrick has not been sentenced. Assistant public defender Gerald Henderson, who represents Wyrick, said Prosecuting Attorney Sean “Corky” Hammers failed to follow a magistrate court rule requiring discovery evidence be disclosed within 21 days of the Jan. 18 scheduled trial.\nBradley Wyrick’s bench trial originally was set for Nov. 29, but the prosecutor’s office also did not provide evidence that would be introduced or a list of witnesses who would testify, Henderson said. That case was granted a continuance after Huntington Police Cpl. Joey Koher, the investigating officer, did not show up.", "url": "https://apnews.com/e74866cf51e44077af7a85f397392472"}