{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:26:23", "date_modify": "2020-05-04 20:26:23", "date_publish": "2019-03-22 05:00:01", "description": "The Libby Asbestos Superfund Advisory Team will meet at 2 p.m. Tuesday, March 26, in Helena at the Montana Department of Environmental Quality Metcalf Building, 1520 E. Sixth Ave., Room 111....", "filename": "_a47119a05e0547499d770421980638b0_1588623983.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a47119a05e0547499d770421980638b0_1588623983.html", "title": "Libby Superfund team goes to Helena to discuss cleanup", "title_page": "Libby Superfund team goes to Helena to discuss cleanup", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Libby Asbestos Superfund Advisory Team will meet at 2 p.m. Tuesday, March 26, in Helena at the Montana Department of Environmental Quality Metcalf Building, 1520 E. Sixth Ave., Room 111. Attendees may also participate remotely by phone and online.\nThe team was established by the 2017 Legislature to enhance communication among Libby Asbestos Superfund cleanup stakeholders. In addition, the team will advise DEQ on administration of the Libby Asbestos Cleanup Trust Fund and operation and maintenance accounts. As cleanup nears its end in many of the Operable Units of the Libby Asbestos Site, Montana DEQ and the U.S. Environmental Protection Agency will work with the team and the community to establish institutional controls and define operations and maintenance activities to protect the cleanup.\nThe agenda will include 2019 legislation (House Bill 30), updates, and the opportunity for public comment. Information about the currently scheduled meeting, team members and past meetings (including agendas, approved minutes and documents) may be found at: http://deq.mt.gov/DEQAdmin/dir/libby/SATeam\nTo attend remotely:\nStep 1: On your computer, go to https://rtchelena.mt.gov/meet/christine.mandiloff/WQV5035L and follow the instructions. This will allow you to view meeting documents.\nStep 2: On your phone, call 406-444-4647. The conference ID is 9506905. Do not press star when asked if you are the leader. Wait for the next prompt to say your name and you will be connected to the meeting. This will allow you to listen to the meeting and participate in the public comment period. If you require assistance to attend the meeting remotely, please contact Christine Mandiloff in advance of the meeting at 406-444-6469 or by email at: christine.mandiloff@mt.gov\nDEQ will make reasonable accommodations for persons with disabilities who wish to participate in the meeting. Please contact Joann Wiggins at (406) 444-6795 or by email at: jwiggins@mt.gov", "url": "https://apnews.com/a47119a05e0547499d770421980638b0"}