{"authors": ["Mark Reagan Staff Writer"], "date_download": "2020-05-04 20:11:36", "date_modify": "2020-05-04 20:11:36", "date_publish": "2019-01-31 04:30:00", "description": "Cameron County Elections Administrator Remi Garza says officials are working to determine the accuracy of a list of voters released by the Texas Secretary of State's Office of nearly 100,000...", "filename": "_74476cf51f8c4ea3b77619dde117b0c8_1588623096.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_74476cf51f8c4ea3b77619dde117b0c8_1588623096.html", "title": "Official concerned over accuracy of list of ineligible voters", "title_page": "Official concerned over accuracy of list of ineligible voters", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Cameron County Elections Administrator Remi Garza says officials are working to determine the accuracy of a list of voters released by the Texas Secretary of State’s Office of nearly 100,000 registered voters who may not be U.S. citizens.\nHowever, Garza said elections staff here are not sure how accurate information provided to him for Cameron County actually is.\nAccording to the Secretary of State’s Office, it discovered that approximately 95,000 people identified by the Texas Department of Public Safety as non-U.S. citizens have matching voter registration records here, including approximately 58,000 who have voted in one or more Texas elections between 1996 and 2018. Only U.S. citizens are allowed to vote and anyone who knows they are not eligible to vote and vote anyway are committing a second-degree felony.\nGarza said the Secretary of State’s Office sent him the list Monday morning that included a little more than 1,600 people it says that it identified as non-citizens registered to vote in Cameron County through Texas Department of Public Safety records.\nHowever, on Tuesday morning, the Secretary of State’s Office called him to say that 1,592 people should not have been on the list, dropping the number of individuals down to 30.\nTo make matters more confusing for Garza, the Secretary of State’s Office called less than three hours later to tell him that the original list of a little more than 1,600 was correct.\nSince then, Garza said his office has been able to remove 300 people from the list after determining they are citizens.\n\"So we are reviewing 1,300 names as of this morning,\" Garza said.\nElections officials are trying to determine whether some of the people DPS flagged on the list sent to Cameron County have since become naturalized U.S. citizens.\n\"We are trying to look at the dates of when that happened, of when they were at DPS and when they registered to vote to kind of see if we could identify a progression of them obtaining citizenship,\" Garza said.\nBut he’s moving cautiously.\n\"I mean, to take action against somebody’s voter registration status based on something that inaccurate was a little uncomfortable for me,\" Garza said of his concerns over the list’s accuracy.\nThe Secretary of State’s Office has asked election administrators to send notices to everyone on that list asking them to prove they are a citizen and if they indicate they are not a citizen or do not respond within 30 days, their voter registration should be canceled.\nGarza said his office is first working to determine the accuracy of the list before sending notices.\nHowever, Garza is concerned about his office’s legal authority to investigate a person’s citizenship.\n\"I don’t think federal law allows us to investigate somebody’s citizenship directly with respect to their application,\" Garza said, explaining that when someone fills out a voter registration application, they acknowledge that there is a penalty for lying on the application, which includes the citizenship question. \"I’m not really comfortable doing this because I don’t know that I have the authority to do it.\"\nThe Secretary of State’s Office has been unhelpful with clarifying those questions, Garza said, adding that responses have ranged to his office can look at the list and not take any action, or look at the list and take some legal action or fully challenge a voter registrant’s citizenship.\nPart of the problem with the list, Garza said, is that DPS records for non-citizens who applied for a driver’s license doesn’t account for whether those people later attained citizenship through naturalization.\n\"We contacted local advocacy groups that do the naturalization ceremonies to see if there is a way to easily identify individuals,\" Garza said.\nHowever, if someone were to register to vote as a citizen and then go to DPS, apply for a driver’s license and tell DPS they were not a citizen, Garza would have no problem sending them the letter asking them for proof of citizenship — but that is not the case with the Secretary of State’s list.\n\"I want to proceed with caution because I do not want to disturb the voter, the registrant, unless I have to because there’s good indication they may not be citizens and are registered to vote,\" Garza said.\nThe Secretary of State’s assertion that there were approximately 95,000 non-citizens in Texas who were registered to vote was quickly publicized Friday by Texas Attorney General Ken Paxton.\n\"Every single instance of illegal voting threatens democracy in our state and deprives individual Texans of their voice. We’re honored to have partnered with the Texas Secretary of State’s office in the past on voter initiatives and we will spare no effort in assisting with these troubling cases,\" Paxton said in a statement. \"My Election Fraud Unit stands ready to investigate and prosecute crimes against the democratic process when needed.\"\nPaxton also touted non-citizen voter fraud convictions obtained by that unit out of Tarrant and Montgomery counties and an arrest in Navarro County.\nTexas Secretary of State David Whitley said his office turned over this list to Paxton’s office.\nWhile the Secretary of State’s Office gave Garza conflicting accounts about the accuracy of the list Tuesday morning, the Texas Tribune reported that the Secretary of State’s office had been calling counties to say that some of the voters don’t belong on the list it sent out.\nWhen Whitley announced the list, which he said was the result of a 10-month investigation, advocacy groups in Texas immediately expressed skepticism and the League of United Latin American Citizens, or LULAC, sued both Paxton and Whitley Tuesday, accusing the officials of violating federal election laws by intimidating voters.\n\"There is no voter fraud in Texas, it’s a lie, repeated time and again to suppress minority voters and we’re going to fight hard against it,\" LULAC National President Domingo Garcia said in a press release.\nAndre Segura, legal director for the American Civil Liberties Union of Texas, said in a press release that voter fraud is historically rare and extremely rare and efforts to identify unlawful mass voting have proven to be inaccurate.\n\"Given the long history of anti-immigrant policies and attempts at voter suppression by our Texas officials, we cannot trust that this investigation has been conducted in a fair and non-discriminatory manner,\" Segura said.\nBeth Stevens, voting rights legal director with the Texas Civil Rights Project, said in a press release that the advisory is an attempt to gain support for what she says is an anti-voter agenda.\n\"The Advisory is another attempt from state officials to drum up support for a radical anti-voter agenda in the current Legislative session and in other states with like-minded officials,\" Stevens said. \"With such irresponsible assertions now in the public, we call on the Secretary of State to immediately rescind this advisory.\"\nmreagan@brownsvilleherald.com", "url": "https://apnews.com/74476cf51f8c4ea3b77619dde117b0c8"}