{"authors": ["Kathy Hanrahan", "Out", "About Editor"], "date_download": "2020-05-04 20:18:19", "date_modify": "2020-05-04 20:18:19", "date_publish": "2019-04-05 15:29:00", "description": "The inaugural Dreamville Festival is scheduled for Saturday at Dix Park in Raleigh. With a sold-out crowd of 40,000 people expected to attend, this is going to be a major event. Dreamville...", "filename": "_f5b7b7b086b920788974799523ff8bd7_1588623499.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f5b7b7b086b920788974799523ff8bd7_1588623499.html", "title": "Dreamville Fest: Everything you need to know before you go", "title_page": "Dreamville Fest: Everything you need to know before you go", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Dreamville Fest: Everything you need to know before you go\nThe inaugural Dreamville Festival is scheduled for Saturday at Dix Park in Raleigh. With a sold-out crowd of 40,000 people expected to attend, this is going to be a major event.\nDreamville Festival is being held at Dorothea Dix Park, 101 Blair Drive. The festival gates open at noon on Saturday and the event is expected to wrap up around 10:30 p.m. And if you didn’t get tickets you can always watch the live stream on Tidal.\nPlanning on bringing your children? Children 3 1/2 feet tall and shorter are admitted for free if they are with a ticket-holding adult. No children under the age of 14 years are allowed in without an adult.\nThe festival is also warning people about potential scammers. There is no re-entry to the festival once you leave, so do not purchase wristbands outside the gates because you won’t be able to use them to get in. The festival is also urging fans not to buy passes from third parties or scalpers because they can’t be guaranteed, authenticated or supported.\nA limited amount of official event parking is available for $20 per car at N.C. State University’s Centennial Campus within walking distance of Dix. There will be no parking allowed on-site or in surrounding neighborhoods, which means thousands of parking spaces normally available on weekends won’t be.\nFor those parking at garages in downtown Raleigh, the festival has shuttle options.\nThe Official Downtown Shuttle, which is operated by Park Jockey, will have numerous vehicles stopping at 500 S. Blount St., 135 E. Martin St. and 137 E. Hargett St. from 10 a.m. until 1:30 a.m., a Dreamville spokesperson told WRAL Thursday. The cost is $10 round-trip.\nFor those coming from outside Raleigh, Regional Express Shuttle, run by FestDrive, will have numerous shuttles operating throughout the day from Greensboro and Durham. Round trip tickets for that shuttle start at $64 and all buses are guaranteed to be at the festival for pick-up at least one hour after the final act, approximately 11:30 p.m.\nLyft is also an option. Dreamville has teamed up with the company to provide rideshare services to the event. You will get picked up and dropped off at a designated Lyft lot within walking distance to the east entrance. The Lyft lot is located at Stancil Dr. in Raleigh and it can only be reached by using Western Boulevard on Saturday due to road closures.\nYou can bike there too. There will be a spot to lock up your bikes at the park.\nWell it’s J. Cole’s festival so obviously he’ll be there! But here’s the rest of the lineup and note that the two stages are at opposite ends of the park:\nOn the Rise Stage:\nOn the Shine Stage:\nStay hydrated and bring in a reusable water bottle or CamelBak. The festival will offer multiple free water refilling stations. Just be sure to have it empty when you get there.\nThere will be no backpacks or large purses allowed into the festival. You can bring in:\nYou can also bring in:\nThings you can’t bring in:\nAll bags and person will be searched and any prohibited items will be taken and not returned. “Upon arrival, all patrons will undergo to a full airport style search, including bag searches and pat-downs,” according to the Dreavmville website.\nThere will be lockers available to rental on site. You can reserve one in advance online.", "url": "https://apnews.com/f5b7b7b086b920788974799523ff8bd7"}