{"authors": ["Mike Sutter"], "date_download": "2020-05-04 20:11:40", "date_modify": "2020-05-04 20:11:40", "date_publish": "2019-05-14 21:30:04", "description": "Note: This is a Just a Taste review, which the Express-News does soon after a restaurant or bar opens to give our first impressions. Combine the kitsch of masked Mexican lucha libre...", "filename": "_8197ebd686144b839491690f66225ec3_1588623100.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8197ebd686144b839491690f66225ec3_1588623100.html", "title": "Review: Macho Libre a Chipotle upgrade", "title_page": "Review: Macho Libre a Chipotle upgrade", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Note: This is a Just a Taste review, which the Express-News does soon after a restaurant or bar opens to give our first impressions.\nCombine the kitsch of masked Mexican lucha libre wrestling, the convenience of Chipotle and the taquería experience of the team behind San Antonio’s El Taco Tote and you get Macho Libre, the taco and burrito shop that opened earlier this year on Babcock Road on the city’s Northwest Side.\nI wish I could say Macho Libre was the first lucha libre-themed taco joint I’ve hit in San Antonio. It’s not. That honor goes to the late Taco Libre for 365 Days of Tacos.\nBut Macho Libre picked up the torch with gusto, filling a modernist fast-food building with patterned cinderblock, regal tile, bold pink signage and lucha libre touches like wrestling ring ropes at the counter and promo poster-style graphics.\nThe philosophy’s familiar in the era of Chipotle: let customers pick a meat, then walk them down a line of toppings and fillings to load their taco, burrito, torta or nachos however they like. But the flavors are tailored more to San Antonio: seared carne asada, red-spiced pork adobado, creamy queso with roasted peppers, even stewed chicharrones.\nOn ExpressNews.com: 365 Days of Tacos: El Taco Tote\nOn the menu: Macho Libre calls its regular-size tacos “burritacos,” softening the ground for the idea that this is a taquería unafraid to embrace the more West Coast notion of a burrito. Built on hot housemade flour tortillas, they were the shop’s best value at $2.50 each, with fillings from smoky shreds of stewed chicken tinga to rich rajas con queso to chicharrones with meat still hanging on to the pigskin, stewed with peppers and tomatoes for rich flavor without getting too sloppy.\nThe Mucho Burro ($8) came on a storebought, 14-inch flour tortilla in either regular, chipotle and spinach flavors. It then put it in a full nelson with choices of rice, beans, cheese, pico de gallo, jalapeños, sour cream, even spinach and tomatoes. A mix of respectable carne asada and dried-out chicken fajita canceled out each other’s high and low points, but either way, they were part of an unwieldy mega-burrito construct that fell apart after a few bites and became a knife-and-fork project.\nStreet tacos ($8 for four with refried beans) were built on small, commercial corn tortillas. Friday through Sunday, barbacoa and pork al pastor join the lineup. The barbacoa was silky and dense, and the al pastor came from a vertical rotisserie trompo with a pineapple crown for real street-taco cache.\nOn ExpressNews.com: Review: SoLuna on Broadway takes Mexican food beyond margaritaville\nPork adobado was almost as good, an everyday option painted with deep red spice that constituted the best part of otherwise ordinary nachos ($8), a pile of chips and beans and a little of everything from the condiment assembly line for a heavy but thoroughly mediocre plate.\nMacho Libre’s salsa trio — creamy jalapeño, tangy tomatillo and smoky chile de arbol — brought a nice edge to all of the above, a nod to the salsa bar at Macho Libre’s mothership restaurant, El Taco Tote.\nOutside the taco-nacho-burrito canon, I liked the cold fruit-and-chile spark of a mangonada ($4), and a cup of arroz con leche ($2.50) brought the simple joys of creamy sweet rice and cinnamon. Nothing killed that joy faster than a salty cup of Mexican street corn built with pale white corn smothered by mayo and crema way out of proportion to the classic mostly corn formula.\nOverall, the effect of Macho Libre is a modern mom-and-pop-style taquería with the speed and convenience of a fast-casual assembly line, a local alternative that breaks the Chipotle chain.\nMike Sutter is a food and drink reporter and restaurant critic in the San Antonio and Bexar County area. Read him on our free site, mySA.com, and on our subscriber site, ExpressNews.com. | msutter@express-news.net | Twitter: @fedmanwalking", "url": "https://apnews.com/8197ebd686144b839491690f66225ec3"}