{"authors": ["Bhaskar Sunkara", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis"], "date_download": "2020-05-04 19:54:33", "date_modify": "2020-05-04 19:54:33", "date_publish": "2019-02-25 00:00:00", "description": null, "filename": "2019_02_the-exercise-of-power_1588622073.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/02/25111255/Rassemblement-populaire-14-juillet-1936.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_02_the-exercise-of-power_1588622073.html", "title": "The Exercise of Power", "title_page": "The Exercise of Power", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "By the 1930s, French socialists had already lost much of their industrial working-class base to a Communist split. The party seemed set on a reformist path to socialism, but it still expressed its goals in explicitly Marxist terms.\nRebuilding the Socialist Party’s (SFIO) infrastructure throughout the 1920s, its leader Léon Blum grappled with the question of why and under what conditions a socialist would enter government. He distinguished between the “exercise of power” (taking office to prepare the groundwork for socialism) and the “conquest of power” (the actual dismantling of capitalism). In the end, Blum settled for the “occupation of power,” to keep it out of the grasp of fascists.\nWhen the Jewish radical Blum rose to power in 1936, the antisemitic politician Xavier Vallat complained, “For the first time this ancient Gallo-Roman land will be governed by a Jew.” Just before becoming prime minister, Blum was dragged from a car and beaten, nearly to death, by a right-wing mob. A picture of him, heavily bandaged with swollen features, appeared on the March 9, 1936 cover of Time magazine.\nWith Nazism on the rise in Europe, in these dark times, the “occupation of power” seemed a noble enough pursuit for the Popular Front coalition. Occupy power now, and even if you can’t win the reforms you want you can prevent the Right from undermining the conditions needed for a future conquest or exercise of power.\nYet something unexpected happened when the Blum government entered office — the ambitions of working people were unleashed. Not content with a resounding electoral victory for Popular Front parties, workers went on strike, occupying factories and paralyzing production.\nMarceau Pivert, leader of the SFIO’s radical left, proclaimed that “everything is possible” in the new environment. Business leaders appealed to Blum to restore order. The result was a series of reforms, the Matignon Accords, which granted workers the legal right to strike, made it easier for them to form unions, and offered large wage increases. They also won unemployment insurance and two weeks of paid vacation. Exhausted but overjoyed, millions flocked to the countryside and the sea for the first time that summer. The dignity these reforms afforded to working people was undeniable. Though they were the product of grassroots rebellion, not Blum’s program, they couldn’t have been implemented without the Popular Front in power.\nOf course, the dilemma of social democracy soon became apparent: capitalism isn’t a fortress that can be surrounded and stormed rampart by rampart, it’s a dynamic, moving target. It’s difficult to keep workers mobilized once gains are made, and capital has the structural power to undermine those gains.\nAs Léon Blum would write in Tribune shortly before he died, “There is perhaps no more difficult a task than that of a Government working within the framework of a capitalist society and having neither the power nor the mandate to transform it completely at one blow.”\nThe upsurges of May and June 1936 triggered a business counteroffensive over the implementation of the reforms. With political instability growing, Blum’s middle-class coalition partners abandoned the fight. The leader had neither the support nor the resolve to pursue more radical measures. Blum was pushed out of power in little more than a year.\nKnowing this history, why is the socialist left in the United States interested in Bernie Sanders? His aims are social democratic, unlike even the reformist socialism of Blum. No comparable wave of working-class militancy would greet his election. And his campaign won’t be supported by a coalition of radical parties — we don’t even have a single party representing the interests of workers.\nFor all its resilience, capitalism’s inequalities still provoke resistance. Billions resent the unfair choices offered to them. But in the United States today, we lack the three ingredients necessary for almost every socialist advance of the past hundred and fifty years: mass parties, an activist base, and a mobilized working class.\nQuite simply, despite the promising revival of socialist ideas, despite the recent growth of the Democratic Socialists of America, despite the popularity of left-wing leaders like Alexandria Ocasio-Cortez, we’re in an almost unprecedented state of weakness. But we can’t just wait for street movements to appear out of nowhere. We need to contest elections, to use the opportunity to communicate our message to millions. More than that we need to actually win those elections and “exercise power” today, laying the groundwork for more radical change in the future, while at the same time depriving the Right of strength.\nWe need, in other words, a Bernie Sanders presidency. Sanders advocates social-democratic demands. But they represent something far different from modern social democracy. Whereas postwar social democracy morphed into a tool to suppress class conflict in favor of tripartite arrangements among business, labor, and the state, Sanders encourages a renewal of class antagonism and movements from below.\nTo Sanders, the path to reform is through confrontation with elites. Rather than talking about an entire nation struggling together to restore the US economy and shared prosperity, and rather than seeking to negotiate a better settlement with business leaders, Sanders’s movement is about creating a “political revolution” to get what is rightfully ours from “millionaires and billionaires.” His program leads to polarization along class lines; indeed, it calls for it.\nSanders was trained as a student in the Young People’s Socialist League and through trade union and civil rights organizing. His worldview was formed by this unusual background. He doesn’t represent a moderate alternative to more militant socialist demands, but a radical alternative to a decrepit liberal center.\nSpeaking in comprehensible language (thankfully, he does not invoke the century-old terminology of European socialism that I do) and connecting with people’s needs and anger, Sanders may well prevail in the coming 2020 election. But what will he do then?\nThis issue tries to grapple with that question, and the fact that the “class-struggle social democracy” of Sanders is exceedingly difficult to pull off. Candidates face both incentives to compromise and structural pressure: administering a capitalist state requires maintaining business confidence and corporate profits.\nOur solution is a vague one, but it involves creating some pressure of our own. Street protests and strikes can discipline wayward candidates for not going along with a redistributive agenda and force businesses to make concessions to reformers once they are elected. Elected officials, too, can push measures that make it easier to undertake these actions.\nAt first glance, this issue is about Bernie Sanders. But it’s really about you, and the latent power of working people to make change.", "url": "https://jacobinmag.com/2019/02/the-exercise-of-power"}