{"authors": ["Ben Beckett", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Scott Slawson", "Micah Uetricht"], "date_download": "2020-05-04 19:53:03", "date_modify": "2020-05-04 19:53:03", "date_publish": "2019-07-09 00:00:00", "description": null, "filename": "2019_07_bernie-sanders-class-struggle-video_1588621983.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/09200603/bernie-sanders.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_bernie-sanders-class-struggle-video_1588621983.html", "title": "Bernie Sanders’s Campaign Is Different", "title_page": "Bernie Sanders’s Campaign Is Different", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "“If I miss a paycheck, I’m screwed. I would literally become homeless.”\nWith this statement in the latest Bernie Sanders campaign video — premiering at Jacobin — labor activist Kelly Osborne of Cedar Rapids, Iowa, speaks for millions of working-class people. Osborne, a forty-four-year-old cancer survivor who is raising her five-year-old grandson, works at McDonald’s for $8.25 an hour, which she describes as “just not a living wage.”\nSpeaking of her grandson, Osborne says, “What I would like to see for him when he gets older and gets a job is union rights, is $15 an hour so he can survive.”\nThe video is notable for Osborne’s bravery in describing her situation and demanding union rights in front of a national audience. It is also notable for what it doesn’t say — and because it shows how Bernie Sanders is running a different kind of presidential campaign.\nSpecifically, no one in the video encourages viewers to vote for Sanders. When he appears for the first time, three-quarters of the way through the video, we see him at a Fight for 15 rally in Cedar Rapids, beside Osborne.\nSpeaking to the crowd of striking fast-food workers through a bullhorn, Sanders says, “A fight at McDonald’s is a fight for millions of working-class people. . . . Today we say . . . to McDonald’s: pay your workers a living wage and negotiate with a union.” Even the title card at the end of the ad asks us not to support Sanders but to “Join the movement.”\nCynics would be wrong to write this off as mere rhetoric. Sanders made a similar 2016 ad, “Tenemos Familias,” that centers the struggle of a Mexican immigrant tomato picker, Udelia Chautla, in Immokalee, Florida. Sanders plays a relatively minor part in the ad; much more central is Udelia and the work and organizing efforts of tomato pickers themselves.\nThroughout the 2020 campaign, Sanders has used the bully pulpit to amplify workers’ struggles from Amazon to University of California to Wabtec and many more. And he has gone a step further, using his campaign’s massive organizational infrastructure to encourage supporters to join picket lines in solidarity with striking workers — something no national politician in the United States has done before now.\nFrom Medicare for All and College for All to his promises to ban anti-union right-to-work laws, cancel student debt, and immediately undo Trump’s anti-immigrant policies, all of his proposals are focused on dramatically improving the lives of working-class people, and doing so in a way that unites them rather than divides them.\nBut beyond his policies and his upbringing in a four-room apartment, the son of a poor working-class immigrant, Sanders is the first major presidential candidate in modern times to run a working-class campaign — one that seeks not only to elect a candidate but to deliberately foster a working-class movement.\nAs the “Living Wage” video featuring Osborne and others like it show, Sanders’s focus on working-class people extends beyond his policy proposals to the way he conducts his campaign.\n“All the focus on working-class people comes directly from Bernie. It’s not something that’s new to him. He was doing it in the ’80s in Burlington with the public-access show when nobody was doing anything like that,” Josh Miller-Lewis, the campaign’s director of digital communications, says.\n“It’s not good enough to just elect a candidate to office. You have to build a movement if you’re going to accomplish any of the changes we’re fighting for. So all of these videos are meant to show that this campaign is about more than just Bernie Sanders. It is about all of us. It is about building a movement of working-class people to take on the power structures that are intent on maintaining the status quo,” Miller-Lewis says.\nBy placing so much emphasis on the struggles of working-class people in their own words, Sanders’s media operation does more than just give workers a platform to speak for themselves about their own concerns — though that is no doubt important.\nThe campaign’s worker-focused media is also critical to its method of organizing. Sanders aims to cohere a political base of a new type — one that is prepared not only to vote for him, but to fight both the boss and the state for its own interests.\nMiller-Lewis described how the campaign’s media and organizing interweave, using the community fight to prevent Hahnemann Hospital in Philadelphia from closing as an example.\nMost campaigns would send out a statement from the candidate and that would be it. We sent out a statement, but that’s only the beginning of this process. So now, our organizing team is mobilized, and we’re sending emails, we’re sending text messages, we’re getting people out to solidarity protests on Thursday. We’re going to go down with the video team and interview people — patients, nurses at the hospital, to talk about it, to raise the profile of this fight. And that doesn’t stop there. Now we’re thinking, what can we do after that protest? How can we continue to put pressure on the owners of that hospital not to close it? It’s really, I think, revolutionary because we’re not just focused around how we [get] more votes for Bernie Sanders. We’re interested in how do we build a working-class movement that is creating change for people right here in their lives, and, of course, longer term, by trying to elect Bernie Sanders president and bring this movement to the White House.\nIn his emphasis on organizing and mobilizing working-class people to at least the same degree as winning votes, Sanders is running a campaign fundamentally different from any other, past or present. He not only needs people to vote him into office. He needs them ready to fight once he is elected, too.\nBut ultimately no politician, even Sanders, can grant the working class enough power to overcome fierce opposition from the rich to his agenda. Only working-class people — the vast majority of people of all ages, races, genders, and backgrounds who depend on wages to survive — can do that. For all the resources and effort Sanders puts toward making organizing ourselves easier, fundamentally, it is up to us.\nAs Osborne says in her final words in the new video, “We need to make things better for everybody now — not in the future, now.”", "url": "https://www.jacobinmag.com/2019/07/bernie-sanders-class-struggle-video"}