{"authors": ["Paul Wedding Pwedding Oaoa.Com"], "date_download": "2020-05-04 20:24:56", "date_modify": "2020-05-04 20:24:56", "date_publish": "2019-03-12 21:52:00", "description": "After a year of turmoil leading to the loss of city funding, the Odessa Hispanic Chamber of Commerce is under new leadership, who hope to restructure the chamber and establish confidence from the...", "filename": "_3edf31dec2ab4ff599c8fbb5815be16f_1588623896.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3edf31dec2ab4ff599c8fbb5815be16f_1588623896.html", "title": "Hispanic Chamber hoping for re-boot", "title_page": "Hispanic Chamber hoping for re-boot", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "After a year of turmoil leading to the loss of city funding, the Odessa Hispanic Chamber of Commerce is under new leadership, who hope to restructure the chamber and establish confidence from the community.\nThe organization has seen a loss in confidence due to abrupt removals of Chamber leaders and board members, as well as a lack of financial transparency. Ben Quiroz, the Chamber’s new director, said he’s hoping the Chamber can overcome those issues with the leadership of himself and Arnulfo Martinez Jr., the Chamber’s new CEO.\n“We need to reach out back to our grassroots and back to working with the community, working with the other nonprofits, working with the other chambers,” Martinez said. “I think what has happened is we’ve become a little disenfranchised from that aspect of a chamber.”\nSince both of them came on in July, Quiroz said the Chamber has been working on re-engaging with their membership, since they now rely solely on membership funds to stay afloat, as well as preparing for their annual banquet, organizing some community programs, and working on putting together an annual career fest for at-risk students in November.\nQuiroz, who is a chiropractor and an Ector County Hospital District board member, said it was the Hispanic Chamber’s annual banquet last year that led to him coming back into the organization. His mother had been active with the organization growing up, and he received support from the Hispanic Chamber when he first opened his own business, but became disengaged with the group after about seven to eight years.\n“Whenever I went back to a chamber event, I noticed membership and activity had significantly declined, and it continued to decline,” Quiroz said. “And I started to watch that and I felt that if there was no true leadership in the organization somebody needed to step up and do that.”\nMartinez came to Odessa in February semi-retired. He previously spent time in Hobbs, N.M., serving as the membership executive, and in Brownsville, where he owned his own business. When he first came to the Hispanic Chamber in Odessa, he offered to help with membership, but said he put that on the backburner after issues with their city funding arose. Months later, in July, he said he was offered the CEO position.\n“I’m really passionate about working with the Hispanic community, just working with the community as a whole,” Martinez said. “There’s a whole lot of need, I feel, here in Odessa that I feel we and the chambers can address as a combined front.”\nBut the public has seen new leaders from the Hispanic chamber touting reform before, with little to show for it. Quiroz said he recognizes that it will take time to redevelop trust from the community.\n“Moving forward, I think our actions will speak for the growth of the Hispanic Chamber,” Quiroz said. “Explaining our mission, vision and values to the community should really be able to help drive the organization into the future, but it does take time.”\nMartinez said the public will see the Hispanic Chamber more visible in the community, and Quiroz said they have already brought together the Odessa Chamber of Commerce and the Black Chamber of Commerce for the first ever chamber summit meeting, and plan to hold quarterly summit meetings.\nOdessa Chamber of Commerce President and CEO Renee Henderson Earls said the meeting happened in late June, organized by Quiroz, and that the three groups will be meeting again next week.\n“It’s just a good opportunity for all of us to see how we might work together,” Earls said. “We’ve seen the Hispanic Chamber much more often recently.”\nFinancial transparency was also a concern, after it was discovered the Hispanic Chamber had never received a third-party audit. Quiroz and Martinez handed the Odessa Development Corporation an audit trail for the last year of their transactions, as well as two checks for $51,301.98 and $2,297.52 as reimbursement of ODC funds.\nBut ODC Chairwoman Betsy Triplett-Hurt said she would still like to have a third-party audit conducted on the Hispanic Chamber for their last three years of business.\n“All of the contractors have an audit at some time and they have not,” Triplett-Hurt said. “We’re not singling them out, it’s just that everyone has an audit so they need to be audited too.”\nQuiroz said they have no problem with an audit, as long as ODC pays for it, and said the financial consulting firm Weaver recommended they not do a third-party audit themselves due to the cost of the audit.\n“If they feel there needs to be a complete audit on the deal without taking the time and effort to review all of the transactions that we provided for them, that is totally up to them,” Quiroz said. “We’re not gonna pay for it though.”\nTriplett-Hurt said ODC would pay for the audit to be conducted.\nThe financial records provided to ODC by the Hispanic Chamber list the last year’s worth of transactions performed by the organization. Quiroz said these transactions were gathered from the accounting software Quickbooks. The Odessa American has asked for actual receipts for the last two years of transactions by the Hispanic Chamber. Martinez said they would look for them, but was unsure if they had all of the receipts.\nMartinez said they will do annual audits within the organization itself from now on, which he said would be transparent. Quiroz said he was unsure right now as to whether the Hispanic Chamber would try to pursue funding from the City again, and that it would depend on where they are in terms of money and membership. They currently have between 150 and 200 members.\nThe audit trail for the last year of their finances shows multiple reimbursements to Raymond Chavez and one to Xavier Gonzalez, who was working with the Hispanic Chamber out of Mexico. Martinez said these reimbursements came from trips the two had made to and from Chihuahua, Mexico, for the group’s Mexico Initiative, an effort to improve business relations between Odessa and Mexico.\nBoth Quiroz and Martinez said they aren’t planning on looking at the Mexico Initiative further for the time being.\n“Once we get healthy and strong, we can look into other projects,” Quiroz said. “But right now, I think we need to focus on home versus trying to go across country lines to generate business or try to develop relationships there. We need to take care of Odessa first.”\nAs far as Raymond Chavez goes, who previously held a paid position heading the initiative and stirred up issues including conflict of interest, nepotism, and poor transparency, Quiroz said he has never met Chavez and he has no influence over him. Martinez said he had only met Chavez when he first got here. Similarly, they both said District 5 City Council Member Filiberto Gonzalez has not been involved in their efforts.\n“They haven’t participated with any chamber business,” Quiroz said about Chavez and Gonzalez.\nHowever, Diana Chavez, Chavez’s wife, is still on the board as an ex officio due to being the past chairman of the organization, but Quiroz said she hasn’t attended the past few meetings.\nMartinez also said the Hispanic Chamber Charity Foundation, which was started by Chavez, was unrelated to the current board, and Quiroz said he had never even heard of the foundation. The foundation was receiving mail at the Hispanic Chamber’s address, but Martinez said he hadn’t seen any mail from them in his time as CEO and thinks they get their mail at The Grove Apartments now, which has a partnership with the foundation.\nQuiroz said he would like to see the Hispanic Chamber engage more with the community on the south side of Odessa, calling it an area he thinks is highly underrepresented by Odessa leadership, and wants to help the people there develop and expand their businesses.\n“I think that we’re in a boom economy in America, so globally, we’re really a very important place right now, so we need to take that serious,” Quiroz said, “and the Hispanic Chamber takes that serious, and sees the opportunities where we can represent that Hispanic voice that’s driving this economy.”\nWhile some have questioned the need for separate chambers, Quiroz and Martinez said the Hispanic Chamber provides a cultural aspect and resources for the Hispanic population of Odessa.\n“A lot of times, you’re gonna find that the minority population might not feel comfortable going to the greater chamber, or just going and asking information,” Martinez said. “It could be a language barrier, cultural barrier, whatever it is. Maybe they feel that they’re not understood or they can’t get their ideas across to somebody who’s not Hispanic.”\nEarls said the Chamber does have employees who can speak Spanish.\n“We do have some bilingual staff so we can certainly accommodate anyone who happens to call and would feel more comfortable speaking in that language,” Earls said.", "url": "https://apnews.com/3edf31dec2ab4ff599c8fbb5815be16f"}