{"authors": ["Hearst Connecticut Media Group Editorial Board"], "date_download": "2020-05-04 20:23:16", "date_modify": "2020-05-04 20:23:16", "date_publish": "2019-03-06 22:15:47", "description": "The public does not need more secrecy from police. If anything, there should be less. A bill brought to a hearing before the Judiciary Committee Wednesday is unwarranted and should go no...", "filename": "_915eb55e17a94f66ae52a87ae9ba34cc_1588623796.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_915eb55e17a94f66ae52a87ae9ba34cc_1588623796.html", "title": "Editorial Police secrecy bill should be defeated", "title_page": "Editorial Police secrecy bill should be defeated", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The public does not need more secrecy from police. If anything, there should be less.\nA bill brought to a hearing before the Judiciary Committee Wednesday is unwarranted and should go no further down the legislative route.\nSenate Bill 970 would allow law enforcement to keep from public disclosure property seized in a criminal arrest or with a search warrant without an arrest, unless it is entered as evidence in a criminal, civil, or administrative proceeding. Specifically, this would circumvent the Freedom of Information Act.\nThe bill is in response to a case lost last fall by the Department of Emergency Services and Public Protection related to property obtained in the investigation of the 2012 Sandy Hook Elementary School shootings that left 26 dead. State Police were withholding documents, such as drawings and writings by Adam Lanza, the shooter. The Hartford Courant filed a complaint with the state Freedom of Information Commission, which agreed the documents should be public.\nThe police appealed, and a trial court ruled in their favor. However, the state Supreme Court reversed that decision in October, saying documents obtained during search and seizure were subject to FOI regulations.\nThis bill amounts to law enforcement telling the Supreme Court it was wrong because they didn’t like the decision.\nNot only does this bill overstep public disclosure regulations, but also it is not necessary. FOI regulations do protect the integrity of criminal investigations by exempting disclosure of documents. Once that investigation is completed, however, the documents are public. In the Sandy Hook case, there would be no arrests because the shooter, who police said acted alone, killed himself.\nPublic interest was high in that case. The failure to release Lanza’s journals and other items hindered the Sandy Hook Advisory Commission, which was tasked with looking into mental health issues, as well as other areas, and formulating strategies to prevent more school shootings.\nThe broad bill would pertain to all criminal investigations that do not go to trial, which is most of the cases.\nIn unsigned submitted testimony Wednesday, the state Division of Criminal Justice stated that “Nothing in the proposal prevents law enforcement from making the information public, or from disclosing it to the public upon request if that is advisable.”\nWe would argue: advisable by whom? Law enforcement seldom provides more than routine information unless it helps them, such as mug shots of suspects they are trying to apprehend.\nKeeping evidence secret hobbles the public’s examination of law enforcement activities and erodes faith in the transparency of the criminal justice system.\nWe agree with the viewpoint posited by Michael Savino, the president of the Connecticut Council on Freedom of Information, who said the bill “would deny access to records that are crucial for public disclosure and transparency.”\nThe public is not served by this needless bill. It should wither in the Judiciary Committee.", "url": "https://apnews.com/915eb55e17a94f66ae52a87ae9ba34cc"}