{"authors": ["Journal Staff"], "date_download": "2020-05-04 20:06:57", "date_modify": "2020-05-04 20:06:57", "date_publish": "2019-05-01 00:54:00", "description": "Editor’s Note: Prep Stars in College is a weekly glance at former southeast Idaho high school athletes who are now competing at the college level. If we’re missing anyone, let us know at...", "filename": "_a5a3742f4662481e978b64d3b971b3e5_1588622817.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a5a3742f4662481e978b64d3b971b3e5_1588622817.html", "title": "Coleton Adamson becomes scholarship player for College of Southern Idaho basketball", "title_page": "Coleton Adamson becomes scholarship player for College of Southern Idaho basketball", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Coleton Adamson becomes scholarship player for College of Southern Idaho basketball\nEditor’s Note: Prep Stars in College is a weekly glance at former southeast Idaho high school athletes who are now competing at the college level. If we’re missing anyone, let us know at sports@journalnet.com.\nColeton Adamson (Century) – College of Southern Idaho\nCentury High graduate Coleton Adamson has become a scholarship player for the COllege of Southern Idaho men’s basketball team after walking on to the program in the fall of 2018.\nThe guard signed his National Letter of Intent on Tuesday to make the designation official.\nAdamson redshirted in his first season with CSI, which finished 24-8 in 2018-19.\nMcKenzie Gunter (Marsh Valley) – Walla Walla Community College\nMarsh Valley High graduate McKenzie Gunter signed her National Letter of Intent in April to continue her women’s basketball career at Montana State Northern after playing two seasons at Walla Walla Community College.\nMSU Northern is an NAIA Division I program that finished 13-18 last season after falling in the first round of the Frontier Conference playoffs.\nGunter tallied 14.8 points per game with a 45.1 shooting percentage as a sophomore at Walla Walla. Her 4.6 assists per game was third-highest in the Northwest Athletic Conference. Walla Walla finished the season 20-10.\nBoone Giulio (American Falls) – St. Cloud State University\nAmerican Falls High graduate Boone Giulio is transferring to the University of Providence in Montana after spending a season wrestling for St. Cloud State.\nProvidence, which announced the news in April, is an NAIA program that finished 12-7 and placed 12th at the NAIA championships.\nGiulio had an 18-7 record in his freshman season as an unattached wrestler at St. Cloud State.", "url": "https://apnews.com/a5a3742f4662481e978b64d3b971b3e5"}