{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:18:00", "date_modify": "2020-05-04 20:18:00", "date_publish": "2019-02-24 03:49:36", "description": "By Kevin Duffy Boston Herald Steven Bell, an attorney with Meltzer & Bell in Palm Beach County, Fla., has represented hundreds of clients charged with solicitation of prostitution. In...", "filename": "_2a3227358c4c45b9b54842477aed27b6_1588623480.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2a3227358c4c45b9b54842477aed27b6_1588623480.html", "title": "A Look at Kraft's Legal Options in Solicitation Case", "title_page": "A Look at Kraft's Legal Options in Solicitation Case", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By Kevin Duffy\nBoston Herald\nSteven Bell, an attorney with Meltzer & Bell in Palm Beach County, Fla., has represented hundreds of clients charged with solicitation of prostitution. In an interview, Bell addressed some of the issues that may be ahead as New England Patriots owner Robert Kraft deals with the legal system in the aftermath of being charged with two counts of solicitation:\nQ. What are Kraft’s legal options?\nA. His options are going to ultimately be to enter a plea of not guilty, to demand a jury trial, to potentially enter into a diversion program if it doesn’t go to trial. He might have the option of entering into a diversionary type program, but his issue in his case is that there are two different cases. I don’t know that the state attorney’s office will be quick to allow diversion on both. That becomes the attorney’s job. I highly doubt that Robert is going to be pleading guilty to this stuff. I highly doubt that. There are some clients who might end up pleading guilty to it, who have a significant history and who aren’t offered diversion and have no other options other to say, ‘Hey I’m guilty and I’ll pay fines and go on probation’ or whatever the state attorney offers in the case. But I don’t anticipate in any of these cases for the state attorney’s office to pursue jail time for these people. I just don’t anticipate that at all, unless there’s some element I’m missing still. There’s only three options: you plead guilty, you enter a plea of not guilty and go to trial. In Palm Beach, they don’t offer no contest pleas. You don’t plead no contest in Palm Beach County ... so, state attorney’s office, it’s a guilty plea.\nQ. What’s the likelihood of diversion, which can be offered at any time by the state?\nA. If someone obtains a solicitation (charge) and has no history and has never been in trouble before, generally, outside of some crazy set of facts that are really, really bad, as a general rule, the state will probably negotiate some type of diversion -- entering into community service, you’ll have to do some education on this type of behavior, some other type of stuff, some testing you’ll have to do. They sometimes require when you’re accused of these things that you have to do STD testing. That’s sometimes required. That’s sometimes a condition in Palm Beach when it comes to diversion. But that’s presuming that the evidence establishes that Robert did anything.\nDiversion, you don’t enter a plea of guilty in county court. It’s no plea. You sign what’s called a Deferred Prosecution Agreement. And basically the state agrees to defer prosecution. It’s like a contract, essentially. You agree to do X, Y, and Z, and we at the state attorney’s office defer prosecution. You come back to court on X date, show us proof you did these things, and we’ll dismiss your case. Very common. Happens all the time. Every day my firm signs clients up for deferred prosecution agreements all the time ... The only element of this is that human trafficking element and what’s on the videos.\nQ. Will he be offered diversion even with two counts of this being charged?\nA. If the evidence establishes that Robert went to a massage parlor and paid them, there’s no evidence of a crime there. The question is, what’s on the video? That’s the case. And I don’t know the answer to those things.\nThe problem with Robert, not that it’s a problem or it can’t be resolved, but he’s got two of these (charges) allegedly. The state attorneys office doesn’t generally offer diversion. They may. It happens. But I don’t know what the state is going to do with this particular situation ... because of the human trafficking element of it.\nQ. Is it rare for these cases to go to trial?\nA. I’ve had cases that have gone to trial. But on first-time offenses with no history, if my client is guilty of it, then they generally resolve it in another fashion through some type of diversion program. A lot of times you’ll have a situation where money is exchanged, but not necessarily for a sexual act. So there you have the question of whether it was really solicitation of prostitution. Can it be proven that that money was absolutely exchanged for that act? So that ultimately would be an issue if a case went to trial. Was that money exchanged for a sexual act?\nA lot of times ... if it works out to get the case dismissed through a diversion program, why take the risk of a jury finding you guilty? Because once you do that, you can’t go backwards, outside of an appeal. I know a lot of these cases are going to be very fact-specific. I’m interested to see how that all plays out.", "url": "https://apnews.com/2a3227358c4c45b9b54842477aed27b6"}