{"authors": ["Monica Brich Daily Sun Staff Writer"], "date_download": "2020-05-04 20:09:41", "date_modify": "2020-05-04 20:09:41", "date_publish": "2019-02-07 18:23:00", "description": "A Beatrice student is being recognized for her local volunteer efforts with a national award. Jorja Boller, 10, was named one of Nebraska’s top two youth volunteers of 2019 by The Prudential...", "filename": "_f915a1e9b6c34392aa08f98409e731b8_1588622981.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f915a1e9b6c34392aa08f98409e731b8_1588622981.html", "title": "10 year old receives national volunteer award", "title_page": "10 year old receives national volunteer award", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Beatrice student is being recognized for her local volunteer efforts with a national award.\nJorja Boller, 10, was named one of Nebraska’s top two youth volunteers of 2019 by The Prudential Spirit of Community Awards, a nationwide program that honors youth volunteer efforts.\nJorja was nominated by Stoddard Elementary School for her work at Beatrice Good Samaritan Center and the Gifts for Grands project she started there when she was 5 years old.\nEvery year at Christmas, Jorja gives the Good Samaritan residents gift bags. Jorja said the bags include ornaments, crackers, cookies, candy and a juice box.\nJorja’s mom, Jackie Boller, said Jorja started volunteering after she participated in community service-based pageants at four years old.\n“She met older girls that had established their charities, were doing platforms, all this stuff,” Boller said. “And from there we kind of wanted to start her on a path of community service, so she started at Good Sam volunteering, and it kind of just morphed to her own charity.”\nBoller said Gifts for Grands grew from there.\n“This year we were contacted by Gold Crest in Adams to be one of the Gifts for Grands places, and it worked that we had just enough to cover theirs,” she said. “People from Crete have reached out to us for theirs, so we’re actually being approached by other nursing homes and facilities to include them. A little girl she met this past summer loved the idea so much she started a chapter of it in Oklahoma.”\nBoller said Jorja’s 4-H group also helps with Gifts for Grands throughout the year.\n“They do fundraisers,” she said. “This past Christmas, instead of buying the ornaments, they made them. All the families saved can lids over the year, then they had a party where we painted them and painted snowman faces and hot glued things. So each of the kids handmade and ornament and the cards that go in the gifts. That’s 27 kids that come in and see the impact they can make.”\nThe top two honorees from each state and the District of Columbia will receive an all-expense-paid trip to Washington, D.C. in early May for four days of national recognition events.\n“They are kept busy doing service activities while they’re there, seeing the sights, talking to senators, things like that,” Boller said. “Learning how to talk about their platforms, finding out what other kids’ platforms are. It’s just a great way to learn how other kids are doing stuff in their community, how they’re raising money for their platforms, and just different things like that.”\nShe added they will also being doing some community service projects while they’re there.\n“They’ve collected new books from several publishers, I believe, and they’re for the K-sixth grade age group,” Boller said. “They’re going to be spending four or five hours in the local elementary donating those books to kids in need and reading to them. That is going to be something she loves. She’s an avid reader.”\n“I think the most exciting part is going to ride a plane because I’ve never rode on one,” Jorja added\nDue to the amount of volunteer hours she has put in, Jorja will also be receiving the President’s Volunteer Service Award, which is given by the president himself.\n“And that’s not something that is just for kids,” Jackie said, “It’s something they can give to any age based on how many community service hours you commit. So we’re pretty honored about that.”\nKevin Janssen, principal at Stoddard Elementary, said they nominated Jorja to give her recognition for everything she’s doing outside of school.\n“We stress all the time in the Beatrice Public Schools, especially in the elementary, about Orangemen pride and what it means to be an Orangemen,” Janssen said. “To treat others as you would want to be treated, to do things when other people aren’t looking, and always try to have a positive attitude. I think this is just one way that Jorja is able to show that. She truly has Orangemen pride. She gives back to so many without others knowing about it, and she doesn’t necessarily like to receive the credit for it. The smiles on the people’s faces does it for her. It just speaks to the kind of character she has.”\nJorja said it was strange to be recognized for her volunteer efforts.\n“He just came in and told us, and then everyone started staring at me,” she said. “It was kind of awkward. Then he went over the intercom and told the whole school.”\nLast fall, Jorja received a Serve Nebraska Step Forward Youth Volunteer award. Governor Mike Foley presented the awards.\nJorja still spends 12-20 hours a month volunteering at Good Samaritan, playing games and doing crafts with the residents. Jorja’s younger sister has started volunteering there, as well.\nGood Samaritan awarded Jorja a regional volunteer award for her work.\n“She’s a great leader to talk to her friends about how much fun it is,” Robin Gascon, director of marketing and research development at Good Samaritan, said. “We need more volunteers like her.”", "url": "https://apnews.com/f915a1e9b6c34392aa08f98409e731b8"}