{"authors": ["Sentinel"], "date_download": "2020-05-04 20:10:37", "date_modify": "2020-05-04 20:10:37", "date_publish": "2019-02-04 16:37:39", "description": "MIDDLETOWN, Conn. -- The Fitchburg State University men's and women's indoor track & field teams competed on Saturday in the 2019 Wesleyan University Invitational. There was no team scoring...", "filename": "_ede988e38c334d90a31688d8fac139db_1588623037.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ede988e38c334d90a31688d8fac139db_1588623037.html", "title": "Pierre, Gonzalez Set the Pace for Falcons", "title_page": "Pierre, Gonzalez Set the Pace for Falcons", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MIDDLETOWN, Conn. -- The Fitchburg State University men’s and women’s indoor track & field teams competed on Saturday in the 2019 Wesleyan University Invitational.\nThere was no team scoring at the event, but both the men and women saw several outstanding individual performances\nFor the men, junior Wilkerson Pierre led the way, earning top honors in the triple jump with a MASCAC qualifying mark of 12.84 meters, as well as placing 14th in the long jump with a jump of 5.48 meters, while sophomore Asante Monteiro turned in a third-place finish in the 60-meterd with time of 7.22 seconds.\nIn the 1,000 meters, freshman Nicholas Sachetta (2:48.74), sophomore Joe Weston (2:57.41), sophomore Andrew Hill (3:14.15) and junior Sam Kupperstein (3:19.65) all qualified for MASCACs, placing fifth, seventh, ninth and 10th respectively, while senior Joseph Darrigo turned in a postseason qualifying time of 9:13.39 in the 3,000 with an eighth-place effort.\nThe 4x400-meter relay team of freshman Michael Masterson, of Pepperell, sophomore Ryan Carter, of Leominster, sophomore Max Charles II and Monteiro finished third with a time of 3:44.20, while in the 800 meters, senior Ryan Stopka and sophomore Ian Poyant posted MASCAC qualifying times of 2:13.33 and 2:51.20, respectively.\nIn the mile, sophomore Timothy Sheehy (fifth) and classmate Jacob Movsessian (sixth) posted MASCAC qualifying times of 4:42.07 and 4:45.32, respectively, while junior Zachary Buckland notched a postseason qualifying mark of 1.75 meters in the triple jump.\nIn the high jump, senior Austin Landress (1.80 meters) and Buckland (1.75) placed third and sixth to qualify for MASCACs, while senior Cameron Stalters rounded out the top Falcon men’s efforts with a seventh-place mark of 3.65 meters in the pole vault.\nFor the Fitchburg State women, sophomore Makaisha Gonzalez, of Lancaster, led the way with a season-best, MASCAC qualifying time of 8.62 seconds in the 60-meter hurdles with a seventh-finish, while sophomore Kambrynn Bowman placed eighth in the 600 with a season-best, postseason qualifying time of 1:47.75.\nFreshman Chloe Guzman notched a pair of MASCAC qualifying times in the 60 meters (8.70 seconds) and 400 meters (1:09.18), placing 15th overall in both events, while classmate Nyasia Torres (Fitchburg, Mass.) turned in a solid time of 6:39.65 in the mile.\nSenior Jennifer Desilvestre (Beverly, Mass.) placed ninth overall in the triple jump with a postseason qualifying mark of 8.62 meters, while junior Kelly McCusker-Brown (Watertown, Mass.) collected a MASCAC qualifying toss of 9.16 meters in the weight throw.\nJunior Brianna Young (Mansfield, Mass.) posted a MASCAC qualifying toss of 10.57 meters in the shot put, while sophomore Alissa Carroll (Boxford, Mass.) put forth a pair solid efforts in the shot put (6.01m) and the weight throw (5.74m) to close out the top performances for the Green and Gold on the afternoon.\nBy The Numbers\n* Makaisha Gonzalez (Lancaster, Mass.) 7th place in the 60m hurdles (8.62)\n* Kambrynn Bowman (Norton, Mass.) 8th place in the 600m (1:47.75)\n* Jennifer Desilvestre (Beverly, Mass.) 9th place in the triple jump (8.62m)\nUp Next\nFalcons return to action next Saturday at both Boston University and MIT for meets starting at 10:00 AM.", "url": "https://apnews.com/ede988e38c334d90a31688d8fac139db"}