{"authors": ["Michelle Iracheta"], "date_download": "2020-05-04 20:28:42", "date_modify": "2020-05-04 20:28:42", "date_publish": "2019-03-14 05:00:00", "description": "Deputies with the Fort Bend County Sheriff’s Office are asking the public for help in locating three men they say may have been involved in an aggravated robbery at a Katy area store. The...", "filename": "_9535de01fb8e4a09b5960d3753198903_1588624122.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9535de01fb8e4a09b5960d3753198903_1588624122.html", "title": "Fort Bend County Sheriff’s deputies seeking men involved in aggravated robbery in Katy", "title_page": "Fort Bend County Sheriff’s deputies seeking men involved in aggravated robbery in Katy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Deputies with the Fort Bend County Sheriff’s Office are asking the public for help in locating three men they say may have been involved in an aggravated robbery at a Katy area store.\nThe incident occurred in the early morning hours of Thursday, March 13 at the 2610 block of FM 1463 in the Katy area, according to the Fort Bend County Sheriff’s Office.\nFootage from a surveillance video shows one man entering the store, making a small purchase and walking out, according to sheriff’s deputies. Moments later, two men, both wearing hoodies, walked into the store, pointed a gun at the store clerk and demanded money, deputies said. No one was injured in the incident.\nOne of the men was wearing a blue hoodie, while the other was wearing a black hoodie. The suspects left the scene in a tan or silver-colored Nissan 4-door sedan.\nDeputies are searching for either two or three suspects they believe may have been involved in the aggravated robbery.\n“Help us catch these men and also earn some money for yourself the right way,” said Sheriff Troy Nehls. “We need to put these guys behind bars.”\nAnyone who has information on this crime is asked to call Fort Bend County Crime Stoppers at (281) 342-TIPS (8477) or submit information online at http://www.fortbend.crimestoppersweb.com. Information, which leads to the apprehension and filing of charges on the suspect(s) involved, could earn you up to $5,000 CASH REWARD. All calls to Crime Stoppers are ANONYMOUS\nmichelle.iracheta@chron.com", "url": "https://apnews.com/9535de01fb8e4a09b5960d3753198903"}