{"authors": ["Branko Marcetic", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul Heideman", "Meagan Day", "Richard Walker", "Neal Meyer"], "date_download": "2020-05-04 19:49:54", "date_modify": "2020-05-04 19:49:54", "date_publish": "2019-06-13 00:00:00", "description": null, "filename": "2019_06_bernie-sanders-speech-democratic-socialism-new-deal-fdr_1588621794.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/13155416/GettyImages-1149502668.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_bernie-sanders-speech-democratic-socialism-new-deal-fdr_1588621794.html", "title": "Bernie Sanders, Socialist New Dealer", "title_page": "Bernie Sanders, Socialist New Dealer", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Yesterday, Bernie Sanders gave a much-anticipated (and, in some quarters, much-derided) speech on democratic socialism. Socialism is an ideology that, in the United States, has more often than not been cast as a kind of deadly foreign pathogen that, left unchecked, will tear through American society, destroying its democratic institutions, warping its children’s minds, causing pestilence and drought, making pets turn on their owners, soda turn flat, and so on.\nThough no doubt infuriating some on the Left, Sanders — who’s weathered decades of this kind of thing — wisely situated his vision of socialism in the long tradition of US progressivism and, crucially, the New Deal liberalism forged by Franklin Roosevelt that dominated American politics until somewhere around the late 1970s.\n“Over eighty years ago, Franklin Delano Roosevelt helped create a government that made transformative progress in protecting the needs of working families,” Sanders said on Wednesday. “Today, in the second decade of the twenty-first century, we must take up the unfinished business of the New Deal and carry it to completion.”\nSanders’ association of the New Deal with the socialist tradition may irk some; after all, a better welfare state isn’t actually socialism, no matter how much the Republicans say it is.\nBut it’s also a product of the carefully deployed pragmatism that has long defined Sanders’ political success. As Sanders said upon becoming mayor of Burlington forty years ago, “I know that there is little I can do from City Hall to accomplish my dreams for society.” Rather, Sanders’ goal, as it has always been, is to open the door of public imagination to the idea of class politics, to make life better for the poor, the elderly, and working people of all kinds, and to weaken the power corporations and the rich have over people’s lives.\nAnd to this end, Sanders’s claiming of the legacy of the New Deal is something just about anyone — from those on the Left who want to go beyond the New Deal, to liberals who think fondly of it but are skeptical of trying to revive it — should take notice of.\nThis is nothing new from Sanders, who has long referred to Roosevelt as something like a political role model. During the 2016 campaign, Sanders name-checked Roosevelt on the debate stage as a leader he admired and even ran an ad comparing himself to the former president. He made a pit-stop at his gravesite, and in 2015, he explicitly compared Roosevelt’s political program to his own in a speech making the case for democratic socialism (something useful to remember for anyone who believes Sanders’ speech yesterday was some grave, out-of-character misstep that will send his poll numbers plunging).\nBut this effort to reclaim the mantle of the New Deal has particular significance in this race. The New Deal may not have been nearly as radical as the Left would’ve liked, both then and now, but it’s been a long time since the Democratic Party has harkened back to it. Sure, Democrats will give Roosevelt and his program a mention from time to time, as Hillary Clinton did in her score-settling book about her 2016 loss to Trump. But in front of a general audience, they’re much more likely to refer back to conservative heroes like Ronald Reagan, as Barack Obama frequently did during his presidency. In an age in which a Democrat declared big government “over,” Roosevelt has become the eccentric uncle the family prefers not to mention at dinner parties.\nBut more pertinent to this moment, the 2020 Democratic contest is shaping up as a showdown between the actual New Deal progressivism today’s Democrats only pretend to embody when the right audience is listening, and the Third Way centrism that made the New Deal tradition its sworn enemy. And the reason is not just Bernie Sanders — it’s also Joe Biden.\nIn presidential contests of the 1980s, the Democratic party went through a similar ideological reckoning, with Reagan’s landslide victories in 1980 and 1984 sending the party into an existential panic. It was especially acute in 1984, when the Democratic candidate, Walter Mondale, had long been identified with the New Deal tradition. Democrats were suddenly split between New Deal liberals — figures like Mondale, Ted Kennedy, and Mario Cuomo — and post-New Deal liberals, or “neoliberals” — including Gary Hart, Bill Bradley, and a young, forty-something Joe Biden (this was long before the “neoliberal” label became so toxic its adherents decided to claim it didn’t really exist).\nAfter Mondale’s catastrophic loss, party members pointed the finger at New Deal liberalism. Mondale, they argued, had been too liberal, allowing Reagan to carry vast swaths of the South. Party officials like Dave Nagle, then the chairman of the Iowa Democratic Party, called for the party to jettison New Deal Democrats like Kennedy, reject “interest groups” — code for anyone who didn’t adhere to the Democrats’ imagined fantasy of a straight, white, middle-class man — and embrace the new breed of triangulating Democrats like Hart and Biden.\nIn 1987, as the first post-Reagan presidential contest approached, for the first time no “mainstream” Democratic candidate — code for anyone who wasn’t Jesse Jackson — came out of the New Deal tradition, with all the leading candidates preaching the necessity of breaking from the party’s golden age. These were candidates like Bruce Babbitt, Michael Dukakis, Dick Gephardt, Hart and, yes, Biden.\n“Biden fascinates young audiences,” wrote the Christian Science Monitor in a June 1987 profile of the young candidate. “His words have an ’80s ring. He speaks the language of now. He’s up to date. This is no tradition-bound Democrat living in the shadow of Franklin D. Roosevelt’s New Deal, à la Walter Mondale.”\nAs is well-known, Biden’s attempt that year to lure the youth toward neoliberalism by being the Poochie of the 1980s didn’t work out, largely because of a rather hilarious plagiarism scandal that saw his campaign go down in flames. But the fact that the White House eluded him didn’t stop Biden from having a hand in just about every Third Way disaster over the next few decades, from mass incarceration and mass surveillance, to welfare reform and banking deregulation.\nSo the irony here is palpable. Through his full-throated embrace of the New Deal and his declared intent to finish the work Franklin Roosevelt started nearly a century ago, Bernie Sanders — the independent socialist who has spent a career railing against the Democratic Party — is now the only political figure explicitly running on the party’s greatest tradition. Meanwhile, his most formidable rival at this point, a decades-long Democrat most associated with the party’s current establishment, is one of the men chiefly responsible for that tradition’s expulsion from the party — and, judging by his campaign so far, he’s in no hurry to revive it.\nThe New Deal may not really be socialism. But given how far the Democratic Party has strayed, perhaps only a democratic socialist could bring its promise roaring back to life.", "url": "https://jacobinmag.com/2019/06/bernie-sanders-speech-democratic-socialism-new-deal-fdr"}