{"authors": ["Adam Owens", "Wral Anchor Reporter"], "date_download": "2020-05-04 20:21:31", "date_modify": "2020-05-04 20:21:31", "date_publish": "2019-05-02 12:39:00", "description": "A Raleigh man was arrested Wednesday on peeping charges involving a student at the school where he worked. Todd Christopher Aberts, 37, of the 5900 block of Woodcrest Drive, was charged with...", "filename": "_9f427cda47dffa3c0f1d0ca0d4b5abf3_1588623691.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9f427cda47dffa3c0f1d0ca0d4b5abf3_1588623691.html", "title": "Raleigh school employee charged with peeping", "title_page": "Raleigh school employee charged with peeping", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A Raleigh man was arrested Wednesday on peeping charges involving a student at the school where he worked.\nTodd Christopher Aberts, 37, of the 5900 block of Woodcrest Drive, was charged with secret peeping and possessing images from peeping.\nProsecutors said in court Thursday afternoon that Aberts used a cellphone to secretly take photos of a girl at St. David’s School, including one up her skirt. Someone saw him do it and reported him to school authorities.\nThe website of the private school in Raleigh had listed Aberts as the technical theater, audio-visual and reservations coordinator, but his information had been removed from the site by noon Thursday.\nHeadmaster Jonathan Yonan sent a message to the families of St. David’s students on Thursday stating that Aberts no longer works at the school. He said school officials immediately contacted Raleigh police and the family of the girl, who he said was an upper-school student, after they learned of the incident, and Aberts was arrested off campus.\nProsecutors said Aberts admitted to the crime, saying he had made a mistake.\n“All appropriate actions are being taken. It is standard school policy that employees are subjected to a thorough criminal background check prior to employment. Because of our longstanding partnership with the Raleigh Police Department, our school was able to respond effectively and promptly,” Yonan said in his message. “We hold the safety of our students as our highest priority. We lean firmly on the truth that God identifies and cares for all those who are afflicted, and we invite you to join us in praying at this time for all parties involved.”\nDefense attorney Seth Blum called the charges against Aberts “overblown” but didn’t elaborate.\n“We are looking forward to the facts coming out. I hope that, when people get the whole story, they will see this is not what it appears to be,” Blum said.\nAberts worked at Raleigh Little Theatre from 2012 to 2017, and theater director Charles Phaneuf said he “never had any complaints” about him during that time.\nAberts remains in the Wake County jail under $100,000 bond, although he could be released by posting a $50,000 bond and agreeing to house arrest.\nIf he is released on bond, he is barred from going onto the St. David’s campus and is prohibited from any contact with the alleged victim or anyone under age 18.\nFour years ago, Scott Anthony Mann, a music teacher at St. David’s, pleaded guilty to taking indecent liberties with a minor for snapping photos of young boys in the school bathroom. He was sentenced to five to 8¼ years in prison.", "url": "https://apnews.com/9f427cda47dffa3c0f1d0ca0d4b5abf3"}