{"authors": ["Bishop Nash The Herald-Dispatch Bnash Heralddispatch.Com"], "date_download": "2020-05-04 20:05:13", "date_modify": "2020-05-04 20:05:13", "date_publish": "2019-02-23 08:15:28", "description": "HUNTINGTON — How fast you can change a tire has long been bantered as a measuring stick for one's auto mechanical handiwork — even for the boastful layman who may or may not actually be able to...", "filename": "_fd3691dba0e1412d83c2320dc0c25ee9_1588622713.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fd3691dba0e1412d83c2320dc0c25ee9_1588622713.html", "title": "Career tech students test their skills", "title_page": "Career tech students test their skills", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON — How fast you can change a tire has long been bantered as a measuring stick for one’s auto mechanical handiwork — even for the boastful layman who may or may not actually be able to unscrew the lug nuts in less than five minutes.\nBut for students at the Cabell County Career Technology Center, it’s a bit harder to fib when you’re on an actual clock with a class full of friends watching every twist of the tire iron.\n“That really lets you know if you need to step up what you’re doing and how hard you need to push yourself,” said Joshua Lusk, a junior auto mechanics student from Ona.\nLusk completely jacked up, down and replaced the tire on the shop’s dummy Ford Taurus in around nine minutes. The all-time school record to change a tire, the class pointed out, is an astonishing subfour minutes.\nThe career center was abuzz with it all Friday for the school’s annual skills competition, testing students in every trade against each other and crowning the handiest to walk their halls.\nPrincipal Frank Barnett compared it with intramural sports at other schools. Auto mechanical students like Lusk competed in how quickly they could change tires or brake pads.\nIn the Machinery Tool Technology room, students hurried twirling metal pieces through the shop’s lathes. Upstairs, coding students clattered out lines of code for an imaginary zoo’s website.\n“These students are competitive by nature,” Barnett said. “And while these may not be athletes, this is their state championship and their Super Bowl, and this is how they get ready for it.”\nThe hall outside the graphic design room was papered by intricate T-shirt concepts with West Virginia themes.\nThe added edge of competition — compounded by the strict deadlines to finish it — gears students to perform at their best in a limited time like they would on a reallife job, said Karleigh Wooten, a senior graphic design student from Barboursville.\nPlastering their work outside for the rest of the school, instead of keeping it in the class, is nice as well.\n“It’s a really good experience to be able to show ourselves off like this and put our designs out there for everyone else to see instead of just our little class,” Wooten said.\nOver at the Building Technology room, teams of students banged out wooden benches that would eventually go to Cabell Midland High School.\nSean Taylor, a senior Building Technology student from Huntington, said it’s not only fun to compete, but it also helps knock out the benches quickly.\n“In a sense it is a competition, but we’re goofing around with each other so we can make it more fun than just a competition,” Taylor said.\n“We’re not setting our eyes completely on winning it. It’s more of completing it and having fun with it.”\nThe competition day prepares students for the state skills competition in Fairmont during the third week of March. Cabell County students will compete against other career-technology students across West Virginia in their trades’ state championships.", "url": "https://apnews.com/fd3691dba0e1412d83c2320dc0c25ee9"}