{"authors": ["Will Webber"], "date_download": "2020-05-04 20:28:52", "date_modify": "2020-05-04 20:28:52", "date_publish": "2019-03-03 06:25:00", "description": "At least one of his players left the court in tears and a number of his fans headed for the exits crying foul, but when things settled down and Jason Abeyta packed his bag to head home Saturday...", "filename": "_218122bda96f4f3e9c0f763515b4d1ee_1588624132.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_218122bda96f4f3e9c0f763515b4d1ee_1588624132.html", "title": "Horsemen corral Indian School, 54-41, for district tournament title", "title_page": "Horsemen corral Indian School, 54-41, for district tournament title", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "At least one of his players left the court in tears and a number of his fans headed for the exits crying foul, but when things settled down and Jason Abeyta packed his bag to head home Saturday night, he couldn’t help but sound like a guy anticipating some tough news.\n“It’s one of those things where I’m hoping for something good, but you never know,” he said.\nThe head coach of the Santa Fe Indian School boys basketball team, Abeyta had just watched his Braves give up an 11-0 run to end a 54-41 loss to top-ranked St. Michael’s in the championship game of the District 2-3A Tournament. While the Horsemen are a lock for the No. 1 overall seed when pairings for the Class 3A State Tournament are released Sunday night, SFIS is one of those teams who presents a strong case to be seeded no lower than third — but may well drop as low as No. 4 or 5.\n“All year I’ve been putting them\nNo. 2 in my poll for the coaches’ thing, but realistically I think the committee might not put them that high,” St. Michael’s head coach David Rodriguez said. “They’re a tough team, great players and they get after it. I’m telling you, they’re right there with us. We’ll just have to see what happens.”\nSaturday’s win was the fourth of the season for the Horsemen (19-8) against SFIS (17-11). Like all the others, it had its share of weird moments.\nSt. Michael’s cruised to a 22-10 lead midway through the second quarter thanks to a suffocating 1-3-1 zone that confused the Braves and forced them to into a slow start where they missed 11 of their first 14 shots. Horsemen big man Thomas Wood started off red hot, scoring seven points with four rebounds and a blocked shot in just four minutes in the first quarter.\nFor a quarter and a half, the Horsemen looked every bit the state title favorite.\nBy the time the Braves figured out the zone, the flood gates opened. SFIS responded with a 17-0 run that continued into the second half. They scored the final 13 points of the second quarter to take a 23-22 lead at the break and outscored the Horsemen 22-2 over a 7-minute, 37-second span between the first and second halves.\n“We got out of our game for a little there,” Wood said. “Composure. We just had to get through it and not make mistakes, cut down on those things.”\nDown eight points, the Horsemen responded with a 15-0 run. SFIS went scoreless for the final 4:37 of the third quarter. A three-point play by Hayden Lee tied the game in the final minute and a half, then he hit two free throws to put St. Michael’s on top.\n“We knew what we were getting into with this game,” Wood said. “We’ve been preparing all week, watching film and doing what we needed to, but no surprises, really.”\nSt. Michael’s went back in front by as many as seven points, but had the lead trimmed to 43-41 after Ethan Roanhorse drained a 3-pointer from the wing with four minutes left in the fourth quarter. Those were the last points the Braves would score. Victor Otero hit a clutch 3-pointer to answer Roanhorse, setting the stage for one last push.\n“We’ve been talking so much about handling pressure, about handling runs, and I don’t think we’ve been great at that,” Rodriguez said. “That’s partly because we were overwhelmed with our early season competition. We didn’t handle that good, and then we didn’t see a lot of pressure in our district season. But for us to grow up and finally handle that half-court trap, we had to do it without a timeout. We have eight seniors — that’s our timeout.”\nUsing a five-in, five-out rotation at the midpoint of every quarter for much of the season, Rodriguez said his second unit is one of the best teams in the district, if not the state.\nThat group consists of big men Lee and Lucas Coriz, guards Jacob Roybal and Dillon Montoya, and forward Devon Flores. That unit saved the day after the Braves rolled to a 32-24 lead.\nIt was those five players who pitched the shutout for the rest of the third quarter and put the Horsemen back in front for good.\nWood was the only St. Michael’s player in double figures with 16 points. He also had nine rebounds and two blocks, doing much of his work in the paint against SFIS big man James Bridges.\nBridges and Anders Pecos had a team-high nine points each while Bridges added seven rebounds and a blocked shot.\nAs down as his players were after the game, Abeyta said there’s a different feel to this year’s state tournament.\nWhile a No. 4 seed would leave the Braves on a presumed collision course with St. Michael’s in the state semifinals, it’s a welcome reprieve from years past.\n“I don’t really think these district tournaments mean much because it probably doesn’t change our seeding, but after all those years being in the same district as Hope and Bernalillo and now St. Mike’s, I’m just happy we’re in that top-three or four discussion,” he said. “At least now we’re up there. At least now we’re considered a dangerous team, you know what I mean?”", "url": "https://apnews.com/218122bda96f4f3e9c0f763515b4d1ee"}