{"authors": ["Natasha Fernández-Silber", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Samuel Farber", "Keeanga-Yamahtta Taylor", "Sam Gindin", "Peter Gowan"], "date_download": "2020-05-04 19:51:39", "date_modify": "2020-05-04 19:51:39", "date_publish": "2019-07-01 00:00:00", "description": null, "filename": "2019_07_socialism-progressives-liberalism_1588621899.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/01141355/GettyImages-1148958281.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_socialism-progressives-liberalism_1588621899.html", "title": "Why We’re Socialists, Not “Progressives”", "title_page": "Why We’re Socialists, Not “Progressives”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "A question we often hear as socialist organizers is whether it’s really necessary to use the “s” word — socialism! — when talking about issues like Medicare for All, affordable housing, or a Green New Deal. Can’t we ignore all of those pesky “isms” and just “do the work”?\nIt’s a fair question, given that for decades, most activists on the progressive left have avoided identifying as socialists (or even openly critiquing capitalism). But it’s also fair to ask: where has all this ideology-free, Red Scare–proof “work” gotten us?\nDonald Trump sits in the White House. Three billionaires own more wealth than the bottom 90 percent of the US population. And climate change poses an imminent, existential threat to human civilization.\nWe are at a crossroads. If we want to guarantee a livable world for ourselves and future generations, we cannot continue to accept defeat. But neither can we win if our politics are too timid to tell the truth about the challenges we face, and what is to blame for them.\nAnd here is the truth: the climate crisis, the crisis of income inequality, the housing crisis (and so many more) have all been caused by the same very powerful, very pernicious “ism.” It’s called capitalism — an economic system designed to endlessly exploit human labor and to endlessly extract natural resources from the planet. A system that delivers profits to a wealthy few while the many suffer, which treats people and their communities as mere investment opportunities, to be abandoned when no longer profitable.\nNothing illustrates this reality better than the climate crisis. Just one hundred companies are responsible for over 70 percent of all global greenhouse gas emissions. The US military emits more CO2 than most countries. The climate crisis has been caused not by our individual consumption habits, but by obscene wealth inequality, by perpetual wars for oil, by the constant need for growth and new markets, by billionaires who use their excess wealth to purchase governments.\nThe climate crisis, quite simply, is a crisis of capitalism, and no “market solution” exists to address it. To paraphrase the famous line, we must either replace capitalism with a more sustainable economic system — or face barbarism and extinction.\nAnd yet, thirty years on from the Cold War, capitalism continues to receive unblinking, near religious reverence in mainstream US political discourse. All of the 2020 Democratic presidential candidates (save for one) enthusiastically defend capitalism. Pete Buttigieg identifies as a proud “democratic capitalist.” Even progressive firebrand Elizabeth Warren feels the need to state repeatedly that she “believes in markets” and describes herself as a “capitalist to [her] bones.” According to Warren, the woes we face as a society are not the fault of capitalism, but of some bad apples within it, who’ve rigged the system for their benefit. We don’t need to end capitalism, she offers, but simply to fix it.\nSurely, there is a place for smart, technocratic policies in any hoped for survival plan. But, as we careen towards the apocalypse, we might stop and wonder why such “fixes” never seem to work for long. Why, for all the Harvard-educated geniuses who’ve graced the halls of Congress over the years, emissions have been rising unabated, inequality grows exponentially, and our life expectancies are dropping. Maybe we can’t just duct tape this thing back together.\nMaybe, instead of finding ways to save capitalism from itself, we should start figuring out how to save ourselves from capitalism.\nOf the current, massive field of 2020 hopefuls, only Bernie Sanders has “a plan for that.” And it’s called democratic socialism, an economic system in which the “means of production” — our factories, our corporations, and our natural resources, etc. — are collectively owned and controlled, so that democracy functions not only in the realm of electoral politics, but in our workplaces and economic life, too.\nIt’s a system in which the fundamentals of human survival and freedom (like healthcare, education, housing, jobs, retirement benefits, the environment) are not bought and sold on the market, but treated as human rights guaranteed to all people. It’s a system in which we work not to make profit for profit’s sake, but to ensure that everyone in our society has what they need to live happy, fulfilled, and healthy lives.\nWhat would life be like for an ordinary worker in such a system? Everyday you would wake up in quality, affordable housing built or subsidized by your government. If you have kids, they’d walk to a quality public school or get dropped off at a free childcare center. You’d ride an electric train or bus to work at a firm that you own or control. Rather than dealing with getting bossed around by some petty tyrant, or competing with your coworkers for some silly promotion, you could focus on what matters: making a better product with your colleagues and contributing to a better world.\nIf you got bored and wanted to change jobs, you could go back to school, for free, and learn new skills. There’d be loads of new jobs, too, funded by the government, to repair our infrastructure, clean and protect the environment, make art, teach, and hang out with old people. And since you’d have healthcare and shelter no matter what, you might start your own company one day, or take a break from work altogether to write that novel you’ve been mulling over. There’d still be heartache, sickness, aging, death. But you would have the time, resources, and social support you need to deal with them in a dignified, humane manner.\nWe can build this world, no question. But to do it, “progressivism” will not be enough. We cannot wait for our intellectual betters to come with “plans” to save us. Ordinary people must become empowered to come up with their own solutions regarding their economic and political circumstances. We need class struggle — guided by the principles of democratic socialism — at work, on the streets, and on the campaign trail. The many must rise up like lions against the few to demand a better world.\nTo build a successful mass movement, in red states and blue, we must build collective power in democratic, self-funded institutions, like unions, and the DSA. We cannot rely on nonprofit organizations that are funded and controlled by corporate sponsors and the wealthy donors who sit on their boards. These organizations do not challenge capitalism because they are fueled by capitalists. The same is true of most politicians, in both major political parties. To win power, we must rally around grassroots-funded, people-powered politicians like Bernie Sanders, Alexandria Ocasio Cortez, and Rashida Tlaib.\nFor too long, segments of the Left have been isolated from each other as they work on distinct struggles for racial justice, denuclearization, environmental justice, prison reform, LGBT rights, women’s reproductive rights, civil liberties, immigration rights, and more. We must develop a coherent economic analysis that enables us to see the relationship between all of these issues under capitalism, and join forces when it counts.\nWhen we come out of the closet as democratic socialists, we say goodbye to the possibility of corporate sponsorship for our activism, or playing nice with benevolent billionaires. But new and better possibilities for organizing emerge. Democratic socialism is the future — and the future is bright.", "url": "https://www.jacobinmag.com/2019/07/socialism-progressives-liberalism"}