{"authors": ["Howard Fischer Capitol Media Services"], "date_download": "2020-05-04 20:04:23", "date_modify": "2020-05-04 20:04:23", "date_publish": "2019-03-01 06:13:00", "description": "PHOENIX — The sponsor of three bills aimed at altering state vaccination laws said Thursday that her proposals are “misunderstood.’’ Rep. Nancy Barto, R-Phoenix, said told Capitol Media...", "filename": "_bb678956a6df443eb431ffc87c673478_1588622663.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bb678956a6df443eb431ffc87c673478_1588622663.html", "title": "Vaccination proposals in Arizona Legislature 'misunderstood,' says sponsor", "title_page": "Vaccination proposals in Arizona Legislature 'misunderstood,' says sponsor", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PHOENIX — The sponsor of three bills aimed at altering state vaccination laws said Thursday that her proposals are “misunderstood.”\nRep. Nancy Barto, R-Phoenix, said told Capitol Media Services nothing in any of the measures that is designed to convince parents to opt out of state requirements to inoculate children as a condition of sending them to child care or public school. Instead, she said, it simply provides information that parents need to make those decisions.\nBarto’s comments come a day after Gov. Doug Ducey said he would veto any measure that he believes will result in fewer children getting immunized against a host of diseases.\nThe governor never addressed the specifics of the three measures that await a House floor vote.\nBut Ducey, with his comments, aligned himself with medical professionals who testified last month that much of what Barto is pushing -- and what cleared the House Committee on Health and Human Services -- would deter parents from vaccinating their children. And that, they warned, would endanger overall public health.\nBarto sidestepped a separate question by the Arizona Capitol Times about whether Ducey himself misunderstood her bills.\nInstead she said there has been an hesitancy to see a connection between vaccinations and “terrible outcomes” for some children who have been inoculated. And Barto said parents who do not believe vaccines are safe should be “spared’’ from the requirements.\n“And they shouldn’t be treated like second-class citizens for using their constitutionally protected right to not be forced to undergo vaccinations,” she said. “We’re headed in that direction.’’\nIt isn’t just Barto who fears that the option for parents to refuse inoculations could evaporate.\nAlso Thursday, Rep. Kelly Townsend, R-Mesa, said she fears efforts by the government to force parents to administer vaccines. Townsend, who has a daughter whose epilepsy she links to childhood immunizations, said she has the ultimate right to refuse to vaccinate the girl’s younger brother.\n“The idea that we force someone to give up their liberty for the sake of the collective is not based on American values but rather Communist,” she wrote on her Facebook page.\nTownsend did not back down when questioned about the comments by Capitol Media Services.\n“My son’s body is sovereign,” she said.\n“The line for me is the government does not have authority to inject him with something and put him at risk,” Townsend said. “That’s my line.’’\nAnd she dismissed the question of whether by not vaccinating her son against communicable diseases she puts at risk other children who cannot be immunized for medical reasons.\n“Who’s more important, my son’s health or the potential (of) contracting measles which may or may not be fatal?” Townsend asked. “We are sovereign and ought to be able to make that decision.’’\nBarto is not alone is proposing new laws about the rights of parents regarding inoculations and hoping that the governor signs them.\nSen. Paul Boyer, R-Phoenix, is pushing similar measures in the Senate. And he defended them as common-sense proposals.\nOne of those requires that parents be given a list of all the ingredients in each vaccine, along with the warning label that the Food and Drug Administration requires manufacturers to provide to doctors. Boyer said there’s no reason all that should not be available to parents.\n“The FDA has mandated that every single ingredient we eat from a food product ... is on the back of the food package,” Boyer said Thursday. “And that’s something we voluntarily consume.’’\nIn this case, he said, parents are being told they have to get their children immunized by injection as a condition of going to school, though parents can opt out.\n“I don’t see any problem with giving parents more information,” he said.\nPotentially more concerning to some is Barto’s proposal to not only expand the right of parents to claim a religious exemption but to eliminate the requirement that they first sign a form, prepared by the state Department of Health Services, acknowledging that they understand the implications of spurning each vaccination as well as the physical effects that getting the disease can have, up to and including paralysis and death. That same form requires parents to also acknowledge that if there is an outbreak of the disease their children can be denied entry to school or child care.\nInstead, they could simply write on any sheet of paper that they are not having their children vaccinated.\nBut even Boyer, who wants the expanded religious exemption, isaid he believes that goes too far in the wrong direction. He said parents should have to acknowledge they know of the specific dangers of what can happen if an unvaccinated child gets a disease.\n“But they should also know that there are risks, benefits and limitations,” he said.\nThe third measure at issue also goes to the question of what parents need to be told. It requires doctors to inform them that there is a test to determine, on a pre-vaccination basis, whether their child already has immunity to the specific disease.\nSeveral doctors who testified on that measure last month said the test is not only expensive but also unreliable.\nAll that goes to why Townsend said she fears the state using its power to coerce parents into getting their children inoculated.\n“When we start having the mindset that, ‘Well you could be harmed but we’re going to put you at risk for the greater good,’ you lose your individual rights,” she said.", "url": "https://apnews.com/bb678956a6df443eb431ffc87c673478"}