{"authors": ["Eugene Robinson"], "date_download": "2020-05-04 20:11:02", "date_modify": "2020-05-04 20:11:02", "date_publish": "2019-02-24 08:50:52", "description": "WASHINGTON — I hope actor Jussie Smollett gets the psychological help he apparently needs. And I hope authorities in Chicago throw the book at him, because the lies he is accused of telling will...", "filename": "_2feebcfd636045de9c02bc4c232a1ff8_1588623062.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2feebcfd636045de9c02bc4c232a1ff8_1588623062.html", "title": "Actor grievously injured countless others", "title_page": "Actor grievously injured countless others", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WASHINGTON — I hope actor Jussie Smollett gets the psychological help he apparently needs. And I hope authorities in Chicago throw the book at him, because the lies he is accused of telling will likely bring great harm to innocent victims.\nSmollett’s arrest Thursday for allegedly filing a false police report came as no surprise. His improbable tale — he said he was accosted last month by two men who yelled racist and homophobic slurs, beat him up, put a noose around his neck and doused him with bleach, with one of the men saying that “this is MAGA [Make America Great Again] country” — sounded like a page from the first draft of a rejected screenplay.\nReal life doesn’t happen that way. Actual white supremacists and homophobes don’t stroll through the streets of Chicago on a bitterly cold night, carrying a hate-crimes kit of rope and Clorox, hoping to chance upon someone who is black, gay and modestly famous. They don’t hurl perfectly scripted insults. They don’t vanish without a trace.\nThe minute I heard Smollett’s story, I suspected it would eventually fall apart — and I feared the potential consequences for genuine victims of genuine hate crimes.\nSmollett was arrested just one day after federal authorities released evidence of the kind of grave threat that really does exist. They announced the arrest of Christopher Hasson, a 49-year-old U.S. Coast Guard lieutenant and self-described white nationalist, for allegedly amassing a deadly arsenal in his Silver Spring, Maryland, home and planning to assassinate a list of public officials and journalists, including House Speaker Nancy Pelosi and MSNBC host Joe Scarborough.\nThe menace of such white-supremacist terrorism is real and growing. Debacles such as Smollett’s apparent hoax do nothing but provide excuses to ignore the threat.\nWere the news media too credulous in their initial reporting about Smollett’s claim? Not necessarily. A well-known person reported being assaulted, and Chicago police said they were taking his story seriously. Smollett had suffered some minor injuries and been treated at a hospital. I don’t know what reporters were supposed to do except report the facts as far as they were known — absent concrete evidence that those facts were actually fabrications.\nPolice now say that the scratches on Smollett’s face were self-inflicted and that he paid two men $3,500 to rough him up — gently — so he could become more famous and demand more money for his role in the Fox television series “Empire.” But nobody knew that at first. When new facts gradually emerged that cast doubt on Smollett’s account, those facts were reported.\nI also don’t blame the fellow “Empire” cast members who stood by Smollett. It is only natural to want to support a friend and colleague who is in crisis.\nBut politicians who rushed to use Smollett’s account as a shocking sign of the times — Sens. Kamala Harris, D-Calif., and Cory Booker, D-N.J., both called it an “attempted modern-day lynching,” for example — were foolish to do so. The story was shaky from the beginning, and a little early caution would have made unnecessary a lot of eventual backpedaling.\nWas there, in general, an eagerness to believe Smollett because of the atmosphere President Trump has created? Probably — and, I would argue, quite understandably.\nAccording to the FBI, there were 7,175 hate-crime incidents in this country in 2017 — a big jump from 2016, when there were 6,121 such incidents. (Those figures surely minimize the real problem, since many jurisdictions do not report hate crimes to the FBI at all.) Regarding incidents in 2017 in which victims were targeted because of race, 2,013 attacks were against African-Americans versus 741 against whites. Of incidents in which victims were targeted because of religion, the vast majority were against Jews and Muslims. There were more than a thousand anti-LGBT incidents versus just 32 classified as anti-heterosexual.\nNo, Trump isn’t telling people to go out and commit hate crimes. But the white-supremacist lunatic who killed 11 innocent Jews in a Pittsburgh synagogue last October was apparently motivated, somehow, by Trump’s apocalyptic rhetoric about illegal immigration. It’s not hard to see why, to some, Smollett’s story might have seemed plausible.\nTrump didn’t actually put words in Smollett’s mouth, though. The actor allegedly made the decision to lie and should now face the consequences.\nPolice officials in Chicago, where the murder rate is out of control, had to waste time and resources on a wild goose chase. Even worse, the next victim of an actual hate crime might not be believed. By allegedly feigning injury to himself, Smollett grievously injured untold others.\nEugene Robinson is a syncicated columnist. His email address is eugenerobinson@washpost.com.", "url": "https://apnews.com/2feebcfd636045de9c02bc4c232a1ff8"}