{"authors": ["Katie Finlon Kfinlon Shawmedia.Com"], "date_download": "2020-05-04 20:22:35", "date_modify": "2020-05-04 20:22:35", "date_publish": "2019-02-25 05:52:00", "description": "SYCAMORE – Carmeda Gregory, a senior tax analyst for H&R Block for 47 years, said this tax season is seeing the most major rule changes since about 1988. Gregory said many people have come...", "filename": "_fad2fef95665445bb58745a9bdd80c40_1588623755.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fad2fef95665445bb58745a9bdd80c40_1588623755.html", "title": "Consultant breaks down new federal tax law, what's being done with refunds", "title_page": "Consultant breaks down new federal tax law, what's being done with refunds", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SYCAMORE – Carmeda Gregory, a senior tax analyst for H&R Block for 47 years, said this tax season is seeing the most major rule changes since about 1988.\nGregory said many people have come in this season who have not been happy with their tax refunds – or lack thereof. This year in particular, she said, her clients have had a lot of meltdowns over their tax returns.\n“I do know of one client that left my office, and before he got to the front door, he was on the phone with [Sen. Dick] Durbin’s office,” Gregory said.\nReactions to the tax law updates and changes in tax refunds come after President Donald Trump signed a new tax law in December 2017. The law included less withholding from paychecks and some changes to deductions taxpayers can have, and many taxpayers are facing smaller-than-expected refunds in light of the changes.\nAccording to the IRS, the average taxpayer’s refund is down by 8.4 percent this year from Feb. 1, 2018. The total number of refunds are down 24.3 percent, and total refund amounts are down 30.6 percent.\nThe 2018 changes also include the new 1040 form, which is a half-page, postcard-sized form, and replaces the 1040A and 1040EZ forms.\nGregory said more of her clients who always have had refunds are seeing balances due for this tax year.\n“Although many did check to see if they were having proper withholding, a lot of taxpayers would have had the proper withholding had the rules not changed,” Gregory said.\nGregory said a lot of people have lost deductions since the rules changed. She said those who have been most affected include truck drivers working for somebody else on a W-2 tax form, teachers and union workers who previously could write off union dues, tools and uniforms on their tax return.\n“They’re losing big time,” Gregory said. “I’m quite sure that our congressmen and our senators are being inundated by letters and emails and phone calls about, ‘What have you guys done to us?’ ”\nGregory said the changes also affect taxpayers who work from home. Unless they are a qualified business, she said, an office in an employee’s home no longer is going to be a tax deduction for them.\nIn the past, workers were able to write off mileage on their own cars used for work to the extent where they wouldn’t be reimbursed, Gregory said. Now you can’t do that anymore as an employee unless you are on a 1099 tax form, she said.\n“So many employers are beginning to work out some sort of a reimbursement option, some sort of an accountable plan, in order to reimburse them,” Gregory said.\nGregory said the changes have saved people who haven’t had to itemize their write-offs in the past. She said single people could only have $6,000 worth of deductions in the past, but it now has doubled to $12,000, for example.\n“So they have a much larger write-off than they have had in the past,” Gregory said.\nGregory said the child credit has doubled from $1,000 to $2,000 a child. She said people also need to be aware that children no longer fall under the child credit once they turn 17, but instead fall into the new family credit, which also can include other relatives, such as live-in Aunt Susie, for example, whereas that wasn’t the case before.\nGregory said taxpayers need to make sure they have the proper documents and classifications for family members who fall under the family credit under the new rules.\n“The programs that are in place right now are designated to pick up on certain words and certain phrases,” Gregory said. “So if it’s not identified properly, they may not be eligible.”\nEvery time there’s a year with so many changes to tax law, taxpayers need to be aware of those changes and how they will directly affect them so that they can plan accordingly for their financial situation, whether they do their own taxes or go to a consultant, Gregory said.\nShe said people also need to be aware of the extra money that no longer is being withheld from their paychecks so they don’t get in a position where they could get caught in a bind with needing a refund that turns out to be smaller than they thought.\n“No matter how much you try to prepare somebody that that’s maybe going to happen to them, they’ll still have that sticker shock come into play,” Gregory said.", "url": "https://apnews.com/fad2fef95665445bb58745a9bdd80c40"}