{"authors": ["Theophilos Argitis"], "date_download": "2020-05-04 20:06:51", "date_modify": "2020-05-04 20:06:51", "date_publish": "2019-02-09 03:49:02", "description": "Canada's labor market began 2019 with an unexpected employment surge, driven by jobs for youth in services and record private-sector hiring, a sign of strength in an economy facing several other...", "filename": "_284fbac972db435fad36ed77d88b4cad_1588622811.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_284fbac972db435fad36ed77d88b4cad_1588622811.html", "title": "Canada's economy adds 67K jobs but unemployment rises", "title_page": "Canada's economy adds 67K jobs but unemployment rises", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Canada’s labor market began 2019 with an unexpected employment surge, driven by jobs for youth in services and record private-sector hiring, a sign of strength in an economy facing several other headwinds.\nEmployment increased by 66,800 in January, Statistics Canada said Friday from Ottawa. That was driven by a 99,200 gain in services, which offset falling employment in goods producing industries. The gains were almost evenly split between full-time and part-time positions.\nThe picture is much stronger than anyone expected in an economy hit by stresses in the oil sector, weakening housing markets, volatility in global financial markets and waning consumer confidence. The report could ease some concerns about the extent of a current soft patch. Economists were forecasting only a 5,000 employment increase in January.\nThe Canadian dollar rose on the data, with the currency up 0.5 percent to C$1.3242 per U.S. dollar at 8:39 a.m. in Toronto trading. Yields on Canadian two-year government bonds were up to 1.78 percent from 1.77 percent on Thursday.\nEven with the gains, Canada’s jobless rate jumped to 5.8 percent last month, from 5.6 percent in December. But the reason for the increase was more people looking for work – a sign of strength that could indicate the jobs market is pulling new workers into the labor force. That could give the economy more room to run without fueling wage pressures.\nCanada is currently in the middle of what economists believe is a temporary soft patch – with growth hovering at around 1 percent. The central bank expects the slowdown to last through the first few months of this year before growth rebounds this spring to levels closer to 2 percent. In the meantime, policy makers have indicated they will refrain from further increases until that happens.\n“First quarter growth is still setting up to be somewhat weak given what we know is happening in the oil patch,” Royce Mendes, an economist at CIBC World Markets, said in a note to investors. “While today’s data will be bullish for the Canadian dollar and bearish for fixed income, the Bank of Canada is still likely on the sidelines for the first half of 2019.”\nThe labor force increased by 103,700, the biggest one-month increase since 2009. The increase was led by a 60,500 increase in the number of youth joining the jobs market. Youth – people aged 15 to 24 – also led the employment gains, with a 52,800 increase.\nThe jump in January brought employment gains over the past 12 months to 327,200, the biggest year-over-year gain since 2017.\nAnother positive was a shift away from self-employment. The number of people employed by the private sector jumped by 111,500, the biggest one-month gain on record in data going back to 1976. The number of self-employed fell by 60,700.\nOntario, with an employment gain of 41,400, led the job surge among provinces.\nThere continues to be some weaknesses in the numbers. Wage gains remain depressed. Average hourly wages were up 2 percent form a year ago, with pay for permanent employees up 1.8 percent.\nAlberta, which is struggling with slumping oil prices and production curbs in the sector, posted a second straight monthly decline in employment.\nThere were also broad-based losses among goods-producing sectors, including manufacturing.", "url": "https://apnews.com/284fbac972db435fad36ed77d88b4cad"}