{"authors": ["Lauren Brant"], "date_download": "2020-05-04 20:22:36", "date_modify": "2020-05-04 20:22:36", "date_publish": "2019-03-23 01:00:00", "description": "LINCOLN — Over 800 students from 28 DECA chapters across Nebraska competed at the Nebraska State Career Development Conference in Lincoln March 14-16. Scottsbluff and Gering high school students...", "filename": "_19f1fcb7995b466099f4ec2c5ddc9226_1588623756.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_19f1fcb7995b466099f4ec2c5ddc9226_1588623756.html", "title": "Bearcats, Bulldogs qualify for International DECA", "title_page": "Bearcats, Bulldogs qualify for International DECA", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LINCOLN — Over 800 students from 28 DECA chapters across Nebraska competed at the Nebraska State Career Development Conference in Lincoln March 14-16. Scottsbluff and Gering high school students were among those who competed, with several students finishing in the top eight.\nForty-five students from the Scottsbluff DECA chapter and 16 students from the Gering DECA chapter qualified to attend the state conference. Ahead of the conference, students began preparing their projects.\n“Students begin work on projects for this conference in October every year,” said Broc Brown, Gering DECA advisor. “They partner with local businesses and organizations to develop creative marketing projects that they then present at the state conference.”\nWhile several students worked with local businesses, others pursued their own ideas for franchise business plans and independent business startups.\nThe students’ projects comprised of writing papers, designing visual aids and rehearsing their presentations.\nAhead of the state conference, Brown worked with the students to revise their papers, design visual aids, finalize their projects and polish their presentations.\n“By the time state rolls around, the primary advice I give is to relax and have fun,” he said. “They are well prepared and know the information. They just need to be reminded to keep it professional, fun and unique to try and connect with the judge to leave a lasting impression.”\nStudents competed in a variety of events, including written tests, role plays, written marketing research projects, advertising and entrepreneurship projects as well as team management decision competitions.\nTwelve Bearcat groups finshed in the top ten at the state conference.\nMaria Diaz and Hally Wilkins competed in school-based enterprises and finished at the gold level. Ty Corr and Morgan Mickey placed first for their creative marketing project. Brayden Gonzales and Hally Wilkins finished in second place on their learn and earn project. Alexia Diaz and Brayden Gonzales competed in marketing team decision making and finished in seventh place.\nIn the individual competitions, Gavin Howell took third in hotel and lodging management, Sydney Hinze won in financial consulting, Aniah Mobley was second in both financial consulting and principles of finance, Makenzie Dunkel finished in seventh in accounting applications, Brock Nikont was sixth in principles of hospitality and tourism, Andrew Clemens competed in marketing communications and finished in sixth and Cody Fosket was fourth in financial consulting.\nScottsbluff DECA advisor Justin Gipe said in a press release: “Scottsbluff DECA enjoyed another qualifying year, placing in thirteen events and qualifying eleven members for the International Conference in Orlando.”\nBulldogs Tommy Ganos, Kyle Schroeder, Hunter Walker and Brandon Panattoni qualified to compete international conference.\nGanos, Schroeder and Walker finished in second place for sports and entertainment operations research. Schroeder also finished in second for sports and entertainment marketing series event.\nPanattoni finished in third place in the sports and entertainment marketing series event as well as the integrated marketing campaign service.\nThe team of Logan Moravec, Dyson Dollarhide and Nathan VanAnne placed third in franchise business plan. Abby Madden competed in buying and merchandising operations research and finished third. Ava Marez and Mary Newman placed third for their creative marketing project. Kobie Krantz, Eric Blue and John Castrejon-Lopez placed third for their start-up business plan. Individual top eight finishers include: Mary Newman and Matthew Bohlman in business services marketing, Abby Madden in principles of business administration, Kobie Krantz in principles of marketing, and Ganos for business finance series.\n“This was another outstanding year for Gering DECA and it marks our 8th consecutive year Gering DECA has qualified students to attend the international conference,” said Brown. “We would like to thank the many business owners and community members who support our efforts by providing students the opportunity to put classroom learning into practice through these DECA competitive events.”\nGering DECA had all six written projects place in the top three and 15 of the 16 students, who attended the conference, earned a top three written or a top eight individual finish.\nThe conference was held at the Cornhusker Hotel.\nThe 73rd annual International Career Development Conference will be held at the Orange County Convention Center in Orlando, Florida, April 27 through April 30.", "url": "https://apnews.com/19f1fcb7995b466099f4ec2c5ddc9226"}