{"authors": ["Sarah Lindenfeld Hall", "Go Ask Mom Editor"], "date_download": "2020-05-04 20:26:16", "date_modify": "2020-05-04 20:26:16", "date_publish": "2019-04-01 18:54:00", "description": "WakeMed Children's announced Monday that it's now operating an urgent care office dedicated to treating kids. WakeMed Children's-PM Pediatrics Urgent Care opened at noon, Monday, at 6402...", "filename": "_4f2f53dad76ccb808d676c8a13d18302_1588623976.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4f2f53dad76ccb808d676c8a13d18302_1588623976.html", "title": "Nighttime fever? After-hours wound? WakeMed now operates urgent care clinic just for kids", "title_page": "Nighttime fever? After-hours wound? WakeMed now operates urgent care clinic just for kids", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WakeMed Children’s announced Monday that it’s now operating an urgent care office dedicated to treating kids.\nWakeMed Children’s-PM Pediatrics Urgent Care opened at noon, Monday, at 6402 McCrimmon Parkway in Morrisville and will be open from noon to midnight, 365 days a year. The office will treat non-life-threatening common conditions in newborns through college-age patients, providing an alternative to the emergency department when, for example, a toddler’s fever spikes late at night. It also offers services that some primary care offices may not have onsite.\nMost urgent care clinics in the region treat all patients—babies to adults. UNC Urgent Care clinics, which see lots of pediatric patients, treat kids ages 4 months and older at its locations. It operates five clinics in Wake County and plans to open four more. Duke Urgent Care also treats all ages at its clinics. Last week, it announced updates that let patients see wait times and reserve an urgent care appointment online.\nBut WakeMed’s office, which is located in space previously occupied by The Pediatric Express, is designed to only treat children and young adults. The Morrisville office is the first of several pediatric urgent care offices that WakeMed plans to open in collaboration with PM Pediatrics Urgent Care, a national provider of pediatric urgent care with 39 locations around the country. More are planned in northern and western Wake County.\nAccording to the news release, the practice is staffed by board-certified pediatric emergency physicians and pediatricians, and features onsite digital X-ray, EKG and laboratory. In addition to treating a variety of illnesses and injuries, including fever, infections, wounds requiring stitches, fracture management and respiratory care, the practice also treats dehydration, which is particularly important during cold and flu season and when treating heat-related illnesses, the release said.\n“Our focus is to make sure the pediatric services that families need most are available and easily accessible across Wake County,” said Perry Ann Reed, executive director of WakeMed Children’s, in the release. “This collaboration bridges a space that complements our comprehensive care services, including primary care and pediatric specialties alongside WakeMed’s dedicated Children’s Emergency Department, Children’s Hospital and Level IV NICU.”", "url": "https://apnews.com/4f2f53dad76ccb808d676c8a13d18302"}