{"authors": ["Bill Wellock"], "date_download": "2020-05-04 20:17:59", "date_modify": "2020-05-04 20:17:59", "date_publish": "2019-02-27 00:00:00", "description": "KINGSTON — If not for the Luzerne County Transportation Authority, Zoey Spak would need another way to get to class. The 21-year-old takes the bus every day from her Plains Twp. home to the...", "filename": "_ebe30d7067c945bfa6e426a045958034_1588623479.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ebe30d7067c945bfa6e426a045958034_1588623479.html", "title": "LCTA Hears From Student Advisory Council", "title_page": "LCTA Hears From Student Advisory Council", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "KINGSTON — If not for the Luzerne County Transportation Authority, Zoey Spak would need another way to get to class.\nThe 21-year-old takes the bus every day from her Plains Twp. home to the main campus of Luzerne County Community College in Nanticoke, where she is studying education.\nSo it’s fitting that Spak is a members of a student advisory council at LCTA.\n“I would like to see more students ride the buses,” she said. “Gas these days is just so expensive, and it’s just $1.75 to hop on a bus.”\nHer fellow students have started to recognize her on campus as the college’s liaison to LCTA, and she’s been helping. For example, one student who uses a wheelchair had to endure long waits for a ride. A call to LCTA and some adjustments shortened that wait.\nThe group is a year old and is modeled after a similar initiative at the Southeastern Pennsylvania Transportation Authority, said marketing coordinator Lori Vandermark. Students from LCCC, King’s College and Wilkes University are part of the council, and LCTA is hoping to involve students from Misericordia University as well.\nThe goal is to hear from students about what they need as bus riders and to learn when LCTA is meeting their needs or falling short, she said.\nFor example, the authority started night service last year, which is something students could use, she said.\nThe thousands of students in the area are potential customers for the authority.\nFor college students who use the bus often, fares can be cheaper, too. A 31-day unlimited pass is $28 with a student ID. It’s $60 for the general public. There are also three-month and four-month passes for students available at a discount.\nKing’s College junior Joe Kelly is another member of the LCTA’s student group.\nHe has begun spreading the word about bus service on his campus and has reached out to a student commuter group.\nKelly and Spak have discussed creating a survey that would tell the authority learn more about student ridership.\nAs the group grows, they would like to see it develop to the point where it can help the authority make decision, like SEPTA’s youth advisory council does.\n“We just want students to know their options and know that the bus is there for them,” Kelly said.\nSouth Valley\nThe opening of a distribution center in Hanover Twp. for True Value Company highlights a major development for LCTA’s service.\nThe center will bring hundreds of jobs to the “Hanover 9” industrial park, and those workers will need a way to commute.\n“There are two more big ones coming,” said LCTA executive director Norm Gavlick. “We’re going to have to figure out a way to service that.”\nRoutes through industrial parks in that area are already heavily used, he said.\nContact the writer:\nbwellock@citizensvoice.com\n570-821-2051, @CVBillW", "url": "https://apnews.com/ebe30d7067c945bfa6e426a045958034"}