{"authors": ["Colin Gordon", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Dianne Feeley", "Carly Regina", "Joanna Wuest", "Nick Conder"], "date_download": "2020-05-04 19:52:20", "date_modify": "2020-05-04 19:52:20", "date_publish": "2019-10-26 00:00:00", "description": null, "filename": "2019_10_iowa-state-caucus-democratic-primary-2020_1588621940.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/26154651/24958234562_1904302e60_o-1.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_iowa-state-caucus-democratic-primary-2020_1588621940.html", "title": "Caucuses or Not, Iowa Workers Are Getting Screwed", "title_page": "Caucuses or Not, Iowa Workers Are Getting Screwed", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIn early February 2020, the state of Iowa will once again cap months of straw polls, earnest paeans to “heartland” values, and reluctant nibbles on State Fair corn dogs to offer its ranking of the major party presidential candidates. This quadrennial exercise (and especially the Democratic Party’s caucuses) carries the patina of participatory democracy, but it is hard to defend the state’s outsized importance in the nomination process. Iowa voters are not representative of the rest of the country, and the party activists that run the caucuses are not representative of Iowa voters. The Iowa vote is first not because it is important; it is important because it is first — an accident of history that has John Delaney or Michael Bennet defending ethanol subsidies to a huddle of CNN producers on the edge of Wapello County cornfields more than a year and a half before any real votes are cast. That said, the Iowa caucuses are not just about the winners and the losers, the front-runners and the wannabes — they are also about the economics, the demographics, and the politics of Iowa itself.\nSilos and Smokestacks While feed caps and never-to-be-worn-again flannel shirts are staples of pre-caucus photo opportunities, agriculture is not the primary driver of Iowa’s economy. Farming accounts for just 3.4 percent of gross state product and less than 1.5 percent of state employment. Farming is not even the largest employer in Iowa’s nonmetropolitan counties (falling behind manufacturing, retail, government, and health care). Of those who are farmers, most rely on nonfarm sources for the bulk of their household income. The distribution of economic activity and employment in Iowa is not unlike the rest of the country, with manufacturing, health care, retail, and education accounting for about half of all jobs. Agriculture — and the political attention it demands — is magnified for several reasons. Although direct farm employment represents a small share of state totals, it does generate plenty of downstream economic activity — including packing and processing industries, commodities markets, and business services. Commodity prices (especially corn, soy, and pigs) drive land values — and with them, state revenues. (Corn and soy production for export has been roiled by the Trump Administration’s tariff tantrums.) And corn — the state’s primary field crop — is a key component of the energy sector. What’s not fed to the state’s population of 25 million pigs is turned into ethanol — an overbuilt sector that depends heavily on federal subsidies and federal refining standards. Across the rest of its economy, Iowa looks a lot like the rest of the country. After more than a decade of glacial recovery from the Great Recession, employment has largely recovered in manufacturing, construction, finance, and professional and business services. Even with historically low levels of unemployment (at 2.5 percent in September, Iowa had a lower rate than every state but Vermont), the state’s economy is delivering little to working families. Since 2009, the median wage in Iowa has crept up a meager 4.4 percent, and most of those gains have gone to earners in the ninetieth percentile or above. Median household income has inched up over the last decade, and (at $76,068) is not much below that of the nation as a whole — but only because, in a chronically low-wage economy, more family members are in the labor market. For one in five Iowa families, and nearly two-thirds of single-parent families, earnings fall short of meeting even a basic needs budget.\nOld, White, and Moving to Town Iowa’s overall population growth is slow and confined almost entirely to a few metropolitan counties. Nearly two-thirds (sixty-four) of Iowa’s ninety-nine counties saw their peak population before World War II, and two-thirds (forty-two) of those counties saw their peak population in the nineteenth century. In sixty-two of ninety-nine counties, the largest town has a population of less than ten thousand. These nonmetropolitan counties are rapidly aging: in twenty counties (as of the 2010 census), over one-fifth of the population was older than sixty-five. Their job base is relatively weak: often a single low-wage employer such as Walmart, a packing plant, or a distribution center dominates the local labor market. Their wages are lower: the urban-rural wage gap in Iowa widens with educational attainment. And public goods and social services are spread thin. All of this, in turn, yields a starkly uneven and volatile political geography. In 2016, twenty-eight Iowa counties that had gone for Obama in 2012 flipped to Trump by more than 15 percentage points — a change of heart driven largely by a collapse in Democratic turnout. Trump carried ninety-one of ninety-nine counties in Iowa in the 2016 election. Clinton’s eight counties contained over 40 percent of the state population, and all but one were at their peak population in 2016. In its broader demographics, Iowa looks decidedly unlike the rest of the country. As of 2017, over 90 percent of the population identified as white alone, 3.4 percent identified as black alone, and 5.7 percent identified as Hispanic (of any race). In fully seventy-two of Iowa’s ninety-nine counties the non-Hispanic white population was over 90 percent, and in eighty-nine of ninety-nine counties the African-American population was under 3 percent. As in much of the Midwest, the result has been a stark pattern of racial stratification and segregation. The African-American population is concentrated in a few metropolitan counties; and within those metropolitan settings, patterns of residential, school, and occupational segregation are persistent and long-standing. On almost every metric of opportunity and outcome — from grade four math scores to rates of incarceration — Iowa’s racial disparities are alarming and consistently fall at the bottom of state-by-state rankings.", "url": "https://www.jacobinmag.com/2019/10/iowa-state-caucus-democratic-primary-2020"}