{"authors": [], "date_download": "2020-05-04 20:05:49", "date_modify": "2020-05-04 20:05:49", "date_publish": "2019-12-24 06:57:30", "description": "ST. LOUIS JURY SIDES WITH JOHNSON & JOHNSON IN TALC CASE ST. LOUIS (AP) — A lawyer for a woman who claimed that Johnson & Johnson’s baby powder caused her ovarian cancer says he believes...", "filename": "_5e74b810c4ca4a33ac8b07c0bb68aa8d_1588622749.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5e74b810c4ca4a33ac8b07c0bb68aa8d_1588622749.html", "title": "AM Prep-Cooler Copy", "title_page": "AM Prep-Cooler Copy", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ST. LOUIS JURY SIDES WITH JOHNSON & JOHNSON IN TALC CASE\nST. LOUIS (AP) — A lawyer for a woman who claimed that Johnson & Johnson’s baby powder caused her ovarian cancer says he believes that the jury ruling in favor of the company means Johnson & Johnson “is going to see this as approval of their continued sale of talc-based baby powder that harms women.” The jury in St. Louis ruled 9-3 late Friday denying 56-year-old Vickie Forrest’s allegation that more than 30 years of use of the talcum-based powder caused her illness. The St. Louis woman was diagnosed with stage 2 ovarian cancer in 2012 and her attorneys say she’s in remission after surgery and chemotherapy. The lawsuit is among several filed on behalf of thousands of women who claim Johnson & Johnson’s talcum powder contributed to their ovarian cancer. Other lawsuits have claimed that talc products caused mesothelioma (meh-soh-theel-ee-OH’-mah). Juries have awarded billions of dollars in damages but some verdicts have been overturned because of jurisdictional issues.\nBABA RAM DASS, SPIRITUAL GURU AND LSD PIONEER, DIES AT 88\nHONOLULU (AP) — Baba Ram Dass, a 1960s counterculture spiritual leader and early LSD proponent, has died at age 88. His death Sunday at his home in Maui, Hawaii, was announced by his foundation. Dass is best known for the 1971 spiritual primer titled “Be Here Now” that found its way into the hands of backpackers around the world. He was born Richard Alpert. Dass’ LSD experiments while he was a young psychology professor at Harvard got him and colleague Timothy Leary kicked out. A 1967 trip to India introduced him to yoga, meditation and spiritualism and he received the name Ram Dass from a guru. The name means servant of God in Hindi.\nJUNIOR JOHNSON, “THE LAST AMERICAN HERO,” DIES AT 88\nNASCAR Hall of Famer Junior Johnson has died at 88. His death was announced Friday by NASCAR. Johnson honed his driving skills as a moonshine runner in North Carolina before he began competing in NASCAR. He won 50 races as a driver and 132 as a car owner. He was also immortalized as “The Last American Hero” by author Tom Wolfe in a 1965 article for Esquire. Johnson was an inaugural member of NASCAR’s Hall of Fame.\nGERMANY: PASSENGERS STOP RUNAWAY TRAM AS DRIVER PASSES OUT\nBERLIN (AP) - Passengers on a tram in Germany forced their way into the cab and stopped the speeding vehicle after the driver passed out and they couldn’t get the emergency brake to work. Police in Bonn say several passengers called the emergency line in the early hours of Sunday to report that they couldn’t get the driver to respond and the tram had skipped several stops. Getting instructions on the phone from officials, passengers smashed the window of the driver’s cab and managed to stop the tram. No one was hurt. The driver was taken to a hospital and released on Monday.\nCOLD-HEARTED PET OWNER WHO LEFT LIZARDS IN STREET IS SOUGHT\nSTOUGHTON, Mass. (AP) — Police are searching for the owner of several lizards that were found in cages on a street in Massachusetts. The Stoughton (STOHT’-uhn) Police Department posted photos Saturday of six lizards it rescued in the hopes someone would claim the reptiles. Police asked that the owner call the department to explain the abandonment of such “remarkably creepy yet shockingly majestic creatures.” The department says that it’s had an “overwhelming response” to the initial lizard post but that the owner had not been located as of Sunday afternoon. Police say the lizards are being professionally cared for.\nTOP BABY NAMES IN NYC WERE LIAM, EMMA IN 2018, OFFICIALS SAY\nNEW YORK (AP) - New York City health officials say the most popular baby names in the city last year were Liam and Emma. Data released Monday by the city’s Department of Health and Mental Hygiene show there were 779 Liams and 501 Emmas born in New York City in 2018. Liam has been the top boys name since 2016. Emma has been the top girls name since 2017. Some New Yorkers opted for rarer names: There were a handful of girls named Aminah, Ida and Zadie and boys called Bentley, Lucian and Warren.", "url": "https://apnews.com/5e74b810c4ca4a33ac8b07c0bb68aa8d"}