{"authors": ["The New Mexican"], "date_download": "2020-05-04 20:26:11", "date_modify": "2020-05-04 20:26:11", "date_publish": "2019-04-01 01:00:00", "description": "School board meets Tuesday The Santa Fe school board will meet at 5:30 p.m. Tuesday at the Educational Services Center, 610 Alta Vista St. The agenda includes discussions of immunization...", "filename": "_4fe19c2053444ffdbd4c478de925acdb_1588623971.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4fe19c2053444ffdbd4c478de925acdb_1588623971.html", "title": "Smart Board, March 31, 2019", "title_page": "Smart Board, March 31, 2019", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "School board meets Tuesday\nThe Santa Fe school board will meet at 5:30 p.m. Tuesday at the Educational Services Center, 610 Alta Vista St. The agenda includes discussions of immunization rates at each school and the rules and compliance for electronic cigarettes.\nFoundation accepting scholarship applications\nThe Santa Fe Community Foundation is accepting applications for the Michael S. Currier Memorial Scholarship for the 2019-20 academic year. The scholarship fund provides renewable aid to low-income students who plan to pursue an undergraduate degree at an accredited four-year institution beginning in fall 2019.\nStudents must be residents of one of the following counties: Santa Fe, Rio Arriba, Taos, Los Alamos, San Miguel or Mora. Scholarships will be paid to the educational institution in the student’s name to subsidize the cost of tuition, fees, books and living expenses. Applications must be received by May 31.\nStudents can register and access scholarship guidelines and an application at sfcf.spectrumportal.net.\nDistricts honored for music programs\nThe National Association of Music Merchants Foundation this week recognized Santa Fe Public Schools, Albuquerque Public Schools, Farmington Municipal Schools and Rio Rancho Public Schools and as Best Communities for Music Education.\nNow in its 20th year, the Best Communities for Music Education program honors schools and districts for the outstanding efforts of teachers, administrators, parents, students and community leaders who have made music education part of core curriculum.\nThe program evaluates schools and districts based on funding, staffing of highly qualified teachers, commitment to standards and access to music instruction. This year, the foundation is recognizing 623 school districts in 41 states as Best Communities for Music Education.\nACT hosts arts showcase\nThe Academy for Technology and the Classics plays host to its annual Arts Showcase at Warehouse 21 beginning at 5:30 p.m. Saturday. There will be an art show and music provided by the school’s music production class. Student film screenings and a concert will begin at 7 p.m. The concert portion will feature two acoustic Americana bands, marimba and short Shakespearean scenes in between.\nWarehouse 21 is at 1614 Paseo de Peralta. A $5 donation will be suggested at the door.\nSchools presents “Ode to Joy”\nSanta Fe Public Schools, the Lensic Performing Arts Center, Performance Santa Fe and Platinum Music Awards present “Ode to Joy” — the annual showcase of musical talent of public school student performers featuring 240 musicians, dancers and artists. The show will include bands, choirs, rock music, world music ensembles, a string orchestra and more. The master of ceremonies will be Veronica García, superintendent of Santa Fe Public Schools.\nProceeds will help support music education in the public schools. Regular tickets are $10 and VIP tickets are $25. Tickets can be purchased at lensic.org or by calling 505-988-1234.\nTutor training\nReading Quest, a local nonprofit that supports literacy, is hosting two reading tutor training sessions for anyone who wants to learn to tutor students in reading at the kindergarten through third-grade levels. The training sessions will take place from 12:30 to 4:30 p.m. Sunday, April 7, and April 14 at Reading Quest headquarters inside the United Way of Santa Fe County’s Early Childhood Center, 1409 Monterey Drive. To register, email readingquestcenter@gmail.com.\nHighlands hires online expert\nNew Mexico Highlands University has hired Patrick Wilson as the founding director of the university’s new Online and Extended Learning Office. The online education veteran will be tasked with increasing access to higher education for adult learners via online learning.\n“Dr. Wilson comes with a solid background in the administration of online programming at the institutional level as well as the system level,” said Roxanne Gonzales, Highlands University provost and vice president for academic affairs. “He also has a faculty background and has led professional studies programs.”\nMost recently, Wilson was the associate vice president at Tennessee Technological University in the Division of Digital and Distance Education from 2016 to 2018. Previously, Wilson worked in positions with the Tennessee Board of Regents.", "url": "https://apnews.com/4fe19c2053444ffdbd4c478de925acdb"}