{"authors": ["Rachel Baker"], "date_download": "2020-05-04 20:15:45", "date_modify": "2020-05-04 20:15:45", "date_publish": "2019-05-02 00:00:00", "description": "Mead High School student Delaney Langston recently took first place in the jewelry category of the Passing the Torch competition held by Seattle Metals Guild. Langston won with a necklace...", "filename": "_1033de0b3fef4077b859aaf2a6798bb2_1588623345.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1033de0b3fef4077b859aaf2a6798bb2_1588623345.html", "title": "Education notebook: Mead student wins jewelry design award", "title_page": "Education notebook: Mead student wins jewelry design award", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Mead High School student Delaney Langston recently took first place in the jewelry category of the Passing the Torch competition held by Seattle Metals Guild.\nLangston won with a necklace piece titled “Fall.” Designed from silver and nickel silver, it features a large branch of fernlike leaves that clasps the chain in front, allowing the remaining chain to drop down the center with its end adorned with three small leaves.\nCheney High teacher wins cruise\nMonte Syrie, a language arts teacher at Cheney High School, was recently announced to be a winner of the Giving Joy campaign hosted by Norwegian Cruise Line. Out of 2 million votes and 12,000 nominations, 30 teachers were chosen to receive a seven-day cruise for two in addition to paid travel to Seattle for an award ceremony Friday where three grand prize winners will receive $10,000, $15,000 or $25,000 toward their respective schools.\nThe campaign was launched this year with nominations coming from across the U.S. and Canada. Teachers can be nominated by others or themselves with the submission of a photo and short essay. Those selected can choose from 15 different cruises.\nTeacher of Year from Freeman\nLaura Hamma of the Freeman School District was the recent recipient of the Spokane Lilac Festival and BMW Teacher of the Year. Hamma was nominated by Lilac Princess Maggie Bailey, a senior at Freeman High School.\nWest Valley teacher honored\nAlison Clark, a teacher at the Early Learning Center, is the most recent recipient of the Above and Beyond Award given by the West Valley School District. Clark was nominated by her peers for her work and expertise.\nRiverside boosters plan benefit\nRiverside School District will host the Ryan’s Rams Night of Remembrance and Ram Pride May 17 at the Riverside High School stadium, 4120 E. Deer Park/Milan Road, Chattaroy.\nHosted by the Ram Nation Boosters, funds will go to Rams in need.\nRegistration begins at 6 p.m. with a kickoff event to follow at 7 p.m. The “Walk a Mile of Memories” begins at 7:15 p.m. and the event will be concluded with a blessing and send up of sky lanterns. A Farmer’s Daughter food truck will be available for dinner.\nWest Valley block party planned\nWest Valley will host a Community Appreciation Block Party on May 16, 5-8 p.m., at West Valley High School, 8301 E. Buckeye Ave., Spokane Valley.\nThe event will feature a free dinner, displays and performances presented by WVSD students, activities, popcorn and snow cones. A Family Connection Center will be available to provide information about local family support agencies.\nThe Education Notebook appears every Thursday in the Voice. If you have news about your school, students or staff, please let us know so we can help spread the word. Submissions can be emailed to Rachel Baker at rachelb@spokesman.com or mail to her, with attention to Education Notebook, P.O. Box 2160, Spokane, WA 99210. Items also can be emailed to voice@spokesman.com.", "url": "https://apnews.com/1033de0b3fef4077b859aaf2a6798bb2"}