{"authors": ["Cynthia Mccorkindale"], "date_download": "2020-05-04 20:16:41", "date_modify": "2020-05-04 20:16:41", "date_publish": "2019-03-31 10:00:00", "description": "It’s Budget Season in Bethel, and as usual, those of us who are committed to restraining spending are suffering the slings and arrows of those who believe that more money equals more...", "filename": "_6f9b32d85cb946cabfa6eceb699b9c7d_1588623401.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6f9b32d85cb946cabfa6eceb699b9c7d_1588623401.html", "title": "Where I Stand Unions dictate much of local budgets", "title_page": "Where I Stand Unions dictate much of local budgets", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s Budget Season in Bethel, and as usual, those of us who are committed to restraining spending are suffering the slings and arrows of those who believe that more money equals more progress.\nBut there’s a bigger issue — one that is rarely ever voiced. It’s time to put a choke-chain around the unions — especially the AFT.\nUnions were the perfect response during the Industrial Revolution to exploitative employers. Workers needed to galvanize in order to protect themselves. However, now the tables are turned, and the weasels appear to be guarding the henhouse.\nThe Speaker of the House of Representatives is Joe Aresimowicz, who is also a longtime union staffer. In fact, Aresimowicz even attended the official union’s institution of higher learning — the National Labor College. At one point, there were those who believed that the overlapping of these two roles might become problematic. However, it was determined by the courts that Aresimowicz’s employment combined with his government position did not constitute a conflict of interest.\nIs no one willing to admit that it’s the unions’ stronghold on state government that prevents Connecticut towns from controlling our own budgets? In Bethel, a whopping 85 percent of the Board of Ed’s budget comes from salaries and benefits — probably 98 percent of which are contractual. Those increases occur no matter what the BoF or taxpayer thinks.\nSo, if you are someone who supports antibullying, start by putting a choke-collar on these heavyweight unions our towns “negotiate” with every year. Only then will we be able to fairly assess our town budgets and all it entails. The taxpayers need to take back the power. In general, people appear to be strangely complacent on this topic, seemingly unwilling to point to it as an issue. There is a huge elephant planted squarely in the middle of the room that is sucking out all our oxygen year after year, leaving taxpayers gasping for air. Especially with state taxes and tolls undoubtedly coming our way, as well as the growing diaspora out of Connecticut, can we simply stand by and let this oppression continue?\nAs a taxpayer, wouldn’t you prefer the School Superintendent and/or Town Administrative team oversee hiring and firing of its own staff? Every year, the Selectmen and Board of Finance are forced to subordinate their own judgment and accept union demands and contracts, as if they were simply a “fact of life!”\nWell, I, for one, have grown quite weary of this process, and every year that goes by, my resentment grows. The combination of the union’s unchallenged power hold and the state’s unfunded mandates turn the school and town budget process into an unnavigable maze where, in the end, there isn’t even the tiniest kernel of corn for the mouse to find!\nThis ridiculous, convoluted process is like some sort of weird family secret that everyone knows about but no one wants to discuss. It’s the main reason local taxpayers become so hostile toward each other at this time of the year — especially regarding the education budget. Pro-budget voters accuse those who do not support it of not caring about education, and being unappreciative of teachers. This is not at all true. Most of us who decry these “unavoidable” budget increases are simply conservatives who are fed up with being handcuffed to a corrupt system that has so many overlapping special interest groups it’s at the point of insanity.\nWe need to realize — and admit that — unless the relationships in Hartford actually change, we are doomed to go through this same nonsense every year. And, to those who believe that the unions are “protecting” teachers, you are flat-out deluding yourselves.\nBethel’s BoE describes itself as being in the “people business,” and they undoubtedly are. But does that really matter when it’s the money-seeking/power-grabbing/politically-motivated unions who are calling the shots? I promise you, the unions are not in the “people business” as much as they are in business for themselves.\nSomething’s gotta give.\nCynthia McCorkindale is a member of the Bethel Board of Finance.", "url": "https://apnews.com/6f9b32d85cb946cabfa6eceb699b9c7d"}