{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:18:43", "date_modify": "2020-05-04 20:18:43", "date_publish": "2019-12-09 15:36:31", "description": "Today in History Today is Sunday, Dec. 15, the 349th day of 2019. There are 16 days left in the year. Today's Highlight in History:", "filename": "_e2b548fde77d4faa87a8278bcc12c7ff_1588623523.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e2b548fde77d4faa87a8278bcc12c7ff_1588623523.html", "title": "Today in History", "title_page": "Today in History", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today in History\nToday is Sunday, Dec. 15, the 349th day of 2019. There are 16 days left in the year.\nToday’s Highlight in History:\nOn Dec. 15, 1978, President Jimmy Carter announced he would grant diplomatic recognition to Communist China on New Year’s Day and sever official relations with Taiwan.\nOn this date:\nIn 1791, the Bill of Rights, the first ten amendments to the U.S. Constitution, went into effect following ratification by Virginia.\nIn 1890, Sioux Indian Chief Sitting Bull and 11 other tribe members were killed in Grand River, South Dakota, during a confrontation with Indian police.\nIn 1944, a single-engine plane carrying bandleader Glenn Miller, a major in the U.S. Army Air Forces, disappeared over the English Channel while en route to Paris.\nIn 1961, former Nazi official Adolf Eichmann was sentenced to death by an Israeli court for crimes against humanity. (Eichmann was hanged 5 1/2 months later.)\nIn 1966, movie producer Walt Disney died in Los Angeles at age 65.\nIn 1967, the Silver Bridge between Gallipolis (gal-ih-puh-LEES’), Ohio, and Point Pleasant, West Virginia, collapsed into the Ohio River, killing 46 people.\nIn 1971, the Secret Service appointed its first five female special agents.\nIn 1974, the horror spoof “Young Frankenstein,” starring Gene Wilder and directed by Mel Brooks, was released by 20th Century Fox.\nIn 1989, a popular uprising began in Romania that resulted in the downfall of dictator Nicolae Ceausescu (chow-SHEHS’-koo).\nIn 2000, the long-troubled Chernobyl nuclear power plant in Ukraine was closed for good.\nIn 2001, with a crash and a large dust cloud, a 50-foot tall section of steel — the last standing piece of the World Trade Center’s facade — was brought down in New York.\nIn 2013, Nelson Mandela was laid to rest in his childhood hometown, ending a 10-day mourning period for South Africa’s first black president.\nTen years ago: World leaders formally opened a U.N. climate change conference in Copenhagen. The Washington, D.C. City Council voted to legalize same-sex marriage. Boeing’s new 787 “Dreamliner” jet went on its long-delayed first test flight, lifting off from Paine Field in Everett, Washington. Evangelist Oral Roberts died in Newport Beach, California, at age 91.\nFive years ago: A 16-hour hostage siege began in Sydney, Australia, as an Iranian-born self-styled Muslim cleric took 17 hostages at a cafe; police ended up storming the cafe, resulting in the deaths of the gunman and two of his captives.\nOne year ago: President Donald Trump said Interior Secretary Ryan Zinke would be leaving the administration at year’s end; Zinke was facing federal investigations into his travel, political activity and potential conflicts of interest. Fearing that the incoming administration of Brazilian President-elect Jair Bolsonaro could restrict same-sex marriage, about 40 gay couples were married in downtown Sao Paulo.\nToday’s Birthdays: Singer Cindy Birdsong (The Supremes) is 80. Rock musician Dave Clark (The Dave Clark Five) is 77. Rock musician Carmine Appice (Vanilla Fudge) is 73. Actor Don Johnson is 70. Actress Melanie Chartoff is 69. Movie director Julie Taymor is 67. Movie director Alex Cox is 65. Actor Justin Ross is 65. Rock musician Paul Simonon (The Clash) is 64. Movie director John Lee Hancock is 63. Democratic Party activist Donna Brazile is 60. Country singer Doug Phelps (Brother Phelps; Kentucky Headhunters) is 59. Movie producer-director Reginald Hudlin is 58. Actress Helen Slater is 56. Actor Paul Kaye (TV: “Game of Thrones”) is 55. Actress Molly Price is 54. Actor Garrett Wang (wahng) is 51. Actor Michael Shanks is 49. Actor Stuart Townsend is 47. Figure skater Surya Bonaly is 46. Actor Geoff Stults is 43. “Crowd-hyper” Kito Trawick (Ghostown DJs) is 42. Actor Adam Brody is 40. Actress Michelle Dockery is 38. Actor George O. Gore II is 37. Actress Camilla Luddington is 36. Rock musician Alana Haim (HYM) is 28. Actress Maude Apatow (AP’-ih-tow) is 22. Actress Stefania Owen is 22.\nThought for Today: “The world is moving so fast these days that the one who says it can’t be done is generally interrupted by someone doing it.” — Harry Emerson Fosdick, American clergyman (1878-1969).\nCopyright 2019, The Associated Press. All rights reserved.", "url": "https://apnews.com/e2b548fde77d4faa87a8278bcc12c7ff"}