{"authors": ["John Hirschauer"], "date_download": "2020-05-04 20:23:57", "date_modify": "2020-05-04 20:23:57", "date_publish": "2019-02-10 11:00:00", "description": "Recently the newspaper ran a piece highlighting an ANCOR Foundation report that ranked Connecticut 31st out of 50 states plus the District of Columbia in its care for persons with intellectual and...", "filename": "_373b7a1bff7a418b8ef3f742c34bddd7_1588623837.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_373b7a1bff7a418b8ef3f742c34bddd7_1588623837.html", "title": "Where I Stand Report misleads on Training School", "title_page": "Where I Stand Report misleads on Training School", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Recently the newspaper ran a piece highlighting an ANCOR Foundation report that ranked Connecticut 31st out of 50 states plus the District of Columbia in its care for persons with intellectual and developmental disabilities (I/DD). There is much to be fixed in Connecticut’s network of care for individuals with I/DD, but the premises used by ANCOR in its formulation of its state rankings are ideological in part and are not without bias.\nThere are metrics in the report worth taking seriously — for instance, the number of families and individuals waiting for services and the average cost of caring for clients are useful measures of a state’s I/DD services — but the report takes great pains to demonize what it calls “large state facilities.” The quality of care at those “facilities,” and the satisfaction of the residents and families who are served there, are never mentioned, let alone quantified. The mere fact that such services exist in a particular state is presented as a stand-alone indictment of that state’s care network for persons with I/DD.\nI am a volunteer at the Southbury Training School. In my own experience as a volunteer, I have seen the outstanding care provided by staff and the support offered by my fellow volunteers to the population at Southbury. The smiles of residents during music sessions, or the fulfilling work they do in the on-campus agriculture, thrift store, and greenhouse programs have made my countless hours of volunteering at Southbury one of the great consolations of my life.\nMany of the residents who remain at Southbury are profoundly medically or behaviorally involved and have lived at STS for the majority of their lives. Some cannot speak, others are blind or deaf, and still others utilize feeding tubes and require 24/7 medical services. Those guardians and family members with loved ones at Southbury with whom I have spoken are deeply grateful for the care that their loved ones receive and worry that arbitrary reports like this one will be used as a pretext to close the care community at STS and move their loved ones into inappropriate placements.\nIn 2016, more than 300 persons in Connecticut with intellectual and developmental disabilities were inappropriately placed in non-I/DD nursing homes. This number is likely similar today and stands as a serious indicator that our state’s system is, in many ways, broken. Southbury is a far better option for that population and ought to be made available to them and their families, not closed or deemphasized.\nIt is a wonderful thing that those who can or desire to live in HCBS-waiver settings have that right, and the state ought to continue to expand such services for individuals for whom it is appropriate. But the families at Southbury, and those families on the waiting list for services whose loved ones might benefit from the intensive medical or behavioral supports offered there, deserve to be “included” in the “Case for Inclusion” report as much as those whose needs differ.\nJohn Hirschauer is a resident of Southbury.", "url": "https://apnews.com/373b7a1bff7a418b8ef3f742c34bddd7"}