{"authors": ["David E. Malloy Hd Media Dmalloy Herald-Dispatch.Com"], "date_download": "2020-05-04 20:22:37", "date_modify": "2020-05-04 20:22:37", "date_publish": "2019-01-24 08:30:59", "description": "IRONTON — The following information was compiled from Lawrence County Sheriff's Office reports: RAPE: A 14-year-old Chesapeake area girl reported earlier this month that her 14-year-old...", "filename": "_afc6e10fb50847a493aecd416111b757_1588623757.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_afc6e10fb50847a493aecd416111b757_1588623757.html", "title": "14-year-old reports rape on school grounds", "title_page": "14-year-old reports rape on school grounds", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "IRONTON — The following information was compiled from Lawrence County Sheriff’s Office reports:\nRAPE: A 14-year-old Chesapeake area girl reported earlier this month that her 14-year-old boyfriend forced her to send sexual images of her and to have sex and that she was afraid to say “no.” A janitor at Chesapeake Middle School said he witnessed the two leaving the boys bathroom on one occasion where some of the sexual encounters took place.\nBURGLARY: A 36-year-old Portsmouth resident reported Monday that someone broke into her uncle’s house in the South Point area and stole two televisions, two firearms, a surround sound system, miscellaneous tools and prescription medication. The items were valued at $1,551.\nBURGLARY: A representative of the Department of Housing and Urban Development reported earlier this month that four windows and a door were smashed and a water heater was stolen from a home in the Chesapeake area. Damages were estimated at $2,300.\nBURGLARY: A 19-year-old South Point area woman reported last week that someone took $60 from a safe from her kitchen.\nBREAKING AND ENTERING: A 37-year-old Willow Wood area resident reported last week that someone stole a fourwheeler trailer, miscellaneous tools, six tires, six wheels from a Dodge dually and vehicle parts. The items were valued at $6,350.\nBREAKING AND ENTERING: A 50-year-old South Point area woman reported last week that someone broke into an outbuilding and stole a gas generator, a welder, a floor jack and tools. The items were valued at $4,340.\nBREAKING AND ENTERING: A representative of American Electric Power Company reported last week that someone cut a hole in the fence off County Road 1A and stole property valued at $4,188. A subsequent report showed that tools valued at $2,000 also were stolen.\nDOMESTIC VIOLENCE: A 58-year-old Ironton area man reported last week that his son punched him in the face following an argument with a relative. A 19-year-old Ironton area man was arrested on a misdemeanor charge of domestic violence and transported to jail.\nDRUG POSSESSION : Responding to a call from the Proctorville area, a sheriff’s deputy last week arrested Victoria Nichole Russell, 23, of Scott Depot, West Virginia, on charges of possession of drugs and disorderly conduct and transported her to jail.", "url": "https://apnews.com/afc6e10fb50847a493aecd416111b757"}