{"authors": ["Nick Conder", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Barry Eidlin", "Ben Beckett", "Eric Blanc"], "date_download": "2020-05-04 19:52:37", "date_modify": "2020-05-04 19:52:37", "date_publish": "2019-08-30 00:00:00", "description": null, "filename": "2019_08_att-southeast-strike-cwa-communications-workers-of-america-bernie-sanders-unions_1588621957.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/30123827/GettyImages-1170356859.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_att-southeast-strike-cwa-communications-workers-of-america-bernie-sanders-unions_1588621957.html", "title": "Bernie on the AT&T Picket Line", "title_page": "Bernie on the AT&T Picket Line", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Over 20,000 AT&T workers in nine southern states walked off the job on August 24, leading to a four-day strike that ended Wednesday with the announcement of a new contract. The Communications Workers of America (CWA) alleged that the telecom company was not engaging in negotiations in good faith, specifically that AT&T had sent representatives to the bargaining table that, bizarrely, did not actually have the authority to negotiate with workers. The union was also fighting previous AT&T offers with inadequate pay and benefits for workers.\nCWA’s strike forced AT&T to bargain more seriously for a contract acceptable to the union; the walkout was a useful tool, speeding up a process that had been unreasonably delayed by the company in several regions in the past few years. CWA filed an “unfair labor practice” complaint with the NLRB after AT&T sent negotiators to the bargaining table without the power to agree to a new contract. The union asked that AT&T bargain in good faith for a contract that would include “quality healthcare coverage, wage increases, job security, and investment in local communities.”\nThe specifics of the contract deal have not been announced yet, meaning that the full results of the strike are still unknown. But the impact of the AT&T strike goes beyond the current contract negotiations in the southeast.\nEven despite the recent uptick in workers going on strike, total US strike numbers are at incredibly low levels. And the strikes that workers have undertaken have been largely in education and hospitals, especially the “red-state” strike wave by teachers in states like Oklahoma and West Virginia. CWA is one of the few unions (along with hotel workers) that have been willing to strike in the private sector, walking off the job against telecommunications companies like AT&T and Verizon in recent years.\nAs important and inspiring as the health care and public education strikes have been, strikes against major corporations like AT&T are crucial for challenging capital at the site of profit-making. The AT&T Southeast strike did just that, many of the AT&T workers striking for the first time in their lives and some locations not having struck since the 1980s.\nDespite relentless attacks on the labor movement by right-wing politicians this decade, the current strike wave is having a major impact on opinions on unions: Americans are becoming more favorable toward unions than they have been since labor’s heyday in the mid-twentieth century.\nFor many communities in the southeast, the sight of an AT&T picket line was new. Southern states have lower union density than the rest of the country. Even in the south, strikes like this one show, workers are willing to fight.\nCWA used the strike to force AT&T to bargain fairly; the tactic was of a piece with teachers (sometimes without the backing of their union) making demands ranging from better pay to more investments in education, and flight attendants using the mere threat of a strike to end a federal government shutdown over the last year. This increase in worker militancy shouldn’t be seen as separate from the upsurge in radical political action in the United States. The AT&T strike came just a few days after Bernie Sanders released his Workplace Democracy Plan, pledging to drastically reform labor laws in workers’ favor, with the goal of doubling union membership in the United States.\nOnce the strike was announced, Bernie visited a picket line shortly before a rally in Louisville on Sunday, briefly addressing the striking CWA members from the back of a pickup truck. He linked the Kentucky AT&T workers’ fight to the broader class struggle.\nMillions of American workers are standing with you today. Because what you are going through is exactly what they are going through. In many cases, they are working longer hours for low wages. In many cases, they’re seeing their healthcare benefits being cut. In many cases, they are seeing jobs that they have go to low-wage countries abroad. In many cases, their wages are going down while the CEOs make huge compensation, sometimes three hundred times more than what their workers are making. So what we’re saying to AT&T and what we’re saying to corporate America: stop the greed and treat your workers with respect and dignity, they are the folks that make your money!\nThese expressions of solidarity are common for the Sanders campaign, which regularly uses its contact lists to turn supporters out for strike support. Bernie won the CWA endorsement in 2016, and has already picked up another endorsement from the United Electrical, Radio and Machine Workers of America (UE) — another union he walked the picket line with earlier this year in Erie, Pennsylvania.\nAnd at the Louisville rally, local teacher Robert Bell spoke ahead of Sanders and urged the crowd to see strikes and other forms of bottom-up worker organizing as the way to affect change in society.\nImagine all the things we can do with a President Bernie Sanders and millions of energized people behind him willing to strike if they need to, willing to pound the pavement and all that. Mitch McConnell knows that. He ain’t scared of no paper, he ain’t scared of no graph, he ain’t scared of no plans — however well crafted. He’s scared of us!\nSanders frequently invokes the language of class struggle. In announcing his labor platform, Sanders sent many socialist hearts aflutter by saying, “If there’s going to be class warfare in this country, it’s about time the working class won that war.” His pro-worker platform and advocacy for workers at Amazon, Walmart, and elsewhere have helped fuel the worker militancy necessary to launch and sustain a successful strike.\nThe current strike wave is rooted in teachers in West Virginia, many of whom had become politicized after supporting Bernie’s 2016 campaign. The AT&T strike being launched by a union that endorsed Bernie in the past seems like no coincidence, though the union has not yet endorsed Sanders for president again. Given Sanders’s uncompromising pro-union stance, an endorsement from CWA — and the rest of the labor movement — is a no-brainer. Endorsing any other candidate would be ludicrous.\nThe balance of power under capitalism is always with capital, but that balance has shifted dramatically away from workers and toward corporations in the last few decades. But the struggle for better laws and working-class demands like Medicare for All opens the door for workers to regain their power — both by electing Sanders as president, but also by backing up workers’ demands with strikes and other forms of militant mass action. Bernie’s movement and the labor movement are reliant on one another to win. Sanders himself seems to know it. The only question now is whether Sanders’s unflagging support for strikes like CWA’s helps union leaders recognize how much they need Bernie.", "url": "https://www.jacobinmag.com/2019/08/att-southeast-strike-cwa-communications-workers-of-america-bernie-sanders-unions"}