{"authors": ["Ronan Burtenshaw", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Andrew Murray", "Daniel Finn", "Christine Berry", "Richard Seymour"], "date_download": "2020-05-04 19:55:18", "date_modify": "2020-05-04 19:55:18", "date_publish": "2019-10-29 00:00:00", "description": null, "filename": "2019_10_socialism-labour-party-brexit-corbyn-democracy_1588622118.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/10/29103915/GettyImages-1175971732.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_10_socialism-labour-party-brexit-corbyn-democracy_1588622118.html", "title": "How Jeremy Corbyn Becomes Prime Minister", "title_page": "How Jeremy Corbyn Becomes Prime Minister", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "For most of 2019, politics in Britain has been consumed by the Brexit crisis. The drama of May’s defeats was followed by the rise of Boris Johnson, this gave way to the controversy over prorogation and increasingly panicked predictions about no-deal. No sooner had these coordinates been established than a deal was agreed with the European Union — which both won and lost key votes before being delayed in turn.\nBrexit has become a slalom of parliamentary intrigue. And it is not surprising that a Corbyn-led Labour Party, premised on a grassroots revolt against the political establishment, should find itself lost amid its twists and turns.\nFor much of the liberal commentariat Brexit itself is the crisis, their much-revered political system wilting under the pressure. Even as some may enjoy the breathlessness of the drama — the latest act of heroic statesmanship from some Tory rebel, perhaps — columns are filled with furious rage at the latest transgression against respectable norms.\nFor socialists, Brexit is only a symptom of a much greater malaise. Ten years after the financial crash, capitalism has failed to produce a new model of popular prosperity. Wages stagnate — the longest such flatline since the Victorian period in Britain — while capital’s share of the national income continues to rise. Austerity tore at the social fabric, while the public service pillars which prop up so many communities continue to erode. Faith in political institutions is at an all-time low.\nThis is not just a crisis in Britain, but one of global scale. It became fashionable, in recent decades, for academics to reject meta-narratives about society and focus instead on the narcissisms of particularity. But there can scarcely be greater evidence of the degree to which we are all connected to a single global capitalist system than the emergence, concurrently, of political crises in countries as distinct as the US, Brazil, and the Philippines which produced figures as comparable as Trump, Bolsonaro, and Duterte.\nAs Thomas Piketty’s research showed, there is scarcely a place on earth in which inequality is not growing, the result of a concentration of wealth, itself linked to common processes of financialization of the economy and a boom in the value of property. And this system now unites us in new ways, too, as the climate catastrophe it has created spreads analogous disasters from continent to continent, leaving the subarctic taiga of Siberia and the tropical rain-forest of the Amazon to burn together.\nOut of the ruins of our political order is emerging a new reactionary movement, increasingly connected across borders and more dangerous than any we have seen in at least a generation. We are not yet in the 1930s, but we may well be in the 1920s. A period of foreboding just before another economic crisis delivers us into truly disastrous realities. If you’re tempted to think such a crash is unlikely, remember how similar our financial architecture is to the edifice which collapsed in 2008.\nThat is the scale of the crisis. And it will not find a solution in liberalism, with its nostalgia for the political order which led us to the precipice. Unfortunately, the ideology and institutions of liberalism continue to hold sway over a great part of the Left. The path of least resistance in this moment of history would be to yield to the column pages of the Guardian and congeal with the political center against the rising right. But it would be a catastrophic error.\nContrary to the dominant wisdom of British liberalism, there is no sensible, moderate politics of a recent past to return to. It was neither sensible nor moderate when the Tories and Lib Dems imposed austerity policies which led to 130,000 preventable deaths in this country. Nor when disabled and sick people were pushed to suicide because they were deemed fit to work by the state. Nor when benefit sanctions reduced families to pauperism, or food banks became weekly realities for hundreds of thousands of people. Nor when Windrush migrants were torn from their homes of decades and dispatched to countries they hardly knew.\nBoris Johnson is not an anomaly in the context of all this, he is its logical conclusion.\nBut alongside the scale of the crisis comes the scale of the opportunity. A government of the center would never pursue the kind of change necessary at this juncture. Faced with its inability to resolve the underlying economic contradictions, it would melt in the heat of the historical moment. Only a government of the Left — prepared to use this to forge a new political and economic model — can prevent a descent into reaction.\nIf we are to succeed in this effort, we need to be clear about our politics and why they offer the alternative to a rising right and a decaying capitalist system. When Labour came to write its 1945 manifesto, the party was clear about its analysis of why reactionary forces had risen to prominence in the 1920s.\n“The great inter-war slumps were not acts of God or of blind forces,” it said, “they were the sure and certain result of the concentration of too much economic power in the hands of too few men. These men had only learned how to act in the interest of their own private monopolies which may be likened to totalitarian oligarchies within our democratic State.”\nUnder capitalism, it is these oligarchies that make the key decisions in every part of our economy. In the 1970s and ‘80s, Margaret Thatcher told us that planning by elected governments was the root of Britain’s economic hardship. But the model she introduced didn’t put an end to planning — it simply transferred it upwards, out of the reach of democracy, so that the key decisions over investment and development were made not by public representatives but by corporate executives.\nWith each passing year this capitalist class gains greater control over our lives. They are accountable to no one but propertied interests. They have no grander ambitions than the pursuit of profit. This nihilism at the heart of our societies — accentuated by the powerlessness working people feel amid an unresponsive political system and declining trade union movement — is the swamp from which contemporary monsters emerge.\nThat perspective is not new. It informed Nye Bevan when he was editor of Tribune in 1942. “The time has come to insist upon the acceptance and application of a truth which a century and a half of experience has established with all the authority of science and of political philosophy,” he wrote. “It is this — that mankind has progressed, has achieved dignity and learning, the certainty of peace and the benediction of security, just to the extent that ordinary men and women won freedom and pushed their way into the citadels of power.\n“That spate of the onrush of ordinary people is still on. The past few years has shown that it is in those places where it ran too feebly, or was dammed up, that the poisons accumulated which now seek to infect the whole earth . . . That is the lesson that Tribune exists to preach.”\nAnd preach we will, because this is not the time to hide our light under a bushel. The challenges we face demand a bold vision of the future that departs radically from both liberalism and reaction. As we face into a general election, it’s time to make the case for socialism.\nAnd not the socialism of vagueries which for too many years was fashionable in the Labour Party, one which could coexist with a managed capitalism and which left the ruling class largely untroubled. No, we need socialism — a society in which common ownership and democratic control replace private oligarchy and market domination.\nJeremy Corbyn’s leadership of the Labour Party, with a left-wing shadow cabinet, an emboldened union movement, and a mass membership, offers an opportunity to win this future. We must give it everything we’ve got. But without keeping that socialist ambition on the horizon, even a Corbyn government won’t be enough. For victory, yes, but for socialism too.", "url": "https://www.jacobinmag.com/2019/10/socialism-labour-party-brexit-corbyn-democracy"}