{"authors": ["Christine Stuart"], "date_download": "2020-05-04 20:12:34", "date_modify": "2020-05-04 20:12:34", "date_publish": "2019-03-26 18:56:56", "description": "HARTFORD — Later this week the Public Health Committee may or may not debate legislation that would allow a terminally ill patient with six months to live to take their own life. Rep....", "filename": "_3d2648adbdf1497fa09a88dbcdc8579f_1588623154.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3d2648adbdf1497fa09a88dbcdc8579f_1588623154.html", "title": "CT aid-in-dying bill could be dead", "title_page": "CT aid-in-dying bill could be dead", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HARTFORD — Later this week the Public Health Committee may or may not debate legislation that would allow a terminally ill patient with six months to live to take their own life.\nRep. Jonathan Steinberg, D-Westport, said he doesn’t know yet if he has the votes. If he finds that he does have the votes, the bill will be on the agenda Friday.\nSteinberg said at the moment he doesn’t have a vote count and was unable to say if a majority of the 25 committee members would support it.\nSteinberg made those remarks Monday before the New Jersey Assembly and Senate sent an aid-in-dying bill to New Jersey Gov. Phil Murphy, who plans to sign it. Supporters are hoping passage in New Jersey will give the bill some momentum in Connecticut.\nMeanwhile, opponents have been working hard to create doubt about the legislation, which has never made it out of the Public Health Committee.\nOpponents like Peter Wolfgang, executive director of the Family Institute of Connecticut, said the doubt some lawmakers have is for good reason.\nWolfgang pointed to new testimony submitted by the Division of Criminal Justice, which expresses concerns about “falsifying a death certificate.”\nThe division headed by Chief State Attorney Kevin Kane said his agency takes no position on the concept, but worries the bill could have “unintended and very unwelcome consequences.”\nThe legislation as currently written says, “The person signing the qualified patient’s death certificate shall list the underlying terminal illness as the cause of death.”\nThe division worries that it becomes problematic and would prevent them from moving forward with a “murder prosecution where the cause of death is not accurately reported on the death certificate.”\nSteinberg said opponents are using the “pejorative of suicide as an excuse” and in doing so are stigmatizing terminally ill patients who may choose it to end their lives. He said other states have found an acceptable way around these concerns. For example, he said there could be a primary and a secondary cause of death listed in the death certificate.\nBut Wolfgang said that beyond the new testimony, the advocacy of Cathy Ludlum of Second Thoughts Connecticut is also having an impact.\n“A lot of people may support the underlying concept, but they oppose this particular bill,” Wolfgang said.\nLudlum said that death from some of these drugs is not as immediate or peaceful as supporters would have someone believe.\nShe pointed to a 2018 report from Oregon, which tracked the “death with dignity” drugs, the number of individuals who requested the drugs, the number who took the drugs, and how long it took them to die.\nThe range for the time of death was between one minute to 104 hours, depending on the medication.\nThe death in many of these cases was not immediate, Ludlum said Monday.\nShe said the data from Oregon shows it could take an hour or two, but it can also take days, and in at least one case it didn’t work for a patient.\nIn 2018, 249 prescriptions were written under the Death With Dignity Act in Oregon. Of those, 158 of those residents ingested the medication and 157 died. One patient ingested the medication but regained consciousness before dying from the underlying illness and “is not counted as a DWDA death,” according to the report from the Oregon Health Authority.\nAn additional 48 did not take the medication and subsequently died of other causes, according to the report. The ingestion status is unknown for 43 patients prescribed DWDA medications in 2018. Of those, 14 patients died but follow-up information is not yet available. For the remaining 29 patients, both death and ingestion status are pending.\nIn Oregon since the law was passed in 1997, prescriptions have been written for a total of 2,217 people and 1,459 have died from ingesting the medications.\nTim Appleton, campaign manager for Compassion & Choices in Connecticut, said he’s grateful the Connecticut Public Health Committee agreed to take up the legislation this year.\nHe declined to speculate on what would happen Friday.\n“We respect the legislative process,” Appleton said.\nHe said it was clear from the testimony on the bill that “this will help prevent suffering for terminally ill patients and give them one more option at the end of their lives.”\nThere has been no national campaign involved yet in getting the bill passed this year in Connecticut, but for the first time the Connecticut State Medical Society has taken a neutral stance on the legislation.", "url": "https://apnews.com/3d2648adbdf1497fa09a88dbcdc8579f"}