{"authors": ["Jim Peters - Staff Writer"], "date_download": "2020-05-04 21:09:00", "date_modify": "2020-05-04 21:09:00", "date_publish": "2019-05-04 21:29:46", "description": "UNION MILLS — When the hits and runs came for South Central in the fifth inning Saturday morning, they didn't stop until the rules said so. Trailing 4-3 to Wheeler, the Satellites unleashed...", "filename": "_4abff39c2f144ec98f3724098be7ee58_1588626540.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4abff39c2f144ec98f3724098be7ee58_1588626540.html", "title": "S.C. brings the thunder", "title_page": "S.C. brings the thunder", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "UNION MILLS — When the hits and runs came for South Central in the fifth inning Saturday morning, they didn’t stop until the rules said so.\nTrailing 4-3 to Wheeler, the Satellites unleashed the fury, scoring 12 times to send the Bearcats packing by virtue of the mercy rule, 15-4.\n“We just knew we needed to get some runs on the board and get back into this game,” Skyler Wildfong said. “Coach (‘Bub’) Gale said, ‘We’re batting around this inning,’ and we all believed it. We just got some momentum going. We said, we got the disease, everybody got the disease, and it just kept flowing through all of us.”\nS.C. (14-3) batted around, plus five hitters, in the frame, pounding out 10 hits, including two doubles and three home runs.\n“The bats finally woke up,” Satellites coach Tony Wallace said. “When the bats came, good gosh. They’re a good, quality team. The first time we played them over there, the pitcher (Brooke Dusseau) held us in check. We knew she was hittable. When we put it together, on a beautiful day like this, it makes for some good softball.”\nWildfong had an inning to remember, launching a pair of two-run homers to left center.\n“There’s a first for everything,” she said. “I’ve hit two in a game before but never two in an inning. I think everything just started to click, everybody got confidence in their bats.”\nHeidi Smith had a three-run launch early in the frame that put South Central ahead for the first time and came back around a second time with an RBI double. Faith Biggs and Holly Noveroske also had two hits and two runs in the onslaught.\n“We were patient up there, sometimes too patient, but it worked out,” Wallace said. “Heidi got into the act. We actually took the load off Faith and Delanie (Gale), our two big bats. Other players were picking up. We have plenty of girls that have power. We’re over 30 home runs for the year. We’ve been working on trying to get more line drives.”\nBiggs got the memo, putting up two singles and two doubles in four at-bats. She also made a lunging tag at the plate to cut down a Wheeler run in the top of the fifth, a play that was crucial at the moment.\n“She was on it,” Wallace said. “We worked over the rainy days on placement. The last two, three games, she’s been lights out. She’s come through in a big way.”\nNoveroske was touched up for three runs in the Wheeler first but only yielded an unearned run in the fifth after that. She struck out three and walked none. Marissa Carr’s second-inning bomb erased a 3-0 deficit.\n″(Errors were) our weak point,” Wallace said. “A lot of the stuff with (Noveroske) is pitch placement. She has to hit her spots. Like I tell the kid, ‘Relax, you know you can do it.’ Nobody’s harder on Holly than herself.”\nIn their second game, Biggs drilled a walk-off two-run home run to center field on a 3-1 pitch to lift the Satellites to a wild 11-10 win over Highland.\n“I really thought I was going to get walked or get hit with the ball,” said Biggs of having the tying run on second. “It was a little outside, but I like those pitches. I just took it where I needed to. I’m not really a good outside hitter, so anything I can do to get to the left side is always good for our team and our base runners.”\nWallace wasn’t surprised Biggs was given something to hit, considering Delanie Gale was waiting on deck.\n“What else are they going to do?” he said. “Coming into the game, her slugging percentage was around one. What’s the lesser of two evils? We had Murderer’s Row coming up so they were going to get it one way or the other. (Biggs) is on fire.”\nBiggs walked and ripped a three-run home run that tied the game in the second, her only out of the two games coming on a line drive to the shortstop.\n“My dad (Gary) always says, knob of the bat to the ball, extend your hands, so that’s all I do,” she said. “Tony was always saying I wasn’t extending my hands so we have this one thing he bought that goes on your arm and your bat so it makes you throw your hands. I did that for a whole practice and I came out the next three games and I was hitting like I was last year. I looked at my batting average and all my stats and said, ‘That’s not me, I’ve got to do something.’ Hopefully, it continues.”\nS.C. also overcame a deficit of 7-3 after Highland (9-7-1) scored four runs in the third. That came on the heels of a lengthy delay following an injury to left fielder Laura Sumano, who ran into a fence post in pursuit of a ball. She was taken from the field by ambulance and reportedly sustained a concussion.\n“It affected them,” Wallace said. “They were in shock for an inning.”\nWildfong popped a solo shot in the third and the Satellites scored five runs on one hit in the fourth inning. A bases-loaded triple to right by McKenzie Hudspeth provided a 9-7 edge they held until Highland tallied three runs on a pair of long balls in the sixth off Noveroske.\n“It’s what they’ve done all year. When one goes down, they rally around and pick everybody up,” Wallace said. ”(Starter) Lauren (Bowmar) had a tough outing, but they came together and started picking away. It wasn’t a walk in the park for Holly either. (Highland) hit. They swing the bat. I can tell you they swung at a lot more pitches than we did.”\nSouth Central 15, Wheeler 4 (5 innings)\nSouth Central 11, Highland 10\nS.C.’s Faith Biggs was 6-for-7 with five runs and six RBI in the two games.", "url": "https://apnews.com/4abff39c2f144ec98f3724098be7ee58"}