{"authors": ["Bishop Nash The Herald-Dispatch Bnash Heralddispatch.Com"], "date_download": "2020-05-04 20:27:51", "date_modify": "2020-05-04 20:27:51", "date_publish": "2019-05-13 08:15:25", "description": "ACE VISITS CAMDEN PARK HUNTINGTON — They don't make them like the Big Dipper anymore. The same can be said for Camden Park. The 116-year-old amusement park has been a Tri-State staple...", "filename": "_92977995c0d94a959f7ed0f777279939_1588624071.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_92977995c0d94a959f7ed0f777279939_1588624071.html", "title": "Coaster lovers take the dip", "title_page": "Coaster lovers take the dip", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ACE VISITS CAMDEN PARK\nHUNTINGTON — They don’t make them like the Big Dipper anymore. The same can be said for Camden Park.\nThe 116-year-old amusement park has been a Tri-State staple since 1903 — creating millions of memories on the far end of Huntington’s Westmoreland neighborhood.\nBut it’s an endangered species. Those small, family-owned amusement parks are dying breeds gradually swallowed in the shadows of national juggernauts with the latest, tallest and fastest rides. For those who recognize their worth, little spots like Camden Park are like an antique treasure chest, and the rides inside are vintage gems.\nThat’s what brought nearly 200 ride fanciers, representing 26 states and Canada, to the park Sunday as the American Coaster Enthusiasts hosted their annual Preservation Conference at Camden Park. The national body also designated the much-celebrated Big Dipper, the park’s 61-year-old flagship coaster, an official ACE landmark.\n“This is a treasure; this is a treat,” said Tim Baldwin, ACE staffer and editor of Roller Coaster! Magazine. “And the people who live locally may not know it.”\nHaving ridden literally close to 1,000 roller coasters, the old-school Big Dipper elicits the same gut-twirling thrills, but with a throwback flair.\n“It doesn’t have to be the biggest or most gigantic, it’s just fun,” he added.\nBoth the Big Dipper and its pint-sized companion LiT Dipper (opened in 1961) are two of the last remaining built by the National Amusement Device Company of Dayton, Ohio. Both are virtually unchanged since the first cars hit the tracks, and were instrumental in recasting Camden Park from a simple picnic ground at a trolley-stop to a full-fledged amusement park under the direction of J.P. Boylin, who bought the park in 1950.\n“It’s a connection to the past, and in parks like this you have that connection of one generation to another and to another,” Baldwin said.\nMaintaining an aging, wooden behemoth like the Big Dipper consumes much of the offseason, said park ride supervisor Sean Wellman.\n“It’s months and months of work,” Wellman said. “They replace huge amounts of lumber in that thing every year. It’s pretty much an ongoing process.\nBut Camden Park staff are aware of the torch they carry as the last of a dying breed. It’s at once a battle to keep a piece of history, but still very-much popular attraction, alive for next generations to scream on.\n“This is one of the few family-owned amusement parks left in the country, and we’ve been a part of the Tri-State and Huntington’s history for a long time,” Wellman said. “And hopefully it’ll continue for a long time to come.”\nEstablished in 1978, ACE is a nonprofit group with more than 6,000 members worldwide, dedicated to focusing on the enjoyment, knowledge and preservation of roller coasters as well as recognition of some as architectural and engineering landmarks.\nFor more information, visit aceonline. org.\nFollow reporter Bishop Nash on Twitter at @BlshopNash.", "url": "https://apnews.com/92977995c0d94a959f7ed0f777279939"}