{"authors": [], "date_download": "2020-05-04 20:03:59", "date_modify": "2020-05-04 20:03:59", "date_publish": "2019-11-22 06:17:34", "description": "ALISON KRAUSS GETS NATIONAL MEDAL OF ARTS WASHINGTON (AP) - President Donald Trump teased Alison Krauss for being introverted as he awarded her the National Medal of Arts. Trump read Krauss’...", "filename": "_69835e9a11b847cd919b1b161b1f2179_1588622639.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_69835e9a11b847cd919b1b161b1f2179_1588622639.html", "title": "AM Prep-Music", "title_page": "AM Prep-Music", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ALISON KRAUSS GETS NATIONAL MEDAL OF ARTS\nWASHINGTON (AP) - President Donald Trump teased Alison Krauss for being introverted as he awarded her the National Medal of Arts. Trump read Krauss’ many accomplishments, including being the woman with the most Grammys. He turned to her and said, “Wow, that’s pretty good. That’s a big statement. Look how shy she is.” Actor Jon Voight and author James Patterson also were among those who received medals.\nSOUND:\n093997-a-134:64-(President Donald Trump)-“shy she is (laughter fades)”-Trump awards medals to Jon Voight, Alison Krauss and others (21 Nov 2019)\n¤¤CUT ´093997 (11/21/19)££ 134:64 “shy she is (laughter fades)”\n093996-a-78:48-(President Donald Trump)-“a special person”-Trump awards medals to Jon Voight, Alison Krauss and others (21 Nov 2019)\n¤¤CUT ´093996 (11/21/19)££ 78:48 “a special person”\nSAM HUNT ARRESTED FOR DUI\nNASHVILLE (AP) - Sam Hunt has not made any public comment about being arrested for driving under the influence in Nashville. Hunt has been released on $2,500 bond after being arrested yesterday morning. The arrest warrant says police stopped a vehicle swerving the wrong way down a one-way road. Police say there were two empty beer containers next to Hunt and he had admitted to drinking alcohol “recently.” Hunt is due in court Jan. 17.\nAMERICAN MUSIC AWARDS ARE SUNDAY\nUNDATED (AP) - All eyes will be on Taylor Swift at Sunday’s American Music Awards, but probably not the way she had planned. Swift’s dispute with her old record label, Big Machine, means her plan to play her hit songs may or may not happen. She’s up for five awards, including artist of the year, and Swift has not been afraid to speak her mind about what’s going on in her life during acceptance speeches. The evening was intended to be a celebration for Swift. Carole King will present her with the Artist of the Decade Award. If Swift wins at least twice, she will pass Michael Jackson as the artist with the most AMA wins. Post Malone leads the nominations with seven. Billie Eilish (EYE’-lish) and Ariana Grande (GRAHN’-day) have six each. Ciara (see-AHR’-ah) will host the awards, which air live from Los Angeles on ABC.\nSOUND:\n093980-r-316:08-(Post Malone and Swae Lee, performing “Sunflower”)-”(music fades)”-The American Music Awards will be held Sunday (22 Nov 2019)\n¤¤CUT ´093980 (11/22/19)££ 316:08 ”(music fades)”\n093978-w-287:28-(Margie Szaroleta (zar-oh-LEH’-tah), AP music correspondent, with music)-“I’m Margie Szaroleta”-The American Music Awards will be held Sunday (22 Nov 2019)\n¤¤CUT ´093978 (11/22/19)££ 287:28 “I’m Margie Szaroleta”\n093981-r-481:92-(Taylor Swift, performing “You Need To Calm Down”)-”(music fades)”-The American Music Awards will be held Sunday (22 Nov 2019)\n¤¤CUT ´093981 (11/22/19)££ 481:92 ”(music fades)”\n093979-w-322:56-(Margie Szaroleta (zar-oh-LEH’-tah), AP music correspondent, with music)-“Ciara will host”-The American Music Awards will be held Sunday (22 Nov 2019)\n¤¤CUT ´093979 (11/22/19)££ 322:56 “Ciara will host”\nJAMES TAYLOR PLANS AUDIO-ONLY MEMOIR\nNEW YORK (AP) - James Taylor will come up with a memoir that’s audio only, and only goes up to the point in his life where he hit the big time. Taylor has signed a deal with producer-distributor Audible for an audio-only autobiography called “Break Shot.” It will focus on his early years and will end just as he started becoming famous in the 1970s. Taylor’s music and interviews with journalist Bill Flanagan will be part of the audiobook. Taylor says it covers the “on-ramp to the road” he still travels. “Break Shot” comes out early next year.\nCOLDPLAY WILL SHUN TOURING FOR ENVIRONMENTAL REASONS\nLONDON (AP) - Coldplay will livestream two concerts in Amman, Jordan, today on YouTube, and aside from a concert Monday in London, that’s all they’re doing. Frontman Chris Martin tells the BBC they will not tour behind their new album, “Everyday Life,” because of the environmental impact. Martin says they will take the next year to figure out how to make a tour not only sustainable, but “actively beneficial.” He says the hardest part to figure out is flying, and their dream is to have a show “with no single use plastic, to have it largely solar powered.” “Everyday Life” comes out today.\nDADDY YANKEE MUSEUM WILL OPEN IN PUERTO RICO\nSAN JUAN, Puerto Rico (AP) - Daddy Yankee will open a museum dedicated to Daddy Yankee today. The Daddy Yankee El Jefe Museum opens today in San Juan, Puerto Rico. Its 8,000 feet dedicated to his clothes, awards, memorabilia and the history of reggaeton starting in 1991. It’s free and will be open until January.\nDAVE EAST PUTS OUT DEBUT TO PAINT A PICTURE OF HIS LIFE\nNEW YORK (AP) - You might know Dave East for his collaborations with Chris Brown, Meek Mill and 2 Chainz. You might know him for playing Method Man in the Hulu series “Wu-Tang: An American Saga.” He’s now hoping you will know him for him. His debut album, “Survival,” debuted at number 11 on the Billboard 200 album chart this week. East says he’s given bits and pieces of his life up to this point, but now he really wants to paint a picture. He says he wants listeners to feel like they’re in his living room where he grew up. East puts a lot of thought into lyrics because he feels that lyrics “can make you do good or bad.” East’s tour launches today in Atlanta.\nBy Margie Szaroleta", "url": "https://apnews.com/69835e9a11b847cd919b1b161b1f2179"}