{"authors": ["Kianna Gardner Daily Inter Lake"], "date_download": "2020-05-04 21:06:41", "date_modify": "2020-05-04 21:06:41", "date_publish": "2019-03-05 05:00:01", "description": "North Valley Hospital released its 2019 Community Report last week, detailing the nonprofit's accomplishments from 2018, which include, among other things, being named as a Baby Friendly Hospital...", "filename": "_057e609eba2946c39e190443e29b2950_1588626401.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_057e609eba2946c39e190443e29b2950_1588626401.html", "title": "Annual report shows uptick in surgical procedures, births", "title_page": "Annual report shows uptick in surgical procedures, births", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "North Valley Hospital released its 2019 Community Report last week, detailing the nonprofit’s accomplishments from 2018, which include, among other things, being named as a Baby Friendly Hospital - a designation employees worked toward for more than five years.\nAs a new Baby Friendly Hospital, the North Valley Birth Center joins a list of about 20,000 maternity centers worldwide that have been labeled as such by the World Health Organization and United Nations Children Fund. According to the report, the hospital delivered 566 babies within its Birth Center in 2018, up from 542 deliveries in 2017.\nThe hospital also saw 8,462 emergency room visits, 45,895 outpatient visits, performed 2,498 surgical procedures and had 1,639 hospital admissions. Some of the numbers, including those for outpatient visits, are similar to years before. However, others have increased since 2017, such as the number of surgical procedures. According to the 2018 community report detailing 2017 accomplishments, North Valley performed 2,267 procedures in 2017.\nAccording to the report, 95 percent of patients say they would “definitely recommend” the hospital to family and friends.\n“Patient word-of-mouth is what really keeps bringing new people in and bringing others back and I think our work with the baby-friendly designation is a great example of that,” North Valley Chief Executive Officer Kevin Abel said.\nThe report and Abel credit the hospital’s successes, in part, to its longstanding Planetree Philosophy of patient-centered care, as well as its recent affiliation with Kalispell Regional Healthcare.\nAbel describes the hospital’s philosophy as something that is “at the core of our care and our hospital,” and Jane Karas, chair of the hospital’s Board of Directors, said it provides “unique, quality health-care opportunities” to patients and the community. The guiding philosophy can be felt by the welcoming design of the hospital itself to smaller, yet significant offerings such as bedside greetings from certified pet therapy dogs.\nThe report also spotlights various grants that have allowed the hospital to bolster some of its services in 2018, including one for $200,000 from the Montana Healthcare Foundation that went toward expanding the hospital’s telemedicine and school-based integrated behavioral health services.\nIn response to a Flathead Community Health Needs Assessment calling for more behavioral health resources, the hospital added two mental and behavioral health providers in the last year and started offering school-based clinics throughout the valley.\nThe hospital also expanded its telehealth services in an effort to better-serve rural hospitals. The telecommunication service allows hospitals elsewhere to video conference for various needs.\nWith 2018 in the rear-view mirror, Abel said the hospital is looking forward to another productive year. He said North Valley will be working closely with Kalispell Regional in the coming months to continue streamlining health-care services across the county as part of the affiliation. He also said hospital officials currently have a close eye on what Montana lawmakers decide to do with Medicaid expansion - the continuation of which is currently undecided.\n“I think we are in a great place as a hospital now, but it will be interesting to see what happens with the legislation and that’s still a question mark in our planning and is one of the largest items on our radar,” Abel said.\nKianna Gardner can be reached at 758-4439 or kgardner@dailyinterlake.com", "url": "https://apnews.com/057e609eba2946c39e190443e29b2950"}