{"authors": ["Connor Kilpatrick", "Bhaskar Sunkara", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Zaid Jilani"], "date_download": "2020-05-04 19:54:35", "date_modify": "2020-05-04 19:54:35", "date_publish": "2019-09-12 00:00:00", "description": null, "filename": "2019_09_elizabeth-warren-bernie-sanders-patagonia-democrats_1588622075.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/09/12121315/GettyImages-1169827895.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_09_elizabeth-warren-bernie-sanders-patagonia-democrats_1588622075.html", "title": "Elizabeth Warren Is Thirty Years Too Late", "title_page": "Elizabeth Warren Is Thirty Years Too Late", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nElizabeth Warren had her road-to-Damascus moment back in 1995, the year she joined the faculty of Harvard Law. She was forty-six. She was asked to take part in a congressional commission on reforming bankruptcy laws. She went in with the best of intentions, ready to draw up a list of policies to help struggling families. But as she attended each hearing, she was shocked to find lobbyists swooping in like vultures to pick it all apart. “The whole process made me gag,” she later wrote. Shortly after, in 1996, she changed her party registration from Republican to Democrat. She fought a noble fight for ten years. In 1998, she met with first lady Hillary Clinton and told her over a hamburger and french fries that the bill taking shape tilted the playing field heavily in favor of the banks and against ordinary Americans. “I pounded Mrs. Clinton with graphs, charts, and projections.” The first lady was convinced. Despite having signaled earlier support, the Clinton White House vetoed the bill in its final days. Warren’s crusade was working. But in 2001, a now-senator Hillary Clinton joined thirty-five of her Democratic colleagues — including Joe Biden — and voted for the bill just three years after her lunch with Warren. “The bill was essentially the same,” Warren said, “but Hillary Rodham Clinton was not.” It is a story of a kind of dark awakening: the deck was now thoroughly stacked against working people, or, as Warren prefers, “the middle class.” The markets weren’t working as they should. The politicians weren’t either. Someone had to do something. Someone had to plug the leak at the top. The dedication that opens Warren’s 2004 book The Two-Income Trap, co-written with her daughter, Amelia, is clear about her mission, the people she wants to save, and how she wants to save them: “They went to college, had kids, bought a home, played by the rules — and lost. It is time to rewrite the rules so that these families are winners again.” This is the key to Warren’s political vision and what — despite some shared policy preferences and a personal friendship — makes her a very different candidate from Bernie Sanders. With a very different constituency. And, ultimately, why it’s harder to imagine her delivering the type of change the United States desperately needs.\nRewrite the Rules When President Trump recently stood before Congress and announced that America “will never be a socialist country,” Warren slowly rose to her feet and applauded. Her more progressive fans seemed surprised. But they shouldn’t be. On the campaign trail, ‘I believe in markets’ has become a kind of mantra for Warren. On the campaign trail, “I believe in markets” has become a kind of mantra for Warren. “I am a capitalist to my bones,” as she put it more explicitly last year. Her 2004 book even boasted that “We haven’t suggested a complete overhaul of the tax structure, and we haven’t demanded that businesses cease and desist from ever closing another plant or firing another worker. Nor have we suggested that the United States should build a quasi-socialist safety net to rival the European model.” (At the time, a whopping 45.8 million Americans were without health insurance, a number roughly equivalent to the entire population of Spain.) And it’s not clear her thinking has changed all that much since. In the recent climate town hall, Warren was asked if she supported the nationalization of public utilities. “Gosh, you know, I’m not sure that’s what gets you the solution . . . the way we get there is we just say, ‘Sorry guys, but by 2035, you’re done. You’re not going to be using any more carbon-based fuels.’ That gets us to the right place.” It’s a sentiment not that far in spirit from Clinton’s claim that she told Wall Street: “Cut it out! Quit foreclosing on homes! Quit engaging in these kinds of speculative behaviors.” It’s been a consistent approach for Warren, but one with questionable results. After the economic catastrophe of 2007–8, a little over a decade after she took up public policy, Warren took a stand for far more stringent regulations on the financial sector, much to the annoyance of the Obama administration. She spearheaded the creation of the Consumer Financial Protection Bureau (CFPB), an impressive regulatory achievement. But while a Republican Congress couldn’t roll back Obama’s Medicaid expansion, a clear program with real material stakes and a constituency to defend it, Warren’s watchdog was another matter. And so, less than seven years after the CFPB’s creation, a Republican president completely gutted it. In other words, Warren rewrote the rules. And then someone else came along and rewrote them again with hardly any notice from the people she intended to help. This is the regulatory-driven strategy that has been contrasted positively to the Bernie Sanders mad-as-hell, bottom-up “political revolution.” As her supporters love to say, she has “a plan” for every possible “that.” But it’s also the strategy that seems more likely to put us back in the same position four or eight years from now with little to show for it. And, after the next election that doesn’t go our way, with an even bigger ghoul in the White House ready to wipe it all away like a splattered bug on a windshield.\nAn Army of Our Own For most liberals, Warren included, the Reagan administration is when it all went to hell. But in the 1980s, the Democratic Party remained firmly in control of most state legislatures. The labor movement still had a few jolts of life in it, with the Professional Air Traffic Controllers Organization (PATCO) strike in 1981, the Hormel meatpackers’ strike in 1985, and the Pittston Coal strike in 1989–90, the latter a rare victory. In 1983, more than one in five workers was still in a union (today, it’s one in ten). Back in the 1980s, the Jesse Jackson campaign tried to revive the New Deal coalition twice. Tony Mazzocchi, a proto-Bernie figure responsible for OSHA (the Occupational Health and Safety Administration), was still alive, leading the Oil, Chemical and Atomic Workers International Union and, a few years later, embarked on a noble attempt to found a Labor Party (during the 1981 PATCO strike, he proposed occupying the National Airport). Warren, to her credit, understands that something went wrong around this time. And her style of politics — had it been pursued by an administration at the time of her political conversion — might have stood a chance of stemming some of the tide that’s since washed American workers out to sea. But Warren underestimates just how cataclysmic the decades since her awakening have been for working people and how her technocratic political approach — the “plans for that” — can hardly summon the change necessary. Events have moved very quickly here in the last twenty-five years. And while Elizabeth Warren had a plan for the 1990s, the problem is that others had a plan, too. They won, she —and we — lost. In the early 1990s, chief executives were compensated roughly 80 times the average worker. Today, it’s nearly 300 times. From 1979 to 1989, the income growth of the average member of the top 1% was 26 times that of the average member of the bottom 90%. From 1989 to 2014, the ratio was 52 times. Between 1989 and 2016, the share of middle-class families with a traditional pension fell from almost half to less than a fifth. In 1991, the average full-time worker had to work 237 hours to afford their family health insurance. In 2018, it was 456 hours. School integration peaked in 1988. Today, American schools are more segregated than they’ve been in decades. The incarceration rate in 1992 was a little over 300 people for every 100,000 Americans. Today, it’s more than doubled at nearly 700. An even bleaker trend has been the recent mass deaths of despair with suicides, alcohol, and opioid addiction causing a drop in life expectancy for Americans — a shocking development for a wealthy nation. Pandora’s box has indeed been cracked open. And the disturbing reality is that all the sensible regulations and detailed policy papers in the world can’t put capital’s furies back into shackles. The strange paradox of being on the Left in 2019 is facing the fact that the most sober, realistic, and sensible position is to not play by the rules. It’s to tip over the board entirely. Because the only thing crazier than demanding the abolition of a trillion-dollar industry like American health insurance — under a right-wing Supreme Court and a hostile Congress — is believing that such an industry can ever be convinced to lay down their arms and agree to effectively abolish themselves, whether it’s through regulation or by letting a “public option” slowly suffocate them. While Warren backs Sanders’s Medicare-for-All bill, she’s recently begun campaigning on “access to health care,” a not-so-subtle indication of surrender before she’s even won the primary, let alone the presidency. All despite the fact that Medicare for All is now wildly popular with Democrats and even many Republicans. If not now, when? Which is why in 2019, with the balance of class forces so lopsided, it’s less a question of policy papers and more a question of armies: the ruling class has theirs — total control over the economy and the state (not to mention the literal army), with only a vaguely disgusted public and a historically weak labor movement to oppose them. For even the slightest chance of tipping the balance, the have-nots will need an army of their own to make the impossible once again possible.\nBack When We Won Something In the early 1930s, American workers faced a similarly hopeless situation: the economy had collapsed, the government was hardly willing to do a thing to help, and the Supreme Court was controlled by a reactionary, Gilded-Age Republican Party. It was a court that remains infamous today for, among other things, upholding segregation and the forced sterilization of the disabled, and striking down laws regulating child labor and the maximum hours in a work day. But what both the court and the new administration faced was an increasingly insurgent working-class radicalism. The result of this power play by workers — angry, antagonistic, and increasingly organized — and their relationship with the Democratic Party of the time was the New Deal. Even the reactionary court, which struck down much of it at first as unconstitutional, couldn’t stamp this tide — not this time. While the recent uptick in labor militancy is still very, very far from anything seen in the 1930s, Sanders’s candidacy is helping stoke the flames of class antagonism in a way we’ve never seen from a presidential candidate. As Seth Ackerman recently put it, “[Sanders] is using his campaign to get people out to picket lines, encouraging class conflict in the hope that his actions . . . can start the kind of upsurge that pushed the New Deal.” And a truly remarkable army has formed around the Sanders campaign, now a legitimate social movement with the potential to catch fire and spread far beyond the campaign trail. As former National Nurses United head RoseAnn DeMoro put it, a 2016 Sanders victory “would have meant a massive shift in the political terrain not just of the United States but even the world. Labor would still be up against enormous odds. But we would have had the benefit of two years of heightened worker expectations and participation in communities around the country . . . All this would have had the support, leadership, and institutional resources of the president of the United States.” After nearly a half century of playing defense, a Sanders victory would give radicals in the labor movement the courage to take the kind of risks that could truly turn the tide for workers. The only problem? At the moment, it all still seems to orbit around Sanders himself. He’s something like a Harry Bridges — the radical longshoreman who shut down the entire West Coast in 1934 — trying to don the mask of an FDR. But unlike Bridges, Sanders is still scrambling for a social base. We are far away from transforming whatever energy there is around him today into working-class institutions that can look consistently beyond just electoral politics and sustain struggles. But it’s what we have, it’s the cards we’ve been dealt, and it’s unclear if this embryonic coalition can simply be “transferred” to another candidate. They’re poorer, less white, and less educated than Warren’s supporters. And they are mad as hell. That is the Sanders base. But what kind of army can Warren raise?\nThe Patagonia Democrats Cannot Rule During the years leading up to Warren’s conversion and the decades after, the Democratic Party bled working-class voters — the people who gave their party control of Congress for the better part of the last eighty years. Some of those voters switched to the GOP, but most checked out of politics entirely. They have been replaced with affluent members of the professional classes — Patagonia Democrats who, despite some anxieties, have still seen their fortunes rise during this time. This is a class that has neither the numbers to change the political realities of our country nor the dire interest in uprooting the very economic and political structures that have led the United States to oligarchy. And these are the people Warren is relying on. Whether she planned to or not, Warren has an educated, rich, and liberal base while Bernie has a multiracial, working-class one. Her coalition is richer and whiter than Sanders’s — in fact, Warren’s support is whiter than any of the other front-runners in the primary. If anything, the game has, all things considered, worked out fairly well for them. They are never going to seize the shop floor. They are never going to occupy the steps of Capitol Hill for Medicare for All or a jobs guarantee or even a grand a month. In the old Democratic Party, this would spell doom for Warren’s coalition of the white and affluent — another Bill Bradley/ Howard Dean wine track campaign. But with the further alienation of working-class voters from politics, a coalition of the affluent could indeed win the Democratic Primary — even as it lost a general election or, at best, squeaked by just enough to keep Republicans from the White House but not Congress or state legislatures. It would be yet another coalition that could win but never govern. Whether she planned to or not, Warren has an educated, rich, and liberal base while Bernie has a multiracial, working-class one. A recent poll showed that while Sanders is firmly in second place and within striking distance of Biden, he earns the support of only 6 percent of voters making over $100,000 a year. Warren receives twice as much support from the affluent. And with people making below $50,000 a year, Sanders cleans up with 37.5 percent of them. Warren, however, receives the support of only 13 percent of that demographic. Her people vote no matter what — and vote “D” no matter what. Bernie, however, is building something unique. In the 206 counties that flipped from Obama in ’08 to Trump in ’16, Sanders is crushing his closest competition in the number of individual donors: 33,185 donors to Warren’s 13,674. And while Park Slope and Fairfax County might be overrepresented in the Discourse, it’s the workers in these Obama-Trump Midwestern counties that still decide the election.\nWhy Who Wins the Primary Matters If we once again had a mass labor movement peppered with socialists, a party hack would be fine, a sympathetic liberal would be great, and a President Warren would be a dream come true. That would mean a tense but functional relationship between a reformist administration in the White House and a strong and organized working class that could at least challenge capital’s imperatives. We don’t want to do politics this way. We don’t want to invest so much hope in the people coalescing around the Sanders campaign. But, in this moment, with no labor movement to force their hand, the individual principles, ideology, and commitments of politicians of the Left take on a new importance and deserve a level of scrutiny that rebels against our materialist instincts. But such is the dilemma of trying to stand back up after being knocked down for decades upon decades. In 2015 and 2016, liberals correctly pointed out that a multiracial working-class movement was needed to create a truly more egalitarian society. With Sanders’s paltry showing among black voters in the 2016 primaries, they had reason to suspect the movement building up around him couldn’t seal the deal. And that Clinton, despite evidence of low enthusiasm among workers of color and hostility from the northern white workers who’d backed Obama, was still the better bet. But Sanders’s supporters were also correct that the potential to build that coalition was there all along — Sanders’s name recognition was still relatively low even as the primaries began. And in 2019, it looks like his supporters were right: poll after poll shows Sanders doing better — far better — with low-income workers of color than any candidate other than Biden. Sure, Warren calls for a “grassroots” movement, but so did Obama. So do most presidents. In a recent profile on Warren, Walter Shapiro made a blunt appraisal of her rapt audience: “unlike a Bernie Sanders crowd, say, there was little sense that these L.L. Bean-clad revolutionaries really want to go to the barricades . . . that may well be enough.” Sanders didn’t need to witness the fallout of the neoliberal turn to understand the injustices of capitalism: as a socialist, he knew such barbarisms were baked into the system. Sanders is different. He really and truly means it. And, it seems, so do his supporters. In 2016, Sanders was asked why he joined the Young People’s Socialist League (YPSL) in college during a seeming “golden age” of American capitalism and the American middle class, the “level-playing-field” era in which Warren found her home in the Republican Party. “[The YPSL] helped me put two and two together in my mind . . . we don’t like poverty, we don’t like racism, we don’t like war, we don’t like exploitation. What do they all have in common? . . . What does wealth and power mean? How does it influence politics? . . . That is why I evolved to an analysis that explains to me what goes on in the world,” said Sanders. Sanders didn’t need to witness the fallout of the neoliberal turn to understand the injustices of capitalism: as a socialist, he knew such barbarisms were baked into the system. And that only a bottom-up movement of working people had any chance of putting a stop to it. This is why quixotic figures like Sanders and Corbyn have been plucked from the margins and thrown into the mainstream, likely very jarring for them both. They understood what was, for a long time, very unfashionable to understand. But Warren’s “capitalist to the bone” analysis is only market-deep. She has always been very clear about this. “[Bernie’s] a socialist, and I believe in markets,” as she recently put it. A former aide was even more explicit: “She loves markets.” Warren wants “good capitalism.” But the only time in history anyone ever got even not-so sociopathic capitalism was when there was a credible threat of some kind of socialist expropriation. As that threat receded across the world, so did the “level-playing-field” capitalism that Warren admires. Senator Warren is, however, uniquely suited for the anxious professional class of 2019, who see both a gulf opening up somewhere below them and a ruling class soaring to new heights above. But Warrenism has much less to offer for the working class, whose immediate, life-or-death needs demand nothing less than a political revolution with, yes, social democracy as its first stop.", "url": "https://jacobinmag.com/2019/09/elizabeth-warren-bernie-sanders-patagonia-democrats"}