{"authors": ["Marcus Gutierrez"], "date_download": "2020-05-04 21:06:36", "date_modify": "2020-05-04 21:06:36", "date_publish": "2019-02-05 14:00:00", "description": "GirlsDistrict 20-5AKingwood Park remains undefeated in districtKingwood Park scored two goals in the second half of two matches to get victories last week.K-Park defeated New Caney 1-0 on Friday...", "filename": "_11128f50767b48b59234aaeaab52be18_1588626396.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_11128f50767b48b59234aaeaab52be18_1588626396.html", "title": "Humble ISD soccer roundup", "title_page": "Humble ISD soccer roundup", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GirlsDistrict 20-5AKingwood Park remains undefeated in districtKingwood Park scored two goals in the second half of two matches to get victories last week.K-Park defeated New Caney 1-0 on Friday night at Texan Drive Stadium in a District 20-5A contest.Katherine Tiedtke scored the second half goal, which as assisted by Cora Morgenroth.Allie Byrd had a goal and one assist to help K-Park defeat Tomball 2-0 on Tuesday night. Marilyn Perri added a goal for the Lady Panthers, who improve to 11-1, 5-0 on the season.K-Park will host the Porter at 7:30 p.m. Tuesday and take on Willis on the road Friday at 7 p.m.District 22-6AKingwood girls roll to two district winsKingwood used its high scoring offense to pick up two District 22-6A wins last week.The Lady Mustangs (5-1-3, 2-0-1) shutout Dobie 6-0 at Mustangs Stadium Friday night.Emma Ebert had a hat trick to lead Kingwood with assists from Elle Smith and Lily Van Meter.Cadyn Hurns and Alex Dumais both scored on free kicks. Savannah Moore kicked the ball in the back of the net and the goal was assisted by Jenelle Dumasi.Kingwood defeated Pasadena Memorial 8-1 last Tuesday at Veterans Memorial Stadium.Smith and Ebert each scored two goals for the Lady Mustangs. Ebert also assisted on one of Smith’s goals.Lily Van Meter had two assists for Kingwood. Emily Zerkel scored a goal off a corner kick and also assisted on Jenna Bordon goals. Isabel Shanahan scored a goal assisted by Cadyn Hulse and Annike Miller added a goal assisted by Cami Wall.Atascocita gets win in districtAtascocita shutout Sam Rayburn 4-0 last Tuesday.Allie Roe scored two goals to lead the Lady Eagles. Brianna Hoffman and Victoria Arenvias each added a goal.Atascocita and Pasadena Memorial tied on last Friday. The Lady Eagles improve to 6-1-3, 2-0-2 on the season.District 22-6A boysAtascocita splits a pair of matchesEthan Fierro scored two goals to lead Atascocita to a 3-1 District 22-6A match win over South Houston last Tuesday. Noah Foulkes also added a goal for the Eagles (2-2).The Eagles lost a 2-1 decision to Pasadena Memorial on Friday night.Foulkes had the lone goal for the Eagles.Humble boys bounce back with winAfter losing a 4-1 decision to Dobie last Tuesday night the Wildcats rebounded with a 4-2 win over rival Summer Creek.Christan Solorzano, Kevin Contreras, Brayan Melo and Geraado Martinez each scored a goal and had an assist for the Wildcats, who improved to 2-3 in district play.Kingwood boys drop two district gamesKingwood battled injures last week in district play and lost two district games.The Mustangs (3-2) lost a 4-1 decision last Tuesday at Mustangs stadium.Kingwood’s lone goal came off a corner kick from Noah Siega to Manuel Malvaez for the score.The Mustangs lost a 4-1 decision to Dobie at Veterans Memorial Stadium last Friday.Will Tucker had the only goal for the Mustangs with the assist coming from Andrew Harrison.Humble ISD coaches can email stats from their game to sports writer Marcus Gutierrez at marcus.gutierrez@chron.commarcus.gutierrez@chron.comTwitter: @MarcG14Line", "url": "https://apnews.com/11128f50767b48b59234aaeaab52be18"}