{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:13:21", "date_modify": "2020-05-04 20:13:21", "date_publish": "2019-05-17 05:00:00", "description": "Where would you find a community that holds electronic recycling drives, utilizes LED bulbs, implements sustainability best practices and provides its residents the option to receive...", "filename": "_b812d44640dc4f4ca16098b7ccc6178c_1588623201.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b812d44640dc4f4ca16098b7ccc6178c_1588623201.html", "title": "Earth Day a year-round partnership at Eagle’s Trace", "title_page": "Earth Day a year-round partnership at Eagle’s Trace", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Where would you find a community that holds electronic recycling drives, utilizes LED bulbs, implements sustainability best practices and provides its residents the option to receive correspondence electronically through an app?\nA college campus? Maybe.\nEagle’s Trace in West Houston? Absolutely.\nThe continuing care retirement community developed and managed by Erickson Living demonstrated that “going green” is a lifestyle with its Earth Day celebration on April 22. Presented by the resident-run conservation group known as the Greenies, the event was a true collaboration.\nResidents and employees enjoyed the opportunity to recycle a variety of products, including batteries and medication, donate items, and tour the garden area. Vendors including Capital Bank, Harper Travel, Next Day Dry Cleaners and CVS Pharmacy participated in the event, and Don McGill Toyota and Westside Lexus showcased the latest hybrid vehicle technology.\nNumerous resident groups such as the Best Buds and Garden Club shared information about their activities, and Eagle’s Trace employees represented the Fitness Center, General Services, Dining and Medical Center.\nBecky Ogle, a resident of Eagle’s Trace for more than 11 years, is the chair of the Greenies. “We are so proud of not only the tangible results from the day’s activities, but also the enthusiasm for future endeavors,” stated Ms. Ogle. “As most of us have children and grandchildren, we value the chance to do our part in small ways to be good stewards of the earth.”\nMs. Ogle credits a strong partnership with management for supporting the goals of the Greenies. “The leadership team of Eagle’s Trace has been in our corner since we began in August of 2018,” she described. “We held two smaller recycling events that paved the way for a successful Earth Day expo and even received valuable support from Highland Springs, our sister community in Dallas.”\nSteve Aigner, the Executive Director of Eagle’s Trace, echoed the importance of this shared mission. “It’s incumbent upon us to utilize our resources wisely to create a campus that promotes energy sustainability and conservation. That’s why we appreciate the Greenies and all residents and employees who recycle and raise awareness for achieving these objectives.”\nMr. Aigner noted that the community utilizes LED light bulbs, installs high efficiency appliances and irrigates the grounds with water from the lake. This summer, Eagle’s Trace will also launch a new line of “to-go” containers in its restaurants, replacing plastics and Styrofoam with recyclable and compostable items such as straws, cups and bags.\nPhoto Caption: Resident members of the Eagle’s Trace Greenies gather during the community’s Earth Day event on April 22.\nAbout Eagle’s Trace: Eagle’s Trace, one of 20 continuing care retirement communities developed and managed by Erickson Living®, is situated on a scenic 72-acre campus in West Houston, Texas. The not-for-profit community of more than 935 residents and 500 employees is governed by its own board of directors, affiliated with National Senior Campuses, who provide independent financial and operational oversight. Additional information can be found at EaglesTraceCommunity.com.", "url": "https://apnews.com/b812d44640dc4f4ca16098b7ccc6178c"}