{"authors": ["Amy Okamoto Norfolk Arts Center"], "date_download": "2020-05-04 20:10:44", "date_modify": "2020-05-04 20:10:44", "date_publish": "2019-01-23 17:05:00", "description": "Looking for a bit of zest to help chase away the winter doldrums? The Norfolk Arts Center’s annual Soup ‘R Art offers just what’s needed to brighten your spirit. Soup ‘R Art is a celebration of...", "filename": "_d77fba1fc12b446298026637c27247c3_1588623044.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d77fba1fc12b446298026637c27247c3_1588623044.html", "title": "Enjoy artwork, soup this weekend", "title_page": "Enjoy artwork, soup this weekend", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Looking for a bit of zest to help chase away the winter doldrums? The Norfolk Arts Center’s annual Soup ‘R Art offers just what’s needed to brighten your spirit. Soup ’R Art is a celebration of the arts — visual, performing and culinary, all while serving as a major fundraiser for the NAC.\nSoup ’R Art is Sunday, Jan. 27, from 11 a.m. to 3 p.m. at the Lifelong Learning Center on the Northeast Community College campus. This year calls for extra celebrating as it’s the 10th year for the event and the 40th year of the NAC in our community.\nIf you’ve never attended Soup ’R Art before, here’s what you can expect: Soups and desserts, art, live music and a strong feeling of community.\nARTISTS FROM around the region will have displays set up for you to peruse. Expect to see a variety of mediums and merchandise represented, including textile arts, jewelry, pottery, wood carvings and paintings. Some of the artists will be demonstrating their techniques, and all of the artists will have items for sale.\nThe artists will be vying for the People’s Choice award, so be sure to vote for your favorite.\nLast year’s winner was woodworker Roger Nadrchal, who will compete again this year.\nNAC 2018 Juried Show winner Megan O’Connor will be on hand as well as current NAC gallery exhibit artist Leroy von Glan. von Glan is one of the demonstrating artists. If you’ve ever wished to watch an artist work with clay on a pottery wheel, this is the perfect opportunity.\nAs for the food, six area restaurants will be competing for the coveted People’s Choice award. Each restaurant will offer a soup and a dessert. Guests are encouraged to try them all and vote for their favorite in each category.\nIF THE art and food aren’t enough, adding to the ambiance is a supergroup of area musicians who will be playing acoustical sets throughout the event.\nDon’t shy away from bringing the whole family. A Kids Zone will be available for guests ages 4-10. Parents may drop off their children to play in this fun zone while they enjoy the festivities.\nIncluded in the event are a silent auction and a chance auction. Attendees have the opportunity to win a variety of goods and services from area businesses.\nAll proceeds from the event help ensure that the NAC can continue to offer quality programming and services to the public.\nAdmission to Soup ’R Art is $10 for adults or $15 at the door. Youth ages 4-10 are $5, and children 3 and under are free.\nAs part of their ongoing programming, all Passport to Art members receive free admission with their passport.", "url": "https://apnews.com/d77fba1fc12b446298026637c27247c3"}