{"authors": ["Seth Mclaughlin The Washington Times"], "date_download": "2020-05-04 20:03:48", "date_modify": "2020-05-04 20:03:48", "date_publish": "2019-04-10 12:20:04", "description": "Sen. Kamala Harris has some ground to make up in her home state of California, according to a new survey released Wednesday that showed she is trailing former Vice President Joseph R. Biden and...", "filename": "_2bb8bb1f73ebf11ba4e4dc1e74d56a86_1588622628.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2bb8bb1f73ebf11ba4e4dc1e74d56a86_1588622628.html", "title": "Joe Biden leads California 2020 primary poll, Kamala Harris places third", "title_page": "Joe Biden leads California 2020 primary poll, Kamala Harris places third", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sen. Kamala Harris has some ground to make up in her home state of California, according to a new survey released Wednesday that showed she is trailing former Vice President Joseph R. Biden and Vermont Sen. Bernard Sanders in her political backyard in the 2020 presidential primary race.\nThe Quinnipiac University Poll found Mr. Biden leading the pack with the support of 26 percent of California Democrats, followed by Mr. Sanders, 18 percent, and Ms. Harris, 17 percent.\nMr. Biden, who has yet to enter the race, is viewed as the most formidable foe against President Trump, with 35 percent saying he has the best chance of defeating the president in a general election showdown, compared to 17 percent for Mr. Sanders and 9 percent for Ms. Harris.\nThe survey also showed that 71 percent of Democrats, and 67 percent of women, give Mr. Biden a pass over allegations of inappropriate touching, saying it is not a serious issue.\n″‘Let Biden be Biden,’ say California voters, clearly unconcerned about former Vice President Joe Biden’s tactile embrace of supporters,” said Tim Malloy, assistant director of the Quinnipiac University Poll.\n“But there is one noticeable generational split, Mr. Malloy said. The youngest of voters are far more inclined to say, ‘hands off.’”\nIndeed, almost 40 percent of voters between the ages of 18 and 34 said the accusations against Mr. Biden are a serious issue, compared to 20 percent of the 65-plus crowd.", "url": "https://apnews.com/2bb8bb1f73ebf11ba4e4dc1e74d56a86"}