{"authors": ["Raul Garcia Staff Writer"], "date_download": "2020-05-04 20:27:52", "date_modify": "2020-05-04 20:27:52", "date_publish": "2019-02-08 03:10:00", "description": "SAN BENITO — They dug into the ground with golden shovels. The symbolic act yesterday by officials marked the start of a $1.7 million project to expand the Cameron County Appraisal District...", "filename": "_80b04c16d9e34c1cb4580b0f9a72a950_1588624072.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_80b04c16d9e34c1cb4580b0f9a72a950_1588624072.html", "title": "$1.7M upgrade to county appraisal office begins", "title_page": "$1.7M upgrade to county appraisal office begins", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SAN BENITO — They dug into the ground with golden shovels.\nThe symbolic act yesterday by officials marked the start of a $1.7 million project to expand the Cameron County Appraisal District building.\n“The funds for this project have already been collected, and there is not going to be any additional cost to the taxpayers,” Chief Appraiser Richard Molina.\nHe said the expansion of the office will be completed in about 270 days in two phases. The first phase is the construction of a new building and the second will be upgrades to the current building.\nThe county building is located in San Benito at 2012 Amistad Drive.\nThe new addition will come with a 2,000-square-foot building connecting to the east side of the existing facility.\nHe said the original building will receive new restrooms, A/C units, roof repair, concrete repair in the back parking lot and the sewer line will be replaced.\nMolina said the department has been waiting for this new expansion for a long time. He said plans for an expansion project have been in the works since 2015.\n“In 2017 we received the approval to go ahead and proceed with the bids,” Molina said. “We finally lined up the contractor, with Peacock Construction.”\nHe said the expansion is going to be beneficial to the employees who work at the appraisal district and will allow more room for the taxpayers when they visit the office.\nWhen Molina started, there were less than 50 employees. Now there are more than 65 employees working daily in the building.\n“When it was built there were only 35 employees,” Molina said about the original building.\nThe appraisal district values all the property in Cameron County and checks what has changed over the years to make sure homeowners are paying their fair share of taxes.\n“They get the money for all our schools and public entities,” said Gloria Casas, a Cameron County Appraisal District board member. “It is important that they have proper facilities because they do a wonderful job.”\nThe appraisal district requested approval from each taxing entity in the county to start the project.\nMolina said all except one of the 42 taxing entities were in agreement for the upgrade.\nThe taxing entities include area school districts, universities and cities within Cameron County.\n“The new edition to the building will help appraisers work in a more comfortable work environment,” Molina said.\nrgarcia@valleystar.com", "url": "https://apnews.com/80b04c16d9e34c1cb4580b0f9a72a950"}