{"authors": ["Ben Wolfgang The Washington Times"], "date_download": "2020-05-04 20:14:37", "date_modify": "2020-05-04 20:14:37", "date_publish": "2019-01-22 08:14:39", "description": "A high-stakes battle of wills between Washington and Beijing escalated Tuesday as the Trump administration said it will formally request that Canada extradite top tech executive Meng Wanzhou to...", "filename": "_bd626946f8fa04d86a364d268a71740e_1588623277.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bd626946f8fa04d86a364d268a71740e_1588623277.html", "title": "U.S. to seek extradition of Huawei executive: Report", "title_page": "U.S. to seek extradition of Huawei executive: Report", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A high-stakes battle of wills between Washington and Beijing escalated Tuesday as the Trump administration said it will formally request that Canada extradite top tech executive Meng Wanzhou to face federal charges, while the Chinese government demanded she be allowed to come home and her company fiercely rejected charges it is spying on citizens and customers around the world.\nMs. Meng, the daughter of Huawei Technologies Co. founder Ren Zhengfei and the firm’s chief financial officer, was arrested in Canada on Dec. 1 at the request of U.S. authorities. The Justice Department says the company, a crown jewel of the Chinese corporate hierarchy, intentionally violated economic sanctions against Iran.\nThe case has sparked a major diplomatic rift between the U.S. and China and between China and Canada, with the government in Beijing retaliating against Ottawa last month by detaining two Canadian citizens. Those prisoners, a former top Canadian official said Tuesday, are being tortured.\nThe U.S. extradition demand will only deepen tensions on all sides and set the stage for a sensational federal trial with major geopolitical implications. Friction between the U.S. and China also has erupted over trade, Taiwan and control of the South China Sea.\n“We will continue to pursue the extradition of defendant Ms. Meng Wanzhou, and will meet all deadlines set by the U.S./Canada Extradition Treaty,” Justice Department spokesman Marc Raimondi told Reuters in a statement. “We greatly appreciate Canada’s continuing support of our mutual efforts to enforce the rule of law.”\nThe Canadian newspaper The Globe and Mail, citing Canadian officials, first reported the extradition request. The U.S. Justice Department confirmed the news later Tuesday.\nIn China, the arrest of one of the country’s best-known female executives has sparked nationalist anger and vows of retaliation. Chinese Foreign Ministry spokeswoman Hua Chunying told reporters that the U.S. and Canada should release Ms. Meng immediately.\n“Canada and the United States arbitrarily abused their bilateral extradition treaty to seriously infringe upon a Chinese citizen’s security and legal rights,” Ms. Hua said. “China will, of course, respond to U.S. actions.”\nThe Chinese state-controlled Global Times news website expressed a widely held belief in China that Ms. Meng was targeted because of Huawei’s success in the marketplace.\n“The Meng Wanzhou case is an assault on China’s high-tech enterprises under the guise of law,” said an editorial Tuesday in the Global Times. “It serves the U.S.’s China strategy which views China as a strategic rival. It is nothing but geopolitical persecution.”\nHuawei Chairman Liang Hua told reporters at the World Economic Forum in Davos, Switzerland, that the company is “following the issue closely” but has not been in contact with either Canadian or U.S. authorities. He said he has “full confidence” in the legal proceedings in Canada and the U.S.\nBroader uncertainty\nThe case of Ms. Meng comes against the backdrop of broader uncertainty in the U.S.-Chinese relationship. President Trump is seeking to close a major trade deal with Beijing but simultaneously taking steps to ban Huawei products from being used in America’s nationwide installation of 5G networks.\nThe president has signed an order prohibiting the U.S. military, federal agencies and government contractors from using any Huawei equipment. Tech industry watchers say Mr. Trump may soon sign a broader emergency order blocking the use of Huawei products in the private sector as well.\nFrom the U.S. to Australia, governments are taking aggressive action to block Huawei equipment from looming 5G upgrades, though such bans will be increasingly difficult to enforce because the company is at the forefront of communications technology and is widely viewed as the global leader in the next wave of telecommunications networks.\nAmerican military and intelligence officials believe the company is joined at the hip with the Chinese government and intends to use its communications networks to eavesdrop and collect data in a massive, well-orchestrated 21st-century spy operation. Specialists have said that such spying would be difficult to detect and could provide Beijing with vital information on its global competitors.\nWhile relatively tight-lipped on the case of Ms. Meng, Huawei officials were much more aggressive in defending their company against accusations of being a tool of the communist regime.\n“If they believe there’s a back door, they should offer evidence to prove it,” Mr. Liang told reporters.\nHe said the company fully complies with all laws and regulations in each country in which it operates and stressed that privacy protections are a top priority for the country.\nMeanwhile, Canadian officials have accused Beijing of retaliating against its detention of Ms. Meng by arresting Canadian citizens and subjecting them to torture. Canadians Michael Kovrig and Michael Spavor were arrested in China shortly after the detention of Ms. Meng. Both were accused of national security offenses.\nAnother Canadian, Robert Schellenberg, has been retried and sentenced to death in China in a drug smuggling case.\nCanadian officials say they have gone out of their way to treat Ms. Meng with respect and dignity by placing her on house arrest in Vancouver and allowing her to leave her home between 6 a.m. and 11 p.m.\nTheir citizens, however, are being treated much differently.\n“Not only are our citizens in detention, we know ... the lights are on 24/7, they’re subjected to round-the-clock interrogations,” David Mulroney, former Canadian ambassador to China, told CNN on Tuesday. “These things actually constitute torture in international law, sleep deprivation. What’s happening with Ms. Meng couldn’t be more different.\n“Canada is following the rule of law to the letter,” he added.\nCanadian Ambassador to China John McCallum said the men are subjected to harsh interrogations for hours each day.\n“It’s not a fixed number, but on the order of four hours a day,” he told the Canadian Broadcasting Corp. “This could go on for up to six months under the Chinese system.”", "url": "https://apnews.com/bd626946f8fa04d86a364d268a71740e"}