{"authors": ["The Lowell Sun"], "date_download": "2020-05-04 20:21:04", "date_modify": "2020-05-04 20:21:04", "date_publish": "2019-03-25 10:35:57", "description": "LOWELL -- A community presentation on the Lowell High School renovation project is slated to take place at the Lowell Senior Center from 6 to 8 p.m. Monday. The event will be hosted by City...", "filename": "_88e4fe8f20914c3faca0a0a9e2f48019_1588623664.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_88e4fe8f20914c3faca0a0a9e2f48019_1588623664.html", "title": "Briefing on Lowell High Project", "title_page": "Briefing on Lowell High Project", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOWELL -- A community presentation on the Lowell High School renovation project is slated to take place at the Lowell Senior Center from 6 to 8 p.m. Monday.\nThe event will be hosted by City Manager Eileen Donoghue, and include presentations from project manager Skanska and architect Perkins Eastman.\nThe Lowell Senior Center is located at 276 Broadway St.\n-- AARON CURTIS\nPet clinic in Lowell\nLOWELL -- Pet owners will have a chance to attend a license, micro-chip and rabies clinic hosted by the Lowell Police Animal Control Division at the Butler Middle School from 8 a.m. to 2 p.m. on May 11.\nA dog license will cost $10 for a pet that is spayed or neutered, and $20 for a dog still intact. A micro-chip will cost the pet owner $20, which includes registration. A rabies vaccination costs $10.\nDogs must be on leashes and cats must be in carriers.\nNumerous vendors from around the area will also be on hand for the clinic.\nButler Middle School is at 1140 Gorham St.\n-- AARON CURTIS\nPreservation grants available\nCONCORD, N.H. -- Proposals for grants for wetland and stream preservation and restoration projects in the Merrimack River Service Area are being accepted by the New Hampshire Department of Environmental Services.\nThe Aquatic Resource Mitigation Fund has roughly $1.7 million to award for the 2019 Grant Round.\nThe ARM Fund has awarded grant money to 106 wetland and stream preservation and restoration projects in Massachusetts since 2006. The projects have resulted in roughly 16,000 acres of land conservation, 100 acres of restoration and protection of 290 vernal pools and 50 miles of stream passage improvements.\nProposals are due May 31, while full applications are due Aug. 30.\nFor application forms and additional information, visit des.nh.gov/organization/divisions/water/wetlands/wmp/index.htm . For additional information, contact NHDES Wetland Mitigation Coordinator Lori Sommer at lori.sommer@des.nh.gov or 603-271-4059.\n-- AARON CURTIS\nSheriff joins advisory board\nBILLERICA -- Middlesex Sheriff Peter J. Koutoujian has joined the Council of State Governments Justice Center Advisory Board.\nThe CSG Justice Center is used to develop research-driven strategies to increase public safety and strengthen communities.\nThe nonprofit’s advisory board -- composed of a bipartisan group of legislators, court officials, law enforcement executives and state executive branch officials -- set and monitor the policy and project priorities for the organization as well as the projects and programs it administers.\n“The CSG Justice Center has been at the forefront of historic criminal justice reform across the country, bringing its expertise and experience to countless jurisdictions,” Koutoujian said. “I look forward to working side-by-side with my fellow board members to ensure this critical work of increasing public safety and strengthening communities continues.”\nIn addition to serving as a CSG Justice Center Advisory Board member, Koutoujian was recently elected to serve as vice president of the Major County Sheriffs of America, which represents more than 90 of the nation’s largest counties.\n-- AARON CURTIS", "url": "https://apnews.com/88e4fe8f20914c3faca0a0a9e2f48019"}