{"authors": ["Don Maines"], "date_download": "2020-05-04 20:23:06", "date_modify": "2020-05-04 20:23:06", "date_publish": "2019-02-27 06:00:00", "description": "Broadcast journalism students at Deer Park High School will host a free public screening March 28 of their drama, “But For the Birds On the Roof,” before entering it in this year’s All-American...", "filename": "_8e1bb8939c414fa29b53e13260593cc6_1588623786.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8e1bb8939c414fa29b53e13260593cc6_1588623786.html", "title": "Deer Park High students’ film probes mental illness", "title_page": "Deer Park High students’ film probes mental illness", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Broadcast journalism students at Deer Park High School will host a free public screening March 28 of their drama, “But For the Birds On the Roof,” before entering it in this year’s All-American High School Film Festival.\nA shorter, seven-minute version of the movie is a finalist in the new “social impact” category at the annual University Interscholastic League Young Filmmakers Festival to be held March 5 at the historic Paramount Theatre in downtown Austin.\nThe film’s all-female creators and their teacher, Jared Creel, plan to attend the festival, where the school’s first effort, “Phenomena,” placed third last year before winning best horror/sci-fi/fantasy film at the All-American High School Film Festival in New York City.\nThe “social impact” category was created to honor films that inform and inspire audiences “to take action on a social issue,” Creel said. However, the goal of “But For the Birds On the Roof” wasn’t to win more awards but “to create something we could be proud of. Winning is not the most important thing,” he said.\nProducing a narrative movie “is quite a bit different” from the students’ usual task of creating a weekly news show for their school, said Creel, who teaches classes in broadcast journalism and sports journalism in addition to serving as the digital media specialist for Deer Park ISD.\n“This was really a group effort,” he said. “I chose a handful of students based on their interests and abilities and work ethic.”\nThe team, led by writer/directors Destiny Hernandez and Abby Sparks, both seniors, began meeting last summer and worked on developing the script in the fall and filming the movie in six days over the Christmas break.\nMandi Gamble, a junior, was the movie’s editor.\nThe crew included sophomore Julie Perez as videographer.\n“The UIL contest has a seven-minute time limit, and our submission was seven minutes exactly,” Creel said. “The film we end up submitting at All-American will be a little longer.”\n“But For the Birds On the Roof” stars Gavin Connor, a Deer Park High junior, as Shaun, a smart, driven teenager who breaks up with his longtime girlfriend, Everly (played by senior Emily Gage).\nFollowing a series of setbacks, said Creel, “Shaun is forced to come to terms with a worsening mental condition, and he realizes he must get help to get better and win back the girl he’s meant to be with.”\nSarah Kouba, a theater teacher at Fairmont Junior High School, portrays a therapist in the film.\nAs for meeting the criteria of the UIL’s “social impact” award, Creel said, “Ultimately the film is about overcoming mental illness and being able to move forward even when things don’t turn out the way you want them to. And that doesn’t necessarily loom the same for everyone; some people need outside help. Some people need medication. Rarely do people with mental illness just ‘get better’ by themselves. The point is recognizing you need help — and that that’s OK.”\nThe students who produced “But For the Birds On the Roof” plan to present a behind-the-scenes featurette of the filmmaking process, along with a blooper reel, at the public screening of the movie.\nDon Maines is a freelance writer who can be reached at donmaines@att.net", "url": "https://apnews.com/8e1bb8939c414fa29b53e13260593cc6"}