{"authors": ["Linda Conner Lambeck"], "date_download": "2020-05-04 20:26:23", "date_modify": "2020-05-04 20:26:23", "date_publish": "2019-02-06 21:31:13", "description": "HARTFORD — Ansonia school and city officials may be patching up their differences over funding, but the state Board of Education isn’t ready to close the books on the matter. Assistant...", "filename": "_cda2e9f83e9848d9afe732e397ffa307_1588623983.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cda2e9f83e9848d9afe732e397ffa307_1588623983.html", "title": "State BOE urged to review Ansonia city-schools agreement", "title_page": "State BOE urged to review Ansonia city-schools agreement", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HARTFORD — Ansonia school and city officials may be patching up their differences over funding, but the state Board of Education isn’t ready to close the books on the matter.\nAssistant Attorney General Ralph Urban advised the board on Wednesday to make sure any agreement satisfies state law.\n“Since the board started an inquiry, it has to decide if matter has been settle or not,” Urban said. “It is your opportunity to determine if the matter is satisfied.”\nThe Ansonia school board and city officials have locked horns over school funding for the 2017-18 school year, when the city took back $600,000 it had given the district when a late state budget gave the city’s schools with more funds than anticipated.\nThe resulting shortfall had Schools Superintendent Carol Merlone threatening to end school early. That didn’t happen, but the matter did end up in court and on the state Department of Education’s radar when concerns were raised about whether the city had satisfied the state’s minimum budget requirement.\nThe board scheduled an inquiry on the matter for last month, but that was postponed when the two sides agreed to mediation in front of retired Superior Court Judge Robert Holzberg.\nThe result was a proposal for the city to add $850,000 to the school board’s 2018-19 budget and for the school district to be more transparent about its spending.\nThe Board of Alderman gave their approval to the plan by a 9-to-2 vote on Tuesday. Merlone said the school board has scheduled a special meeting at 8:30 p.m. Wednesday to also take action on the deal.\nLouis B. Todisco, an attorney for the state Department of Education, said once both sides agree and documents are signed, the state can withdraw the case as long as its determined the minimum budget requirement for 2018-19 fiscal year has been met.\n“I did ask the (Ansonia) school board’s attorney if they believe the MBR has been satisfied and he said yes,” Todisco said.\nState School Board Member Terry Jones said he is happy the issue appears settled, but said he wish there had been more dialogue between the two sides earlier.\nSo did Sharon Voroschak-Papcin, an Ansonia resident who address the state board at the start of its meeting Wednesday.\n“There are always two sides to every story,” she said. “Framing municipalities as the bad guys in school funding disputes is not only irresponsible, it works against this (board’s) goal of teaching Connecticut’s children,” Voroschak-Papcin said.\nVoroschak-Papcin said the whole city has been stressed by the situation. In her view the Ansonia school board used bullying tactics when it threatened to close school early and that the administration has refused to disclose public documents, even to its own members, she told the state board.\n“I want to see the city of Ansonia and Board of Education move forward together, not dwell on the past,” she said.\nLast June, while the suit was pending and the school board sought a temporary emergency order, the Board of Aldermen agreed to set up a $500,000 contingency fund which the Board of Education could spend only on specific items like payroll, insurance and textbooks.\nIf approved, the settlement would add $850,000 to the schools’ 2018-19 budget. Under the proposal, the 2019-20 budget would include $800,000, which under the state’s minimum budget requirement law cannot be removed from future school board budgets.\nIn exchange for the payout, the pending proposal calls for the school board to authorize the city’s insurance broker to analyze claims information and evaluate insurance options. This has been an area of contention, particularly after a recent audit determined the school board overspent its 2017-18 budget by $225,694 mostly, by underestimating insurance costs.\nThe proposal also requires the school board to provide the city with budgetary and financial information, and to implement a shared, modern financial platform to replace its current software.\nlclambeck@ctpost.com; twitter/lclambeck", "url": "https://apnews.com/cda2e9f83e9848d9afe732e397ffa307"}