{"authors": ["Emilie Eaton"], "date_download": "2020-05-04 21:06:43", "date_modify": "2020-05-04 21:06:43", "date_publish": "2019-05-03 17:50:54", "description": "James C. “Jim” Hale was a young boy the first time he flew in an airplane. Almost immediately, he fell in love. “His very first flight was with his dad, when he was 5 or 6 years old,” said...", "filename": "_b2f72e04845241378e88f355678553f9_1588626403.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b2f72e04845241378e88f355678553f9_1588626403.html", "title": "James C. Hale flew all over the world as military and commercial pilot", "title_page": "James C. Hale flew all over the world as military and commercial pilot", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "James C. Hale flew all over the world as military and commercial pilot\nJames C. “Jim” Hale was a young boy the first time he flew in an airplane. Almost immediately, he fell in love.\n“His very first flight was with his dad, when he was 5 or 6 years old,” said his wife, Bobbi Hale. “Pilots would come to the pastures in Clarksburg, Texas, where he grew up, and they would take the kids in the plane for a few minutes.”\nOver the next several decades, Hale forged a successful career as a pilot, first as an officer in the U.S. Air Force. He was part of the strike force that President John F. Kennedy considered sending to Russia to attack missile sites during the Cuban missile crisis, and he flew combat missions during the Vietnam War.\nYears later, as a commercial pilot for United Airlines, he carried passengers all over the world, including to Australia, Thailand, Japan, South Korea and New Zealand.\nHale died March 21 of complications from Alzheimer’s disease. He was 85.\nHale was born Oct. 26, 1933, to Paul and Lucille Hale, who owned a farm in East Texas. He attended North Texas State University in Denton, where he enrolled in the school’s Reserve Officers’ Training Corps, or ROTC.\nIt was there that he met his future wife, Bobbi, who was attending Texas Woman’s University. They were on a group date with friends, each with a different partner. Bobbi Hale said she was instantly attracted to him.\n“It was probably his good looks,” she said, laughing. “And that he was friendly to everyone.”\nAfter her date canceled for her university’s Red Bud Ball, Bobbi invited Jim. They immediately “went steady” and married a year later in a small chapel in Denton.\nAfter graduating, Bobbi Hale continued with school, while her new husband received his officer commission at Webb AFB in Big Spring. Then-Senate Majority Leader Lyndon B. Johnson pinned on Hale’s new second lieutenant bars.\n“That was very exciting for all the cadets,” Bobbi Hale said.\nJim Hale received his pilot training at Moore AFB in Mission.\nAfter returning home from the Vietnam War, he was stationed at March AFB in Riverside, Calif., where he was promoted to lieutenant colonel. He transitioned into the Air Force Reserve and flew on several search missions.\nAround that same time, he began working as a commercial pilot for United Airlines. In 1983, Jim and Bobbi Hale moved to Colorado, where Hale became a training check airman, the person responsible for checking a pilot’s competency.\n“He was part of an elite roup of pilots,” Bobbi Hale said. “He really enjoyed instructing.”\nWhen her husband traveled for work, Bobbi Hale often got to accompany him, flying business class. They would take their kids, Laurie and Gary, and visit historic sites and museums as a family.\n“Looking back, it’s almost like a dream,” Bobbi Hale said. “We did a lot; it was a good life.”\nIn 1992, the Hales moved to Fair Oaks Ranch, northwest of San Antonio, and in March 1995 — 40 years to the day after he completed pilot training — Jim Hale retired.\nIn retirement, he golfed often and served on three community boards. Hale also enjoyed playing bridge with his wife — though he didn’t like that she was better at it.\nIn 2015, Hale was diagnosed with Alzheimer’s disease. Upon hearing the diagnosis, he told his doctor he wanted to donate his brain for medical research.\n“That was his very first thought, his very first sentence,” Bobbi Hale said. “I thought that was so amazing.”\nSo it was that Jim Hale’s body was donated to the University of Texas Health Science Center after he died. Bobbi Hale said she’s comforted knowing his body will be used to help find a cure for diseases like Alzheimer’s.\n“He wanted to make sure that future generations will benefit from his brain,” Bobbi Hale said. “I’m happy he decided to go through with it.”\nEmilie Eaton is a criminal justice reporter in the San Antonio and Bexar County area. Read her on our free site, mySA.com, and on our subscriber site, ExpressNews.com. | eeaton@express-news.net | Twitter: @emilieeaton", "url": "https://apnews.com/b2f72e04845241378e88f355678553f9"}