{"authors": ["Jeff Forward"], "date_download": "2020-05-04 20:09:19", "date_modify": "2020-05-04 20:09:19", "date_publish": "2019-01-17 06:00:00", "description": "When Bala Iyer applied to join The Woodlands Township Development Standards Committee in November of 2018, he was asked to attend a township board meeting where he could speak about his...", "filename": "_1fd8b73c65d846b79f6a56b600884cf6_1588622959.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1fd8b73c65d846b79f6a56b600884cf6_1588622959.html", "title": "Newest DSC member still learning, but has lots of enthusiasm", "title_page": "Newest DSC member still learning, but has lots of enthusiasm", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When Bala Iyer applied to join The Woodlands Township Development Standards Committee in November of 2018, he was asked to attend a township board meeting where he could speak about his experience. When the time came to talk about himself, Iyer was honest and told directors he didn’t know much about the committee, but wanted to serve the community.\nA week later, Iyer was chosen as the newest member of the DSC, the seven-member committee tasked with dealing with the township’s complex covenant system and resolving issues about a wide range of exterior building issues for both residential and commercial structures and developments.\nIyer, 46, said the appointment to the DSC is his first experience with governmental service. Iyer lives in the Village of Alden Bridge with his wife and son, who is in the ninth grade. Iyer received his undergraduate degree in electrical engineering at a college in India, and then after moving to the United States, earned a master’s degree in computer science from the University of Oklahoma.\nJoing the DSC is a way to be involved in the community at the ground level, Iyer said of his desire to serve The Woodlands. He is a project manager with Exxon Mobil and has lived in The Woodlands for 14 years.\n“I wanted to play some role in the governance of the community,” Iyer said. “Then I just happened to see an article about the DSC (seeking new members) and threw my hat in. I said, ‘This is my chance.’ Growth of the community got me interested…to take part in stewarding it and managing it, kind of like a son. Growth is necessary whether we like it or now. The community here is a great place to live.”\nThe first part of the process of joining the DSC, Iyer said, was attending a nearly two hour meeting with township and DSC staff, where he said he was taught the finer points of the DSC and the township’s covenant structure. Iyer said he was thankful to DSC Chairman Walter Lisiewski as well as John Anthony Brown, who is both a member of the DSC as well as the township board.\n“Walter has been great. You don’t feel like I am out of place (being new). They were very welcoming and very funny. It is the kind of setup you want to be in, where you can laugh but also get things done,” Iyer noted.\nDuring his first meeting, Iyer was confronted with a typical scenario seen at the twice-monthly meetings: a local woman had filed a complaint with the DSC to have her neighbor’s basketball hoop removed or moved to another part of their property. The location of the hoop was allowed under covenants, and despite claims from the woman errant basketballs could harm her daughter, the DSC rejected her complaint.\n“The basketball court… it did not violate the covenants, but was it a safety issue?,” Iyer said of the situation. Do you rule by the book or do you rule by the heart? That is what I am trying to learn, what is set in stone and where is there flexibility.”\nAs for large issues confronting the DSC, Iyer said he feels that the issues surrounding short-term rentals such as AirBnb and other services will have to be dealt with in the township sooner rather than later, and he said the looming issue of solar power and the possibility of many more people opting for solar panels will be another issue that comes up.\n“Solar panels are going to be one thing people want to do, along with the Airbnb rentals,” Iyer said. “It is still new waters for me to learn (about township covenants). We can adapt and write smart policies that make people happy…we have to adapt or some other city will become more attractive (for homeowners).”\nOutside of the DSC, which meets twice a month, Iyer said he has several hobbies and passions he pursues with his family, especially activities with his son. The trio enjoys astronomy and star-gazing, he said, often driving north for a few hours to get away from the light of the urban region and look at stars or other astronomical entities. He also likes photography, hiking and building and launching kit rockets.\njeff.forward@chron.com", "url": "https://apnews.com/1fd8b73c65d846b79f6a56b600884cf6"}