{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:11:07", "date_modify": "2020-05-04 20:11:07", "date_publish": "2019-03-30 05:00:00", "description": "Eugene Delozier April 19, 1938-March 28, 2019 Eugene Delozier, 80, of Columbus, died Thursday, March 28, 2019, at the Norfolk Veterans Home in Norfolk.", "filename": "_e57bb1ab1195467fa54297625639ec27_1588623067.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e57bb1ab1195467fa54297625639ec27_1588623067.html", "title": "Eugene Delozier", "title_page": "Eugene Delozier", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Eugene Delozier\nApril 19, 1938-March 28, 2019\nEugene Delozier, 80, of Columbus, died Thursday, March 28, 2019, at the Norfolk Veterans Home in Norfolk.\nThe funeral service will be held at 11 a.m. on Tuesday, April 2, at Gass Haney Funeral Home, with the Rev. Cory Burma officiating. Interment will be in Columbus Cemetery with military honors by American Legion Hartman Post 84 Honor Guard. Visitation will be from 9 a.m. until service time on Tuesday at the funeral home. Memorials may be directed to the family or the donor’s choice.\nEugene Lyle Delozier was born on April 19, 1938, to Lyle and Lucille (VanKirk) Delozier in Randolph. He attended school in Randolph and graduated from Randolph High School in 1957. Eugene entered the United States Army on Nov. 18, 1959. After his honorable discharge on Aug. 23, 1961, he served in the active Army Reserves for four years.\nEugene was united in marriage to Annette Schaffer on Jan. 15, 1966, in Norfolk. The couple was blessed with three children. Eugene worked for the alfalfa mill in Columbus before going to work for A. Glenn Kluck Feed Lots, where he worked for over 40 years until his retirement. Eugene enjoyed going to farm sales, the sale barn, and spending time on his acreage where he raised hogs, chickens, and cows.\nEugene is survived by daughter, Deb (Warren) Debban of Lee’s Summit, Missouri, grandchildren: Cami and Micah Debban; daughter, Lori (Mike) McGuire of Columbus, grandchildren: Michael, Julia, and Brodie McGuire; son, Todd Delozier of Columbus, grandchildren: Nick (Christine) and Jakob Delozier, great-grandchild: Kyler Delozier; sister-in-law, Nancy Delozier of Columbia, Missouri.\nEugene was preceded in death by parents, Lyle and Lucille Delozier; wife, Annette Delozier; brother, Donald Delozier.\nCondolences may be sent to www.gasshaney.com.", "url": "https://apnews.com/e57bb1ab1195467fa54297625639ec27"}