{"authors": ["Amy Muldoon", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Tim Marshall", "Lois Weiner", "Samir Sonti", "Doug Henwood"], "date_download": "2020-05-04 19:59:45", "date_modify": "2020-05-04 19:59:45", "date_publish": "2019-02-26 00:00:00", "description": null, "filename": "2019_02_worker-strikes-2018-bureau-labor-statistics_1588622385.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/02/26133908/GettyImages-1131234065.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_02_worker-strikes-2018-bureau-labor-statistics_1588622385.html", "title": "Workers Are Striking Again", "title_page": "Workers Are Striking Again", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The Bureau of Labor Statistics (BLS) released its summary of strike activity for 2018 earlier this month, and the numbers confirm that the decades-long one-sided class war has given way to a two-sided battle. 2017 saw a depressingly low count of 25,000 workers striking in major work stoppages; 2018’s total topped 485,000.\nThe new numbers arrive just two weeks after another BLS report showing that labor density continued to decline in 2018. Coming in the wake of the Janus Supreme Court decision, the decline in membership is not particularly surprising. But that decline in official union membership is happening at the same time as an uptick in on-the-job militancy.\nBefore the strike numbers were released, Doug Henwood sorted through some of the union membership numbers, noting that while the numbers were down, the decline isn’t the bloodletting that many the mainstream commentators predicted in the wake of Janus, at least not yet. Though labor is starting from a weak position, the key measure of labors strength — strikes — is on the rebound in a major way.\nHow the open-shop offensive is playing out is being shaped by different strategies within labor’s leadership, and by the rising tide of labor militancy kicked off (and given another recent boost) by West Virginia educators.\nWhile some locals have focused on member-to-member outreach and aggressive bargaining to show the value of union representation, others continue focusing on a service-based philosophy. Former SEIU Local 775 President David Rolf was infamous for this approach, arguing labor had to embrace “a specific strategy that delivers quantifiable benefits to a recipient through a uniquely differentiated product, service, or intervention that solves a problem or improves a situation.”\nIf unions can’t deliver strong contracts and real benefits on the job, the right-wing pitch to “give yourself a raise” by quitting the union and saving on monthly dues offers a more immediate payoff. Reducing union membership to a transactional level of getting a good return on investment undermines the larger solidaristic cause of labor that is so evident in the current strike wave.\nBut this shouldn’t be unexpected for anyone familiar with the labor movement for the last fifty years. The bywords of business unionism that dominate labor have been to cooperate with capitalists and “friendly” politicians, preserve “labor peace,” avoid the costly and risky disruptions of strikes, and count members as “dues units.”\nUnable to counter the all-out offensive against organized labor since the late 1970s, bureaucratized leaderships have accepted concessionary bargaining as the norm. Decade after decade of stagnating or falling wages simply leaves the door open to the question “why pay dues at all?”\nThis is mirrored in the private sector, most dramatically illustrated by the recent Teamsters contract negotiations with United Parcel Service (UPS). The strike-adverse Hoffa administration imposed a contract rejected by the members that contains a new tier of drivers who will never achieve parity with existing delivery drivers. Adding insult to injury, starting wages for the lowest paid at unionized UPS are now fully $2 less than nonunion Amazon — a calculated move by the retail behemoth to cut any unionization effort at off at the legs.\nOn the more positive side of the equation for labor, the impressive numbers can’t be separated from the character of the strikes. The most exciting of these recent strikes broke out of the narrow confines of tightly scripted actions and unleashed the creative energy of the rank and file. The strikes of 2018 included illegal strikes, rank-and-file-led strikes, and strikes of the unorganized (most notably anti-sexual harassment walkouts at Google).\nIt is not surprising then, that locals that bargained strong contracts, and those that struck, held the line against Janus or grew. Membership actually rose by 2.2 percent in Red States that saw raucous strikes last year, where unionism came to mean participatory direct action.\nThe Los Angeles teachers’ strike was an offensive strike that brought social justice issues to the bargaining table that were not covered by their contract. Images of teachers, students, and parents eating free tacos and dancing in the streets flooded the news. And strikers are talking to each other, using social media to support each other across state lines and sectors, watching live-streams, and participating in video conferences.\nLabor faces simultaneous attacks, stubborn bureaucracy, and emerging militancy, making this a volatile moment. The balance can shift further in labor’s favor if rank-and-file militants can further cohere the confrontational, democratic, political actions they are now taking into a larger strategy to take on capitalism. Changes in union leadership, fights, and splits are likely in the near future as workers keep fighting. Not all the coming battles will play out within existing unions, and unionization won’t always be the goal.\nThe history of class struggle in the US has always been long periods of quiet giving way to huge waves of struggle. Unions have been built in the enormous eruptions and represent the hope of turning around the numerical decline of membership. But it also represents the hope of breaking out of the confines of business unionism, to build class-wide movements for universal health care, to reverse neoliberal educational reform, to defend and include migrant workers, and to reverse racism and gendered cultures in workplaces.\nHopefully the current movement will reverse declining union membership. But it also offers an opportunity to do something more important: to reshape the labor movement to truly represent and fight for the working class.", "url": "https://www.jacobinmag.com/2019/02/worker-strikes-2018-bureau-labor-statistics"}