{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:12:34", "date_modify": "2020-05-04 20:12:34", "date_publish": "2019-03-26 04:01:00", "description": "The song's a classic, first grooved on vinyl by Guy Lombardo and the Royal Canadians in 1949. Later done by the Tommy Dorsey band, Bing Crosby, Doris Day, Louis Prima, the Supremes and even in...", "filename": "_7808fa8235d449268b743400cbff78ec_1588623154.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7808fa8235d449268b743400cbff78ec_1588623154.html", "title": "Late '40s hit tune is still a great life lesson", "title_page": "John Patrick Grace: Late '40s hit tune is still a great life lesson", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The song’s a classic, first grooved on vinyl by Guy Lombardo and the Royal Canadians in 1949. Later done by the Tommy Dorsey band, Bing Crosby, Doris Day, Louis Prima, the Supremes and even in reggae version by Prince Buster.\nIts lesson is timeless: “Enjoy yourself, it’s later than you think/ Enjoy yourself, while you’re still in the pink/ The years go by, quickly as a wink/ Enjoy yourself, enjoy yourself, it’s later than you think.”\nI’ve been singing it around the house in what is for Paula and me a landmark period, March 2019: 12-year anniversary of our adopting shepherd-husky mix and Hospice House therapy dog Cooper. Notably, average lifespan for his breed and size is 11 years, so we’re past that threshold and still rolling.\nWe had a stretch there a couple months ago when we thought we might even lose Cooper due to ravaging skin allergies and infections. He was truly miserable. I had to pull him from duty at Hospice House.\nBut with help from Dr. Anna Scarberry, our trusty vet at Guyan Animal Hospital, we apparently got going with the right medications and treatments. And Cooper is “back on post,” at least one Sunday a month.\nTwo years ago he received his five-year volunteer pin from Hospice and had his picture taken in a group with five-year human volunteers at the annual Hospice recognition luncheon. A proud moment. He’s the star, I’m just the aide (my official title is “pet handler”). Together we have interacted with well over 800 people, patients and visitors at Hospice House on the river.\nOur current jubilation over Cooper “making it” to the 12-year mark has been tempered by travails our senior feline, Cleo, a pretty and sweet Tuxedo Cat (black with white patches on throat and all four paws) has been traversing.\nAt about age 14 Cleo is visibly slowing down, having trouble eating, pooping in very irregular fashion (and never in the litter box anymore). She has a history of seizures, for which we, after hit and miss attempts, finally got the right medication. (Kudos to retired vet Dr. Ricky Millen from Stonecrest Animal Clinic.) The meds tone down the seizures but don’t entirely head them off.\nBoth Cooper and Cleo are likely in my own age bracket - I’m now 76 - in dog and cat year equivalents. We’re all “up there.” It is, indeed, “later than you think.” Thus watching our pets age, I’m led to take the cue that “the years go by, quickly as a wink.”\nWhile my wife and I were coping with Cleo’s downhill slide, a Publishers Place Inc. board member, the wonderful former Huntington mayor and state legislator Bobby Nelson, passed away at age 84. The always vibrant, if peppery, Mayor Nelson certainly did know how to “enjoy himself.” And he knew how to kick up fun as well as attention to biting social issues such as addiction and homelessness. Memories of guesting on Bobby’s WRVC 94.1 FM radio show are priceless.\nTime, however, ran out for Bobby Nelson, as it will, before we know it, for each and every one in our households.\nMeanwhile, Cooper’s been showing signs of cloudy eyes — encroaching cataracts — and I myself have been struggling with three different eye conditions: cataracts (yes, had the surgery), glaucoma (had the laser treatment, twice) and blepharitis. Hate all that because it sure cuts down on reading!\nHappily, our junior cat, Punkin, at 11 is still spunky. But she too will learn her limits, soon enough.\nJohn Patrick Grace lives in eastern Cabell county, edits books and teaches the Life Writing Class.", "url": "https://apnews.com/7808fa8235d449268b743400cbff78ec"}