{"authors": ["Cea Weaver", "Michael Cavadias", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Amee Chew", "Katie Goldstein", "Tanner Howard", "Meagan Day"], "date_download": "2020-05-04 19:49:44", "date_modify": "2020-05-04 19:49:44", "date_publish": "2019-06-10 00:00:00", "description": null, "filename": "2019_06_universal-rent-control-new-york-housing_1588621784.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/10144315/rent.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_universal-rent-control-new-york-housing_1588621784.html", "title": "New York Needs Universal Rent Control Now", "title_page": "New York Needs Universal Rent Control Now", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "With some of the strongest renter protections in the country, New York has been the epicenter of tenant power for a century. Though it doesn’t extend to the whole state, the existing system of rent control, known as “rent stabilization,” still protects nearly one million households from unregulated rent increases and arbitrary evictions.\nBut at the same time, New York is the epicenter of real estate power, gentrification, and unaffordable housing. Over half the state’s renters are rent burdened, and more than a hundred people are evicted each day. This month, rent stabilization will expire altogether and need to be renewed, giving both the real estate industry and the tenant movement an opportunity to win gains in either direction.\nOur current system, the Emergency Tenant Protection Act (ETPA), is a product of a century of struggle between landlords and tenants. Rent control has been under assault since its inception, and in recent decades property owners have made major progress in weakening the laws. ETPA is full of loopholes that lead to tenant harassment and burdensome rent hikes. Nearly three hundred thousand apartments have been deregulated since 1991, and rent stabilized landlords’ net operating income has grown by 64 percent in that period.\nThe loopholes have a menacing impact, particularly on New York City, a city struggling to maintain affordability in the face of gentrification. Private equity investors like the Blackstone Group have trained their eyes on rent stabilized apartment complexes. Because it’s easy for landlords to raise rents on vacant apartments, but relatively more difficult on occupied ones, rent stabilized tenants face “incorrect and deliberately misleading” eviction notices in an attempt to push them out. The share of apartments that are owned by global investors is growing — and the prospect of removing apartments from rent regulation and reaping unlimited profit from New York’s seemingly insatiable housing market is a key part of the reason why.\nBut after forty years in a defensive posture, fighting to hang onto the system as it stands, the tenant movement has a rare opportunity to win real gains. The Housing Justice for All campaign, a coalition of tenant groups and homeless New Yorkers across the state, is fighting to reverse decades of deregulation and to expand renters’ rights.\nIn addition to eliminating the ways that landlords are able to get around the law to raise rents, the “Universal Rent Control” platform includes a good-cause eviction bill that would protect tenants currently living in unregulated apartments — of which there are over three million — from arbitrary evictions and unconscionable rent hikes.\nGood-cause eviction was introduced to the State Senate by Julia Salazar — New York’s first socialist state senator in decades — this January. Salazar was elected refusing to accept real estate donations to fund her campaign — a “no real estate” money pledge that was introduced by State Assemblywoman Diana Richardson and the Crown Heights Tenant Union in 2015, and is increasingly a litmus test for the state’s progressive candidates.\nThis is a far cry from the last time New York’s rent stabilization laws expired, in 2015. That year, both the Democratic Speaker of the State Assembly and the Republican Senate Leader both were arrested on corruption charges related to their relationship with the real estate industry.\nThe shift in New York’s tenant movement is happening as the national tenant movement quickly expands. Last November, after a damning misinformation campaign bankrolled by the real estate industry, California voters considered and ultimately rejected a statewide measure to lift restrictions on local rent controls. In February, Oregon became the first state in decades to pass statewide rent regulation and voters in eighteen Chicago precincts voted in support of lifting a statewide ban on rent control. The same week, the Center for Popular Democracy, Policy Link, and Right to the City released a study evaluating rent control’s effectiveness at solving a widespread housing affordability crisis, estimating that current rent control campaigns could protect over twelve million households in the United States.\nAnd at a campaign rally in Brooklyn this March, presidential candidate Bernie Sanders spoke about his childhood in a rent controlled apartment, and vowed to fight gentrification.\nBy limiting landlords’ power to charge whatever they wish, rent control can build tenant power and undermine the logic of speculative neighborhood investments. The measure is a radical, scalable solution that directly intervenes in the market and constrains the ability of landowners to limitlessly profit. By discouraging speculation and lowering the value of investment properties, it lays the groundwork for an expansion of alternative housing models, like social housing and community land trusts.\nRent control is as sensible as it is radical. It addresses basic needs, like the freedom to live without fear of an eviction. Without it, at the end of a lease term, or maybe at any time in the middle of the month, tenants find themselves without shelter — forced to leave the neighborhood where they have built their lives. The fight for rent control unites downwardly mobile, student-debt burdened millennials who will never own a home with long-time neighborhood residents in a shared struggle against arbitrary landlord power.\nThree Democratic Socialists of America chapters around New York have joined the Housing Justice for All campaign for universal rent control. Right now, only cities in eight New York counties (New York City and surrounding areas) are eligible to opt-in to rent stabilization law. One bill on the Universal Rent Control platform would expand the right to opt-in to the entire state, opening the door for socialists to organize for rent control in cities from Buffalo in the Rust Belt, to Kingston in the Hudson Valley.\nStill, despite the rise of the tenant power movement and a progressive shift in the New York State Senate, victory is far from certain. Albany is notoriously controlled by “three people in a room”: the leader of the State Senate, the head of the State Assembly, and the governor. The assembly speaker has signaled support for tenant issues, but has also cautioned that the State Assembly will not do anything to “disincentivize landlords.” The State Senate has a newly elected cohort of progressives who refused real estate donations, but they are under increasing attack by Governor Andrew Cuomo and his allies in the business community for their role in stopping the multibillion-dollar giveaway to Amazon. Cuomo’s cozy relationship with the real estate industry makes him one of the biggest obstacles to any serious new regulations.\nNonetheless, New York tenants have the strongest opportunity to strengthen rent control that the movement has had in decades. Winning these reforms will give people who rent their homes the ability to stay in their communities, keep children in their schools, and protect hundreds of thousands of people from the merciless power of capital. In New York and beyond, we need universal rent control now.", "url": "https://jacobinmag.com/2019/06/universal-rent-control-new-york-housing"}