{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:28:13", "date_modify": "2020-05-04 20:28:13", "date_publish": "2019-03-28 05:00:00", "description": "As part of the Spring Break DWI Initiative, Friendswood police arrested seven allegedly intoxicated drivers March 12-18. The initiative involved 18 area law enforcement agencies working to...", "filename": "_e401eeb6cfd24363b9f5a888e0b6d104_1588624093.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e401eeb6cfd24363b9f5a888e0b6d104_1588624093.html", "title": "Spring break police effort tallies 7 DUI arrests", "title_page": "Spring break police effort tallies 7 DUI arrests", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "As part of the Spring Break DWI Initiative, Friendswood police arrested seven allegedly intoxicated drivers March 12-18.\nThe initiative involved 18 area law enforcement agencies working to raise community awareness about the risks of drinking and driving, the Friendswood Police Department noted in a press release.\nThe release urged those planning to drink to get a ride from a designated driver, cab or rideshare or to call a sober friend for a lift.\nThose arrested were:\nAn Alvin woman, 21, who was charged with DWI with a child under 15 after a traffic stop for no tail lights March 12 in the 3600 block of FM 528. She reportedly failed a field sobriety test and consented to a blood test. During a vehicle inventory, the officer found a vape pen containing a THC oil cartridge, police said.\nA Santa Fe woman, 34, charged with DWI after allegedly abruptly crossing three lanes of FM 529, driving in the turn lane for several blocks and following too closely behind another vehicle March 16 in the 3100 block of Bay Park Drive, police said. She failed a field sobriety test and refused breath and blood tests, according to the report.\nA Pasadena man, 38, who was charged with DWI after a traffic stop for failure to maintain a single lane and speeding March 16 in the 1500 block of South Friendswood Drive. The officer reported observing an open can of beer on the passenger floorboard during the stop. The driver failed a field sobriety test and refused breath and blood tests, police said.\nA 55-year-old Alvin man, who was charged with DWI after a traffic stop for speeding March 17 in the 2100 block of West Parkwood Avenue, police said. He reportedly failed a field sobriety test and provided a blood specimen.\nA Friendswood woman, 50, with DWI after she allegedly stopped in an intersection March 17 in the 2900 block of West Bay Area Boulevard. She did not immediately stop for the officer’s red lights and pulled over only after the officer turned on the siren, police said. Then, instead of pulling over to the right, she stopped to the left in a gap in the median, according to the report. After the officer instructed her to pull into a nearby parking lot, she reportedly struck a curb. She failed a field sobriety test and refused breath and blood tests, police said.\nA Friendswood man, 44, charged with DWI after a traffic stop for failure to drive in a single lane and almost striking another vehicle March 17 in the 200 block of Edgewood Drive, police said. He reportedly failed a field sobriety test and agreed to provide a breath specimen.\nA Friendswood man, 47, who with DWI after a traffic stop for an improper lane change and failure to maintain a single lane March 18 in the 1100 block of West Parkwood Avenue. He reportedly failed a field sobriety test and refused a breath or blood test.\nTheft\nPolice charged a Houston man, 29, with theft and public intoxication after a disturbance March 12 at Kroger, 3135 FM 528. Officers arrived to find the man fighting with store employees, police said. He had a bottle of vodka and refused to speak with officers, according to the report. Employees told officers the man entered the store just before closing time and rolled out a grocery cart full of merchandise without paying. The merchandise totaled $87.79, police said.\nA man described as in his late 20s, slightly overweight and wearing a green hat, green shirt and blue jeans stole a package from the front porch of a residence in the 1700 block of East Winding Way, according to a March 12 police report. He drove up in a white, single-cab Ford F-150 and took the package about 20 minutes after the UPS driver left it, police said. The truck reportedly had a white Costa sticker on the bottom left of the back windshield as well as some damage to the rear bumper.\nA 62-year-old Hitchcock man left H-E-B, 701 W. Parkwood Ave., without paying for meat he had placed in his walker, according to a March 13 police report. When an employee asked the man if he had forgotten to pay for something, the suspect took off without the meat, police said. Officers reportedly found him at Subway, 101 W. Parkwood Ave., and charged him with theft. He has prior theft convictions, and bond was set at $60,000, according to the report.\nNarcotics\nPolice charged a Friendswood man, 23, with possession of a controlled substance after a traffic stop for a license plate violation March 12 in the 3700 block of FM 528. Asked if he had marijuana inside the vehicle, the man allegedly told the officer he had 4 grams in his driver’s-side door. The officer found the marijuana, a glass pipe, a grinder and some cocaine during a vehicle search, police said.\nA Houston man, 46, was charged with possession of a controlled substance after an officer found him drinking alcohol inside a parked vehicle March 12 in the 100 block of Imperial Drive, police said. The man appeared to be living inside the vehicle, according to the report. The officer reportedly found marijuana, psilocybin mushrooms, methamphetamine and unknown pills during a vehicle search. Bond was set at $10,000.\nA routine license plate check led to the arrest of a Webster man, 37, for a felony Galveston County narcotics warrant March 14 in the 2300 block of Heritage Bend Court, police said. During the stop, the man reportedly refused to put his car in park, rolled up the window and tried to drive away. An officer opened the driver’s-side door, removed the man from the vehicle and detained him in handcuffs, according to the report. The passenger, a 28-year-old Bacliff woman, had an active Friendswood warrant and faces charges for possession of a controlled substance after an officer found a methamphetamine pipe, two syringes of methampetamine and crystal methamphetamine in her possession, police said.\nA Pasadena woman, 46, was charged with possession of a controlled substance after a traffic stop March 15 in the 3200 block of West Parkwood Avenue, police said. The stop began when a routine license plate check showed the vehicle’s registered owner had outstanding warrants, according to the report. The woman reportedly declined consent to search, and a police dog provided an alert to the driver’s-side and front passenger doors. The officer found crystal methamphetamine in a purse and a scale with residue under the front passenger seat during a vehicle search, police said. At the jail, the woman allegedly was found in possession of a glass pipe and methamphetamine. The passenger, a 38-year-old Webster man, had an active parole violation warrant, police said.\nPolice charged a Houston woman, 25, with possession of drug paraphernalia after a traffic stop for expired registration March 17 in the 2400 block of West Parkwood Avenue. She had a suspended driver’s license, police said, and the officer reportedly found a “one-hitter” pipe, rolling papers and a grinder during a vehicle search. The passenger, a 25-year-old Missouri City woman, allegedly had marijuana under the passenger seat and was charged with marijuana possession.\nWeapons\nPolice charged a Friendswood man, 22, with possession of drug paraphernalia after a traffic stop for defective brake lights March 14 in the 200 block of East Parkwood Avenue. The passenger, also a 22-year-old Friendswood man, was charged with unlawfully carrying a weapon after he reportedly confessed to having marijuana in the passenger-side door along with a firearm in the glovebox. The officer found marijuana residue, two grinders, two marijuana cigarettes and a handgun during a vehicle search, police said.\nTraffic\nPolice charged a Pasadena woman, 38, with driving while license invalid after an officer reportedly observed her passenger not wearing a seatbelt March 11 in the 3000 block of West Bay Area Boulevard. The woman allegedly had a suspended driver’s license. Her passenger, a 40-year-old Webster man, was arrested for outstanding Friendswood warrants, police said.\nA San Leon man, 23, was charged with driving while license invalid March 15 in the 1000 block of West Parkwood Avenue, police said.\nPolice charged a Dickinson man, 24, with disregarding a traffic control device and possession of drug paraphernalia after a traffic stop March 16 in the 2900 block of FM 528. The officer found two BB guns, two marijuana cigarettes, a starter pistol and marijuana residue during a vehicle search, police said.\nA Pearland woman, 33, was charged with failure to stop at a designated point and possession of drug paraphernalia after a traffic stop March 17 in the 2700 block of Friendswood Link Road, police said. A K-9 provided a positive alert for narcotics in the vehicle, and an officer found a vape pen and a cartridge containing THC oil during a search, according to the report.", "url": "https://apnews.com/e401eeb6cfd24363b9f5a888e0b6d104"}