{"authors": ["Courtesy Of The West Virginia Humanities Council"], "date_download": "2020-05-04 20:06:52", "date_modify": "2020-05-04 20:06:52", "date_publish": "2019-01-26 05:01:00", "description": "The West Virginia Humanities Council has funded a continuation of the Diversity in Appalachia Lecture Series hosted by the Frank and Jane Gabor West Virginia Folklife Center on the campus of...", "filename": "_c23bf527d5614378b9f4f0b30fbce72a_1588622812.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c23bf527d5614378b9f4f0b30fbce72a_1588622812.html", "title": "West Virginia Humanities Council continues funding lecture series", "title_page": "West Virginia Humanities Council continues funding lecture series", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The West Virginia Humanities Council has funded a continuation of the Diversity in Appalachia Lecture Series hosted by the Frank and Jane Gabor West Virginia Folklife Center on the campus of Fairmont State University.\n“We are thrilled to have the continued support of the West Virginia Humanities Council,” noted Dr. Francene Kirk, the Folklife Center’s interim director. According to Kirk, the goal of the lecture series for the spring semester is to engage students, faculty, staff and community members in conversations about race, class, and gender in Appalachia. Two of the presentations include short documentary films. All of the events are held in the Frank and Jane Gabor West Virginia Folklife Center and are free and open to the public.\nThe first event is a screening of the documentary film “Blanket Town: The Rise and Fall of an American Mill Community” on Tuesday, Feb. 19 at 12:30 p.m. and 7 p.m. Filmmaker Rebecca Williams will show and discuss her short documentary film about the rise and fall of the Beacon Blanket Mill in Swannanoa, NC, its influence on the people who worked there, and its national and global context. The story of the Beacon Mill is the story of the United States manufacturing industry, a complex legacy of generations of workers who lived and worked together “like a family” in tight knit communities. Many former mill workers define life in the mill village as an idyllic lifestyle with company sponsored housing, ball teams, recreation centers and other employee benefits. With the decline of the textile industry in the 70s and 80s and the introduction of NAFTA in the 90s, small mill towns, like Swannanoa, began to die.\nMs. Williams is a free-lance artist and filmmaker with an M.A. in theatre and women’s studies from Rhode Island College. She has a certificate in documentary arts from the Duke Center for Documentary Studies and is the founder of Serpent Child, a non-profit professional arts company dedicated to the collaborative creation of multi-disciplinary, community-based art.\nOn Tuesday, March 26, at 7 p.m. , Dr. Cris Mayo, will talk about the history of the LBGTQ community in Morgantown, West Virginia. Dr. Mayo’s presentation will focus on the work done in Morgantown, WV, over the course of many decades to create welcoming spaces for the LBGTQ community. Drawing on oral history narratives of people of diverse genders and sexualities, the presentation will chart both the stories of those who left but contributed in their visits home and those who stayed and built safe spaces, relationships, and organizations dedicated to improving the lives of other LGBTQ citizens in WV. Dr. Mayo is a professor in Women’s and Gender Studies and the director of the LBGTQ+ Center at West Virginia University.\nFinally, Dr. Beth Davison will show and discuss her short documentary, “Dulatown”, on April 22, at noon and at 7 p.m. in the Folklife Center. Dulatown, a community in Lenoir, NC, was established from land a slave owner (Alfred Dula) bequeathed to his slave (Harriet) and their eight children. Dulatown embraces its history at a bi-annual reunion where in recent years both African-American and White Dula relatives come together around their shared history and genealogy to publically acknowledging they share more than just a surname.\nDr. Beth Davison teaches in the Departments of Sociology & Culture, Gender and Global Studies at Appalachian State University where she is also the co-director of the University Documentary Film Services. Davison has a certificate in documentary arts from the Duke Center for Documentary Studies.\nThe Diversity in Appalachia Lecture Series is presented with financial assistance from the West Virginia Humanities Council, a state affiliate of the National Endowment for the Humanities. Any views, findings, conclusions or recommendations do not necessarily represent those of the West Virginia Humanities Council or the National Endowment for the Humanities.\nFor additional information about the lecture series, contact the Frank and Jane Gabor West Virginia Folklife Center at 304-367-4403 or WVfolklife@fairmontstate.edu.", "url": "https://apnews.com/c23bf527d5614378b9f4f0b30fbce72a"}