{"authors": ["Journal Staff"], "date_download": "2020-05-04 20:07:26", "date_modify": "2020-05-04 20:07:26", "date_publish": "2019-04-06 23:26:00", "description": "SIOUX CITY - Morningside rallied from a significant deficit for the second straight day and the end result was a sweep of City rival Briar Cliff 5-2 and 6-5 in Great Plains Athletic Conference...", "filename": "_558ddbeb95bd4ef89019424ef157eebe_1588622846.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_558ddbeb95bd4ef89019424ef157eebe_1588622846.html", "title": "COLLEGE SOFTBALL: Morningside uses another improbable rally to sweep BCU", "title_page": "COLLEGE SOFTBALL: Morningside uses another improbable rally to sweep BCU", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SIOUX CITY - Morningside rallied from a significant deficit for the second straight day and the end result was a sweep of City rival Briar Cliff 5-2 and 6-5 in Great Plains Athletic Conference softball play held at the Jensen Family Complex Saturday afternoon.\nA day after spotting Mount Marty a seven-run lead, the Mustangs saw Briar Cliff surge to a 5-1 lead in the top of the sixth inning of the second game of the set. Morningside pulled two runs closer on RBI singles by Cortney Joiner and Carrington Entinger in the sixth. In the seventh, Kelsey Spongberg had a two-run single to tie the game and Entinger hit an rbi grounder to plate Spongberg with the winning run.\nBriar Cliff had posted the lead scoring once in each of the first three frames and twice in the sixth on a two-run homer by Johanna Vaske.\nThe first game was tied 2-2 in the third inning before Morningside (15-6 overall and 8-2 GPAC) scored a run to take the lead for good. Pitcher Hallie Misiaszek kept the Chargers (7-18 overall and 2-8 GPAC) from scoring again after a two-run third and struck out five while giving up six hits and a walk.\nThe win was the ninth straight in the series for the Mustangs, who last suffered defeat to the Chargers in 2013. In all, Mornignside leads the all time series 24-4.\nSOUTH DAKOTA 5-4, OMAHA 4-0: Dustie Durham had the game-winning hit in the first game then pitched a four-hit shut out in the nightcap as the Coyotes swept the Mavericks in a Summit League softball twin bill at Nygaard Field in Vermillion Saturday.\nUSD was on the verge of dropping the opener trailing 4-3 going into the seventh inning but No. 9 hitter Lauren Eamiguel belted a solo home run to lead off the frame and tie the score. Alyssa Fernandez followed with a one-out single and came around to score the winner on Durham’s single up the middle.\nSouth Dakota (24-18 overall and 7-1 Summit) got a two-run home run from Dylan Underwood in the nightcap while Durham had two hits and drove in another run.\nThe teams play the third game of the series today at 11 a.m.\nNORTHWESTERN 6-8, HASTINGS 0-2: The Raiders imited the Broncos to two runs on the way to a Great Plains Athletic Conference softball doubleheader sweep in games played in Hastings Saturday afternoon.\nSamantha Ubben threw a shut out on four hits in the first game, fanning five while walking two. Amber Schubert, a former Sergeant Bluff-Luton prep athlete, hit a two-run in the third inning to get the Raiders the lead and Devin Dreesen later drove in two more runs with a single.\nDreesen drove three more runs and Schubert a pair more in the second game for the Raiders, who scored six runs over the final three innings to break from a 2-2 tie and get the sweep. Emma Schnell and Sydnee Isom shared the pitching duties in the nightcap for Northwestern (10-13 overall and 3-3 GPAC) with Isom getting the win in relief.\nLUTHER 6-5, BUENA VISTA 0-1: The Norse rolled to a doubleheader sweep in an American Rivers Conference softball doubleheader played in Decorah Saturday.\nLuther got just three hits in the first game but took advantage of five walks and a hit batter to scored four times in the second inning without the benefit of a hit. Samantha Bratland pitched a five-hitter to each the shut out in the opener for the Norse.\nIn the second game, BVU took a 1-0 lead in the first inning on an RBI double by Kate Lesmeister that scored Michaela Mason. The Norse got a three-run homer from Blake Banowetz in the bottom of the first and went on to sweep the set.\nBuena Vista (14-12 overall and 0-6 ARC) hosts Nebraska Wesleyan Wednesday.\nCONCORDIA-ST. PAUL 15-3, WAYNE STATE 3-4: The Golden Bears got a walk off win in the nightcap to earn a sweep of their Northern Sun Conference softball doubleheader with the Wildcats in a game that was moved to Wayne but played as a home contest for Concordia-St. Paul.\nWayne State (9-17 overall and 0-10 NSIC) trailed 4-1 in the seventh inning of the nightcap but got a tying three-run home run from Emily Chandler to tie the game at 4-4. The Golden Bears loaded the bases on a double and two walks in its half of the seventh ahead of a winning single by Hannah Carlson.\nWayne State took a 2-0 lead in the top of the first of the opener on RBI singles by Emily Chandler and Abbie Hix but would score no further while Concordia St. Paul (20-10 overall and 7-3 NSIC) had 15 unanswered runs.\nDOANE 3-3, DORDT 1-7: The Tigers and Defernders spilt a Great Plains Athletic Conference softball doubleheader in games played in Crete, Neb. Saturday.\nDordt (12-13 overall and 6-4 GPAC) got home runs from winning pitcher Rachel Evavold and Marissa VandenBerg in the second game to earn the Game 2 win. Hailey Heeringa also drove in a pair and Evavold went the distance in the circle for the win, striking out four.\nFriday\nDOANE 2-2, NORTHWESTERN 0-12: Amber Schubert hit her first two home runs of the season and drove in three runs as she helped the Raiders gain a split of a Great Plains Athletic Conference softball doubleheadrer played in Crete, Neb. Friday evening.\nBrianne Giordano also had a home runs and drove in three in the win. Emma Schnell got the pitching win giving up four hits and two walks in the game that was halted by run rule after five innings. Pitcher Josie Schnakenberg got the win in the opener for Doane (12-16,4-4 GPAC) shutting the Raiders down on four hits.", "url": "https://apnews.com/558ddbeb95bd4ef89019424ef157eebe"}