{"authors": ["Dennis Punzel", "Wisconsin State Journal"], "date_download": "2020-05-04 20:15:12", "date_modify": "2020-05-04 20:15:12", "date_publish": "2019-01-30 10:35:00", "description": "J.M. Gold. Nick Neugebauer. Mark Rogers. Mike Jones. Eric Arnett. Jed Bradley. Taylor Jungmann. The list goes on and on, and most Milwaukee Brewers fans can recite them without pausing...", "filename": "_2f19e146dc6e47b9b1dba4789c2c787d_1588623312.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2f19e146dc6e47b9b1dba4789c2c787d_1588623312.html", "title": "Homegrown talent developing on the mound for Brewers", "title_page": "Homegrown talent developing on the mound for Brewers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "J.M. Gold. Nick Neugebauer. Mark Rogers.\nMike Jones. Eric Arnett. Jed Bradley. Taylor Jungmann.\nThe list goes on and on, and most Milwaukee Brewers fans can recite them without pausing for a breath.\nThe list, of course, is that of highly regarded pitching prospects who either flamed out in the minor leagues or had brief, unremarkable major league careers.\nIt is a list that has fed the Brewers’ reputation for not being able to develop homegrown pitchers, save for the random Ben Sheets or Yovani Gallardo.\nBut now the Brewers have a core of young pitchers who could help them shed that reputation.\nThat group is led by right-handers Corbin Burnes, Brandon Woodruff and Freddy Peralta, who made splashy big league debuts in helping the Brewers get to within one game of the World Series last season. And there’s a reasonable chance they could form a good part of the starting rotation this season.\nThose three, along with another wave coming along behind them, are part of a concerted effort by the Brewers to improve their track record in developing pitchers. It started about eight years ago when the organization held a pitching symposium, bringing in all of their medical staff, pitching coaches and some outside experts for a two-day summit to examine each step in the process from drafting to developing.\n“We put our absolutes out there,” said farm director Tom Flanagan, who was part of the Brewers contingent on hand for the annual Dugout Club banquet Tuesday at the Marriott Madison West. “Is it a draft issue? Is it a development issue? Where is it breaking down where we like a guy in the draft and we’re not seeing enough of them in the big leagues?”\nFlanagan said the changes instituted were not dramatic, but more of a combination of minor adjustments.\n“I don’t think it’s one magic bullet,” Flanagan said.\nOne change was being beholden to the radar gun or sticking too strictly to any prototype of pitching prospects.\n“Sometimes teams will have that mold where everybody is 6-foot-2 and the delivery is real pretty,” he said. “But you’re really restricting your talent pool and you may walk away from those outliers like (Tim) Lincecum that come along. Not that you’re looking for Lincecum but you don’t want to close the door before you’ve even kicked the tires on a guy in the draft.”\nThe next wave of pitching prospects was assembled without the expenditure of many high draft picks. Since drafting Jungmann and Bradley in the first round in 2011, the Brewers have drafted only one pitcher in the first round — left-hander Kodi Medeiros, who was traded last season for Joakim Soria.\nThe leader of the post-symposium pitchers was right-hander Jimmy Nelson, a second-round draft pick in 2010 who was emerging as the ace of the staff in 2017 before suffering a shoulder injury that knocked him out for all of last season.\nWoodruff was drafted in the 11th round in 2014, Burnes in the fourth round in 2016 and Peralta was acquired in a trade from Seattle in 2015 when he just 19 and hadn’t pitched beyond rookie ball. Each was brought up during the season and made a big impression.\nPeralta started 14 games with a 6-4 record and 4.25 ERA and had 96 strikeouts in just 78.1 innings. Woodruff pitched in 19 games, making four starts, going 3-0 with a 3.61 ERA.\nBurnes was used out of the bullpen in 30 games and went 7-0 with a 2.61 ERA.\n“Woodruff and Burnes are very similar,” Flanagan said. “They’re both big, strong, right-handers and they’re big-time competitors. I always say they pitch angry. When they’re on the mound they want to shove for however long they’ll let them go. Usually their last couple pitches are as strong as their first ones.\n“Peralta is kind of an outlier. He was the guy who from the standpoint of a scout in the stands, you liked it but you didn’t really know if there was something different about him where he could get guys out in the minor leagues but would that play in the big leagues because he throws such a high percentage of fastballs. He pitches up and he gets a lot of swing and miss. Guys see it a lot harder than it is.”\nFlanagan thinks right-hander Zack Brown could be the next in line. Brown, a fifth-rounder in 2016, was the organization’s minor league pitcher of the year last season when he went 9-1 with a 2.44 ERA at Class AA Biloxi.\n“Zack Brown is following those guys’ footsteps,” Flanagan said. “He’s got the fastball and he’s got a big, big breaking ball. It’s a hard curveball and that’s his bread-and-butter pitch. A lot of guys think he may end up in the bullpen someday but every level he’s been at he’s gotten the job done as a starter.”\nDown the line Flanagan sees similar profiles in right-handers Trey Supak, Braden Webb and Caden Lemons and lefty Aaron Ashby.", "url": "https://apnews.com/2f19e146dc6e47b9b1dba4789c2c787d"}