{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:14:22", "date_modify": "2020-05-04 20:14:22", "date_publish": "2019-01-30 05:01:01", "description": "By NIKKI DOTSON MERRITT Managing Editor WAYNE - DaVita Beech Fork, aka Ravine Dialysis, located at 600 McGinnis Drive, Wayne, West Virginia, 25570, will cease operations as of Feb....", "filename": "_ff50fc12a69346a48c89f410c6171f09_1588623262.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ff50fc12a69346a48c89f410c6171f09_1588623262.html", "title": "DaVita ceasing operations at end of February", "title_page": "DaVita ceasing operations at end of February", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "By NIKKI DOTSON MERRITT\nManaging Editor\nWAYNE - DaVita Beech Fork, aka Ravine Dialysis, located at 600 McGinnis Drive, Wayne, West Virginia, 25570, will cease operations as of Feb. 27.\nDuring the next several weeks, patients at this location will be assisted in arranging for dialysis treatment at alternative locations to ensure continuity of care.\nThe business is designed to help those in stage five of kidney disease, which requires dialysis.\nA chronic kidney disease (CKD) diagnosis may come as a surprise to many people, because the symptoms are often times subtle.\nThe signs of kidney disease are:\nn Change in urination\nn Swelling\nn Fatigue\nn Skin rash\nn Metallic taste in mouth\nn Nausea and/or vomiting\nn Shortness of breath\nn Feeling cold\nn Dizziness\nn Trouble concentrating\nn High blood pressure\nIn many cases, kidney damage is the result of another illness that has progressed slowly over the years.\nThe two main causes are diabetes and high blood pressure. If your kidney disease is the result of one of these conditions, the best way to manage it is to treat the illness that is causing it.\nOnce it’s determined that you have kidney disease, it’s important that you learn about your condition. Kidney disease is one of the few diseases that can be managed. You play a crucial role in maintaining your kidney function.\nThe five stages of chronic kidney disease ranging from Stage 1 is the closest to healthy kidney function and Stage 5 requires dialysis or a kidney transplant.\nFor more information, contact your healthcare provider.", "url": "https://apnews.com/ff50fc12a69346a48c89f410c6171f09"}