{"authors": ["Justin A. Cohn"], "date_download": "2020-05-04 20:07:58", "date_modify": "2020-05-04 20:07:58", "date_publish": "2019-05-14 05:00:01", "description": "Gary Graham is out as the Komets' coach not because he didn't win : he's the fourth-winningest coach in the franchise's 67-year history and made the playoffs all six of his seasons : but because...", "filename": "_8a0a0413621a4eddbf72fa68de5bf481_1588622878.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8a0a0413621a4eddbf72fa68de5bf481_1588622878.html", "title": "K's play stunk up Coliseum too often", "title_page": "K's play stunk up Coliseum too often", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Gary Graham is out as the Komets’ coach not because he didn’t win : he’s the fourth-winningest coach in the franchise’s 67-year history and made the playoffs all six of his seasons : but because ownership wasn’t happy with the direction of the team.\nWhen the Komets lost this season, they lost badly.\nIf you were to sit down and make a pro/con list of whether or not to keep Graham, a native of Fort Wayne, the points on the pro side would tip the scales: 251-130-51 regular-season record in the ECHL’s toughest division, victories in seven of 13 playoff series, two trips to the conference finals, an understanding of the expectations that come with coaching in Fort Wayne.\nBut anyone who was around the ownership group, namely General Manager David Franke, President Michael Franke and Vice President Scott Sproat, could see their level of frustration was at a point not seen since, oh, Dave Farrish was axed during the 1996-97 season.\nThe Frankes can deal with a certain amount of losing, but they loathe seeing their players stink up the joint when the Coliseum is packed. That happened on more than a few occasions : the worst examples being a 4-3 loss to Brampton in front of 10,233 fans on New Year’s Eve, a 10-8 loss to Kalamazoo in front of 6,782 fans Jan. 16 and an 8-2 loss to Adirondack in front of 8,445 fans Feb. 15 : to say nothing of the 11-0 road loss March 2 to the Toledo Walleye.\nEven when Graham seemed to have maybe righted the ship with a Game 5 victory over the Walleye at the Huntington Center, his fate was sealed with a bad 4-1 season-ending loss at the Coliseum three days later.\nFans often lament Graham’s lack of popularity among the players as the problem, and the players did gripe plenty about him, but Al Sims and Greg Puhalski were equally, if not more, disliked in the locker room and they won six championships between them in Fort Wayne. It’s also worth noting that Shawn Szydlowski, Jamie Schaafsma, Cody Sol and several others kept signing on for more of Graham, so you just can’t always put much stock in that “we hate the coach” narrative.\nUltimately, ownership is holding Graham accountable for poor recruiting last summer, failure to get the most out of his roster,and whether he should have adjusted his tactics more.\nAfter the Komets had lost to the Colorado Eagles in overtime of Game 7 of the 2018 Western Conference finals, other flagship teams were facing rebuilds, too, including Toledo and Florida. But Fort Wayne’s opening roster was undermanned : remember Garret Ross, Garrett Ladd and Thomas Ebbing? : and it took 11 trades and myriad signings to make the team competitive. David Franke deserves some of the recruitment blame, too, and so does assistant coach Ben Boudreau. It should also be noted that the affiliation with the Vegas Golden Knights was laughable, yielding only goaltender Zach Fucale and six games of forward Matthew Weis.\nGraham incessantly talked about turnovers along with penalties and the players’ inability to stick to his game plan. These things weren’t necessarily his fault; the players knew what they were supposed to do and just seemed mentally incapable of doing them. But Graham never seemed to find a system of X’s and Os’ that might have covered up his team’s deficiencies.\nGraham’s bosses didn’t like the look of any of this, especially the 18-13-5 home record, topping out at two five-game winning streaks and playing down to lesser divisional opponents Kalamazoo, Indy and Wheeling.\nI don’t think firing Graham is the right move. He’d done enough to at least finish out the final year of his contract. It feels like a firing for the sake of making a change, not because a definite upgrade has been locked down. Hopefully, the Komets didn’t make the move based primarily on feedback from players who mailed it in one out of every three periods.\nThe Frankes have earned trust when it comes to making coaching decisions, though, even if they can be chided for firing Bruce Boudreau, a future star NHL coach, back in 1994-95. Of the nine coaches they’ve hired, only Farrish was a dud, but even he made the playoffs. The forgettable Pat Bingham was 51-21-4 in his lone season. Most lambasted the hiring of Sims for a second stint with the team in 2007 and he won four championships in six years.\n“If you look at the coaches we’ve had over the years, (they) have gotten us to the playoffs and some have won championships for us,” David Franke said. “Really we’ve missed the playoffs so few times (three times since 1990), that we have the confidence that we can put the right team together with the right coach.”\nI have no doubt Graham is going to be successful soon as an ECHL head coach or American Hockey League assistant.\nThe Frankes are gambling because if their next hire turns in anything less than a terrific regular season and a trip to the second round of the 2020 playoffs, the future will see Graham much more favorably than he’s being seen today.\nJustin A. Cohn, senior writer for The Journal Gazette, has covered Fort Wayne sports since 1997. He can be reached by email at jcohn@jg.net or phone at 260-461-8429. You can also follow him on Twitter@sportsicohn.", "url": "https://apnews.com/8a0a0413621a4eddbf72fa68de5bf481"}