{"authors": ["Erica Moser"], "date_download": "2020-05-04 20:20:12", "date_modify": "2020-05-04 20:20:12", "date_publish": "2019-05-18 05:00:01", "description": "Six elementary schools in southeastern Connecticut have measles, mumps and rubella vaccination rates below 95 percent, the desired threshold set by the Centers for Disease Control and Prevention,...", "filename": "_7ceb3dfd836c4cd49c6a3df0f1a5f812_1588623612.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7ceb3dfd836c4cd49c6a3df0f1a5f812_1588623612.html", "title": "Some local schools fall below vaccination threshold", "title_page": "Some local schools fall below vaccination threshold", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Six elementary schools in southeastern Connecticut have measles, mumps and rubella vaccination rates below 95 percent, the desired threshold set by the Centers for Disease Control and Prevention, according to the most recently available numbers.\nFor public schools in the region, the median MMR vaccination rate was 97.6 percent for kindergarteners and 98.2 percent for seventh-graders in the fall of 2017, per data the state Department of Public Health released earlier this month.\nIt was the first time the department released data at the school level. DPH originally released the data on May 3, then “worked with school officials to identify and correct reporting errors.” This resulted in updated data for 16 elementary and middle schools, released May 10.\n“Parents or guardians of children who cannot get the vaccines for medical reasons need information about children’s school vaccination rates for their children’s protection,” DPH Commissioner Renee Coleman-Mitchell explained to state legislators. State Epidemiologist Matthew Cartter added that there are more measles cases now in the U.S. than there have been in 25 years.\nThe CDC sets a threshold of 95 percent for herd immunity, also known as community immunity, the point at which a “sufficient proportion of a population is immune to an infectious disease ... to make its spread from person to person unlikely.”\nStatewide, the kindergarten vaccination rate for MMR is 96.5 percent, with 102 schools coming in below 95 percent.\nThe alarm from elected officials — Gov. Ned Lamont called the data “startling” — led to the unconventional and controversial scheduling of a public hearing on the possibility of removing the religious exemption for vaccines. Lawmakers announced Friday they would hold off on a potential bill until next year.\nReaction to the data\nThe local public schools with vaccination rates listed below 95 percent were Charles Barnum and Catherine Kolnaski elementary schools in Groton, Integrated Day Charter School and Moriarty Magnet School in Norwich, Harbor School in New London and Oakdale School in Montville.\nThe data was based on what the state collected from schools in the fall of 2017. One complicating factor for Groton, Superintendent Michael Graner said, is the 30-day grace period military families have to submit immunization information to the district. He said some children didn’t have records on file by Oct. 1, 2017, the as-of date for reporting.\nIn response to the data release, Graner said the district is tightening up its registration procedures.\nGroton, East Lyme and Old Lyme each had one elementary school with a kindergarten vaccination rate of 100 percent, while Waterford had two and Norwich had four.\nNorwich Public Schools nursing supervisor Jennifer Ceccarelli said the nurses at those schools informed her they didn’t do anything different to achieve those rates. She said one factor might be that Norwich didn’t see many displaced students who came from other countries with no records in the 2017-18 school year.\n“I’m happy with our numbers, and we’re going to continue to keep a goal with the district to keep them above 95 percent,” she said.\nThe lowest rate in Norwich Public Schools was Moriarty Magnet School, at 93.9 percent.\nIntegrated Day Charter School, which is in Norwich but not part of the district, reported the highest exemption rate of any public school in the region, at 7.9 percent.\nBut that is lower than the schoolwide exemption rates for four private schools with rates ranging from 8.1 percent to 13.6 percent: Pine Point School in Stonington, Wildwood Christian School in Norwich, North Stonington Christian Academy, and Montessori Discovery School in Norwich. The first three schools only had religious exemptions, while Montessori Discovery had a higher share of students with medical exemptions.\nThe state did not report kindergarten or seventh grade vaccination rates for any of these four schools because standards do not allow for the release of data when there are fewer than 30 students in a grade at a school.\nSteve Mansfield, director of health for Ledge Light Health District, said he “was heartened to see that the rates across our district were generally very high,” and he has spoken with officials in Groton and New London, which had schools below 95 percent.\n“I think it’s good that the data has been released,” he said. “Any information that’s out there that provides the public and the school system with information about vaccination rates that may encourage parents to reconsider getting their children vaccinated, or to seek out advice from their primary care provider about vaccinations, is good.”\nBut Mansfield stressed that this data is “a snapshot in time” and may not be an accurate reflection of where schools are today.\nTalk of repealing religious exemption\nMedical exemptions are rare, said Dr. Jody Terranova, immunization representative for the Connecticut chapter of the American Academy of Pediatrics. Some reasons might include being allergic to a vaccine component, being born with an immunodeficiency disorder or undergoing chemotherapy.\nState data shows that the percentage of incoming students claiming a religious exemption increased from 0.3 percent in 2003-04 to 1.5 percent last year, while the share for medical exemptions only rose from 0.2 to 0.3 percent.\nParents do not need to give a reason for the religious exemption on their forms, but many shared their reasons on Monday during a public hearing on the possibility of a last-minute bill to remove the religious exemption. It would have barred children who are not vaccinated for religious reasons from attending public schools.\nTerranova noted that West Virginia, Mississippi and California have removed all nonmedical exemptions, and Oregon and New York are working on doing so, as well.\nAccording to the CDC, 839 measles cases have been confirmed across the nation so far in 2019, and Connecticut is among 23 states with confirmed cases. In New York, Brooklyn and Queens have seen 498 confirmed cases since September, mostly in the Orthodox Jewish community, while there have been three in Connecticut this year.\nSome of the parents testifying in favor of keeping religious exemptions said there is hardly an emergency in Connecticut, with Trumbull resident Barbara Rudini calling the release of data “a witch hunt” that will cause bullying and lawsuits.\nMultiple parents objected to the administration of MMR vaccines, in part, because they contain cell lines from aborted fetal tissue. The CDC lists the MMR-II vaccine as containing “WI-38 human diploid lung fibroblasts.”\nTo this day, the only aborted fetuses ever to be used for vaccine development were two fetuses aborted in the 1960s, when Leonard Hayflick developed the WI-38 cell strain using lung cells from one, according to The College of Physicians of Philadelphia. Vaccines today are prepared with descendant cells, which do not come from aborted fetuses.\nThe position of the National Catholic Bioethics Center is that “the risk to public health, if one chooses not to vaccinate, outweighs the legitimate concern about the origins of the vaccine.”\nConnecticut parents asserted their beliefs are valid even if they’re not tied to any position or organized religion.\n“My religious beliefs tell me that God made my body perfect,” said one mother, who did not provide her full name, “and I was made perfect in his image, and I do not need vaccinations to make me more perfect.”\nA lifelong Democrat, Ariana Fine, said the Democratic Party is “supposedly the party of ‘my body, my choice.’” But Rep. Pat Wilson Pheanious, D-Ashford, responded that she doesn’t see this as a Democratic issue or a Republican issue, but a public health issue.\nRepublican Rep. Noreen Kokoruda agreed with her colleague’s sentiment but said it was wrong of Democratic leadership to circumvent the normal process by calling the hearing.\nHouse Majority Leader Matthew Ritter, D-Hartford, pumped the brakes on Friday, saying he wants more information about how to address unvaccinated children already enrolled in school, and what other remedies exist for what the DPH commissioner called “pockets of vulnerability within our state.”\nThe department has not taken a position on whether there should be a religious exemption, but Ritter said “they need to be more forthcoming with what they think the state of Connecticut needs to do.”\ne.moser@theday.com", "url": "https://apnews.com/7ceb3dfd836c4cd49c6a3df0f1a5f812"}