{"authors": ["Andrew Blake The Washington Times"], "date_download": "2020-05-04 20:08:30", "date_modify": "2020-05-04 20:08:30", "date_publish": "2019-01-16 10:26:04", "description": "Russia \"has no interest in a new arms race,\" President Vladimir Putin said in an interview published Wednesday, albeit while warning the Trump administration against withdrawing the U.S. from a...", "filename": "_85e2cb44ff3d00dc895e3ea09125e3ed_1588622910.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_85e2cb44ff3d00dc895e3ea09125e3ed_1588622910.html", "title": "Putin: Russia has no interest in arms race with U.S., but says grave consequences if Trump ends INF", "title_page": "Putin: Russia has no interest in arms race with U.S., but says grave consequences if Trump ends INF", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Putin: Russia has no interest in arms race with U.S., but says grave consequences if Trump ends INF\nRussia “has no interest in a new arms race,” President Vladimir Putin said in an interview published Wednesday, albeit while warning the Trump administration against withdrawing the U.S. from a landmark weapons agreement.\nMr. Putin made the remarks while discussing the future of the bilateral Intermediate-range Nuclear Forces (INF) Treaty during an interview with Serbian media, according to an English translation released by the Kremlin.\n“Indeed, the United States is basically pursuing a course towards dismantling the system of international agreements on arms control that prevent it from bolstering its military capabilities, or trying to adhere to the agreements selectively, i.e. only insofar as they serve its interests. The declaration of the intention to withdraw from the INF Treaty has become just another step in a sequence of similar actions. It is obvious that such a course will have the gravest consequences,” said Mr. Putin, according to the Kremlin.\n“Naturally, we are not going to turn a blind eye to the deployment of American missiles, which present a direct threat to our security. We will have to take effective countermeasures. However, Russia, as a responsible and sensible country, has no interest in a new arms race,” Mr. Putin added, the Kremlin reported.\nSigned in 1987 by former U.S. President Ronald Reagan and Mikhail Gorbachev, the last leader of the former Soviet Union, the INF required either country to disengage and destroy their short- and intermediate-range missiles and missile launchers, resolving fears of a nuclear war erupting and ultimately paving the way for the Cold War’s conclusion.\nMr. Trump abruptly threatened to withdraw the U.S. from the agreement late last year but has failed to follow through.\n“We’ll have to develop those weapons,” Mr. Trump said in October 2018. “We’re going to terminate the agreement, and we’re going to pull out.”\nReacting to Mr. Trump at the time, Mr. Gorbachev,87, predicted that withdrawing the U.S. from the INF would pose a “dire threat to peace” and initiate “a new arms race.”\nThe White House did not immediately return a request for comment.", "url": "https://apnews.com/85e2cb44ff3d00dc895e3ea09125e3ed"}