{"authors": ["Aimee Arrambide"], "date_download": "2020-05-04 20:05:45", "date_modify": "2020-05-04 20:05:45", "date_publish": "2019-01-16 23:22:11", "description": "Throughout my childhood, my father was an abortion provider in our hometown of San Antonio. What I didn’t realize until much later was that he would put a Kevlar vest over his scrubs because...", "filename": "_2f812ccff2cd490a8cf79dbc0e6daa4e_1588622745.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2f812ccff2cd490a8cf79dbc0e6daa4e_1588622745.html", "title": "Expand base of abortion providers in Texas", "title_page": "Expand base of abortion providers in Texas", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Throughout my childhood, my father was an abortion provider in our hometown of San Antonio. What I didn’t realize until much later was that he would put a Kevlar vest over his scrubs because anti-abortion terrorists threatened and harassed him. Every Friday, he drove hundreds of miles to Laredo and Corpus Christi to provide care for people there.\nNow, decades later, the communities my father traveled to are without clinics entirely. In fact, since 2013, the number of Texas abortion clinics has dropped from 42 to 21. Right now, no abortion clinics are open in the Panhandle, large swaths of South and West Texas, and East Texas, forcing people in some cities to travel 300 miles one-way to get the care they need.\nTo put it simply, Texas is an abortion desert, and this is entirely by design. For the past decade, anti-abortion lawmakers controlling the Texas Legislature have passed dozens of laws intended to chip away at abortion access, with the end goal of making abortion nonexistent in our state. And this year will be no different, despite the gains made in the midterm elections.\nBut the political tide is turning, and the time is now to offer a vision for restoring and expanding access to abortion in Texas.\nTexans who are forced to travel for abortion care rack up significant additional expenses for things such as transportation costs and hotel stays, or in lost wages. Research has also shown that as abortion clinics have shuttered, wait times for appointments have increased, which force patients to delay their care until further into pregnancy, adding even more cost to the procedure.\nBut what if patients could communicate with their physician over phone or video and still access safe, effective abortion care? Enter abortion pills via telemedicine. Advances in technology and medicine mean telemedicine is now lauded as a meaningful solution to gaps in health care access.\nTelemedicine holds the promise that patients in the most rural parts of our vast state can get the basic care they need even if there is no provider in their community. The Texas Legislature acknowledged as much in 2017, passing a sweeping bill that expanded telemedicine in our state. Solely for political reasons, abortion care was specifically excluded.\nFor more than 15 years, medication abortion — a two-pill regimen of mifepristone and misoprostol — has been an FDA-approved, safe method of abortion care up to 10 weeks of pregnancy. In fact, studies have consistently shown that medication abortion via telemedicine is just as safe as a doctor dispensing the pills to a patient in person.\nWe need only look to pilot projects underway in Iowa , Hawaii or Maine for a glimpse of what abortion via telemedicine could look like. A patient would arrive at a medical facility, consult with an abortion provider over video, and then pick up a prescription at a local pharmacy and manage the abortion at home. Research shows medication abortion is extremely safe, but should a patient need follow-up, a provider is only a phone call away.\nAnother commonsense solution to expanding abortion access would be allowing advanced clinicians — such as advanced practice registered nurses, physician assistants or certified nurse midwives — to provide abortion care. Texas is one of the 34 states that require abortions be provided by physicians, but research tells us that many advanced clinicians have the necessary skills and training to also provide abortions.\nIn fact, these so-called “physician-only” laws actually create unnecessary barriers to abortion care, according to a recent study by the National Academies of Science, Engineering, and Medicine. The same study found that abortions provided by advanced practice clinicians are just as safe as those provided by a physician.\nWhat’s more, Texas insurance law recognizes registered nurses as primary health care providers, but again, these same nurses are forbidden from performing a safe health care procedure purely because of politics.\nAs I think about what lies ahead this legislative session, I’m reminded of my father. He put his life on the line every day to ensure Texans could get the abortion care they needed without shame or stigma.\nI look forward to the weeks and months to come, when together with our partners and with Texans who share the belief that each of us should be able to make decisions about our own health care, we offer a vision for a better Texas, where people and their decisions are supported and respected, and they can get the care they need with dignity. Starting with commonsense solutions to expanding access to abortion.\nAimee Arrambide is the executive director of NARAL Pro-Choice Texas.", "url": "https://apnews.com/2f812ccff2cd490a8cf79dbc0e6daa4e"}