{"authors": ["Peter Urban"], "date_download": "2020-05-04 20:25:13", "date_modify": "2020-05-04 20:25:13", "date_publish": "2019-02-28 15:55:43", "description": "WASHINGTON — Leticia Colon de Mejias, the founder of a weatherization and home-energy efficiency business in Windsor, threw her support behind legislation to increase “green energy” job training...", "filename": "_e5ad6583c43041ccb972a28cfa3db0d5_1588623913.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e5ad6583c43041ccb972a28cfa3db0d5_1588623913.html", "title": "CT businesswoman pushes Congress for ‘green energy’ job training", "title_page": "CT businesswoman pushes Congress for ‘green energy’ job training", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WASHINGTON — Leticia Colon de Mejias, the founder of a weatherization and home-energy efficiency business in Windsor, threw her support behind legislation to increase “green energy” job training opportunities during testimony Wednesday on Capitol Hill.\n“When we enhance the ability of our businesses to invest in employees, and when we as a nation invest in our youth in a way that prepares them to meaningfully contribute to the energy economy of the future, we all win,” she told members of the House Commerce and Energy Committee.\nColon de Mejias testified before the Energy Subcommittee along with a panel of other witnesses who generally agreed that Congress should pass legislation to increase job training resources in the growing green energy field particularly for women, minorities, and the military. Under consideration is HR 1315, the “Blue Collar to Green Collar Jobs Development Act of 2019,” which was introduced last week by Energy Subcommittee Chairman Bobby Rush of Illinois.\nRush, a Democrat, has promoted similar legislation in previous years including a bill that cleared the House last year by voice vote but was not taken up in the Senate. His newly drafted bill, however, is drawing Republican opposition this year because it excludes the fossil fuel and nuclear energy industries from participating unlike the previous legislation.\n“I was disappointed to learn Republicans were cut out of the process,” said Rep. Richard Hudson, R-N.C. “It is not all-the-above. It excludes fossil, nuclear and manufacturing and falls well short of the agreement we had in the last Congress.”\nRush said he introduced the new bill last week with the objective of “putting as many Americans to work in good paying green energy jobs as possible.” He noted that low-income individuals, minorities, women, and returning veterans often find it difficult to take advantage of current training programs.\nHis bill, HR 1315, would set aside $1 billion over 10 years for the Department of Energy to establish and carry out a comprehensive, nationwide energy-related industries jobs program focused on solar, wind, and other renewable energy sources and energy efficiency.\nRep. Fred Upton of Michigan, the ranking Republican on the panel, said he has “serious concerns” that the bill “picks winners and losers” and has potential to waste taxpayer dollars.\nColon de Mejias, who testified in her role as policy chair for the Connecticut Energy Workforce Consortium, said she has heard “countless energy business owners explain the difficulties they have in hiring staff that have the proper credentials and training required to work in the energy industry.” Many of these businesses are small, including her own, which employs 22 people. Rush’s bill she said would address that by providing assistance to businesses that are seeking to educate and train new hires and existing employees in the energy efficiency and renewable energy industries, she said.\nColon de Mejias, CEO and owner of Energy Efficiencies Solutions and founder/co-chair of Efficiency For All (EFA), said she was also pleased the bill gives priority to businesses that recruit employees from local communities, minorities, women, and veterans.\n“These are often the hardest working people in our society, who already have a vested interest in bettering their communities. With the proper training, they can excel at positions in the clean energy economy, improving not just their own community, but the nation more broadly,” she said.\nIn her prepared testimony that submitted to the panel, Colon de Mejias highlighted a number of priorities:\nWe should strengthen and more fully engage the Department of Energy programs and national labs in carrying out the Department’s Minorities in Energy Initiative.\nWe should implement direct assistance (including financial assistance awards, technical expertise, and internships) to educational institutions, local workforce development boards, State workforce development boards, nonprofit organizations, labor organizations, and apprenticeship programs.\nWe should establish a clearinghouse to maintain and update information and resources on training and workforce development programs for energy-related jobs; Develop a comprehensive understanding of the workforce needs of energy-related industries and job opportunities by State and by region and publish an annual report on job creation in the energy-related industries.\nWe should solicit input from the Secretaries of Education, Commerce, Labor, the National Science Foundation, and energy-related industries to develop best practices and grade-specific guidelines for teaching energy efficiency and conservation initiatives to educate students and families.\nWe should take special care to engage underserved populations and give special consideration to increasing outreach to minority-serving institutions and training providers and make resources available with the objective of increasing the number of skilled minorities and women trained for jobs in energy-related industries; Encourage additional opportunities for MSI students to participate in industry internships and cooperative work-study programs; Partner with the national laboratories to increase underrepresented groups’ participation in internships, fellowships, traineeships, and employment opportunities.\nWe should give special consideration to increasing outreach to employers and job trainers preparing displaced and unemployed energy workers for emerging energy-related jobs; make resources available to institutions serving displaced and unemployed energy workers with the objective of increasing the number of individuals trained for jobs in energy-related industries.\nAmong others on the panel, Gilbert Campbell of Volt Energy, a clean energy development, said he is a “strong supporter” of the bill saying that all Americans should benefit from the growth of clean energy by making critical investments in workforce training in “underrepresented and rural communities.”\nVien Truong, president of Dream Corps in Oakland, Calif., told the panel that it is time “for bold leadership” to help transition to a “new green economy.” She noted that jobs in the solar industry are expanding creating a need for a skilled workforce.", "url": "https://apnews.com/e5ad6583c43041ccb972a28cfa3db0d5"}