{"authors": ["Cnn Staff"], "date_download": "2020-05-04 16:52:56", "date_modify": "2020-05-04 16:52:56", "date_publish": "2019-01-21 13:18:39", "description": "The 2020 election Democratic field is taking shape, with candidates revealing their intentions on a seemingly everyday basis. View the list of who is running for president.", "filename": "2019_01_21_politics_2020-democrats-running-for-president_index_1588611176.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200110173052-0110-2020-dem-power-rankings-january-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2019_01_21_politics_2020-democrats-running-for-president_index_1588611176.html", "title": "Joe Biden is the only Democrat left running for president. These are the others who were once in the race.", "title_page": "2020 Democratic presidential candidates: Joe Biden is the only Democrat left running for president. These are the others who were once in the race. - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The 2020 Democratic presidential primary field is down to one. Sen. Bernie Sanders has ended his presidential campaign, leaving only former Vice President Joe Biden remaining from the once-crowded pack.\nHere's an updated look at all the candidates who were once in the race.\nAnnounced campaigns\nAGE: 77\nSTATE: Delaware\nKNOWN FOR: Biden's long-anticipated announcement marks his third presidential campaign after he passed on a 2016 run. His name recognition, decades of experience and ties to former President Barack Obama are seen as his greatest assets. But his track record on -- and public response to -- making some women uncomfortable with his behavior could be an obstacle to gaining modern voters, some of whom may also think that the party needs new, more diverse representation.\nJUST WATCHED Bernie Sanders announces 2020 presidential run Replay More Videos ... MUST WATCH Bernie Sanders announces 2020 presidential run 00:56\nDropped out\nAGE: 55\nSTATE: Colorado (Dropped out February 11, 2020)\nKNOWN FOR: Bennet, the former superintendent of Denver Public Schools, was forced to hold off on entering the race following a diagnosis and subsequent treatment of prostate cancer in April. Having served in the Senate since 2009, Bennet pitched himself in pre-campaign appearances and speeches as a pragmatic lawmaker who has a progressive voting record. Bennet's candidacy sputtered from the outset, with the Colorado senator failing to qualify for the majority of Democratic debates or to gain traction among voters in key states.\nJUST WATCHED Sen. Michael Bennet jumps in 2020 presidential race Replay More Videos ... MUST WATCH Sen. Michael Bennet jumps in 2020 presidential race 01:58\nAGE: 77\nSTATE: New York (Dropped out on March 4, 2020)\nKNOWN FOR: The former New York mayor entered the race in late November as a moderate alternative to Biden, highlighting his extensive experience as NYC's mayor and the campaign funds he put toward key Democratic issues such as the climate crisis and gun control in past elections. His campaign briefly gained traction amid Biden's early struggles, but he faltered after widely criticized debate performances and questions over his past support for stop-and-frisk policing practices . He dropped out after he only won the American Samoa in the critical Super Tuesday contests.\nJUST WATCHED Michael Bloomberg: From entrepreneur to politician Replay More Videos ... MUST WATCH Michael Bloomberg: From entrepreneur to politician 01:47\nAGE: 50\nSTATE: New Jersey (Dropped out January 13, 2020)\nKNOWN FOR: Booker, who gained national recognition during his tenure as Newark's mayor before being elected to the US Senate, ran for president aiming to restore a sense of community and mend the moral fabric of America. But his fundraising paled in comparison to that of the top-tier Democratic candidates, limiting his capacity to expand his campaign team and advertise on television.\nJUST WATCHED Who is Cory Booker? Replay More Videos ... MUST WATCH Who is Cory Booker? 01:18\nAGE: 53\nSTATE: Montana (Dropped out December 2, 2019)\nKNOWN FOR: Bullock, who served as Montana's attorney general before being elected governor in 2012, failed to convince the party's base that the best way to defeat Trump was by nominating someone who can win in a red state. Bullock, who is term-limited as governor, will not take on Republican Sen. Steve Daines in 2020, his spokeswoman said.\nJUST WATCHED Montana Gov. announces 2020 run Replay More Videos ... MUST WATCH Montana Gov. announces 2020 run 01:56\nAGE: 38\nSTATE: Indiana\nKNOWN FOR: Known locally in South Bend, Indiana, as \"Mayor Pete,\" Buttigieg served as a naval officer in Afghanistan. Buttigieg's run was historic . He is the first openly gay man to launch a competitive campaign for president, and he broke barriers by becoming the first gay candidate to earn primary delegates for a major party's presidential nomination. He ended his campaign on March 1, 2020 after his performances in Nevada and South Carolina, two states where Buttigieg finished significantly behind the race's front-runners.\nAGE: 45\nSTATE: Texas (Dropped out January 2, 2019)\nKNOWN FOR: The son of a Chicana activist, Castro served as mayor of San Antonio in 2009 and served as secretary of Housing and Urban Development in the Obama administration. The only Latino in the 2020 field, Castro ran an unabashedly progressive campaign over the last year, staking out left positions on issues like immigration, housing and policing. But the former secretary failed to gain traction in the large field of Democratic candidates and struggled to raise enough money to stay solvent.\nJUST WATCHED Julian Castro announces presidential bid Replay More Videos ... MUST WATCH Julian Castro announces presidential bid 01:10\nAGE: 58\nSTATE: New York (dropped out September 20, 2019)\nKNOWN FOR: The two-term New York mayor has enjoyed success on several largely progressive issues such as universal pre-K, raising the minimum wage and a low murder rate during his tenure. But he failed to resonate in the polls and was criticized for neglecting his duties as mayor to run for president, most notably during a brief blackout in Manhattan in July which happened when he was campaigning in Iowa.\nAGE: 56\nSTATE: Maryland (dropped out January 31, 2020)\nJUST WATCHED Rep. shares combat perspective on Iraq Replay More Videos ... MUST WATCH Rep. shares combat perspective on Iraq 02:21\nKNOWN FOR: A self-made businessman, Delaney at one point was the youngest CEO on the New York Stock Exchange. Delaney was the first candidate to officially enter the race when he declared his candidacy in July 2017, but he failed to gain name recognition and make his moderate message break through.\nRep. Tulsi Gabbard\nAGE: 38\nSTATE: Hawaii (dropped out March 19, 2020)\nAGE: 53\nSTATE: New York (dropped out August 28, 2019)\nKNOWN FOR: Gillibrand, who centered her campaign on women's equality, ended her White House bid in late August as she was on the cusp of failing to qualify for the third Democratic primary debate. Her campaign saw her embrace increasingly progressive stances on immigration and gun control that ran counter to positions she had held when running for the House. Despite Gillibrand's high profile position, she failed to break out from the crowded primary field, with her campaign polling under 1% nationally when she exited the race.\nJUST WATCHED Sen. Kirsten Gillibrand joins race for president Replay More Videos ... MUST WATCH Sen. Kirsten Gillibrand joins race for president 01:58\nAGE: 55\nSTATE: California (dropped out December 3, 2019)\nKNOWN FOR: Harris, a former California state attorney general and the daughter of Jamaican and Indian immigrants, held progressive stances supporting \" Medicare for All \" and marijuana legalization . The senator, who struggled to energize her campaign in recent months, acknowledged that she was forced to unexpectedly drop out because of money. \"I'm not a billionaire. I can't fund my own campaign. And as the campaign has gone on, it's become harder and harder to raise the money we need to compete,\" she said.\nJUST WATCHED A look at Sen. Kamala Harris' political career Replay More Videos ... MUST WATCH A look at Sen. Kamala Harris' political career 03:40\nAGE: 67\nSTATE: Colorado (dropped out August 15, 2019)\nKNOWN FOR: As the head of Colorado from 2011 to 2019, Hickenlooper helped steer the state through several tragedies , including the 2012 shooting in a movie theater in Aurora that left 12 people dead and catastrophic wildfires and floods in 2013. Hickenlooper, who framed his candidacy around stemming the leftward lurch of the Democratic Party, dropped out in mid-August and launched his Senate campaign.\nJUST WATCHED Hickenlooper ends 2020 presidential bid Replay More Videos ... MUST WATCH Hickenlooper ends 2020 presidential bid 01:26\nAGE: 68\nSTATE: Washington (dropped out August 21, 2019)\nKNOWN FOR: Inslee, who has held elected office for much of the last three decades, has been an outspoken progressive executive since he became governor in 2013. He has been a vocal opponent of President Donald Trump, including suing the President after he tried to ban immigration from several Muslim-majority countries. Inslee dropped out as it appeared he wouldn't make the stage for the third round of debates. A day after he exited the 2020 race, Inslee announced he would seek a third term as Washington's governor.\nJUST WATCHED Washington Gov.: Not a moment for climate 'timidity' Replay More Videos ... MUST WATCH Washington Gov.: Not a moment for climate 'timidity' 13:55\nSen. Amy Klobuchar\nAGE: 59\nSTATE: Minnesota (dropped out March 2, 2020)\nKNOWN FOR: Klobuchar announced her run outdoors as it snowed, which she tied to her commitment to a \"homegrown\" campaign with \"grit.\" The Minnesota moderate looked to work across the aisle and win back fellow working-class Midwesterners. But her path to the nomination all but closed after she posted sixth place finishes in Nevada and South Carolina, a sign that the Minnesota senator's surprising showing in New Hampshire would not be nearly enough to propel her towards the nomination.\nJUST WATCHED Amy Klobuchar officially announces 2020 run Replay More Videos ... MUST WATCH Amy Klobuchar officially announces 2020 run 01:40\nAGE: 45\nSTATE: Florida (dropped out November 20, 2019)\nKNOWN FOR: The child of Jamaican immigrants, Messam is a first-generation American and first black mayor of Miramar. His campaign held progressive views on guns, immigration and the environment. He was part of a group that sued the state of Florida in 2018 over a law that restricted his ability to create municipal gun regulations after he wanted a new amphitheater in his city to be a \"gun-free venue.\" Despite failing to gain traction in his bid for the Democratic presidential nomination, Messam said, \"my state of Florida will be ground zero and I intend to be a factor to mobilize our state for the Democratic Party nominee.\"\nJUST WATCHED Florida mayor announces 2020 presidential bid Replay More Videos ... MUST WATCH Florida mayor announces 2020 presidential bid 01:37\nAGE: 41\nSTATE: Massachusetts (dropped out August 23, 2019)\nKNOWN FOR: Moulton, a Marine veteran and three-term congressman , raised his national profile after trying and failing to prevent House Speaker Nancy Pelosi from reclaiming the speaker's gavel. He later voted for her after Democrats retook the House last year. Moulton's run for president lasted four months and ended in August after he failed to gain traction or make the Democratic debates. He plans to run for reelection to Congress and relaunch a PAC that aims to elect Democrats with service backgrounds.\nJUST WATCHED Why 2020 candidate Seth Moulton reads 'Where's Spot?' Replay More Videos ... MUST WATCH Why 2020 candidate Seth Moulton reads 'Where's Spot?' 01:38\nAGE: 49\nSTATE: West Virginia (dropped out January 25, 2019)\nKNOWN FOR: A former Army paratrooper, Ojeda served for 24 years , earning the rank of major and serving in both Iraq and Afghanistan. A 2016 Trump voter , he focused on school finance reform and issues facing the middle class before dropping out of the race in late January.\nAGE: 47\nSTATE: Texas (dropped out November 1, 2019)\nJUST WATCHED Beto O'Rourke drops out of 2020 presidential race Replay More Videos ... MUST WATCH Beto O'Rourke drops out of 2020 presidential race 01:30\nAGE: 63\nSTATE: Massachusetts (dropped out February 12, 2020)\nKNOWN FOR: Patrick, a two-time governor of Massachusetts, announced a late entry to the race in November 2019, reversing a previous decision to stay out. He hoped his regional connections in New England and appeal as the last African American candidate would give him a boost in the early voting states of New Hampshire and South Carolina. But ultimately, he was unsuccessful in raising money and breaking through as a moderate candidate in a crowded field.\nAGE: 46\nSTATE: Ohio (dropped out October 24, 2019)\nKNOWN FOR: Ryan, whose district includes Youngstown, Ohio, entered the presidential race as a long-shot candidate with less name recognition than most candidates and a far smaller political network. He dropped out in late October after failing to gain momentum and announced he would run for reelection to the House of Representatives. He has become most known in Democratic circles for his opposition to House Speaker Nancy Pelosi retaining her leadership positions, though he later voted for her when Democrats elected her speaker earlier this year.\nSen. Bernie Sanders\nAGE: 78\nSTATE: Vermont (dropped out April 8, 2020)\nKNOWN FOR: Sanders' democratic socialist platform gained significant traction during the 2016 primaries, when the independent senator who caucuses with Democrats ran against Hillary Clinton. His policy agenda includes various progressive proposals, many of which have been embraced by the Democratic Party, like expanding health care, broadening the social safety net and making higher education free. Sanders dropped out in early April, clearing Biden's path to the Democratic nomination.\nJUST WATCHED Tim Ryan explains why he's entering the 2020 race Replay More Videos ... MUST WATCH Tim Ryan explains why he's entering the 2020 race 01:25\nAGE: 68\nSTATE: Pennsylvania (dropped out December 1, 2019)\nKNOWN FOR: Sestak, who ascended to become a 3-star admiral in the US Navy during a 31-year military career prior to his election to the House of Representatives in 2006, entered an already-crowded Democratic primary field in June hoping to leverage his naval career into a successful presidential campaign. He represented Pennsylvania's 7th District until mounting a pair of ultimately unsuccessful campaigns for the Senate in 2010 and 2016, respectively.\nPhotos: Former presidential candidate Joe Sestak Former US Rep. Joe Sestak speaks to supporters while running for the US Senate in 2016. He is joined by his wife, Susan, and their daughter, Alex. Hide Caption 1 of 14 Photos: Former presidential candidate Joe Sestak Sestak spent 31 years in the US Navy and was second in his class at the US Naval Academy. He was on the National Security Council during the Clinton administration, serving as director for defense policy. Hide Caption 2 of 14 Photos: Former presidential candidate Joe Sestak Sestak ran for Congress in 2006 and defeated Republican incumbent Curt Weldon. Hide Caption 3 of 14 Photos: Former presidential candidate Joe Sestak Sestak is joined by his wife, Susan, and House Speaker Nancy Pelosi during his mock swearing-in. He was re-elected in 2008. Hide Caption 4 of 14 Photos: Former presidential candidate Joe Sestak Sestak campaigns with Democratic presidential candidate Hillary Clinton in April 2008. Hide Caption 5 of 14 Photos: Former presidential candidate Joe Sestak In August 2009, Sestak speaks during a forum at the Veterans Multi-Service Center in Philadelphia. He had recently announced his candidacy for the US Senate. Hide Caption 6 of 14 Photos: Former presidential candidate Joe Sestak Sestak and former US Rep. Pat Toomey take part in a town-hall meeting in Allentown, Pennsylvania, in September 2009. Toomey, a Republican, defeated Sestak in the 2010 Senate race. Hide Caption 7 of 14 Photos: Former presidential candidate Joe Sestak Sestak speaks to Democrats in Doylestown, Pennsylvania, in January 2010. Hide Caption 8 of 14 Photos: Former presidential candidate Joe Sestak Sestak holds his daughter, Alex, in May 2010. Hide Caption 9 of 14 Photos: Former presidential candidate Joe Sestak Sestak looks over papers in his office in May 2010. Hide Caption 10 of 14 Photos: Former presidential candidate Joe Sestak President Barack Obama campaigns with Sestak in September 2010. Hide Caption 11 of 14 Photos: Former presidential candidate Joe Sestak Sestak speaks at a campaign event in West Chester, Pennsylvania, in October 2010. Hide Caption 12 of 14 Photos: Former presidential candidate Joe Sestak Sestak meets with supporters at a campaign office in Philadelphia in November 2010. Hide Caption 13 of 14 Photos: Former presidential candidate Joe Sestak Sestak also ran for the Senate in 2016 but lost in the Democratic primary. Hide Caption 14 of 14\nAGE: 62\nSTATE: California (dropped out February 29, 2020)\nKNOWN FOR: Steyer has operated as a funding force in Democratic politics in recent years, bankrolling candidates and organizations that promote liberal causes, including the impeachment of Trump. The billionaire businessman exited the race after he failed to claim victory in South Carolina, a state he invested heavily in, hoping it would turn around his sputtering run. \"I said if I didn't see a path to winning that I'd suspend my campaign. And honestly, I can't see a path where I can win the presidency,\" he said.\nAGE: 39\nSTATE: California (dropped out July 8, 2019)\nKNOWN FOR: The Democrat who represents California's 15th Congressional District entered the race as a long-shot candidate in a crowded field. A frequent critic of the Trump administration, Swalwell raised his profile by becoming a staple on cable television. He focused on combating gun violence, and traveled to Iowa in December with Cameron Kasky, who's a survivor of the 2018 shooting at Marjory Stoneman Douglas High School in Parkland, Florida, and a co-founder of March for Our Lives.\nJUST WATCHED Swalwell kicks off presidential run focused on gun reform Replay More Videos ... MUST WATCH Swalwell kicks off presidential run focused on gun reform 00:45\nAGE: 70\nSTATE: Massachusetts (dropped out March 5, 2020)\nKNOWN FOR: Warren was appointed as assistant to President Barack Obama and special adviser to the Treasury secretary in order to launch the Consumer Financial Protection Bureau. She was also appointed to a congressional oversight panel overseeing the $700 billion Trouble Assets Relief Program that was passed in response to the 2008 financial crisis. Warren centered her bid on a promise to wipe out corruption in Washington but ended her campaign following another round of disappointing finishes in primary contests across the country on Super Tuesday.\nJUST WATCHED Warren to face obstacles as she eyes 2020 bid Replay More Videos ... MUST WATCH Warren to face obstacles as she eyes 2020 bid 02:25\nAGE: 67\nSTATE: Texas (dropped out January 10, 2020)\nKNOWN FOR: Williamson is best known for being a spiritual counselor to Oprah Winfrey and has written several best-selling books, including her debut \"A Return to Love.\" She called for \"a moral and spiritual awakening in the country\" with her campaign, but acknowledged on January 10, 2020 , that her effort will \"not be able to garner enough votes in the election to elevate our conversation any more than it is now.\"\nJUST WATCHED Presidential candidate calls for moral awakening in US Replay More Videos ... MUST WATCH Presidential candidate calls for moral awakening in US 01:31\nAGE: 45\nSTATE: New York (Dropped out February 11, 2020)\nKNOWN FOR: Yang is an entrepreneur who launched Venture for America, a fellowship program that aims to connect recent grads with startups. He wanted to give all Americans a universal basic income of $1,000 per month to address economic inequality. While Yang overperformed what many experts believed he would accomplish in the Democratic primary, his devoted following -- known as the Yang Gang -- was unable to propel him beyond Iowa and New Hampshire, defeats that largely thwarted the candidate's rise.\nDecided not to run\nFormer Georgia House Minority Leader Stacey Abrams (took herself out of consideration on August 13, 2019)\nAGE: 46\nSTATE: Georgia\nSen. Sherrod Brown (took himself out of consideration on March 7, 2019)\nAGE: 67\nSTATE: Ohio\nKNOWN FOR: A liberal populist, Brown won three terms in Ohio, a state that has been trending Republican in recent years. Brown would've offered Democrats a candidate who could reconnect with voters in the Midwest. Before deciding not to run, he had embarked on a \"listening tour\" that included stops in the four key early voting states in the 2020 primary.\nFormer Attorney General Eric Holder (took himself out of consideration on March 4, 2019)\nAGE: 69\nSTATE: New York\nKNOWN FOR: Holder served as President Barack Obama's attorney general until 2015. Holder had told several Democrats -- and \"The Late Show\" host Stephen Colbert -- that he was \"interested\" in pursuing the nomination, but ultimately he opted not to launch a campaign.\nFormer Secretary of State John Kerry (took himself out of consideration on June 10, 2019)\nAGE: 76\nSTATE: Massachusetts\nKNOWN FOR: Kerry served on the Cabinet during President Barack Obama's second term. Prior to that, he spent 28 years representing Massachusetts in the Senate, and was the 2004 Democratic presidential nominee. During an interview with Sky News, he ruled out another presidential run, saying he was \"delighted\" that Biden had gotten into the 2020 race.\nFormer Virginia Gov. Terry McAuliffe (took himself out of consideration on April 17, 2019)\nAGE: 62\nSTATE: Virginia\nKNOWN FOR: McAuliffe previously served as governor of Virginia and chairman of the Democratic National Committee and has an extensive fundraising network. He opted instead to help coordinate the campaigns of Virginia's local and national Democratic lawmakers \"to make sure that we are blue\" for 2020.\nSen. Jeff Merkley (took himself out of consideration on March 5, 2019)\nAGE: 63\nSTATE: Oregon\nKNOWN FOR: Merkley, the junior senator from Oregon, has focused on holding the Trump administration accountable on immigration policy, specifically family separations at the southern border. He opted in March to devote himself to his Senate re-election campaign over the next two years.\nUPDATE: This story has been updated to reflect CNN's official tally of the major Democratic candidates running for their party's nomination for president.", "url": "https://www.cnn.com/2019/01/21/politics/2020-democrats-running-for-president/index.html"}