{"authors": ["Luke Savage", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Branko Marcetic"], "date_download": "2020-05-04 19:54:51", "date_modify": "2020-05-04 19:54:51", "date_publish": "2019-08-01 00:00:00", "description": null, "filename": "2019_08_joe-biden-democratic-debate_1588622091.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/01014621/GettyImages-1165423553.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_joe-biden-democratic-debate_1588622091.html", "title": "Joe Biden Was a Trainwreck in Last Night’s Debate", "title_page": "Joe Biden Was a Trainwreck in Last Night’s Debate", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "At last night’s Democratic debate in Detroit, the second of two this week, Joe Biden predictably emerged as the primary target of attacks from his rivals. And for good reason. From his longstanding deference to corporate interests to his unreliable record on reproductive rights, his zealotry for militarism abroad and his indefensible role in authoring brutal mass incarceration and “tough-on-crime” policies, the former vice president is a living avatar for everything wrong with the way career centrist Democratic insiders do politics.\nNotably, Sen. Kirsten Gillibrand hammered him for a 1981 op-ed in which he claimed that federal subsidies for childcare would cause “the deterioration of family.” New York Mayor Bill de Blasio also hit Biden for a recent speech to a group of wealthy donors in which he declared “nothing would fundamentally change” if he were president, then seizing another moment to demand he answer for the record number of deportations that occurred during his tenure in the Obama administration.\nEven Sen. Cory Booker, whose generally insufferable schtick as the field’s happy warrior largely spurns negativity, demanded Biden stop hiding behind his former boss and take some responsibility for a change: “Mr. Vice President, you can’t have it both ways. You invoke President Obama more than anybody in this campaign. You can’t do it when it’s convenient and then dodge it when it’s not.”\nTo say Biden handled the relentless attacks on his record poorly is an understatement. Stammering at times and often trailing off as he faced a barrage of criticism from all sides, the current frontrunner mostly fell back on his favorite and apparently only defense: reciting the words “Barack Obama” ad nauseum. By night’s end, Biden’s teflon sincerity had run so thin that even the pundits assembled in CNN’s post-debate spin room were conceding he’d been diminished by the affair.\nBut the debate also exposed key Biden rivals like Booker and Sen. Kamala Harris to criticism they didn’t seem particularly prepared to weather. Despite a general leftward rhetorical shift across the Democratic field, Biden is hardly the only figure who lacks credibility when it comes to appropriating progressive language — particularly on issues related to healthcare and criminal justice reform.\nRep. Tulsi Gabbard noted Harris’s recent past as an avowedly tough on crime Attorney General in California, also chastising her for attempting to appease private insurance interests around Medicare for All. Booker also fielded uncomfortable questions about his record on policing and “stop and frisk” while Mayor of Newark.\nWhile Biden deserved every salvo his rivals fired, the bottom line is that very few Democratic candidates are credibly equipped to indict any of the others over a history of triangulation. In this way, last night’s debate ultimately served to put the party’s craven malleability and two-facedness on full display.\nThank God the candidates it platformed aren’t the only game in town.", "url": "https://jacobinmag.com/2019/08/joe-biden-democratic-debate"}