{"authors": ["Tracy Maness"], "date_download": "2020-05-04 20:10:15", "date_modify": "2020-05-04 20:10:15", "date_publish": "2019-03-12 05:00:00", "description": "From a bright yellow shipping container in Montrose, Café Bustelo is serving up Latin coffee, caffeine buzzes and community now through May 25. Although the weather was gray and drizzly, the...", "filename": "_83afde71c67e4edcbfe4d62ee0566c60_1588623015.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_83afde71c67e4edcbfe4d62ee0566c60_1588623015.html", "title": "Café Bustelo pop-up brings Latin coffee to Montrose", "title_page": "Café Bustelo pop-up brings Latin coffee to Montrose", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "From a bright yellow shipping container in Montrose, Café Bustelo is serving up Latin coffee, caffeine buzzes and community now through May 25.\nAlthough the weather was gray and drizzly, the pop-up coffee shop opened on Tuesday, March 12, at 3615 Montrose Blvd. to a crowd of coffee enthusiasts who braved the elements to get their morning perk.\nKnown for its espresso-style Latin coffee packaged in yellow canisters, Café Bustelo was founded in 1928 by Spanish entrepreneur Gregorio Bustelo. He moved to New York and then discovered Latin America while traveling with the United States Merchant Marine.\n“He fell in love with the culture, with the coffee, and he brought it back to New York,” said Café Bustelo Senior Brand Manager Eduardo Merino.\nBustelo liked the coffee so much that he made a business out of it starting from a Latin community in East Harlem.\nMore than 90 years later, Merino said the coffee brand’s first fully operational coffee shop is a “dream come true” with two main objectives. The first, he said, is increasing brand awareness as people experience their culture and try their coffee with pairings like pastelitos and empanadas. But Merino said building relationships within the community is also key.\nFor that purpose, Café Bustelo is giving a portion of the shop’s proceeds to MECA Houston (Multicultural Education and Counseling through the Arts) and HACU (Hispanic Association of Colleges and Universities) to further educational programs in the Houston area.\nAlso, Merino said all the shop’s baristas live in the Houston area and that local artists helped to give the coffee shop its unique and attractive look. Muralist Armando Castelan painted the large mural on the back of the shop and said the Montrose neighbors made the project a fun experience.\n“The community, the neighborhood especially, people would stop by and realize that I was actually painting on the container, and they would ask me some questions about the process,” he said. “So that was pretty cool, and then I was getting free coffee the whole time. So that kept me going.”\nCastelan said he appreciated that Café Bustelo opted to support local art instead of just using a big decal.\nCourtney Jones waited among the crowd to receive her coffee order. A teacher that lives in the neighborhood, she wandered into the shop on her spring break, unaware it was opening day and thinking the place would be empty. Jones didn’t seem to mind the wait though and said she was looking forward to trying a drink she originally started ordering during a year she spent in Miami.\n“I haven’t really found a place since moving back to Houston that I like their café con leche, so I thought I’d try it,” Jones said.\nArtist Shelbi Nicole collaborated with artist GONZO247 to create a mural for a shop Café Bustelo opened for a couple of days last fall to test things out. She came out to the grand opening of the latest shop to show her support and of course to have some joe from her favorite coffee brand.\n“I’m just here to support it, and I love their coffee,” Nicole said. “I think that I love that it’s so strong. It’s really bold. It’s different. It keeps me going all day when I’m painting long hours.”\nMoreno said plans are in the works for the pop-up shop to debut in other cities, but details are not yet available.\nIn the meantime, the pop-up coffee shop will be open every day from 7 a.m. 4 p.m. now through Saturday, May 25, at 3615 Montrose Blvd.\ntracy.maness@hcnonline.com", "url": "https://apnews.com/83afde71c67e4edcbfe4d62ee0566c60"}