{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:12:32", "date_modify": "2020-05-04 20:12:32", "date_publish": "2019-05-16 07:20:25", "description": "WARREN TODD CLINE, 51, of Huntington, W.Va., formerly of South Williamson, Ky., passed away on May 13, 2019, in the Emogene Dolin Jones Hospice House in Huntington following a lingering illness....", "filename": "_03cf1d3a36064cebaf314d35e7361fbc_1588623152.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_03cf1d3a36064cebaf314d35e7361fbc_1588623152.html", "title": "WARREN TODD CLINE", "title_page": "WARREN TODD CLINE", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WARREN TODD CLINE, 51, of Huntington, W.Va., formerly of South Williamson, Ky., passed away on May 13, 2019, in the Emogene Dolin Jones Hospice House in Huntington following a lingering illness. Born June 29, 1967, in South Williamson, Ky., he was a beloved son of Brisey Hatfield Cline of Huntington and the late Herbert B. “Hub” Cline Jr. In addition to his father, he was preceded in death by a brother, Rodney E. Cline. Todd grew up in the Martin and Pike county areas of Kentucky. He loved spending time outdoors in the majestic, mountainous region of eastern Kentucky that he called home. As the love of basketball was seemingly inborn in the Cline family, and standing 7 feet tall, Todd spent most of his youth playing basketball with his brothers and friends. He was a graduate of Sheldon Clark High School where he was an All-State basketball player. He was the 1986 captain of the All-Area basketball team, and in 1985 he broke the scoring record at the Arby’s Classic, scoring 43 points. He went on to play college basketball at Liberty University and he had also attended Fork Union Military Academy. While Todd will be sorely missed, he will also be lovingly remembered. A multitude of happy memories of days gone by will remain in the hearts of all who knew and loved him and shared his life. In addition to his mother, Todd is survived by a son, Herbert William Cline and his wife Samantha; a daughter, Heaven Grace Cline; two brothers, Herbert B. “Butch” Cline III and his wife Shannon and Mark Cline and his wife Nancy; a sister, Sandra Cline; a sister-in-law, Frances Jewell Cline; several nieces and nephews; extended family members; and his longtime and devoted companion, Kimila Hall. Visitation is on Thursday evening, May 16, 2019, from 6 to 9 p.m. at Weaver Mortuary, West Williamson, W.Va. Funeral services will be conducted at 11 a.m. Friday, May 17, at the mortuary. Reverend Bill Evans will officiate. Interment is in the Cline Family Cemetery at Middle Fork, Inez, Ky. Pallbearers include Michael Brewster, Mark Cornette, Mernie Gilliam, Michael Hylton, Argie Jeffers, Rod May, Donovan Slone and Tom Taylor. You may express online condolences at www.weavermortuaryinc.com. Weaver Mortuary of West Williamson is serving the Cline family.", "url": "https://apnews.com/03cf1d3a36064cebaf314d35e7361fbc"}