{"authors": ["Marina Starleaf Riker"], "date_download": "2020-05-04 20:24:26", "date_modify": "2020-05-04 20:24:26", "date_publish": "2019-05-09 18:33:11", "description": "A man accused of killing a San Antonio Police detective in 2016 lost an attempt to get out of jail during a court hearing Thursday. Judge Ron Rangel of 379th Criminal District Court denied...", "filename": "_f15c77e2afa8423dbf783761cdb0353f_1588623866.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f15c77e2afa8423dbf783761cdb0353f_1588623866.html", "title": "Judge denies accused San Antonio cop killer’s request to get out of jail", "title_page": "Judge denies accused San Antonio cop killer’s request to get out of jail", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Judge denies accused San Antonio cop killer’s request to get out of jail\nA man accused of killing a San Antonio Police detective in 2016 lost an attempt to get out of jail during a court hearing Thursday.\nJudge Ron Rangel of 379th Criminal District Court denied Otis Tyrone McKane’s request for a personal recognizance bond, which requires no money. He is currently held under $2 million bail, which requires a bond of $200,000.\nMcKane, 33, is currently awaiting trial on one count of capital murder of a police officer, accused of shooting Detective Benjamin Marconi on Nov. 20, 2016.\nOn ExpressNews.com: In jailhouse interview, McKane says he’s been ‘demonized’\nDuring Thursday’s hearing, McKane’s attorneys argued that prosecutors weren’t ready for trial and that neither McKane, nor his family, could afford his original $2 million bond.\nThe state’s attorneys disagreed, arguing that McKane shouldn’t be granted bail. In Texas, bail is a constitutional right — except in capital murder cases.\nThe court hearing came just days after Bexar County District Attorney Joe Gonzales announced that he would seek the death penalty for McKane.\n“When I ran for district attorney in 2018, I promised the citizens of Bexar County that I would seek the death penalty only in the worst of the worst cases,” he said in the statement. “The facts of this case meet that standard.”\nOn ExpressNews.com: San Antonians mourn slain San Antonio police officer\nMarconi, 50, was working overtime on patrol and had pulled over a motorist in front of Public Safety Headquarters around 11:45 a.m. on a Sunday. He was sitting inside the squad car when a man approached and shot him twice in the head.\nMcKane was spotted on security camera video at the headquarters on the day of the shooting. The next day, he was spotted on video entering the Bexar County Courthouse to get married.\nAuthorities apprehended McKane about 28 hours after the slaying. He claimed he was upset about a child custody battle and that he lashed out by killing the 20-year SAPD veteran, according to previous reports.\nMarina Starleaf Riker is an investigative reporter for the San Antonio Express-News with extensive experience covering affordable housing, inequality and disaster recovery. Read her on our free site, mySA.com, and on our subscriber site, ExpressNews.com. | marina.riker@express-news.net | Twitter: @MarinaStarleaf", "url": "https://apnews.com/f15c77e2afa8423dbf783761cdb0353f"}