{"authors": ["Times-Tribune Readers"], "date_download": "2020-05-04 20:10:33", "date_modify": "2020-05-04 20:10:33", "date_publish": "2019-01-12 00:00:00", "description": "No noise wall fights Editor: Why is it we can spend billions on noise walls along our highways? The government has built more than 3,000 linear miles of sound walls to protect homes...", "filename": "_31d2c13a9efe4caeb5ffbbaa57fd5dd5_1588623033.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_31d2c13a9efe4caeb5ffbbaa57fd5dd5_1588623033.html", "title": "Letters To The Editor 1/12/2019", "title_page": "Letters To The Editor 1/12/2019", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "No noise wall fights\nEditor: Why is it we can spend billions on noise walls along our highways?\nThe government has built more than 3,000 linear miles of sound walls to protect homes from traffic noise.\nSome of these walls are estimated to cost up to $2 million per mile. In Butler County, Ohio, a gigantic wall averaging 16 feet in height snakes along a 6-mile section of Route 129. It has been there nearly 20 years, protecting residents from the roar of cars and trucks on the road. The noise barrier cost nearly $9 million. It is just one of the 147 sound walls in Ohio, which reportedly spent $417 million on sound walls along 232 miles of highways and interstates. Indiana spent $135.7 million on walls. These are just a few states to spend on sound walls. There are many more.\nThis brings us to President Trump’s proposed border wall. Anyone can see how political this wall issue has become. People who represent us care less for the people.\nThey just want power. They are not adults, just children doing everything to try to have it their way.\nEMIL KONZMAN\nCLIFFORD TWP.,\nSUSQUEHANNA COUNTY\nWrongly targeted\nEditor: Once again, Times-Tribune editors attack the NRA (“End NRA’s policymaking,” Dec. 17).\nThe newspaper seems to be for every antigun policy, without any reason, logic, or facts to back up that support. Where is the reason or logic behind supporting a proposal, from Democrat Rep. Dan Frankel, “to allow local governments to establish local gun laws to protect public health?” What logic would allow 2,500 Pennsylvania municipalities to pass their own gun laws? What is perfectly legal in one town may be a misdemeanor or felony in the next. Does that make sense?\nIf the newspaper was truly interested in protecting public health, it would side with the NRA. Some studies suggest guns help prevent crime and save lives more often than they are used to commit violence.\nMurder and violent crime peaked in this country in the early 1990s. By 2014 the murder and violent crime rates in this country were less than 50 percent what they were in 1993. Many states eased their gun laws during this time.\nOne state that toughened its gun laws during this time period was California. The Violence Prevention Research Center at UC Davis and the Johns Hopkins Bloomberg School of Public Health conducted a study of the gun suicide and gun murder rate in California in the 10 years after California enacted comprehensive background checks and misdemeanor violence prohibition policies.\nThe study found that the firearm suicide rate fell at the same rate as the nonfirearm suicide rate over the 10 years. The study also found “no net difference between firearm-related homicide rates before and during the 10 years after policy implementation.”\nKEITH MacDONALD\nOLYPHANT\nEditor’s note: The study results cited by the writer conflict with findings from studies that associate comprehensive background check policies with reduced firearm homicide and suicide rates in Connecticut and increased incidence of firearm homicides and suicides after background checks were repealed in Missouri.\nClose coverage gaps\nEditor: When you can’t breathe, nothing else matters.\nPatients with asthma need access to quality and affordable health care to obtain the medications and treatments necessary to manage their disease and live healthy lives.\nMedicaid is an especially important program for asthma patients, as half of all kids with asthma in the United States get their health insurance coverage through Medicaid or the Children’s Health Insurance Program.\nThe American Lung Association urges the Pennsylvania General Assembly’s newest members to make improving health care in the commonwealth a top priority this new session.\nPennsylvania’s medical assistance program needs to improve its coverage so that people with asthma can breathe easier. Pennsylvania doesn’t cover treatments that doctors recommend, including providing consistent coverage of long-term controller medications and barriers such as prior authorizations and step therapy limitations. The General Assembly should work to close these gaps during the 2019 legislative session.\nSARAH LAWVER\nAMERICAN LUNG ASSOCIATION,\nCAMP HILL,\nCUMBERLAND COUNTY\nHypocritical nation\nEditor: Let’s look at the faces of the New Democratic Party, such as Michigan U.S. Rep. Rashida Tlaib and New York U.S. Rep. Alexandria Ocasio-Cortez.\nHas anything really changed on the Democratic side? No, voters have just added to the trash by electing these people. How many on the Democratic side stand up for Americans?\nDid President Obama and President Clinton not say we needed a wall on our southern border? There are two sides to every story and Republicans are to blame as well.\nThe media has made a big thing about election of Muslims to Congress and this has been a disaster. I think it shows that Tlaib is not an American but maintains her culture. As for the Hispanic Ocasio-Cortez, what can be said except that it shows what the voters of New York think of America.\nWe need limited terms and a morals clause for members of Congress. How many members of our government are honest and support our country? America has become a hypocritical nation and we pay for it.\nHAYDN EVANS\nSCOTT TWP.\nNo immigration halt\nEditor: This is a response to the recent editorial about the need for immigrants (“Kids, decency die at border,” Jan. 2).\nNobody is saying to stop immigration.\nThe need to keep anyone at anytime from entering the country is real. Why do people who come here through airports need passports and to be vetted if they want to apply for citizenship? Why not just open up areas of the country?\nAnyone who thinks that we need all the immigrants we can get to save the country is stupid.\nMICHAEL J. BARROWS\nWAVERLY\nCurb climate impact\nEditor: The Arbor Day Foundation states that planting more trees could help offset extreme weather changes.\nTrees are the great mediators of our weather. The average tree holds 200 gallons of water. Without trees the water goes straight from the ground to the sky and may come back down almost as fast. It is not climate change but tree change that is causing this effect.\nThe president should mention this at the next State of the Union address: Plant trees and you will see real climate change. Thank President Trump for everything he does for our country .\nTHOMAS FITZGERALD\nCLARKS SUMMIT\nTRIBUNE NEWS SERVICE PHOTO ILLUSTRATION", "url": "https://apnews.com/31d2c13a9efe4caeb5ffbbaa57fd5dd5"}