{"authors": ["Luke Savage", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Tim Higginbotham", "Chris Maisano", "Meagan Day", "Carl Beijer"], "date_download": "2020-05-04 19:55:01", "date_modify": "2020-05-04 19:55:01", "date_publish": "2019-08-28 00:00:00", "description": null, "filename": "2019_08_bernie-sanders-2020-presidential-campaign-election-plan-movement_1588622101.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/28150437/GettyImages-1169828801.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_bernie-sanders-2020-presidential-campaign-election-plan-movement_1588622101.html", "title": "Bernie Sanders Has a Plan - But He’s Also Building a Movement", "title_page": "Bernie Sanders Has a Plan — But He’s Also Building a Movement", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Do voters favor wonkery or personality?\nThat’s the choice facing Democrats, according to a recent piece in the Washington Examiner by GOP consultant Liz Mair, which contrasts Elizabeth Warren’s policy-focused campaign with the Biden camp’s emphasis on personality. Unsurprisingly, the op-ed largely dismisses Bernie Sanders — leading the field nationally alongside Warren, according to a Monmouth poll released earlier this week — devoting only a single sentence to the claim: “[Warren’s] policies are almost indistinguishable from Sanders’s, yet [are] better spelled-out and more detailed.”\nThe conservative bona fides of its author notwithstanding, this framing of the race has also gained considerable traction among liberal pundits and talking heads who increasingly perceive the difference between Sanders and Warren as one of wonkish policymaking versus nonspecific political grandstanding. That was the narrative advanced by former Hillary Clinton staffer Zerlina Maxwell on MSNBC this week, where she claimed:\nBernie Sanders is excellent at explaining what the problem is . . . at laying out all of the different things that are wrong structurally in this country . . . and then he stops talking. And I’m always listening for solutions and specifics. Warren doesn’t stop talking.\nIt’s a puzzling narrative, to say the least, given the many proposals released by Sanders and his campaign — no less expansive and detailed than those floated by Warren.\nIn the past ten days alone, the Vermont senator has unveiled plans for a $16.3 trillion Green New Deal designed to transition the US economy to renewable energy by 2050, and a comprehensive Workplace Democracy initiative that aims to empower American workers and strengthen trade unions. Earlier this week, he used an op-ed in the Columbia Journalism Review to pitch a series of ideas and proposals designed to combat corporate media consolidation and foster a more independent press. Prior to these, his campaign had already tabled detailed plans for the creation of a universal Medicare-for-All system, sweeping reform of the criminal justice system, and the elimination of existing student debt, to name just a few.\nClaims that Sanders eschews specifics or is vague on the details don’t hold up to even the most basic scrutiny, but they are fast-becoming the fulcrum of an emerging campaign narrative for many pundits and talking heads. The way some are keen to frame it, Sanders isn’t really big on “plans” at all — a perplexing take to have on a candidate that visibly has quite a few. As Commonweal ’s Matt Sitman recently observed: “Bernie is dropping plan after plan and not getting much wonk love. Turns out ‘having a plan’ messaging is not about the plans.”\nIt’s an unfortunate, though admittedly predictable, development given the uncharitable treatment reserved for Sanders in the mainstream media. But it’s also a revealing one, in that it ignores what is arguably the most critical and innovative feature of his campaign: namely, an analysis of how embedded interests and powerful actors obstruct transformative change and a strategy for building the necessary popular pressure to defeat them.\nThe details or mechanics of various policy initiatives aside, what’s at stake in the 2020 election cannot ultimately be summed up in the form of “plans” or whose campaign has the most of them. Given the number of candidates in the running, the presidential field hardly wants for policy ideas as it is — there are plenty currently on the table, some of which are good and many of which are bad.\nBut, as the Obama presidency demonstrated, any Democrat entering the White House will face a host of obstacles even when they wield a legislative majority and bend over backward to find consensus and reassure corporate America of their moderate intent. No matter what the composition of the next Congress turns out to be, even the most lukewarm of plans will inevitably be opposed by oligarchs, business interests, and the innumerable lawmakers who receive bottomless donations from both. Given that reality, the only viable course for those seeking sweeping and necessary political change is direct confrontation with these interests and the mobilization of massive popular pressure as a counterweight against them.\nSanders understands this, which is why he identifies the actors opposed to his various plans — Wall Street, the Walton family, the fossil fuel industry — at every opportunity. It’s also why his campaign has gotten directly involved in frontline struggles like teachers’ strikes and even used its resources to direct supporters to pickets. When Sanders talks about building a movement, it’s not mere branding or political window dressing, but rather the strategy underlying all of his plans and policies made explicit. The specific nuts and bolts of policy ideas or the merits of different proposals aside, this theory of political change is what most distinguishes Sanders from the rest of the Democratic field.\nAs he himself put it at the end of the first televised debate in June:\nI suspect people all over the country who are watching this debate are saying, these are good people, they have great ideas. But how come nothing really changes? How come for the last forty-five years wages have been stagnant for the middle class? How come we have the highest rate of childhood poverty? How come 45 million people still have student debt? How come three people own more wealth than the bottom half of America? . . . Nothing will change unless we have the guts to take on Wall Street, the insurance industry, the pharmaceutical industry, the military-industrial complex, and the fossil fuel industry.\nWhile mainstream pundits are keen to frame the primary contest as a policy arms race, no plan or series of plans, however progressive or well thought out, can become a reality in America today without an unprecedented popular movement behind them. That’s because the most pressing issues facing Americans are less puzzles to be solved than they are injustices to be overcome — not by way of plans alone, or by the election of any single candidate as president, but through large-scale popular organization and mass action from empowered citizens and workers.\nSanders, unique among those seeking the Democratic nomination, makes this explicit with his favorite campaign slogan: “Not me. Us.”", "url": "https://www.jacobinmag.com/2019/08/bernie-sanders-2020-presidential-campaign-election-plan-movement"}