{"authors": ["Elizabeth Zavala"], "date_download": "2020-05-04 20:18:05", "date_modify": "2020-05-04 20:18:05", "date_publish": "2019-05-23 13:50:11", "description": "The maternal grandparents of King Jay Davila, the San Antonio baby whose body was found buried in a backpack in January, are expected to be in court Thursday in an attempt to regain custody of...", "filename": "_76ba884a0508470e8f6d1ef062c71de5_1588623485.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_76ba884a0508470e8f6d1ef062c71de5_1588623485.html", "title": "Hearing in San Antonio may decide where King Jay’s siblings live", "title_page": "Hearing in San Antonio may decide where King Jay’s siblings live", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The maternal grandparents of King Jay Davila, the San Antonio baby whose body was found buried in a backpack in January, are expected to be in court Thursday in an attempt to regain custody of their grandchildren after they were abruptly removed from their home May 13.\nKing Jay, 8 months, initially was reported as kidnapped by Christopher Davila, believed to be the boy’s father who was responsible for the child at the time. San Antonio police believe he lied about the abduction to cover up circumstances of the baby’s death. He later told authorities that the boy died after falling from a carseat that had been on a bed in Davila’s home, and then led them to his body.\nDavila is charged with injury to a child by omission, felon in possession of a firearm, drug possession and tampering with evidence. His mother, Beatrice Sampayo, and his cousin, Angie Torres, are accused of participating in the cover-up and also are charged with tampering with evidence.\nOn ExpressNews.com: CPS removes King Jay’s siblings from grandparents\nChild Protective Services caseworkers removed King Jay’s four brothers May 13 from Josephine and Fernando Yee, the mother and stepfather of Jasmine Gonzales, the boys’ mother. The couple had cared for them since they were young, and were placed with them in January after the King Jay’s death.\nThe children, between the ages of 8 and 2, were removed because of a “genuine and strong belief that the children may be at imminent risk,” according to a CPS statement released at the time. The removal of the four apparently has “no additional ties” to the death of King Jay, spokeswoman Mary Walker said at the time.\nGonzales recently gave birth to another child by Christopher Davila, a son and sibling of King Jay’s, who was placed in CPS custody May 10 after authorities removed him from the hospital, a CPS spokeswoman confirmed.\nOn ExpressNews.com: Bombshell drops in court over King Jay’s real father\nIn a bizarre twist, Gonzales testified in April that Davila was not King Jay’s biological father, although Davila has maintained King Jay was his. Another man, Martin Gonzales III, the estranged husband of Jasmine Gonzales, reached out to an Express-News reporter and claimed that King Jay was his son.\nThe CPS case is being heard in Children’s Court.\nElizabeth Zavala covers county and state courts in San Antonio. Read her on our free site, mySA.com, and on our subscriber site, ExpressNews.com. | ezavala@express-news.net | Twitter: @elizabeth2863", "url": "https://apnews.com/76ba884a0508470e8f6d1ef062c71de5"}