{"authors": ["Claire Bessette"], "date_download": "2020-05-04 20:05:45", "date_modify": "2020-05-04 20:05:45", "date_publish": "2019-02-13 05:00:01", "description": "When Bill Kowalski started as the new state municipal electric consumer advocate in January 2018, he was troubled by wording in the bylaws of the Connecticut Municipal Electric Energy Cooperative...", "filename": "_3c96fc8d473647cfadee3a1a9e409803_1588622745.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3c96fc8d473647cfadee3a1a9e409803_1588622745.html", "title": "Electric ratepayer advocate warned of potential CMEEC legal costs", "title_page": "Electric ratepayer advocate warned of potential CMEEC legal costs", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "When Bill Kowalski started as the new state municipal electric consumer advocate in January 2018, he was troubled by wording in the bylaws of the Connecticut Municipal Electric Energy Cooperative he warned could leave CMEEC with expensive legal bills to defend any official involved in criminal or civil suits.\nThat fear appears to be coming to fruition, with a federal judge’s ruling last week that CMEEC must pay advanced legal expenses to former Chief Financial Officer Edward Pryor, one of five officials indicted Nov. 8 on federal corruption charges connected with CMEEC’s hosting of lavish trips to the Kentucky Derby for four years and a trip in October 2015 to a West Virginia golf resort.\nPryor filed a federal civil lawsuit demanding that CMEEC cover his legal costs in the criminal defense. CMEEC didn’t contest the ruling but reserved the right to challenge it in the future.\nCMEEC has received invoices from the firm of Finn, Dixon and Herling, representing Pryor for 9,148.19.\nCMEEC CEO Drew Rankin, Pryor, Bilda and former CMEEC board members James Sullivan of Norwich and Edward DeMuzzio of Groton were charged with one count each of conspiracy and three counts each of theft from a program receiving federal funds for their roles in the trips to the Kentucky Derby and the golf resort. Rankin and Sullivan face the same charges in a second indictment for CMEEC’s reimbursement of nearly 370,000 for the cooperative’s response to FBI subpoenas during the two-year investigation.\nKowalski spent months negotiating with CMEEC officials to try to tighten the so-called indemnification language in the bylaws. During that time, Rankin and Pryor held their CMEEC positions, and Bilda was a voting CMEEC board member. Three other CMEEC board members had attended the trips.\nOne day after the indictments, Rankin and Pryor were placed on unpaid leave, and Bilda was removed from the board. Pryor retired Jan. 1, and the Norwich utilities commission approved a separation agreement with Bilda Jan. 22.\nAlthough changes to the indemnification language in the CMEEC bylaws finally were approved on Oct. 9, 2018, one month before the indictments, the actions cited in the criminal case occurred under the previous broad indemnification language.\n“It’s unfortunate that the changes are forward-looking,” Kowalski said Tuesday, meaning the revisions are not retroactive. “Sometimes you see something that’s troublesome.”\n“We carefully evaluate requests for advancement of legal fees, and going forward will do so in the additional light of the court’s order with regard to Mr. Pryor, including reserving the right to contest the advancement of legal fees at a future date,” CMEEC Interim CEO Mike Lane wrote in a statement issued Friday in response to the court ruling in Pryor’s civil suit.\nLast summer, all five CMEEC officials under investigation and later indicted signed an “Affirmation and Undertaking” statement saying each felt they acted: “in good faith and in a manner that I reasonably believed to be in, or not opposed to, the best interests of CMEEC, and I had reasonable belief that my conduct was lawful.”\nThe second paragraph said, “if it is ultimately determined” the person is not entitled to indemnification, “I will promptly repay CMEEC on request for the amounts of legal fees, expenses and other costs that CMEEC has advanced or reimbursed on my behalf for legal fees and expenses.”\nPrior to the changes, the bylaws called for the cooperative, owned by six municipally owned utilities, to cover all costs and expenses in defense of “any claim, action, suit or proceeding” derived from their positions as CMEEC board members or officers. The revisions inserted the word “reasonable” for legal costs and attorney fees and put a cap on CMEEC’s expenses if a settlement is reached and the party rejects it.\nKowalski said he had submitted several options for new language — not all accepted — during the back-and-forth revisions with CMEEC officials. “I think once this is done, we need to revisit it,” he said.\nKowalski’s position was created in a 2017 state law in response to the Kentucky Derby controversy. When he started in January 2018, the FBI was a year into its criminal investigation of CMEEC’s finances in connection with the derby trips.\n“Objected to proposed revisions of CMEEC Bylaws,” Kowalski wrote in his first quarterly report at the end of March 2018, “relating to indemnification of employee and director expenses for litigation or administrative action expenses arising from employee or director wrongdoing which breaches the Code of Ethics or is illegal; Held multiple meetings and communications with CMEEC General Counsel re: same.”\nIn an Aug. 2 letter to the editor to The Day, Kowalski wrote that he was continuing to negotiate for stronger language to reduce potential future legal liabilities to CMEEC, realizing the changes would not be retroactive.\n“But because bylaws are prospective in nature, changes to them now cannot reverse expenses that have already been incurred,” Kowalski wrote. “However, if adopted, these changes could help reduce excessive legal expenditures in the future. That would reduce CMEEC administrative overhead, leaving more revenue to flow to CMEEC member utilities and their downstream ratepayers.”\nc.bessette@theday.com", "url": "https://apnews.com/3c96fc8d473647cfadee3a1a9e409803"}