{"authors": ["Steve Fraser", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Branko Marcetic", "Richard Walker", "Daniel Aldana Cohen"], "date_download": "2020-05-04 19:49:49", "date_modify": "2020-05-04 19:49:49", "date_publish": "2019-06-30 00:00:00", "description": null, "filename": "2019_06_new-deal-great-depression_1588621789.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/30084425/GettyImages-3329220-web.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_new-deal-great-depression_1588621789.html", "title": "The New Deal in the American Political Imagination", "title_page": "The New Deal in the American Political Imagination", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\n“We are in a new era to which I do not belong.” So confided ex-president Calvin Coolidge to a close friend on a cold December day in 1932. He punctuated that melancholic thought a few weeks later by dying. Coolidge was right. Within months of his death, the New Deal would begin the recreation of the American political universe. From that moment to this one, the New Deal has served as the ground zero of the country’s political imagination. It is the Rosetta stone for understanding every enduring political development of the last seventy-five years. Harry Truman’s Fair Deal and Lyndon Johnson’s Great Society were conceived as elaborations of what the New Deal had wrought. Neoliberalism and New Conservatism were invented to undo the damage. Today, the Green New Deal marks the far horizon of the left-liberal imagination. For those opposed, the Green New Deal, like the original one, is a camouflage for socialism. Both sides of this divide are touched by irony. Once, during the 1960s, that era’s New Left considered the New Deal a form of corporate co-optation. We’re a long way from that now. A half century of deregulation, evisceration of the labor movement, shredding of the social safety net, and privatization worked wonders. So that now even the most elementary forms of the New Deal order seem to the contemporary left as visionary, if not infeasible. In the meantime, those who subscribe in theory to laissez-faire economics and the free market — the liberalism of the nineteenth century — in real life rely on all the forms of state support for private enterprise pioneered by the New Deal. Nearly a century has gone by, and the New Deal continues to function as an inspiration for the Left and as the bête noire of the Right. Both sides share a myth: that the New Deal was anti-capitalist. While confrontations occur on dozens of battlefields, the war itself is about that. And the myth, like all durable myths, carries its own truth. America has endured two civil wars. The first was about slave labor and was fought to a bloody resolution. The second was about wage labor and ended in compromise. The New Deal was the outcome of the previous half century when, in the words of President Woodrow Wilson, “The question which stands at the front of all others amidst the present great awakening is the question of labor.” Soon after the Civil War, the country was nearly ripped apart once again by a new civil war, a war of the many against the few, the haves against the have-nots, the exploiters against the exploited. Many feared that the nation was becoming “two nations,” that a new “irreconcilable conflict” must end either in a capitalist autocracy or a cooperative commonwealth. Looking back, the New Deal might be seen as the living repudiation of that ominous prophecy — or, depending on which side you were on, that exhilarating foretaste of emancipation. Under the most trying circumstances, the New Deal worked out a historic compromise. What in the Gilded Age was frowned upon as “wage slavery” would become universal. Capitalism and democracy could coexist so long as capitalism operated under surveillance. But for those there at the creation, when American capitalism was undergoing a near-death experience, no one could foresee the outcome. All the combustible anti-capitalist desires that had accumulated from the Gilded Age to the Great Depression were still alive and well. Indeed, they would go on to provide much of the energy that made the New Deal possible. At the time, however, who knew where they might end up? Moreover, even once it became clear that capitalism would survive, no one could predict with confidence just how far into the interior of the free market state regulation might intrude — especially if historical circumstances changed, which they inevitably would. That unknown would continue to enliven the Left and scare the Right. Capitalist democracy was the enduring achievement of the New Deal. It has oscillated ever since between intimations of social democracy on the one hand, and free market absolutism on the other. But capitalism has remained in the driver’s seat. Private capital accumulation is the previously existing condition, the axiomatic given, constraining all overtures at economic and social reform. For that reason, the New Deal falls short of the Left’s consoling delusion that social democracy might lie somewhere just over the horizon of a reinvigorated New Deal. For that reason, the capitalist democracy of the New Deal is also not the existential threat the Right purports it to be. And for that reason as well, the New Deal as a historic compromise is always a work in progress, inherently unstable, drawn first this way and then that way, a devil’s dilemma putting under pressure both camps of the social entente. Only in hindsight does the New Deal seem to be the inevitable, if not the foreordained, resolution of the country’s bitter class antagonisms. If more fundamental challenges to capitalism tout court circulated through American society at that time, a mystery remains: what became of them? How were they transposed — if they were transposed and not simply eliminated — so as to become part of the political and cultural infrastructure of a renewed capitalism? What does that historical alchemy suggest about existing and future oppositions to the reconfigured capitalism of twenty-first century America?\nThere at the Creation Except for the Civil War, the Great Depression was the most traumatic experience in the history of the United States. In an American culture that normally lives in the windowless room of the current event, the economic devastation of the 1930s and the New Deal which tried to repair it remain to this day deeply imprinted on the national psyche. The recent Great Recession is only called that as an implicit comparison to what unforgettably befell the nation seventy-five years earlier. The national income was halved in three years beginning with the stock market crash in 1929. One quarter of the workforce (about fifteen million people) was unemployed in 1933. Joblessness had tripled in those same three years. In fact, if we leave out of account people employed in one way or another in agriculture, unemployment amounted to an astounding 37 percent. In industrial cities like Toledo, the number was a surreal 80 percent. Of the 75 percent of the national workforce actually employed, one third could only get part-time work, so in reality only one-half of the active laboring population did so on a full-time basis. The payroll of full-time workers at United States Steel went from 25,000 in 1929 to zero in early 1933. Industrial construction practically evaporated, plunging from $449 million to $74 million in 1932. Manufacturing output dropped 39 percent between 1929 and 1933. Thirteen million bales of cotton went unsold in 1932, while food crops rotted in the fields and cattle were slaughtered by the millions. Five thousand banks had failed by the time Franklin Roosevelt took office in March of 1933. Exports bottomed out a level not seen since 1904. The money supply, thanks in part to mass hoarding by ordinary people terrified by the banking crisis, had fallen by one-third between 1929 and 1933, aggravating what was already a crushing price deflation that affected everything from home prices to wages. So, for example, 80 percent of the stock market’s values in 1929 had vaporized by 1933. The Dow Jones average shrank from 381 in September 1929 to a nearly invisible forty-one at the beginning of 1932. Six hundred thousand properties, including not only farms but also urban and rural residences, were in foreclosure. In early 1933, thirty-six of forty key economic indicators had arrived at the lowest point they were to reach during the whole eleven grim years of the Great Depression. Panics and depressions were hardly new; they had occurred every twenty years or so, beginning with a severe one in 1837. But what no previous bust or slump had ever produced a foreboding sense that the whole system of production and distribution had reached a state of terminal breakdown. Poverty had long since lived side by side with plenty. Now it seemed, however, that those parallel lines had converged — that plenty, a toxic excess of wealth, had produced poverty. Moreover, the nation’s political institutions seemed implicated as well, either by virtue of a decade’s worth of crony capitalism or by their inaction and ineptitude in the early years of the slump. Whether democratic protocols could be maintained in the face of such a catastrophic emergency was by no mean self-evident. Inevitably, the cultural authority of those figures in the media, in politics, in the academy, in the church, and above all, in business, who had spent the previous decade celebrating the “new era” of permanent prosperity, was now at a deep discount. All in all, this constituted the makings of a true crisis of confidence and legitimacy. At first, fear mixed with disorientation. As weeks became months and months turned into years of bitter disappointment and frustration, fear, guilt, and denial gave way to more muscular emotions. Anger, a thirst for revenge, a giddy camaraderie of the disinherited, and even on occasion, a perverse sense of liberation, formed a psychic united front that vastly overmatched the dwindling cultural resources of the old order. “The stock market crash was to count for us,” Edmund Wilson reported, referring to his fellow artists, writers, and intellectuals, “almost like a rending of the earth in preparation for the Day of Judgment.” That rending sound could be intoxicating. “Yet to the writers and artists of my generation who had grown up in the Big Business era and had always resented its barbarism . . . these years were not depressing but stimulating. One couldn’t help being exhilarated at the sudden and unexpected collapse of that stupid gigantic fraud. It gave us a new sense of freedom, and it gave us a new sense of power to find ourselves still carrying on while the bankers, for a change, were taking a beating.” It was as if the whole country awoke from a delirium. Writers from the Left like Wilson, but also from the Right and center, took note. Wilson was part of a group of writers and intellectuals, including John Dos Passos, Malcolm Cowley, Langston Hughes, and Lincoln Steffens, who issued a manifesto that endorsed the Communist Party candidate for president in 1932 “in the interests of a truly human society in which all forms of exploitation have been abolished; in behalf of a new cultural renaissance.” An editor at the Baltimore Sun confirmed that for the vast middle class, the romance and idolization of the great men of business was over. Pare Lorentz, whose documentary filmmaking became a vital part of the Depression era’s populist aesthetic, declared that “the great American game of starting over from scratch is definitely over.” John Dewey, philosopher and political activist, wrote about “The Collapse of the Romance,” an exhausted faith that somehow gambling unleashed human energies and hidden springs of economic good times. Conservative economist Virgil Jordan pronounced “the sacred bull is dead.” That “potent symbol of the economic millennium,” which, according to Jordan, had replaced the eagle as the nation’s favorite emblem, had now betrayed a worshipful citizenry. Popular culture — movies, plays, cartoons, songs, novels, comic one-liners, editorials, even painting and poetry — overflowed with ridicule and rage aimed at the ancient regime. All this added up to a dawning realization of a ruling class’s unfitness to rule. Walter Lippman decried the woeful state of the American leadership class, a class educated for success but not “to exercise power,” living from day to day, governing if at all in impromptu fashion, obeyed but without authority. Material misery all by itself need not lead to political daring and radical imagination. If the Great Depression leveled the ground and opened up radical political and social possibilities, it was due to that misery plus this conviction that the country’s bankruptcy was also the bankruptcy of an elite, of all its beliefs and traditions, its presumptions and sense of entitlement. Every nightclub punchline and lampooning cartoon, each literary satire and poetic belittlement, the whole flood of iconoclastic biographies, cinematic excommunications, and editorial jeremiads whittled away the puissance of the old ruling class. A ruling elite may survive a reputation for imperial aloofness; indeed, under the right circumstances a reputation for disinterested cruelty may even enhance an impression of impregnability and social superiority. What is harder to weather is a popular conviction that the ancient regime is not only narrow-mindedly selfish, disingenuously conflating its own well-being with society’s, but foolish, deluded, frail, and inept. An indigenous rebelliousness showed itself before Roosevelt was elected, before any of the New Deal’s initiatives had even been conceived. It took many forms. Farmers took to the fields and roads in shocking displays of lawlessness. All across the corn belt, rebels banded together to forcibly prevent evictions of fellow farmers. According to Milo Reno, president of the Farm Holiday Association, the real culprit for the massive misery of the nation’s agrarians was the system of heartless usury run out of Wall Street. A wholesale housecleaning was called for to “break the grip of Wall Street and the international bankers on our government.” Nor were its concerns confined to the farm belt; the Holiday movement demanded a sharply progressive income tax and relief for the urban unemployed and for the federal government to run the banks. The Association, its membership close to a million, created a virtual moratorium on foreclosures from the Rockies to Appalachia in the winter before FDR took over. Demonstrations at state capitols in Iowa, Nebraska, and Minnesota, among others, led legislatures to declare moratoria or extensions on overdue mortgage payments. In the South, tenants and sharecroppers unionized and conducted what a Department of Labor study called a “miniature civil war.” Factory occupations, urban street battles, violent strikes in the South, mass marches of the unemployed, seizures of mines and public utilities by the freezing and desperate, squatting on vacant land and in unoccupied houses, and blocked foreclosures and evictions in big cities were all symptomatic of a more general readiness to trespass across lines of authority and private property that had long been verboten. Veterans of World War I massed in Washington to demand the government accelerate payment of service pensions; the Bonus Army was dispersed violently by troops led by Douglas McArthur and Dwight Eisenhower, ordered in by President Hoover. From the restive ranks of unemployed councils emerged what later became known as the Lundeen bill (named for the Farmer-Labor Party congressman from Minnesota and sometimes known as the “Workers Bill”), proposing federal insurance for all those unemployed, covering health care as well, and funded by a progressive tax on incomes over $5,000, which was to be administered by elected workers’ councils. In Detroit, tenants and unemployed councils stopped all evictions in 1931. Some councils were integrated, some won the support of the Urban League, and some demanded fourteen weeks of unemployment insurance for maternity leave. Pre–New Deal strikes especially in the textile belt in the Carolinas were defeated, but displayed the outsized influence of small radical groups, communists, socialists, and “wobblies,” among others. Anti-capitalist political rumblings stretched from Huey Long’s attack on the petrochemical and landed elites of Louisiana to Father Charles Coughlin’s social justice radio outbursts in Michigan, decrying the international banking fraternity. Long proposed confiscating all income above a threshold, somewhere between $600,000 and $1.8 million, and a guaranteed homestead allowance of three to five thousand dollars and pensions for everyone over sixty. Upton Sinclair’s End Poverty in California movement promised to replace capitalism with something like a cooperative commonwealth. Among its more inventive proposals: to settle a million people on unused land; to operate idled factories at public expense, bartering what they produced; to provide pensions to all those needy and over sixty years old. For his trouble, Sinclair was vilified by the old guard as an epileptic, a red, an atheist, and an advocate of free love. In the Midwest farmer-labor parties were gestating. Eastern intellectuals formed embryonic third parties, including the League for Independent Political Action, which advocated massive income redistribution. The Socialist Party led by Norman Thomas remained stoutly anti-capitalist, although its influence was rapidly diminishing. Membership in the Communist Party, on the other hand, began to grow. And both parties issued calls for public ownership of basic resources and for the socialization of credit. All of this and more was well underway before FDR took the oath of office.\nWhat Is to Be Done? Revolution was never on the New Deal agenda. Still, in the early days, intimations of radical reform showed up even in the regime’s inner circles. Public works, for example, took many forms and were a recurring feature of the administration’s economic recovery strategy. Some of this bordered on state-directed and managed investment, what one historian called “a massive governmental recapitalization for purposes of economic development,” some of it aimed at creating “long-term markets by building infrastructure in underdeveloped regions,” like the TVA in Appalachia. There were New Deal insiders like Rexford Tugwell and Henry Wallace who foresaw the inevitability of collectivism, a concordat of business, labor, and the state that would “plan production.” Harold Ickes talked about the “irreconcilable conflict” between “the power of money and the power of the democratic instinct” and feared “big business and the coming of a Fascist America — an enslaved America.” Infant bureaucracies of the new order felt the heat. Within the mushrooming social welfare bureaucracy, a militant grouping agitated for a more comprehensive income maintenance program. It would be paid for by taxing the wealthiest and be administered by social workers and their unemployed clients, who were themselves often involved with councils of the unemployed, some of which staged sit-ins at relief offices. The movement also took on the conventional social work establishment and its technocratic approach which emphasized control, discipline, and tutorial intervention into the lives of their “clients.” They argued instead that it was more on the mark to advocate social change, organize unions, and join larger campaigns for housing, the right to organize, and for major income redistribution. Once installed in office, the New Deal administration went off in various directions at once, trying out this and that. Orthodoxy still had a say, for example, in the axiomatic belief, which FDR shared, in the need to balance the budget. But the urgency of the moment compelled other options. So, the National Recovery Administration experimented with corporatism; the state would backstop the power of business to discipline itself, to reign in its self-destructive impulses to compete, to overproduce, to slash wages. Meanwhile, the Tennessee Valley Authority ventured into the realm of state planning and regional development. New regulatory laws governing banks and the stock market would put the financial system under surveillance. Public works put people to work, refreshed and extended the infrastructure of the national marketplace, and presumably primed the pump of industrial recovery. All of this was underway three months in. All of it, if not entirely new, seemed bold, pathbreaking. None of it, however, was meant to uproot the foundations of capitalism in America, but rather to restore them. Outside the ranks of the administration, however, is where currents of radical anti-capitalism were detectable during these formative years when the New Deal had not yet consolidated its hold; not merely detectable, but ones with real force and amplitude.\nThe Shifting Equilibrium Strikes and union organizing were commonplace throughout the decade; nor did they, taken in isolation, challenge the fundamentals of the marketplace. On the contrary, conventional trade unionism, under normal circumstances, presumes the marketplace, wage labor, and contractual relations between bosses/owners and employees. However, the circumstances were not normal, nor was the behavior of the union movement conventional. To begin with, all the core sectors of the industrial economy were free of unions. This was not a matter of good luck for the employing classes, but rather the result of concerted efforts going back decades to cleanse industry of their presence. Fledgling or even more established unions had been defeated over and over again, and driven underground or out of existence by the collusive efforts of companies, courts, police, vigilantes, and the mobilization of private and public armies. Faced with that history of failure, summoning up the will to try again was itself a radical break with the resignation, fatalism, and self-reproach otherwise so natural in such an environment. If the era is most distinctively marked by the uprising and organization of millions of working people, then that phenomenon alone suggests a radical rupture with the past. Beyond the act of rebellion, this working-class insurgency carried with it other signs of something out of the ordinary. Much of what eventually became the Congress of Industrial Organizations was led by political radicals. And the workers they led knew them to be men and women of the Left. Moreover, the new institutions they invented were ecumenical in makeup. Encrusted barriers of skill, religion, ethnicity, gender, and even race, which with very few exceptions, had disabled earlier efforts to create inclusive unions and a living sense of social solidarity, were overcome; not completely, not permanently, but with enough tenacity to win out against long odds. Embryonic unions often began as communal undertakings. This was especially the case in the steel, meatpacking, and textile industries, and was true elsewhere to a lesser extent in automobile, rubber, and mining (where it had always been true). That meant they deliberately enlisted not only the support but the participation of community groups including ethnic clubs, neighborhood tenant associations, local churches, and fraternal societies among others. Conventional trade unions tend to stay in their own lane, conducting their affairs at some remove from the general public, and confining their concerns to contractual relations with ownership. CIO unions, in this formative period, were much more capacious. They self-consciously identified their own interests with those of the wider social universe they were embedded in. It is in this zone, between customary acts of collective bargaining and the riskier, more audacious attempt to stand up for the whole community, where class consciousness is born. Signs of this more adventurous spirit marked the era. Sit-down strikes in the rubber and auto industries particularly, but also across broad stretches of the economy, were transgressive. They called into question the inviolability of private property as workers occupied factories and other commercial assets. This elicited hysteria among political and corporate elites. Nor would these uprisings have been as successful as many of them proved to be without the mobilization of sympathetic “outsiders” from the surrounding towns and neighborhoods. Furthermore, the waves of strikes that washed over the country for several years were often prompted by or assisted by “flying squadrons” of militants who raced here and there on behalf of the common cause; another tangible expression of the social-mindedness — the class consciousness, if you will — of the insurgency. Enthusiasm of this scale carried political implications. Before any of the ameliorative measures most famously identified with the New Deal (the Wagner Act, the Social Security Act, the Fair Labor Standards Act) were adopted, two general strikes erupted. One was in San Francisco and led by the longshoremen’s union. The other was in Minneapolis and led by the Teamsters. Both were captained by revolutionary socialists. General strikes are rare and inherently political. While they last, the mechanisms and authority of the strike supplant or co-exist with those of the “legitimate” municipal government. Power to run daily affairs — everything from sanitation to transportation, from medical services to policing — oscillates between the institutions of old and the upstart centers of the mass movement, or even may vest entirely in the General Strike Committee. This is an untenable situation. Barring actual revolution, power ultimately devolves back to where it came from. But the act of calling and conducting a general strike is a grave one. It may have no revolutionary aspirations, yet it opens the door to the unknown. That these two strikes happened in the same year — 1934 — is a barometer of just how far down the road of anti-capitalism the working-class movement had traveled. While the sit-down and general strikes were the most dramatic and politically challenging expressions of working-class sentiment, the whole movement of the CIO was, from the outset, a political undertaking as well as an economic one. In one sense, that was involuntary. Major corporations like GM, Ford, US Steel, US Rubber, General Electric, among others, quickly resorted to police, judges, and elected officials to frustrate working class mobilizations. The new labor movement was quick to seek out its own political allies as a counterweight. Sometimes this worked — for example when labor secretary Frances Perkins intervened, although with little effect, in the GM-UAW confrontation — and sometimes it did not — for example, when the President refused to take sides in the bloody contest between the “little steel” companies and the fledgling Steel Workers Organizing Committee. Apart from specific instances like those, more profoundly, the existence and survival of the infant industrial union movement was implicitly premised on an alliance with the Roosevelt administration. In the earliest years, that relationship was not as one-sided as it might appear. True, the labor movement’s initial calls to join a union because the president wants you to, were both disingenuous (FDR was at best agnostic about unions) and pathetic. However, bitter about the way labor had been mistreated or ignored entirely by the National Recovery Administration, leaders of the incipient mass movement took a decision to go ahead on their own, expecting no tangible aid from Washington. When important segments of American business decided they too had had enough of New Deal tinkering with the economy, their disaffection opened a doorway through which the new labor movement could reenter. That moment, happening around the time that the Supreme Court ruled the NRA unconstitutional in 1935, changed the nation’s political chemistry. The Roosevelt administration needed new allies. To get them it would have to pay closer attention to the social upheavals erupting around the country. The center of gravity was shifting, and the New Deal would have to shift with it or risk isolation. As far as the new labor movement was concerned, that meant, at the very least, the Administration’s support for a new labor law, the Wagner Act, which FDR had never shown any interest in. While the Wagner Act is today a toothless piece of legislation — and one that in hindsight crippled the labor movement’s freedom of action — back when it was adopted, it was rightfully celebrated as an innovative piece of industrial democracy, liberating for millions. Some sectors of the business community were prepared, even eager, to seek out a modus vivendi with the labor movement that would help stabilize industrial labor relations and take labor costs out of a self-destructive, competitive equation. Other elements of the commercial world, especially those entrenched in heavy industry, were furious about being evicted from their customary perches at the top. They turned on the New Deal with a vengeance. In turn, this alienation of segments (not all) of the corporate world, invited more straightforward political engagement by the just-born CIO. Creating Labor’s Non-Partisan League in 1936 to support FDR’s reelection (as well New Deal aligned politicians all over the country) may be seen as the first fateful step that would end in the labor movement’s incorporation into the Democratic Party. It was. But, at the moment of creation, it was also a repudiation of what had been earlier the labor movement’s studious political agnosticism. And as the national mood shifted, the New Deal felt compelled to speak a class inflected political language — redolent metaphors like “tories of industry” and “economic royalists” — aimed not only at the new labor movement, but at all those other simmering social rebellions. Most acutely, New Dealers in Washington worried about the movements led by Huey Long, Father Coughlin, and Francis Townsend. Long’s Share Our Wealth clubs, Coughlin’s National Union for Social Justice, and the Townsend Clubs rallying behind Dr. Townsend’s pension plan together embraced millions of followers. In retrospect they are often treated as right-wing, protofascist gatherings. That was not self-evident at the time. All three evinced anti-capitalist sentiments even as they trafficked in anti-Semitism (in Coughlin’s case) and demagogic authoritarianism (in Long’s case.) Calls to redistribute wealth and power characterized all three. In that way, they were part of a broader populist persuasion that included the formative CIO. It directed its anger at the peak institutions — banks, corporations, political elites — of the old order. It is worth noting the common terrain often occupied by anti-capitalist formations of the Left and Right. This had been true in Europe where overlapping constituencies from the radical right and socialist left moved in and out of Mussolini’s fascist movement and Hitler’s National Socialists. The political atmosphere was electric in the Old World and the New. Looking back, FDR’s reelection in 1936 seems a foregone conclusion. The Union Party created by Coughlin, Townsend, and the heirs of Long’s Share Our Wealth organization, garnered less than a million votes — 2 percent of the total and no electoral votes. But it was not perceived that way at the time. A great fear infected the ranks of the administration that populist currents might pose a serious political threat. One scholar has argued that fear motivated the whole political era of the New Deal. Certainly, elite circles in and out of government were afraid of where things were heading. But it is a gross mischaracterization to paint a whole political universe as gripped and motivated by fear. On the contrary, the varied rebellions that lent the New Deal enterprise its frisson were the outcome of enormous social courage and defiance — not fear. Fear is what had kept industrial workers under the thumb of their corporate overlords, what had for generations hobbled farmers and sharecroppers leaving them at the mercy of their landlords, what made the dispossessed scurry away at the sight of the police, what made ‘little men’ cower and fawn in the presence of the mighty, what made gross inequality of condition seem foreordained. Overcoming those fears, not succumbing to fear, is what made the New Deal possible.\nThe Historic Compromise If the substructure of the New Deal originated in numerous acts of rebellion, those radical instincts were soon enough transformed and stripped of their most audacious presentiments. How to account for that political alchemy? Peering inside these insurgencies reveals a counter logic, a conservative tidal drift pulling these movements away from the precipice. Looking at them from afar, taking the measure of the wider context in which they were embedded, exposes those deep historical currents running through American society that foreshortened the horizon of the possible. Take the CIO. Radicals — communists, socialists, Trotskyists, syndicalists, among others — occupied leadership positions as organizers, strategists, and propagandists. But the CIO was a grouping of trade unions, not a political party. Although it forcefully ventured into the political arena, its membership subscribed to no single ideology or programmatic blueprint. On the contrary, the ranks of CIO unions embraced multitudes: practicing Catholics, some liberal-minded, some quite conservative when it came to matters of the family, education, and religion. Migrants fresh from the desiccated farms of Appalachia and the Great Plains turned up in midwestern industrial centers and flooded into the new unions. They might be secular in outlook, even have had some industrial and union experience as miners or railroad workers. But just as likely they were attached to various fundamentalist denominations and marginal homesteads and carried with them traditional attitudes about private property, the patriarchal household and race. Some CIO’ers were first generation immigrants still immersed in their insular ethnic communities and attached to their old-world ways of life and belief. Others were second generation, more experienced with and open to the currents of modern urban life. That could mean they married outside their ethno-religion, for example, and that they were open to unorthodox, even radical ideas. But it could also mean they were more open than theirs parents to the allure of modern consumer culture and shaped their expectations for the future accordingly. African Americans joined the CIO in numbers that were unprecedented, if only because the labor movements before the CIO were usually so hostile to their presence. There were those among them who were experienced veterans of various movements for black liberation, either in the South or in northern cities. They naturally gravitated into the more radically minded caucuses within the CIO and perceived the connection between racial emancipation and anti-capitalism. But dispossessed sharecroppers and farm laborers made up the bulk of the African American industrial labor pool. Their aspirations were often more modest; an escape from the Jim Crow peonage to be sure, but one in which decently remunerated wage labor was a worthy social accomplishment. It might be said that the CIO did not represent the American industrial proletariat, but many proletariats. Whatever the views of CIO leaders — and they were not all radical by any means — they were compelled to pay due attention to the decidedly non-radical inclinations of their varied constituencies. And whatever their formal ideological positions on capitalism, socialism, and revolution, left-wing trade union cadre along with wider circles of radical activists in and outside of the SP and the CP, remained the sons and daughters of the Enlightenment. The struggle to preserve and extend democracy and equality in the age of fascism was for all practical purposes the summa of their lives. This was might be called the “political commons,” terrain shared by multitudes encircled by a wall beyond which lay the anti-capitalist unknown. Trade unionism in the abstract presumes a common denominator, a consensus formed out of the shared desire to negotiate the best contractual terms possible for selling labor power. It presumes capitalism and presumes nothing beyond that. In real life, however, forming a union may indeed encourage a broader vision of collective mission and destiny. The circumstances under which the CIO was created, and the eye-opening experience of fashioning a new organization that transcended entrenched barriers of skill, ethnicity, religion, and race, left the CIO somewhere in the middle, simultaneously a trade union in every conventional sense and a social movement that championed the desires of working people generally whether in or outside of the institution itself. Flux, not fear, is what characterized not just the CIO but all the rebellions the Great Depression set in motion. Townsend’s pension plan (and his was only the best known of many such schemes to restore some security amid capitalism’s mayhem) was daring, yet was to be financed by a regressive sales tax. It proposed to abolish all other forms of Federal relief as emasculating, too tainted with a collective paternalism that Doctor Townsend loathed. Long’s Share Our Wealth clubs (which may have enjoyed a membership of seven or eight million) promised to give all a home, a car, a radio, a guaranteed annual income, a thirty-hour work week, an eleven-month work year, government supports for agricultural prices, a veterans cash bonus, and so on, all designed to accomplish a massive redistribution of income. Nor were the clubs confined to the South; they spread into the Midwest and mid-Atlantic states as well. But the movement never meant to challenge the primacy of private property and soon enough became riddled with the racist and anti-Semitic rants of Gerald L.K. Smith, who took over after Long’s assassination. For his part, Coughlin applauded Roosevelt so long as the president chased after the “money-changers.” But soon enough, the priest’s rhetorical bombast targeted the New Deal’s “financial socialism” and characterized the regime as a “broken down Colossus straddling the harbor of Rhodes, its left leg standing on ancient Capitalism and its mired in the red mud of Communism.” In their purest forms, the Long, Coughlin, and Townsend movements echoed a besieged culture of small town patriarchal and personalized wealth and property, feeling overwhelmed by nationwide industry, national markets, the modern state, and the impersonal bureaucracy of the corporation. But their moral condemnations of concentrated wealth, Wall Street, the “money power,” and parasitic gain were broadly appealing well beyond the borders of “our town” America. Many a Polish autoworker, Slavic steel worker, and German carpenter listened intently to both the social Catholicism of Father Coughlin and the social democracy of John L. Lewis of the CIO. While the captains of these movements bristled at each other from afar, members of the Share the Wealth clubs or the National Union of Social Justice often found themselves together with fellow craftsmen in the more conservative AFL or even with their insurgent brethren in the CIO. Popular culture echoed these ambiguities. Movies, radio, literature, music, and the visual arts conveyed a new comfort with the cosmopolitanism of American life. Folk cultures were recovered and celebrated (and sometimes subsidized by New Deal agencies) and often carried with them an implicit or explicit disdain for privilege, pretension, and the high and mighty. Dawning was the age of the “Common Man.” Its aesthetic impulses showed up at the concert hall, in the dance studio, on stage, at art galleries and other unlikely sites of high culture. Its instinctual egalitarianism was self-evident. Yet this “common man” remained the man of the traditional patriarchal family. His root values were well-worn, familiar ones. Work, frugality, patient planning for the future, the home as sacred sometimes sentimentalized space. The Three Little Pigs, Walt Disney’s first feature length smash hit, which debuted in 1933, was a celebration of that old-time faith, one of many such artistic homilies. This family-based life form needed protection against the violent vicissitudes of the marketplace. The search for security was as powerful a motivation as the desire to level the social hierarchy. Could the New Deal find a way to assure a modicum of equality and a modicum of security while granting capitalism a reprieve from a near-death experience? Yes, it could and did.", "url": "https://jacobinmag.com/2019/06/new-deal-great-depression"}