{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:09:30", "date_modify": "2020-05-04 20:09:30", "date_publish": "2019-03-06 14:00:00", "description": "Last summer, after consulting two arborists, a tree in the front easement was determined that it could not be saved. On Feb. 26 a crew from Kankakee Public Works was sent to cut down a tree that...", "filename": "_d2cccb495eea4935807717053cdf65dd_1588622970.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d2cccb495eea4935807717053cdf65dd_1588622970.html", "title": "Voice of the People: Kudos to tree removal crew", "title_page": "Voice of the People: Kudos to tree removal crew", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Last summer, after consulting two arborists, a tree in the front easement was determined that it could not be saved. On Feb. 26 a crew from Kankakee Public Works was sent to cut down a tree that was possibly planted when the Shidler home was built in 1924.\nThe crew worked all day on carefully scoping and assessing the tree to meticulously and safely trimming its branches. The finale occurred in the afternoon with the huge trunk coming down. The drama was fascinating and sad at the same time because if the tree had been serviced 15 years ago, it could possibly have been saved. The rings were counted, and it was determined that the tree had been planted perhaps when the home was constructed, almost a hundred years ago.\nThe crew did a noteworthy job of managing the downed branches and trunk. The work included carefully cutting branches so as not to damage the sidewalk or Wildwood Avenue. The cleanup was major, including removing all small branches and sawdust from the downed tree, But one person went above the cleanup and did more.\nNow for a brief explanation, the easement is a garden in progress with many flowering plants and scrubs with a border of stone edging around the perimeter. With that said, there was a younger person on the crew that blew the left-over debris from the tree to the street and then replaced much of the stone edging piece by piece, stepping aside and looking at the aesthetic character of placement. He worked the perimeter and when he was thanked, he smiled and apologized for not knowing where the stones should be placed. This is remarkable.\nIt is important to recognized when a crew, and especially the young man, do a very nice job of tree removal and cleanup, including replacing a stone edging.\nMany thanks to the crew that worked on the tree.\nSusan Kay Henke\nKankakee", "url": "https://apnews.com/d2cccb495eea4935807717053cdf65dd"}