{"authors": ["Katie Finlon Kfinlon Shawmedia.Com"], "date_download": "2020-05-04 20:04:42", "date_modify": "2020-05-04 20:04:42", "date_publish": "2019-02-12 05:35:00", "description": "SYCAMORE – Two contentious solar energy projects in DeKalb County will be eligible for the Illinois solar project lottery after all, after a County Board vote. The DeKalb County Board voted,...", "filename": "_b7d4a77fecb646a5b3204bdbba4cd81a_1588622682.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b7d4a77fecb646a5b3204bdbba4cd81a_1588622682.html", "title": "DeKalb County Board approves 2 Cortland Township solar projects", "title_page": "DeKalb County Board approves 2 Cortland Township solar projects", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SYCAMORE – Two contentious solar energy projects in DeKalb County will be eligible for the Illinois solar project lottery after all, after a County Board vote.\nThe DeKalb County Board voted, 12-8, to allow the solar projects through the special use permit approval process in time for the state’s lottery submission deadline during a special meeting Monday night. Board members Rukisha Crawford, Laurie Emmer, Tim Hughes, Maureen Little, Larry West, Jeff Whelan, Tim Bagby and Scott Campbell voted against the proposed projects after the proposal was approved by the county’s Planning and Zoning Committee again.\nCounty Board Chairman Mark Pietrowski Jr. said project developer U.S. Solar is required to create screening that would block at least 50 percent of the view of the project, as seen from the first floor of each residence, for the eight affected neighbors on Airport Road within seven years. He said that must be met either by planting more trees on the project site, on neighbors’ properties or both.\n“And if the neighbors say no, it has to be met on the petitioner’s property,” Pietrowski said.\nThe special board meeting comes after the committee voted, 7-0, last month to approve the proposed 2-megawatt community solar gardens from U.S. Solar on Bethany Road in Cortland Township. The board initially sent the projects back to the committee because of concerns about a lack of apparent compromise between the developer and affected neighbors.\nThe board held the special meeting because the company ran into a deadline problem regarding the projects, as it is trying to get the proposals submitted to the state in time for the solar project lottery process. The submission deadline for the lottery is Wednesday.\nNathan Wozniak, project development analyst for U.S. Solar, said the company completed the revised plan presented Monday with the help of a licensed landscape architect, which meets the requirements as long as the company can plant trees on the project site and neighboring residential property. He said the company is looking forward to working with residents to meet the county’s requirements within seven years.\n“I’m happy that we got approval,” Wozniak said.\nMegan Gerwig of Sycamore, who lives on one of the eight neighboring properties affected by the projects, said she works in landscaping and does not feel confident about the types of trees the company proposed to use to meet the screening requirement. She said only a small list of trees, which can’t grow taller than 20 feet, would be able to fare in the environment with full sunlight and lots of wind and water.\n“I’m not sure who came up with the idea for the Black Hills spruce, but it’s not a good one,” Gerwig said.\nTerry Martinson of Sycamore said he and the handful of other residents who came Monday’s meeting are disappointed in the outcome. After an hour and 15 minutes of discussion, he said, he remains skeptical about whether the company can meet the county’s screening standards with the property being on a 100-foot slope, with the houses being at the top of the slope.\n“It’s just ridiculous,” Martinson said.", "url": "https://apnews.com/b7d4a77fecb646a5b3204bdbba4cd81a"}