{"authors": ["Michal Rozworski", "Leigh Phillips", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Dawn Foster", "Meagan Day", "Solomon Hughes"], "date_download": "2020-05-04 19:56:31", "date_modify": "2020-05-04 19:56:31", "date_publish": "2019-12-07 00:00:00", "description": null, "filename": "2019_12_national-health-service-nhs-britain-funding_1588622191.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/12/07102850/6869336880_38a99668c7_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_12_national-health-service-nhs-britain-funding_1588622191.html", "title": "The NHS Shows What Life Outside the Market Could Look Like", "title_page": "The NHS Shows What Life Outside the Market Could Look Like", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThis article is adapted from Michal Rozworski and Leigh Phillips’s book The People’s Republic of Walmart: How the World’s Biggest Corporations are Laying the Foundation for Socialism , which is available from Jacobin here.\nThe National Health Service is at risk of being eroded and privatized if Boris Johnson and Donald Trump get their way. Opening a service already underfunded and riven with privatization to a further round of exploitation by the vultures of the US pharmaceutical industry could really be the moment that the NHS as its been known begins to end. However, the battle for the soul of the NHS — the fight to keep this vital service public, free at point of use, and democratic — has been raging much longer. For decades, the Tories have tried to undermine what is unique and cherished about the NHS, the bulwark it offers against the market in people’s lives, at every opportunity. Whatever the outcome of Thursday’s election, the Labour Party will need to confront the intrusion of markets and private interests head-on. While the NHS today outpolls every other institution — including the monarchy — in popularity among Britons, it is also, sadly, living proof of a dream compromised. Reduced to a hobbled mess of public and private institutions crisscrossed by markets, it is an example of far-reaching potential stymied. The story of the British NHS is thus much more than a story about caring for the sick.\nMaking the NHS “Nye” Bevan, as supporters affectionately called the charismatic leader of Labour’s left-wing who established the NHS, famously said that it was “a piece of real socialism.” Before its creation and throughout its history, many of the NHS’s opponents have seen it that way as well and have acted accordingly. Before the NHS, health care was largely a luxury. The wealthy hired personal doctors; the rest simply did without or depended on the modicum of relief provided by churches or the state. Local governments set up rudimentary hospitals for the poor, but they were at best insufficient, at worst more akin to prisons. As a counter to this injustice, working-class organizations of all kinds began to experiment with mutual aid. Workers formed “friendly societies,” pooling together small monthly subs from individual workers to pay doctors and run occasional free clinics. As they grew, some societies could hire full-time doctors and even build their own clinics, offering care to entire families, rather than just (mostly male) workers. The working class organized itself to deal collectively with a problem that affected every individual, but with which no individual could deal on their own. It was socialized medicine in embryo — an answer to the question of whether people should be passive consumers of medicine or instead its active co-creators. Although it would take until 1948 to be officially established, the new National Health Service was the postwar government’s greatest achievement. Health care was made free at point of service, paid out of taxation, and universally available. Distinct from some other public health care systems, hospitals were not merely publicly funded but nationalized. To those with a vested interest in the old system who resisted, Nye Bevan, who had experienced firsthand the system of medical mutual aid in Tredegar, the Welsh mining village where he was born, famously declared: “We’re going to Tredegarize you.”\nDemocratic Potential The first task of the early NHS was turning an inadequate patchwork of clinics, hospitals, and other services into a functioning, properly joined-up, and universal public health care system. Much like today, where less populated regions suffer a lack of high-speed internet because telecommunication companies cherry-pick the most profitable areas to service (and let the rest of a country rot, for all they care), great chunks of the country came into the era of the NHS hospital-less, or at best with hospitals in poor shape, a situation that would not be corrected for years. For example, the 1962 Hospital Plan of the then-Conservative government was a grand promise, but it almost immediately ran into chronic underfunding — presaging of much of the history of the NHS to come. A decade later, however, under another Labour government, meaningful planning appeared to be on the horizon. In policy documents, the aspirational goal of the NHS was now “to balance needs and priorities rationally and to plan and provide the right combination of services for the benefit of the public.” In practice, three changes pointed to the potential for more thoroughgoing, democratic planning. First, the NHS expanded the horizons of health. A reorganization in 1974 integrated health care into local planning of other kinds, whether this meant sewers, roads, community centers, or schools. The potential was, in principle, enormous: health care could be more than just a reaction to illness and begin to have bearing on those broader social determinants of health. The same 1974 reform changed how health care was managed. New local management teams integrated hospitals, family medical clinics, and community health centers for the elderly and those with severe mental health difficulties. Working alongside them were “community health councils.” Local organizations representing seniors or the disabled were given the right to elect one-third of the members. Although the councils initially had no direct decision-making authority, they showed that it was possible to open the opaque NHS hierarchy to the bottom-up voices of patients and citizens. Finally, in 1976, the NHS committed to distributing resources in line with health needs, a potentially radical transformation. Regions with bigger needs (which were often poorer as well) would now receive bigger budgets. The reforms of the 1970s carried in them the seeds of a more radical remaking of the NHS. Rather than planning only how much health care there was, and where, these reforms could also have laid the groundwork for planning that tackled how health care was produced and, most importantly, who participated in decision-making.\nUnder Thatcherism Soon, however, the reforms of the 1970s fell, one by one, to the Right’s vision for health care. Over the course of the 1980s, a business ethos crept into the NHS. It didn’t come out of nowhere: the Right’s once-marginal ideologues had long blamed all NHS shortcomings on misspent budgets and a lack of “choice” by patients. While the problems of poor services and long wait times were real, fears about “out-of-control” budgets were largely manufactured. The NHS had been massively underfunded. Spending on health as a percentage of GDP had started out at a measly 3 percent of GDP in 1948, growing only to around 6 percent by the 1980s. At the time, France was spending about 9 percent of GDP on health care, and Germany 8 percent; thus, the NHS was and remains a relative bargain. By comparison, the market-based system in the United States consumes nearly double that figure, 17 percent of GDP, while still denying care to millions — a paragon of economic inefficiency. The Right’s counterargument — that any budget, no matter how big, would never be enough — falls flat. Right-wing hand-wringing about cost control, however, provided cover to the health care corporations that would gain, even if only part of the NHS were sold off. The barrier to overt privatization was that the NHS regularly topped polls of most-trusted institutions among the British electorate. Famously, even arch-neoliberal Margaret Thatcher had to promise that “the NHS is safe in our hands” in a speech to her own Conservative Party convention in 1983. But by 1988, when Thatcher announced a major review of the NHS, nearly a decade of hard-right rule and a much-longer ideological battle against the welfare state left these words increasingly hollow. Three years later, Thatcher’s successor as prime minister, John Major, introduced the biggest reform in the history of the NHS: the “internal market.” Although the Conservatives couldn’t put the NHS onto the market, with it they found a way to put the market into the NHS, with an end result that was neither fish nor fowl.\nFranken-Health Care The big change was what was termed the “purchaser-provider split.” Before this reform, a doctor would refer a patient to a local hospital or clinic for any further service, such as a blood test, hip replacement, or liver transplant. The NHS paid the doctor and funded the hospital, so no money explicitly changed hands between the two. Under the internal market, hospitals and community care clinics “sell” services. They are the providers. Doctors, local health authorities, or other NHS agencies are purchasers who in turn “buy” these services in the name of their patients. Over the course of the 1990s, a Labour-Conservative consensus around the efficiency of markets and competition replaced the postwar consensus around planning and public service. Margaret Thatcher reportedly called Tony Blair — elected in 1997 as the first Labour prime minister since the 1970s — her greatest achievement. His business-friendly, pro-market New Labour government worked to expand the Conservatives’ market reform, in particular in the English NHS. In the English NHS, purchasers, now called “commissioners,” became fully independent of the NHS hierarchy, thus attenuating voter accountability. With the door to wholesale market transformation cracked, David Cameron’s post-2010 coalition of Conservatives and Liberal Democrats pushed it wide open. Their 2012 Health and Social Care Act now extended access to explicitly for-profit providers and introduced competition over commissioning contracts themselves — a contract for who gets to sign other contracts. By this time, even the British Medical Association — the same doctors’ organization that had initially fought Bevan to maintain space for private business and professional privileges — was standing up to reforms that would be a gateway for health care corporations first to cherry-pick, then to take over, large sectors of the NHS. In the years immediately following this overhaul, over 10 percent of total NHS spending already went to for-profit providers.\nAgainst the Market The story of the NHS since the 1990s is not just one of a conflict between planning and markets; it is also a reminder that markets need to be made and sustained, a point well understood by the neoliberals who set out to do just this. Three decades on, the central NHS is increasingly a rudderless vehicle for handing out money, as system-wide planning has eroded away. Competition was supposed to make the NHS more efficient, increase the quality of services, and give patients a voice. On all counts, however, it has done little; and instead, it has undermined the basic values of the NHS — that health care be universal, accessible, and free. Market reforms introduced plenty of new costs. Ostensibly about slimming down government bureaucracy, the dense jungle of contracts between providers and purchasers in fact required armies of new bureaucrats. Even by 1994, three years into the internal market, the NHS had hired ten thousand new managers. While administration costs made up just 5 percent of the total NHS budget in the 1980s, by 2005 they had nearly tripled, to 14 percent of the total. A 2014 report from the UK’s Centre for Health and the Public Interest put the cost of just running the internal market itself at an estimated £4.5 billion per year — enough to pay for dozens of new hospitals. Markets in health care are not only costly, but also far from the simple models described in economics textbooks. What economists call “costs of entry” are very high: building new hospitals is an option available only to the state or to the few large health care corporations. And without the state, these corporations end up dominating the market, leading to scant competition but widespread waste and duplication. Consultants and marketers, for example, have flourished under the NHS internal market. Resources that could go toward saving lives or curing diseases end up wasted on enticing doctors to pick one clinic over another for a referral. Have all of these additional costs created new benefits? At best, it’s hard to tell. Every patient comes into treatment with their own personal history, including all the social determinants of health, making comparison very difficult. But some comparisons can be made. As England moved further along the market path, Scotland decided in the late 1990s to return to a more public NHS. Since then, the Scottish NHS has improved more rapidly on important indicators, such as wait time for a hospital bed or an ambulance. On other measures like life expectancy, the gap between relatively poorer Scotland and its southern cousin remains steady, as well. Difficulties in gauging quality haven’t stopped market boosters from pretending it’s simple. As part of its reforms, New Labour even created a three-star rating system — like Uber driver reviews but for hospitals. This went about as badly as you’d expect. For example, under the star system, cardiac surgeons in London hospitals were less willing to perform high-risk but life-saving operations because they could damage their hospital’s rating. The free-market fanatics, who complained that perverse incentives let quality languish under planning, thus created perversions all their own. So, if competition cannot claim to be more efficient or to deliver higher quality, can it at least give patients that elusive “voice”? In fact, it turns out that having a choice in one’s medical provider is a fairly low priority. In a recent UK survey, 63 percent of people ranked fairness as their most important value in health care. Choice in services, however, was last. What’s more, where conditions become more life-threatening and treatments more technologically advanced, people demonstrate even less desire to give input into medical decisions. And surveys have also found that people would rather have a greater say over the kind of treatment they receive than over who delivers it. People clearly desire a voice in health care decision-making, but realizing this requires different and deeper democratization than that provided by the shallow market version. Involving patients by treating them as if they were consumers choosing shampoo at the drugstore is very different from giving patients more informed autonomy over their own health.", "url": "https://www.jacobinmag.com/2019/12/national-health-service-nhs-britain-funding"}