{"authors": ["Special To Today S News-Herald"], "date_download": "2020-05-04 20:21:47", "date_modify": "2020-05-04 20:21:47", "date_publish": "2019-03-01 06:31:00", "description": "Special to Today’s News-Herald KINGMAN — Authorities say a Kingman man was walking along the eastbound railroad tracks directly across the Thompson Avenue and Route 66 intersection and was...", "filename": "_6d28163b4c2d40cebfb1aafc33e134ed_1588623707.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6d28163b4c2d40cebfb1aafc33e134ed_1588623707.html", "title": "Train strikes Kingman man, suffers non-life threatening injuries", "title_page": "Train strikes Kingman man, suffers non-life threatening injuries", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Special to Today’s News-Herald\nKINGMAN — Authorities say a Kingman man was walking along the eastbound railroad tracks directly across the Thompson Avenue and Route 66 intersection and was struck by a westbound BNSF train Wednesday night.\nKasper Gillespie, 23, was taken to University Medical Center in Las Vegas where it was determined his injuries were non-life threatening, according to Mohave County Sheriff’s Office Public Information Specialist Anita Mortensen.\nGillespie was determined by law enforcement to be under the influence of an illegal substance and allegedly admitted to have used methamphetamine.\nThe BNSF train personnel noticed Gillespie walking on the tracks at about 9:40 p.m. and warning blasts from the train’s horn were given. Engineers reported they saw Gillespie stagger and cross the tracks, and the train’s brakes were applied.\nWhen the train came to a halt, its crew checked on Gillespie, who was responsive. The BNSF personnel called for medical and law enforcement help.\nAfter more BNSF staff responded, the engineer crew continued on their route.\nThe investigation is ongoing.", "url": "https://apnews.com/6d28163b4c2d40cebfb1aafc33e134ed"}