{"authors": [], "date_download": "2020-05-04 21:06:29", "date_modify": "2020-05-04 21:06:29", "date_publish": "2019-12-27 05:56:14", "description": "LOS ANGELES PROSECUTORS REVIEWING 8 CASES AGAINST WEINSTEIN LOS ANGELES (AP) - Prosecutors in Los Angeles are reviewing eight cases accusing disgraced film mogul Harvey Weinstein of sexual...", "filename": "_e70d8079294d4c259b470b9bddf2865b_1588626389.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e70d8079294d4c259b470b9bddf2865b_1588626389.html", "title": "AM Prep-Segue", "title_page": "AM Prep-Segue", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "LOS ANGELES PROSECUTORS REVIEWING 8 CASES AGAINST WEINSTEIN\nLOS ANGELES (AP) - Prosecutors in Los Angeles are reviewing eight cases accusing disgraced film mogul Harvey Weinstein of sexual assault. A spokesman for the Los Angeles County District Attorney’s Office said Thursday that the Los Angeles and Beverly Hills police departments each brought four investigations to prosecutors. He says no charges have been filed and he didn’t know details about the allegations. Weinstein’s publicist said in an email to The Associated Press that he has “nothing to add right now.” Weinstein has denied all wrongdoing in previous allegations and is scheduled to stand trial on rape charges next month in New York City.\nHUMORIST MO ROCCA’S ‘MOBITUARIES’ MAKES FOR LIVELY READING\nLOS ANGELES (AP) — Journalist and humorist Mo Rocca looks at history through a lens uniquely his own. That’s reflected in the title of his new book, “Mobituaries.” It’s a collection of obituaries of people, some famous, some less recognized today. For the better-known, including presidential sibling Billy Carter, author Rocca offers a reappraisal. For others, such as an African American politician of the reconstruction era, he fills in the blanks. Rocca, a “CBS Sunday Morning” correspondent, also revisits departed things, including the station wagon, and movie portrayals of celebrities such as Fanny Brice. Rocca also does a “Mobituaries” podcast, which is in its second season.\nA LESSON IN JUNGIAN PSYCHOLOGY FROM BILLY DEE WILLIAMS\nPASADENA, Calif. (AP) - Billy Dee Williams gets through life by pondering analytical psychology. Williams says many years ago, he embraced the teachings of Carl G. Jung (YUNG). He says he’s fascinated by concepts like the duality of life, the collective unconscious and struggling with ourselves. This may seem like pretty heady stuff from the guy known for playing Lando Calrissian in “Star Wars,” but he points out that’s essentially what “Star Wars” is about. He says the films are about “struggling with the negatives and positives outside of yourself and negatives and positives within yourself.”\nSOUND:\n%@AP Links\n099850-a-96:72-(Billy Dee Williams, actor)-“very bad joke (laughs)”-Billy Dee Williams ponders Jungian psychiatry, mortality (27 Dec 2019)\n¤¤CUT ´099850 (12/27/19)££ 96:72 “very bad joke (laughs)”\n099848-a-154:08-(Billy Dee Williams, actor)-“theories were different”-Billy Dee Williams ponders Jungian psychiatry, mortality (27 Dec 2019)\n¤¤CUT ´099848 (12/27/19)££ 154:08 “theories were different”\n099849-a-174:00-(Billy Dee Williams, actor)-“out our lives”-Billy Dee Williams ponders Jungian psychiatry, mortality (27 Dec 2019)\n¤¤CUT ´099849 (12/27/19)££ 174:00 “out our lives”\n099851-a-126:96-(Billy Dee Williams, actor)-“there’s something else”-Billy Dee Williams ponders Jungian psychiatry, mortality (27 Dec 2019)\n¤¤CUT ´099851 (12/27/19)££ 126:96 “there’s something else”", "url": "https://apnews.com/e70d8079294d4c259b470b9bddf2865b"}