{"authors": ["The Herald-Dispatch"], "date_download": "2020-05-04 20:11:21", "date_modify": "2020-05-04 20:11:21", "date_publish": "2019-03-12 04:01:00", "description": "ATHENS, Ohio — March is Colorectal Cancer Awareness Month, and a good time to learn more about colorectal cancer (cancer of the colon and rectum) and how it can be prevented or treated. This...", "filename": "_79e88bc3f78a4524b778a19fc8f5ee7d_1588623081.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_79e88bc3f78a4524b778a19fc8f5ee7d_1588623081.html", "title": "Tips for how to lower the risks for colorectal cancer", "title_page": "Tips for how to lower the risks for colorectal cancer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Tips for how to lower the risks for colorectal cancer\nATHENS, Ohio — March is Colorectal Cancer Awareness Month, and a good time to learn more about colorectal cancer (cancer of the colon and rectum) and how it can be prevented or treated.\nThis year, approximately 140,000 new cases of colorectal cancer will be diagnosed and 56,000 people will die from the disease. However, colorectal cancer is a disease that can be prevented through regular screenings, a healthy diet and regular exercise.\nTo discuss prevention, risk factors, and bring awareness to this disease, Brian Torski, DO, Gastroenterology, Holzer Health System, will be offering a seminar at Ohio University Inn in Athens, 331 Richland Ave., Monday, March 18, at 5:30 p.m. Dinner is provided during the seminar.\nTo lower the risk of colorectal cancer, the American Society of Colon and Rectal Surgeons recommends:\nn Get regular colorectal cancer screenings after age 45. Between 80-90 percent of colorectal cancer patients are restored to normal health if their cancer is detected and treated in the earliest stages.\nn Eat a low-fat, high-fiber diet.\nn If you use alcohol, drink only in moderation. If you use tobacco, quit. If you don’t use tobacco, don’t start. Alcohol and tobacco in combination are linked to colorectal cancer and other gastrointestinal cancers.\nn Exercise for at least 20 minutes three to four days each week. Moderate exercise such as walking, gardening or climbing steps may help.\nn Current screening methods include fecal occult blood testing (a simple chemical test that can detect hidden blood in the stool), flexible sigmoidoscopy (a visual examination of the rectum and lower portion of the colon, performed in a doctor’s office), double contrast barium enema (barium x-ray), colonoscopy (a visual examination of the entire colon) and digital rectal exam. Colorectal cancer screening costs are covered by Medicare and many commercial health plans.\nIt is recommended to find out what colorectal surgeon or other healthcare provider to find which screening procedure is right and how often one should be screened.\nFor more information or to RSVP for the free seminar with Dr. Torski, please call 740-446-5828. Individuals can also register online at: https://www.holzer.org/forms-other-miscellaneous/colorectal-cancer-awareness-seminar/.", "url": "https://apnews.com/79e88bc3f78a4524b778a19fc8f5ee7d"}