{"authors": ["Brian Pearson Idaho Fish"], "date_download": "2020-05-04 20:19:49", "date_modify": "2020-05-04 20:19:49", "date_publish": "2019-02-13 07:15:00", "description": "An innovative approach using trail cameras to capture wildlife will allow Idaho Fish and Game biologists to estimate deer and elk populations in a safer, less-invasive and less-expensive way than...", "filename": "_3de73c89534d42248c3836036ef74cbc_1588623589.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3de73c89534d42248c3836036ef74cbc_1588623589.html", "title": "Game cameras provide new methods for counting and managing wildlife", "title_page": "Game cameras provide new methods for counting and managing wildlife", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "An innovative approach using trail cameras to capture wildlife will allow Idaho Fish and Game biologists to estimate deer and elk populations in a safer, less-invasive and less-expensive way than the traditional method of biologists flying in aircraft and counting them.\nDuring November, biologists deployed a network of trail cameras on winter range of mule deer in eastern Idaho, as well as elk range in the St. Joe River and the South Fork of the Clearwater River. In each location, cameras were deployed at randomly selected GPS points across the animals’ winter range.\nDuring December, and at least through February, the remote cameras will snap a picture any time they sense movement, much in the same way hunters use them to scout for game.\nMore important for Fish and Game’s population surveys, all the cameras are synchronized to take photos at exactly the same time at 10-minute intervals. Those photos will be used in statistical modeling that allows biologists to estimate populations across the entire study area with statistical confidence.\n“It is a big deal,” said Mark Hurley, Fish and Game’s wildlife research manager. “This is quite a breakthrough to discover some of these different techniques for estimating populations.”\nMore data and better data\nBiologists also believe the photos will help them generate more reliable estimates of sex ratios for the mule deer in southern Idaho than their current helicopter surveys. The current process for generating sex ratio estimates involves sampling a small portion of a winter range from the air, and expanding that over the entire range. Because bucks aren’t always congregated with does and fawns on winter range, there can be some inconsistencies in those sex ratios. The new remote camera method samples the entire winter range, which can eliminate those inconsistencies.\nFor elk herds being surveyed farther north, where dense vegetation makes traditional helicopter surveys impractical or impossible to conduct, it will lead to the first population and sex ratio estimates ever.\nSex ratios are important measurements for managing populations to ensure there’s adequate numbers of breeding-age females, enough young animals to sustain or grow the herds, and enough males to support harvest.\nSafer surveys\nThe idea of using remote cameras to generate population estimates in Idaho goes back about five years. Fish and Game put together a team of biologists to look at alternative methods to aerial surveys where biologists fly in a helicopter and count animals in the open and semi-open areas of Southern Idaho.\nThey also wanted a method that could be applied to portions of north and central Idaho where dense vegetation makes spotting animals from a helicopter difficult.\nEven in areas where aerial surveys are typically done, pilots have to fly in rugged terrain, at low elevations and during winter weather while a biologist counts animals, which makes surveys potentially hazardous.\n“One of the biggest reasons we wanted to find an alternative was to reduce the amount of time we put department employees at danger in helicopters,” Fish and Game Deer and Elk Coordinator Daryl Meints said.\nAlso, traditional helicopter surveys are expensive and getting progressively more so every year, and surveys are tough to conduct during mild winters. Light snow means animals are dispersed throughout the landscape and at different elevations rather than congregating on low-elevation winter range.\nBorrowing a hunter’s tool for wildlife management\nThe concept of using trail cameras in wildlife management is not entirely new: Idaho Fish and Game biologists have used them since the early 2000s, but only to determine the presence or absence of a given species.\nWildlife managers in other states have used various methods of employing trail cameras to generate population estimates, but typically with animals with distinct, individual markings.\nThose methods present challenges when applied to mostly identical-looking animals, such as deer and elk. To use existing methods, biologists would have to mark individual animals, which would still require extensive helicopter use.\nTo find a new approach, Fish and Game’s researchers worked with Anna Katherine Moeller, a graduate student at the University of Montana, to test a trio of methods designed to allow biologists to estimate populations of unmarked animals without tracking individuals over time. She referred to the three methods as “Instantaneous Sampling,” “Space-to-Event” and “Time-to-Event.”\nElk herds in the Idaho Panhandle and the Beaverhead Mountains were counted in a February, 2016 case study and the results were promising, particularly Moeller’s “Space-to-Event” model.\n“You’ve got this randomly placed camera grid out there, and they all take pictures at exactly the same time, which is used for a population estimate,” Hurley said. “You get these multiple detection estimates every hour. Each hour is a sampling event, and you kind of roll those up for 24 hours to get a true abundance estimate every day.”\nFor fairly dense herds of deer and elk on winter range, the “Space-to-Event” method works pretty well.\n“It gives an idea, spatially, where animals are, and also in what type of habitat you are most likely to see an animal,” Hurley said. “You can put that together with the area that the camera is actually taking a picture of, and you can roll a density estimate up to abundance.”\nAbundance estimates for the Beaverhead study area near the Montana border between Salmon and Island Park were comparable to prior abundance estimates done with aerial surveys.\nComparing the new camera-based surveys with traditional aerial surveys, which are time-tested and proven accurate, and coming up with similar population estimates signaled to biologists that cameras are likely a viable alternative.\nIn the Panhandle study area — where other abundance methods are difficult to implement — cameras produced the first-ever elk abundance estimates for an area consisting mostly of dense forests.\n“When all was said and done, we knew we were onto something,” Meints said.\nSame photos, more species and more opportunities\nMeints said white-tailed deer surveys in Northern Idaho will be added next — using photos from the same cameras used in the elk survey – and future applications of remote cameras for surveys are nearly unlimited.\n“We’re going to capture photos of everything on the landscape, and down the road, we’re hoping to use all of them,” Meints said. “We have a research team that is embarking on a 10-year-plus project looking at all major ungulates and all major predators. The cameras will play a critical role in that.”\nHurley added that as Fish and Game adapts the program to more species, other methods may work better for estimating abundance.\nFor deer and elk, biologists are hoping the trail cameras can gather data year after year, allowing the department to fill in the gaps between its comprehensive population surveys, which are done on a rotating basis in different areas of the state about every five years.\nThe trail camera surveys will allow biologists to take a more real-time approach in managing elk and deer populations for Idaho’s hunters and adjust seasons and tag allocations based on current data so they accurately reflect the number of animals available.\n“Cameras are going to enable us to do a better job of managing wildlife,” Meints said. “When we don’t have data, or there are gaps in the data, we’re forced to be more conservative with hunter opportunity.”", "url": "https://apnews.com/3de73c89534d42248c3836036ef74cbc"}