{"authors": ["Royal Mcgregor Rmcgregor Oaoa.Com"], "date_download": "2020-05-04 20:06:47", "date_modify": "2020-05-04 20:06:47", "date_publish": "2019-03-22 22:30:00", "description": "For the past four years, Joey Gabarda admitted it has been tough to bring what is known as an East Coast sport to West Texas. West Texas Lacrosse will host its annual recruitment event from...", "filename": "_4f71c7a9c3ee4e41a44493b8ec543419_1588622807.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4f71c7a9c3ee4e41a44493b8ec543419_1588622807.html", "title": "West Texas Lacrosse sets annual recruitment event", "title_page": "West Texas Lacrosse sets annual recruitment event", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "For the past four years, Joey Gabarda admitted it has been tough to bring what is known as an East Coast sport to West Texas.\nWest Texas Lacrosse will host its annual recruitment event from 2 p.m. to 4 p.m. Sunday at Academy Sports and Outdoors in Midland.\nGabarda, the owner of Classic Honda in Midland, said during a phone interview playing lacrosse allowed him the opportunity to play collegiately at a private university.\n“I started playing in the fifth grade,” Gabarda said. “I played it throughout grade school, high school and it’s what put me through college. It’s the fastest growing sport in the country.\n“Sports will teach you leadership. It will teach you courage, risk and it will help you work together as a team. That’s what has made me really successful in my career.”\nWest Texas Lacrosse’s press release detailed the minimum age for a player to participate in its clinics is eight years old. The organization will offer loaner equipment to new players.\nPeople can also register online at westtexaslacrosse.org. Registration is $50 for five sessions or $10 per session. Clinics will begin March 31 at the TURF fields at Scharbauer Sports Complex in Midland.\nGabarda said there were about 50 children in last year’s clinic. He said he believes there should be higher demand for the sport due to the number of scholarships available at the collegiate level.\nThe NCAA has estimated that lacrosse has the highest probability that a male high school athlete will compete in college whether it’s at the Division I, II or III levels. Lacrosse reportedly has a 12.4 probability percent, while ice hockey is second at 11.9 percent. Football and basketball are at 6.9 and 3.4 percent, respectively.\nFor females, lacrosse has the second highest probability at 12.6 percent. Ice hockey ranks No. 1 at 24.5 percent.\nThe NCAA has estimated those statistics with the high school figures from the 2016-17 High School Athletics Participation Survey conducted by the National Federation of State High School Associations, the NCAA details. Data from club teams is not included. College numbers are from the NCAA 2016-17 Sports Sponsorship and Participation Rates Report.\nGabarda graduated from Northwood University in Midland, Mich., in 1997. The Timberwolves are an NCAA Division II member of the Great Lakes Intercollegiate Athletic Conference.\n“A lot of academically good universities whether it’s Division II or Division III, they still give a lot of scholarships for good lacrosse players,” Gabarda said. “Division I is when you get into Syracuse, Princeton and Johns Hopkins and you have to be elite there, but since it’s such a fast growing sport and it’s growing West, there’s a lot of opportunity for the youth.”", "url": "https://apnews.com/4f71c7a9c3ee4e41a44493b8ec543419"}