{"authors": ["Tim Stephens The Herald-Dispatch Tstephens Herald-Dispatch.Com"], "date_download": "2020-05-04 20:16:32", "date_modify": "2020-05-04 20:16:32", "date_publish": "2019-04-07 07:20:35", "description": "ONA — Gavin Beverage threw so far Saturday, Cabell Midland High School's shot put pit couldn't contain him. The Knights' senior threw 64 feet 2.5 inches, the longest in the state this year,...", "filename": "_4487c70cd9d048d88808e3238fa7093c_1588623392.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4487c70cd9d048d88808e3238fa7093c_1588623392.html", "title": "CM's Beverage tops WV shot put", "title_page": "CM's Beverage tops WV shot put", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ONA — Gavin Beverage threw so far Saturday, Cabell Midland High School’s shot put pit couldn’t contain him.\nThe Knights’ senior threw 64 feet 2.5 inches, the longest in the state this year, Saturday during the Carlos Akers/Doc Hale Memorial Track Meet. While every other competitor’s throws made puffs of dust fly from the slag surface of the pit, Beverage’s dented the grass beyond.\n“I’m very happy,” Beverage said of his throw. “As soon as I threw it, I knew it was a personal record.”\nThe heave also set a meet record, easily beating the mark of 56-3 set by Sissonville’s Eric Myers in 2008. The feat is astonishing considering that the 6-foot-4, 310-pound Beverage was nowhere near the record as recently as two years ago.\n“This is a guy who two years ago was throwing 38 feet,” Cabell Midland coach Chris Parsons said. “He’s worked very hard and has improved tremendously.”\nThe secret to Beverage’s gains is twofold — work in the weight room, and instruction from personal coach Angel De La Santos from Chicago.\n“The weight room was a huge help,” Beverage said. “I’ve worked out a lot more since I was a sophomore. Coach Angel changed the way I threw and that’s made a big difference.”\nThe difference is big enough that it transformed Beverage from a middling high school shot putter to a state championship contender with a NCAA Division I college scholarship. Beverage committed to the University of California-Riverside, about 55 miles east of Los Angeles, where he plans to major in biology with a goal of entering the medical field, particularly radiology.\nWhile his mother Samantha and father Tim said they don’t like how far away Beverage will be, they are thrilled he will compete at such a high level.\n“Coach Angel knew their throwing coach and put me in contact with her,” said Beverage, who also considered Illinois State University. “I visited and loved it. They were such wonderful people.”\nBeverage’s story is even more improbable in that his track career began as a hurdler in sixth grade. One day his brother William left a discus in the yard and Beverage picked it up and threw.\n“I thought it was a cool sport,” Beverage said.\nBeverage likes throwing discus, but loves flinging the shot put. The only other sport he has played was some youth league basketball. He also plays sousaphone in Cabell Midland’s band. Beverage said he has little time for other pursuits, being that weightlifting and throwing takes up much of his schedule. He does, however, like to go fishing when he gets the chance, with Stonewall Jackson Lake being a particular favorite place to land bass.\nBeverage’s goal is a state championship, but he also wants to break the state record in the shot put. The mark of 66-9.5 was set in 1984 by two-time Olympian Randy Barnes of St. Albans.", "url": "https://apnews.com/4487c70cd9d048d88808e3238fa7093c"}