{"authors": ["Marialuisa Rincon"], "date_download": "2020-05-04 20:23:15", "date_modify": "2020-05-04 20:23:15", "date_publish": "2019-01-18 06:00:00", "description": "One day soon, a patient suffering from coronary heart disease in The Woodlands may be treated with a method developed by one of their own. Shobha Dasari, a senior at The Woodlands College...", "filename": "_ce49330fa0e24eb6ba8d046e186b0451_1588623795.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ce49330fa0e24eb6ba8d046e186b0451_1588623795.html", "title": "Faces in the crowd: College Park senior Shobha Dasari", "title_page": "Faces in the crowd: College Park senior Shobha Dasari", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "One day soon, a patient suffering from coronary heart disease in The Woodlands may be treated with a method developed by one of their own.\nShobha Dasari, a senior at The Woodlands College Park High School, was named as a scholar in the Regeneron Science Talent Search with her project, “Minimizing Arterial Damage Induced by Coronary Stenting.” Dasari is one of 300 nationwide to receive the honor, and only one of 12 in Texas and the only one in the Houston area to be tabbed.\nDasari designed a similar project during her sophomore year, examining how pressure in the brain caused by tumors affected a patient’s brain function, so when the Science Talent Search call for applications went out, she was already finishing her research into stenting.\n“When it came time to find another thing to research, I knew I wanted to do something similar,” Dasari said.\nCoronary heart disease — the accumulation of plaque on artery walls — is the most prevalent form of heart disease and the leading cause of death in the United States, killing more than 370,000 people every year, according for the Centers for Disease Control and Prevention.\nFor the layman, a coronary stent is essentially a 2- to 5-millimeter metal, tube-shaped piece of mesh that is inserted, then expanded, into a blocked artery to keep it open. It is considered the most effective treamtment, but carries a high risk, with 20 to 30 percent of patients suffering from a collapse of the mesh, which puts pressure on the thin artery wall akin to a 200-pound person standing on one foot.\nWith her project, Dasari sought out to reduce that risk.\n“There’s no better option out there,” Dasari said. “After a certain point, if the amount of plaque is so great, the only solution is to go in there and (insert a mesh).”\nBy manipulating coronary stents in latex tubes standing in for arteries, Dasari’s model explored methods used in civil engineering to evaluate how structurally sound the meshes were and made suggestions on how to improve their structural integrity.\nDasai’s submission to the Science Talent Search was one of almost 2,000 across the country selected by biotechnology company Regeneron and science education non-profit Society for Science & the Public to compete on the scholar level, each of whom receives a $2,000 prize to go toward an education match with $2,000 to their schools’ STEM programs.\n“Dasari was motivated and inspired,” said Maya Ajmera, president and CEO of Society for Science & the Public. “She decided to go out and really dig deep into the research she did.”\nOn Jan. 23, the 300 scholars — the elite of young scientists in the United States — will be whittled down to 40 finalists, who will meet in Washington, D.C. for a week at the beginning of March and compete for the $250,000 grand prize.\nRegeneron’s Director of Corporate Citizenship, Potoula Gjidija said the selection process is rigorous, with 250 science, technology, engineering and mathematics experts serving as judges who evaluate each applicant’s research papers, scientific background, acaemic and extra-curricular history and “potential for scientific leadership.”\n“It provides a platform for us to celebrate and recognize future talent,” Gjidija said. “These are students that have their eyes on solving the problems of our world.”\nmrincon@chron.com", "url": "https://apnews.com/ce49330fa0e24eb6ba8d046e186b0451"}