{"authors": ["Staff Writer"], "date_download": "2020-05-04 21:07:10", "date_modify": "2020-05-04 21:07:10", "date_publish": "2019-04-07 13:30:00", "description": "Today • Today, the Portneuf Sangha, 424 W. Lewis St. in Pocatello, will continue to examine the Buddha’s Eightfold Path with a recorded talk by Jack Kornfield about Right Effort, or the...", "filename": "_8a8bd17ad9064e05ae89bc54dd770213_1588626430.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8a8bd17ad9064e05ae89bc54dd770213_1588626430.html", "title": "Community calendar: April 7-8", "title_page": "Community calendar: April 7-8", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Today\n• Today, the Portneuf Sangha, 424 W. Lewis St. in Pocatello, will continue to examine the Buddha’s Eightfold Path with a recorded talk by Jack Kornfield about Right Effort, or the energy we want to generate to act in accord with our values. The morning begins with chanting practice from 9:15 to 9:45 a.m., followed at 10 a.m. with a 30-minute silent meditation period with guidance offered for those who would like it. After the meditation, the filmed teaching will be shown, and a brief discussion will follow. For more information, contact Paula and Tony Seikel at 208-775-3183 or portneufsangha17@gmail.com or visit portneufsangha.org.\n• The Pocatello Unitarian Universalist Fellowship will have a worship service at 4 p.m. today at the church at 309 N. Garfield Ave. All are welcome. “How Race and Class Impact our Approach to the Lent and Easter Season” is the theme of the service, with the Rev. Jenny Peek as the worship leader. Plan to Linger Longer after the service for refreshments and fellowship.\n• “Stan & Ollie” will be shown at 4:30 and 7 p.m. today in the Bengal Theater. Laurel and Hardy, the world’s most famous comedy duo, attempt to reignite their film careers as they embark on what becomes their swan song — a grueling theater tour of post-war Britain. Admission is $3 for the public, $2 for ISU staff and free for ISU students with Bengal ID. For trailer and more information, go to www.pocatellofilmsociety.com/stan.\nMonday\n• There will be Summer ASA Softball Umpire Clinic at 5:30 p.m. Monday in Council Chambers at Pocatello City Hall.\n• The Human Relations Advisory Committee will meet at 5:30 p.m. Monday in the Iwamizawa Conference Room at Pocatello City Hall.\n• Old Town Actors Studio presents its seventh annual burlesque show, “Let’s Misbehave,” at 7:30 p.m. April 8. This is a show for grown-ups only. Call 208-478-6886 for reservations. Tickets are $12. OTAS is at 427 N. Main St., Suite G, in Pocatello. Call 208-478-6886 for reservations.", "url": "https://apnews.com/8a8bd17ad9064e05ae89bc54dd770213"}