{"authors": ["Kelsey Rettke Krettke Shawmedia.Com"], "date_download": "2020-05-04 20:09:26", "date_modify": "2020-05-04 20:09:26", "date_publish": "2019-04-30 00:28:00", "description": "SYCAMORE – Makhai Rhodes, 9, laughed as he contorted himself to fit in the middle of the giant front wheel of a green John Deer combine harvester Monday, surrounded by his third grade classmates...", "filename": "_db52a885e3904fd3b0693fb2e832f19b_1588622966.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_db52a885e3904fd3b0693fb2e832f19b_1588622966.html", "title": "Annual Ag History Expo teaches third-graders about farming", "title_page": "Annual Ag History Expo teaches third-graders about farming", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SYCAMORE – Makhai Rhodes, 9, laughed as he contorted himself to fit in the middle of the giant front wheel of a green John Deer combine harvester Monday, surrounded by his third grade classmates from Littlejohn Elementary School.\nIt was day four of the annual Ag History Expo at the DeKalb County Farm Bureau, sponsored by the DeKalb School District, Farm Bureau, and the DeKalb Area Agricultural Heritage Association. Rhodes, along with third-graders from District 428 schools, enjoyed a full day of interactive sessions at the bureau, dissecting a corn kernel, learning about farming and the history of the DeKalb Winged Ear logo, and even shucked some corn.\n“My favorite part was about the soil,” Rhodes said. He thought about it again for a second, adding “No actually, the combine.”\nStudents rotated around seven different stations Monday, each with a different educational presentation or activity, presented by bureau staff and volunteers. They talked about soil for growing crops, and what the process looks like for farmers to bring a seed to a crop able to be harvested.\nRhodora Collins, Ag Literacy Coordinator for the farm bureau, has been talking agriculture for 21 years, and said the expo, now its in second year, helps kids understand the scope of the industry.\n“One thing I’m asking every group of children, and I think I’ve only had one who knew [so far], is ‘What is agriculture?’ ” Collins said after her last teaching session of the day.\nBy the end of the day Tuesday, Collins had instructed over 550 students on the in’s and out’s of farming, and how agriculture isn’t just about cows and corn.\n“I think they know what farming is, but they don’t know the word ‘agriculture’ or the fact that it’s the entire industry, farming included,” Collins said. “It provides us with virtually all of our food, some of our clothing. Agriculture is very important in all of our live and in our county. It’s a big part of our history and heritage here.”\nCollins said brainstorming for different ways to teach kids about the agricultural community around them began two and a half years ago, when the DeKalb-based District 428 was looking for ways to improve their social studies program for the third grade.\n“They were looking for ways to incorporate history into the curriculum,” Collins said. “We say down and talked about how our area’s history is so rich with agriculture. I want the kids to understand the context of modern day because many don’t know what modem-day agriculture looks like.”\nDuring Collins’ session on following a seed through the different seasons of planting, Barret Gaffney, 9, was eager to share that he already knew what a biplane for crop dusting was, since he saw it in a movie.\n“I learned all the cool stuff that’s in corn,” Gaffney said, as he helped shuck corn outside.\nCollins said she often observes that to many students, learning about the agriculture industry is something new.\n“I have noticed that some of our students who may have immigrated from Mexico or elsewhere have closer farm connections that children who were born here,” she said.\nTuesday will close out the annual expo, which organizers say couldn’t happen without the help of volunteers provided by the DeKalb County chapter of Future Farmers of America.", "url": "https://apnews.com/db52a885e3904fd3b0693fb2e832f19b"}