{"authors": ["Connor Kilpatrick", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Sarah Lazare", "Luke Savage", "Michael Arria", "Katie Halper"], "date_download": "2020-05-04 19:52:01", "date_modify": "2020-05-04 19:52:01", "date_publish": "2019-12-18 00:00:00", "description": null, "filename": "2019_12_krystal-ball-rising-the-hill-msnbc_1588621921.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/12/18165605/krystal_ball3_original.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_12_krystal-ball-rising-the-hill-msnbc_1588621921.html", "title": "Krystal Ball Is the Anti-Rachel Maddow Bernie Fans Have Been Waiting For", "title_page": "Krystal Ball Is the Anti–Rachel Maddow Bernie Fans Have Been Waiting For", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "And for a growing segment of the American public — disproportionately online — it’s exactly what they’ve been waiting for. In June, the show started off with 6,000 of them subscribing on YouTube. After a mere six months, subscribers now number over 172,000. (Ball has more than 220,000 followers on Twitter, quickly climbing.) And despite a feisty yet traditional polish that’s closer to Fox News than Vice , Ball is more and more shaping up to be their champion.\nWatching Rising is like you just woke up a decade into some mass political realignment, in which the Bloombergians, the Paul Ryans, the Clintonites, and even the Obamicans have all been swept into the dustbin of history, leaving only two poles standing: Bernie Sanders and Steve Bannon.\n“I do think part of the power of it is that it looks mainstream,” Ball says as we sit in the café at the Newseum in Washington, DC. She’s just finished shooting Rising for the day, still in makeup and wardrobe. “There we are, sitting behind an anchor desk. I’m wearing my jewel-colored sheath, or whatever, with my professional makeup and hair done. And then we start talking, and it sounds way, way different. From the topics we choose, to the way that we think about them, to the way that we engage with each other, and with guests, to the type of debates we have.”\nAfter the Democrats won back the Kentucky governor’s mansion in November, she turned the show over to a heavily accented Kentucky Teamster official. The bullet point read: “Ditch Ukraine. Embrace class.” The effect is something like if Robin Roberts and George Stephanopoulos suddenly burst into trash-talking “neoliberals” and chuckling about “ the PMC .”\nThat’s how Ball’s “On My Radar” graphic read the morning after Kamala Harris dropped out. The “Radar” segment is a kind of aggressive left-populist take on Bill O’Reilly’s infamous Talking Points Memo. “Prepare for a holiday season of neoliberal tears,” she said, closing it out with a huge grin. Another recent monologue focused on whether or not Obama would step up to stop Sanders. “Many of the elite preservers of the status quo in the Democratic Party would rather see Trump re-elected than Bernie as president,” Ball said. “Remember, they’re all making money under Trump. That includes Obama. That includes the oligarchs. That includes the professional managerial class,” or PMC. (Her “On My Radar” bullet points that morning: “They Prefer Trump,” “Wake-Up Call”).\nBut when you start listening to what they’re saying, that’s when Rising becomes a very surreal experience.\nIf you were to watch it all in the manner that millions of Americans catch morning news broadcasts (in the background, while making coffee and toast), you could be forgiven for thinking you were tuning in to one of any dozen Good Morning America clones. Democracy Now! this is not.\n“I guess I’d call it conventional but playful,” she tells me. “But these days, I must confess, it’s also a little tongue in cheek.”\nOn Rising with Krystal & Saagar , Ball’s political talk show at TheHill.com, it is always a good morning. And Ball and her conservative cohost, Saagar Enjeti, are always happy to bring us an amazing show. The studio is sleek and modern in that Star Trek–bridge sort of way with impeccably designed graphics easily up to CNN’s standards. The music is bright and upbeat, as if threatening to break into a Mighty Mighty Bosstones cover. Both Ball and Enjeti are always smartly dressed, gleaming smiles all around, with Ball’s colorful wardrobe crushing the competition.\n“Good morning, everyone! Welcome to Rising . Saagar, what kind of show do we have today?” she asks her cohost.\nKrystal Ball looks like she belongs on TV. She sounds like it, too — if you’re not paying attention.\n“I was completely non-political growing up,” Ball says as we stroll by a chunk of the Berlin Wall at the Newseum. An actual rifle tower from Checkpoint Charlie looms over us. “I couldn’t have even told you the difference between a Democrat and a Republican until probably close to college.”\nShe grew up in King George County, Virginia, where she still lives, commuting an hour and a half to work. (“It’s awesome to go to the grocery store and run into someone I grew up with who does not give a shit at all about the things that we’re fixated on every day.”)\nAfter graduating from the University of Virginia with a degree in economics, she moved to East Liverpool, Ohio, once known as “the pottery capital of the world,” a time Ball calls “most influential for me, politically.” Steel mills in the surrounding Mahoning Valley kept the region steady with nearly 10,000 jobs — until they began to vanish in the 1980s.\n“Today,” she tells me, “the thing that East Liverpool is most known for is this horrible photo that went viral of two adults who had OD’d in the front seat with a child strapped into the backseat.” A police officer, she points out, shared the photo on social media.\nAt twenty-eight, she ran for congress in Virginia as a Democrat at the height of the Tea Party movement in one of the most conservative districts in the state, going door-to-door with her two-year-old daughter in a stroller. And while that campaign was closer to Obamaism than the economic populism she would later embrace, it seems to have sparked the beginning of a leftward trajectory.\n“The DCCC [The Democratic Congressional Campaign Committee] literally will take your phone and go through it. They call it rolodexing, and see if you have enough wealthy people in your phone to be able to raise $200,000 or $300,000 right out of the gates.” I ask her if they did that to her. “Yes, they did.”\nA few months into the race in the fall of 2010, photos surfaced of Ball in a bawdy college Halloween costume. The photos were silly, innocuous, and thoroughly PG-13, but in the media climate still stuck in the conservative W years, they were more than enough to finish off her insurgent campaign.\n“For a brief moment, I was one of the most googled people in the world,” as she put it on a recent episode of Rising .\nBut the attention and sympathy from liberals led to regular spots on MSNBC. And then as a host on The Cycle , part of an attempt by the network to cultivate Millennial talent. But Ball might’ve been more than they bargained for. It was there in 2014 that she delivered a powerful and prescient monologue urging Clinton not to run for president.\n“We’re now at a moment of existential crisis as a country. We’re recovering slowly from the Great Recession, but as we pick our heads up at where we’re heading, we don’t like what we see.”\nWhile the rest of the Democratic Party elites were still patting themselves on the back for reelecting Obama, Ball alone at MSNBC saw the fires on the horizon. She cited inequality statistics, the decline of workers’ rights, the rise of a ruling class, and Clinton’s complicity in all of it.\n“Don’t run, Hillary,” she said. “Don’t run.”\nShortly after it aired, she was called into her boss’s office. Clinton World, it seems, was not at all pleased.\n“After that, every time I was going to do another monologue on Hillary Clinton, I had to get it approved by the president of the network,” she tells me. “That’s not a normal thing.” Ball’s show was canceled in the summer of 2015.\n“I would do these MSNBC pieces on inequality, or the plutonomy, or Piketty, or how I thought Hillary Clinton was going to lose, and it felt very lonely. Honestly, it has felt very lonely until basically this moment,” she tells me. “But it’s also kind of funny that it would be so radical to just actually talk about class politics, and actually not go out of your way to smear Bernie Sanders every day.”\nWarren has leaned more and more into gender and identity and less into the core of her critique of power,” Ball says. “I mean, she actually said that Deval Patrick of Ameriquest and Bain Capital would be a ‘must have’ in her cabinet. What?!\nAfter MSNBC, she started a PAC called the People’s House Project (PHP), dedicated to the goal of putting working-class candidates in Congress. PHP backed the Marine vet and severely crew-cut Rich Ojeda for West Virginia’s 3rd Congressional District — who introduced himself to voters with an intense four-minute video of him pumping iron — as well as former ironworker Randy Bryce in Wisconsin’s 1st. Both men looked and sounded about as far from a 2010s Ivy League Democrat as one could get — at one of Ojeda’s earlier campaign BBQs, a childhood acquaintance beat him with brass knuckles, then attempted to run him over with a truck. Both men won their primaries, too — but lost in the general.\nOjeda, however, received the largest swing of Trump voters toward Democrats in any congressional district that year, likely due in part to his prominent role in supporting the West Virginia teachers’ strike.\n“They have been a godsend,” Ojeda said of Ball’s support.\nWhile mainstream Democrats saw little more than a redneck state senator who openly admitted to voting for Trump — less an error of judgment than an unforgivable sin for many — Ball saw something else entirely: a spark of working-class populism that might catch on in Trumpland. And the total opposite of the MSNBC green rooms she knew so well.\n“Ojeda is a guy who, in his community, had a ton of credibility and trust, and was a true working-class guy, and just got that to his core. It was instinctive. I could not have told him, in southern West Virginia, what to say, or how to say it, or whatever. He just knew how to talk to people.”\nThat she was drawn to a candidacy like Ojeda’s after her time at MSNBC shows just how unlikely Ball’s career is. And how far she’s moved from her congressional run.\n“If her views have accelerated,” her cohost, Enjeti, says, “it’s not a result of her departure. It’s a result of the times we live in.”\nBecause Krystal Ball is very good at what she does. It’s just surprising that what she does even exists.\nWhereas MSNBC celebrates the Democratic Party’s takeover by affluent moderates, Rising seems to revel in attacking anyone or anything that smacks of “PMC.” Just as liberals tune in to Rachel Maddow to have a well-dressed wonk make them feel smart, Rising fans live to roast (and troll) that very demographic. With Harris out, Pete Buttiegieg is now a favorite punching bag of Ball’s, calling him the candidate of “generational change, which really just means the status quo, only from a younger dude.” (Her “On My Radar” bullet point for the candidate: “OK Boomer.”)\n“I guess it comes from always having a foot in both worlds, so to speak,” she tells me. “I grew up in rural Virginia, where I actually live now to this day, in a place that Trump won by something like thirty points.” (In a recent podcast interview, she video-chatted in from her car, apologizing because there was little broadband access in her hometown.)\nBut look no further than her take on Elizabeth Warren, a candidate she once gave a thumbs-up to in her MSNBC days, but who Ball now eviscerates regularly on her show as “a perfect candidate for the type of liberal that the media is,” and — even more damning in the world of Rising — the winner of “the Rachel Maddow vote.” (Maddow, despite being a former colleague, has been the target of heavy criticism on Rising for spreading what Ball calls “feverish, Russian conspiracy theories.”)\nWarren, for Ball, is someone “relentlessly cheerful and unflappable. Never cross. Always ready with a plan or a folksy quip. Or a tale from her upbringing on the ragged edge of the middle class. A sort of peppy, silver-sneakers cheerleader with the right answer always ready to go,” she said in November. “But every once in a while, Warren’s mask slips.”\nFor a former supporter, it’s quite a turn. “I practically begged her to run against Hillary in 2016,” Ball says. At the time, “Warren seemed to be an antidote.” She cites Warren’s failure to endorse Sanders in the last election plus her recent rhetorical shifts. “She’s leaned more and more into gender and identity and less into the core of her critique of power,” Ball says. “I mean, she actually said that Deval Patrick of Ameriquest and Bain Capital would be a ‘must have’ in her cabinet. What?!”\nBut sometimes, it sounds like Ball’s skepticism is rooted in an intimate familiarity with Warren’s appeal — and her own professional-class instincts: “Warren can’t get a B on the test, she has to get an A. As a natural pleaser, ‘A’ student, rule follower? I get it,” she said in a recent Rising monologue. “I really do.”\nBall doesn’t dispute it. “I’ve absorbed all the ‘good girl’ cultural programming that comes with being raised in an American middle-class household,” Ball tells me. “My natural mode is rule worshipper, pleaser. I still hate confrontation, and I hate making people uncomfortable.” She points out a tic she has on Rising — a nervous laugh to break the tension after she goes on the attack. “Ultimately, though, you’ve got to be willing to fight for the things and the people you say you are fighting for, whether it’s personally comfortable or not. I guess that is why I have so much scorn for the kind of civility politics of the PMC crowd. The lives of working people literally depend on those of us with a modicum of power being willing to be uncomfortable.”\nThe morning we met in her Washington studio, shortly after Sanders’s fiery, post–heart attack debate, numerous media outlets including NBC, New York magazine, and the Washington Post had mysteriously misattributed Sanders’s searing attack on the health insurance industry to Elizabeth Warren.\n“Maybe it’s an honest mistake, but then you look at all the outlets that repeated his honest mistake, you look at the overall tone of his coverage and the direction that it always goes in,” she says, rolling her eyes. “I think a lot of it with Bernie Sanders is the fact that his support is disproportionately working class. These aren’t the people that newsrooms are filled with. They just genuinely don’t understand his appeal or think that he has an appeal, really, to speak of.”\nBall’s familiarity with that green-room world though is what makes watching Rising so much fun. She’s the anti-Maddow. It’s as if she’s defected from the enemy, ready to spill all their secrets.\nIn a segment on CNN’s selling of Buttigieg as the new Obama, Ball gives us an insider’s view as to how exactly cable news picks favorites: “Basically, the reporter and the producer decide whatever angle they’re looking for. Then they find someone willing to parrot that angle that they’ve devised back to them. Just watch and learn.” (“On My Radar” headline this time: “LOL CNN” with a “Condolences to the Media” bullet point.)\n“I’m going to be on CNN this weekend, actually,” she says, sighing. “We’re going to talk about impeachment and Ukraine.”", "url": "https://www.jacobinmag.com/2019/12/krystal-ball-rising-the-hill-msnbc"}