{"authors": ["Paul Heideman", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Rob Larson", "Corey Robin", "Shawn Gude", "Neal Meyer"], "date_download": "2020-05-04 19:50:09", "date_modify": "2020-05-04 19:50:09", "date_publish": "2019-06-13 00:00:00", "description": null, "filename": "2019_06_bernie-sanders-democratic-socialism-freedom_1588621809.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/13114131/GettyImages-1149507019.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_bernie-sanders-democratic-socialism-freedom_1588621809.html", "title": "Bernie: Freedom Is a Democratic Socialist Value", "title_page": "Bernie: Freedom Is a Democratic Socialist Value", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Bernie Sanders’s latest defense of democratic socialism was a frontal assault on many of the cliches that are held to govern American politics. Its very title — “How Democratic Socialism Is the Only Way to Defeat Oligarchy and Authoritarianism” — elicited incomprehension and laughter from his Democratic primary competitors. Colorado senator Michael Bennet, one of the many indistinguishable mediocrities crowding the Democratic field, told a reporter, “I don’t think the American people even know what that means . . . Nobody in my town halls talks about democratic socialism versus oligarchy and authoritarianism.”\nWhile it’s always edifying to see a politician talk about what his voters don’t understand, Bennet would have done well to get past the title of Sanders’s speech, and listen to its actual content. The core of the address dealt with questions most voters understand all too well — medical debt, skyrocketing housing costs, overwork, and jobs that literally steal the lives of the poor.\nWhat was most notable about Sanders’s discussion of these issues, however, was how he framed them. All of these injustices of capitalism, he argued, were infringements on people’s freedom.\nFor a long time, freedom seemed like the ideological province of the Right. Milton Friedman’s famous defense of capitalism was called Capitalism and Freedom. And many on the Left played into this, rejecting freedom, choice, and liberty as “bourgeois values,” incompatible with socialism.\nThe result was a necessarily defensive posture. Instead of arguing that capitalism was violating the values people held, too many leftists argued that people should have different values. Predictably, few were convinced.\nSanders took the opposite approach in his speech yesterday, asking:\nAre you truly free if you are unable to go to a doctor when you are sick, or face financial bankruptcy when you leave the hospital? Are you truly free if you cannot afford the prescription drug you need to stay alive? Are you truly free when you spend half of your limited income on housing, and are forced to borrow money from a payday lender at 200 percent interest rates? Are you truly free if you are seventy years old and forced to work because you lack a pension or enough money to retire? Are you truly free if you are unable to go to attend college or a trade school because your family lacks the income? Are you truly free if you are forced to work sixty or eighty hours a week because you can’t find a job that pays a living wage? Are you truly free if you are a mother or father with a new born baby but you are forced to go back to work immediately after the birth because you lack paid family leave? Are you truly free if you are a small business owner or family farmer who is driven out by the monopolistic practices of big business? Are you truly free if you are a veteran, who put your life on the line to defend this country, and now sleep out on the streets?\nWith all of these, Sanders took aim at one of the central dogmas of contemporary capitalism: that it enhances freedom.\nMost Americans, however, don’t experience it that way. Student loan debt doesn’t feel like freedom. Neither does losing your health insurance because you’ve changed jobs. Rationing insulin because it’s too expensive is not what most people think of when they think of liberty. Far from capitalism’s home turf, freedom is a value that, for most of us, it will never realize.\nSanders’s emphasis on freedom as a socialist value is also what allows him to connect the many different manifestations of capitalism’s pathologies. When he talked about the rise of authoritarian leaders like Viktor Orbán and Jair Bolsonaro, he didn’t portray them as illiberal “populists,” but rather different manifestations of the same threat to freedom represented by the 1 percent in the United States. When he applauded women fighting for abortion rights and immigrants fighting the deportation and detention machine, he celebrated their struggles as different fronts in the effort to expand people’s freedoms.\nSanders refuses to be put on the defensive for his advocacy of democratic socialism. Sanders’s capitalist opponents see this as his key weakness. But in their confidence that they’ve found his, they may be underestimating how precisely he has identified theirs.", "url": "https://jacobinmag.com/2019/06/bernie-sanders-democratic-socialism-freedom"}