{"authors": ["Jeremy Brecher", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Kim Moody", "Arlene Inouye", "Jane Mcalevey", "Joey La Neve Defrancesco", "Joe Burns"], "date_download": "2020-05-04 19:59:50", "date_modify": "2020-05-04 19:59:50", "date_publish": "2019-04-24 00:00:00", "description": null, "filename": "2019_04_strike-jeremy-brecher-interview-teachers_1588622390.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/04/24143739/GettyImages-1144219410.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_04_strike-jeremy-brecher-interview-teachers_1588622390.html", "title": "There’s Still Power in a Strike", "title_page": "There’s Still Power in a Strike", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Interview by Mark Engler\nOn April 11, thirty-one thousand workers at Stop & Shop supermarkets throughout New England walked away from their delis, checkouts, and storerooms to form picket lines outside their stores. Their action, which lasted until a tentative deal was reached last Sunday, is the largest private-sector strike in the US in several years. It follows a year of notable unrest, in which steelworkers, Marriott hotel employees, and public school teachers in West Virginia, Oklahoma, and beyond all boycotted work to force concessions from employers.\nAs historian Jeremy Brecher can attest, such actions might be unusual by recent standards, but they have deep precedent in American history.\nIn 1972, Brecher, a writer and New Left activist, published the book Strike!, which went on to become a classic of labor history. At the time there was little like it available for readers who wanted a popular account of the country’s tumultuous legacy of class struggle. The books that did exist tended to focus on the institutional formation of different unions or the lives of top leaders.\nBrecher took a different approach. Channeling Rosa Luxemburg, he focused on moments of mass unrest among workers, describing how these disruptive outbreaks — often organized outside of unions’ formal bureaucratic channels — not only shaped industrial conflict in the US, but also affected the working conditions of millions of people.\nA sweeping survey that covered nearly a century of labor history, Strike! has since appeared in several editions — with successive updates addressing the setbacks of the Reagan era, the UPS Strike of 1997, and twenty-first-century “mini-revolts” like the mass immigrant rights marches of 2006 and Occupy Wall Street.\nBrecher is currently preparing another update for the book’s fiftieth anniversary. Mark Engler, a Philadelphia-based writer, recently spoke with him about the wave of education actions, the new forms that strikes are taking in the Trump era, and the enduring power of walking out. Their discussion has been edited for length and clarity.", "url": "https://www.jacobinmag.com/2019/04/strike-jeremy-brecher-interview-teachers"}