{"authors": ["Matthew Paras The Washington Times"], "date_download": "2020-05-04 20:28:54", "date_modify": "2020-05-04 20:28:54", "date_publish": "2019-05-14 14:47:38", "description": "Wizards fans can count on seeing Zion Williamson next season. Unfortunately for them, it will be when he comes to Washington with the visiting New Orleans Pelicans. The Wizards entered...", "filename": "_b8c5b014fb39a2de0817fc70774a026e_1588624134.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b8c5b014fb39a2de0817fc70774a026e_1588624134.html", "title": "Wizards lose Zion Williamson sweepstakes, land ninth pick in NBA draft", "title_page": "Wizards lose Zion Williamson sweepstakes, land ninth pick in NBA draft", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Wizards fans can count on seeing Zion Williamson next season. Unfortunately for them, it will be when he comes to Washington with the visiting New Orleans Pelicans.\nThe Wizards entered Tuesday’s NBA draft lottery with a 9% chance of landing the first overall pick, but the night’s big ping-pong ball winner was New Orleans, which won the No. 1 pick and the right to take the former Duke star on June 20.\nAnd in a disappointing result for the Wizards, Washington landed the ninth-overall pick despite having the sixth-worst record in the league. The Wizards fell after both the Los Angeles Lakers and the Memphis Grizzlies jumped into the top four.\nStill, Washington is in a position to draft a quality player. Washington needs help after a 32-50 season in which it missed the postseason and fired longtime general manager Ernie Grunfeld.\nThe Pelicans, without a doubt, were the big winners of the night. Following a season in which star Anthony Davis demanded a trade, they ended up with the opportunity to pick Williamson regarded as a surefire prospect. With his 6-foot-7, 285-pound frame and his freakish athleticism, Williamson soared to the top of draft boards after a dominant season at Duke. He is, perhaps, the most hyped prospect since LeBron James.\nOutside of Williamson, this year’s draft considered to be top heavy with talent includes Duke’s R.J. Barrett, Murray State star Ja Morant and Virginia swingman De’Andre Hunter.\nMorant and Barrett are regarded as the best two prospects after Williamson, and will likely be gone by the time Washington picks. Hunter, ranked fifth on ESPNs Big Board and as the sixth-best player by The Ringer, will also likely be gone.\nOther possibilities include Texas Tech’s Jarrett Culver, Duke’s Cam Reddish, Vanderbilt’s Darius Garland, North Carolina’s Coby White, Gonzaga’s Brandon Clarke and Guinea’s Sekou Doumbouya.\nAfter New Orleans, Memphis gained the second pick, New York drew the third and the Lakers will pick fourth. Following those four, Cleveland, Phoenix, Chicago and Atlanta will pick ahead of Washington.\nThe NBA unveiled the results on a half-hour television special on ESPN before the start of the Western Conference Finals between the Golden State Warriors and Portland Trail Blazers.\nDeputy commissioner Mark Tatum revealed the order live on the air, but the lottery selection is actually determined in a back room with reporters and executives present. The league draws ping-pong balls from a machine to determine the first four picks. After the four are chosen, the teams are ordered by the worst-regular season records.\nThis was the first year in which the NBA reformatted its lottery in an attempt to discourage tanking.\nBefore, the team with the worst record had a 25% chance to earn the first overall pick, which critics believe incentivized teams to lose as many games as possible. As a fix, the NBA voted in 2017 to level out the odds so that the teams with the three worst records would have an equal 14% shot at landing the first pick. The change went into effect in 2019.\nFor the Wizards, they will now have to determine who will be responsible for choosing their draft pick. Owner Ted Leonsis has yet to hire Grunfeld’s replacement, with Grunfeld’s No. 2, Tommy Sheppard, tabbed as interim GM.\nSheppard remains a candidate for the full-time position. Washington has also reportedly interviewed former Hawks general manager Danny Ferry and Oklahoma City assistant general manager and D.C. native Troy Weaver. Now that the Nuggets are out of the playoffs, Denver’s Tim Connelly is rumored to be interested in the job, as well.\nThe Wizards have picked ninth three times in franchise history, but haven’t done so since 1979 when they picked Tom Hammonds.\nMore recent No. 9 picks include forward Kevin Knox, guard Dennis Smith, center Jakob Poeltl, center Frank Kaminsky, forward Noah Vonleh, guard Trey Burke and center Andre Drummond.", "url": "https://apnews.com/b8c5b014fb39a2de0817fc70774a026e"}