{"authors": ["Paul Schott"], "date_download": "2020-05-04 20:17:59", "date_modify": "2020-05-04 20:17:59", "date_publish": "2019-04-04 17:51:13", "description": "STAMFORD — The downtown Stamford Corners apartment complex, at 1455 Washington Blvd., has sold for $60 million in the city’s largest property sale so far this year. Los Angeles-based 1455...", "filename": "_f027278fee5c41e19a987fec697e9310_1588623479.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f027278fee5c41e19a987fec697e9310_1588623479.html", "title": "Downtown Stamford apartment complex sold for $60M", "title_page": "Downtown Stamford apartment complex sold for $60M", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STAMFORD — The downtown Stamford Corners apartment complex, at 1455 Washington Blvd., has sold for $60 million in the city’s largest property sale so far this year.\nLos Angeles-based 1455 Washington Boulevard LLC sold the building to Deer Park, N.Y.-based Stamcon Holdings LLC, according to city property records.\nThe business address for 1455 Washington Boulevard LLC is the same as Los Angeles-based real estate investment firm CIM. Other CIM assets include 432 Park Avenue, the 1,396-foot-tall condominium tower in midtown Manhattan.\nA message left for CIM was not returned.\nThe sale price is almost identical to the property’s appraisal value listed in the online real estate database, Vision Appraisal. The approximately 200-unit 1455 Washington was built in 1999, and also sold for about $60 million in a 2006 transaction.\nApartments are available at 1455 Washington at monthly rents between about $2,150 and $3,100, according to realtor.com.\nThe sale netted the state $450,000 in conveyance taxes.\nAmong other recent sales, a future self-storage facility at 370 W. Main St. sold for $5.5 million.\nAt the turn of the year, the downtown office complex at 600 Summer St. changed hands for about $18 million.\nOther sales in the past few months have included the site of the Stamford Marriott hotel, which sold last October for about $32 million, and a two-building complex at 1111-1117 Summer St., which was bought last October for around $12 million.\npschott@scni.com; 203-964-2236; twitter: @paulschott", "url": "https://apnews.com/f027278fee5c41e19a987fec697e9310"}