{"authors": ["Express-News Editorial Board"], "date_download": "2020-05-04 20:03:42", "date_modify": "2020-05-04 20:03:42", "date_publish": "2019-05-04 05:00:00", "description": "Being tough on crime means being smart on crime. It means recognizing what cases to prioritize and how best to use limited resources. It means understanding some people accused of crimes...", "filename": "_29109fe458a64034b825e7e1cdcd7f58_1588622622.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_29109fe458a64034b825e7e1cdcd7f58_1588622622.html", "title": "Gonzales hitting mark with reforms", "title_page": "Gonzales hitting mark with reforms", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Being tough on crime means being smart on crime.\nIt means recognizing what cases to prioritize and how best to use limited resources. It means understanding some people accused of crimes should never be in jail, but others should not be released pretrial out of concern for the safety of victims and the community.\nDistrict Attorney Joe Gonzales gets this. It’s early in his term, but Gonzales is moving forward with a number of smart and overdue reforms that should keep more people accused of low-level, nonviolent crimes out of the overcrowded Bexar County Adult Detention Center, and he’s offering opportunities for these defendants to avoid ever being charged for these crimes.\nOn the other end of the spectrum, prosecutors have been working nights and weekends to address a backlog of family violence cases — another campaign promise from Gonzales.\nBy far the biggest reform Gonzales has promised voters is a meaningful cite-and-release program. This is when certain nonviolent misdemeanors are treated similarly to tickets. Picture charges such as marijuana possession of 4 ounces or less, criminal mischief, theft and theft of service — not paying for one’s bill at a restaurant.\nUnder this program, defendants facing such misdemeanors will be given tickets and asked to appear at Bexar County’s Reentry Services building within 30 days. They may be asked to take a course, perform community service or enter drug treatment. If such conditions are met, then charges are never filed. And, of course, if conditions are not met, then charges will be filed and it’s back to the old way of doing things.\nBut the old way of doing things isn’t always the best way of doing things. That’s the point of cite and release and other reforms.\nGonzales had hoped his cite-and-release program would be running by now, and so did we. But it looks as if it won’t launch until this summer when new ticket books finally arrive. Part of this delay reflects the work Gonzales has put in to get this right. Gonzales has buy-in from the San Antonio Police Department and the Bexar County Sheriff’s Office, the two largest local law enforcement agencies.\nGonzales told us a successful program might serve 100 people a month. In terms of dollars and cents, that would mean 100 people a month who aren’t languishing in jail for minor crimes at considerable taxpayer expense. In terms of supporting families, that would mean 100 people a month who could stay employed and live with their families, or who might participate in a program to meaningfully change their lives.\nBut this is also not the only reform in play.\nGonzales will no longer be charging most homeless people with criminal trespass. This policy change follows the tragic case of Jack Michael Ule, 63, a homeless man from Ohio who died in jail in April. He was charged with criminal trespass.\nThere will be exceptions to this rule, but the basic premise is that homeless people need to be guilty of something more than being homeless to be jailed for criminal trespass. We agree.\nUle was in jail on a $500 bond, which is yet another reminder about the inherent unfairness and absurdity of the cash bail system. One that rewards wealthy defendants, but punishes poor defendants and has absolutely nothing to do with community safety.\nGonzales has said he has instituted a policy for prosecutors to recommend personal recognizance bonds for such nonviolent cases. He’s going where Bexar County’s judges have refused to go.\nHe’s also considering declining charges for small amounts of marijuana possession and trace amounts of other drugs.\nThese are all welcome reforms that highlight an intention to bring fairness to the system, but it’s more than that. It’s also about focus. The community is better served prosecuting violent crime (remember the backlog of family violence cases he inherited) than clogging the jail with low-level offenses.\nGonzales is lighting the way, and Bexar County’s judges, who have been so resistant to bail reform and other changes, should follow.", "url": "https://apnews.com/29109fe458a64034b825e7e1cdcd7f58"}