{"authors": ["Matt Bruenig", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Matt Karp", "Hadas Thier", "Tim Higginbotham"], "date_download": "2020-05-04 19:51:01", "date_modify": "2020-05-04 19:51:01", "date_publish": "2019-11-01 00:00:00", "description": null, "filename": "2019_11_elizabeth-warren-medicare-for-all-taxes-financing-plan_1588621861.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/11/01112714/46962741104_be68503e45_o.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_11_elizabeth-warren-medicare-for-all-taxes-financing-plan_1588621861.html", "title": "Elizabeth Warren’s Plan to Finance Medicare for All Is a Disaster", "title_page": "Elizabeth Warren’s Plan to Finance Medicare for All Is a Disaster", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nElizabeth Warren released her Medicare for All financing plan today. The main purpose of the proposal appears to be to find a plan that you can message as “not increasing middle class taxes,” which is of course a nonsensical goal insofar, as Warren herself has said, what matters is middle-class health care costs, not whether you categorize those costs as premiums, taxes, or out-of-pocket expenses. Nonetheless, bowing to the stupid media discourse on this, Warren put forward a financing proposal that is clearly unworkable and bad. The proposal is as follows: Employers will be required to pay an “employer Medicare contribution” equal to 98 percent of their per-employee health care costs in the year prior to Medicare for All’s implementation. This will mean that initially some employers pay more than others since that is already the case in the status quo. But over time, each employer’s contribution will be gradually converged to average employer Medicare contribution until every qualifying employer is paying the same amount per employee. Employers with less than fifty employees would be exempt from the employer Medicare contribution both initially and forever. Independent contractors (and the companies who hire them) will also be exempt from the employer Medicare contribution both initially and forever.\nBad Distribution What Warren is proposing here, in ordinary fiscal language, is a Medicare head tax. This is a departure from the normal Medicare payroll tax proposals. The distributive difference between them is that the Medicare payroll tax charges a specific percentage of each worker’s earnings, while the Medicare head tax charges a specific dollar amount per worker. To illustrate the difference, I have the following two graphs. The first one shows the difference in terms of employer-side taxes paid by worker earnings level. Under the 8 percent employer-side payroll tax, the employer taxes paid for a worker earning $15,000 per year is $1,200, while the employer taxes paid for a worker earning $200,000 per year is $16,000. Under the $9,500 employer-side head tax, the employer taxes paid is $9,500 for both workers. The second graph is the same as the first, except the vertical axis is done as percent of earnings rather than dollar amounts. In this graph, the $9,500 head tax is equal to 63 percent of the earnings of the worker making $15,000 per year, but only equal to 5 percent of the earnings of the worker making $200,000 per year. For the employer-side payroll tax, it is 8 percent for everyone. Needless to say, the Medicare payroll tax is far superior to the Medicare head tax distributively speaking. Specifically, the Medicare head tax charges middle and low earners massively more than the Medicare payroll tax does. Elizabeth Warren’s team realizes this. The reason they are using the head tax is because they think they can trick journalists into declaring that this is not a tax, since it is expressed in dollar terms rather than percent terms. On first glance, this might seem like a stretch that probably won’t work. But it is a more plausible strategy once you consider that journalists are mostly very stupid and cannot evaluate policy claims on their own, relying instead on trusted sources and names (Warren being one of those names). NEW: Elizabeth Warren finally reveals how she’d pay for Medicare for All. Taxes on employers, corporations, 1% + revenue via war savings and immigration reform. Her advisers peg the cost at $20.5 trillion. Contra Bernie Sanders, no middle class taxes.https://t.co/rYyQ59zRLG — Sahil Kapur (@sahilkapur) November 1, 2019\nEasily Evaded Separate from the distributive problems of Warren’s head tax, the two exclusions also make the proposal clearly unworkable and easily gamed. All companies have to do to avoid rather large head tax charges is spin off workers into independent contractor status or spin them off into firms with less than fifty employees that they then contract with for services. Once some employers start doing this, the average Medicare employer contribution will have to go up to keep revenue stable, which will push even more employers to restructure their labor into independent contracting or outsourcing to small firms. And, at that point, the death spiral is off to the races. The genius of the payroll tax, of course, is that it is unable to be evaded like this. Every dollar of labor income — even independent contractor income — is charged the same. No restructuring can save you from it.", "url": "https://www.jacobinmag.com/2019/11/elizabeth-warren-medicare-for-all-taxes-financing-plan"}