{"authors": ["Liza Featherstone", "Mike Davis", "Peter Frase", "Seth Ackerman", "Chris Brooks", "Edward Carver", "Branko Marcetic", "Leigh Phillips", "Sam Lewis", "Mímir Kristjánsson"], "date_download": "2020-05-04 19:52:18", "date_modify": "2020-05-04 19:52:18", "date_publish": "2019-05-07 00:00:00", "description": null, "filename": "2019_05_climate-change-student-strikes-green-new-deal_1588621938.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/05/07092358/GettyImages-1136454743.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_05_climate-change-student-strikes-green-new-deal_1588621938.html", "title": "The Scale of the Problem", "title_page": "The Scale of the Problem", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Alexandria Ocasio-Cortez often says of the climate crisis that we need a solution on the scale of the problem. She’s is the first US politician to have advanced one that even comes close: the Green New Deal. But to get there, and to get something that comes close, we also need a movement on the scale of the problem. In the last couple months, we’ve just begun to see the beginnings of such a thing.\nTaking profits away from people who now enjoy and benefit from them is not a mere “ask” (a funny bit of nonprofiteering jargon that has crept into current movement lingo). Transforming our economy away from fossil-fuel dependency and toward one powered by renewable energy sources is a seismic economic transformation, just as abolishing US slavery was in the nineteenth century.\nAlthough abolition didn’t mark the end of capitalism, it was a massive expropriation of property — no wonder it couldn’t be done peacefully and by mere moral suasion. It took the violent deaths of more than six hundred thousand — 2 percent of the population — to end slavery. The change we need today can be accomplished without mass violence, but not without a mass movement, and that movement needs to be everywhere — making the current system as ungovernable as slavery was in wartime.\nWe are starting to see this scenario unfold. In the United States, members of the Sunrise Movement have been getting arrested at their representatives’ offices, demanding that they sign onto the Green New Deal. In the UK, members of the Extinction Rebellion have been gluing themselves to the fences of Parliament and shutting down the Tube. Parliament has already met their first demand — a national declaration of climate emergency. The US Extinction Rebellion movement is now gathering momentum too, making a more modest demand: that New York City declare a climate emergency.\nIn a similar westward motion across the pond, the student climate strikes started by Greta Thunberg, which spread so quickly across Europe and are now held every Friday, have arrived in the United States. Organized in part by Ilhan Omar’s sixteen-year-old daughter, Isra Hirsi, students went on strike from school in March, and again last Friday in Seattle, Phoenix, Salt Lake City, Houston, Austin, Oklahoma City, Minneapolis-St. Paul, Des Moines, St. Louis, Chicago, Madison, Pittsburgh, Harrisburg, State College and Lancaster, Pennsylvania, Philadelphia, New York City, Albany, Hartford, all across Massachusetts and in many other cities and towns. In most cases, they held protests at government offices.\nIn New York City, the striking students held a sit-in at City Hall, and also on the Brooklyn Bridge, demanding, with Extinction Rebellion, that New York City declare a climate emergency. Nationally, they’re demanding a Green New Deal, among other extremely concrete proposals. They’re also pushing all the presidential candidates to participate in a climate debate, a depressingly low bar (more like an “ask”).\nThis movement is organizing and growing quickly after years of stagnation.\nInfluenced by the climate movement in Europe — as well as by the recent dire warnings, from science and lived experience alike — the US climate movement is moving quickly beyond the nonprofit industrial complex, which produces a lot more direct mail than direct action. We’re now hearing the early rumblings of the movement that’s actually needed, with constant action at every level, from legislative bodies to the streets — and a sense that the subject of climate action has become inescapable. In the mid-nineteenth century, black and white abolitionists alike created a culture in which the evils of slavery were constantly discussed and debated. In London, Extinction Rebellion has done this with climate change. We may get there, too.\nThis new movement distinguishes itself by a willingness to tell the truth — that we could be facing disaster, even human extinction — and to confront the horror of that truth. Extinction Rebellion, as its name suggests, is honest about that. On Truth-Telling Thursdays, activists set up tables and tell people, without sugarcoating, how bad the climate crisis is, signing them up for the movement.\nFor many people, though, denial remains the most popular option. (Not ideological Fox News–style climate denial, but rather the form that many of us deploy as often as possible: thinking about anything other than climate change.) For most of us, it hasn’t been worth exiting that comfortable fog just to participate in the occasional ineffectual protest. That’s changed for two reasons: it’s becoming impossible to hide from the problem, and the movement is growing so fast that change looks possible. Now that it actually might matter, leaving that safe haven of denial seems worth it.\nAnother reason this movement is growing so fast, and might eventually win, is its understanding that climate change requires a massive economic change that is at least comparable to the ending of slavery. That’s why it is so intertwined with — and at least in part made possible by — the recent resurgence of socialism. This movement understands that the problem, and all its major solutions, are economic in nature and also massive.\nKarl Marx and his comrades wrote an open letter (a thing you could do even before Medium.com) to that “single-minded son of the working class,” Abraham Lincoln, congratulating him on his 1864 re-election and on his “matchless struggle” against slavery and for “the reconstruction of a social world.” He lyrically describes how inspired the European masses had been by emancipation, and how they welcomed a “new era of ascendancy” for the American working class.\nSo do we. The conflict with the Slaveocracy was a solution on the scale of the problem of slavery. Our movement — we hope — doesn’t have to be that violent but it absolutely has to be that big.", "url": "https://www.jacobinmag.com/2019/05/climate-change-student-strikes-green-new-deal"}