{"authors": ["Jeff Mordock The Washington Times"], "date_download": "2020-05-04 20:31:22", "date_modify": "2020-05-04 20:31:22", "date_publish": "2019-05-01 18:32:15", "description": "A former CIA officer pleaded guilty Wednesday to giving Chinese spies information about the agency's top-secret operations in China. Jerry Chun Shing Lee, a naturalized U.S. citizen who left...", "filename": "_7d6bb99ccba159980304544a205ea1fc_1588624282.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7d6bb99ccba159980304544a205ea1fc_1588624282.html", "title": "Jerry Chun Shing Lee, former CIA officer, spied for China", "title_page": "Jerry Chun Shing Lee, former CIA officer, spied for China", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A former CIA officer pleaded guilty Wednesday to giving Chinese spies information about the agency’s top-secret operations in China.\nJerry Chun Shing Lee, a naturalized U.S. citizen who left the CIA in 2007 after 13 years, pleaded guilty to conspiring to communicate, deliver and transmit national defense information to the People’s Republic of China. He will be sentenced on August 23 and faces a maximum of life in prison, though he’ll likely receive a more a lenient punishment.\nAuthorities arrested Lee in January 2018 in New York after he arrived in the U.S. on a flight from Hong Kong. He was indicted last May and initially charged with illegally possessing classified information.\nIt is the third case in less than a year in which a former U.S. intelligence officer has pled guilty or been convicted of conspiring with Chinese intelligence services to transfer national defense secrets.\nAssistant Attorney General for National Security John C. Demers said the cases were a “tragic betrayal of country and colleagues.”\nProsecutors say that two Chinese intelligence officers offered to pay Lee for information starting in 2010 and he continued to receive directions through at least 2011.\nThe intelligence officers offered to take care of Lee for life in exchange for his cooperation, preparing a gift of $100,000 in cash according to court documents.\nThe investigation was part of a joint probe by the FBI-CIA, investigating how the Chinese government penetrated the CIA’s covert methods of communicating with its spies.", "url": "https://apnews.com/7d6bb99ccba159980304544a205ea1fc"}