{"authors": ["Eric Schucht The Banner-Press"], "date_download": "2020-05-04 20:06:09", "date_modify": "2020-05-04 20:06:09", "date_publish": "2019-02-19 20:09:00", "description": "All-day preschool will soon be offered at public schools in Butler County. The David City Public Schools Board of Education approved implementing an all-day preschool option for the 2019-20...", "filename": "_51c445288a64436e96ede05aab22ab71_1588622769.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_51c445288a64436e96ede05aab22ab71_1588622769.html", "title": "David City Public School to offer all-day preschool", "title_page": "David City Public School to offer all-day preschool", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "All-day preschool will soon be offered at public schools in Butler County.\nThe David City Public Schools Board of Education approved implementing an all-day preschool option for the 2019-20 school year at a recent meeting.\nPreschool at Bellwood Elementary will be extended from a half to full day. Currently, Bellwood only offers a morning session from 8 a.m. to 11:15 a.m. Monday through Thursday. Now, it will be expanded to 3:30 p.m. five days a week. David City Elementary will offer the same all-day program in addition to its current morning and afternoon half-day programs.\nBellwood Principal Danielle Beerbohm said the program expansion will help fulfill a need in the area. The school loses many potential preschoolers to day care providers in David City or Columbus because the Village of Bellwood currently lacks such facilities. She said the new program will benefit students, families and the community as a whole.\n“The national research shows that kids are better off later in life the more they have exposure to education,” Beerbohm said. “I just think it’s a really good opportunity for our kids in the district, (an) opportunity for parents to have some structure and have some place for their kids to go.”\nThe Board also approved hiring an additional preschool teacher for David City to start work during the next school year. The school’s current preschool teacher, Julie Zrust, will continue to run her half-day program while the new hire will take on the all-day program.\nDavid City currently offers three half-day preschool sessions, one in the morning and two in the afternoon, while Bellwood only offers a morning. This preschool program is for children ages 3-4, and sometimes 5, depending on the cut-off date. Once the new program is implemented, parents will have the option for their preschoolers to be in school for a full day or a half day.\nLyshelle Jisa has taught preschool at Bellwood for the past five years. The school’s half day afternoon session was recently discontinued due to dwindling numbers. As so, Jisa taught at Bellwood in the morning and David City in the afternoon. With her focus now shifting back solely to Bellwood for the all-day session, she said it will help the program and the community.\n“I’m really excited for us to have a whole day program,” Jisa said. “I think that will really help our community out. There’s a lot of parents where day care is a huge issue right now because there’s nothing in Bellwood. So it’s really nice to have those parents be able to have that option.”\nSuperintendent Chad Denker said the lack of child care in Butler County has deterred many from moving to the area. He said he hopes the change will encourage families to move into the school district.\n“People aren’t going to move to the area if there isn’t quality housing, quality day care and schools,” Denker said. “So, hopefully, if we do our part, we can see that happen.”\nEric Schucht is a reporter for The Banner-Press. Reach him via email at eric.schucht@lee.net.", "url": "https://apnews.com/51c445288a64436e96ede05aab22ab71"}