{"authors": ["Jared Fialko", "Wral Multimedia Sports Journalist"], "date_download": "2020-05-04 20:28:46", "date_modify": "2020-05-04 20:28:46", "date_publish": "2019-03-12 02:08:00", "description": "NC State and Clemson open Wednesday's second round of the ACC Tournament in Charlotte. The last time they got together, all it took for the Pack to walk away winners? Four missed Marcquise Reed...", "filename": "_32398c28afee349114bfdd686202bb37_1588624126.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_32398c28afee349114bfdd686202bb37_1588624126.html", "title": "Pack preps for potential play-in game", "title_page": "Pack preps for potential play-in game", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NC State and Clemson open Wednesday’s second round of the ACC Tournament in Charlotte. The last time they got together, all it took for the Pack to walk away winners? Four missed Marcquise Reed free-throws and a Braxton Beverly buzzer-beating heave.\n“It was a really fun game to be a part of with a really fun ending, but that was a couple of weeks ago, that’s in the past,” says NCSU guard Braxton Beverly. “We can’t rely on another last second shot to get the win.”\nWhen the final horn sounds this time though, it may be signify the end for the fallen’s Big Dance dreams. Both sides right on the cusp, 9-9 in ACC play, both with 1-8 marks against Top 25 teams.\n“I can’t say honestly if we’re living on the bubble,” admits NCSU head coach Kevin Keatts. “If the new standard is the NET, then all I can tell you is we’re 32 in the NET. So, I don’t know if that’s the bubble or not.”\nIf there’s one thing you know about the Selection Committee, it is that you never know. So, in essence, this could be a play-in game.\n​“Honestly, NCAA Tournament predictions and things like that, I try to leave that to the experts,” says NCSU guard Torin Dorn. “I just try to go out and play as hard as possible and let the chips fall where they may.”\n“Start with Clemson, whoever is up after them, handle that, and hopefully get into that championship game,” says NCSU guard C.J. Bryce “And then we’ll worry about whatever happens after that.”\n“We’re blessed to be in a position to play meaningful basketball in March, and there’s nothing else that you could want or ask for,” Dorn says. “So, it’ll just be two teams that are extremely hungry to play.”​\nIs this the scenario: winner, set for Selection Sunday. Loser, left hoping the resume’s already good enough. When asked if he thought they were already an NCAA Tournament team in his opinion, Dorn replied, “In my opinion? I wouldn’t be a competitor if I said no, right?”", "url": "https://apnews.com/32398c28afee349114bfdd686202bb37"}