{"authors": ["Walter Williams"], "date_download": "2020-05-04 20:06:03", "date_modify": "2020-05-04 20:06:03", "date_publish": "2019-04-03 08:10:29", "description": "Sometimes, during my drive to work, I listen to Clarence Maurice Mitchell IV, host of the Baltimore's WBAL C4 radio show. Mitchell was formerly a member of Maryland's House of Delegates and its...", "filename": "_8c5116b0b42945078afccb24a959bfbb_1588622763.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8c5116b0b42945078afccb24a959bfbb_1588622763.html", "title": "More police on campuses is not the cure", "title_page": "More police on campuses is not the cure", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sometimes, during my drive to work, I listen to Clarence Maurice Mitchell IV, host of the Baltimore’s WBAL C4 radio show. Mitchell was formerly a member of Maryland’s House of Delegates and its Senate. In recent weeks, Mitchell has been talking about the terrible crime situation in Baltimore. In 2018, there were 308 homicides. So far this year, there have been 69. That’s in a 2018 population of 611,648 — down from nearly a million in 1950. The city is pinning its hopes to reduce homicides and other crime on new Police Commissioner Michael Harrison.\nAnother hot news item in Baltimore is the fact that Johns Hopkins University wants to hire 100 armed police officers to patrol its campuses, hospital and surrounding neighborhoods. The hospital president, Dr. Redonda Miller, testified in Annapolis hearings that patients and employees are “scared when they walk home, they’re scared when they walk to their cars.”\nPhiladelphia’s Temple University police department is the largest university police force in the United States, with 130 campus police officers, including supervisors and detectives.\nIn 1957, I attended night school at Temple University. There was little or no campus police presence. I am sure that people who attended Johns Hopkins, University of Chicago, and other colleges in or adjacent to black neighborhoods during the ’40s, ’50s and earlier weren’t in an armed camp.\nIn the nation’s largest school districts that serve predominantly black youngsters, school police outnumber, sometimes by large margins, school counseling staffs. Again, something entirely new. I attended predominantly black Philadelphia schools from 1942 to 1954. The only time we saw a policeman in school was during an assembly where we had to listen to a boring lecture on safety. Today, Philadelphia schools have hired more than 350 police officers. What has happened to get us to this point? Will hiring more police officers and new police chiefs have much of an impact on crime?\nNo doubt hiring more and better trained police officers will have some impact on criminal and disorderly behavior — but not much unless we create a police state. The root of the problem, particularly among black Americans, is the breakdown of the family unit where fathers are absent. In 1938, 11 percent of blacks were born to unmarried women. By 1965, that number had grown to 25 percent. Now it’s about 75 percent. Even during slavery, when marriage between blacks was illegal, a higher percentage of black children were raised by their biological mothers and fathers than today. In 1940, 86 percent of black children were born inside marriage. Today, only 35 percent of black children are born inside marriage. Having no father in the home has a serious impact. Children with no father in the home are five times more likely to be poor and commit crime, nine times more likely to drop out of school and 20 times more likely to be in prison.\nOur generous welfare system, in effect, allows women to marry the government. Plus, there is shortage of marriageable black men because they’ve dropped out of school, wound up in jail and haven’t much of a future. Unfortunately, many blacks followed the advice of white liberal academics such as Johns Hopkins professor Andrew Cherlin who in the 1960s argued that “the most detrimental aspect of the absence of fathers from one-parent families is not the lack of a male presence but the lack of male income.” Cherlin’s vision suggested that fathers were unimportant and if black females “married the government,” black fathers would be redundant.\nMost of today’s major problems encountered by black people have little or nothing to do with racial discrimination and a legacy of slavery. People who make those excuses are doing a grave disservice to black people. The major problems black people face are not amenable to political solutions and government anti-poverty programs. If they were, then they’d be solved by the more than $20 trillion the nation has spent on poverty programs since 1965. As comic strip character Pogo said, “We have met the enemy and he is us.”\nWalter Williams is a syndicated columnist. To learn more about him, go to the website at www.creators.com.", "url": "https://apnews.com/8c5116b0b42945078afccb24a959bfbb"}