{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:06:51", "date_modify": "2020-05-04 20:06:51", "date_publish": "2019-03-24 14:15:00", "description": "The Rome Music Teachers Association recently sponsored a Romantic Competition in Brookes Chapel at Shorter University. Chairpersons were Amy Neal and Dr. Jerico Vasquez. Students performing...", "filename": "_bdaa08698b3b44f88b510cf8423ec35e_1588622811.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bdaa08698b3b44f88b510cf8423ec35e_1588622811.html", "title": "Rome Music Teachers Association - Romantic Competition", "title_page": "Rome Music Teachers Association - Romantic Competition", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Rome Music Teachers Association recently sponsored a Romantic Competition in Brookes Chapel at Shorter University. Chairpersons were Amy Neal and Dr. Jerico Vasquez.\nStudents performing were Christopher Neal, Mac Walker, Kaelyn Vasquez, Clay Sabino, Hadley Davis, Jack Heath, Ansley Combes, Cal Sabino, Margaret Gaines, Malachi McRoy, Meredith Walker, Ellie Schwartz, Grayson Davis, Samuel Duncan, Shiloh St. Clair, Elijah Gentry, Anna Rose Reid, Charlie Shane, Charis McRoy, Matthew George, and Calvin Stovall.\nWinners in the Early-Late Elementary Division were Clay Sabino-Outstanding Performance and Ansley Combes-Award of Excellence.\nIn the Intermediate-Advanced Division, the winners were Charis McRoy-Outstanding Performance and Calvin Stovall-Award of Excellence.\nJudging the event was Huu Mai, artist in residence at Kennesaw State University.\nTeachers whose students participated were Kay Greene, Amy Neal, Kathryn Nobles, Shelley Reid, Dr. Jerico Vasquez, and Kyla Zollitsch.\nThe association invites the public to visit their website at www.romemta.com for additional information regarding Rome Music Teachers Association.", "url": "https://apnews.com/bdaa08698b3b44f88b510cf8423ec35e"}