{"authors": ["Ron Jackson"], "date_download": "2020-05-04 20:17:09", "date_modify": "2020-05-04 20:17:09", "date_publish": "2019-03-16 11:00:00", "description": "Who wouldn’t want to be in a position to guarantee that your children get admitted into the college of their choice? Even when it may not be the choice of the child. To call a parent’s “by all...", "filename": "_f5adeaeb8d9d4ebea89fc27bc27e137e_1588623429.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f5adeaeb8d9d4ebea89fc27bc27e137e_1588623429.html", "title": "Ron Jackson: Buying an education just tip of the iceberg", "title_page": "Ron Jackson: Buying an education just tip of the iceberg", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Who wouldn’t want to be in a position to guarantee that your children get admitted into the college of their choice? Even when it may not be the choice of the child. To call a parent’s “by all means necessary” decision a scandal worthy of federal investigation is really ridiculous. The only factor making it scandalworthy is that the participants were part of an elite class most Americans cannot relate to. It is nothing more than elite parents, elite kids and elite institutions following a different set of guidelines.\nThis was a case where the Golden Rule was aptly applied. I don’t mean the moral rule most pretend to follow but the literal rule that states, “He who has the gold makes the rules.” At various levels, knowingly or unknowingly, we have all witnessed it. It is not always about money; more times than not the rule is enforced by people in position of golden influence.\nSo, why are we so up in arms about a few rich kids getting admitted into certain elite academic institutions over possibly more qualified applicants merely because their parents could easily afford it? OK, their parents could bribe decision makers. That is not out of the norm. That is a part of the college admission process. Every student is not admitted based upon academic qualifications. No, some get preferential treatment that allows them admission over a more qualified student. Most of those preferential admission rules are institutionally implemented. Some are government-mandated policy.\nHow is getting into the college of choice over a more-qualified student because of an ability to pay any different than an academically unqualified student being admitted for just one year based on athletic ability? Or how is a student admitted because they meet an established racial quota any less privileged than a wealthy student?\nIn all three cases, a very qualified student may be passed over. There is no way in hell we can be expected to believe that every student in every college athletic team photo or on the bench can read at college level. In every race-based admission, are we to believe there was not a more-qualified applicant who was overlooked?\nSome rich, super-athletic students are given one year admissions to elite sports colleges. These one-’n’-done revenue generators take away opportunities from real student athletes. That should be a scandal, but it is not. It is the norm. It is acceptable to the government, the schools and the public. But we frown upon a financially affluent student who uses his or her best asset to attend the school of their parent’s choice?\nIn the currently reported school admission scandal, a couple of cited examples are laughable. Two students had their athletic prowess embellished and accompanied with a financial incentive to get a sports-based admission. Both students who received a sports admission had almost zero athletic ability and even less than zero interest in sports. Their applications included doctored photos showing them participating in athletic endeavors. That is fraud, yes. But what about the thousands of kids who have their academic prowess grossly embellished by referring to them as student athletes? Where is the fraud in giving a student with zero interest in academics that same type of sports admission? In both cases, the institutions generate revenue. That is the bottom line.\nWhy is it acceptable for institutions of higher learning to generate money off the bodies of poor, academically challenged students but unfair to do same off the bank accounts of wealthy-but-academically-challenged students? Why is it acceptable that some students of equal or higher academic qualifications be denied admission because they do not meet a race quota?\nColleges have varied preferential admission standards including legacy admissions, sports admissions, race admissions and academic admissions. Why are financial admissions taboo? Especially, when there are not that many.\nIf the economically elite are allowed to buy justice, buying a seat in a classroom and a degree should not be considered scandalous. It should be called overzealous parenting.", "url": "https://apnews.com/f5adeaeb8d9d4ebea89fc27bc27e137e"}