{"authors": ["Staff Writer"], "date_download": "2020-05-04 20:25:18", "date_modify": "2020-05-04 20:25:18", "date_publish": "2019-02-15 05:01:00", "description": "Danny D’Antoni was livid. Marshall University’s head coach was the most irate, most infuriated, most incensed I have seen him in five years. He was that angry after witnessing...", "filename": "_21e71190e1344c2c947a7160d99b61c0_1588623918.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_21e71190e1344c2c947a7160d99b61c0_1588623918.html", "title": "One defeat too many for D'Antoni", "title_page": "Chuck Landon: One defeat too many for D'Antoni", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Chuck Landon: One defeat too many for D’Antoni\nDanny D’Antoni was livid.\nMarshall University’s head coach was the most irate, most infuriated, most incensed I have seen him in five years.\nHe was that angry after witnessing Marshall’s too little effort and too many turnovers performance in a 77-68 loss to UAB Thursday night.\nWhen D’Antoni stormed into the media room after the game it was like a tsunami had blown in.\nThen the real storm started.\n“Marshall means too much for me not to go down in a fight,” he said. “That was no fight.”\nNext, the thunder started.\n“Lackadaisical,” said D’Antoni, spitting out the word as if it were a vile obscenity. “ I haven’t felt like this since my first year.”\nThen, somebody made the mistake of asking D’Antoni about Marshall’s bench play.\n“I don’t like our bench,” he thundered. “There’s no strength. Life is about strength and passion. We don’t have any.”\nWas he being too harsh?\nNo.\nD’Antoni simply had gotten to the end of his rope. His reservoir of patience wasn’t just depleted, it was drained as if someone had pulled the plug.\n“There’s no roses after this one,” he said with a razor-edge in his tone.\nThen, the subject of turnovers was mentioned. It was one of the keys to this significant defeat, as Marshall committed 15 while UAB had only six. That led to an enormously important 17 points off of turnovers for the Blazers to only three points for Marshall.\nThat’s a 14-point differential in a nine-point loss.\nIt was, of course, a sore subject for D’Antoni.\n“No fight,” he declared. “No force. Lackadaisical. Being sharp with the ball. I don’t even know what to say, I’m so livid.”\nNow, that’s livid.\n“I don’t like our spirit, our effort, our focus — from the first guy to the 15th guy,” said D’Antoni, dropping the words as if they were hand grenades. “Sometime before this last game we’ve got to find it.”\nThe Thundering Herd also has to find a handle for the basketball. Besides the immense point differential, yet another turnover actually ended Marshall’s rally during the closing minutes.\nMarshall had closed the score to a 70-67 deficit on a driving layup by C.J. Burks with 58 seconds remaining. Next, Jon Elmore stepped in front of a UAB pass into the post for a steal. The senior point guard pushed the ball hard down the court and took it tough to the rim, but UAB’s Tavin Lovan blocked Elmore’s layup.\nYet, the Herd still had another chance after that, until Rondale Watson committed a turnover — No. 15 — with only 29 seconds remaining.\nThat was the final straw.\nThen, Elmore seemed to echo his coach’s words, but in a subdued voice.\n“We have to learn to fight,” he said. “We have to learn to compete. We have to look inward. At the end of the day, players have to make plays.\n“We have to look inward.”\nWhether it’s inward or outward, the view isn’t very pretty right now.\nIt’s as rough as D’Antoni’s disposition.\nChuck Landon is a sports columnist for The Herald-Dispatch. Contact him at clandon@herald-dispatch.com.", "url": "https://apnews.com/21e71190e1344c2c947a7160d99b61c0"}