{"authors": ["Stephen Dinan", "Alex Swoyer", "Stephen Dinan The Washington Times"], "date_download": "2020-05-04 20:03:50", "date_modify": "2020-05-04 20:03:50", "date_publish": "2019-04-14 21:20:22", "description": "White House Press Secretary Sarah Sanders would not say Sunday whether President Trump will order the Internal Revenue Service not to release his tax returns to House Democrats as they renew their...", "filename": "_18c1fd34ecb1d1dfc710be05342aed3f_1588622630.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_18c1fd34ecb1d1dfc710be05342aed3f_1588622630.html", "title": "Members of Congress not smart enough to review Trump's tax returns", "title_page": "Sarah Sanders: Members of Congress not smart enough to review Trump's tax returns", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "White House Press Secretary Sarah Sanders would not say Sunday whether President Trump will order the Internal Revenue Service not to release his tax returns to House Democrats as they renew their efforts to force the disclosure.\n“The president has been clear since the beginning as long as his taxes are under audit, he will not release them,” Mrs. Sanders told “Fox News Sunday.”\nThe pushback comes after House Democrats set a new deadline over the weekend for Mr. Trump to turn over his tax returns after the Treasury Department missed the original deadline Wednesday, giving the IRS 10 more days before it is deemed to be stonewalling.\nMrs. Sanders, though, said even if members of Congress were to obtain the president’s tax returns, she doesn’t trust they are intelligent enough to understand them.\n“My guess is most of them don’t do their own taxes,” she said. “This is all about political partisanship. This is a dangerous, dangerous road.”\nSome House Democrats didn’t like the implication.\n“Our freshman class includes intelligence analysts, nurses, veterans, and ahem law professors,” wrote Rep. Katie Porter, California Democrat and a tenured law professor who sits on the Financial Services Committee.\nRep. Ted Lieu, California Democrat, facetiously vowed that “if we are not smart enough to understand them, we will send them back. Pinky promise.”\nRep. Richard E. Neal, Massachusetts Democrat and House Ways and Means Committee chairman, insisted he is not on a mission to embarrass Mr. Trump, but rather looking to engage in normal legislative oversight in this case to see whether the IRS is doing its job.\nHe said he wants the returns in hand by April 23, and said neither the Trump administration nor the courts can undercut him.\n“Indeed, the Supreme Court has consistently noted that the motivations underlying congressional action are not to be second guessed, even by the courts,” Mr. Neal wrote.\nTreasury Secretary Steven Mnuchin earlier this week sent a letter making clear he would blow through Mr. Neal’s original April 10 deadline for turning over the returns for Mr. Trump and some of the organizations affiliated with him, including one of his golf courses.\nMr. Mnuchin said that while Congress does have investigative powers, they must be flexed in pursuit of a legislative purpose. The comments of some of Mr. Neal’s committee members saying they want to see Mr. Trump’s returns out of political payback or to embarrass the president could undercut the chairman’s legal standing.\nThere also appears to be an odd game going on in that Mr. Neal keeps writing his requests directly to the IRS, but it’s Mr. Mnuchin who responded the last time.\nThe April 23 deadline falls in the middle of the House’s two-week spring break, which began Wednesday.", "url": "https://apnews.com/18c1fd34ecb1d1dfc710be05342aed3f"}