{"authors": ["Amanda Christman"], "date_download": "2020-05-04 20:04:43", "date_modify": "2020-05-04 20:04:43", "date_publish": "2019-04-29 00:00:00", "description": "A local police officer is now realizing a lifelong goal of working for the commonwealth at the state Capitol. Jim Patterson served as a municipal police officer for 16 years, working in Kline...", "filename": "_6874eeb551f24029a3dd3ca3a61e9fe3_1588622683.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6874eeb551f24029a3dd3ca3a61e9fe3_1588622683.html", "title": "Area Officer Achieves His Dream, Joins Capitol Police", "title_page": "Area Officer Achieves His Dream, Joins Capitol Police", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A local police officer is now realizing a lifelong goal of working for the commonwealth at the state Capitol. Jim Patterson served as a municipal police officer for 16 years, working in Kline Twp., McAdoo, Mahanoy City and Sugar Notch and for the Hazleton Area School District. But, after years of waiting, March 25 was his first day on duty with the Capitol Police in Harrisburg. “It was always my main goal to be a full-time officer for the state of Pennsylvania,” Patterson said. He joins a host of other locals who joined the ranks of Capitol police and splits his time between greater Hazleton and Harrisburg. The Bureau of Police and Safety, simply called Capitol Police, was established in 1895, making it the second oldest state government police department in the United States. Its officers protect employees and visitors to the Capitol Complex, according to its website. They are charged with conducting patrols and traffic stops, answering calls for help, directing traffic and serving on protective duties and escort details, Patterson said. And, so far it has been a great place to work. “I love it and the officers there are great, too,” he said. Some of his new colleagues he knew from the Navy, where he is a reservist. Patterson said he saw a familiar face approach him on his first day, a man he served with in the Navy who shook his hand and welcomed him aboard. Then he felt a push from behind and when he turned around, saw another friend from the Navy. Patterson has been in the Navy Reserve for eight years, serving as master-at-arms, and enlisted for another six, having been deployed once during that time to the Middle East for one year during Operation Enduring Freedom. His position in the military is close to police work and allows him to continue his passion for helping and protecting people, he said. “I always felt that was my true calling in life. I always felt there was no other job for me,” he said. Patterson looks forward to spending at least 20 more years with the Navy and the Capitol Police. He applied a few times to the Capitol Police, starting about five years ago, and kept pushing forward until he was hired. He had a lot of role models growing up who served as police officers. One in particular was Charles Altmiller, an officer in Patterson’s then hometown of Drums. Altmiller embodied the qualities Patterson wanted to live up to, he said. To children having the same aspirations as him, he told them to be honest and respectful to people. He said he has come across a number of youths who showed desire to serve in the military or police but were not living up to the qualities that people in those positions should have. “That’s not going to fly if you have a real passion to help people,” he said. Patterson is father to a 13-year-old daughter. He graduated from Hazleton Area High School in 1995 and then from Lackawanna Police Academy in 2002 before finishing up his associate degree in criminal justice in 2003. Contact the writer: achristman@standardspeaker.com; 570-501-3584", "url": "https://apnews.com/6874eeb551f24029a3dd3ca3a61e9fe3"}