{"authors": ["Lisa Backus"], "date_download": "2020-05-04 21:07:04", "date_modify": "2020-05-04 21:07:04", "date_publish": "2019-03-20 17:21:10", "description": "On the campaign trail, savings from the Department of Correction were supposed to help Gov. Ned Lamont pay for a property tax credit for the middle class, but in his first two-year budget,...", "filename": "_38c52e1d69df4fdc9b3cfc8d4d27eecd_1588626424.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_38c52e1d69df4fdc9b3cfc8d4d27eecd_1588626424.html", "title": "Inmate health care, union contract drive up CT corrections department budget", "title_page": "Inmate health care, union contract drive up CT corrections department budget", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "On the campaign trail, savings from the Department of Correction were supposed to help Gov. Ned Lamont pay for a property tax credit for the middle class, but in his first two-year budget, spending on the agency will increase $35 million.\nThe increase, according to the department, is necessary to address collective bargaining agreements and inmate health care.\nThe increases also include $8 million over two years in new money to provide medication-assisted treatment to inmates who are dealing with opioid addiction and money to provide inmates with identification cards upon release from prison.\nAt the same time, the agency will reduce overtime by $5 million by hiring more corrections officers, save nearly $4 million by closing three units at the Northern and Bridgeport Correctional Institutions and two cottages at the Mason Youth Institution and reduce $1 million in overtime for parole and community services.\nThe largest increases come from collective bargaining wage increases and adjustments for deficiencies in the 2019 budget, corrections staff said. In all, Lamont is recommending spending $8 million more on the DOC in 2020, bringing the agency’s budget up to $616 million, and another $27 million increase in fiscal year 2021.\nNewly confirmed DOC Commissioner Rollin Cook said he inherited the agency’s transition from using Correctional Managed Health Care within the University of Connecticut Health Center for medical treatment for inmates to a system provided by the department.\nHealth care for inmates has become an issue in recent years with several filing state and federal lawsuit against the state and former DOC Commissioner Scott Semple over what they said was sub-standard medical treatment that has led to deaths.\nHealth care workers within the state’s prison system rallied in September, pointing out that staffing shortages have reached dangerous levels.\nDOC took over health care from UConn on July 1. Since then, Cook told members of the Appropriations Committee, 34 health care staff have been hired, an additional 10 are slated to start this month and another 84 are in various points of the hiring process.\n“I would like to recognize and applaud our incredible health care staff and their efforts under very difficult circumstances. I know it has been extremely challenging for them, especially considering the staffing concerns we face, yet they have shown up every day and given 110% in all of their responsibilities,” Cook told the committee. “Upon the transition of the provision of inmate health care from UCONN to DOC, we inherited a significant number of vacancies. This difficult situation was compounded with the departure of a number of medical staff resulting from the natural uncertainties surrounding a change of this magnitude”\nNationally there’s a shortage of physicians and advance practice registered nurses making recruitment a challenge, he said.\n“The provision of appropriate health care while incarcerated is essential to achieving better offender outcomes and is also required by our constitution,” he said. “We must not neglect these facts and ensure we meet the national standard of care. No exceptions!”\nOver the past few years, the agency has reduced its budget by $79 million as the state’s incarcerated population has decreased by 21 percent, Cook said. But any further reductions will likely come from a cut in recidivism rates which are connected to services provided while incarcerated he said.\nThe agency worked with the state Office of Policy and Management to craft the expansion of the medication-assisted treatment program for offenders who are addicted to opioids to help them remain sober after release.\n“Fifty-two percent of people in Connecticut who died of a drug overdose had at one point been in a correctional facility,” officials from the Office of Policy and Management said. “This investment will help promote both a safer environment for corrections officers and greater recovery among people in prison with opioid use disorders.”\nThe DOC program would cost $2 million in 2020, $6 million in 2021 and $6 million in 2022.\nThe Undersecretary of Criminal Justice, Marc Pelka, who shaped the proposal with DOC and Lamont, is also championing a bid to spend $229,950 in all three years to provide inmates with state-issued identification to remove road blocks to accessing services and employment.\n“Providing our offenders with opportunities for success, is not only the right thing to do, it is also a key component to keeping cities and towns safe and keeping our judicial and correctional systems affordable,” Cook said. “Incarceration is expensive, but not preparing offenders for reentry and not supporting their reintegration into our society after incarceration is equally costly.”\nCook will meet with the Appropriations sub-committee March 26 to review more details of his operation as the full committee deliberates and crafts their own budget in the coming weeks.", "url": "https://apnews.com/38c52e1d69df4fdc9b3cfc8d4d27eecd"}