{"authors": ["Michal Rozworski", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Ronan Burtenshaw", "David Broder", "Dawn Foster"], "date_download": "2020-05-04 19:56:04", "date_modify": "2020-05-04 19:56:04", "date_publish": "2019-12-16 00:00:00", "description": null, "filename": "2019_12_tories-uk-general-election-labour-party-neoliberalism-austerity_1588622164.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/12/16101837/GettyImages-1192162810.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_12_tories-uk-general-election-labour-party-neoliberalism-austerity_1588622164.html", "title": "“The Tories Don’t Give a Shit About Us.” “I Know. But.”", "title_page": "“The Tories Don’t Give a Shit About Us.” “I Know. But.”", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "“The Tories don’t give a shit about us.”\n“I know, mate, but . . .”\nThe weekend before the December 12 election that proved so disastrous for Labour, I had not one but many exchanges like this. I spent that Saturday and Sunday out canvassing for Labour in Walsall and Stoke-on-Trent, two towns in the West Midlands, part of the Labour Party’s ex-industrial heartland.\nOn the doors in working-class areas of Walsall and Stoke, the anger and disillusion were palpable. We heard a lot of distrust of politicians and of electoral politics — entirely justified after decades of neglect, of policy effectively designed to let communities like these slowly rot.\nMany conversations with long-time Labour voters veered to Brexit and “getting it done.” Nearly every one of these interactions touched on not following through on a democratic vote. After three years, disillusion and anger drowned out much else.\nIf I was given the chance, and often I was, I tried to cut through with class appeals. The appeals partly worked — many people were still open to seeing the world in these terms. They admitted gargantuan levels of inequality and the fact that the Tories represented the interests of the rich, interests opposed to theirs. But they wanted to be heard, and they were willing to vote knowingly against their class interests.\nI was seeing the long crisis of democratic legitimacy unfold on a micro scale. Door by door, the victory of a culture war started by the Right and designed to avoid talking about a decades-long political and economic crisis for working people, was winning over a set of shared concerns that could have united a majority of the UK’s diverse working class — young and old, racialized and white, in the cities and towns. The culture war was able to win in large part because it was now harnessed to a (rightly) perceived democratic betrayal by people who felt otherwise voiceless and powerless.\nThe two other issues that came up most frequently at the start of doorstep conversations, Jeremy Corbyn and disenfranchisement from politics, were in many ways derivative of the same anger. Sometimes the door was slammed in my face, but often I was given the chance to start a conversation — surprisingly often even after an angry rant about Corbyn being a terrorist supporter.\nMany times, all it took was a short question, “why” or “why not.” People wanted to talk, especially after so long having their voices ignored. (Centrists within Labour crowing about Jeremy Corbyn’s lack of popularity shouldn’t be smug: whenever Tony Blair came up, it was negatively.)\nBut one conversation was not enough to combat the deep distrust and the media narratives about Corbyn, or to make the case for a transformational economic program (even one that would “merely” transform the UK into the average continental European country in important respects). Corbyn was most often a proxy for other issues — from lack of clarity on Brexit to economic credibility — each hard to cut through on its own, never mind with the additional layer of media caricatures. There was distrust in politicians and disbelief that the economy could work differently. The manifesto, as others have written, was likely too disjointed, and that made it seem all the more impossible to actually carry out.\nIn hindsight, what I heard that weekend encompassed the election. That became clear to me on election night. Previously, the alarm bells I had heard canvassing in the West Midlands were drowned out by hope and the energy of a very spirited campaign that activated thousands of volunteers — driven in large part by Momentum’s impressive campaigning machinery.\nThe people I met who knew that the Tories don’t give a shit about them but who either wanted to “get Brexit done” or didn’t trust that anything could change were saying things of deep political substance. They were expressing a potent combination of class analysis and class anger that Labour in part misread and in part hasn’t had the time to counter because it was decades in the making. Much of the same disillusionment and disenfranchisement could be heard on the doors in London, too, though not reflected as much by the additional prism of Brexit.\nBoth of the constituencies outside the capital I visited that weekend had been already rather narrowly won by the Conservatives in 2017 for the first time in decades. This was part of Labour’s “red wall” that had already crumbled but was similar to the still-standing sections that would have been key to stopping a Conservative majority. In reality, the Tories increased their margin to over 10,000 votes in each of these two constituencies.\nThe conversations there mirrored what I heard on election day in Stevenage, where previous Labour voters would often turn out to be ex-Labour voters for this election, and where Labour also ended up trailing by more than 10,000 votes. What I heard also features prominently in the numerous other first-person accounts of Labour volunteers canvassing in Leave areas, particularly the Midlands, Yorkshire, and the North. Labour’s loss was presaged in these conversations.\nSo many people I spoke with viscerally understood today’s yawning inequality and that it was no accident, that it had been actively created. They knew whose interests the Tories represent. They often agreed that austerity was impacting them or soon would be. But they either wouldn’t vote, would vote Brexit Party, or would even vote Tory.\nA closer look at the election data will surely reveal lots of wrinkles and a more sophisticated picture. Already, it is clear that Labour lost votes to all quarters compared to 2017: to the Tories, to the Lib Dems, to the SNP and the Greens, and to abstention. In both Walsall and Stoke, turnout was down even as the Tory majority ballooned.\nAcross the country, some Labour Leave voters, including some of those I spoke to, voted Tory, and some abstained. But even some Labour Remainers were convinced by the Tory message that something had to be done, while others swung to the Lib Dems, SNP, Plaid Cymru, or Greens anyway.\nSo this wasn’t just an election about longtime Labour voters voting Tory. But it was one where Brexit dominated, where political disillusion remained strong, and where Labour couldn’t push through — in significant part because its centrist wing misunderstood how and where the election would be won or lost.", "url": "https://www.jacobinmag.com/2019/12/tories-uk-general-election-labour-party-neoliberalism-austerity"}