{"authors": ["Sentinel"], "date_download": "2020-05-04 20:07:26", "date_modify": "2020-05-04 20:07:26", "date_publish": "2019-04-04 10:53:57", "description": "Jim Nantz has been the television play-by-play announcer for the men's NCAA Final Four since 1991. He's seen a lot of high-level basketball and a lot of juicy storylines along the...", "filename": "_fabfa1b8c46548e3986913abb3f13b5f_1588622846.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fabfa1b8c46548e3986913abb3f13b5f_1588622846.html", "title": "Final Four Could Be One for the Ages", "title_page": "Final Four Could Be One for the Ages", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jim Nantz has been the television play-by-play announcer for the men’s NCAA Final Four since 1991.\nHe’s seen a lot of high-level basketball and a lot of juicy storylines along the way.\nOnce again, Nantz will be on the call this Saturday for the 2019 Final Four, and thinks we’re on the precipice of seeing an all-timer unfold and culminate on Monday night.\n“This is truly one of the great stories that’s in front of us, it’s one of the best stories that I’ve seen going into the Final Four in a long time,” teased Nantz during a Final Four conference call with the media on Tuesday afternoon. “I do think if Virginia wins the championship, to go from the despair, the devastation of a loss to a 16 (seed) for the first time in the history of the tournament to winning the championship, it’ll be regarded as one of the great championships and turnarounds in history, not only of this sport but anything we’ve seen in American sport in a long time.\n“You can talk about worst-to-first in the NFL and coming out of fourth place in your division and making the playoffs, whatever it may be. We’re talking about not just a No. 1 seed, the No. 1 overall seed in the tournament last year, losing to the last-seeded team in the tournament. I’m not saying it’s going to happen, but there is the potential there for that story.”\nNantz, of course, is referring to Virginia’s monumental upset loss to 16th-seeded UMBC, the America East champion, in the first round of last year’s tournament. It was truly jaw-dropping. Everyone wondered how much that loss shook the psyche of the Cavaliers and how they would respond this year.\nWell, all they did was earn the top seed in the South Region, storm through that bracket and roll into Saturday’s Final four in Minneapolis with a 33-3 record. I’d call that a decent response.\nVirginia will face Auburn (30-9) on Saturday night (6:09 p.m.), followed by Texas Tech (30-6) against Michigan State (32-6) in what figures to be an excellent pair of games. Anyone who tries to tell you otherwise is probably not a college basketball fan. Or they’re just uninformed, lazy or attempting to be a contrarian. Believe me, I’ve seen some of those “man, what a boring Final Four” tweets out there, and they kinda make my blood boil.\nSure, there’s no Zion Williamson, no Duke, no North Carolina, no Kentucky, no Kansas, no Cinderella darling. Oh well.\nWhat we do have is four big-time programs from big-time conferences, that offer a lot more new blood than blue blood, and that’s not a bad thing. Virginia is in just its third Final Four in program history and first since 1984. Auburn and Texas Tech are in their first Final Four. Michigan State is in its 10th.\nIf you’re a hoop purest, who thinks one-and-dones have damaged the college game, this is the Final Four for you. There’s only two freshmen starters on the four teams combined. These games will feature well-coached teams that are committed to distinct styles and relentlessly imposing their will.\nNo team in the country has been better at accomplishing that goal to this point than Virginia.\n“Obviously their style of play is very methodical and deliberate,” said Grant Hill, the former Duke and NBA star who will call the game alongside Nantz and Bill Raftery. “Virginia kind of lulls you into playing their style of basketball.”\nIf you’re looking for the best NBA prospect in the Final Four, he’ll be wearing a Virginia uniform. That would be sophomore 6-foot-7 swingman DeAndre Hunter, who’s widely projected to be a top-10 draft pick. Texas Tech sophomore guard Jarrett Culver is also a special talent and would be the next in line.\nThe four head coaches offer a little bit of everything.\nYou have royalty in Michigan State’s Tom Izzo, who won a national title (2000) and has been to eight Final Fours. You got the goofy personality of Auburn’s Bruce Pearl, a graduate of Sharon High School and Boston College, where he served as the men’s basketball team manager. You got the up-and-comer in Texas Tech’s Chris Beard, a 46-year-old who appears destined for a outstanding career. And, finally, Virginia’s Tony Bennett, who just may be the best of story of them all.\nBennett is the son of legendary coach Dick Bennett, who guided Wisconsin to the Final Four in 2000. Tony played for his dad in college at Green Bay and still ranks first in NCAA history in career 3-point percentage at 49.7. He played three years for the Charlotte Hornets (1992-95). Tony was an assistant coach on Dick’s staff at Wisconsin and then Washington State before Dick handed over that program to Tony in 2006.\nAt Virginia, Tony uses the stingy pack-line defense, made famous by his father. The Cavaliers play a smart brand of basketball, prioritizing tempo and ball movement. What they’ve been able to do in recent years in the mighty ACC has the feel of a mom and pop operation outselling the Targets and Walmarts of the world.\nVirginia has a chance to make history. It would be a great story, and it’s a story worth rooting for.\nFollow Matt Langone on Twitter @MattLangone", "url": "https://apnews.com/fabfa1b8c46548e3986913abb3f13b5f"}