{"authors": ["Rick Elmore"], "date_download": "2020-05-04 20:27:52", "date_modify": "2020-05-04 20:27:52", "date_publish": "2019-05-10 04:01:01", "description": "HUNTINGTON - A rare hitting feat and a freshman stepping up on the mound helped lead Huntington St. Joe to a 8-3 win over Tug Valley Thursday at the YMCA Kennedy Center's George T. Smailes Field...", "filename": "_8c415fd117c241e6b3fc6257eb8c810c_1588624072.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8c415fd117c241e6b3fc6257eb8c810c_1588624072.html", "title": "Hunter Eplin homers in 8-3 win for Huntington St. Joe", "title_page": "Hunter Eplin homers in 8-3 win for Huntington St. Joe", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HUNTINGTON - A rare hitting feat and a freshman stepping up on the mound helped lead Huntington St. Joe to a 8-3 win over Tug Valley Thursday at the YMCA Kennedy Center’s George T. Smailes Field in the Class A, Region IV, Section 2 playoff game between the two schools.\nFreshman Caleb Smith came on in the fourth inning with the game tied and held the No. 4-seed Panthers scoreless through the remainder of the game until pushed across two runs an inning later and wouldn’t look back.\nThe win keeps the No. 3-seed Fighting Irish alive for a Thursday elimination game at No. 1-seed Sherman.\n“What Caleb did was big,” Huntington St. Joe coach Dave Jenkins said.\nSmith pitched 3-2/3 innings and allowed a singled unearned run to the Panthers. Smith walked four but struck out three including two in the top of the seventh to end the game.\nSmith didn’t hide his feelings of the situation either.\n“I was nervous and scared, but my teammates picked me up and supported me,” Smith said. He added he wasn’t able to overcome those emotions entirely but changing velocity on his pitches helped keep Tug Valley from sitting on his fastball.\nWould he be ready to be ready to be called upon for another relief appearance? “Heck yeah,” the freshman answered.\nA wild first inning saw four runs scored between the two teams.\nTug Valley opened the scoring with an RBI triple by Dakota Vance that scored lead-off man Ethan Varney. Vance then scored on an sacrifice by Freddy Copley.\nHuntington St. Joe answered in the bottom of the first with a lead-off double by Noah Beter who advanced to third on a ground ball to the right side then scored on a wild pitch. Lenny Washington then singled, advanced to second on a walk then scored on an RBI single by Connor Joseph that tied the game 2-2.\nThree errors by the Panthers infield allowed the Fighting Irish to take the lead in the bottom of the second. A ground ball to shortstop Justin Hall was dropped during the exchange from the glove to the infielder’s throwing hand and then thrown away by Hall as he was trying to hurry the throw to first base. Those two mistakes allowed St. Joe’s Cory Sweeney to take two bases.\nOne batter later a routine ground ball got under the glove of Hall allowing Sweeney to score.\nHuntington St. Joe starter Hunter Eplin allowed a single in the top of the fourth to Vance and Smith was then moved from right field to the pitchers mound.\nAn infield error by St. Joe allowed the first batter Smith faced, Copley to reach first base and Vance moved to third. Smith got the next batter, Alex Vance, to hit a bouncing ground ball back to the mound where the freshman fielded the ball cleanly and threw home to get Dakota Vance out.\nA Huntington St. Joe error made while trying to pull off what would have been and inning-ending double play instead allowed Copley score from second to make it a 3-3 game.\nSloppy play defensively continued in the fourth for Huntington St. Joe but it managed to escape the inning with no other runs scored.\nMax Adkins’ two-run single in the bottom of the fifth put St. Joe in front again. The ground ball through a vacated hole at second base that scored Joseph and Bronson Barker.\nTug Valley challenged in the top of the sixth after getting two-out walks from Shane Russel and Corey Pack but Smith pitched out of trouble by getting the Panthers’ Kobe Smith to fly out in foul territory to third.\nThe Fighting Irish pounded out three more runs in the bottom of the sixth with a double by Luke Stollings, an RBI triple by Washington and a two-run home run by Eplin to make it 8-3.\nEplin’s homer to straight away right field was the first Jenkins had seen at George T. Smailes Field in his 25 years of coaching high school baseball, he said.\n“Usually there’s a 35 mph wind coming off the river that makes it harder to hit it there. If you see a homer here it’s from the left side,” Jenkins said.\nSmith came through again after Tug Valley advanced a runner to third base but he never got home as Smith struck out the lead-off hitter Brennan Pack and then struck out Dakota Vance to end the game.\nTUG VALLEY 200 100 0 -- 3 4 4\nHUNTINGTON ST. JOE 210 023 x -- 8 8 1\nVarney and Russel; Eplin, Smith (4) and Barker.\nHitting: (TV) D. Vance 2-4 3B 1 RBI; (SJ) Eplin 1-3 HR 2 RBI, Adkins 1-3 2 RBI, Washington 2-2 3B 1 RBI.", "url": "https://apnews.com/8c415fd117c241e6b3fc6257eb8c810c"}