{"authors": ["Jim Mcalister"], "date_download": "2020-05-04 20:08:46", "date_modify": "2020-05-04 20:08:46", "date_publish": "2019-02-27 05:00:00", "description": "Complacency has the advantage of ignoring the reality around us, allowing us to focus our energies and enjoyment elsewhere — but the consequences of doing so can be disastrous. Case in point:...", "filename": "_ccf76a2ad3764f948e08dbe8d6b4a09c_1588622926.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ccf76a2ad3764f948e08dbe8d6b4a09c_1588622926.html", "title": "Where I Stand Our lake’s future now depends on a wing and a prayer", "title_page": "Where I Stand Our lake’s future now depends on a wing and a prayer", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Complacency has the advantage of ignoring the reality around us, allowing us to focus our energies and enjoyment elsewhere — but the consequences of doing so can be disastrous. Case in point: aquatic invasive species (AIS) currently reside in waters both in and around Candlewood Lake and, if ignored, represent a clear and compelling danger to our lake’s ecosystem, our recreational enjoyment of these waters, and our regional and personal “economies” as well.\nSome estimate a 15-20 percent hit to real estate prices if these demons breach defenses — and since such defenses are not currently in place, much less firmly on the drawing board, we’re winging it and our prayers won’t hold sway.\nWithout residents’ concern, active engagement, and sufficient funding, the noose tightens. While remedial actions are in place to help stem Candlewood’s milfoil (think carp and deep drawdowns), we have not mounted the essential defenses to keep zebra mussels and their brethren at bay. Enter hydrilla — described by those in the know as “milfoil on steroids” — this alien, aggressive species has now infected waterbodies elsewhere in the state, including the Connecticut River. And, inevitably, the list goes on — and grows exponentially given AIS fertility/expansion rates, the effect of climate change, and careless transient boaters who can accelerate AIS spread and thus the potential, irreversible consequences to treasured waters.\nFortunately, sprigs of hope are on the horizon: Increased Candlewood Lake Association attention is now being directed at defense and decontamination strategies; opportunities to engage the state Department of Energy and Environmental Protection are being explored at the lake level; and now, in the halls of the Connecticut Legislature, a bill is gaining traction that holds promise on the funding front.\nSuch a bill contemplates the infusion of funds to help prevent, control and remediate damage by AIS (and potentially blue-green algae) from across the state through a modest, user-fee structure involving resident and non-resident boaters, plus provision for voluntary contributions.\nThis draft bill — termed Connecticut proposed House Bill No. 6637 — is now in discussion within the Environment Committee and, once members are comfortable as provisions evolve, it is destined to be aired in a Public Hearing where both verbal and written testimony are invited.\nIndications are the hearing is scheduled for Friday at the state Capitol in Hartford. (Periodically Google the evolving bill, as referenced above or check on the General Assembly website). Among bill’s co-sponsors are Democratic Danbury-area legislators, state Sen. Julie Kushner, D-Danbury and state Reps. David Arconti and Kenneth Gucker.\nSince significant, alternative funding sources are virtually non-existent at the federal, state and local levels, please give active consideration to such a state-wide fund devoted to protecting against the potential ravages of AIS, and frame your case for backing such a measure.\nIf our waters and those across Connecticut are to be successfully defended, such a bill is an essential step to making that happen. By engaging in the dialogue, you can help sustainable AIS funding become a reality.\nJim McAlister, a New Fairfield resident, is the founder of the Candlewood Watershed Initiative.", "url": "https://apnews.com/ccf76a2ad3764f948e08dbe8d6b4a09c"}