{"authors": ["Katherine Feser"], "date_download": "2020-05-04 20:07:02", "date_modify": "2020-05-04 20:07:02", "date_publish": "2019-03-22 11:00:00", "description": "Australia-based Caydon will break ground early next year on Laneways, the next phase of its mixed-use development spanning three full blocks in Midtown. The company aims to bring a touch of...", "filename": "_46270ec705454293a806efc4e5f68790_1588622822.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_46270ec705454293a806efc4e5f68790_1588622822.html", "title": "Caydon to bring Melbourne lifestyle to Midtown in Laneways development", "title_page": "Caydon to bring Melbourne lifestyle to Midtown in Laneways development", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Australia-based Caydon will break ground early next year on Laneways, the next phase of its mixed-use development spanning three full blocks in Midtown.\nThe company aims to bring a touch of Melbourne to Midtown with the development, which targets a September opening for its 27-story apartment tower at 2850 Fannin. The next four buildings, including a boutique hotel, high-rise condos and apartments and retail, will go up north of 2850 Fannin as part of the more than 3.5-acre development bounded by Main, Fannin, Tuam and McGowen.\n“We are designing a mixed-use development inspired by the iconic pedestrian Laneways in Melbourne with coffee shops, boutiques, wellness concepts and wine bars,” Joe Russo, principal of Caydon, wrote in an email. “Melbourne’s lanes are also home to an eclectic mix of high-rise residences and boutique hotels.”\nThe project is designed to create a community connecting residents in more than 2.5 million square feet of condo and apartment space and a 200-room hotel with green spaces, dining and entertainment. In the middle of the development, Drew and Dennis streets will provide a direct connection to Midtown Park. The newly announced name reflects Melbourne’s walkable, transformed alleyways that are enlivened by cafes, street art, residences and hotels.\nCaydon, which acquired the land in multiple transactions, will start the next phase at 2711 Main, which is currently occupied by the Art Supply store.\nCaydon Architecture and Design in Melbourne is handling the conceptual design for the district. Pricing at the condo tower, planned for about 200 units, has not been set. A hotel operator is expected to be announced soon, according to the developer.\nThe 2850 Fannin apartment building, designed by Ziegler Cooper Architects, has 13,000 square feet of street level retail space to be occupied by Atlanta’s Flying Biscuit café, a health and wellness operator and a Laneways sales center for the condos. An additional 55,000 square feet of retail will occupy the ground floors of the other four towers.\n“We are excited by the Midtown location, being in the heart of Houston - between Downtown and the Medical Center, on the light rail, surrounded by bars and nightlife and a new Whole Foods opening up,” Russo said. “Our vision for our Laneways project will enhance the already thriving neighborhood, as we look to bring the Melbourne lifestyle to Midtown, all while infusing Houston’s culture and creativity.”\nkatherine.feser@chron.com\ntwitter.com/kfeser", "url": "https://apnews.com/46270ec705454293a806efc4e5f68790"}