{"authors": ["Matthew Paras The Washington Times"], "date_download": "2020-05-04 20:04:06", "date_modify": "2020-05-04 20:04:06", "date_publish": "2019-04-29 16:15:24", "description": "The Washington Redskins ultimately chose to draft a quarterback instead of trading for Josh Rosen last week taking Ohio State's Dwayne Haskins with the 15th pick. But the Arizona Cardinals...", "filename": "_021f0d3c299fadd95cb6555dae1ed0c1_1588622646.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_021f0d3c299fadd95cb6555dae1ed0c1_1588622646.html", "title": "Redskins laughed at Cardinals' trade demand for Josh Rosen: report", "title_page": "Redskins laughed at Cardinals' trade demand for Josh Rosen: report", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Washington Redskins ultimately chose to draft a quarterback instead of trading for Josh Rosen last week taking Ohio State’s Dwayne Haskins with the 15th pick. But the Arizona Cardinals reportedly called Washington to gauge their interest in Rosen on draft night.\nTalks, however, didn’t get very far.\nAccording to a report from Sports Illustrated, a Washington executive laughed at Arizona’s ask of a first-round pick. The Cardinals reportedly engaged talks with Washington just before they took Oklahoma quarterback Kyler Murray with the first overall pick.\n“That’s really bold for someone who just took a QB,” the Redskins executive said in response to Arizona’s asking price, per the the report.\nWith the Redskins passing on Rosen, the Cardinals traded the quarterback to the Miami Dolphins. Arizona only received the 62nd overall pick and a 2020 fifth-rounder for Rosen, who was drafted 10th overall in 2018.\nRosen threw for 2,278 passing yards, 11 touchdowns and 14 interceptions in 13 starts last year though his supporting cast was among the worst in the league. Arizona finished the year 3-13 and set their eyes on Murray after the season. The Cardinals also fired first-year coach Steve Wilks and hired Kliff Kingsbury, who briefly coached Murray at Texas Tech before the quarterback transferred.\nThe Redskins were linked to Rosen throughout the offseason, given their need for a quarterback in the wake of Alex Smith’s injury.\nAsked about Rosen on Thursday, coach Jay Gruden said the possibility of trading for him “never came up” during the first round of the draft.", "url": "https://apnews.com/021f0d3c299fadd95cb6555dae1ed0c1"}