{"authors": ["Neal Meyer", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Nick French", "Leo Panitch", "Shawn Gude"], "date_download": "2020-05-04 19:53:45", "date_modify": "2020-05-04 19:53:45", "date_publish": "2019-08-19 00:00:00", "description": null, "filename": "2020_04_why-you-should-be-a-socialist-review-robinson_1588622025.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/19210419/GettyImages-1146330449.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_04_why-you-should-be-a-socialist-review-robinson_1588622025.html", "title": "Why You Should Be a Socialist - and a Marxist", "title_page": "Why You Should Be a Socialist — and a Marxist", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nReview of Nathan Robinson’s Why You Should Be a Socialist (Macmillan, 2019).\nLike Moses and the ancient Israelites, for forty or so years, socialists were lost in the wilderness. From 1975 to 2015, socialists were a fast-greying lot with no power and influence and very little hope. A small few cornered appointments at universities, stuck by their politics, but remained politically isolated. The rest congregated on the margins of political life; or hid their full convictions from their coworkers, friends, and family; or threw themselves into union and community activism — but never dared to use the “s word.” Or they gave up altogether. That has changed, thank God. Socialism is back. And we’re now in a moment that is calling out for new books, magazines, documentaries, podcasts, and commentary making the case for democratic-socialist politics to millions of readers. That’s what makes Nathan Robinson’s new book Why You Should Be a Socialist a welcome and useful addition to the bumper crop in cases for left-wing politics. In a little over 250 pages, Robinson persuasively lays out the moral case against capitalism, a system of brutal exploitation, oppression, and waste that Robinson dissects and disposes of in short order. Robinson launches the book by engaging a hypothetical reader who is “extremely dubious” about socialist ideas and promises to win them over. It’s a fruitful strategy. Even though most of his readers will probably be at the very least already curious about democratic-socialist politics, they’ll find many of their doubts assuaged and questions answered. Robinson does so by directing his attention first to awakening in his readers a “socialist instinct.” He invokes basic moral principles that many of us share, a hatred of cruelty and a passionate desire to alleviate suffering being prominent among them. His own process of radicalization provides the starting point for this part of the argument. “I saw people buying new phones every year and keeping the old ones in a drawer, while a few miles away, day laborers picked tomatoes, earning 45 cents for every 30-pound bucket. I saw reports of Americans being charged $5,000 by hospitals for an icepack and a bandage, or paying $1,200 a month in rent for a bunk bed.” No doubt every reader has had similar experiences. And while the depravities of the capitalist system are onerous enough for those of us not on the top, the life of luxury for the lucky few makes it all the worse. Robinson appeals to those readers who “want to see what being super-wealthy means, but [who] don’t have the door codes to get inside their lairs — sorry, homes” to buy a copy of the Wall Street Journal and turn to its real estate section, “which is literally called ‘Mansion.’” Robinson’s point is a basic one, but one that deserves constant repetition: these shared moral inclinations ought to lead us to want to make dramatic changes to society — in a socialist direction. He then pivots to show how those moral instincts can be hardened into more concrete political commitments, particularly towards policies that help build a more solidaristic and egalitarian society. Such a society, Robinson points out, would actually be far freer than the world of capitalist “freedom” we live in today. Medicare for All, a Green New Deal, a real plan to end mass incarceration — all would expand the freedoms and quality of life of the vast majority, and are part of walking the fine line Robinson draws between both “dream[ing] of a very different world” and “look[ing] closely at the world you actually live in and be[ing] realistic in setting short-term political goals.” Finally, Robinson dispatches with alternative political orientations. He shows how a conservative worldview is at its core an ugly one, and how liberalism is wholly inadequate to the challenges of the moment. In Robinson’s apt phrasing, conservatives today are “mean, false, and hopeless” while liberals are engaged in the unenviable task of “polishing turds.” Robinson carries out the core tasks he sets for himself with admirable skill. The socialist movement is lucky to have him, and he has made a valuable contribution to the debate about capitalism and socialism now underway in the United States.\nShould We All Be Libertarian Socialists? But Robinson runs into trouble when he approaches strategic debates within the socialist left. Though a relatively small part of the book, it’s worth focusing in on two points where he is on much shakier ground: his unsubstantiated attacks on the most important political tradition in the history of the Left, Marxism, and his self-proclaimed identity with the politics of “libertarian socialism.” The problems begin when Robinson turns his attention to Karl Marx, who he introduces as a thinker who “can’t be ignored.” After recognizing the force of Marx’s writings on capitalism and economics, Robinson disappointingly drudges up accusations against Marx from Marx’s nineteenth-century anarchist contemporaries. The accusations include claims that Marx had “authoritarian tendencies.” Where? When? Robinson doesn’t say. Marxists have “had too little regard for the importance of individual liberty.” This is certainly true for Stalinism, but it’s hardly a fair picture of the rich democratic-socialist tradition inspired by Marx. And the anarchist Pierre-Joseph Proudhon, Robinson writes, was right to worry that Marx and other socialists had become “fanatics of state power.” This is a bizarre claim, considering Marx spent his life running from state authorities in Germany and never lived to see a socialist state for which he could be fanatical. Robinson’s accusations against Marx go beyond establishing some critical distance from an important thinker. They play into destructive anti-socialist tropes that are as common as they are unwarranted. Contrary to the claims of Robinson, Proudhon, and others, Marx was a committed small-d democrat. Marx was so committed to democracy that in The Communist Manifesto, he and Friedrich Engels argued that the struggle and realization of a democratic society were the key to the achievement of socialism: “[T]he first step in the revolution by the working class is to raise the proletariat to the position of ruling class to win the battle of democracy.” Marx’s successors in the socialist parties of Europe in the late nineteenth century were no less democratic in their politics. In fact, they were the main organizers for movements to extend suffrage to all, to defend and expand civil liberties, and to build unions and organs of democratic control in the workplace. Robinson’s attempted takedown of Marx therefore does an injustice to a committed democratic socialist, to many who identify as Marxists, and — most troubling — to young socialists looking for political direction. New socialists’ political development will benefit enormously from taking Marx and the Marxist tradition seriously and incorporating it into their newfound democratic socialism. Robinson also throws his hat in with the tradition of “libertarian socialism.” Libertarian socialists “hate government and capitalism alike,” according to Robinson. It is a tradition that “commits itself unwaveringly to a set of respectable principles and compromises neither its radical socialism nor its radical libertarianism.” What this really amounts to for Robinson personally, however, beyond an understandable desire to reject the authoritarian socialist experiments of the twentieth century, is unclear. If what Robinson wants is a credible alternative to authoritarian socialism, he does not need to reject Marxism. Marxists from CLR James to Ralph Miliband and Michael Harrington have maintained a clear-eyed criticism of Stalinism and its ideological brethren without embracing a hazy notion of “libertarian socialism.”\nMaking the Case for Democratic Socialism These confusing twists limit the effectiveness of Robinson’s overall argument. While his moral indictment of capitalism is compelling, his moral defense of the positive program of democratic socialism is lacking. This is not because Robinson fails to make the case for why democratic-socialist ends would be morally desirable. The democratic-socialist future that Robinson trumpets — a world where “people do not go to war; there are no class, racial, and gender hierarchies; there are no significant imbalances of power; there is no poverty coexisting alongside wealth; and everyone leads a pleasant and fulfilled life” — is clearly a desirable one, and he makes that point effectively. But Robinson’s peculiar commitment to the politics of libertarian socialism makes presenting a defense of the democratic-socialist means to get there difficult, if not impossible. After all of Robinson’s celebration of the desirability of Medicare for All, the Green New Deal, and other policies paid for by new taxes on the wealthy, he fails to make a moral defense of the necessity of using state power to win them — precisely the kind of question the socialist-dubious reader, fed on a steady diet of “libertarian capitalist” talking points for most of their life, is likely most uneasy about. Surely Robinson knows that if Bernie Sanders had won the 2020 presidential election and was able to enact these policies, it would have required a massive redistribution of power in society — power that he would say he supports. But that redistribution would only have been possible because Sanders and the democratic-socialist movement he now leads would have had access to a portion of state power. To take just one example, under the very best-case scenario, Sanders would have signed a bill enacting Medicare for All at some point in his administration. The millionaires and billionaires and the CEOs of major health insurance companies would inevitably object. But officials from the IRS and the power of the US judicial system would be used to ensure that new taxes are collected and the doors to every health insurance company in the country shuttered by force if necessary. (The collective shout for joy on that day, when it finally does come, will be overwhelming. I predict fireworks and mass parades.) Robinson is free to have misgivings about all this as a libertarian socialist. But he must recognize that the kind of “political revolution” Sanders put forward, that millions of working-class Americans rallied to, and that Robinson himself supported, is a process that would be carried out through the use of state power. The strategy of the political revolution is therefore at odds with the intellectual tradition that Robinson professes. Proudhon, Mikhail Bakunin, and generations of anarchists would read Why You Should Be a Socialist and be baffled to find one of their ideological progeny advocating such a strategy. They’d likely apply the same accusations of authoritarianism and state-power worship they once lobbed at Karl Marx at one Nathan J. Robinson. All this matters because we’re sure to see a new and forceful moral indictment of redistribution made by “libertarian capitalists” as part of an ideological offensive against democratic socialism in the years to come. If as a movement we can’t compellingly defend the moral desirability and necessity of using state power to redistribute resources, we open ourselves up to defeat in the battle of ideas. The defense of the use of state power as a means to achieve democratic-socialist ends is readily supplied. Democratic majorities have a right in any society to make decisions for the whole as long as basic minority rights to dissent, dignity, and personal freedom are respected. And massive majorities exist for all the key points of Bernie’s program. The real activists undermining democracy are precisely today’s libertarian capitalists who defend a system that has so far blocked these majorities. But making that case depends on jettisoning the debilitating anarchist misgivings about majority rule and state power that are still too common even among socialists.", "url": "https://www.jacobinmag.com/2020/04/why-you-should-be-a-socialist-review-robinson"}