{"authors": ["Richard Walker", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Branko Marcetic", "Daniel Aldana Cohen", "Jennifer Mittelstadt"], "date_download": "2020-05-04 19:49:46", "date_modify": "2020-05-04 19:49:46", "date_publish": "2019-06-17 00:00:00", "description": null, "filename": "2019_06_the-color-of-law-richard-rothstein-review_1588621786.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/17171948/gettyimages-514080362-5b03524ae4fa1476f57f11429c084f166b8e1cb9-s1500-c85-web.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_the-color-of-law-richard-rothstein-review_1588621786.html", "title": "The New Deal Didn’t Create Segregation", "title_page": "The New Deal Didn’t Create Segregation", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Richard Rothstein’s The Color of Law has made quite a splash. It’s been widely praised for its no-holds-barred look at American racism. Rothstein has toured the country lecturing about the book; he’s has been interviewed on National Public Radio and other outlets many times; and he’s been widely cited by mainstream liberals — and even some on the left. His thesis is simple. As he summarized it in an article for the libertarian magazine Reason, “Racial segregation in America was, to a large degree, engineered by policy makers in Washington” — above all, the policy makers of the New Deal.\nRothstein is right to attack the systematic racism that has plagued this country and to lay bare the way our cities have been racially segregated — and continue to be to this day. This is not exactly news, but it is an important truth that bears repeating for every generation. So, to the extent that it helps educate the young, and especially white Americans, about certain harsh realities, The Color of Law serves a good purpose. This country’s sorry record on race needs to be aired as an essential part of our urban history.\nOn the other hand, Rothstein is wrong in ways that mislead readers about the causes and course of racial segregation. His errors of theory and fact seriously undermine the value of the book as a work of historiography and are a disservice to progressive politics today. Indeed, Rothstein ends up bolstering conservative positions on several fronts, starting with the idea that racism is not a structural element of US civil society and that government is the problem not the solution. Whatever his good intentions, Rothstein’s dubious scholarship has some very bad, if unintended, consequences.\nRothstein’s central argument, as stated in the subtitle of the book, is that the federal government imposed the modern racial order on this country in the twentieth century, particularly residential segregation. The fundamental error of this thesis stems from its depiction of racism as a system imposed from above, by the state, rather than something embedded in American social structures since before the founding. He favors a purely legal theory of de jure racial discrimination that naively reproduces classical liberal legal doctrine, in which law is the foundation of the social order and that order is arrived at through a “social contract.”\nRothstein’s wrongheaded approach undergirds the detailed history of twentieth century housing policy that fills the bulk of The Color of Law. His primary target, again, is the federal government and the ways it enabled and even imposed segregation on localities. But while it is undeniable that federal promotion of zoning, mortgage guarantees, and public housing mostly lined up with the prevailing practices of racial segregation, and reinforced them in important ways, Rothstein’s idea that this was imposed on reluctant localities is ludicrous.\nIn order to make the case that the federal government imposed residential segregation, he cherry-picks examples of government agencies refusing to approve projects where white liberals were willing to live with black families or white developers wanted to build integrated housing. Such instances existed, but they are notable precisely for being exceptionally rare efforts to break through the color line. In reality, the record of urban politics in the twentieth century is mainly one in which white people and their leaders get the segregation they wanted with the help of their local, state, and federal governments. Not only were laws and regulations written and enforced with white preferences in mind, the consequences for any government that didn’t go along were clear: if whites didn’t get the segregated neighborhoods they wanted, they were quick to protest, riot, and resort to violence. Rothstein notes a few such cases but passes over them too glibly.\nFurthermore, in telling the story of law and residential segregation, one cannot begin with New Deal public housing and zoning. One must first confront the prior history of deed covenants, racial exclusion, and use restrictions reaching back to the nineteenth century, while taking into account the power of the real estate industry as it developed in the early twentieth century. Not only was racial segregation not new by the 1930s, it was good business for an important sector of capital.\nDeed covenants go back to the 1880s and grew out of the common law of nuisance. They were the first major way of protecting white and upper-class property from the intrusion of immigrants, industry, and people of color. Covenants were built into the first large-scale developments of the 1900s and 1910s, such as Roland Park in Baltimore, the Country Club District in Kansas City, and St. Francis Woods in San Francisco. These were the work of the first “community builders,” as Marc Weiss has dubbed them, who founded the powerful National Association of Real Estate Boards (NAREB); pushed for planning, zoning, and subdivision rules; and later created the Urban Institute. Most houses built before the 1960s still have such covenants on their deeds, even though they are now unenforceable in court.\nZoning goes back even farther. The first racially targeted land use restrictions, which were aimed at the exclusion of Chinese laundries, appeared in the 1860s in Modesto and San Francisco. The reason developers and their upper-class customers turned to zoning in the early twentieth century was that deed covenants proved to be too piecemeal to protect their territories of privilege effectively. The first zoning laws were explicitly racial, but such measures were overturned by the US Supreme Court in 1916. It was only after the court, in the Euclid v. Ambler decision of 1926, ruled that zoning per se was not an unfair taking of private property that the new, improved system of spatial ordering became universal among city governments.\nThe Euclid decision points to another reason for separating industry, workers, pollution, and other undesirables from the neighborhoods of the upper classes. Covenants and zoning were meant to protect class privilege, the single-family home, and above all, real estate values. Rothstein is wrong to dismiss these as mere excuses for racial segregation. He underestimates the power of America’s commercial culture and the way homes serve the financial purposes of property owners. Not only are developers keen on profiting from land value appreciation, home owners always have one eye on house prices.\nNearly everyone of importance in city building and public policy in the early twentieth century agreed on the desirability of racial segregation, whether in the interests of outright racism, or for the purposes of keeping the peace or upholding land values. It wasn’t just “white folks” in general but the entire real estate industry leading the way: bankers, builders, and brokers, plus all the supporting cast of architects, landscape architects, civil engineers, lawyers, and urban planners. Even the most progressive of urban reformers, such as Catherine Bauer, Clarence Stein, and Henry Wright, tolerated racial segregation in housing and urban development.\nThe consequence of this consensus was that when the New Deal policies of public housing, mortgage rescues, and federal mortgage insurance came along in the 1930s, they were following in a long-established tradition of racial segregation; they did not invent it. Furthermore, the laws creating key programs like the Home Owners’ Loan Corporation (HOLC), the Federal Housing Administration (FHA), and Federal National Mortgage Association (Fannie Mae) were passed (and written) with the help of NAREB and the mortgage banking industry. The chief economist of NAREB, Homer Hoyt, wrote the FHA regulations that included redlining as a means of minimizing risk for lenders and investors. As Marc Weiss has observed: “Since the mandate was to stabilize homeownership and reduce long-term insurance risk from a purely financial and actuarial perspective, redlining made economic sense, even if it was immoral as social policy.”\nI have a further objection to The Color of Law , in that Rothstein treats the New Deal as if Franklin Roosevelt and the New Dealers were just another bunch of racist politicians. The book even features FDR in the frontispiece, portraying him as central to the story of American racism. This is nonsense and a serious misrepresentation of the New Deal. Leading New Dealers, including Harold Ickes, Frances Perkins, Harry Hopkins, and Eleanor Roosevelt, not only made serious efforts to defy white supremacy and segregation; they were pretty much the first federal officials to do so since Lincoln and Reconstruction.\nAs a result, many New Deal programs like the Civilian Conservation Corps (CCC), Works Progress Administration (WPA), and public housing (under the Public Works Administration and the US Housing Administration) were not initially segregated. The CCC, for one, was gradually forced to segregate its camps due to local pressure from southern and rural communities. The WPA built thousands of integrated recreation facilities, including swimming pools, and there is ample photographic evidence of integrated WPA work teams, especially in service projects like sewing rooms, classrooms, and clinics. The CCC and WPA employed more than a million African Americans and other people of color, who were paid the same regardless of race. The New Dealers were well aware of the plight of African Americans and targeted them with programs for farm loans, housing, schooling, and more. It is especially galling that Rothstein starts his book with an attack on public housing, which the New Deal tried to build in quantity for the first time in US history and which provided tens of thousands of new homes for people of color. Public housing has always been a pariah in American politics, and Rothstein plays right into that prejudice.\nThe upshot of Rothstein’s perverse “hidden history” is a public shaming of the New Deal, its leaders, and its policies. This, too, conforms to popular conservative ideology that denigrates one of the most progressive moments in American history and government. It’s important to revisit the history of New Deal policies to see how and why it went wrong on race in cases where it did so, but overall, the New Deal should be remembered as the time of the greatest federal effort in American history to support working people — millions of whom were not white.\nI want to end on the key point of where social change and racial progress come from. The Color of Law is meant to educate us about the past, but in the end leaves us ignorant of how politics and power really work — leaves us unable to see how to make the future look different. American racism is not an unmovable barrier and has been pushed back considerably since the middle of the twentieth century. How was that done? Not by correcting the erroneous legal reasoning of the Supreme Court, as Rothstein seems to think. His final chapter on “fixes” for segregation is all about law and policy, but taking those in isolation just won’t do the job.\nMajor social change never comes without a fight, and massive popular struggles have brought about improvements in the conditions of working people and people of color over time. That is how the Civil Rights Movement arose in the interwar period and finally triumphed in the realm of law and policy in the 1960s, after years of struggle and mobilization. Good policies can help, of course, as they did during the New Deal or the 1960s, but a fundamental social revolution against white supremacy can only come through political upheaval and conflict, led from below. Rothstein has almost nothing to say about any of that.", "url": "https://jacobinmag.com/2019/06/the-color-of-law-richard-rothstein-review"}