{"authors": ["Kevin Warren"], "date_download": "2020-05-04 20:10:27", "date_modify": "2020-05-04 20:10:27", "date_publish": "2019-04-28 05:00:00", "description": "It’s been almost 3½ years since I saw and spoke with my mom. She was sitting on the edge of a nursing home bed; she had terminal cancer and I had to leave to catch my flight home. As we said...", "filename": "_312597f93dbd499989235e0e8455a946_1588623027.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_312597f93dbd499989235e0e8455a946_1588623027.html", "title": "It’s more personal than you know", "title_page": "It’s more personal than you know", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "It’s been almost 3½ years since I saw and spoke with my mom. She was sitting on the edge of a nursing home bed; she had terminal cancer and I had to leave to catch my flight home.\nAs we said goodbye, I remember walking out of the room, eyes on her, knowing this was likely the last time I would see or speak with her. Despite the flood of emotion, I had a comfort knowing the nursing home staff who cared for her every day had built a relationship with her and treated her with the dignity she deserved. She had touched their hearts, like she’s done with so many people.\nAfter discharging from Medicare, she was placed on hospice care and returned home, where she passed away with her daughter and her mother by her side. My family couldn’t afford for her to remain in the nursing home paying privately — we would have been looking to apply for Medicaid to help pay for the costs of nursing care she would have received had cancer not won the fight.\nMy mother was a proud woman. She spent her professional career as a private attorney and prosecutor. As a single mother, she lived within her means and did her best to care for her son and daughter, and then for my grandmother.\nMany Texans are relying on nursing home staff to care for our loved ones, not as the patient in Room 210A, but as the retired teacher, or grandmother of 10, or the father who never missed his son’s baseball game. We never want Mom to feel afraid or lonely or forgotten, but to be living with purpose.\nI’ve lived my entire life in Texas and have dedicated my career to ensuring quality and compassionate nursing home care in Texas. As Texans, we look out for one another; we take pride in responsibility, accountability and self-sufficiency. We take pride in being an example for others to follow.\nSadly, when it comes to caring for our elderly in Texas, we fall short. By the state’s own numbers, Texas is short over $945 million in what the state’s payment system says nursing facilities should be paid. Consequently, Texas has one of the highest nursing staff turnover rates in the country, negatively affecting the quality of care while increasing bankruptcies. Our reality is an underfunded system, forcing companies to leave Texas and families to suffer in some instances with a lower quality of care. This session, legislators can impact real change with the Texas Nursing Home Quality Act (SB 1050 and HB 3342). This legislation would make Texas the national leader in quality-based payments in nursing home care.\nIf this measure isn’t approved, I’m afraid the worst is yet to come. At least 25% of all nursing homes in Texas are at risk for closure or sale because of their willingness to care for Medicaid patients, and the inability to cover costs in caring for these patients.\nThe last time I saw my mom, I was coming back to Texas. The compassionate, quality care she was getting didn’t happen in Texas. Here, in a state known for taking care of its own, our nursing home owners and employees have continued efforts to provide dignified care, even while losing money.\nThis session, our Legislature and the state’s leadership have the ability to change the trajectory of long term care in Texas, either positively or negatively, for generations to come. Let’s look back on this legislative session and be able to take pride in how we supported those who raised us and who deserve to live out their days in facilities that reflect Texas values.\nKevin Warren is CEO of the Texas Health Care Association.", "url": "https://apnews.com/312597f93dbd499989235e0e8455a946"}