{"authors": ["Steve Early", "Rand Wilson", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Jeremy Brecher", "Antoine Dangerfield", "Julian Guerrero", "Joe Allen"], "date_download": "2020-05-04 19:59:35", "date_modify": "2020-05-04 19:59:35", "date_publish": "2019-07-12 00:00:00", "description": null, "filename": "2019_07_telephone-workers-strike-single-payer_1588622375.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/12140231/jobs.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_07_telephone-workers-strike-single-payer_1588622375.html", "title": "How a Telephone Workers’ Strike Thirty Years Ago Aided the Fight for Single Payer", "title_page": "How a Telephone Workers’ Strike Thirty Years Ago Aided the Fight for Single Payer", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nThirty years ago this summer, 60,000 telephone workers walked off the job in New York and New England — and stayed out for seventeen weeks. Their struggle against NYNEX, a telecom giant, became one of labor’s few big strike victories, during a decade that began with the disastrous defeat of PATCO, the national air traffic controllers union. Within the Communications Workers of America (CWA) and the International Brotherhood of Electrical Workers (IBEW), the model of membership mobilization and workplace militancy developed in 1989 has been used, to varying degrees, in every regional contract campaign they’ve conducted since then. Telephone workers in the northeast, employed at successor firms of NYNEX (including Verizon) or AT&T, have struck seven times during that period, over a variety of regional and national issues. (For more on their recent disputes, see Dan DiMaggio, at New Labor Forum). Three decades of joint bargaining and strike activity by more than thirty local affiliates of IBEW and CWA represents a major accomplishment by itself. In the rest of organized labor, workers represented by different unions which deal with the same private or public sector employer often fail to create any semblance of a united front. In an era of revived US strike activity, what makes the NYNEX dispute most worthy of study is the central issue involved: health care cost shifting. Workers today face the same kind of management demands for medical plan give-backs that forced 40,000 CWA members and 20,000 IBEW members to spend four months “holding the line in ’89.” As Washington state AFL-CIO president Larry Brown recently noted, health care is still “the biggest cause of strikes, lock-outs, and concession bargaining.” That’s because millions of workers with good union-negotiated benefits are paying more for them every year through increased co-pays, deductibles, and premium contributions or out-of-pocket payments for prescriptions or treatment not covered at all. The answer, according to Brown, is “to take health care off the bargaining table by making it a right for all Americans.” In the meantime, he says, unions should stop “trying to circle the wagons around an unsustainable model of employment-based healthcare.” The challenge facing labor negotiators today who favor Medicare for All is no different than in 1989. How do we defend past private insurance gains in a way that builds stronger support for universal coverage, based on the single-payer model?\nOvercoming Internal Division Before the showdown with NYNEX that enabled IBEW and CWA members to avoid making any health care premium contributions for the next two decades, the two telecom unions had to get their own act together. In 1986 bargaining, conducted with each union separately, NYNEX got IBEW to refrain from striking and accept health care concessions. CWA members struck for nine days to defeat the same cost shifting demands. But IBEW-represented workers then got the benefit of CWA’s better settlement with no sacrifice, thanks to their union’s “me-too” deal with NYNEX. (In labor relations back then, “me-tooism: was a much-used management tool for sowing dissension and undermining solidarity.) Fortunately, in the next round of IBEW local elections, incumbent officials who aided this divide-and-conquer strategy were defeated by rank-and-file dissidents. In 1988, this new leadership, personified by IBEW Local 2222 Business Manager Calvey in Boston, began to work closely with CWA on a coordinated campaign of membership education and mobilization, in hundreds of workplaces in six states. The first goal of that internal effort was to expand existing shop steward networks by recruiting and training 4,000 “mobilization coordinators. Their job was to keep members active and informed about FACTS — the “Fight Against Cost Shifting.” This became the acronymic focus of escalating “days of action” involving red T-shirt, sticker, and button wearing, informational picketing, and then a union takeover of an employee gathering held on the eve of NYNEX’s annual shareholders’ meeting. The facts were simple. The $10 per week payroll deduction for health insurance sought by NYNEX would, under its proposed cost-sharing escalator and medical spending cap, leave union members footing 30 percent of the bill for their benefits by contract expiration. To back up its demand — even before 1989 negotiations over this issue started — NYNEX sent every bargaining unit employee a form authorizing future sharing of health insurance premium costs. Those who failed to return this paperwork by a company-set deadline were threatened with higher deductibles for the next three years. Demonstrating the potency of an eleven-month internal organizing drive that built workplace solidarity and trust, 85–90 percent of all CWA-represented technicians, operators, and customer service reps refused to turn in the payroll deduction cards.\nDemanding a Political Solution When the NYNEX strike began on August 6, 1989, the fight against cost-shifting had to be framed differently. Most phone company customers, including those who belonged to unions, already made premium contributions, if they were lucky enough to have job-based coverage. The public was not likely to be sympathetic if NYNEX succeeded in depicting strikers as selfish, overly privileged defenders of a medical plan better than anyone else’s. So, CWA and IBEW went on the offensive, printing up thousands of strike posters, stickers, and leaflets which highlighted the demand: “Health Care For All, Not Health Cuts At NYNEX.” In press interviews, strike-related op-eds, letters to the editor, radio talk show appearances, and rally speeches, union representatives rejected the idea that medical cost inflation could be solved through worker give-backs to individual employers like NYNEX, which was hugely profitable. Strike organizers argued that the United States needed a tax-supported system of coverage not tied to employment, in which a single government payer would replace the role of private insurers with their billions of dollars’ worth of wasted overhead and administrative costs. Only then would all workers, union and nonunion, have access to affordable and quality care, with effective cost controls. To expose the interlocking director relationships that were part of the reason why corporate America (NYNEX included) favored the health care status quo, strikers staged protests at the headquarters of big private insurers with ties to their employer. They targeted NYNEX board members, by picketing their homes in wealthy neighborhoods, places of business, and public appearances before civic groups. NYNEX strikers linked up with other union members engaged in simultaneous work-stoppages, about benefit issues, at Pittston and Eastern Airlines. Coal miners and pilots were prominently featured at CWA-IBEW rallies, marches, and regular strike meetings; meanwhile, the NYNEX walkout became a major focus of trade union solidarity throughout the northeast.\nSiding With Consumers Community outreach by the striking unions took multiple forms. CWA aligned itself with customers concerned about the cost and quality of NYNEX’s state-regulated service. Telephone workers gathered 100,000 signatures from poor and working-class phone users in NY opposed to a $360 million rate hike sought by the company. A majority of state legislators also lent their names to union ads opposing the increase. During the strike, more than 15,000 IBEW and CWA members gathered in Boston for one of the biggest labor protests in that city’s history, a mass rally and march featuring recent presidential candidate and single-payer advocate Jesse Jackson. In addition to Rev. Jackson and his Rainbow Coalition, strikers teamed up with Citizen Action, the National Organization of Women and Physicians for a National Health Program (PNHP). A then-unemployed Vermont politician named Bernie Sanders (who was sojourning at the Kennedy School of Government in the fall of 1989) organized a forum that brought together Harvard students, NYNEX strikers, and health care reform advocates. Creative messaging, progressive coalition-building, and pro-active legislative/political work all helped to defeat NYNEX’s drive for concessions. But the 1989 strike ultimately succeeded because of the courage, determination, and personal sacrifice of thousands of workers. Before a settlement was reached, the company cut off medical coverage for all 60,000 strikers and their families, creating a huge strike relief challenge — and a teachable moment about the downside of job-based benefits. There were two strike-related fatalities — a CWA steward in New York was hit and killed by a scab-driven car; and an IBEW member in New Hampshire, forced to take a job in a nonunion factory to support his family, died in a grisly industrial accident. Due to their highly effective mobile and mass picketing, many strikers were arrested. Several hundred faced strike-related suspensions or firings (which took many months to contest and resolve in arbitration proceedings held after other strikers returned to work). Allegations of sabotage became the subject of full-page NYNEX ads in the Boston Globe and New York Times, which offered $100,000 rewards to readers with information about the culprits.\nBlocking a Back-Door Deal Like NEA and AFT bureaucrats in some recent “red state” teachers’ struggles, higher-level officials of the IBEW were deeply unnerved by rank-and-file militancy. The leadership of the IBEW nationally and regionally at the time was conservative, building trades–oriented, and not supportive of strike activity. Telephone workers were treated as second-class members within the IBEW. Strikers in New England got some assistance from an emergency relief fund that raised and disbursed less than $200,000. Meanwhile, one electrician local continued to supply its own members to NYNEX contractors doing struck work, until that form of union scabbing was finally stopped. As the strike dragged on, one IBEW International Vice-President tried to bypass his own union’s elected bargaining committee and reach a separate settlement with NYNEX that included concessions. Only the direct intervention of IBEW strikers — who picketed his office by the hundreds — aborted this back-door deal, a return to work by the IBEW, and fatal unraveling of union unity. Meanwhile, the 40,000 CWA strikers were strongly backed by their national and regional officials. Everyone picketing had access to a $16 million CWA defense fund. Based on personal need, local union committees authorized payment of medical bills or COBRA coverage; to prevent eviction, overdue rent or mortgage payments were also made. NYNEX strikers residing in New York became eligible for state unemployment benefits after an eight-week waiting period. But even in those enviable and unusual circumstances, CWA’s relief fund was not adequate. To provide aid to members and their families near the end of the struggle, CWA had to borrow $15 million (at a generously low interest rate) from ZENDENTSU, the Japanese telephone workers’ federation. In the strike’s aftermath, CWA convention delegates decided that the union should never again be caught short, so quickly, due to a work stoppage of such large scale and long duration. They approved a dues increase to finance a new Members’ Relief Fund. The MRF now has a balance of more than $425 million and provides fixed weekly strike benefits (which start at $200 and increase to $400, in longer disputes). Post-strike, single-payer advocacy continued, including a union attempt to get NYNEX shareholders to adopt a resolution in favor of Canadian-style health care reform. The first anniversary of the strike was observed by a Jobs with Justice-initiated “Health Care Action Day,” in which IBEW and CWA members participated in their own workplaces.", "url": "https://www.jacobinmag.com/2019/07/telephone-workers-strike-single-payer"}