{"authors": ["Logan Wroge", "Wisconsin State Journal"], "date_download": "2020-05-04 20:07:15", "date_modify": "2020-05-04 20:07:15", "date_publish": "2019-02-15 16:30:00", "description": "Over the past three years at Madison high schools, while arrests have dropped and the number of citations has fluctuated, African-Americans continue to predominantly be those most cited or...", "filename": "_7ab8f03c27a4419ab57f939af0f0dda9_1588622835.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7ab8f03c27a4419ab57f939af0f0dda9_1588622835.html", "title": "Scale of 'school-to-prison pipeline' has been 'vastly exaggerated'", "title_page": "Madison Police Chief: Scale of 'school-to-prison pipeline' has been 'vastly exaggerated'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Over the past three years at Madison high schools, while arrests have dropped and the number of citations has fluctuated, African-Americans continue to predominantly be those most cited or arrested, according to Madison Police Department data.\nAs the fate of a contract that stations police officers in high schools remains uncertain, Police Chief Mike Koval took to his blog Thursday to back the school-based officers and argue that the department’s data do not support a “school-to-prison pipeline” narrative that opponents say results in minority students being disproportionately put into the criminal justice system.\n“While the numbers are at a point where we should still be doing a deeper drill to see how we can continue to improve and mitigate those numbers, the extent to which the ‘problem’ has been described, I think has been vastly exaggerated,” Koval said in an interview.\nKoval attached to his blog post a report the Madison Police Department complied using data from the past three school years on the citations issued and arrests made at the district’s four main high schools — East, La Follette, Memorial and West — where a uniformed and armed police officer, known as a school resource officer, or SRO, is stationed during school hours.\n“There is no question that the combination of school disciplinary practices and juvenile justice practices, working in interaction, have unnecessarily, disproportionately placed young people in the juvenile justice system,” said School Board member TJ Mertz.\nWhile he said the phrase “school-to-prison pipeline” is a little loaded, Mertz said when a student is taken from school to the juvenile jail, “then literally they are involved in the school-to-prison pipeline, and to pretend otherwise is absurd.”\nThe police data include anyone, regardless of age or student status, who was arrested or cited at the four high schools by any police officer, not just SROs.\nYouths between ages 14 and 17 made up the large majority of those who were arrested or cited.\nDuring the previous three school years, 390 citations were issued to 335 people at the four main high schools: 148 in 2015-16, 108 in 2016-17, and 134 in 2017-18.\nAfrican-Americans were issued about 68 percent of the citations in the first two years and about 77 percent of citations last school year. Over those three years, black students accounted for a little less than 18 percent of the district’s enrollment.\nKoval noted 43 percent of citations were for truancy and 20 percent for trespassing, issued at the request of school officials.\n“The majority of citations issued to students are not self-initiated by an officer working in isolation, they are from the direction and collaboration of a school official,” he said in the blog.\nMertz said Koval’s argument of those citations not being self-initiated is “muddying the water a little bit” as board policy bars officers from citing or arresting students, except in limited circumstances, without the request of an administrator.\nDistrict spokeswoman Rachel Strauch-Nelson said truancy tickets are viewed differently by the district when it compiles its own arrest and citation data, as truancy offenses usually come with different interventions than a simple fee associated with other citations.\nAll the youths between ages 12 and 16 issued a municipal citation at the high schools were offered the chance to enter a restorative justice diversion program, Koval said. That option has been available to youths in that age range, regardless of whether they are cited in school or out of school, since 2015.\nThe top five citations over the three years were: 168 for truancy, 84 for disorderly conduct, 79 for unlawful trespass, 16 for battery, and 13 for possession of marijuana. The 390 citations were divided among the high schools with 113 at East, 96 at Memorial, 91 at West and 90 at La Follette.\nThe Police Department’s report differs in the way citations are counted compared to the National Incident-Based Reporting System, the federal system of collecting and reporting crime data that considers certain citations to be arrests.\n‘Physical arrests’ drop\nThe “physical arrests,” in which an officer made an arrest and removed the person from the high school to be taken somewhere else such as the Juvenile Detention Center, have declined over three years, according to Madison police.\nThere were 65 arrests in 2015-16, 54 in 2016-17 and 36 in 2017-18 that resulted in 257 distinct criminal charges. The majority of those arrested — about 83 percent of those taken into custody in all three years — were African-Americans.\nOver the three years, 10 of the 155 physical arrests involved people 20 or older.\n“We got four great (SROs), and they know any day we have to physically arrest a kid and take a kid out of school, it’s a very, very bad day at school,” said Joe Balles, the district’s safety and security coordinator. “All systems have failed if we ever get to that point.”\nThe top five suspected criminal actions were: 39 for disorderly conduct, 12 for battery, 11 for resisting arrest or obstructing police, eight for a juvenile warrant and seven for possession of a weapon.\nContract’s final year\nThis academic year is the last in a three-year contract between the district and Police Department to provide SROs, formerly referred to as educational resource officers, or EROs, at the high schools.\nThe district has been re-examining the duties and policies of the officers following criticism of the SRO program and has sought several changes to the contract. Late last year, the School Board, on a 4-2 vote, supported a new contract with changes that emphasize alternative disciplines over arrests and citations, require more training for SROs and lay the groundwork for a new complaint process.\nBut an amendment to the contract made at the board’s meeting would give the School Board the ability to require an SRO be replaced if problems with the officer cannot be resolved — a condition the Madison Police Department had said was a nonstarter as it would likely run aground of the department’s labor agreements.\nKoval said he is not confident an agreement can be reached, calling negotiations “effectively at an impasse.”\n“The district continues, through its attorney, to want to have some sort of ownership or control over our officers, where there are disagreements with the officer, that there be an opportunity for mediation to decide what to do with the officer,” Koval said.\nMertz characterized the negotiations as being “paused.”\n“Negotiations are continuing with the city,” Strauch-Nelson said. “We believe we are ultimately responsible for the adults in our school buildings, and that we should have some say in assignments.”\nKoval said the department “would love to continue our relationship with (the district) by having SROs in the high schools.”\n“We believe they are a complementary piece to helping all students feel safe and maximize their learning potential,” he said. “However, I will not let SROs continue to be scapegoated, maligned and blamed for issues that are beyond the pale of MPD’s control.”", "url": "https://apnews.com/7ab8f03c27a4419ab57f939af0f0dda9"}