{"authors": ["Rowan Scarborough The Washington Times"], "date_download": "2020-05-04 20:20:39", "date_modify": "2020-05-04 20:20:39", "date_publish": "2019-02-24 21:30:11", "description": "Anti-Trump dossier creator Christopher Steele will face a London defamation trial later this year, one of two court cases in which he was forced to produce his first and only on-the-record...", "filename": "_bd1ac13c92a80b738d70ff56843bd1cf_1588623639.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bd1ac13c92a80b738d70ff56843bd1cf_1588623639.html", "title": "Christopher Steele libel trial to begin in fall", "title_page": "Christopher Steele libel trial to begin in fall", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Anti-Trump dossier creator Christopher Steele will face a London defamation trial later this year, one of two court cases in which he was forced to produce his first and only on-the-record statements on how he investigated and spread Democratic Party opposition research.\nA lawyer involved in a lawsuit told The Washington Times that the London trial will start this fall, sometime between mid-October and mid-December.\nA half-dozen libel lawsuits have been filed against Mr. Steele and other dossier-related operatives. The one filed in London in 2017 by Russian entrepreneur Aleksej Gubarev would be the first to reach trial.\nMr. Steele is a key figure in promoting Trump-Russia conspiracy theories within the Obama administration and the news media. In his final of 17 dossier memos in December 2016, he accused Mr. Gubarev, a large supplier of computer servers, of hacking into Democratic Party computers under pressure from Russian intelligence. Mr. Gubarev, a resident of Cyprus, immediately denied the charge. There has been no evidence he did the intrusion.\nMr. Gubarev sued BuzzFeed in Florida for publishing the discredited 35-page dossier, which listed his name as a criminal hacker. A federal judge dismissed the case, but not because she ruled the charge was true. Rather, she ruled that BuzzFeed had a right to publish since the FBI was using Mr. Steele’s charges to investigate President Trump.\nIn Britain, libel laws don’t favor the press the way they do in the U.S.\nMr. Gubarev’s lawsuit has avoided the issue of dismissal because Mr. Steele’s defense isn’t that the dossier is true, said Val Gurvits, Mr. Gubarev’s U.S.-based attorney. Mr. Gubarev heads XBT Holdings, which includes the server provider Webzilla.\n“They didn’t have a motion to dismiss,” Mr. Gurvits told The Times. “It doesn’t work that way in England. Because they did not allege truth as a defense, they did not have a right to file for summary judgment. That’s a huge issue, by the way, that most of the press conveniently ignored. Christopher Steele is not arguing that the allegations against Gubarev are true.”\nMr. Gurvits said the trial is slated to start between Oct. 21 and Dec. 18.\nMr. Steele underwent lawyer questioning in London, but his deposition remains sealed.\nMr. Steele and his Orbis Business Intelligence firm also are being sued for defamation in London by three Russian oligarchs tied to Russian President Vladimir Putin. Mr. Steele accused Alfa Bank’s Mikhail Fridman, Petr Aven and German Khan of paying cash bribes to Mr. Putin.\nSome Republicans today, after two years of investigations, view the dossier as a hoax, perhaps perpetrated by Mr. Steele’s Kremlin sources.\nThe three Russian billionaires sued Fusion GPS, Mr. Steele’s handler, in a court in the District of Columbia. A judge dismissed the case, prompting an appeal.\nWithout these two London libel cases, the public might never know details of Mr. Steele’s campaign to spread unverified charges against Mr. Trump. He has filed at least two declarations in the Gubarev case and one in the Alfa lawsuit.\nAmong Mr. Steele’s disclosures in Gubarev v. Orbis:\nHe was hired by the Washington investigative firm Fusion GPS in June 2016 to “prepare a series of confidential memoranda based on intelligence concerning Russian efforts to influence the U.S. presidential election process and links between Russia and Donald Trump.” Fusion co-founder Glenn Simpson told Congress he didn’t give Mr. Steele such a specific charge.\nOrbis associate Andrew Wood met postelection with Sen. John McCain and an associate, David Kramer. The meeting started the process of placing the dossier in their hands to deliver to FBI then-Director James B. Comey. Mr. Steele, a former MI6 intelligence officer posted in Moscow, also provided some dossier material to British intelligence.\n(It emerged in the Florida case that Mr. Kramer leaked the dossier to BuzzFeed. Court filings show BuzzFeed journalists put complete trust in Mr. Steele’s work. Mr. Steele said he made it clear to Mr. Kramer that the dossier should be used only in McCain’s official capacity.)\nThe charges against Mr. Gubarev in the December memo were “unsolicited intelligence” and “raw intelligence” that “needed to be analyzed and further investigated/verified.” He said, “Such intelligence was not actively sought; it was merely received.”\nThe “raw intelligence” included supposed details on then-Trump attorney Michael Cohen making a secret trip to Prague in August 2016 to meet with Putin aides and engineer a hacking cover-up. Cohen has denied repeatedly that such a trip took place and hasn’t retracted that even since turning against Mr. Trump under pressure for unrelated crimes from special counsel Robert Mueller. No public evidence of the trip has surfaced from Mr. Mueller’s office.\nThe dossier didn’t contain the identities of Mr. Steele’s sources. He describes them as “a former top Russian intelligence officer,” a “senior Russian Foreign Ministry figure,” a “former top level Russian intelligence officer still active inside the Kremlin” and a “senior Kremlin official.”\nMr. Steele, at Mr. Simpson’s urging, briefed news outlets during September and October 2016 trips to Washington: The New York Times, The Washington Post, Yahoo News, The New Yorker and CNN.\nMr. Steele’s dossier emphatically stated there was an “extensive conspiracy” between the Trump campaign and the Kremlin to hack computers and spread stolen documents.\nIn contrast, in his court declaration Mr. Steele talks only of “possible coordination of members of the Trump campaign and Russian government officials.”\nAmong Mr. Steele’s disclosures in Fridman, Aven, and Khan v. Orbis:\nMr. Steele said Fusion hired him to obtain information that Democratic nominee Hillary Clinton could use to challenge the 2016 presidential election should Mr. Trump win.\nNo congressional testimony suggested this motive.\n“Internet traffic data suggested” that a computer server at Trump Tower were directly linked to Alfa bank for communications.\n(This charge has not been supported by public evidence. Cybersleuths say the server in question sits outside Philadelphia spewing marketing spam that includes Trump hotels.)\nMr. Steele made dossier disclosures to Strobe Talbott, a longtime Washington fixture as a journalist, deputy secretary of state under President Clinton and a former president of the Brookings Institution. He now serves as chairman of the State Department’s Foreign Affairs Policy Board.\nThe Talbott revelation adds to extensive effort Mr. Steele undertook to spread his allegations in an attempt to ruin candidate Trump.\nBesides Mr. Kramer, McCain, journalists and Mr. Talbott, Mr. Steele briefed a John F. Kerry aide at the State Department; Justice Department attorney Bruce Ohr, who relayed information to the FBI; and the FBI directly in Italy and Great Britain, and by phone and messages.", "url": "https://apnews.com/bd1ac13c92a80b738d70ff56843bd1cf"}