{"authors": ["Tom Howell Jr. The Washington Times"], "date_download": "2020-05-04 21:07:13", "date_modify": "2020-05-04 21:07:13", "date_publish": "2019-03-25 17:25:00", "description": "Roughly 11.4 million people signed up for Obamacare coverage this year, according to a final government report that finds roughly 300,000 fewer people selected or renewed an exchange plan compared...", "filename": "_8fe78817ee343661a72775738fad8685_1588626433.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8fe78817ee343661a72775738fad8685_1588626433.html", "title": "Obamacare enrollment dropped 300K for 2019: CMS", "title_page": "Obamacare enrollment dropped 300K for 2019: CMS", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Roughly 11.4 million people signed up for Obamacare coverage this year, according to a final government report that finds roughly 300,000 fewer people selected or renewed an exchange plan compared to 2018.\nThe Centers for Medicare and Medicaid Services offered a number of theories for why signups ebbed, even as premiums stabilized overall.\nIt said higher employment likely contributed to the decline, as people shift into job-based coverage, and that 100,000 Virginians suddenly became eligible for Medicaid instead of exchange coverage, after the commonwealth used federal dollars under Obamacare to expand the federal-state insurance program for the poor.\nDemocrats say Mr. Trump is largely to blame for drops in enrollment in recent years.\nIn particular, they cite his push to slash outreach and marketing funding for HealthCare.gov the main Obamacare website and extend the availability of cheaper, bare-bones plans that don’t comply with the law’s standards.\nEnrollment in state-run exchanges has been relatively stable, while the federal exchange has seen decreases.\nThe administration argues the exchanges remain stable overall, despite the hue and cry, and that they’ve managed to cut the most unpopular parts of the Affordable Care Act, while extending more affordable options to those left behind by the law.\nCMS said Monday it is extending, by one year, an Obama-era policy that allowed people to hold onto “grandmothered” plans that didn’t comply with Obamacare’s new rules.\nThe last administration offered the reprieve amid a firestorm over cancellation notices in late 2013, when people realized they couldn’t hold onto plans they liked.\n“Not extending the grandmothered plan policy would cancel plans that are meeting people’s needs today and, as a result, force people to decide between buying coverage they cannot afford on the individual market or going uninsured,” said CMS Administrator Seema Verma. “By extending the grandmothered plan policy, we are following through on our commitment to protect those left behind by Obamacare.”", "url": "https://apnews.com/8fe78817ee343661a72775738fad8685"}