{"authors": ["Sarah Clayton Special To The State Journal"], "date_download": "2020-05-04 20:07:50", "date_modify": "2020-05-04 20:07:50", "date_publish": "2019-05-05 11:00:00", "description": "If you ask an archaeologist what they study, they will likely explain that we aim to understand major transformations in our human history. Why, for example, did human societies begin to...", "filename": "_2018cbc03fbe4240b77ed5627d141561_1588622870.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2018cbc03fbe4240b77ed5627d141561_1588622870.html", "title": "Archaeologist excavates the details of everyday life", "title_page": "Archaeologist excavates the details of everyday life", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "If you ask an archaeologist what they study, they will likely explain that we aim to understand major transformations in our human history.\nWhy, for example, did human societies begin to practice agriculture? How did the world’s first cities form?\nWhile my students and I steadily scrape the ground with our trowels to uncover crumbling remnants of adobe houses, charred food remains from cooking hearths, and broken bits of pottery, our minds drift toward different kinds of questions: Where did people sleep? What was for dinner? And, of course, where were the bathrooms?\nAs an archaeologist, I am fascinated by the ways in which urban communities form and endure over the long term.\nMy interests have led me to central Mexico, where I collaborate with students and colleagues to reconstruct population growth, land use and social interaction in a settlement that prospered more than 1,000 years ago.\nWe use the material remains of daily practices to trace the story of a community with no written history, whose inhabitants innovated forms of local leadership and were able to successfully sustain a large population for many centuries.\nThe beauty of archaeology is its capacity to connect big questions about the trajectories of human societies with the smaller details of everyday life.\nArchaeology advances knowledge of substantial long-term social change. As a necessary part of this process, it also illuminates experiences and concerns of daily life that we can all relate to and that connect us through time and space.", "url": "https://apnews.com/2018cbc03fbe4240b77ed5627d141561"}