{"authors": ["Pam Eggemeier Peggemeier Saukvalley.Com", "Ext."], "date_download": "2020-05-04 20:06:14", "date_modify": "2020-05-04 20:06:14", "date_publish": "2019-03-30 00:21:00", "description": "STERLING – Infrastructure has emerged as a predominant issue in the city's 1st Ward aldermanic race between an experienced incumbent and a youthful challenger calling for change. Retha...", "filename": "_8c0bf3ed56254531baca7db405b72fb8_1588622774.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8c0bf3ed56254531baca7db405b72fb8_1588622774.html", "title": "Experience vs. change on the ballot in Sterling council race", "title_page": "Experience vs. change on the ballot in Sterling council race", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "STERLING – Infrastructure has emerged as a predominant issue in the city’s 1st Ward aldermanic race between an experienced incumbent and a youthful challenger calling for change.\nRetha Elston, 55, who has represented the ward for 13 years, is opposed by Dasan Klingenberg, 23, in Tuesday’s general election. Elston is a registered nurse at KSB Hospital in Dixon. Klingenberg is a sales associate with U.S. Cellular.\nElston is one of two council members on the Sterling Liquor and Tobacco Commission; the other is 4th Ward Alderman Joe Martin.\nWhile both candidates agree that infrastructure should continue to be a top priority for the city, they have different views on how much progress has been made. Elston said the city is making the most of its sales tax revenues to chip away at a long list of needed stormwater sewer upgrades.\n“In the last year alone, we have finished or started more than $6.2 million in stormwater sewer projects,” Elston said.\nDuring her time on the council, great strides have also been made in city beautification efforts. If re-elected, she said she would continue to focus on revitalization efforts and working with residents on building priorities.\n“We have cleaned up blight at more than 35 abandoned properties,” Elston said. “Much has been done through the efforts of Public Works and our code enforcement department.”\nKlingenberg’s campaign has been heavily weighted in infrastructure, primarily a call for sidewalks and roads. While not specifically addressing how to pay for it, he believes it can be done without adding to the burden of property owners.\n“We need to re-evaluate how the money we have in the budget can be used so we don’t have to raise taxes,” Klingenberg said. “The city is crumbling and taxes keep going up.”\nKlingenberg says the city has “dropped the ball” on the riverfront.\n“Progress has been slow, and we’ve heard a lot of excuses about EPA funding and other things holding it up,” Klingenberg said.\nElston counters that her opponent doesn’t have an appreciation of the enormity of the work that has been done at the Northwestern Steel and Wire site and the environmental challenges at the Lawrence building.\n“A lot has been done at the riverfront in the last 10 years,” Elston said. “The mill cleanup and redevelopment is a huge project that towns this size rarely do. We have used the Mud to Parks grant and moved a building to the business park and put in walkways.”\nKlingenberg said the community feels it’s not being heard and he can provide a new voice.\n“Some of the members have been on the council for at least a decade and I think there is great value in having a different generational voice,” he said.\nKlingenberg said his technology experience could be used to help the city innovate in that area.\nElston has a reputation for making herself readily available to the residents of the First Ward and doggedly working to find answers for them.\n“I am devoted to the ward and I treat residents like they were part of my family,” she said. “I’m experienced, knowledgeable, and if I don’t have an answer, I’m persistent about finding it.”\nBoth candidates said they are concerned about rural population loss and are focused on quality-of-life issues that will help the city retain and draw residents.", "url": "https://apnews.com/8c0bf3ed56254531baca7db405b72fb8"}