{"authors": ["Spike Jordan"], "date_download": "2020-05-04 20:17:58", "date_modify": "2020-05-04 20:17:58", "date_publish": "2019-03-06 01:00:00", "description": "SCOTTSBLUFF — When people think of ragtime music, they usually think of two things: music played on an out-of-tune piano in the back of a smoke-filled bar, or the score from the 1973 movie “The...", "filename": "_5d1b595705014b5a823fc9740f610411_1588623478.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5d1b595705014b5a823fc9740f610411_1588623478.html", "title": "Peacherine Ragtime Society Orchestra to perform at Midwest Theater", "title_page": "Peacherine Ragtime Society Orchestra to perform at Midwest Theater", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SCOTTSBLUFF — When people think of ragtime music, they usually think of two things: music played on an out-of-tune piano in the back of a smoke-filled bar, or the score from the 1973 movie “The Sting,” which featured Scott Joplin’s “The Entertainer” as the theme music.\n“Really, ragtime was America’s first popular music,” conductor Andrew Greene said in a telephone interview Tuesday. “Before we had jazz, before we had country — certainly before we had rock ‘n’ roll, there was ragtime. It laid the foundations for all of the American music that we now celebrate and love.”\nBilled as “the premier American ragtime ensemble,” Greene’s Peacherine Ragtime Society Orchestra will take the stage at The Midwest Theater on Friday, March 8.\nGreene said that ragtime’s birth coincided with the first forms of recorded music — the player piano, which mechanically played music based on rolls of paper with holes corresponding to the notes that the keys would play; and the wind-up phonograph, which allowed for music to be recorded to shellac records and reproduced on a mass scale.\n“It was really this cultural revolution where suddenly audiences all around the world could hear a guy in New York sing,” Greene said. “You could hear it in Scottsbluff or San Francisco.”\nIt was also an era when the automobile was new, flying machines took to the skies and the first moving pictures began to light up screens in movie halls across the nation.\n“For the first time, the music seemed to capture all of the innovation and excitement that was going on in America with all of the new waves of technology,” he said. “We try to capture a bit of that fun and essence in all of our shows.”\nGreene said the program, titled “Masters of Silent Comedy,” recreates the movie-going experience of the early 1920s. Three silent films from Charlie Chaplin, Buster Keaton, and Laurel & Hardy will be projected while the 12-piece orchestra plays the original scores written for the films.\n“We’re also recreating the same sized ensemble that would have been in a medium-sized vaudeville or motion picture house at about 1910 or 1915,” Greene said.\nMany of the musicians are also playing on period instruments — the drummer is bringing equipment from 1897 to play on, the brass instruments are from 1919, the string players’ instruments are from 1916.\n“It’s about as in-depth as we can go, using the original music with the original films, played by the same type and ensemble,” he said. “We try to recreate everything, because there’s a different sound. If you hear a modern snare drum, it’s not the same.”\nGreen said the way the music was written, it doesn’t need a piano to make it work.\n“When everyone thinks of ragtime, they think of a piano, but brass bands and orchestras were a crucial thing of the day,” he said. “They would play the pop music of the day, and then people would go to their local music store after a show, purchase the sheet music for 5 or 10 cents, and then go home to learn the new popular song on their piano.”\nIn a way, ragtime musicians produced the “hit new singles” long before 45 rpm records or iTunes downloads.\nYou can see The Peacherine Ragtime Society Orchestra for yourself at The Midwest Theater in downtown Scottsbluff Friday, March 8, at 7:30 p.m.\nTickets are $22 for members and students, and $26 for non-members.\nFor tickets and more information, visit: https://midwesttheater.com/, call 308-632-4311 or email midwest@nebraskarts.com.", "url": "https://apnews.com/5d1b595705014b5a823fc9740f610411"}