{"authors": [], "date_download": "2020-05-04 20:06:40", "date_modify": "2020-05-04 20:06:40", "date_publish": "2019-12-26 07:50:10", "description": "SURFING SANTAS RIDE WAVES ALONG FLORIDA'S SPACE COAST COCOA BEACH, Fla. (AP) - Who needs a sleigh when you've got a surf board? Some 600 surfers dressed as Santa chose surfboards instead of...", "filename": "_1826ecd2de70423e8c33d084fbb29909_1588622800.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1826ecd2de70423e8c33d084fbb29909_1588622800.html", "title": "AM Prep-Kickers", "title_page": "AM Prep-Kickers", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SURFING SANTAS RIDE WAVES ALONG FLORIDA’S SPACE COAST\nCOCOA BEACH, Fla. (AP) - Who needs a sleigh when you’ve got a surf board? Some 600 surfers dressed as Santa chose surfboards instead of sleighs on Tuesday during an annual Christmas Eve surfing fundraiser in Cocoa Beach, Florida. Almost 10,000 spectators also turned out for the 10th Annual Surfing Santas event along Florida’s Space Coast. The surfing fundraiser raised $40,000 for the Florida Surf Museum and a nonprofit that helps people with cancer.\nJFK LETTER PROMISING SANTA SAFE DURING COLD WAR ON DISPLAY\nBOSTON (AP) — Former President John F. Kennedy’s letter reassuring a young girl that Santa was safe during the Cold War is being featured this month in Boston. The JFK Presidential Library and Museum is displaying a carbon copy of the letter along with other holiday-themed artifacts in its lobby. Kennedy’s 1961 letter was addressed to an 8-year-old Michigan girl, who wrote to the president about her concerns that the Russians would kill Santa if they tested a nuclear bomb in the North Pole. Kennedy said Santa had told him recently that he was fine and was planning to deliver presents on Christmas as usual.\nMAN ROBS COLORADO BANK, THROWS CASH, SAYS ‘MERRY CHRISTMAS’\nCOLORADO SPRINGS, Colo. (AP) — A 65-year-old Colorado man is jailed after witnesses say he robbed a bank in Colorado Springs, walked outside and threw money out of the bag and then said ‘Merry Christmas.’ He then walked to the coffee shop next door and sat down and waited for police. Dion Pascale told KKTV that bystanders picked the money up and gave it back to the bank teller. Police say thousands of dollars are still missing. The man is jailed on $10,000 bail and a court date is set for Thursday.\nSEA LION ‘STILL FEISTY’ AFTER FALL TO CALIFORNIA HIGHWAY\nLAGUNA BEACH, Calif. (AP) - A sea lion pup was in critical condition but feisty after it fell more than 30 feet from a footbridge onto a highway in California. The Orange County Register said the 33-pound pup, now named “Lords-a-Leaping,” was dehydrated and emaciated when it was rescued Monday evening in Laguna Beach by staff from the Pacific Marine Mammal Center. It did not appear to suffer any fractures or internal injuries. Animal care coordinator Wendy Leeds told The Associated Press that most animals at the center are in critical condition for at least a week after they arrive. She said the pup was eating and feisty on Wednesday.\nROOKIE NFL PLAYER PAYS OFF LAYAWAY DEBTS FOR 60 PEOPLE\nOCALA, Fla. (AP) — A rookie NFL player has paid off the layaway debts of five dozen people at a shopping center store in Florida. Ulysees Gilbert, a linebacker for the Pittsburgh Steelers, on Monday paid off thousands of dollars in debts for 60 people at a Burlington Factory at the Shady Oaks Shopping Center in Ocala, Florida. Gilbert graduated from a local high school. He said he got the idea when he saw other professional athletes paying off layaway debts on social media.\nYEARS LATER, THIEF SENDS COUNTY MONEY FOR STOLEN RECEPTACLE\nTOPEKA, Kan. (AP) — A Kansas county has an extra $75 in its coffers thanks to a former thief with a guilty conscience. The Topeka Capital-Journal reports that someone anonymously sent the money to Shawnee County along with a letter dated Dec. 18. The letter states that the sender is in a 12-step program and working to make financial amends. It states that many years ago the writer stole a receptacle meant for cigarette ashes that was in front of the courthouse. County Commission Chairman Bill Riphahn says the letter was accompanied by three $20 bills, one $10 bill and one $5 bill.\nNIGHT DRONE FLIGHTS REMAIN A MYSTERY TO COLORADO AUTHORITIES\nDENVER (AP) — The purpose of recent nighttime drone flights over northeast Colorado has remained a mystery to authorities who are trying to learn the identities of the operators. The Denver Post reported the drones have flown over Phillips and Yuma counties for the last week. The Phillips County Sheriff’s Office cannot explain where the drones are coming from or who is flying them. The sheriff says the group of at least 17 drones with wing spans of about 6 feet fly only in the dark. Federal aviation, law enforcement and military officials say they do not have information about the aircraft.", "url": "https://apnews.com/1826ecd2de70423e8c33d084fbb29909"}