{"authors": ["Fredrik V. Sand", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Rune Møller Stahl", "Óscar García Agustín", "Martin Bak Jørgensen", "Meagan Day", "Andreas Møller Mulvad"], "date_download": "2020-05-04 19:58:26", "date_modify": "2020-05-04 19:58:26", "date_publish": "2019-06-05 00:00:00", "description": null, "filename": "2019_06_denmark-red-green-social-democrats-elections_1588622306.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/06/05102414/red-green.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_06_denmark-red-green-social-democrats-elections_1588622306.html", "title": "The Last Socialists", "title_page": "The Last Socialists", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nIf Shakespeare thought there was something rotten in the state of Denmark, today it’s fabled as a success story. After the fall of Soviet socialism, Francis Fukuyama was proclaiming “the end of history” and the triumph of liberal hegemony. But after the 2008 crisis, he’d changed to talking about how other countries ought to try “getting to Denmark.” Fukuyama took it is a metaphor for a country with a good balance between strong institutions, rule of law, and democratic accountability. But this isn’t the only positive take on the Scandinavian country. Before his first presidential campaign Bernie Sanders held rallies where he posed the question “What can we learn from Denmark?” He drew on its example of free health care and education, a progressive redistributive tax system, parental leave, paid vacation, and unemployment benefits. In the first debate between the Democrats’ presidential candidates in 2015, Hillary Clinton responded distant: “We are not Denmark. I love Denmark. We are the United States of America.” After the debate, Denmark’s prime minister had to underline that the country is in fact a market economy, not a socialist democracy. So clearly “getting to Denmark” isn’t the same as achieving the socialist dream. Yet developments on the left of Danish politics are providing an inspiration, including in other Scandinavian countries. If figures like Nigel Farage were the big winners in last weekend’s European elections, in the Danish part of the vote the Red-Green Alliance (Enhedslisten) won representation in Brussels for the first time. After the general election to be held on June 5, it may play a key role in national politics.\nRenewal With an Anchor This success doesn’t come from nowhere. Over the last decade, the Red-Green Alliance has been important to the renewal and growth of the radical left across Scandinavia, alternative to the old social democratic parties. Its declaration of principles is explicitly revolutionary, insisting on the need for a fundamental socialist transformation of society. At the same time, it has moved from a marginal “watchdog” role denouncing the misdeeds of various governments to become the country’s fourth largest party, enjoying the stable support of eight to ten percent of the population. The Red-Green Alliance was founded thirty years ago, patching together forces from the outer reaches of the Left. Today it has got rid of the old stigma of association with the Soviet Union, instead advocating a democratic path to social change and more generally adopting a more modern profile. Its leading figures include young, trusted, and popular fighters for justice, most of them women — Game of Thrones fans might think of them a bit like the early Daenerys Targaryen. (And unlike in the seven kingdoms, the Red-Green Alliance has a rotation system among its leaders that secures sharing of power and prevents top politicians from remaining in office too long.) Politically, the party puts the fight against economic inequality front and center. It has intersected with a kind of zeitgeist by fighting against cuts in unemployment benefits, at a time when rising unemployment has hit an increasing number of Danish workers. It also takes an often-lonely stance in support of social movements, like defending struggling teachers against the loosening of working hours regulations, and fighting the sale of shares in the state-owned energy company to Goldman Sachs. Furthermore, the Red-Green Alliance has held on to its socialist visions and an anchorage in a (un-dogmatic) Marxist approach to politics, where society and politics are analyzed on the basis of fundamental conflicts of interest, between labor and capital, between common people and the elites.\nFairness First On June 5, Danes will go back to the polls to elect their national parliament. After Brexit, the Red-Green Alliance has smoothed off some of the edges on its traditional left-wing opposition to the European Union, with its restrictive neoliberal treaties. This has not stopped the party taking bold initiatives to pull the public debate to the left. In the past year, the party has particularly set the political agenda. This owes to its ambitious proposals on democratizing the private sector through cooperatives and other forms of common ownership, its call for regulation of the financial sector, and its critique of the political priorities framing the national budget. Disguising ideology as “economics,” the Ministry of Finance calculates that tax cuts increase employment levels while disregarding the positive economic effects of welfare. In addition, and perhaps most importantly, the party has presented a fair and coherent program for the ecological transition — a Danish version of the Green New Deal. The Red-Green Alliance’s climate program shows how environmental policies can be implemented in fair ways that don’t hit workers and especially the low-waged. New jobs will be provided to those whose current jobs are threatened by the greening of the economy. The companies that pollute the most will pay the most tax, but they will get refund grants if they convert to green production. In this view, the charges on forms of consumption that have a negative climate impact should also be differentiated. Many business-class journeys will be heavier charged than a single family holiday. And the part of the population with middling and low incomes will get tax refunds. For the Red-Green Alliance, this environmental agenda isn’t just window-dressing: in fact, it has long insisted that “The next election must be a climate election.” And in the ongoing election campaign, the climate truly has become the most important issue for Danish voters (as a poll by Norstat demonstrates). Health and inequality also mobilize broad masses of voters, while immigration has dropped down the agenda for Danish voters, even if it draws a lot of attention in public debate. The breakthrough of the Red-Green Alliance coincided with the decline of the party’s closest competitor on the Left: the left-socialist Socialist People’s Party (SF). SF entered a close partnership with the Social Democrats, entering government in 2011, but this also meant putting aside its objections to a harsh immigration policy. Such was the turmoil within SF ranks that at one point it seemed to be the end of the party. SF left the government in 2014, after major internal divisions on the sale of state shares in the energy sector. SF remains the junior partner to the Social Democrats. But so far in the election campaign, it has increased in the polls, apparently not at the expense of the Red-Green Alliance. Indeed, the Left as a whole is growing. The parties to the left of the Social Democrats are together gaining up to 20 percent. The rise of these alternative forces is also helping to draw the Social Democrats toward a rhetoric more critical of the excesses of capitalism, in a bid to woo left-wing voters on the important terrain of welfare and tax policy. The center-left party however leaves plenty of room to doubt its intentions. Indeed, this owes not only to its rightward-moving line on immigration, drawing closer to the positions of the right-wing populist Danish People’s Party (DF), but even its recent record regarding the welfare state itself.\nSocialism in the Land of Equality? This might seem surprising outside of Scandinavia, where the region is best known (except for the Vikings, that is) for its extensive welfare states, built by a well-organized labor movement in the twentieth century. Why, then, the need for parties to the left of social democracy? In fact, in recent decades the very social democratic parties, who once participated in building the welfare state, have fronted reforms that have threatened key pillars of this same model. Like its sister parties, the Danish Social Democrats have made tax reforms that increase inequality, introduced markets and management models drawn from private business into health care and the public sector, and privatized state-owned companies and public services. If anything, it is new parties outside the Social Democrats who most firmly stand in the traditions of the labor movement. They continue to pursue its original agenda, both as the foremost defenders of the public services it built, and as the champion of the idea of a radical and democratic socialist future. If Denmark can be seen as a country with relatively low inequality, high levels of trust in institutions, and strong institutions, this also provides the bases for a fight for even more democracy and equality — a socialist project that the Social Democrats are no longer willing to fight for. If anything, the current turn in the Social Democrats represents the extension of a regressive turn in Danish politics, undermining the principles of solidarity and equality that underpin the welfare state. They are winning voters back from the Right, but without stopping the rise in far-right themes. The Danes’ approach to such forces has long been complacent, not treating the right wing as pariahs but rather opening up further space for them. If in Sweden the other parties’ refusal to collaborate with the far-right Sweden Democrats has caused difficulties in forming functional governments, nor has the Danish approach of “neutralizing” the right-populists by making concessions to their agenda actually undermined them. Rather, in recent years the right-wing populists have participated in agreements on the national budget and other core issues together with the Danish government. Instead of resisting the Danish People’s Party’s anti-immigration agenda, the Social Democrats are kowtowing to it. Their leader Mette Fredriksen has openly said that she wants to work with the Right to ensure a broad majority behind restrictive immigration politics. We might well ask whether the so-called “neutralization” of anti-immigration politics, by occupying the Right’s own terrain, has really restricted space for far-right forces. Indeed, although the Danish People’s Party is set to lose votes to the Social Democrats, two other small racist parties are on the brink of entering parliament. The Red-Green Alliance’s political response has been to defend the rule of law and oppose racism. Still, the party’s representatives have been honest about the fact that integration costs money, that taking in traumatized refugees from war-torn countries takes effort, and when the state makes local municipalities responsible for this task, it also needs to finance them to do so. Vitally, this also demands that we avoid any conflict — such as the Right and the Social Democrats suggest — between paying for the welfare state and spending resources on refugees. Moreover, the Red-Green Alliance emphasizes that the need to provide welcome to refugees is a different issue than employers importing cheap labor, as favored by the EU model. Indeed, the risk is that the European Union’s internal labor market may be used to increase the competition between workers, to the detriment of wages and working regulations, given the disparity between countries with stronger trade unions and a more compressed wage structure (broadly speaking, in Northern Europe) and the lower-wage economies of the East. The Red-Green Alliance thus insists that all hiring must take place at common wage levels and on the trade unions’ terms. Far from ignoring the question of immigration entirely, or — worse — adopting the right-wing populists’ own positions, this stance means putting the conflict between labor and capital at the center of things. Unlike the Social Democrats’ stance, it highlights the need to defend left-wing principles and avoid globalization putting pressure on the balance of strength in the labor market.", "url": "https://www.jacobinmag.com/2019/06/denmark-red-green-social-democrats-elections"}