{"authors": ["Clark Grell Lincoln Journal Star"], "date_download": "2020-05-04 20:26:26", "date_modify": "2020-05-04 20:26:26", "date_publish": "2019-05-25 04:30:00", "description": "OMAHA — Nine-run lead? Game in hand? It didn’t matter. Mojo Hagge wasn’t going to show any mercy, and he churned his legs as fast as he could. The Nebraska junior outfielder caught a...", "filename": "_f73b2eda95e446b3b604ab4dfb0a04d2_1588623986.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f73b2eda95e446b3b604ab4dfb0a04d2_1588623986.html", "title": "A win away from Sunday's final, Huskers show no mercy in thumping Iowa in eight innings", "title_page": "A win away from Sunday's final, Huskers show no mercy in thumping Iowa in eight innings", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A win away from Sunday’s final, Huskers show no mercy in thumping Iowa in eight innings\nOMAHA — Nine-run lead? Game in hand? It didn’t matter.\nMojo Hagge wasn’t going to show any mercy, and he churned his legs as fast as he could.\nThe Nebraska junior outfielder caught a pitch up and in, drove it to the gap in right-center field and sprinted to third base for a triple in the bottom of the eighth inning during Friday’s Big Ten Tournament game against Iowa at TD Ameritrade Park.\nHagge slid face first into third, popped up and emphatically pointed to the Nebraska dugout.\nA Cam Chick sacrifice fly later, Hagge stepped onto home plate to complete the Huskers’ 11-1 rout of the Hawkeyes in mercy-rule fashion.\nThe Nebraska offense was at it again — the Huskers have scored eight runs or more in five of their past six games — and Nate Fisher flipped his most recent script against Iowa, pitching seven strong innings.\nA year after missing the Big Ten Tournament completely, Nebraska is making its presence known in downtown Omaha.\nNU is 2-0 in the tournament, and this is the deepest it has been in a Big Ten tourney since reaching the 2014 final against Indiana.\nThe Huskers (30-20) are a win away from Sunday’s 1 p.m. Big Ten Tournament final. They’ll get two shots at it Saturday. NU will play Michigan at 9 a.m. If the Huskers lose, they’ll play again later in the day.\nOn Friday, they took out some aggression against an Iowa team that has been a thorn in the Huskers’ side in recent years. Iowa (31-23) took two of three from NU during the regular season.\n“We were pretty upset about that and I think it was just a big revenge game, so we gave it all we got and we got them,” freshman Spencer Schwellenbach said.\nAdded Fisher, “I don’t think we want to let whatever opponent we’re facing really dictate how we go about our business, but I think it’s a huge win for us and we’re striving in the right direction.”\nNU coach Darin Erstad described Friday’s victory this way: “Crazy game of baseball.”\nThe last time Fisher pitched against Iowa, the Hawkeyes tagged the Yutan native for seven runs in 4 2/3 innings.\nAnd the last time the Huskers faced Grant Judkins, Iowa’s starter Friday, the right-hander held NU to three hits in seven innings.\nFriday was a much different story.\nNebraska chased off Judkins (4-7) in a four-run second inning, and scored four more runs in the fifth inning. The Huskers pounded out 15 hits — three came from Hagge and three from Alex Henwood, who is playing with one good shoulder — and drew 10 walks.\nOf the Huskers’ first 10 batters, seven worked full counts.\n“Just grinding out at-bats,” Erstad said. “We’ve been doing this for the last 2½ weeks and it’s more where we’re at in the season, and they’ve kind of taken that to heart and playing at a high level with a lot of energy.”\nNebraska put the game out of reach with a four-run fifth, which started when Schwellenbach planted a ball into the Husker bullpen in left field for a solo homer.\nWhen the Husker offense struck, Fisher (7-3) was at his best.\nHe threw 103 pitches, struck out seven and allowed one run on four hits (all singles).\n“The biggest thing is when we scored, he got shutdown innings,” Erstad said. “That was the big thing. I think he had three or four shutdown innings, and that was so big in keeping the momentum.”\nNebraska looks to keep the momentum going Saturday.\nThe Huskers have won seven of their past nine games. Erstad sees a confident bunch that wasn’t thrown off by Thursday’s storms postponing the Iowa game until late Friday morning.\n“That’s why I don’t really have to do much,” he said. “We have a change in their schedule and this group doesn’t care. It’s like, ‘All right, whatever. Go to the next day, let’s play.’ It’s a fun group to be around.”", "url": "https://apnews.com/f73b2eda95e446b3b604ab4dfb0a04d2"}