{"authors": ["Ben Beckett", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Meagan Day", "Matt Bruenig", "Mark Dudzic"], "date_download": "2020-05-04 19:52:53", "date_modify": "2020-05-04 19:52:53", "date_publish": "2019-08-21 00:00:00", "description": null, "filename": "2019_08_bernie-sanders-labor-platform-health-care_1588621973.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/08/21164507/GettyImages-1163058631.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2019_08_bernie-sanders-labor-platform-health-care_1588621973.html", "title": "Any Union That Doesn’t Endorse Bernie Sanders Is Leaving a Huge Pile of Money on the Table", "title_page": "Any Union That Doesn’t Endorse Bernie Sanders Is Leaving a Huge Pile of Money on the Table", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "On Wednesday, Senator Bernie Sanders released arguably the most ambitious labor platform of any major presidential candidate in history.\nAll labor activists should read the platform in full. Some of Sanders’s proposals address longstanding concerns Democrats neglected to address when President Barack Obama had a Democratic Congress behind him, like better protecting workers’ pensions and new union certification by “card check,” which would certify a union in a workplace when a majority of workers sign a card indicating they want to join and remove some of bosses’ opportunities to destroy fledgling union drives. Other planks have the potential to fundamentally change the balance of power between workers and employers — ideas like bargaining by economic sector rather than employer-by-employer, giving federal workers the legal right to strike, and a law mandating “just cause termination” for all workers.\nBut as someone who recently sat on a union bargaining team, the platform’s last plank spoke to me directly. It reads\nIf Medicare for All is signed into law, companies with union negotiated health care plans would be required to enter into new contract negotiations overseen by the National Labor Relations Board. Under this plan, all company savings that result from reduced health care contributions from Medicare for All will accrue equitably to workers in the form of increased wages or other benefits.\nDepending on how it is interpreted, this rule would give me a raise of up to $1,700 per month, based on health care costs my employer currently pays. (It is unclear if the plan envisions family health benefits as transferable to new wages, or just the portion that covers the employee.)\nWhatever the details, if enacted, this plank would be an enormous boon to all unionized workers. It is fair to say that any union that does not endorse Sanders and make a serious push to make this plan a reality is leaving a huge pile of money on the table that would otherwise go in its members’ pockets.\nTo be clear, my union has negotiated a good health care plan with premium costs significantly below average, especially for family plans. I am proud of the work our members have done to make sure that is the case, both at our most recent contract bargaining sessions and long before I joined the union.\nBut with Medicare for All, Sanders is offering to take an enormous burden off our shoulders. No longer would we have to read pages and pages of fine-print plan documents, trying to determine if management is sneaking previously covered medical services out of the next contract. Nor would we have to ask if we want to fight for wages or benefits when determining what demands to make of our employer.\nDuring the last round of bargaining, some of us dreamed aloud of getting the whole issue of health care off the bargaining table, wondering what else we could fight for with that critical concern met. We didn’t dream about getting a huge raise out of the deal, too — but that is exactly what Sanders’s plan would do.\nUnions have long used the legislative process and relationships with elected officials to advance their members’ interests. Indeed, at times they have relied too heavily on relationships between high-level union officials and politicians who do little to concretely advance working-class demands.\nBut in Bernie Sanders and his labor platform, we in the labor movement have the biggest opportunity in generations to grow our unions, make them more powerful, and put more of the boss’s money into our members’ pockets. When will a candidate like this have a real shot at the presidency again? It’s our duty to our fellow members to make sure he wins.", "url": "https://www.jacobinmag.com/2019/08/bernie-sanders-labor-platform-health-care"}