{"authors": ["Rand Wilson", "Peter Olney", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Terry Miller", "Paris Marx", "Nicole Aschoff"], "date_download": "2020-05-04 19:59:24", "date_modify": "2020-05-04 19:59:24", "date_publish": "2019-07-07 00:00:00", "description": null, "filename": "2020_04_amazon-worker-organizing-salting-union-coronavirus_1588622364.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2019/07/07074808/GettyImages-825338414-web.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_04_amazon-worker-organizing-salting-union-coronavirus_1588622364.html", "title": "Amazon Workers Desperately Need an Insurgent Union Campaign", "title_page": "Amazon Workers Desperately Need an Insurgent Union Campaign", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "A global pandemic is shaking capitalism to its core. In the midst of this crisis, Amazon recently hired 100,000 new warehouse workers and announced it was hiring an additional 75,000 on April 13. The company is offering temporary premium pay of $17 per hour — $2.00 more than their usual start rate.\nFor the many thousands of out-of-work young socialists and other fed-up workers who have lost their jobs in the service and hospitality industry, this is a perilous moment. But it’s also a great opportunity for activists to join a burgeoning network of organizing going on within Amazon.\nWhy Amazon? Because it’s one of the most important companies in the American and global economies — a company in which an organized and invigorated working class might be able to exercise some real power in the twenty-first-century economy.\nAlready, workers organizing under the banner of Amazonians United (AU) have been doing impressive work at fulfillment centers in major metropolitan areas. In September 2019, long prior to COVID-19, workers at a large fulfillment center near the Sacramento airport demanded that two workers fired for missing work due to deaths in their families be rehired with back pay. A petition and subsequent “march on the boss” led to the rehiring of both workers. In November 2019, AU Sacramento followed up with a second petition campaign for paid time off (PTO). This time, they staged a walkout.\nInspired by Sacramento AU, Chicago AU began their own campaign for PTO and collected over 250 signatures from their coworkers before confronting management with their demands. New York City AU picked up the ball in February 2020, collected 150 names on a petition for PTO, and also marched on the boss to deliver it. In a major victory for nationally coordinated organizing, Amazon conceded PTO for all Amazon workers on March 23.\nLabor organizing in all of Amazon’s locations has escalated with the new challenges of exposure to COVID-19 while doing “essential work.” Queens AU started a worldwide petition protesting Amazon’s COVID-19 response policy. In mid-March, Queens AU caught management trying to cover up a COVID-19 case, and the workers organized two walkouts shutting down operations for two shifts.\nIn late March, Chicago workers led by AU demanded a shutdown of their warehouse for cleaning. They struck for four shifts with majority participation and a community caravan in support. Their impressive organizing built on an earlier protest in June 2019 about the lack of air conditioning in their warehouse. Activists petitioned and marched on the boss, successfully forcing the company to send them home with pay for the duration of the heat wave.\nIt will take dedicated “salts” inside the Bezos behemoth to crack this bastion of twenty-first-century capitalism. Salts — workers hired with the deliberate intention of organizing a union — are key to the internal organization of the vast Amazon workforce, particularly at its most strategic nodes. The old labor term “salting” has two equally powerful and complementary origins: salting a mine to bring out the rich ores, or pouring salt on a wound to aggravate the pain.\nSalts are indispensable to worker organizing in large-scale industries. No amount of outside talent and resources can substitute for the presence of conscious and disciplined on-the-job organizers getting to know workers, winning their trust, and helping them to self-organize.\nThe work isn’t easy. Salts risk being fired and often feel isolated. But strong internal organizers are necessary to advance the workers’ movement in key segments of the capitalist supply chain. Groups like Amazonians United offer a support network that can train and sustain workers who decide to become “salts” to organize their coworkers.\nIf you are interested in joining the movement inside Amazon, then reach out to Roots Action. As we wrote in 2018, there is no better way for twenty-first-century socialists to learn about building the working-class movement than by taking a job at Amazon:", "url": "https://www.jacobinmag.com/2020/04/amazon-worker-organizing-salting-union-coronavirus"}